[{"title": "Redmi Note 5 pro", "thread": [{"postID": "post6187229", "text": "Anyone here using Note 5 pro...I need honest review....", "time": "03-12-2018 05:45 AM", "replies": []}]}, {"title": "Google Directions widget seems to be not available on MIUI", "thread": [{"postID": "post6186542", "text": "Hello,\nI use Xiaomi Redmi 3S with MIUI 8. I wanted to add a navigation shortcut to Google Maps to my home screen. This is how Google describes how it can be done:https://support.google.com/maps/answer/6291823\nUnfortunately, when I want to add widget to the home screen, there is no \"Google Direction\" widget available. I think that no widgets from Google Maps are available - they are just not in the list I can select widgets from. Has anyone using MIUI made it to work? Any help would be appreciated.\nAnd, yes, I know I can do ALMOST the same \"from the other side\". I can select the destination in Google Maps and select the option to create a shortcut. I confirm it works. But this way I cannot select a name for the shortcut icon, so it is not exactly the same.", "time": "03-11-2018 02:43 PM", "replies": []}]}, {"title": "help me on mi a1", "thread": [{"postID": "post6185878", "text": "Want to install google camera with portrait mode.\nI see many videos,tutorial but still some question still there.\n1.can we get mobile brick?\n2.can my phone get permanent open bootloder?\n3.can i get regular phone update and security update when available?\n4.system camera work ok with google camera.?\n5.can google camera is better than stock camera ?", "time": "03-10-2018 10:18 PM", "replies": []}]}, {"title": "Xiaomi mi5 oreo", "thread": [{"postID": "post6178629", "text": "This week is roling oreo for mi5 betatesters , using miflash you can install, using update on mi5 is fail", "time": "03-04-2018 08:10 AM", "replies": []}]}, {"title": "Xiaomi Mi A1 (Android One)", "thread": [{"postID": "post6040942", "text": "Anyone else has it yet? \nI own it for a couple of days and it's great, pure stock android straight from Google, nice specs, good battery life, build quality, looks, headphone jack sound quality (and I'm coming from the HTC 10) and powerful external speaker. The only thing not so good is the stock camera app but I've seen people getting much better results when adding the Google Camera (needs rooting) so there's hope Xiaomi fixes it with an update.\nCheers", "time": "10-27-2017 05:26 AM", "replies": []}, {"postID": "post6066086", "text": "Where do you live and what do you get for data?\nI'm in the US, and it shows 4G now on T-mobile (at first I only had 2G service, but traveled into a 4G area and it's stayed on 4G ever since). I am trying to figure out which bands are being utilized for my 4G service, since I'd like to switch to Mint or Cricket.\nAnyhow, I like it so far. For me, it's just an interim until something hits the market that I really like. \nThe built quality is phenomenal, camera is OK, screen is great but screen resolution much lower than I had before, and this phone is gorgeous but BIG. \nI got it within 3 days from China.", "time": "11-12-2017 06:54 AM", "replies": [{"postID": "post6066093", "text": "I live in Portugal and get 4G constantly since this smartphone has all the bands used here in Europe.", "time": "11-12-2017 07:17 AM", "replies": []}, {"postID": "post6147237", "text": "I was wondering if you are still using T-Mobile US and how the service is? Are you getting LTE service or HSPA+?\nI am also interested in the device and was wondering which site you purchased from.\nThanks.", "time": "01-27-2018 01:01 PM", "replies": []}]}, {"postID": "post6168135", "text": "Actually, i intend to buy this as my second phone, how about the camera? is that okay? i mean it is dual camera right, maybe can produce some great blur effect on the background..\nSo it is almost 3 month now since the last time you posted about this topic, so everything is okay? i mean battery life, smoothness and so on", "time": "02-21-2018 03:46 AM", "replies": []}]}, {"title": "How to identify if the original screen and replaced one of a xiaomi MI5 ?", "thread": [{"postID": "post6017885", "text": "I am thinking to buy a used XIAOMI MI5 ,so how will i identify that the phone has all genuine parts,specially mobile screen?", "time": "10-13-2017 11:19 AM", "replies": []}, {"postID": "post6151345", "text": "s/n behind the screen", "time": "02-01-2018 04:45 AM", "replies": []}]}, {"title": "My android phone internal memory need to format. How can i do it", "thread": [{"postID": "post6146915", "text": "my coolpad phone with snapdragan processor is rooted. when I upgrade it to MIUI 8 BETA ROM to MIUI 8 STABLE ROM the phone goes to black screen. after several methods i am unable to give life to it. I format the internal memory to FAT 32 file system. is it correct? if not what is the format type of the internal memory and how to format it?", "time": "01-27-2018 01:52 AM", "replies": []}, {"postID": "post6147052", "text": "Welcome to the forums. Did you reinstall Android? If you did, you shouldn't have to reformat anything.", "time": "01-27-2018 09:02 AM", "replies": []}, {"postID": "post6147972", "text": "Reflash the 8 Stable and you'll get the screen back (but not any of your data - if you don't have it backed up, and can't get it off with adb, it's gone).", "time": "01-28-2018 01:20 PM", "replies": []}]}, {"title": "Unable to transfer files properly between redmi note 4 and PC.", "thread": [{"postID": "post6138320", "text": "Hi I am Rupesh from India and I have a PC and redmi note 4 with 64 GB internal storage. I want to transfer files between redmi note 4 and PC but can't. I am getting a number of errors while transferring in various situations.\nI have a folder in external SD card which contains 500 mp3 files of size 2.5 GB. I have tried to move these files to a folder in PC and unfortunately 150 files are transferred properly with correct size and remaining 350 files are copied with zero size for all files. Finally I have lost 350 files in SD card so I have tried to recover using data recovery software in redmi note 4 itself but failed. In order to transfer these files I have compressed them after that copied the resulted zip file to PC and succeeded.\nI have three text files in a folder of PC. First I have selected these three text files and selected copy option after that I have connected the phone to PC and selected transfer files option after that in internal storage I have made right click and I can't find paste option and even I have pressed Ctrl+v and no use. I have tried to copy these text files to lenovo a3000 internal storage which is connected as USB storage and successfully completed.\nPreviously I have tried to copy 2000 mp3 files of size 9 GB and unfortunately 1500 files are copied and remaining left un copied.\nSuppose if I want to copy a folder containing 1000 files from PC to redmi note 4 and the phone already contains 500 files. I want to copy remaining 500 files and skip already existing files. I have tried copy and paste and it asked confirmation to replace existing files or not and I have selected no and after that the paste process is taking lot of time. If I try to copy these 1000 files to an empty folder of phone storage the paste process is taking less time than above.\nI have used a number of android phones and tabs and all of them have an option to mount storage as USB storage in PC but redmi note 4 doesn't. Can anyone of you suggest how to mount internal storage or external SD card as USB storage. Is there any android app which allows mounting as USB storage.\nMy PC runs Windows 8.1 pro and my phone runs MIUI 9. \nIs there any PC companion suite specifically for redmi note 4 which allows transferring files between redmi note 4 and PC with minimum errors.\nRegards,\nRupesh.", "time": "01-17-2018 12:20 AM", "replies": []}, {"postID": "post6141250", "text": "USB isn't designed to do massive file transfers - the USB chip heats up and fails. (And most USB hubs can't take it - so plug the phone directly into the PC, not into a hub.) Also, file copies are buffered, and you're probably running out of buffer size with such large copy lists.\nUse REPLACE /A instead of COPY, so only the files that haven't been copied will be.\nUse DIR > some_file_name.bat so that all the files you want to copy get listed in that file. Then edit the file, chopping off all columns except the file name and extension. Add replace /a at the beginning of every line, and the destination at the end of every line.\nChop the file into about 100 lines each, each with a different name, like 1.bat, 2.bat, etc..\nRun one file at a time.\nIt should work.", "time": "01-20-2018 12:49 PM", "replies": []}]}, {"title": "White screen after device unlock", "thread": [{"postID": "post6141066", "text": "Xiaomi redmi note 3", "time": "01-20-2018 08:12 AM", "replies": []}, {"postID": "post6141239", "text": "Evidently the method used to unlock it failed badly. If you see nothing at all on the screen, you'll have to reflash the stock ROM - then find some method of unlocking it that actually works.", "time": "01-20-2018 12:22 PM", "replies": []}]}, {"title": "How to disable the bloatware and built-in apps?", "thread": [{"postID": "post6134242", "text": "I just got my first Xiaomi device which is a Redmi 4X. I hate the constant nags from the Feedback MUI Forum and whatnot. I also cannot disable many of the apps.Please guide me how to do this. My phone is not rooted and I don't know how to root", "time": "01-12-2018 07:40 AM", "replies": [{"postID": "post6135954", "text": "Or you can unlock bootloader and install MIUI EU, which is a custom MIUI based on Chinese MIUI, you will lose some features from Global, like notification shade, but it comes with a lot less bloatware, better performance and battery, better translation, among other features. \nCheck their website: https://xiaomi.eu/community/", "time": "01-14-2018 09:19 AM", "replies": []}]}, {"postID": "post6134425", "text": "Root the phone, then remove the bloatware and any built-in apps you know won't brick the phone by being missing.\nYou can't remove most bloatware or any built-in (meaning installed as system) apps without rooting.", "time": "01-12-2018 10:39 AM", "replies": [{"postID": "post6134570", "text": "Thanks, I'm confused about this step though, can you explain how to do this please:Unlock Bootloader, flash via Fastboot", "time": "01-12-2018 01:06 PM", "replies": []}]}]}, {"title": "Contact image is not coming in Android 7.1.2", "thread": [{"postID": "post6099215", "text": "I bought new mobile MI A1 which works on Google stock Android version (Android one).\nI was unable to get the caller image for both incoming and outgoing calls and even for the favourite contacts.\nI had searched all type of settings but failed all over.\nCan anyone suggest me solution what to do.🙂", "time": "12-07-2017 01:17 PM", "replies": []}, {"postID": "post6101106", "text": "Welcome to Android Central! In your Contacts app, do contact photos show up there? If so, then when those contacts call, you still don't see their face in the incoming call screen?", "time": "12-09-2017 02:00 AM", "replies": []}, {"postID": "post6125823", "text": "I just got the Oreo update and this is now fixed...I'm getting the contact photo in both incoming and outgoing calls", "time": "01-03-2018 11:42 AM", "replies": []}]}, {"title": "No voicemail notification on xiaomi mi6", "thread": [{"postID": "post5993181", "text": "Hi everyone\nI have had the mi6 for a few weeks now and love it. However I have just realised that I don't receive any notifications for voicemail messages. I am using the Drupe app as a dialer as I found after using the nexus phones the original app too basic.\nHas anyone else had this problem?\nMany thanks\nBob", "time": "09-26-2017 06:30 AM", "replies": []}, {"postID": "post6124658", "text": "For me it works perfectly fine.\nDo you receive standard SMS text messages?\nBecause I get notifications about new voicemail from my provider (T-Mobile AT) via SMS.", "time": "01-02-2018 08:45 AM", "replies": []}]}, {"title": "xiaomi mi6 global room", "thread": [{"postID": "post5801102", "text": "Will this phone work in the USA with the latest global rom (t-mobile)?", "time": "05-04-2017 06:36 PM", "replies": [{"postID": "post5916109", "text": "I am wondering the same thing. I have a blue Mi6 and I'm getting H+ on T-Mobile in Los Angeles. It's a beautiful phone but I was hoping it would get LTE like the Mix did.", "time": "08-08-2017 01:53 AM", "replies": []}]}, {"postID": "post5821609", "text": "It has more limited LTE frequencies BUT yes it should work.", "time": "05-19-2017 10:24 PM", "replies": []}, {"postID": "post6124651", "text": "The ROM works perfectly with T-Mobile in Austria, even with LTE\nAs @pkcable said, not all LTE Bands are supported (e.g. Band 20 which is widley used in Europe)", "time": "01-02-2018 08:40 AM", "replies": []}]}, {"title": "Phone stuck in Fastboot", "thread": [{"postID": "post5860493", "text": "I have a XiaoMi Mi4 and I recently tried rooting my phone with no success. I have never attempted to flash any custom ROMs before.\nRecently, my phone would occasionally turn off and reboot into a looped Fastboot Mode, with no way of getting out. Most of the time it resolves itself, but it's happened again and I can't find any answers on the rest of the Internet as to how to fix it.\nAny suggestions?", "time": "06-23-2017 05:50 AM", "replies": []}, {"postID": "post6113802", "text": "What do you mean by \"Most of the time it resolves itself\"? Does it boot regularly?\nFortunately, the bootloader of the Mi4 is not locked. So you could flash TWRP recovery via fastboot.\nFrom TWRP you can flash any ROM or SuperSU.zip\nIf you need further instructions, I can post a short guide here", "time": "12-21-2017 06:32 AM", "replies": []}]}, {"title": "What do you think about Xiaomi Mi A1", "thread": [{"postID": "post6104391", "text": "I just got mine last week but it's still in the box. I'm not opening it until Christmas. Why? Well, why should only the children have fun on Christmas? I want to see it for the first time on Christmas. I also accept waiting until the 25th December as a challenge.\nDid you get your Mi A1? If yes, tell me what do you think about it, and more importantly, criticize the parts you don't like about it.", "time": "12-12-2017 02:49 AM", "replies": [{"postID": "post6108234", "text": "I love mine, I am coming from the HTC one m8 and the HTC 10. Much better battery life, wifi range (when compared to the HTC 10, which sucked in that department) it has a very nice screen, it's smooth and fast... but the camera is not so good. There's a Google camera app ported from the Pixel that adds video stabilization and makes the photos much better so there's some hope Xiaomi improves the camera performance with a software update.\nBut both my previous smartphones cost more than 500 bucks and this one cost 230 so I knew something had to be worse.\nI am not wanting to replace it anytime soon so I am very happy with my decision", "time": "12-15-2017 08:01 PM", "replies": []}]}, {"postID": "post6106545", "text": "I got a Mi A 1 last week for my son, exchanging his old phone. The phone works fine, no lag anywhere with the clean stock Android. It got security update while setting up and the Dec security update 2 days ago. We have installed Nova Prime launcher for gestures etc. The camera seems to be nice with portrait mode though we haven't used it much yet. I hope it gets the promised Oreo update before the end of December.\nI hope you enjoy your new Mi A1 after you open the box. \nI couldn't have left it till then because I would have been apprehensive that in case there is any problem with it then the period for returning the phone would be over.", "time": "12-14-2017 04:58 AM", "replies": []}, {"postID": "post6113801", "text": "I am a Xiaomi user for 3 years now. The A1 is an amazing phone for a very competitive price but I prefer Xiaomi's own Android based MIUI operating system.", "time": "12-21-2017 06:24 AM", "replies": []}]}, {"title": "My favorit icon dissapeard from my closed window.", "thread": [{"postID": "post6105809", "text": "I love my Redmi 3S phone, but nowdays a problam occoured with it. There was a system refresh on (probably with MIUI) and after it I found a strange thing on it. On the close screen I always have 2 icons those I could use without solve the close screen up. One of them was the camera, but the other one was the telephone. After the refresing, the phone has disappiered, instead the TV remote icon is on. I am not able to find the way how to change it with the telephone icon. Please help me somehow.", "time": "12-13-2017 11:59 AM", "replies": []}, {"postID": "post6106403", "text": "Welcome to Android Central! Does this help?", "time": "12-13-2017 11:09 PM", "replies": []}]}, {"title": "Does Redmi 3s support Quick Charge?", "thread": [{"postID": "post5806054", "text": "The Xiaomi India website doesn't mentions that it supports Qualcomm Quick Charge but there are some people who are saying that it supports Q.C. 1.0/2.0 and some even saying that it supports 3.0. \nAnd the Xiaomi website states that “[it] Comes with 5V/2A quick charging to charge and go with minimal downtime.”. Interestingly enough, Quick Charge 1.0 also charges at 5V/2A.\nHas anyone tried charging with Qualcomm Certified chargers and is there any long term issue like battery inflating, poor battery backup, etc? \nAnd if it does work then what are the things I should be looking in a charger when buying apart from Qualcomm certified chargers?", "time": "05-08-2017 01:54 PM", "replies": []}, {"postID": "post6102101", "text": "3s chipset support Quick charge 2.0 but\nxiaomi kernel doesn't support it by default for this you need to use a custom kernel like beacon,perxpeted or gearbox etc", "time": "12-10-2017 03:29 AM", "replies": []}]}, {"title": "I have the Xiaomi Mi Mix 2 - AMA", "thread": [{"postID": "post6015463", "text": "I have been using the Xiaomi Mi Mix 2 on TMO for about a week now.\nIf you have questions, ask away.", "time": "10-11-2017 02:58 PM", "replies": [{"postID": "post6037835", "text": "Do you have WiFi Calling on T-Mobile?", "time": "10-25-2017 10:37 AM", "replies": []}]}, {"postID": "post6015473", "text": "How are the speeds on LTE and how does it compare to the original Mix???", "time": "10-11-2017 03:04 PM", "replies": [{"postID": "post6015531", "text": "Sppeds are great. See screenshot below. Currently using it on TMO in LA area.", "time": "10-11-2017 04:06 PM", "replies": [{"postID": "post6017985", "text": "I would NOT call those speeds great! They are certainly acceptable, BUT on a good day on my S8 or iPhone 7, I get almost reach 100 down.\nPictures look pretty good!", "time": "10-13-2017 12:33 PM", "replies": [{"postID": "post6017998", "text": "I get the same speeds on my iPhone and Pixel. It's not the phone it's TMO.", "time": "10-13-2017 12:39 PM", "replies": []}]}]}]}, {"postID": "post6015497", "text": "Does it come with google play store?", "time": "10-11-2017 03:28 PM", "replies": [{"postID": "post6015516", "text": "Nope. No Global Official as of yet.", "time": "10-11-2017 03:50 PM", "replies": [{"postID": "post6015535", "text": "I beg to differ.", "time": "10-11-2017 04:08 PM", "replies": []}]}, {"postID": "post6015534", "text": "Yes. Mine came with Play Store installed.\nI am running MIUI 9 Global beta ROM. See screenshot below for details.", "time": "10-11-2017 04:07 PM", "replies": []}]}, {"postID": "post6015542", "text": "I can check data speed on Verizon tomorrow.", "time": "10-11-2017 04:13 PM", "replies": []}, {"postID": "post6015576", "text": "Is this phone way better than essential phone? Both design looks good.", "time": "10-11-2017 04:31 PM", "replies": [{"postID": "post6015623", "text": "Not having played with the Essential phone is hard to do a comparison. But it's probably one of the best large screened devices that I have used this year.", "time": "10-11-2017 05:03 PM", "replies": [{"postID": "post6015631", "text": "Where did you get it? Any US warranty?", "time": "10-11-2017 05:08 PM", "replies": [{"postID": "post6015643", "text": "No warranty. I have a source who gets me my Xiaomi devices.", "time": "10-11-2017 05:15 PM", "replies": [{"postID": "post6015647", "text": "Did you get a 8gb 256gb version? How’s camera compared to google pixel?", "time": "10-11-2017 05:19 PM", "replies": [{"postID": "post6015652", "text": "I have the 6/256 version. I will post pictures shortly.", "time": "10-11-2017 05:22 PM", "replies": [{"postID": "post6015667", "text": "I want 256gb version. Do you get deep discount from your vendor?? I want one!", "time": "10-11-2017 05:35 PM", "replies": [{"postID": "post6015678", "text": "Ha, ha. I do get a decent deal. But he is not a bulk reseller.", "time": "10-11-2017 05:41 PM", "replies": []}]}]}]}]}]}]}]}, {"postID": "post6015665", "text": "Okay here are pictures from Mix 2.", "time": "10-11-2017 05:34 PM", "replies": []}, {"postID": "post6015666", "text": "Same pictures using Google Pixel", "time": "10-11-2017 05:35 PM", "replies": []}, {"postID": "post6015668", "text": "Two more pictures using Mix 2.", "time": "10-11-2017 05:36 PM", "replies": []}, {"postID": "post6015669", "text": "Same pictures using Google Pixel.", "time": "10-11-2017 05:36 PM", "replies": []}, {"postID": "post6015671", "text": "Two more pictures using Mix 2.", "time": "10-11-2017 05:37 PM", "replies": []}, {"postID": "post6015672", "text": "And the same pictures using Google Pixel.", "time": "10-11-2017 05:38 PM", "replies": []}, {"postID": "post6015675", "text": "Last two pictures using Mix 2.", "time": "10-11-2017 05:39 PM", "replies": []}, {"postID": "post6015677", "text": "And the same two pictures using the Google Pixel.\nSorry I am switching between phones to post the pictures.", "time": "10-11-2017 05:40 PM", "replies": []}, {"postID": "post6015679", "text": "Hope the pictures helped. I will do some low light comparisons later.", "time": "10-11-2017 05:41 PM", "replies": [{"postID": "post6015737", "text": "I don't see the global beta on their site. Is it a custom ROM?", "time": "10-11-2017 06:31 PM", "replies": [{"postID": "post6015750", "text": "No, this is the factory ROM but it is 7.9.21 Beta. It is the global ROM though.", "time": "10-11-2017 06:39 PM", "replies": [{"postID": "post6015761", "text": "I'm aware. But it's not listed on Xiaomi website. There's another site that customizes China ROMs to look like global", "time": "10-11-2017 06:47 PM", "replies": []}]}]}]}, {"postID": "post6023275", "text": "I ordered the 6/256 yesterday. Currently using nexus 6p. How's the Os compared to nexus?", "time": "10-17-2017 02:02 AM", "replies": [{"postID": "post6027333", "text": "MIUI takes a bit of getting used to. I have been sampling Xiaomi phones since 2014 so I am quite comfortable with the UI.", "time": "10-19-2017 11:00 AM", "replies": []}]}, {"postID": "post6027346", "text": "Battery life is incredible on this device. Here are a couple of screenshots.", "time": "10-19-2017 11:10 AM", "replies": []}, {"postID": "post6027349", "text": "Low light pictures.", "time": "10-19-2017 11:11 AM", "replies": []}, {"postID": "post6037891", "text": "There is a Wi Fi calling option in the settings menu but for some reason it doesn't want to turn on even though I am connected to Wi-Fi. Let me reboot the phone and see what happens.", "time": "10-25-2017 11:03 AM", "replies": []}, {"postID": "post6095769", "text": "I can't access Cell Trader Online through tapatalk anymore. Can someone please help me", "time": "12-04-2017 03:25 PM", "replies": []}]}, {"title": "Types of external sdcards supported by redmi note4 with snap dragon processor.", "thread": [{"postID": "post6083924", "text": "Hi I am Rupesh from India and I have brought redmi note 4 four months back. One of my friend called me from us and said that I am going to send a gift ie., 128 GB memory card to you. He has not specified which company and features of it.\nDoes all 128 GB memory card's are supported by my phone.\nRegards,\nRupesh.", "time": "11-25-2017 05:05 AM", "replies": []}, {"postID": "post6084932", "text": "The official specs say that it supports SD cards up to 128 GB, so it shouldn't be a problem: Redmi Note 4 Specification - Mi India. It doesn't matter who makes the card, or what the speed is (although slower speeds will obviously give you slower read/write performance).", "time": "11-26-2017 12:57 AM", "replies": []}, {"postID": "post6084991", "text": "What is the difference between sdxc,sdhc etc.,", "time": "11-26-2017 02:41 AM", "replies": [{"postID": "post6084996", "text": "Max size. Any of them will work as long as size fits the phone specs.", "time": "11-26-2017 03:16 AM", "replies": []}, {"postID": "post6085447", "text": "Read more info about it here: https://kb.sandisk.com/app/answers/d...-compatibility", "time": "11-26-2017 12:32 PM", "replies": []}]}]}, {"title": "Source Xiaomi Mi 4 Lite / Global Edition & Unlocked", "thread": [{"postID": "post6082662", "text": "Hello android community, we need to replace the onboard comms device on our fleet at work, and have a spare. We need uniformity currently with 5 Xiaomi Mi4 Lite. \nDoes anyone have any knowledge on where to source 1 to 3 Xiaomi Mi 4 Lite? It;s not sold any longer on the Xiaomi official online store. Info and sales would be helpful.", "time": "11-23-2017 06:30 PM", "replies": []}, {"postID": "post6083468", "text": "Moved to the Xiaomi forum for more specific traffic.", "time": "11-24-2017 03:58 PM", "replies": []}]}, {"title": "Android For Redmi4", "thread": [{"postID": "post5994590", "text": "Will the redmi 4 mobile support Android as you can see they are like bombs in our hands because of the Battery backup???", "time": "09-27-2017 02:00 AM", "replies": []}, {"postID": "post5995020", "text": "Welcome to Android Central! Moved from the Android Apps forum to the Xiaomi forum, since the former is intended for developers to promote their apps.\nWhat do you mean by your question? The Xiaomi Redmi 4 is an Android phone, so by definition it supports Android. Or are you asking how good Xiaomi's customer support if your phone is defective?", "time": "09-27-2017 10:57 AM", "replies": []}, {"postID": "post6080703", "text": "Please suggest, how to found my lost android phone IMEI1 No. 867512029704463 and IMEI2 No. 867512029704471. \nShailesh Kr. Lal", "time": "11-22-2017 03:39 AM", "replies": []}]}, {"title": "Xiaomi Mi Note 3 Review | Budget Friendly Xiaomi Mi 6 All You Need To Know", "thread": [{"postID": "post6078269", "text": "With every new device Xiaomi is proving why in near future global smartphone game will completely change in their favor! This is Xiaomi Mi Note 3 which is cheaper Xiaomi Mi 6 with not too much if any real sacrifice :-) I hope you will enjoy review! Leave a comment would like to hear your opinion.", "time": "11-20-2017 12:55 PM", "replies": []}]}, {"title": "Best phone case with best front and back protection for the Xiaomi Mi Mix?", "thread": [{"postID": "post6024587", "text": "i was told to avoid the love mei case due to rumors the claimed gorilla glass is not even gorilla glass and id rather have my phone completely protected.", "time": "10-17-2017 08:05 PM", "replies": []}, {"postID": "post6025532", "text": "Nillkin has a nice case for the Mi Mix.\nHowever, in the Pay it forward thread in the Marketplace @pkcable is giving away a free case and I have two tempered glass screen protectors if you are in the USA.", "time": "10-18-2017 11:44 AM", "replies": []}, {"postID": "post6025637", "text": "Welcome, please join the site so you can reply in this thread. See this link for instructions on how to join Android Central.\nYes, I would be glad to hook you up! Join the site and then send me a PM.", "time": "10-18-2017 12:37 PM", "replies": []}, {"postID": "post6026252", "text": "i am in the usa but if this pay it forward is about actually paying right now then i cannot but appreciate the offer. i just got back from ma after the loss of my father so im tapped out on money for now. ill have to take a look at this nillkin case, i see this tempered glass for my front but im not seeing a armor case for my mi mix haha", "time": "10-18-2017 06:28 PM", "replies": []}, {"postID": "post6026722", "text": "No charge for the case. At some point when YOU have something extra, you will “pay it forward” and give that thing to someone else.", "time": "10-19-2017 12:49 AM", "replies": []}, {"postID": "post6027001", "text": "that sounds reasonable", "time": "10-19-2017 07:36 AM", "replies": []}, {"postID": "post6027006", "text": "what kinds of items can i pay forward?", "time": "10-19-2017 07:41 AM", "replies": [{"postID": "post6027013", "text": "If you have an extra case, or screen protector, or whatever low cost accessory for a phone you no longer own, you post it up in this thread....https://forums.androidcentral.com/ma...rd-thread.html", "time": "10-19-2017 07:44 AM", "replies": []}]}, {"postID": "post6027034", "text": "ok i understand it now. thank you  i think i have a charger or 2 for some phones laying around that i can eventually give out if someone needs.", "time": "10-19-2017 07:54 AM", "replies": []}, {"postID": "post6066815", "text": "Noreve has a leather flip case for the Mi Mix. I buy these types of cases (not necessarily from Noreve) for all my phones. I just ordered a Mi Mix today and ordered the Noreve flip case as well.\nHere's a link: https://www.noreve.com/en/mi-mix/345...r_nappa_black_", "time": "11-12-2017 06:47 PM", "replies": []}]}, {"title": "Xiaomi Mi Mix 2 - US carrier compatibility", "thread": [{"postID": "post5976812", "text": "I had the original Mi Mix. It was a groundbreaking device.\nAnd it worked on the standard GSM carriers - TMO and ATT.\nBut surprisingly it worked on Verizon as well.\nI am hoping that the new Mi Mix 2 will also work on Verizon out of the box. I have a spare VZW SIM and can't wait for the Mi Mix 2 to show up.\nAre you excited about the Mi Mix 2 and using it on a carrier in the United States?", "time": "09-15-2017 04:24 PM", "replies": [{"postID": "post5981963", "text": "I am also excited for the Mi Mix 2. It would be my first time importing a phone. Xiaomi has included all the U.S. LTE bands so it should work on all networks. I have been looking at the phone on Banggod and Geekbuying. I am looking for one that has the Global ROM. What is your experience with this? Does your Mi Mix have the Global Rom?", "time": "09-18-2017 06:09 PM", "replies": [{"postID": "post5982021", "text": "I believe my Mi Mix had the Global ROM. I no longer have the device. I am hoping that my Mi Mix 2 comes with the Global ROM.\nGood luck with your purchase of the Mix 2.", "time": "09-18-2017 06:45 PM", "replies": []}]}]}, {"postID": "post6015459", "text": "Update.\nI have the Mi Mix 2 and it gets LTE on Verizon and TMO.\nOn TMO, I am also getting VoLTE.", "time": "10-11-2017 02:56 PM", "replies": [{"postID": "post6048064", "text": "Could you receive or make phone call using the Verizon carrier? I can only use the network, trying to figure out what's going on with the device. But it works fine with my Tmobile sim card(both phonecall and network). Please HELP!", "time": "10-31-2017 10:24 PM", "replies": [{"postID": "post6048073", "text": "I'm sorry but I sold the phone last Friday so I can't test that out for you. I have switched to a Note 8.", "time": "10-31-2017 10:33 PM", "replies": []}]}]}, {"postID": "post6050545", "text": "Picked up a Mi Max 2, had the Mi Max and Mi Mix. Mi Max 2 is faster, smoother than the Mi Max. Just got OTA MIUI 9.0 staple, using the China ROM. It works very well on T-Mobile and At&t.", "time": "11-02-2017 02:04 PM", "replies": []}]}, {"title": "Thousands zip files appeared.", "thread": [{"postID": "post6047012", "text": "Hello,\nSuddenly I have 1,5K zip files all named section_and numb.\nAny ideas what this is?", "time": "10-31-2017 08:43 AM", "replies": []}]}, {"title": "Google App: This Account is Not Eligible for Feed?", "thread": [{"postID": "post6042646", "text": "I have installed the google app on a new phone (the Xiaomi Mi Note 3) and when I open the Google app, it gives me the message \"The Account is not Eligible for Feed\"\nI tried adding another account but the same thing happens. Weird thing is that my original phone (The Lenovo Z2 Plus) can display cards on the Google app from those two accounts no problem.\nWhat's happening?\nI have Google Framework, account services and permissions enabled.", "time": "10-28-2017 09:10 AM", "replies": []}, {"postID": "post6045221", "text": "Moved from the Android Apps forum to the Xiaomi forum, since the former is intended for developers to promote their apps.", "time": "10-30-2017 03:50 AM", "replies": []}]}, {"title": "Xiaomi Mix 2", "thread": [{"postID": "post5943239", "text": "I have switched to Android phone from Windows. I loved Windows, but the app issue just became to much of an issue. I bought a Samsung Galaxy S8+ and was excited. Unfortunately the phone does exactly what people complain about when you mention Samsung... It slows down after just a few weeks of use. And while the Galaxy is a nice size phone, I miss the size of my Nokia 1520 immensely. I have read great things about the Xiaomi Mix holding it's performance and the screen size is something I miss so much. With it being so close to it's second edition being released, I figure I might as well hold out. I am in the United States and was wondering if someone could point me to a retailer or site that I could trust to purchase from for use with AT&T. I'd greatly appreciate any help or suggestions. Thanks in advance.", "time": "08-28-2017 03:20 PM", "replies": [{"postID": "post5981878", "text": "I am also looking forward to the release of the Mi Mix 2. Although it won't release in the U.S. Xiaomi wants us to purchase it, given the fact that they will include all the U.S. LTE bands. I have been comparing prices from 2 sellers that have a good track record, Banggood.com and Geekbuying.com", "time": "09-18-2017 05:27 PM", "replies": []}]}, {"postID": "post5944033", "text": "The Mi Mix 2 is great, yet I suggest thinking about the upcoming Pixel2", "time": "08-29-2017 04:04 AM", "replies": []}, {"postID": "post5944199", "text": "All I can tell you, is this Samsung has left a sour taste in my mouth as far as Android goes. Laggy mess.", "time": "08-29-2017 07:14 AM", "replies": []}, {"postID": "post5963069", "text": "I had a dozen Samsung high-end models, from S and Note families for business reasons, and I always hated Android with all my heart. Slow and buggy phones! Almost useless for my everyday needs. Now I have a Mi MIX and, man, this gadget is so much better than that crappy Samsung ones!! Three months with intense use, lots of apps installed, and for the first time in a few years my iPhone is sitting on my desk. Really recommend MIX.", "time": "09-07-2017 09:01 PM", "replies": []}, {"postID": "post6015460", "text": "I just got the Mi Mix 2 about a week ago. This thing is sweet.\nGets full LTE on TMO including VoLTE out of the box.", "time": "10-11-2017 02:57 PM", "replies": [{"postID": "post6015739", "text": "I thought you might have gotten it.\nHow are notifications on it?", "time": "10-11-2017 06:31 PM", "replies": [{"postID": "post6015752", "text": "Not bad at all.", "time": "10-11-2017 06:39 PM", "replies": []}]}, {"postID": "post6037834", "text": "Do you have WiFi Calling on T-Mobile?", "time": "10-25-2017 10:37 AM", "replies": [{"postID": "post6037890", "text": "There is a Wi Fi calling option in the settings menu but for some reason it doesn't want to turn on even though I am connected to Wi-Fi. Let me reboot the phone and see what happens.", "time": "10-25-2017 11:02 AM", "replies": [{"postID": "post6037936", "text": "Thank you for checking it out. Please let me know how it goes.", "time": "10-25-2017 11:18 AM", "replies": []}, {"postID": "post6037937", "text": "Thank you for checking it out. Please let me know how it goes.", "time": "10-25-2017 11:18 AM", "replies": [{"postID": "post6037950", "text": "No luck after reboot. I will try it on a different WiFi network at home and revert back to you.", "time": "10-25-2017 11:24 AM", "replies": []}]}]}]}]}, {"postID": "post6015702", "text": "How's the sound quality compared to LG V series?", "time": "10-11-2017 05:59 PM", "replies": [{"postID": "post6015718", "text": "I haven't plugged in a headphone yet. Let me try it out. I don't have a LG V series device to compare against. I had a V10 ages ago and sold my V20 about 3 months back.#donglelife \nI also started a AMA thread if you are interested in asking other questions. Here is the URLhttps://forums.androidcentral.com/xi...ml#post6015679", "time": "10-11-2017 06:16 PM", "replies": []}, {"postID": "post6015730", "text": "The audio output from the speakers is decent. It is stereo as the top earpiece speaker (not very loudly) also fires along with the bottom speaker.\nThe audio output through the USB-C port and dongle on Sennheiser HD202 is decent. The amp is not that strong. Using the Mi Enhancer does bump the output and equalizer effects help but I still think the DAC on the V30 or V20 is probably much much better. \nHope this helps.", "time": "10-11-2017 06:23 PM", "replies": []}]}, {"postID": "post6026765", "text": "considering about the price, i suggest MEIIGOO S8 or ELEPHONE S8", "time": "10-19-2017 02:16 AM", "replies": [{"postID": "post6027419", "text": "Meh, they are not even in the same league as the Mix 2.\nI have the Elephone S8 and it is meh compared to the Mix 2.", "time": "10-19-2017 11:50 AM", "replies": []}]}]}, {"title": "Xiaomi Mi Mix 2 - Battery Life", "thread": [{"postID": "post6034803", "text": "I have been using the Mix 2 now for about 4 weeks. The battery life on this device is incredible. I have seen crazy numbers from folks on the S8+ and V30 but usually this is within 24 hour period.\nI consistently get 48+ hours between charges and 6+ hours of SOT.\nTo me that is stellar battery life.", "time": "10-23-2017 05:28 PM", "replies": []}]}, {"title": "Fingerprint Sensor", "thread": [{"postID": "post5993260", "text": "How long a finger print sensor lasts long if i use it every time to unlock phone..I am AFRAID of that .I am mi max 2 user.Should i use power button or just go with the flow and use fingerprint sensor.\nThanks in advance", "time": "09-26-2017 07:51 AM", "replies": []}, {"postID": "post5993302", "text": "Welcome to Android Central.\nI suggest using your fingerprint sensor. They are built to take the wear and tear. You can also use your power button but fingerprint sensor is quick and easy to use. Thanks!", "time": "09-26-2017 08:30 AM", "replies": []}, {"postID": "post5993324", "text": "Will the life of the sensor be decreased if i use it frequently ?\nAnd thanks a lot", "time": "09-26-2017 08:49 AM", "replies": [{"postID": "post6015736", "text": "I don't think so. I have been using the FPS on my Google Pixel for almost a year and absolutely no issues. Enjoy your Xiaomi Mi Max 2.", "time": "10-11-2017 06:28 PM", "replies": []}]}]}, {"title": "Can I change screen size?", "thread": [{"postID": "post6009390", "text": "Hello,\nOn my Nexus 5x there was this option that makes everything smaller or bigger. Is there way to do this with Xiaomi Redmi Note 4x?\nI would love this feature!!!\nThanks.", "time": "10-07-2017 02:05 PM", "replies": []}, {"postID": "post6009821", "text": "it's different system but I think you an do this using 3rd party apps.", "time": "10-07-2017 06:37 PM", "replies": []}]}]
[{"title": "Battery Draining in Redimi4 ??", "thread": [{"postID": "post6005286", "text": "Most of the time my mobile battery is draining by \"Android System\". Can any one help me solve this??\nIt is using up to 32% approximately is there a way to resolve this Android OS some how??", "time": "10-05-2017 05:30 AM", "replies": []}, {"postID": "post6006925", "text": "Moved from the Android Apps forum to the Xiaomi forum, since the former is intended for developers to promote their apps.\nCharge up to 100%, then let it drain to 20-30% with normal usage, without charging in between. Then show us:\n1. The main Settings>Battery screen.\n2. The fullscreen battery graph screen (which shows Awake time and Cell Signal Strength).\n3. The Screen category (to see total Screen On time).\n4. The Cell Standby category, if present (to see Time Without Signal).http://forums.androidcentral.com/gen...d-central.html\nYou might have to install a 3rd party battery monitor, like GSam Battery Monitor, to get the Cell Signal Strength graph.", "time": "10-06-2017 12:04 AM", "replies": []}, {"postID": "post6006977", "text": "That was very helpful info.", "time": "10-06-2017 01:09 AM", "replies": []}]}, {"title": "Different colors are appearing on the screen.", "thread": [{"postID": "post5999900", "text": "My redmi note 3 broken n it got repaired for two days it was okay but now different colors are appearing on the screen.", "time": "10-01-2017 11:00 AM", "replies": []}, {"postID": "post6000044", "text": "Welcome to Android Central! Bring it back to the repair shop and ask them about it.", "time": "10-01-2017 12:41 PM", "replies": []}]}, {"title": "Massive SoT while sleeping?", "thread": [{"postID": "post5996208", "text": "Using MiA1 android 7.1.2\nDischarged 20% while i was asleep\nBattery usage stats show major usage by screen only (5.5 hours screen on while i was asleep) How can the screen be on while being asleep? Sleep after inactivity is set to 1 minute.", "time": "09-28-2017 07:04 AM", "replies": []}, {"postID": "post5996418", "text": "Welcome to the forums. I would try a reboot and full charge and see if it happens again.", "time": "09-28-2017 09:44 AM", "replies": []}]}, {"title": "About Mi Max 2 camera", "thread": [{"postID": "post5992182", "text": "I bought Mi Max 2(xiaomi) 1 day ago..When i click camera,sometimes the picture doesn't save at the gellery...This happens randomly,not continuously.my camera picture storage is sd card.", "time": "09-25-2017 01:10 PM", "replies": []}, {"postID": "post5992492", "text": "check the default storage for the device.", "time": "09-25-2017 05:09 PM", "replies": []}, {"postID": "post5993443", "text": "i check the default storage,it was sd card", "time": "09-26-2017 10:20 AM", "replies": []}]}, {"title": "Trying to Root a Xiaomi Redmi 4", "thread": [{"postID": "post5981988", "text": "Hello i have a xiaomi redmi 4 (prada) with MIUI 9. I unlocked the bootloader and pressed the option root in the settings. But i run a program that checks if my phone is rooted and it is not. SuperUser app doesn't work. So i tried to install TWRP to root it. There is no official TWRP for my device so i found a couple of ports online. I installed them with no problem. But none of them really worked. When go to the recovery mode it is the official mi recovery. So is there any way of rooting my phone without TWRP? Can i do TWRP work? Thank you", "time": "09-18-2017 06:23 PM", "replies": []}, {"postID": "post5982057", "text": "Actually, when you opened the root option in the Settings (or another app like Security), your phone has been rooted. Xiaomi has its own root manager function (with no need of SuperUser or SuperSU) in the place where you open root access. Whenever you run an app that requires root access (including the app you installed to check root status), you have to go to the root manager to manaully authorize root permission for the app. \nAnd, every time you update a Developer ROM, the root function seems to be closed until you open it manually again. It is not that convenient to use rooting function in Xiaomi comparing with other devices. That may be the cost since it is way safer and easier to root a Xiaomi than other Android devices.\nHere is a guide about how to root Xiaomi Redmi Note 3, which should also work for your Redmi 4.", "time": "09-18-2017 07:14 PM", "replies": []}, {"postID": "post5982923", "text": "Okay i will keep that in mind thank you very much", "time": "09-19-2017 11:22 AM", "replies": []}]}, {"title": "LG L90 replacement?", "thread": [{"postID": "post5981092", "text": "Hello\nFor me the most important thing in smarthphone is camera. I wonder if Xiaomi 4X with its 13 Mpx sensor takes better photos than my old LG L90 with 8 Mpx sensor? This old LG makes very good and sharp photos with a lot details as far as landscapes are concerned (I don't care that much about photos from short range) in good light conditions. Xiaomi 4X would be good choice for taking photos of landscapes, cities etc. during a day? Maybe you could suggest other models with good camera in prace range 140-190 EUR. I'd rather have small screen size, maximum 5\"\", but I'd prefer little smaller (just like my old LG's 4,7\")", "time": "09-18-2017 10:14 AM", "replies": []}]}, {"title": "Xiaomi Mi Note 3 - Is it a downgrade?", "thread": [{"postID": "post5976820", "text": "I had the original Mi Note in white. It was a superb device. So when the chance arrived to get a Mi Note Bamboo Edition, I got that. Used it as my primary device for a couple of months. It was a superb device. The best wooden back surface execution bar none. I also think it was the inspiration for the Note 5 with a curved back.\nI had the Mi Note 2 as well. It was a definite leap forward in the right direction. Latest processor, gobs of RAM, camera wasn't shabby at all and superb battery life. And best of all, it worked on TMO, ATT and Verizon in the USA!\nWell now that the Mi Mix 2 is become more mainstream, I feel that the Mi Note 3 is no longer the top shelf large screen device from Xiaomi since it will sport a Snapdragon 6XX processor. I am also worried that Xiaomi will no longer put in TMO, ATT and VZW compatible bands in this phone and thereby discouraging most of us in America from importing this device.\nWho knows if there are die hard fans willing to live with H/H+ speeds.\nSound off your thoughts in the thread below.", "time": "09-15-2017 04:29 PM", "replies": []}, {"postID": "post5977244", "text": "no one's willing to live with H/H+ just for Xiaomi this is crazy. (fanboyism? )", "time": "09-15-2017 08:01 PM", "replies": []}, {"postID": "post5977447", "text": "I heard the screen on mi note 2 was awful , wonder how the screen is on note 3", "time": "09-15-2017 09:47 PM", "replies": []}]}, {"title": "Xiaomi Redmi Note 4x - How do I get a bloatware-free Android 7 install from a developer?", "thread": [{"postID": "post5963556", "text": "Hi again folks,\nI'm wondering, who do I ask, to install a clean, bloatware-free install of Android 7 on a Xiaomi Redmi Note 4/4x for me? I've just today registered on xdadevelopers but I can't post in the forums yet (to find a developer to help me) until I post,. (catch 22?!), so I don't really know what to do about that side of things.\nI'd REALLY like a CLEAN, resource-light install of Android 7, (despite the phone being more than capable of dealing with background interference from unwanted apps running etc) but without the masses of bloatware that is frequently a nightmare to deal with. I don't want to have to disable the bloatware apps (because even that isn't always successful) and I know I certainly won't be able to remove the bloatware - so it'd be better if it wasn't installed in the first place, right?\nObviously, there are some apps that are sometimes considered bloatware that are in fact essential for the OS to work, but save for those few apps, I'd like to have Android 7 installed WITHOUT the majority of the apps that ARE bloatware and ARE considered non-essential to the operation of the operating system.\nThe thing is,. could I do it myself without too much hassle/stress? Also, if I didn't feel I could do it myself, would developers do it for a one-off and would it likely cost me? If so, how much? Who could help me with the install? How long would it take? Can I choose which apps to omit from the package prior to the Android 7 [Nougat] install? Any advice pertinent to my query is welcome, thank you.", "time": "09-08-2017 05:33 AM", "replies": []}, {"postID": "post5976196", "text": "Go to XDA forum in search redmi note 4 you will gef every adcice you want its there.", "time": "09-15-2017 11:13 AM", "replies": []}]}, {"title": "Settings icon disappeared", "thread": [{"postID": "post5976032", "text": "Settings icon on home screen got disappeared and i am not able to recover it", "time": "09-15-2017 09:59 AM", "replies": []}, {"postID": "post5976083", "text": "Welcome to the forums! Can you find it under 'widgets'?", "time": "09-15-2017 10:21 AM", "replies": []}]}, {"title": "Will the Mi A1 Make it to the US Market?", "thread": [{"postID": "post5970897", "text": "I understand you can buy but will it function on US networks..", "time": "09-12-2017 03:34 PM", "replies": []}, {"postID": "post5971250", "text": "I don't think it will officially make it's way to USA. And the chances of it functioning on USA networks to LTE are slim.\nHere are the specsMi A1 Specification - Mi India\nYou can always check network compatibility at www.willmyphonework.net\nGood luck.", "time": "09-12-2017 06:00 PM", "replies": []}]}, {"title": "Le 2 or Note 4x?", "thread": [{"postID": "post5969444", "text": "Now the Le 2 looks HOT. But Im starting to worry about it getting updates as my Mrs hasnt got a 7.0 update yet.\nXiaomi often update there phones and I read the Note 4x will be getting Oreo.\nNow the Le2 has Adreno 510 vs 506. It also has fast charge. And the Note 4x is butt ugly in comparison (but looks are everything). Also the note 4x doesnt use Gorilla glass?\nSo the Xiaomi missing fast charge kind of negates the better battery as does the lack of gorilla glass, but then the updates almost make up for it?\nIts $170 delivered vs $210 for the xiaomi where I live. So I am paying more for the Xiaomi.", "time": "09-11-2017 05:39 PM", "replies": []}, {"postID": "post5969531", "text": "Xiaomi for sure!", "time": "09-11-2017 06:50 PM", "replies": []}]}, {"title": "why the screen recorder close when video call is ended", "thread": [{"postID": "post5965784", "text": "when i start the recordinding its closed automatically and also showing corruoptted video what i do help me please", "time": "09-09-2017 10:12 AM", "replies": []}, {"postID": "post5966868", "text": "Welcome to Android Central! Is this a preinstalled screen recorder app, or a 3rd party one you installed? Is it saving to Internal Storage or an SD card?", "time": "09-10-2017 12:22 AM", "replies": []}]}, {"title": "Xiaomi Redmi Note 4/4x - RAW capability?", "thread": [{"postID": "post5962110", "text": "Hi folks,\nOk, so my Asus Zenfone's screen recently came loose and it's since died - so, now I need a new Android phone.\nI was looking at the Xiaomi Redmi Note 4 series phones, (mainly the 4x), but something got me thinking - how cool would it be if the phone had the ability to create RAW files when taking pictures with either the main 13Mp rear camera or even inc' the front 5Mp front-facing camera, (in .dng file format or similar).\nI'm still looking at the Xiaomi phones from AliExpress. Does anyone know of a UK supplier? I don't really want to pay extra for expedited delivery from China, or wait even 20 days - I currently don't have a phone, I need one ASAP!  Ok, so I can wait a week if I need, but not much longer.\nI don't really want a rooted phone unless I can see any definite and clear benefits of a rooted device.\nGetting back to the [potential] RAW file 'capability' of the Xiaomi Redmi Note 4/4x devices, I'm pretty sure that the phone doesn't natively support RAW files, but I saw online that there's something called a Bayer file; does the phone need be rooted for it to give the phone RAW shooting capability? Can I just install it WITHOUT rooting the phone? If yes are there any cautionary tales or tips/advice etc you see as important?\nAny tips/advice/knowledge on getting a Redmi Note 4/4x (from the UK) AND getting it to shoot RAW (.dng etc), files, would be humbly welcome, thanks!", "time": "09-07-2017 12:25 PM", "replies": []}]}, {"title": "Xiaomi Redmi 4x can't connect with pc during fastboot.", "thread": [{"postID": "post5948438", "text": "After Installing minimal adb and fastboot and enable usb debugging on my xiaomi.., I still can't see any sign on my pc show that I had connect my device with my pc. What should I do....Any suggestion?", "time": "08-31-2017 10:34 AM", "replies": []}, {"postID": "post5948455", "text": "Welcome to Android Central. You also need USB drivers on the PC for your device. You'd get them from Xiaomi's website I assume.\nIf you need additional help or have more questions or details to share, please join the site so you can reply in this thread. See this link for instructions on how to join Android Central.", "time": "08-31-2017 10:43 AM", "replies": []}, {"postID": "post5948466", "text": "Mod Note: Thread moved for better visibility.", "time": "08-31-2017 10:48 AM", "replies": []}, {"postID": "post5948607", "text": "Try Xiaomi USB Drivers for drivers.", "time": "08-31-2017 11:45 AM", "replies": []}]}, {"title": "How to use ok google?", "thread": [{"postID": "post5937410", "text": "Whenever I try to enable it,,,there comes a message that-\"could not retrieve settings, please try again later\"...I really want to use it...I am using xiaomi mi4i.", "time": "08-25-2017 12:58 AM", "replies": []}]}, {"title": "Xiaomi Android Smartphone Rising Trend", "thread": [{"postID": "post5561760", "text": "What do you guys think about Xiaomi? They are cheap and comparable with the rest of the bunch here. Any updates in terms of performance and price?", "time": "11-14-2016 01:33 AM", "replies": [{"postID": "post5854348", "text": "They are Flagship phones at mid-tear price. Don't let the low price fool you. They are top quality in every way. I have two.", "time": "06-17-2017 11:08 PM", "replies": []}]}, {"postID": "post5610210", "text": "I enjoy using the Mi Max, currently have a S7 edge, Nexus 6P. Each has their features, like the dual sim, ir blaster on the Max. Great for switching between work an personal sim.", "time": "12-16-2016 11:44 AM", "replies": []}, {"postID": "post5640528", "text": "A family member recently wanted a new phone for under AU$200, and after scouring the market's offerings/specs I managed to find the Redmi 4 Prime being the best features/specs for $210 (phones with the back button on the left were not an option). The family member in question had the Galaxy J3 in mind but this Xiaomi model in particular blows it away. 5 inch 1080p screen, 4G, 3gb ram and 32GB ROM, android 6.0 and the new MIUI 8 interface from Xiaomi, even has fingerprint scanner.\nSolid great feeling phone that easily outmuscles my Galaxy Note 3 in performance, I now cannot wait to get a new phone myself (must have a stylus though). I like that Xiaomi put a mid-range CPU (snapdragon 625 octo) in it, they seem to have put a focus on a few higher quality things in a budget range phone, for this particular model.\nThe wifi is only n grade (and seemed a tiny bit slow for n), the buttons are not lit, no gorilla glass (Redmi 3S survives drop tests on youtube though), the camera isn't amazing, but these are fair trade offs for the FHD screen and 4100mAh battery among other things (dual sim, microSD, all the sensors).\nSeems to be a market sleeper, possibly due to the large and confusing range of Xiaomis.\nOnly issue besides yucky icons was that the message app worked once, then crashed upon opening every time after that, so a 3rd party one had to be installed.\nAlso the phone shows approx 1.4gb of ram being used with no apps open, so I'm glad I ordered the 3GB ram model instead of the cheaper 2GB+16ROM version- not sure how that would have turned out!", "time": "01-11-2017 07:47 PM", "replies": []}, {"postID": "post5641655", "text": "I have two xiaomi phones. The redmi note 3 pro and the Mi Max! I cant believe how its possible to get these amazing and fabulous phones for 200 bucks! Its crazy but its also wonderfull!", "time": "01-12-2017 03:58 PM", "replies": []}, {"postID": "post5735810", "text": "Performance is excellent. The Mimix is an awesome phone. My family had every iPhone from 1 to 7s, although I switched to Android with the S5, LG G4, Note 7. When I had to return the note 7 I was looking for something new and went for the Mimix. It's a very large phone, but this suites me as I can easily read documents and pdfs and thus I no longer use my tablet. Performance is excellent, although I did install Nova as a launcher to make it easier switching between Android phones of different brands. The only negative is the camera, the video doesn't seem to have any stabilisation and the pictures are not at good as the Note 7 or G4. They are probably better than the S5 so not too bad. Battery life is great. So after 4 months heavy use the performance beats all the other android phones I've had. My LGs had boot loop issues, the note 7 slowed considerably when I mass loaded it up (may have been a rogue app)", "time": "03-31-2017 02:11 PM", "replies": []}, {"postID": "post5753207", "text": "Having both the Max and Mix, I will be looking forward to the Mix 2.", "time": "04-10-2017 06:49 PM", "replies": []}, {"postID": "post5757750", "text": "I had my doubts when I purchased the redmi note 2, but quickly changed my mind when I saw how well it handled my demands compared to my Xperia Z. The only drawback was the power hungry MTX Helio x10 cpu. Even though I could easily get 4 to 5 hors of SOT, it really felt like it shoulded push about an hour more. \nI recently upgraded from that phone to Redmi Note 3 pro with Snapdragon 650 and got +3 hours of SOT. All in all I am very happy with it, but only after I unlocked the bootloader (official way) and flashed twrp and rooted the device. \nCurrently running the latest stable global MIUI rom (android 6.0.1) with Nova prime and haven't noticed anything weird or any bugs.", "time": "04-13-2017 03:14 PM", "replies": []}, {"postID": "post5935329", "text": "I had the mi mix and loved it. If it worked better on my carrier I would still have it. I'm hoping the mix 2 works better with my carrier.", "time": "08-24-2017 05:12 AM", "replies": []}]}, {"title": "Xiaomi mi 5x - dual cameras on a budget", "thread": [{"postID": "post5900253", "text": "Good option for those on a budget looking for 2x zoom phone https://m.androidcentral.com/xiaomi-...-segment-mi-5x", "time": "07-26-2017 08:22 AM", "replies": []}, {"postID": "post5900310", "text": "Please note, for those importing this phone in to the US it will likely not get LTE. Although it will work on GSM carriers such as AT&T and T-Mobile.", "time": "07-26-2017 09:20 AM", "replies": []}, {"postID": "post5907105", "text": "I think the phone is a good compromise, some sites like geekbuying already have the phone on sale.", "time": "07-31-2017 03:13 PM", "replies": [{"postID": "post5926145", "text": "Doesn't look too bad. They just listed the rose gold version with 64GB storage for $255", "time": "08-17-2017 01:21 AM", "replies": []}]}]}, {"title": "How to copy files with long filenames to redmi_note4.", "thread": [{"postID": "post5911963", "text": "Hi I am Rupesh from India and yesterday I have bought xiomi redmi note 4 which has 64 internal memory and snap Dragon processor. I have some music files in my pc and I want to transfer them to internal memory of my phone.\nAt present I have installed Windows 8.1 pro on my pc. when I connect the phone to the computer using original usb cable provided the phone is displaying message as connected for charging only and tap for other options and when I tap there's no entry for usb mass storage.\nAs the phone is connected in mtp mode file transfer is very slow and also when I try to recopy a directory from pc to phone it is copying all files again instead of skipping already done.\nI have tried copying with other tools in Windows like tera copy, rich copy, rockdils unstoppable copier etc., but there's no use I mean I am unable to copy as I can't find entry of the phone like redmi note 4. Some of the tools specified above can transfer long filenames but they are expecting a path starting with drive letter like d:/\nIn order to mount internal memory as usb mass storage the phone needs to be rooted but when I try to root the device my device warranty may become invalid.\nPlease suggest how to copy files with long filenames to my phone internal memory.\nRegards,\nRupesh.", "time": "08-04-2017 07:27 AM", "replies": []}, {"postID": "post5912246", "text": "First, I don't believe transferring via USB Mass Storage mode would be any faster -- the data transfer speed will depend on the USB connection. Are you using a USB 2.0 or 3.0 port on the computer? Make sure it's 3.0. Also, try different USB cables, since cables can get damaged.\nWhen you say file transfer is slow, do you mean that an individual file's transfer rate is very slow, or that you're trying to copy many files in bulk, and that's taking a while?", "time": "08-04-2017 11:46 AM", "replies": []}]}, {"title": "unable to eject SIM card tray of xiomi redmi note4.", "thread": [{"postID": "post5912017", "text": "Hi I am Rupesh from India and yesterday I bought xiomi redmi note 4 with snap Dragon processor. I am unable to insert SIM card and memory card into the phone.\nI have used the original pin provided by the company and pushed gently into the hole present at the left side of the phone. The SIM tray is not getting out and instead the tray is coming out very slightly I think in the size of the width of a nail.\nI heard that if we push the pin hardly the phone may damage and if we remove 10 to 20 times SIM tray also the phone may damage. Is it true.\nPlease suggest how to eject sim tray properly and insert SIM and memory cards.\nRegards,\nRupesh.", "time": "08-04-2017 07:57 AM", "replies": []}, {"postID": "post5912231", "text": "You typically have to press in fairly firmly to eject the SIM tray completely.", "time": "08-04-2017 11:39 AM", "replies": []}]}, {"title": "Xiaomi Redmi 4X opinions and experiences?", "thread": [{"postID": "post5858230", "text": "I'm interested in buying the phone.", "time": "06-21-2017 10:28 AM", "replies": []}, {"postID": "post5890088", "text": "Go for it man! Great phone, super battery, smooth performance!", "time": "07-18-2017 03:49 PM", "replies": []}, {"postID": "post5900132", "text": "I'm using the redmi note 4 (4gb ram and 64gb memory), global version, for 2 weeks and I'm very happy with it. The battery is great lasting 1,5 days. The 625 processor is fine (I'm not a game player, using it more for emails and watch Netflix), using 2 sim cards, I'm using the blackberry launcher. No nougat so far but not feeling the need. My other phone is a Samsung S7 which battery is a pain. I do not compare both devices as Samsung has a better processor and much better camera. But for the xiaomi price and normal use, I believe it's hard to find a better ratio price-quality. At the end of the day all we want is a phone that lasts full day and works well.", "time": "07-26-2017 05:57 AM", "replies": []}]}, {"title": "Xiaomi Mi Mix", "thread": [{"postID": "post5727700", "text": "Ordered Xiaomi Mi Mix, 256 GB, hope it works as well as the Xiaomi Mi Max worked for me. I like the phone quality of both SIM's with the Max. With dual SIM phone 4g on one SIM and 2g on the other just bad, might as well be no G.", "time": "03-27-2017 01:04 PM", "replies": []}, {"postID": "post5727769", "text": "As I understand the Mix was not designed for use in the US and it's missing some of the US LTE bands. You WILL get some though, for example on T-Mobile LTE bands are 2, 4 and 12 with 4 and 12 being the primary bands, and you DO get band 2 and 4 on the Mix, BUT not 12 (12 is the best to have, BUT it's not the end of the world). On AT&T you get 2, 4 and 5, BUT not their primary band 17. You get 2 and 4 on Verizon, but not their primary 13 AND no CDMA backup, so I wouldn't trust it on Verizon. And you get nothing on Sprint, plus their is NO way Sprint would activate it anyways.\nI will tell you this despite that I almost got one. I'm on T-Mobile, JUST for that gorgeous screen!", "time": "03-27-2017 02:09 PM", "replies": [{"postID": "post5749154", "text": "That's not true. I've had a mix since October and have used it on both ATT and Verizon. Yes the missing band 17 on ATT and the missing band 13 on verizon is an issue. When I was on ATT I had LTE at all times in Southern California. Using it on Verizon I would usually latch on to band 4 (in areas where other verizon phones would be on band 13. So there is some overlap and redundancy. The few times where there was no band 2 or 4 for me to get, I did have 3g and was still able to make calls and even stream netflix with no buffering.", "time": "04-07-2017 10:52 PM", "replies": [{"postID": "post5749211", "text": "Coolio! Maybe I will try to get one again.", "time": "04-08-2017 12:00 AM", "replies": []}]}]}, {"postID": "post5731903", "text": "Received the Mi Mix, had the Mi Max before, so easy setup, getting 4G with AT&T and 3G with T-Mobile at the house. Orlando area.", "time": "03-29-2017 09:34 PM", "replies": []}, {"postID": "post5753204", "text": "Currently getting VoLte with T-Mobile. Really loving the phone. Only miss Samsung Pay and group messages.", "time": "04-10-2017 06:47 PM", "replies": []}, {"postID": "post5753220", "text": "Gearbest had a flash sale so I bought one!", "time": "04-10-2017 06:58 PM", "replies": []}, {"postID": "post5763105", "text": "Just bought one from Hong Kong. Works well in HK. I have the 6GB ram and 256GB storage version. Has Google Play pre installed. Excellent phone. Beware some \"themes\" are buggy. The default theme works well. Some other themes not so smooth. E.g, i tried a few different themes and the Contacts and Dialler kept hanging, so obviously went back to the default theme. Also some non default launchers may not work properly. BlackBerry launcher, with Sony clock widget didn't work. Kept showing the wrong time. Battery and display are amazing.", "time": "04-17-2017 12:00 AM", "replies": []}, {"postID": "post5854230", "text": "I can't get Verizon to work at all. I wonder what the deal is. It sees the SIM is Verizon, but I get zero service. I tried to add an APN, won't save it. T-mobs works but no 4G/LTE", "time": "06-17-2017 08:36 PM", "replies": [{"postID": "post5854333", "text": "I don't think the Mi Max is compatible with Verizon on 4G, only CDMA 3G. \nYou can check this out if it helps:https://www.google.com.vn/amp/s/apn.....php%3Famp%3D1", "time": "06-17-2017 10:56 PM", "replies": []}, {"postID": "post5867284", "text": "What ROM are you using? I had issues with RR in some builds where the APN settings weren't right and I couldn't get any phone calls, newer builds this was fixed though and I was able to get everything working right off the bat without doing anything.", "time": "06-29-2017 12:29 AM", "replies": [{"postID": "post5867285", "text": "First off, you're not even talking about the correct phone. We are discussing the Mi Mix, not the Mi Max. Secondly, it does work on Verizon as I and many others have verified. It is only missing one LTE band.. the same amount of bands it is missing on ATT.", "time": "06-29-2017 12:30 AM", "replies": []}]}]}, {"postID": "post5867730", "text": "Cheers for pointing out my mistake. It is the Mi MIX not MAX & you're correct it is missing the LTE band 13. But Band 13 is the MAIN LTE band for Verizon (For ATT it's band 17) That may present a problem depending upon your area. Plus, no CDMA backup.https://www.reddit.com/r/Xiaomi/comm...compatibility/", "time": "06-29-2017 10:32 AM", "replies": [{"postID": "post5870109", "text": "I get 3g on my Mix whenever I'm in an area that doesn't get LTE. 90% of the time I have LTE in SoCal but there are pockets where I fall back to 3g. You should probably defer to someone who has actually owned the phone over a copy-pasted list on reddit.", "time": "07-01-2017 02:54 PM", "replies": [{"postID": "post5870587", "text": "I never said it wouldn't work, did I? \nYou'd do well over at Crackberry. Their all a bunch of cranky know-it-alls too.", "time": "07-02-2017 03:40 AM", "replies": [{"postID": "post5872149", "text": "You literally said no CDMA backup. And I'm not being a know it all I just don't like to see people talking out of their *** and giving people incorrect information.", "time": "07-03-2017 02:12 PM", "replies": []}]}]}]}]}, {"title": "Redmi 4A phone stuck at TWRP!", "thread": [{"postID": "post5869556", "text": "Hi, I just bought Redmi 4A long time ago, and I installed TWRP in it long time ago. But then today, I tried to root my phone, so I re-flash and reboot TWRP and my phone is not doing anything so I force power-off my phone and when I reboot my phone, it goes to the TWRP thing, and I can't do anything there.\nI tried to flash ClockworkMod but still doesn't work, I tried factory reset still don't work!\nPlease help!", "time": "07-01-2017 01:50 AM", "replies": []}]}, {"title": "Why there is a off coloured pixel in my display?", "thread": [{"postID": "post5859342", "text": "I've been using redmi note4 & few days back i noticed a very small horizontal line which lights oddly in my display, this is visible only in black background. Is this a dead spot or some other damage, please help ?", "time": "06-22-2017 09:07 AM", "replies": []}, {"postID": "post5859848", "text": "Welcome to Android Central! It's likely a dead pixel, or a group of them. If it's bothersome to you, check with Xiaomi to see what their dead pixel policy is. Most manufacturers won't do anything unless you have above a certain number of dead pixels.", "time": "06-22-2017 03:10 PM", "replies": []}]}, {"title": "I have a little white mark on the lower right corner of the screen on my Xiaomi mi note", "thread": [{"postID": "post5858381", "text": "The mark appeared yesterday and i don't know how to get rid of it,you can only see it on a dark image but when the screen in white it dissapears.", "time": "06-21-2017 12:40 PM", "replies": []}, {"postID": "post5858993", "text": "It could be light bleed. Is it right at the edge of the screen?", "time": "06-21-2017 11:18 PM", "replies": []}, {"postID": "post5859123", "text": "It isn't at the edge", "time": "06-22-2017 04:46 AM", "replies": []}]}, {"title": "Unlocking redmi note4 sd varient", "thread": [{"postID": "post5854456", "text": "I need to unlock , root, and install twrp on my redmi note 4 running miui 8.2.5 stable .but I'm seeing tutorials about unlocking mobiles running 8.1 versions . Is those tutorials helpful for miui 8.2.5 version.or I need to revert back to miui 8.1 if I need how to do that or is there any other methods .sorry for my English .hope u understood my question . Thank you", "time": "06-18-2017 02:39 AM", "replies": []}, {"postID": "post5854692", "text": "I think it would be a good idea to look at the MIUI forums for your answer. It is a much more comprehensive forum for Xiaomi phones and a very active community.Xiaomi MIUI Official Forum", "time": "06-18-2017 10:08 AM", "replies": []}]}, {"title": "Xiaomi Mi 4 vs Lenovo K6", "thread": [{"postID": "post5635962", "text": "Hello, people!\nWell, I have a LG L90 with CM 11 (thank you for the help!). After doing this, it's performance have been satisfactory. Although, the pictures are not good...\nI'm considering buy another phone. I don't play games or watch movies on the phone, and I love to use it with a single hand, swyping to type - so, I am looking for a \"small\", one-handed phone, the L90's 4.7\" screen seems perfect to me. More than a great performance, I appreciate a good front camera - I miss decent selfies.. \nSo, I'm considering Xiaomi Mi 4 and Lenovo K6 (Redmi 4 seems to have a worse front camera). What do you think?\nThanks in advance", "time": "01-08-2017 01:03 PM", "replies": []}, {"postID": "post5854358", "text": "Mi 4 all the way. Flagship phone 2.5 years ago and still a great phone. \nXiaomi supports and updates their phones much more consistently and there is a great community of Mi users.", "time": "06-17-2017 11:20 PM", "replies": []}]}, {"title": "Ebay buyer claims she needs email and password to unlock Mi Max", "thread": [{"postID": "post5637886", "text": "Hey Mi Max users, I need some advice, hope you can help.\nI sold my mi max, which I bought brand new and am sure I factory reset.\nThe buyer has sent me a message saying she wants a refund. She says it is locked to a user and she doesn't know the email and password to unlock it. She said she had this problem with an IPhone before.\nI have no idea what she is referring to. I've sold plenty of phones before, where i factory reset the phone, it's good to go as a new phone and the buyer is happy. I've asked her to send a screenshot of the screen she is getting.\nAnyone have any idea of what could be going on? This buyer has over 800 transactions with 100% feedback", "time": "01-09-2017 09:25 PM", "replies": []}, {"postID": "post5637893", "text": "I would wait to see photos, or preferably, video of the device asking for that information. If you did reset the device then it should not be asking for this information.", "time": "01-09-2017 09:35 PM", "replies": [{"postID": "post5638478", "text": "I've had this issue before (and so weird, because I know how to factory reset everything!) this is a GOOD IDEA!!!!", "time": "01-10-2017 10:43 AM", "replies": []}]}, {"postID": "post5638875", "text": "Before you did the factory reset, did you remove your Google account from the Settings>Accounts menu? This properly authorizes the factory reset. If you don't remove the Google account first, it's considered an unauthorized factory reset, which causes Google's Factory Reset Protection feature to kick in. It requires the user to enter that account's name and password to proceed. See here: https://support.google.com/nexus/answer/6172890?hl=en\nThis has been the case since Lollipop, I think, but it's still not widely understood, so we see this crop up with some regularity here. It's reasonable to ask the buyer for a photo to confirm that they're getting that screen. If you give her your password, she could then boot the phone up, go to Settings>Accounts, select your account, and properly remove it. Then she could do a proper factory reset, and then set it up for herself.\nAfter this, you could then change your password -- but another tricky thing here is that if you change the password too soon, it might prevent her from finishing the above process. You might want to arrange a time where you can do a video chat using Skype or Hangouts, so you can see what she's doing. Once she removes your account and does the factory reset, you can then change your Google password.\nComplicated, I know, but if you want to keep that good eBay rating, it might be worthwhile!", "time": "01-10-2017 02:36 PM", "replies": []}, {"postID": "post5638938", "text": "Thanks for the responses guys. I did request a screenshot, no response so far! \nThis is the second time I've heard that there is a security feature to unlock after reset. I'll keep this in mind when selling phones in the future. However, I've sold an HTC 10 and Nexus 5x this year on eBay with really happy buyer's, so looks like this issue didn't come up on those phones?", "time": "01-10-2017 03:15 PM", "replies": []}, {"postID": "post5638965", "text": "Interesting. Maybe you did remove your Google account before factory resetting in those cases?", "time": "01-10-2017 03:29 PM", "replies": []}, {"postID": "post5640902", "text": "Massive thanks B. Diddy. You were right, removing my google account worked. She seems quite happy and is no longer requesting a refund.", "time": "01-12-2017 05:28 AM", "replies": []}, {"postID": "post5641193", "text": "Excellent! Although Factory Reset Protection has been around for a while, it still doesn't seem as widely known as it should be. This ought to be required reading: Selling your Android phone or tablet: The ultimate guide | Android Central", "time": "01-12-2017 10:31 AM", "replies": []}, {"postID": "post5854357", "text": "Old thread I know, but she may be referring to your Mi Cloud account. \nThe phone will ask you to sign into you Mi Account every time until you do it. \nNot sure of the solution other than her trying to sign up for a new Mi Account.", "time": "06-17-2017 11:17 PM", "replies": []}]}, {"title": "How to unroot my Xiaomi 1S?", "thread": [{"postID": "post5740442", "text": "Using SuperSU I can not update it's binary\nAlready using TWRP/CWM", "time": "04-03-2017 03:23 AM", "replies": []}, {"postID": "post5740622", "text": "Flash a stock ROM.", "time": "04-03-2017 07:48 AM", "replies": [{"postID": "post5854350", "text": "This. \nGo to the Xiaomi website for instructions", "time": "06-17-2017 11:11 PM", "replies": []}]}]}, {"title": "Mi Mix camera guessing my age?", "thread": [{"postID": "post5764161", "text": "Folks,\nOk I'm not sure what is up here, BUT as I was taking a selfie with my Mix today, mostly just to test the camera, it kept guessing my age! Ok I'm 51, BUT the damn thing was giving guesses from 45 (I liked that) all the way up to 59 (I did NOT like that!). What's up with that. Is age detection a feature of the camera and why? Is this damn phone an amateur Kreskin? lol", "time": "04-17-2017 02:16 PM", "replies": []}, {"postID": "post5775998", "text": "Mine is guessing on the low side", "time": "04-21-2017 08:27 PM", "replies": []}, {"postID": "post5778702", "text": "That happened to all  hope Xiaomi will fix it on Mi 6", "time": "04-23-2017 03:05 AM", "replies": [{"postID": "post5854345", "text": "In the Camera app there is a setting called Age & Gender. It set set to ON by default. You simple need to turn it OFF.", "time": "06-17-2017 11:04 PM", "replies": []}]}]}, {"title": "Snapchat picture is pixelated when zoomed in", "thread": [{"postID": "post5853578", "text": "Hi,\nI'm having this strange issue, when using Snapchat and zooming in (even a little bit) it goes pixelated. Native camera app works perfectly but Google Camera (installed from apk) has the same problem as Snapchat. \nI have a Xiaomi Redmi Note 3 Pro, a month old. Running default global rom 8.2.4.0.\nAny help will be appreciated!\nRegards,\nKerdo", "time": "06-17-2017 07:36 AM", "replies": []}, {"postID": "post5854289", "text": "Many (most?) of the instant messaging apps will downsize and/or compress your pictures before sending them because sending large pictures is expensive.\nHow big (in pixels) is your photo to start with?\nHow big (in pixels) is your photo after Snapchat plays with it?", "time": "06-17-2017 10:09 PM", "replies": []}]}]
[{"title": "Understanding Xiaomi MIUI ROMs", "thread": [{"postID": "post5853469", "text": "I found this explanation of the various types and versions of Xiaomi MIUI ROMs to be very helpful. So I thought I would share.\nAll credit to the original author.Understand MIUI ROM Version and How To Identify Which ROM Installed On Your Mi Devices | Mi/MIUI Malaysia Community", "time": "06-17-2017 03:51 AM", "replies": []}, {"postID": "post5854129", "text": "Moved from the General Help forum to the Xiaomi forum.", "time": "06-17-2017 06:23 PM", "replies": []}]}, {"title": "37% Discount on Mi 5!", "thread": [{"postID": "post5849024", "text": "Hey all,\nJust came across a very nice discount at banggood, they sell the Mi 5 with a discount of 37%! https://goo.gl/2gmnB5.", "time": "06-13-2017 09:39 AM", "replies": []}]}, {"title": "Is the Xiaomi Redmi 4A compatible with Samsung Gear 3 ?", "thread": [{"postID": "post5832135", "text": "i have a LG phone and is not compatible.", "time": "05-29-2017 02:26 PM", "replies": []}, {"postID": "post5832567", "text": "Welcome to Android Central! This list doesn't include the Redmi 4A, but there's always a slight chance it might be and the list hasn't been updated yet. Compatibility | Samsung Gear S3 - The Official Samsung Galaxy Site", "time": "05-29-2017 10:45 PM", "replies": []}]}, {"title": "Xiaomi Redmi Note 2 - Recovery boots again and again", "thread": [{"postID": "post5830611", "text": "I dont know what to do, i do power + vol up and it does like normal boot and then repeats , vibrates ... i dont know, help me !", "time": "05-28-2017 04:32 AM", "replies": []}, {"postID": "post5831236", "text": "Welcome to Android Central! Are you able to boot into Recovery and wipe the cache partition? XIAOMI Redmi Note 2 - Recovery Mode - HardReset.info", "time": "05-28-2017 05:59 PM", "replies": []}]}, {"title": "Mi Cloud: Authentication failed - Invalid username or password", "thread": [{"postID": "post5829771", "text": "I have changed my password and when I try to sign in to Mi cloud to reactivate the sync, it shows the following error. I have entered the correct password and this was used to sign into my Mi account. I am using Redmi 2 and my MIUI is MIUI Global 8.1. Please help!", "time": "05-27-2017 09:03 AM", "replies": []}]}, {"title": "How to unbricked my phone Xiaomi Redmi note 4?", "thread": [{"postID": "post5824999", "text": "I flashed it with a wrong ROM", "time": "05-23-2017 02:24 AM", "replies": []}, {"postID": "post5826515", "text": "If you have the Mediatek version you can follow this tutorialhttp://en.miui.com/thread-371349-1-1.html\nIf you have the Qualcomm version, things are a bit more complicated I think. Have a look at the official forumhttp://en.miui.com/forum.php", "time": "05-24-2017 10:30 AM", "replies": []}]}, {"title": "Why doesn't Xiaomi sell phones in the USA ?!?", "thread": [{"postID": "post5806903", "text": "They would take a serious portion of the mid market segment. \nWhy don't they sell here ?", "time": "05-09-2017 06:19 AM", "replies": [{"postID": "post5815660", "text": "Hardware is hard. \nThe US is such a saturated market.", "time": "05-15-2017 11:59 AM", "replies": []}]}, {"postID": "post5806972", "text": "You answer your own question. That phone brand would\ntake big portion of the wireless market..Another reason\nmaybe the Xiaomi's doesn't meet quality standards", "time": "05-09-2017 07:33 AM", "replies": [{"postID": "post5819105", "text": "Xiaomi exceeds quality standards. \nNew Budget King (move over, Moto G 4/5!) \nXiaomi Redmi 4 Tech.review and HERE \nMi 5 Review by PcAdvisor", "time": "05-17-2017 08:05 PM", "replies": []}]}, {"postID": "post5815616", "text": "Business, they need to expand at a rate where they can stay afloat", "time": "05-15-2017 11:34 AM", "replies": []}]}, {"title": "Gyro drifting to the right", "thread": [{"postID": "post5794675", "text": "Hello. Some time ago my gyro sensor is going mad. Even if i put it on the table or any flat surface,it still moves. I have triead flashing rom and reseting and battery pull ect... Please help me it makes vr games unplayable! Btw. My phone is xiaomi redmi 2", "time": "05-01-2017 03:41 AM", "replies": []}, {"postID": "post5794704", "text": "Maybe hardware problem. Gyro possibly faulty. Needs replacing", "time": "05-01-2017 04:31 AM", "replies": []}]}, {"title": "Unable​ to get a GPS Fix inside home on Redmi 3s prime", "thread": [{"postID": "post5787746", "text": "I never get a fix inside my house and also outside its accuracy is not impressive. How can i solve this gps problem??", "time": "04-27-2017 07:13 AM", "replies": []}]}, {"title": "i'm deciding between two phones which one to buy..", "thread": [{"postID": "post5765278", "text": "i really would like to choose the one with the best camera quality and better all round performance. My two options are the xiaomi note 4 and i phone 5S/SE\nthank you all in advance for your responses", "time": "04-18-2017 04:01 AM", "replies": []}, {"postID": "post5765319", "text": "I'll move the thread to the Xiaomi forum, on the offchance that users there are familiar with the 5s and/or SE and are able to make a comparison.", "time": "04-18-2017 05:10 AM", "replies": []}, {"postID": "post5775604", "text": "Welcome to the forums! I can only speak for the SE - it takes very good quality photos. My boyfriend has it and I've always liked his camera quality. I feel like iPhone is really good at \"media\" performance in that respect - photos, iTunes, etc.\nHopefully other users will be able to comment on Xiaomi's camera performance. You could watch some reviews and unboxing videos on YouTube (look for Android Authority and Android Central videos) to see if the Xiaomi is featured.", "time": "04-21-2017 05:40 PM", "replies": []}]}, {"title": "My sim card is detected but i cannot call or send message", "thread": [{"postID": "post5744568", "text": "I use a redminote-3 and since past two days though my SIM card is detected am not able to make calls or message anyone but am able to use hotspots easily and connect to any server and the simcard is not faulty as it is working perfectly fine in other mobiles and i use Airtel sim", "time": "04-05-2017 08:50 AM", "replies": []}, {"postID": "post5744757", "text": "Welcome to Android Central! Have you contacted your carrier about this?", "time": "04-05-2017 10:27 AM", "replies": []}]}, {"title": "What symbol is this on the notification bar of my xiaomi phone?", "thread": [{"postID": "post5741452", "text": "it is a shape of a leaf with a circle in it.. I'm really curious as to what it means", "time": "04-03-2017 04:15 PM", "replies": [{"postID": "post5742354", "text": "I think it's the battery saver, it's the normal simbol for that.", "time": "04-04-2017 02:02 AM", "replies": []}]}, {"postID": "post5741461", "text": "Can you attach a screenshot? My guess is Greenify, but would have to see it.", "time": "04-03-2017 04:23 PM", "replies": []}, {"postID": "post5741467", "text": "I just posted an attachment, it's beside the battery percentage..", "time": "04-03-2017 04:25 PM", "replies": []}, {"postID": "post5743687", "text": "Could be facial recognition, I have it on my BLU energy xl", "time": "04-04-2017 06:04 PM", "replies": []}]}, {"title": "Xiomi phone wifi turning on very slowly", "thread": [{"postID": "post5742936", "text": "Sir\nmy xiomi redmi 1s phone which i bought an year ago recently takes several minutes to get wifi turning on. I regularly do all software updates by xiomi.my phone also forgets many of the saved wifi passwords also.phone is working well,except this wifi issue.how to fix wifi turning on delay..please help.thanks for lisitening me...", "time": "04-04-2017 11:02 AM", "replies": []}]}, {"title": "because i want good battery performance", "thread": [{"postID": "post5736986", "text": "How's mi 6", "time": "04-01-2017 05:06 AM", "replies": []}]}, {"title": "I lost automatically my songs from my playlist of red mi note 4 how i restore it please give me", "thread": [{"postID": "post5715493", "text": "Automatically i have find all songs from my playlist deleted so how i restore all these files", "time": "03-17-2017 03:56 PM", "replies": []}, {"postID": "post5735188", "text": "Hopefully you have backups on your computer", "time": "03-31-2017 09:10 AM", "replies": []}]}, {"title": "Speech Recognition", "thread": [{"postID": "post5713868", "text": "Hi,\nI have just ordered a new phone from Gearbest, China, Xiaomi Redmi Note 3 Pro 4G, and I have since found out that this phone does not support speech recognition. Is there any way that I could download an app that would enable this or does it mean that the hardware wont support speech recognition.\nThanks for any advice that might be forthcoming.\nRegards,\nJohn.", "time": "03-16-2017 06:52 AM", "replies": []}, {"postID": "post5714822", "text": "How did you find out that it doesn't support speech recognition? Any Android phone should be able to do voice-to-text. Do you mean that the phone won't be compatible with any Google apps (i.e., if it's a phone that was intended for the Chinese market), and therefore won't be compatible with Google Now?", "time": "03-17-2017 02:48 AM", "replies": []}, {"postID": "post5714994", "text": "Isn't that built into the OS?... IE every android phone?\nSettings => Language and input => Google voice typing\nSet it to how you want it to behave.", "time": "03-17-2017 08:29 AM", "replies": []}, {"postID": "post5715578", "text": "Hi B.Diddy and kramer5150,\nThank you so much for taking the time to reply. This is the phone I orderedXiaomi Redmi Note 3 Pro 4G Phablet-189.99 Online Shopping| GearBest.com\nand I had previously had an xiaomi phone but when I tried to install google keyboard it said \"this phone does not support speech recognition\". So I sent the question when I was about to order this new phone but they took so long to respond that I had already ordered it by the time I got their reply. And the reply was \"Sorry, this phone does not support speech recognition!\". \nI am not convinced that the answer has been researched or whether they just take the safe route! The phone is what they call a global version but I don't know how much of the original O/S is disabled.\nAnyway, I have ordered it now so will just try and see if I can make it work on speech recognition.\nMany thanks to you both for your comments - I will post to let you know how it pans out.\nRegards,\nJohn.", "time": "03-17-2017 05:49 PM", "replies": []}, {"postID": "post5715741", "text": "In the Questions/Answers section of that website, it says, \"You need to install the Google Store and others google applications by yourself after receiving it if you order this item.\" This indicates that the phone is not certified for Google Play, and therefore may not work with Google services -- so you might not be able to use Google's voice-to-text feature or Ok Google. There might be some 3rd party voice-to-text engine you can use, though.", "time": "03-17-2017 09:00 PM", "replies": []}, {"postID": "post5715908", "text": "Hi again B.Diddy,\nOn the web link I sent, right at the bottom, below the two sets of pictures it states the following\n[I][B]\"Product Notes:\n1. Download your favorite apps through the Google Play Store or Market installed.\n2. Note: This smart phone is designed only to work with the current Android/Windows OS installed in it. Any alterations such as upgrades or flashing a newer version will void the warranty.\n3. The stated ROM amount shows the maximum available ROM with nothing installed. However, the Android/Windows OS and pre-installed software from the manufacturer will occupy some of this ROM. The available ROM on the device will therefore be slightly less than the ROM listed.\"\nSo it looks this model does have Google Play and it makes me wonder about their Q and A's as I said earlier I am not sure how much research goes into their answers - gives me a bit of hope regarding my question to them about speech recognition!\nI should get the phone in about 10 days and I will report back if the microphone icon is \"greyed out\".\nThanks again,\nJohn.", "time": "03-18-2017 02:36 AM", "replies": []}, {"postID": "post5716162", "text": "But in the Q&A, it specifically states that you have to download the actual Google Play Store app yourself. The product notes don't actually say that the Play Store app is preinstalled. The \"Market\" they're talking about is probably some 3rd party app market specific for the Chinese region.\nAnyway, I hope you have success!", "time": "03-18-2017 10:01 AM", "replies": []}, {"postID": "post5716334", "text": "Hi B.Diddy,\nThe spec looks like it is a little misleading - \n(1. Download your favorite apps through the Google Play Store or Market installed.) \nI took it to mean that google Play Store AND Market IS installed but as you pointed out it could mean \"Market\" installed. If you want Play Store you have to install it.", "time": "03-18-2017 01:30 PM", "replies": []}]}, {"title": "Why has the sms delivery notification sound + confirmation suddenly stopped?", "thread": [{"postID": "post5702299", "text": "Xiaomi MI4i MIUI 8.2.2.0.\nWhen using the phone's default Messaging app, I had the following selections (which I have not changed). \nSettings - Messaging - Notifications - Delivery Status On, Delivery Sound On. I used to see \"Received\" on the left of the message sent and also a hear a sound. These notifications have suddenly stopped. I have made no changes in Settings ( I double checked), and I have not switched networks. Would someone be able to help with this? Thank you.", "time": "03-07-2017 03:43 AM", "replies": []}, {"postID": "post5702988", "text": "Welcome to Android Central! Do you still see the Received at the left of the message, but just don't hear the tone?", "time": "03-07-2017 02:09 PM", "replies": [{"postID": "post5703793", "text": "Hi, no the Received note does not appear any more either.", "time": "03-08-2017 05:16 AM", "replies": []}]}, {"postID": "post5704029", "text": "And all other notifications continue to work normally?\nAny power-saving modes turned on? Try wiping the cache partition: XIAOMI Mi 4 - Recovery Mode - HardReset.info.", "time": "03-08-2017 08:58 AM", "replies": []}, {"postID": "post5704028", "text": "And all other notifications continue to work normally?\nAny power-saving modes turned on? Try wiping the cache partition: XIAOMI Mi 4 - Recovery Mode - HardReset.info.", "time": "03-08-2017 08:59 AM", "replies": []}]}, {"title": "Prevent Autokill on App", "thread": [{"postID": "post5677403", "text": "Is there an app or Xposed module to lock a specific app in memory and prevent it from being closed by Android?", "time": "02-13-2017 11:58 PM", "replies": []}, {"postID": "post5696474", "text": "Open recent, swype down on an app and lock it!", "time": "03-02-2017 07:15 AM", "replies": []}]}, {"title": "Xiaomi Mi Max", "thread": [{"postID": "post5552614", "text": "Picked up a Xiaomi Mi Max, working great on T-Mobile and AT&T, so far 3g mixed with wifi is moving quickly.", "time": "11-08-2016 07:37 AM", "replies": []}, {"postID": "post5552851", "text": "Me too! I use it often for a back up phone. I'd use it more but the camera KINDA isn't the greatest and it doesn't support my wells fargo app.", "time": "11-08-2016 10:00 AM", "replies": []}, {"postID": "post5553042", "text": "I'm looking to pickup one of these as a backup phone and media consumption device (my main phone is an iPhone 7 Plus but I love having an android phone too). Would you recommend it for this use? Any issues with Google Play Store or Google Apps? and I'm in the states, what's your best advice for obtaining one? I typically buy used phones on Swappa but there's not any Maxes listed ATM and they don't pop up that often. Thanks in advance!", "time": "11-08-2016 11:38 AM", "replies": []}, {"postID": "post5553105", "text": "Got mine on Swappa. GearBest.com was another choice. Big phone, all my apps are running, even gear fit 2. Google play was loaded already, had to add apps one at a time, could not find a way to transfer apps.", "time": "11-08-2016 12:24 PM", "replies": [{"postID": "post5553132", "text": "Thanks for the info. Do you know if yours was running a vendor rom (with lots of bloat) vs an official MIUI rom?", "time": "11-08-2016 12:37 PM", "replies": []}]}, {"postID": "post5554480", "text": "I am running MIUI 7.3 - stable - 7.3.14.0(MBDCNDE) ANDROID VERSION 6.0.1 MMB29M\nNot Sure what it all means, but may try to flash MIUI 8, later", "time": "11-09-2016 09:32 AM", "replies": [{"postID": "post5558358", "text": "thanks for the info. I bought one off swappa and it arrived yesterday. I like it so far.", "time": "11-11-2016 02:58 PM", "replies": []}, {"postID": "post5585145", "text": "Did you flash Miui 8?", "time": "11-29-2016 12:57 PM", "replies": []}]}, {"postID": "post5583976", "text": "Just got one from China. Using it as a daily driver on VZW & Tmobs for a few days to see how it is. My top priority for device is battery and this thing is a beast at 4850mAh. I love how big it is. Allows my big fat fingers to type better. Lol", "time": "11-28-2016 08:09 PM", "replies": [{"postID": "post5634584", "text": "These phones are compatible with Verizon? You tried it and it worked for data and cellular coverage?", "time": "01-07-2017 07:40 AM", "replies": []}]}, {"postID": "post5592991", "text": "Loved the Max so much Just order a Mi Mix. Can't wait!!! Gonna list the Max on Swappa.", "time": "12-04-2016 07:09 PM", "replies": []}, {"postID": "post5603428", "text": "i have a mi max and is great , battery longlast almost all the day depending the use and screen is great resolution and color gamut ,is even better than my laptop and my old ipad mini ,a suggestion update it to MIUI 8 ,camera is nice and good resolution for photos even have manual mode and is great also pano photo is very good", "time": "12-11-2016 05:25 PM", "replies": []}, {"postID": "post5610117", "text": "Not sure how to do it, never rooted/flashed before. Downloaded apps from the internet before, but that's it.", "time": "12-16-2016 10:09 AM", "replies": [{"postID": "post5613188", "text": "I've been looking into this. The Gearbest units come with a custom Rom which won't update automatically. Official ROMs are available for download but you needs to apply to Xiaomi first to get the boatloader unlock permission. Not sure that 8. is that different to 7. More of an issue maybe as and when Nougat comes along.", "time": "12-19-2016 05:45 AM", "replies": []}]}, {"postID": "post5613317", "text": "Just downloaded Nova Launcher Prime 5.0 for $0.99, on sale. It is a great upgrade for the Mi Max, change grid size, download new icons, etc. Lots of options, gives the appearance of Marshmallow.", "time": "12-19-2016 08:36 AM", "replies": [{"postID": "post5614461", "text": "Great app. Used it for years and with its back up facility to cloud it's very easy to migrate your layout to another phone.", "time": "12-20-2016 02:21 AM", "replies": []}]}, {"postID": "post5693210", "text": "Hey guys, is this still a good phone? Found the 4GB 128GB version at geekbuying for $259. How's it?", "time": "02-27-2017 02:32 PM", "replies": []}, {"postID": "post5694949", "text": "It's a great phone. I love mine. I'm on T-Mobile and get LTE speeds. Have not complaints. Very impressed. Plus I like having a device not many people have. It's unique.", "time": "02-28-2017 10:37 PM", "replies": []}, {"postID": "post5695180", "text": "Great phone. But check if it has a Vendor ROM. If so, you will have to do manual ROM updates.....if you want updates. Lot of info on Xiaomi.eu", "time": "03-01-2017 06:40 AM", "replies": []}, {"postID": "post5696179", "text": "Go for it man. Got the 32gb for $178 on AliExpress and I'm living it. Wish I'd give for the 128gb version. It's as high end as phones come.", "time": "03-01-2017 11:15 PM", "replies": []}, {"postID": "post5696470", "text": "Got mine 1 month ago , fantastic device for 225 euro. 3/32 version, grey. Unlocked bootloader and root", "time": "03-02-2017 07:13 AM", "replies": []}]}, {"title": "good sound recording app for xiaomi redmi note 3 phone", "thread": [{"postID": "post5674383", "text": "I would like to be able to have the ability to see the output of my recording and drag the cursor to a particular spot on the recording so I can record over something when I make a mistake.\nhope that makes sense\nThank you in advance", "time": "02-11-2017 01:28 AM", "replies": []}]}, {"title": "Note 4 super deal I found.", "thread": [{"postID": "post5664042", "text": "40% off the MRSPXiaomi Redmi Note 4 Fingerprint 5.5-inch 3GB RAM 64GB MTK X20 Deca-core 4G Smartphone Sale - Banggood Mobile", "time": "02-01-2017 08:12 AM", "replies": []}]}, {"title": "GPS shows no satellites", "thread": [{"postID": "post5619767", "text": "Hi all,\nI have a Xiaomi Mi4 and I recently got screen replacement after breaking the screen. Now, my GPS shows no satellites (P.S. I used GPS Essentials app to check this). Could it be that I somehow loosened up some connections while the phone was open? Any other suggestions would be really helpful.", "time": "12-24-2016 01:11 PM", "replies": [{"postID": "post5619794", "text": "That would be my guess.", "time": "12-24-2016 01:34 PM", "replies": []}]}, {"postID": "post5620189", "text": "Any idea which connection am I looking at?", "time": "12-25-2016 01:29 AM", "replies": [{"postID": "post5620198", "text": "No, I didn't take it apart.", "time": "12-25-2016 01:59 AM", "replies": []}]}]}, {"title": "Xiaomi Mi5s Review | Flagship Which You Want", "thread": [{"postID": "post5618478", "text": "Real flagship on budget, is it possible? Yes it is (and this is not the first time). Model in review is Xiaomi MI5s 3GB RAM & 64GB ROM. In depth analysis with video and photo samples. \nDisplay: 5.15 inch, 1920 x 1080 FHD screen\nCPU: Snapdragon 821 Quad Core 2.15GHz\nGPU: Adreno 530\nSystem: International Edition MIUI 8 ( or MIUI 8 above )\nRAM + ROM: 3GB RAM + 64GB ROM\nCamera: 12.0MP rear camera with PDAF and dual-tone flash light + 4.0MP with f/2.0 aperture front camera\nSensor: Accelerometer, Ambient Light Sensor, E-Compass, Gyroscope, Hall Sensor, Proximity Sensor\nSIM Card: Dual nano SIM \nBattery: 3200mAh\nFeature: GPS / A-GPS / Glonass / Beidou / OTA\nBluetooth: 4.2\nNetwork: \nGSM: B2/B3/B5/B8\nCDMA: 1X/EVDO BC0\nWCDMA: B1/B2/B5/B8\nTD-SCDMA: B34/39\nFDD-LTE: B1/B3/B5/B7\nTD-LTE: B38/B39/B40/B41", "time": "12-23-2016 10:19 AM", "replies": []}]}, {"title": "Xiaomi Mi Max - Questions Before I Buy It", "thread": [{"postID": "post5603819", "text": "I want to buy the Xiaomi Mi Max for T-Mobile in USA in New York City. But before I do I got questions.....\n1) Its not compatible with 4G LTE on tmobile. But its compatible on tmobile's 3G. How fast is it on 3G? Is it good?\n2) I hate MIUI. Can you install Marshmallow, the non-MIUI version? \n3) A review said that video recording wasnt stable. If this is true, is there a fix?\n4) What dont you like about it?\n5) Which is better, this phone or the Doogee Y6 Max?\n6) Will T-Mobile refarm their network to include 4G for this phone?", "time": "12-12-2016 12:28 AM", "replies": []}, {"postID": "post5604223", "text": "The Xiaomi Mi Max will not be fully supported on T-Mobile. Meaning, you will not have LTE and will be limited to the slower 2G network. That’s considering the device you want to purchase is unlocked and will work on T-Mobiles network. Why not consider something else, such as the Moto G4/G4 Plus that does support the network and will have full LTE support? It’s affordable and no need to worry about missing features and you get the stripped down UI and will be close the stock Marshmallow.", "time": "12-12-2016 10:05 AM", "replies": [{"postID": "post5604420", "text": "I need a phone with 6.5 or 7 inch screen size. What do you suggest?", "time": "12-12-2016 12:00 PM", "replies": []}]}, {"postID": "post5604232", "text": "Or the One Plus 3 or 3T, or the Axon 7?", "time": "12-12-2016 10:11 AM", "replies": [{"postID": "post5604420", "text": "I need a phone with 6.5 or 7 inch screen size. What do you suggest?", "time": "12-12-2016 12:00 PM", "replies": []}]}, {"postID": "post5604516", "text": "ZTE Max Pro, or the Sony Ultra Z\nBoth are only 6 though, BUT maybe that's big enough? Best Buy has the Ultra on sale for 299 right now.  Maybe go check it out?\nOOOOO scratch that Amazon has black ones for 269!https://www.amazon.com/Sony-Xperia-U...cUvbUpU5604516", "time": "12-12-2016 12:54 PM", "replies": [{"postID": "post5604549", "text": "Appreciate it but I really need 6.5 inch phone. Do you have other suggestions?", "time": "12-12-2016 01:18 PM", "replies": []}]}, {"postID": "post5605135", "text": "A tmobile rep emailed me the LTE bands that tmobile currently uses for New York City. He said the phone is compatible. Look below at the tmobile bands. Compare those with the bands on the Xiaomi Mi Max, which is linked here:http://www.devicespecifications.com/en/model/4ea93be4\nLet me know you guys think!!!!\nT-mobile network frequencies in New York are:\n2G (GSM)\n4G/3G U2100\n4G/3G U1900\nLTE 2100\nLTE 1900\nLTE 700A", "time": "12-12-2016 11:53 PM", "replies": []}, {"postID": "post5610128", "text": "3G is OK, a strong 3G is pretty quick. If you have a strong WiFi it is quicker. Using T-Mobile and AT&T.", "time": "12-16-2016 10:18 AM", "replies": []}, {"postID": "post5610141", "text": "You probably would get 3G or H+ as they call it, but for sure you won't get LTE, the phone does not have the proper LTE bands.", "time": "12-16-2016 10:37 AM", "replies": [{"postID": "post5610353", "text": "Unless the LTE bands can be unlocked on the phone", "time": "12-16-2016 01:54 PM", "replies": []}]}, {"postID": "post5610200", "text": "Yes, 3G phone/voice and H+ internet. Using it right now. Big phone with a nice big keyboard.", "time": "12-16-2016 11:32 AM", "replies": [{"postID": "post5610356", "text": "So you have the phone on T-Mobile. How's the 3G experience on it? Is it fast enough and do you like the speeds?", "time": "12-16-2016 01:56 PM", "replies": []}]}, {"postID": "post5615231", "text": "It is fast enough to stream Netflix, cruising the internet there is not much of a difference if the signal is strong.", "time": "12-20-2016 04:01 PM", "replies": [{"postID": "post5615460", "text": "The problem with the phone is that stupid MIUI o/s which I consider to be substandard, too simple and too godamn boring. MIUI is to win 95 what MM is to win 10. MIUI is the worst android o/s ever made. I cant stand it. Replacing it with CM is pointless too since its got several bugs, a few being the cam and video record. \nI'll just wait until theres a 6.5 inch phone fully compatible with tmobile without having to go through all those issues that arent guaranteed in the end.", "time": "12-20-2016 08:26 PM", "replies": []}]}, {"postID": "post5618034", "text": "Running Nova Launcher Prime, looks and feels like my Nexus 6P.", "time": "12-22-2016 09:36 PM", "replies": []}]}, {"title": "Different icons in different smartphones?", "thread": [{"postID": "post5592146", "text": "In Xiaomi Redmi 3s prime, all icons are of same shape, within a square box. Whereas in Nexus 5, app icons are as they actually are. Is this because of custom and stock android? Is there anyway I can get Nexus-5-style icons in Xiaomi or any other phones with similar issue?", "time": "12-04-2016 04:37 AM", "replies": []}, {"postID": "post5592947", "text": "Welcome to Android Central! It has to do with Xiaomi's own launcher. Most manufacturers have their own style of launcher and icons. You can always install an alternate launcher like Nova Launcher, and then install one of the many icon packs that are available on the Play Store.", "time": "12-04-2016 06:31 PM", "replies": []}]}, {"title": "App icon", "thread": [{"postID": "post5592149", "text": "In some phones, Xiaomi 3s prime for example, app icons are not exactly they are, rather in a square box. But in Nexus 5, app icons are exactly they are, without any box or other shapes at all. Is it because of custom and stock android difference? Is there any way I can get Nexus like icons in Xiaomi or other phones with similar issue? Thanks!", "time": "12-04-2016 04:43 AM", "replies": []}, {"postID": "post5592279", "text": "Sounds like a launcher-specific thing.\nThere are a number of very good third-party launchers available in the Play store. A couple of very popular ones are:https://play.google.com/store/apps/d...oilsw.launcherhttps://play.google.com/store/apps/d...ddoes.launcher\nAnd, if it will work on your phone, you can try the Google Now launcher; it's the default launcher for the Nexus line:https://play.google.com/store/apps/d...droid.launcher", "time": "12-04-2016 07:50 AM", "replies": []}]}, {"title": "Xiaomi Redmi Note 4 Review | High Dynasty Continuation", "thread": [{"postID": "post5561130", "text": "In sea of good options we have one more offering in 200$ segment. To be honest good options are never bad things. Newest and greatest Xiaomis Redmi Note 4 \nDisplay: 5.5 inch FHD screen \nCPU: Helio X20 2.1GHz Deca Core\nSystem: International Edition MIUI 8 OS\nRAM + ROM: 3GB RAM + 64GB ROM \nExternal Memory: 128GB\nCamera: Back camera 13.0MP with AF and flashlight + front camera 5.0MP \nBattery: 4100mAh\nBluetooth: 4.2\nNavigation: GPS, A-GPS, GLONASS\nSensor: G-sensor, Proximity sensor, Ambient light senor, Hall sensor, Accelerometer\nSIM Card: Dual SIM dual standby, one is micro SIM card, the other is nano SIM card\nNetwork: \nGSM B2/B3/B8 CDMA 2000/1X BC0\nWCDMA B1/B2/B5/B8 TD-SCDMA B34/B39\nFDD-LTE B1/B3/B5/B7/B8 TD-LTE B38/B39/B40/B41(2555-2655MHz)", "time": "11-13-2016 03:04 PM", "replies": []}]}, {"title": "Mi Note 2 Immediate Sell-out", "thread": [{"postID": "post5541138", "text": "Customers can't get enough of this new high-spec device from Xiaomi it would seem:\nXiaomi sells out of the Mi Note 2 in just 50 seconds in Chinahttps://r.tapatalk.com/shareLink?url...0&share_type=b", "time": "11-02-2016 09:57 AM", "replies": []}, {"postID": "post5541216", "text": "Wow, that's a really popular device. I wonder if it will be sold in the US. It says unlikely, but perhaps they will decide to sell it here.", "time": "11-02-2016 10:35 AM", "replies": []}, {"postID": "post5552619", "text": "Would like to pick one up in a few months, looks like a nice phone.", "time": "11-08-2016 07:39 AM", "replies": []}]}, {"title": "Great news for Mi 5 fans in Io India.. rates slashed", "thread": [{"postID": "post5358664", "text": "Good news if you are to buy a Mi 5 ..\nThe rates of the device in India were slashed by ₹ 2000...\nIt's available at ₹ 22,999 now...Mi 5 - Mi India\nPosted via the Android Central App", "time": "08-23-2016 11:51 AM", "replies": []}]}, {"title": "Xiaomi Mi 5 mini-review (real life)", "thread": [{"postID": "post5313310", "text": "Hi everyone!\nI've been using the Xiaomi Mi 5 for the better part of 2 weeks and here's my review. It's been paired with a Moto 360 (2014), running on T-Mobile in the greater NYC area - which included my hometown and my home apartment is known as a dead zone.\nNot doing a full review as some of the ones on YouTube (like C4ETech's) is very comprehensive.\nThe Mi 5 is incredibly light...Samsung Galaxy S2/ Focus S like. Yes, much lighter than a Nexus 5X. So lightweight you don't remember it is a premium device. I originally had this with a clear case which really highlighted how lightweight it was. I upgraded to those dual TPU with hard plastic trim cases and it's added a bit more heft to the phone so it sits much better in hand. I've got the basic white with the 32GB + 3GB RAM model, and since the case itself has black with a silver trim, it does give things a nice visual touch.\nDesign language is nice...glass feels good, phone is narrow and single handed use is good overall. This is a slippery phone so a case is mandatory. It's like someone said \"let's take the Note 5 and shrink it down to the iPhone 5S dimensions\". Still, very nice.\nPros:\n1) Battery life is good. Pairing a 1080P LCD + S820 chip + 3000mah battery was a smart move. I get two days mixed usage, one day solid heavy usage.\n2) 1080P panel is really good. A treat to use. Can get super bright and super dim. I don't miss the Maxx's screen (which as an AMOLED panel is vastly superior...maybe the best panel I've used overall - better than the G4's and a slight step down from the Note 5) as much when using this.\n3) 2016 hardware is fast, no lag...especially when I shut off the system animations. Speed demon indeed.\n4) Solid audio...headphone jack is good enough for me, and button speaker is decent. MIUI has some nice enhancements audio wise that are decent.\n5) Quick charge 2.0 and 3.0 via USB-C. Very fast and convenient.\n6) While I'm not a fan of the fingerprint reader on the front in terms of placement, this is a good one. You need to hold your finger a slight tock longer over the sensor, but once you learn that, very responsive.\n7) Camera in good lighting is good.\nCons:\n1) Lack of appropriate band support. I knew this going in, and wherever I've gotten H+ steadily, it's been good. But I really wish this thing had AWS to give me the full LTE. Data isn't a pain in the *** until you need to do something and drop down to Edge.\n2) I've got the base 32GB + 3GB RAM model. For the price it was offered to me at, I've got no complaints...still, I wish it was the 64GB + 4GB RAM model.\n3) No micro SD. I wish it was a hybrid slot, meaning I could give up one of the sim slots for a micro SD. It would have made the point above much more bearable.\n4) No Qi charging. That would have been nice.\n5) Camera could have been better in low light, since it has OIS. While more usable than the Maxx, low light isn't great here. G4 still bests this, and the 950XL too.\n6) Since I'm using the Chinese ROM retrofitted with Play store apps, it lacks US language support. So some apps don't play nice with this (Chase Bank, for example).\n7) Auto brightness is really aggressive. I love the fact that the panel can get really dim, but every once in a while it does so at the wrong time. Not sure whose battery saver here is more aggressive...the G5 or the Mi 5.\nMeh:\n1) MIUI is an acquired taste. I'm not a fan of how they handle the notification bar by splitting it in two panes, but I've seen worse. MIUI offers lots of granular controls, which is good. Still, there is a learning curve and it's not for everyone. For instance, the RAM management is aggressive. Maybe not Huawei level aggressive, a lot more aggressive than I'm used to. Being the Chinese ROM I had less Google bloat but more Xiaomi bloat.\nWould I recommend this? Yes, provided you can get the full LTE on your carrier. And you get it at the right price. $350 (or under), hell yes as it crushes the 5X and Nextbit Robin easily. At $400 it becomes a harder proposition...if size isn't an issue, then no (especially in the US with the following phones offering full band compatibility). The Axon 7 and OP3 will slay this. I'd even pick the Idol 4S over this too at that price. \nStill, Xiaomi did a very nice job here. I would have been super happy if this had the hybrid slot for more storage and T-Mobile band support. But as it is, I'll continue to use it. It's a really solid device.\nPosted via Xiaomi Mi 5", "time": "08-10-2016 06:42 AM", "replies": []}, {"postID": "post5314919", "text": "Nice review, thanks!", "time": "08-10-2016 05:33 PM", "replies": []}]}]
[{"title": "Xiaomi Mi5 pro or One plus 3", "thread": [{"postID": "post5232797", "text": "Hi all, \nJust ask which you guy preferred mi 5 pro or one plus 3?", "time": "06-20-2016 08:54 PM", "replies": []}, {"postID": "post5232832", "text": "I'd get the OnePlus 3. It seems like it would be more up-to-date for longer with 6gb of ram, and it has a lot of support compared to the Xiaomi.", "time": "06-20-2016 09:32 PM", "replies": []}, {"postID": "post5232857", "text": "Both phones are very intriguing... \nAs I always say, watch unboxing videos on YouTube (especially look for Android Authority) and read online reviews (bear in mind, however, that some people are quicker to post negative reviews about products than establishments than they are to post about positive reviews). Go to the store and try them both out for size! See how they feel in the hand and imagine what it would be like using them in your everyday life. \nLet us know what you decide!\nPosted via the Android Central App", "time": "06-20-2016 10:00 PM", "replies": [{"postID": "post5258603", "text": "Yes of course i already watched a lot of video in youtube,  I just want got more info from user experiences in here", "time": "07-10-2016 08:12 AM", "replies": []}]}, {"postID": "post5291408", "text": "It depends on where you are and your requirements.\nIf you're in the US and need the full band support, the OP3 is the choice. If you want a bigger screen or prefer a full metal design, or easier software support, then you'll pick the OP3.\nHowever, if you need a smaller device, MIUI doesn't bother you, you live in a heavy data coverage area, and you just want something different, the Mi 5 will do.\nPosted via Xiaomi Mi 5", "time": "07-31-2016 09:03 AM", "replies": []}]}, {"title": "Mi 5: Do you agree that it is an incredible phone on many levels?", "thread": [{"postID": "post5015797", "text": "Richard thinks that it is an incredible on many levels. It does seem like a well built device \nXiaomi Mi 5 hands-on: An incredible phone on many levels Xiaomi Mi 5 hands-on: An incredible phone on many levels | Android Central", "time": "02-25-2016 11:57 AM", "replies": []}, {"postID": "post5017269", "text": "Having read about the stuff they've managed to cram into it, and for a relatively low price, I'm inclined to agree. It's regrettable that, as yet, Xiaomi phones are not more readily available in some parts of the world....but that may change. \nPosted via the Android Central App", "time": "02-26-2016 06:33 AM", "replies": []}, {"postID": "post5022176", "text": "It definitely will be the flagship if we compare the specs and the price. Sexy price of smartphone.", "time": "02-29-2016 12:32 AM", "replies": []}, {"postID": "post5151956", "text": "Isn't the Redmi Note 3 a comparable but much cheaper phone? I've ordered one, and it's going to arrive in a few days, can't wait to see how it's like!", "time": "04-29-2016 04:21 AM", "replies": [{"postID": "post5151963", "text": "Do let us know. I'm looking at both of them as comparison too", "time": "04-29-2016 04:36 AM", "replies": []}]}, {"postID": "post5287586", "text": "How is it loudspeaker performance?", "time": "07-28-2016 04:29 PM", "replies": [{"postID": "post5291401", "text": "Seems decent so far. Not as loud as I'd like (and pretty easy to cover up), but is adequate.\nPosted via Xiaomi Mi 5", "time": "07-31-2016 09:00 AM", "replies": []}]}]}, {"title": "Is it possible to buy one in the US?", "thread": [{"postID": "post5170647", "text": "HTC Fumbled my order for the 10 so I'm thinking about looking at other phones. Do you know where I can grab one of these in the US?", "time": "05-10-2016 02:57 PM", "replies": []}, {"postID": "post5286161", "text": "Maybe through eBay.\nPosted via the Android Central App", "time": "07-27-2016 09:26 PM", "replies": []}]}, {"title": "New SMS messages no sound just vibrate", "thread": [{"postID": "post5248030", "text": "When i get a new text message, i am not getting any sounds. It does vibrate.\nSame for Whatsapp messages, no sound just vibrate. However whatsapp calls have a good ringing volume\n1)I have restarted the device\n2) i have gone into settings and changed the ringtone to another\n3) i have changed the themes\n4) in settings > sound and vibration > volumes > all turned up to max\nReally frustrating, any other suggestions?\nThanks in advance for your help!", "time": "07-01-2016 07:03 PM", "replies": []}, {"postID": "post5250062", "text": "Welcome to Android Central! Did you go to the System Settings or the app's own settings? Try going to the app's settings (i.e., open the Messaging app, tap Menu>Settings), and look for the notification options. Try selecting a tone there.", "time": "07-03-2016 05:15 PM", "replies": []}]}, {"title": "Music pauses when my Android phone is upside down. How to turn this feature off in Android 5.1?", "thread": [{"postID": "post5233490", "text": "It turns out to be a really frustrating feature since volume does go down (as well as voice gets a bit muffled) when the phone’s screen is on the top. How can we solve this problem?\nAnd there's no setting option such as \"Motion\" or something like answers 2 or 3 years ago have described.", "time": "06-21-2016 10:05 AM", "replies": []}, {"postID": "post5233744", "text": "Duplicate, please respond here: http://forums.androidcentral.com/xia...oid-5-1-a.html. Thread closed to prevent parallel discussions.", "time": "06-21-2016 12:52 PM", "replies": []}]}, {"title": "Xiaomi Mi4i screen broken and USB debugging is OFF, what can I do?", "thread": [{"postID": "post5206535", "text": "Hi,\nMy Xiaomi Mi4i mobile screen is broken from bottom half of phone and I am not able to select settings--> USB debugging ON which every software need to connect the phone with PC for remote control. I am new to androicentral hence if there is any solution in other thread already - please help me with the link. or if not, please help with the answer - is there any way to enable USB debugging ON when your screen is broken? \nI installed ADB and fastboot but while running adb shell. got the error:\nadb server version (32) doesn't match this client (35); killing...\n* daemon started successfully *\nerror: no devices/emulators found \nC:\\Program Files (x86)\\Minimal ADB and Fastboot>\nWhile retrying after killing old adb.exe running; I got this:\nC:\\Program Files (x86)\\Minimal ADB and Fastboot>adb shell\n* daemon not running. starting it now on port 5037 *\n* daemon started successfully *\nerror: no devices/emulators found\nC:\\Program Files (x86)\\Minimal ADB and Fastboot>\nMy device is connected with USB to PC already\nI installed android SDK also if that would be needed for anything to help on this. \nI am not an android programmer so appreciate if there is any better solution than rooting/flashing the phone etc.", "time": "06-02-2016 09:03 AM", "replies": []}]}, {"title": "Xiaomi Mi 5 hands-on video", "thread": [{"postID": "post5015807", "text": "Android Central did a hands on video of the phone\nWatch our Xiaomi Mi 5 hands-on video from MWC 2016! Watch our Xiaomi Mi 5 hands-on video from MWC 2016! | Android Central", "time": "02-25-2016 12:00 PM", "replies": []}, {"postID": "post5145098", "text": "Looks like it might be a pretty nice device.", "time": "04-25-2016 09:09 AM", "replies": []}]}, {"title": "Xiaomi Mi 5 costs $354 for 128gb", "thread": [{"postID": "post5015813", "text": "Price is great for what you get. \n128GB Xiaomi Mi 5 costs just $354, going on sale in China March 1 128GB Xiaomi Mi 5 costs just $354, going on sale in China March 1 | Android Central", "time": "02-25-2016 12:01 PM", "replies": []}, {"postID": "post5015839", "text": "That IS one sweet price. I wish the S7 line would have had at least half of that memory. I mean, I expected it to be more expensive, but I guess I wasn't expecting the Xiaomi one to be so cheap. Good for them for stirring things up!", "time": "02-25-2016 12:15 PM", "replies": []}, {"postID": "post5060348", "text": "I wish I could get on a pre order for that price. Try $550.", "time": "03-14-2016 05:29 PM", "replies": []}, {"postID": "post5131664", "text": "Same here, In europe at least 580 € for pro version.\nSigh.", "time": "04-18-2016 04:51 AM", "replies": []}]}, {"title": "Record long movies with Xiaomi Mi5. More than 3.5 GB?", "thread": [{"postID": "post5126916", "text": "Hi. I want to record long moives with my Xiaomi Mi5. It divides the movies after about 3.5GB. Any fixes for this?", "time": "04-15-2016 07:35 AM", "replies": []}, {"postID": "post5131518", "text": "Welcome to Android Central! No, unfortunately not. The maximum filesize for a video is 4 GB. Even though Android formats internal storage into EXT4 (which supports files much larger than 4 GB), it appears that video files can't exceed that size, likely due to some legacy code.", "time": "04-18-2016 02:02 AM", "replies": []}]}, {"title": "Mi5 will support LTE bands for all U.S Carriers", "thread": [{"postID": "post5016776", "text": "Here is source:Xiaomi confirms 18 LTE bands for Mi5, compatible with all major US carriers - GSMArena.com news\nI'm seriously considering this being my next phone.", "time": "02-25-2016 08:42 PM", "replies": []}, {"postID": "post5017577", "text": "They've confirmed the bad support:\nFDD-LTE (Bands 1,3,7) \nTD-LTE (Bands 38,39,40,41)\nTD-SCDMA (Bands 34,39)\nWCDMA (Bands 1,2,5,8)\nGSM (Bands 2,3,5,8)\nCDMA1X/EVDO (Band BC0)", "time": "02-26-2016 09:40 AM", "replies": []}]}, {"title": "Xiaomi Mi 5 specs", "thread": [{"postID": "post5015787", "text": "Specs look pretty good for the price. \nXiaomi Mi 5 specs Xiaomi Mi 5 specs | Android Central", "time": "02-25-2016 11:54 AM", "replies": []}, {"postID": "post5016857", "text": "Yes, they do. Almost seem to be somewhat competing against Samsung.", "time": "02-25-2016 09:39 PM", "replies": []}, {"postID": "post5017270", "text": "That home button reminds me of something, too. \nPosted via the Android Central App", "time": "02-26-2016 06:36 AM", "replies": []}, {"postID": "post5017574", "text": "I don't think this phone will have a MicroSD slot. It does have dual SIM, however.\nAlso, the colors coincide with the storage options. Black is 128GB with ceramic back cover. And it weights 10g more.", "time": "02-26-2016 09:40 AM", "replies": []}]}, {"title": "Xiaomi Mi 5 OIS shakes it off against the iPhone", "thread": [{"postID": "post5015804", "text": "This is a good video of the phone's camera. \nXiaomi Mi 5 OIS shakes it off against the iPhone Xiaomi Mi 5 OIS shakes it off against the iPhone | Android Central", "time": "02-25-2016 11:59 AM", "replies": []}, {"postID": "post5016861", "text": "Impressive. Hardly any movement in the shot from the Xiaomi at all.", "time": "02-25-2016 09:41 PM", "replies": []}, {"postID": "post5017274", "text": "That's a very self-confident manufacturer who can take on the iPhone's famously excellent photographic abilities. Has Xiaomi done it?\nPosted via the Android Central App", "time": "02-26-2016 06:39 AM", "replies": []}]}]
