[{"title": "Group messaging stopped in mms, setting has gone", "thread": [{"postID": "post6192350", "text": "Woke up this morning and am unable to send group mms in standard messaging app. Gone to settings and the option for group messaging is simply not there. Has been working fine. Phone is Nokia5. Individual mms works fine but on group, phone throws a message about changing settings, but there is no setting there.", "time": "03-15-2018 05:36 PM", "replies": []}]}, {"title": "How can i lower the noise gate/ noise reduction on new nokia 5", "thread": [{"postID": "post6189563", "text": "I am a musician and I like to use my phone to record musical ideas that i get. I have a new nokia 5 phone with anroid 8 OS and i find that the noise gate/noise reduction on the phone really interferes with my recordings. Is tgere a way to adjust the noise reduction so that this doesn't happen? Thanks for any help.", "time": "03-13-2018 05:56 PM", "replies": []}]}, {"title": "Nokia 5 SD Card is not shown on PC after adopting it as internal storage", "thread": [{"postID": "post5943167", "text": "Hi there everyone,\nI was using Lumia 520 before this and only recently I've bought Nokia 5 (16GB storage) installed with Nougat Android 7.1.1 so I'm kind of new in using Android based OS. It's also updated with Android security patch of August 1, 2017.\nSince half of the internal storage already taken by the OS,I'm left with the other half remaining which resorted me to buy a 32GB microSD card (Sandisk Ultra C10). At first, I was using it as portable storage to put picture,video etc. But after knowing I'm capable of transferring app from internal > sd (after formatting it as internal), I thought I might give it a try to save more internal space. Back-up my SD card data onto and then format it as internal. After done with the formatting, I turn off my phone and open it back. I can still see both my internal storage and SD card is detected on the phone screen Setting>Storage.\nThe problem comes when I plugged in the USB to my PC but only the original internal storage is seen and not the formatted SD card which makes me unable to transfer the backup data back. I've read about this kind of problem from lots of forum/web and try few of the following methods but none seems to be working:\n1) Deleting the data and cache of External Storage and Media Storage (System App) and then reboot it.\n2) Clear cache partition in the recovery mode.\n3) Change USB option from 'MTP' to Charging while USB was connected to the computer, then while still connected, change the USB option back to MTP.\nWould appreciate if someone could help me fix this problem.\nThank you.", "time": "08-28-2017 02:21 PM", "replies": [{"postID": "post6168233", "text": "", "time": "02-21-2018 07:57 AM", "replies": []}]}, {"postID": "post5995990", "text": "Any luck yet? I just plugged in the sd card and before choosing which option 1-as internal storage 2-for media, i decided to google it first. \nSo what happened with you ?", "time": "09-27-2017 11:48 PM", "replies": []}, {"postID": "post6168236", "text": "Still the problem exists.... how to resolve the same... can anyone help me..", "time": "02-21-2018 07:58 AM", "replies": []}, {"postID": "post6168252", "text": "I’ll move this to the Nokia 5 forum.", "time": "02-21-2018 08:24 AM", "replies": []}]}, {"title": "Why don't some apps download on my SD-card? (Nokia 5)", "thread": [{"postID": "post6148934", "text": "I've formatted my SD-card as internal, but not all of the apps that I download can be downloaded on the card. And if I go to the app there is no option to change the directory, though they aren't essential apps for the system. Apps like these are for example: OneDrive, OneNote, Reddit, Spotify, Steam, WhatsApp and the list goes on. Why is this?", "time": "01-29-2018 02:56 PM", "replies": []}, {"postID": "post6149865", "text": "If you format the card as internal, Android decides what goes where. As for changing the directory, downloads go to Download. Always. And apps are installed to wherever Android installs them. (But you have more storage now, so you can download more and install more.) You don't logically have an \"external SD card\" any more, it's just storage tacked on to the existing storage in the phone. If you want a separate \"card\", format it as external.\n(The whole reason for adoptable [internal] storage was for the cheap 8GB phones coming out in the past couple of years - to effectively add more \"internal\" storage. If your phone has 32GB or more of internal storage, the card should be formatted as portable or external.)", "time": "01-30-2018 01:08 PM", "replies": []}]}, {"title": "Duplicate contacts", "thread": [{"postID": "post5922939", "text": "I have got Nokia 5 with Nougot 7.1.1. The system is very fast but only thing getting on my nerves is everytime I search for contacts, its showing double the times. Even though I have selected customize view for the same. \nAlso, please help me to save my contacts on my device not on Google.\nThe only option in save is \"Google account\"\nThanks in advance.", "time": "08-14-2017 03:45 AM", "replies": []}, {"postID": "post5922958", "text": "Saving on Google Account saves to both device and is backed up to Google. If you make it to not save contacts to Google, in the event your device suffers an accident, contacts may be lost and irrecoverable. Saving to Google means that if you buy a new phone and sign in your Google account, the contacts from the old phone are automatically downloaded. \nAs for the duplicates, do you know where the duplicates reside? Normally they appear because you have it saved on the phone on multiple locations (i.e. SIM, a second account etc).", "time": "08-14-2017 04:47 AM", "replies": []}, {"postID": "post5923030", "text": "I also got the N5 over the weekend and yesterday I also observed this. It doubled my Google/Phone contacts and that of those with WhatsApp.", "time": "08-14-2017 07:32 AM", "replies": [{"postID": "post5923083", "text": "I forgot to mention in my previous reply. \nOpen the contacts app>menu>settings>merge duplicate contacts.", "time": "08-14-2017 08:35 AM", "replies": [{"postID": "post5923565", "text": "Thanks, but I cant see that option :-(", "time": "08-14-2017 05:03 PM", "replies": [{"postID": "post5928657", "text": "Open contactas app -> 3bar menu -> suggest/suggestions and there is the optione to merge duplicated contacts.", "time": "08-19-2017 11:46 AM", "replies": []}]}]}]}, {"postID": "post5928663", "text": "There should also be an option to only view one set of contacts; phone, SIM, Google, etc. I personally have not had good results from merging duplicates.", "time": "08-19-2017 11:51 AM", "replies": []}, {"postID": "post5930538", "text": "Thanks for all the help but I just decided to delete the whatsapp contacts, now the whatsapp option is integrated with the google contact (as displayed). Thanks.", "time": "08-21-2017 08:32 AM", "replies": []}, {"postID": "post5979118", "text": "I have same problem, it's in dialler not in contacts, seems to be what's app adding to the dialler contacts for any that have a what's app account in your contacts list, can't get rid of em. Surely someone knows why this is happening on Nokia phones? I have Nokia 5.", "time": "09-17-2017 01:10 AM", "replies": []}, {"postID": "post5979124", "text": "Can anyone help fix this issue?? Really annoying. Thanks", "time": "09-17-2017 01:18 AM", "replies": []}, {"postID": "post6138555", "text": "Go to contacts >settings>contacts to display >select customize > then u select account you want to display \nHope this solves the problem. I tried and succeeded in my Nokia 6", "time": "01-17-2018 09:39 AM", "replies": []}]}, {"title": "How to turn off end of call beep in Nokia 5", "thread": [{"postID": "post6053222", "text": "There is a somewhat loud beep at the end of a call in Nokia 5, I have searched for settings to turn it off to no avail. Can anyone help here?", "time": "11-04-2017 03:56 AM", "replies": []}]}, {"title": "Questions from a Luddite about space (Use of Micro SD for apps / photos)", "thread": [{"postID": "post6045351", "text": "Apologies for the daft questions but here we go:\nI purchased a Nokia 5 and a SanDisk Ultra 64 GB Memory Card.\nMy first numpty question - can the memory card be used for photos and apps? I'm assuming not because when I formatted for photos, I can't move apps to the Micro SD as there's no options under Storage on the app. However when I changed the format of the disc for apps, when I tried to take a photo, I got an error message saying \"insert SD card.\" \nI can then only guess the ideal workaround then would be to change the photo settings so they save on the phone, and store the photos in the cloud but again I can't seem to be able to change the default phone settings.\nInsight would be greatly appreciated. Thank you!", "time": "10-30-2017 06:08 AM", "replies": []}, {"postID": "post6047695", "text": "You’re right in deducing that adapted storage is for apps, portable is for photos/other data. Not many apps (if any) will go on portable. With adopted storage, the phone treats the card as an extension of its own memory. And everything is encrypted, so that the particular phone it was formatted in will be the only thing that’ll ever be able to access anything on the card (so something to think through!). I’m not familiar with Nokia phones (mine’s a Motorola), but I think this applies to all phones.\nIn mine, moving existing data (e.g. photos) from the phone’s own memory to SD card is done by fetching them from the SD card, in the phone settings under Storage. And telling the camera to store photos automatically on the SD card is done from within the camera app. If your camera’s not recognising the SD card, maybe you didn't tell it to save to internal memory? In which case it’ll still be expecting a card formatted as portable.\nCloud storage? Yes. If nothing else, because the more backup methods the better (and cloud storage is a painless one, as it can be set to happen automatically). Like everything else computer related, the best place to start is to decide what you want to achieve, and then on what scale (then double it!). Then it’s horses for courses with choosing one (or more) of the options out there. For instance, Google Drive storage is the most direct one with Android and plays nicely with the other software, and Flickr is a good one to consider for photos (I use both).\nIt doesn’t sound as if you’ve done much research re the things you want to learn about. I recommend it - there's so much how-to and explanatory stuff out there. I was new to smartphones, touchscreens and Android when I got this phone 2 years ago, and only started using it for anything except calls, texts and camera a year or so ago, since when it’s been standing in as my only computer. In my remote location the search bar’s been my chief teacher (and a fast one!). Android's Central's a great place to start (on the other hand, the wider web can sometimes get more results re topics that aren't Android specific such as this one).\nI think the title of your topic is good (about as specific as you could get in the length), but to get more responses you need more details about your setup, what you’re trying to achieve and what you’ve tried so far. There’s a lot of expertise and helpfulness in these forums, but they’re busy ones, and most people just don’t have the time for asking a lot of questions before they can help.", "time": "10-31-2017 04:48 PM", "replies": []}, {"postID": "post6050440", "text": "Thanks for the feedback on my post. Just a shame it couldn't have helped me resolve this issue esp around the problems I had with adaptive storage and the apps. I really didn't need to be told how to move apps and photos! I have been trying to do it and it's not working.", "time": "11-02-2017 12:51 PM", "replies": []}]}, {"title": "Nokia 5 very-initial impressions", "thread": [{"postID": "post5871705", "text": "Well, while waiting for the Nokia 6 to arrive so that I can purchase one, I found a Nokia 5 in-store, so I decided to play with one and see what all the fuss is about. Here are my initial impressions based on my pretty short time with the device.\n· Build quality at first glance is pretty dang good. It's a metal chassis all around, and it really does feel nice, and the device also has a reasonable amount of heft that adds to that solid feel. I personally don’t like thin devices made out of glass and feel overly light, and the Nokia reinforces my thought. It really does feel nice.· Now, this won’t win the “slimmest top and bottom bezel” award since they are pretty chunky, actually chunkier than what I would’ve preferred. But at the very least, there are capacitive buttons alongside a fingerprint sensor on the chin, so that space is at least used, even if the fingerprint sensor itself is strangely small.\n· The 5.2” display is a 720p IPS LCD and for a budget phone, it’s par for the course. Brightness is reasonable and colors are accurate, but contrast is a tad on the low side, although since I was in a store that had some harsh lighting, I would have to try it out again sometime to verify my thoughts.\n· The phone runs Android 7.1.1 Nougat and….that’s about it. Aside from some Nokia tweaks and a different camera app, it’s pretty much close-to-stock, which should make those looking for a Nexus-like experience on a budget pretty happy.\n· The specs are also typical for a phone at this tier, at least in some markets. It’s powered by a Snapdragon 430 backed up by 2GB of LPDDR3 RAM. Because it’s running on a relatively lean build of Android, performance is more than adequate in terms of daily use. It’s obviously a tad slower and more prone to hiccups than my flagship Moto Z, but for the usual texting, browsing and calling, it’s more than adequate, and based on my experience using the backup phone I have, which incidentally has the exact same processor and RAM combo, battery life should also be very good due to its lower power use, although a 14nm process would’ve helped further.\n· And then we come to the camera. I didn’t use the selfie camera since I do not take selfies regularly, if at all. The 13MP sensor has PDAF and an approximate pixel size of 1.12 microns, making it a 1/3” sensor, and has an aperture of f/2.0. In good lighting, the camera is capable of some solid photos with good amounts of detail and sharpness, although make no mistake, this is obviously no PureView. When the light goes down, the lack of hardware stabilization is made more obvious, and you’d need a bit more effort to get a steady shot. The first indoor shots I took looked a tiny bit soft until I properly stabilized it. That said, the focus is pretty darn quick. For $189, it is a capable camera, although one that also needs the user to know its limits. \n· The camera app is a tad confusing at first. While it is very familiar to the Google Camera, the one that I’ve been using for a while, it certainly wouldn’t hurt to add exposure compensation for automatic modes, at least one that I could find. Haven’t tried the manual controls yet, though.\n· Oh yeah. The buttons. Nobody mentions them often, but they are very clicky. Certainly a nice touch.\nAt $189, this is going up against phones like Samsung’s Galaxy J5/J5P, BBK’s Vivo Y55 in some markets, alongside the standard Moto G5 and a slew of Chinese competitors that offer similar specs for less or beefier specs for the same price or a little more.\nThe Nokia 5’s spec list isn’t going to impress anyone, and its featureset is definitely on the lean-side compared to some of the aforementioned competition. However, what Nokia does deliver on is a very solid handset that has very solid build quality, an Android experience that purists will definitely like and the promise of speedy Android updates, where it is even mentioned on marketing material.If specs are your primary concern, then offerings from companies like Xiaomi are bound to be up your alley. But if you like a pure Android experience and prioritize the overall experience and timely updates, I think Nokia might have a chance. Here’s hoping HMD can refine that Nokia recipe for future devices, especially the flagship.", "time": "07-03-2017 07:31 AM", "replies": []}, {"postID": "post5871986", "text": "Nice writeup! How slippery is the metal back?", "time": "07-03-2017 12:13 PM", "replies": [{"postID": "post5872467", "text": "It has a satin-like finish, so it's not too slippery.\nPersonally, I'd go for the 6. It's only a little bit more but you get quite a bit in return. Personally, I'm interested to see how HMD lives up to its widely-touted Android update promise.", "time": "07-03-2017 07:40 PM", "replies": []}]}, {"postID": "post5872834", "text": "Really like the write-up.\nMy thoughts after talking to people in China is that HMD/Nokia are keeping up with the updates currently and with a promise of \"O\" in the future and high end phones coming they look as if they are back in the game again.\nRegards\nInfinidim", "time": "07-04-2017 05:07 AM", "replies": [{"postID": "post5873101", "text": "Yeah, HMD is keeping their promises so far.\nI hope it holds up. I really want to like their phones because in terms of build quality, they are really giving a positive impression, especially since Nokia phones were known for being as tough as a brick back in the day.", "time": "07-04-2017 10:57 AM", "replies": []}]}, {"postID": "post5992458", "text": "The camera is actually pretty crappy and it's not the hardware's fault. I have a Nokia 5 and it's a good phone if you can get it for less than the 200€ it sells for here in Europe. But it's nowhere near as good as it should be.\nThe camera problem, however, can be fixed by the user...by installing another camera. I've sideloaded the Pixel camera apk from XDA (yes, it works on the SD430) and here's the result.\nTop picture is taken with the stock camera, HDR on, focus on the Nokia logo.\nBottom is taken with the iPixel camera, HDR+ on, focus on the Nokia logo.\nNot only it produces a much better photo, it's also a hell of a lot faster to take and save the photo. This showed me clearly that HMD has a LOT of work to do in the software department.", "time": "09-25-2017 04:48 PM", "replies": []}, {"postID": "post6042494", "text": "Where did you find this camera app? Can you post a link? I found several with the same name. \nThanks", "time": "10-28-2017 05:44 AM", "replies": []}, {"postID": "post6043793", "text": "Tend to agree with DJCBS, the camera does need a bit of work done on it which I am sure that HMD / Nokia will be doing.\nRegards\nInfinidim", "time": "10-29-2017 08:10 AM", "replies": []}, {"postID": "post6043795", "text": "Tend to agree with DJCBS, the camera does need a bit of work done on it which I am sure that HMD / Nokia will be doing.\nRegards\nInfinidim", "time": "10-29-2017 08:11 AM", "replies": []}]}, {"title": "I NEED TO SILENT POWER OFF/ON SOUND when I open my phone", "thread": [{"postID": "post6041663", "text": "How to silent Nokia android 5 power off/on sound", "time": "10-27-2017 01:37 PM", "replies": []}, {"postID": "post6041775", "text": "Not sure how the Nokia works, but on some phones if you set your phone to Silent or Vibrate before you turn it off, it'll respect that when turning it back on. It also depends on the carrier.", "time": "10-27-2017 03:08 PM", "replies": []}]}, {"title": "Often received call goes on mute on Nokia 5 (Android 7.1.1)", "thread": [{"postID": "post6019256", "text": "Often when I receive a call, after a half or one minutes my mic goes on mute. It is only happened when I received the call so far. When this happens, I have to unlock the phone, and select the ongoing call which is somehow gone to the background, and it is automatically unmuted.", "time": "10-14-2017 11:50 AM", "replies": []}, {"postID": "post6019667", "text": "Welcome to Android Central! When it goes on mute, can you still hear the other person?\nThis is with regular calls, and not with some kind of VoIP calling service, right? Any power-saving modes turned on, or 3rd party power-saving apps installed?", "time": "10-14-2017 05:03 PM", "replies": []}, {"postID": "post6020282", "text": "Regular calls, no VoIP and any power saving mode or program. I think that would be a very stupid problem, I suspect I grip the phone wrong, and sometimes the back and the mute buttons gets pressed…", "time": "10-15-2017 04:26 AM", "replies": []}, {"postID": "post6020555", "text": "Hmm, that's possible. Let us know if the problem persists after you modify your grip.", "time": "10-15-2017 10:26 AM", "replies": []}, {"postID": "post6029189", "text": "Somehow I touched the back and the mute buttons simultaneously. Now everything is OK. I do not understand nonetheless, because the proximity sensor switches off the screen, so it shouldn't be a problem that I touch the edges of the screen.", "time": "10-20-2017 11:34 AM", "replies": []}, {"postID": "post6030196", "text": "Do you habitually hold the phone a bit far from the ear? If you do that intermittently, it might cause the screen to wake up just long enough for you fingers to cause the buttons to press.", "time": "10-20-2017 09:45 PM", "replies": []}, {"postID": "post6033552", "text": "Yeah, it could be. I bought a cover and I hold the phone a bit different, and it has not happened for a week now. Thanks for the help!", "time": "10-23-2017 03:27 AM", "replies": []}]}, {"title": "Android 7.1.1 - widgets gone", "thread": [{"postID": "post5922031", "text": "I´ve got a new Nokia 5 phone with android 7.1.1.\nI´ve installed some apps, a launcher, set up a few widgets - and then made the worst thing I could: rebooted the system. Since then no widgets are able to run anymore, not even after another restart (another 5 to be honest).\nI´ve returned the system to factory settings and not even after that am I able to see (for example the DEFAULT clock widget) any useful widgets (not talking about some \"shortcut widgets\" that are actually included) in the menu.\nWhat is this? Is it just some system update bug?", "time": "08-13-2017 03:07 AM", "replies": []}]}, {"title": "Nokia 5 interest?", "thread": [{"postID": "post5695279", "text": "Is there anyone who is interested in picking up a Nokia 5? It seems like it might be a good inexpensive daily driver, or a very solid backup.", "time": "03-01-2017 08:12 AM", "replies": []}, {"postID": "post5696884", "text": "In the mid-range category, I don't think it's possible to get any better than the Nokia 5 and 6. A fluid, stock Android experience paired with build-quality you won't even find on most flagships, let alone mid-rangers.", "time": "03-02-2017 01:15 PM", "replies": [{"postID": "post5848955", "text": "Its quite possible. Moto G5 is $180 and has better specs. \nNokia 5 has been launched for 13000 which is approx $200 which is more expensive than Moto G5 while having inferior specs and no marketing. \nAlso there's Redmi 4 and Redmi Note 4 which are even better and even cheaper.", "time": "06-13-2017 08:23 AM", "replies": []}]}]}, {"title": "Coming to America?", "thread": [{"postID": "post5694646", "text": "Well, not really the movie, but I'm hoping this device makes it's way to the US. I think this device will put Nokia's name back in cell phones. The one everyone talks about...the one everyone wants.", "time": "02-28-2017 05:17 PM", "replies": []}, {"postID": "post5696594", "text": "I made an error when I created this thread. I missed an article on AC that stated all 3 devices announced at MWC would be available globally: http://www.androidcentral.com/nokia-...ching-globally", "time": "03-02-2017 09:16 AM", "replies": []}]}, {"title": "Nokia 5 availability", "thread": [{"postID": "post5696591", "text": "I somehow overlooked this the other day, but Nokia has announced that all 3 phones appearing at MWC will be sold globally.Nokia is back with three new Android phones, launching globally! | Android Central", "time": "03-02-2017 09:15 AM", "replies": []}]}, {"title": "Nokia 5 specs", "thread": [{"postID": "post5695329", "text": "From the blog: Hands on with Nokia's new Android phones: the 3, 5, and 6 | Android Central\nCPU: Qualcomm SD 430\nRAM: 2 GB\nStorage: 16 GB\nScreen: 5.2\" IPS LCD 1280x720\nCamera: 13MP f/2.0 1.12um pixels\nBattery: 3000 mAh\nCharging port: Micro USB\nOS: Android \nSpecs from GSM Arena: Nokia 5 - Full phone specifications\nOS: Android 7.1.1\nExpandable storage to 256 GB.", "time": "03-01-2017 08:49 AM", "replies": []}, {"postID": "post5695579", "text": "The thing I'm most impressed about is the OS. Android 7.1.1 out the box. Great to see. Having a nice 5.2\" screen will make split screen look great.", "time": "03-01-2017 12:07 PM", "replies": []}, {"postID": "post5696546", "text": "The most updated version of Android is good to see. Glad to see Nokia doing that.", "time": "03-02-2017 08:33 AM", "replies": []}]}, {"title": "Is 720p okay?", "thread": [{"postID": "post5694394", "text": "I'd have been happy to pay more for a 1080p device.", "time": "02-28-2017 01:29 PM", "replies": [{"postID": "post5695683", "text": "1080p definitely keeps the screen looking really good. Obviously the 720p decision was a cost decision to try get the phone out to as many potential buyers. Which might be a good idea just to get first time customers and then you can slowly increase the price. \nI think if you have a good quality panel, 720p can look good.......Yeah, it's tough. 1080p wouldn't have cost that much more, maybe $49? \nFor the 'average' person. I think they will still be happy \nA droid a day keeps the Apple away", "time": "03-01-2017 02:05 PM", "replies": []}]}, {"postID": "post5694418", "text": "On 4.7\" screens I didn't mind 720p. On 5.2, not sure you can get away with that. Guess we'll see?", "time": "02-28-2017 01:50 PM", "replies": []}, {"postID": "post5694477", "text": "This is probably one of the factors that helped get the price point. It's tough to say whether this was a good move or not.", "time": "02-28-2017 02:43 PM", "replies": []}, {"postID": "post5694708", "text": "Yes, the 312ppi LCD display of my 720p 4.7\" Lumia 550 has almost all the sharpness you could wish for in ordinary use. You can see pixels if you look hard, but in ordinary use, you don't look hard.", "time": "02-28-2017 06:10 PM", "replies": []}]}, {"title": "The Nokia 5", "thread": [{"postID": "post5694315", "text": "The second Nokia device is the Nokia 5. A step up from the 3, The display, CPU and battery are given an upgrade. A 5.2\" display, a Snapdragon 430, and a 3,000 mAh battery.\nThe announced price is 189 Euros, and converting that to USD, makes it about $200. All in all, I think this may be a pretty good bundle for what you pay. Quite possibly the most cost effective choice.\nFrom the blog: Hands on with Nokia's new Android phones: the 3, 5, and 6 | Android Central", "time": "02-28-2017 12:32 PM", "replies": []}, {"postID": "post5694384", "text": "Of the three devices this is the one that most appeals to me. The size is good - though I personally would have preferred something a touch smaller - and the FPS on such an inexpensive device is very welcome. 1080p at a higher price would have been nice, but nevertheless there's a high likelihood that I shall be buying when available. Looking forward to it.", "time": "02-28-2017 01:26 PM", "replies": [{"postID": "post5694480", "text": "I think 5.0 would have been ok, especially if the 3 was a 4.5\" line.", "time": "02-28-2017 02:45 PM", "replies": []}]}]}, {"title": "Is this the one?", "thread": [{"postID": "post5694375", "text": "I think this may be the phone to bring Nokia to the Android world. They have the name recognition and the price for what is in it seems well balanced.", "time": "02-28-2017 01:20 PM", "replies": []}, {"postID": "post5694381", "text": "Do you know what countries this will be sold in?", "time": "02-28-2017 01:22 PM", "replies": []}, {"postID": "post5694479", "text": "I don't recall seeing anything on the blog, but I may be wrong. Hopefully, these will all be a world wide release.", "time": "02-28-2017 02:44 PM", "replies": []}]}, {"title": "Nearly Pure Android", "thread": [{"postID": "post5694401", "text": "For those of us who like vanilla, Nokia's decision will be welcome. They've done sone stuff to the Camera, but then, being Nokia, that's very probably good.", "time": "02-28-2017 01:35 PM", "replies": []}, {"postID": "post5694476", "text": "For Nokia to get into Android, leaving the OS to be more like a Nexus/Pixel is probably a good move. One less thing they have to be concerned over.", "time": "02-28-2017 02:42 PM", "replies": []}]}]
