[{"title": "Is anyone having problems getting Waze or Maps to work on Android Auto using their Honor 7X", "thread": [{"postID": "post6186638", "text": "Everytime I connect my Honor 7X to my head unit in my car I'm unable to activate Waze or Maps, does Huawei / Honor do things differently? I have a Pioneer AVH-2300NEX. Waze and Maps work on the phone when not connected to the Pioneer, when connected Android Auto appears but unable to press navigation icon on Pioneer screen.\nNo problem with other smartphones, Alcatel Idol 3, Nexus 4, Xperia Z Ultra.", "time": "03-11-2018 04:32 PM", "replies": []}]}, {"title": "Red Honor 7x Now Available!", "thread": [{"postID": "post6155272", "text": "http://forums.androidcentral.com/e?l...token=x94XUOuP", "time": "02-05-2018 05:39 PM", "replies": []}, {"postID": "post6155840", "text": "When will these be available via amazon? Looks like all the 7x's on amazon's site are back ordered as well.", "time": "02-06-2018 09:03 AM", "replies": [{"postID": "post6158756", "text": "Red is limited only available at hihonor.com\nNo word if it will come to Amazon.", "time": "02-09-2018 01:45 PM", "replies": []}]}, {"postID": "post6164588", "text": "Wow! That looks pretty snazzy!", "time": "02-16-2018 07:58 PM", "replies": []}, {"postID": "post6178533", "text": "Too bad, since Valentine's day, I've been trying to get the red version here in Canada. Honor doesn't have a functional Canadian website to sell to Canadians, US site doesn't ship up here. missed a couple of great sales discounts too (Chinese New year & Christmas period). I ended up waiting for the Amazon US and ordered last week. Just got my blue version, only wish the red was available to Canadians!\nHuawei / Honor is missing out on the Canadian market.", "time": "03-04-2018 05:51 AM", "replies": []}]}, {"title": "Does anyone know how to stop led indicator from glowing while charging in honor 7x?", "thread": [{"postID": "post6147682", "text": "I have a problem with led indicator. At night I mostly use my phone while it's getting charged. While my honor 7x is getting charged the led indicator is on. It's so annoying. Can anyone know how to stop this led from glowing?", "time": "01-28-2018 04:53 AM", "replies": []}, {"postID": "post6148651", "text": "I couldn't find anything that would work. It's not bright at all and a really small led. I don't find it bothersome and I keep my phone plugged in on my night stand next to my bed.", "time": "01-29-2018 09:10 AM", "replies": []}, {"postID": "post6170640", "text": "I have been looking for a solution to this issue as well, hope OP found an answer - still looking myself.\n@dby2011 it's not about that, it's about not being able to see whether you have notifications or not, if it's constantly on while charging.\nI want to be able to tell by a glance whether I have a notification or not (especially while my phone is away charging).", "time": "02-23-2018 10:24 PM", "replies": []}, {"postID": "post6178343", "text": "Welcome to Android Central! I know this is an older thread, but I too sometimes find the charging LED light to be annoying and cumbersome. Since I always charge my phone at night, I turn it upside down so I don't see the LED as prominently.\nI am unsure if this is the kind of \"feature\" that can be turned off... I think it is more of a system/software setting than anything else.", "time": "03-03-2018 08:53 PM", "replies": []}]}, {"title": "OS and security versions", "thread": [{"postID": "post6123809", "text": "Happy New Year, everyone!\nWhat are the current OS and security patch versions on the Honor 7X?", "time": "01-01-2018 08:45 AM", "replies": []}, {"postID": "post6135532", "text": "Happy New Year to you, too!\nAccording to GSM Arena, the Honor 7X ships with Android 7.0 (Nougat) out of the box; with a Kirin 659 processor. Not sure about its security patch, however.", "time": "01-13-2018 05:48 PM", "replies": [{"postID": "post6135533", "text": "Here is the link to GSM Arena's spec sheet of the Honor 7X, if you are interested:https://m.gsmarena.com/huawei_honor_7x-8880.php", "time": "01-13-2018 05:49 PM", "replies": []}, {"postID": "post6160711", "text": "Just to further clarify, Android 7.0 was released on August 2016", "time": "02-12-2018 04:19 AM", "replies": []}]}, {"postID": "post6136057", "text": "Mine says the following: Build number BND-L24C567B130, EMUI version 5.1, Android version 7.0, Android security patch December 1, 2017", "time": "01-14-2018 11:35 AM", "replies": [{"postID": "post6136075", "text": "Thanks for posting that!", "time": "01-14-2018 11:58 AM", "replies": []}]}, {"postID": "post6136842", "text": "Build no BND-AL10C675B101\nEmui version 5.1\nAndroid version 7.0\nSecurity patch 5 Oct 2017", "time": "01-15-2018 09:23 AM", "replies": []}, {"postID": "post6136843", "text": "I wonder why mine is on October security patch", "time": "01-15-2018 09:23 AM", "replies": [{"postID": "post6136845", "text": "Your phone was purchased online, I'm assuming (ie, from Honor or Amazon)?", "time": "01-15-2018 09:25 AM", "replies": []}, {"postID": "post6136876", "text": "Did you buy the US version or an international version? Regional differences could play a role in the rollout of software and security updates.", "time": "01-15-2018 10:09 AM", "replies": []}]}, {"postID": "post6137017", "text": "I purchased 7x from Amazon India. It is Indian retail version.", "time": "01-15-2018 12:44 PM", "replies": []}, {"postID": "post6137501", "text": "Just got January 1, 2018 Android security patch", "time": "01-16-2018 01:02 AM", "replies": [{"postID": "post6137590", "text": "Very good! I hope it makes it to the US soon!", "time": "01-16-2018 05:44 AM", "replies": []}, {"postID": "post6137662", "text": "Awesome! That's great!", "time": "01-16-2018 07:50 AM", "replies": []}, {"postID": "post6139202", "text": "", "time": "01-17-2018 11:45 PM", "replies": []}]}, {"postID": "post6137702", "text": "Just ordered a US Honor 7x to play with. Should be here by the end of the week. I'll report what version I end up getting. From my research online there appears to be different versions of software depending on what region your phone is in.", "time": "01-16-2018 08:43 AM", "replies": [{"postID": "post6137710", "text": "That's so exciting - congratulations! Yes, let us know your version number, and also how you are liking you phone! Happy Phone Week!", "time": "01-16-2018 08:56 AM", "replies": []}, {"postID": "post6137861", "text": "I got two 7x purchased from Honor USA official online store. Both came with Nougat 7.0 and November 6 security patch", "time": "01-16-2018 11:26 AM", "replies": [{"postID": "post6137885", "text": "That should update to the December patch immediately (at least mine did).", "time": "01-16-2018 11:44 AM", "replies": [{"postID": "post6137915", "text": "Mine just says there's no updates.\nNot sure if that's the reason, by mine don't have SIM cards yet.", "time": "01-16-2018 12:08 PM", "replies": []}]}]}]}, {"postID": "post6161753", "text": "I have the US version and just got an update today. It now has Feb 2018 security update and it added AR to the camera. No face unlock yet", "time": "02-13-2018 12:11 PM", "replies": [{"postID": "post6161830", "text": "Cool! I'm impressed that the security update was released so quickly!", "time": "02-13-2018 01:52 PM", "replies": []}, {"postID": "post6161952", "text": "US version here, no update yet.", "time": "02-13-2018 04:56 PM", "replies": [{"postID": "post6162260", "text": "Just checked, and it's not available.", "time": "02-14-2018 04:11 AM", "replies": []}, {"postID": "post6166807", "text": "Have you received this update yet? I still haven't.", "time": "02-19-2018 04:44 PM", "replies": [{"postID": "post6166825", "text": "Same... hopefully soon", "time": "02-19-2018 05:07 PM", "replies": []}]}]}]}, {"postID": "post6167863", "text": "We have already started pushing the 140 build to US models. This started about a week ago. \nOTA rollouts can last a couple of weeks. So keep checking for updates periodically. \nMy US model doesnt have 140 build yet either, I've seen some who have gotten it. \nPatience", "time": "02-20-2018 06:53 PM", "replies": [{"postID": "post6167903", "text": "Thank you, Chris, I appreciate the update!", "time": "02-20-2018 07:46 PM", "replies": []}, {"postID": "post6172018", "text": "Stop with the Lies Honor......\nI own a 6x, 8 and now a 7x and wish I did'nt own any.. constant issue and your support is the worst next to Motorola...\nYour fix for everyone in the US is to tell us to wait, hard reset or return the NEW phone with a 1 year warranty for a refurbished phone that only gets a 90 day warranty....\nNot going to rip Honor to bad but the 7x is awful.... The US version does NOT have any of the functions that the european or the asian versions have. Its not a true dual camera.. The US version does not get any updates. Current build for US is B138 which is what mine is on... all other version currently on B192. When support was contacted I was told huh let me investigate, still waiting for answer - 6 days since request. B192 gets ar lens and facial recognition.... again like my Honor 8 - promises promises promises but no delivery... last Honor product I purchase. \nLast time i called Honor's support it was so scripted and their fix for everything is to hard reset and even had the balls to ask if i had cleaned the lens for the camera due to the grainy low light pictures... They also cotradicted themselves.... I was told they do not have any updates for either models... They already have B192 which has the facial recognition / AR Lens Asia / European models. B140 which only has AR Lens update and is only for US models. I was told that US might not get further patches asked why and I got no response.", "time": "02-25-2018 04:20 PM", "replies": []}]}, {"postID": "post6172714", "text": "I'm in the US and I got my 140 update over a week ago. It has the Feb 2018 security patch. I can't complain about my X7 not being supported.", "time": "02-26-2018 10:18 AM", "replies": [{"postID": "post6173050", "text": "Same here", "time": "02-26-2018 03:52 PM", "replies": []}]}, {"postID": "post6172881", "text": "", "time": "02-26-2018 01:33 PM", "replies": []}]}, {"title": "Does Honor 7X have Gyroscope sensor in EU version", "thread": [{"postID": "post6172819", "text": "I want to know if Honor 7X have the gyroscope sensor in BND-L21(EU) version.", "time": "02-26-2018 12:25 PM", "replies": []}, {"postID": "post6173046", "text": "All versions have gyroscope sensor, although initially, some version didn't have it enabled.", "time": "02-26-2018 03:50 PM", "replies": []}]}, {"title": "I don't want any security on my phone.", "thread": [{"postID": "post6166192", "text": "Everytime I try to open an app that has credential storage I have to set a lock screen pattern, pin or a password. Is there anyway I can bypass that?", "time": "02-19-2018 01:02 AM", "replies": []}, {"postID": "post6166787", "text": "No, unless you write the app yourself. (You can't \"change\" a compiled app very easily, and if you had enough experience in Java that you could you wouldn't be asking here.)\nOf course if you disable the security and someone gets your phone for even a few minutes, you could find yourself with an empty bank account, or a huge credit card bill. If you get a phone with a fingerprint scanner, you can secure the app with your fingerprint, so it's really no problem. (Unless someone duplicates your fingerprint, but we're still a few years away from when how to do that becomes common knowledge - and they'll probably change the fingerprint scanners to defeat that when it does.)", "time": "02-19-2018 04:24 PM", "replies": [{"postID": "post6168500", "text": "The app that requires a secured login doesn't really have sensitive information. It's just my schedule for work.", "time": "02-21-2018 01:49 PM", "replies": []}]}]}, {"title": "Do not do business with Honor", "thread": [{"postID": "post6139585", "text": "I've contacted them to return my defective Honor 7x and they received it on January 3rd and I still never got money back after contacting them numerous times about my refund. I've opened a dispute on PayPal and contacted my bank about it", "time": "01-18-2018 11:43 AM", "replies": []}, {"postID": "post6139632", "text": "Was this returned under warranty or during their 10 day (or whatever, depending on your location) return period?", "time": "01-18-2018 12:36 PM", "replies": []}, {"postID": "post6139634", "text": "Yes.", "time": "01-18-2018 12:37 PM", "replies": []}, {"postID": "post6139786", "text": "Wow, that is rough.\nPlease keep us posted.", "time": "01-18-2018 04:43 PM", "replies": [{"postID": "post6140435", "text": "Will do. They kept giving me excuses why they can't give me a refund", "time": "01-19-2018 11:15 AM", "replies": []}]}, {"postID": "post6140509", "text": "They are very new to the US, but at least they did come through. I've read plenty of posts about other companies that have had similar problems- Motorola was pretty bad with issues like this. Good thing you have Paypal to help you. That is the reason I would only used Paypal to buy one. US customers are probably better off buying the X7 from Amazon once it's available. Amazon is great when it comes to returns.", "time": "01-19-2018 12:51 PM", "replies": [{"postID": "post6140894", "text": "They said I wouldn't receive my money until next week as they are trying to fix the system that processes refunds but they didn't give me a concrete date so I'm keeping the PayPal case open so I can get my money back sooner through PayPal. I'm done doing business with Huawei.", "time": "01-19-2018 11:24 PM", "replies": [{"postID": "post6143362", "text": "At least it sounds like you are getting your money back - that is good news. Please keep us updated.", "time": "01-22-2018 08:03 PM", "replies": [{"postID": "post6144715", "text": "Today I received my money back through the PayPal claim. I don't intend on doing business with Huawei ever again.", "time": "01-24-2018 11:38 AM", "replies": [{"postID": "post6144829", "text": "So glad you got your money back!", "time": "01-24-2018 02:08 PM", "replies": []}]}]}]}]}, {"postID": "post6140511", "text": "Frankly I'm stumped how they could engineer a phone in 2017 that has a SINGLE band, 2.4 gHz WiFi radio! I mean the antique Galaxy S3 I have, which is 5 years old has dual band..WTF?", "time": "01-19-2018 12:56 PM", "replies": []}, {"postID": "post6141558", "text": "2.4 ghz wifi doesn't effect anything, my router is only 2.4 ghz and it runs my xbox one x great with is 59 times as powerful as any phone.\nyou do realize 5ghz is not needed for wifi to work great right? do you want me to post video to prove it? in fact 2.4 has longer range than 5.\ni can post video of youtube playing great over 2.4ghz, or anything wifi can do.", "time": "01-20-2018 09:11 PM", "replies": []}, {"postID": "post6146767", "text": "I too am having trouble. I returned the phone and its been 3 weeks with no refund. I contacted chat and was told they were having some problems and I should just be patient and wait for the confirmation email. Looks like I'll have to open a case with my CC company.", "time": "01-26-2018 06:15 PM", "replies": [{"postID": "post6147362", "text": "That's awful to hear - especially the fact that you've waited for over three weeks. Please keep us updated on what happens.", "time": "01-27-2018 04:48 PM", "replies": [{"postID": "post6159089", "text": "Ok, was issued a full refund! But no email notification. Just checked with my CC info every couple of days. Was about to call them this time instead of using the chat. But I saw the refund was finally issued.", "time": "02-09-2018 11:49 PM", "replies": [{"postID": "post6164587", "text": "That's so great that you got your money back!", "time": "02-16-2018 07:57 PM", "replies": []}]}]}]}]}, {"title": "Bluetooth issues", "thread": [{"postID": "post6163155", "text": "Just curious if anyone else is having Bluetooth connection issues. The first one I have is that when streaming music in my car the audio has a slight distortion. Second I've had an issue with text messages being displayed on the cars system, my last phone had no issue. This seems to come and go, some days it works fine others not at all. There have also been a few times that the connection with the car is lost after a call. By the way the car is a 2017 Mazda 3. Going to contact Honor today to see what they say, just wanted to see if anyone else has this issue. \nThanks", "time": "02-15-2018 07:30 AM", "replies": []}, {"postID": "post6164130", "text": "In regards to the music. Plus in some headphones and then go to the Sound settings. Make sure the Huawei Histen sound affects are turned off. Unplug the headphones and then see if the sound is better on bluetooth. That made a big difference for me- its a known issue with Huawei phones.", "time": "02-16-2018 08:41 AM", "replies": [{"postID": "post6164194", "text": "Thanks, I will give it a try later. I have an Honor 8 which works fine, maybe it's the Bluetooth protocol. The 7x has 4.1 while the 8 has 4.2. \nAlso support was not helpful just suggested I return the device.", "time": "02-16-2018 10:10 AM", "replies": []}]}, {"postID": "post6164359", "text": "Try clearing all connected devices on your Mazda. My Honor 7X sync fine with my 2014 Mazda 6.", "time": "02-16-2018 01:32 PM", "replies": []}, {"postID": "post6164511", "text": "Turning off Histen did help a little but it's still there. It sounds like the eq is just set way too high. The text message issue is the strangest, it wasn't working then randomly started. I have a replacement on order, it's out of stock on Amazon until next month. hopefully the new one won't have this issue.", "time": "02-16-2018 05:31 PM", "replies": []}]}, {"title": "Extremely slow wi-fi on USA model of 7X?", "thread": [{"postID": "post6114388", "text": "So I bought the USA version of 7x (I live in USA) Saturday. For the most part what it brings is simply amazing for 199, although the screen viewing angles could be better.\nHowever an issue has emerged, slow wi-fi at home. I understand the 7X only has 2.4 ghz wifi. I'm not sure if this is the problem, but for whatever reason the phone consistently speed tests around 2.6-2.8 mbps on my 50 mbps speed home internet. My Galaxy S6 in contrast tests at 50 mbps as you'd expect. It's not just tests either, instagram and snapchat load slow on the 7x over wifi and podcasts download slow as well. A couple times the 7x has speed tested at ~20 mbps for whatever reason, still well below 50. But mostly it tests at 2.6-2.8 mbps over wi-fi.\nI live in a suburb, not an apt or anything.\nI guess my question is, is this because of 2.4ghz? Or is it a bug that could be fixed in a future software update? Or maybe even just my particular handset is faulty? Should I return it and get a different phone?", "time": "12-21-2017 06:08 PM", "replies": []}, {"postID": "post6114451", "text": "You might try testing with mobile data only and then with wifi only to see the difference. Also double check to make sure your S6 is forced on the 2.4 GHz band. Some devices will default automatically to the fastest connection unless you disable this feature. You might even test both phones side by side. On your router gateway can you see the network connection speeds for devices connected to it? \nThe 2.4 GHz band data speeds will be significantly slower than the 5 GHz bands, which can carry more information. I just got 57mbps down on my 5 GHz and about 12 mbps down on my 2.4 GHz band with my Mate 9. But there's many factors (distance to the router, other traffic on your network, and congestion...) that can contribute. The 2.4 GHz band can be busy place with lots of interferrence. \nInteresting that the 7x would get decent speeds at times, but not others. Makes it look like it might be a bandwith issue on your network.", "time": "12-21-2017 07:28 PM", "replies": []}, {"postID": "post6114671", "text": "Well turns out my router is a linksys e1200. Apparently it's only 2.4 ghz. So the whole 5ghz vs 2.4 thing was a red herring by me.\nAlso another guy on a forum said he was getting 50 mbps on his 7x.\nLooks like I have a defective unit somehow. That's odd, though.\nEdit: Literally just after I wrote this I had the idea to hard power off the device. Cause I was thinking of even a factory reset but I didn't want to go that far. what do you know directly after reboot it was pulling 47 mbps down as it should.\ndont know, I'm gonna keep an eye on it. I hope it's not a bug where after the phone has been on a long time the wi-fi slows down. I know I shut the phone down several times at work every day too, so it's not like it never gets rebooted.\nWill monitor.", "time": "12-22-2017 02:18 AM", "replies": [{"postID": "post6115143", "text": "Wow! But probably not too surprising considering it's a brand new device. Did it receive any updates when you booted it up? \nHope you continue to see higher speeds and the 7x works out well for you overall. How do you like the extra screen space?", "time": "12-22-2017 12:53 PM", "replies": [{"postID": "post6115357", "text": "well here the next day, as soon as I woke up the phone was back to it's old ways. It's also throttling over 4G too...it wont pull over 2mbps's there. Not sure how long it's been doing that.\nSo definitely a big problem. I guess I will go to the next step a hard reset. But even if that works I'll be wary that it's a permanent fix. Besides that will mean I have to re input all my info etc which is a big pain, took me a while to transfer all pics etc over to this phone.\nI guess it's looking likely I'll have to send it back.\nShame, overall for 199 I love the rest of the phone.\nAnybody else with USA version have these issues?", "time": "12-22-2017 05:07 PM", "replies": []}]}]}, {"postID": "post6115470", "text": "Have you tried to do a factory data reset? Make sure you backup data first. You would need to do a factory data reset before doing a return anyway", "time": "12-22-2017 08:05 PM", "replies": []}, {"postID": "post6116381", "text": "I saw your comment on slickdeals. I just discovered a problem: when Bluetooth and wifi are turned on, my speeds are bad. When Bluetooth is turned off, my wifi speeds are great! OnePlus users were having this issue as well, and OnePlus said the issue had to do with wifi and Bluetooth using the same antenna. I will attach some pictures showing what I mean. 1) Wifi on and Bluetooth off 2) Wifi on, Bluetooth on 3) LTE on and Bluetooth on 4) LTE on and Bluetooth off\nAll of these were done connected to the same Speedtest server.\nSo, as you can see, Bluetooth is the issue.", "time": "12-23-2017 07:50 PM", "replies": [{"postID": "post6116500", "text": "Wow! So, is this something that can be resolved with a software update (bluetooth drivers) that properly prioritizes signals to the antenna. How would you know if there are separate antennas in our devices?", "time": "12-23-2017 11:07 PM", "replies": [{"postID": "post6116646", "text": "I did a quick Google search and quite a few devices experience this issue. OnePlus, Redmi, LG Nexus 5X, Galaxy S3, Chromebooks and so on.https://www.reddit.com/r/Xiaomi/comm...w_on_redmi_3s/https://www.reddit.com/r/AndroidQues..._bluetooth_is/https://www.reddit.com/r/GalaxyS3/co...ows_down_wifi/https://www.reddit.com/r/LGG3/commen...h_is_on_vs985/https://www.reddit.com/r/GooglePixel...ver_wifi_when/https://www.reddit.com/r/AndroidWear...ith_bluetooth/\nInteresting answer in one of those threads:\nThe Bluetooth and Wi-Fi share the same 2.4GHz antenna. They cannot transmit simultaneously. A 5GHz band Wi-Fi router should allow you to listen to your (2.4GHz) Bluetooth headset and wireless simultaneously without delay.\nAnother answer I saw:\nThis issue is posted over and over again. And I can only repeat myself: Wifi and BT share the same antenna/spectrum. The issue is only resolved if you use a 5ghz (a or ac) access point, then you can have full speed and bluetooth at the same time. This issue is not limited to this device, it also occurs on many notebooks and other phones. \n---------------\nBasically, this is the downside of having a 2.4ghz device. If Honor wouldn't have cheap out and added 5ghz, we wouldn't have experiencing this problem. It's 2017, this shouldn't be optional anymore. My guess is the Honor 8X next year will include 5ghz wifi and NFC.", "time": "12-24-2017 02:28 AM", "replies": [{"postID": "post6118500", "text": "I am not so sure... at least not at the $200 price point. They have to lose something to get that price, imo", "time": "12-26-2017 01:14 PM", "replies": []}]}]}, {"postID": "post6118496", "text": "That really sucks. Looks like they took a shortcut in the design. If you need Bluetooth a lot then this phone might not be for you then", "time": "12-26-2017 01:11 PM", "replies": []}]}, {"postID": "post6116456", "text": "Wow, the bluetooth thing was it! Immediately after turning bluetooth off my speed shot up to 35-45mbps. with Bluetooth on it consistently runs just under 3 mbps.\nNot sure how to feel about this. there are definitely instances I could imagine of bluetooth and wifi being used simultaneously. For example, i'm watching a youtube video in the kitchen on the phone but want decent sound so I bluetooth to speaker. I'm regularly connected to my JBP flip 3 in the kitchen. For a podcast it shouldn't matter, I'm rarely using the phone while listening to podcasts at home. However the youtube video thing could be a real issue. Could be avoided somewhat by using a auxiliary cable in those instances instead, though less convenient.\nDoes the oneplus 5t do the same thing??? I was/am considering to purchase that phone...or is just older One Plus models?\nDefinitely seems like a QC oversight IMO.\nAgain, not quite sure what to think. Glad I know the root of the issue now though, and didn't waste time returning it...", "time": "12-23-2017 09:43 PM", "replies": [{"postID": "post6118498", "text": "Not sure if this is a qc issue more of a design limitation... I am assuming that this was done to save money in manufacturing", "time": "12-26-2017 01:12 PM", "replies": []}]}, {"postID": "post6117232", "text": "What's bad about the bluetooth causing slowdown in the wifi case of the Honor 7X, or at least my Honor 7x with my wifi setup, is it's throttling all the way down to about 3 mbps.\nIf it was like the other guy's example (with a different phone), and throttling from 50 to 25 mpbs, I wouldn't even be worried about it, as 25 mbps should be plenty.\nSo yeah there's a big difference in severity of the issue between throttling to 25 mbps (some phones apparently) and all the way to 3 mbps (my Honor 7X).\nI do have a question though, how would a 5ghz router solve the problem? I dont understand it. If the phone only has a 2.4 antenna, how can a 5 ghz router help?\nthe phone is good enough for the price though that even with the issue I'm most likely keeping it. that and it would be a lot of trouble and expense to return.\nIf a 5ghz router would alleviate the problem and i can find one for like 40 bucks or less, it would probably be worth it to me to solve the issue. My current router ias some linksys I picked up on clearance for like 19 bucks, and it's been solid and reliable for a long long time. So cheap doesn't mean bad.\nalso, my brother has one of those expensive nighthawk routers (I assume this has 5ghz). i was over at his house the other night showing him the issue. the phone was definitely performing different. i dont recall it dropping below about 10 mbps, but OTOH that's no great shakes. Still well above what mine was getting. Several times it would jump to ~50 mbps (although he has 200 mbps internet) but not consistently. TBH I dont even know if bluetoth was on but it should have been since it's my default. This was before i knew bluetooth was causing the issue.", "time": "12-24-2017 08:32 PM", "replies": [{"postID": "post6118503", "text": "A 5ghz capable router won't help, unfortunately. because the honor 7x doesn't support Wi-Fi 5ghz, there is no way for you to use the 5ghz wifi channel.", "time": "12-26-2017 01:18 PM", "replies": []}]}, {"postID": "post6117236", "text": "I also found this somewhere in my googles about this issue:It still seems like maybe some sort of design flaw or software flaw quite possibly, as high performance 2.4 ghz wifi+bluetooth obviously is achievable, for example my prior S6 handled it with no problem.\nMaybe it is something they can fix or improve with an update.", "time": "12-24-2017 08:46 PM", "replies": []}, {"postID": "post6159877", "text": "I can confirmed this on my new Honor 7X. Wifi speed drop almost in half with Bluetooth on. It maybe annoying but I just toggle Bluetooth on/off as needed on top pull down.", "time": "02-11-2018 12:13 AM", "replies": []}, {"postID": "post6164138", "text": "Is this the same on the 6X?", "time": "02-16-2018 08:49 AM", "replies": []}]}, {"title": "Debate: Is the 7X the best $200 smartphone?", "thread": [{"postID": "post6099302", "text": "Thought this would make a fun topic. Do you think the 7X is the best $200 smartphone out there? If yes, WHY? If not, which one is, and WHY?", "time": "12-07-2017 02:34 PM", "replies": []}, {"postID": "post6099321", "text": "No. Moto G5+. Huawei still hasn't stopped being Huawei on the privacy and security front. As soon as that changes, they will be able to have a real competition against the Moto G line.", "time": "12-07-2017 02:52 PM", "replies": [{"postID": "post6103240", "text": "I couldn't have said it any better!\nAnd if you're on T-Mobile in the US, they don't have full coverage of the frequencies needed to get the most of of their network... Moto, for example, covers Band 66, and Huawei/Honor don't - not even the flagship Mate 10/10 Pro.", "time": "12-11-2017 07:37 AM", "replies": [{"postID": "post6103642", "text": "What about volte and wfc?", "time": "12-11-2017 12:49 PM", "replies": []}, {"postID": "post6113349", "text": "False. At least I know the Mate 10 will cover the new longer range 600mhz bands that T Mobile invested in. M", "time": "12-20-2017 03:49 PM", "replies": [{"postID": "post6115498", "text": "I don't see lte band 66 supported on any version of the mate 10 http://consumer.huawei.com/en/phones/mate10/specs/", "time": "12-22-2017 08:50 PM", "replies": [{"postID": "post6117014", "text": "It isn’t. I cross-checked this info with phonescoop.com and none of them support B66.", "time": "12-24-2017 02:02 PM", "replies": [{"postID": "post6118526", "text": "Thanks for the confirmation. It sucks but it doesn't surprise me as most unlocked phones don't support it", "time": "12-26-2017 01:37 PM", "replies": [{"postID": "post6118533", "text": "Yes, it does indeed, but I suppose something has to give to meet their budget pricing targets.\nI’ve also compared it to my iPhone SE, which is an outstanding little smartphone. It, too, lacks B66, but performs rather well regardless. The same is true of my iPhone 7. So perhaps it matters less than I’d initially thought.", "time": "12-26-2017 01:43 PM", "replies": [{"postID": "post6118579", "text": "I like to have phones that have the best cellular support, but with that said at this point, a significant number of tmobile phones don't support it so it is not a big deal, unless you are looking for it.", "time": "12-26-2017 02:49 PM", "replies": [{"postID": "post6120950", "text": "It's a new band for TMO. I hope we will have more phones supporting it in 2018.", "time": "12-28-2017 11:08 PM", "replies": [{"postID": "post6120962", "text": "Most definitely. More phones will support it in 2018. My only point was that knocking the honor 7x for not having it isn't fair at this time.", "time": "12-28-2017 11:20 PM", "replies": []}]}]}]}]}]}, {"postID": "post6150109", "text": "I thought T-Mobiles new band is Band 71?", "time": "01-30-2018 06:34 PM", "replies": [{"postID": "post6160697", "text": "Band 71 is the newest but literally only 3 phones support it, the v30, v30 plus and s8a. All of which are carrier phones. There are no unlocked phones that support it so I wouldn't fault this phone for not having it", "time": "02-12-2018 03:44 AM", "replies": []}]}]}]}]}]}, {"postID": "post6099340", "text": "This is a tough call. Just on specs, I would say le max2 which has the snapdragon 820,6gb ram, QHD display, 64gb internal. But you are only buying for the hardware. \nSoftware support is tricky on Huawei too... The 5x was abandoned, and multiple reports of people on the 6x and even mate 9 on April patch, although some are able to get more recent patches. Still, consistency is an issue. \nBased on looks though, the 7x is definitely the sleekest at $200. Specs are good as well.", "time": "12-07-2017 03:10 PM", "replies": []}, {"postID": "post6099361", "text": "I think it's a workable $150.00 phone.\nLooks good and has the bigger screen going for it.\nEverything else is 2016 and like dpham indicates update support may not be available for certain regions.", "time": "12-07-2017 03:32 PM", "replies": []}, {"postID": "post6099848", "text": "Huawei software support is what is the Achilles heel here.\nMy tablet is still on the May 2017 security patch. I mean they can't even push out security patches once in six months. \nNow Moto might be slightly better but they also tend to abandon their phones in terms of OS upgrade. I am not too sure if they keep pushing out security patch updates at a regular interval or not.\nOn paper the 7x is a solid device and Huawei cameras tend to be better than Moto.\nI would say it is probably an even split between with a slight advantage to the Moto.", "time": "12-07-2017 10:53 PM", "replies": [{"postID": "post6103636", "text": "Which Huawei tablet do you have?", "time": "12-11-2017 12:46 PM", "replies": [{"postID": "post6103652", "text": "MediaPad M3 64GB version with Mate 9 hardware.", "time": "12-11-2017 01:00 PM", "replies": [{"postID": "post6103862", "text": "Ah ok. Mine is the 32gb. I will check to see what it is on when I get a chance", "time": "12-11-2017 03:39 PM", "replies": [{"postID": "post6103892", "text": "Cool. I really like it as a media consumption device.", "time": "12-11-2017 03:51 PM", "replies": [{"postID": "post6106761", "text": "Most definitely. It is great for media consumption,especially the wide screen. Sadly I use my other tablet more since my m3 doesn't have 4glte connectivity.", "time": "12-14-2017 09:51 AM", "replies": [{"postID": "post6106776", "text": "Yeah it would be nice if I had the LTE version like my Tab S2.", "time": "12-14-2017 10:09 AM", "replies": [{"postID": "post6107090", "text": "Yes that would be nice. Unfortunately the tab s2 and iPads are full screen. Ugh.", "time": "12-14-2017 03:55 PM", "replies": [{"postID": "post6107094", "text": "Yeah, I'm not a big fan of that format for entertainment consumption.", "time": "12-14-2017 04:01 PM", "replies": [{"postID": "post6107405", "text": "I hope that they move towards wide-screen especially with the push towards video.", "time": "12-14-2017 10:46 PM", "replies": [{"postID": "post6107416", "text": "I am tempted to try out the 7X.", "time": "12-14-2017 11:02 PM", "replies": [{"postID": "post6107772", "text": "I am too. Although I am concerned about performance, as my 5x underperformed, although I hope that they fixed things. Also... Updates... My 5x was abandoned", "time": "12-15-2017 10:32 AM", "replies": [{"postID": "post6107793", "text": "The 6x was vastly improved over the 5X.\nSoftware updates are a definite bugaboo about this device/company in general.", "time": "12-15-2017 10:46 AM", "replies": [{"postID": "post6107895", "text": "Glad to hear that the 6x performance was much better. Still my honor 5x experience makes the 7x option kinda iffy for me. If they choose to like on the 5x,they can abandon support.", "time": "12-15-2017 12:42 PM", "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"postID": "post6100211", "text": "For the average customer monthly security patches isn't what they're looking into when purchasing a phone especially at this price point. \nNow specs alone between Moto G5+ vs 7x. Probably the 7x imo. bigger display, bigger battery, dual camera, ir blaster over the G5+\nSoftware Support though. I'm not sure really. Huawei ditched 5x. Moto delayed Moto X Pure Nougat a whole year later. And Moto do tend to abandoned their phones after a while. Like only the G4 Plus will get Oreo while the regular model will not", "time": "12-08-2017 09:59 AM", "replies": [{"postID": "post6103242", "text": "That's true... it's an attractive, high-quality piece of hardware for $200, and lots of folks looking for phones in that price range aren't concerned about software support.\nBut I'd still say that the Moto G series are the best phones in this price range, regardless of what people actually end up buying.", "time": "12-11-2017 07:40 AM", "replies": [{"postID": "post6103643", "text": "It's probably the most well rounded phone for sure. The honor 7x has specs but the rest is iffy", "time": "12-11-2017 12:51 PM", "replies": []}]}, {"postID": "post6103640", "text": "The other issue is warranty. I haven't had any first hand experience, but a few members here said that warranty service was very difficult. Moto isn't great but they had to pay millions after people sued them for their warranty practices and so supposedly they are better now.", "time": "12-11-2017 12:49 PM", "replies": []}]}, {"postID": "post6112676", "text": "I'd say yes! Bummer it doesn't have usb-c or NFC, But what makes this phone so good is the screen, performance, decent camera and amazing build quality. All for $199.", "time": "12-20-2017 12:45 AM", "replies": [{"postID": "post6112714", "text": "That's great to hear.\nDo post some pictures taken with the 7X camera when you get a chance.", "time": "12-20-2017 02:42 AM", "replies": []}, {"postID": "post6115497", "text": "The lack of Wi-Fi 5ghz would be the biggest downer for me. For the price of course it's acceptable though", "time": "12-22-2017 08:46 PM", "replies": []}]}, {"postID": "post6150526", "text": "For the US, I would agree the X7 is probably the best option. However, it gets a little foggy if the Moto G5 Plus is on sale. The G5 has a little bit better screen when it comes to viewing angles, has a nano coating against water and performs a bit faster with less bloat due to almost pure android. The X7 however, has faster and better quality cameras, has a higher resolution screen, form factor makes it easier to hold, and soon it will have face unlock. It's kind of a toss up when those phones are close in price.", "time": "01-31-2018 08:04 AM", "replies": []}, {"postID": "post6150553", "text": "I believe 71 is the new 600mhz, which hardly any phone supports right now. Band 66 is a derivative of band 4 and not really used. the Honor X7 supports the bands most of the T-mobile phones support, you are not losing anything.", "time": "01-31-2018 08:43 AM", "replies": []}, {"postID": "post6161243", "text": "Also keep in mind that this phone doesn't support LAA, which according to tmobile has \"material impacts in speed performance – increasing speeds 5-10X\". Lower end phones won't support this though, but it is a difference between low end and the high end and the speed can make a difference if you are getting poor speeds and LAA is deployed in the area\nIt probably also won't support carrier aggregation, qam 256, and 4x4 mimo, which are also features not typically in lower end phones.", "time": "02-12-2018 06:28 PM", "replies": []}]}, {"title": "Honor 7x is #1 Best Seller in Unlocked phones on Amazon", "thread": [{"postID": "post6144848", "text": "Proud to announce we are now #1 on Amazon for Best Seller in unlocked cellphones. \nNeed a fantastically built phone, great camera and a large screen but the budget is tight? Check out the link belowa.co/2QgzRoe\nIn your opinion, what makes the Honor 7x number 1?", "time": "01-24-2018 02:39 PM", "replies": []}, {"postID": "post6144895", "text": "How about sending out OTA updates for past #1 selling phones from honor...", "time": "01-24-2018 03:35 PM", "replies": [{"postID": "post6160708", "text": "The honor 5x was released in January 2016 and guaranteed 2 years software updates. It is currently on Android os released in October 2015. The honor 7x has no guarantees that I know of although the op, working for Huawei, should be able to clarify on this. Granted I would take it with a grain of salt, given their previous record of reneging on promises on both the honor 5x and honor 8, but it would be better than nothing. Also if honor really wants people to know that they take updates seriously then they should put a guarantee that would provide say a $50 refund should they not meet their guarantee.", "time": "02-12-2018 04:15 AM", "replies": []}]}, {"postID": "post6145144", "text": "I'm sure the low price with solid specs and design are big reasons why the 7x is selling so well.", "time": "01-24-2018 09:14 PM", "replies": []}, {"postID": "post6145310", "text": "It’s an attractive phone with great build quality and very good performance for $200...but Guytronic is right to be skeptical regarding updates.", "time": "01-25-2018 04:27 AM", "replies": []}, {"postID": "post6147364", "text": "I did hear this! That's pretty awesome!", "time": "01-27-2018 04:49 PM", "replies": []}]}, {"title": "Can Not Receive MMS on 7X", "thread": [{"postID": "post6138863", "text": "Posting here is a bit of a last resort. \nT-Mobile blames Huawei, Huawei blames T-Mobile. I told both of them if they don't stop blaming each other and just get it fixed, I'm returning the phone and going to AT&T.\nAnyone have any suggestions? If I reset the settings, it works again. Once I personalize it (choose ringtone, set default apps, etc.) the problem returns. It's exhausting.", "time": "01-17-2018 04:44 PM", "replies": [{"postID": "post6159618", "text": "I called T-Mobile and Honor 7X support and neither could help. I changed all the APN according to T-Mobile but it did not work. I changed the default MMS app to Pulse (Google store) and it WORK PERFECTLY. No need to return the Honor 7X.", "time": "02-10-2018 04:31 PM", "replies": [{"postID": "post6159623", "text": "Very strange... It should've worked with the T-Mobile APN. Regardless, I'm glad you've figured it out!", "time": "02-10-2018 04:35 PM", "replies": [{"postID": "post6159816", "text": "After MMS work with Pulse messaging, I changed the default back to Google (Android) messaging and it stopped receiving MMS. Once changed default back to Pulse, can received MMS again. But since I have both installed, the Google will mirror the Pulse, and see all the sms, just cant received or sent.\nUpdate: After uninstalling and reinstalled Textra, it can now send MMS again, strange. All SMS apps able to send MMS now.", "time": "02-10-2018 09:52 PM", "replies": []}]}]}]}, {"postID": "post6139130", "text": "What settings are you resetting? Does the APN setting remain correct for T-Mobile? https://support.t-mobile.com/docs/DOC-2090. Or does it keep changing to something incorrect?", "time": "01-17-2018 10:15 PM", "replies": [{"postID": "post6140014", "text": "Just personalization settings. APN is fast.t-mobile.com.Textra. But if I return to the default messaging app things don't change.\nThe first week I had the phone I used Textra without issue. Sent and received MMS perfectly. Then as I customized my phone further the problem arose.\nThe thing that sucks even more about this is that I only got the 7X to hold me over until the Mate 10 Pro finally becomes available. But if there's a clash between Huawei/Honor phones and T-Mobile/AT&T, then the entire past 6 months of waiting have been in vain.", "time": "01-18-2018 10:08 PM", "replies": []}]}, {"postID": "post6139390", "text": "Crap  I am expecting my 7X today and since I ordered it I've been reading about SMS and MMS issues with it in the US with both ATT and T-Mobile. I don't think going to ATT will solve the issue. Ugh, I'm wondering if I made a mistake.", "time": "01-18-2018 07:59 AM", "replies": [{"postID": "post6139450", "text": "I've used my Honor 7X on T-Mobile and Mint SIM (which runs on T-Mobile's network). I've had no problems with sending or receiving messages with either of them. You need to make sure the APN settings are correct for your provider.", "time": "01-18-2018 09:02 AM", "replies": []}]}, {"postID": "post6139494", "text": "That's nice to hear. What messaging client are you using. I read that the issues come up when you use a texting app other then what is on the phone. Apparently if you use the included app everything works. Not sure how true that is.", "time": "01-18-2018 09:55 AM", "replies": [{"postID": "post6139497", "text": "I'm using the stock messaging app. I tried using Android Messenger but it doesn't do a good job of managing multiple SIM cards.", "time": "01-18-2018 09:58 AM", "replies": []}, {"postID": "post6140014", "text": "Just personalization settings. APN is fast.t-mobile.com.Textra. But if I return to the default messaging app things don't change.\nThe first week I had the phone I used Textra without issue. Sent and received MMS perfectly. Then as I customized my phone further the problem arose.\nThe thing that sucks even more about this is that I only got the 7X to hold me over until the Mate 10 Pro finally becomes available. But if there's a clash between Huawei/Honor phones and T-Mobile/AT&T, then the entire past 6 months of waiting have been in vain.", "time": "01-18-2018 10:08 PM", "replies": []}]}, {"postID": "post6139523", "text": "Hope it really isn't an issue. I have no problem using the stock messaging app, however I prefer Google's because it works much better with Android Auto and Android Wear. Good thing is I really just got the X7 to play with for something different. I don't need to depend on it as my main phone so I can wait so see if things improve.", "time": "01-18-2018 10:39 AM", "replies": []}, {"postID": "post6139580", "text": "I just ordered one to use on AT&T. Hope it’s ok. I’ve read a ton of reviews and none really mention lack of MMS or problems with it. Has the OP solved the problem? Is anyone using the US version on AT&T with MMS problems? Thanks for any feedback.", "time": "01-18-2018 11:38 AM", "replies": []}, {"postID": "post6139640", "text": "On a side note- my 7x was just delivered. Wow- the build quality is exceeding my expectations. I'm beginning to think I may be using this more then I thought. Can't wait to spend time with it tonight.", "time": "01-18-2018 12:45 PM", "replies": [{"postID": "post6139690", "text": "Let us know what you experience with texting/MMS. Thanks.", "time": "01-18-2018 02:13 PM", "replies": []}]}, {"postID": "post6139780", "text": "I do think it's a good idea to check the APN settings manually to make sure the phone is taking advantage of the fast.t-mobile.com APN setting.", "time": "01-18-2018 04:36 PM", "replies": []}, {"postID": "post6140263", "text": "Set up my new USA Honor 7X late last night with T-Mobile. I sent multiple texts and MMS messages using Google's Messaging app with no issues. I sent them to my daughter's and wife's phones. I tested it with Wifi and just cellular. I looked at the APN settings and they were fine, didnt have to change anything. They were the same as my Moto Z2 Play. Pretty happy with the phone so far, the display isn't as great as I was expecting. The viewing angles are not the greatest- my daughter's Moto G4 Plus has a better screen in regards to viewing angles.", "time": "01-19-2018 08:17 AM", "replies": [{"postID": "post6140285", "text": "Thanks so much for the feedback.", "time": "01-19-2018 08:34 AM", "replies": []}]}]}, {"title": "Now that the 7X is bezel-less does that mean other Honor/Huawei phones will be?", "thread": [{"postID": "post6017979", "text": "Folks,\nOk so with the 7X, Honor/Huawei has released their first bezel-less phone. Does this mean more are to come? One would certainly think so. Will all their future phones be bezel-less, OR just some models? What else do you think Honor/Huawei has in store for us with regards to phone design?", "time": "10-13-2017 12:30 PM", "replies": []}, {"postID": "post6018235", "text": "I would hope it means more to come. I like how the 7x still has a little bezel at the top and bottom and I hope they continue that trend vs edge to edge screen with camera/ sensor cutouts.", "time": "10-13-2017 03:52 PM", "replies": []}, {"postID": "post6018814", "text": "I am not sure if all, but I would speculate that they are moving in that direction", "time": "10-14-2017 01:35 AM", "replies": []}, {"postID": "post6050743", "text": "Let's hope so. love this look", "time": "11-02-2017 04:05 PM", "replies": []}, {"postID": "post6108535", "text": "I agree, this screen looks fantastic", "time": "12-16-2017 04:49 AM", "replies": []}, {"postID": "post6121250", "text": "I feel like I'm one of the only ones left who don't mind bezels at all - in fact, I love them, and love them on my Honor 8 and enjoy seeing them on the Pixel 2 - but I do like the bezel-less look on certain devices. I think the V30, Honor 7X, and the Pixel 2 XL do it well. It would be nice if Huawei/Honor would make a variety: some phones with bezel, and some without.", "time": "12-29-2017 08:40 AM", "replies": [{"postID": "post6122012", "text": "Well Huawei likes to follow trends so I would expect more phones with small bezels", "time": "12-29-2017 11:12 PM", "replies": [{"postID": "post6122045", "text": "I'm sure you are right. I wonder if we'll see any phones with bezels in 2018.", "time": "12-29-2017 11:42 PM", "replies": [{"postID": "post6123547", "text": "I do not think that Huawei would make a standard bezel screen for 2018", "time": "12-31-2017 07:49 PM", "replies": [{"postID": "post6123962", "text": "Awww hopefully we get some kind of bezel option in 2018!", "time": "01-01-2018 12:03 PM", "replies": [{"postID": "post6124084", "text": "I am sure that you will. It just might not be from Huawei though", "time": "01-01-2018 01:55 PM", "replies": [{"postID": "post6124746", "text": "Good point. I'm really looking forward to seeing what HTC and LG do this year.", "time": "01-02-2018 10:41 AM", "replies": [{"postID": "post6124755", "text": "So am I, especially HTC... they need to hit a home run this year!", "time": "01-02-2018 10:52 AM", "replies": [{"postID": "post6124800", "text": "For sure! I loved the U11. I'm really interested in seeing how they do the U12.", "time": "01-02-2018 11:21 AM", "replies": []}]}]}]}]}]}]}]}, {"postID": "post6122137", "text": "You’re not the only one. I totally don’t get the no-bezel obsession. In my opinion, they frequently make phones less usable.", "time": "12-30-2017 05:26 AM", "replies": [{"postID": "post6122188", "text": "I completely agree with you - it definitely infringes on the usability of phones!", "time": "12-30-2017 07:24 AM", "replies": []}, {"postID": "post6123549", "text": "I prefer a little bezel as well but unfortunately you just have to live with the options that are available", "time": "12-31-2017 07:50 PM", "replies": []}]}]}, {"postID": "post6158813", "text": "I like the bezel-less trend, BUT if you got a good reason for bezels then I'm good with it. Example the Razor phone!", "time": "02-09-2018 03:12 PM", "replies": []}]}, {"title": "What's the best screen protector for the Honor 7X", "thread": [{"postID": "post6148990", "text": "I'm going to get the Honor 7X and I was wondering what the best screen protector would be please leave an Amazon link thanks", "time": "01-29-2018 03:49 PM", "replies": []}, {"postID": "post6149060", "text": "I just installed a Skinomi screen protector last night. It worked out well. I gave up on the glass ones, they just don't work well with the 2.5 screens.", "time": "01-29-2018 05:11 PM", "replies": []}, {"postID": "post6149829", "text": "There's really no good scratch protector - even tempered glass is softer than carbide, and there's a lot of carbide in the air, so dragging your finger across a protector if there are carbide particles on it (and they're too small to feel) produces scratches.\nPlastic protectors, of course, scratch easily, but at least they offer some break resistance - which glass protectors don't do. (I've heard of cases in which the screen shattered but the glass protector wasn't harmed.) I go with a plastic protector and replace as needed. They're cheap enough that you can replace them whenever they bother you.", "time": "01-30-2018 12:39 PM", "replies": []}, {"postID": "post6155271", "text": "I use https://www.amazon.com/Huawei-Protec...cUvbUpU6155271 on my 7x and works wonderfully! No halo affect", "time": "02-05-2018 05:38 PM", "replies": []}]}, {"title": "Weather widget isn't updating", "thread": [{"postID": "post6149757", "text": "I've noticed that the stock EMUI weather widget doesn't update unless my phone is connected to WiFi. Has this happened to anyone else?", "time": "01-30-2018 11:52 AM", "replies": [{"postID": "post6149761", "text": "Happens to me on my MediaPad M3 as well. I think it's EMUI.", "time": "01-30-2018 12:01 PM", "replies": [{"postID": "post6149777", "text": "Well, that's unfortunate... it's a nice weather widget, but pretty useless if it won't update...", "time": "01-30-2018 12:12 PM", "replies": []}]}]}, {"postID": "post6149822", "text": "Up until now, many people paid for mobile data by amount used, so they made the app only update on wifi. (It would have been nice to give the user a choice.) Now that more and more carriers are going to unlimited data, we'll probably see that sort of thing stop.", "time": "01-30-2018 12:35 PM", "replies": [{"postID": "post6149933", "text": "True enough.\nI've always used weather widgets on Android and set them to update as frequently as possible, and they've always just worked. And they don't use much data compared to some other background-updating apps.", "time": "01-30-2018 02:00 PM", "replies": []}]}]}, {"title": "does Honor 7x supports AR or VR?", "thread": [{"postID": "post6148505", "text": "AR -Augmented Reality\nVR -Virtual Reality", "time": "01-29-2018 05:12 AM", "replies": []}]}, {"title": "US bands", "thread": [{"postID": "post6147739", "text": "Does anyone know the US bands that come on the 7x?", "time": "01-28-2018 07:39 AM", "replies": []}, {"postID": "post6147879", "text": "LTE band 2(1900), 4(1700/2100), 5(850), 7(2600), 12(700), 17(700)", "time": "01-28-2018 11:02 AM", "replies": []}, {"postID": "post6147880", "text": "I have been using it on AT&T with full LTE. Works great!", "time": "01-28-2018 11:03 AM", "replies": [{"postID": "post6147891", "text": "Thank you! From what I've seen it didn't show those bands but it may have been a different model.\nAny lagging?\nAble to use mobile Hotspot?", "time": "01-28-2018 11:15 AM", "replies": [{"postID": "post6148112", "text": "It usually runs very fast. As others have mentioned it has gotten really slow on me once. I rebooted and all was fine. It's fantastic for $200. \nI don't use a mobile hotspot.", "time": "01-28-2018 03:30 PM", "replies": []}]}]}]}, {"title": "Lag", "thread": [{"postID": "post6119273", "text": "I been dealing with constant lag and stutters on my 7x how do I fix it?", "time": "12-27-2017 10:09 AM", "replies": []}, {"postID": "post6119280", "text": "Have you tried anything yet? Does a reboot help?", "time": "12-27-2017 10:23 AM", "replies": []}, {"postID": "post6119304", "text": "Where are you seeing the lag and stutter?", "time": "12-27-2017 10:38 AM", "replies": []}, {"postID": "post6119433", "text": "Everywhere. I tried rebooting it too.", "time": "12-27-2017 12:44 PM", "replies": []}, {"postID": "post6119529", "text": "I was JUST about to create a post about this lag. Something is definitely not right to have lag delays for so long. I was going to say it's probably the ram in our 3gb model but I have two work phones running on 2gb ram and never got lag this bad. \nWhen it just freezes with lag (at random even if I haven't used the phone for an while), I check the ram and there is still 1.5gb free so it's not a ram issue, must be a software issue. A few times a day it'll take an app a full 60-90 seconds to launch and everything will be at a snails pace for the next 5 minutes. If anyone has any tips it'll GREATLY be appreciated.", "time": "12-27-2017 01:51 PM", "replies": [{"postID": "post6123133", "text": "I have the UK model with 64 gig and 4 gig ram and get the odd small stutter but nothing bad. The one thing that I am getting is main settings often taking ages to open and crashing all the time. I have tried everything but still it does it", "time": "12-31-2017 08:56 AM", "replies": []}]}, {"postID": "post6119591", "text": "Something to keep in mind.... Android likes having RAM full. Are you both using a RAM clearing app?", "time": "12-27-2017 02:42 PM", "replies": []}, {"postID": "post6122529", "text": "Nope", "time": "12-30-2017 02:24 PM", "replies": []}, {"postID": "post6127080", "text": "Are you guys using the factory launcher or do you have a 3rd party launcher on your Honor 7X?", "time": "01-04-2018 05:26 PM", "replies": []}, {"postID": "post6128150", "text": "I started with the factory launcher and had the severe 45-60 second lag with opening certain apps so I switched to my favorite (Action launcher) and the homescreen lag is reduced but it still randomly freezes up sometimes. Mainly happens upon waking up the device after I haven't used the phone in an hour or so, everything gets bogged down like crazy for about 10 full minutes.", "time": "01-05-2018 06:06 PM", "replies": []}, {"postID": "post6128657", "text": "Is everyone experiencing lag or are most of you having a good experience?", "time": "01-06-2018 10:57 AM", "replies": []}, {"postID": "post6143654", "text": "Have had my USA Honor 7X (bought directly from Honor) on T-Mobile for the last 5 days. Very little lag at all. So far the phone has been excellent. I switched to Nova Launcher last night and the phone actually seems even smoother. I suspect those that have lag may have some app that may not be working well with the Kirin processor maybe?", "time": "01-23-2018 07:58 AM", "replies": [{"postID": "post6143681", "text": "Could be. I don't have anything out of the ordinary on my phone (I'm not even running Nova, which is normally one of the first things I install out of the box) and my phone flies. It's an impressive performer for the price.", "time": "01-23-2018 08:26 AM", "replies": []}]}, {"postID": "post6144147", "text": "When the Mate 9 came out some apps didn't work correctly because of the Kirin. Netflix was one of them from what I remember. Updates fixed that. I do wonder since apps are programmed for the Qualcomm chips that maybe some of the apps may have issues with the Kirin.", "time": "01-23-2018 06:26 PM", "replies": []}]}, {"title": "Huawei Honor 7x Damage", "thread": [{"postID": "post6143930", "text": "I received my Huawei Honor 7x on a Friday. I put a screen protector and phone case on it the same day. As soon as I turned it on I noticed problems. The screen wasn't responsive at times, especially at the bottom of the screen. I thought, well maybe I can deal with it but the problem worsened. On Monday I called their (crappy) customer service to arrange for phone repair and went back to using my old but dependable HTC. Three days and two more phone calls later they finally sent me a shipping label. \nYesterday I got my Honor phone back. A note said they wouldn't repair it because of liquid damage, which also voided the warranty. The phone has had a screen protector and phone case the entire time I've had it, it's never been near water, but the problems started as soon as I used it.\nI'm furious, obviously called them, but there's nothing they will do. The phone evidently was damaged before they even sent it to me and now I've been ripped off. \nMeanwhile, the problems are worse. The phone will not play sound now. I'm furious. \nIs there anything I can do to fix it, or is there anyway to get Huawei to replace it?", "time": "01-23-2018 01:31 PM", "replies": []}, {"postID": "post6144059", "text": "Welcome to Android Central! I moved this from the Honor 7 forum to the Honor 7X forum, just to be specific.\nProbably the only thing you can do is be persistent, and keep calling. Ask for things to be escalated to the next customer service level. Be firm but polite -- don't sound like you're losing your temper, because that will just make them less willing to help. It would have been ideal to take a video of the phone in action as soon as you saw the issue, because the timestamp of the video might have helped show them that you didn't have the phone for very long before the problem started (just something to remember in the future). The problem is that there's no definitive way to prove that the phone wasn't exposed to water while in your possession, so it's essentially your word against theirs.\nWhen you talk to a higher level of customer service, try buttering them up and talk about how excited you were to get your 7X, and how you were hoping to continue using Honor products in the future. Ask them if there's anything they can do to help you remain a Huawei/Honor customer. Good luck!", "time": "01-23-2018 04:20 PM", "replies": []}]}, {"title": "Honor 7x on amazon?", "thread": [{"postID": "post6120294", "text": "So when did the 7x launch? I am a current VZW line holder who is thinking of making the jump to AT&T or Cricket so this opens a whole new world of phones for me. I currently run a Moto Z Play, and have heard its tough getting it over to AT&T. I don't need the newest processor, as im mostly on social media and tapatalk forums. No games. \nThe 7x, Nokia 6, Le Max 2, and RedMi note 4 seems like the favorites, but I'd like to purchase via amazon and the 7x isn't on there yet. I see the 6x, but don't want to buy it when its almost the same price and outdated already.", "time": "12-28-2017 10:01 AM", "replies": []}, {"postID": "post6120424", "text": "I have the honor 7x and it has a poor GPU.", "time": "12-28-2017 12:12 PM", "replies": [{"postID": "post6120470", "text": "care to elaborate on this? Seems the Kirin 629 is a pretty good processor.", "time": "12-28-2017 12:40 PM", "replies": [{"postID": "post6120888", "text": "Yes, elaborate please. Bad processor for doing what?", "time": "12-28-2017 09:40 PM", "replies": []}]}, {"postID": "post6120535", "text": "I, too, would like to know what you think is wrong with the GPU. Are you seeing frame drops in regular use (stuttering on the home screen, that sort of thing), problems streaming video, playing games, etc.? I’m just trying to determine whether you’re seeing the sorts of things I could forgive in such an inexpensive device.", "time": "12-28-2017 01:33 PM", "replies": []}]}, {"postID": "post6121249", "text": "Hello! Hopefully the 7X will come to Amazon soon! In my experience, they seem to be pretty good at getting devices out there; however, I understand your wanting to wait to get the device you want and not get another one like the 6X.\nAlso, I must say, I do like the devices you've mentioned. The Redmi, Nokia, and Honor devices are all great phones that I feel are underrated.", "time": "12-29-2017 08:38 AM", "replies": []}, {"postID": "post6122014", "text": "I suspect that honor will provide these phones to all vendors at the same time", "time": "12-29-2017 11:16 PM", "replies": []}, {"postID": "post6123426", "text": "I too am looking forward to upgrading my 6x to the 7x.", "time": "12-31-2017 04:08 PM", "replies": [{"postID": "post6123481", "text": "What features are making you excited about upgrading from the honor 6x to the honor 7x?", "time": "12-31-2017 05:33 PM", "replies": [{"postID": "post6124232", "text": "Mainly the all metal body, the 18:9 display and an oleophobic coating with gorilla glass. All of those things plus a slight boost in processing power and the potential for Android Oreo make it worth it for me.", "time": "01-01-2018 05:09 PM", "replies": [{"postID": "post6124745", "text": "Doesn't the 6x have an all metal body and oleophobic coating as well?", "time": "01-02-2018 10:40 AM", "replies": [{"postID": "post6125338", "text": "The top and bottom of the phone is plastic and it's not a unibody design. The screen is also an undisclosed 2.5D type that has shown to scratch at a mose 4, which means keys, coins etc;. It also has no oleo.", "time": "01-02-2018 09:27 PM", "replies": [{"postID": "post6126008", "text": "Thanks for the information! I didn't know that it wasn't a full metal construction! I am also surprised about the no oleophobic coating. Ugh.", "time": "01-03-2018 03:27 PM", "replies": []}]}]}]}]}]}, {"postID": "post6130768", "text": "It’s up for pre-order on Amazon in the US for January 25th release. $199.", "time": "01-08-2018 07:07 PM", "replies": [{"postID": "post6131569", "text": "Thanks for the update. I actually went with the Moto G5 and I like it. Going to give the 7x a couple months and go from there.", "time": "01-09-2018 03:02 PM", "replies": [{"postID": "post6131694", "text": "The Moto G5 is indeed an excellent phone for the price. I bought the G5S Plus on sale about a month ago and absolutely love it!", "time": "01-09-2018 06:13 PM", "replies": []}]}]}, {"postID": "post6143138", "text": "Honor 7x has been available on Amazon for over a week now. https://www.amazon.com/Honor-7X-full...cUvbUpU6143138", "time": "01-22-2018 04:04 PM", "replies": []}, {"postID": "post6143655", "text": "For preorder on US Amazon- yes. I just noticed it is now in stock as of today- a few days early  Bought mine last week from Honor- very impressive phone so far.", "time": "01-23-2018 08:00 AM", "replies": []}]}, {"title": "Best Tempered Glass for Honor 7X", "thread": [{"postID": "post6131113", "text": "So I got my blue 7x last month and and since then I'm trying to find best tempered glass for 7x. I had tried 3 local tempered glasses and fit are not good. They don't stick on the edges and dust gets in there pretty quickly. Now last week I was comparing my 7x with my brother's OP5t and noticed that these 2 has almost identical screen size. So I tried OP5t's tempered glass on my 7x and guess what it's fits perfectly. I tried two local made 5t's glasses on 7x and can confirm that if you can't find proper 7x glass, you can use 5t's. In some market not many 7x's tempered glasses are available but you can find plenty of for 5t. You can even get a branded one for 5t and use with 7x.", "time": "01-09-2018 06:57 AM", "replies": [{"postID": "post6135112", "text": "please post a picture", "time": "01-13-2018 07:25 AM", "replies": []}]}, {"postID": "post6143145", "text": "I've personally used the Nillkin tempered glass on my 7x for over a month now. No halo affect. Just doesnt cover the 2.5D glass", "time": "01-22-2018 04:07 PM", "replies": []}, {"postID": "post6143360", "text": "Cool beans! Yes, please post a picture!", "time": "01-22-2018 08:02 PM", "replies": []}]}, {"title": "Just got my Honor 7x", "thread": [{"postID": "post6111274", "text": "I just got it in guys", "time": "12-18-2017 07:07 PM", "replies": []}, {"postID": "post6111286", "text": "", "time": "12-18-2017 07:22 PM", "replies": []}, {"postID": "post6111405", "text": "Nice!\nThanks for posting the pictures.\nLet us know how you like it.", "time": "12-18-2017 10:35 PM", "replies": []}, {"postID": "post6111482", "text": "Nice. Looking forward, to your posts about how it's working out for you. Have fun customizing and playing.", "time": "12-19-2017 12:25 AM", "replies": []}, {"postID": "post6112327", "text": "Congratulations on you new 7x! Play with it a bit and let us know how it is working for you!", "time": "12-19-2017 06:13 PM", "replies": []}, {"postID": "post6112649", "text": "The screen on this is phenomenal for $200.", "time": "12-19-2017 11:43 PM", "replies": []}, {"postID": "post6114596", "text": "Can it do group text?", "time": "12-21-2017 11:39 PM", "replies": [{"postID": "post6115109", "text": "Yes.", "time": "12-22-2017 12:17 PM", "replies": []}]}, {"postID": "post6114993", "text": "CONGRATS. Of course, you can now make some of us feel like suckers for paying so much more!!!!!", "time": "12-22-2017 10:27 AM", "replies": []}, {"postID": "post6118794", "text": "Yeah the videos and comparisons I've seen are great.", "time": "12-26-2017 07:46 PM", "replies": [{"postID": "post6119316", "text": "I don't usually watch video reviews... Which one would you recommend for the honor 7x?", "time": "12-27-2017 10:49 AM", "replies": []}]}, {"postID": "post6118818", "text": "So glad you are loving it! Congratulations on your Honor 7X! \nAlso, please post some pictures taken with your 7X's camera, so we can see it in action! Enjoy!", "time": "12-26-2017 08:19 PM", "replies": [{"postID": "post6119318", "text": "Yes we would love to see the dual back camera in action!", "time": "12-27-2017 10:50 AM", "replies": []}]}, {"postID": "post6120268", "text": "I'm really interested in this phone, but would like to see a few more user reviews before I place an order. Keep us posted, please!", "time": "12-28-2017 09:33 AM", "replies": [{"postID": "post6120359", "text": "I wouldn't mind more reviews about it either. I think Android Central has posted some things about it!", "time": "12-28-2017 11:21 AM", "replies": [{"postID": "post6120491", "text": "Here is the Android Central video reviewhttps://www.google.com/amp/s/www.and...x-review%3famp", "time": "12-28-2017 12:59 PM", "replies": [{"postID": "post6120533", "text": "Thanks for sharing the link!\nI’m just waiting for a few more regular folks to review it or at least post their impressions here.", "time": "12-28-2017 01:31 PM", "replies": [{"postID": "post6120949", "text": "Most definitely. It is hard to find those but there are some professional reviews that you can watch in the mean time on YouTube.", "time": "12-28-2017 11:08 PM", "replies": []}]}, {"postID": "post6120801", "text": "Awesome, thanks!!", "time": "12-28-2017 07:10 PM", "replies": []}]}]}]}, {"postID": "post6128791", "text": "I recently purchased an Honor 7X in UK blue colour. My verdict is 8 out of 10. Build quality is fantastic,screen is very bright,vibrant and colours accurate but has a brightness dim at angles. Performance is good but there is some stutter sadly but it's not terrible,can be fixed with updates. Battery life is ok ish not as good as expected. Camera was a nice surprise,good sharpness and fair amount of detail although some sharpening is noticed. Lowlight not bad. Front camera is terrible has poor detail and often blurry even without beauty mode and bokeh enabled. I had 4 gig 64 gig model but sadly had to return mine to online retailer. I had many issues including settings constantly crashing and taking ages to open,tried everything but nothing worked. Camera had a weird issue which had red and purple blotches on images. A reset fixed it but it returned. Another issue I had was touch screen acting erratic in cold weather,often resulting in touches acting as swipes and notification swipe down would always flick back up again. These issues frustrated me too much . See attached image for camera issue", "time": "01-06-2018 01:45 PM", "replies": []}, {"postID": "post6128990", "text": "I wonder if there's a difference in firmware between my US version (32 GB storage and 3 GB RAM) and the ones available in other countries. With the exception of a few odd stutters, mine is as smooth and responsive as many phones that cost 2-3 times as much.", "time": "01-06-2018 06:32 PM", "replies": []}, {"postID": "post6140513", "text": "Curious how you folks enjoy having a phone with a outdated WiFi radio. I'm baffled by how they use a single band, 2.4 gHz radio when today, 5 gHz AC is far less crowded and faster. My 5 year old Sammy has a dual band radio, ha ha", "time": "01-19-2018 12:58 PM", "replies": [{"postID": "post6140564", "text": "Hasn't made any difference for me. I'm too far from my router most of the time to get decent signal strength on 5 GHz.\nThis is a discount handset, so I'm willing to compromise a bit on specs. It doesn't offer wireless charging, 5 GHz WiFi, or NFC, but the processor is plenty fast, build quality is as good as flagships from the big boys, and the screen is quite good for $200.", "time": "01-19-2018 01:52 PM", "replies": []}, {"postID": "post6141560", "text": "Yes you've already posted this multiple times. The \"haha\" seems extra fake when you've posted the same thing so many times. BTW 2.4 ghz wifi is fine, and has longer range than 5ghz and penetrates walls better. I can post a video of 50 mbps download speed on my 2.4 ghz-only router. That's my speed cap, so it could go higher although I think many phone wifi chips are throttled anyway?", "time": "01-20-2018 09:15 PM", "replies": []}]}, {"postID": "post6140517", "text": "Most wouldn't know the difference. I knew going into it but didn't notice a thing using it on Wifi at my house. I set the whole phone up using Wifi.", "time": "01-19-2018 01:04 PM", "replies": []}]}, {"title": "Having sound problems in Android Auto? Try this", "thread": [{"postID": "post6140502", "text": "FYI- received my USA Honor 7x yesterday. I'll try to have a brief review of it soon here. I did come across an unusual issue with the phone concerning the sound quality when using Google Play Music in Android Auto. The sound was horrible- very flat and no bass. When I switched to bluetooth it sounded fine. I also switched cables and it made no difference. After playing with multiple settings I figured out it was the Huawei Histen sound effects setting for the headset that caused this. You need to plug in a pair of headphones, make sure the setting is turned off, unplug the headphones then start Android Auto. Very strange issue but this seems to have solved everything. I thought I should post this in case others have this issue. I assume once US Amazon gets this in stock this forum is going to take off and someone will have this issue.", "time": "01-19-2018 12:45 PM", "replies": []}]}, {"title": "honor 7x notification not showing in my home screen", "thread": [{"postID": "post6137738", "text": "i just bought the new honor 7x yesterday the middle east version with 64gb and 4gb ram and notification not showing in my home screen although i went to settings and selected to show but still no notifications", "time": "01-16-2018 09:20 AM", "replies": []}]}, {"title": "Color preference Blue vs black?", "thread": [{"postID": "post6113276", "text": "I'm actually torn between which color to get. All black is always sleek, but the blue also seems quite nice.", "time": "12-20-2017 02:00 PM", "replies": []}, {"postID": "post6113279", "text": "I'd say Black.", "time": "12-20-2017 02:04 PM", "replies": []}, {"postID": "post6114749", "text": "Blue.That's what i have got. But i would say to go black", "time": "12-22-2017 05:44 AM", "replies": []}, {"postID": "post6115478", "text": "Blue all the way. I find black boring.", "time": "12-22-2017 08:13 PM", "replies": []}, {"postID": "post6116686", "text": "Blue, blue. From the first time I saw it, I fell in love.", "time": "12-24-2017 04:06 AM", "replies": []}, {"postID": "post6117411", "text": "Blue is better than Black imo because 7x has some kind of anti-fingerprint coating on the back. Blue color also helps in hiding fingerprint. You can hardly see any fingerprint on blue color. And I have seen many YouTube videos where black color easily gets fingerprints. So go for blue. BTW I'm loving my blue 7x.", "time": "12-25-2017 06:24 AM", "replies": [{"postID": "post6118495", "text": "That's a good point. Black usually is much worse at showing fingerprints.", "time": "12-26-2017 01:10 PM", "replies": []}]}, {"postID": "post6118788", "text": "Cool, thanks for the input. I like the blue, just because it was more aestically pleasing. But the info about the fingerprints, just helps cement opinion about the blue.", "time": "12-26-2017 07:41 PM", "replies": []}, {"postID": "post6118822", "text": "Honor does make a very slick black device... Maybe go for blue, though? Honor's colours seem to be more vibrant than other blues, blacks, whites, etc - at least, in my opinion.", "time": "12-26-2017 08:23 PM", "replies": []}, {"postID": "post6118937", "text": "Also black honor 7x has somewhat grayish antenna lines. Which sticks out lot more than dark blue antenna lines of blue honor 7x. But it's all about personal preference. Blue's antenna lines blends in well imo.", "time": "12-27-2017 12:19 AM", "replies": []}, {"postID": "post6125194", "text": "I ordered the blue one, and it arrives tomorrow. I rarely get anything but black, so this is a bit radical for me!\nI’ve just checked their store, and they’re sold out of blue. It looks like I ordered mine just in time!", "time": "01-02-2018 05:19 PM", "replies": [{"postID": "post6127654", "text": "That's great that you got your blue version just in time! (Heh, I wrote \"Blue Version\" - any Pokémon fans here? 😃) Let us know how you are liking it!", "time": "01-05-2018 09:11 AM", "replies": [{"postID": "post6127689", "text": "I like it \nI'm planning to do a mini-review before this weekend is over.", "time": "01-05-2018 09:55 AM", "replies": [{"postID": "post6127744", "text": "Sweet, I can not wait to read your review!", "time": "01-05-2018 10:34 AM", "replies": []}]}]}, {"postID": "post6127743", "text": "Awesome! Glad that you were able to get the blue before it ran out of stock!", "time": "01-05-2018 10:33 AM", "replies": []}]}]}, {"title": "Confirmed: Working Gyroscope on the Honor 7x", "thread": [{"postID": "post6125260", "text": "Im Chris, the new community manager for Honor USA. Hoping to get more involved here and interact with you all.\nWould like to share with everyone that after the most recent OTA update for the Honor 7x, there is now a detected and working gyroscope. \nInstall VR Services from the playstore\nNow you'll get to enjoy VR content and even more games that utilize this sensor!", "time": "01-02-2018 07:09 PM", "replies": []}, {"postID": "post6125267", "text": "Good find... thanks for sharing!\nWhat OS version and security patch level did you receive with the latest OTA, and where are you located?", "time": "01-02-2018 07:21 PM", "replies": [{"postID": "post6125272", "text": "Im in the US, using L24 US variant. \nI came across this but the last OTA was a couple weeks ago.\nDecember 1 security patch and still 7.0\nL24C567B130", "time": "01-02-2018 07:35 PM", "replies": [{"postID": "post6125274", "text": "Well, at least it’s the December security patch. That’s better than nothing, I suppose.", "time": "01-02-2018 07:37 PM", "replies": [{"postID": "post6126012", "text": "December is pretty good, considering that the pixels just got January a few days ago.", "time": "01-03-2018 03:30 PM", "replies": []}]}]}, {"postID": "post6126011", "text": "That's awesome Chris! Thanks for confirming this. Have you had any first hand experience with vr on the 7x?", "time": "01-03-2018 03:29 PM", "replies": [{"postID": "post6126194", "text": "Unfortunately, moving to Ca has caused most of my stuff to still be packed (including my google cardboards). I opened a 360 YT video and was able to view, as well as google cardboard and move the phone around.", "time": "01-03-2018 07:56 PM", "replies": [{"postID": "post6127753", "text": "That's pretty awesome! Thanks for checking on it for me!", "time": "01-05-2018 10:39 AM", "replies": []}]}]}]}]}, {"title": "Honor 7x broken screen", "thread": [{"postID": "post6122283", "text": "Hey guys. Just made an account to post this. Got my girlfriend an Honor 7x for Christmas and gave it to her last night (late Xmas celebrations) Super impressed with the phone and was very happy with the purchase. It came with a crappy case that really didn't fit the phone. Was about to order a better case.It fell out of her pocket while getting out of her SUV. Screen is now broken. Looking for advice of how to fix it. Looking on YouTube the 7x screen replacement looks a bit hard to do...", "time": "12-30-2017 10:07 AM", "replies": []}, {"postID": "post6123546", "text": "Have you tried to contact honor? They could give you can estimate as to how much a screen replacement would be", "time": "12-31-2017 07:48 PM", "replies": []}, {"postID": "post6123982", "text": "Hey Doug please let me know if warranty covers screen replacement P. S I have a broken screen as well", "time": "01-01-2018 12:24 PM", "replies": []}, {"postID": "post6127077", "text": "I thought if you did the pre-order there was some extra warranty? Can you find out if Honor will replace it for a minimal charge?", "time": "01-04-2018 05:24 PM", "replies": [{"postID": "post6127751", "text": "Oh i didn't know about that. That would be pretty sweet of true!", "time": "01-05-2018 10:37 AM", "replies": []}]}, {"postID": "post6127653", "text": "I too thought the order itself came with some kind of warranty. I too recommend contacting Honor for a replacement; especially before you start taking apart the screen, as that would certainly void any warranty.", "time": "01-05-2018 09:10 AM", "replies": []}]}, {"title": "Anyone using two SIM cards?", "thread": [{"postID": "post6125198", "text": "As the subject says... is anyone using two SIMs? I understand that only one of them can be designated for mobile data use. Does that mean that the second SIM runs in 2G?", "time": "01-02-2018 05:22 PM", "replies": [{"postID": "post6126016", "text": "I believe so but you can check with Chris, the community manager for honor usa to verifyhttps://forums.androidcentral.com/sh....php?p=6125260", "time": "01-03-2018 03:34 PM", "replies": [{"postID": "post6126017", "text": "I’ll find out soon enough. Mine is on a UPS truck and will be here within the next two hours", "time": "01-03-2018 03:35 PM", "replies": []}]}]}, {"postID": "post6127703", "text": "My phone arrived as expected on Wednesday, and I spent the evening getting it configured according to my preferences. I put both SIMs into their appropriate slots before booting for the first time, then booted and went through the setup routine, which included a dual-SIM configuration step right before launching the homescreen for the first time. Either of the SIMs can be designated as the primary data SIM, and they can be switched on the fly, provided that the APNs for each are configured correctly. It also provides a setting to enable call forwarding from one SIM to another during active phone calls - very impressive! I'll post screenshots in my upcoming mini-review. Suffice it to say, I'm very impressed with what this device offers for a mere $200!", "time": "01-05-2018 10:07 AM", "replies": [{"postID": "post6127748", "text": "That's pretty awesome how they set up the dual sim!\nI am assuming that you cannot use the dual sims and sd card simultaneously?", "time": "01-05-2018 10:36 AM", "replies": [{"postID": "post6127750", "text": "That's correct - it's either dual-SIM, or single-SIM plus SD card.", "time": "01-05-2018 10:37 AM", "replies": []}]}]}]}, {"title": "How much is the Honor 7X?", "thread": [{"postID": "post6097898", "text": "Is it really just a couple hundred bucks? What's the exact price - needing to know haha", "time": "12-06-2017 01:31 PM", "replies": []}, {"postID": "post6099863", "text": "$199.99 on Honor website. Link is below. Right now they are having a pre-sale and throwing in a case. Along with if your order number is 7, 77, 177, 277 and so forth they will refund you the purchase price.http://forums.androidcentral.com/e?l...token=4tvFwphA", "time": "12-07-2017 11:11 PM", "replies": [{"postID": "post6121251", "text": "WOW what a great deal!", "time": "12-29-2017 08:41 AM", "replies": []}]}, {"postID": "post6122010", "text": "Did anyone here get it for free by being the 7,77,etc?", "time": "12-29-2017 11:11 PM", "replies": [{"postID": "post6122044", "text": "I'd be interested in knowing that, too! I think it's really cool that Honor did that. Makes buying one even more exciting!", "time": "12-29-2017 11:42 PM", "replies": [{"postID": "post6122048", "text": "It is like playing the lottery but with better odds!", "time": "12-29-2017 11:48 PM", "replies": []}]}]}, {"postID": "post6124234", "text": "7 is a considered a lucky number in most parts of Asia and China specifically.", "time": "01-01-2018 05:13 PM", "replies": [{"postID": "post6124743", "text": "Good point. I wonder how many where influenced to buy it simply because it had a 7 in the name.", "time": "01-02-2018 10:39 AM", "replies": []}, {"postID": "post6127655", "text": "Oh right. That's cool. Might make buying a phone more exciting for them!", "time": "01-05-2018 09:12 AM", "replies": []}]}]}, {"title": "US Honor 7X with AT&T LTE", "thread": [{"postID": "post6121639", "text": "Does anyone have the US version on AT&T? Does it work with LTE? Thanks.", "time": "12-29-2017 03:01 PM", "replies": []}, {"postID": "post6122007", "text": "I don't have it but based on the specs, it should work with att lte", "time": "12-29-2017 11:08 PM", "replies": [{"postID": "post6122236", "text": "Yes, it should... according to phonescoop.com, the 7X provides access to bands 2, 4, 5 and 12, which are AT&T's basic LTE bands.", "time": "12-30-2017 08:50 AM", "replies": [{"postID": "post6123485", "text": "Is there any data on that carrier aggregation options the 7x will support?", "time": "12-31-2017 05:36 PM", "replies": [{"postID": "post6123734", "text": "Not that I’ve seen. It would be surprising to find that in a budget handset, but I have a feeling we’re getting closer as the distinction between top- and mid-range phones continues to fade.", "time": "01-01-2018 06:08 AM", "replies": [{"postID": "post6124212", "text": "Most definitely. Carrier aggregation, qam 256 and MIMO 4x4 are pretty important when you are in a marginal area", "time": "01-01-2018 04:32 PM", "replies": []}]}]}]}]}, {"postID": "post6122652", "text": "I was wondering the same thing, thanks for posting.", "time": "12-30-2017 05:24 PM", "replies": []}]}]
[{"title": "Honor 7X versus Mi A1 or Redmi 5 Plus", "thread": [{"postID": "post6099858", "text": "What is your take on Honor 7X versus these two phones from Xiaomi?\nMi A1 is a solid contender with dual cameras, clean AndroidOne software experience from Google, great build quality.\nRedmi 5 Plus has a slightly larger screen and a massive battery. \nAlso Xiaomi devices have 4GB RAM and Snapdragon 625.https://www.phonearena.com/phones/co...48,10592,10754\nSound off your thoughts below.", "time": "12-07-2017 11:08 PM", "replies": []}, {"postID": "post6106193", "text": "I got my son a Mi A1 last week exchanging for his old phone . I have not used the other two phones. I preferred the Mi A1 over the 5 plus as it has a clean stock Android experience and promise of regular updates. The phone received the Nov security patch while setting it up and Dec security patch 2 days ago. The phone, so far, is working fine and has no lags . My son has not used it a lot but he seems to be satisfied with it.", "time": "12-13-2017 07:12 PM", "replies": [{"postID": "post6111103", "text": "That's great to hear. I had the Mi A1 for a few weeks earlier this year and enjoyed it. Luckily one of the few Chinese devices to get LTE on TMO and not HSPA/H+ data speeds.", "time": "12-18-2017 03:55 PM", "replies": [{"postID": "post6112329", "text": "There are a few Chinese manufacturers who make devices that get lte on tmobile like Huawei, lenovo/Motorola, zte.", "time": "12-19-2017 06:16 PM", "replies": [{"postID": "post6112342", "text": "Yup. Actually I got LTE on my Umidigi Z1 Pro as well.", "time": "12-19-2017 06:27 PM", "replies": [{"postID": "post6112578", "text": "Good to hear. Lte is a public standard so anyone can implement it without paying a licensing fee.", "time": "12-19-2017 10:37 PM", "replies": [{"postID": "post6112600", "text": "Besides Mi Mix, Mix 2, Mi Note 2 and Mi A1 the only non Huawei, ZTE phone that got LTE.\nOther Chinese brands such as Meizu, Leagoo, Elephone, Oukitel etc are no go for LTE in USA on TMO and ATT.", "time": "12-19-2017 10:54 PM", "replies": [{"postID": "post6113442", "text": "Lenovo under it's motorola brand releases plenty of unlocked phones here", "time": "12-20-2017 06:23 PM", "replies": [{"postID": "post6113448", "text": "My comment was for Chinese devices not sold directly in the USA.", "time": "12-20-2017 06:26 PM", "replies": [{"postID": "post6115495", "text": "Ah ok. Thanks for the clarification. It makes sense though as why would they provide support for lte if the device isn't sold here?", "time": "12-22-2017 08:45 PM", "replies": [{"postID": "post6115504", "text": "Yup. But it's nice to get some phones to try out here and if they get LTE. Mi Mix series is really a great device, not sold in USA.", "time": "12-22-2017 09:12 PM", "replies": [{"postID": "post6115505", "text": "That's true. I would love to try one. Does it get volte and wfc?", "time": "12-22-2017 09:17 PM", "replies": [{"postID": "post6115955", "text": "I got VoLTE but not WiFi calling.", "time": "12-23-2017 10:33 AM", "replies": [{"postID": "post6116027", "text": "That's not bad. at least you get volte. Not many unlocked phones get Wi-Fi calling anyway", "time": "12-23-2017 11:49 AM", "replies": [{"postID": "post6116044", "text": "It would be nice if the Honor 7X gets WiFi calling.", "time": "12-23-2017 12:04 PM", "replies": [{"postID": "post6116087", "text": "Although it would definitely be great if it did, I honestly don't see it happening,unless it becomes a carrier phone.", "time": "12-23-2017 12:55 PM", "replies": [{"postID": "post6116088", "text": "Works on Pixel without it being a carrier phone. Worked on the LeEco series as well so it would be nice if Honor 7X had it.", "time": "12-23-2017 12:56 PM", "replies": [{"postID": "post6116250", "text": "I am not surprised about Google but le leco is a bit surprising.\nStill, the issue with Huawei, especially when you are on tmobile, is that the two companies aren't on the best of terms since tmobile accused Huawei of stealing proprietary technology and Huawei sued tmobile over patent infringement.", "time": "12-23-2017 04:56 PM", "replies": []}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}]}, {"postID": "post6111282", "text": "We are in India and here phones are unlocked. \nMi is testing the Oreo beta in India and I hope the phone gets Oreo update at the end of this month before he goes back for his semester.", "time": "12-18-2017 07:12 PM", "replies": [{"postID": "post6111407", "text": "That's sounds great.", "time": "12-18-2017 10:36 PM", "replies": []}]}, {"postID": "post6116217", "text": "I've always had contract devices from major manufacturers. I sold my iPhone and got an Honor 6x, and I love it. Its unlocked, so when I upgrade, I won't owe anything and it works great on TMO.", "time": "12-23-2017 03:53 PM", "replies": [{"postID": "post6116317", "text": "You don't have to worry about service contract phones anymore... Carriers did away with it.", "time": "12-23-2017 06:04 PM", "replies": [{"postID": "post6116718", "text": "You still have device payment agreements, which is what I meant rather than a service contract. Sorry.", "time": "12-24-2017 05:52 AM", "replies": [{"postID": "post6118529", "text": "Ah ok. I am OK with device payment agreements depending on the terms...if I can pay off anytime without losing anything then I don't have a problem. But some deals require bill credits which you lose if you pay off the phone early", "time": "12-26-2017 01:38 PM", "replies": [{"postID": "post6118535", "text": "Yeah, I prefer to avoid bill credits. Unfortunately I was sucked into such a deal with my iPhone 7 and that’s the only reason I’ve avoided paying it off. Lesson learned, I guess.", "time": "12-26-2017 01:45 PM", "replies": [{"postID": "post6118575", "text": "It is also a pain to sell financed devices. Swappa doesn't let you do it,which is my preferred place of selling devices. There are other places to sell of course but I don't like using them", "time": "12-26-2017 02:45 PM", "replies": []}, {"postID": "post6120948", "text": "Same here but I am going to pay it off next month and move my service. This iPhone is for a family member. I only use unlocked devices.", "time": "12-28-2017 11:06 PM", "replies": [{"postID": "post6120966", "text": "Oh you are looking to move your service? What do you have now and what are you looking to move to?", "time": "12-28-2017 11:23 PM", "replies": [{"postID": "post6120967", "text": "I'm going to ditch TMO and go to Mint SIM.", "time": "12-28-2017 11:24 PM", "replies": [{"postID": "post6120975", "text": "Oh that should work well. Mint is A Tmobile mobile virtual network operator so it should get similar to what you you were getting on tmobile, although, you might get de prioritized over tmobile customers", "time": "12-28-2017 11:28 PM", "replies": [{"postID": "post6120976", "text": "Yeah but it should save me some $$ per month. The line I am switching doesn't use too much data to begin with.", "time": "12-28-2017 11:29 PM", "replies": [{"postID": "post6120981", "text": "Right, mobile virtual network operators are usually cheaper because they have no infrastructure of their own and piggyback on a larger carrier", "time": "12-28-2017 11:32 PM", "replies": []}]}]}]}]}]}]}]}]}]}]}, {"postID": "post6122812", "text": "Mi A1 is getting the Oreo update right now here in India.", "time": "12-30-2017 09:43 PM", "replies": [{"postID": "post6122830", "text": "Yup, I saw that yesterday.", "time": "12-30-2017 10:09 PM", "replies": [{"postID": "post6122890", "text": "My son checked his phone today morning and found a 'security update' notification of 1100 MB size . It wasn't there when he had checked last night before going to bed.\nAfter downloading and installing he found his phone on 8.0\nThe process was very quick and smooth.\nIt's nice that Xiaomi kept their promise of providing the update by the end of 2017 and he got the update before going back for his semester on 3rd Jan.", "time": "12-30-2017 11:45 PM", "replies": [{"postID": "post6123483", "text": "Wow they were cutting it close but hey, they did meet their promise so that is good news", "time": "12-31-2017 05:35 PM", "replies": []}]}]}]}]}, {"title": "How much will it cost?", "thread": [{"postID": "post6078216", "text": "Would anyone like to speculate on how much the 7X will cost once it hits the shelves in the US (or anywhere else for that matter)?", "time": "11-20-2017 11:54 AM", "replies": []}, {"postID": "post6078223", "text": "My guess is $275.", "time": "11-20-2017 12:03 PM", "replies": []}, {"postID": "post6078225", "text": "$299 in the US", "time": "11-20-2017 12:08 PM", "replies": []}, {"postID": "post6079136", "text": "Probably similar to 6x when it came out. Starting base at $250 usd", "time": "11-21-2017 01:19 AM", "replies": []}, {"postID": "post6079828", "text": "I would guess $225", "time": "11-21-2017 01:53 PM", "replies": []}, {"postID": "post6079868", "text": "If it's $250 or less, I'd most likely buy one. That's a steal!", "time": "11-21-2017 02:16 PM", "replies": [{"postID": "post6079910", "text": "Imo, higher than $250 is a mistake.", "time": "11-21-2017 02:46 PM", "replies": [{"postID": "post6080186", "text": "I agree. I just picked up a Moto G5S Plus and it’s very good for the price I paid ($239). It’d be hard to justify charging much more than that for the 7X, especially considering that Huawei/Honor are trying to make names for themselves in the US market.", "time": "11-21-2017 05:13 PM", "replies": [{"postID": "post6080248", "text": "Yeah I used moto pricing as a baseline.", "time": "11-21-2017 05:41 PM", "replies": [{"postID": "post6080255", "text": "They offer one of the best pricing out there indeed", "time": "11-21-2017 05:52 PM", "replies": [{"postID": "post6080280", "text": "Right and honor competing in the usa will have to compete with them. Especially since most people know Motorola and honor is a relative unknown", "time": "11-21-2017 06:07 PM", "replies": []}]}]}, {"postID": "post6080254", "text": "The Moto lines are a great competition against the 7X and other budget phones", "time": "11-21-2017 05:51 PM", "replies": [{"postID": "post6080281", "text": "Yup. I hope honor does some great pricing here", "time": "11-21-2017 06:07 PM", "replies": []}, {"postID": "post6080312", "text": "I just wish Moto would make a dual-SIM edition of at least one of their mid- to low-end phones. I know that’s less popular here than it is in other countries, but it would be convenient for folks who, like me, manage separate lines for work and personal use.", "time": "11-21-2017 06:31 PM", "replies": [{"postID": "post6080418", "text": "There are dual sim versions but they are the international models", "time": "11-21-2017 08:09 PM", "replies": [{"postID": "post6080457", "text": "Ah that's nice to know", "time": "11-21-2017 08:30 PM", "replies": [{"postID": "post6081574", "text": "Yup. And at least some have usa lte so they will work.. But warranty could be an issue", "time": "11-22-2017 05:07 PM", "replies": []}]}]}, {"postID": "post6080449", "text": "I though they offer dual sim phones ?", "time": "11-21-2017 08:29 PM", "replies": [{"postID": "post6081572", "text": "Yes they do but not usa ones", "time": "11-22-2017 05:05 PM", "replies": [{"postID": "post6081712", "text": "Gotchu. Thanks", "time": "11-22-2017 07:33 PM", "replies": []}]}]}]}]}]}]}]}, {"postID": "post6080013", "text": "Budget phones are getting closer to that $200 mark. Amazing how these budget phones perform for such a low cost.", "time": "11-21-2017 03:34 PM", "replies": [{"postID": "post6080247", "text": "That is true. A lot has changed in the last few years", "time": "11-21-2017 05:40 PM", "replies": []}, {"postID": "post6121253", "text": "Absolutely! It makes one rethink paying four or even five times as much for a phone that basically does the same thing; save for some bells and whistles and additional features like waterproofing, etc.", "time": "12-29-2017 08:43 AM", "replies": [{"postID": "post6122009", "text": "You are paying a large premium for not as much better phone for sure. Think that most people could be happy with it if they were looking for a basic Android phone", "time": "12-29-2017 11:11 PM", "replies": [{"postID": "post6122043", "text": "Absolutely. More bang for your buck is the way to go, in my opinion.", "time": "12-29-2017 11:41 PM", "replies": [{"postID": "post6122051", "text": "Most definitely. Technology has really progressed that a $200 phone performs very adequate. The honor 7x performs between the note 4 and note 5 in synthetic benchmarks.", "time": "12-30-2017 12:04 AM", "replies": [{"postID": "post6122189", "text": "Wow, that's amazing!!", "time": "12-30-2017 07:24 AM", "replies": []}]}]}]}]}]}, {"postID": "post6080285", "text": "Both phones offers great experience so it really does come down to the price.", "time": "11-21-2017 06:09 PM", "replies": [{"postID": "post6080416", "text": "It also depends on what you like, Moto is a closer to stock android and Huawei has emui", "time": "11-21-2017 08:08 PM", "replies": [{"postID": "post6080454", "text": "That too. Always a big debate between android skins vs stock", "time": "11-21-2017 08:30 PM", "replies": [{"postID": "post6081573", "text": "That's what's great about Android, you have so many choices", "time": "11-22-2017 05:06 PM", "replies": [{"postID": "post6081714", "text": "One of the best thing about Android. Absolutely love it", "time": "11-22-2017 07:33 PM", "replies": []}]}]}]}]}, {"postID": "post6096566", "text": "$199 for Early Bird offer. Pretty decent price, IMO.\nDelivery expected December 15th for USA.", "time": "12-05-2017 10:36 AM", "replies": []}, {"postID": "post6096879", "text": "$200 is a bargain", "time": "12-05-2017 04:08 PM", "replies": []}]}, {"title": "Who has received their 7X? Post pictures of your start screen here.", "thread": [{"postID": "post6108053", "text": "So looks like today might be the first day the pre-orders should start shipping or potentially showing up.\nSo who has gotten one?\nPlease post pictures / screenshots of your start screen(s) here.", "time": "12-15-2017 03:42 PM", "replies": []}, {"postID": "post6108092", "text": "It just went on sale today in the US, and I bought one for my daughter. How soon will I get it? My first purchase with Huawei.", "time": "12-15-2017 04:10 PM", "replies": [{"postID": "post6111099", "text": "Let us know once you receive it.", "time": "12-18-2017 03:53 PM", "replies": []}]}, {"postID": "post6108096", "text": "Looking forward to seeing these, in the wild.", "time": "12-15-2017 04:13 PM", "replies": []}, {"postID": "post6108112", "text": "Mine arrives the 19th", "time": "12-15-2017 04:51 PM", "replies": [{"postID": "post6111098", "text": "Please post a picture once you receive it tomorrow!", "time": "12-18-2017 03:53 PM", "replies": []}]}, {"postID": "post6108217", "text": "Having used the 6x for a couple of weeks, I'm interested in the 7x if it has an oleophobic coating on the glass. if it does, I'm going to upgrade in a couple of months.", "time": "12-15-2017 07:39 PM", "replies": [{"postID": "post6108291", "text": "It does indeed have an oleophobic coating.", "time": "12-15-2017 09:20 PM", "replies": []}]}, {"postID": "post6111485", "text": "Got my 6x on 12/13. Loving it. But paying close attention to the 7x forums. If everyone is loving it, might just have to pass this along to a family member , and trade up. lol", "time": "12-19-2017 12:31 AM", "replies": [{"postID": "post6112326", "text": "Well the 7x is certainly a better looking device, I my opinion. Performance probably isn't a huge difference though.", "time": "12-19-2017 06:12 PM", "replies": []}]}, {"postID": "post6112678", "text": "7X also supports double tap to wake  I don't believe the 6x does.", "time": "12-20-2017 12:47 AM", "replies": [{"postID": "post6112684", "text": "I don't think so not on the 7X. The phone will wake up when you put your finger on the fingerprint scanner", "time": "12-20-2017 12:56 AM", "replies": []}]}, {"postID": "post6112703", "text": "Nevermind I was wrong. You have to dig through the menus", "time": "12-20-2017 01:55 AM", "replies": [{"postID": "post6113111", "text": "How is the battery life? You ran it down to 10%.", "time": "12-20-2017 11:19 AM", "replies": [{"postID": "post6113119", "text": "It's not too bad. I been trying to drain to 10% or less as one of my coworkers recommended me doing that to any new phone that I get", "time": "12-20-2017 11:23 AM", "replies": [{"postID": "post6113158", "text": "yeah its recommended you run down the battery, then charge up again. Repeat about 3 or 4 times to fully condition the battery.", "time": "12-20-2017 11:55 AM", "replies": []}, {"postID": "post6115474", "text": "Do you have any screen shots of the battery life?\nAlso you don't need to drain it down to 10% unless you are having a problem.", "time": "12-22-2017 08:08 PM", "replies": []}]}]}, {"postID": "post6118820", "text": "I wish my Honor 8 had double tap to wake! I miss that - my LG G3 had that feature and it was so convenient.", "time": "12-26-2017 08:22 PM", "replies": [{"postID": "post6119314", "text": "I prefer a front fps, or at least a home button activated with the screen off like on my note 8.", "time": "12-27-2017 10:47 AM", "replies": [{"postID": "post6119353", "text": "Yes, a front-facing fingerprint scanner definitely comes in handy!", "time": "12-27-2017 11:36 AM", "replies": [{"postID": "post6119389", "text": "It definitely is convenient especially when using the phone on a desk or a flat surface.", "time": "12-27-2017 12:03 PM", "replies": [{"postID": "post6119403", "text": "For sure! That's one reason why I really want a double tap to wake. At least if you have a rear-facing FPS, you can still check your notifications at a glance that way.", "time": "12-27-2017 12:25 PM", "replies": [{"postID": "post6120247", "text": "That is true. Although it would be nice to have the aod. But I am certainly not knocking the 7x on this due to the price range", "time": "12-28-2017 09:16 AM", "replies": [{"postID": "post6121230", "text": "AOD on the 7X would be pretty cool.", "time": "12-29-2017 08:19 AM", "replies": [{"postID": "post6122016", "text": "I would think that they could add it if enough people asked for it", "time": "12-29-2017 11:17 PM", "replies": []}]}]}]}]}]}]}, {"postID": "post6120264", "text": "I LOVE that feature on the LG G6!", "time": "12-28-2017 09:30 AM", "replies": [{"postID": "post6120357", "text": "That is one of the many reasons why I'm leaning towards LG for my next phone!", "time": "12-28-2017 11:20 AM", "replies": []}, {"postID": "post6120955", "text": "Does the lg g6 have the always on display?", "time": "12-28-2017 11:13 PM", "replies": [{"postID": "post6121229", "text": "Yes it does!", "time": "12-29-2017 08:18 AM", "replies": [{"postID": "post6122015", "text": "That is good to hear. Can you unlock it by touching on the aod like you can in the note 8?", "time": "12-29-2017 11:17 PM", "replies": [{"postID": "post6122047", "text": "I'm honestly unsure, as I do not own the G6. However, it also has double tap to wake; so perhaps that would have something to do with touching/not touching AOD to unlock the phone. Perhaps both features are present?", "time": "12-29-2017 11:43 PM", "replies": []}]}]}]}]}]}]}, {"postID": "post6113350", "text": "Why do battery myths like that still persist. 30-20% is sufficient and draining too low is not shown to be positive or negative. Most batteries operate on cycles anyways.", "time": "12-20-2017 03:51 PM", "replies": []}, {"postID": "post6114216", "text": "Yeah that draining the battery down to 10% is a myth that needs to go away.", "time": "12-21-2017 02:17 PM", "replies": []}, {"postID": "post6115111", "text": "here's the start screen. I typically use Nova Launcher.", "time": "12-22-2017 12:19 PM", "replies": []}, {"postID": "post6115658", "text": "No, sorry I get about 4 hours of screen on time.", "time": "12-23-2017 12:21 AM", "replies": [{"postID": "post6115680", "text": "Oh, that's a bit low for SOT, considering the specs of this phone", "time": "12-23-2017 12:37 AM", "replies": []}]}, {"postID": "post6115685", "text": "So the phone will last a day but don't expect it to last 2 days without a charge.", "time": "12-23-2017 12:40 AM", "replies": [{"postID": "post6116252", "text": "That's acceptable considering the rest of the phone.", "time": "12-23-2017 04:57 PM", "replies": []}]}, {"postID": "post6117414", "text": "Mine is getting around 5:30-6 hours sot", "time": "12-25-2017 06:30 AM", "replies": [{"postID": "post6118492", "text": "That's pretty good, especially considering the price point.", "time": "12-26-2017 01:08 PM", "replies": []}]}, {"postID": "post6117415", "text": "Man how do u post pictures in hear!!! I'm new to the forums so can't find my way around.", "time": "12-25-2017 06:33 AM", "replies": [{"postID": "post6118493", "text": "What are you using to post on the forums?", "time": "12-26-2017 01:09 PM", "replies": []}]}, {"postID": "post6118790", "text": "That's much better avg's. That's about what I'm getting on my 6x.", "time": "12-26-2017 07:44 PM", "replies": []}, {"postID": "post6118935", "text": "I'm using Android Central app. Which I had downloaded from play store.", "time": "12-27-2017 12:13 AM", "replies": [{"postID": "post6119312", "text": "Use the paperclip icon in the upper right to attach a picture.", "time": "12-27-2017 10:45 AM", "replies": []}]}]}, {"title": "Social Media sharing - Honor 7X $199.99", "thread": [{"postID": "post6096569", "text": "If you ever had a Honor device before or if you subscribed to their emails you should have received an email today about the Early Bird Offer for $199.99\nIf you share it on social media with #Honor7X and #EarlyBirdOffer there are quite a few goodies you might qualify for.\nSo if you are interested about the 7X in the USA, go ahead and tweet the email link or share it on Facebook to qualify for a freebie if you are lucky!", "time": "12-05-2017 10:39 AM", "replies": []}, {"postID": "post6121256", "text": "This was a great campaign, from the sounds of it! Thanks for sharing!", "time": "12-29-2017 08:43 AM", "replies": []}, {"postID": "post6122008", "text": "Is this campaign still going on? Or is it over already?", "time": "12-29-2017 11:09 PM", "replies": []}]}, {"title": "Honor 7x screen dim timer doesn't work", "thread": [{"postID": "post6120113", "text": "Hi I just got the Honor 7x, but for some reason the screen goes to sleep after 8 seconds. I have the sleep timer set to the max but it is still going to sleep after the slightest inactivity.", "time": "12-28-2017 06:38 AM", "replies": [{"postID": "post6120892", "text": "Hi, I was having the same issues on my 6x. Here are the instructions from a PM with Honor USA that solved the problem: Hello Mark, thank you for contacting Huawei, it will be a pleasure to assist you today. We know this situation can be very frustrating, however, in order to correct it, please consider the following:\n- Choose Settings.\n- Then scroll down to Advanced settings and hit this option.\n- From the following options select Reset all Settings.\n- Finally, choose Reset all Settings, and confirm the whole operation tapping Reset all Settings one more time.\n- Restart the phone and set the screen timeout again.\n- Make a test.\nDo not hesitate contact us if you need further assistance or you have any doubts. We wish you a nice day. -O.R", "time": "12-28-2017 09:43 PM", "replies": []}]}, {"postID": "post6120430", "text": "try to factory reset it.", "time": "12-28-2017 12:14 PM", "replies": []}]}, {"title": "Honor 7x $199!", "thread": [{"postID": "post6096498", "text": "Just got this email. Early bird special. http://forums.androidcentral.com/e?l...token=4-oRtzh1 Campaign&utm_medium=Introduction&utm_campaign=Honor 7X Pre-Order&utm_content=Main", "time": "12-05-2017 09:27 AM", "replies": []}, {"postID": "post6096560", "text": "I got the same email. This is a pretty nice price for the device.\nI am seriously considering getting one.", "time": "12-05-2017 10:32 AM", "replies": [{"postID": "post6098050", "text": "I was considering it but no Verizon support once again", "time": "12-06-2017 03:33 PM", "replies": [{"postID": "post6098053", "text": "That's not an issue for me", "time": "12-06-2017 03:34 PM", "replies": []}]}]}, {"postID": "post6096753", "text": "Me too. Looks like a great successor to the 6X. Complete with USA frequency support. So Honor isn't giving up on the USA after all!", "time": "12-05-2017 01:34 PM", "replies": [{"postID": "post6098052", "text": "Not complete usa support... Only 2 of the 5 major carriers.", "time": "12-06-2017 03:33 PM", "replies": [{"postID": "post6098059", "text": "True. I meant GSM carriers - wasnt' considering CDMA.", "time": "12-06-2017 03:36 PM", "replies": []}]}]}, {"postID": "post6096878", "text": "Wasn't surprised about the 7x coming to the states, I was surprised the Honor V10 was tho", "time": "12-05-2017 04:08 PM", "replies": [{"postID": "post6098054", "text": "It also makes sense why they kept having the honor 6x on sale recently", "time": "12-06-2017 03:35 PM", "replies": [{"postID": "post6098449", "text": "Yah I knew they're getting rid of the 6x to make room for the 7x", "time": "12-06-2017 10:11 PM", "replies": []}]}]}, {"postID": "post6097211", "text": "I'll be the test case for this from honor.\nOrdered it at $199.\nI'm pretty sure I will be disappointed with 3gb of ram and the iffy camera.\nMore after the 15th...", "time": "12-06-2017 12:14 AM", "replies": [{"postID": "post6097332", "text": "Let us know !", "time": "12-06-2017 03:59 AM", "replies": []}, {"postID": "post6098058", "text": "3gb should be ok for normal uses but a little short for heavy usage.", "time": "12-06-2017 03:36 PM", "replies": []}]}, {"postID": "post6097397", "text": "I changed my mind and cancelled out.", "time": "12-06-2017 06:06 AM", "replies": [{"postID": "post6097785", "text": "Dang. For a minute I got all excited.", "time": "12-06-2017 12:04 PM", "replies": []}, {"postID": "post6098060", "text": "Wow that's a quick change of mind", "time": "12-06-2017 03:36 PM", "replies": []}]}, {"postID": "post6097434", "text": "Why's that", "time": "12-06-2017 06:58 AM", "replies": []}, {"postID": "post6097449", "text": "I don't really want an honor phone.", "time": "12-06-2017 07:19 AM", "replies": [{"postID": "post6098061", "text": "Yeah I don't blame you with your record ob honor phones", "time": "12-06-2017 03:37 PM", "replies": []}]}, {"postID": "post6098102", "text": "I'm still tempted.", "time": "12-06-2017 03:57 PM", "replies": []}, {"postID": "post6098104", "text": "Interesting that the Kirin 659 outperforms the Snapdragon 625. The 625 is a very nice chip. Got my daughter a Moto G5 Plus a while back and that's a snappy little phone with great battery life. Wife and one son have also been using the Moto G4 and Moto G4 Plus - decent phones, but all these Moto phones need better cameras. Honor 7x has the better processor, better camera, and more features - plus it's cheaper. With their new phones like the 7X and V10, Honor may soon catch up with Moto in the USA market.", "time": "12-06-2017 04:00 PM", "replies": [{"postID": "post6098217", "text": "I agree. Moto is in some jeopardy. Huawei needs to clean up their software support though.", "time": "12-06-2017 05:36 PM", "replies": [{"postID": "post6108308", "text": "Well both moto and Huawei are going after the same target audience with these phones. I think if Huawei can get an unlocked one compatible with all carriers like moto then it could do well", "time": "12-15-2017 09:39 PM", "replies": [{"postID": "post6108318", "text": "Software updates need to get sorted out as well, and soon.", "time": "12-15-2017 09:50 PM", "replies": [{"postID": "post6108738", "text": "I really hope so. The issue of it not being update able on all 6x or whatever is rediculous especially since these are unlocked phones. Huawei has full control here", "time": "12-16-2017 10:09 AM", "replies": [{"postID": "post6108743", "text": "Yup. And to add salt to the wounds they don't even push the security patch updates as well. That bothers me more than OS updates.", "time": "12-16-2017 10:11 AM", "replies": [{"postID": "post6108855", "text": "Let's be honest. At $199, it's acceptable to do quaertrly updates, assuming that they get it working right.but flagship should be monthly", "time": "12-16-2017 11:49 AM", "replies": [{"postID": "post6108898", "text": "I agree. Right now things are maybe a yearly security patch, lol.", "time": "12-16-2017 12:41 PM", "replies": [{"postID": "post6109188", "text": "It's not so good here but my honor 8 has been doing every 2-4 months which isn't bad.", "time": "12-16-2017 06:18 PM", "replies": [{"postID": "post6109201", "text": "Wish I could say the same thing about my MediaPad M3", "time": "12-16-2017 06:36 PM", "replies": []}]}]}]}]}]}, {"postID": "post6108785", "text": "I agree... I might overlook some of its other shortcomings (like not having the same range of radio frequencies as the Moto G series) if I knew it’d at least get semi-regular security updates.", "time": "12-16-2017 10:38 AM", "replies": [{"postID": "post6108820", "text": "Agreed. No security patch updates is probably the biggest downside of purchasing a Huawei device.", "time": "12-16-2017 11:08 AM", "replies": []}, {"postID": "post6108865", "text": "Unfortunately that is the big question. and any promises by Huawei isn't going to mean much since they promised the honor 5x quarterly updates and we all know how well that turned out", "time": "12-16-2017 11:53 AM", "replies": []}]}]}]}]}, {"postID": "post6108305", "text": "How is the battery life? My moto z play droid with the 625 was getting 15-18 hr sot", "time": "12-15-2017 09:35 PM", "replies": [{"postID": "post6108319", "text": "That's just insane battery life!", "time": "12-15-2017 09:50 PM", "replies": [{"postID": "post6108741", "text": "Yes it is. And that's without using the battery mod which gets even more battery life", "time": "12-16-2017 10:10 AM", "replies": []}]}, {"postID": "post6108985", "text": "She's not complaining about battery life with the G5 Plus - and says it works very well for her. I've asked her about the SOT, but she just doesn't track these tech specs. The phone just works very well for her - and like every other teenage girl she's got it running a ton of junky, battery heavy, apps on it.", "time": "12-16-2017 02:16 PM", "replies": [{"postID": "post6109193", "text": "Yeah that's cool. I mean, it works for her. That's the important thing.", "time": "12-16-2017 06:24 PM", "replies": [{"postID": "post6109278", "text": "Big step up for her. Its a funny story (or at least I think so!). She'd be using Moto G's all along and repeatedly breaking screens - even though I bought them cases and screen protectors. Apparently cases are not \"cool\". Finally got to the point the old moto G screen was totally shattered. So, I got her a $59 BLU Amazon Prime phone - and a case and screen protector! I guess you could call it punishment for not having the case on her previous Moto G. So she sported the Blu phone in a case for about 6 months (BLU phones are even more embarrassing than a case apparently) until I finally got her the G5 Plus. She keeps the G5 Plus it in a case now :-).", "time": "12-16-2017 08:05 PM", "replies": [{"postID": "post6111100", "text": "Haha. No doubt people are like... Blu... What the heck is that? Moto at least has name brand recognition here in the United States", "time": "12-18-2017 03:53 PM", "replies": []}]}]}]}]}]}, {"postID": "post6098163", "text": "199 seemed good initially.\nAfter reading about the hardware it's not much of a jump in my opinion. The only attractive design feature for me is the screen size.\nBy springtime the 7X will be 149.", "time": "12-06-2017 04:46 PM", "replies": [{"postID": "post6108306", "text": "It won't be a permanent price at $149,in my opinion. Although it might be on sale at that price", "time": "12-15-2017 09:37 PM", "replies": [{"postID": "post6108317", "text": "Agreed. It's not gonna be $149 until the 8X shows up.", "time": "12-15-2017 09:49 PM", "replies": [{"postID": "post6108735", "text": "I am not even sure that will happen. The honor 6x is still $199-249 on honor website today. It is $199 retail on Amazon though on sale for $149.", "time": "12-16-2017 10:07 AM", "replies": [{"postID": "post6108744", "text": "They fully know that people aren't going to buy last year's version though.", "time": "12-16-2017 10:12 AM", "replies": [{"postID": "post6108857", "text": "Of course, my point is though that they aren't willing to drop the 6x MSRP even though the 7x came out. Of course it's on sale at other retailers.", "time": "12-16-2017 11:50 AM", "replies": [{"postID": "post6108899", "text": "If they're thinking that people cannot do a simple Google search then you know...", "time": "12-16-2017 12:42 PM", "replies": [{"postID": "post6109192", "text": "You are right but... As of this post, this is what I see", "time": "12-16-2017 06:22 PM", "replies": []}]}]}]}]}]}]}]}, {"postID": "post6111095", "text": "Wonder if anyone on the thread here has ordered a 7X or not?", "time": "12-18-2017 03:51 PM", "replies": [{"postID": "post6111101", "text": "I have not because it is not available for use with Verizon.", "time": "12-18-2017 03:54 PM", "replies": []}]}, {"postID": "post6111205", "text": "I actually have one.", "time": "12-18-2017 05:43 PM", "replies": [{"postID": "post6111495", "text": "Thanks for posting pictures of your device.", "time": "12-19-2017 12:46 AM", "replies": []}]}, {"postID": "post6111483", "text": "Great price, unfortunately I picked up a 6x at $149. I needed a phone immediately and got same day shipping with Amazon. Couldn't wait any longer. Oh well. Still a fantastic phone.", "time": "12-19-2017 12:27 AM", "replies": [{"postID": "post6111874", "text": "Are you within the return period? Maybe you can do an exchange, while paying the difference?", "time": "12-19-2017 10:25 AM", "replies": []}]}]}, {"title": "Import a 7X now or wait for US/Can release?", "thread": [{"postID": "post6016346", "text": "Folks,\nAs you know yesterday Honor (Huawei) announced the Honor 7X in China (for the Asian market) you can check it out here. BUT they have an event planned in Dec for the UK where they will <hint> <hint> showing off a bezel-less device. Check THAT out here. Could this be the worldwide release of the 7x?\nIn any event my question is, do you import an 7X now, or wait till Dec for the possible world release?", "time": "10-12-2017 08:09 AM", "replies": [{"postID": "post6016356", "text": "I would wait. I really wanted an honor 9 but it only gets 3g in the US. I’m guessing the Chinese variant might be similar of the 7x. Possible the UK one too. I’d wait to see if it supports our bands properly first.", "time": "10-12-2017 08:26 AM", "replies": []}]}, {"postID": "post6018232", "text": "I'd wait as well. If I remember correctly the honor 6x came to the states a couple months after it was released in China. If there's no hint about it coming stateside by February of next year is when I would start looking to import.", "time": "10-13-2017 03:48 PM", "replies": []}, {"postID": "post6023402", "text": "I would think Honor should release it early, especially around Thanksgiving. I was about to buy the 6X because of reduced Best Buy prices last week but refrained because of the 7X release. Now I'm debating whether I should wait or just import the Xiaomi Mi A1. This will be my backup device for international travel so I don't care if it gets LTE in the US.", "time": "10-17-2017 06:14 AM", "replies": [{"postID": "post6023498", "text": "Their next announcement they have planned is for December so I don't think it'll be here in time for Thanksgiving. Last year they released the 6x in China around this time and it didn't land in the states till early in 2017. I'm guessing they'll do the same with the 7x.", "time": "10-17-2017 07:57 AM", "replies": [{"postID": "post6053386", "text": "Hopefully they release it here asap. Why release it months later ...", "time": "11-04-2017 08:15 AM", "replies": [{"postID": "post6056569", "text": "It could be due to fcc approval needed in the states.", "time": "11-06-2017 10:25 AM", "replies": []}]}]}]}, {"postID": "post6064518", "text": "So much delays...", "time": "11-11-2017 06:37 AM", "replies": [{"postID": "post6065292", "text": "Yeah and no one outside of honor knows exactly why", "time": "11-11-2017 04:15 PM", "replies": [{"postID": "post6065365", "text": "Let me just sneak into their hq and find out for everyone.", "time": "11-11-2017 04:48 PM", "replies": [{"postID": "post6068406", "text": "But then Huawei might accuse us of stealing things just like tmobile accused Huawei", "time": "11-13-2017 08:03 PM", "replies": []}]}]}]}, {"postID": "post6068514", "text": "Tmobile isn't as sneaky as me.", "time": "11-13-2017 09:39 PM", "replies": [{"postID": "post6068542", "text": "I guess that's a good thing?", "time": "11-13-2017 09:58 PM", "replies": []}]}, {"postID": "post6068695", "text": "Oh I meant huawei isn't as sneaky as me! Read what you said backwards at first", "time": "11-14-2017 01:26 AM", "replies": [{"postID": "post6069832", "text": "Ah ok. Thanks for clarifying", "time": "11-14-2017 06:04 PM", "replies": []}]}, {"postID": "post6070045", "text": "I really need to watch what I say before commenting oh god", "time": "11-14-2017 08:59 PM", "replies": [{"postID": "post6072060", "text": "Haha. Same here", "time": "11-15-2017 08:33 PM", "replies": []}]}, {"postID": "post6072085", "text": "It's just getting worse", "time": "11-15-2017 08:45 PM", "replies": [{"postID": "post6072960", "text": "It's OK. Just try to improve... I mean it's fine so long as you are trying for best", "time": "11-16-2017 01:06 PM", "replies": []}]}, {"postID": "post6073167", "text": "I just need to proofread it.", "time": "11-16-2017 03:19 PM", "replies": [{"postID": "post6075118", "text": "No worries, I probably need to proofread a little bit better too", "time": "11-17-2017 10:25 PM", "replies": []}]}, {"postID": "post6075225", "text": "But mines so much worst than anyone lol", "time": "11-17-2017 11:51 PM", "replies": [{"postID": "post6079833", "text": "Don't worry. The important thing is that you try to improve", "time": "11-21-2017 01:56 PM", "replies": []}]}, {"postID": "post6079983", "text": "True!", "time": "11-21-2017 03:19 PM", "replies": []}, {"postID": "post6080435", "text": "It's coming to the USA. My guess would be to watch for the rollout announcement at CES in early January. https://www.digitaltrends.com/mobile...honor-7x-news/", "time": "11-21-2017 08:21 PM", "replies": [{"postID": "post6080573", "text": "Yes this is the link I was looking for earlier. Isn't officially confirmed though but sure is exciting", "time": "11-21-2017 10:41 PM", "replies": []}]}, {"postID": "post6096562", "text": "Well the Early Bird offer for USA is live.\n$199 with a free case and free expedited shipping. Looks like orders will be delivered on Dec 15th. So who is going to get one in the USA?", "time": "12-05-2017 10:35 AM", "replies": [{"postID": "post6108292", "text": "I will pass for now. The specs look great but I already have too many phones", "time": "12-15-2017 09:26 PM", "replies": [{"postID": "post6108322", "text": "Same here", "time": "12-15-2017 09:52 PM", "replies": [{"postID": "post6108753", "text": "I used to get more phones because Verizon let me buy at contract pricing and saving me $30/mo per line to go on contract. Was a no brainer really. Buy a phone at cheap price and save $720 on my phone bill over 2 years. But Verizon ended contracts. So now I have to be more selective", "time": "12-16-2017 10:15 AM", "replies": [{"postID": "post6108758", "text": "I have never gotten phones on contract. Always buy them out right unlocked. But I figured out a way to fund my hobby early on about 4 years ago.", "time": "12-16-2017 10:17 AM", "replies": [{"postID": "post6108839", "text": "Well I don't plan to move from Verizon so no reason not to get a contract, allowing me to save over a grand. Per phone bought on contract.", "time": "12-16-2017 11:33 AM", "replies": []}]}]}]}]}]}, {"postID": "post6096889", "text": "$200 is such a good deal. I don't need one but it's tempting", "time": "12-05-2017 04:15 PM", "replies": [{"postID": "post6097786", "text": "For some reason I don't see you buying it.", "time": "12-06-2017 12:04 PM", "replies": [{"postID": "post6098436", "text": "You don't think so ?", "time": "12-06-2017 10:05 PM", "replies": [{"postID": "post6098458", "text": "Nope. You're in the Philippines", "time": "12-06-2017 10:19 PM", "replies": [{"postID": "post6098597", "text": "Who said ? I'm in US lol", "time": "12-07-2017 02:10 AM", "replies": []}]}]}]}]}, {"postID": "post6098062", "text": "Much earlier than I thought it would be released in the USA. That's a great thing!", "time": "12-06-2017 03:37 PM", "replies": [{"postID": "post6098098", "text": "Yes and it's priced well.", "time": "12-06-2017 03:55 PM", "replies": [{"postID": "post6098108", "text": "Yeah that was another nice surprise!", "time": "12-06-2017 04:02 PM", "replies": [{"postID": "post6098111", "text": "I'm hoping that the V10 is priced equally well.", "time": "12-06-2017 04:03 PM", "replies": [{"postID": "post6098120", "text": "Might be wrong, but I've heard it's going to start at around $599. At least that was UK price. Maybe slightly lower in the USA? Same price I paid for my Mate 9 last January, but the V10 is better device.", "time": "12-06-2017 04:11 PM", "replies": [{"postID": "post6098437", "text": "Probably $500 usd. Competitive against the 5T", "time": "12-06-2017 10:06 PM", "replies": []}, {"postID": "post6108296", "text": "Oh $599 is a bit high, imo. I hope they keep the prices a bit lower", "time": "12-15-2017 09:28 PM", "replies": [{"postID": "post6108321", "text": "$599 is a bit on the higher side but still below HTC U11 prices. Although $549 would allow Huawei to be competitive with OP5T.", "time": "12-15-2017 09:52 PM", "replies": [{"postID": "post6108746", "text": "Let's be honest though. Htc prices are sky high. No one but die hard htc fans are buying them at that price. I do agree that $549 would be competitive though. I bet it will drop too that price shortly anyway.", "time": "12-16-2017 10:13 AM", "replies": [{"postID": "post6108760", "text": "My personal entry level price for the V10 is around $449 though. That might take a while to get there.", "time": "12-16-2017 10:18 AM", "replies": [{"postID": "post6108849", "text": "It should be possible... not permanent pricing but a steep introductory sale. Hey,we can wish right?", "time": "12-16-2017 11:41 AM", "replies": [{"postID": "post6108900", "text": "Yup. Fingers crossed.", "time": "12-16-2017 12:42 PM", "replies": []}]}]}]}]}]}]}]}]}, {"postID": "post6108294", "text": "It definitely is. Was thinking it would be priced closer to the 6x at launch", "time": "12-15-2017 09:27 PM", "replies": []}]}]}, {"postID": "post6109412", "text": "I'm hoping itll be $500 usd", "time": "12-16-2017 11:42 PM", "replies": []}]}, {"title": "7X camera specs", "thread": [{"postID": "post6098892", "text": "For a budget phone what are the camera specs? Is it usable as an everyday shooter or should I look elsewhere?", "time": "12-07-2017 09:20 AM", "replies": []}, {"postID": "post6099110", "text": "Welcome to Android Central! Alex Dobie felt that the camera was quite good: https://www.androidcentral.com/honor-7x-review\nHere's a more detailed look at its features: https://www.androidcentral.com/honor-7x-camera", "time": "12-07-2017 12:15 PM", "replies": []}, {"postID": "post6099851", "text": "Camera is pretty solid.\nHere are some nice pictures in the Digital Trends reviewhttps://www.digitaltrends.com/cell-p...nor-7x-review/\nAnd some more here at TechRadarHonor 7X review: Battery life and camera | TechRadar", "time": "12-07-2017 10:58 PM", "replies": []}, {"postID": "post6108302", "text": "Good overall, but a bit weak in night photos,although night photos are tricky for phones in its class.", "time": "12-15-2017 09:33 PM", "replies": []}]}, {"title": "Is the 7x waterproof or water resistant?", "thread": [{"postID": "post6018241", "text": "The promo image of the phone shows a guy in a wet suit getting splashed by water. Rumor has it this could mean the phone is at least water resistant, Though I can't find anything confirming it. Seems odd to use a promo image like that if it wasn't at least water resistant.", "time": "10-13-2017 03:56 PM", "replies": []}, {"postID": "post6018293", "text": "water resistance I guess.", "time": "10-13-2017 04:35 PM", "replies": [{"postID": "post6018714", "text": "Yeah that's what I figured, just can't find anything confirming it.", "time": "10-13-2017 10:58 PM", "replies": []}]}, {"postID": "post6019528", "text": "There's no \"waterproof\" spec for cellphones - IP67 and IP68 are both water resistance.", "time": "10-14-2017 03:09 PM", "replies": [{"postID": "post6019570", "text": "Ah good to know, thanks! I guess the question is whether it's water resistant or not.", "time": "10-14-2017 03:54 PM", "replies": []}]}, {"postID": "post6072167", "text": "How do you get water to splash off you like this?\nEverybody on TV has water splashing off them.\n(Confuses me)", "time": "11-15-2017 09:38 PM", "replies": []}, {"postID": "post6072958", "text": "Maybe they used wind to push it?", "time": "11-16-2017 01:05 PM", "replies": []}, {"postID": "post6075380", "text": "Hess Aquaman", "time": "11-18-2017 05:02 AM", "replies": [{"postID": "post6079829", "text": "That's possible too...", "time": "11-21-2017 01:54 PM", "replies": []}]}, {"postID": "post6079850", "text": "Honor on Instagram says the 7X is out... Yet where is it out?", "time": "11-21-2017 02:05 PM", "replies": [{"postID": "post6079912", "text": "Haha. Maybe it's a false start release date", "time": "11-21-2017 02:47 PM", "replies": []}]}, {"postID": "post6079980", "text": "Isn't the announcement on Dec 5th for this phone lol", "time": "11-21-2017 03:17 PM", "replies": [{"postID": "post6080108", "text": "Hell I dunno what's going on.\nLet's just jump to the 8X now...", "time": "11-21-2017 04:29 PM", "replies": [{"postID": "post6080185", "text": "I heard the 9X is around the corner", "time": "11-21-2017 05:13 PM", "replies": [{"postID": "post6080195", "text": "Moving on from the 7X...\n...what shall we talk about now?", "time": "11-21-2017 05:20 PM", "replies": [{"postID": "post6080246", "text": "Maybe about which phone would actually come to the usa?", "time": "11-21-2017 05:40 PM", "replies": []}]}, {"postID": "post6080245", "text": "Or maybe honor 10x.", "time": "11-21-2017 05:39 PM", "replies": []}]}, {"postID": "post6080242", "text": "Sounds good. Let's just skip 7", "time": "11-21-2017 05:38 PM", "replies": []}]}, {"postID": "post6080241", "text": "I thought that was the v10? Who knows", "time": "11-21-2017 05:38 PM", "replies": []}]}, {"postID": "post6080282", "text": "There was an article online I read saying huawei will release the 7x to the states. I'll try to look for it and post it here", "time": "11-21-2017 06:08 PM", "replies": [{"postID": "post6080423", "text": "I hope they do.... But they also need to price it aggressively.", "time": "11-21-2017 08:14 PM", "replies": []}]}, {"postID": "post6080499", "text": "Can't find the link anymore. They said it was nearly confirmed huawei will release it. But nothing is confirmed till huawei says it themselves", "time": "11-21-2017 09:09 PM", "replies": [{"postID": "post6080885", "text": "You mean like how Huawei confirmed that the honor 5x would get quarterly updates?", "time": "11-22-2017 08:03 AM", "replies": [{"postID": "post6081560", "text": "Definitely. Just like that", "time": "11-22-2017 05:01 PM", "replies": [{"postID": "post6081571", "text": "So why should we wait for honor to confirm it when they don't even attempt to follow through on what they say?", "time": "11-22-2017 05:05 PM", "replies": [{"postID": "post6081710", "text": "You don't have to wait or deal with it. Your choice if you want to", "time": "11-22-2017 07:32 PM", "replies": [{"postID": "post6081738", "text": "Which then goes back to what Guy said... No one knows... Not even honor", "time": "11-22-2017 07:49 PM", "replies": []}]}]}]}]}]}, {"postID": "post6080521", "text": "No one knows what's going on now.\nNot even honor", "time": "11-21-2017 09:29 PM", "replies": [{"postID": "post6080886", "text": "You are probably right. Guess we will just have to wait.", "time": "11-22-2017 08:04 AM", "replies": []}]}, {"postID": "post6081871", "text": "Couldn't even Honor their own name", "time": "11-22-2017 11:49 PM", "replies": [{"postID": "post6088636", "text": "Haha nice pun", "time": "11-28-2017 06:42 PM", "replies": []}]}, {"postID": "post6081930", "text": "I used to have faith in honor.\nReally thought the brand would be a saviour of the bargain hunter that was hoping for continued support.\nNot to be....", "time": "11-23-2017 01:28 AM", "replies": [{"postID": "post6088642", "text": "They certainly have been botching things lately especially with the 5x", "time": "11-28-2017 06:44 PM", "replies": []}]}, {"postID": "post6081995", "text": "You can wait and see how they handle their future Honor phones before purchasing again.", "time": "11-23-2017 03:28 AM", "replies": [{"postID": "post6088645", "text": "But the problem is they reneged on their word. Even if they do better for a bit, if sales slump, who's to say they go back to their old ways?", "time": "11-28-2017 06:45 PM", "replies": [{"postID": "post6088898", "text": "Only time will tell how they really are with their promises", "time": "11-28-2017 09:58 PM", "replies": []}]}]}, {"postID": "post6082795", "text": "Waiting is the curse of every phone nerd/junkie.\nAll phone nerds dog these phone makers for release dates.\nCauses lots of stress for nerds who are tech addicts.", "time": "11-23-2017 10:46 PM", "replies": [{"postID": "post6088649", "text": "You are definitely right. Honor tries to push their phones amongst phone nerds but aren't willing to put the effort to give the nerds what they want", "time": "11-28-2017 06:46 PM", "replies": []}]}, {"postID": "post6082818", "text": "You don't wanna waste your money though.", "time": "11-23-2017 11:31 PM", "replies": [{"postID": "post6088653", "text": "Yup. That is true. I don't want to buy a phone that I won't use due to weak updates", "time": "11-28-2017 06:47 PM", "replies": []}]}, {"postID": "post6082823", "text": "Waste money?", "time": "11-23-2017 11:39 PM", "replies": []}, {"postID": "post6082882", "text": "Buying phones cause you're a phone junkie\nIt does suck waiting and not even having a chance to see the phone in person.", "time": "11-24-2017 02:54 AM", "replies": [{"postID": "post6088657", "text": "Nothing wrong with having phones for a hobby... So long as your finances are ok", "time": "11-28-2017 06:48 PM", "replies": [{"postID": "post6088900", "text": "Oh yah, if you can afford it without any issues. Go for it.", "time": "11-28-2017 09:59 PM", "replies": []}]}]}, {"postID": "post6082918", "text": "Ahhh...\nI see what you were saying earlier about not wanting to waste $$", "time": "11-24-2017 04:49 AM", "replies": [{"postID": "post6082941", "text": "Yah my bad. Should've been more clearer", "time": "11-24-2017 05:35 AM", "replies": [{"postID": "post6088660", "text": "No worries, at least we understand now", "time": "11-28-2017 06:49 PM", "replies": []}]}, {"postID": "post6088659", "text": "Yes, and it certainly makes sense.", "time": "11-28-2017 06:48 PM", "replies": []}]}, {"postID": "post6097788", "text": "Supposedly it's water resistant, not waterproof.", "time": "12-06-2017 12:05 PM", "replies": []}, {"postID": "post6100214", "text": "Don't think there's a phone that's waterproof out just yet.", "time": "12-08-2017 10:00 AM", "replies": []}]}, {"title": "Which OS comes on the 7X?", "thread": [{"postID": "post6099308", "text": "Please don't tell me it's Marshmallow + EMUI", "time": "12-07-2017 02:41 PM", "replies": []}, {"postID": "post6099317", "text": "gsmArena says nougat", "time": "12-07-2017 02:50 PM", "replies": []}, {"postID": "post6099849", "text": "EMUI 5.1\nAndroid 7.0\nHere is the link:http://www.hihonor.com/global/produc...ch&utm_term=ad", "time": "12-07-2017 10:55 PM", "replies": []}, {"postID": "post6100193", "text": "No reason for them to release it with Marshmallow", "time": "12-08-2017 09:46 AM", "replies": []}]}, {"title": "Where can I buy the 7X?", "thread": [{"postID": "post6097902", "text": "Where can you buy the Honor 7X?", "time": "12-06-2017 01:32 PM", "replies": [{"postID": "post6098113", "text": "Here's the US Honor site:Honor Official Site (USA) - Honor Smartphones - For The Brave\nDon't see it yet on Amazon or B&H.", "time": "12-06-2017 04:06 PM", "replies": [{"postID": "post6099860", "text": "They will have it after Huawei/Honor starts shipping the devices to customers.", "time": "12-07-2017 11:09 PM", "replies": []}]}]}]}, {"title": "Honor 7x to be unveiled Oct 11th!", "thread": [{"postID": "post6003594", "text": "Looks like the successor to the honor 6x will be unveiled October 11th. Rumors include a Kirin 670 chipset, 4gb ram, 64 GB of internal storage along with a bezel-less display. If this comes to the states at a reasonable price I might have to make a jump from my honor 8.", "time": "10-04-2017 08:38 AM", "replies": []}, {"postID": "post6003634", "text": "I will certainly give it a good look! I nearly got the 6x!", "time": "10-04-2017 09:12 AM", "replies": []}, {"postID": "post6003723", "text": "Yeah, I love my Honor 8 but lately these mid-range devices with their power efficiency are really temping me. I've come to the realization that battery life is my top priority. If this thing can get 2 days out of a charge I'm sold!", "time": "10-04-2017 10:20 AM", "replies": [{"postID": "post6006148", "text": "i don't really see it as being 2 days battery, at least for moderate to heavy usage. the only phone that i know of that can do this would be the moto z play.", "time": "10-05-2017 03:05 PM", "replies": []}]}, {"postID": "post6007236", "text": "Well, here's hoping for a 1+ day battery life.", "time": "10-06-2017 08:15 AM", "replies": [{"postID": "post6008058", "text": "I think that that would be achievable, based on how it is specd", "time": "10-06-2017 04:20 PM", "replies": []}]}, {"postID": "post6008660", "text": "the honor 7 will have to be very impressive to replace my honor 6x!!!!", "time": "10-07-2017 12:44 AM", "replies": [{"postID": "post6009053", "text": "It's not really designed to cull people from a 6x,probably people who are using other phones.", "time": "10-07-2017 10:27 AM", "replies": []}]}, {"postID": "post6011996", "text": "More rumors. Looking like a 18:9 screen is all but confirmed.https://www.phonearena.com/news/Hono...-phone_id98739", "time": "10-09-2017 09:49 AM", "replies": [{"postID": "post6012617", "text": "That's good. I love the new wider displays.", "time": "10-09-2017 04:24 PM", "replies": []}]}, {"postID": "post6012629", "text": "Yeah, if it does come to the states, I think it'll do well as itll be one of the first budget phones with a bezel-less design.", "time": "10-09-2017 04:30 PM", "replies": []}, {"postID": "post6013572", "text": "Tomorrow! Tomorrow! I love ya tomorrow!", "time": "10-10-2017 10:28 AM", "replies": [{"postID": "post6013594", "text": "Glad I'm not the only excited one!", "time": "10-10-2017 10:48 AM", "replies": []}]}, {"postID": "post6014221", "text": "Is it coming state side?", "time": "10-10-2017 05:57 PM", "replies": [{"postID": "post6014557", "text": "Don't know yet, hopefully tomorrow will shed some light if it comes over here. It would probably do pretty well if it did as it'll be the first 18:9 Budget phone stateside.", "time": "10-10-2017 10:52 PM", "replies": []}]}, {"postID": "post6014950", "text": "Looks pretty good! MicroUSB though?! And no word yet on US debut. Still if it's anything like the 6x debut, it'll be released several months after the Chinese version.https://m.androidcentral.com/honor-7...l-rear-cameras", "time": "10-11-2017 08:18 AM", "replies": []}, {"postID": "post6015033", "text": "Micro usb is still common in this price range. Looks really good for the price though", "time": "10-11-2017 09:13 AM", "replies": [{"postID": "post6015138", "text": "True, and yeah price is excellent. I wonder if they can keep the price in the same ballpark if and when it comes to the US.", "time": "10-11-2017 10:30 AM", "replies": []}]}, {"postID": "post6016332", "text": "I'm sure the importers like Gearbest and Aliexpress will have it for those who JUST can't wait.", "time": "10-12-2017 07:56 AM", "replies": [{"postID": "post6016481", "text": "Ha true. Anybody have any experience importing phones? Not that I'm planning to, I just see deals come up all the time and am curious about the process of buying on these sites.", "time": "10-12-2017 10:36 AM", "replies": [{"postID": "post6016523", "text": "I'm glad you asked! Yes I have done it, I got a Mi Mix from Gearbest without issue, also I traded for an International Mate 9 a couple months before the US release. In both cases I knew ahead of time that the devices had LTE in the US. In the case of the Mate 9 all LTE bands from T-Mobile (except the newest that no one has), and in the case of the Mi Mix while it did not have band 12, it did have 2 other T-Mobile LTE bands and I almost always got a good LTE signal.\nYou need to check what radios/frequencies the device has BEFORE you import it, and you must accept what it has. Additionally there will be no US warranty, and returning the device will be difficult if not impossible.", "time": "10-12-2017 11:03 AM", "replies": [{"postID": "post6016654", "text": "Gotcha thanks for the info. This is really helpful. Do these phones usually come in other languages? And if so how easy is it to switch it to English?", "time": "10-12-2017 12:29 PM", "replies": []}]}]}, {"postID": "post6016790", "text": "The question is does it support usa lte and features like volte, wfc, etc. I am sure they are all quad band gsm so technically it would work but internet could be really slow.", "time": "10-12-2017 02:07 PM", "replies": [{"postID": "post6016821", "text": "True true.  You need to check specifically. SOME phones support some or all of the US LTE bands, but often there are no US LTE bands. As for VoLTE and WiFi calling, often/sometimes T-Mobile supports it on those phones, BUT AT&T almost NEVER does. At least this has been my experience. The key is to check BEFORE you buy and then be satisfied with what you are getting. When I bought my Mi Mix, I did just that. I knew it was missing band 12, but I was ok with that since it had the other LTE bands and WiFi calling DID work.", "time": "10-12-2017 02:29 PM", "replies": []}]}]}, {"postID": "post6053234", "text": "I really like the look of this one. Hopefully they bring this baby to US", "time": "11-04-2017 04:37 AM", "replies": []}, {"postID": "post6055106", "text": "hopefully the Honor 7x will have wireless calling and even better if it will end up with\na c charger", "time": "11-05-2017 12:08 PM", "replies": [{"postID": "post6055566", "text": "Wireless calling ? I don't understand why they went with micro USB charging port either ...", "time": "11-05-2017 05:12 PM", "replies": []}, {"postID": "post6064517", "text": "Did you mean wifi calling or wireless charging ?", "time": "11-11-2017 06:36 AM", "replies": [{"postID": "post6065310", "text": "Or both?", "time": "11-11-2017 04:24 PM", "replies": [{"postID": "post6065361", "text": "Is that what wireless calling mean ?", "time": "11-11-2017 04:46 PM", "replies": [{"postID": "post6068408", "text": "No idea, just wondering about it", "time": "11-13-2017 08:04 PM", "replies": []}]}]}]}, {"postID": "post6070049", "text": "I still don't get why they went with micro USB. Old technology these days", "time": "11-14-2017 09:02 PM", "replies": [{"postID": "post6072058", "text": "Save money.", "time": "11-15-2017 08:33 PM", "replies": [{"postID": "post6072087", "text": "Old technology. Shouldn't be here anymore", "time": "11-15-2017 08:46 PM", "replies": [{"postID": "post6072095", "text": "I certainly agree. But this phone is built on very thin margins. So they gotta cut corners where they can.", "time": "11-15-2017 08:49 PM", "replies": []}]}]}]}]}, {"postID": "post6056574", "text": "Mod Note, I will move this to the 7x forum", "time": "11-06-2017 10:27 AM", "replies": []}, {"postID": "post6068516", "text": "Ahhh gotchu. I'm assuming he means wireless charging.", "time": "11-13-2017 09:40 PM", "replies": [{"postID": "post6069833", "text": "Ah ok. Maybe so", "time": "11-14-2017 06:04 PM", "replies": []}]}, {"postID": "post6070096", "text": "So Honor 7x and Honor 9, which one will be better", "time": "11-14-2017 09:27 PM", "replies": [{"postID": "post6072059", "text": "Honor 9 for sure.", "time": "11-15-2017 08:33 PM", "replies": []}]}, {"postID": "post6070097", "text": "Honor 9 by far", "time": "11-14-2017 09:28 PM", "replies": []}, {"postID": "post6072204", "text": "I get that part but is it really that much different in price from using type c port ..", "time": "11-15-2017 10:12 PM", "replies": [{"postID": "post6072956", "text": "Companies will save every penny possible especially on the honor 6x where the profit margin is pretty thin.", "time": "11-16-2017 01:04 PM", "replies": []}]}, {"postID": "post6073166", "text": "I agree with that", "time": "11-16-2017 03:18 PM", "replies": [{"postID": "post6075121", "text": "Honor figured out what options they could add that would add the best bang for the buck. Usb c wasn't it", "time": "11-17-2017 10:27 PM", "replies": []}]}, {"postID": "post6075226", "text": "Although that is true, old technology is still old technology . Just disappointing .", "time": "11-17-2017 11:52 PM", "replies": [{"postID": "post6079831", "text": "Yes it certainly is disappointing. But I don't see it changing anytime soon", "time": "11-21-2017 01:55 PM", "replies": []}]}, {"postID": "post6079982", "text": "I don't either sigh", "time": "11-21-2017 03:19 PM", "replies": []}, {"postID": "post6081575", "text": "Problem is people don't care enough about this feature.", "time": "11-22-2017 05:09 PM", "replies": []}, {"postID": "post6081621", "text": "USB C is cool because it requires people to run off and buy additional accessories.", "time": "11-22-2017 05:50 PM", "replies": [{"postID": "post6081734", "text": "Huawei's justification is that they want to save you money", "time": "11-22-2017 07:47 PM", "replies": [{"postID": "post6081786", "text": "Not just them. Same with moto G5 series", "time": "11-22-2017 09:08 PM", "replies": [{"postID": "post6081853", "text": "I should say Chinese manufacturers in general.", "time": "11-22-2017 11:29 PM", "replies": [{"postID": "post6081964", "text": "Awh that's better. Yup agreed", "time": "11-23-2017 02:25 AM", "replies": [{"postID": "post6082851", "text": "Even low end Samsung like the j7 has micro usb", "time": "11-24-2017 12:57 AM", "replies": [{"postID": "post6082878", "text": "Seems like it", "time": "11-24-2017 02:48 AM", "replies": []}]}]}]}]}]}, {"postID": "post6081787", "text": "Type c is way cooler and easier to plug it in", "time": "11-22-2017 09:08 PM", "replies": [{"postID": "post6081854", "text": "Easier to plug in sure. Cooler? Not necessarily", "time": "11-22-2017 11:30 PM", "replies": [{"postID": "post6081965", "text": "Cooler than the micro USB. Oh yes", "time": "11-23-2017 02:26 AM", "replies": [{"postID": "post6082852", "text": "Guess we will agree to disagree on that", "time": "11-24-2017 12:58 AM", "replies": []}]}]}]}]}, {"postID": "post6081735", "text": "Lol...", "time": "11-22-2017 07:47 PM", "replies": []}, {"postID": "post6081827", "text": "I like USB C...it is pretty handy to type the least.", "time": "11-22-2017 10:10 PM", "replies": [{"postID": "post6081857", "text": "It's easier to use than micro usb, but not as good as lighting", "time": "11-22-2017 11:31 PM", "replies": []}]}, {"postID": "post6081927", "text": "Sorry to say the 7X is most likely a turd out of the box.", "time": "11-23-2017 01:09 AM", "replies": [{"postID": "post6081966", "text": "A good turd?", "time": "11-23-2017 02:26 AM", "replies": [{"postID": "post6082552", "text": "Stinky one...", "time": "11-23-2017 03:47 PM", "replies": [{"postID": "post6082854", "text": "But... Is it necessary?", "time": "11-24-2017 12:59 AM", "replies": []}]}, {"postID": "post6082853", "text": "Maybe a necessary one", "time": "11-24-2017 12:58 AM", "replies": []}]}, {"postID": "post6082850", "text": "Is it at least a nice looking turd though?", "time": "11-24-2017 12:56 AM", "replies": []}]}, {"postID": "post6082746", "text": "Have you smelled it", "time": "11-23-2017 09:35 PM", "replies": [{"postID": "post6082855", "text": "Uhh... There are things that I don't need to smell.", "time": "11-24-2017 12:59 AM", "replies": [{"postID": "post6082879", "text": "There are some smells that'll creep up to you before not even seeing it. \nLike a turd", "time": "11-24-2017 02:50 AM", "replies": []}]}]}, {"postID": "post6082749", "text": "Nop", "time": "11-23-2017 09:38 PM", "replies": []}]}, {"title": "Release Date", "thread": [{"postID": "post6052958", "text": "Is this phone coming to India?If yes when? I have a honor 6x really like to upgrade to new 18:9 display phone", "time": "11-03-2017 09:57 PM", "replies": []}, {"postID": "post6052966", "text": "This site:Honor 7X with dual rear cameras, Android Nougat launched in China | The Indian Express\nSays late December to early January 2018 for India.", "time": "11-03-2017 10:07 PM", "replies": []}, {"postID": "post6056571", "text": "How reliable is that site?", "time": "11-06-2017 10:26 AM", "replies": []}, {"postID": "post6056823", "text": "Heck I dunno.\nJust did a common search to find something about a release date for India.", "time": "11-06-2017 01:54 PM", "replies": [{"postID": "post6056891", "text": "Ah ok. Site wasn't familiar to me so I was just wondering if it was a random search or if it was from a reliable site that you have used in the past", "time": "11-06-2017 02:56 PM", "replies": []}]}, {"postID": "post6057901", "text": "https://www.androidauthority.com/hon...cember-812669/\nSame info above.", "time": "11-07-2017 05:38 AM", "replies": [{"postID": "post6058435", "text": "Cool, thanks for sharing this, aa is a more familiar site", "time": "11-07-2017 11:58 AM", "replies": []}]}, {"postID": "post6058594", "text": "Yub...\nThat jumped up on the Google app yesterday so I thought it was relevant.", "time": "11-07-2017 01:24 PM", "replies": []}, {"postID": "post6059510", "text": "Let us know how you like the phone if you get it. I'm interested in getting one to play around with", "time": "11-08-2017 01:59 AM", "replies": [{"postID": "post6059521", "text": "Who?\nThe OP?\nI doubt he will respond here.", "time": "11-08-2017 02:15 AM", "replies": [{"postID": "post6059522", "text": "Why you say that", "time": "11-08-2017 02:16 AM", "replies": []}]}]}, {"postID": "post6059525", "text": "Hasn't come back yet.\nIf he has his answer I don't see the OP responding at all.", "time": "11-08-2017 02:20 AM", "replies": [{"postID": "post6059526", "text": "Thread still pretty fresh so there's still a chance he'll responds", "time": "11-08-2017 02:22 AM", "replies": []}, {"postID": "post6060488", "text": "You are most likely right but it doesn't hurt to ask.", "time": "11-08-2017 04:26 PM", "replies": []}]}, {"postID": "post6059527", "text": "Doubtful here.\nPhone is 2 months out for India.\nKnowing Honor it's probably a minimum 3 months away.", "time": "11-08-2017 02:24 AM", "replies": [{"postID": "post6060493", "text": "There's a slight chance given that the op has 44 posts here... Granted a small one but more than some who come and post just once or twice", "time": "11-08-2017 04:30 PM", "replies": []}, {"postID": "post6060495", "text": "So you really think 3 vs 4 months is going to make a difference?", "time": "11-08-2017 04:32 PM", "replies": [{"postID": "post6060609", "text": "Yup. Once it hit that 4 months , and it's just now releasing in your country ... phone isn't new new. I wouldn't pay full price for it", "time": "11-08-2017 05:18 PM", "replies": [{"postID": "post6060735", "text": "I see. Well let's see what the general public thinks, and how many will buy", "time": "11-08-2017 06:30 PM", "replies": [{"postID": "post6060772", "text": "It'll still sell. Not everyone buys phones right away", "time": "11-08-2017 07:05 PM", "replies": [{"postID": "post6061064", "text": "I still don't think it will sell well in the usa.", "time": "11-08-2017 10:52 PM", "replies": [{"postID": "post6061071", "text": "Oh if you're talking about USA. Then it probably won't", "time": "11-08-2017 10:58 PM", "replies": [{"postID": "post6062122", "text": "Yeah I am talking about usa.", "time": "11-09-2017 02:40 PM", "replies": [{"postID": "post6062400", "text": "Topic was about India. Thought that's what you were taking about too lol.", "time": "11-09-2017 05:30 PM", "replies": [{"postID": "post6063815", "text": "Oh i must have been confused with another thread", "time": "11-10-2017 04:54 PM", "replies": [{"postID": "post6063864", "text": "That's fine. I get confused as well. I had to read a couple of posts before commenting making sure I'm in the right topics as everyone else.", "time": "11-10-2017 05:23 PM", "replies": [{"postID": "post6063930", "text": "I did read the few posts before it but it wasn't clear that it was only about India", "time": "11-10-2017 06:03 PM", "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"postID": "post6059531", "text": "Phone is still pretty new. If we're talking like a minimum of 4 months then that's different.", "time": "11-08-2017 02:35 AM", "replies": [{"postID": "post6060495", "text": "So you really think 3 vs 4 months is going to make a difference?", "time": "11-08-2017 04:32 PM", "replies": [{"postID": "post6060609", "text": "Yup. Once it hit that 4 months , and it's just now releasing in your country ... phone isn't new new. I wouldn't pay full price for it", "time": "11-08-2017 05:18 PM", "replies": [{"postID": "post6060735", "text": "I see. Well let's see what the general public thinks, and how many will buy", "time": "11-08-2017 06:30 PM", "replies": [{"postID": "post6060772", "text": "It'll still sell. Not everyone buys phones right away", "time": "11-08-2017 07:05 PM", "replies": [{"postID": "post6061064", "text": "I still don't think it will sell well in the usa.", "time": "11-08-2017 10:52 PM", "replies": [{"postID": "post6061071", "text": "Oh if you're talking about USA. Then it probably won't", "time": "11-08-2017 10:58 PM", "replies": [{"postID": "post6062122", "text": "Yeah I am talking about usa.", "time": "11-09-2017 02:40 PM", "replies": [{"postID": "post6062400", "text": "Topic was about India. Thought that's what you were taking about too lol.", "time": "11-09-2017 05:30 PM", "replies": [{"postID": "post6063815", "text": "Oh i must have been confused with another thread", "time": "11-10-2017 04:54 PM", "replies": [{"postID": "post6063864", "text": "That's fine. I get confused as well. I had to read a couple of posts before commenting making sure I'm in the right topics as everyone else.", "time": "11-10-2017 05:23 PM", "replies": [{"postID": "post6063930", "text": "I did read the few posts before it but it wasn't clear that it was only about India", "time": "11-10-2017 06:03 PM", "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"postID": "post6060299", "text": "Probably be a popular phone for India due to the low starting price.", "time": "11-08-2017 02:35 PM", "replies": []}, {"postID": "post6060941", "text": "The 7X may do very well in India and Asia I'm thinking.\nGoes without saying honor designs these low line phones to support their popular markets.", "time": "11-08-2017 08:53 PM", "replies": [{"postID": "post6061066", "text": "Yeah people in those markets aren't tied to Samsung and Apple", "time": "11-08-2017 10:53 PM", "replies": []}, {"postID": "post6061074", "text": "Those markets are lucky. They get a lot more phones than the states", "time": "11-08-2017 11:04 PM", "replies": [{"postID": "post6062124", "text": "That is true. We in the usa are limited", "time": "11-09-2017 02:41 PM", "replies": [{"postID": "post6062401", "text": "Yes, despite being the 3rd biggest market in the world, and yet, we are limited", "time": "11-09-2017 05:31 PM", "replies": [{"postID": "post6063816", "text": "Oh third? I didn't not know that", "time": "11-10-2017 04:54 PM", "replies": [{"postID": "post6063861", "text": "Yah, India just took the 2nd spot recently.", "time": "11-10-2017 05:23 PM", "replies": []}]}]}]}]}]}, {"postID": "post6064366", "text": "I scam thru this thread real quick, I believe we talked about India", "time": "11-11-2017 01:22 AM", "replies": []}, {"postID": "post6064370", "text": "Well the first 2 posts kind of pointed at the original subject of this thread.", "time": "11-11-2017 01:27 AM", "replies": [{"postID": "post6065309", "text": "Good point. Back on topic, XDA-Developers also mentions an India launch next monthhttps://www.xda-developers.com/honor...ecember-honor/", "time": "11-11-2017 04:23 PM", "replies": []}]}, {"postID": "post6064399", "text": "Pretty much", "time": "11-11-2017 02:26 AM", "replies": []}, {"postID": "post6065708", "text": "Nice. Hopefully OP is satisfied with this info", "time": "11-11-2017 09:05 PM", "replies": []}, {"postID": "post6068402", "text": "No response, we will just assume that he got the answer he is looking for.", "time": "11-13-2017 07:58 PM", "replies": []}, {"postID": "post6069872", "text": "India before the US then?\nI don't really care much for honor phones now though.", "time": "11-14-2017 06:22 PM", "replies": []}, {"postID": "post6070055", "text": "I'm sure India will get it before usa", "time": "11-14-2017 09:04 PM", "replies": []}, {"postID": "post6070072", "text": "It's by honor so it won't appear in the US anyway. Unless it's a failure everywhere else then it might show in the US dead on arrival.", "time": "11-14-2017 09:13 PM", "replies": [{"postID": "post6070155", "text": "Doubt it. I think the 6x did relatively well in the states", "time": "11-14-2017 10:03 PM", "replies": [{"postID": "post6072040", "text": "Not that well considering that Huawei hasn't pushed a single update", "time": "11-15-2017 08:29 PM", "replies": []}]}, {"postID": "post6072038", "text": "Yeah, that's most likely the case", "time": "11-15-2017 08:28 PM", "replies": []}]}, {"postID": "post6070172", "text": "My opinion:\nI don't think people in the US buy honor phones unless they notice them on Amazon etc...for a low price.", "time": "11-14-2017 10:18 PM", "replies": []}, {"postID": "post6070214", "text": "Possibly. Or walk into best buy and see it in the display", "time": "11-14-2017 10:51 PM", "replies": []}, {"postID": "post6070246", "text": "I've never seen an honor phone in a BB store around here.", "time": "11-14-2017 11:08 PM", "replies": [{"postID": "post6070255", "text": "It's in best buy in my area. I think I've seen some in best buy mobile stores in the mall too.", "time": "11-14-2017 11:12 PM", "replies": []}]}, {"postID": "post6070265", "text": "I don't frequent BB very much.\nTraffic here is a pain in the *** so I shop on line a lot anyways.", "time": "11-14-2017 11:18 PM", "replies": []}, {"postID": "post6070333", "text": "I don't go a lot either cause they're usually expensive there", "time": "11-15-2017 12:23 AM", "replies": []}, {"postID": "post6070338", "text": "BB customer service is cool.\nI bought an open box camera lens from them online.\nIt was missing the hood.\nDrove over to the store to ask for a return.\nCustomer service just exchanged it for a brand new sealed in box lens.\nLeft with the big smile on my face", "time": "11-15-2017 12:28 AM", "replies": []}, {"postID": "post6070378", "text": "Oh replaced a used product for a new one. Nice ! Did they know it was from am open box purchase ?", "time": "11-15-2017 12:53 AM", "replies": []}, {"postID": "post6070403", "text": "Yes", "time": "11-15-2017 01:12 AM", "replies": [{"postID": "post6070439", "text": "You scored a good one right there", "time": "11-15-2017 01:47 AM", "replies": []}]}, {"postID": "post6070407", "text": "Phones are becoming so much harder to choose these days... Sometimes I want a budget phone over a flagship lol", "time": "11-15-2017 01:15 AM", "replies": [{"postID": "post6070423", "text": "Nothing wrong with that. Mid range phones are getting better and better every year. And can easily be used as a daily driver with no issues", "time": "11-15-2017 01:38 AM", "replies": []}]}, {"postID": "post6072079", "text": "Not true. Nougat is out. but somehow it's not out for everyone", "time": "11-15-2017 08:43 PM", "replies": [{"postID": "post6072354", "text": "???", "time": "11-16-2017 01:56 AM", "replies": [{"postID": "post6072431", "text": "Nougat has been pushed to 6x earlier in the year.", "time": "11-16-2017 05:26 AM", "replies": [{"postID": "post6072951", "text": "I don't disagree that it has been released, but people are having problems updating to it.", "time": "11-16-2017 01:03 PM", "replies": [{"postID": "post6073162", "text": "Is there no nougat update in ff?", "time": "11-16-2017 03:16 PM", "replies": [{"postID": "post6073544", "text": "You would need someone with the 6x to check... I don't have one", "time": "11-16-2017 08:06 PM", "replies": [{"postID": "post6073585", "text": "Ah I see", "time": "11-16-2017 08:45 PM", "replies": [{"postID": "post6075115", "text": "Yeah it only shows updates for the phone that you are on.", "time": "11-17-2017 10:24 PM", "replies": []}]}]}]}]}]}]}, {"postID": "post6072947", "text": "Well then there's some problem with Huawei system then. Because it should go out to everyone. And if it does not then those who don't get it should be able to get a warranty replacement.", "time": "11-16-2017 01:01 PM", "replies": [{"postID": "post6073160", "text": "I wasn't aware this happened to some people. Pretty sad. I would contact huawei for it", "time": "11-16-2017 03:15 PM", "replies": [{"postID": "post6073559", "text": "You weren't aware? But you posted this comment just yesterday? Please clarify.", "time": "11-16-2017 08:20 PM", "replies": [{"postID": "post6073584", "text": "I wasn't aware this happened when the rollout went out. I thought it was a global rollout. I just repeated myself in that post.", "time": "11-16-2017 08:44 PM", "replies": [{"postID": "post6075114", "text": "Oh OK. Well good thing you know now.", "time": "11-17-2017 10:23 PM", "replies": []}]}]}]}]}]}, {"postID": "post6073228", "text": "Is the 7x also the Mate 10 Lite?", "time": "11-16-2017 04:02 PM", "replies": [{"postID": "post6073347", "text": "No that's a different device. Mate 10 Lite is also known as Honor 9i, Nova 2i and Maimang 6", "time": "11-16-2017 05:26 PM", "replies": []}]}, {"postID": "post6073451", "text": "You had to look that up didn't youz", "time": "11-16-2017 06:50 PM", "replies": [{"postID": "post6073545", "text": "What, you aren't familiar with the maimang 6?", "time": "11-16-2017 08:07 PM", "replies": []}, {"postID": "post6073582", "text": "I did ! Only because I didn't know how the China version spelled like. Lol", "time": "11-16-2017 08:42 PM", "replies": [{"postID": "post6075111", "text": "Oh OK glad to hear that you knew it except for the spelling.", "time": "11-17-2017 10:22 PM", "replies": [{"postID": "post6075224", "text": "Yup. I've seen a couple videos about it and how many version names there were for the same phone", "time": "11-17-2017 11:50 PM", "replies": []}]}]}]}, {"postID": "post6073548", "text": "Lol...", "time": "11-16-2017 08:10 PM", "replies": []}]}, {"title": "December 5th UK launch event", "thread": [{"postID": "post6028517", "text": "Honor is holding a launch event on December 5th in the UK. Do we think this is for the 7x or a completely different phone. My money is on the 7x UK launch with hopefully US launch shortly after.", "time": "10-19-2017 10:45 PM", "replies": []}, {"postID": "post6038594", "text": "Hopefully it will be the 7x! They have made significant strides from the 5x to 6x. Can't wait to see what's in store for the 7x", "time": "10-25-2017 05:29 PM", "replies": [{"postID": "post6038999", "text": "I agree, I think its the 7x. As much as I like the honor 8, the x series has sold better.", "time": "10-25-2017 10:11 PM", "replies": []}]}]}]
