[{"title": "Are you interested in buying the XZ2 or the XZ2 Compact?", "thread": [{"postID": "post6172786", "text": "I'm curious to know.\nAs someone that owned the XZ1 Compact, the XZ2 Compact sounds good but I'm not sure. \nHow about you? Are you interested in buying the XZ2 or the XZ2 Compact?", "time": "02-26-2018 11:51 AM", "replies": [{"postID": "post6175763", "text": "I'm pretty sure that I'm getting the XZ2. It'll depend on US pricing though. I'm back on iOS as my daily, but I'd love to have the XZ2 for my second line.", "time": "03-01-2018 10:14 AM", "replies": []}]}, {"postID": "post6176762", "text": "I'm going to be following reviews. I'm always interested in Sony phones because I think they make great ones but honestly, I'm a little bummed that they got rid of the blocky design. I was hoping for a thin bezel remake but the same overall vibe.", "time": "03-02-2018 09:50 AM", "replies": [{"postID": "post6177239", "text": "This!! And also will they ever be able to fix the terribly slow shutter speed?", "time": "03-02-2018 04:47 PM", "replies": []}]}, {"postID": "post6178571", "text": "I'm interested. I have the XZ1 C. I like Sony's software. I'll wait for reviews before any decision to buy.", "time": "03-04-2018 06:51 AM", "replies": []}, {"postID": "post6179100", "text": "I use the Compact XZ1 as my backup phone. I may sell it and treat myself to the XZ2. It will come with a glass back, wireless charging and a larger battery.\nI'd be a little concerned that the higher resolution on the XZ2 Compact screen will eat up the small bump in the mAh that Sony added. \nBut for now I'll stay with my current phone Pixel 2.", "time": "03-04-2018 07:18 PM", "replies": []}, {"postID": "post6179616", "text": "I'm going to keep an eye on them. I have the XZS and at some point I'd like to update to a new Sony but I'm not sure if the XZ2 is it or not", "time": "03-05-2018 09:50 AM", "replies": []}, {"postID": "post6181945", "text": "I'll keep an eye out, but as long as the Sony phones don't display bluetooth meta data on my car stereo I'll pass. Also I hate how they bake in apps like Facebook as system apps so they can't be deleted, only disabled. I also don't know if I could do a phone with no AOD after using the G6, S8+, and Note 8.", "time": "03-07-2018 08:59 AM", "replies": []}, {"postID": "post6185406", "text": "I'd advise people to go out and check out GSM Arena's photo compare tool with the XZ2. Sony definitely is using the new Spectra 280 ISP (which they apparently helped design) to their advantage. Would like to see samples ftom other sources too, but if these hold up they've definitely made advances, even while using the same IMX 400 sensor from last year's models. (Though they still have a bit too much sharpness I think)https://www.gsmarena.com/piccmp.php3...&idPhone3=8804", "time": "03-10-2018 12:58 PM", "replies": []}, {"postID": "post6186962", "text": "Does anyone know when it's being released in the US? I'm interested as well", "time": "03-11-2018 10:29 PM", "replies": [{"postID": "post6196705", "text": "I was wondering the same thing. I read a few articles that this would work on Verizon's Network as well, can anyone confirm? \nAlso in Europe, if you pre-order, you get a free PS4 or PSVR. I hope that deal is in the US as well", "time": "03-20-2018 10:35 AM", "replies": []}]}, {"postID": "post6187207", "text": "Does anyone know if it finally surfaces raw (even if requiring a 3rd party camera app) ?", "time": "03-12-2018 05:18 AM", "replies": [{"postID": "post6194672", "text": "no one has mentioned it in the early reviews so I would guess not. honestly, I'm not sure what their hang-up is about RAW and the Camera2 API as well.", "time": "03-17-2018 04:26 PM", "replies": []}]}, {"postID": "post6188292", "text": "I really don't like their new design and it's no longer 4.6 inch screen. Also, it's missing 3.5mm headjack.", "time": "03-12-2018 06:36 PM", "replies": []}, {"postID": "post6195853", "text": "I totally am! I just don't know about the prices. I wouldn't mind either the 5.7\" version or the smaller 5.0\" one. I'm trying to save some money so if the prices of this device line (though it's awesome!) are a little high, I will look elsewhere.", "time": "03-19-2018 03:11 PM", "replies": []}]}, {"title": "Raw", "thread": [{"postID": "post6187178", "text": "Anyone know yet if the XZ2 finally surfaces raw output ? \nI can’t find any information online regarding raw (with 3rd party camera apps is fine). \nSony has a long history of not surfacing the raw output even though the sensors support it.", "time": "03-12-2018 04:29 AM", "replies": []}]}]
