[{"title": "Why is my battery life draining so fast? (Huawei P9 Lite Mini)", "thread": [{"postID": "post6195312", "text": "I bought Huawei P9 Lite Mini two months ago and battery was good. But last two days (after new update) my phone loses 30% over night (I turned off Wi-Fi). And battery is draining so fast. Can new update be the problem or is the problem in phone? Please help.", "time": "03-19-2018 07:04 AM", "replies": []}, {"postID": "post6195679", "text": "What do your battery usage stats indicate as having used the charge? That is in Settings > Battery.", "time": "03-19-2018 12:28 PM", "replies": []}]}, {"title": "Error regarding Googlequicksearchbox in camera of P9 Lite", "thread": [{"postID": "post5633440", "text": "Hello,\nHappy New Year to you all!\nI have owned a Huawei P9 Lite for roughly 6 months now and am quite happy with it. However, for the past few days, I've been having the following problem ...\nWhenever I open the camera, I get an error, which, roughly translated from Dutch, says \"Camera is recording audio. Com.google.android.googlequicksearchbox:interactor can't open at the moment\"\n(I added a screenshot)\nIf I tap \"OK\", the error message disappears, but pops right up again seconds later. I can use the camera, but it is of course very annoying if you can't see what you're snapping pictures of.\nI've been Googling about this and I found out that Quicksearchbox refers to a search box or Google Now. However, I do not have a search box widget on my screen and I also don't see the connection between the camera and that, nor the link with Google Now.\nI can't find any topics about the entire error on Google.\nDoes anyone have any idea what's going on? I would prefer not to do a factory reset if not necessary.\nGreetings,\nLenny", "time": "01-06-2017 05:39 AM", "replies": [{"postID": "post5715979", "text": "I have the same problem, so I go to \"OK GOOGLE\" detection, and switch off the \"from any screen\". Done.", "time": "03-18-2017 05:54 AM", "replies": []}]}, {"postID": "post5635338", "text": "Welcome to Android Central! Try wiping the cache partition: http://www.solvemix.com/index.php/an...rtition-solved. If the problem persists, see if it goes away in Safe Mode: http://consumer.huawei.com/ca/suppor...a.htm?id=55398. If it does, then something you installed is interfering. You might have to uninstall apps one by one until the problem goes away.", "time": "01-07-2017 11:02 PM", "replies": [{"postID": "post5636773", "text": "Thank you... Clearing the cache seems to have done the trick! \nLenny", "time": "01-09-2017 06:13 AM", "replies": []}]}, {"postID": "post5637050", "text": "Great! Let us know if the problem returns.", "time": "01-09-2017 10:03 AM", "replies": []}, {"postID": "post5644121", "text": "Also I am facing same problem with mate 9 .\nWhile using some apps like yeecall,WhatsApp or even phone above error will pop-up.\nIn the begining I thought it's a software issue and I did reset the phone twice but nothing happened.\nSo please advice", "time": "01-15-2017 12:43 AM", "replies": [{"postID": "post5647801", "text": "I just bought a P9 yesterday and had the same problem, the issue is that I had enabled \"OK Google\" to work from every screen, soon as I disabled that, the error stopped showing up in various apps. To bad the mic can't handle two apps at a time :/", "time": "01-18-2017 06:46 AM", "replies": []}]}, {"postID": "post5682483", "text": "Just to confirm what Gretar has said, go to your Google Now settings - Voice - and disable the bit where you can access Google now from any screen by saying \"OK Google\". I had exactly this problem but as soon as I disabled this it sorted it out. \nObviously the 'ok google from any screen' setting means having the microphone permanently on, which seemingly causes lots of issues in other apps.", "time": "02-18-2017 08:49 AM", "replies": [{"postID": "post5696657", "text": "This method really solved my problem. Thank you for sharing ^_^", "time": "03-02-2017 10:15 AM", "replies": []}, {"postID": "post5699309", "text": "Thanks, it was useful for me as well. I met the same situation on a P9.\nI tried turning off Huawei's quick calling, but nothing changed. Disabling OK Google seems the easiest solution.", "time": "03-04-2017 01:58 PM", "replies": []}, {"postID": "post5708303", "text": "This worked so well. Thank you, tried cleaning cache, but it didn't work on P9 lite.", "time": "03-11-2017 02:33 AM", "replies": []}]}, {"postID": "post5689340", "text": "I had the same problem with my p8 (not lite) \nHowever I solved it differently. (Edit did not solve, issue came back)\n(Wiping cache did not help) \nI disabled quick calling (Huawei feature) since it seems Huawei related and I trust Google SW more than Huawei =) \n1 Search for voice in settings (in settings search box)\n2 choose voice control\n3 choose quick calling\n4 turn quick calling off\nDone \nno more issues and I have \"hello google\" still active so I guess the 2 features were fighting about mic and when camera also request, 3parties was too much. \nIssue came after updating to latest build nr ending with b390 and emui 4.0.1 on Android 6.0\nEdit: issue came back, so it seems like I need to turn off hello goggle as well.\nOh and it was a l8tr phone I have", "time": "02-24-2017 03:43 AM", "replies": [{"postID": "post5693995", "text": "I tried this route unfortunately it didnt work for me on my P9 but turning google voice off on every page did.\nHopefully 1 of the 2 will for future readers", "time": "02-28-2017 08:21 AM", "replies": []}]}, {"postID": "post5696343", "text": "I can't find voice in setting. Care to give step by step instructions?", "time": "03-02-2017 02:55 AM", "replies": [{"postID": "post5696416", "text": "It is if you go in to like your making a call then press on the right bottom lines and go to setting you have it there.\nBut mine was off and cleaned cache.. still get the error on my P9", "time": "03-02-2017 05:58 AM", "replies": []}]}, {"postID": "post5696383", "text": "Is there anyway to fix this without turning off the \"OK Google\" from any screen??? I use that features heavily. Clearing the cache doesn't fix it for me.\nSince this used to work for me, but not anymore... I'm hating Huawei right now...", "time": "03-02-2017 04:42 AM", "replies": []}, {"postID": "post5696642", "text": "unfortunately, my problem still not solve. I've done the wipe cache but it doesn't work on my Huawei p9 lite. Is this the problem that caused by this phone since I'm Huawei p9 lite user as well? I hope that there will be other ways to solve this problem. Please kindly help me.", "time": "03-02-2017 10:01 AM", "replies": []}, {"postID": "post5698581", "text": "I had the problem on the Mate 9. The above solution to disable 'access Google Now from any screen' worked beautifully. Thanks.", "time": "03-03-2017 08:34 PM", "replies": []}, {"postID": "post5699319", "text": "i got solution for my P9 lite.\nFollowing the Steps\n1- settings\n2- google\n3- search\n4- voice\n5- 'Ok Google' detection\n6- Delete voice model\n7- Ok\n8- Enjoy", "time": "03-04-2017 02:05 PM", "replies": [{"postID": "post5699476", "text": "Thank you for the steps below.. It really helped me locate ok Google on my honor 8.", "time": "03-04-2017 06:39 PM", "replies": []}, {"postID": "post5803453", "text": "I've got a P9, and had the same error message \"camera is currently recording audio. com.google.android.googlequicksearchbox:interactor will not be able to record right now\". The first 5 steps worked for me, and then:\n6. From any screen - disable.", "time": "05-06-2017 02:14 PM", "replies": []}, {"postID": "post6007221", "text": "This really worked on my P9 Plus. Thanks.", "time": "10-06-2017 08:02 AM", "replies": []}, {"postID": "post6099343", "text": "Thank you Muhammad Jasim, this helped solve my problem", "time": "12-07-2017 03:16 PM", "replies": []}]}, {"postID": "post5699470", "text": "This happened on my Mate 9. The persistent error message will pop up in every app that uses the microphone. Tried clearing cache, wiping cache partition but didn't help. The only way is to disable OK Google detection from any screen. Sad that there's no other way.", "time": "03-04-2017 06:31 PM", "replies": [{"postID": "post5941033", "text": "I used this as my phone kept getting pop ups so I couldn't use my camera and this method has sorted it out thanks would recommend trying this", "time": "08-27-2017 07:40 AM", "replies": []}]}, {"postID": "post5705414", "text": "I have the same error in my mate 9\nIt used to work with no issues but not these dialogs pop-up all the time while using the mic on other apps. The only way to disable is to disable voice control from any screen as stated above\nAlso everytime I connect or disconnect phone to computer or charger another dialog pop-ups. Very annoying\nSeems like a Huawei soft issue as it started happening after the last update. Tried cleaning cache, etc but did not work", "time": "03-08-2017 09:31 PM", "replies": []}, {"postID": "post5708370", "text": "Clearing cache in play services worked for me. Definitely coming from there bc I just got the google assistant update...lost features vs google now. Only setting I have is for it to always listen...no separate settings for any screen, screen off, personal results....plus I couldn't even turn off that 1 always listening option to troubleshoot so, ironically, I deleted voice model, then set it back up, THEN I started getting this error and ended up here. But I want voice so started by deleting cache and that's working for now. Despite wanting it so badly, assistant has just been a pain on Honor so I'm sure this or something else will be broken again tomorrow.", "time": "03-11-2017 04:43 AM", "replies": []}, {"postID": "post5708486", "text": "This has definitely something to do with the latest update.\nTried all the solutions above, none worked on my Honor8.\nFor now, I've completely denied Google app access to the microphone.\nSettings - permissions - microphone\nSo far so good", "time": "03-11-2017 07:39 AM", "replies": []}, {"postID": "post5708882", "text": "Thank you for sharing this. I've had this problem for 2 weeks and it is finally solved. You are an absolute legend.", "time": "03-11-2017 02:39 PM", "replies": []}, {"postID": "post5708883", "text": "Hopefully Huawei release an update to fix this problem if its possible.", "time": "03-11-2017 02:41 PM", "replies": []}, {"postID": "post5709856", "text": "Hey bro I had the samesame thing and I just did this:\nGo to google not google chrome but the google app with the G.\nThen on your top left the will be the menu button. \nClick that go to settings. \nClick voice. \nClick \"Ok google\" detection. \nThen the first point on top \"from the google app\" disable that and restart your phone. \nEverything will be back to normal.\nHave a nice day", "time": "03-12-2017 12:59 PM", "replies": []}, {"postID": "post5710076", "text": "clear cache for google search. It solved it for me", "time": "03-12-2017 05:28 PM", "replies": []}, {"postID": "post5716904", "text": "Settings, Google voice typing, \"ok Google\" detection, \nSelect From the Google app.", "time": "03-19-2017 02:31 AM", "replies": []}, {"postID": "post5718167", "text": "Thank you! Thank you! Thank you!!! I tried every it seemed and nothing worked until I deleted the voice model! Thank youuuuuuu!", "time": "03-20-2017 08:18 AM", "replies": []}, {"postID": "post5719982", "text": "none of the above has worked for me on my sensa phone how do you delete the voice model?", "time": "03-21-2017 01:37 PM", "replies": []}, {"postID": "post5723004", "text": "Hi everyone, you know i have the same problem like all of you pal, as far as I know you can solve the problem like this :\n- go to setting\n- Google \n- tap search at the end \n- then select voice \n- then 'Ok Google' \n- select 'Delete voice model' \n@@@@then enjoy @@@@\nit works : p9, mate 8, mate 9, p9 lite\nplz do it and tell us that problem solve or not.", "time": "03-23-2017 05:41 PM", "replies": []}, {"postID": "post5725225", "text": "Guys, I came across a full instruction on how to solve this problem. And to my happiness one of the methods helped to overcome it on Huawei P9. Here's the 100%-working solution:Source: https://android-fix.com/android-erro...ing-audio.html", "time": "03-25-2017 11:12 AM", "replies": []}, {"postID": "post5726151", "text": "Hey guys i just fixed it like 15 mins ago.\nso apparently the problem occurs when u have the google app that can recognize your voice when you say like \"OK google\"\nso i figure i can just disable(deny) Google permission to use microphone. it works but i wont be able to quickly do a quick google search by using my voice, which used to be very helpful to me.\nso what i did next instead is to go to the Google App i found on the menu. Settings, > Voice > \"OK google\" detection and just disable \"From any screen\". tested it out and it works.\nby enabling this you can say ok google anywhere INCLUDING IN CAMERA MODE. but by disabling it you will need to be on the home menu for it to work if im not mistaken.\nso yea thats it. hope this helps", "time": "03-26-2017 07:55 AM", "replies": []}, {"postID": "post5749327", "text": "I've had the same issue coming up if I try to take videos. Still photos were fine but I had that same error message (in English) whenever I tried to record something. \nI fixed it by opening the camera app on normal photo mode then swiped right to settings and then scrolled down to the bottom and clicked restore defaults. A message then pops up to say 'camera settings will be restored to their default values.' I clicked ok and then swiped back onto camera mode. A couple of messages came up for permissions like allowing location service so I accepted the ones I wanted. I had no message about ok Google though as I don't use it so maybe it's best to decline that if it comes up on yours. I then clicked on the video function, pressed record and it records as normal. Problem fixed! Yay! \nHope this works for you.", "time": "04-08-2017 04:23 AM", "replies": []}, {"postID": "post5754080", "text": "Guys honestly listen to Bigbadboogie he truly solved my problem.. Thanks mate", "time": "04-11-2017 10:26 AM", "replies": []}, {"postID": "post5765743", "text": "Hi therebabe,\nDx", "time": "04-18-2017 09:43 AM", "replies": []}, {"postID": "post5783707", "text": "any update to this or better solutions? \nyou can't use google assistant on your phone as the issue comes then...", "time": "04-25-2017 10:43 AM", "replies": []}, {"postID": "post5786032", "text": "Camera", "time": "04-26-2017 11:20 AM", "replies": []}, {"postID": "post5787629", "text": "camera? \nthe issue presists throughout the whole phone and actions!", "time": "04-27-2017 04:42 AM", "replies": []}, {"postID": "post5802314", "text": "I have a Huawei P9 with the same issue.\nTry this as it worked for me.\nSettings\nGoogle\nApps connected\nThen disconnect any apps that might be using the mic all the time. \nI had 'Google sing' and some other Google game related crap. \nI disconnected them both and so far so good. \nWorth a shot! Good luck.", "time": "05-05-2017 03:41 PM", "replies": []}, {"postID": "post5823872", "text": "Hi all, I've tried all the above and it didn't work, very frustrating, but then I stumbled on a YouTube vid that did work. So on your P9, go to \"Settings : Apps : Advanced (at the bottom) : App Permissions : Microphone and slide/switch off Google App\". Hey Presto!! Video will record.", "time": "05-22-2017 05:37 AM", "replies": []}, {"postID": "post5893375", "text": "Hi my mobile honor 5x how to automatic call record and how to connect otg cable pls rpy", "time": "07-20-2017 09:47 PM", "replies": []}, {"postID": "post5934678", "text": "Was able to fix the problem by disabling the google app.\nOn huawei mate 8.", "time": "08-23-2017 08:51 PM", "replies": []}, {"postID": "post5987371", "text": "I have solved problem by this step.", "time": "09-21-2017 11:02 PM", "replies": []}, {"postID": "post6045827", "text": "Settings --> Google --> Search --> Voice --> turn off all\nSettings --> Google --> Search --> Screen Search --> turn off\ntry this, the error will stop.. it is working for me and the error never came back", "time": "10-30-2017 12:37 PM", "replies": []}, {"postID": "post6184874", "text": "So none of these suggestions worked for me, when trying to get rid of \"is currently recording audio.com.google.android.googlequicksearchbox\"\nSo I did the only thing I could do and did a Network Settings Reset.\nSettings\nAdvanced Settings\n(Scroll down)\nBackup & reset\nNetwork Settings Reset. \nHope I helped anyone, it was an annoying error to get rid of.", "time": "03-09-2018 11:26 PM", "replies": []}, {"postID": "post6186515", "text": "I tried to wipe partition, doesn't work.\nI tried to delete voide model(in google now) , doesn´t work\nI tried to disable google now assistant-> google(swipe left) ->settings-> voice-> voice match-> disable Say \"Ok Google\" any time . Yes , OK works, but I want to have activate my google assistant. \n*I tried this and works, google assistant and ANY app that use mic(recorder, whatsapp voice,etc) without error : \n- Swipe down(menu bar)-> go to Settings(wheel icon)-> Apps -> tap on icon Avdanced(wheel icon)-> choose Default app settings -> go Assistance &voice input:\nChoose none in Assist app\nChosse Basic Google recognition in voice input.\nSave it . \nNow works both google assistant(any place and app , you can say \"OK GOOGLE\")and any app that use mic to record o send voice message. \nwhat a relief!!:-)", "time": "03-11-2018 02:18 PM", "replies": []}]}, {"title": "Problem with fingerprint scanner Huawei P9", "thread": [{"postID": "post6163142", "text": "Problem with fingerprint scanner\nLately the fingerprint scanner won't unlock the phone. There's no vibration indicating wrong fingerprint, it just does nothing. When I unlock the phone using PIN it works fine opening top notification panel or scrolling through photos. When I go to settings and fingerprints manager it recognizes my fingerprints without a problem. Even when I lock the phone it works well for couple of times but after a while it stops working again. \nI already switched the phone off and on again but it changed nothong. \nAny advice besides resetting to factory settings? \nThanks for any help", "time": "02-15-2018 07:12 AM", "replies": []}, {"postID": "post6179457", "text": "I have the same problem, have you found a solution?", "time": "03-05-2018 07:09 AM", "replies": [{"postID": "post6180561", "text": "See response in your other thread: How to turn on safe mode on Huawei P9", "time": "03-06-2018 01:58 AM", "replies": []}]}]}, {"title": "My fingerprint lock sensor stopped working", "thread": [{"postID": "post6179454", "text": "So, today I noticed my fingerprint isn't working. I tried turning the phone off and on again. When I turn it back on it works for less than 20 secs. It doesn't register wrong finger neither I can use it for looking pictures in gallery. Should I try doing a factory reset and has anyone had the same problem? Thanks for help.", "time": "03-05-2018 07:07 AM", "replies": []}, {"postID": "post6180559", "text": "Welcome to Android Central! Does it also happen in Safe Mode? How to turn on safe mode on Huawei P9", "time": "03-06-2018 01:58 AM", "replies": []}]}, {"title": "P9 lite internet dont work.", "thread": [{"postID": "post6169971", "text": "Hello, I found a issue that I can't connect to internet with WiFi or 4G internet. Let me start: 1-3 Days I could connect to internet, it was slower and google chrome, with some games didint work. Everything else worked fine. Today- Cant connect anywhere. It shows that there is connection but its 0 mbps. Internet on computer works fine. Thank you for reading, Rokas P.S. what does the Key icon mean? (In the image).", "time": "02-23-2018 04:31 AM", "replies": []}, {"postID": "post6170746", "text": "Welcome to Android Central! Does it connect if you turn off wi-fi and use mobile data only?\nI think the key icon is Google Wi-fi Assistant making sure your connection is secure: https://www.howtogeek.com/275474/how...blic-networks/", "time": "02-24-2018 12:26 AM", "replies": []}]}, {"title": "Can't open my gallery and camera using Huawei P9lite", "thread": [{"postID": "post6163016", "text": "I can't open my gallery and camera using Huawei p9", "time": "02-15-2018 02:10 AM", "replies": []}, {"postID": "post6163635", "text": "Welcome to Android Central! Does this persist after a reboot? Or in Safe Mode? How to turn on safe mode on Huawei P9 Lite", "time": "02-15-2018 05:11 PM", "replies": []}]}, {"title": "Why there comes the same notification of 'message not sent' on my huawei p9 lite?", "thread": [{"postID": "post6159062", "text": "I've installed handcent app but it didn't work on my phone.\nSo please anyone of you who has experience about it give me the solution of it. \nThis is annoying me!\nSo kindly give me solution that i can get rid of this useless notification.", "time": "02-09-2018 10:52 PM", "replies": []}]}, {"title": "HuaWei P9, google contact not working", "thread": [{"postID": "post6158738", "text": "I have downloaded google contact. while signing in, it does not show my email address, in turn, process can not be completed. I did try help me to find my account, encountered the same issue.\nPlease note, I have all other google apps installed, like gmail, google plus, google play....", "time": "02-09-2018 01:23 PM", "replies": []}]}, {"title": "Contacts searching by pseudonym. Does not work for Android 7.0 (Huawei P9 lite)", "thread": [{"postID": "post6146964", "text": "It's unbelievable but my Huawei P9 Lite does not search for contacts by a pseudonym (Android 7.0).\nDoes something special have to be set?", "time": "01-27-2018 04:52 AM", "replies": []}, {"postID": "post6146991", "text": "Your search box is gone when you open contacts?", "time": "01-27-2018 06:42 AM", "replies": []}, {"postID": "post6148104", "text": "I just write a pseudonym in place where usually we write a name. In my old samsung rigth person is found. In Huawei P9 lite it doe not work", "time": "01-28-2018 03:22 PM", "replies": []}]}, {"title": "Huawei p9 lite - moving apps to ad card", "thread": [{"postID": "post6066100", "text": "So I've been promoted to download an os update. I have no internal room as there is 9gb (!) App data on the internal when default is set to install to sd card. Had a Google but doesn't seem straight forward as apps aren't allowing to be moved?\nThanks", "time": "11-12-2017 07:27 AM", "replies": []}, {"postID": "post6067992", "text": "Most app data can't be moved to sd card unfortunately.", "time": "11-13-2017 03:52 PM", "replies": [{"postID": "post6068804", "text": "Surely there is a workaround? What is the point in using an SD card ? Main reason I ditched apple was for this reason.\n9gbs of app data and I don't have a LARGE number of apps. Large sd card barely used, with just music files.", "time": "11-14-2017 05:43 AM", "replies": [{"postID": "post6069439", "text": "You can setup the sd card as adoptable storage if your phone supports it.\nUnfortunately Huawei does not.", "time": "11-14-2017 01:05 PM", "replies": []}]}]}, {"postID": "post6070479", "text": "You can store pictures and videos. Will transferring all your device stored pictures and videos to the sd card makes enough room to update your phone?", "time": "11-15-2017 02:46 AM", "replies": [{"postID": "post6071308", "text": "That might help. Doesn't hurt to try", "time": "11-15-2017 01:16 PM", "replies": []}]}, {"postID": "post6070481", "text": "uninstall some apps your rarely use as well", "time": "11-15-2017 02:47 AM", "replies": [{"postID": "post6071309", "text": "Another good idea. Especially large apps", "time": "11-15-2017 01:16 PM", "replies": [{"postID": "post6071593", "text": "Yes, it's so easy to start downloading apps and just forget about them. Taking space in your phone", "time": "11-15-2017 04:11 PM", "replies": [{"postID": "post6073314", "text": "Oh i know what you mean. Sometimes I will download apps to try out and forget it delete them", "time": "11-16-2017 05:03 PM", "replies": []}]}]}]}, {"postID": "post6073681", "text": "I deleted a few last week. And realized I need stop downloading random apps that sounds interesting but never used after.", "time": "11-16-2017 09:36 PM", "replies": [{"postID": "post6080141", "text": "You and me both! It ends up being too much clutter", "time": "11-21-2017 04:47 PM", "replies": [{"postID": "post6080204", "text": "I'm still doing it tho", "time": "11-21-2017 05:22 PM", "replies": [{"postID": "post6081388", "text": "Ugh. Same here. I really need to stop", "time": "11-22-2017 02:04 PM", "replies": []}]}]}]}, {"postID": "post6081461", "text": "I have a couple games installed which I haven't even played yet. I feel like I will play them later so I'm keeping them installed lol", "time": "11-22-2017 03:33 PM", "replies": []}, {"postID": "post6143973", "text": "So after thinking this has gone away - following a holiday (in which my gfs phone battery broke due to a Qatar airways USB charger) she created albums on my phone for Facebook uploads (use internal memory) - I've moved back to camera / SD card but am having constant \"full\" notifications to the point where my Gmail won't send email !!\nPlease look at the screenshot I have removed pics from.thr phone, deleted half the apps, removed WhatsApp text and Facebook messages... \n1) the below numbers don't add up\n2) if all else fails will need to revert back to old firmware ?", "time": "01-23-2018 02:46 PM", "replies": []}]}, {"title": "Video enhancer on Android 7", "thread": [{"postID": "post6130048", "text": "How to turn it off on p9", "time": "01-08-2018 03:51 AM", "replies": []}, {"postID": "post6130093", "text": "Display, Settings, Enhanced features uncheck.", "time": "01-08-2018 05:54 AM", "replies": []}]}, {"title": "Red Green Blue boot screen on huwaei android P9 Lite", "thread": [{"postID": "post6114679", "text": "I am getting Red Green Blue boot screen on huwaei android P9 Lite.\nAnyone has any idea on how it can be resolved?", "time": "12-22-2017 02:45 AM", "replies": []}, {"postID": "post6115669", "text": "Welcome to Android Central! What do you mean by Red Green Blue? Is it stuck on that screen? Can you show us a picture of what it looks like? http://forums.androidcentral.com/gen...d-central.html. You'll have to register on this forum first. https://forums.androidcentral.com/as...ml#post3754828", "time": "12-23-2017 12:27 AM", "replies": []}]}, {"title": "Huawei P9 display problems", "thread": [{"postID": "post5456739", "text": "Hi guys!I just bought my huawei p9 and i noticed very very thin lines across display,if the phone sits in a vertical position.The lines are like fingerprint marks,just straight and from lef bottom corner,to right up corner,and parallels,and only observing if the phone sits in a vertical position.It s not really annoying,but i want to find out if this is a problem or is ok. The lines are a bit thiner than the fingerprint lines.Is this a issue?\nSorry for bad english!", "time": "09-30-2016 02:20 PM", "replies": [{"postID": "post6114719", "text": "Lines on the screen means there is a defect on LCD screen flex cable. It can not recover any more. It doesn't matter if you don't mind that line, because the touch sensor and other part of the screen is still working fine. If you want to replace the screen, you should follow some guides. Youtube has many repair guides about this", "time": "12-22-2017 04:34 AM", "replies": []}]}, {"postID": "post5456887", "text": "It does not sound like anything normal to me, unless it's the structure of the display. I'll ask the Moderators to move this to the P9 forum, where other users may have something to say.\n(Your English is good. You described the problem clearly.)", "time": "09-30-2016 03:39 PM", "replies": []}, {"postID": "post5457261", "text": "Mod note. Moved to the P9 forum for more visibility.", "time": "09-30-2016 08:19 PM", "replies": []}, {"postID": "post5457521", "text": "Thank you guys. I would think that this is the structure of the display, because it s all over the screen and uniform, parallels lines. It s not bothering, but I wanna know if it's a problem or not", "time": "10-01-2016 12:08 AM", "replies": [{"postID": "post5845584", "text": "I have the same problem, Sometimes it's annoying but for me it's only on video player on all app, like YouTube, ...", "time": "06-10-2017 05:07 AM", "replies": []}]}, {"postID": "post5850168", "text": "Never had any display issues but if I did it would be going back to my carrier under warranty for investigating", "time": "06-14-2017 10:19 AM", "replies": []}]}, {"title": "Huawei p9 Battery not charging", "thread": [{"postID": "post6113753", "text": "Hi I just replaced my battery and now when I plug-in the charger for few seconds it's showing it's charging but after 4 seconds it's disappear and my phone doesn't charge ..if anyone can help me pls ....thank you", "time": "12-21-2017 04:33 AM", "replies": []}, {"postID": "post6114219", "text": "Welcome to Android Central! Did you do the replacement yourself, or did you take it to a shop? It could be a bad battery, or some disruption to the connections that happened during the replacement process.", "time": "12-21-2017 02:19 PM", "replies": []}]}, {"title": "Is an email required for Huawei P9 hard reset?", "thread": [{"postID": "post6112715", "text": "I forgot the unlock password for my Huawei P9 and since I want to do a factory reset anyway I thought I would do a hard reset.\nI understand that Huawei P9 requires entering an email address when doing a factory reset. Is an email address also required when doing a hard reset? If it is, when would I enter it and would I be prompted?\nMy questions may seem silly but I want to know what's required before I start a hard reset.\nThanks, Lance", "time": "12-20-2017 02:44 AM", "replies": []}, {"postID": "post6113064", "text": "Welcome to Android Central! If you do a hard reset without first removing the primary Google account, it's considered an unauthorized factory reset. This means that after the reset, you have to enter that previous Google account and password to proceed. This is meant to discourage thieves from stealing a phone and doing a simple factory reset to make it their own.", "time": "12-20-2017 10:45 AM", "replies": []}]}, {"title": "Format and Reinstall Phone... Files Transfer etc- Huawei P9 Lite", "thread": [{"postID": "post6111896", "text": "Hi! I have a Huawei P9 Lite and its a bit of a mess right now. \nThere is no space left on the phone and i dont seem to be able to move the apps onto my 32GB memory card (10 GB left on SD card)\nAs there was no space on phone, I started using the memory card for whatsapp, so now the photos that are on the phone cant be viewed as im using the sd card\nI would like to Format and Reinstalled - but make sure all photos etc and move onto SD card before that.\nOnce OS is installed, use device storage for apps, but sd card for photos etc as default.\nAny ideas the best way to sort this mess out!\nThanks", "time": "12-19-2017 10:42 AM", "replies": []}]}, {"title": "P9 update", "thread": [{"postID": "post6103697", "text": "Sorry if this had been posted before. I'm in the UK on the EE network and was wondering if anyone has received the update to Nougat. Had the phone a year and thought it would have came through before now. Wife has the p9 lite on o2.", "time": "12-11-2017 01:47 PM", "replies": []}]}, {"title": "Huawei P9 Lite \"Please update system again!\"", "thread": [{"postID": "post5929256", "text": "Hey guys i really need your help.\nSo i relock my phone, and it's shows \"ERROR MODE, Please update system again!\" Error! Func:NO: 11 (recovery image), (Error NO: 2 (load failed!)\"\nI have access to phone, when im fully discharge device, and then plug in, and run. OS is starting, and everythings seems normal. I can't go to FASTBOOT&RESCUE mode, \nAndroid 7.0, VNS-L21C432B380.\nYes, i'm know i did something wrong with triying to installing root. But please help me.", "time": "08-19-2017 11:56 PM", "replies": [{"postID": "post6098937", "text": "bro have you got any fix?\npleASE TELL ME....CONTACT ME PLEASE", "time": "12-07-2017 10:04 AM", "replies": []}]}]}, {"title": "youtube problems", "thread": [{"postID": "post6093399", "text": "I have a p9+. The last few days my youtube app havent been willing to play videos. I can open the app, and open the videos, but the videos will not play. I have tried on both my wifis and on the mobile net. On my iPhone, iPad and LG4, all on the same YT-account, there is no problem at all. I have tried to reinstall through the playstore and forceclose. Do any of you have the same problem, and suggestions for a solution?", "time": "12-02-2017 08:49 AM", "replies": []}, {"postID": "post6093860", "text": "Try going to Settings>Apps, select YouTube, and Clear Cache/Clear Data.", "time": "12-02-2017 06:15 PM", "replies": []}, {"postID": "post6095242", "text": "Did the solution by B Diddy helped ?", "time": "12-04-2017 05:42 AM", "replies": []}]}, {"title": "(deleted?) alarm keeps going off randomly and plays deleted ringtone", "thread": [{"postID": "post6089152", "text": "Hi. i think a ghost is inhabiting my phone or something \nAn alarm will randomly go off in the background, playing a file that doesn't exist once (custom ringtone) then go silent, it can take 2 minutes to several weeks before this happens again.\nI generally keep the phone silent because I'm in a noisy environment and can't really hear it most of the time, but when i'm expecting a call, this issue is pretty annoying and I consider resetting the phone to be the backup for an emergency solution - so, what can be done to resolve this?\nI have avast installed but it doesn't find anything", "time": "11-29-2017 04:58 AM", "replies": [{"postID": "post6091349", "text": "Do you have any third party alarm clocks installed?", "time": "11-30-2017 04:10 PM", "replies": [{"postID": "post6091524", "text": "I highly doubt the default android clock/alarm app would cache the ringtone. As mentioned, there is no alarms set and the alarm ringtone is different from the ringtone used for incoming calls.If i search for the file name using AndroZip it can not be found.I suppose you can configure a tag to turn an alarm off or on? \nBut i don't have any tags...This part i can not understand. Nope. never was.", "time": "11-30-2017 05:31 PM", "replies": [{"postID": "post6091922", "text": "Probably do the factory reset", "time": "11-30-2017 09:27 PM", "replies": []}]}]}]}, {"postID": "post6089293", "text": "Is there no alarm set up in the clock app? Everything is deleted and cleared ?", "time": "11-29-2017 08:19 AM", "replies": [{"postID": "post6090575", "text": "Thanks, I keep NFC off because i never use itThe last alarm i had stored didn't match the timing of these random ringings.\nEven if it was present, How would it play the sound of a deleted ringtone?", "time": "11-30-2017 06:30 AM", "replies": [{"postID": "post6091359", "text": "Maybe there was more than one copy of the ringtone on the phone?", "time": "11-30-2017 04:13 PM", "replies": [{"postID": "post6091524", "text": "I highly doubt the default android clock/alarm app would cache the ringtone. As mentioned, there is no alarms set and the alarm ringtone is different from the ringtone used for incoming calls.If i search for the file name using AndroZip it can not be found.I suppose you can configure a tag to turn an alarm off or on? \nBut i don't have any tags...This part i can not understand. Nope. never was.", "time": "11-30-2017 05:31 PM", "replies": [{"postID": "post6091922", "text": "Probably do the factory reset", "time": "11-30-2017 09:27 PM", "replies": []}]}]}]}, {"postID": "post6091354", "text": "I am just curious how it could play a ringtone that was deleted", "time": "11-30-2017 04:12 PM", "replies": [{"postID": "post6091478", "text": "Phone is haunted", "time": "11-30-2017 05:10 PM", "replies": []}, {"postID": "post6091524", "text": "I highly doubt the default android clock/alarm app would cache the ringtone. As mentioned, there is no alarms set and the alarm ringtone is different from the ringtone used for incoming calls.If i search for the file name using AndroZip it can not be found.I suppose you can configure a tag to turn an alarm off or on? \nBut i don't have any tags...This part i can not understand. Nope. never was.", "time": "11-30-2017 05:31 PM", "replies": [{"postID": "post6091922", "text": "Probably do the factory reset", "time": "11-30-2017 09:27 PM", "replies": []}]}]}]}, {"postID": "post6089522", "text": "Welcome to Android Central! Does this happen if you turn NFC off?", "time": "11-29-2017 10:58 AM", "replies": [{"postID": "post6090575", "text": "Thanks, I keep NFC off because i never use itThe last alarm i had stored didn't match the timing of these random ringings.\nEven if it was present, How would it play the sound of a deleted ringtone?", "time": "11-30-2017 06:30 AM", "replies": [{"postID": "post6091359", "text": "Maybe there was more than one copy of the ringtone on the phone?", "time": "11-30-2017 04:13 PM", "replies": [{"postID": "post6091524", "text": "I highly doubt the default android clock/alarm app would cache the ringtone. As mentioned, there is no alarms set and the alarm ringtone is different from the ringtone used for incoming calls.If i search for the file name using AndroZip it can not be found.I suppose you can configure a tag to turn an alarm off or on? \nBut i don't have any tags...This part i can not understand. Nope. never was.", "time": "11-30-2017 05:31 PM", "replies": [{"postID": "post6091922", "text": "Probably do the factory reset", "time": "11-30-2017 09:27 PM", "replies": []}]}]}]}, {"postID": "post6091358", "text": "How is nfc related to the alarm?", "time": "11-30-2017 04:12 PM", "replies": [{"postID": "post6091481", "text": "I'm curious to this too", "time": "11-30-2017 05:10 PM", "replies": []}, {"postID": "post6091524", "text": "I highly doubt the default android clock/alarm app would cache the ringtone. As mentioned, there is no alarms set and the alarm ringtone is different from the ringtone used for incoming calls.If i search for the file name using AndroZip it can not be found.I suppose you can configure a tag to turn an alarm off or on? \nBut i don't have any tags...This part i can not understand. Nope. never was.", "time": "11-30-2017 05:31 PM", "replies": [{"postID": "post6091922", "text": "Probably do the factory reset", "time": "11-30-2017 09:27 PM", "replies": []}]}, {"postID": "post6091761", "text": "I asked this in case it actually wasn't an alarm, but rather that odd NFC notification tone that the phone might make if there's something with an NFC chip nearby (like a credit card or other ID card).", "time": "11-30-2017 08:19 PM", "replies": [{"postID": "post6091921", "text": "Oh thats interesting", "time": "11-30-2017 09:27 PM", "replies": []}]}]}]}, {"postID": "post6090578", "text": "Yes that's pretty creepy. You can try a factory reset . Back up your device first before doing so.", "time": "11-30-2017 06:31 AM", "replies": [{"postID": "post6091362", "text": "It definitely is weird. I would also recommend the fdr", "time": "11-30-2017 04:14 PM", "replies": []}]}, {"postID": "post6091484", "text": "Maybe the ring tone isn't fully deleted in the phone. But if it's not set to play that ring tone then that's weird.", "time": "11-30-2017 05:11 PM", "replies": [{"postID": "post6091524", "text": "I highly doubt the default android clock/alarm app would cache the ringtone. As mentioned, there is no alarms set and the alarm ringtone is different from the ringtone used for incoming calls.If i search for the file name using AndroZip it can not be found.I suppose you can configure a tag to turn an alarm off or on? \nBut i don't have any tags...This part i can not understand. Nope. never was.", "time": "11-30-2017 05:31 PM", "replies": [{"postID": "post6091922", "text": "Probably do the factory reset", "time": "11-30-2017 09:27 PM", "replies": []}]}]}]}, {"title": "huawei p9 updates", "thread": [{"postID": "post6085411", "text": "Hi im not a noob but this is my 1st huawei in about 5 years. I recently found a good deal on a p9 and bought it as I had a play on my friends and was happy for what the price was. Problem is that im stuck on 6.0 emui 4.1.3 and no matter what I try (flash manually with dload) or smash update button, in\nIm getting nothing Im in uk and its sim free and my friends wich is EE locked has 7.0 emui 5.0 I believe so any ideas what is going on? Was on b182 when purchased now on b210 becuse I got a 500mb update within last few few days but no nougat. Please any advice/info would be appreciated", "time": "11-26-2017 12:09 PM", "replies": [{"postID": "post6091365", "text": "Is it under warranty? If so then Huawei could warranty it for you", "time": "11-30-2017 04:15 PM", "replies": []}]}, {"postID": "post6086182", "text": "Try downloading Firmware Finder on the app store and force that update for your phone", "time": "11-27-2017 02:22 AM", "replies": [{"postID": "post6091399", "text": "That's another option although the OTA method is preferred", "time": "11-30-2017 04:35 PM", "replies": [{"postID": "post6091487", "text": "Yeah but there's no ota at the moment", "time": "11-30-2017 05:12 PM", "replies": []}]}]}, {"postID": "post6086366", "text": "tried that, unfortunately that hasnt worked it just fails", "time": "11-27-2017 07:52 AM", "replies": [{"postID": "post6087074", "text": "Was there a update tho? Firmware Finder can be a headache and requires to update it few times for it to work.", "time": "11-27-2017 05:43 PM", "replies": [{"postID": "post6091407", "text": "Yeah it definitely is not easy to use", "time": "11-30-2017 04:38 PM", "replies": []}]}, {"postID": "post6091402", "text": "Keep trying. It took me a few hours fiddling with firmware finder to get it to finally take the update", "time": "11-30-2017 04:35 PM", "replies": [{"postID": "post6091489", "text": "Few hours. Really? That's tough", "time": "11-30-2017 05:12 PM", "replies": []}]}]}, {"postID": "post6087560", "text": "Well I found my current build number and then downloaded the build number what come after it and still no luck lol. I got exited when I got a ota from b182 to b210 but nothing come ota after that", "time": "11-28-2017 04:20 AM", "replies": [{"postID": "post6091410", "text": "Oh that sucks. I am surprised that there is no further update", "time": "11-30-2017 04:39 PM", "replies": []}]}, {"postID": "post6087610", "text": "Here's a site that can help you little more. Be careful if you want to try it..it might brick your phone. https://forum.xda-developers.com/p9/...ng-to-t3551523", "time": "11-28-2017 05:37 AM", "replies": [{"postID": "post6091411", "text": "Wow that's pretty involved.", "time": "11-30-2017 04:39 PM", "replies": []}]}, {"postID": "post6087656", "text": "I will try this, thank you", "time": "11-28-2017 07:05 AM", "replies": [{"postID": "post6091412", "text": "Let us know if it works", "time": "11-30-2017 04:40 PM", "replies": []}, {"postID": "post6091491", "text": "Let us know if you can get it updated or not", "time": "11-30-2017 05:13 PM", "replies": []}]}]}, {"title": "No unlock screen animation on Huawei p9?", "thread": [{"postID": "post6087951", "text": "When i updated my phone to the newest version, i noticed that there isnt any screen unlocking (with fingerprint) animation.. Is there any way i can enable the animations?", "time": "11-28-2017 11:14 AM", "replies": []}]}, {"title": "voice identifying to unlock?", "thread": [{"postID": "post6074799", "text": "Sometimes my P9 lite wants to voice identify to unlock? how can I disable that?", "time": "11-17-2017 05:47 PM", "replies": []}, {"postID": "post6080135", "text": "When did this start happening?", "time": "11-21-2017 04:45 PM", "replies": []}, {"postID": "post6081701", "text": "Its a new phone. I think it stopped recently. might be something to do with the Google App.", "time": "11-22-2017 07:25 PM", "replies": [{"postID": "post6081982", "text": "Glad it stopped for you. If it occurs again, let us know. We'll find a solution", "time": "11-23-2017 03:17 AM", "replies": []}]}]}, {"title": "remove camera from lock screen?", "thread": [{"postID": "post6074665", "text": "I have a P9 lite with Android 7. How do I remove the camera from the lock screen? I want no ability to open/run the camera without unlocking the screen. Disabling Settings -> Apps -> Camera -> Notifications -> Display on the lock screen does not remove it.", "time": "11-17-2017 04:03 PM", "replies": []}, {"postID": "post6074787", "text": "no way to disable it.", "time": "11-17-2017 05:40 PM", "replies": []}, {"postID": "post6074798", "text": "there has to be a way...", "time": "11-17-2017 05:46 PM", "replies": []}, {"postID": "post6075060", "text": "I tried as well. Nothing disables it. Should contact Huawei support for that tbh", "time": "11-17-2017 09:45 PM", "replies": []}, {"postID": "post6080133", "text": "Unfortunately I couldn't find a way either", "time": "11-21-2017 04:43 PM", "replies": []}, {"postID": "post6080647", "text": "Disabling it doesn't work. that's odd", "time": "11-22-2017 01:06 AM", "replies": [{"postID": "post6081380", "text": "Yes it is. Hopefully they will add that ability in a future update", "time": "11-22-2017 02:00 PM", "replies": []}]}, {"postID": "post6081465", "text": "Contacting huawei is the best approach. Not sure if theyre aware of it", "time": "11-22-2017 03:34 PM", "replies": []}]}, {"title": "screen lites up for no reason", "thread": [{"postID": "post6079195", "text": "p9 lite screen lites up frequently but no messages,goes off after a few seconds", "time": "11-21-2017 02:54 AM", "replies": []}, {"postID": "post6079510", "text": "Welcome to Android Central! Do you have a case on? Is there anything nearby that is magnetic? Magnets could trigger the phone's smartcover sensor.", "time": "11-21-2017 10:26 AM", "replies": []}, {"postID": "post6080023", "text": "This would happen to my phone as well. Do you have any apps that hides the notifications like 360 Security ?", "time": "11-21-2017 03:39 PM", "replies": []}, {"postID": "post6080127", "text": "Some phones have a setting where it will turn the screen on if there is some motion. Not sure if this is the case here though", "time": "11-21-2017 04:42 PM", "replies": [{"postID": "post6080645", "text": "Didnt know about this. Is that under the settings OP can find ?", "time": "11-22-2017 01:03 AM", "replies": [{"postID": "post6081384", "text": "If it is a feature then you should be able to turn it off in the settings", "time": "11-22-2017 02:02 PM", "replies": []}]}]}, {"postID": "post6081463", "text": "Are you talking about lift to wake ?", "time": "11-22-2017 03:33 PM", "replies": []}]}, {"title": "Camera recording problem", "thread": [{"postID": "post6075348", "text": "When I open camera and start recording in mean while error like (camera is connect with andriod googlequick.com)", "time": "11-18-2017 03:26 AM", "replies": []}, {"postID": "post6075365", "text": "Is your OK Google voice activated ? You need to disable that. Under settings - Google - search - voice \nDisable OK Google detection \nSomehow OK Google voice interrupts the camera. Let me know if this helps", "time": "11-18-2017 04:34 AM", "replies": [{"postID": "post6080130", "text": "Nice tip. Hopefully it helped the op", "time": "11-21-2017 04:42 PM", "replies": []}]}, {"postID": "post6080202", "text": "I hope so. \nOP,\nDid this helped your issue ?", "time": "11-21-2017 05:21 PM", "replies": [{"postID": "post6080227", "text": "It would be nice if he came back and let us know that it worked or not", "time": "11-21-2017 05:30 PM", "replies": []}]}]}, {"title": "Why I can't use video camera", "thread": [{"postID": "post6073951", "text": "When I'm wanted to recording a video it's alway come out like This \" Camera is currently Recording Audio. Com.Google.android.googlequicksearchbox:interactor will not be able to record right now \".\nAnd when i press ok, it's dissapear for a while..But when i'm gonna recording a video again, it's will came out the same Thing and Issues... It's make me to repeat And repeat the same thing eveytime I'm Gonna use it...Damn it...What the Hell that Troublesome came for.....\nAnd please, can U help Me....#Huawei P9 lite..", "time": "11-17-2017 04:42 AM", "replies": []}, {"postID": "post6073953", "text": "Please Somebody Help me....I'm begging You Guys..Please....", "time": "11-17-2017 04:50 AM", "replies": []}, {"postID": "post6073980", "text": "Is your OK Google voice activated ? You need to disable that. Under settings - Google - search - voice \nDisable OK Google detection \nSomehow OK Google voice interrupts the camera. Let me know if this helps", "time": "11-17-2017 05:41 AM", "replies": []}, {"postID": "post6073982", "text": "Here is a thread that can further assist you https://forums.androidcentral.com/hu...a-p9-lite.html", "time": "11-17-2017 05:43 AM", "replies": []}, {"postID": "post6074160", "text": "Thanks You So much Aljean Thein.....Thanks you Buddy For Help Me out...And Thanks for Give me Your Brilliant Suggestion and your knowledges...\nIt's working....It's work successfully.........\nAnd Now I can Take or Records how video as many as I wanted.......I'm really Appreciate it....\nA Thousand Thanks For U Buddy....You're really A nice Guy......I owe so much.....Someday I'll returns Favor......Bye.....", "time": "11-17-2017 08:44 AM", "replies": []}, {"postID": "post6074706", "text": "No problem. I'm here to help !", "time": "11-17-2017 04:30 PM", "replies": []}, {"postID": "post6080138", "text": "That's awesome that you were able to find a solution on the forums!", "time": "11-21-2017 04:46 PM", "replies": []}]}, {"title": "Why does P9 suddenly drain from 50%+ to 1%?", "thread": [{"postID": "post5759314", "text": "Recently had my screen replaced by reputable shop. Since getting it back p9 will suddenly go from loads of battery to 1% and shutdown. Doesn't seem to relate to one particular app, although has been camera last few times. Often if i restart/plug on it isn't actually dead.\nI've done a full factory reset, cleared data, cleared cache. I've tried wakelock.\nAny ideas what it could be and how I can fix it?", "time": "04-14-2017 02:08 PM", "replies": []}, {"postID": "post5761665", "text": "Welcome to Android Central! It sounds like it could be a battery dendrite, which is an irreversible defect in the battery. You may have to get the battery replaced.", "time": "04-16-2017 01:25 AM", "replies": [{"postID": "post6073933", "text": "This exact same issue happened to my P9 after the screen was replaced. As soon as it hits 40% the phone drains and turns off but can then turn back on again. So would the battery dendrite be caused by a screen replacement or could there be an other explanation?", "time": "11-17-2017 03:52 AM", "replies": []}]}, {"postID": "post6074830", "text": "No, dendrites can just happen. See this article: https://www.electronicproducts.com/P...batteries.aspx", "time": "11-17-2017 06:30 PM", "replies": []}]}, {"title": "Lock-screen pictures getting cropped", "thread": [{"postID": "post6052064", "text": "I have a Huawei P9 Lite. I managed to put a set of rotating photos as lock-screen using the \"Magazine unlock\" setting, but all of the pictures get cropped! The edges get cut out of just a bit, but I find it really annoying..\nIs there a way to have the pictures completely shown? Or is there any app that can do it?\nThank you!", "time": "11-03-2017 11:24 AM", "replies": []}, {"postID": "post6053043", "text": "I'd get back to you once I get home and try to find a way with my honor 8", "time": "11-03-2017 11:23 PM", "replies": []}, {"postID": "post6054234", "text": "I can't seem to find a way to not crop the picture. \ncan anyone else chip in?", "time": "11-04-2017 07:10 PM", "replies": []}, {"postID": "post6056270", "text": "Thanks for trying! I've been looking for it on the web but I didn't really find a solution yet.. :/", "time": "11-06-2017 05:55 AM", "replies": []}, {"postID": "post6056388", "text": "Are the pictures the same aspect ratio as the phone screen? If not then try to modify them so that they are.", "time": "11-06-2017 08:12 AM", "replies": []}, {"postID": "post6057635", "text": "I believe mine were. I'll check again", "time": "11-06-2017 10:58 PM", "replies": []}, {"postID": "post6059601", "text": "How do I know the aspect ratio of my phone screen?\nThere were some lock screen backgrounds already in the phone and they are 1080x1920, but I checked and even those get cropped!", "time": "11-08-2017 05:47 AM", "replies": [{"postID": "post6059790", "text": "P9 lite is 16x9.", "time": "11-08-2017 08:12 AM", "replies": []}]}, {"postID": "post6059799", "text": "On my Honor 8, some of my photos get cropped as well. Perhaps editing the photos would help? Not sure if there is an aspect ratio setting, but there could be!", "time": "11-08-2017 08:17 AM", "replies": [{"postID": "post6059872", "text": "You can play around with resizing the picture until you figure out the exact aspect ratio used in the wallpaper", "time": "11-08-2017 09:16 AM", "replies": []}]}, {"postID": "post6070486", "text": "Have you guys figured it out ?", "time": "11-15-2017 02:49 AM", "replies": []}, {"postID": "post6071314", "text": "Does it happen when you don't use the magazine setting?", "time": "11-15-2017 01:17 PM", "replies": [{"postID": "post6071655", "text": "Good question", "time": "11-15-2017 04:37 PM", "replies": [{"postID": "post6073311", "text": "Hopefully that can fix it.", "time": "11-16-2017 05:01 PM", "replies": []}]}, {"postID": "post6073978", "text": "How do you not use that setting?", "time": "11-17-2017 05:41 AM", "replies": []}]}, {"postID": "post6073985", "text": "I don't see anything under Magazine Unlock settings to turn it off. Im not quite sure. \nYou can at least unsubscribe your current likings.", "time": "11-17-2017 05:48 AM", "replies": []}]}, {"title": "How to delete temporary update files?", "thread": [{"postID": "post6066122", "text": "I have stock EVA-L09C432B391 build number\nOn my clean device I have only 21.2 GB out of 32 GB free space\nAccording to Settings -> Memory and Storage, firmware takes 6.92 GB, Apps take 796 MB, Cached Data takes 25.31 MB, and Other take 51.52 MB, so the sum gives about 7.8 GB, so I should have about 24.2 GB free space left, but I have only 21.2 GB\nSO where did the remaining 3 GB go?\nI heard that the clean P9 should have about 25 GB space left for the user\nI was recently doing a lot of updates using Firmware Finder, so I'm guessing that maybe there are some leftover update packages somewhere?\nI tried wiping partition cache but it didn't help", "time": "11-12-2017 07:50 AM", "replies": []}, {"postID": "post6067988", "text": "Maybe try to uninstall the ff app?", "time": "11-13-2017 03:51 PM", "replies": [{"postID": "post6071277", "text": "I did this and it didn't help\nI also tried cleaning the device using the buit-in phone manager and still no success\nNo app can find these 3 GB files", "time": "11-15-2017 01:04 PM", "replies": [{"postID": "post6071305", "text": "That sucks. I know a fdr would fix it but that's a hassle.", "time": "11-15-2017 01:15 PM", "replies": [{"postID": "post6071541", "text": "By \"fdr\" do you mean factory reset?\nI did it many times and it didn't help either", "time": "11-15-2017 03:34 PM", "replies": [{"postID": "post6071645", "text": "Yes, factory device reset.", "time": "11-15-2017 04:32 PM", "replies": []}, {"postID": "post6073312", "text": "Yes that's what I meant", "time": "11-16-2017 05:02 PM", "replies": []}]}]}]}]}, {"postID": "post6070483", "text": "Weird. 3 GB is huge. and clearing cache didn't help that. have you tried the suggestion from dpham?", "time": "11-15-2017 02:48 AM", "replies": []}]}]
[{"title": "why my micro sd-card get corrupted evry while in Huawei p 9 lite", "thread": [{"postID": "post6065994", "text": "I have Huawei p 9 lite internal memory 16 g so I bought micro sd card of 16 also it work for a while then I can't save any thing on it nor transfer it to computer ,it say error ,corrupted but I can view it content but I can't write on it , this happened twice so I thought something wrong in the device it self that destroy the sd cards repetitively ...can you help me to repair this sd card and how to avoid it in the future ???", "time": "11-12-2017 03:20 AM", "replies": []}, {"postID": "post6066592", "text": "If you installed it as adoptable storage (or internal storage), the phone doesn't see the card, it just sees 32GB of internal storage. You can't write to the card and have it used as internal storage.\nIf you install it as portable storage, you'll be able to write to it, but the phone will have only 15GB of internal storage again. (Meaning that you can save files [pictures, videos, music, etc.] to the card, but you can't install apps on it.)", "time": "11-12-2017 03:04 PM", "replies": [{"postID": "post6070485", "text": "Did this help, OP?", "time": "11-15-2017 02:49 AM", "replies": []}]}, {"postID": "post6067799", "text": "Have you tried another sd card?", "time": "11-13-2017 01:15 PM", "replies": []}, {"postID": "post6071312", "text": "Where did you get the sd card from?", "time": "11-15-2017 01:17 PM", "replies": []}]}, {"title": "Rooted Fake P9+ Stuck On Bootloop", "thread": [{"postID": "post6060550", "text": "I few months back I rooted a fake p9+ I got online. I knew it was fake but I looked for some rons and software I figured would work. Now it will not let me access my recovery but it will let me access the factory mode. Has anybody else handled this situation and found a way to fix it with a stock rom?", "time": "11-08-2017 04:52 PM", "replies": []}, {"postID": "post6060580", "text": "The problem is that it's impossible to tell what is really a stock ROM for a fake device.", "time": "11-08-2017 05:04 PM", "replies": [{"postID": "post6061836", "text": "Right. A stock rom on one fake might not be compatible with another fake", "time": "11-09-2017 11:40 AM", "replies": []}]}, {"postID": "post6060605", "text": "I was hoping somebody had the same issue and found a fix.", "time": "11-08-2017 05:17 PM", "replies": [{"postID": "post6065700", "text": "I dont think a lot of people would've buy fake model phones. Might be hard to find someone with the same problem.", "time": "11-11-2017 09:00 PM", "replies": []}]}, {"postID": "post6064499", "text": "Interesting how you came up with that plan. But as others said, it's probably not compatible", "time": "11-11-2017 06:19 AM", "replies": []}, {"postID": "post6065155", "text": "Keep in mind that it might brick the phone if incompatible", "time": "11-11-2017 03:12 PM", "replies": []}]}, {"title": "P9 wifi range issue....", "thread": [{"postID": "post6040895", "text": "I was doing some networking stuff in my house yesterday and that included changing my parents phone over to the new said etc... I noticed then that at the same distance from the router my phone had 0 bars and my parents had 4.... We both have a P9 which is why I find this so confusing.. it is the same everywhere I go (ive decided to test it for the past week) anyone had this?", "time": "10-27-2017 04:25 AM", "replies": []}, {"postID": "post6042717", "text": "Are they both on the same network? Both on 2.4 or 5ghz?", "time": "10-28-2017 10:26 AM", "replies": []}, {"postID": "post6053044", "text": "Did you solved your problem ?", "time": "11-03-2017 11:24 PM", "replies": []}, {"postID": "post6056389", "text": "Any update op? Do you need further assistance?", "time": "11-06-2017 08:13 AM", "replies": []}]}, {"title": "How do I change the main user name on my phone. Please it's urgent", "thread": [{"postID": "post5942319", "text": "Ok so this is the story. My friends took my Huawei P9 and set the user and made the name very disturbing and vulgar and when someone goes to my notifications and looks at the user they will see it. \nI can't edit it or delete it. I've tried making a new user and then tried to edit it but no option for that, just to switch back to it.\nI'm not sure it its connected to the device name possibly and that's what they have changed?", "time": "08-28-2017 04:33 AM", "replies": []}, {"postID": "post5942340", "text": "Settings... About device,.. Device name....\nTry that...", "time": "08-28-2017 04:54 AM", "replies": []}, {"postID": "post6053046", "text": "Did that worked for you, OP ?", "time": "11-03-2017 11:26 PM", "replies": []}]}, {"title": "huawei Safe not found", "thread": [{"postID": "post6050377", "text": "I have updated my huawei p9lite from android 6 to 7.. now when I click on safe it shows \"safe not found\"\nIf I accidently deleted the files..can I recover them!!!", "time": "11-02-2017 12:11 PM", "replies": []}]}, {"title": "Huawei P9 lite cant connect to public wifi", "thread": [{"postID": "post5961374", "text": "When im at home my Huawei P9 lite wifi independently connects and works fine.\nBut when im in a public place with free wifi ie Asda, MacDonalds, or in my work place, I connect it, tick the t&c's, the little wifi symbol appears at the top of my screen but when I try logging onto the internet it just says its offline, aaaghhh everytime.*\nIve looked in my security settings but cant see what would be blocking this.\nCan anyone advise please?", "time": "09-07-2017 04:31 AM", "replies": []}, {"postID": "post5961393", "text": "You can firstly confirm this wifi can be used for other phone. You may delete this WiFi in your phone and reconnect it. Just have a try.", "time": "09-07-2017 04:59 AM", "replies": []}, {"postID": "post5973211", "text": "Some WiFi requires you to confirm their terms and agreement before having full access of the Internet. Did you get any pop up doing so ?", "time": "09-13-2017 07:27 PM", "replies": [{"postID": "post5973998", "text": "Based on what the op said, they already agreed to the terms yet wifi still didn't work", "time": "09-14-2017 09:23 AM", "replies": []}]}]}, {"title": "Can i turn vibrate off on my Huawei Nova alarm?", "thread": [{"postID": "post5967037", "text": "I can't find a way to stop my phone vibrating when the alarm goes off. I can turn vibrate off for other functions but not this, which is kind of irritating as the vibration on my bedside counter is louder than the gentle alarm I chose! Any ideas?! Thanks", "time": "09-10-2017 05:48 AM", "replies": []}, {"postID": "post5973209", "text": "I don't see any settings to turn it off on the clock app itself. probably use a 3rd party clock app", "time": "09-13-2017 07:24 PM", "replies": []}]}, {"title": "Huawei P9 Android calendar notifications making no sound, ringtone", "thread": [{"postID": "post5959588", "text": "I have a Huawei P9 and I am constantly missing the notifications for events because, despite having set a ringtone noise (one of my own music files, not one of the phone's default sounds), the notification alert just vibrates once instead and makes no noise. This is especially a problem with early-morning notifs (I have it set to alert me two hours before the event); I have my Do Not Disturb setting until 09:00 am, and don't get the event notifications at all if they are set to go during the do-not-disturb time, even though I have marked the calendar app as a priority one which means it SHOULD go off even during do-not-disturb, as I understand it. \nI got it to work by setting the ringtone as the phone's default notification noise (by mistake) - but then I was getting the song playing at every text etc, which is really not workable.\nCan anyone help? I want only the calendar notifications to make this sound, and it's driving me crazy that it's just ignoring the settings!\nI'm using the default calendar app, btw.", "time": "09-06-2017 09:52 AM", "replies": []}, {"postID": "post5959608", "text": "Welcome to Android Central! Is the custom tone saved to the SD card or Internal Storage? Make sure it's the latter, and that you saved it to the Notifications directory.", "time": "09-06-2017 10:03 AM", "replies": []}]}, {"title": "Google assistant", "thread": [{"postID": "post5902918", "text": "Anyone in the UK getting Assistant working by long pressing the home button? I'm on Nougat and have tried changing all the languages settings to US but still nothing so went back to UK language. Apparently it's being rolled out to the UK months ago.", "time": "07-28-2017 10:37 AM", "replies": []}, {"postID": "post5909698", "text": "assistant has not started rolling out in the UK as of yet.", "time": "08-02-2017 02:57 PM", "replies": []}, {"postID": "post5943218", "text": "Just noticed, by accident, that I have it now.", "time": "08-28-2017 02:59 PM", "replies": [{"postID": "post5943328", "text": "Was this after an OTA update?", "time": "08-28-2017 04:33 PM", "replies": [{"postID": "post5943887", "text": "No firmware update, no. No idea what happened to activate it", "time": "08-29-2017 01:02 AM", "replies": []}]}]}]}, {"title": "Why is my hidden apps feature on my p9 lite phone dissapear", "thread": [{"postID": "post5777910", "text": "The feature pissed all the apps I hide to the homescreen after I restart my phone and emui suddenly try install update and stuck at 5% and it fail and it tell me to redownload the package (I already installed the latest update month ago) then I force to restart my phone, after I restart my hide apps feature dissapear, I can't no longer use it. I drag appart 2 of my finger to access it, many time but still cant. I need help please.", "time": "04-22-2017 04:44 PM", "replies": []}, {"postID": "post5940672", "text": "I have the same problem on owner user. On quest user this feature is still working.", "time": "08-26-2017 10:01 PM", "replies": []}]}, {"title": "Huawei p9 blank homescreen keeps deleting", "thread": [{"postID": "post5928976", "text": "Hi. Since installing the last update my huawei p9 keeps deleting the blank homescreen I've always used and it's driving me crazy! I like to keep all my apps on a screen to the right and leave my homescreen blank. It's never automatically deleted before and I'm not sure what's triggering it. Is there a new setting somewhere I'm missing? Thanks for your help in advance.", "time": "08-19-2017 04:54 PM", "replies": []}]}, {"title": "P9 Lite Soft Brick Stuck on Fastboot", "thread": [{"postID": "post5925742", "text": "The phone does not boot and does not enter custom recovery or erecovery (lost TWRP after flashing LineageOS),\nI can only enter Fastboot and while the bootloader is unlocked the phone is OEM Locked (because I cannot enter the OS I cannot OEM Unlock)\nI have a TWRP backup for all the good it is doing me.\nI know fastboot with OEM Lock can only flash official Google-signed update.zip archive files unfortuately I cannot find any of those files\nThe full post is in XDA\nLink: https://forum.xda-developers.com/hua...icked-t3657372\nDoes anyone know anything that can help me?", "time": "08-16-2017 03:19 PM", "replies": []}]}, {"title": "What is the best call recording app for huawei p9?", "thread": [{"postID": "post5637716", "text": "I have downloaded few apps for call recording, and change the settings needed. But, whenever outgoing and incoming calls, no calls were recorded through the application.", "time": "01-09-2017 06:27 PM", "replies": [{"postID": "post5637863", "text": "That is likely an issue with the app(s) rather than the phone itself. I would suggest contacting any of those developers to see what the problem is.", "time": "01-09-2017 09:06 PM", "replies": []}]}, {"postID": "post5638042", "text": "Bearing in mind that recording calls without express permission on the other party is illegal in most places and using recordings obtained without permission will be deemed inadmissible should you attempt to use as evidence... just saying..\nThe recorded party could take legal action against you if you record them without permission. Take care...", "time": "01-10-2017 12:59 AM", "replies": []}, {"postID": "post5645559", "text": "Hello Dizzy Mizzy,\nI have the same problem, I use to have a Samsung Note 4 with ACR Call Recorder, it worked perfect.\nAs of the januari 3th I have a Huawei P9 Plus, ACR Call Recorder doesn't work properly any more, it only records my voice and not\nthe other side of the call.\nI have send a mail to ACR, it's a Huawei issue and they are working on it.\nIf you find a working one, please let me know.\nThx.\nSpammm", "time": "01-16-2017 11:26 AM", "replies": []}, {"postID": "post5646303", "text": "Hello\nI use this: https://play.google.com/store/apps/d...r.callrecorder. \nNo problem.", "time": "01-17-2017 01:26 AM", "replies": []}, {"postID": "post5803489", "text": "I use call recorder, works perfectly good.", "time": "05-06-2017 02:48 PM", "replies": [{"postID": "post5918904", "text": "Can you please specify your audio setup of Call Recorder (Source, Format, Encoder). Thanks", "time": "08-10-2017 07:21 AM", "replies": []}]}]}, {"title": "Huawei P9 audio port problem", "thread": [{"postID": "post5916299", "text": "I dropped my phone which resulted in a broken LCD screen and the jack port was a bit different after that, the headphones still worked, but sometimes I had to fiddle with it a bit. After a few days only my speakers worked from the jack, not the buds.\nI took the phone apart, fixed the screen, now I'm checking what problem the port can possibly have, but I can't see anything broken, all the wires still connected, but when I plug the jack in it doesn't give that clicking noise that it would be in place.\nAnyone has any idea what that can be? Like it doesn't go all the way in or something. It's not dust, already tried that.\nThanks", "time": "08-08-2017 08:09 AM", "replies": []}, {"postID": "post5916615", "text": "The headphone jack could somehow be physically messed up. I would try to change the headphone jack to see if it fixes your problem", "time": "08-08-2017 12:50 PM", "replies": []}]}, {"title": "why my phone is showing rtl layout?", "thread": [{"postID": "post5907658", "text": "my phone huawei p9 lite android version 7.0 crashed and restarted and the layout was flipped, and it's now right to left, i went to developer options and couldn't find ''Force rlt layout'' option, so what can I do to make it back ltr?", "time": "08-01-2017 02:08 AM", "replies": []}, {"postID": "post5908144", "text": "Not sure what else up suggest other than to try a factory data reset. Make sure to backup data before you do this", "time": "08-01-2017 12:45 PM", "replies": []}]}, {"title": "Nfc on huawei p9 lite not working", "thread": [{"postID": "post5906708", "text": "Hello,\nMy NFC on my p9 life is not working, I've tried everything: wiping cashe partition, restarting, even a full factory reset, and nothing seems to fix the problem... Anyone got a suggestion? Thanks in advance.", "time": "07-31-2017 10:43 AM", "replies": []}, {"postID": "post5906903", "text": "Welcome to Android Central! How have you tested the NFC? Does it work in Safe Mode? How to turn on safe mode on Huawei P9 Lite", "time": "07-31-2017 01:16 PM", "replies": []}]}, {"title": "How can I set alarm on specific date on Huawei P9 ?", "thread": [{"postID": "post5906358", "text": "Can I set alarm on specific date on the Huawei P9?", "time": "07-31-2017 04:12 AM", "replies": []}, {"postID": "post5906450", "text": "Welcome to AC forums. I don't know for sure on your particlar phone, however I have never seen a stock alarm clock with that feature. You can set a calendar reminder if that works for you.", "time": "07-31-2017 06:49 AM", "replies": []}]}, {"title": "I want to backup my P9 using my Chromebook...", "thread": [{"postID": "post5819370", "text": "And I have absolutely no luck. I want to save all my photos and videos (of which I have THOUSANDS) to the cloud (either GDrive or Dropbox) so I can clear my phone. However, the only option I can find is to upload individual files via my phone, which is frustrating. When I plug my Huawei phone into my Chromebook it claims my phone is empty. HELP!!!", "time": "05-18-2017 02:54 AM", "replies": [{"postID": "post5902893", "text": "Why don't you let everything upload to Google Photos App? Once there you can leave the photos there (unlimited storage) and then import your videos to your YouTube account easily?", "time": "07-28-2017 10:22 AM", "replies": []}]}]}, {"title": "Removing the unlocked bootloader warning", "thread": [{"postID": "post5890765", "text": "Hi all.\nI recently unlocked the bootloader on my Huawei P9 device and as a result of this I get an \"unlocked bootloader\" warning very time I restart.\nI downloaded a copy of the ROM as I thought there may be a default logo.bin I could flash via ADB/Fastboot similar to other manufactures but no such file is obvious within the image.\nCan anyone please advise if it is indeed possible to remove the notification?\nThanks in advance!", "time": "07-19-2017 05:22 AM", "replies": []}, {"postID": "post5890837", "text": "Hi there!\nI don't think there is a way to remove an \"unlocked bootloader\" warning on a non-Moto device as far as I know.\nI'll let anyone who has more expertise on Huawei phones get you back on that.", "time": "07-19-2017 07:20 AM", "replies": []}]}, {"title": "Why us the P9 nougat update taking so long?", "thread": [{"postID": "post5808302", "text": "Hi Good morning, can anyone help? \nI have a huawei p9 eva-l09c432b1669c432b166.\nI waited with anticipation for the end of the Q1 update to nougat to arrive... It didn't.. I called huawei and they advised that as I bought the phone from CPW they are being updated later with the first week in May being suggested... That's now passed as well. I'm getting a bit fed up with the waiting and the feeling of being fobbed off.. Is anybody else having issues with the update on phones bought at CPW? Thanks Steve", "time": "05-10-2017 03:57 AM", "replies": []}, {"postID": "post5813267", "text": "I got a p9 from cpw no update for me. However cpw phones are factory unlocked so I am sure the update should be pushed direct", "time": "05-13-2017 01:54 PM", "replies": [{"postID": "post5815119", "text": "Morning, I spoke to huawei back in March and they said that because my phone was purchased from CPW the update will be later.. They suggested the first week in May. We are now at the third week of May. And still no update, just seems wrong when your update is almost 2 months later than the reports suggest...", "time": "05-15-2017 02:20 AM", "replies": []}]}, {"postID": "post5820017", "text": "Sounds to me like they are passing the buck as cpw don't push updates. That would be down to your network. My network is ee", "time": "05-18-2017 02:04 PM", "replies": []}, {"postID": "post5850180", "text": "I tweeted huawie and they just send a link back to their website support team who to be fair replied pretty quickly saying that the update is sent out in batches. I think it could be a carrier issue as I believe they have to check it out. EE are not that quick in sending out updates.", "time": "06-14-2017 10:23 AM", "replies": []}, {"postID": "post5890735", "text": "anyone in the UK had the update for the p9 yet", "time": "07-19-2017 04:27 AM", "replies": []}]}, {"title": "huawei p9 sending picture messsage converts to bad quality", "thread": [{"postID": "post5885909", "text": "how do you make the huawei p9 phone stop converting a good quality image into a pixelated poor quality one that you can't make out what it is when you add it to a sms to try and send a picture message please? thanks.", "time": "07-15-2017 02:45 AM", "replies": []}, {"postID": "post5886187", "text": "Have you tried to use a third-party text messaging app like Textra?", "time": "07-15-2017 10:29 AM", "replies": []}, {"postID": "post5888617", "text": "Welcome to Android Central! How big is the picture you're trying to send? Remember that the max filesize of an attached photo is about 1 MB, so the phone will always compress larger photos over MMS.", "time": "07-17-2017 01:10 PM", "replies": []}]}, {"title": "I have huawei p9 and for some reason the android easter egg wont work for me", "thread": [{"postID": "post5705809", "text": "So i can get it to the screen where the N logo shows up but after i rub and tap it nothing happens, no cat appears", "time": "03-09-2017 05:58 AM", "replies": []}, {"postID": "post5706000", "text": "follow this guide from Android Central website:Android 7.0 Nougat Developer Preview 5 actually comes with an awesome Easter Egg | Android Central", "time": "03-09-2017 09:38 AM", "replies": [{"postID": "post5849933", "text": "Didn't help me.\nAs OP said I tap the button a couple of times and hold it down but there is no cat emoji I need to press.", "time": "06-14-2017 06:49 AM", "replies": []}]}, {"postID": "post5883271", "text": "Exactly the same with my \nHuawei P9 lite", "time": "07-13-2017 05:09 AM", "replies": []}, {"postID": "post5883417", "text": "If you don't see it then perhaps Huawei disabled it. You can try to email Huawei customer support for clarification.http://consumer.huawei.com/en/contact-us/", "time": "07-13-2017 08:06 AM", "replies": []}]}, {"title": "Where Is The \"Protected Apps\" Setting On Huawei P9 Lite", "thread": [{"postID": "post5869189", "text": "Hi!\nI'm at the verge of hurling my phone to nearest wall in frustration. Do you know where is the \"Protected Apps\" setting is located on Huawei P9 Lite?\nApp locking apps can't intercept the apps i locked. Always letting everyone in due to Huawei's aggressive app killing.\nAlso, what is the best app to hide \"sensitive\" picture s and videos on Android?\nI use Hide Photos, Video Hide It. It's seems good. Hides the files you want in SD Card which is nice but a few pictures had their thumbnails missing and a few videos were outright viped during the hiding process i'm a little skeptical.\nI hate the gallery apps with passion. Why index all my photos / videos / music for the prying eyes? No privacy in 21st century. Grrr.\nSorry for rant.\nP.S Even Huawei's own app locker in Phone Manager app fails to intercept and does not ask for a password.\nAlso, how can i make apps ask for my fingerprint only and not for a password as i think there is a slight chance a pin can be guessed by people close to you.", "time": "06-30-2017 03:42 PM", "replies": []}, {"postID": "post5870792", "text": "Moved from the Android Apps forum to the P9 forum, since the former is intended for developers to promote their apps. The P9 forum is the closest to the P9 lite that we have.", "time": "07-02-2017 08:01 AM", "replies": []}]}, {"title": "Multiple media related problems", "thread": [{"postID": "post5869355", "text": "Hi\nI have a Huawei P9 Lite. About two days ago I started experiencing multiple problems. I'll list them here:\n1.Camera will take a photo but apps such as WhatsApp can't read it. Says \"The file you picked is not a photo.\" After awhile the photo disappears from the gallery. Won't send any existing photos either.\n2.When I try take a video it won't record.\n3.WhatsApp - Won't take pictures or video. Also voice note doesn't work.\n4. Play music album download crashes and I need to restart phone to get it started again.\nThese faults all began together, before yesterday all the above mentioned functions worked perfectly. I factory reset my phone but the problems persisted. I also cleared the caches of many apps.\nAny help would be greatly appreciated, thank you!", "time": "06-30-2017 06:45 PM", "replies": []}, {"postID": "post5869465", "text": "Are you using an SD card? If so then I would suggest setting the pictures and video to save to internal memory", "time": "06-30-2017 09:58 PM", "replies": []}]}, {"title": "Higher RAM usage after Android N update?", "thread": [{"postID": "post5698925", "text": "Hello all! New here. \nSo, just a couple days ago I updated my P9 (EVA-L19) with EMUI 5.0, and I just recently noticed that I only had somewhere around 750MB - 800MB of the 3GB of RAM available. On EMUI 4.1, I would usually get a value between 1.3GB and 1.4GB.\nI was wondering if this is a common thing with the update, or is it just me? And is there any way to fix it?", "time": "03-04-2017 07:20 AM", "replies": []}, {"postID": "post5698931", "text": "Busy \n\"Free memory\" us wasted memory unless it gets to the point apps don't have enough\nEvery new OS uses more. Always has.", "time": "03-04-2017 07:26 AM", "replies": []}, {"postID": "post5709037", "text": "Here's mine...", "time": "03-11-2017 05:14 PM", "replies": []}, {"postID": "post5860923", "text": "I can't wait to get the update.", "time": "06-23-2017 12:09 PM", "replies": []}, {"postID": "post5860971", "text": "Are you having any problems with apps being kicked out of memory more quickly than before the update? Or any other performance issues?", "time": "06-23-2017 12:55 PM", "replies": []}]}, {"title": "How to stop Huawei Health", "thread": [{"postID": "post5756925", "text": "I'm now on my third P9 device. \nOn this one, the health app keeps appearing and disappearing in the notification screen.\nIs there any way to turn this off completely? I've cancelled notifications for it but they still appear.", "time": "04-13-2017 03:52 AM", "replies": []}, {"postID": "post5850200", "text": "As it is a system app I don't think you can uninstall it. I disabled notification then hid it. Swipe two fingers across the screen then you should be able to hide it", "time": "06-14-2017 10:38 AM", "replies": []}, {"postID": "post5859461", "text": "You should be able to disable it with the debloater tool. You will need a PC though and ADB.https://forum.xda-developers.com/and...bloat-t2998294", "time": "06-22-2017 10:30 AM", "replies": []}]}, {"title": "Huawei P9 slow charging", "thread": [{"postID": "post5851428", "text": "My P9 has started charging really slowly (10% per hour) and will not charge at all when I am using it plugged in. Prior to 2 days ago it would charge in and hour and a half. \nI have bought and am using new USB c cable and Belkin main charger and the problem is the same. \nI have cleaned the charging port with an air cleaner. \nNot sure what I can try next - does anyone have any ideas?", "time": "06-15-2017 10:32 AM", "replies": []}, {"postID": "post5859458", "text": "Have you tried to get another genuine Huawei charger and cable to see if it would do fast charging?", "time": "06-22-2017 10:27 AM", "replies": []}]}, {"title": "My p9 doesn't show apps icon after installing", "thread": [{"postID": "post5828630", "text": "After each new app download and install to my Huawei p9 I can't find the app on my screen but system recognize as already have it installed so I can find it and open it from Google play history. What's wrong with it? What should I try more?", "time": "05-26-2017 02:04 AM", "replies": []}, {"postID": "post5850194", "text": "Never had that on any phone but I would go to play store and uninstall then try again", "time": "06-14-2017 10:34 AM", "replies": []}, {"postID": "post5851346", "text": "Are you using stock launcher or something else like Nova?", "time": "06-15-2017 09:13 AM", "replies": []}]}, {"title": "Huawei P9 Lite secret code.", "thread": [{"postID": "post5830601", "text": "Hello.\nI have a Huawei P9 Lite and it upgraded to Android 7 but I have a wireless problem. My wireless connection disconnected sometimes and I like to reset network setting. How can I do it?\nThank you.", "time": "05-28-2017 03:57 AM", "replies": [{"postID": "post5830916", "text": "Go to Settings > Advanced Settings > Backup and reset > Network settings reset", "time": "05-28-2017 11:43 AM", "replies": []}]}]}, {"title": "Huawei P9 photo printing dpi", "thread": [{"postID": "post5826687", "text": "Hi,\nI am trying to change the settings on my phone to optimize the camera for printing photos.\nAlthough I am taking photos on the highest resolution (12M 3968X2976 4:3) they are only saving as 72dpi.\nI am looking to store the photos at 300 dpi.\nAnyone have any tips for me? I'm a complete novice to android so apologies if this is a basic question!\nThanks,\nSarah", "time": "05-24-2017 01:00 PM", "replies": []}]}]
[{"title": "Screen Lock data traffic. Should I care?", "thread": [{"postID": "post5584391", "text": "P9 lite, 3gb Ram. 1 month old.\nI constantly have screen lock data traffic information in my notifications. Is this useful and what numbers are good or bad. Should I care. Can I get rid of this notification. Thanks", "time": "11-29-2016 03:17 AM", "replies": []}, {"postID": "post5596817", "text": "If anyone knows the answer, I'd be glad to hear it too. It's quite annoying...", "time": "12-07-2016 08:42 AM", "replies": []}, {"postID": "post5598233", "text": "I have managed to switch this off.\nSettings, .........\nSo sorry but can not remember how and can not find it again.\nIt is there to be switched off I promise.\nSo sorry.", "time": "12-08-2016 02:26 AM", "replies": []}, {"postID": "post5817983", "text": "I disabled background data for several applications and then I got these messages.\nI believe these should all be set to enabled.\nSettings, apps, app name, data usage..\nI also did some tinkering to the global data limit before getting the lock screen messages.", "time": "05-17-2017 01:38 AM", "replies": []}]}, {"title": "Huawei mate 9 blocks video recording", "thread": [{"postID": "post5793257", "text": "My new Huawei mate 9 blocks me from recording videos using WhatsApp and other apps with the following error message\nCamera is currently recording audio. com.google.android.googlequicksearchbox:interactor will not be able to record right now. Is there a setting I need to change to stop sort this issue and stop the error message. Many thanks", "time": "04-30-2017 07:31 AM", "replies": []}, {"postID": "post5795743", "text": "Welcome to Android Central! See if this thread helps: http://forums.androidcentral.com/hua...a-p9-lite.html\nWhen you get a chance, head over to the Introductions forum and tell us something about yourself! Introductions", "time": "05-01-2017 04:18 PM", "replies": []}]}, {"title": "Android and emui issues", "thread": [{"postID": "post5791490", "text": "I tried to manually update my phone to emui 5.0 and Android 7.0, it didn't work and I had to do a hard restore, so now I have it running but it is at 3.1 for emui and Android 5.1 beta, the model number was Eva-l09 now it's at A168-L09, how can I get my phone back to the version it was at, tried the updates on emui, in settings and hi care, any help would be greatly appreciated thank you", "time": "04-29-2017 06:55 AM", "replies": []}]}, {"title": "Why the \"touch disable mode\"on my p9 is not working after I updated to android 7", "thread": [{"postID": "post5790434", "text": "The option was working properly, but after I got the notification that new update is available, the system was update from Android 6 to 7, and then the option didn't work anymore, eventhough it is still enabled", "time": "04-28-2017 02:29 PM", "replies": []}]}, {"title": "Anyone can tell me about G3 compatibility with Android 7.0 and Huawei P9 Lite?", "thread": [{"postID": "post5789510", "text": "I was thinking of purchasing a Gear S3 Frontier for my Huawei P9 lite, recently updated to Android 7.0, since I'm having disconnections problems with my Pebble Time since this update. Anyone can tell me about compatibility or limitations with P9 lite and Gear S3? Thanks.", "time": "04-28-2017 04:23 AM", "replies": []}, {"postID": "post5789812", "text": "I found many guys over the internet who have Huawei mate 9 with Android 7 and S3 frontier is working great.", "time": "04-28-2017 08:48 AM", "replies": []}]}, {"title": "Huawei P9 or Oneplus 3", "thread": [{"postID": "post5284929", "text": "Hello, \nIm in doubt between these two phones. \nI search for rooting possibilities, nice loudspeaker, good sunlight visibilitity, and nice câmera. \nThanks", "time": "07-27-2016 08:47 AM", "replies": []}, {"postID": "post5284935", "text": "Hey there.\nThe Huawei P9 and OnePlus 3 are 2 pretty solid devices.\nHowever, even though I am a fan of the camera on the P9 (I used one before), if you're looking into rooting, while it might be possible on the P9, the OnePlus 3 might be your pick, since it is easier to root. Sunlight readability on the OP3 isn't great, but it's still a very solid device.", "time": "07-27-2016 08:52 AM", "replies": [{"postID": "post5285051", "text": "Thanks! \nIll be coming from a LG G5. Do you think it is a step forward on camera departament?", "time": "07-27-2016 09:59 AM", "replies": [{"postID": "post5285068", "text": "The OnePlus 3?\nTo be honest, not really. You lose the secondary wide-angle camera and the OnePlus 3's camera isn't on the same level as the G5 quality-wise, especially since it is a smaller sensor, but it's still a decent performer.\nEven though I'm not a fan of the LG G5, the camera is the one thing I really love on it.", "time": "07-27-2016 10:05 AM", "replies": [{"postID": "post5285151", "text": "Sorry for not explain better. \nIs P9 a big step forward on camera departament over LG G5? \nThanks again for being helpful.", "time": "07-27-2016 10:48 AM", "replies": [{"postID": "post5285195", "text": "The Huawei P9? Not really, too.\nIt's not that it's bad. It's a great camera, with excellent dynamic range, great amounts of detail, superb lens quality, good color accuracy and overall a pretty good experience.\nHowever, the camera on the LG G5 also has those traits (mostly, as its lens isn't quite as good, but it's decent enough), and the quality of photos on both are roughly similar, with the G5 maybe having a wee-bit more detail. The G5 also has the benefit of OIS and 4K video recording, something the P9 lacks. However, the P9 does shoot in 1080p60 at max, something the G5 doesn't support for some reason.", "time": "07-27-2016 11:19 AM", "replies": []}]}]}]}]}, {"postID": "post5288694", "text": "And if i would like to compare for the battery life between the huawei p9 and the oneplus 3?\nWhich is better with better screen on time?", "time": "07-29-2016 10:24 AM", "replies": []}, {"postID": "post5288742", "text": "Im still on doubt. \nP9 has (much?) better multimedia features, but dev comunity and snapiness is better on 1+3.", "time": "07-29-2016 10:52 AM", "replies": [{"postID": "post5288786", "text": "Do things like root and XDA matter to you?\nIf yes, the OP3. \nNote that the P9 may be more expensive in your area. In that case, I would still give the OP3 a worthy consideration. It's actually a pretty damn good phone for the price.", "time": "07-29-2016 11:21 AM", "replies": []}]}, {"postID": "post5786800", "text": "Could anyone compare the cameras of oneplus 3t and Huawei P9? Also the battery life and charging? There is a sale of the P9 in my county and it's 400eur vs 440eur for the 3t and I am thinking witch one to get", "time": "04-26-2017 04:34 PM", "replies": []}]}, {"title": "Cant change themes/lockscreen", "thread": [{"postID": "post5762658", "text": "Hi!\nI downgraded from B378 to B182 and i want to use the Magazine unlocker so i can get notifications on the lock screen. I downloaded the themes from here http://www.modaco.com/forums/topic/3...wei-p9-themes/ since there wasnt any Magazine in my Themes app. But when i try to apply the new lock screen it wont change and i still have the iPhone lookalike lockscreen. What can i do? The phone is not rooted.", "time": "04-16-2017 05:17 PM", "replies": []}]}, {"title": "Screen problem", "thread": [{"postID": "post5761813", "text": "Hi Guys,\ni have a little problem with a screen. When the screen is off it isnt true black like on the others P9s. Its more grey. The colors are great but not great and vivid like my friends P9. Should i claim it? Or doesnt do anything with that? Its not a big problem like i said. The colors are great but its just a small glitch. Thanks for answer.", "time": "04-16-2017 05:54 AM", "replies": []}, {"postID": "post5762121", "text": "the P9 plus display is Super amoled and the P9 display is IPS-NEO LCD so it should be a little different.", "time": "04-16-2017 10:07 AM", "replies": []}]}, {"title": "How to unhide a photo album?", "thread": [{"postID": "post5550542", "text": "Hi All - Am still loving my P9 and (touch wood) am not having any problems with it. Still an awesome phone with endless customisation options. I have a question though: I created an album which had photos of my wife operation recovery that I didn't want all and sundry to see, so I found that I could 'hide' the album. Brilliant! Now herein lies the problem: I can't see how to unhide the damn thing now lol!! I can see the photos in the file manager, but I cannot find the album itself to unhide. Any thoughts greatly received!!", "time": "11-07-2016 07:09 AM", "replies": []}, {"postID": "post5550988", "text": "I know this is for the Honor 5X, but since it's also from Huawei, it might have the same feature as your P9: [Honor 5X] Hidden Features for your device | Android Authority Forums", "time": "11-07-2016 10:46 AM", "replies": []}, {"postID": "post5758792", "text": "Go to Gallery (make sure view is set on Albums and not Photos). Click on \"Menu\", then \"Hide Albums\". This will show a list of all your Albums, as well as the Hidden Albums. From there you will have the option again to Hide or not to Hide", "time": "04-14-2017 08:42 AM", "replies": []}]}, {"title": "Huawei P9 EVA-L09 Bricked So Hard?", "thread": [{"postID": "post5749342", "text": "Hi!\nI was trying to update my P9 to nougat all was going well, until during the installation process it said 'Reset Failed'\nNow this brick is stuck in a boot loop, unable to get into fastboot or any combination of buttons\nAnyone know a software fix?\nOr shall I just give this to Trump?\nThanks", "time": "04-08-2017 05:01 AM", "replies": []}, {"postID": "post5751633", "text": "download any rom file and move it inside \"dload\" folder on the sdcard.\nthen force flash the rom by pressing all 3 buttons(volume up, down, and power) for 5-8 seconds, a Huawei icon will pop.", "time": "04-09-2017 06:34 PM", "replies": []}]}, {"title": "Huawei P8/P9 Lite 2017 phone - Phone wakes up at 2am", "thread": [{"postID": "post5746111", "text": "Hey guys!\nSo, this is my first time having an Android phone. Got a Huawei P8/P9(depends on the country, here in the EU  ) 2017 and I really love it. One thing I noticed though: According to the built-in battery meter, my phone starts to lose charge fast after 2am till morning (about 10% is lost). Every night, exactly the same time. After I looked at the Consumption Levels option I see that Android OS is the highest, checking the details it kept my phone running for 2 hours. Obviously, first thing I tried is : Disable all the auto updates(google play, maps, the google app), deleted all the pre-installed games and other bloatware apps. Then I disabled all the notifications. Wifi and GPS is off for the night. Disabled Google's location history service, the wifi is set to never stay awake and the scan settings are also off, not allowing anything to wake my wifi. Also disabled auto sync and auto backup. \nWhat might cause this strange behaviour? Is there a way to see wakelocks without rooting?", "time": "04-06-2017 01:33 AM", "replies": []}, {"postID": "post5746184", "text": "🙋\nI had something similar happen on one of my phones. Turned out it was a pre-installed security app that had somehow become set to perform a scan at the same time each day, in the early morning. How the change occurred I don't know.https://forums.androidcentral.com/sh...d.php?t=409154", "time": "04-06-2017 04:23 AM", "replies": []}, {"postID": "post5746239", "text": "Hm ... you might be right. I do have an app called \"Phone Manager\" and in that app I have a virus scan. I think its a pre-installed Avast scanner(it says \"powered by Avast\"). Now, the question is: How do I turn this thing off, without root? On most of the apps I could press the disable or force stop buttons, but this is like the system processes, the disable and force stop is grayed out. I did set it to no auto update the virus database, and the scan speed from full to quick + disabled something called \"Cloud scan\". Hope that does it. In the meantime, any tips from Huawei users how to disable it? Will installing a real Antivirus app disable the default, so I can set up the app version correctly?", "time": "04-06-2017 05:44 AM", "replies": []}, {"postID": "post5746360", "text": "I don't recall how I fixed it in my own case, but it was simple. The app was McAfee. I think I just switched off the scan option in the app's settings.\nI'll move the thread to the P9 forum, shall we say, for Huawei-specific suggestions.\nAlso, welcome as a new member.", "time": "04-06-2017 08:05 AM", "replies": []}, {"postID": "post5746517", "text": "Thanks for the help ^^ I hope I can solve it without having to call their support.", "time": "04-06-2017 10:14 AM", "replies": []}]}, {"title": "Stills from Hauwei video", "thread": [{"postID": "post5740458", "text": "I have some great videos on my Hauwei P9 and want to extract some stills. Can this be done and, if so, how?", "time": "04-03-2017 04:00 AM", "replies": []}, {"postID": "post5742062", "text": "Welcome to Android Central! Try Video to Image Converter, or one of the other similar apps listed there.", "time": "04-03-2017 09:44 PM", "replies": []}]}, {"title": "Reseting input language error on Huawei p9", "thread": [{"postID": "post5739800", "text": "Sorry i just sent a message related to my error in advertently setting Turkish as the input language on my new Huawei P9 running on Android 7. I tried to reset to English but i cannot read the menue displaying in Turkish. I tried to guess the function from another Android menue but the fuctions display is different so i do notknow how to sort this out. Any help please will be appreciated. Thanks.Mil.", "time": "04-02-2017 04:37 PM", "replies": []}, {"postID": "post5740224", "text": "one of the most efficient tricks that I've ever tried is to use google translate on another phone with camera instant translation.", "time": "04-02-2017 10:21 PM", "replies": []}]}, {"title": "Pictures by P9", "thread": [{"postID": "post5188681", "text": "Decided to start a topic, where we all can share our best pictures, taken with P9", "time": "05-21-2016 10:03 AM", "replies": []}, {"postID": "post5190357", "text": "Love that first pic!", "time": "05-22-2016 01:41 PM", "replies": []}, {"postID": "post5192067", "text": "Panoramic shot 😉\nPosted via the Android Central App", "time": "05-23-2016 02:11 PM", "replies": []}, {"postID": "post5258769", "text": "Hello,\nI shot several samples too: Fényes Lóránd - asztrofotográfia | HUAWEI P9 PHOTO SAMPLES\nLorand", "time": "07-10-2016 11:03 AM", "replies": []}, {"postID": "post5286397", "text": "", "time": "07-28-2016 01:18 AM", "replies": [{"postID": "post5550433", "text": "Gorgeous!\nPro Mode? \nLast time I shot a sunset I had to choose the Sun setting in white balance to get the colours to pop (oh and I underexposed too)", "time": "11-07-2016 04:47 AM", "replies": []}]}, {"postID": "post5479887", "text": "Night shots of Birmingham UK", "time": "10-10-2016 12:37 PM", "replies": [{"postID": "post5544876", "text": "Breathtaking shots. Do you shoot with an nd filter or does the phone expose this well alone?", "time": "11-04-2016 05:32 AM", "replies": []}]}, {"postID": "post5481805", "text": "P9 Plus.", "time": "10-11-2016 02:27 AM", "replies": []}, {"postID": "post5500371", "text": "Couple of recent night shots in Riga, Latvia.\nFirst one.", "time": "10-17-2016 04:03 PM", "replies": []}, {"postID": "post5500376", "text": "The second one", "time": "10-17-2016 04:04 PM", "replies": []}, {"postID": "post5550432", "text": "From my experience the handset exposes that well.\n@Bonovox72 were they shot using Night Shot? I occasionally find that Night Shot exposes better than I can get the handset to when using Pro Mode settings.", "time": "11-07-2016 04:46 AM", "replies": []}, {"postID": "post5552410", "text": "No, auto mode every time 😉", "time": "11-08-2016 03:53 AM", "replies": []}, {"postID": "post5557503", "text": "-8.0 mag Iridum flare\nISO100, 3s exposure", "time": "11-11-2016 05:45 AM", "replies": []}, {"postID": "post5619275", "text": "Is it real? Unbelievable!", "time": "12-23-2016 11:55 PM", "replies": []}, {"postID": "post5645337", "text": "Messing around with the Night Shot", "time": "01-16-2017 07:52 AM", "replies": [{"postID": "post5728176", "text": "Wow, this is incredible.", "time": "03-27-2017 05:50 PM", "replies": []}]}, {"postID": "post5708913", "text": "Casual Auto mode shot 😉", "time": "03-11-2017 03:16 PM", "replies": []}, {"postID": "post5735821", "text": "Thank you all for posting! I can't believe I missed the $240 deal for the P9 here..", "time": "03-31-2017 02:18 PM", "replies": []}]}, {"title": "Bought the P 9", "thread": [{"postID": "post5713149", "text": "Bought the P 9 last week after using the Sony Z3 compact for two years.\nI like the change, the phone is very responsive. The Huawei stock launcher doesn't worry me\nmuch, can still use all the facility's it has.\nThe camera is a bit more technical to operate compared to the Sony's, but after a few weeks of practice I will get it right.\nLooking forward to the nougat update in a couple of months.\nAlways nice to get updates and check all the systems out. Like getting a new device.\nI have really no issues with the phone, but I have a Huawei specialised shop nearby, they will help with anything....that's nice and reassuring.\nI fully insured the phone.\nI think I could keep this one for a longer period, as I cant see that any other model can do very much more really. \nRegards", "time": "03-15-2017 02:06 PM", "replies": []}, {"postID": "post5728175", "text": "Thank you so much for your review! What is battery life like, and how does it feel in the hand?", "time": "03-27-2017 05:49 PM", "replies": []}]}, {"title": "P9 Lite dualsim - android wear unusable", "thread": [{"postID": "post5728147", "text": "Hello folks,\nmy first post here, so many thanks in advance for your help!\nI just bought a P9lite dualsim, primarily for glucose monitoring, which works through a connected sony smartwatch 3. And here´s the problem: I start android wear, connect with smartwatch, and android wear tells me to upgrade in playstore, or abort. if i click \"upgrade\", google playstor tells me: your device is not compatible with this upgrade. if I choose abort, android wear closes. reopnening leads to the same upgrade window. uninstalling resetting to factory, new google account... at the end I see the same upgrade window...\nany ideas for that?\nmany thanks\nklaus", "time": "03-27-2017 05:31 PM", "replies": []}]}, {"title": "How to transfer my pictures from my Huawei P9 to my PC", "thread": [{"postID": "post5718094", "text": "Hello everybody, \nQuite new to this. My girlfriend has bought a P9 and has managed to fill in all the internal storage with pictures etc. Connect the phone on the PC and we cannot see any files. How can I access the files in the phone and back them up in my PC. She does not have a micro SD card in the phone would that be the easiest way of transferring the data?\nShe is not very tech savvy and even though I'm good on dealing with technology I'm not an Android user so if you go slow on me it will be amazing.", "time": "03-20-2017 06:37 AM", "replies": []}, {"postID": "post5718354", "text": "Welcome to Android Central! Connect the phone to the PC via USB, swipe down on the notification panel, tap the USB icon, and make sure MTP or File Transfer is selected. Then open Windows Explorer on the PC and open the phone in the device list. You can now drag and drop files from the phone storage to the PC's hard drive. Photos taken by the camera app are in the /DCIM/Camera directory.\nI would also strongly recommend taking advantage of Google Photos auto backup: https://support.google.com/photos/an...DAndroid&hl=en", "time": "03-20-2017 10:38 AM", "replies": []}]}, {"title": "Copy from one P9 to another P9", "thread": [{"postID": "post5717089", "text": "Hello\nMy P9 has to go away for repair, so I have bought another to use while its gone. \nWhat is the best way to copy everything from one device to the other? Ideally I'd like to copy accounts/wifi/calendar/contacts/files/apps. \nThanks in anticipation", "time": "03-19-2017 08:33 AM", "replies": []}, {"postID": "post5717315", "text": "Try this guide: http://forums.androidcentral.com/amb...id-device.html", "time": "03-19-2017 12:44 PM", "replies": []}]}, {"title": "EMUI 5.0 - Nougat - How to check for updates?", "thread": [{"postID": "post5709574", "text": "I manually upgraded my P9 Lite to EMUI 5.0 - Nougat, but unlike the previous version when I go to Settings I don't see any option to check for updates (which used to be at the bottom of the screen).\nIs this normal?", "time": "03-12-2017 07:09 AM", "replies": []}, {"postID": "post5710457", "text": "Moved to the P9 forum.", "time": "03-13-2017 02:36 AM", "replies": []}, {"postID": "post5710479", "text": "It is at:\nSetting > About phone > System update > Check for update", "time": "03-13-2017 02:58 AM", "replies": []}]}, {"title": "When will Huawei p9 lite get Android 7/EMUI 5.0?", "thread": [{"postID": "post5702196", "text": "It has been said that Huawei p9 lite will be one of the phones to get new android but what would be the exact realease date?", "time": "03-07-2017 12:26 AM", "replies": []}, {"postID": "post5709021", "text": "Like, yesterday...", "time": "03-11-2017 04:59 PM", "replies": []}]}, {"title": "How can you use a 'hands free' mode with the P9", "thread": [{"postID": "post5708240", "text": "I'll admit to being very 'technically challenged', so please bare with me ;(\nI have recently upgraded to the Huawei P9 after my faithful old Samsung died. Back when my Samsung was working I could get in my car, turn on the 'hands free' mode and I could simply say 'Hi Galaxy' and a voice prompt would ask me what I wanted. 3 options....navigate, text or call. It was fantastic.\nNow I've spent all this money on the P9 and don't seem to be able to operate 'hands free' Would have thought this technology would have been a given with such a new phone. Hope you can help. Thanks", "time": "03-10-2017 11:57 PM", "replies": []}]}, {"title": "how do i fix huawei p9 lite bootloop?", "thread": [{"postID": "post5707191", "text": "I installed android nougat on p9 lite didn't like it and I downgraded to marshmallow now phone is stuck in bootloop and I cant get into recovery. HELP ME.", "time": "03-10-2017 05:56 AM", "replies": []}, {"postID": "post5707502", "text": "Moved to the P9 forum.", "time": "03-10-2017 11:01 AM", "replies": []}]}, {"title": "Problems moving Music to my Huawei Nova", "thread": [{"postID": "post5706597", "text": "Hey guys, just bought myself a Nova and am loving it! However am having huge problems moving my music onto the phone.\nFor whatever reason, the file manager from huawei doesn't deal with music (Contacts, videos, pictures and messages) and trying to manually move MP3's into the folder, it pops up the message the phone has disconnected (which it has not). \nI've given the HiSuite (the Huawei file manager) access to auto connect to my phone, allowed it to use HDB and tried both SD and internal storage to no avail  Any help is much appriciated!\nThanks!", "time": "03-09-2017 05:02 PM", "replies": []}, {"postID": "post5707064", "text": "Welcome to Android Central! Don't bother with HiSuite. Instead, connect the phone to your computer via USB, then swipe down the notification panel and tap the USB notification there. Make sure MTP or File Transfer is selected.\nNow open Windows Explorer and look for the phone in the device list. Open it. Now you can drag and drop your mp3 files to the phone's internal storage -- I would suggest copying the files to the Music directory, and keep the standard folder hierarchy of Artist>Album>Song.", "time": "03-10-2017 02:17 AM", "replies": []}]}, {"title": "Huawei p9 screen in smart view case mode", "thread": [{"postID": "post5705124", "text": "Hi,\nMy friend dropped her huawei p9 in the water for a fraction of a second and now when it turns on all we see is the shrunk screen for the official smart view case even though she doesnt own the case! So now she cant get into her phone at all.\nIs there anyway of getting through this?\nThanks so much", "time": "03-08-2017 06:47 PM", "replies": []}]}, {"title": "Thinking of buying a P9, a few questions..", "thread": [{"postID": "post5521689", "text": "Im thinking of getting myself a P9, but was wanting some advice from \"real\" users, not reviews...\nIm coming from a Nexus 6P, but find I dont use the speakers on the front and find it a bit on the large side.. with the speaker chins.. its just over 6\" ... like a big flat slab in my hand... which is starting to annoy me.. Im also getting tired of 3rd party manual camera apps draining the battery, so..\nI mainly use my phone for Photography, music and RSS articles and News (Nwesstand, Flipboard).. I have a Lenovo Tab for Movies, Netflix etc.. so not bothered about that... and dont mid a 1080p screen..\nSo how do you find the P9 in its current OS build", "time": "10-25-2016 06:10 AM", "replies": []}, {"postID": "post5527911", "text": "I love mine. I didn't like my Sammy S7E so some it on and came to the p9 after my Sony Z3c died, I have just tried a Moto Z but missed the camera options from the p9 and didn't like the finger print scanner or the size of it. \nMy only gripe is no fast charger available....at least in the UK. \nI ditched the Huawei launcher for Nova as I do on all my phones. Love this phone but would like it to be waterproof and have fast charging.... I think I'd like a Sony /Huawei mash up phone but this is a top phone for the price IMHO.", "time": "10-27-2016 10:39 AM", "replies": [{"postID": "post5528717", "text": "Ive actually picked one up.. and yes.. Im loving it so far... althnough 5.7\" to 5.2\" screen is quite a come down at first, but ill get used to it.. I actually quite like the EMU UI (which I had to flash Manually from B166 > B182 - 411)... its fun to use and has a few useful features.. although some might call them gimmicks..\nIve tried a Samsung S7E, with its childish Disney UI... the Edge.. prevented me from pressing the \"1\" and the \"A\" keys when setting up and the camera.. im sorry to say.. was terrible.. I just couldnt get a decent image out of it at all... the speaker was a squacky tinney mess for PodCasts (I listen to P..Cs in bed).. and headphone audio was a disgrace for a £700 flagship.,.. I cashed in my 48 hour exchange policy straight away..\nYes sadly, no fast charge... but the rest makes up for it \nIve posted a review..", "time": "10-27-2016 04:04 PM", "replies": []}]}, {"postID": "post5528876", "text": "Yay! \nYou'll get used to the size... Easier one handed, more pocketable etc. \nTotally agree re S7E \"disney\" style UI and I too didn't get on with the camera. \nTiny Huawei things I like... Knuckle tap for screenshot, mini icons in colour for notifications on the bar, slide down fingerprint sensor to open notifications... Or camera or whatever you configure.\nMy can't live without feature though is the camera UI and the bokeh setting.... Love it. \nI also love the form factor of this phone, clean simple, great size etc and how colours look real.", "time": "10-27-2016 05:29 PM", "replies": []}, {"postID": "post5597227", "text": "My contract with my sony Z3 compact expires in March 2017. I like trying different phones out. The Z3 compact was almost perfect, even with marshmellow it didnt give any problems. Except the back glass cracked from excessive heat on internet.\nI like the look of the P9. Its in my price range along with the LG G5 se.\nI really haven't heard much about this company Huawei compared to HTC, Sony, LG and samsung.\nAccording to reviews the P9 can be better, but for whom....The Iphone and S7 are out of my price range. \nThe phone will be many used for internet surfing, phone, whatsapp and some pictures. I dont do the game thing.\nSo will the P9 fit the bill. Will Huawei also give good service and updates....\nThankyou in advance", "time": "12-07-2016 12:55 PM", "replies": []}, {"postID": "post5645341", "text": "With the witchcraft Huawei have put into battery power not having a fast charger out the box doesn't really bother me as the battery life is excellent. Not fast charging will prolong the life of the non replaceable battery.", "time": "01-16-2017 07:58 AM", "replies": [{"postID": "post5683018", "text": "Thats actually a really good point which is rarely mentioned... Constant Fast Charging over and over again actually shortens the life of Lithium Ion batteries, I used to turn it off on my S7 edge.. However, the P9 is so slow its ridculous... I let my P9 drop to 10% a few days ago.. and it took nearly 4.5 hours to charge .. thats not good .. Im running B182 OS.I believe P9 supports its own kind of Huawei F.C..yes, but its not QC 2 or even QC 3.. the best i found was this tread.. which is confusing...https://forum.xda-developers.com/p9/...ei-p9-t3373037\nHope that helps", "time": "02-18-2017 07:08 PM", "replies": []}]}, {"postID": "post5646224", "text": "Can one buy a fast charger, or doesnt the phone do fast charging ?", "time": "01-16-2017 10:50 PM", "replies": [{"postID": "post5683018", "text": "Thats actually a really good point which is rarely mentioned... Constant Fast Charging over and over again actually shortens the life of Lithium Ion batteries, I used to turn it off on my S7 edge.. However, the P9 is so slow its ridculous... I let my P9 drop to 10% a few days ago.. and it took nearly 4.5 hours to charge .. thats not good .. Im running B182 OS.I believe P9 supports its own kind of Huawei F.C..yes, but its not QC 2 or even QC 3.. the best i found was this tread.. which is confusing...https://forum.xda-developers.com/p9/...ei-p9-t3373037\nHope that helps", "time": "02-18-2017 07:08 PM", "replies": []}]}, {"postID": "post5701292", "text": "One quick question.\nAnyone have problem with streaming TuneIn / podcast apps? On P9?", "time": "03-06-2017 11:22 AM", "replies": []}]}, {"title": "Will my certain huawei get 7.0", "thread": [{"postID": "post5700257", "text": "Hello. I currently have a huawei p9 and I am wondering if the certain model which is EVA-L09C900B139 will get android 7.0 it is said to be coming out this month and I am wondering if I will get it?", "time": "03-05-2017 02:07 PM", "replies": []}, {"postID": "post5700284", "text": "all P9 models are the same, so your model will get 7.0 update.", "time": "03-05-2017 02:52 PM", "replies": []}]}, {"title": "Transfer notes to Huawai P9", "thread": [{"postID": "post5697051", "text": "I have a lot of notes on my old HTC and I would like to be able to import these notes into notepad on my P9.", "time": "03-02-2017 03:54 PM", "replies": []}, {"postID": "post5697542", "text": "Welcome to Android Central! What app did you use on the HTC phone to make the notes? The problem with the stock note-taking apps on various phones is that they are often not interchangeable (and the app doesn't always have a sync or backup function). That's why I strongly recommend using Google Keep.", "time": "03-03-2017 12:34 AM", "replies": []}, {"postID": "post5699349", "text": "The notes were stored in the NOTES folder on HTC Sensation. There is a notes icon on the HTC phone. Notes on the P9 are stored in the notepad. When I transferred the notes they imported as HTML files and can be seen in Documents on P9. I do not see any import in notepad. The question is, can notes from other phones be imported into notepad on P9 ?", "time": "03-04-2017 02:51 PM", "replies": []}, {"postID": "post5699737", "text": "That will probably depend on how the notepad app on other phones creates and saves notes, and if the app has any kind of export function. The notepad app will differe depending on the manufacturer, and sometimes the same manufacturer will have a newer notepad app on newer phones, compared to their older phones.", "time": "03-05-2017 01:53 AM", "replies": []}]}, {"title": "my huawei p9 video recorder won't record", "thread": [{"postID": "post5692946", "text": "i keep getting a box popping up saying, com.google.androidgooglequiksearchbox:interacter", "time": "02-27-2017 10:10 AM", "replies": []}, {"postID": "post5692992", "text": "Keep getting a box popping up saying, camera is currently recording audio. com.google.android.googlequiksearchbox:interacter", "time": "02-27-2017 10:42 AM", "replies": [{"postID": "post5699660", "text": "I had the same problem after I have activated Google Assistant Voice Recognition (the OK Google thing).\nIn camera mode you can easily fix it by deactivating from Settings the Audio Control mode (you won't be able to take automatically pictures by saying CHEESE).\nWhen you are in Camera, Swype left, enter Audio Control and deactivate all options.\nIt did the trick for me.", "time": "03-04-2017 11:11 PM", "replies": []}]}]}, {"title": "Cant sign in my google account", "thread": [{"postID": "post5695795", "text": "I got a new phone huawei p9 and yest i successfully set it up but today i put in a sim card,google wont let me sign in,i kept getting this prompt\nThis device was reset.to continue,sign in with a google account that was previously synced on this device,verrry frusting", "time": "03-01-2017 03:54 PM", "replies": []}, {"postID": "post5697661", "text": "Welcome to Android Central! Did you get this phone used from someone else? If so, did they properly remove their Google account prior to the reset? That has to be done in order for the reset to be considered authorized. Otherwise, Google's Factory Reset Protection will kick in, and after the reset is done, it will prompt the user to enter the previous Google account's name and password.", "time": "03-03-2017 01:54 AM", "replies": []}]}, {"title": "Bild oder Video Übertragung ist unscharf Bitte um weiter Hilfe", "thread": [{"postID": "post5697190", "text": "Am Anfang war alles ok bild Übertragung von IP Camera auf mein P9 war Super, dan habe sich nächste Tag total ferschlescht und seit 2 Tagen ist Bild unscharf ich komme nicht weiter können mir jemand weiter helfen", "time": "03-02-2017 05:45 PM", "replies": []}, {"postID": "post5697194", "text": "[Google Translate:]\nIn the beginning everything was ok Picture transmission of IP Camera on my P9 was super, dan has been next day totally ferschlescht and since 2 days is blurred image I come no further can help me someone", "time": "03-02-2017 05:49 PM", "replies": []}]}]
[{"title": "Huawei P9", "thread": [{"postID": "post5686762", "text": "Hi I am new at this so bare with me please. I have had the above phone for about a month now and loving it. I dont use it to its full potential but learning daily. \nOne small problem at the moment. I allowed the battery to go totally flat overnight and now have it on ab out 99% charged. My question, I have somehow pressed something for the emergency screen to pop up and is asking me for a password. I have never set up a password ~ only my fingerprint which allows me to switch on and off. This is not working in getting rid of the emergency screen. What to do?", "time": "02-22-2017 02:19 AM", "replies": []}, {"postID": "post5688061", "text": "Welcome to Android Central! When you set up your fingerprint, it most likely asked you to create a backup password as well. Android devices that use fingerprint unlock typically require you to enter that backup password periodically, to increase security. You don't recall creating one?\nAlso, can you take a picture of that screen with another device and post it here? http://forums.androidcentral.com/gen...d-central.html", "time": "02-23-2017 02:51 AM", "replies": []}, {"postID": "post5689305", "text": "Thank you.. Yes stupid me I did do a back up password but forgot about it and did not connect the two. All sorted thank!\nMM", "time": "02-24-2017 02:12 AM", "replies": []}]}, {"title": "Huawei P9 - Can't add Google account - Can't open Play Store", "thread": [{"postID": "post5686149", "text": "I live in Europe and have a new Huawei P9. I can't add a Google account and sign in to it. All Google apps, like Drive and Play Store, flash and quit or stay open but don't let me add an account and sign in. Gmail, Youtube, etc., I can't sign in. So, I can't install new apps, because I can't use Play Store. It flashes and quits. Everything else works, I can browse the internet with Chrome.\nI found out, many people have/had this problem. I tried everything, even resetting the phone.\nAny help please?", "time": "02-21-2017 02:16 PM", "replies": []}, {"postID": "post5686698", "text": "Welcome to Android Central! Did the phone come with Google Play Store preinstalled, or did you have to install it yourself? If the latter, then the phone might have been intended for a market where Google Play isn't available.", "time": "02-22-2017 12:05 AM", "replies": []}, {"postID": "post5686748", "text": "All Google apps, like Google Play, came preinstalled, I didn't have to install them.", "time": "02-22-2017 01:52 AM", "replies": []}, {"postID": "post5687136", "text": "Go to the Google Play Services app page on the Play Store website (on your desktop browser), click Installed, and see if your device shows up as eligible for an update: https://play.google.com/store/apps/d...roid.gms&hl=en", "time": "02-22-2017 10:40 AM", "replies": []}, {"postID": "post5687321", "text": "I didn't buy my device from Play Store, so when I go to the page you sent me, in Chrome, logged in with my Google account, no device is listed and there is no option to add my device.\nWhen I search for an app, like Skype, and want to download it, the page tries to open the Play Store app, which then quits immediately (the problem described above).\nIf I could safely download the apps I need, like Skype, I wouldn't bother much, but unfortunately all app downloads go through Play Store, which keeps quitting.", "time": "02-22-2017 01:17 PM", "replies": [{"postID": "post5687975", "text": "No, I'm realizing now the problem with my suggestion -- if you were unable to log into your Google account with your phone, then Google won't have your device listed in your account, and therefore it won't show up when you try to install Google Play Services.\nWhat country are you in? Google Play still isn't available in all countries, but I'd be surprised if that were the case in any European country.", "time": "02-23-2017 12:28 AM", "replies": []}]}, {"postID": "post5688080", "text": "I have read about this problem. Many people have/had it. All Google apps on my P9 quit, so I can't login to Google. I can login to Gmail in Chrome though, but this doesn't solve the problem with the Google apps.", "time": "02-23-2017 03:21 AM", "replies": []}, {"postID": "post5688417", "text": "You didn't recently change your Google account password, right? If you did, you have to wait 72 hours before you can log into a new phone.", "time": "02-23-2017 10:29 AM", "replies": []}, {"postID": "post5688561", "text": "No. The thing is, this device knows nothing about my Google account, since I couldn't register any, then the Google apps quit before I can setup my account. Therefore, I can't even add an Google account to this phone.", "time": "02-23-2017 12:32 PM", "replies": []}, {"postID": "post5688815", "text": "Let's backtrack a bit. When you try to add a Google account, what exactly happens? So if you go to Settings>Accounts and then tap Add Account, what happens when you go through the process of adding your Google account?", "time": "02-23-2017 04:15 PM", "replies": []}, {"postID": "post5688818", "text": "When I do what you said, the Google app opens, but quits immediately. I can't add any account, since it quits. Then I see again the white Settings page \"Add Account\", which was behind.", "time": "02-23-2017 04:19 PM", "replies": []}, {"postID": "post5688862", "text": "Whenever I set up a phone first time,\nI have to give email address,\nWhen I go to Google Play Store mist Google apps have an update pending and until Google Services is updated some things don't work\nThis phone was never ever used before? Sounds strange, odd. \nPerhaps return, I'd try factory reset first", "time": "02-23-2017 05:01 PM", "replies": [{"postID": "post5688866", "text": "The OP already tried doing a factory reset.\nThis probably won't do much, but try going to Settings>Apps, select the Google app, and Clear Cache/Clear Data. Then try again.", "time": "02-23-2017 05:06 PM", "replies": []}]}]}, {"title": "Tethering /mobile internet", "thread": [{"postID": "post5686892", "text": "Hi, \nOdd issue. \nwhen ever i enable tethering on my p9 lite i loose the abililty to use internet apps on my phone. ie google chrome bbc iplayer etc. \nMy phone plan allows tethering so this is not an issue where the provider is blocking the connection as my sim card works in my old p8 phone and tethering and internet access on phone works at the same time. \nThe phone is brand new and was once on the Vodafone network , it has since been unlocked to any network . \nAny ideas what could be causing this ? . i have asked three technical support but they are useless.\nThanks in advance. \nRay", "time": "02-22-2017 06:46 AM", "replies": []}, {"postID": "post5688056", "text": "Welcome to Android Central! Is there any kind of data-saver setting or app on the phone that forces the phone to use wi-fi rather than mobile data? If so, then it might be confused when the phone's wi-fi radio turns on but is being used to broadcast a signal (rather than receive).", "time": "02-23-2017 02:46 AM", "replies": []}]}, {"title": "P9 Lite screen protector?", "thread": [{"postID": "post5668433", "text": "I know this isn't the P9 Lite forum (actually there isn't one) so I'm posting here.\nIs the screen protector that came with the phone fine (actually I have 2 applied lol) or do I *NEED* another one?", "time": "02-05-2017 12:05 PM", "replies": []}, {"postID": "post5685622", "text": "I kept the supplied screen protector on for months, then bought a pair of Omoton tempered glass protectors - they're much better and oleophobic, in my opinion. The screen seems a lot cleaner.", "time": "02-21-2017 06:09 AM", "replies": []}]}, {"title": "Keep or not to keep???", "thread": [{"postID": "post5640173", "text": "Recently (Sunday) went into my local EE store to see if I was eligible for an upgrade. Just an enquiry, that's all....however I somehow managed to come out of the shop with a new contract and phone. \nCurrently using a galaxy S6 but ended up with a Huawei P9.\nMy question is do I keep it or sell it??? I can't return it as there's no cooling off period if you buy in the shop. \nI wanted the Google Pixel (too expensive to upgrade) or a sim only and purchase a One plus 3.\nAre any off you able to convince me enough to keep it and use it....\nMany thanks in anticipation", "time": "01-11-2017 02:25 PM", "replies": []}, {"postID": "post5645313", "text": "Keep. I came from a Note 4 (stupendous phone) The P9 camera is excellent and it's witchcraft that Huawei have put into their battery. I can get nearly 10 hours SOT\nMine is on an EE contract but I flashed my own unbranded firmware.", "time": "01-16-2017 07:27 AM", "replies": []}, {"postID": "post5683911", "text": "I know this is a bit late, but Ide keep it.... It has a fantastic camera.... one of the best manual modes and settings Ive ever used.... I even think its better than the S7 edge, also the single audio speaker is really great.. and very loud without distorting (i use it for Podcasts) and its impressive on headphones as well..... \nAlso, dont fall into the \"Its only a 1080p screen\" trap, because its a great 1080p screen, very clear, great viewing angles and makes the battery life stretch for hours..\nEnjoy it", "time": "02-19-2017 04:45 PM", "replies": []}]}, {"title": "Google Chrome, webpages text very small, like dots", "thread": [{"postID": "post5683457", "text": "For some reason my Huawei P9 started to dispaly some text on webages so so small, it seems like dots or a line. Have to zoom like 100% to see the text.\nSome pages are OK. \nUnfortunatelly it is not possible to attach a screenprint.", "time": "02-19-2017 07:48 AM", "replies": []}, {"postID": "post5683682", "text": "Welcome to Android Central! In Chrome, tap Menu, and make sure Request Desktop Site isn't checked on.\nHere's how to attach screenshots: http://forums.androidcentral.com/gen...d-central.html", "time": "02-19-2017 12:19 PM", "replies": []}]}, {"title": "P9 lite sim free unlocked but has vodafone logo?!", "thread": [{"postID": "post5678339", "text": "I have just received my P9 lite from a 3rd party seller on Amazon and fulfilled by Amazon.\nThe phone is unlocked and sim free but what I don't understand is that when the phone boots up it displays the Vodafone logo.\nBearing in mind that the the phone was brand new and had what I presume was genuine unvoided stickers securing the box.\nThe phone is brand new to look at and had all the proper celephane protection.\nI just don't understand how the phone can be brand new, sim free and unlocked but display the Vodafone logo?\nThe phone is unlocked as I have my Three sim working fine in it.\nAny ideas?", "time": "02-14-2017 06:40 PM", "replies": []}, {"postID": "post5683560", "text": "Probably because Vodafone aren't sim locking these devices anymore...", "time": "02-19-2017 10:06 AM", "replies": []}]}, {"title": "HuaweiHealth app not counting steps anymore", "thread": [{"postID": "post5667007", "text": "Hey, new here, have had my p9 for close to 6 months. So not that new to the phone and seem to have a handle on it, now running emui 5.\nI use the step counter on the huaweihealth app, it was working fine (even after emui5 was installed) and one day (january 28th to be exact) the app will no longer count steps.\nI downloaded another pedometer app. And it works fine, but I'd like to have this one working again as it has my history and I don't need to turn it on, it's integrated into the phone nicely.\nAny ideas? I'm using the BlackBerry launcher of that has anything to do with anything, but like I said before, it was working fine with no issues before that day. I've tried powering off and restarting a couple of different times.\nLet me know, thanks!\nMike", "time": "02-03-2017 08:29 PM", "replies": []}, {"postID": "post5669031", "text": "mines still working fine, you could try uninstalling it then download it again apk file, however i am still strugling to find a way in changing it from km to miles? and mine wont log in", "time": "02-06-2017 05:53 AM", "replies": []}, {"postID": "post5669171", "text": "Any idea where I can find the apk file?", "time": "02-06-2017 09:12 AM", "replies": []}, {"postID": "post5675829", "text": "Check my post at XDA > https://forum.xda-developers.com/p9/...4/post70523390", "time": "02-12-2017 02:07 PM", "replies": []}, {"postID": "post5683062", "text": "Thanks for this, was able to download and install. Any idea where I can find version 2 though?", "time": "02-18-2017 08:29 PM", "replies": []}, {"postID": "post5683064", "text": "Also, it doesn't seem to be working even after the uninstall and reinstall of the version on your previous post... any other ideas or things to try?", "time": "02-18-2017 08:30 PM", "replies": []}]}, {"title": "Hotmail", "thread": [{"postID": "post5474805", "text": "I would like it if when I delete an email on my phone, it will also be deleted from my actual hotmail account, how can I achieve this please? I am a new hauwei user (used iphone since forever...) thanks", "time": "10-08-2016 10:16 AM", "replies": [{"postID": "post5533513", "text": "Did you ever get this figured out? Just bought a P9 plus yesterday and got everything, including my outlook/hotmail account setup. I setup an Exchange account. On Huwaei, you do this by going to Account->Add an account->Corporate. Enter Email Address, username, password. Email Address/username will be the same. That *should* work. There are other settings behind that, but they are set correctly (except maybe one).\n*If*, Using the standard account setup doesn't work, it may be the server. By default it is m.hotmail.com. On my previous phone that worked. On the phone before that, I used eas.outlook.com. If the standard account setup fails, go to the manual setup and change the server to eas.outlook.com. Port and Security Type is already correct.\nOnce you do that and it works, you can setup everything you want to sync. I sync everything, contacts, calendar, email, but you may only want email. I set up the account \"sync schedule\" to push, so I get email as soon as it arrives. Also, when I delete emails, they get deleted on the server (which is what you are wanting). \nHope that helps.", "time": "10-29-2016 09:59 PM", "replies": []}]}, {"postID": "post5475000", "text": "Kind of unrelated, but what Huawei are you using? Do you like it and would you recommend someone else to make the same purchase?", "time": "10-08-2016 11:52 AM", "replies": []}, {"postID": "post5477064", "text": "It's a P9 and I really like it, dont miss having an iphone which I thought I would! Just want to sort this email business out... 😊", "time": "10-09-2016 10:44 AM", "replies": []}, {"postID": "post5481923", "text": "Hello, from my experience (always used Hotmail and the respective app) the problem is not on the phone but the app itself.It seems to somehow lack that synchronization with the inbox elsewhere. Even on windows phone where it is a native service.", "time": "10-11-2016 04:42 AM", "replies": [{"postID": "post5496639", "text": "Hi, I don't use the app, I just assigned my hotmail account to my phone and when I had it set up like this on my iphone, it worked fine, if I deleted an email on my phone, it would be deleted from my hotmail account, confused... ������", "time": "10-16-2016 03:02 AM", "replies": []}]}, {"postID": "post5675370", "text": "Thanks, I'm all sorted now.", "time": "02-12-2017 02:41 AM", "replies": []}, {"postID": "post5682516", "text": "Good to hear your sorted.. but email works like this:\nExchange / IMAP / IMAP 4.. are server based - so your logged into your email server... delete it from the phone and it deletes from server..\nPOP / POP3 is device based... It basically \"Downloads\" it to your device from server, so deleting mail.. only deletes it from the device..\nHope that helps", "time": "02-18-2017 09:14 AM", "replies": []}]}, {"title": "Android Pay not working on P9", "thread": [{"postID": "post5543223", "text": "Okay so ive moved Note7 to P9. I am in UK. \nSet up all my apps inc registering a bank card on Android Pay. \nTried on 2 separate contactless readers in the same store. \nNothing. \nWhere precisely on the P9 is the NFC chip please?", "time": "11-03-2016 09:46 AM", "replies": []}, {"postID": "post5543324", "text": "Have you been able to test out NFC on anything else? From what I've been reading, certain Huawei models intended for the China market don't have NFC: NO NFC on Chinese Version AL10 P9 Plus | Huawei P9 Plus\nTry installing something like NFC Check to make sure the phone has NFC functionality.", "time": "11-03-2016 10:26 AM", "replies": [{"postID": "post5543816", "text": "Just downloaded yorcard checker and that works fine. \nI observe that the NFC reader appears to be up the top by the Leica camera.", "time": "11-03-2016 02:05 PM", "replies": []}]}, {"postID": "post5543950", "text": "Have you been able to use it successfully anywhere else? In the US, I still find some checkout readers that claim to support Apple Pay/Android Pay, but don't work -- which is sometimes due to the store not actually activating it properly.", "time": "11-03-2016 03:22 PM", "replies": [{"postID": "post5545915", "text": "Ive tried Android pay twice today, both times failures. \nCalling my bank now. \nAndroid Pay is a dealbreaker for me", "time": "11-04-2016 02:28 PM", "replies": []}]}, {"postID": "post5546176", "text": "When you mentioned that Yorcard Checker works fine, do you mean that it was able to detect your smartcard via NFC?\nWhen you try to pay with Android Pay, does it just not detect anything, or does the phone vibrate at all?", "time": "11-04-2016 04:58 PM", "replies": [{"postID": "post5548920", "text": "Thanks for the follow up. \nNFC works (verified by Yorcard checker, beaming, etc). \nAndroid pay tried at a variety of retailers with different machines all of which have failed. \nIn Costa just now 'unsupported card' appeared on the screens. \nAny thoughts?", "time": "11-06-2016 10:01 AM", "replies": []}]}, {"postID": "post5548985", "text": "I wonder if it's a problem with your cards not being supported by Android Pay, the phone's Android Pay interface not responding correctly, or the stores' readers not accepting Android Pay. The first possibility seems unlikely, because Android Pay should tell you if a card isn't compatible, and not let you keep it in your wallet. I wish I could help you narrow the problem down more.", "time": "11-06-2016 10:36 AM", "replies": [{"postID": "post5581762", "text": "Still no joy. \nSeriously considering jacking the P9 and just getting an S7E. \nTo recap my android pay worked fine on previous note 7 and note 3 devices with the same bank card. \nMy Bank have cancelled the previous android pay virtual card number and i now have a new one. \nEven with this new number it still brings up the 'security check required, insert card into chip n pin slot' message. \nReally unsure who to hold accountable and how.", "time": "11-27-2016 04:30 AM", "replies": [{"postID": "post5589458", "text": "Any thoughts anyone, please? \nDoes anyone in UK have it working on a P9?", "time": "12-02-2016 04:48 AM", "replies": []}]}]}, {"postID": "post5680486", "text": "Hi\nI've got the P9 Lite and use Android Pay on it daily in London. Or I would do if it worked all the time. It probably works three out of every four attempts.", "time": "02-16-2017 01:43 PM", "replies": []}]}, {"title": "Why is 3g showing at top when mobile data is not enabled?", "thread": [{"postID": "post5678188", "text": "Hello. I have a normal huawei p9 and I am not sure why at the top the signal bar shows that 3g is enabled when mobile data is off and connected to the WiFi. I have even tried factory resetting and nothing has worked.", "time": "02-14-2017 04:04 PM", "replies": []}, {"postID": "post5678314", "text": "Typically, the g indicates data is off and G indicates it is on.\n3G is just telling you you are on an HSPA network as opposed to LTE or GSM", "time": "02-14-2017 06:20 PM", "replies": []}]}, {"title": "How to take screenshot on Huawei P9?", "thread": [{"postID": "post5270882", "text": "Hi All, how to take a screen shot on Huawei P9?", "time": "07-18-2016 12:02 PM", "replies": []}, {"postID": "post5270930", "text": "Welcome to the forums. Have you already tried pressing simultaneously the volume down and power keys for a second?", "time": "07-18-2016 12:35 PM", "replies": []}, {"postID": "post5270962", "text": "Welcome to the forums!\nI used the Huawei P9 before. Pressing volume down and power at the same time should take a screenshot. On a side note, there should be a Knuckle command for it to do so.", "time": "07-18-2016 12:51 PM", "replies": []}, {"postID": "post5273667", "text": "Try double knock on the screen. The settings are found under motion control. That will do the trick.", "time": "07-20-2016 07:59 AM", "replies": []}, {"postID": "post5277424", "text": "", "time": "07-22-2016 12:27 PM", "replies": []}, {"postID": "post5665456", "text": "Swipe down from the top , you will see shortcuts, screenshots is there", "time": "02-02-2017 12:05 PM", "replies": []}]}, {"title": "Error with Android Device Manager trying to locate phone", "thread": [{"postID": "post5639540", "text": "It says it contacted it... but doesn't ring... I'm wondering if something is needed to be added to 'protected app's under battery manager?\nDoes anyone else have this issue?", "time": "01-11-2017 04:17 AM", "replies": []}, {"postID": "post5640271", "text": "Any power saving modes turned on?", "time": "01-11-2017 03:36 PM", "replies": []}, {"postID": "post5640641", "text": "Power plan is on Smart... will try Performance\nEdit: didnt help", "time": "01-11-2017 10:23 PM", "replies": []}, {"postID": "post5640731", "text": "Does it work in Safe Mode? http://consumer.huawei.com/ca/suppor...a.htm?id=55398", "time": "01-12-2017 01:39 AM", "replies": []}, {"postID": "post5652387", "text": "Doesnt seem to give me an option for safe mode...", "time": "01-22-2017 03:17 AM", "replies": []}, {"postID": "post5652396", "text": "Google is suggesting this is a common problem with Android now :/", "time": "01-22-2017 03:29 AM", "replies": []}]}, {"title": "Where is the Video Call option?", "thread": [{"postID": "post5649539", "text": "Hello,\nI am trying to make a Video Call but for the life of me i cannot find the option to do it?\nIs it hidden somewhere ?", "time": "01-19-2017 01:44 PM", "replies": []}, {"postID": "post5649543", "text": "Welcome to Android Central! I may be wrong, but I thought video calls require the phone to be from the carrier itself, not unlocked, since video calling is a function of the carrier's VoLTE network. You're not talking about Skype or Hangouts, right?", "time": "01-19-2017 01:51 PM", "replies": []}, {"postID": "post5649590", "text": "Hello B.Diddy.\nYes i am talking about the Carrier Video Calls, nope not skype or any other app, i bought the phone unlocked and i am using it in a different country, but i cannot find the option to make a Video Call in the first place !\nShould i be giving Orange(carrier) a call? Or does the mobile itself doesnt support native Video Calls ?", "time": "01-19-2017 02:24 PM", "replies": []}, {"postID": "post5649593", "text": "I confirmed with one of my colleagues -- native video calling from your carrier requires the phone be from the carrier. You could give Orange a call, but I don't think you'll be able to get it on that phone.", "time": "01-19-2017 02:26 PM", "replies": []}, {"postID": "post5649600", "text": "Damn, thanks mate !", "time": "01-19-2017 02:32 PM", "replies": []}, {"postID": "post5649619", "text": "I have just called my Carrier, they informed me that my mobile doesn't support native Video Calling. :/", "time": "01-19-2017 02:47 PM", "replies": []}, {"postID": "post5649734", "text": "Try to convince your friends and family to install Duo, Hangouts, or Skype!", "time": "01-19-2017 04:34 PM", "replies": []}]}, {"title": "Huawei P9 Google Chrome Brightness Dim", "thread": [{"postID": "post5495032", "text": "Hi everyone! So I just got my P9 a few hours ago. I noticed than when I go to my google chrome browser the brightness is dimmer than its normal brightness. When I go back to the homescreen or other application, the brightness is fine. Im not in auto brightness. Do you know a fix for this? Thanks in advance.", "time": "10-15-2016 10:20 AM", "replies": [{"postID": "post5592573", "text": "I have the exact same problem. Chrome just started doing this dimming thing. PLEASE someone, anyone, how can i fix this? This sucks.", "time": "12-04-2016 12:39 PM", "replies": []}]}, {"postID": "post5649598", "text": "You need to set the Battery Power to Performance.", "time": "01-19-2017 02:31 PM", "replies": []}]}, {"title": "Mobile data not always working", "thread": [{"postID": "post5645275", "text": "Hi!\nI purchased a brand new P9 32GB two weeks ago and im really happy with it most of the time. I like to save both battery and money by turning off mobile data and background update for most of the apps, even the system apps and keeping the most important ones on. This works great most of the time but i got a slight problem with it. I have mobile data turned off for Google Play Store. If im on mobile data with wifi turned off and i need a app, i will go into settings to turn on mobile data for Google Play Store. But thats when the strange thing happens.. Mobile data wont work for Google Play Store (or any other app). Its turned on, i open the app but it tells me i need either a wifi connection or mobile data connection. The only way to fix this is to turn on mobile data and background update for every app and restart the phone. My friend also bought the exact same model but from a different store, and he also experienced this problem. The method by enabling all the apps and restarting the phone usually worked for him, but last time it didnt work at all so he had to return it to the store and get a new phone. I've also been in contact with Huawei's customer support but they hadnt even heard of this problem. \nSo im asking here. Does anyone know what could cause this problem?", "time": "01-16-2017 05:58 AM", "replies": []}, {"postID": "post5646153", "text": "Welcome to Android Central! Are you individually selecting apps to Restrict Background Data, or are you doing it universally? If it's universally restricted, then you have to go to that menu and turn off Restrict Background Data. But are you saying that even if you do this, you have to restart the phone to get it to work?", "time": "01-16-2017 09:58 PM", "replies": [{"postID": "post5646445", "text": "You mean Restrict Background Data as in Networked apps > Advanced network management and the Background data tab right? Next to roaming data. If so, i have it turned on for Google Play Store, Huawei Home, Updater, Wi-Fi Direct and Youtube. \nThe problem is that if Mobile Data isnt enabled for Google Play Store, and i want to browse for an app with mobile data on i then turn on Mobile Data for Google Play Store (in the Networked apps section) but it then tells me i have to be connected to Wifi or mobile data when opening the app. I then have to restart the phone for mobile data to work for Google Play Store. So some of the apps works when i enable mobile data for them on the go, and some doesnt.\nOn a iPhone i remember this was flawless. If i had for example Snapchat turned off for mobile data use, i could easily turn on mobile data, then enable mobile data for Snapchat and i would be good to go.\nI just cant figure out whats causing this. Like i said, my friend also had the same problem, but Huawei havent even heard about the problem. And the lack of the response on this thread also confirms that this isnt a common problem.", "time": "01-17-2017 05:42 AM", "replies": []}]}, {"postID": "post5646662", "text": "In that Networked Apps>Advanced Network Management menu>Background Data menu, what exactly does the option say? Can you show us a screenshot? http://forums.androidcentral.com/gen...d-central.html\nI know from my Honor 5X that Huawei firmware tends to be particularly aggressive about battery and RAM management (perhaps to a fault), so this might be a side effect.", "time": "01-17-2017 09:56 AM", "replies": []}, {"postID": "post5646704", "text": "You mean like this?", "time": "01-17-2017 10:26 AM", "replies": []}, {"postID": "post5646811", "text": "Yes, that's the one. So you're saying that you have Background Data checked on for the Play Store, correct? And you're not toggling it off before trying to access the Play Store? Just want to make sure, because I usually see the option as \"Restrict Background Data,\" such that if you turn it on, you're actually turning Background Data off. But in your menu, it looks like toggling that option on turns Background Data on​.", "time": "01-17-2017 11:45 AM", "replies": []}, {"postID": "post5646866", "text": "Correct. Background Data has allways been turned on for Play Store and i dont mess with that setting. As you can see in the screenshot below, im guessing when the checkmark is green the Background Data is on. Default settings turns all the checkmarks green.\nI just cant figure out what is causing the bottleneck since it all works fine when restarting the phone.", "time": "01-17-2017 12:13 PM", "replies": []}, {"postID": "post5646891", "text": "In your OP, you mentioned \"I have mobile data turned off for Google Play Store. If I'm on mobile data with wifi turned off and I need an app, I will go into settings to turn on mobile data for Google Play Store.\" Your phone actually lets you turn on mobile data for specific apps only? I just want to make sure I'm understanding everything correctly, and this isn't referring to background data.", "time": "01-17-2017 12:24 PM", "replies": []}, {"postID": "post5647058", "text": "Thats correct. As you can see here you are able to turn on and off mobile data for system apps and downloaded apps. A smart thing to do to save both battery life and money (can also turn on and off wifi for apps/system apps). I thought this was standard on all phones today.", "time": "01-17-2017 02:20 PM", "replies": []}, {"postID": "post5647138", "text": "No -- on \"stock\" Android on a Nexus device, you can't be that granular. You either keep mobile data on or turn it off. The tweaking by Huawei that was necessary to give you that feature might be why it's a little glitchy.", "time": "01-17-2017 03:34 PM", "replies": []}, {"postID": "post5647148", "text": "Oh really. I didnt know that. I know Apple had it for a really long time, not sure about Android/Huawei though. Used to a own a HTC a couple of years ago and that option wasnt on that. \nAnd yes, it might be a stupid glitch. But a really annoying glitch. And its pretty strange that Huawei hasnt heard about the problem as i doubt im the only one who turns of mobile data for some of my apps. Hopefully this has been worked out in the upcoming update of Android/EMUI.\nThanks for your replies!", "time": "01-17-2017 03:44 PM", "replies": []}, {"postID": "post5647642", "text": "When you called Huawei, did they give you a ticket number, or anything suggesting they'd look into this problem? Or did they just grunt and hang up? Hopefully they're at least filing this as an open ticket.", "time": "01-18-2017 01:19 AM", "replies": []}, {"postID": "post5647725", "text": "Nope. The guy i spoke with was searching through their FAQ and said they didnt have any reports on the problem. Then i had to tell him that maybe i should wait for the new Android and EMUI update because it wasnt going anywhere and he agreed to that. Kinda bad customer support..", "time": "01-18-2017 03:53 AM", "replies": []}, {"postID": "post5648010", "text": "That's about as good as a grunt and hangup. I wouldn't expect them to have a fix or solution immediately, but at least they should acknowledge the issue and let you know that they'll track it.", "time": "01-18-2017 09:51 AM", "replies": []}, {"postID": "post5648510", "text": "Yep, i totally agree. But i'll hold on and wait till new releases and see if they have fixed it, if not i will contact them again and make sure they make a ticket", "time": "01-18-2017 03:50 PM", "replies": []}]}, {"title": "Why I haven't received the password recovery email yet?", "thread": [{"postID": "post5634816", "text": "Hi! I have a huawei P9, and yesterday I forgot my huawei id password, so I clicked on the forgot password option but it doesn't seems to be working because they never send me the password recovery email, what can I do?", "time": "01-07-2017 12:03 PM", "replies": [{"postID": "post5634866", "text": "Been there, done that. Does the company have a customer support number? No guarranty but it is a start. Try repeating your request for the new temp password. Many on line functions are funky and do not work every time.", "time": "01-07-2017 01:22 PM", "replies": []}]}, {"postID": "post5634964", "text": "Oh thanks, ok I'll try that. The other thing is that it gives me the message that my account is suspended because I've tried to log in with an incorrect password too many times. What can I do?", "time": "01-07-2017 03:32 PM", "replies": []}, {"postID": "post5635294", "text": "Welcome to Android Central! Duplicate threads merged.\nHave you already looked here? https://uniportal.huawei.com/uniport..._en.html#FAQ15", "time": "01-07-2017 10:23 PM", "replies": []}, {"postID": "post5643338", "text": "Can you solve your problem with your P9 Huawei? I tave the same problem like you, the huawei system don´t send me the link \"I forgot the password\" to my mail. I called them but they told me that they can't help me, I wrote an email and I am waiting for their answer.", "time": "01-14-2017 06:29 AM", "replies": []}]}, {"title": "Huawei P9 lite Dual", "thread": [{"postID": "post5640880", "text": "Hello everyone! Sorry if that's the wrong place to submit that question but I did not find a sub-forum for that phone. Anyways, I'm about to buy the Huawei P9 lite (even though I'm still kinda worry for the high sar, but I don't talk much on phone so yeah) and more specific, the Dual edition-or at least I wanted so. I don't have a second Sim but here's why I was thinking about Dual phone:\n1. I read that you can not insect a microSd in the Single sim phone (I don't know if that's true)\n2. Just in case that I travel abroad one day, I will have the possibility to keep contact with everybody. Or if my job requires I will have two numbers in one phone. \nSo, I was ready to buy the dual, while I will use it with one Sim card and put in the second slot my microSd for more space. Until I talked my cousin who is in phones and stuff and told me that I will have got many problems like problems in signal so I should never take a dual phone. \nI was wondering if you can help me decide. Thank you in advance.", "time": "01-12-2017 04:59 AM", "replies": []}, {"postID": "post5641389", "text": "Welcome to Android Central! I'm not sure if there is a single SIM version. This review only mentions the dual SIM: Huawei P9 lite review: On a diet - GSMArena.com. Like many other phones these days, the 2nd SIM tray slot is hybrid, so you can either put a 2nd SIM there or a microSD (not both).\nI'm not aware of signal problems with dual SIM phones, but another thing to remember is that the 2nd SIM slot often only supports 2G, not 3G or 4G.", "time": "01-12-2017 01:33 PM", "replies": [{"postID": "post5641537", "text": "Thank you! Yeah there is a single sim phone. :  \nSo what do you suggest me to take?", "time": "01-12-2017 02:52 PM", "replies": []}]}, {"postID": "post5641596", "text": "Oh, sorry about that. But the specs I see here indicate that even the single SIM version has an SD slot: Huawei P9 Lite VNS-L31 - Specifications and Features", "time": "01-12-2017 03:22 PM", "replies": []}, {"postID": "post5641797", "text": "Thank you so much!!!", "time": "01-12-2017 05:52 PM", "replies": []}]}, {"title": "Back up from iCloud", "thread": [{"postID": "post5639062", "text": "Apologies if I'm in the wrong section or repeating a question already covered in a previous thread. \nI just got a P9 and I'm wondering if there is anyway of getting my data from a back-up on iCloud onto my new phone? \nMy iPhone died 2 days ago and a back-up was done the day before that (I think it's about 2.5Gb). I've been able to get my contacts onto my P9, but are my texts/whatsapp messages and photos accessible or are they doomed to the vaults in the clouds? Surely those are my data and there is some way to access them?! \nThanks very much,\nKilian", "time": "01-10-2017 04:47 PM", "replies": []}, {"postID": "post5639165", "text": "You could start with icloud.com You may be able to access your pictures from there. Texts will be a different story, as would Whatsapp.", "time": "01-10-2017 06:18 PM", "replies": []}]}, {"title": "HUAWEI p9. Suspended huawei id account", "thread": [{"postID": "post5634816", "text": "Hi! I have a huawei P9, and yesterday I forgot my huawei id password, so I clicked on the forgot password option but it doesn't seems to be working because they never send me the password recovery email, what can I do?", "time": "01-07-2017 12:03 PM", "replies": [{"postID": "post5634866", "text": "Been there, done that. Does the company have a customer support number? No guarranty but it is a start. Try repeating your request for the new temp password. Many on line functions are funky and do not work every time.", "time": "01-07-2017 01:22 PM", "replies": []}]}, {"postID": "post5634964", "text": "Oh thanks, ok I'll try that. The other thing is that it gives me the message that my account is suspended because I've tried to log in with an incorrect password too many times. What can I do?", "time": "01-07-2017 03:32 PM", "replies": []}, {"postID": "post5635294", "text": "Welcome to Android Central! Duplicate threads merged.\nHave you already looked here? https://uniportal.huawei.com/uniport..._en.html#FAQ15", "time": "01-07-2017 10:23 PM", "replies": []}, {"postID": "post5643338", "text": "Can you solve your problem with your P9 Huawei? I tave the same problem like you, the huawei system don´t send me the link \"I forgot the password\" to my mail. I called them but they told me that they can't help me, I wrote an email and I am waiting for their answer.", "time": "01-14-2017 06:29 AM", "replies": []}]}, {"title": "Huawei P9 Lite- slowspeed", "thread": [{"postID": "post5631739", "text": "I set to view the speed I am getting on the phone... I am subscribe to 10mbps but I was only getting an ave of 300kbps (showed above the phone). I ignored it since I was getting 10mbps on the online speedtest. After I upgrade to VNS...170, The speed gets worse where I only get an ave of 1kbps or sometimes lost the connection at all... Why cant I get the same speed showing on the online speedtest, 10mbps?", "time": "01-04-2017 06:43 PM", "replies": []}, {"postID": "post5633077", "text": "Welcome to Android Central! Is this on mobile data or your wi-fi network? Which online speedtests are you using? What do you mean by upgrading to VNS...170?", "time": "01-05-2017 08:08 PM", "replies": [{"postID": "post5633454", "text": "Hi B. Diddy.. Anyway I am using wifi and the upgrade Im referring to is\nVNS-L31C636B170... I am getting 10mbps o speedtest.net and that's the exact speed of my subscrption.", "time": "01-06-2017 06:22 AM", "replies": []}]}, {"postID": "post5634377", "text": "Is that upgrade for the phone's system firmware or the router's firmware?\nFirst, try rebooting the router by unplugging its power for 10 seconds, then plugging it back in again. If that doesn't help, check your local wi-fi traffic to see if the channel your router is using is congested -- see this guide for more info: http://forums.androidcentral.com/amb...-problems.html", "time": "01-06-2017 11:20 PM", "replies": []}]}, {"title": "My first 2 days with my P9... A Brief review", "thread": [{"postID": "post5528733", "text": "So I unboxed my P9 nearly 2 days ago now.. and.. I like it.. alot, so heres just a short trivew so far: \nWho needs a 2k screen on phone, seriously and when using the P9... I really cant tell Im using a 1080p screen.. its so crisp and clear and really bright.. great colour depth and rich reds and blues.... I cant comment on battery yet.. but ill add it at a later date.. \nAs Ive only unboxed my P9, the shots ive taken have all been on AUTO, SOO.. the camera is not as DSLR amazing as Huawei claim it is.. but its very good, nice and crisp if a little lifeless and flat on a dull day (Like today).. its on a par with the S6 edge, amd the G4.. but not quite the G5... however, that said.. it has so many settings to tinker and experiment with, its possible to make alot of changes... It doesnt have OIS.. but I dont think it needs it, the EIS or DIS.. does a fantastic job... out of 21 photos.. I only lost 3 to camera shake, and even then.. it was my own fault\nSadly, the P9 only has a 1.25 micro pixel size, compared to the S7E, 6P and G5.. which have a 1.55 micron, which means the P9 cam detail does suffer a little when being heavily cropped in that being said,, I really like the camera as it can deliver some truely stunning shots.. but sometimes a softer image is what looks the best.. not every photo has to be super crispy.. especially in macro or candid photography... So, well done, Huawei.. you made a good one.. keep it up.. Unfortunately, YouTube has everyone going hysterical and slamming Devs if you cant read a car number plate Cropped In 1000x from half a mile away with your latest camera on your phone..\nLoud voices in phone calls, Build quality is beautiful.. much nicer and sexier than a Samsung... The single speaker is surprisingly good and quite full sounding..nice and loud for RingTones... its on a par with the G5.. Headphone Audio is eally great using Sennheiser 422s and LG Quadbeat 3s, loud and punchy.. plenty of depth and instrument separation, but can struggle in choral works.. playing Def Leppard, Bee Gees, Mark Knopfler, Vangelis and Franz Lizst \"Missa Choralis\", and with it having an SDCard.. you can rip in flac...\nTBH... Theres not alot wrong with this phone at all.. so far... yes there was too much hype made about the \"Amazing\" camera.. which is truely great, but wont replace my Canon DSLR quite yet.. but the fantastic audio side, stunning 1080p screen, awesome build quality and, IMO, interesting EMUI 411 make it a pleasure to use.", "time": "10-27-2016 04:12 PM", "replies": []}, {"postID": "post5528879", "text": "Enjoy! \nThe camera takes a little getting used to to figure and get good results but is worth the effort IMHO.", "time": "10-27-2016 05:32 PM", "replies": []}, {"postID": "post5569479", "text": "hi, i want to ask you few questions about the p9, because i want to buy a new phone and i read some bad comments about the max vol on headphones, its true? i mostly play rock- electronic music and what can you say about the signal strenght from the wifi and 4g antenna?. \nThx, and excuse me for my bad english hehehe.", "time": "11-18-2016 05:21 PM", "replies": [{"postID": "post5575601", "text": "I'm in UK with a UK L09 running B182 stock firmware and not Rooted and I find the Wifi great. I have a TPLink 750 router and live in a fairly large house and still get a great signal.. no dropouts or disconnects...\nYour 4G signal depends on your carrier... I'm with O2 UK and I can get the new 4G+ no problem with all 4 or 3 signal bars, So IMO... the Antennas are really good on my P9 and I'm very happy with it.. In fact apart from my Lumia 950 XL, the P9 is one of the best phones Ive owned for signal strength\nMusic Volume is loud.. You don't need max volume on the P9, but I don't get any signal breakup or distortion when I play Loud.. about 85 - 90%.. I use Sennheiser HD432s for serious listening and LG Quadbeat 3 buds for outdoors and both are really great IMO. no issues..\nIde buy the P9... I love mine.. camera is amazing (beats S7E IMO), I'm happy I changed my 6P", "time": "11-22-2016 04:06 PM", "replies": []}]}, {"postID": "post5584406", "text": "I find the sound great on my P 9 lite 4 weeks old.\nI listen to a lot of audio on podcasts and at the moment the experience is as good if not better than the iPhones and Samsung note2 I have had in the past.\nI do have an issue when connecting to my speakers in the car with a jack plug. Not with loudness but with the connector. This may be isolated to my phone, I am in the process of finding out.", "time": "11-29-2016 04:01 AM", "replies": []}, {"postID": "post5587474", "text": "I hear a lot of music on my smartphones and I like them to have a loud and bass-rich sound.\nHow does the P9 behave in terms of sound quality with headphones? Does it have an equalizer?", "time": "11-30-2016 09:00 PM", "replies": [{"postID": "post5634257", "text": "Sorry for the 5 week late reply.. Yes,, it has an EQ., its got a nice punchy sound and audio.. but that can depend on your headphones, I would highly recommend buying the P9.. you wont be dissapointed", "time": "01-06-2017 07:58 PM", "replies": []}]}, {"postID": "post5587494", "text": "So glad you are liking your P9! It's a great device!", "time": "11-30-2016 09:19 PM", "replies": []}]}, {"title": "Move Lockscreen clock", "thread": [{"postID": "post5634225", "text": "Just got my New P9 on O2 UK today, which Iam happy to say looks unbranded. \nIve just updated to the latest OTA B190 build.. but the clock on the lockscreen is at the top centre.. just like every other ugly Android lockscreen..\nIs there any way to change it back to the bottom left corner, which looks nicer and kinda reminds me of my old Windows Phone\nThanks", "time": "01-06-2017 07:04 PM", "replies": []}]}, {"title": "P9 lite RAM and storage question", "thread": [{"postID": "post5632130", "text": "Hi guys, so I have Huawei P9 lite. In specs it claims to have 2gb of ram and 16 gb of internal storage. However when i use app switcher or whatever it's called it shows only about 750-800 mb of free ram space (with no apps running) and when i go to „about phone” section and internal storage it also shows like 8.00/10.00 gb used, meaning that storage has only 10, not 16 gigs. So main question is, where my ram and storage space goes? Is it bloatware that eats it or what? (I'm new to huawei  ) Thank you for answers.", "time": "01-05-2017 03:56 AM", "replies": []}, {"postID": "post5632163", "text": "My Lenovo vibe x2 also has the ram problem, same 2gb ram, only around 600-700 MB available even without any apps on.\nAbout storage, the 6GB ur missing goes in all the default apps and the Android software.", "time": "01-05-2017 05:17 AM", "replies": []}]}, {"title": "Bug report won't complete", "thread": [{"postID": "post5622630", "text": "Hi, Could someone please help me with this. I'm trying to run a bug report on a Huawei p9 lite, but when I press report nothing happens. I don't get any notification. Thanks, Craig", "time": "12-27-2016 12:50 PM", "replies": []}]}, {"title": "Unable to mute notification sound", "thread": [{"postID": "post5614459", "text": "I just got the p9. I find that I'm unable to turn off the notification sound for mail received etc. I do not want to put the phone in the silent mode. Please help, as the sound is driving me crazy", "time": "12-20-2016 02:16 AM", "replies": []}, {"postID": "post5616915", "text": "Welcome to Android Central! What if you open the Email app, tap Menu>Settings, select the email account, and look for the notification options there? You can usually set the tone to \"Silent\" or \"None.\"", "time": "12-21-2016 11:25 PM", "replies": []}]}, {"title": "how to upload an album on my home screen", "thread": [{"postID": "post5612311", "text": "i am new to Huawei P9 & i accidently deleted an icon on my home screen. i go to settings-home screen style & i can see \"choose an album\" but how do i upload it. Kindly assist. TQ", "time": "12-18-2016 10:21 AM", "replies": []}, {"postID": "post5612535", "text": "Welcome to Android Central! What kind of icon are you talking about? An app shortcut icon would be different from a photo album.", "time": "12-18-2016 01:40 PM", "replies": []}]}, {"title": "P9 backup to computer", "thread": [{"postID": "post5610945", "text": "Hello\nId like to back up my contacts to my desktop PC please. \nI do NOT wish to use any of the cloud backup or sync services. \nIs there a way to do this please. I have the Huawei P9 phone and a Windows 10 desktop. \nIdeally wanting to do a backup file on the computer from which i can do future restores if needed, otherwise sync to Outlook would be better than nothing. \nThanks", "time": "12-17-2016 05:52 AM", "replies": []}, {"postID": "post5611253", "text": "Can you use google to do it.", "time": "12-17-2016 11:59 AM", "replies": [{"postID": "post5612016", "text": "The OP specifically stated a preference not to use the cloud.\nOpen your Contacts app, tap Menu, and look for an Import/Export option. Select that, and choose Export. You should be able to export your contacts as either a .CSV file or a multiple .VCF file, which can then be copied to your computer.", "time": "12-18-2016 02:35 AM", "replies": [{"postID": "post5612038", "text": "Great stuff. Thank you", "time": "12-18-2016 03:45 AM", "replies": []}]}]}]}, {"title": "Is it it normal that the Huawei p9 makes a 'mechanical' sound every time de camera app launches?", "thread": [{"postID": "post5609186", "text": "I have just bought the Huawei p9 and I'am surprised at the subtle noise it makes everytime the camera launches. It is not the shutter sound when taking a picture, it is a sound when you launch the camera app, it also happens with other apps when you launch the camera from within (facebook) but not with all (not with whatsapp). Is this sound normal?", "time": "12-15-2016 03:43 PM", "replies": []}, {"postID": "post5609248", "text": "Mod note. Thread moved to the Huawei P9 forum for more visibility.", "time": "12-15-2016 04:26 PM", "replies": []}, {"postID": "post5611414", "text": "All Chinese stuff makes a noise", "time": "12-17-2016 02:19 PM", "replies": []}]}, {"title": "File management on P9", "thread": [{"postID": "post5592124", "text": "I want to use the internal memory for apps,... (System based stuff) But I want to use the MicroSD card for all data. (Photo's, Music, Podcasts, Documents,...) A bit like a desktop environment.\nIn settings -> advanced settings -> memory and storage -> standard location: I switched it to the MicroSD card. (Note the menu route is a translation of the settings)\nBut I'm a bit worried I didn't need to do that because now I have a Android, LOST.DIR,... folder on MicroSD card. Is my system running on the MicroSD now?\nWhat is the correct setting for what I want to do? \nThanks for the help!", "time": "12-04-2016 03:33 AM", "replies": []}, {"postID": "post5592951", "text": "Welcome to Android Central! No, the system won't run off the SD card. Any time you insert an SD card in an Android device, it will create an Android directory (which the system will use to save certain non-crucial bits of data) and a LOST.DIR directory (which is where broken files get stored, in case you have to try recovering them).", "time": "12-04-2016 06:33 PM", "replies": []}, {"postID": "post5593433", "text": "Ah so I did need to switch the standard location as I did? \nWill app's still be installed on the P9 or will they be installed on the MicroSD?", "time": "12-05-2016 06:10 AM", "replies": []}, {"postID": "post5593968", "text": "When you switch the storage location, that's only for files you download, and possibly for apps to store data (but not to save the actual app files). If you go to Settings>Apps and select an app, then tap Move to SD, that will move part of the app itself to the SD (but not the whole thing). The only way for an entire app to be installed to the SD is if you're on Marshmallow or above, and are able to format an SD card as Internal Storage (i.e., Adoptable Storage).", "time": "12-05-2016 12:56 PM", "replies": []}, {"postID": "post5593975", "text": "That's great! System and storage separated. Exactly how it seems right for me.", "time": "12-05-2016 01:01 PM", "replies": []}]}]
[{"title": "Unable to log in to email on Huawei p9 lite", "thread": [{"postID": "post5590342", "text": "I can't log in to my hotmail account on my huawei, the error message says something about the POP3 or something not being set up but I can't find anything on my settings to enable that.", "time": "12-02-2016 05:15 PM", "replies": []}, {"postID": "post5590621", "text": "Welcome to Android Central! Try opening the email account, go to its settings, select the Hotmail account, and remove it. Then go through the process of adding it back again.", "time": "12-02-2016 09:58 PM", "replies": []}]}, {"title": "How to film video", "thread": [{"postID": "post5581765", "text": "Hey. I have a P9. Loving the quality of still photos with the Leica camera. \nHow do i film video please?", "time": "11-27-2016 04:32 AM", "replies": []}, {"postID": "post5582842", "text": "Look at pg 90 of your manual: 【HUAWEI P9】 - Huawei Mobile Phones - Huawei Official Site You can download the manual at the bottom of this page, under Manuals.", "time": "11-28-2016 12:04 AM", "replies": [{"postID": "post5590338", "text": "Thanks. This doesnt work for me sadly. \nI can press the red circle but it doesnt change into a red square", "time": "12-02-2016 05:12 PM", "replies": []}]}, {"postID": "post5590441", "text": "When you open the camera app and swipe right, does it at least get to the video camera mode correctly?", "time": "12-02-2016 07:14 PM", "replies": []}]}, {"title": "Hot spot working on the connected device, but disconnect my phone from internet", "thread": [{"postID": "post5588744", "text": "when i use the wifi hot spot, the conncted device IE my laptop is able to connect the internet, but then, i cant surf through my phone at the same time. its like i only have a connection on my laptop, and doesnt have one on my phone.\nit doesnt let me connect to whatsapp web etc cuz my phone doesnt have internet O_o\nsomeone had this problem before?", "time": "12-01-2016 03:52 PM", "replies": []}, {"postID": "post5588751", "text": "Please continue with your earlier thread here. http://forums.androidcentral.com/ask...ml#post5588742\nThanks", "time": "12-01-2016 03:59 PM", "replies": []}]}, {"title": "Airplane mode. Is it good for the Cinema", "thread": [{"postID": "post5584405", "text": "P9lite.\nI am in the habit of switching of my phones when at the cinema. After the film I switch back on but I now wonder about airplane mode. Is this just as good. No reminders, no calls, no alarms and no alerts. Am I correct? Thank you.", "time": "11-29-2016 03:56 AM", "replies": []}, {"postID": "post5585472", "text": "Welcome to Android Central! Airplane Mode is fine, but reminders and notifications from apps that don't require an active web connection will still occur, so you'd still want to turn the volume to silent or vibrate only.", "time": "11-29-2016 03:49 PM", "replies": []}]}, {"title": "Phone wont connect to car through jack-stick", "thread": [{"postID": "post5499469", "text": "My phone wont connect to my parents car through jack-stick. It just keeps playing from the phones speakers istead of the cars. The cars is a citroen c4 Picasso.", "time": "10-17-2016 10:17 AM", "replies": []}, {"postID": "post5501535", "text": "Welcome to Android Central! Are you talking about using an aux cable to connect the phone's headphone jack to the phone's aux port? Or are you talking about a USB connection?\nIf you're using an aux cable, make sure that (a) the car's input is set to Aux, and (b) the phone's volume is turned up to max (you can still adjust the volume using the car's volume control).", "time": "10-18-2016 04:11 AM", "replies": []}, {"postID": "post5501699", "text": "Thanks! Yes i am talking about the aux to aux cable and not a usb connection. The cars input is set to aux, and the phones is also set to max volume but it doesn't really connect to the car since the phone keeps just blasting music out its own speakers and doesn't act like it is hooked up to something through the headset Jack. Very odd", "time": "10-18-2016 05:52 AM", "replies": []}, {"postID": "post5504036", "text": "Try using a different aux cable.", "time": "10-18-2016 10:19 PM", "replies": []}, {"postID": "post5584382", "text": "I have a similar problem. P9 lite. I have tried two sets of connectors. I have to carefully insert the jack in the phone and gently place it down. Any movement and the sound comes out of the phone. It is as if the jack is too small for the phone and moves about! I use ear buds a lot and don't have the same issue.", "time": "11-29-2016 03:09 AM", "replies": []}]}, {"title": "Huawei P9 stuck at first startup (2+ hours)", "thread": [{"postID": "post5581188", "text": "So I went to a Vodafone store today to buy a new phone and i got the Huawei P9 Lite model. We started it up there and it demanded a change on the system to change to Vodafone compatible mode, and after that, the phone has been stuck for more than two hours on a black screen with a logo that says \"EMUI\" surrounded by a black circle. \nI don't want to do anything about that without knowing that what i'll do is 100% safe. What solutions do I have to this problem? Thanks in advance!", "time": "11-26-2016 03:22 PM", "replies": [{"postID": "post5581365", "text": "1- Take it back to where you bought it and ask for a refund or exchange.\nYou're welcome in advance.", "time": "11-26-2016 06:19 PM", "replies": []}]}, {"postID": "post5581784", "text": "You sure there's no other way to do that?", "time": "11-27-2016 05:06 AM", "replies": []}, {"postID": "post5582014", "text": "Yes. that is the safest solution.", "time": "11-27-2016 09:52 AM", "replies": []}]}, {"title": "Android Pay No Longer Working on Huawei P9", "thread": [{"postID": "post5438732", "text": "Hi Guys, just a query to see if anybody else has had a similar issue and if they found any solution without going down the flash/rooting route. \nI have recently received my device back after a screen repair by Huawei and now the Natwest banking app no longer lets me log in with fingerprint and Android Pay no longer allows any use whatsoever.\nI have had a bit of dig around the internet and discovered that it is an issue with the CTS Profile Match returning as False and thereofre not adhering to Android security standards.\nBit more info I have build number EVA-C900B166 EMUI 4.1 and Android 6.0\nHas anybody else had the same issue and managed a to resolve it without getting too technical and flashing/rom'ing or is this a matter of waiting on Huawei to admit it is an issue and resolving from their end?", "time": "09-22-2016 09:15 AM", "replies": []}, {"postID": "post5581766", "text": "I didnt understand most of this but i also have a thread here about android pay issues. \nDid you get sorted?", "time": "11-27-2016 04:34 AM", "replies": []}]}, {"title": "Android game doesn't start on P9", "thread": [{"postID": "post5576691", "text": "Even if I follow the stept to start the game, after the last long press on the logo, instead of starting the game, the phone gets back to the device info section in settings.", "time": "11-23-2016 08:57 AM", "replies": []}, {"postID": "post5576745", "text": "Welcome to the forums. Did you get the game off the Play store or was it sideloaded?", "time": "11-23-2016 09:31 AM", "replies": []}, {"postID": "post5576965", "text": "I didn't get the game from anywhere, I just got the phone. I had another phone before and I didn't have to do anything but to start it from them version menu.", "time": "11-23-2016 11:47 AM", "replies": []}, {"postID": "post5577345", "text": "I think I know what you mean...the game that's like Flappy bird? That was an Easter egg, and only for 5.0 as I recall.", "time": "11-23-2016 04:37 PM", "replies": []}, {"postID": "post5577922", "text": "yes, that game is like flappy bird, but i also had it on a sony and a samsung that had aldo android 6. do you have a p9? can you try to start the game? thanks man!", "time": "11-24-2016 03:18 AM", "replies": [{"postID": "post5578188", "text": "It might have been Marshmallow, I can't really recall. As for owning a P9, I do not.", "time": "11-24-2016 09:07 AM", "replies": []}]}]}, {"title": "Contact Photos", "thread": [{"postID": "post5568241", "text": "No contact images when receiving incoming calls", "time": "11-18-2016 03:19 AM", "replies": []}, {"postID": "post5568820", "text": "Welcome to Android Central! Are those incoming phone numbers part of the contacts that are saved to your device or to your Google Contacts?", "time": "11-18-2016 11:06 AM", "replies": []}]}, {"title": "P9 plus from china, google play store not working", "thread": [{"postID": "post5559552", "text": "Hi there, my nephew was presented with a huawei p9 plus over in china. As he is an iphone user he gave it to me. Its 64gb vie-al10.\nI changed the language to english but a lot of the chinese stuff remained. I then did a restore of my honor 6 plus and it kinda worked with the exception of google play store and play services, they wont run so music, video,books etc wont run either. Can i do anything to turn this into a uk model?. I have tried various apks of google play services to no avail. Also what is android infineon balong-ril 1.0 ? . have never heard og it. Build number is vie-al10c741b180.\nOs version M(6.0)\nAny help appreciated.", "time": "11-12-2016 11:32 AM", "replies": []}, {"postID": "post5559605", "text": "Go to the HiStore if it is present and search for \"Google\".\nThe first banner should show a list of Google apps when tapped. Install them and change some permissions so that they run without much issue.", "time": "11-12-2016 12:11 PM", "replies": []}]}, {"title": "Can't here caller when they call me.", "thread": [{"postID": "post5550361", "text": "Hi there. I've just had my P9 and although when I call someone there are no problems when anyone calls me we cant hear each other. I've looked in settings and I can't find anyrhing I can change, so womdering if its a fault with the phone. I rebooted yesteday and that seemed to work for a while, however it's gone back to not working again.", "time": "11-07-2016 02:47 AM", "replies": []}, {"postID": "post5550993", "text": "Welcome to Android Central! Try booting into Safe Mode, which temporarily disables all 3rd party apps. http://consumer.huawei.com/ca/mobile...a.htm?id=55398\nIf the problem disappears in Safe Mode, then something you installed is causing the problem. You may have to uninstall apps one by one until the problem disappears. If the problem persists in Safe Mode, then it's more likely to be a hardware or firmware problem.", "time": "11-07-2016 10:48 AM", "replies": []}]}, {"title": "P9 Cannot disable pin number", "thread": [{"postID": "post5548781", "text": "Hi all , I've had a Huawei P9 for a few weeks now and I love it but recently while installing the Android pay app it had asked me for a pin number. After a short while I had noticed the phone kept asking me for a pin code ( not SIM pin or SD card pin by the way) everytime after screen unlock or after turning it on. I've been into settings , been into various sections of the security features and I cannot see an option to turn the pin off at all. I've even googled it but cannot find a solution. Anyone else encounter this issue. #help", "time": "11-06-2016 08:20 AM", "replies": []}, {"postID": "post5549860", "text": "Is the phone encrypted? If the phone doesn't come encrypted by default (like the Nexus 6P, for example), and if you chose the option to encrypt it at some point, that usually makes a PIN or password mandatory.", "time": "11-06-2016 07:15 PM", "replies": []}, {"postID": "post5550570", "text": "Take a look here, probably it can help you http://forum.xda-developers.com/show...php?p=68877517", "time": "11-07-2016 07:40 AM", "replies": []}]}, {"title": "Huawei P9 sound problem", "thread": [{"postID": "post5453871", "text": "I don't know if this is the right place to ask this, but I'm gonna try it. Whenever I open an app on my phone with the sound on, it just plays the sound as loud as the slider is, BUT then when I tap the screen, the volume of the sound lowers substantial. The slider will still stay at the same place. I hope you guys can help me!", "time": "09-29-2016 08:23 AM", "replies": []}, {"postID": "post5454303", "text": "Welcome to Android Central! Does this happen in Safe Mode? http://consumer.huawei.com/ca/suppor...a.htm?id=55398", "time": "09-29-2016 12:06 PM", "replies": []}, {"postID": "post5454797", "text": "Hey! Thanks for your reply! I can't use my apps in safe mode, and it's changing the sound (as far as I know) in youtube or for that matter any video app or on any video. It doesn't even appear in every (for instance) game I try. Some games lower the volume after tapping and others don't (I think).\nI've only had this phone for 2 days now and it's my first Android, so I don't really know how to use this haha.", "time": "09-29-2016 03:35 PM", "replies": []}, {"postID": "post5455227", "text": "There still should be some video apps you can use in Safe Mode. If YouTube was preinstalled, it should work in Safe Mode. Otherwise, what if you play a video file using the stock video player?", "time": "09-29-2016 07:20 PM", "replies": [{"postID": "post5455715", "text": "Damnit I'm sorry, I meant to say it doesn't happen in video apps as far as I know.\nEDIT: okay so i found out that it also happens in youtube. Also in safe mode. So appareantly it happens in every app (except pokemon go it seems).", "time": "09-30-2016 02:44 AM", "replies": []}]}, {"postID": "post5457098", "text": "That suggests it's a problem with either the firmware or hardware. I'm not sure how easy it is to reinstall the firmware--a quick search on Google didn't come up with any straightforward process. Ultimately, you may need to contact Huawei about it.", "time": "09-30-2016 06:23 PM", "replies": []}, {"postID": "post5458714", "text": "If you mean a factory reset I know how to do that", "time": "10-01-2016 08:00 PM", "replies": []}, {"postID": "post5458994", "text": "No--factory reset isn't quite the same as reinstalling the firmware. A factory reset will use the firmware that is currently installed on your phone, and revert it to factory settings--but if the firmware is corrupt, then you won't be fixing the underlying problem. Reinstalling the firmware puts a fresh uncorrupted copy of the firmware on the phone.", "time": "10-02-2016 12:55 AM", "replies": []}, {"postID": "post5459105", "text": "Oh, well I have no idea how to do that. I spoke to Huawei staff twice, one said it's the hardware, and the other the software. I searched a little more on youtube and found a video with the same problem. He said to wait for a later buildnumber than me, which the Huawei staff also said. So I guess I'll wait for a week or 2.", "time": "10-02-2016 04:13 AM", "replies": []}, {"postID": "post5544902", "text": "UPDATE: the update released a few days ago, installed it and the problem is gone. Thanks for your help!", "time": "11-04-2016 05:55 AM", "replies": []}]}, {"title": "How can i transfer my apps to SD card Huawei p9 lite", "thread": [{"postID": "post5474016", "text": "Hello,\nI've recently bought a P9 Lite which, I think, software side it should be the same as a P9, so Android 6.0 with EMUI 4.1. Since the storage isnt' that much (16 GB), I've bought a 32 GB Micro SD card but I'm having a hard time understand how the system handles it.\nBy default, I've noticed that, when I inserted it, the phone has automatically started to save some things on it, like pictures and videos taken with the camera. However, some other things, like apps or offline maps by Google, are still saved on the main memory.\nIn the phone settings I've found an option to switch, as main memory, from the internal one to the SD Card, but Huawei doesn't clear explain what this option really do. I only get a warning to pay attention to my data since the internal memory is encrypted, while the SD no.\nIs there someone that can help me to understand the real meaning of this option?\nThanks!\nBest", "time": "10-07-2016 11:42 PM", "replies": []}, {"postID": "post5474035", "text": "I'm not a fan of putting apps onto sd cards myself, you only get some of the app on the card, the guts of it stays on the device anyway. And with your encrypted phone vs unencrypted card you are setting yourself up for grief I reckon. Put your media on the card and leave the apps in device is what I'd do. No doubt you'll get more feedback here from other more knowledgeable peeps than myself tho....", "time": "10-08-2016 12:01 AM", "replies": []}, {"postID": "post5474109", "text": "do you have any idea how can i move the app to sd card ? or is it possible on my huawei p9 lite ?", "time": "10-08-2016 01:13 AM", "replies": []}, {"postID": "post5477782", "text": "Welcome to Android Central! My guess is that the option you mention will change the default data storage and download location to the SD card instead of internal storage--but this is only for data files, and not for app installation. The ability to move an app to SD depends on the phone (as well as the app itself), so if you go to Settings>Apps, select apps, and don't see a Move to SD button, then it's not possible (either on the phone, or for that app). Moreover, moving an app to SD only moves a portion of the app (and often a relatively small portion), so your internal storage savings my not be that much.", "time": "10-09-2016 03:52 PM", "replies": []}, {"postID": "post5530176", "text": "Duplicate threads merged.", "time": "10-28-2016 09:34 AM", "replies": []}]}, {"title": "P9 autofocus", "thread": [{"postID": "post5505507", "text": "Hi, guys. I need some help. I have P9, EMUI 4.1, EVA-L19, from two months. Today i notice somenthing strange. When i shooting with b/w camera automatically appear the white circle in the middle of the screen. It became yellow when the camera focused. When i shooting with color camera this circle do not appear. The camera autofocusing. All is normal, but do not indication for that. It appear when i zoom... When i hide the b/w camera with finger in color camera mode without zoom the white ring appear on screen. Is it normal ? I am worring that may i have camera problem?\nP.s. I try to reset the phone and clear registry of the camera but the problem is as i describe above.", "time": "10-19-2016 12:03 PM", "replies": []}, {"postID": "post5528765", "text": "Are you talking about the focus ring.. You do know that when \"touch to focus\" on the camera viewfinder, it manually focuses and the focus ring turns orange to tell you its now focused..\nOr do you mean the orange ring appears on your photograph itself... \nPlease post an image example", "time": "10-27-2016 04:28 PM", "replies": []}]}, {"title": "Huawei P9 Plus MMS Not Working", "thread": [{"postID": "post5522634", "text": "Hello:\nI just bought a Huawei P9 Plus with T-Mobile service in US. However, I can't make MMS work no matter how I change the settings for APN (Access Point Names).\nAnybody can help?\nAnother issue might be related but I am not sure. When sending text to recipients I have to add \"1\" to the front of the phone number. For example, instead of using 8885482934 I have to use 18885482934 instead. Otherwise I get \"Invalid recipient\" error.\nBut making phone calls without 1 in the front works fine.\nRegards,\nNewman", "time": "10-25-2016 12:25 PM", "replies": []}, {"postID": "post5522693", "text": "Mms are network enabled. Call the carrier and ask them to enable your mms service...", "time": "10-25-2016 12:42 PM", "replies": []}]}, {"title": "Huawei P9 Lite Screen Flickering", "thread": [{"postID": "post5508212", "text": "I bought a HUWAEI P9 Lite phone on the Rome (Italy) in the Leonardo Da Vinci Airport and unfortunately as we removed it from the box and start using it, the screen started to show large flickering on the bottom and central part. The flickering consists of a total change on the pixels and transforms the screen to total ineligibility. The phone appears to continue to work and the touch functions are working.\nThe flickering somehow seems to reduce when displaying simple grey interfaces (e.g. control panel is sometimes legible) as shown in the image below \nhttps://s21.postimg.org/fjmnjt8s7/p9lite_1.png\nNeedless to say that I tried to restarted and even doing a hard reboot. I managed to great pains to try to perform an update but with no change. \nAnyone saw this or has any suggestions to solve this ?\nbest regards", "time": "10-20-2016 09:48 AM", "replies": []}, {"postID": "post5510672", "text": "this is horrible. This never seems to be a software issue. Better contacting your nearest service center may help you.", "time": "10-21-2016 05:23 AM", "replies": []}]}, {"title": "Unable to make or receive calls", "thread": [{"postID": "post5501671", "text": "For maybe the last week i have been unable to make or receive calls.\nI get an error msg 'Mobile Network not available'\nI have network bars.\nI have data and wifi usage\nNo area network issues\nVodafone UK have advised that they can see the SIM and no issues, no barring on the account\ni have rebooted and done factory resets\nI have put the sim in another handset and it worked.\nHas anyone else had this issue or have suggestions on how to resolve?", "time": "10-18-2016 05:26 AM", "replies": [{"postID": "post5501734", "text": "Well my first thought was the SIM card, but I guess you have ruled that out.\nSo 2 options, Factory reset, which I doubt will work. \nOr bring it into a store and have them test it\nAt least rule out an actual network issue", "time": "10-18-2016 06:19 AM", "replies": []}]}, {"postID": "post5505381", "text": "Seems the handset has been blacklisted by my provider", "time": "10-19-2016 11:27 AM", "replies": [{"postID": "post5507320", "text": "Typically that only happens if it's been reported as stolen? Did you buy it used?", "time": "10-20-2016 12:45 AM", "replies": []}]}, {"postID": "post5507471", "text": "It was boxed and wrapped still, apparently an unwanted upgrade.\nSo best guess, its stolen or an insurance job, either way im chasing the seller but not holding my breath.", "time": "10-20-2016 03:21 AM", "replies": [{"postID": "post5510224", "text": "I have heard of legit sounding companies reboxing bricked phones, and even rewrapping them. Was it a business or just some independent seller?\nI wish you all the best on that one! Go get um!", "time": "10-20-2016 10:14 PM", "replies": []}]}]}, {"title": "Huawei P9 screen protection", "thread": [{"postID": "post5449746", "text": "Hi has anyone found a good screen protector for the Hussein P9 like a tampered glass? I've got a slight crack in my screen already..", "time": "09-27-2016 09:43 AM", "replies": []}, {"postID": "post5450026", "text": "Mod note. Moved to the Huawei P9 forum for more visibility.", "time": "09-27-2016 12:08 PM", "replies": []}, {"postID": "post5502147", "text": "you can return phone, Huawei offer 3 month guarantee on screen even if its your fault", "time": "10-18-2016 09:51 AM", "replies": []}]}, {"title": "How can I get my Huawei P9 to sound notifications all the time?", "thread": [{"postID": "post5474266", "text": "At night if my P9 is left plugged in charging, it will sound all notifications that I have given permission to via battery settings (protected apps).\nIf however the P9 is NOT plugged into the wall, after a period of time no notifications sound. I imagine it goes into a type of deep sleep mode after not being used.\nHow can I keep the P9 sounding notifications 24 hours a day regardless of being plugged into the wall or not?\nThanks for your help - am new to Android.", "time": "10-08-2016 04:42 AM", "replies": []}, {"postID": "post5477895", "text": "Welcome to Android Central! Are any other power-saving modes turned on, or do you have a 3rd party battery saver app installed?", "time": "10-09-2016 04:31 PM", "replies": []}, {"postID": "post5487336", "text": "Thanks very much for responding. I don't have a 3rd party battery saver app. Equally the apps I want to sound off I've put them as \"protected\". \nI have even chosen within Battery manager Performance and not \"Smart\" or \"Ultra\" - but the mobile seems to go back to 'Smart' on its own.\nMaybe I'm not selecting or saving something correctly.\nAll in all, I need a few apps to ring no matter what time of the day it is.", "time": "10-12-2016 02:50 PM", "replies": []}, {"postID": "post5488049", "text": "The issue might be the fact that the power plan keeps reverting to Smart (and in my experience, anything on a phone that's called \"Smart\" is often not  ). Check to see if other P9 users are having this issue as well, or contact Huawei about it.\nAlso, see if the problem persists in Safe Mode: http://consumer.huawei.com/ca/mobile...a.htm?id=55398", "time": "10-12-2016 08:01 PM", "replies": []}, {"postID": "post5494793", "text": "Thanks! Yes you're absolutely right. Everytime I optimize the mobile the smart mode for the battery is activated.\nI've tweeted the issue to @HuaweiMobiles - I'll share what they come back with.", "time": "10-15-2016 08:36 AM", "replies": []}, {"postID": "post5495209", "text": "Is there some sort of Optimize button? If so, that's what you have to avoid. Huawei devices can be pretty aggressive when it comes to \"optimization\" and \"boosting,\" so if you see notifications that you haven't \"optimized\" your phone in n days, just ignore it -- there shouldn't really be any need to \"optimize\" an Android device.", "time": "10-15-2016 12:05 PM", "replies": []}, {"postID": "post5497459", "text": "Ok - thanks! I regularly get notifications to optimise - I thought it was necessary - I'll ignore from now on in", "time": "10-16-2016 01:14 PM", "replies": []}, {"postID": "post5497849", "text": "Yep, I see that too on my Honor 5X. Swipe away!", "time": "10-16-2016 04:38 PM", "replies": []}]}, {"title": "Images / videos disappear after few days?", "thread": [{"postID": "post5445006", "text": "Hi.\nDoes anyone have the problem of having your pictures and videos disappearing after few days?\nI saw Auto cleanup function was on, so I turned it off in Storage Cleaner's setting.\nIs there anything else I'm missing here to address the issue (except bug or that sort of stuff) and\n(If my assumption is correct) Is there an option to exclude pictures from the auto clean up?\nI've had already three times my pics disappeared and I'd really appreciate your help.\nThank you so much.", "time": "09-24-2016 08:57 PM", "replies": []}, {"postID": "post5445249", "text": "Welcome to Android Central! Are they saving to Internal Storage or the microSD card? Have you checked the actual /DCIM/Camera directory (using a file manager app) to see if the photo files are still there, or are you only using a Gallery app to look?", "time": "09-24-2016 11:38 PM", "replies": []}, {"postID": "post5496261", "text": "Hi Diddy!\nThanks for your reply and sorry for my late one. \nYes, I've checked using other app (ES File explorer) but all pix and videos were gone.\nBut ever since I stopped using \"Phone manager\" the issue hasn't been occurred.\nHasn't understood how to change setting not to delete image/ video while clean up, though...", "time": "10-15-2016 09:47 PM", "replies": []}, {"postID": "post5496672", "text": "Hopefully that keeps the problem away! I never trust these manufacturer-installed \"phone manager\" or \"phone optimizer\" apps. They're often based on or similar to Clean Master, which is notorious for causing more problems than it claims to solve.", "time": "10-16-2016 03:39 AM", "replies": []}]}, {"title": "Camera \"sharpening image\"?", "thread": [{"postID": "post5495207", "text": "Once i took a picture and text popped up saying \"sharpening image\"? Whats this about?", "time": "10-15-2016 12:04 PM", "replies": []}, {"postID": "post5495220", "text": "This seems to be a native feature of the camera app. If you open the Camera, then go to its settings, is there an option to turn off auto-sharpening? Or is there some other shooting mode that doesn't do it? If there's a Manual mode, try that.", "time": "10-15-2016 12:11 PM", "replies": []}]}, {"title": "phone and watch", "thread": [{"postID": "post5482374", "text": "I just bought the Huawei p9 plus and Huawei Watch black leather. My Lg G4 is getting shorter and shorter battery life, heats up and is slow. \nI would usually wait until the phone stopped, but I found a good offer on the p9 plus and the watch for cheaper than what the phone usually costs, 5990 NOK, when only the phone goes for about 6500 or over in most stores here in Norway, so I thought f.. It, and ordered it. \nBut this is not only me bragging about a good buy;-) I have some questions as well\nBloatware: what do you recommend that I delete from the phone? \nI have never used a smartwatch before : can it connect to more than one phone?\nHow trustworthy is the stepcounter? I will use it as help for getting in better shape.\nAny tips for an app that will use info from several sources, like an iphone, the p9 plus and the watch. \nOther tips that you wish to share? I have never used a huawei or a smartwatch, so others experience would be great. I have read lots of rewiews this last days, but rewiews cannot compare with users that have used it for months and years", "time": "10-11-2016 07:57 AM", "replies": [{"postID": "post5483692", "text": "No -- you can pair multiple watches with one phone, but not one watch to multiple phones. In order to pair the watch with another phone, you'd have to do a factory reset of the watch. See here: https://support.google.com/androidwe.../6058799?hl=enSorry, can you clarify what you mean by this?\nI have a Huawei Watch paired to my Nexus 6P, and in general I love it--primarily because of how it looks. I think this watch most closely resembles a classic men's dress watch, compared to all other Android Wear watches currently available. Since I love changing up how the watch looks, and since I appreciate watchfaces that look like real watches, I highly recommend WatchMaster (which is different from another popular app called WatchMaker).\nAnother useful feature is using the watch as a remote camera shutter. If you use the Google Camera app, when you open it on the phone, a watch notification should appear that allows you to use it as a camera shutter release. If you don't use the Google Camera app, there are some 3rd party remote camera apps available on Google Play.\nI think the main weakness of this watch is the weak vibration. It's strange, because when the watch vibrates, I can hear it vibrating, but I often don't feel the vibration at all on my wrist.", "time": "10-11-2016 02:10 PM", "replies": []}, {"postID": "post5483692", "text": "No -- you can pair multiple watches with one phone, but not one watch to multiple phones. In order to pair the watch with another phone, you'd have to do a factory reset of the watch. See here: https://support.google.com/androidwe.../6058799?hl=enSorry, can you clarify what you mean by this?\nI have a Huawei Watch paired to my Nexus 6P, and in general I love it--primarily because of how it looks. I think this watch most closely resembles a classic men's dress watch, compared to all other Android Wear watches currently available. Since I love changing up how the watch looks, and since I appreciate watchfaces that look like real watches, I highly recommend WatchMaster (which is different from another popular app called WatchMaker).\nAnother useful feature is using the watch as a remote camera shutter. If you use the Google Camera app, when you open it on the phone, a watch notification should appear that allows you to use it as a camera shutter release. If you don't use the Google Camera app, there are some 3rd party remote camera apps available on Google Play.\nI think the main weakness of this watch is the weak vibration. It's strange, because when the watch vibrates, I can hear it vibrating, but I often don't feel the vibration at all on my wrist.", "time": "10-11-2016 02:10 PM", "replies": []}]}, {"postID": "post5485835", "text": "Thanks for answering some of my questions B Diddy:-)\nI was unclear in one of my questions when I asked about an app that could use info from several sources. What I meant was health info, specifically things as steps, weight, BMI, periods. I now use an iPhone for some of it, and would like one program where all that info is collected, that takes it info from both the iPhone and the watch. Hmm, maybe I could keep on using the iPhone's health app. I see this is something I must take a choice about. It also influences the choice of which phone I connect the watch to. I now use the Lg as my primary, with the iPhone using a twin SIM-card, and wanted to replace my Lg with the Huawei. Since I have all my health info on my iPhone, and one of the reasons I bought the watch was health, I must learn more when I have the watch in front of me. \nI think the watch looks gorgeous from the pictures and videos I have seen, but one thing that worries me a little bit is its size. I am a little over five feet, and have small hands and wrists. I also haven't seen pictures of other women wearing it, so I cannot compare the size. You mention you think i looks like a mans classical watch, no doubt I can find a face that .. What to say, feminizes it a little bit ;-) english is not my mother tounge.", "time": "10-12-2016 07:19 AM", "replies": [{"postID": "post5487166", "text": "I'm not sure if there's an Android Wear app that will incorporate all of those things. FitWell might be close.It is fairly large, but there are significantly larger watches as well (like the larger sized Moto 360 and the LG G Watch Urbane). Oversized metal watches for women (so-called \"boyfriend watches\") still remain stylish, so I don't think it would look unusual.You do a good job with your English! I can't imagine what my post would look like if I tried to write in some other language besides my own.", "time": "10-12-2016 01:56 PM", "replies": []}, {"postID": "post5487166", "text": "I'm not sure if there's an Android Wear app that will incorporate all of those things. FitWell might be close.It is fairly large, but there are significantly larger watches as well (like the larger sized Moto 360 and the LG G Watch Urbane). Oversized metal watches for women (so-called \"boyfriend watches\") still remain stylish, so I don't think it would look unusual.You do a good job with your English! I can't imagine what my post would look like if I tried to write in some other language besides my own.", "time": "10-12-2016 01:56 PM", "replies": []}]}, {"postID": "post5488883", "text": "I have downloaded watchmaster, I liked those faces much more than watchmaker's, and will upgrade to paid as soon as the watch and phone arrives. It will be here the 17, can't wait :-)\nI like buying cases for my phones, (some may say I have an addiction, but don't listen to them:-) ) and wanted to find some bands for the watch, but no luck. Nobody sells something like that here in Norway: I have checked every online store that offers the watch, and none of the Amazon sellers send to Norway. Do you know if I can use regular straps, and what do I have to look after?", "time": "10-13-2016 05:32 AM", "replies": [{"postID": "post5490639", "text": "This should help: http://www.droid-life.com/2015/09/17...change-straps/", "time": "10-13-2016 04:43 PM", "replies": []}]}]}, {"title": "Accidentally deleted huawei app store?", "thread": [{"postID": "post5487372", "text": "I bought a p9 from china and i think i deleted the stock huawei app store. How do i get it back?", "time": "10-12-2016 03:04 PM", "replies": []}, {"postID": "post5488080", "text": "Unless the phone is rooted, it would be surprising to me that you could delete that -- most preinstalled apps are uninstallable. I would ordinarily ask you to check your App Drawer, but I'm assuming you're still using the stock EMUI launcher, which doesn't have an App Drawer.\nIf you go to Settings>Apps, tap the Menu button, and select Show System, do you see it listed there at all?", "time": "10-12-2016 08:16 PM", "replies": [{"postID": "post5490098", "text": "Nope definitely deleted it", "time": "10-13-2016 01:07 PM", "replies": []}]}, {"postID": "post5490617", "text": "You could search for the apk file on the web, but be careful about this, since websites that have apks for download are typically not vetted for malware.", "time": "10-13-2016 04:31 PM", "replies": []}]}, {"title": "Bought a p9 from china. Help me set it up!", "thread": [{"postID": "post5483009", "text": "No google services, many apps are in chinese, no play store. What do i do?", "time": "10-11-2016 11:00 AM", "replies": []}, {"postID": "post5483028", "text": "Have a look at this.[Q] Any issues with Chinese version? | Huawei P9\nLots of good info.", "time": "10-11-2016 11:07 AM", "replies": []}, {"postID": "post5483179", "text": "Hey guys google play launcher isnt working. I enabled permissions for Google and google launcher and rebooted the phone. Its not working", "time": "10-11-2016 11:48 AM", "replies": []}, {"postID": "post5483195", "text": "Also i dont have hiApp?", "time": "10-11-2016 11:52 AM", "replies": []}, {"postID": "post5483227", "text": "Theres a huawei launcher and a changmi launcher?", "time": "10-11-2016 11:58 AM", "replies": []}]}, {"title": "How can i move apps to sd card huawei p9 lite android 6.0 emui 4.1", "thread": [{"postID": "post5474016", "text": "Hello,\nI've recently bought a P9 Lite which, I think, software side it should be the same as a P9, so Android 6.0 with EMUI 4.1. Since the storage isnt' that much (16 GB), I've bought a 32 GB Micro SD card but I'm having a hard time understand how the system handles it.\nBy default, I've noticed that, when I inserted it, the phone has automatically started to save some things on it, like pictures and videos taken with the camera. However, some other things, like apps or offline maps by Google, are still saved on the main memory.\nIn the phone settings I've found an option to switch, as main memory, from the internal one to the SD Card, but Huawei doesn't clear explain what this option really do. I only get a warning to pay attention to my data since the internal memory is encrypted, while the SD no.\nIs there someone that can help me to understand the real meaning of this option?\nThanks!\nBest", "time": "10-07-2016 11:42 PM", "replies": []}, {"postID": "post5474035", "text": "I'm not a fan of putting apps onto sd cards myself, you only get some of the app on the card, the guts of it stays on the device anyway. And with your encrypted phone vs unencrypted card you are setting yourself up for grief I reckon. Put your media on the card and leave the apps in device is what I'd do. No doubt you'll get more feedback here from other more knowledgeable peeps than myself tho....", "time": "10-08-2016 12:01 AM", "replies": []}, {"postID": "post5474109", "text": "do you have any idea how can i move the app to sd card ? or is it possible on my huawei p9 lite ?", "time": "10-08-2016 01:13 AM", "replies": []}, {"postID": "post5477782", "text": "Welcome to Android Central! My guess is that the option you mention will change the default data storage and download location to the SD card instead of internal storage--but this is only for data files, and not for app installation. The ability to move an app to SD depends on the phone (as well as the app itself), so if you go to Settings>Apps, select apps, and don't see a Move to SD button, then it's not possible (either on the phone, or for that app). Moreover, moving an app to SD only moves a portion of the app (and often a relatively small portion), so your internal storage savings my not be that much.", "time": "10-09-2016 03:52 PM", "replies": []}, {"postID": "post5530176", "text": "Duplicate threads merged.", "time": "10-28-2016 09:34 AM", "replies": []}]}, {"title": "Huawei p9 vibrate on touch", "thread": [{"postID": "post5474787", "text": "Hi all, just got my partner a Huawei p9 and set it all up.\none problem, she hates vibrate on touch, I've delved into the settings and can't find the option to turn it off and there is no help (that I can reasonably find) so any feedback would be much appreciated.", "time": "10-08-2016 10:08 AM", "replies": []}, {"postID": "post5476409", "text": "On my P9 Plus it is : settings-sound-scroll down to vibrate on touch.", "time": "10-09-2016 02:42 AM", "replies": []}]}, {"title": "I've got the Huawei P9, you've got questions — fire away!", "thread": [{"postID": "post5109073", "text": "First, be sure to check out our hands-on report from London today: Huawei P9 + P9 Plus hands-on: Dual cameras in Huawei's new high-end duo | Android Central\nRichard Devine and I both have the Huawei P9 in-hand, so if you've got questions, be sure to fire away.\n(Note that things like battery life will take a little longer to figure out — we've both been using the phone for less then a day at this point.)", "time": "04-06-2016 05:39 PM", "replies": []}, {"postID": "post5109082", "text": "What's your favorite of the available colors, and why is it pink?", "time": "04-06-2016 05:42 PM", "replies": []}, {"postID": "post5109126", "text": "You must be mistaken. There is no pink version. Only titanium grey, champagne gold and rose gold, none of which are pink.", "time": "04-06-2016 05:58 PM", "replies": [{"postID": "post5109131", "text": "FTFY", "time": "04-06-2016 05:59 PM", "replies": []}, {"postID": "post5112940", "text": "SOMEBODY'S in denial....", "time": "04-08-2016 01:09 PM", "replies": []}]}, {"postID": "post5109208", "text": "Im not a big fan of Benchmarks, but can u run Antutu? Im just curious if the result is better than the leaked details.\nIf u have time, please make a shot of the camera settings. Thx", "time": "04-06-2016 06:38 PM", "replies": [{"postID": "post5109246", "text": "Crap-ton of camera settings:Focus speed is quick but not GS7 quick. \nSlowmo video: yep.\nNo lag. Pretty quick to capture.\nNeed more time to compare, but I'd say the GS7 outperforms it in most areas. 6P is less clear.", "time": "04-06-2016 06:56 PM", "replies": []}]}, {"postID": "post5109210", "text": "How's the camera? \nLike focusing speed and options available. \nSlow motion video? \nIs there any lag when taking pictures very fast? And moving the phone at the same time... \nLike compared to the nexus 6p or the Galaxy s7? I love taking pictures with my smartphone so that's a big deal for me...", "time": "04-06-2016 06:39 PM", "replies": [{"postID": "post5109246", "text": "Crap-ton of camera settings:Focus speed is quick but not GS7 quick. \nSlowmo video: yep.\nNo lag. Pretty quick to capture.\nNeed more time to compare, but I'd say the GS7 outperforms it in most areas. 6P is less clear.", "time": "04-06-2016 06:56 PM", "replies": []}]}, {"postID": "post5109239", "text": "Does the phone record 4K video? Thanks in advance.", "time": "04-06-2016 06:55 PM", "replies": [{"postID": "post5109249", "text": "Nope", "time": "04-06-2016 06:58 PM", "replies": [{"postID": "post5109907", "text": "Disappointing but logical due to the lack of OIS unless they have fantastic EIS, also a limitation of the Kirin SoC.", "time": "04-07-2016 04:17 AM", "replies": []}]}]}, {"postID": "post5109262", "text": "How skinned is the OS? What are the lockscreen notifications like? Is there a flashlight toggle?", "time": "04-06-2016 07:05 PM", "replies": [{"postID": "post5109900", "text": "Yes to both. But lock screen notifications aren't done in the normal Android way\nPosted via the Android Central App", "time": "04-07-2016 04:08 AM", "replies": []}]}, {"postID": "post5109267", "text": "2 main questions.\nBased on first impressions, did you find it a little bit more difficult to nail a shot due to the lack of OIS?\nAnd has Huawei finally sorted out EMUI's nagging system notifications?", "time": "04-06-2016 07:09 PM", "replies": [{"postID": "post5109908", "text": "OIS doesn't seem to make a difference when focusing, but you definitely miss it in night shots. \nNotifications are less of a mess than before, but still not the same as stock. No US price yet. Expect it to be pretty expensive if you import. \nNo QC3 with the bundled charger. Need to investigate further to see if it'll go higher than 5v/2a with a third party brick. correct Should have the main bands for both, but double check with wherever you import from. Not in its current form. Apparently it supports the relevant camera APIs, but I'm not seeing a raw mode in the stock camera app. http://www.androidcentral.com/sites/...4/p9-dof_0.jpg", "time": "04-07-2016 04:19 AM", "replies": [{"postID": "post5109981", "text": "RAW is listed after pro gets activated.", "time": "04-07-2016 05:47 AM", "replies": []}]}]}, {"postID": "post5109311", "text": "QC 3.0? How much in U.S.D.?\nPosted via the Android Central App", "time": "04-06-2016 07:33 PM", "replies": [{"postID": "post5109908", "text": "OIS doesn't seem to make a difference when focusing, but you definitely miss it in night shots. \nNotifications are less of a mess than before, but still not the same as stock. No US price yet. Expect it to be pretty expensive if you import. \nNo QC3 with the bundled charger. Need to investigate further to see if it'll go higher than 5v/2a with a third party brick. correct Should have the main bands for both, but double check with wherever you import from. Not in its current form. Apparently it supports the relevant camera APIs, but I'm not seeing a raw mode in the stock camera app. http://www.androidcentral.com/sites/...4/p9-dof_0.jpg", "time": "04-07-2016 04:19 AM", "replies": [{"postID": "post5109981", "text": "RAW is listed after pro gets activated.", "time": "04-07-2016 05:47 AM", "replies": []}]}]}, {"postID": "post5109322", "text": "I'm assuming this phone can't be used on Verizon ?", "time": "04-06-2016 07:41 PM", "replies": [{"postID": "post5109908", "text": "OIS doesn't seem to make a difference when focusing, but you definitely miss it in night shots. \nNotifications are less of a mess than before, but still not the same as stock. No US price yet. Expect it to be pretty expensive if you import. \nNo QC3 with the bundled charger. Need to investigate further to see if it'll go higher than 5v/2a with a third party brick. correct Should have the main bands for both, but double check with wherever you import from. Not in its current form. Apparently it supports the relevant camera APIs, but I'm not seeing a raw mode in the stock camera app. http://www.androidcentral.com/sites/...4/p9-dof_0.jpg", "time": "04-07-2016 04:19 AM", "replies": [{"postID": "post5109981", "text": "RAW is listed after pro gets activated.", "time": "04-07-2016 05:47 AM", "replies": []}]}]}, {"postID": "post5109351", "text": "Alex, what are the LTE band options on this device? Will it be compatible with t-mo or at&t you think?", "time": "04-06-2016 07:56 PM", "replies": [{"postID": "post5109908", "text": "OIS doesn't seem to make a difference when focusing, but you definitely miss it in night shots. \nNotifications are less of a mess than before, but still not the same as stock. No US price yet. Expect it to be pretty expensive if you import. \nNo QC3 with the bundled charger. Need to investigate further to see if it'll go higher than 5v/2a with a third party brick. correct Should have the main bands for both, but double check with wherever you import from. Not in its current form. Apparently it supports the relevant camera APIs, but I'm not seeing a raw mode in the stock camera app. http://www.androidcentral.com/sites/...4/p9-dof_0.jpg", "time": "04-07-2016 04:19 AM", "replies": [{"postID": "post5109981", "text": "RAW is listed after pro gets activated.", "time": "04-07-2016 05:47 AM", "replies": []}]}]}, {"postID": "post5109359", "text": "I think Alex fell asleep", "time": "04-06-2016 08:00 PM", "replies": []}, {"postID": "post5109363", "text": "Is the P9 coming to the US?", "time": "04-06-2016 08:01 PM", "replies": [{"postID": "post5109908", "text": "OIS doesn't seem to make a difference when focusing, but you definitely miss it in night shots. \nNotifications are less of a mess than before, but still not the same as stock. No US price yet. Expect it to be pretty expensive if you import. \nNo QC3 with the bundled charger. Need to investigate further to see if it'll go higher than 5v/2a with a third party brick. correct Should have the main bands for both, but double check with wherever you import from. Not in its current form. Apparently it supports the relevant camera APIs, but I'm not seeing a raw mode in the stock camera app. http://www.androidcentral.com/sites/...4/p9-dof_0.jpg", "time": "04-07-2016 04:19 AM", "replies": [{"postID": "post5109981", "text": "RAW is listed after pro gets activated.", "time": "04-07-2016 05:47 AM", "replies": []}]}]}, {"postID": "post5109715", "text": "Hi\nQ1) Does it shoot in RAW format like Huawei N6P ?\nQ2) Does it have any build in AMP & DAC ?\nThanks", "time": "04-06-2016 11:51 PM", "replies": [{"postID": "post5109908", "text": "OIS doesn't seem to make a difference when focusing, but you definitely miss it in night shots. \nNotifications are less of a mess than before, but still not the same as stock. No US price yet. Expect it to be pretty expensive if you import. \nNo QC3 with the bundled charger. Need to investigate further to see if it'll go higher than 5v/2a with a third party brick. correct Should have the main bands for both, but double check with wherever you import from. Not in its current form. Apparently it supports the relevant camera APIs, but I'm not seeing a raw mode in the stock camera app. http://www.androidcentral.com/sites/...4/p9-dof_0.jpg", "time": "04-07-2016 04:19 AM", "replies": [{"postID": "post5109981", "text": "RAW is listed after pro gets activated.", "time": "04-07-2016 05:47 AM", "replies": []}]}]}, {"postID": "post5109804", "text": "how is the hybrid auto focus feature? could you post some samples of depth-of-field pictures", "time": "04-07-2016 01:55 AM", "replies": [{"postID": "post5109908", "text": "OIS doesn't seem to make a difference when focusing, but you definitely miss it in night shots. \nNotifications are less of a mess than before, but still not the same as stock. No US price yet. Expect it to be pretty expensive if you import. \nNo QC3 with the bundled charger. Need to investigate further to see if it'll go higher than 5v/2a with a third party brick. correct Should have the main bands for both, but double check with wherever you import from. Not in its current form. Apparently it supports the relevant camera APIs, but I'm not seeing a raw mode in the stock camera app. http://www.androidcentral.com/sites/...4/p9-dof_0.jpg", "time": "04-07-2016 04:19 AM", "replies": [{"postID": "post5109981", "text": "RAW is listed after pro gets activated.", "time": "04-07-2016 05:47 AM", "replies": []}]}]}, {"postID": "post5109905", "text": "Alex can you post some video footage? Want to see how the P9 fares without OIS for video.\nThe P9 has that 1.7mm bezel, is it the same on the P9 Plus or has it been scaled up in ratio?", "time": "04-07-2016 04:15 AM", "replies": []}, {"postID": "post5109975", "text": "Please compare with GS7 camera!", "time": "04-07-2016 05:41 AM", "replies": []}, {"postID": "post5110117", "text": "Does the smaller P9 have fast charging?? I know the P9 Plus does", "time": "04-07-2016 07:29 AM", "replies": [{"postID": "post5110357", "text": "'Officially' we were told no. But equally in the event they said yes. Haven't actually charged it up yet to see what's what, but the indications on the stage were for some kind of rapid charge.", "time": "04-07-2016 09:42 AM", "replies": []}, {"postID": "post5288173", "text": "Yes, with proper charger it supports fast charging too. http://forums.androidcentral.com/hua...ml#post5286393", "time": "07-29-2016 01:24 AM", "replies": []}]}, {"postID": "post5110225", "text": "Has the new camera setup done in partnership with leica improved the camera to S7's level of experience and quality?\nPosted via the Android Central App", "time": "04-07-2016 08:42 AM", "replies": [{"postID": "post5110587", "text": "Nope, unfortunately.", "time": "04-07-2016 11:33 AM", "replies": [{"postID": "post5110598", "text": "Well, that's a shame.", "time": "04-07-2016 11:38 AM", "replies": []}]}]}, {"postID": "post5110247", "text": "Does this support wi-fi calling for a provider like t-Mobile? Their customer support says they do, but its hard to believe", "time": "04-07-2016 08:55 AM", "replies": [{"postID": "post5110359", "text": "There are Wi-Fi calling settings on the P9, yes. So as a phone it supports it. \nAs for T-Mobile, I cannot answer. Being in the UK it would be irresponsible to guess.", "time": "04-07-2016 09:44 AM", "replies": []}]}, {"postID": "post5111899", "text": "Does Richard have a race car fast enough to outrun the Chinese thought police when they see the things that you two like to do with your phones?\nIf you hold it up to your ear in the still of the night when the moon is full, can you hear speeches from Chairman Mao coming from the communist silicon?\nDid you get an #OO tattoo? Is it somewhere we can see it, or is it on a place on your body only a degenerate from the west would get tattooed?\nIn before MERICA hateses Spinese phones.", "time": "04-07-2016 11:48 PM", "replies": [{"postID": "post5111965", "text": "Jerry, I spit out nearly all of my drink all over my phone while reading that. And I'm still laughing pretty hard now.\nThat’s a classic right there.\n(I live by 3 words. fastboot flashing unlock)", "time": "04-08-2016 01:20 AM", "replies": []}]}, {"postID": "post5112369", "text": "Yeah.... looking at those gsmarena test stills, I'm not all that impressed. There's a LOT of digital junk, smudged up details... there's a surprising lack of finite detail in every shot, even the B&W image, which doesn't involve any image merging based on their press material. The 1:1 looks are kind of a mess, if you showed me those I would in no way, shape or form say there was any benefit to a dual camera.\nMuch disappoint.  I mean, the concept should allow for some incredible pictures... razor sharp detail (without the processing artifacts), excellent dynamic range, etc. The approach is used in optical astronomy to great effect, and there are ground based telescopes that use a similar mechanism (along with some other tricks) to lead to images with resolution that's absolutely staggering. I', going to chalk this up to \"because first\"... and hope that subsequent attempts will lead to better quality.", "time": "04-08-2016 08:35 AM", "replies": [{"postID": "post5112411", "text": "I just looked at them, and what hit me at first was \"Where's all the detail?\"\nTo my eyes, it's apparent that there doesn't seem to be a lot of detail in the P9's camera. Some might say it's due to the 12-megapixel resolution, but I don't really think the 12MP resolution is really to blame here. I zoomed in and there seems to be quite a bit of digital-noise and the noise-reduction is kinda smudgy. Dynamic range is also kinda \"Ehhh\", but I've seen worse.\nAs of this time, I don't think there's any benefit to a dual-camera setup like this. It has potential, but for some reason, it isn't fully realized yet. I'm chalking this up to software processing and I hope that Huawei/Leica will improve the way images are processed because this camera has potential and it needs the software to realize it. If it's hardware, well, at least they're the first to do it this way?\n(The GSMArena shots I looked at are here. Leo probably used the same set.We have Huawei P9 camera samples, check them out - GSMArena blog)", "time": "04-08-2016 08:57 AM", "replies": [{"postID": "post5113739", "text": "That 12MP has less detail is a myth actually. If you crop a 16:9 16MP to 4:3, you get a 12MP picture. Any 'loss of detail' will be related to differences in field of view, which isn't really a loss in detail in the first place.\nBesides... Both the S7 and 6P are 12mp and the pictures they push out are light years beyond what we saw here.\nNew tech, needs some seasoning.", "time": "04-08-2016 08:49 PM", "replies": [{"postID": "post5114101", "text": "That's what I thought too.\nI've used a couple of 12MP cameras and I never found any loss of detail compared to my G4. So when I saw how the P9's photos seem to lack any sense of detail despite having that resolution, I'm pretty certain that it has to be something else.\nI'm thinking that it's smudgy noise-reduction or maybe the way the phone takes the imaging data from the 2 sensors is a bit iffy right now.\nWell, it is decidedly \"First-Gen\", and that's pretty much what I think.", "time": "04-09-2016 04:21 AM", "replies": []}]}]}]}, {"postID": "post5116239", "text": "First gen? The honor 6 Plus also have Dualcam.", "time": "04-10-2016 11:19 AM", "replies": []}, {"postID": "post5136226", "text": "I currently have the Samsung S6 for work and will very shortly be getting the Huawei P9; how easy is it to transfer info from the Samsung to Huawei; can I do it through Smart Switch? Also, I hear that some don't like the EMUI interface; how do you feel about it, and do you have any thoughts for using a different launcher instead?", "time": "04-20-2016 06:40 AM", "replies": []}, {"postID": "post5138071", "text": "How well does the wide aperture mode work for photos?", "time": "04-21-2016 04:24 AM", "replies": []}, {"postID": "post5257318", "text": "Hi,\nThis is my first post. First of all, I'll like to say a big hello to all. My name is Rainer, I'm from Johor Bahru, Malaysia. I've decided to post in this thread under general issues.\nI have a Huawei P9 Lite. Everytime I connect the phone to my PC, I have to manually go to the phone settings and select Media Transfer Protocol (MTP) under Select USB Configuration, then only I can transfer files to and from the phone and PC. How do I setup the phone so that I don't have to manually set these options every time I connect the phone to my PC? I want the phone to autoconnect to the PC every time I connect it to the PC. I didn't have this problem in my previous phone, Samsung Galaxy Mega 2.\nPls help thanks. Looking forward to reply.\nFrom a frustrated Huawei P9 Lite user.", "time": "07-09-2016 01:19 AM", "replies": []}, {"postID": "post5288136", "text": "Hi I have just got the p9 however im really frustrated I imported all my contacts but instead of just my phone numbers when I press the contacts icon everything is listed email adresses ect the only way I can access just the numbers is going in to the options then selecting groups this ery annoying could someone plesse help", "time": "07-29-2016 12:32 AM", "replies": []}, {"postID": "post5309336", "text": "Hi there,\nI got a p9 lite I love the phone But i encontered a problem, and I dont know if this is a bug or a problem of the phone, when i record a vídeo it doesn't record with sound ive tried several \"fixes\" like clearing the cache, rebooting, but no luck. \nCan somente help me?", "time": "08-08-2016 01:47 PM", "replies": []}, {"postID": "post5474817", "text": "How can I make it so that when I delete an email from my phone that it deletes from my actual email account? (Hotmail) thanks", "time": "10-08-2016 10:22 AM", "replies": []}]}, {"title": "Only fingerprint unlock", "thread": [{"postID": "post5457662", "text": "Hi, does anyone know how to unlock it only with the fingerprint ID ? I mean to eliminate the pin when you slide the lock screen and to appear when the fingerprint doesn't match for 5 times.", "time": "10-01-2016 04:37 AM", "replies": []}, {"postID": "post5458171", "text": "Not possible. For Android, you MUST have a PIN or password set as the backup in case the fingerprint fails.", "time": "10-01-2016 12:02 PM", "replies": []}]}, {"title": "Huawei P9 fingerprint sensor", "thread": [{"postID": "post5447142", "text": "Anyone notice that if you have usb cable plugged into the Huawei P9 and when you try to unlock the lock using the fingerprint sensor, it is not that accurate and very difficult to read your finger. However if your USB cable are not plugged into the phone, unlocking the phone with the fingerprint sensor is a breeze. \nAnyone came across this issues?", "time": "09-26-2016 03:05 AM", "replies": []}, {"postID": "post5447385", "text": "Mod Note: Moved to the Huawei P9 subthread for relevance\nAnd from my time with the P9, I haven't really ran into such an issue. Weird.", "time": "09-26-2016 08:02 AM", "replies": []}]}]
[{"title": "Huawei P9 Plus Hands on", "thread": [{"postID": "post5108127", "text": "From the blog, a quick hands on with the P9 Plus: Huawei P9 + P9 Plus hands-on: Dual cameras in Huawei's new high-end duo | Android Central\nLooks to be a pretty good phone.", "time": "04-06-2016 09:37 AM", "replies": [{"postID": "post5440747", "text": "The phone looks amazing. Has a great build quality. I really liked the new dual less camera that can capture great shots.", "time": "09-22-2016 11:32 PM", "replies": []}]}, {"postID": "post5108141", "text": "Looks solid for sure. Going to dig into this one a bit more!", "time": "04-06-2016 09:40 AM", "replies": []}, {"postID": "post5177344", "text": "Thinking about getting this one. Does anyone know how long Huawei supports SW updates on its phones? I.e. my Oneplus One was updated from Android 4.4 to 6.0.1. Can I expect the same support from Huawei?", "time": "05-14-2016 02:04 PM", "replies": [{"postID": "post5181909", "text": "I have mate 7 from 2014 was on kitkat 4.4 updated to lollipop and one month ago I received marshmallows... i know it's a little late but better than nothing...", "time": "05-17-2016 11:53 AM", "replies": [{"postID": "post5183961", "text": "Oneplus one got 6.0 update about month ago also. And Samsung phones only about two months ago as far as I know. So it is quite good.", "time": "05-18-2016 02:31 PM", "replies": []}]}]}, {"postID": "post5366438", "text": "Thanks for the link", "time": "08-25-2016 07:50 PM", "replies": []}, {"postID": "post5438496", "text": "Be Aware\nI have huawei P9 plus when I clean memory it will stop download manager and applock apps", "time": "09-22-2016 07:17 AM", "replies": [{"postID": "post5440753", "text": "Must be some kinda bug. Might be fixed once you get updates. If you've found it you should tell em on their site or twitter handle.", "time": "09-22-2016 11:34 PM", "replies": []}]}]}, {"title": "How to rearrange playlist on Huawei P9 Plus", "thread": [{"postID": "post5424817", "text": "When I add songs to a playlist they are arranged in alphabetical order. Is there any way I can rearrange the songs? I tried long pressing and selecting the songs and pressing the \"move\" option but that only served to remove the song from the playlist. Can anyone help me with this other than suggesting to download another music playing app?", "time": "09-16-2016 10:19 PM", "replies": [{"postID": "post5435627", "text": "Welcome to Android Central!\nDid you figure out how to do it?", "time": "09-21-2016 08:08 AM", "replies": []}]}]}, {"title": "Where to buy P9 Plus?", "thread": [{"postID": "post5419286", "text": "I am in the U.S., Where can I buy the P9 Plus. Any help is greatly appreciated.", "time": "09-14-2016 06:42 PM", "replies": []}, {"postID": "post5428115", "text": "You will probably have to order it for shipment from China. Take a look at the new Huawei Honor 8. $400 dollars and if you register with Honor USA before Oct 3rd you can buy it from their US op HiHonor.com. they currently have white and black models ready to ship. They have almost the same specs as the P9 for a lot less. Check it out. Also the P9 will probably not work with the US carriers LTE bands.", "time": "09-18-2016 04:59 PM", "replies": []}, {"postID": "post5428141", "text": "Check Oppomart. All their phones have 1 year warranty, 14 day money back guarantee and 4-7 day shipping.", "time": "09-18-2016 05:16 PM", "replies": []}]}, {"title": "Snapchat/Instagram laggy video recording?", "thread": [{"postID": "post5426528", "text": "Hey I am really interested in this phone, but I've read that it doesn't work well with Snapchat and Instagram. Someone to test and share here? While in video mode or recording. Is it laggy/choppy?", "time": "09-17-2016 08:23 PM", "replies": []}]}, {"title": "VPN connection problem on Huawei p9", "thread": [{"postID": "post5396098", "text": "Guys, \nI have a Huawei p9 EVA-L19 device running Android Marshmellow 6.0 and EMUI 4.1, I have installed the latest two updates available for it normal through the updater (I live in UAE), I have noticed a drop in the stability of the VPN connection after the update and then the VPN services stopped completely from connecting with the latest update, I have tried all VPN software even I tried to set a VPN connection manually but that didn't work also, I would appreciate your help on this one, I really need to have the VPN in order to use calling features offered by skype and whatsapp.\nThank you", "time": "09-05-2016 11:24 AM", "replies": []}, {"postID": "post5400670", "text": "I think this solution helps you or may be your vpn provider issue not mobile issue tell me which vpn service you using i suggest you try expressVpn service Read User feedbacks and reviews from here Reddit this is helps you to get a good decision", "time": "09-07-2016 05:18 AM", "replies": []}, {"postID": "post5405882", "text": "Hi \nThe problem is not with the VPN provider, I have tried almost every one even the one you suggested yet no connection", "time": "09-09-2016 09:25 AM", "replies": []}]}, {"title": "Exchange email issue", "thread": [{"postID": "post5397816", "text": "Hi all,\nWe are using the new P9's for our company and some users are complaining about the following:\nthey receive a notification that they have a new mail, but when opening the mail app it's not showing.\nRebooting the device, disabling/enabling wifi/4G doesn't matter. Only after a certain time they suddenly get all their emails in one go.\nAnyone else had this issue?\nifso, what can be done to fix it?\nThanks,\nRens", "time": "09-06-2016 01:44 AM", "replies": []}]}, {"title": "E-mail configuration", "thread": [{"postID": "post5396470", "text": "At all the e-mail apps, I cannot configure my e-mail account.\nEverytime time I'm filling the form, I cannot introduce the password.\nSomeone can help me, please?", "time": "09-05-2016 01:54 PM", "replies": [{"postID": "post5396557", "text": "You are going to have to be more specific. Who is your email account through and what apps have you tried. There is no reason you shouldn't be able to enter your password. Unless you are choosing that your email doesn't REQUIRE a password. I use the GMAIL app for all my email accounts and it handles it great, and I have no issues for it in regards to allowing me to enter my password.", "time": "09-05-2016 02:37 PM", "replies": []}]}, {"postID": "post5396978", "text": "Hi, the problem is solved.\nIt was my mistake while introducing the e-mail address.\nMany thanks\nLuis Antunes", "time": "09-05-2016 05:36 PM", "replies": []}]}, {"title": "huawei p9 camera not working", "thread": [{"postID": "post5391887", "text": "Hi..so it breaks down like this...\nI was using my phone normally to record monster jam in Cardiff and taken photos and videos..I took many successfully tonight.\nProblem..\nWent to take last few photos and camera app (standard with phone) was just showing me a black screen.. and is unresponsive to my button press from shutter.. or to any other button press such as advanced mode.. nothing works..in short..I can load app but not do anything with it regards viewing or taking photo/ videos.\nPrior to this black screen tonight..I did notice a general slowdown in time taken for camera to show me what I was pointing at...\nSteps taken so far...\nI have taken phone SD card out ( which is Hi speed... I can provide specs..up to now have experienced no issues with card performance and i have already taken plenty of photos and videos and have plenty of capacity left on card)\nI have tested camera without SD card in and found no change.\nI have rebooted using restart now and power off options and no change..\nI have forced stopped camera app and also cleared cache via settings.\nI have performed reboot and cleared system cache using home plus power on/off and home button then volume down to select clean system cache and no change.\nI haven't dropped phone or got it wet..\nPlease help... i am too early in my contract for this and really need to get camera working for Goodwood next weekend...\nCan't believe it's hardware..I would surely receive \" error loading camera\" or some such thing..also..fact that camera was taking longer and longer to focus suggests software..but I don't know what else to try. .\nthanks a lot.\nPhil.", "time": "09-03-2016 07:23 PM", "replies": []}, {"postID": "post5391951", "text": "Just tried a hard reset and that hasn't worked ..no change with camera..phone software fully up to date..", "time": "09-03-2016 07:48 PM", "replies": []}]}, {"title": "Huawei / EMUI 4.1 and SD card management", "thread": [{"postID": "post5229352", "text": "Hello,\nI've recently bought a P9 Lite which, I think, software side it should be the same as a P9, so Android 6.0 with EMUI 4.1. Since the storage isnt' that much (16 GB), I've bought a 32 GB Micro SD card but I'm having a hard time understand how the system handles it.\nBy default, I've noticed that, when I inserted it, the phone has automatically started to save some things on it, like pictures and videos taken with the camera. However, some other things, like apps or offline maps by Google, are still saved on the main memory.\nIn the phone settings I've found an option to switch, as main memory, from the internal one to the SD Card, but Huawei doesn't clear explain what this option really do. I only get a warning to pay attention to my data since the internal memory is encrypted, while the SD no.\nIs there someone that can help me to understand the real meaning of this option?\nThanks!\nBest", "time": "06-18-2016 03:35 AM", "replies": []}, {"postID": "post5231672", "text": "This maybe only a problem with mine, but I have the P9 and I got a 32Gb SD card and transferred all my photos across onto it. Then the SD card started having problems and the phone said that the SD card was corrupted. I stained my undies a little but when i put the SD card into my computer I managed to retrieve most of the videos and photos. I have decided NOT to continue using an SD card as do not want to risk losing all my files. I guess if storage becomes an issue then I will just backup all the files from the SD card onto my computer every week. At least if it goes corrupt again, then at least I will have the majority of my files safe! \nWith regards to your question, I was a little confused too so ended up going to the Files icon in the Tool sub-folder and then just manually copied and pasted them across from phone onto SD card. Haven't found an easier option as yet, but probably because I stopped using the card.", "time": "06-20-2016 06:24 AM", "replies": []}, {"postID": "post5263800", "text": "Hello,\nI am in the exact same situation as you. \nHave you got any news about how to move the apps to the SD card ?\nThanks", "time": "07-13-2016 06:23 PM", "replies": []}, {"postID": "post5371562", "text": "That option help you to install game data on sd card", "time": "08-27-2016 03:44 PM", "replies": []}, {"postID": "post5371569", "text": "Hello \nOn storge sittings make your sd card default storge", "time": "08-27-2016 03:49 PM", "replies": []}]}, {"title": "XDA: Android Nougat Beta Build for the Huawei P9 is Available", "thread": [{"postID": "post5285679", "text": "Android Nougat Beta Build for the Huawei P9 is Available - Get it Now!", "time": "07-27-2016 03:52 PM", "replies": []}, {"postID": "post5285882", "text": "Interesting...", "time": "07-27-2016 05:40 PM", "replies": []}, {"postID": "post5286400", "text": "It is an early BETA leak, but it is a good news for us. N update is in the works and it means we maybe getting N update sooner than we expected to our P9'es", "time": "07-28-2016 01:21 AM", "replies": [{"postID": "post5322033", "text": "Have you tried the Nougat? Can it be upgraded to the official once it comes out?", "time": "08-13-2016 11:18 AM", "replies": []}]}, {"postID": "post5327593", "text": "I don't think so. It is early beta, so use it at your own risk. I think you will have to downgrade manually to the latest stable version before final official update.\nPosted via the Android Central App", "time": "08-15-2016 05:01 AM", "replies": []}]}, {"title": "Pairing with Android Wear?", "thread": [{"postID": "post5195175", "text": "I'm unable to pair my new P9 with my Huawei Watch 0925 - The Android Wear app reports \"Incompatible Android Wear device connected. Please use an official Android Wear in China device.\"\nHas anyone else seen this problem?\nThe firmware on the P9 is very China-centric, which is cute but somewhat less than functional in the United States. Does anyone know if Huawei has plans to release a US firmware anytime soon?\nAbsolutely loving the phone otherwise - The modifications Huawei made to Android make it feel like a far more usable device than the near-stock experience I had on my LG G4.", "time": "05-25-2016 12:10 PM", "replies": [{"postID": "post5326199", "text": "", "time": "08-14-2016 04:51 PM", "replies": []}]}, {"postID": "post5212159", "text": "I have the same error with the same phone.\nFunny thing is I have a huawei watch.\nCannot find any solution yet.\nWill update if I find any.", "time": "06-06-2016 12:57 PM", "replies": []}, {"postID": "post5223339", "text": "Mine works fine in the UK, where the watch came with the phone", "time": "06-14-2016 06:14 AM", "replies": []}, {"postID": "post5326206", "text": "Hi! I have exactly the same problem. Did you find a solution??", "time": "08-14-2016 04:53 PM", "replies": []}]}, {"title": "Stock android???", "thread": [{"postID": "post5324711", "text": "Ok here goes.... I'm a bit of a noob when it comes to rooting etc but I can't help but notice that there are 'official' marshmallow builds for the p9.... is this exactly as it sounds? Will this give me marshmallow EXACTLY as it is on a nexus phone for example?\nPosted via the Android Central App", "time": "08-14-2016 07:54 AM", "replies": []}, {"postID": "post5324855", "text": "Where are you seeing this? Can you post a link?", "time": "08-14-2016 08:59 AM", "replies": []}]}, {"title": "Possible adware - adverts in background", "thread": [{"postID": "post5315866", "text": "Had my P9 about 24 hours, all of a sudden I get those \"you can make so much money in a 1 day\" adverts in the background?! ive restarted my phone and it does the same?! I am confused as hell, no apps are open what so ever, what could be causing this? i have tried restarting the phone, reinstalling chrome, ran malware scans but still the same issue. disappointing for a phone that's a day old.", "time": "08-11-2016 03:30 AM", "replies": []}, {"postID": "post5318003", "text": "Welcome to Android Central! Are they only appearing when you're using the browser? If so, they're probably popup ads related to the sites you're visiting. Avoid those sites.", "time": "08-11-2016 09:05 PM", "replies": []}]}, {"title": "WiFi issues after update VNS-L31C55B120", "thread": [{"postID": "post5312014", "text": "Hello, I've recently received the update mentioned in the title on my P9 Lite and, after that, I've started to notice that the WiFi speed is very flaky. When I check the settings, I always see that the reported speed is between 5 and 10 Mbps, while at home I have a 100 / 30 optic fiber connection. I understand I can't reach maximum speed because the P9 Lite doesn't support 5 GHz networks, but before the update I didn't have such issues. Now, most of the time the loading speed is so slow that I have to turn WiFi off and use 4G connection. Anyone else is seeing the same? \nThanks!\nPosted via the Android Central App", "time": "08-09-2016 04:08 PM", "replies": []}, {"postID": "post5312355", "text": "Welcome to Android Central! Have you tried rebooting your router (by unplugging its power for 10 seconds, then plugging back in again)?", "time": "08-09-2016 06:42 PM", "replies": []}]}, {"title": "Wifi calling?", "thread": [{"postID": "post5299723", "text": "Honestly I have no Idea how to turn this on.\nI confirmed with my carrier (vodafone)yesterday that I have it available, they had to switch it on themselves their end.\nFirstly I don't see it in this settings menu, anywhere.\nSecondly I can find it if I do a search in settings. However, trying to activate it is another matter.\nThis is the message I get when I try to activate it:\n\"When Wi-Fi calling is on, your phone can route calls via Wi-Fi networks or your operator's network, depending on your preference and which signal is stronger. Before turning on this feature, check with your operator regarding fees d other details.\"\nThere are no buttons or any way (that I can see) to progress to another screen.\nCan anyone work this out? Slightly losing my mind over this as I can normally find the answer, be it through my own findings or through my friend google.", "time": "08-04-2016 12:54 AM", "replies": []}, {"postID": "post5302178", "text": "Okay, so after two more phone calls to vodafone yesterday I have been told that the P9 is not yet a compatible phone with them for wifi calling, furthermore because I purchased it from carphonewarehouse, it will probably never be compatible with them, which is absolute bull****. \nAre there any tricks I can use to activate this myself? Quite desperate for this to work as I literally have no signal anywhere in my house (absolutely fine once I step out the door mind). This goes for any network operator, I'm sure my house is lined with lead.", "time": "08-05-2016 01:07 AM", "replies": []}]}, {"title": "Huawei P9 data transfer", "thread": [{"postID": "post5298878", "text": "I have just ordered a P9 and pick it up tomorrow,can anyone tell me if I will be able to transfer all my data from my old phone (sony xperia Z1 compact) to the P9 and is it easy to do.\nMany Thanks for any replies", "time": "08-03-2016 04:44 PM", "replies": []}, {"postID": "post5302075", "text": "hello,anyone got an answer please", "time": "08-04-2016 11:31 PM", "replies": []}]}, {"title": "Huawei p9 build quality?", "thread": [{"postID": "post5257585", "text": "Hello p9 fans\nI want to know how is the build quality of the hauwei p9?\nHow scratch resistant is the display glass?\nAlso how scratch resistant the back glass panel covering the back cameras? Is it made of gorilla glass?\nI had p8 but the back glass had few scratches on it,also the metal alloy used in the phone body is not strong, it got scratches and dents easily, so how is that in the new p9?", "time": "07-09-2016 08:33 AM", "replies": []}, {"postID": "post5302013", "text": "My assessment is not good. I have had a P9 for less than 1 month. The device was accidentally dropped from a height of less than 2 feet or 1/2 a meter. I expected cosmetic damage, but what happened instead is that the power button AND volume buttons no longer work and the OS is corrupt and will not boot correctly anymore.\nYou could say my fault for dropping, but the device literally fell LESS than 50 cm, that's less than the fall from your pocket to the ground, and now the device is not only damaged but UNUSABLE. This phone seems to require flawless care.\nWould not recommend this device to any but the most careful users", "time": "08-04-2016 10:44 PM", "replies": []}]}, {"title": "Nillkin tpu case for Huawei P9", "thread": [{"postID": "post5297179", "text": "Hi, anyone is using a Nillkin tpu case for Huawei P9? \nWho have this case, can make a test please. With the tpu case in, take a picture at night with flash. \nWith my phone interferes with the flash and makes the photos white.", "time": "08-03-2016 05:00 AM", "replies": []}]}, {"title": "How to select pictures from gallery & how to move it to a different folder on the phone?", "thread": [{"postID": "post5288386", "text": "Just got my hands on the new Huawei P9 plus.\nSeems like it is not so user friendly.\nI can't find the \"select\" picture option and I don't know how to move the pictures from the camera folder to a folder I have created. This is driving me nuts as it is supposed to be a simple task on my previous Samsung phones.", "time": "07-29-2016 07:15 AM", "replies": []}, {"postID": "post5288683", "text": "Go to File Manager -> Device Storage or emulated/0 -> DCIM -> Then find the Folder and copy it.\nIf your Folder is not there, then go to Device Storage or emulated/0 -> Pictures -> Find the folder and copy/move it.\nHope it helps!\nRafee", "time": "07-29-2016 10:18 AM", "replies": [{"postID": "post5289855", "text": "Thanks Rafee.\nActually I found the solution after playing around with the phone.\nTo select the pictures, long press the picture while it is in its album and a tick will appear in the top right hand corner, and then you can select a few pictures by ticking them and then click on the \"move\" or \"share\" option below.\nNow I am figuring out how to upload the pictures to Huawei's hicloud.\nI tried to log into the hicloud via mobile phone but was unsucessful.", "time": "07-30-2016 04:48 AM", "replies": []}]}]}, {"title": "Quick charging P9", "thread": [{"postID": "post5242744", "text": "Anyone using the P9 quick charging brick have done any comparison with regular QC compatible charger?\nI noticed charging with the Huawei Quick Charge charger (bought separately) it charges relatively quick till about 85%-90% then it throttles the charge to a crawl. Really.... Slowly. I know it's normal to avoid damaging the battery in the long run. It's ridiculously slow, the last 10% would take another 20-25mins to complete. \nWhen using another QC compatible charger, it doesn't charges as quick but it is consistent right till 100%. Considering that, it seems both charges the phone in total equal time.", "time": "06-28-2016 06:50 AM", "replies": []}, {"postID": "post5286393", "text": "Only Huawei branded chargers will work. Just received this one. Works perfectly.Original 9V 2A EU US Adaptive Fast Wall Charger for Huawei P9 Plus HTC Oneplus | eBay\nAnd it works in very interesting way. Yet I think it really saves a battery. I have a power meter in my 220V power outlet. At first charger kicks at 16W power mode. Later another mode I've noticed was some kind of trickle charging, when power meter showed the charger changing it's power used: 16W - 11.5W - 16W - 11.5W. Just more later - steady 11.5W. And it has to do a lot not with how much battery left, but with it's temperature. If your phone just feels warm in your hand - the charger won't kick to 16W mode even at the beginning.\nThe final result here: started charging at 34%. 30 minutes later I had 74%. With 3000mAh battery inside 40 percent in 30 minutes seems to be quite impressive to me.\nPS. Phone also indicated charger properly, so you will see on-screen message it is not \"Charging\", but \"Fast Charging\".", "time": "07-28-2016 01:16 AM", "replies": []}]}, {"title": "Unable to start app due to LogCollectManager.getUserType() error", "thread": [{"postID": "post5281082", "text": "When I try to run my application on Huawei P9 I’m getting the error \"Attempt to invoke virtual method 'int com.huawei.lcagent.client.LogCollectManager.getUserType()' on a null object reference\". Is there any way to debug this because application works on other Android 6 phones (Samsung, HTC...).\nAPP:https://play.google.com/store/apps/d...orescreens.mkt\nLOG:\n07-04 10:42:56.045: W/System.err(955): java.lang.NullPointerException: Attempt to invoke virtual method 'int com.huawei.lcagent.client.LogCollectManager.getUserType()' on a null object reference\n07-04 10:42:56.046: W/System.err(955): at com.android.server.util.ReportTools.getUserType(ReportTools.java:86)\n07-04 10:42:56.046: W/System.err(955): at com.android.server.util.ReportTools.isBetaUser(ReportTools.java:73)\n07-04 10:42:56.046: W/System.err(955): at com.android.server.util.ReportTools.report(ReportTools.java:58)\n07-04 10:42:56.046: W/System.err(955): at com.android.server.util.HwUserBehaviourRecord.appExitRecordInnerImpl(HwUserBehaviourRecord.java:125)\n07-04 10:42:56.046: W/System.err(955): at com.android.server.util.HwUserBehaviourRecord.access$200(HwUserBehaviourRecord.java:32)\n07-04 10:42:56.046: W/System.err(955): at com.android.server.util.HwUserBehaviourRecord$AsyUploadLooperThread$1.handleMessage(HwUserBehaviourRecord.java:255)\n07-04 10:42:56.046: W/System.err(955): at android.os.Handler.dispatchMessage(Handler.java:102)\n07-04 10:42:56.046: W/System.err(955): at android.os.Looper.loop(Looper.java:150)\n07-04 10:42:56.046: W/System.err(955): at com.android.server.util.HwUserBehaviourRecord$AsyUploadLooperThread.run(HwUserBehaviourRecord.java:267)", "time": "07-25-2016 03:59 AM", "replies": []}]}, {"title": "4G gone after latest update", "thread": [{"postID": "post5280229", "text": "Hi, I ran the latest update on my P9 on Friday night which has caused 4g/3g to vanish from my phone. I've checked settings and everything seems to be fine and I've spoken to 3 people at vodafone and none of their suggested fixes have worked. \nHas anyone else had the same issue? \nThanks, Roy", "time": "07-24-2016 02:41 PM", "replies": []}, {"postID": "post5280759", "text": "Welcome to Android Central! Can you get any mobile data at all, like 2G/EDGE? Have you already checked your APN settings? Made sure Preferred Network Type is set to include LTE, or Global, or Automatic?", "time": "07-24-2016 10:09 PM", "replies": []}]}, {"title": "Can't Sync Google contacts, what can i do?﻿ Device: Huawei P9 Plus 128gb Vie-AL10", "thread": [{"postID": "post5267114", "text": "I just bought a Huawei P9 Plus 128gb model VIE-AL10, from China. Im having trouble getting it to sync my google contacts. So far i have downloaded google contacts sync but it just isn't working, what can i do?﻿", "time": "07-15-2016 04:47 PM", "replies": []}, {"postID": "post5278577", "text": "I got it working, someone in the XDA Forums managed to do it, so here is the solution:\nLets start from scratch to make it simpler.\nRemove Google Contacts via the apps section of the phone\nDownload Google Contact Sync APK and install it (Even if you already have it) get this one: https://www.apkmirror.com/apk/google...-apk-download/\nReboot phone\nGo into permission manager and select Google Contacts Sync and make sure it is set as \"Trust this app\"\nThen go into Apps via Settings and search for Google Contacts Sync and select permissions, make sure \"Contacts\" is enabled as per screenshot http://anonpix.com/images/2016/05/16/7qEOb.png\nReboot phone\nCheck your accounts and you should see Google Contact Sync", "time": "07-23-2016 08:28 AM", "replies": []}]}, {"title": "P9 fingerprint sensor material/durability?", "thread": [{"postID": "post5255724", "text": "Hi, any thoughts on the durability of the fingerprint sensor? Is it made of easily scratched plastic (like Samsung) or something more durable? Thanks.", "time": "07-07-2016 08:27 PM", "replies": []}, {"postID": "post5257320", "text": "Hi richcswu, my fingerprint sensor is working fine, so far so good, got no issues so far.\nI'm using the P9 Lite btw.\nHave u setup the fingerprint sensor yet? U hv to scan different parts of your finger before the scan is complete.\nHope this helps.\nRainer", "time": "07-09-2016 01:23 AM", "replies": []}, {"postID": "post5258504", "text": "Thanks. I also got the P9 Lite. Overall very satisfied. Time will tell how easily the fingerprint sensor scratches.", "time": "07-10-2016 05:31 AM", "replies": []}, {"postID": "post5269337", "text": "I have watched a YouTube review testing the durability of the P9. It appears to be all metal, even the fingerprint sensor.", "time": "07-17-2016 12:44 PM", "replies": []}, {"postID": "post5275083", "text": "Yes it is metal but coated and scratches easily as ii seen on the you tube.\nCheck the channel : jerryrigeverything", "time": "07-21-2016 02:51 AM", "replies": []}]}, {"title": "end call by pressing power switch", "thread": [{"postID": "post5273573", "text": "Hi, on my P9 lite, I have to press the power button twice to end a call (with the power button to end call function already enabled in settings). Pressing it just once or even long pressing does nothing. Anyone else have this situation? Not a big deal and easy enough to do, just wondering if this is the way is was designed to work.", "time": "07-20-2016 06:47 AM", "replies": []}]}, {"title": "Where can I find a Fake Location and disable it?", "thread": [{"postID": "post5273310", "text": "I have a Huawei P9 phone. An app enabled it automatically and I can't find it to disable it.", "time": "07-19-2016 11:58 PM", "replies": []}, {"postID": "post5273315", "text": "You can uninstall each app one by one to find the offending app", "time": "07-20-2016 12:18 AM", "replies": []}]}, {"title": "Gmail contact sync", "thread": [{"postID": "post5212343", "text": "I try all my possible ways but can not get sync my gmail contacts with my phone, my one is a Huawei P9 Plus Chinese version, hope anyone can help me\nThanks", "time": "06-06-2016 03:19 PM", "replies": []}, {"postID": "post5213993", "text": "Welcome to Android Central! Go to Settings>Apps>All. Is Google Play Services installed? The Chinese version might not be Google Play certified, which means it might have issues with Google syncing.\nGo to Settings>Accounts​. Tap Google if you see it, then see if the Contacts option is switched on.", "time": "06-07-2016 07:01 PM", "replies": []}, {"postID": "post5267117", "text": "I literally just posted this question, and didn't see this. im having the same problems, any help would be great", "time": "07-15-2016 04:49 PM", "replies": []}]}, {"title": "Huawei P9 Lite facing call recording issue. How do I record audio calls?", "thread": [{"postID": "post5264980", "text": "Dear all,\nusing Automatic Call recorder by Appliqato, also add app in protected app.\n1: Poor voice Quality recording.\n2: In Setting automatically change from \"voice call\" to \"Voice Communication\"\nalso try other apps but still facing audio/voice quality too low and noise issue.\nkindly guide me. How to record audio calls.\nthanks.", "time": "07-14-2016 10:39 AM", "replies": []}, {"postID": "post5266037", "text": "Moved to the P9 forum (which is close enough to the P9 Lite).", "time": "07-15-2016 12:43 AM", "replies": []}]}, {"title": "Huawei p9 users opinions plz?", "thread": [{"postID": "post5255111", "text": "Hello p9 fans\nNeed your honest opinion please\nI am thinking of buying the new p9\nBut i am confused between the p9 and the new oneplus 3?\nSo users who tried the p9 , plz tell me how is the battery life of this mobile. I always open the mobile data all day long and use my phone mainly for browsing, facebook,whats app and emailing.\nAnd all of these applications are used by the mobile data not wifi.\nSo how is the battery life time and how long is the screen on time using the mobile data and adjusting the screen brightness to below than medium?\nAlso how is the camera quality? Some say it is amazing and others say it is not of very high quality specially at night due to the absence of OIS. \nAlso how is the build quality of the metal used? Some reviewers said that it is flimsy metal that can happened to have scratches amd dents very easy. \nI had before the p8 and i suffer from scratches in the piece of glass covering the back camera ,so is it the same scenario in the p9?\nPlease i need honest opinions.\nI am using now my galaxy s7 but i dont like the quality of the phone as the home button is badly scratched after 4 months of usage.build quality is one of the main concerns to me.\nRegards.", "time": "07-07-2016 10:36 AM", "replies": []}, {"postID": "post5256225", "text": "P9 is an amazing phone , so far the only thing that I'm not to happy about is the iu, but I read somewhere that there is a huge update coming in September or around there , camera is great , build is great ,fingerprint sensor works good , no too much to complain about it , you can switch no another laucher in the meantime like nova while the update comes.good luck!\nPosted via the Android Central App", "time": "07-08-2016 09:30 AM", "replies": [{"postID": "post5256848", "text": "How is the battery life if using mobile data all day?\nHow much screen on time you can achieve if the screen brightness is adjusted to below medium?", "time": "07-08-2016 04:34 PM", "replies": [{"postID": "post5261630", "text": "Battery is fare, screen time depends on your settings , never had it below that.\nPosted via the Android Central App", "time": "07-12-2016 10:42 AM", "replies": []}]}]}]}, {"title": "Got my P9!", "thread": [{"postID": "post5165740", "text": "I was excited yesterday when I arrived at home to find my new P9 and free Huawei watch at home from Vodafone (UK). What a package! They even included an official Huawei case which was really nice. Anyway, 24 hours in and I'm very impressed with the package. Especially the battery life. It came off charge at 5am this morning, had a fair amount of use during my 1 hour each way commute and I've still got 43% battery left! I'm hoping to check out the camera in more detail tomorrow but if anyone has any questions please ask and I will try my best to answer!", "time": "05-07-2016 03:21 PM", "replies": []}, {"postID": "post5166344", "text": "I'll certainly be interested to know how the camera is. The Honor 5X's camera is pretty disappointing, so I hope they did a good job with this one!\nThe free Huawei Watch is a very impressive freebie. I have one, and it's very nice. Did you get it with the stainless steel band or leather?", "time": "05-08-2016 12:47 AM", "replies": []}, {"postID": "post5166547", "text": "I got the leather band included although I may look to upgrade to a stainless steel for the summer. I'm out and about today testing the camera, so far not blown away to be honest. It produces good photos but not as good as the hype!", "time": "05-08-2016 05:45 AM", "replies": []}, {"postID": "post5166549", "text": "The watch. Photo taken from P9 indoors with light only from a window.", "time": "05-08-2016 05:47 AM", "replies": []}, {"postID": "post5166559", "text": "Huawei P9 in the official View Flipcase. Really nice case!", "time": "05-08-2016 06:06 AM", "replies": []}, {"postID": "post5166580", "text": "One thing to note, Inbox by Google doesn't play nice with the P9. I had to go back to Gmail.", "time": "05-08-2016 06:31 AM", "replies": []}, {"postID": "post5166987", "text": "That case is pretty slick!\nIn what way does Inbox not play nice? One thing I noticed about my Honor 5X is that certain Google services seem to be very slow with syncing (even if I have them set to be excluded from Huawei's aggressive battery-saving efforts), like Calendar and Hangouts. Is that what you're seeing as well?", "time": "05-08-2016 12:22 PM", "replies": []}, {"postID": "post5167128", "text": "Yes, Inbox wouldn't sync unless I opened the app and synced manually, where as Gmail syncs instantly!", "time": "05-08-2016 01:48 PM", "replies": []}, {"postID": "post5167130", "text": "Wide Aperture shot with the cup in focus", "time": "05-08-2016 01:49 PM", "replies": []}, {"postID": "post5167133", "text": "Outdoor shot in sunny conditions", "time": "05-08-2016 01:49 PM", "replies": []}, {"postID": "post5167136", "text": "Selfie with 8MP front facing camera", "time": "05-08-2016 01:50 PM", "replies": []}, {"postID": "post5167140", "text": "Screenshot showing the home page with a really nice theme called Benbai", "time": "05-08-2016 01:53 PM", "replies": []}, {"postID": "post5211511", "text": "Awesome, mine should be arriving today!\nI ordered through CPW so aren't getting the watch but getting the Huawei Band instead TT_TT\nStill, looking forward to getting the handset! I'm a bit worried about going down to a smaller screen (using a Nexus 6 atm) but we'll see.", "time": "06-06-2016 03:19 AM", "replies": []}, {"postID": "post5230340", "text": "I'm enjoying the smaller screen, I had the 6P before and found it too big. It's nice to be able to use the screen with one hand while walking etc, something I couldn't do safely with the 6P!", "time": "06-19-2016 01:54 AM", "replies": []}, {"postID": "post5257323", "text": "Hi,\nI have a Huawei P9 Lite. Everytime I connect the phone to my PC, I have to manually go to the phone settings and select Media Transfer Protocol (MTP) under Select USB Configuration, then only I can transfer files to and from the phone and PC. How do I setup the phone so that I don't have to manually set these options every time I connect the phone to my PC? Pls help thanks.\nFrom a frustrated Huawei P9 Lite user.", "time": "07-09-2016 01:30 AM", "replies": []}]}]
[{"title": "Can't tranfer music into USB music folder", "thread": [{"postID": "post5253825", "text": "I jus bought a Huawei P9 Lite, I connect it with USB into my computer, I open the files, the files appear, I go to the Music folder, I try to drag mp3 files into the folder, but it doesn't work. I'm having a small stop symbol when I try to drag it in. I've been searching everywhere but there's no answer. Can someone please help me out?", "time": "07-06-2016 01:07 PM", "replies": [{"postID": "post5253866", "text": "Instead of dragging and dropping, can you copy and paste?\nAlso, what kind of connection is it? Can you put any files on to the phone? Maybe you need to switch the setting to MTP? What kind of computer are you using?", "time": "07-06-2016 01:29 PM", "replies": []}, {"postID": "post5257322", "text": "Hi xsparkzx, how did u manage to connect your phone to your PC? I have to manually choose under Settings, Select USB Configuration, Media Transfer Protocol (MTP) everytime I connect to PC. Is there any way to setup so that it automatically connects to PC? I don't hv this problem with my previous phone, Samsung Galaxy Mega 2. Pls help thanks. \nRainer", "time": "07-09-2016 01:28 AM", "replies": []}]}, {"postID": "post5253905", "text": "Oh my god I'm so stupid for not trying to copy paste instead. It worked, thanks man!", "time": "07-06-2016 01:43 PM", "replies": []}]}, {"title": "can't change to nova launcher", "thread": [{"postID": "post5243107", "text": "For some reason the system is not letting me have nova laucher as de default one , when I click to set nova as default inside nova settings nothing happens. \nAlso , does anybody knows how to change themes on this phone? Thanks in advance!\nPosted via the Android Central App", "time": "06-28-2016 11:14 AM", "replies": []}, {"postID": "post5243209", "text": "In the main System Settings, is there an option called Home? If so, tap that, then tap Nova as your default launcher.\nYou can find instructions on themes on pg 37 of the manual: http://download-c.huawei.com/downloa...Code=worldwide (I downloaded it myself to read, and it appears safe.)", "time": "06-28-2016 12:24 PM", "replies": []}, {"postID": "post5243242", "text": "You could try these instructions to set Nova as default.\nPress Home - settings - apps - tap on the Advanced tab at the bottom of the page - Default App Settings - Launcher - select Nova and confirm. Next time you press Home it should switch to Nova and stays as default. Tell us how it goes.", "time": "06-28-2016 12:47 PM", "replies": []}, {"postID": "post5243346", "text": "Thanks guys ! I will try those options.\nPosted via the Android Central App", "time": "06-28-2016 01:59 PM", "replies": []}]}, {"title": "Slow motion export / share", "thread": [{"postID": "post5241796", "text": "Hi everyone, \nI've contacted Huawei a few times, but haven't got an answer.\nDoes anyone know why the P9 does not support exporting or sharing slowmotion videos? I can only share it on google+, if I do it on instagram, facebook or simply copy and play it on my pc, it is in regular speed, now slowed down.\nWhat's the point of this function then? Samsung S6 can record the same and simply exports it.", "time": "06-27-2016 12:57 PM", "replies": []}]}, {"title": "Huawei announces the P9 Plus.", "thread": [{"postID": "post5108120", "text": "Huawei announces the P9 Plus in tandem with the P9. From the blog: Huawei announces the P9 and P9 Plus with dual Leica cameras | Android Central", "time": "04-06-2016 09:34 AM", "replies": [{"postID": "post5117772", "text": "Sweet looking phone!", "time": "04-11-2016 07:31 AM", "replies": []}]}, {"postID": "post5120456", "text": "I'm seriously tempted....... I have a mate 8 at the moment, if the battery life is as good as this, it's a done deal 👍\nPosted via the Android Central App", "time": "04-12-2016 12:34 PM", "replies": []}, {"postID": "post5179920", "text": "How long huawei phones get sw updates (including new android updates)?", "time": "05-16-2016 09:18 AM", "replies": [{"postID": "post5237842", "text": "Anyone know the answers to this question?\nPosted via the Android Central App", "time": "06-24-2016 07:37 AM", "replies": []}]}]}, {"title": "Why is my camera freezing and photos turning into green lines?", "thread": [{"postID": "post5213635", "text": "Issue:\nOpen camera (stock) on the P9 and take photo, shows up in the gallery box in corner, if I exit camera photo is fine. The problem arises if I then try to take another photo straight after the first i.e. person didn't smile the camera won't take a photo and when I exit and re-enter camera (or gallery) the photo is just green lines. \nI've played around with settings and changed memory card but am still getting the same issue, is there something I'm not doing setting wise or is it a fault with the camera?\nThanks in advance.", "time": "06-07-2016 02:34 PM", "replies": []}, {"postID": "post5213654", "text": "Do not save photos directly to the memory card; save to internal memory and then move them later if you must.\nAlso, it is possible that your SD cards are not of the required speed class. See How to Buy an SD Card: Speed Classes, Sizes, and Capacities Explained for helpful info.", "time": "06-07-2016 02:46 PM", "replies": []}, {"postID": "post5213679", "text": "Thanks for the reply, but I should have said I tried that, first thing I did, I've had a similar issues before with memory cards.", "time": "06-07-2016 03:02 PM", "replies": []}, {"postID": "post5230339", "text": "Not exactly the same problem but I'm finding the camera incredibly slow to open and take photos. It's annoying when you're trying to take a quick photo and end up missing it because your waiting 10 seconds for the app to open then another 10 secs for the shutter to activate!", "time": "06-19-2016 01:53 AM", "replies": []}]}, {"title": "Why is my camera freezing and photos turning into green lines?", "thread": [{"postID": "post5213626", "text": "Issue:\nOpen camera (stock) on the P9 and take photo, shows up in the gallery box in corner, if I exit camera photo is fine. The problem arises if I then try to take another photo straight after the first i.e. person didn't smile the camera won't take a photo and when I exit and re-enter camera (or gallery) the photo is just green lines. \nI've played around with settings and changed memory card but am still getting the same issue, is there something I'm not doing setting wise or is it a fault with the camera?\nThanks in advance.", "time": "06-07-2016 02:25 PM", "replies": []}, {"postID": "post5213676", "text": "Duplicate post - see http://forums.androidcentral.com/hua...een-lines.html", "time": "06-07-2016 03:01 PM", "replies": []}]}, {"title": "Huawei p9 with Virtual Reality glasses (VR)", "thread": [{"postID": "post5212836", "text": "Hi yah all!!\nI got the p9 and i wanted to get the most out of it. I was playing around and trying out different settings when i got the phone, something i think most of us do. After some weeks i ordered VR - glasses something that gave me a pain in the head, because it did not seem to work correctly. And i write here because i guess some of you are just as lost as i am and don't know why this happened, but finally i find the solution and that was as simply that my screen resolution was set down. \nTo check this go to:\nSettings - Advanced Settings - Battery Manager \nAnd if the ROG power saver is on, turn it of. \nThen it will work perfectly.\nBut if you want to keep it on for some reason, you can use this and scan in Google Cardboard:\nI use the Blitzwolf VR glasses and they work really good, and are comfortable to use, be aware that this are not advanced glasses so you have no buttons.", "time": "06-07-2016 01:12 AM", "replies": []}]}, {"title": "P9 not connecting to Band D6B, how do I turn on the bands bluetooth?", "thread": [{"postID": "post5206338", "text": "Hi \nJust got an issue with the band i received with my phone.. \nI have tried to follow the instructions to connect it but it still wont work..\nWhen ever i switch the band on it tells me that the bluetooth is turned off but offers no options that i can see to turn it back on..\nI use the android wear app and that still wont connect to the band...\nHow do i turn the bands bluetooth on?\nCheers\nChip", "time": "06-02-2016 06:58 AM", "replies": []}]}, {"title": "Huawei P9 Cases", "thread": [{"postID": "post5194833", "text": "I want to get this smartphone as a gift to a friend of mine and I'm looking for some cases that can provide good protection but won't be too bulky. Did any of you guys had a chance to try this device with protective cases?", "time": "05-25-2016 08:55 AM", "replies": []}, {"postID": "post5199489", "text": "If you gonna gift a mobile to your friend don't gift it along with the case, Cause they might or might not know how good the P9 looks on hands. Let them enjoy and people ask them when you bought this one (IMO). If you need to protect it from the scratches, try total body screen protectors. One of my suggestion is Gadgetshieldz. I'm using it on my S7 without any problem.Huawei P9 Screen Protectors, Cases, Covers | Full-Body Invisible Shields | Gadgetshieldz", "time": "05-28-2016 04:29 AM", "replies": []}]}, {"title": "How can I get this phone if I live in the USA?", "thread": [{"postID": "post5175715", "text": "Want this phone but as you all know here in the states is not for sale yet , any options? Thanks\nPosted via the Android Central App", "time": "05-13-2016 11:59 AM", "replies": []}, {"postID": "post5176177", "text": "Import it? From eBay or Amazon? Most likely will be very expensive and you will have to double check that the correct network bands are supported.", "time": "05-13-2016 04:16 PM", "replies": []}, {"postID": "post5197169", "text": "Will it work with att and tmobile?\nPosted via the Android Central App", "time": "05-26-2016 02:49 PM", "replies": []}, {"postID": "post5198298", "text": "You can take a look for yourself here. WillMyPhoneWork.net - Check if your phone works on a network\nIf you want to deal with English language customer service, I would suggest going through a UK seller. I haven't used them but I've heard Clove and Handtec are also pretty good.", "time": "05-27-2016 09:30 AM", "replies": []}]}, {"title": "Huawei P9 , Power consumption?", "thread": [{"postID": "post5189909", "text": "My Huawei P9 phone is now 3 days old and i´m wondering why battery drains so fast, even in stanby. I charged phone full 100% an after few hours there is 70 - 80% power left.(idle) I have a\"clever\" battery profile in use an there is no any \"lot of power\" using apps running.\nIs this normal stituation or am i middle of troubles?\nThank You", "time": "05-22-2016 07:57 AM", "replies": []}, {"postID": "post5190202", "text": "For the first few charge cycles (100% to when the phone shuts off), the drain may seem a bit high. Also some apps may be updating in the background, which will increase the battery drain. And check the Battery in \"Settings\" - tap the graph to get to the next page and look at the mobile signal line at the bottom. If it's anything but solid green or white, the phone's transmitter is running at higher power because the signal is weak, and that uses more battery too.", "time": "05-22-2016 12:13 PM", "replies": []}, {"postID": "post5190584", "text": "Welcome to Android Central! Seeing some battery stats may be helpful. Charge up to 100%, then let it drain to 20-30% with normal usage, without charging in between. Then show us:\n1. The main Settings>Battery screen.\n2. The fullscreen battery graph screen (which shows Awake time and Cell Signal Strength).\n3. The Screen category (to see total Screen On time).\n4. The Cell Standby category, if present (to see Time Without Signal).http://forums.androidcentral.com/amb...d-central.html", "time": "05-22-2016 04:23 PM", "replies": []}, {"postID": "post5191041", "text": "Thank you for your help, i.ll think problem is solved now. Factory reset performed and maybe themes causes abnormal power leak.", "time": "05-22-2016 11:25 PM", "replies": []}, {"postID": "post5194611", "text": "I had the same issue and turning off the backup made a huge difference", "time": "05-25-2016 06:01 AM", "replies": []}]}, {"title": "B135 update changelog", "thread": [{"postID": "post5149029", "text": "Of course I get EVA-L09C432B135 right before we're about to publish our review. Here's the full changelog:", "time": "04-27-2016 10:24 AM", "replies": []}, {"postID": "post5187474", "text": "B136 is also live. Change log attached.\nPosted via the Android Central App", "time": "05-20-2016 02:34 PM", "replies": []}]}, {"title": "Already got mine!", "thread": [{"postID": "post5142141", "text": "Preordered the P9 a few weeks back and yesterday it was delivered, which is weird since officially sales start on the 29th over here. Oh well it's not like I'm complaining . \nAnyways after a day of use I'm very happy with it, also got the Huawei Watch (free with the preorder) and liking that as well. A bit of an adjustment coming from an Iphone 6 Plus but I've really missed Android. Android Auto also works a lot better(once you get it set up) than Apple Carplay in my opinion.\nHaven't had too much time to play with the camera yet since the weather has been pretty uninspiring but here's a few shots for the interested (auto mode/monochrome, no editing).\nFull size: http://i.imgur.com/gbNivCC.jpg\nFull size: http://i.imgur.com/NETPVj9.jpg\nFull size: http://i.imgur.com/b7EgT6N.jpg\nI'll post more shots once I have the time to really dig into the camera.", "time": "04-23-2016 08:15 AM", "replies": []}, {"postID": "post5142151", "text": "Awesome! Great shots - Thanks or sharing!\nGive us some more thoughts after a few days of use.", "time": "04-23-2016 08:28 AM", "replies": [{"postID": "post5142162", "text": "Will do. \nEdit: PS: Would be nice to have the device added to the device list in the profile options", "time": "04-23-2016 08:35 AM", "replies": []}]}, {"postID": "post5143388", "text": "Few more shots from yesterday, the camera was really the main reason I went with Huawei and so far I'm pretty happy, the Lack of OIS is a shame though. These are shot with various settings but are unedited.", "time": "04-24-2016 05:21 AM", "replies": []}, {"postID": "post5155197", "text": "Hi Aldorfin,\ncan you post more pictures made during day and night also. If made in auto mode or special settings.\nI am interested in P9, but not sure if camera is so good or S7 is better. Most reviews are not real, they get paid...so just a real review and pictures tell the truth.\nPlease post a review about phone and most important about pictures and put more pictures in different situations, daylight, low light, night.\nThank you !", "time": "05-01-2016 11:13 AM", "replies": [{"postID": "post5162088", "text": "Hi,\nHere's a few more pictures, I don't really have that many pictures from different situations yet but at least I found some good light . I'm going to Croatia tomorrow and will try to post some thoughts about the phone, and more pictures, once I get back.\nEDIT: PS. those are all shot in auto mode from what I remember.\nThe only real problems I've had with the camera so far is the slight loss in detail when it gets really dark and sometimes you get pretty bad lens flares in direct sunshine.", "time": "05-05-2016 10:26 AM", "replies": []}]}, {"postID": "post5162560", "text": "I made a flickr album where I'll be uploading photo's taken with the P9 if you're interested:https://flic.kr/s/aHskw2HpBu", "time": "05-05-2016 02:50 PM", "replies": []}, {"postID": "post5165359", "text": "Hey, \nKnow you know if the phone works with qualcomm QC? I know it's kirin and not SD but just wanted to see if it will still accept fast charge from qualcomm spec charging bricks.\nPosted via the Android Central App", "time": "05-07-2016 10:21 AM", "replies": [{"postID": "post5186917", "text": "No, mine is not accepting QC certified charger.", "time": "05-20-2016 07:03 AM", "replies": []}]}]}, {"title": "Quick Charging", "thread": [{"postID": "post5184081", "text": "I have the P9 and I really like it. My only gripe is that the supplied charger is 5V/2A. \nI heard the P9 has fast charging, but does this support Qualcomm QC chargers or just Huawei fast charging tech? \nThanks to anyone that can test this\nPosted via the Android Central App", "time": "05-18-2016 03:46 PM", "replies": [{"postID": "post5186909", "text": "I have a QC Certified 2.0 charger and yes, it does not charge phone at fast charging rates. But I work at sales and I have a P9 presentation for training, so it supports 9V 2A charging, but it is a Huawei's tech not compatible with QC chargers. You need to buy Huawei's charger, but it is hard to get.", "time": "05-20-2016 06:56 AM", "replies": []}]}, {"postID": "post5184688", "text": "I think it's just the P9 Plus that supports fast charging. I have one and a fast charger and it doesn't do anything.", "time": "05-18-2016 10:37 PM", "replies": []}]}, {"title": "Huawei P9 ~ spare usb c cable ?", "thread": [{"postID": "post5185021", "text": "Can anyone recommend a good usbc cable I can buy as a spare for my P9 ? I tried the anker cable but its not as good a fit as the cable supplied with the handset and \"wiggles\" (-:", "time": "05-19-2016 06:21 AM", "replies": []}, {"postID": "post5186022", "text": "Welcome to Android Central! Benson Leung's Google+ page is good to follow, since he is the Google guru of USB-C cables. He has extensively reviewed cables to warn consumers of those that are not up to spec (and therefore potentially dangerous). https://plus.google.com/+BensonLeung", "time": "05-19-2016 05:17 PM", "replies": []}]}, {"title": "Touch Screen Response", "thread": [{"postID": "post5184693", "text": "Any of you folks with a P9 find that the touch response is sometimes not the best. I have found that if you touch the screen very lightly that it doesn't respond and needs a more deliberate touch than other devices. Like the Oppo R7 Plus that I'm using to post this. Thinking of returning it as a consequence - note that Wired commented the same in their review.", "time": "05-18-2016 10:40 PM", "replies": []}, {"postID": "post5184805", "text": "Solved I think by turning on the Glove function.", "time": "05-19-2016 01:07 AM", "replies": []}]}, {"title": "In which color the Huawei P9 looks the best?", "thread": [{"postID": "post5116349", "text": "", "time": "04-10-2016 12:38 PM", "replies": [{"postID": "post5123158", "text": "Welcome to Android Central!\nI am particular to a black phone, it tends to make it look slimmer and smaller than it actually is.", "time": "04-13-2016 02:53 PM", "replies": []}]}, {"postID": "post5165931", "text": "I would say the grey looks the best. It looks great at the front, just one slab of back glass.", "time": "05-07-2016 05:25 PM", "replies": []}]}, {"title": "Huawei P9 Plus uk", "thread": [{"postID": "post5145766", "text": "any news if this is coming out", "time": "04-25-2016 04:00 PM", "replies": []}, {"postID": "post5146481", "text": "Yes - check O2's website, they have it in the \"coming soon\" section.", "time": "04-26-2016 03:18 AM", "replies": []}]}, {"title": "P9 Plus specs", "thread": [{"postID": "post5108148", "text": "Here is the spec sheet about the P9 Plus: Huawei P9 and P9 Plus specs | Android Central\n3400 battery and USB C is pretty nice. The display differences are interesting.", "time": "04-06-2016 09:42 AM", "replies": []}, {"postID": "post5108349", "text": "Yes, I'm intrigued that they've chosen LCD for the smaller and OLED for the larger. There doesn't seem to be any obvious reason.\nPosted via the Android Central App", "time": "04-06-2016 11:37 AM", "replies": []}, {"postID": "post5115600", "text": "Yes yes, but will it work on Verizon LTE?", "time": "04-09-2016 11:52 PM", "replies": []}]}, {"title": "P9 Specs", "thread": [{"postID": "post5108143", "text": "The specification sheet for the P9: Huawei P9 and P9 Plus specs | Android Central\n3000 mAh battery, and USB C is pretty nice.", "time": "04-06-2016 09:41 AM", "replies": []}, {"postID": "post5109211", "text": "No NFC, but who use that anytimes today?", "time": "04-06-2016 06:39 PM", "replies": []}, {"postID": "post5109305", "text": "Lack of NFC would mean that Android Pay could not be used.", "time": "04-06-2016 07:30 PM", "replies": []}, {"postID": "post5109527", "text": "As always, a compromise has to be made when trying to hit a specific price point. In this case, NFC was benched.", "time": "04-06-2016 09:38 PM", "replies": [{"postID": "post5109545", "text": "The cheapest P9 is €599, which is $683, so I don't see why there would be any compromises needed for something that expensive.", "time": "04-06-2016 09:46 PM", "replies": [{"postID": "post5109554", "text": "True, but wasn't there a price discrepancy in the Moto X Play (I think that was it)? It was cheaper in the US due to certain taxes that didn't apply as they do in Europe.", "time": "04-06-2016 09:52 PM", "replies": [{"postID": "post5109557", "text": "I'm not sure, but that could be the case. I just Googled and found this, so we're talking about prices similar to those of the Samsung Galaxy S7.", "time": "04-06-2016 09:55 PM", "replies": [{"postID": "post5109576", "text": "Perhaps Huawei is going with: 'Shoot for the moon; if you miss, you will land among the stars'", "time": "04-06-2016 10:07 PM", "replies": []}]}]}]}]}, {"postID": "post5110266", "text": "Everytime I think I've found the perfect phone for me, when I look deeper at the specs there are some compromises. To be expected but some of these are strange.\n- NFC on single-sim but not on dual-sim versions (can't figure out how they are connected, Samsung and Xiaomi can manage both together)\n- Dual-sim: 32GB/3GB version supports less network bands than the 64GB/4GB version (why?)\n- Dual-sim 64GB/4GB version on comes in a single colour, Haze Gold! (never been a fan of gold phones)\nAlso, a couple of questions I hope someone can help with regarding dual-sim:\n1. 4G+3G or 4G+2G?\n2. What does dual-standby mean compared to dual-active? (from what I've read dual-active means 2 radios so both sims can receive/make calls at the same time but uses more battery life. Dual-standby means can only receive/make calls from 1 sim at a time which is fine with me but what is confusing is can you receive calls and sms on one sim whilst using data on the other sim at the same time?)\nThanks", "time": "04-07-2016 09:04 AM", "replies": []}, {"postID": "post5110539", "text": "The dual sim is probably the second guess. Duals usually are.", "time": "04-07-2016 11:13 AM", "replies": []}, {"postID": "post5112439", "text": "Just to let you guys know.\nThe Huawei P9 supports Band 12 on T-Mobile and Band 17 on AT&T, alongside B2 and B4 on both.Note that only the single-sim variant alongside the 64GB dual-SIM variant supports the above bands. The 32GB dual-SIM variant doesn't.\nAnd while the phone does support some LTE bands used by Sprint, US Cellular and Verizon, it apparently does not work on their CDMA network, so if you're on either of those carriers, this phone is a pass unless Huawei makes a version that works on both GSM and CDMA networks for its upcoming official Stateside launch.http://forums.androidcentral.com/hua...7-support.html", "time": "04-08-2016 09:07 AM", "replies": []}]}, {"title": "If you're wondering whether the Huawei P9 has B12/17 support...", "thread": [{"postID": "post5110572", "text": "...This was on Unbox Therapy.\nAccording to the spec sheet, Band 12 (T-Mobile) and Band 17 (AT&T) seem to be fully-supported on the P9.\nThis may vary between different variants of the same phone, however.\nIf you're thinking of importing the device (it's going to cost a pretty penny, however), the P9 might be a safe bet.", "time": "04-07-2016 11:27 AM", "replies": []}, {"postID": "post5112262", "text": "Get hype, great news, I know what my next phone will be\nPosted via the one and only Honor 5x", "time": "04-08-2016 07:23 AM", "replies": []}, {"postID": "post5112377", "text": "Yeah, definitely variant dependent. Got this from the Huawei website:\nDual-sim 4GB version seems to support the most bands but also no NFC and only a single colour.", "time": "04-08-2016 08:38 AM", "replies": [{"postID": "post5112417", "text": "Thanks for the extra bit of information.\nYeah, it looks like you'll need to get either the single-SIM or the 64GB dual-SIM version just to ensure that LTE bands on many major US carriers are supported by the phone.\nAnother thing I noticed is \"3G-TD-SCDMA\". Does this actually support CDMA?\nUPDATE: Checked FreqCheck and it apparently doesn't work on Sprint and Verizon's CDMA network. So if you're on either of those carriers, this phone is a pass.", "time": "04-08-2016 09:01 AM", "replies": []}]}]}, {"title": "Huawei announces the new P9", "thread": [{"postID": "post5108038", "text": "Looks like it might have a really good camera. From the blog: Huawei announces the P9 and P9 Plus with dual Leica cameras | Android Central", "time": "04-06-2016 08:50 AM", "replies": []}, {"postID": "post5108053", "text": "Have been looking forward to this announcement!\nP9 looks promising (not interested in the P9 Plus). Here are my positives so far:\n- Quite compact (a little taller than I would have liked but only a couple of millmeters more than the S7 and Mi 5)\n- 5.2\" 1080p and 3000mAh battery is good.\n- No glossy plastic or shiny grubby glass on the back (Yes!!!), and plenty of colour choices.\n- Dual SIM version\n- 3GB/32GB or 4GB/64GB version\n- Dual-camera sounds interesting\n- Support for 18 LTE bands!\n- Optimised file system (so hopefully no lag over time, wonder if this is similar to UFS 2.0?)\nIR Blaster but not sure if it is only on the Plus version?\nMay be my next phone. Just need to know the price...", "time": "04-06-2016 08:59 AM", "replies": []}, {"postID": "post5108121", "text": "It does look like to be an interesting phone.", "time": "04-06-2016 09:35 AM", "replies": []}, {"postID": "post5108342", "text": "I looked at a site promising to reveal the price, but it did not😠. So I'll guess at £400 for the P9 in the UK.\nPosted via the Android Central App", "time": "04-06-2016 11:32 AM", "replies": []}]}, {"title": "Hands on with the P9", "thread": [{"postID": "post5108130", "text": "The blog published a hands on article with the P9: Huawei P9 + P9 Plus hands-on: Dual cameras in Huawei's new high-end duo | Android Central\nBoth look to be like a couple of pretty good devices.", "time": "04-06-2016 09:38 AM", "replies": []}, {"postID": "post5108237", "text": "I'm excited to see a good photo comparison to see if those dual cameras really make that much of a difference.", "time": "04-06-2016 10:37 AM", "replies": []}, {"postID": "post5108338", "text": "Very interesting devices for photography buffs. They've used the Summarit name, I see. The original Summarit was a 7-element 50mm f1.5 first produced in the 1930's, but there have been other Leica lenses bearing the name since then.\nPosted via the Android Central App", "time": "04-06-2016 11:31 AM", "replies": []}]}]
