[{"title": "moto c plus software update", "thread": [{"postID": "post6080730", "text": "Iam using Moto C Plus which is now running in android 7.0 but in the motorola website it is shown that it was launched with 7.1.1 which turns out to be a lie. I want to know that will i get an update or not?", "time": "11-22-2017 04:44 AM", "replies": []}, {"postID": "post6081167", "text": "on GSMArena it's 7.0", "time": "11-22-2017 11:39 AM", "replies": []}, {"postID": "post6081208", "text": "Moved from the Nexus 4 forum to the Moto C Plus forum.\nIt says Android 7.0 here as well: http://forums.androidcentral.com/e?l...token=yURFW5Sf", "time": "11-22-2017 11:57 AM", "replies": []}]}, {"title": "when will be new update released for moto c plus ?", "thread": [{"postID": "post5903844", "text": "my phone moto c plus running on nougat 7.0 stock android version. whether my phone will get 7.1.1 update ???/", "time": "07-29-2017 01:46 AM", "replies": []}, {"postID": "post5919099", "text": "I doubt it. C Plus will remain on 7.0 its entire life. \nLenovo should have definitely atleast updated it to 7.1.1 but they won't.", "time": "08-10-2017 10:35 AM", "replies": []}]}, {"title": "OFFICIAL: Moto C and Moto C Plus", "thread": [{"postID": "post5815606", "text": "it's official: Get the Trusted Essentials You Crave with the new Moto C & Moto C Plus - The Official Motorola Blog", "time": "05-15-2017 11:29 AM", "replies": []}, {"postID": "post5815612", "text": "I think these devices will appeal to folks who like smaller phones, since there aren't many smaller phones at this time.", "time": "05-15-2017 11:33 AM", "replies": [{"postID": "post5818612", "text": "I hate that we have come to the point where 5 inch phones with big bezels are considered small. \nActually to put things into perspective this phone is almost as big as the LG G6. Hardly a small phone by any standard. \nAnyway i have a few things to say about this new Moto C phones. \n1. Why not blue color? I really like cyan or sapphire blue or some variation of blue. Why only gold, black, white and red? I want blue! \n2. Would have preferred a smaller screen but i see why they went with a big screen. Because bigger is always better and that's what sells these days but i would have been happy with even a 4.7\"display. \n3. 1gb ram? Is this 2014? Thankfully my country will get the 2gb ram variant so that's good. \n4. Am 100% sure Lenovo will not update this to Android O. \nYeah that's about it. Looks like a decent upgrade from my 1st gen Moto E but a smaller size would have been nice.", "time": "05-17-2017 01:10 PM", "replies": [{"postID": "post5818631", "text": "I wouldn't expect OS upgrades at this price point.", "time": "05-17-2017 01:33 PM", "replies": []}]}]}, {"postID": "post5818815", "text": "I would consider this small compared to the 2015 MXPE.", "time": "05-17-2017 04:00 PM", "replies": [{"postID": "post5819164", "text": "I consider 2015 MXPE small compared to the Sony Xperia XA1 Ultra.", "time": "05-17-2017 08:50 PM", "replies": []}]}, {"postID": "post5823758", "text": "One hand usability will be difficult due to the big size. Still a pretty decent phablet for the price.", "time": "05-21-2017 11:59 PM", "replies": []}, {"postID": "post5827389", "text": "I just noticed it comes with Android 7.0. I don't understand why they didn't provide 7.1.1? There are so many security fixes included in 7.1.1, any chance of an official 7.1 update? 7.0 is ancient.", "time": "05-25-2017 04:01 AM", "replies": [{"postID": "post5827737", "text": "What about security patch levels?", "time": "05-25-2017 10:42 AM", "replies": []}]}, {"postID": "post5838231", "text": "Moto C has been officially launched in India for $94. Its the 4G model. \nIt is quite overpriced. Selling a $50 phone for $94.", "time": "06-04-2017 03:10 AM", "replies": [{"postID": "post5840108", "text": "It's supposed to be $50?", "time": "06-05-2017 08:59 PM", "replies": [{"postID": "post5845532", "text": "Its official price is $90 which correctly translates to 6000 rupees but my point is this phone isn't worth that much based on the specs. \nBased on the specs this phone should be at most $50. \nThe specs are worse than Moto E 2nd gen which is 2 yrs old and people were buying that phone for $20 unlocked at various places.", "time": "06-10-2017 02:30 AM", "replies": [{"postID": "post5848046", "text": "I don't think I've seen it as a direct currency conversion. \nFor example, in India the Moto Z2 Play is ₹27,999. Current currency conversion to US dollars is $434.23.\nBut in the US, the Moto Z2 Play will be $499.99. \nI see articles saying that the Moto C will be ₹5,999. Motorola said the Moto C would start at €89. ₹5,999 comes out to €83.06. Nowhere did Motorola say this would be a $50 phone and you're assumption based on specs is incorrect.", "time": "06-12-2017 01:31 PM", "replies": [{"postID": "post5848391", "text": "Again i am not comparing us or euro prices with indian price. \nAm saying the phone is overpriced in general. \nEven if you ignore the $20-50 price of 2nd gen Moto E, there is still $80-100 G4 Play. G4 play has much superior specs. \nEven in India at the same price of 5999 there is the much superior Redmi 4A.\nEven my original Moto E which i bought for $100 has a higher resolution display than this 2017 phone. \nEither the price should have been lower (about $70/€70) or better specs. \nSurely you agree with that.", "time": "06-12-2017 06:48 PM", "replies": [{"postID": "post5848424", "text": "Are you quoting launch prices?", "time": "06-12-2017 07:23 PM", "replies": []}]}]}]}]}]}, {"postID": "post5855344", "text": "Moto C Plus has been officially launched in India at a price of 6999 which is approx $110 which is much better pricing than the Moto C which is priced at 5999 ($93).\nFor $17 more you get a much bigger battery, better rear camera, double the ram, fast charging and high definition display so its a much better value for money. \nRedmi 4 however is still better than Moto C Plus as it has SD435 and fingerprint sensor although it does not have the latest OS and its not stock Android which some people prefer. \nBoth are good options at same price.", "time": "06-19-2017 02:12 AM", "replies": []}]}, {"title": "Moto X 2013 vs Moto C Plus", "thread": [{"postID": "post5822250", "text": "Can the $120 2017 budget phone be better than $500 flagship from 2013? \nProcessor - No idea if Snapdragon S4 Pro would be better than Mediatek 6737. Maybe someone here can tell me. \nGraphics - Adreno 320 without a doubt is way better than Mali T720 \nDisplay - Moto X 2013 is better \nCamera - No idea which would be better\nBuild quality - Pretty sure Moto X would be better \nBattery life - Moto C Plus wins this easily\nLooks like other than battery life, Moto C cannot match up to the Moto X 2013.", "time": "05-20-2017 02:19 PM", "replies": []}, {"postID": "post5822285", "text": "yeah... I don't think they serve the same markets.", "time": "05-20-2017 03:03 PM", "replies": [{"postID": "post5822311", "text": "My point was to see if enough progress has been made that a budget phone of today can match or beat a flagship device from 4 years ago by the same company.", "time": "05-20-2017 03:38 PM", "replies": [{"postID": "post5822330", "text": "The Moto C is bottom, entry-level. Budget is still higher, like the Moto E/G.", "time": "05-20-2017 03:59 PM", "replies": [{"postID": "post5822401", "text": "Ok that makes sense. \nAlso can you explain why does it have physical capacitive navigation keys even though android hasn't needed it since ICS?", "time": "05-20-2017 05:09 PM", "replies": [{"postID": "post5822723", "text": "That's easy. It's not a requirement (to go with on-screen buttons).", "time": "05-21-2017 12:49 AM", "replies": []}]}]}]}]}]}, {"title": "First Generation Motorola Moto C (Moto C, Moto C Plus, Moto C 2017)", "thread": [{"postID": "post5755824", "text": "https://twitter.com/evleaks/status/851839362916642816\nfunction loadx(data) {\n  document.write(data.html);\n}\nhttps://venturebeat.com/2017/04/11/m...tphone-buyers/https://twitter.com/Slashleaks/statu...13726366941184\nfunction loadx(data) {\n  document.write(data.html);\n}\nhttps://twitter.com/Slashleaks/statu...13944537911296\nfunction loadx(data) {\n  document.write(data.html);\n}", "time": "04-12-2017 12:17 PM", "replies": []}, {"postID": "post5814579", "text": "https://twitter.com/evleaks/status/863580163153461249\nfunction loadx(data) {\n  document.write(data.html);\n}", "time": "05-14-2017 04:01 PM", "replies": []}]}]
