[{"title": "Moto G5 Plus with Consumer Cellular", "thread": [{"postID": "post6193423", "text": "Title should read Moto G5s Plus \nNeed to replace a Moto G 1st gen with a better phone on Consumer Cellular. \nCurrently CC has a crappy mid level phone option. We have found the Moto G5 Plus in our price range but CC says they can't guarantee text messaging or data would work. Is anyone using Moto G5s Plus on Consumer Cellular now? Any issues?\nWe are looking for a phone around $300 dollars with decent photo's along with data/texting with photo's!. My husband and I like to use similar phones. I already upgraded mine to a moto g4 a while back.\nAppreciate any feedback. thank you!", "time": "03-16-2018 02:51 PM", "replies": []}, {"postID": "post6193521", "text": "As far as I know CC uses AT&T's network and they specifically advertise that you can use any phone previously used on AT&T or T-Mobile. I have a G5S Plus on AT&T and use it with no issues. I really can't see you having any problems. Are you using a different carrier now?", "time": "03-16-2018 04:16 PM", "replies": []}, {"postID": "post6193682", "text": "Thank you so much for your reply!\nWe have been on Consumer Cell for years now. Our first smart phones were Moto G 1st Generation. Getting them programmed to work ...which we had to do ourselves was a major challenge and luckily folks on this forum helped us through it. Soon after that CC started carrying Moto G's ... now the just have on Moto E but appear to be moving away from them. \nThey do run a disclaimer both with the CSR and on the website that says non CC phones may not work with all features.... so ordering one from motorola makes us a bit nervous. \nJust reviewing the Motorola sight on compatibility ... http://forums.androidcentral.com/e?l...token=lUDdR4ZY\nNow having second thoughts... even the ATT has some with and some with out. ugh. \nWill have to stew on it some more. \nThank you again for your response. Any others are welcome too.", "time": "03-16-2018 06:20 PM", "replies": []}]}, {"title": "Disabling Googe Assistant", "thread": [{"postID": "post6191845", "text": "Moto G5 S plus 7.1.1\nThe home button has been hijacked by Google Assistant\nWhen I long press it no longer puts the phone to sleep but now launches GA.\nI turned off GA and now a long press asks if I want to activate GA.\nHow can I get rid of this nuisance?\nThanks,\nWV-Mike", "time": "03-15-2018 10:24 AM", "replies": [{"postID": "post6192149", "text": "Wait, wait, I think I found it. \nGo to settings - apps - gear icon - assist & voice input - tap on Assist app/Google - select 'none'. This will stop opening the Assistant after a long press on the home button (it will do nothing, though). The shorter long press will still lock the phone, as usual.", "time": "03-15-2018 02:40 PM", "replies": [{"postID": "post6192160", "text": "Thanks!!\n-mb", "time": "03-15-2018 02:51 PM", "replies": [{"postID": "post6192173", "text": "Glad it helped! \nI moved your thread to the Moto G5S & G5S+ forum.", "time": "03-15-2018 02:59 PM", "replies": []}]}]}]}, {"postID": "post6191880", "text": "I'm not sure if it can be disabled, I can't find a setting to do it. Usually the Assistant will open only if you hold the home button for a long time (2-3) seconds. If you hold it for no more than a second it should lock the phone.\nThe same applies if you enabled one-button nav or not.", "time": "03-15-2018 10:45 AM", "replies": []}, {"postID": "post6193524", "text": "I have one button nav enabled and never had that issue. Brief tap = home; slightly longer tap = lock/sleep; longer tap = GA.", "time": "03-16-2018 04:20 PM", "replies": [{"postID": "post6193529", "text": "Yep, same here.", "time": "03-16-2018 04:28 PM", "replies": []}]}]}, {"title": "AT&T 4G service - no indicator on home screen", "thread": [{"postID": "post6117905", "text": "I'm transitioning from a Blackberry Passport to the G5S Plus. I'm in the process of transferring my data and contacts over and when I took my AT&T SIM out of the Passport and put it into the G5S Plus everything worked but I get no indication that I'm getting 4G/LTE service like I have on all my previous devices.\nAny AT&T users of this device out there that can shed some light on this? \nThanks in advance for any info.", "time": "12-25-2017 08:43 PM", "replies": []}, {"postID": "post6117913", "text": "What options do you get in settings - more (wireless & networks) - cellular networks - preferred network type?", "time": "12-25-2017 08:58 PM", "replies": []}, {"postID": "post6117945", "text": "Hmmm... I'll have to put the SIM back next chance I get and take a look.\nI am still not 100% ready to switch devices full time! I will post an update when I get that SIM back in. \nThank you for your help thus far. This forum is invaluable.", "time": "12-25-2017 09:32 PM", "replies": []}, {"postID": "post6118226", "text": "Good morning, Bob... take a look at your APN settings - go to the Settings menu, and hit the \"...\" under Wireless & networks, then Cellular Networks -> Access Point Names. I found the correct settings here: https://www.att.com/esupport/article...less/KM1062162\nI'm using my G5S Plus with a prepaid plan from Mint SIM, and I had to enter APN settings manually, so that could be the case for you, too.\nLet us know whether any of these suggestions are helpful!", "time": "12-26-2017 08:15 AM", "replies": []}, {"postID": "post6118906", "text": "There is no \"preferred network type\" under cellular networks or anywhere else I can find.\nI only see \" Data roaming\" and Access Point Names\"", "time": "12-26-2017 10:57 PM", "replies": []}, {"postID": "post6118908", "text": "I will take a look at your link when I get time tomorrow. Thank you for that.\nI do see \"AT&T Nextgenphone\" under APN and it's selected. Since I just put my AT&T SIM back into this device a few minutes ago I now see an \"LTE\" indicator on my home screen, which I did NOT see the last time I put this SIM in a few days ago.\nSo it looks like there is some mystery going on here!\nIn any event, all seems okay now. I want to thank you all for the help and assistance!\nWhen I get the case I ordered a few days ago I will jump in and actually make this phone my daily driver and see how it goes.\nThanks again to all. You WILL be hearing from me again!", "time": "12-26-2017 11:01 PM", "replies": []}, {"postID": "post6193528", "text": "Just in case anyone sees this and has the same \"issue\" it seems that the LTE indicator does not display when on WiFi. My previous devices didn't behave that way and that was the source of my confusion.", "time": "03-16-2018 04:23 PM", "replies": []}]}, {"title": "Moto g5 s plus display wakes up with slightest movement", "thread": [{"postID": "post6008576", "text": "What is the purpose of having the phone lit up with such fine movement.it losed battery even on standby.4% within 5 hours of complete standby ,no apps running. I have not yet set up the phone.\nMy redmi 4 on the other hand loses just 1% or less during my sleep of around 7 hours with several apps running and IT Shows the notifications when they come up. No useless working the motion sensor.", "time": "10-06-2017 11:08 PM", "replies": []}, {"postID": "post6009107", "text": "Welcome to the forums. That's Moto Display in action. It doesn't use much battery at all and most people find this feature very helpful. If you don't like it you can disable it in the Moto app.", "time": "10-07-2017 11:09 AM", "replies": []}, {"postID": "post6109367", "text": "or just put the phone face down, it should disable it.", "time": "12-16-2017 09:50 PM", "replies": []}, {"postID": "post6183252", "text": "I love this feature, very useful.", "time": "03-08-2018 01:45 PM", "replies": []}]}, {"title": "G5S Plus updare", "thread": [{"postID": "post6176647", "text": "I woke up to this on my G5S Plus this morning", "time": "03-02-2018 08:00 AM", "replies": []}, {"postID": "post6177185", "text": "I received the same update yesterday. Moto/Lenovo have been disappointingly slow in issuing updates!", "time": "03-02-2018 04:14 PM", "replies": []}, {"postID": "post6183242", "text": "No update for me  Still on 116-24-4 (October 2017) here in the UK on my unlocked/unbranded G5S Plus.", "time": "03-08-2018 01:40 PM", "replies": []}]}, {"title": "One button navigation. Are you using it?", "thread": [{"postID": "post6072821", "text": "Recent Moto models include a new Moto Action that enable gestures on the fingerprint sensor. It's quite easy to turn this feature on and it will hide the standard navigation bar. \nMoto app - Actions - One button nav.\nOnce you enable this feature these are all the gestures/actions that you get.\nQuick touch - Home.\nLonger touch - Lock screen.\nTouch and hold - Google app/assistant.\nSwipe to the left - Back.\nSwipe to the right - Recent apps.\nThe option to switch between the two most recent apps is still there, now you just need to swipe twice to the right.\nI've been using this feature from day one, took me no time to get used to and never disabled it. For me it makes a big difference in real-world usage and you get a bigger screen without the on-screen nav keys.\nWhat do you think? Have you used it?\nMore info here:https://motorola-global-portal.custh.../30,6720,10165", "time": "11-16-2017 11:03 AM", "replies": []}, {"postID": "post6094263", "text": "Very helpful. Best feature existed for a real smartphone. Lenovo should buy BlackBerry.", "time": "12-03-2017 09:05 AM", "replies": []}, {"postID": "post6117903", "text": "I turned it on when I first got my phone and set it up. I'm not a button person, I like gestures and this feature makes life easier for me. Glad it's there.", "time": "12-25-2017 08:40 PM", "replies": []}, {"postID": "post6164145", "text": "I've been using since I got my phone, I love it! The extra screen real estate is awesome!", "time": "02-16-2018 08:55 AM", "replies": []}, {"postID": "post6168639", "text": "The Pixel 2 (I don't know about the original Pixel) allows pulling notifications down by \"pulling down\" on he sensor, and I have that enabled. Quite often my hand is holding the phone so that my finger is near the sensor (it's on the back), so it's easier to pull the notifications down that way. There are no other fingerprint gestures on the Pixel 2. Back and home would be nice, though.", "time": "02-21-2018 04:41 PM", "replies": []}, {"postID": "post6180938", "text": "I now use it and it feels a bit weird", "time": "03-06-2018 10:54 AM", "replies": []}, {"postID": "post6183241", "text": "I enabled it when I first got the G5S Plus, never looked back. Works very well indeed.", "time": "03-08-2018 01:38 PM", "replies": []}]}, {"title": "Received January security update", "thread": [{"postID": "post6176646", "text": "My G5S has been sitting in a drawer for a few weeks, so I decided to fire it up last night and check for Google Play Store updates, and was pleasantly surprised by a system update as well! It's now on the January 2018 security patch, and it listed a few other changes, but I didn't pay attention to those.\nUnfortunately, it's a month behind my Honor 7X, which just received the February patch about a week ago.", "time": "03-02-2018 07:58 AM", "replies": []}, {"postID": "post6177092", "text": "My G5S Plus just got that patch today. I just finished the update.", "time": "03-02-2018 02:38 PM", "replies": []}]}, {"title": "want visible, silent notifications", "thread": [{"postID": "post6171325", "text": "I can't work out a way of having visual, silent notifications. I want my ringtone loud and notifications unobstrusive. A slight beep would be OK.\nDoes anyone know a way?\nthanks", "time": "02-24-2018 06:44 PM", "replies": [{"postID": "post6171342", "text": "You can also go to Settings > Notifications and set them to be silent. Or Settings > Sounds and set your notification sounds to something brief.", "time": "02-24-2018 07:24 PM", "replies": [{"postID": "post6171379", "text": "actually the settings>sounds folder is empty.\nif you know of a brief, quiet notific ation, please let me know", "time": "02-24-2018 08:15 PM", "replies": [{"postID": "post6171402", "text": "When I go to Settings > Sounds I get the screen in the screenshot where I can select tones.\nI use the G5 Plus. Soft, Clear and Ivory are brief non-disturbing notification tones in the G5 Plus. Otherwise you can also download other soft tones from apps in the Play Store.", "time": "02-24-2018 08:52 PM", "replies": []}]}]}]}, {"postID": "post6171334", "text": "You should have a separate volume control for notification and ringtone. Push volume button, when the droop down volume appears, tap the arrow icon on the right corner which should give you another drop down...", "time": "02-24-2018 06:57 PM", "replies": []}]}, {"title": "G5S+ sound coming out of bottom speaker only - Not the earpiece (like the E4+)", "thread": [{"postID": "post6168479", "text": "I have an E4 Plus that plays sound out of the same speaker used for the speakerphone (the earpiece), which sounds great. The G5S Plus, however, only plays out of the bottom speaker (which the E4+ does not have). Unfortunately, the sound on the E4+ is much better, because it actually faces the listener.\nIs there any way to turn on the earpiece of the G5S+ so sound plays out of it - like it does on the E4+? I am sure sound would be better playing out of both speakers (earpiece and bottom speaker), but if that is not possible, the earpiece by itself would still be better than the bottom speaker alone.", "time": "02-21-2018 01:21 PM", "replies": []}, {"postID": "post6169770", "text": "Not possible, only the bottom speaker works", "time": "02-22-2018 07:58 PM", "replies": []}]}, {"title": "Problem with contact list on Motorola G5s", "thread": [{"postID": "post6168341", "text": "When I get phone calls from someone on my contact list sometimes it shows the name of the caller and sometimes just the number. Can I change it so that I always get the name of the caller?", "time": "02-21-2018 10:21 AM", "replies": []}, {"postID": "post6168633", "text": "Are you sure that the number of the caller you see in the notice and the number in your contact list are exactly the same? (Having a + in front of the number is enough to make the phone not recognize the caller - and some carriers sent a + sign in front of the number, even in the US, where it almost never makes sense.)\nAlso, if you have more than one number for a caller, only one of them will be recognized as that caller.", "time": "02-21-2018 04:37 PM", "replies": []}]}, {"title": "When Moto G5s Plus get Oreo Update? Is it possible to get in January?", "thread": [{"postID": "post6123776", "text": "Is it possible to get in January?", "time": "01-01-2018 08:09 AM", "replies": []}, {"postID": "post6123795", "text": "Nobody knows. It seems some users are getting an OTA update with the December security patch, so I guess Oreo could take a while to arrive.", "time": "01-01-2018 08:34 AM", "replies": [{"postID": "post6138018", "text": "Javier, have you received the December patch yet?", "time": "01-16-2018 02:24 PM", "replies": [{"postID": "post6138025", "text": "Not yet. A new update is being released for the G5S here, so it must be close for the Plus.\nI'll post here as soon as I get any news.", "time": "01-16-2018 02:32 PM", "replies": []}]}]}, {"postID": "post6138026", "text": "My bet, we'll jump straight to Oreo next month.", "time": "01-16-2018 02:34 PM", "replies": [{"postID": "post6138178", "text": "The G5 S Plus has received the Dec security patch in India some days back.", "time": "01-16-2018 07:21 PM", "replies": []}]}, {"postID": "post6155009", "text": "It's coming! https://www.xda-developers.com/motor...2-g5-g5s-more/", "time": "02-05-2018 11:52 AM", "replies": [{"postID": "post6155025", "text": "Cool! I wonder how long it’ll take them to roll it out world-wide.\nI’m switching my sim back and forth between the G5S and Honor 7X, and will likely stick with whichever one receives Oreo first.", "time": "02-05-2018 12:10 PM", "replies": []}, {"postID": "post6157597", "text": "It doesn't seem to be true as no one from Australia has confirmed this, according to XDA Forum threads.In fact, someone said that there's no Oreo update there on his Moto G5 Plus.", "time": "02-08-2018 08:26 AM", "replies": [{"postID": "post6157644", "text": "Yeah, read about that now. It seems it was just a click bait article and a hoax. Even big boys like XDA and GSMarena fell for it. Oh well.", "time": "02-08-2018 09:28 AM", "replies": [{"postID": "post6157649", "text": "It seemed quite unusual for Motorola to provide OS updates to all models together. OS updates and soak tests usually begin from Brazil and then India as I have seen in the past one year. \nThere hasn't been any news of soak tests either. Have you heard of soak tests in your country ?", "time": "02-08-2018 09:33 AM", "replies": []}]}]}]}, {"postID": "post6155119", "text": "And in the meantime ... Downloading January security patch as I type.", "time": "02-05-2018 02:04 PM", "replies": [{"postID": "post6163102", "text": "The G5S + is getting the January security update in India today along with the KRACK fix.", "time": "02-15-2018 06:05 AM", "replies": []}]}, {"postID": "post6155217", "text": "There’s nothing available here, but I’m sure it’ll come soon!", "time": "02-05-2018 04:07 PM", "replies": []}, {"postID": "post6157651", "text": "Yeah, only for the Z series.", "time": "02-08-2018 09:42 AM", "replies": [{"postID": "post6157742", "text": "Ok, thanks for the info. Nothing for the G series till now.\nBut hasn't some of the Z series models already received the official update?", "time": "02-08-2018 11:02 AM", "replies": []}]}, {"postID": "post6157749", "text": "Yeah, the Z2 Force was updated a time ago.", "time": "02-08-2018 11:05 AM", "replies": []}, {"postID": "post6158655", "text": "If it patches the crummy wifi performance of my g5s plus im all for it..if it doesnt moto can pound sand..", "time": "02-09-2018 11:46 AM", "replies": []}]}, {"title": "Moto G5S - no bt notification sent to smartwatch", "thread": [{"postID": "post6163015", "text": "Hello everyone!\nI'm using Moto G5S + Smartwatch Y1. Both devices are paired\nThe problem is that bt notifications are not being send to Smartwatch. There is no problem with SMS messages and calls, they are sent to smartwatch. \nI was trying many bt notification apps.\nDo you have any idea what can be the reason? Is it possible that something is blocking notifications to be sent out?\nRegards!", "time": "02-15-2018 02:05 AM", "replies": []}]}, {"title": "I have Moto g5 plus and I bought it 2 months back but frequently while trying to use camera it is gi", "thread": [{"postID": "post6161406", "text": "It is moto g 5 plus .", "time": "02-12-2018 11:32 PM", "replies": []}]}, {"title": "Moto 5GS Screen blacks out", "thread": [{"postID": "post6133176", "text": "I have been using Moto 5GS for last 3months and have been experiencing delay response and hangups. Today after finishing a call, screen just blacked out. Connected to battery bank and can see it is charging, however no response when I press any button. When tried to call the number in the phone, can hear ringing tone from the calling end, but from the receiving end, ie. Moto 5G, has no any sign of receiving calls. Did any one experience similar issues? is there any solution. pls share", "time": "01-11-2018 03:24 AM", "replies": []}, {"postID": "post6133180", "text": "Reboot!", "time": "01-11-2018 03:33 AM", "replies": []}, {"postID": "post6149568", "text": "Yes, happens to me on outgoing and incoming calls.eventually I can get it on with the power button but it can take 2 or 3 times getting the correct length push, and because the phone is ringing you can't answer it during all that. On an outgoing call from the car you can't tap \"speaker phone\" so one must fumble with the phone to amswer a call. This is dangerous! If one accidentally dials a call there is no to know it and no way to stop it. I have veen trying \"keep screen on\" apps but none of them help with this issue.\nI have changed all the settings and troubleshot the proximity sensor. It even happens in safe mode.", "time": "01-30-2018 07:56 AM", "replies": []}]}, {"title": "Changing the number of rings before voicemail", "thread": [{"postID": "post6128731", "text": "I changed the number rings before going to voicemail a long time ago but this phone for some reason rings, somewhat faintly twice before going to vibrate and then voicemail. I want to change b/c its rare that i can make it to, and answer my phone within two rings...\nI tired a couple of internet fixes that targeted the G4 and G5 plus models but no go. TIA", "time": "01-06-2018 12:29 PM", "replies": []}, {"postID": "post6129006", "text": "I'm assuming you've tried raising your ring volume and maybe changing your ringtone so that it's louder?", "time": "01-06-2018 07:07 PM", "replies": []}, {"postID": "post6129033", "text": "Contact your service provider, they can increase your ring time...\nYou also have codes you dial but I never had any success with that clumsy arrangement..", "time": "01-06-2018 07:48 PM", "replies": []}]}, {"title": "Custom ringtones and notification tones", "thread": [{"postID": "post6123605", "text": "I am trying to setup custom notification tones/ringtones for various apps. When I try to change the notification sound I am presented with a fixed list of stock ringtones with no way to select any others.\nI had previously copied all of my custom notification sounds/ringtones and put them in my \"ringtones\" folder, however there seems to be no way to access them.\nAm I missing something obvious, or is there no way to do this in Android. Maybe I've just been spoiled by Blackberry all these years. Thank you in advance for any light that can be shed on this.\nWishing everyone a happy and healthy new year.", "time": "12-31-2017 09:32 PM", "replies": []}, {"postID": "post6123784", "text": "Have you already tried restarting the phone? Sometimes it can take a little while before the system scan the new media files.", "time": "01-01-2018 08:20 AM", "replies": []}, {"postID": "post6124085", "text": "Put them in a Ringtones folder (and notifications in a Notifications folder). The upper case first letter makes a difference. (And either restart the phone or run an app like media.Re.Scan to make sure that your media is rescanned.)", "time": "01-01-2018 01:56 PM", "replies": []}, {"postID": "post6124369", "text": "I'll give those suggestions a try and let you know what happens. Thank you for the tips.", "time": "01-01-2018 08:39 PM", "replies": []}, {"postID": "post6124371", "text": "Actually, maybe I should ask if these files need to be a specific format to be recognized by the OS.", "time": "01-01-2018 08:44 PM", "replies": []}, {"postID": "post6125319", "text": "Reboot worked. I expected instantaneous results. Now I know. Thank you all!", "time": "01-02-2018 08:49 PM", "replies": []}]}, {"title": "Cases for G5S Plus", "thread": [{"postID": "post6034445", "text": "Considering getting this for my son, 'Kid Devlyn16', since he has basically killed my OG Moto X. However I need to know what the case options for it are? Do cases for the G5 Plus fit the G5S Plus? Seems that they do not, Thus since OtterBox does not have a commuter for it I will have to get something different", "time": "10-23-2017 02:00 PM", "replies": []}, {"postID": "post6034724", "text": "No, they don't fit, different sizes and camera in a different position. I just checked on my G5S+ the case my wife is using on her G5+.", "time": "10-23-2017 04:33 PM", "replies": []}, {"postID": "post6035536", "text": "I got the following case and screen protectors from Amazon for my Moto G5s Plus and they work great:\nMoto G5S Plus GS5+ Case, Cimo [Grip] Premium Slim Protective Cover for Motorola Moto G5S Plus GS5+ - Clear\nMoto G5s Plus Screen Protector, Wimaha 2 Pack 9H Tempered Glass Screen Protector for Motorola Moto G5S Plus Scratch Resistant Ultra Clear(Not fit for G5 Plus)\nI realize a clear case will yellow over time but at 8 bucks, I can replace it every 6 months or whenever needed. I just like being able to see that beautiful gold Moto phone. The case is also available in black.\nI have dropped the phone once onto asphalt and my case and screen protector did their job: no damage.", "time": "10-24-2017 05:56 AM", "replies": []}, {"postID": "post6121356", "text": "as-guard and cimo make slim cases that fit the g5s. And there less than $10..", "time": "12-29-2017 10:00 AM", "replies": []}]}, {"title": "Instagram App often crash on G5S Plus", "thread": [{"postID": "post6112622", "text": "I use Samsung 64 GB SD card as an internal storage (there are two options, standalone or internal), then when I install instagram, I notice that once in a while, the IG app crash (or unable to load).\nI see that the app is automatically installed by Android OS on the SD card instead of the internal storage. I also notice that Whatsapp is installed on internal storage instead of Samsung, LINE is installed on SD card.\nSo what cause the IG app to crash? Because of the faulty SD card? Software Android problem/bug? Does user have options to install app on SD card or internal card?\nThanks.", "time": "12-19-2017 11:23 PM", "replies": []}, {"postID": "post6112683", "text": "Its app why would you install it on SD card? SDs are use for media and other files only. Installing app on external storage is not recommended.", "time": "12-20-2017 12:52 AM", "replies": [{"postID": "post6113629", "text": "I said it before, the app is automatically installed by Android OS in the SD card instead of media storage... I didn't have an option or choice to pick...", "time": "12-20-2017 11:21 PM", "replies": []}]}, {"postID": "post6112801", "text": "I would recommend you to redefine the SD card as portable storage, following the instructions in your storage settings. Adoptable storage can be glitchy and a bit risky, much better using the SD card only for your media files and such.", "time": "12-20-2017 06:34 AM", "replies": [{"postID": "post6113630", "text": "so how do I redefine the SD card as a portable storage without resetting the phone? Thanks.", "time": "12-20-2017 11:22 PM", "replies": [{"postID": "post6113904", "text": "I haven't done it myself, but if I remember correctly there should be an option in settings - storage - internal - menu to move/migrate data from the card to the internal storage before formatting as portable. I remember reading about these steps when adoptable storage was introduced with Marshmallow. I can't confirm on my phones, right now I'm not using an SD card.\nSearch around and, if you decide to go back to portable, make sure you have enough free storage in your phone to save the combined data.", "time": "12-21-2017 08:38 AM", "replies": []}]}]}, {"postID": "post6113678", "text": "btw, the IG app does not crash all the time, more like 25-30% off the time", "time": "12-21-2017 12:09 AM", "replies": []}, {"postID": "post6114429", "text": "Settings > Storage > sd card > 3 dots on right upper corner > storage settings > format as external ( or something like that). I think apps will get transferred to internal storage automatically during the process. But I suppose it would be better if you can do it yourself before formatting as external storage.", "time": "12-21-2017 07:01 PM", "replies": []}, {"postID": "post6117105", "text": "Don't install apps on the microSD card...leave the memory card only for photos and videos, nothing else", "time": "12-24-2017 04:42 PM", "replies": []}]}, {"title": "Notification light question", "thread": [{"postID": "post6109350", "text": "New Moto G5S Plus owner here, coming from Nexus 7 (2013) that I replace since it's charging slowly plus other quirks.\nAs an owner of N7, I am used to notification light that blinking whenever I have new notification. I can't seem to find the setting on the G5S Plus that would do the same\nAny ways to have notification light like on N7 (probably the LED flash on the front camera)?\nThanks.", "time": "12-16-2017 09:28 PM", "replies": []}, {"postID": "post6109372", "text": "Moto G5S Plus doesn't have notification lights. Sorry", "time": "12-16-2017 09:56 PM", "replies": []}, {"postID": "post6111025", "text": "Do you have Moto Display enabled? I find this feature more helpful than the notification LED.", "time": "12-18-2017 02:45 PM", "replies": []}, {"postID": "post6111225", "text": "Agree on this Moto Display under Moto app.", "time": "12-18-2017 06:03 PM", "replies": []}, {"postID": "post6112424", "text": "What about wave to wake? Or is that only on the z and x series?", "time": "12-19-2017 07:42 PM", "replies": [{"postID": "post6112426", "text": "Not available on the Moto G5 models.", "time": "12-19-2017 07:44 PM", "replies": [{"postID": "post6112432", "text": "Thanks", "time": "12-19-2017 07:47 PM", "replies": []}]}]}]}, {"title": "Anyone also get the Moto X4", "thread": [{"postID": "post6112430", "text": "How about the x4? anyone here have both. I like metal over glass. But the android one Moto X4 gets guaranteed updates direct from google.", "time": "12-19-2017 07:46 PM", "replies": []}]}, {"title": "how to restrict background data for ALL apps for G5S Plus?", "thread": [{"postID": "post6110349", "text": "I can only restrict data for every app, but not for all apps, anyone know how?", "time": "12-18-2017 01:54 AM", "replies": []}, {"postID": "post6110539", "text": "Just per apps.", "time": "12-18-2017 08:35 AM", "replies": []}, {"postID": "post6110546", "text": "Maybe you can try Google's new app Datally.", "time": "12-18-2017 08:40 AM", "replies": [{"postID": "post6111229", "text": "Nice find", "time": "12-18-2017 06:06 PM", "replies": []}]}]}, {"title": "how to customize the 'mini' control center on G5S Plus?", "thread": [{"postID": "post6110569", "text": "so when you pull the first time, you can see the minimized version of control center, then pull again, the big one shows up.\nI want to know how to customize the mini one, for example, since my phone has a dual sim mode, one of the icon is the second sim icon, which i don't use. i want to replace it with rotate screen.\nThanks.", "time": "12-18-2017 08:57 AM", "replies": []}, {"postID": "post6110611", "text": "Pull down notification. Pull down again to make it big. If you see a pen icon tap on it. You should now able to edit the arrangements you desired it to be.", "time": "12-18-2017 09:32 AM", "replies": [{"postID": "post6111018", "text": "^^ This.\nYou can select which toggles you get on that bar rearranging the quick settings tiles. After you select the edit/pencil icon long press one of the tiles and drag it to the new position. The first six tiles will show up on the toggles bar.", "time": "12-18-2017 02:34 PM", "replies": []}]}]}, {"title": "is it possible to assign different notification sound to different app?", "thread": [{"postID": "post6109423", "text": "so lets say i want different notif sound for Instagram and Twitter, i know we can assign different notif sound to contact, but not sure about app.\nThanks.", "time": "12-17-2017 12:01 AM", "replies": []}, {"postID": "post6109453", "text": "For those two particular apps, you can for Twitter but not for Instagram (it's on each app's Settings). But that's with your 'stock' options. If you download a notification manager app, like LightFlow, you CAN assign different notification sounds and lights (if your phone supports it) to each app.", "time": "12-17-2017 01:21 AM", "replies": []}]}, {"title": "Moto G5s Case", "thread": [{"postID": "post6108614", "text": "Are there any cases for Moto G5S? I've just bought one and every Google search only seems to find cases for G5S Plus - which of course is a different size. \nI'm looking for a flip type case - not just a silicon back cover - as I want the glass front protected.\nThis is a UK request.\nThanks for all help\nAndroidNewby", "time": "12-16-2017 06:51 AM", "replies": []}, {"postID": "post6109371", "text": "Yes you can find lots in Alibaba. Amazon has few also.", "time": "12-16-2017 09:55 PM", "replies": []}]}, {"title": "system update fails on Moto G5 Plus", "thread": [{"postID": "post6102912", "text": "I just got a new Moto G5 Plus a few days ago and am trying to get it set up correctly. I checked for system updates and there was one available so I downloaded it today and then tried to install it, but after rebooting automatically it just gives me a screen with an up arrow and a down arrow, a little start icon, a picture of Android laying on his back with the flap over his stomach open, and then a bunch of numbers on the bottom of the screen like \"AP fastboot flash mode secure\", \"battery okay\", a serial #, \"connect USB data cable\", \"software status official\" Etc. But when I tap on any of those items it just sits there like the screen is frozen and does nothing. Please help because I am not very techy. Thank you.", "time": "12-10-2017 08:21 PM", "replies": []}, {"postID": "post6102915", "text": "Sorry. I guess I put this under the Moto G 5S area by mistake. Could one of the moderators please switch this over to the correct forum? Thanks.", "time": "12-10-2017 08:30 PM", "replies": []}, {"postID": "post6103247", "text": "Welcome to the forums. Something similar to this?\nIs it a brand new phone or second hand? Did you root or unlock it? If it's a brand new phone I'd recommend you to ask for a replacement.\nI moved your thread to the correct forum.", "time": "12-11-2017 07:44 AM", "replies": [{"postID": "post6103964", "text": "Yes very similar to that picture, Javier. I have no idea how to root a phone but I bought it from B&H on sale on Cyber Monday, brand new, unlocked. So what do I tell them is wrong with it? Should I exchange it or try to just get a refund? I'm using mint Sim for my carrier. Would that affect it in any way?\nThis is our first smartphone, although I have a couple of tablets I've been using before, but I didn't think that smartphones would be that much different to operate or set up.\nPS. Thanks for putting this in the right thread Javier.", "time": "12-11-2017 04:45 PM", "replies": [{"postID": "post6104034", "text": "Sorry, I don't know how the return policies work in those sites, or in the States in general, I live in Brazil  Here I would take the phone to a Motorola official repair center and use the warranty. Not sure how easy this could be in your case.\nAlso, you can take a picture of that screen to help explaining what the problem is.\nMaybe @Golfdriver97 knows a better and easier way to get your phone exchanged.", "time": "12-11-2017 06:03 PM", "replies": []}]}]}, {"postID": "post6103348", "text": "I agree with @Javier P. If it's new, get it exchanged.", "time": "12-11-2017 09:22 AM", "replies": []}, {"postID": "post6104129", "text": "I would be honest. Take the receipt and say an update caused it to be useless. You might want to be fast about this. The return limit may end soon.", "time": "12-11-2017 07:59 PM", "replies": []}, {"postID": "post6104190", "text": "Ok, thanks to both of you. B&H is in New York and I'm in California so I guess I'll have to call them about it tomorrow. I'd still like to know what that screenshot that you attached means or indicates, if you can tell me Javier?", "time": "12-11-2017 08:48 PM", "replies": [{"postID": "post6105159", "text": "Call Motorola's support line, 800-734-5870, and they may replace your phone.", "time": "12-12-2017 06:58 PM", "replies": []}]}, {"postID": "post6105160", "text": "Update!!\nI finally got all three updates downloaded last night somehow. I had read online somewhere, (maybe in these forums?) that one person couldn't get his security updates either until he took off the rubber Edged case that he had on his G5 Plus. So as a last resort, I removed the \"Cimo heavy duty shock absorbing Protection cover\" that I had bought from Amazon and put around the edges of my G5 Plus and then surprisingly, my downloads started to go through, 😁 so I got the January, May, and August security updates one at a time last night. I couldn't see anything that was being blocked by the case but he had said that there was a hidden sensor at the top of G5 plus's that some cases may block. So I hope this information will help someone else also that is having trouble getting their G5+ security upgrades.👍", "time": "12-12-2017 06:59 PM", "replies": [{"postID": "post6105166", "text": "Great news! Glad you managed to solve your problem and thanks for the follow up! It'll be very helpful for other users with a similar problem.\nIt's possible that the case was a bit too tight and was pressing the power and volume key. I would try a different case to avoid this problem.", "time": "12-12-2017 07:11 PM", "replies": [{"postID": "post6105285", "text": "Thanks. Actually I already purchased a Belk wallet type case from Amazon immediately after I got my Cimo case because the pictures of the Cimo they showed in the Amazon ad made me think that it covered the entire phone because of the way they had the two halves of the Moto G5 Plus facing each other in their photo. Anyway I already put on the new wallet case as soon as the three security updates downloaded last night and really like it so far.", "time": "12-12-2017 09:57 PM", "replies": []}]}]}]}, {"title": "Apps using data - but I didn't install them!", "thread": [{"postID": "post6095892", "text": "I was looking through my cellular data usage statistics this weekend, and noticed two apps that we're using data, but I didn't install either of them, and they weren't preinstalled, either. Has anyone else seen anything like this?", "time": "12-04-2017 05:32 PM", "replies": []}, {"postID": "post6095894", "text": "Here's the other one:", "time": "12-04-2017 05:36 PM", "replies": []}, {"postID": "post6095919", "text": "Well don't waste time searching, how they were installed & proceed\nto Uninstall them. In the majority of \"Android phones\" We delete\nunwanted apps by open >>Settings lookup for Apps >>Find \nthe 2-Intruders and Tap on the [Uninstall] button\nand Bingo! They will be history..\nOoPs! forgot if you don't find the apps on the 1st screen - Look on the \nUpper left corner, you'll see this \"All apps\" with a Down arrow-Tap\non it and the >>Moto G5S or G5S-Plus will display the rest \nof the apps installed..Once spotted the apps apply \nthe delete procedure outlined above", "time": "12-04-2017 06:27 PM", "replies": []}, {"postID": "post6095947", "text": "I’m an Android veteran and know all about disabling and installing undesired apps. The problem with these two is that they’re not IN the list of installed apps and are using data anyways. Anyone know what’s up with that, or whether they’re hidden within some other, less-obvious app?", "time": "12-04-2017 07:00 PM", "replies": [{"postID": "post6097469", "text": "As far as I know Prip is a Nextel app. Where did you buy your phone?", "time": "12-06-2017 07:39 AM", "replies": [{"postID": "post6097490", "text": "I bought it at Best Buy (that is, not at a carrier store or anything like that). It’s just strange that they’re not in the “All Apps” list. I would’ve frozen them immediately (it’s the first thing I usually do when setting up a new phone).", "time": "12-06-2017 07:59 AM", "replies": [{"postID": "post6097506", "text": "Yeah, that's strange. I've read on different places that some models came with LinkedIn preinstalled, but nothing about Prip. Try this. Open the data usage screen for any of these apps and tap the name of the app. See if this way you can disable it.", "time": "12-06-2017 08:09 AM", "replies": [{"postID": "post6097518", "text": "I already disabled background data, but I can't figure out how to disable the apps entirely. I wonder if there are sharing hooks for these apps built into the OS image.", "time": "12-06-2017 08:17 AM", "replies": [{"postID": "post6097523", "text": "I know. For most apps if you tap the name on the data usage screen you get the app manager screen where you can disable it. Maybe it's different for these apps, but worth a try anyway. Try with LinkedIn first.", "time": "12-06-2017 08:20 AM", "replies": [{"postID": "post6097526", "text": "Aha, that's it... sorry, I misunderstood the first time. I can't believe I've never learned that trick in all the years I've been using Android!\nUnfortunately, for these two, I can only force-stop them. They're already listed as \"disabled.\"", "time": "12-06-2017 08:22 AM", "replies": [{"postID": "post6097552", "text": "Also, if they are disabled you should find them in settings - apps - tap 'all apps' - select 'disabled'.", "time": "12-06-2017 08:47 AM", "replies": [{"postID": "post6097557", "text": "I went to Settings->Apps->Disabled, and selected \"Show system\" from the menu at the upper-right, and still don't see them.\nThen I went back into Settings->Data usage->Cellular data usage and followed the method you described above to enable them, then disable them again. NOW they finally show up in the disabled apps list. How weird is that?!?", "time": "12-06-2017 08:51 AM", "replies": [{"postID": "post6097569", "text": "Yeah, definitely weird, most likely caused because they were preinstalled and never set up. Who knows. I hope they stay now under control once you managed to disable them manually.", "time": "12-06-2017 09:05 AM", "replies": []}]}]}]}]}]}]}]}]}]}, {"postID": "post6096276", "text": "LinkedIn? App is safe and not a big deal. When I got mine on day one it's already installed. Didn't bother to open or delete it. I just leave it there and enjoy my new phone. \nAnyway, if you want to make sure your phone is safe from anonymous app installing make sure 'Unknown sources' is disabled under Settings-Security. Hth", "time": "12-05-2017 02:18 AM", "replies": []}, {"postID": "post6097538", "text": "Haha. No worries, it's not a very intuitive shortcut.\nStrange that they are disabled and you can select force stop. These preinstalled apps can do funny things. Maybe you could try force stop - storage - clear data.", "time": "12-06-2017 08:32 AM", "replies": []}]}, {"title": "Moto G5S Plus - System update.", "thread": [{"postID": "post6062099", "text": "New version is NPSS26.116-45-5 and includes the October security patch. Size about 60MB.", "time": "11-09-2017 02:18 PM", "replies": []}, {"postID": "post6062211", "text": "Interesting I'll check my mother's G5S plus again I wasn't getting then also my Moto Z Play got it as well.", "time": "11-09-2017 03:44 PM", "replies": []}, {"postID": "post6062303", "text": "it's great to see this great support for mid-range devices.", "time": "11-09-2017 04:23 PM", "replies": []}, {"postID": "post6064698", "text": "i didn't got update yet i am from india nd where from you are", "time": "11-11-2017 09:27 AM", "replies": [{"postID": "post6064720", "text": "Welcome to the forums. This is on the Brazilian retail model. The updates are rolling for both S models here.", "time": "11-11-2017 09:41 AM", "replies": []}]}, {"postID": "post6074197", "text": "It's very encouraging to see the October security patch on at least one variant of the G5S. I've held off on several smartphone purchases due to slow rollout of security updates.", "time": "11-17-2017 09:08 AM", "replies": []}, {"postID": "post6077184", "text": "What’s the latest security patch on the US version?", "time": "11-19-2017 05:41 PM", "replies": []}, {"postID": "post6082499", "text": "Finally got the update", "time": "11-23-2017 02:34 PM", "replies": []}]}, {"title": "Saving Wet Moto G5s Plus: How to reboot charging system?", "thread": [{"postID": "post6067823", "text": "I dropped my Moto G5s Plus in the toilet of a Porta Potty (don't ask!). Due to the sewage and sludge, the phone wasn't immersed but sat on top of the water. It had a case on it that partly protected it.\nI did the bag of rice thing overnight and to my surprise, the phone mostly worked. The only problem was a tiny, humming speaker, due either to water or perhaps a tiny speck of rice. I figured I could live with that or get it fixed.\nHowever, after using the phone all day with no problems, I tried to recharge it. Despite using the manufacturer supplied Turbo charger for several hours, the phone hasn't gotten better than a 0 or 1% charge. I did successfully reboot the phone, but it immediately shut down due to lack of power.\nIs there a way to reset the charging system of the phone to work again or is this phone likely lost?\nThx for any help offered. \nIf I have to replace this phone--which I love--I may have to get a water resistant model going forward.", "time": "11-13-2017 01:37 PM", "replies": []}, {"postID": "post6070282", "text": "I'm afraid the damage has already been done by the moisture. I don't think there's any way to fix it short of taking it apart and starting to replace components. Sorry!", "time": "11-14-2017 11:26 PM", "replies": []}, {"postID": "post6072443", "text": "Thx for your reply.\nAny idea what it would cost via Motorola or elsewhere to fix this phone?\nOr would I be better off putting the money toward a replacement?", "time": "11-16-2017 06:07 AM", "replies": []}, {"postID": "post6073425", "text": "Strangely, my Moto G5s Plus seems to have resurrected itself. However, on the Turbo charger, it took all night for the phone to go from an 11% to 85% charge. While on the Turbo charger, the phone cycles between the \"charging\" notice at the bottom of the screen and no notice. I don't know if that is typical for the Turbo Charger or not.\nOn a regular usb adapter, the phone charges without this problem though it is not nearly as quick as the Turbo Charger was before the phone was damaged.\nI hope my phone will continue to work. We shall see.", "time": "11-16-2017 06:25 PM", "replies": []}, {"postID": "post6073909", "text": "Well at least the splash proofing saved it somewhat if not get a Moto X4.", "time": "11-17-2017 03:09 AM", "replies": []}]}, {"title": "Moto G5S Plus - Ringtone will NOT change when assigned to contact", "thread": [{"postID": "post6065083", "text": "I have repeatedly gone through all the steps to assign a unique ringtone to a contact.\nI get to the list of ringtones and select the one I want, choose OK, then tap the check mark to save it.\nWhen I get a call from the number my default ringtone sounds.\nWhat to do next?\nThanks,\n-Mike", "time": "11-11-2017 02:01 PM", "replies": []}, {"postID": "post6065328", "text": "Which app are you using to change the ringtone? The stock Media Storage, a file explorer or any specific app like Zedge? Is that a ringtone that came with the phone or one that you downloaded?", "time": "11-11-2017 04:29 PM", "replies": [{"postID": "post6067300", "text": "I am using the stock dialer which came pre installed on the Moto G5S Plus.\nWhen I change the ringtone I open Contacts, choose the contact, choose Edit, choose Set Ringtone, select the ringtone, choose OK, then tap the check mark to save.\nWhen my number is dialed from the set ringtone contact' s phone it still uses the default ringtone on my phone.\nConvoluted...\nThanks,\n-Mike", "time": "11-13-2017 07:06 AM", "replies": []}]}, {"postID": "post6067501", "text": "That's weird. I've used that same method on different Moto devices and never had a problem, even when using ringtones that I downloaded.\nJust a question, when you select a ringtone from the list, do you get it to play before confirming 'OK'.", "time": "11-13-2017 10:19 AM", "replies": [{"postID": "post6067651", "text": "Yes. It will preplay any ring selected.\nWhen it does I choose \"OK\".\nIf I close Contacts then reopen the contact the RT I selected previously is shown as being selected.\nI selected another RT which came with the phone. It will not work either.\nIt is weird.\n~Mike", "time": "11-13-2017 12:01 PM", "replies": []}]}, {"postID": "post6067883", "text": "Yeah, definitely weird. Not sure what else to suggest. Just to be sure, these are calls that you are receiving through the stock dialer/phone app, right?", "time": "11-13-2017 02:30 PM", "replies": [{"postID": "post6067911", "text": "Yes, that is correct.\nI think I am going to try the Moto G5 / Moto G5 Plus - Lenovo Community forum.\nThanks,\nMike", "time": "11-13-2017 02:57 PM", "replies": [{"postID": "post6068076", "text": "Tell us if you find any solution for your issue, it will be very helpful for other users with a similar problem.\nI searched a bit and didn't find any report about this problem. Just in case, have you already tried setting a personal ringtone for a different contact? What about deleting the contact you're having problems and add it back again?", "time": "11-13-2017 04:44 PM", "replies": [{"postID": "post6068097", "text": "Will do.I will try this and report back.\n-Mike", "time": "11-13-2017 05:02 PM", "replies": []}, {"postID": "post6068097", "text": "Will do.I will try this and report back.\n-Mike", "time": "11-13-2017 05:02 PM", "replies": []}, {"postID": "post6070775", "text": "SOLVED!\nThis is embarrassing.\nI had two entries for the same number.\nWhen I deleted one of them there was no problem in assigning a custom ringtone.\nThanks to all for the help.\nWV-Mike", "time": "11-15-2017 08:32 AM", "replies": []}]}]}]}, {"postID": "post6070784", "text": "No worries. Glad you managed to solve it!", "time": "11-15-2017 08:36 AM", "replies": []}]}, {"title": "What are the best cases available for the Moto G5[S] Plus?", "thread": [{"postID": "post6064965", "text": "I visited the topic: What are the best cases available for the Moto G5 Plus?\nI tried to post a comment but could not.\nHere is what I tried to post:\n\"The Supcase Unicorn Beetle Pro with Built-in Screen Protector image at Amazon shows a cut out for the head phone on the bottom next to the charging port.\nMy phone (Moto G5 Plus) has the headphone port on the top of the phone.\nI want a rugged outdoor case. Who has one they can recommend?\nThanks,\n-Mike\"", "time": "11-11-2017 12:08 PM", "replies": []}, {"postID": "post6065019", "text": "Hi Mike! What error did you get when trying to post? Did you include any link in your post?", "time": "11-11-2017 12:54 PM", "replies": []}, {"postID": "post6065231", "text": "Mike, look at Spigen armor cases. I've always used Otterbox cases, but they don't make one for the G5 Plus.\nAlthough looking around, I found http://forums.androidcentral.com/e?l...token=nHVUPRmX I don't know if that would fit your phone or not, but you can ask them. (OB is unbeatable - I've had my phone tossed against a wall, screen-first, when I caught the wireless charging power cord on my chair. Not even the wall get marked, but from the sound of the phone hitting, I was shre the wall had a hole in it.)", "time": "11-11-2017 03:45 PM", "replies": [{"postID": "post6067286", "text": "I checked the Spigen web site. Once again there is a photo showing the G5 Plus with the headphone jack on the bottom of the phone. Mine is on the top.\nThis is the problem I had with one I bought at OfficeDepot and box label said specifically the case was for the G5 Plus.\nGrrrr!", "time": "11-13-2017 06:53 AM", "replies": [{"postID": "post6067310", "text": "My phone is the Moto G5S Plus.\nThere must be a different case for this phone as none of the ones I have seen for the Moto G5 Plus have the correct cut outs in the case.\n-Mike", "time": "11-13-2017 07:19 AM", "replies": [{"postID": "post6067333", "text": "I thought you had the G5 not the G5S. Do you want me to edit your thread title?\nAnd yes, they need different cases. Different size, camera in a different position, etc.", "time": "11-13-2017 07:46 AM", "replies": []}]}]}]}, {"postID": "post6067290", "text": "Mod note. Thread moved to the G5 & G5 plus forum.", "time": "11-13-2017 06:55 AM", "replies": []}, {"postID": "post6067309", "text": "Where are the G4 and G5 forums?\nI do not see them in the drop down \"Forum\" menu at the top right of the page.\nMike", "time": "11-13-2017 07:14 AM", "replies": [{"postID": "post6067334", "text": "Both are under Motorola phones. This is from the app.", "time": "11-13-2017 07:47 AM", "replies": []}]}, {"postID": "post6067342", "text": "\"I thought you had the G5 not the G5S. Do you want me to edit your thread title?\"\nYes, thanks.\nSorry for the confusion.\n-mb", "time": "11-13-2017 08:01 AM", "replies": [{"postID": "post6067371", "text": "No worries. Done and thread moved to the correct forum.", "time": "11-13-2017 08:25 AM", "replies": []}]}, {"postID": "post6067349", "text": "I am not seeing this menu option on the website drop down \"Forum\" menu.\nI am unable to get a screen shot of the drop down menu to verify this.\n-Mike", "time": "11-13-2017 08:06 AM", "replies": [{"postID": "post6067605", "text": "You need to scroll a long way down to find the Moto forums, right after Samsung and LG. The easiest way to access any sub-forum is subscribing, so you can easily access them from 'My Menu'.\nTo subscribe, select the sub-forum and open the menu under 'Tools'.", "time": "11-13-2017 11:30 AM", "replies": [{"postID": "post6067643", "text": "This what I see from the drop down \"Forums\" menu:", "time": "11-13-2017 11:54 AM", "replies": []}]}]}, {"postID": "post6067421", "text": "\"Best\" case is super subjective... for rugged outdoor cases I would look at Poetic Revolution or UAG Outback.\nHonestly, I have had several Supcase Beetles on Moto G 2015 and Moto X Pure and although they provided good protection, the plastic over the buttons was incredibly stiff and made the buttons hard to push without using way more force than you should have to. Granted it probably eliminates accidental button presses, but it just felt like I was going to damage something because I had to press so hard. \nThere are also several dozen decent \"rugged\" hybrid style cases on Amazon, iBlazon, Celljoy Liquid Armor, LK Armor Defender, MicroP Hybrid Armor, ZeopoCase, CoverON Tank series, BestAlice Hybrid, and more... The phone is common enough world wide to have lots of choices. \nI have had a couple Spigen cases over the years, they seem to protect well but tend to show wear quickly... It's the old bad apple scenario with me, once you bite into a rotten apple you tend to avoid apples for a while, even if you know in your mind they are good.\nI have gotten to a point I don't bother with high end cases anymore, just basic drop/bump protection like a Cruzerlite Bugdroid (of which I have a few different colors) or what has become my favorite case for this phone the Incipio NGP Advanced and if want more protection, add a quality tempered glass screen protector.", "time": "11-13-2017 09:06 AM", "replies": [{"postID": "post6067473", "text": "Thanks for all the info.\nUnfortunately I incorrectly stated the model of the phone I have.\nI have the Motorola Moto G5S Plus, not the Motorola Moto G5 Plus\nThere are lots of case for the Motorola Moto G5 Plus but I have not yet found one for the Motorola Moto G5S Plus.\n-Mike", "time": "11-13-2017 09:50 AM", "replies": [{"postID": "post6067564", "text": "I had no issue finding G5S Plus cases on Amazon... Spigen Rugged ArmorTekcoo HybridTudia MergeANLI Heavy Duty Protection SeriesCoverON Explorer Series\nAnd more... personally, I would consider the Spigen or Tudia, had several Tudia cases and had no problems with them.", "time": "11-13-2017 11:01 AM", "replies": [{"postID": "post6068904", "text": "What can I say? I think I was repeatedly dropping the \"s\" in the G5S Plus for my searches.\nI ordered the TUDIA Moto G5S Plus Case and the Moto G5S Plus Screen Protector, [2 Pack] SPARIN .\nThanks for the leads.\n-Mike", "time": "11-14-2017 07:37 AM", "replies": []}]}]}]}, {"postID": "post6067652", "text": "I see what you mean. You need to click on it, wait for the new page to load and then scroll down until you find the Moto forums.", "time": "11-13-2017 12:01 PM", "replies": [{"postID": "post6067813", "text": "Got it.\nThanks!\n-Mike", "time": "11-13-2017 01:30 PM", "replies": []}]}]}]
[{"title": "Moto G5S plus always has low signal", "thread": [{"postID": "post6066008", "text": "Hello. I have a Moto G5S plus using a Verizon Sim. I had a Moto G5+, but gave it to my cousin and got the G5S+. The G5+ always had full bars in my house. However, the G5S+ has full bars sometimes, but gets only 1 bar a lot of the time. It fluctuates a lot. It seems to mostly become low signal when its asleep. They both will be using the same Sim card and network, but their amount of signal differ greatly. I also tested the signal with a Nexus 6P, Galaxy S4, iPhone 6S plus, Moto E2, and Moto E4. Each of them have full signal in my house all the time while the G5S+ gets 1 maybe 2. The wifi range also seems to be less compared to the G5+. I thought maybe I got a defective unit, but I got a replacement from Motorola and the replacement is exactly the same way. Is this just how the phone is? Did I possibly get a 2nd defective device? Or is it potentially a software problem and can be fixed with an update, if Motorola ever ever decides to? Not having signal when another phone will somewhere is a deal breaker for me. Can this be fixed, or should I just get a G5+? Thank you.", "time": "11-12-2017 04:01 AM", "replies": []}]}, {"title": "Moto g5s plus case with port hole covers??", "thread": [{"postID": "post6057826", "text": "Anyone come across a decent case that has covers across the port holes? for the g5s plus, cheers", "time": "11-07-2017 02:36 AM", "replies": []}]}, {"title": "How do you download your own ringtone?", "thread": [{"postID": "post6043062", "text": "This is for the G5s plus. When I go into settings and sounds and then ringtones, it only lists the phones ringtones. Where is the option to use my own which I already downloaded to my phone. \nThanks.", "time": "10-28-2017 03:23 PM", "replies": []}, {"postID": "post6043074", "text": "Welcome to the forums. You need to move those files to the 'ringtones' folder. You can use the stock file explorer (settings - storage - explore) or a third party app. \nI moved your thread to the G5S+ forum for better visibility.", "time": "10-28-2017 03:27 PM", "replies": []}]}, {"title": "Android Nougat version, send contact as plain SMS, not as MMS or VC card", "thread": [{"postID": "post6033634", "text": "I am using Motorola G5s Plus, with Android 7.1.1 (Nougat version). When I try to share a contact it goes as an MMS or a VC card which many a times incompatible with receivers mobile and so causes problem.\nThanks and Regards,\nManoj", "time": "10-23-2017 05:07 AM", "replies": [{"postID": "post6034994", "text": "Might be better off manually typing or cutting and pasting it. SMS is supposed to be text only.", "time": "10-23-2017 07:42 PM", "replies": [{"postID": "post6035012", "text": "This is the best way to share a contact phone number if you want to use SMS. Open the Contacts app - tap on the avatar to select one - long press the phone number and 'copy to clipboard'. Go to the Messages app - open new message or select an existent thread - long press on the text window and 'Paste'.\nOther possibilities are using MMS or apps like WhatsApp, Hangouts, etc.", "time": "10-23-2017 07:52 PM", "replies": []}]}]}, {"postID": "post6034985", "text": "Welcome to Android Central! My understanding is that contacts cards have to be sent as MMS. If you want to send as SMS, you can try a 3rd party app like Share Contacts.", "time": "10-23-2017 07:36 PM", "replies": []}, {"postID": "post6038674", "text": "on my s5 if i go into my stock messaging app i press the attach file icon, i then select contacts, then find the contact i want to send, when selected it asks me if i want to send as text or v card", "time": "10-25-2017 06:28 PM", "replies": [{"postID": "post6039156", "text": "But I believe that will get sent as MMS, correct? The OP wants to know if the info can be sent as SMS.", "time": "10-26-2017 01:20 AM", "replies": [{"postID": "post6039176", "text": "Nope. Samsungs have the feature to actually send the contact as an sms message. Choosing contact>share>text on a Samsung creates an SMS that contains only the full name and primary contact numbers.\nIt may be a Samsung feature and not a default feature of Android.", "time": "10-26-2017 01:40 AM", "replies": []}]}]}, {"postID": "post6039179", "text": "Ah, I stand corrected -- thanks @chanchan05 and @A Bochur!", "time": "10-26-2017 01:48 AM", "replies": []}]}, {"title": "Camera - is it really slow?", "thread": [{"postID": "post6035339", "text": "I like to take pictures of my small daughter who is always on some run. \nAnd I see they say camera is slow and sluggish.\nCan someone verify?\nAlso if I take picture of something (some normal or auto mode) if that object moves before picture is 'processed' (goes in gallery or whatever) does it look normal or blurry?\nOr better can it take pictures of someone running and that they look normal?\nThank you", "time": "10-24-2017 12:39 AM", "replies": []}, {"postID": "post6037481", "text": "The camera has gotten faster with updates. I also find it is faster when choosing \"Professional\" mode than standard mode.\nThere is also a rapid fire (burst mode), I believe, that should help with actions shots.\nI have not had any problem with blurred action shots but catching the exact moment of the desired pic is not always possible.\nThe phone is great overall but the camera is not its strong suit. The Moto G5Plus may be a better choice for you if you want to stay in this price range as it doesn't have a shutter lag.", "time": "10-25-2017 07:31 AM", "replies": []}]}, {"title": "G5S Plus First Impressions", "thread": [{"postID": "post6001219", "text": "Got mine last Thursday (September 28, 2017), it took one week from the \"pre-order\" to delivery. I bought the 64GB/4GB version and paid $284.99 total plus state tax (how does the state really know that Lenovo in China is paying the tax back to the state?).\nI'm replacing a Moto X Pure Edition from 2015 that was starting to run slow and doesn't have the Nougat that was promised and has the December 2016 security update, the last available for that phone.\nAs usual, it took about 2 days to get the G5S Plus set up the way I like it, get all the apps and logins transferred, my Blacklist Pro blacklist file, notification and ringtones, etc.\nThe G5S Plus weighs 167 grams compared to 177 grams for the Moto X PE, a slight and not-really-noticeable difference.\nThe G5S Plus is (slightly) noticeably thinner though at 8.09 mm vs. 10.7 mm for the Moto X PE.\nBig difference in the feel though; my Moto X PE has the black hard rubber back, which gives good traction. The G5S Plus (gray) has a slippery aluminum back. \nWhy oh why are these manufacturers so focused on style and looks over function? It's a dang phone for cryin' out loud -- a tool, not a piece of jewelry.\nI'm going to mask off the antennae and camera on the back and spray it with some clear traction material I've used before. I never buy a case for a phone, just on principal. \nI can't get past buying a multi-hundred-dollar phone and then having to spring another 50 bucks for a case that makes it thicker. Design the phone so it's protected from the start without having to require a case!\nAnyway, the G5S Plus is a good replacement for the Moto X PE, which was the top-of-the-line phone from Motorola 2 years ago. It runs slightly faster; enough to be noticeable when opening apps. the HTC U11 I bought and gave to my wife after 2 days doesn't run any faster that I can notice, despite having a much higher spec processor (and costing more than twice as much).\nI don't use the fingerprint sensor (not secure enough for me) so I can't comment on that, although it just takes up valuable space on the front.\nThe screen measures 130 mm diagonal viewable size vs. 143 mm for the Moto X, which is a big (and kind of disappointing) difference.\nOtherwise, the screen colors, brightness, quality, etc. seems the same to me. \nI'm also a bit disappointed with the new notifications screen on the G5S Plus. You can no longer just wave your hand over the top and see the notifications, which is probably the biggest disappointment for me, as I really liked that feature on the Moto X. \nIn fact, I can't quite figure out how to get the notifications on the G5S Plus to work -- sometimes it shows when I pick up the phone, but disappears within a second or so, fast enough that I only get a quick glance at the notifications. \nYou have to touch the on/off button to see the notifications and that's just dumb. No-handed was much better.\nCall quality is excellent, a touch better than the Moto X PE, so no problems to report there.\nBy the way, the on/off button and volume button are reversed from the Moto X PE, with the power button now on the bottom. Took me a couple of days to get used to that. Also, the power button has very small traction bars compared to the Moto X; I can't really feel them on the G5S Plus. The buttons feel solid though.\nOverall, the build quality is excellent, especially compared to other phones I've seen costing a lot more -- like the HTC U11, which is a piece of junk as far as I'm concerned with its ridiculous all-glass build that looks, feels and is less solid.\nBottom line? You can spend more, as I've learned, but you don't get more phone than the G5S Plus, despite what anyone says. Spending more is foolish in my opinion. But hey -- opinions are like bung holes; everybody has one.\nIf you have any questions about the G5S Plus, let me know.\nP.S. Also, battery life is excellent, I'd guess it lasts twice as long as my Moto X PE. I've been using the G5S Plus the same as I did the Moto X PE and the battery goes down only about 30% in one day, compared to using almost a full battery in the Moto X in one day. So I'm really happy about that, as I'd usually have to recharge the Moto X once or twice during the day.", "time": "10-02-2017 11:52 AM", "replies": []}, {"postID": "post6001241", "text": "Similar story here. I bought the G5S+ to replace my aging X Play. Very happy so far. I've never used a case and, as you said, I was a bit worried about the aluminium back. A bit slippery specially coming from a hard rubber back, but I got used quite quickly and I'm having no problem with one-handed use.\nI use the FPS all the time, fast and accurate, and I enabled the one-button nav. It's excellent and you get some extra screen without the nav bar.\nI didn't have the wave action to wake up the screen on the Play, so I don't really miss it and a soft nudge is enough to see the notifications.\nPerformance and battery are great, as you said, and the camera is a mixed bag. Good for normal use, slow for dual camera tricks, like depth. Still learning, but it can take pretty good photos.", "time": "10-02-2017 12:23 PM", "replies": []}, {"postID": "post6002374", "text": "I saw an app in the Play Store that supposedly adds the wave your hand notification thing. I'm not sure if it will work on this phone but maybe you could try it. It is called 'MotoDisplay Handwave'https://play.google.com/store/apps/d...handwave&hl=en\nAlso, I saw there is a camera tuner app for the Moto G5S Plus called 'Camera tuner for Moto G (5S) Plus'https://play.google.com/store/apps/d..._sanders&hl=en\nMaybe these apps could be useful to you.", "time": "10-03-2017 10:39 AM", "replies": [{"postID": "post6002442", "text": "Wow, great tip, thanks! The hand wave app works great! Just what I was looking for.", "time": "10-03-2017 11:17 AM", "replies": []}, {"postID": "post6005440", "text": "Be aware the handwave is a good one, with fingerprint sign in being disabled. That is no no for me.", "time": "10-05-2017 08:26 AM", "replies": []}]}, {"postID": "post6002388", "text": "That Camera Tuner app comes preinstalled in the phone, no need to download it, just keep it updated. I have already received two updates for the stock camera app and the Depth feature is much quicker now.", "time": "10-03-2017 10:44 AM", "replies": []}, {"postID": "post6005084", "text": "I picked up my 64gb G5s Plus on the 29th as well as a 32gb I set up for a friend. I'm likewise upgrading from a Moto X PE, which still works quite well.I'm hoping this phone stays in the upgrade path, not abandoned like the Moto X PE.\nIt took several days to setup the two phones so I've just got around to switching the Sim cards after running SMS Backup & Restore. BTW, SMS Backup & Restore, free, will transfer call logs and sms from other manufacturors.\nThe setup process, copying from another phone, was fairly well done. Nova Launcher and a 200gb microsd gives the phone a similar look and feel to past phones and tablets.\nLet's keep on making app suggestions and problem solving hints.\nBest,\nTom", "time": "10-04-2017 11:45 PM", "replies": []}, {"postID": "post6025233", "text": "I got the Moto G5s Plus a couple of weeks ago and I'm crazy about it.\nThe larger screen (though essentially the same size phone as the G5 Plus) helps more than I expected when reading and watching videos.\nThe build quality approximates that of a $600 phone.\nBattery life is as good or better than my old G5 Plus (which was still in the return window when I ordered the S Model).\nThe 7.1 Android experience is fast, fun, and flawless.\nYes, the camera lag is annoying but I do get great pics. Again, better IMHO than the G5 (which was/is a great phone).\nI hope the camera lag will be fixed with updates but regardless, I am very happy with my 3 mg/32 mg G5S Plus for under $300 (got mine for $229 under pre-order).\nHighly recommended.", "time": "10-18-2017 08:52 AM", "replies": []}]}, {"title": "Call Quality on G5s Plus?", "thread": [{"postID": "post5973745", "text": "I'm missing calls on my G5 Plus, which may be due to a low signal.\nI also don't get as many bars (signal quality) on this phone as I did on my old iPhone 6s.\nAny idea if the new G5s Plus, given its new antenna bands, will be any better?", "time": "09-14-2017 06:12 AM", "replies": []}, {"postID": "post6010343", "text": "I have had the Moto G5S plus for a week now and I have had no dropped calls.", "time": "10-08-2017 03:40 AM", "replies": []}, {"postID": "post6011859", "text": "Thx. I think the problem may be a loss of my wireless carrier signal in a new office where I'm working now.", "time": "10-09-2017 08:00 AM", "replies": []}, {"postID": "post6022203", "text": "Bob, have you tried a new sim card?", "time": "10-16-2017 11:34 AM", "replies": []}, {"postID": "post6025224", "text": "Actually, I upgraded to the G5s Plus and haven't had the problem, even though it's the same sim card", "time": "10-18-2017 08:45 AM", "replies": []}]}, {"title": "Internet data gets disconnected on Moto g5s", "thread": [{"postID": "post6023592", "text": "I am using golan telecom on moto g5s. Whenever my phone switches from wifi to mobile data, internet gets disconnected although it is still connected to the network. I always have to reboot the phone to use mobile data. Please help.", "time": "10-17-2017 08:55 AM", "replies": []}, {"postID": "post6024065", "text": "Are you sure it's not just getting disconnected from the site or web app it was connected to? Switching internet connections make you a different user to web servers. If the data actually turns off (in settings), contact the place you got it from - it's probably a defect in the phone, and it should still be in warranty.", "time": "10-17-2017 01:54 PM", "replies": []}]}, {"title": "Volte is not supporting for jio", "thread": [{"postID": "post6020901", "text": "I am using Motorola g5s plus but it seems as if it is not supporting volte for jio. I am unable to directly video call from my dialler. I have tried few of the solutions mentioned on the net like enabling volte provisioned and restarting the phone but still volte is not supported in my phone", "time": "10-15-2017 02:58 PM", "replies": []}]}, {"title": "Moto G5S Plus coming to the U.S. Who's getting one?", "thread": [{"postID": "post5988455", "text": "The latest Moto G model will be available in the U.S. at the end of September. With that price it could be the best mid-ranger right now. What do you think? I bought mine a few weeks ago and it's an excellent phone.\nMoto G5S Plus coming to the U.S. Sept. 29 for $230 https://www.androidcentral.com/moto-...us-sept-29-230", "time": "09-22-2017 05:06 PM", "replies": []}, {"postID": "post5988993", "text": "I ordered a G5S Plus yesterday to replace my Moto X PE that will never be updated, has a December 2016 security patch, is running slow and apparently the fast charge has failed because it takes forever to charge now.\nI said I'd never buy a Motorola again after that but I had to face the fact that the G5S Plus is the best mid-ranger around and better than my Moto X PE, which was a flagship only a couple of years ago when I bought it.\nAlso, I'm totally hooked on the notice screen or whatever Motorola calls it, I wave my hand over the screen and can see the email, text or notifications. That has become an essential feature I can't live without on a phone.\nI ordered the 64GB/4GB RAM edition of the G5S Plus. There was a $50.00 discount and then as I was waffling and about to leave the page after putting it in the shopping cart, a 5% off coupon popped up so I grabbed that and then bought the phone. Total was $284.99 plus state tax. Since I don't like to pay more than 300 bucks for a phone, I guess I'm OK.", "time": "09-23-2017 06:36 AM", "replies": []}, {"postID": "post5989553", "text": "Hi do you remember the discount code? It came up for me earlier but not now when I'm ready to order.", "time": "09-23-2017 04:03 PM", "replies": []}, {"postID": "post6014420", "text": "$50 off again for a limited time.http://forums.androidcentral.com/e?l...token=BgYPPbif", "time": "10-10-2017 08:28 PM", "replies": []}, {"postID": "post6014423", "text": "Oh well, AC doesn't like those links. Check out Motorola page for the deal.", "time": "10-10-2017 08:30 PM", "replies": []}, {"postID": "post6014624", "text": "Just grabbed mine today from Best Buy. Wasn't on display yet, but they had full stock on hand. So far really impressed. Reminds me of OnePlus 5 a bit. Only thing I can't get around is the camera lag. .. that's really bad.. how'd that pass QA? Hopefully it gets fixed in future.", "time": "10-10-2017 11:44 PM", "replies": [{"postID": "post6015120", "text": "They pushed two updates for the camera app and one for the camera tuner since I bought it. It made the camera a bit better and the depth processing a lot faster. See if this makes a difference.", "time": "10-11-2017 10:17 AM", "replies": []}]}, {"postID": "post6015740", "text": "I've gone through all available updates - honestly this may be one of the worst cameras I have used in years on a phone... I swear the original Moto G was better off...", "time": "10-11-2017 06:31 PM", "replies": [{"postID": "post6015806", "text": "That's strange. It's not the best camera, that's for sure, but it can still take pretty good pictures. I had the original Moto G as well, which I love, and I think that's a bit exaggerated. \nTake a look here, and this is after the forums compression.https://forums.androidcentral.com/sh...d.php?t=835673", "time": "10-11-2017 07:31 PM", "replies": []}]}, {"postID": "post6018272", "text": "So, I just got a wave of updates come through via the play store. (Previously were not showing up.)\nHas improved camera quality significantly, but looking forward to further improvement.\nI went to a concert last night and had to bring my old phone to get some decent photos. Too bad these updates didn't hit my phone until today. :-/", "time": "10-13-2017 04:24 PM", "replies": []}]}, {"title": "My Moto G5s Plus does not load GIFs on the stock Android Messages app.", "thread": [{"postID": "post6017955", "text": "GIFs work on every other app (Hangouts, Facebook messenger, Twitter, etc) but come through as images instead of a GIF on the Messages app. Any idea what the fix is?", "time": "10-13-2017 12:08 PM", "replies": []}, {"postID": "post6017963", "text": "Welcome to the forums. Is your mobile data working normally in other apps? Can you send normal images through MMS?", "time": "10-13-2017 12:11 PM", "replies": []}, {"postID": "post6018049", "text": "Thank you. Yes, normal mobile data is working fine and I also can send and receive images and texts. My Messages app is up-to-date. I have uninstalled and reinstalled. My friend also has the same issue with his Moto G5s Plus. Calling Motorola did me no good.", "time": "10-13-2017 01:24 PM", "replies": []}, {"postID": "post6018052", "text": "Thanks for registering! Have you already tried a different app, like Textra for example?\nI'll move your thread to the G5S & G5S+ for better visibility.", "time": "10-13-2017 01:29 PM", "replies": []}, {"postID": "post6018058", "text": "Thank you. No I have not. I have used Messages for years on Motorola phones so just been used to it. Thanks for the suggestion.", "time": "10-13-2017 01:32 PM", "replies": []}, {"postID": "post6018267", "text": "I'll chime in and say that Textra has been my go-to for a long long time. I always go back to it if I try a stock sms app. Looks great, very stable.", "time": "10-13-2017 04:21 PM", "replies": []}]}, {"title": "Gription Stiction for the G5S and Plus", "thread": [{"postID": "post6015481", "text": "I'm not a fan of bulky and expensive cases but my new G5S Plus is kind of slippery to hold.\nSo I bought this slab of \"Gun Grip Tape Material\" from a seller \"Caloosa Tactical\" on eBay for $4.40 with free shipping.\nI measured (18 mm wide and 130 mm long) and cut it, then I cleaned the back of the phone with rubbing alcohol, then stuck this on. \nIt works great! Gives me lots of grip and it's pretty thin, so no problems getting it in and out of the pocket.", "time": "10-11-2017 03:13 PM", "replies": []}]}, {"title": "Moto G Plus 5th Gen is it worth it?", "thread": [{"postID": "post5977854", "text": "So I'm in the market for a phone for about what the G 5th Gen costs. I wish it were 5.5 inches in this case as I normally would not but I'm searching for something larger than 5.2 inches as I have a 5.2 inch device already. That said the specs on the G 5th Gen are definitely good and it makes it tempting to get it. Anyone who has it how does it feel in terms of build quality? Ate there any skins out there for it. Anyone notice any lag with this phone? Thanks for any help.", "time": "09-16-2017 05:25 AM", "replies": []}, {"postID": "post5978100", "text": "I've got the G5S+ model. Build quality is quite good for this price and it feels great on the hand. No idea about skins and cases, I don't use them and there are no many options where I live. \nI'm not interested in Moto mods so I decided for the G instead of buying the Z2 Play. Performance wise they are very similar and battery life is about the same, which means great  The SD625/626 are very efficient and the 3000 mAh battery is enough, even for heavy users.\nIf you are interested in Moto mods or have any already in your hands I'd recommend you to spend a little more and go for the Z2 Play.", "time": "09-16-2017 09:51 AM", "replies": [{"postID": "post5990716", "text": "Not using a case for your phone? I'm planning to do the same but I'm worried about the protruding camera hump. Is the glass strong enough for day to day use and placement?", "time": "09-24-2017 12:47 PM", "replies": [{"postID": "post5990847", "text": "I'm not a good example  I've never used a case or screen protector on any of my phones, just a sunglasses pouch to avoid scratches. \nThe metallic ring around the camera glass is a bit higher, so it protects the glass when placed the on a flat surface.", "time": "09-24-2017 02:45 PM", "replies": []}]}]}, {"postID": "post5986971", "text": "Just in case you're still interested the S model with a 5.5\" display will be available in the States next week.\nMoto G5S Plus coming to the U.S. Sept 29 for $230 https://www.androidcentral.com/moto-...us-sept-29-230", "time": "09-21-2017 04:14 PM", "replies": []}, {"postID": "post5987991", "text": "Just pre-ordered one for $229. Amazing deal. I don't think anyone can go wrong on this device.", "time": "09-22-2017 11:16 AM", "replies": [{"postID": "post5988053", "text": "I completely agree with you. It's an excellent mid-ranger and with that discount ...", "time": "09-22-2017 11:42 AM", "replies": [{"postID": "post5988293", "text": "$300 for the 64gb version. If my wife would trade off her 7 year old flip phone I'd get her one of these, looks like a very nice phone, and unlocked to boot!", "time": "09-22-2017 02:14 PM", "replies": []}]}]}, {"postID": "post5991536", "text": "Can you help me with one more thing?\nCan you check and tell me the latest version of camera app, camera tuner app and the photo editor app?\nIt shows 31 August as the latest version for moto camera 2 (7.0.48.20) and for photo editor (1.4.45.4). Latest version of camera tuner for G5S plus was published on 28 august (1.15.8). When I see these apps seperately outside of playstore, it shows a more updated version on a later date (september).\ncan you tell me which versions of these are running on your phone?", "time": "09-24-2017 11:55 PM", "replies": [{"postID": "post5991794", "text": "Same versions on my phone. I remember getting an update for these apps a couple of weeks ago.", "time": "09-25-2017 07:50 AM", "replies": []}]}, {"postID": "post5991555", "text": "Not sure if it has Shattershield, but if it does, you'd want a screen protector. The Shattershield is shatterproof since it's plastic, but it's very scratchable.", "time": "09-25-2017 12:28 AM", "replies": []}, {"postID": "post5996358", "text": "My power button is a little wobbly but works fine. Is it the same for you guys as well? Just want to know whether it's a defect on my phone or if that's how it is", "time": "09-28-2017 09:19 AM", "replies": [{"postID": "post5996425", "text": "Now that you mention it ...  I tried and with the right angle and paying close attention I noticed it wobbles a little bit, but nothing important.", "time": "09-28-2017 09:47 AM", "replies": []}]}]}, {"title": "What Moto Actions do you use?", "thread": [{"postID": "post5995215", "text": "My favorite is 'One button nav'. This is what I have enabled.", "time": "09-27-2017 12:46 PM", "replies": []}, {"postID": "post5995256", "text": "Twist for Quick Capture\nChop Twice for Flashlight", "time": "09-27-2017 01:03 PM", "replies": []}]}, {"title": "phone locking", "thread": [{"postID": "post5991539", "text": "Hi,\nI'm using moto g5s plus and there is issue in screen locking. I've set up pattern and screen senser. When I press the power button to lock it, it doesn't lock. It just power off the screen. Now when I press the power button and swipe the screen, I should have be prompted to screen where I put in the pattern or asked for senser, instead, I am already inside the device as if I already put the pin in. \nHowever, a Lock appeared on screen when I press power button to lock it, and if we manually press that lock it gives the message that 'Device will stay locked until you manually unlock it' and after pressing the lock phone asks for pattern or senser to unlock it?\nAny suggestion??", "time": "09-24-2017 11:58 PM", "replies": []}, {"postID": "post5992206", "text": "Welcome to Android Central! There should be an \"Automatically Lock\" setting in the System Settings that allows you to choose how long the phone waits after the screen goes to sleep before it then locks the phone. Open your System Settings, tap the Search icon, and search for \"Automatically.\"", "time": "09-25-2017 01:26 PM", "replies": []}]}, {"title": "Moto G5S leak shows off all-metallic chassis and three color options, which color are you interested", "thread": [{"postID": "post5897967", "text": "Personally i would like the blue one!https://www.google.com/amp/s/www.and...-options%3famp", "time": "07-24-2017 03:02 PM", "replies": []}, {"postID": "post5906166", "text": "Gold or that blue.", "time": "07-30-2017 09:34 PM", "replies": []}, {"postID": "post5906174", "text": "That blue looks very nice.", "time": "07-30-2017 09:40 PM", "replies": []}, {"postID": "post5907148", "text": "Oh well. The blue one is not included in the latest leak.https://mobile.twitter.com/FlamingAa...24501277007877", "time": "07-31-2017 03:37 PM", "replies": []}, {"postID": "post5908218", "text": "Here they are. It's official.\nMoto G5S + Moto G5S Plus specs: More metal, better cameras https://www.androidcentral.com/moto-...g5s-plus-specs", "time": "08-01-2017 01:43 PM", "replies": [{"postID": "post5908378", "text": "Nice.", "time": "08-01-2017 03:59 PM", "replies": []}]}, {"postID": "post5955284", "text": "Anyone know when these are coming to America?", "time": "09-04-2017 07:55 AM", "replies": []}, {"postID": "post5973356", "text": "Got one!  Fast, smooth and pretty good in the hand. I'll use it for a few days and tell you how it goes. So far so good. Nice phone.\nOh, bought the Platinum model.", "time": "09-13-2017 09:01 PM", "replies": [{"postID": "post5973669", "text": "Nice. 5.2\" or Plus?\nAny sign of a compass / magnetometer sensor thing?\nG5S is now on sale on the Motorola UK site @ £219 with 3 months Deezer \nG5S Plus is still pending. \nAfaik these are not currently heading to the US, Javier is south of the equator.", "time": "09-14-2017 04:08 AM", "replies": [{"postID": "post5973752", "text": "5.5\" Plus. It comes with gyro and accelerometer. Here in Brazil they sell the G5S+ with 3/32gb, no sign of 4/64 in the near future. \nPerformance and battery life are pretty good.", "time": "09-14-2017 06:22 AM", "replies": []}]}]}, {"postID": "post5973557", "text": "Anyone know when the G5 plus 5.5 in screen will be available?", "time": "09-14-2017 12:22 AM", "replies": []}, {"postID": "post5977849", "text": "Ashame these aren't coming to the US as I would not mind that plus model but after all if they did come to the US Motorola would only be competing with their own self as the 5.2 g5 currently has a 625 processor so the only change just about would be the 5.5 inch screen. I can see why they didn't release in the US now after seeing the specs.", "time": "09-16-2017 05:16 AM", "replies": [{"postID": "post5977970", "text": "All leaks say that both S models will be released in the US this fall, we'll see. The 'old' 5.2\" model is the G5+ (my wife got one), excellent cheap phone. The main differences in the G5S+ are screen size, dual camera and better finishing (all metal).", "time": "09-16-2017 08:10 AM", "replies": []}]}, {"postID": "post5979037", "text": "I'm pretty sure these phones are coming to the US.", "time": "09-16-2017 11:29 PM", "replies": [{"postID": "post5986587", "text": "There you go.\nMoto G5S Plus coming to the U.S. Sept. 29 for $230 https://www.androidcentral.com/moto-...us-sept-29-230", "time": "09-21-2017 12:02 PM", "replies": []}]}]}, {"title": "Motorola Moto G5S and Moto G5S Plus?", "thread": [{"postID": "post5814581", "text": "https://twitter.com/evleaks/status/863580163153461249\nfunction loadx(data) {\n  document.write(data.html);\n}", "time": "05-14-2017 04:03 PM", "replies": []}, {"postID": "post5814582", "text": "https://twitter.com/evleaks/status/863581657168834561\nfunction loadx(data) {\n  document.write(data.html);\n}\nhttps://twitter.com/evleaks/status/863581959661944833\nfunction loadx(data) {\n  document.write(data.html);\n}", "time": "05-14-2017 04:05 PM", "replies": []}, {"postID": "post5824839", "text": "http://www.androidauthority.com/leno...images-774266/", "time": "05-22-2017 10:05 PM", "replies": []}, {"postID": "post5834333", "text": "Moto G5S and G5S Plus: all the rumors in one place - Android Authority", "time": "05-31-2017 12:43 PM", "replies": []}, {"postID": "post5834334", "text": "Moto G5S and G5S Plus: what we&#039;d like to see", "time": "05-31-2017 12:44 PM", "replies": []}, {"postID": "post5850780", "text": "Still waiting for the new g5s", "time": "06-14-2017 06:24 PM", "replies": []}, {"postID": "post5900872", "text": "https://twitter.com/HeyAndri/status/889873013356679168\nfunction loadx(data) {\n  document.write(data.html);\n}", "time": "07-26-2017 05:32 PM", "replies": []}, {"postID": "post5965832", "text": "Looks nice....kinda like the gen 1 X..http://forums.androidcentral.com/e?l...token=2tpIe_8B", "time": "09-09-2017 10:51 AM", "replies": []}]}, {"title": "Are you looking forward to the dual camera?", "thread": [{"postID": "post5897966", "text": "The gs5 plus should be incorporating dual cameras. Depending on how the implementation is, it could be a great dual camera in the mid range market.", "time": "07-24-2017 03:00 PM", "replies": []}, {"postID": "post5897988", "text": "IF they don't compromise much on quality. I have a LG G6 and the wide angle lens is REALLY useful... but - and this is a big but - the cameras are a bit meh. LG used the same sensor for both rear cameras, and neither are great. They are good... but good in a 2015 sort of way.\nBased on that, dual cameras that add functionality vs. improve quality, I'm over.\nHow are they using the two cams? I haven't found a lot of info on it so far other than a vague throw-away line about how they will have a color/B&W pairing like Huawei uses.", "time": "07-24-2017 03:22 PM", "replies": []}, {"postID": "post5898882", "text": "Will this be the first mid range phone with flagship cameras?", "time": "07-25-2017 08:04 AM", "replies": []}, {"postID": "post5900567", "text": "Probably the same color/b&w setup as the Z2 Force", "time": "07-26-2017 12:58 PM", "replies": []}]}, {"title": "G5S and Plus", "thread": [{"postID": "post5897904", "text": "So, if the rumoured devices are to become a reality, what do you think they ought to include to make them preferable to the G5 and G5 Plus? That's a way of saying, What did the manufacturer get wrong about those two phones?", "time": "07-24-2017 02:06 PM", "replies": [{"postID": "post5897925", "text": "I don't feel there is much wrong with the g5 plus. These updates seem like they will be minor (processor, battery, camera)", "time": "07-24-2017 02:27 PM", "replies": []}]}, {"postID": "post5898883", "text": "What is changing about the battery from the G5+ to the G5S+?", "time": "07-25-2017 08:05 AM", "replies": []}]}, {"title": "Do you think that the g5s plus will have a premium feel?", "thread": [{"postID": "post5897969", "text": "I had the g4 plus last year and it was a good phone, but it felt really cheap. This year with the rumored g5s plus, it looks like moto is stepping up the game with the metallic chassis. Hopefully they can pull off a premium feel phone for not much more than what a g5 plus is going for.", "time": "07-24-2017 03:06 PM", "replies": []}]}]
