[{"title": "Will we ever see an update? Should I give up hope and go Lineage?", "thread": [{"postID": "post6176433", "text": "I have a Le 2 and a Le Max 2. AWESOME phones.\nBut still rocking Marshmallow and seriously bad security patches.\nShould I give up faith and just install Lineage?", "time": "03-02-2018 12:13 AM", "replies": []}, {"postID": "post6176473", "text": "Normally, we don't recommend people flash custom firmware at the risk of possible security flaws and the risk of breaking their phone(s) due to inexperience.\nBut given LeEco's troubles, it's not unreasonable to assume that support would have dwindled.\nIf you're willing to take the plunge, you can check out the XDA forums, but I do highly recommend reading up a lot on the flashing process and understanding the risks and knowing any recovery methods should the worst happen.", "time": "03-02-2018 01:20 AM", "replies": []}]}, {"title": "LeEco Le 2 Pro - Can't do factory reset", "thread": [{"postID": "post6166139", "text": "After selecting \"Reset Phone\" and confirming Reset, it goes to LeEco RECOVERY screen for a several seconds and then reboots normally as if I asked to reboot. \nPlease help. How to reset the phone?\nP.S. I have 2 LeEco Le 2 Pro, and the other did fine.", "time": "02-18-2018 10:42 PM", "replies": []}, {"postID": "post6166230", "text": "Welcome to Android Central! Are you trying to reset it from the Recovery Menu, like this? LeEco Le 2 Pro X20 - How to Hard Reset my phone - HardReset.info", "time": "02-19-2018 02:24 AM", "replies": []}, {"postID": "post6166367", "text": "Hi, thanks for getting back to me.\nI've tried from the Settings menu and with your recommendations as well. Unfortunately, it works until step 3. After LeEco RECOVERY shows up, I press Power button (step 4) and then the phone reboots and shows normal LeEco screen as if I've just switched it on.", "time": "02-19-2018 08:23 AM", "replies": []}, {"postID": "post6166433", "text": "I wonder if those steps are a little misleading. Try the following:\n1. Power off the phone.\n2. Press and hold Power and Vol Up until you see the LeEco logo -- then release the Vol Up button only.\n3. Keep the Power button pressed until the Recovery Menu appears (hopefully).", "time": "02-19-2018 10:25 AM", "replies": []}, {"postID": "post6166662", "text": "Oh, I see. My guess is that for normal phones the steps work fine either way  Thank you for helping me!\nI did as you explained but got the same result. Here's a video what happens each time when I try to factory-reset: https://drive.google.com/file/d/1eO7...ew?usp=sharing (sorry for the ancient quality)", "time": "02-19-2018 02:02 PM", "replies": []}, {"postID": "post6166864", "text": "Hmm -- sorry, but I don't have a good explanation for that other than it could be a problem with the firmware or motherboard. Is it under warranty?", "time": "02-19-2018 05:40 PM", "replies": []}, {"postID": "post6167097", "text": "Actually, I couldn't find if it's 1-year or 2-year warranty. Anyway, I will contact the seller.\nIt's been a pleasure to communicate with you. Thank you and good luck!", "time": "02-19-2018 11:42 PM", "replies": []}]}, {"title": "LeEco S3 Known Issues", "thread": [{"postID": "post5557263", "text": "Has anyone had any issues?\nA few recurring ones for me are practically unusable wifi speeds. Occasionally I will go an hour without any web-based notifications and as soon as I leave wifi I get flooded with fb messages, emails, etc.\nSecond: SMS messages not sending/receiving randomly for hours. I have a TMO sim which was previously used in my GS7 without any issues. \nThanks", "time": "11-10-2016 10:50 PM", "replies": []}, {"postID": "post5557273", "text": "I haven't had any of those issues on AT&T or with Wi-Fi. \nThough I swear every once in a while the touch screen registers touches about a cm to the right. Like, VERY rarely! And a couple times I've had the screen lock. Tapping the power button and waking it fixed the problem every time.", "time": "11-10-2016 11:01 PM", "replies": []}, {"postID": "post5557748", "text": "Not a single problem here. Wifi has been good, cell has been good. This is with T-Mobile.", "time": "11-11-2016 08:56 AM", "replies": []}, {"postID": "post5563298", "text": "I have problems with the phone working when using the bundled headphones. People can't hear me. Phone hangs up. Seems to work better with with no headphones", "time": "11-14-2016 09:18 PM", "replies": [{"postID": "post5563304", "text": "Are you using the bundled headphones or are you using the adapter?", "time": "11-14-2016 09:21 PM", "replies": []}]}, {"postID": "post5563313", "text": "I'm using the bundled headphones", "time": "11-14-2016 09:32 PM", "replies": [{"postID": "post5564241", "text": "Weird. I just did a 2 hour long phone conference with those and they worked fine. Have you tried the bundled adapter?", "time": "11-15-2016 12:42 PM", "replies": [{"postID": "post5569496", "text": "Haven't tried yet. Will try that.", "time": "11-18-2016 05:32 PM", "replies": []}]}]}, {"postID": "post5600856", "text": "Recently my S3 has been stuttering when I scroll down on an app. Most commonly, Chrome and Settings. This is pretty annoying. The screen will freeze up for few seconds until jumping to the correct location. I've also noticed that my available RAM never gets above 700-800MB. I finally just restarted and I haven't seen any issues yet. I've submitted feedback thru the app already.\nAnyone else with similar issues?", "time": "12-09-2016 03:02 PM", "replies": [{"postID": "post5600959", "text": "Only thing I was about to ask is if the available RAM should ever get above 1.3GB as on mine it never does.\nOther than that, no problems here.", "time": "12-09-2016 03:53 PM", "replies": []}]}, {"postID": "post5600869", "text": "The only issue I have is the screen flickers when incoming calls shows up.", "time": "12-09-2016 03:11 PM", "replies": []}, {"postID": "post5609026", "text": "Found something. I'm getting a massive amount of feedback in Google duo. Anyone have ideas about fixing this? Both my phone and my wifes phone seem to do it. If we mute one phone it goes away but it kind of screws up the point of Duo.", "time": "12-15-2016 02:00 PM", "replies": []}, {"postID": "post6110003", "text": "Hi guys, I recently got the LeEco S3 X626 phone about a week ago. I noticed it freezes and then restarts. Has anyone had a similar experience?", "time": "12-17-2017 03:31 PM", "replies": []}]}, {"title": "Why can't I hook up my Bluetooth device anymore?", "thread": [{"postID": "post6077139", "text": "I recently started having a problem with my Bluetooth headphone. They connect and are found on my phones connected devices, but when I run YouTube or Netflix it just stops the app in it's tracks and I have to force the apps closed. Anyone with any advice please help. Thanks", "time": "11-19-2017 05:00 PM", "replies": []}, {"postID": "post6077629", "text": "Welcome to Android Central! Those apps only malfunction when you're using those headphones? Are the videos pausing, or is the whole app freezing?", "time": "11-20-2017 01:59 AM", "replies": []}]}, {"title": "LeEco Le 2 charges slowly after a factory reset", "thread": [{"postID": "post6071777", "text": "Hello Everyone,\nI recently ordered a phone 3 months ago. and I must confess, its a nice phone.\nAnd I believe it is a stock ROM. One day after updating all my apps successfully, some days later one of the app (dictionary) started giving me a false update. It will display downloading then the status of the download is paused. Whenever I click on the item downloading it will do nothing. If I reboot the phone, more downloads will appear and so on. So I uninstalled the dictionary app thinking it will stop, but that same downloading still appeared. Then I decided to do a factory reset on the phone but before doing that, I backed up my apps including system and user apps. \nAfter the factory reset, I installed all the applications but I keep getting \"sorry google play services has stopped\" error messages, I have updated to the current play services 11.7.46 and I am still getting the same error message.\nAnd the most annoying thing is that, after the reset, the phone stopped charging fast, though the fast charging is enabled, now it takes for ever to charge to 100% and it discharges fast too and when charging, the battery temperature raises above 45 degree.\nSo I believe that the factory reset removed the fast charging from the phone.\nplease I need help on what to do\nthanks", "time": "11-15-2017 05:46 PM", "replies": []}]}, {"title": "Paranoid Android on Le Pro 3", "thread": [{"postID": "post6004368", "text": "I got Paranoid Android running on my Le Pro 3 a couple of weeks ago. Its running pretty well. There are a few bugs but overall, it's a great way to get the latest updates on this completely underappreciated phone. \nI'm going to install it on my wife's Pro later this week, when the new one comes in. She dropped hers and shattered it a few days ago, I've got a replacement coming from Amazon for $190 crazy deal if you ask me. \nThe install is not for the faint of heart but it is worth it.", "time": "10-04-2017 03:31 PM", "replies": []}]}, {"title": "LeEco Le S3", "thread": [{"postID": "post5539456", "text": "Le Pro3 and Le S3 hands-on: Welcome to the U.S., LeEco | Android Central", "time": "11-01-2016 02:41 PM", "replies": []}, {"postID": "post5549484", "text": "The chamfered edges are nice.The build quality is amazing for this price point. ( I got the discount) The battery charges super fast and holds a charge really well. There really isn't a lot of bloat. The speaker gets loud but I haven't tried it out with any headphones yet. The finger print works well and fast. This is kind of similar to the Honor 5X which I also tried for a week or 2. This phone is wayyyyy nicer for about $60 more.", "time": "11-06-2016 03:46 PM", "replies": []}, {"postID": "post5553756", "text": "Mine arrived tonight...but I\"m resisting the urge to open the plastic wrapping until I've decided whether or not to return it.", "time": "11-08-2016 06:47 PM", "replies": []}, {"postID": "post5553892", "text": "Open it! You know you want to!!", "time": "11-08-2016 08:50 PM", "replies": []}, {"postID": "post5889949", "text": "hey guys, is this still a good phone for $118 at geekbuying?", "time": "07-18-2017 02:25 PM", "replies": [{"postID": "post5914856", "text": "It is but it will most likely see no more software updates so unless you are comfortable flashing custom ROMs, I would personally get a second hand or Amazon ad version Moto g5 plus or Nokia 6. The leeco s3 would do the trick for basic smartphone use, but I hate the leeco UI more than any Chinese Android overlay and the amera is meh at best.", "time": "08-07-2017 01:15 AM", "replies": []}]}, {"postID": "post5892629", "text": "Doesn't look like a bad deal.", "time": "07-20-2017 12:15 PM", "replies": []}, {"postID": "post5949407", "text": "the pro is a better deal at it's price point. the build quality is excellent. my wife drops her on concrete all the time and it hasn't broken. I'm impressed.", "time": "08-31-2017 05:51 PM", "replies": []}]}, {"title": "New eui 6overdue", "thread": [{"postID": "post5920194", "text": "Pls when are we getting EUI 6s (android N) update?", "time": "08-11-2017 07:20 AM", "replies": []}, {"postID": "post5949399", "text": "LeEco is basically out of business in North America. See the hacking community for updates at this point. great damn phone though. I'm totally happy with the build quality nine months in.", "time": "08-31-2017 05:47 PM", "replies": []}]}, {"title": "Should I buy a LeEco s3?", "thread": [{"postID": "post5538752", "text": "I'm in the market for a new. CHEAP phone. I currently have a Nokia Lumia 635, which is honestly pretty bad. I was looking at the G4 Play, but I really want a bigger screen..\nI've never heard of LeEco, but somehow I ended up on their website. \nThey're having some flash sale thing tomorrow, bringing the price down to what seems like a stunning $150. Is that true? A fingerprint scanner, 5.5\" 1080p panel, Snapdragon CPU, 13MP camera and much more for $150?\nCan anyone vouch for their quality? Any opinions?\nThanks.", "time": "11-01-2016 09:29 AM", "replies": []}, {"postID": "post5538829", "text": "Up and coming brand; \nIndia seems to be the target market ; despite the (high) specs I doubt the quality of the hardware; eg quality of the Ram, etc\nPersonally I hate Samsung ; still using one since there are plenty of resources when I need help, etc rooting", "time": "11-01-2016 10:07 AM", "replies": [{"postID": "post5538846", "text": "I wouldn't want to take a risk, but $150 is at the very top of my budget. The only phone that fits the bill besides this one is the G4 play. The Le eco has MUCH better specs all over, but like you said, the quality could be mediocre.\nI guess it comes down to, is it worth the risk to buy from an almost unknown Chinese company that may or may not offer a warranty or supply updates.\nI'm going to go look at the warranty.", "time": "11-01-2016 10:17 AM", "replies": []}]}, {"postID": "post5538973", "text": "no, even though it is very cheap, the software is junk.", "time": "11-01-2016 11:09 AM", "replies": [{"postID": "post5539008", "text": "Thanks for the info! I'm coming from a Windows 8 phone, having never used an android I feel it won't be as bad as for most others.\nI'm registered and ready for as soon as it goes up tomorrow. If I decide to get it. I've read all the blog posts, and really everyone seems to like it. Even with all the weird software it doesn't look too bad. Could be good, who knows.Why is this? I have yet to see any reviews saying it's terrible. It's different, yes. But even say I hate it, I'd think there's a way to get around most of it.\nMore opinions!", "time": "11-01-2016 11:30 AM", "replies": []}]}, {"postID": "post5539988", "text": "I just asked LeEco about any future plans to upgrade to nougat and got this:\nHello Melopuf, thank you for your interest in our products! Unfortunately we cannot comment on unannounced updates, but please continue to follow us on our fan pages for the latest updates.\nWhich was kinda disappointing.. Then I asked about security/stability updates in general and got this:\nWe have a fully staffed R&D team standing by to work on updates. Our phones are also configured with a System Update app that allows you to download and install updates over the air for your convenience. This app will even automatically notify you when new updates are available.\nWhat does that mean exactly?", "time": "11-01-2016 06:26 PM", "replies": []}, {"postID": "post5540129", "text": "Forget about manufacturers' support; never existed \nInstead lurk at eg Xda and see whether it is a popular device", "time": "11-01-2016 07:34 PM", "replies": []}, {"postID": "post5540501", "text": "Does anyone know how long it should be until there are tons of aftermarket cases for these?\nIf/When I get the S3, I'd rather not pay $20 for a silicone case and $10 for a screen protector. But that may be the case if it takes these companies a month to manufacture cheap cases/screen protectors.", "time": "11-01-2016 11:01 PM", "replies": []}, {"postID": "post5540959", "text": "For lesser known phones, it takes some time. There might be a few available now but in a few months, there should be more options ideally. (For context, I have an Honor 8, which was released late August-early September, and more cases became available last month, compared to just a few before.)", "time": "11-02-2016 08:18 AM", "replies": []}, {"postID": "post5540982", "text": "Right now, there are none. Besides what they sell which are insanely overpriced. If I get the phone, which I'll talk about in a second, I'll probably just be careful with it until there are some cheaper cases. I would have thought there would be 1 or 2 aftermarket cases available on launch, but I guess not.\nAs for getting the phone, it's starting to look like I may not.. I'll try to, but it's looking more and more like I won't be home at 10AM PT. But I'll do my best.", "time": "11-02-2016 08:26 AM", "replies": []}, {"postID": "post5541119", "text": "Just an FYI:\nThe American LeEco Le S3 is the exact same phone as the Indian LeEco Le 2LeEco Le2 Specifications and Parameters - Lemall.com\nDimensions for Le 2 : 15.11 × 7.42 × 0.75 cm (5.95 x 2.92 x 0.3 in)\nDImensions for S3 : 151.1 x 74.2 x 7.5 mm (5.95 x 2.92 x .30 inches)\nSo, any case made for that one, should work just fine! Also, take a look at reviews for that device if you want more info about the phone!", "time": "11-02-2016 09:43 AM", "replies": []}, {"postID": "post5541129", "text": "So this would work? https://www.amazon.com/Impact-Resist...cUvbUpU5541129\nIf so, there are cheap cases galore!", "time": "11-02-2016 09:51 AM", "replies": [{"postID": "post5541166", "text": "Yeppers!!! Also remember that it DOES come with a TPU case in the box (i know, not quite the beefy case you linked to, but there is at least something!)\nAlso, a question. I did the little spin wheel and got (quite a few) coupons added to my account. It says they are active, but I have NO CLUE how to actually use them. I added an item to my cart and went to check out, and there was no way to add the coupon. No codes on the page, no way to click on them...nothing! Hopefully they'll magically activate when the flash sale starts. I'd like to get the glass screen protector for $5.00!", "time": "11-02-2016 10:13 AM", "replies": []}]}, {"postID": "post5541226", "text": "On my Nokia, I'm starting to fear that I wont make it.. I'm trying to get home quick enough but I'm not sure. I hope they have enough to keep it going for a bit. \nAnd thanks for the info about the case!!", "time": "11-02-2016 10:37 AM", "replies": []}, {"postID": "post5541290", "text": "for reference....here's pics of the TPU case that is sold on lemall india and US, for the S3 and Le 2. The one thing that grabbed my attention is that tiny (i'm guessing microphone) hole just above the camera.LeMall IndiaLeMall US", "time": "11-02-2016 11:06 AM", "replies": []}, {"postID": "post5541340", "text": "I made it back!!!!!\nAs for promo codes from the wheel, atleast for me they are automatically applied right before the payment method screen.", "time": "11-02-2016 11:35 AM", "replies": [{"postID": "post5541368", "text": "Ahh...I see now. I had a bluetooth headset in the cart too, and it only applied the '$22 off' for that, but not the $5 for the screen protector...if I add a 2nd screen protector (even though i have 2 screen protector coupons) it still only applies 1 code. Might be making multiple orders! It would appear that it only takes the largest discount. hmm...", "time": "11-02-2016 11:49 AM", "replies": [{"postID": "post5541379", "text": "Not saying it's good, but I could see them doing that.\nI'm all ready to get one in 4 minutes. I'm getting the phone and a $5 screen protector.", "time": "11-02-2016 11:55 AM", "replies": []}]}]}, {"postID": "post5541392", "text": "Got one!!!!! \nAccidentally freaked out and got 2 sets of screen protectors and a case I didn't want, but it only came to 165 so eh 15 bucks and I have an extra protector and case.", "time": "11-02-2016 12:04 PM", "replies": [{"postID": "post5541507", "text": "Congrats! Let us know your first impressions and general thoughts on it when it comes. That's a great deal though!", "time": "11-02-2016 01:10 PM", "replies": []}]}, {"postID": "post5541478", "text": "It shows $249 right up until right before you pay. After selecting what color and stuff. I still don't know how I got 2 screen protectors and a case, nor how that only added up to like 5 bucks lol.\nI was split between Grey and Gold so I just clicked one quick and it ended up being gold. Never had a gold phone, nor has anyone here. Looks amazing to me! \nI literally am so excited right now lol. I just hope it doesn't take a month+ to get here lol.", "time": "11-02-2016 12:58 PM", "replies": [{"postID": "post5541565", "text": "I ordered the Pro 3, so gold was my only choice. I'm not really fond of that color, but maybe if I like the phone enough it'll grow on me.", "time": "11-02-2016 01:33 PM", "replies": []}]}, {"postID": "post5541554", "text": "Great deal indeed! Congrats! Please, let us know how things go.", "time": "11-02-2016 01:26 PM", "replies": []}, {"postID": "post5541738", "text": "Can't say or not if it's true, but it says it will be here within a week.", "time": "11-02-2016 03:01 PM", "replies": [{"postID": "post5541750", "text": "Yeah...took me a minute to figure this out, but it looks like it's saying delivery by 11/9:", "time": "11-02-2016 03:14 PM", "replies": []}]}, {"postID": "post5541949", "text": "I did find out I ordered an extra screen protector and a case. It comes with the exact same case I accidentally ordered lol.\nSo if anyone needs a case and screen protector we can work something out. \nI could just return them but I'd probably end up paying shipping, and I just don't feel like going through the hassle of a return.", "time": "11-02-2016 04:44 PM", "replies": []}, {"postID": "post5544027", "text": "Ordered yesterday...... got it today..... fastest ever......", "time": "11-03-2016 04:20 PM", "replies": [{"postID": "post5544094", "text": "Seriously?! Whoa, please post impressions! If you already have, my apologies.", "time": "11-03-2016 05:06 PM", "replies": []}]}, {"postID": "post5544256", "text": "Also ordered yesterday and fedex says delivery tomorrow. Wicked fast shipping!", "time": "11-03-2016 06:52 PM", "replies": [{"postID": "post5544355", "text": "Wow! Please share your impressions?", "time": "11-03-2016 08:08 PM", "replies": [{"postID": "post5544358", "text": "As soon as it gets here I plan too! Can't wait!", "time": "11-03-2016 08:13 PM", "replies": []}]}]}, {"postID": "post5545047", "text": "My Pro3 is apparently on a slow boat from City of Industry, California...with a stopover in Winslow, AZ.", "time": "11-04-2016 07:46 AM", "replies": []}, {"postID": "post5545540", "text": "Initial impressions:\nIt's beautiful.. \nDon't love the TPU case, it's going to get dirty fast and I have 2 of them now lol. But it will definitely work for right now until the aftermarket beefy cases come out.\nBefore I start her up we need to go to the T-Mobile store and get a nano sim. That's somewhat disappointing lol.", "time": "11-04-2016 11:11 AM", "replies": [{"postID": "post5545747", "text": "You should be able to power up and get it running even without a SIM, right? The SIM is only for the phone/LTE service.", "time": "11-04-2016 12:54 PM", "replies": [{"postID": "post5545913", "text": "It asked for a sim so I decided to just wait a bit. We were going out anyways, so it wasn't a big deal. Just got it and got back home..\nLet me just say, I love it! Fingerprint scanner works like a charm, camera is amazing, atleast to me compared to the lumia, and the interface is honestly not bothersome at all. Yeah, there's a \"live\" button that's right in the center of the bottom bar, but it's not like I accidentally press it or anything. Sure a clean android may be better, but so far I wouldn't say that's even close to a reason to not buy it. Like Scott said, build quality seems very good. Picture looks great, although I'm coming from the 635 so I'm not great at saying whether or not it's a good picture for what it is.\nLove it!", "time": "11-04-2016 02:26 PM", "replies": [{"postID": "post5545985", "text": "You could always just use a different launcher like Nova. That's the first thing I put on my last two new devices.", "time": "11-04-2016 03:12 PM", "replies": [{"postID": "post5545993", "text": "I hate to sound stupid, but is that easy to uninstall say if the warranty was needed? I feel like they wouldn't want you sending it back with a 3rd party launcher on it.\nI do a lot on computers, but phones, and android, are very new to me.", "time": "11-04-2016 03:16 PM", "replies": [{"postID": "post5546018", "text": "No...it's just an app that changes your interface. It doesn't require rooting or flashing or anything that might void a warranty. \nOne thing it CAN'T change is the notification shade, though...unfortunately. Some parts of the Mfr skin are untouchable without root access.", "time": "11-04-2016 03:41 PM", "replies": []}]}]}]}]}]}, {"postID": "post5545588", "text": "I got the gold one. Build quality is really good. Fingerprint works flawlessly so far. I threw Nova on it right away. I have about 57 apps installed and I have 18.74gb left on storage out of the 29.12 or so gb you start off with. Single speaker sounds good and gets loud. I haven't tried listening to music to see how the Dolby Atmos works yet. The only problem I foresee right now is lack of accessories available. When even Amazon doesn't have anything you know they must be new in this country", "time": "11-04-2016 11:31 AM", "replies": []}, {"postID": "post5545630", "text": "Fingerprint to unlock works with Last Pass password manager", "time": "11-04-2016 12:00 PM", "replies": []}, {"postID": "post5545937", "text": "The 2 photos on the top are the Le S3 and the 2 on the bottom are from my Moto X Pure", "time": "11-04-2016 02:40 PM", "replies": []}, {"postID": "post5545946", "text": "Attachment 245157Attachment 245158Attachment 245159Attachment 245160\nsame", "time": "11-04-2016 02:45 PM", "replies": []}, {"postID": "post5545963", "text": "Attachment 245161Attachment 245162Attachment 245163Attachment 245164\nsame. So I don't think this camera is up to par with the Moto X Pure. But for $149.00 I think its a decent camera", "time": "11-04-2016 02:55 PM", "replies": []}, {"postID": "post5545968", "text": "IMHO the Moto X has better color reproduction and lets in more light. I will try and get some outdoor shots to post here", "time": "11-04-2016 02:57 PM", "replies": [{"postID": "post5545988", "text": "I'll have to try the Pro3 against my LG G3 to compare.", "time": "11-04-2016 03:13 PM", "replies": []}]}, {"postID": "post5545976", "text": "top 2 Le S3 bottom Moto X Pure", "time": "11-04-2016 03:05 PM", "replies": []}, {"postID": "post5546003", "text": "If you factory reset to send it in for repair it will delete the Nova Launcher and all your other installed apps.", "time": "11-04-2016 03:26 PM", "replies": []}, {"postID": "post5546046", "text": "Thanks guys! I'll install it and play around!\nOne question I do have which may or may not be their skin, should it show the exact battery percentage and service etc when you pull down from the top? I believe that's the notification shade. I'm used to sliding down from the top of my lumia and getting the specifics of what's shown up there, like the battery percentage.\nIs this just android or no? Either way, does anyone know how to see the battery percentage on these easily?", "time": "11-04-2016 03:59 PM", "replies": []}, {"postID": "post5546053", "text": "Hey guys! I created a thread to post your photos. Show us what this camera can do http://forums.androidcentral.com/sho...d.php?t=742870\nLeEco S3. Show us your photos!", "time": "11-04-2016 04:03 PM", "replies": []}, {"postID": "post5546167", "text": "what you have to do is hit the recent apps button and it pulls up that and your quick toggles etc. You can't get your quick toggles by pulling down which is how most androids work", "time": "11-04-2016 04:51 PM", "replies": []}, {"postID": "post5546208", "text": "Pulling down with two fingers didn't work. \nGoing to recent apps works, but I installed GSam and now the percentage is always up there which is great!\nI didn't dislike the Le Eco launcher at all. Until I used Nova launcher. Wow this is amazing!!! \nAnother thing I found that I honestly LOVE, is the IR blaster. When I heard that they decided to remove the 3.5mm jack and add an IR I was kinda ticked off. But I didn't even really think about it. I thought it was so that you can control their TVs and like sync them together or whatever. But it just acts as a remote for any TV. And being that I can never find the remote for my TV, or any TV in the house for that matter, it's very useful to me.", "time": "11-04-2016 05:18 PM", "replies": []}, {"postID": "post5546344", "text": "I don't know if anybody has the answer but I was wondering if the 2 LeEco phones they released in the US have the same camera?", "time": "11-04-2016 06:55 PM", "replies": [{"postID": "post5546352", "text": "Every review I've found say that they are identical.", "time": "11-04-2016 07:01 PM", "replies": []}]}, {"postID": "post5546393", "text": "I have run into my first problem that may end up in getting it replaced.\nThe left speaker on the bottom of the phone is not working. It's always possible that it's not supposed to(?) but I don't think so.. Could anyone confirm this? This is youtube videos, netflix etc etc.\nThis could be one of those styling features like the \"speaker\" grill on the top of the front of the phone, I'd just like to be sure.\nEDIT: Was just chatting with Le Eco support, the left speaker is a microphone in disguise. That would explain it!", "time": "11-04-2016 07:33 PM", "replies": []}, {"postID": "post5559158", "text": "It doesn't show the battery percentage as shipped. But you can change that in System Settings - Battery. It's the first toggle there.\nThe service information is displayed in the notification bar on the lock screen, and it also shows when you pull down the notification shade. I haven't found any way to get it to show in the normal UI.", "time": "11-12-2016 04:28 AM", "replies": []}, {"postID": "post5559174", "text": "My impressions:\nThe Snapdragon 652 is fast. I did some benchmarks; it's on a par with the Snapdragon 801, which is what was in flagship phones two years ago. At this price level it's an impressive level of performance.\nI couldn't live with the lack of an app tray. So I installed the Google Now launcher because it's what I'm accustomed to. I may try out some of the other launchers that have been suggested here.\nNFC would be nice. But other phones in this price class also leave it out. I'd love to have support for a MicroSD card.\nI thought the Band 12 support was broken; I kept trying to see if I got connected on it but always got the usual band 4. But a few days ago I was in a basement where I have a weekly meeting, and there it was. Weak, but my previous phone with no Band 12 support got nothing at all in that location. (I use LTE Discovery for the info.)\nVoLTE and WiFi calls sound great. Phone calls without the usual CELP encoding artifacts are a big step forward. Again, my first phone with support.\nAll in all, an astonishing value if you get it for $150. I was looking for a replacement for my Zenfone 2 which started acting up, but my budget is limited right now so this is plenty good enough. My dream device is the LG V20 (especially for the audio features) but I don't want it enough to scrape up $800!", "time": "11-12-2016 04:50 AM", "replies": []}, {"postID": "post5559176", "text": "LeEco pushed out a system software update for the Le S3 yesterday. It's bug fixes and little UI tweaks, not a major change. The release notes say there is now a setting for backlighting of the capacitive buttons but I haven't found it. I did find a setting for moving the back button to the left side as it is on most Android phones (the app switcher then moves to the right side) - it changes the function of the buttons but the icons remain, so pressing what looks like the app switcher actually goes back and vice versa. Weird but it does preserve your touch memory.", "time": "11-12-2016 04:57 AM", "replies": []}, {"postID": "post5576077", "text": "Does the S3 have stereo speakers? How do the speaker /speakers sound? Loud? Does Dolby help? Have you used 3.5mm adapter with your headphones?", "time": "11-22-2016 09:53 PM", "replies": []}, {"postID": "post5910498", "text": "No stereo speakers", "time": "08-03-2017 06:35 AM", "replies": []}]}, {"title": "Le 2, Le Max 2, S3, Best screen protector?", "thread": [{"postID": "post5885403", "text": "Im wondering which brand is best for retaining or enhancing visibility and retaining the touch sensitivity?", "time": "07-14-2017 05:27 PM", "replies": []}, {"postID": "post5893072", "text": "Can I please get some advice here, I cant find any locally in NZ.\nGenerally speaking is there any difference in screen protectors?\nI thought I read some enhance the screen. Im only concerned with stopping scratches, but most importantly I want to retain the vibrant screen and the touch response.\nMod Note: Added questions from duplicate thread.", "time": "07-20-2017 05:12 PM", "replies": []}, {"postID": "post5893077", "text": "Do you have access to Amazon? I buy most of my stuff there but don't know if my brand, ArmorSuit makes protectors for your phone. You will get the most clarity and feel from glass, the most protection and, potentially, touch response from wet apply gel.", "time": "07-20-2017 05:15 PM", "replies": []}, {"postID": "post5894564", "text": "Thanks for that, yep I can order from Amazon, just takes ages to arrive down under here in NZ.\nI know Letv make a tempered glass protector specifically for the 5.5\" models. \nIll look into those ones you suggested though.\nThe gel ones are the ones you can run your finger nail down and the scratch returns back to normal?", "time": "07-21-2017 05:37 PM", "replies": [{"postID": "post5894626", "text": "Some call them gel, I think self-healing is more accurate. That's what I use.\nI have not used the Crystalusion, sorry, so can't comment on it.", "time": "07-21-2017 06:18 PM", "replies": []}]}, {"postID": "post5894609", "text": "Is this an example of the Gel ones and is it a good brand?Crystalusion Liquid Glass Screen Protection :: MobileFun.co.nz", "time": "07-21-2017 06:03 PM", "replies": []}, {"postID": "post5894794", "text": "It seems going on the hammer and scratch tests the gorilla glass 3 is pretty darn tough anyway, Ive seen it smashed with ball hammers and nothing happened, scraped with all kinds of things. Bizarre.\nLeeco do a 9H hardness screen protector specifically for it.\nThe liquid ones whilst probably the easiest dont last forever and you never know exactly when its worn out. But if it protects the back, I can see it being handy for having no case at all.", "time": "07-21-2017 09:41 PM", "replies": []}]}, {"title": "Problems with microphone of USB-C EARPODS", "thread": [{"postID": "post5670369", "text": "I have been having problems with microphone of USB-C EARPODS. \nAfter about a months of use, 2 different Earpod microphones has gone mute. Since I had additional ones, I tested and the new ones worked. \nLe Eco gave me a refund, but claimed it was isolated. I doubt it. \nAnyone else have this problem?", "time": "02-07-2017 10:02 AM", "replies": []}, {"postID": "post5860372", "text": "My USB-C audio adapter that came with my Le Max 2 already broke. I bought some new ones from amazon for 10$ u can try that perhaps.", "time": "06-23-2017 01:12 AM", "replies": []}]}, {"title": "How to use Android Pay on LeEco Le pro 3?", "thread": [{"postID": "post5835992", "text": "Hi, I got a LeEco Le Pro 3 directly from China 8 months ago. Android pay just released in Canada and I want to use it. \nBut, When I open Android Pay on my Leeco Le Pro 3, it said : \"Android Pay can't be used on this device - This may be because your device is rooted, has an unlocked bootloader or is running a custom ROM. As a result, Google can't confirm that your device meets Android Pay's security standards\". \nMy phone isn't rooted! I checked it with some weird apps I found on the Play Store.\nI do not have a custom ROM except if EUI is considered as a custom ROM.\nAndroid Version : 6.0.1\nEUI Version : 5.8.017S\nModel Number : LEX720\nThank you for your support!", "time": "06-01-2017 08:23 PM", "replies": []}, {"postID": "post5860371", "text": "You are right, EUI doesn't satisfy Android Pay's Security Standards. I have a custom rom of EUI on my Le Max 2 and Android Pay works on that. Perhaps you can try that.", "time": "06-23-2017 01:10 AM", "replies": []}]}, {"title": "Death sentence for my Le Pro3", "thread": [{"postID": "post5798465", "text": "So last night my wife and I were on the couch and my phone was on the coffee table. She reached for her drink and it tipped over. Some of the drink got on my phone and I quickly scooped it up and dried it off...but I could almost immediately see something was wrong. First, I kept getting the notification about headphones being plugged in even though nothing was connected to the USB-C port. I rebooted the phone, hoping it was just a software bug...and that notification went away and I thought it was all good. \nSo then when I went up to bed and plugged it in to the charger, nothing happened. No charging. I completely shut it down and then plugged it in again and at first it appeared to be charging, then it stopped...then started, then stopped...over and over. This morning the battery was down to 25% and it still was not taking a charge. Not from the regular cord, not from the Anker cord I bought. I tried through the converter that came in the box, I tried through the USB outlet in the kitchen, I tried through my car. Nothing. I think the USB-C port is fried. It wasn't even soaked! That's what kills me...the phone was in a case and barely got splashed! \nSo the port is apparently very sensitive and now my phone is down to 18% and I'm thinking it's a goner. I suppose I could hold out for a replacement? Not sure I want to now...the fact that it was so easy to take this device out troubles me and makes me less likely to want anything to do with another one. The amazing battery life will be a huge loss...\nAnyway, I sent off an email to Le Eco support...we'll see what they say.", "time": "05-03-2017 07:57 AM", "replies": []}, {"postID": "post5799378", "text": "Tough break. In the future, with any kind of liquid exposure, the safest thing to do is to completely power off the phone, then do the drying thing (by sealing it in a ziploc bag with uncooked rice or other desiccants for at least 24 hrs), or following the tips here: http://forums.androidcentral.com/amb...e-got-wet.html. If you continue to operate the phone while components are wet (and especially if you try to charge it), that could cause them to short out.", "time": "05-03-2017 06:09 PM", "replies": []}, {"postID": "post5800275", "text": "Yeah...it's been sitting in a bag of rice since yesterday morning. We shall see. They've sent me a Fedex slip for returning it for repairs. If it isn't working by tomorrow morning, I'll send it out.", "time": "05-04-2017 08:20 AM", "replies": []}, {"postID": "post5800311", "text": "Well, hopefully it all turns out ok. It is a little concerning that it only took that much water to do that, but who knows what happened.\nI'm not taking back what I said about the support being great as they were, but I may have spoken a bit too soon about my phone being fixed. After using the new charger for 3 days it no longer works and I'm back to my sister's charger.", "time": "05-04-2017 08:43 AM", "replies": []}, {"postID": "post5816140", "text": "Okay.\nSo after sending it out via FedEx and not hearing back for several days about the status, I sent LeEco an email asking for an update. I received a reply that I would hear within 2 business days of receipt (this was Friday I sent the message)...so I figured okay, maybe Monday or Tuesday?\nThen this morning at work, I received a text from my wife that a phone had been delivered. I was dumbfounded. They basically replaced my phone for no charge...and within a week. The only problem...in the meantime I'd decided I was just going to go ahead and take advantage of the good T-Mobile deal on the LG G6 (which is waterproofed, by the way). So I'm slightly torn. I mean, the Pro 3 was actually an awesome phone and I really grew to like the interface and the overall feel of the device. Unfortunately, I think I'm going to stick with my G6. I've got expanded storage (128 GB), better support for updates, waterproofing, a better camera and, to some degree, a bit more durability. \nSo now I have a basically brand new Le Pro3 here, ready to go. I'd hang onto it, but now it's kind of a waste of money. \nNeed to figure out the best way to sell this thing. I genuinely liked this device (especially the battery life!!!) and would recommend it to anyone looking for an affordable Android device...without hesitation.", "time": "05-15-2017 06:03 PM", "replies": [{"postID": "post5816903", "text": "Yep, just like what they did for me, just with a phone instead!\nI feel you, I love my S3 but that T-Mobile deal for the LG G6 tempts even me..\nIf you find you can't seem to get rid of it, I will happily take care of it free of charge.", "time": "05-16-2017 09:10 AM", "replies": []}, {"postID": "post5821816", "text": "Sell it on swappa", "time": "05-20-2017 05:22 AM", "replies": [{"postID": "post5827843", "text": "Done.\nJust shipped it out today. Wish I could have gotten more for it, but I think all the problems LeEco has been having the last six months have limited the resale value on these.", "time": "05-25-2017 12:17 PM", "replies": []}]}]}, {"postID": "post5818830", "text": "Well it looks like my time with the S3 is coming to an end.\nI just found a BRAND NEW AT&T S7 Edge at Walmart for $199. As long as AT&T lets me unlock it, it's my new daily driver.\nI have no idea why the have the clearanced to near nothing but I'm glad they do! I would have bought all of them to sell them for $450 each but alas my funds only allowed for one. That and I try not to be a terrible person to all the other people who wants them lol.", "time": "05-17-2017 04:17 PM", "replies": []}]}, {"title": "Charger stopped working, great customer support.", "thread": [{"postID": "post5786970", "text": "My charger stopped charging my phone this last weekend. It was probably my fault as it is frequently unplugged and plugged back in. I'm not the most careful with my chargers.\nAnyways, I emailed LeEco support on Saturday, and I got my first reply on Tuesday. When it took them 4 days to respond I got a little wary but my guess is they don't look at emails over the weekend.\nThey responded to the initial email asking for my order #, imei, address and a few other things. After that we went back and forth a bit about what was up, then they said they were going to transfer me to \"level 2 support\". This is when it came to mind that it could be months before I get my new charger.\nSurprisingly, they got back to me that same day! They needed me to confirm my address and they'd get right to it.\nNow today I get an email with a tracking number and them saying it shipped. It's estimated arrival is Friday! \nSo in under a week from me sending the initial email the charger should be here. No sending mine back, no weeks of them trying to avoid sending me a charger, just great customer support.\nIf anything, the one thing that made me want to avoid this company was the fear of terrible customer support. I'm not saying it won't change or that they're not just great for the first few months after release, but right now I'd happily give them an A++ in terms of customer support.\nGood job, LeEco!", "time": "04-26-2017 06:05 PM", "replies": []}, {"postID": "post5795111", "text": "Good to hear...though I am beginning to suspect ours might be the only devices released in the US by Le Eco due to all the news of financial trouble they've had over the last several months.\nI do take every opportunity to rave about the battery on this thing, though. I mean, this weekend I unplugged it around 7am on Saturday morning and didn't plug it in again until last night (Sunday) around 11:30 pm...and STILL had 19% battery life remaining. This was with normal use.", "time": "05-01-2017 10:37 AM", "replies": []}, {"postID": "post5795129", "text": "I know, it's sad. Look at the reviews of working at LeEco in cali. It's rated 2 stars on one of the big job rating sites due to horrible management that know nothing of how the US works.\nThe battery on my S3 is quite surprising too. It's not a huge battery like the Pro3 but I've never run out unless I forget to charge it. Now this is coming home with 5-10% battery but I also always have the brightness at 75-100% and use my phone alot. And it can charge back up to a good amount in what feels like minutes.", "time": "05-01-2017 10:48 AM", "replies": []}, {"postID": "post5817453", "text": "I had a similarly positive experience with my wife's phone when her charging cable died. P.S. the replacement has since died as well", "time": "05-16-2017 02:37 PM", "replies": [{"postID": "post5817792", "text": "As did mine! I'm currently working on getting another one.", "time": "05-16-2017 08:31 PM", "replies": []}]}]}, {"title": "Le S3 Questions - Wi-Fi settings", "thread": [{"postID": "post5815356", "text": "Hey there - I gave my wife my Le S3 after she broke her iPhone this weekend. It's doing well, but today she's at work and I can't go in and fix things for her. I have 2 questions:\nHow do you 'forget' a wifi network? She needs to reset her connection at work.\nHow do you enable Wi-Fi calling? I saw it's supported. We're on AT&T.\nI'd be able to get it if I had the phone in front of me.\nThanks.", "time": "05-15-2017 08:25 AM", "replies": []}, {"postID": "post5815509", "text": "To forget a wi-fi network, usually you go to Settings>Wi-fi, long-press the network, then tap Forget. Wi-fi has to be on at the time. Does it work differently on that phone?", "time": "05-15-2017 10:28 AM", "replies": []}]}, {"title": "LeEco Le Pro3", "thread": [{"postID": "post5505690", "text": "With a $100 instant rebate.LeEco Le Pro 3 Ecophone - 5.5'' FHD 4GB/64GB Smart Phone | LeMall.com", "time": "10-19-2016 01:15 PM", "replies": []}, {"postID": "post5505846", "text": "LeEco is poised to make a big splash.", "time": "10-19-2016 02:14 PM", "replies": []}, {"postID": "post5506095", "text": "The only negative so far is the lack of a headphone jack. But I might be able to learn to live with it considering the price. I'll definitely be keeping out an eye on reviews. If the software matches the specs, this could change the game...", "time": "10-19-2016 03:29 PM", "replies": []}, {"postID": "post5506100", "text": "There is no 3.5\" connection for my head phones. \nCan you charge the phone and listen to music at the same time?", "time": "10-19-2016 03:31 PM", "replies": []}, {"postID": "post5506322", "text": "I'm super interested in these phones, but I'm leaning towards the S3 for $150, but I'll have to wait for some reviews to see if it has NFC or not. I registered for the phones regardless.", "time": "10-19-2016 04:51 PM", "replies": []}, {"postID": "post5538593", "text": "Pretty positive review here: LeEco Le Pro3: Stunning battery life and high quality keep me from ordering a Pixel | ZDNet\nWhat I gather from the review is overall very positive, with the biggest drawbacks being:\n1: Annoying aspects to the software in the native launcher\n2: 1080p LCD display (though it sounds like the display is still nice and not being QHD means better battery life)\n3: The camera is \"decent\". Not really a drawback (I mean, hey...the phone is $400!), but if camera is a big deal it's something to think about.\n4: It sounds like Android Pay is not yet supported, but ought to be soon.\nLong battery life is a BIG plus, though...and the price (especially with the $100 discount) is fantastic enough to make me think I might try to get in on the flash sale. I did sign up just to have a chance if I decide to go for it. I'm currently on Sprint, but we've been talking about moving to T-Mobile...which is the only way I could use the thing anyway.", "time": "11-01-2016 08:15 AM", "replies": []}, {"postID": "post5539457", "text": "Le Pro3 and Le S3 hands-on: Welcome to the U.S., LeEco | Android Central", "time": "11-01-2016 02:41 PM", "replies": []}, {"postID": "post5541404", "text": "I went ahead and pulled the trigger on this one. We haven't even switched to T-Mo yet, so I can't say if I'll even keep it...but it seemed like a good deal on a promising device. We shall see...", "time": "11-02-2016 12:12 PM", "replies": [{"postID": "post5559753", "text": "Did you get it yet? I'd be interested in your honest opinion.", "time": "11-12-2016 02:20 PM", "replies": [{"postID": "post5560632", "text": "I did get it earlier this week (Tuesday, I think).\nI've only opened the box...haven't powered it up, though. Physically I'm impressed with the phone...it's solid. Good weight and feel. Beyond that, though, I can't say. It's mostly just a matter now of figuring out when to switch carriers. My wife wants us to, but doesn't want to actually deal with the hassle of getting the new phone and all the stuff that is involved. We're on Sprint now, so it's not like just swapping out SIM cards.", "time": "11-13-2016 07:41 AM", "replies": []}]}]}, {"postID": "post5541855", "text": "I'm a little skeptical about the display. My LG G3 is quad HD at the same size (5.5\")...so this is actually a step down. I'll still reserve judgment until I can see it first hand.", "time": "11-02-2016 03:57 PM", "replies": []}, {"postID": "post5546115", "text": "I'm hoping for some in-depth reviews that spend a lot of time covering the main concerns. Namely software stability, support, and how reliable the body is.\nThe fact that barely anyone says a single word on the huge black bezels has me very sceptical of many hands-on reviews.", "time": "11-04-2016 04:32 PM", "replies": []}, {"postID": "post5546956", "text": "Android pay works fine! I have my unit already. Any questions, ask away!", "time": "11-05-2016 05:09 AM", "replies": [{"postID": "post5547060", "text": "I'd definitely like to know about the camera and how it compares to other devices you own/have owned.\nAlso, I've seen different sources say that it does have expandable storage and that it does not. Please settle this one for me!\nThanks.", "time": "11-05-2016 07:25 AM", "replies": [{"postID": "post5547341", "text": "Both DO NOT have expandable storage but the Pro does come with 64gb of internal instead of 32 like the S3", "time": "11-05-2016 11:28 AM", "replies": []}]}]}, {"postID": "post5547369", "text": "Single sim card with no expandable memory. Camera seemed decent,maybe not better than the LG g4 .way better than my HTC one m8.", "time": "11-05-2016 11:51 AM", "replies": []}, {"postID": "post5554296", "text": "I bought this phone for my wife. We are coming from the Asus Zenfone 2. \nThis phone seems like a good step up in every way. It's solid build, premium chip and huge battery are some sweet selling points at a great price.\nThe software is a bit weird but after a week or two It will be normal. \nThe camera is better than I expected. Indoor shots look bright and crisp. \nI'm thinking of buying another one for myself. I'll kick myself if I miss out on the $100 off.", "time": "11-09-2016 07:02 AM", "replies": [{"postID": "post5627456", "text": "How is the blue tooth?\nSent from my XT1585 using Android Central", "time": "12-31-2016 06:56 PM", "replies": []}]}, {"postID": "post5555827", "text": "I put the Google Now launcher on my wife's phone last night and she is perfectly happy with it now. It's just going to take a bit of muscle memory training to get used to the flipped back button.\nI'm really starting to wonder why this phone is being overlooked. it kicks ***", "time": "11-10-2016 07:06 AM", "replies": [{"postID": "post5555840", "text": "Part of me wants to hate it just because of the name...the faux French-sounding name of a Chinese company.\nThen there's the pricing. People generally want to believe that, when it comes to smartphones, you can't get a quality phone for $150 or - in the case of a 821, all-metal body Pro 3 - $300.\nLastly, I think people are turned off the Flash Sale model. I agree it's not the best way to sell in the US, but I can understand the reasons for not wanting to go all-out. Oneplus took two or three cycles to get over their odd invite-only sales model. When stepping into a loaded - and uncertain - market, caution leads to these sorts of things.", "time": "11-10-2016 07:27 AM", "replies": [{"postID": "post5556105", "text": "For me, the flash sale thing but really the size. If they make a smaller phone, I might be more open to giving it a try even though I think it's cool.", "time": "11-10-2016 10:04 AM", "replies": []}]}]}, {"postID": "post5556572", "text": "If you really don't like the flash sales, feel free to buy it at full price. It's worth it. It does not seem that the flash sales are selling out very quickly regardless.", "time": "11-10-2016 03:07 PM", "replies": []}, {"postID": "post5562079", "text": "Alright, I gave in and powered it up. I was really just too curious. I haven't installed anything or signed into any accounts...so it's really just the basic interface set up right now. I'm only able to compare it to my LG G3, which is a 2.5 year old device. Based on that, though, I'm already impressed. I don't know what an S7 or a OnePlus 3 or a V20 (or even a V10) is like...so my perspective may be a little out of whack in comparison to someone who handles a lot of flagship devices regularly. \nMy comparison between the Le Pro 3 and the G3:\nFingerprint: well, this is my first time experiencing a fingerprint reader on a phone, but it seems quick and responsive. Easy to set up.\nHaptic feedback: much stronger on the Pro 3\nSound: FAR better on the Pro 3. The G3 sound was always very disappointing, so the bar was set pretty low. I must say I hate all the ringtone options...but that's all subjective.\nInterface: the lack of usable features on the notification shade is annoying and frankly confusing. I'm hoping they change this part of the eui interface...or at least allow as an option (much like EMUI has done with the app drawer with their recent v5 update).\nScreen: One advantage - on paper - my G3 has is the quad HD resolution vs. the Pro 3 HD resolution. Once I had them side by side, the difference was almost inconsequential. I didn't run a bunch of comparisons, but my initial impression was they are about equal. \nCamera: My G3 camera has always driven me a bit nutty. I do love the G3 camera app that allows you to take a photo by touching anywhere on the display, but the shutter speed was always...very...very...slow. On my half dozen test shots on the Pro3, the shutter was nice and quick and the shots appeared to be of decent quality. \nI'll have to run a couple actual tests on this device over the next week or two...just to see if I'm really okay with using this device for the next year or so. So far it's looking good, though...", "time": "11-14-2016 08:05 AM", "replies": []}, {"postID": "post5566173", "text": "Very positive review here (until it addresses the software, of course):http://www.digitaltrends.com/cell-ph...-pro-3-review/\nUltimately, it's the software that turns the reviewer off a glowing recommendation. I really hope LeEco is listening closely...", "time": "11-16-2016 03:43 PM", "replies": []}, {"postID": "post5628174", "text": "Bluetooth works fine. Have used with Bluetooth Speaker and Earphones.", "time": "01-01-2017 04:37 PM", "replies": []}, {"postID": "post5630144", "text": "Does the device support aptX for BT?", "time": "01-03-2017 01:44 PM", "replies": []}, {"postID": "post5635609", "text": "I have the phone. Ask me if you want.", "time": "01-08-2017 07:01 AM", "replies": []}, {"postID": "post5666779", "text": "So I finally am using this device, three months after buying it in the first flash sale. We'd been planning to move over from Sprint for the longest time, we were just waiting for an opportunity when one or both of us really needed to upgrade. Well, the LG G3 I'd been using started giving me real trouble. This was the second replacement for that phone - the first one bricked after just a few weeks, the second one after a little over a year. This time, the screen just started doing weird stuff - freezing up, fading out, flickering. Made it unusable...so we went over to T-Mobile last night and signed up.\nThe Pro 3 is a nice, solid device. Easy to set up, fast and responsive. The interface takes some getting used to, but it's not quite as annoying as I thought it would be. Slowly having to get rid of my LG muscle memory (I miss knock-on!), but I'm already getting the hang of it. The one thing I've noticed is the fingerprint reader is not as dependable as I'd hoped. I've figured out how to touch it to get it to wake faster, but I'd say it's probably somewhere between 50 and 75% success at first touch. \nAnother thing that took me a while to figure out was why my screen seemed so much bigger. The G3 was also 5.5\" (although it was a quad-HD display, this one seems just as crisp as that one did). No...I finally realized the difference: capacitive buttons. I'd gotten so used to the on-screen buttons, I never really thought about how much real estate they took up on the screen. It feels like I have much more room on this one, amazingly enough. \nI'm not a big 'music on my phone' kind of guy, so I haven't messed with the earphones or the audio, but what I've heard just messing with the notifications and ringtones, the audio on this is decent. Surely not among the top performers, but clearly better than my G3.\nWhile I tend to keep my phones in the 2 to 3 year range, I suspect this one will not be a long-term device for my 'daily driver'. It's good, not outstanding. I'm hoping to see some software and UI upgrades this year, hopefully closer to stock android as rumored. I have heard the camera is disappointing...but I haven't taken many photos yet, so we'll see. I think it's enough to keep me happy at least through this year...long enough until I can have a choice for a higher-end device with better camera and fingerprint sensor...maybe water-proof/resistant. We'll see. I'm sure I'll be back if anything comes up that I want to complain about (or praise, of course).", "time": "02-03-2017 02:30 PM", "replies": []}, {"postID": "post5689384", "text": "Okay...so after a few weeks of having this as my regular phone, I have the same concerns.\nThe camera just generally is not great. It's not awful, really...it just doesn't stand out. It's quicker than my G3 was, but the image quality is lacking and the audio quality on videos is not great.\nThe fingerprint sensor is still inconsistent.\nThe vibration is very weak. I'm constantly missing notifications and even calls because I don't feel the vibration in my pocket. My G3 also was pretty weak in this regard, but the Pro 3 is much worse.\nStill gotta complain about the lack of good quality protective cases. I ended up with a Nillkin textured thin case, but it's not anything close to a Spigen or Otterbox level of protection. This one is primarily for grip and to cover the gold color which I've never been wild about.\nOverall, I'd say this phone is good enough to keep me happy through the year. It's nice to have a low cost device that handles well and does most everything I need well enough. I think if anything about it will cause me to move on sooner rather than later (I usually keep phones for roughly 2 years) it will be the camera.", "time": "02-24-2017 05:02 AM", "replies": []}, {"postID": "post5689804", "text": "Did you download the 21S update rolling out in the last few days? Specifically, the finger print sensor seems more responsive. The camera with HDR enabled does not have any lag, as it did before. Photos look good. Be interested how you feel, after update. Don't forget we got it for $249?", "time": "02-24-2017 12:19 PM", "replies": []}, {"postID": "post5691688", "text": "I did update. Can't really tell a difference with the fingerprint sensor. I hadn't really tried enabling HDR, but it does appear to be low-lag.\nI'd still like a stronger vibration....and better cases!", "time": "02-26-2017 10:00 AM", "replies": [{"postID": "post5691707", "text": "Don't forget cheap $249 price.", "time": "02-26-2017 10:19 AM", "replies": []}]}, {"postID": "post5691757", "text": "I paid $299 when it first went on sale in November", "time": "02-26-2017 11:08 AM", "replies": [{"postID": "post5692951", "text": "Still great price.", "time": "02-27-2017 10:13 AM", "replies": []}]}, {"postID": "post5702519", "text": "Three other comments on my Pro 3 after about a month of use.\n1. Battery life on this thing is, in a word, FANTASTIC. On my old LG G3, it was often down to about 40 or 50 percent by lunch time. I usually had to charge it up off and on all day long. It took me a week or two to realize I don't have to plug this thing in AT ALL during the day and will usually still have at least 40% at the end of the day. I've never dropped into the single digits on this thing.\n2. The notification light is weak. Just like the vibration, I barely notice it even when I'm looking out for it.\n3. Weird thing happened the other day. I don't usually do music on my phones, but the other day I fired up Pandora and plugged in the headphones that came with the phone. About 20 minutes in, the phone totally flipped out. The screen went blank and the sound no longer came through the headphones, instead blaring out the main speakers. I ended up having to hard reboot the phone to get it back to normal. I don't know if it was something weird with the Pandora app or something with the phone, but I've shied away from using it at work for music anymore and uninstalled Pandora for now.", "time": "03-07-2017 08:34 AM", "replies": []}, {"postID": "post5746093", "text": "hey buddy how did you get android pay to work ? i spent 2 days trying different methods but it just wont work for me.", "time": "04-06-2017 12:55 AM", "replies": []}, {"postID": "post5754264", "text": "Yep...I've only used it once (that's the only time I've ever used it) just the other day. No problems.", "time": "04-11-2017 12:33 PM", "replies": []}]}, {"title": "Task Manager bug?", "thread": [{"postID": "post5724239", "text": "I use Nova Launcher and until the last day or two, when I would go to the task manager (left capacitive button), it would give me the home page as the primary option. From there I could press the home page preview or the 'LE' capacitive button to get to the home page. Now, when I select the task manager, instead of the home page preview, it shows me the last active app...so pressing the 'LE' capacitive button just takes me back to that app instead of the home screen. \nDid I inadvertently change some setting? I can't seem to get it to show me the home screen preview in the task manager anymore and pressing the 'LE' (home) button doesn't function that way anymore either.", "time": "03-24-2017 02:04 PM", "replies": []}, {"postID": "post5724247", "text": "For the home screen preview have you tried a long press on any blank section of the screen?", "time": "03-24-2017 02:10 PM", "replies": []}, {"postID": "post5724300", "text": "See attached. One is my typical home screen. The other is what I now see in the task manager. As you can see, the how screen is no longer an option in the preview...and when I press the home button, it just takes me to the app that appears in the left-most preview (Netflix in the example below).", "time": "03-24-2017 03:02 PM", "replies": [{"postID": "post5730519", "text": "FYI, great photo for home page.", "time": "03-29-2017 10:17 AM", "replies": []}]}, {"postID": "post5726748", "text": "Seems to be a Nova Launcher issue. I tried reverting back to the eui launcher and it doesn't happen. Just hope they fix this in Nova!", "time": "03-26-2017 06:02 PM", "replies": []}, {"postID": "post5727406", "text": "For anyone using the Nova Launcher beta, it appears that the 5.1 beta1 broke the home page/Nova Launcher preview in the task manager. It was working fine in 5.02 and around release 5.03 it turned the preview black, but it still functioned on selection and hitting the home button in the task manager still sent you to the home screen. With the 5.1 betas, even that was lost", "time": "03-27-2017 09:23 AM", "replies": [{"postID": "post5730517", "text": "Yes, latest Nova beta changed how recents are handled. I reported it to Nova development team. Go to Nova beta discussion in Google +. It is being discussed there with screen shots. To me it is an inconvenience, not productivity issue. Don't know when they will fix it.", "time": "03-29-2017 10:15 AM", "replies": []}]}, {"postID": "post5732600", "text": "Yeah...I've been participating in at least one of those discussions. I had gone back to 5.02, but then my device auto updated it again and so I'm back on the beta. It's defiinitely annoying....but I'm working with it, hoping they update soon.", "time": "03-30-2017 07:45 AM", "replies": []}, {"postID": "post5744772", "text": "The latest betas fixed Nova issue with recents. Works fine.", "time": "04-05-2017 10:32 AM", "replies": []}]}, {"title": "Le Pro 4 leak?", "thread": [{"postID": "post5711689", "text": "Some stories hit my google feed about some leaked images of the next Le Eco 'flagship'. Looks to be a dual-curved display and apparently has the Snapdragon 835 chip.\nInteresting and I have to wonder if this one will also be a $400 price point. As tempting as that is, though...if they can't address some of the problems I've had with the Pro 3, I likely won't jump on this one. I need a better camera with OIS, better vibration/notification light, more accessories...to name a few.LeEco&#039;s Next Flagship to Pack Snapdragon 835 CPU, Dual-Curved Display", "time": "03-14-2017 08:21 AM", "replies": [{"postID": "post5712912", "text": "Saw this report. When it comes out, it will be later in year because Samsung has exclusive on 835 for awhile. I bet Le Eco will be higher than $400, given specs. Like one plus raised price on 3T.\nSpecs and camera ok with me, so I don't see anything extra here. \nBut, we of Pro 3, my benefit from new 7.0 software coming with new phone. Doubt they would bring out new phone on 6.0. Plus new 8.0 will be released by summer. \nImprovements in software is my biggest need. Fix quirks.", "time": "03-15-2017 10:21 AM", "replies": []}]}, {"postID": "post5714885", "text": "They just sold all the real estate they purchased in California recently. I wonder if this company isn't just going down...", "time": "03-17-2017 05:51 AM", "replies": [{"postID": "post5715148", "text": "Yes, I saw this story this am. They may pull out of US and India and be China only. \nPrices were too low for products. Great for consumers one time, but probably not sustainable. \nBut, unless it breaks I could use it for 2 years and then on to next company. \nHope at least for upgrade to 7.0.", "time": "03-17-2017 10:32 AM", "replies": [{"postID": "post5716743", "text": "I'm with you. If it lasts me 2 years its more than lived up to the insanely low price tag. 7.0 would just be amazing.", "time": "03-18-2017 09:48 PM", "replies": []}]}]}]}, {"title": "Post update camera impressions?", "thread": [{"postID": "post5710671", "text": "For those of you who have gotten the update - have you noticed any camera improvements? I have the Le S3, and I'm still pretty underwhelmed by the shooter.", "time": "03-13-2017 08:49 AM", "replies": []}]}, {"title": "where JAN update for LE S3?", "thread": [{"postID": "post5651826", "text": "well it was back in DEC 20th when we got the last update so where or when will we see a update for JAN ? has any one here any thing for the JAN update?", "time": "01-21-2017 03:38 PM", "replies": []}, {"postID": "post5651995", "text": "You read my mind. Last one on Dec 24. Could it be 7.1?", "time": "01-21-2017 06:28 PM", "replies": [{"postID": "post5654951", "text": "it may be well today is JAN 24th so we will see we get some in today", "time": "01-24-2017 07:46 AM", "replies": []}]}, {"postID": "post5651998", "text": "FYI, I have a Le Pro 3", "time": "01-21-2017 06:29 PM", "replies": []}, {"postID": "post5655003", "text": "I don't think it's 7.1, but like I posted earlier I was private messaging them and they told me there was going to be a huge EUI revamp to be closer to stock android. Estimated around the beginning of the new year.", "time": "01-24-2017 08:53 AM", "replies": [{"postID": "post5655009", "text": "YAY i love stock android", "time": "01-24-2017 09:03 AM", "replies": []}, {"postID": "post5658631", "text": "Saturday is Chinese New Years, so I wonder if that slows process down? \nOr maybe because of it, they release 7.0 as a New Years present?", "time": "01-27-2017 10:09 AM", "replies": [{"postID": "post5666409", "text": "Don't suppose this will be built on top of Nougat...?", "time": "02-03-2017 09:11 AM", "replies": [{"postID": "post5666448", "text": "your asking me stuff i dont even no lol", "time": "02-03-2017 09:39 AM", "replies": []}]}]}]}, {"postID": "post5678441", "text": "I bet we don't get any more updates for a while.. Hopefully though", "time": "02-14-2017 08:48 PM", "replies": []}, {"postID": "post5687737", "text": "Just got the alert saying there's a new update. Installing now.\nIt says, among some other small things, that it adds a true app drawer. We'll see.", "time": "02-22-2017 08:05 PM", "replies": [{"postID": "post5687744", "text": "Any mention of 7.0?", "time": "02-22-2017 08:12 PM", "replies": [{"postID": "post5687758", "text": "Not in the changelog, no.", "time": "02-22-2017 08:28 PM", "replies": [{"postID": "post5687760", "text": "Bug fixes? What security patch does it show? I have a Le Pro 3 and am on December patch. Thanks for the information.", "time": "02-22-2017 08:33 PM", "replies": []}]}]}]}, {"postID": "post5687763", "text": "5.8.021S\nSays it also improves the camera in low light.\nUpdated Android Security patch, Updated GMS package to 6.0_r11", "time": "02-22-2017 08:40 PM", "replies": [{"postID": "post5687765", "text": "Thanks. 21S. Look forward to update on Pro 3.", "time": "02-22-2017 08:43 PM", "replies": []}]}, {"postID": "post5689808", "text": "Downloaded and installed 21S update to my Pro 3. Finger print sensor seems improved, camera lag gone. Installed easily and everything working.", "time": "02-24-2017 12:22 PM", "replies": []}]}, {"title": "New 21S Update Released", "thread": [{"postID": "post5687811", "text": "New 21S Update Released according to official Le Eco forums. Rolling out now for S3 & Pro 3. Still 6.01. Check Le Eco forum for change log.", "time": "02-22-2017 09:26 PM", "replies": []}, {"postID": "post5688787", "text": "Not quite a change log, but the official LeEco blog has details here: UP2U Enhancements: Our Latest Ecophone Update | LeEco", "time": "02-23-2017 03:49 PM", "replies": []}, {"postID": "post5689801", "text": "New 21S update installed within 20 min. Finger Print Sensor seem more responsive. Camera with HDR enabled is now quick, no lag. everything else working normally.", "time": "02-24-2017 12:16 PM", "replies": []}]}, {"title": "Problems", "thread": [{"postID": "post5679614", "text": "Sometimes I answer my phone and people can't hear me, but I hear them.", "time": "02-15-2017 07:08 PM", "replies": [{"postID": "post5680250", "text": "Does it happen with Le Eco Earphones? I have had issues with the microphone on the Earpods, where it stopped working. Sent back two for replacement. \nAlso, had issue when on call and screen goes off, microphone goes mute. \nI reported both issues to Le Eco via the bug report.", "time": "02-16-2017 09:48 AM", "replies": []}]}, {"postID": "post5679738", "text": "Does it work on speakerphone, or with a wired or Bluetooth headset? If so, make sure the primary mic opening isn't blocked (e.g., by a case, or by your finger, or by debris lodged in the opening).", "time": "02-15-2017 09:06 PM", "replies": []}]}, {"title": "Pro 3 cases", "thread": [{"postID": "post5576718", "text": "Ordered a few different cases from ebay(China). All were disappointing except the 360 Protection Blade Shockproof Soft TPU ($7-8). Fit is very good, button bumps work well, color & quality of TPU seems good. Ordered two more with Dragon, who doesn't love some style. Black TPU compliments gold Pro 3 very well. Have the leather/tpu & plastic/tpu/stand...both are garbage. Amazon is starting to bring some over now. Awaiting Spigen, Tudia, etc., to pick it up. Thoughts/Suggestions?", "time": "11-23-2016 09:15 AM", "replies": []}, {"postID": "post5577310", "text": "I'm curious about the two-layer cases (hard shell over softer silicone layer).https://www.amazon.com/Helianton-Pro...cUvbUpU5577310https://www.amazon.com/LeEco-CoverON...cUvbUpU5577310\nAnyone try either of these? They are very inexpensive, so I can only assume they don't stack up to something like a Spigen...", "time": "11-23-2016 04:12 PM", "replies": [{"postID": "post5579199", "text": "They are the same, and both garbage. Originally from a China/Ebay vendor. Try this TPU. Has corner bumpers too, feels good in hand. Still looking for a highend case though.\nLook at this on eBay 360° Protection Blade Shockproof Soft TPU Case Cover For Letv LeEco Le Pro 3 | eBay", "time": "11-25-2016 01:46 AM", "replies": []}]}, {"postID": "post5578543", "text": "I think both of those are the same. I bought one and have been generally impressed with it. It's been my wife's daily driver for about a week now. I bought one other, it is all a single color (was offered in several) not super impressed with it but I bought them for cheap on ebay from China.", "time": "11-24-2016 01:47 PM", "replies": []}, {"postID": "post5581463", "text": "That's the one I got in grey. I haven't used it but it's not impressive.", "time": "11-26-2016 08:14 PM", "replies": []}, {"postID": "post5582697", "text": "Think we're not going to see very many cases for this one sadly. I actually quite like the included case though. So I don't know that I would be getting another case anyway, but it would be nice to see some good tough cases for this phone.", "time": "11-27-2016 09:58 PM", "replies": []}, {"postID": "post5638269", "text": "I'm now using this case from Ebay. It's pretty darn good. my only compalint is it's a little too flexible around the charging port but that's pretty minor. LK Drop Protection Hybrid Armor Defender Case Cover for LeEco Le Pro 3 | eBay", "time": "01-10-2017 07:50 AM", "replies": []}, {"postID": "post5677645", "text": "I can't believe that even four months after making the Pro 3 available, they still don't even have a case for this device on the LeMall site. They only have one for the Le 3.", "time": "02-14-2017 08:24 AM", "replies": []}]}, {"title": "Charging accessories for Le Pro 3", "thread": [{"postID": "post5666317", "text": "Finally switched over to T-Mobile yesterday after my Sprint phone bit the dust (same model for the third time!).\nI'm looking to find out what sort of charging adapter I need for the Le Pro 3. I know using the wrong type can cause problems. \nBest cable and adapter recommendations?", "time": "02-03-2017 07:42 AM", "replies": []}, {"postID": "post5666464", "text": "Just chatted with a rep...and he seems to be pretty clueless. He said \"as long as it's type C it will work\". Uhhh...yeah, I know that! I am not concerned about the cord, just the adapter! I guess I'll try my luck with a good brand Quick Charge 3.0 adapter...Anker or Aukey?", "time": "02-03-2017 10:01 AM", "replies": [{"postID": "post5667550", "text": "I have the Pro 3. I use Anker cables, wall plugs, portable battery. I have not been able to get quick charging speeds using 3rd party cables and Le eco plug. \nAnd you can't buy a replacement on the Le Eco web site, which is frustrating. \nYou can buy Anker plug and cable for high speed.", "time": "02-04-2017 12:07 PM", "replies": []}, {"postID": "post5667557", "text": "FYI, I am on Tmobile and it works great.", "time": "02-04-2017 12:16 PM", "replies": []}]}]}, {"title": "Anyone get Direct TV free 3 month code?", "thread": [{"postID": "post5637335", "text": "I bought the Pro 3 during Black Friday and was promised Direct TV free for 3 months. \nLe Eco promised to send code? \nAnyone receive needed Direct TV code?", "time": "01-09-2017 01:39 PM", "replies": [{"postID": "post5638336", "text": "Did you sign up for the free EcoPass that came with the phone? I thought I heard somewhere it was connected to that.", "time": "01-10-2017 08:55 AM", "replies": [{"postID": "post5638429", "text": "No, I didn't sign up for Eco pass. Thought they were sending code first?", "time": "01-10-2017 10:10 AM", "replies": [{"postID": "post5639248", "text": "Dunno then. It may have nothing to do with EcoPass, I just thought I heard it was connected.\nDid you ask them? Atleast for me, they're very quick and helpful on their online chat and DMs on Twitter.", "time": "01-10-2017 07:53 PM", "replies": []}]}]}]}, {"postID": "post5641898", "text": "You must sign up for the eco pass in order to receive the code. I did and got the code last week", "time": "01-12-2017 08:10 PM", "replies": [{"postID": "post5642473", "text": "Thanks for the information.", "time": "01-13-2017 10:05 AM", "replies": []}, {"postID": "post5643819", "text": "Thanks. Signed up for Eco pass and got Direct TV code. Set up Direct TV now account. But, it claims it wants to charge me $105 first? \nHow do you do it?", "time": "01-14-2017 05:42 PM", "replies": []}, {"postID": "post5645656", "text": "Thanks, Signed sup for Ecopass and got Direct TV code. \nYou have to set up a Direct TV account.\nAnother oddity was the code only worked using the Chrome Desktop Browser. Tried using my phone and Safari browser on my MacBook Pro, but neither worked. I used the Chrome Desktop Browser and it worked. You have to give them your profile, plus valid credit card or pay pal, load the promo code and it should show you that you get the 3 months free. I also had to hit submit 3 times before it took the info and worked.\nFinally, there is no customer service phone number. There is an online chat function, which I used, and they helped me to get it to work.\nSo, I did get the free 3 months, but it may take a little work.", "time": "01-16-2017 01:10 PM", "replies": [{"postID": "post5651433", "text": "Yep, I just went through this process last night. It's a pain in the neck. I'll happily use it for the free 3 months, but it's not something I'd pay even $35 for. App is slow and glitchy, and the website only opens in very specific browsers.", "time": "01-21-2017 09:04 AM", "replies": [{"postID": "post5651488", "text": "Great. Yes, I will use use DTV for 3 months and cancel. Nice add on for free. \nFS1 DOESN'T WORK? \nDid you try Eco pass?", "time": "01-21-2017 10:01 AM", "replies": []}]}]}]}]}, {"title": "How do I charge my phone and listen to headphones at the same time with a Le Pro 3?", "thread": [{"postID": "post5583152", "text": "The LeEco LE Pro 3 comes with a headphone adapter but no way to charge the phone via a cable and listen to wired headphones. This is a problem especially when trying to plug it into a sound system or car that has aux in only. There are plenty of dongles for iPhone lightning ports that split to another lighting or UBS charger and a headphone port but I have not found a single one for USB C even though there are multiple android phone with no head phone jack. How does this even make any sense? Need some help 😅.", "time": "11-28-2016 09:48 AM", "replies": [{"postID": "post5583205", "text": "You are right. There are prototypes of charging /listening, but have not come to market yet. \nThis issue is why I hesitated to buy, but given the quick charging, I figure I can plug into a wall or use portable quick charge to get 50% more within 15 minutes. \nAssume dual ability will come along soon. \nMy Le Pro 3 is coming today, so I will update once I get and try it. \nBest to have regular or Quick Charge portable battery, if you use it a lot.", "time": "11-28-2016 10:23 AM", "replies": [{"postID": "post5606777", "text": "cool my LeEco S3 mmay be coming today has well it was forecast too come on thursday but it may come today so i think it be cool if we got both of are phones at the same time am coming from a moto G 4 wish has not seen a android update since july 1st patch", "time": "12-14-2016 08:57 AM", "replies": []}]}, {"postID": "post5583205", "text": "You are right. There are prototypes of charging /listening, but have not come to market yet. \nThis issue is why I hesitated to buy, but given the quick charging, I figure I can plug into a wall or use portable quick charge to get 50% more within 15 minutes. \nAssume dual ability will come along soon. \nMy Le Pro 3 is coming today, so I will update once I get and try it. \nBest to have regular or Quick Charge portable battery, if you use it a lot.", "time": "11-28-2016 10:23 AM", "replies": [{"postID": "post5606777", "text": "cool my LeEco S3 mmay be coming today has well it was forecast too come on thursday but it may come today so i think it be cool if we got both of are phones at the same time am coming from a moto G 4 wish has not seen a android update since july 1st patch", "time": "12-14-2016 08:57 AM", "replies": []}]}]}, {"postID": "post5596720", "text": "You don't. Bluetooth works great. The battery has a crazy long life. I'm completely happy with this phone after getting used to a few quirks.", "time": "12-07-2016 07:21 AM", "replies": []}, {"postID": "post5607055", "text": "I have had the Le Pro 3 for two weeks. It works great. Some items to get used to in the software, but generally has worked well. \nThe included ear buds sound great. And I got bluetooth ear buds from Anker for $30, which works well, and allows me to charge the phone at the same time I am listening to music.\nAlso got a Le Eco Portable Quick Charger, which has worked great. Can +30% in around 15 minutes.\nGive us a review when you receive your unit.", "time": "12-14-2016 12:18 PM", "replies": []}, {"postID": "post5635614", "text": "I got it too for about a month. Some small issues but overally good phone.", "time": "01-08-2017 07:04 AM", "replies": []}]}, {"title": "just got my new phone", "thread": [{"postID": "post5609287", "text": "hi \ni this got my new LeEco S3 i had too go get me a new sim card has the old one was too big has far has the UI gos i like it it remind of IOS i all so like being on a newer patch level since my old moto G is still stuck on july 1st so far now all is well with this phone and i like it i have too say for a snapdragon 652 this is a really fast phone apps open fast no issue what so ever am keeping my moto G4 has a back up in case some in happens to this phone\ni all so like the notifcation area i like the UI has it remind me of window 7 UI it not like the stock android notifcation i find this notifcation march easyer too read my notifcation i all so like too where there a clear all and when some one text you you can respond right from the notifcation so i love how EUI looks\nThis has got to be one of the most fastest LTE smartphone I ever used wow LTE on this phone is blazing fast", "time": "12-15-2016 04:59 PM", "replies": []}, {"postID": "post5609751", "text": "Thanks for the info! Which LeEco phone do you have?", "time": "12-16-2016 01:16 AM", "replies": [{"postID": "post5609850", "text": "LeEco S3", "time": "12-16-2016 04:11 AM", "replies": []}]}, {"postID": "post5624666", "text": "thanks for the info", "time": "12-29-2016 05:08 AM", "replies": []}]}, {"title": "new update EUI 5.8020S", "thread": [{"postID": "post5618078", "text": "i this got a new update on my phone EUI 5.820S", "time": "12-22-2016 10:30 PM", "replies": [{"postID": "post5619723", "text": "Yeah my S3 updated the other day as well. Haven't really noticed any differences in function outside of HDR processing faster.", "time": "12-24-2016 12:09 PM", "replies": []}, {"postID": "post5619818", "text": "Yes, I have a Pro 3 and I just got update. Works fine with my Nova launcher. Impressed with timely updates. Now on security patch December. \nOthers say camera software updated.", "time": "12-24-2016 02:03 PM", "replies": [{"postID": "post5622402", "text": "well the S3 got NOV patch", "time": "12-27-2016 09:11 AM", "replies": []}]}]}]}, {"title": "Temps?", "thread": [{"postID": "post5620564", "text": "Just been keeping an eye on my temps, what have you guys been seeing?\nMine gets to around 102 or so max playing normal games, but just reached 121 while playing with vr inside a cheap vr headset.\nFirst off, what are you guys getting?\nSecond off, for someone who knows almost nothing about these batteries, is 121F alright? It was actually very uncomfortable to the touch.", "time": "12-25-2016 02:19 PM", "replies": []}, {"postID": "post5620688", "text": "60°C (140°F) is the maximum battery temperature. The CPU is just about safe there, but it should be running closer to 45°C (113°F) to 50°C (122°F).", "time": "12-25-2016 05:04 PM", "replies": [{"postID": "post5620732", "text": "So 120(for the battery) is fine if it's only there for 5-10 minutes?\nDon't have any programs to check CPU temps, but I probably will just for one run with VR to see.", "time": "12-25-2016 05:35 PM", "replies": []}]}]}, {"title": "what is your android patch level on this phone?", "thread": [{"postID": "post5594930", "text": "hi\nwhat is your android patch level on this phone all so how you got any more android update since the OCT 1st android patch level update ?", "time": "12-06-2016 01:56 AM", "replies": [{"postID": "post5595418", "text": "Mine is also Oct. 1.A new software update is due around 12/15. Let's hope they are prompt.", "time": "12-06-2016 10:07 AM", "replies": [{"postID": "post5608592", "text": "will today is 12/15 what see if they give us a new update today \nall so today is the day i get my new phone", "time": "12-15-2016 09:23 AM", "replies": [{"postID": "post5608654", "text": "Well, none of these tech companies are that reliable with dates, but hope update comes soon. \nTell us how much you like phone when you get it.", "time": "12-15-2016 10:04 AM", "replies": []}]}]}]}]}]
[{"title": "LeEco EUI Update(Quick Settings in Notification Shade) Early next year.", "thread": [{"postID": "post5601033", "text": "I recently(as in like 30 minutes ago) used the \"Le\" App feedback thing asking if they are thinking about adding quick options (ie: Brightness, settings, etc) in the notification shade as I honestly believe it would bring in more buyers and make people coming from a clean android experience happier.\nExtremely quickly I got an email from them saying that they will release an EUI update making the user interface much more like stock android. He then said it would \"Satisfy My Requirement\" meaning they would add quick settings in the notification shade.\nNot sure if this was already known, but I thought I'd put it out there.", "time": "12-09-2016 04:54 PM", "replies": [{"postID": "post5601192", "text": "I'm both excited and sad because I've already gotten used to it xD\nBut I totally agree. Especially once it's in stores!", "time": "12-09-2016 06:55 PM", "replies": []}]}, {"postID": "post5601888", "text": "Great news. You deserve gold star.", "time": "12-10-2016 10:33 AM", "replies": []}, {"postID": "post5604098", "text": "Yeah, this \"Issue\" took me about a week to get used to. Now it's no big deal.", "time": "12-12-2016 08:30 AM", "replies": []}, {"postID": "post5604846", "text": "Same here. I never had an android phone before this, so it never bothered me at all. But I can honestly say, 2 people asking me if they should buy one didn't like the idea of no quick settings at all. So much so it sounded like it was a top reason to not get one.", "time": "12-12-2016 05:46 PM", "replies": [{"postID": "post5604868", "text": "People are loyal to the idea of \"stock Android\", so major deviation is frowned upon. \nAlso swiping down for everything vs pushing buttons. \nI get used to new things pretty quickly also.", "time": "12-12-2016 06:06 PM", "replies": []}]}]}, {"title": "just order the brand new LeEco s3", "thread": [{"postID": "post5602169", "text": "hi \ni just order the brand new LeEco s3 off swappa this is going too be a nic upgrade over my moto G4 phone wish is still stuck at july 1st patch level pluse am going too try some in new and since the moto G4 is a 5.5\" screen i be haveing the same screen says so its a win win", "time": "12-10-2016 03:00 PM", "replies": [{"postID": "post5602303", "text": "Welcome to the small but friendly family! It's a great phone. I'd love to hear your thoughts coming from a G4 once you have it!", "time": "12-10-2016 05:07 PM", "replies": [{"postID": "post5602335", "text": "thanks this is my last X mass gift too me this year has i all so this got done upgradeing my DSL wifi equipment i will give you my thoughts after my 1st full day of used", "time": "12-10-2016 05:56 PM", "replies": []}]}]}, {"postID": "post5604299", "text": "The seller has shipped my new phone today can't wait too get it. This is going too be a nice upgrade from. My moto G 4 phone has my phone I have now is still stuck on July patch so it will be nice too have a normal phone like everyone one else for a change that gets Android updates every now and then and not 2 too 4 month down the road", "time": "12-12-2016 10:55 AM", "replies": []}, {"postID": "post5604300", "text": "And an trying some in news", "time": "12-12-2016 10:56 AM", "replies": []}]}, {"title": "Phone Mutes During Calls Using Earbuds When Screen Goes Off", "thread": [{"postID": "post5585899", "text": "I got my wife a Le Pro 3 and with Nova Launcher, she loves it. However, using either the included earbuds or her own earbuds with the included dongle attached, the phone mutes when she is talking on the phone when the screen goes off. She can hear the other person but they can't hear her. This problem does not occur when she is not using earbuds. \nDoes anyone know how to fix this rather than replacing the phone as Le Eco wants her to do?\nThanks in advance.\nBryan", "time": "11-29-2016 08:49 PM", "replies": [{"postID": "post5590662", "text": "Same problem. Haven't had a answer. Didn't notice that it was the screen off that was causing the problem.", "time": "12-02-2016 10:28 PM", "replies": []}, {"postID": "post5591510", "text": "Yes, it happened to me this am. Others on different thread mentioned it. I sent a trouble ticket asking for software fix. \nTemp fix. Go to Display and set to 30 minutes for screen to go off. That will fix for any calls 30 minutes and less. \nDon't turn phone back. It works great, especially for price. Most phones have software quirks. This one especially annoying. \nFYI, was talking to my mom when it happened twice before I figured out issue.", "time": "12-03-2016 02:11 PM", "replies": []}]}]}, {"title": "LeEco phones coming to Amazon, Best Buy and Target", "thread": [{"postID": "post5586497", "text": "No more flash sales.\nStarting tomorrow (12/1): http://www.theverge.com/2016/11/29/1...get-december-1", "time": "11-30-2016 08:36 AM", "replies": [{"postID": "post5586649", "text": "Yes, I saw it. Hope that Amazon etc will reduce price of accessories. USB-C EAR Phones that came with my Pro 3 are $30 per. That is alot given no alternative. Also hopefully Wall charges and cables not on site. Should be interesting.", "time": "11-30-2016 10:05 AM", "replies": []}, {"postID": "post5586963", "text": "I'm really hoping LeEco can build some brand recognition. I feel like some solid sales over the upcoming holidays would go a long way with that.", "time": "11-30-2016 02:08 PM", "replies": []}]}, {"postID": "post5586967", "text": "Good move.", "time": "11-30-2016 02:12 PM", "replies": []}]}, {"title": "Full LeEco S3 Review - An amazing budget option", "thread": [{"postID": "post5553622", "text": "TLR\nPurchased with LeRewards (the whole LeMall naming is LeAim…), this phone cost me $150 during one of their flash sales. It was shipped quick and packaged like a premium handset. Having no experience with the brand, I’m downright impressed with the quality and performance of this budget handset. I have no doubt that this device will set the bar to which all sub $200 phones are judged. It performs as well as phones that were twice the price.The Good:\nAll day battery + Quick Charge\nButtery smooth performance\nMore than good camera\nDeceivingly light The Bad:\nLeEco take on Android is a challenge\nThe screen should be brighter\nIt’s pretty chunkyMy Usage:\nI’ve been using the LeEco Le S3 for three days as my daily driver on AT&T in the Twin Cities. It shipped with the up-to-date software version (As of 11/7/16).Hardware:\nIt’s another metal phone. It’s a pretty close ringer to the HTC M9 and OnePlus 3 designs. It has the square camera with the fingerprint sensor right below it. What you notice right away when you take this phone out of the box is that it is stout. I went from the OnePlus 3 to the Le S3 and it was a dramatic change. Though the overall footprint isn’t changed too much, the phone doesn’t taper nearly as thin. The edges are a noticeable. It’s a bigger phone, but it is a lighter phone as well. If you like a phone that you notice in your hand and if you feel safe having some sort of edge to hold on to, I think you’ll like the feel of this device.\nI can also tell the speakers on the bottom of this phone are made for media. They’re about as loud as any speakers I’ve heard on a phone (including the HTC One line). They seem to be well balanced and offer as much bass as you could ask for from speakers on a device this small. I have caught myself a couple of times turning the volume down when I’m watching snap stories alone, and hardly having to turn it up in a room full of people. If you could complain about phone speakers being too loud, this would be your best case.\nHow they finished the metal casing has played a little trick on my senses. It’s definitely a metal phone, but my sense of touch would have me guess that it’s plastic. I don’t know if that speaks more to the finish of the phone or how far plastic phones have come, but it doesn’t scream metal phone when you’re touching it.\nFeel aside, the phone looks to be assembled well. You can visually see the caps at the top and bottom of the phone on the back. The edges fit tight and there’s no wiggle.", "time": "11-08-2016 05:01 PM", "replies": [{"postID": "post5555035", "text": "Thanks for the review. With these Chinese low priced phones , it seems like software and camera are the weak points.\nIf you are counting it as sub $200 as that's the price you paid after promotions then I paid $20 for my Moto Z play and$40 for my ZTE zmax pro, both after promotions. Personally I don't see the s3 as being 7x better than my Moto z play .", "time": "11-09-2016 04:11 PM", "replies": [{"postID": "post5555060", "text": "Whoa! How'd you get those so cheap?! I'm talking the price I paid up front for the phone was $150 unlocked and off contract.", "time": "11-09-2016 04:25 PM", "replies": [{"postID": "post5555130", "text": "It was$408on Verizon dpp -$200 coupon - $300 trade in for a cracked screen g4 + $110 for the cracked screen g4. There was no service contract involved. I bought it at the end of September and the phone has as of now been fully paid for and the$300 trade in has been used. It was the Verizon version obviously but it was factory sim unlocked.\nAs for the zmax pro, I just ported one of my Verizon lines to metroocs for a month and they sold me the phone for$40. Note that one month service did cost$30, but I was able to use it on metroocs for the whole month.", "time": "11-09-2016 05:20 PM", "replies": [{"postID": "post5555149", "text": "That's what I thought. I don't see how trading in a $300-500(depending on when purchased) phone counts as an instant rebate that anyone can do. Unless everyone but me can magically pull them out of their rears.\nI'm not trying to be a jerk, when 9/10 people buying an S3 as their daily driver either have no phone or no phone worth trading in, none of this matters. The only phones I've seen that are readily available to buy UNLOCKED just off the internet is some Blu phones. And even they don't have anything at this price point with these specs.\nAs for not being able to get one today for under $200, actually you could. The sale started at noon and ran until 3-4PM? And it starts again in a week.", "time": "11-09-2016 05:32 PM", "replies": [{"postID": "post5555171", "text": "Like I said above, I paid$110 for a cracked screen g4 and traded it in for $300.\nAgain, you can't buy it TODAY for under $200. Sure you can wait for the sale, but that isn't the regular selling price. So it isn't a sub $200 phone.\nThe ZTE zmax pro is $99, granted it is locked but I was easily able to unlock it for a small cost and you can walk into any MetroPCS store and buy it for that price. No need to wait for some special sale. Because waiting for a special sale means that you are alr willing to jump through some hoops to get it. So it just depends on what hoops you are willing to jump through.", "time": "11-09-2016 05:52 PM", "replies": [{"postID": "post5555215", "text": "Alright I did misread that part, but the majority(not of the people here that bought it) don't want to go through searching CL or ebay for a cracked screen phone to trade in. What he(and I) mean about this being such a good deal is for someone who just needs a new phone. I'm always on the search for good deals, but I don't want to go through the hassle of buying a broken phone and hoping my carrier will take it and give me twice as much credit.\nOnce again, this is a good phone for $150. For the full price of $250 I wouldn't even say right off the bat I recommend it, because I don't know what else is out there for $250. I still don't see how going through buying and trading phones and still have to pay for it.\nI for one would wait a week and get a great phone for $150 then take however long buying and trading to get the best deal. If that's what you do, good for you. 90% of people wouldn't think about.\nBut whatever, I guess there are better deals then it if you want to hunt around. But All we were trying to say is that this a great phone for $150 if you get it onsale.\nThat's that.", "time": "11-09-2016 06:26 PM", "replies": []}]}]}]}]}]}]}, {"postID": "post5553625", "text": "Display\n: \nI’ve never been one who has been insistent on displays pushing more pixels once they got to 1080p. Now with VR headsets, I’m starting to understand better, but I still think a 1080p display is plenty. It’s one the OnePlus 3 had, it’s what the Le S3 has. The pixels are dense enough! The noticeable difference in this phone is the screen colors and brightness. I’m used to pegging the brightness slider down between ten and twenty percent. On the Le S3, I have it up between 50% and 75%. That’s inside and outside. The auto-brightness was poorly calibrated, too. The nice thing is that the display brightness is one setting that’s easily adjusted (more on that to come), but in my use, this screen is just bright enough to use and won’t be blowing anyone away.\nThat being said, the colors are fine. It’s an okay screen, and it isn’t too damaging to the battery to have the brightness at levels that allow you to see what’s on the screen. There are some preset calibrations that allow you to cater the display to how you feel best. That helps offset an otherwise dull display\n.\nMy complaints could just be what I’m used to, but I would have liked to see a little brighter display on a phone touting a great entertainment ecosystem.Courage:\nLeEcho dropped the headphone jack from these phones. I was hardly bummed. The writing has been on the walls and in other devices already. They are kind enough to supply USB C headphones in the box. And a dongle. The headphones are white and decent enough to remind me of another company’s included, white headphones. The headphones are surprisingly balanced and round for something you get free. You’ll also find the much loathed dongle for adapting stereo mini plugs to USB-C.\nWhat you will find when you search your phone over for a headphone jack is an IR blaster. I looked all over the Specs and didn’t once see that mentioned. There is a remote app included in the software as well. It seems to work like any of the other remote apps I’ve used. It was an appreciated surprise for such a cheap phone. (I am not a fan of calling this phone cheap. It’s inexpensive, but well done. You get what I’m saying, though.)\nOther things that are included in the box are the charger, which happens to be a quick charger, a screen protector that’s pre-applied, and a good enough clear, soft plastic case. It’s nice to have, especially considering there doesn’t seem to be many accessories available in the states yet.Specs:\nDISPLAY\n5.5” Full HD (1080p)\n403ppi Resolution\nCorning® Gorilla® Glass 3\nPERFORMANCE\nQualcomm® Snapdragon™ 652 CPU\n32GB Storage\n3GB RAM\n3000mAh Battery\nUnlocked Dual-SIM\nCAMERA\n16MP Rear Camera\n8MP Front Camera\n4K Video Recording\nDual-LED Rear Flash\nSlow-Motion Recording\nPanorama Mode", "time": "11-08-2016 05:02 PM", "replies": []}, {"postID": "post5553629", "text": "Software:\nIt’s safe to say that the software is my least favorite part of this phone. Let’s dive in.\nFirst, the launcher. They’ve done away with the app drawer. To some, that’s a huge no-no. I didn’t mind the implementation on the Nextbit Robin. There’s something about the lack of an app drawer on this device that really grinds my gears. To the left of the default is the LeEco landing page. It’s a nice way to consume what LeEco has to offer. I haven’t been able to use it enough to have a decided opinion on it, but it seems decent.\nAnother software quirk is the notification drawer and quick settings. In most (if not all) the android phones I’ve used in the last two or three years, if you need a setting you can quickly get to it from the notification drawer, either in the quick settings or in the full settings that’s available when you pull open the notifications. This is gone with LeEco’s EUI. That space is reserved for 100% notifications 100% of the time.\nInstead, if you want quick settings, you have to go into the multitasking pane. Multitasking mode is half totally useful and half a total mess. When you go into multitasking pane, you will immediately be hit with a quick launcher for tools, media controller, quick settings bar, screen brightness slider, open apps, and a RAM cleaner button. It’d all be useful stuff if it didn’t slam across your screen all at once when you press the recent apps button.\nAnd the quickest way to get into settings is in the multitasking pane on a top slider. It's fine. It actually didn't work for me right away and instead brought up the slider settings. Now it's working and much less annoying than it was before.\nI also think they got the back and multitasking buttons switched around. I know that’s been an issue on phones in the past. I don’t know what it’s supposed to be, but it feels backwards. I’ll adjust soon enough.\nThe launcher is something you can replace, but that shouldn’t be your responsibility as the consumer, and when you do replace it, you still don’t get an easy way to settings unless you have the app on your home screen.Camera:\nThe camera app isn’t as full featured as I’ve been used to. There aren’t manual controls, there is an HDR mode, and there is a setting for a LeEco watermark. The camera takes good pictures. In HDR it improves the blowouts a little, but it does take a relative eternity to save the shot. This won’t be a Google Pixel or iPhone 7 camera, but it gets the job done, and it does well considering it’s not (as far as I can tell) doing any sort of HDR magic. \nPictures in the daylight are darn good. Even in average lighting, there’s enough information to at least Snapseed my way into a great picture. Night shots are a little harder. It gives you a reminder that you need to keep your phone still when it’s taking a night photo, but it still ends up with some noise. I’ve had some surprisingly good photos and some surprisingly bad pictures at night. There’s potential there, but no consistency. It will be interesting to see if that gets fixed by an update eventually. I’ve taken some surprisingly nice night shots.", "time": "11-08-2016 05:04 PM", "replies": [{"postID": "post5554725", "text": "Also, there is an HDR mode, but it's very slow. About two seconds per picture. Just slide up from the photo setting to access. \nHope this helps!", "time": "11-09-2016 12:20 PM", "replies": [{"postID": "post5554734", "text": "That video should have started at 1:18. The forum broke the link", "time": "11-09-2016 12:25 PM", "replies": []}]}]}, {"postID": "post5553632", "text": "Real-life Use:\nI was coming from a OnePlus 3. On paper, I’m halving my RAM, halving my storage, and I’m using a slower processor to power the same number of pixels. I was expecting lag, bottlenecks, and heat, as well as a decreased battery life due to the screen decisions each company made.\nInstead, I have a phone that is, by all practical measures, just as enjoyable to use. I have yet to find myself in a situation where I feel the processor and RAM get choked up. The UI is smooth, even with the (in my mind, necessary) 3rd party launchers installed. I get insane battery life. Between the battery life and the quick charge, today is the first day I’ve felt like I needed to plug it in outside of my daily commute and errands (I had a phone interview and had to make sure it was prepared). The phone is efficient enough and charges fast enough that I don’t worry about finding an outlet overnight. \nThe camera is fine passable. I’ve rarely found myself upset with any of the shots, but I haven’t found myself overly impressed either, except for that random night shot that TOTALLY turns out.\nThe screen is the only hardware piece of this phone that I have a complaint about. In direct sunlight it’s a challenge to see. The colors are okay, and nothing really pops like it did on the OnePlus 3, or other screens on phones 2-4 times its cost. I think it’s an okay compromise, though I’m puzzled by it when LeEco is trying desperately to sell its media platform to the US.\nAnd the software. Oh, this software. I installed a launcher after I decided the software wasn’t worth dealing with. I was able to make settings a bit more accessible with Microsoft’s Arrow launcher. I’ll gripe about the functionality of it all day, but it’s fast and responsive, and for a budget cell phone, that’s more than I can ask for.Should you buy it?\nYeah, I would give this phone two thumbs way up. The performance to cost simply can’t be beat. The build is great, and at $150, it’s perfectly suited to be the best backup, or a cheap daily driver. I’m selling my OnePlus (because it’s worth what I put into it) right now and I’m going to rock the LeEco for a while and my daily driver. The value offered here is second to none and from a practical standpoint, I don’t understand why you would pay double for a phone that’s equally as nice. Just make sure you buy it with the credits at LeMall.com. It’s a fine phone at $250 as well, but if you can get it for $150, why wouldn’t you?", "time": "11-08-2016 05:05 PM", "replies": []}, {"postID": "post5554649", "text": "Can I ask how much screen on time are you getting? I agree that this battery life is pretty good, much better than my old phone (LG G3), but I am only getting around 3.5 hours of screen on time when I was expecting more like 5. I keep getting drain on an item called \"media server\".", "time": "11-09-2016 11:26 AM", "replies": [{"postID": "post5554653", "text": "I'll do a day and I'll let you know. MediaServer has used my processor 17 seconds in the last 2 hours tho. It's at the very bottom of my battery settings page.", "time": "11-09-2016 11:29 AM", "replies": [{"postID": "post5554666", "text": "I would appreciate that. I'm thinking that Mediaserver what's partly causing it since it is my second most used at 11%. I do not do any gaming on my phone, just calls, text, Whatsapp, Kakaotalk, Groupme, and stream music through Spotify. But all in all, a very snappy, great phone.", "time": "11-09-2016 11:42 AM", "replies": [{"postID": "post5556273", "text": "Here's my overnight battery stuff. Not really a great reflection of a full day of use, but still interesting.", "time": "11-10-2016 11:30 AM", "replies": [{"postID": "post5556475", "text": "Nice, I think my drain is associated with streaming music. Thanks again for the review!", "time": "11-10-2016 01:48 PM", "replies": []}]}]}]}]}, {"postID": "post5554721", "text": "In the control panel/quick settings, you can slide the options around and one of them is settings. You can also edit the order to place settings on the initial screen. \nMakes it much easier to access settings with only a few taps!!", "time": "11-09-2016 12:18 PM", "replies": [{"postID": "post5554744", "text": "That's strange - when I tapped that before, it brought up the quick launch apps/tools. Now it's fixed. Thanks for the heads up.", "time": "11-09-2016 12:28 PM", "replies": []}]}, {"postID": "post5554745", "text": "No problem my friend!", "time": "11-09-2016 12:30 PM", "replies": []}, {"postID": "post5554852", "text": "Is anyone having issues with not getting some notifications? For example: Snapchat notifications not being shown on the notification dropdown. It seems like the software force shutdowns the application which causes this.", "time": "11-09-2016 01:53 PM", "replies": [{"postID": "post5554856", "text": "Do you have power saving options on? Go into battery saver settings and make sure Snapchat is protected.", "time": "11-09-2016 01:54 PM", "replies": []}, {"postID": "post5554900", "text": "I have noticed that when one hits the ram cleaner button, the phone kills all background apps if they aren't protected. This goes for fb messenger, inbox, discord, etc. At least in my experience. It's very strange. Basically, don't swipe/close apps you want constantly checking the internet. One exception seems to be SMS/MMS. which is good.", "time": "11-09-2016 02:32 PM", "replies": [{"postID": "post5554960", "text": "Yes, it looks like this is the issue caused when running the ram cleaner button. Will just have to leave them locked in the app switcher.", "time": "11-09-2016 03:29 PM", "replies": []}]}]}, {"postID": "post5554965", "text": "Also, is it just my phone or is anyone else bothered by the low vibrations on the phone. You can hardly tell if the phone is vibrating, compared to my Nexus 6.", "time": "11-09-2016 03:33 PM", "replies": [{"postID": "post5554981", "text": "I've noticed mine to be quieter. I've forgotten I have the ringer off and missed calls and notifications galore. If it's in my pocket, it's no sweat, but it's much less noticeable when it's on a table.", "time": "11-09-2016 03:46 PM", "replies": []}, {"postID": "post5554983", "text": "I've noticed mine to be quieter. I've forgotten I have the ringer off and missed calls and notifications galore. If it's in my pocket, it's no sweat, but it's much less noticeable when it's on a table.", "time": "11-09-2016 03:47 PM", "replies": [{"postID": "post5556098", "text": "Amazing review by the way!", "time": "11-10-2016 10:01 AM", "replies": []}]}]}, {"postID": "post5555061", "text": "And how exactly did you get your Moto Z Play for 40 bucks? Cause unless it was from their website where you could literally purchase it for $40, that has nothing to do with the same thing.\nI wouldn't say having to be part of some overpriced plan with a bunch of requirements is exactly the same as buying a phone unlocked with no string attached.\nIf I'm not getting it and you can just go out, or you could just go out, not part of any carrier, and buy the Z play for $40, then I take it back. But I don't think that's the case.\nEDIT\nWell I sounded like a jerk.\nSorry about that lol.", "time": "11-09-2016 04:26 PM", "replies": [{"postID": "post5555135", "text": "My point is that you can't buy the s3 for under$200 today.\nYes it was somewhat involved, but getting a Moto Z play for$20 for like an hour's effort was worth it for me, though I realize that it isn't worth it for everyone, and bit everyone can get on the deal... Just like not everyone can currently get an s3 for under$200\nI also got a few s6 edge for Free after rebate back in may from best buy. Though likewise I know that many people don't want to deal with rebates. But for that deal, anyone could have done it.", "time": "11-09-2016 05:23 PM", "replies": []}]}, {"postID": "post5556364", "text": "@mstrblueskys - thanks for the great review! Was really curious about this phone and you answered a lot of my questions!", "time": "11-10-2016 12:30 PM", "replies": [{"postID": "post5557269", "text": "Happy to help! Thanks!", "time": "11-10-2016 10:59 PM", "replies": []}]}, {"postID": "post5582384", "text": "There's still lots of work going on. I've gotten my LG exeed 2 for 8 dollars, if we're comparing for value. Straight from Amazon.", "time": "11-27-2016 04:47 PM", "replies": []}]}, {"title": "LeEco Black Friday Sale", "thread": [{"postID": "post5568602", "text": "Anyone getting anything? Their 55\" 4K Smart TV will be down to $599 and you get a free S3 ecophone.\nThe S3 will be down to $150 + $20 off and special deals on accessories.\nPro3 Will be $299 + $20 off.\nAnd a bunch of over deals.\nThese prices($100 off TVs and $20 off phones) are if you spin the wheel and get the codes. but first day I got $100 off 55\", 45\" and $ off S3 so it should be no problem.Black Friday Weekend Sneak Preview", "time": "11-18-2016 08:59 AM", "replies": []}, {"postID": "post5568843", "text": "I'm probably buying another Pro 3. It's stupid that this phone is being ignored by AC.", "time": "11-18-2016 11:19 AM", "replies": [{"postID": "post5571621", "text": "Sounds good! Good luck!\nMy sister and possibly my brother are going to get S3's. I convinced them it's too good of a phone to pass up when they were planning on getting the G4 play for $30 less with amazon lock screen ads.", "time": "11-20-2016 09:07 AM", "replies": []}, {"postID": "post5575201", "text": "Its being ignored by just about everyone really. I think Engadget only just now posted a review a couple of days ago. There's a few youtube reviewers that have done reviews too, but its kind of crazy. I mean on the one hand I kind of get why most of the major tech (and in particular Android) blogs might be ignoring it. The launch event seemed to be off putting for a lot of people since LeEco seemed to really be pushing their services more than anything else. But the value proposition of the Pro 3 and S3 is just way too much to ignore.", "time": "11-22-2016 12:17 PM", "replies": []}]}, {"postID": "post5575565", "text": "Agree the hardware of both phones is super cheap, but what about software? Even with Nova Launcher, no traditional android drop down menu? No app draw? What prospects of security or 7.0 updates? Returns, customer service, software issues? \nI am tempted by s3 for $129", "time": "11-22-2016 03:41 PM", "replies": [{"postID": "post5575620", "text": "Nova (and other launcher alternatives) will add an app drawer.", "time": "11-22-2016 04:13 PM", "replies": []}, {"postID": "post5575758", "text": "All the quick menu options usually in the drop down are in recents. It's a weird change, but they're still there. As far as updates, no clue about 7.0 but they released the Nov. Security update pretty quickly and I'm expecting the same for Dec.", "time": "11-22-2016 05:42 PM", "replies": [{"postID": "post5575830", "text": "Do you have S3 or PRO?", "time": "11-22-2016 06:29 PM", "replies": [{"postID": "post5577475", "text": "I have the S3!", "time": "11-23-2016 06:16 PM", "replies": []}]}]}]}, {"postID": "post5575828", "text": "Thanks for the information. How is the sound? Is it stereo using bottom and ear hole on top?", "time": "11-22-2016 06:27 PM", "replies": []}, {"postID": "post5576547", "text": "The Black Friday coupon for the Pro 3 is now up to $50. I can't turn that down.", "time": "11-23-2016 07:08 AM", "replies": [{"postID": "post5576613", "text": "I got that email too, very tempting.", "time": "11-23-2016 07:56 AM", "replies": []}]}, {"postID": "post5577664", "text": "How is the sound from speakers? Is it stereo, loud? Have you listened using dongle for 3.5 ear pods or headphones? \nI use Nova. Do you use a different launcher on the S3?", "time": "11-23-2016 09:11 PM", "replies": [{"postID": "post5577855", "text": "To my knowledge, only one of the grills at the bottom of the phone holds a speaker. However, that speaker sounds quite nice. Gets pretty loud without distortion too. \nThe dongle works just fine with regular 3.5mm headphones. Also used it with a car's aux cable and it sounded great! I prefer the lossless Type C headphones they included (there's actually a pretty significant difference, at least to my ears). Not to say the dongle+ regular headphones sound bad, just that the type c ones sound better. \nI am a recent convert to Action pro from Nova and both work perfectly;", "time": "11-24-2016 01:15 AM", "replies": []}]}, {"postID": "post5578034", "text": "Sound comes from the top (ear) speaker and one on the bottom...so it's kinda stereo(ish). Better sound than my LG G3...that's for sure.", "time": "11-24-2016 06:33 AM", "replies": []}, {"postID": "post5578279", "text": "Does sound come out of the ear hole? That apparently is how stereo works on the Le Pro 3, so I hope it is comparable. \nWith coupons, S3 only $129, so I will probably buy it. \nAny other issues with S3? \nThanks so much for info. Very Helpful.", "time": "11-24-2016 10:07 AM", "replies": []}, {"postID": "post5578521", "text": "Just spun wheel and got another $50 off Le Pro 3, so now $249.\nWhich should I get? S3 or Le Pro 3? \nThe S3 is so cheap at $129, but the specs on the Le Pro 3 is so great for $249??", "time": "11-24-2016 01:32 PM", "replies": [{"postID": "post5578597", "text": "Honestly, I'd say the S3. I know I own it, which could make me biased, but I just love it. The Pro3 is a great deal at $250, but what are you doing on the phone? Games like CSR 2 and Pokemon Go run flawlessly on the S3, the camera is the same, both have fingerprint scanners, etc. If you're a heavy multi-tasker or want to do some very intensive stuff, the Pro3 is for you. But for an everyday great phone, save the $120. Camera is the same also.Maybe if you live in cali? Not sure. I know that down south where I am, there was none on the first flash sale.\nMake sure you look at the accesory bundles when you buy the phone. I think I read somewhere the S3 comes with their Bluetooth headphone(or powerbank) + case + screen protector for like $19. Wicked good deal if the headphones are as good as people say. Or if you need a powerbank.", "time": "11-24-2016 02:25 PM", "replies": [{"postID": "post5578626", "text": "I live on west coast, so hoping no sales tax. \nYou make the same argument that has me leaning to S3. \nReason to pay extra for fast chip, extra storage, memory, better audio with stereo speakers, better audio for headphones. \nComing from Apple laptops, I am used to quick, easy software. Would like to use some apps I use all the time with top shelf equipment. \nFind that on current phone there is a lag or freeze sometimes with some apps. \nI am not a gamer. But I use audio and video quite a bit. \nFYI, I use Tmobile with good downloads now. How is WiFi and cell reception?", "time": "11-24-2016 02:42 PM", "replies": [{"postID": "post5578676", "text": "We're with Tmobile, WiFi calling and cell reception are both great.", "time": "11-24-2016 03:43 PM", "replies": [{"postID": "post5578723", "text": "Thanks again. Good to know. One more attraction to the Le Pro 3 is 4000 battery. I am a heavy user and carry a 20,000 portable battery, but still nice to have that much at 100%.\nAssuming I will get one with discount and no tax at $249 flat. That is cheap for what you are getting.", "time": "11-24-2016 04:22 PM", "replies": []}]}]}]}]}, {"postID": "post5578536", "text": "Does Le eco charge sales tax?", "time": "11-24-2016 01:41 PM", "replies": [{"postID": "post5578597", "text": "Honestly, I'd say the S3. I know I own it, which could make me biased, but I just love it. The Pro3 is a great deal at $250, but what are you doing on the phone? Games like CSR 2 and Pokemon Go run flawlessly on the S3, the camera is the same, both have fingerprint scanners, etc. If you're a heavy multi-tasker or want to do some very intensive stuff, the Pro3 is for you. But for an everyday great phone, save the $120. Camera is the same also.Maybe if you live in cali? Not sure. I know that down south where I am, there was none on the first flash sale.\nMake sure you look at the accesory bundles when you buy the phone. I think I read somewhere the S3 comes with their Bluetooth headphone(or powerbank) + case + screen protector for like $19. Wicked good deal if the headphones are as good as people say. Or if you need a powerbank.", "time": "11-24-2016 02:25 PM", "replies": [{"postID": "post5578626", "text": "I live on west coast, so hoping no sales tax. \nYou make the same argument that has me leaning to S3. \nReason to pay extra for fast chip, extra storage, memory, better audio with stereo speakers, better audio for headphones. \nComing from Apple laptops, I am used to quick, easy software. Would like to use some apps I use all the time with top shelf equipment. \nFind that on current phone there is a lag or freeze sometimes with some apps. \nI am not a gamer. But I use audio and video quite a bit. \nFYI, I use Tmobile with good downloads now. How is WiFi and cell reception?", "time": "11-24-2016 02:42 PM", "replies": [{"postID": "post5578676", "text": "We're with Tmobile, WiFi calling and cell reception are both great.", "time": "11-24-2016 03:43 PM", "replies": [{"postID": "post5578723", "text": "Thanks again. Good to know. One more attraction to the Le Pro 3 is 4000 battery. I am a heavy user and carry a 20,000 portable battery, but still nice to have that much at 100%.\nAssuming I will get one with discount and no tax at $249 flat. That is cheap for what you are getting.", "time": "11-24-2016 04:22 PM", "replies": []}]}]}]}, {"postID": "post5578616", "text": "I typically get charged sales tax here in NY and I wasn't charged tax when I bought the Pro 3, so its possible that they don't unless I missed it.", "time": "11-24-2016 02:35 PM", "replies": [{"postID": "post5578631", "text": "Thanks. B & H are the only retailer not charging sales tax. Le Eco is making it as cheap as possible to own a phone. I guess they think we will pay for their online content. \nI will put Nova on and ignore their apps.", "time": "11-24-2016 02:47 PM", "replies": []}]}]}, {"postID": "post5579214", "text": "It is 12:26am on the left coast, california and I just bought the Le Pro 3 for $249 + 21 tax = $270. Yes, I think they are based in California, so like Amazon they charge tax to this state. I also tried to buy the bluetooth speaker, discounted from $39 to $17, but I guess people already were able to buy it all along and they discontinued the discount, so I took a pass. The only disappointments.\nIt came live as advertised at midnight and the checkout was easy. got the confirmation email stating that I could expect the phone to be delivered by next Friday, December 2.\nWill leave a review once I get it. Thanks to everyone for all the information, which was very helpful deciding I wanted to get the Le Pro. In the end the specs for such a low price was too enticing. Look forward to getting the phone, throwing on the Nova Launcher and my apps and seeing home it works.", "time": "11-25-2016 02:27 AM", "replies": []}, {"postID": "post5579227", "text": "Flash Sale over at Le Eco as of 12:37 AM.", "time": "11-25-2016 02:39 AM", "replies": []}, {"postID": "post5579274", "text": "Glad you got it! I'm working on getting 2 S3s right now, one for my brother and one for my sister.", "time": "11-25-2016 03:46 AM", "replies": [{"postID": "post5579279", "text": "They refreshed site again with daily specials. Still selling phones at discount. \nThey may not be selling as many as they thought. It does take a risk, a small $ one, to buy one. Service, updates are up in the air. \nBut if it works for a year, that is enough.", "time": "11-25-2016 03:57 AM", "replies": [{"postID": "post5579280", "text": "Were any of the deals better before? I was sure they said the accessory deals were going to be better. Either way, $130.99 is a GREAT price for the S3+Tempered glass protector+silicon case. That's the grand total, no tax or shipping here.", "time": "11-25-2016 04:01 AM", "replies": [{"postID": "post5579288", "text": "That is great you live in a no tax state. We pay for the fact that so many of the tech companies are based here. \nThey had Bluetooth speakers for $17, but we're gone by midnight. 9.99 for quick charge battery pack on Sunday.", "time": "11-25-2016 04:10 AM", "replies": []}]}]}]}, {"postID": "post5579534", "text": "Well something a little strange happened.\nMy brother bought one, and it came to $143. That's with the silicon case, screen protector and phone.\nThen I bought one for my sister, and it came up to $130.98 for the same thing just a different color case. I looked at orders and all of the stuff is in the order, but the case and screen protector came up as $0. Good for me I guess.", "time": "11-25-2016 09:14 AM", "replies": [{"postID": "post5579576", "text": "It could be different colors. Many times different colors are priced differently. Congrats on the deal.", "time": "11-25-2016 09:51 AM", "replies": []}]}, {"postID": "post5581707", "text": "12:05am Sunday. Just Got a USB-C Portable Charger Battery for $9.99. Could only buy one and it was over by 12:00am. Phones and TV's still for sale.", "time": "11-27-2016 02:07 AM", "replies": []}]}, {"title": "Pro 3 texting app", "thread": [{"postID": "post5579202", "text": "Is there a setting in the stock texting app to see the contact info (name or #) of separate people in a group text? Right now, I only see text box replies, but cannot tell who actually sent individual replies. Maybe a setting in contacts instead of text app. Help needed.", "time": "11-25-2016 01:53 AM", "replies": []}, {"postID": "post5581404", "text": "Disregard got it. Text app setting, but is reversed option from other Android phones. Regardless, it works.", "time": "11-26-2016 06:59 PM", "replies": []}]}, {"title": "Is it worth the risk of buying S3?", "thread": [{"postID": "post5571800", "text": "I have an Alcatel idol 3, but thinking of S3 for more power, ram and storage and importantly cheap price of $129 on black Friday. \nSound, both through the speakers and headphones is crucial for me. Feedback from S3 owners? \nI use Nova launcher. Curious if using Nova makes software acceptable or still a problem? \nAre LeEco apps intrusive or can you hide them? \nFinally, what is return policy? Anyone deal with company on return? \nThanks for any information.", "time": "11-20-2016 11:30 AM", "replies": [{"postID": "post5572734", "text": "I've been using the S3 as my daily for a few weeks now. Great option for the price. \n1. To my knowledge, you cannot play sound through both the speakers and the headphones. \n2. Nova launcher works just fine! I was using it regularly until I switched to Action.\n3. LeEco's apps are all a variety of content/entertainment apps. I haven't used them and they are basically invisible once you install a new launcher. (can't be uninstalled though, which likely is due to their connection to the default launcher)\n4. Last I checked, the return policy was 15 days. I've had mine longer so I'm not sure how smooth that process is. \nHope this helps!! \nP.S. I personally recommend it. I've been loving it so far.", "time": "11-20-2016 11:41 PM", "replies": []}]}, {"postID": "post5572001", "text": "In excellent used condition it's worth about $60-$90, so that seems a bit overpriced. Nova has very little to do with whether apps will run - if they will run, Nova will launch them. (It's the only launcher I've used for years.) You can hide any app.\nThe return policy depends on what you're buying, a phone or a phone and plan. Considering the price, I doubt this one comes with a plan, so there's probably a 14 day \"it doesn't work\" return policy. As for an \"I changed my mind policy\", that depends on the store manager ultimately, but usually no.\n(Sound should come from either the earphone or the speakers, but not both at the same time [which is how phones usually work, but since I don't own an S3, I can't verify it. But that's how it works on a Note 3].)", "time": "11-20-2016 01:47 PM", "replies": []}, {"postID": "post5574018", "text": "Thanks so much for info. As far as audio I meant listening via headphones, while I am charging the phone. Since headphones and charger cable use same USB-C slot, you can only charge or listen, not both.", "time": "11-21-2016 05:39 PM", "replies": []}, {"postID": "post5574434", "text": "Yeah, unfortunately this is the case. However, I'm happy to say this phone has stellar battery life so I've never found myself in the situation where that was an issue.", "time": "11-21-2016 10:52 PM", "replies": []}, {"postID": "post5575168", "text": "The bluetooth headphones they offer are nice, if you're thinking about that as an option around the single port issue. Plus, they show the battery indicator next to the bluetooth icon for the headphones.", "time": "11-22-2016 12:06 PM", "replies": []}, {"postID": "post5577344", "text": "They have a cheap Bluetooth Speaker for $17 that I might buy to complement S3 solo speaker and with Quickcharge 3.0, I will feel fine running at lower battery %., so no 3.5\" also ok I guess.", "time": "11-23-2016 04:37 PM", "replies": []}, {"postID": "post5577351", "text": "FYI, the Le Eco return policy is 15 days except 30 days for California. That is return for no reason.", "time": "11-23-2016 04:41 PM", "replies": []}]}, {"title": "Terrible that AC left the LeEco phones off of their Black Friday deals list.", "thread": [{"postID": "post5576743", "text": "I'm surprised and dismayed that Android Central left these great phones off of their Black Friday deals list. I've long been a supporter of this site and have come to them and trusted their opinions but this is really unsettling. \nI understand that they are not as well advertised and likely have not bought space on the site but reporters have a responsibility to be neutral and honestly evaluate what is available. The very idea that a Snapdragon 821 phone with a 4000mah battery is available is a big deal, it's even bigger when they are so affordable. It's disturbing that they are ignoring a competitor to the brands they \"Love\". Yeah, a pixel would be nice to own, an S7 would be nice too, but this phone has the opportunity to change the game and ignoring it brings light to the editorial slant of this site.", "time": "11-23-2016 09:29 AM", "replies": [{"postID": "post5576760", "text": "And it's not like they don't know they exist. They have reviewed them and they did make a section on their forums for them.\nIt makes no sense. I was honestly expecting one of the two, if not both, to be there. A phone for $250 that would easily beat almost any phone under $400? And it doesn't even get listed? Really?\nOr a budget phone, for $130, that would blast ANY phone at that price point out of the water. I mean I've picked up LG20s, S7s, and even a Pixel, to me this phone would compare in the visual and premium feel department. This phone FEELS like 600 bucks and costs $130. Not to mention the performance at that price point is amazing. Definitely blows the G4 play miles out of the water. In every aspect. \nAnd before someone says they can't recommend it because of the software, just stop there. Any aftermarket launcher gives the app drawer removes all the LeEco software from the front page. No it can't be deleted, but does it really bug you that much to see it in the app drawer every once in awhile? Really??\nAll these major sites give both of these phones way too much hate. I guess they can't review them at their flash sale price, but I mean a 6/10 because the software that a simple launcher app will fix? I mean come on.. And if it's 6/10 because of the no settings in the notification shade, just get out. Yes it was a bad idea on their part, but I'm used to it after a week of using it. If you can't take a week to get used to something different, then just return the phone and get something else, but don't go saying how bad it is, cause it's not.\nok im done.", "time": "11-23-2016 09:43 AM", "replies": []}]}, {"postID": "post5576764", "text": "What are the Black Friday deals for LeEco? Are they these ones? LeEco's Black Friday sale offers up Le Pro3 phone for $279, 65-inch Super4 TV for $1099 | Android Central", "time": "11-23-2016 09:45 AM", "replies": [{"postID": "post5576795", "text": "This page that gets updated frequently with the best Black Friday deals is where I was talking about.Black Friday 2016 Deals | Android Central\nHaving them mentioned like they are is good, but it's also 6 days old and not going to be updated. Unless of course the page I linked is only for major retailers.", "time": "11-23-2016 09:59 AM", "replies": []}]}, {"postID": "post5576805", "text": "The deal I see for those phones looks to be extra \"rewards\" credit, not a discount on the actual device. To see what you get, you need to register for an account with the manufacturer.", "time": "11-23-2016 10:03 AM", "replies": [{"postID": "post5576815", "text": "All you do is make an account at LeMall, click \"LeRewards\" on the device you want, you'll get a coupon. The coupon then doesn't activate until November 25th, when it activates you get that exact amount off. No MiRs, just $100 off the price. But before you do that, spin the wheel at the bottom of the page until you get a coupon for the device you want, they're $20 off the Pro3 or S3 and more off the TVs. I got an email saying my $20 coupon for the Pro3 doubled so it's actually $40 off..", "time": "11-23-2016 10:09 AM", "replies": [{"postID": "post5576864", "text": "Pro 3 has a $50 off coupon now.", "time": "11-23-2016 10:43 AM", "replies": [{"postID": "post5576904", "text": "Just went back and looked. The TV code doubled, the Pro 3 code went to $50. \nEven better!", "time": "11-23-2016 11:08 AM", "replies": []}]}]}]}]}, {"title": "The state of LE Eco as a company", "thread": [{"postID": "post5567717", "text": "Are any of you device owners out there concerned of the company's financial status? \nIf they hit ground you wouldn't get any more software support of course. \nWhaddya guys think?", "time": "11-17-2016 05:15 PM", "replies": []}, {"postID": "post5568852", "text": "The phone runs well now. I hope that it gets security updates, that remains to be seen. This is a HUGE company, with millions of phones out in the wild, They will likely be fine. \nAs is, it's a $300 phone with top end specs and a huge battery. It may never get nougat. I can buy another phone next year if it bothers me. The phone won't stop working and doing all the things it can already do if the company goes under.", "time": "11-18-2016 11:24 AM", "replies": []}]}, {"title": "LeEco Listens", "thread": [{"postID": "post5562219", "text": "I tweeted to LeEco about their Gallery app.https://twitter.com/MstrBlueSkys/sta...83374615805952\nAnd what do you know? Today's software update made the icon much less Nazi-esque.\nThanks LeEco!", "time": "11-14-2016 09:37 AM", "replies": []}, {"postID": "post5562345", "text": "Wow! Must be a bunch of youngsters there who were totally blind to the symbolism of the old logo!", "time": "11-14-2016 10:26 AM", "replies": [{"postID": "post5562401", "text": "Maybe youngsters, or they were just honestly not thinking about it. It's triangles and squares. Not awful design, but not thoroughly considered, either!", "time": "11-14-2016 10:51 AM", "replies": []}]}, {"postID": "post5562376", "text": "I'm embarrassed to admit I didn't even notice. Maybe it's because it was all done-up in rainbow colors. Now that you bring it to my attention, though...I'm amazed it ever got approved. To me it looks like they were going for the 'pinwheel' look that Google uses for their Photos app, but they clearly didn't think it through.", "time": "11-14-2016 10:44 AM", "replies": [{"postID": "post5562396", "text": "Yeah, the colors were distracting, but once I saw it, I couldn't unsee it. I'm glad they changed it, and it's nice to at least feel listened to!", "time": "11-14-2016 10:50 AM", "replies": []}]}, {"postID": "post5562753", "text": "DAMN! I am truly impressed by this.", "time": "11-14-2016 02:44 PM", "replies": [{"postID": "post5562885", "text": "Right?! I mean, I don't know if I was the first or only one to point that out, but that tweet isn't a week old yet.", "time": "11-14-2016 04:31 PM", "replies": [{"postID": "post5562953", "text": "Well, it DOES look like a swastika. Bad PR is bad PR for a company trying to make inroads.", "time": "11-14-2016 05:15 PM", "replies": [{"postID": "post5563247", "text": "That's true. It's amazing how some companies just address and move on and some get stuck on some things. So far, I'm liking what I'm seeing out of LeEco (even though it's just a little so far!)", "time": "11-14-2016 08:47 PM", "replies": [{"postID": "post5563269", "text": "Im seriously thinking about the next flash sale on the 16th! Lol", "time": "11-14-2016 09:00 PM", "replies": [{"postID": "post5564231", "text": "I'm using it as my daily driver now, and have been happily for about 2 weeks. I took the launcher off to force myself to get used to their take on Android. It's not as bad, and they fixed a couple things which I was annoyed by in the multi tasking view.\nIt's a fine daily driver if you're not going to be offended by the photography, and it's a super solid backup device at $150", "time": "11-15-2016 12:38 PM", "replies": []}]}]}]}]}]}, {"postID": "post5565948", "text": "I just sent them a direct suggestion, we'll see if they respond.", "time": "11-16-2016 01:00 PM", "replies": []}]}, {"title": "Update on LeEco Le Pro 3", "thread": [{"postID": "post5557362", "text": "Just downloaded a 310 mb update. Not seeing anything really. Anyone else get one?", "time": "11-11-2016 01:25 AM", "replies": [{"postID": "post5557365", "text": "I'm on the S3 and also received an update to EUI 5.8019S (previously 5.8018S).\nI took a quick look at the change log and didn't notice anything truly substantial. Other than the monthly security update. Which is rather important! I'm impressed with how quickly they turned the update out. If they keep that up, this phone increased in significance", "time": "11-11-2016 01:37 AM", "replies": []}]}, {"postID": "post5557423", "text": "I'm very pleased with how quick the first update was. I hope it bodes well for us!", "time": "11-11-2016 03:09 AM", "replies": [{"postID": "post5557970", "text": "Same!!!", "time": "11-11-2016 11:06 AM", "replies": []}]}, {"postID": "post5563607", "text": "This new update made a significant volume increase to the speakers output on my phone.\nThe speaker volume was okay before the update and now it is very good. Much louder with solid bass and no \"tinny\" sound at high volume settings.", "time": "11-15-2016 04:38 AM", "replies": [{"postID": "post5563901", "text": "I almost thought it was placebo, but I noticed the same thing.", "time": "11-15-2016 09:15 AM", "replies": []}]}, {"postID": "post5564624", "text": "There were lot of fixed actually, and most importantly around apps needing to run in background for notifications like Gmail, email app, or any chat app - before the update they were getting killedhttps://www.reddit.com/r/LeEcoPhones...release_notes/", "time": "11-15-2016 05:07 PM", "replies": []}]}, {"title": "Update for the S3", "thread": [{"postID": "post5562191", "text": "I haven't had too much tone to play with it, but I'll let you know how it goes. Here are screenshots of the details.", "time": "11-14-2016 09:25 AM", "replies": []}, {"postID": "post5562205", "text": "Details (sorry, the AC app isn't allowing multiple attachments)", "time": "11-14-2016 09:31 AM", "replies": []}, {"postID": "post5562208", "text": "Last", "time": "11-14-2016 09:32 AM", "replies": []}, {"postID": "post5562632", "text": "Very impressed that they released an update already which looks like it added a lot!", "time": "11-14-2016 01:19 PM", "replies": [{"postID": "post5562888", "text": "After using it, the practical additions are pretty slim. \nI will note that usually I see heavily decreased battery life on Android Phones after a major OS update. Today I'm experiencing CRAZY great battery life. I'll keep you posted, but if it keeps up, they did something special to make this happen, and I like it.", "time": "11-14-2016 04:33 PM", "replies": []}]}, {"postID": "post5563257", "text": "I don't know if it's actually lasting longer, but my phone was off the charger at 6:30 this morning, did the update, and has run all day. I've played YouTube, made phone calls, played Pokemon Go, etc, and I'm still up at a third of my battery! Screen on time is at 2.5 hours.", "time": "11-14-2016 08:52 PM", "replies": []}, {"postID": "post5564235", "text": "Came back to report that I had a weird battery issue this morning where it was discharging super fast. A reboot stopped it. I installed the game that I think was the culprit. I'll keep you updated. It seems like the battery should again last a whole day and then some!", "time": "11-15-2016 12:39 PM", "replies": []}, {"postID": "post5564581", "text": "Also, I just noticed that the screen is not an issue for me anymore. It's still not as bright as some of the phones I've used recently, but it seems to be much brighter at the top end.", "time": "11-15-2016 04:36 PM", "replies": []}]}, {"title": "Unboxing", "thread": [{"postID": "post5547310", "text": "Just got mine in this morning. Here is the unboxing.  \nCurrently importing my apps and charging up (arrived powered on but almost dead, must be coming in hot).", "time": "11-05-2016 11:00 AM", "replies": []}, {"postID": "post5547333", "text": "Nice looking phone for $300!", "time": "11-05-2016 11:19 AM", "replies": []}, {"postID": "post5547637", "text": "As I understand it, I believe it is supposed to come with a case in the box (the cheap clear kind).\nAlso...does it really come with a tempered glass screen protector already on it? If so, THAT's pretty cool.\nIt seems to fit tight in the box, which is probably how it came to you already powered on...the power button was perhaps pushed for a long enough duration during shipment...?", "time": "11-05-2016 02:33 PM", "replies": []}, {"postID": "post5547852", "text": "Like J-Grouchy said, that little box that you said probably has a manual in it, actually has a clear TPU case. It's cheap, but much better than nothing. It also contains the little tool to get the SD card tray out, but you've probably figured this out by now. As for a Tempered glass screen protector, I don't think so? Either that or I put a new one on top of the one already on it. o.o\nMine was also powered on when it arrived, it was at about 35% battery I believe.", "time": "11-05-2016 05:44 PM", "replies": []}, {"postID": "post5547952", "text": "Yep, it has a basic clear TPU case in the box. It has a cheap plastic screen protector on as well. It's hidden better than others I've had of late.", "time": "11-05-2016 06:56 PM", "replies": []}, {"postID": "post5548114", "text": "Sure enough. There was a case in that black thing I thought just had the manual in it. Thanks for the heads up.", "time": "11-05-2016 09:01 PM", "replies": []}, {"postID": "post5548118", "text": "It seems pretty solid. I don't want to remove it to check because it is perfectly applied (no edges or bubble issues).", "time": "11-05-2016 09:02 PM", "replies": []}, {"postID": "post5548182", "text": "I just remove them because it feels like plastic. Good temporary protection I suppose until I order a tempered glass protector.", "time": "11-05-2016 10:09 PM", "replies": []}, {"postID": "post5548205", "text": "Yeah, I just removed it too. I ordered a tempered glass protector with my S3 so I had one ready. And I accidentally have another on it's way for it's full price($10) lol.\nI have the S3, but everything down to the packaging looks very close to the same.", "time": "11-05-2016 10:26 PM", "replies": []}]}, {"title": "Who is LeEco?", "thread": [{"postID": "post5539452", "text": "(Lay-E-coh)Here's what you need to know about LeEco | Android Centralhttps://www.cnet.com/news/leeco-the-...uck-in-the-us/What Is LeEco? -- The Motley Fool", "time": "11-01-2016 02:39 PM", "replies": []}]}, {"title": "This is not a phone, it's a comprehensive internet ecosystem.", "thread": [{"postID": "post5022196", "text": "This phone cannot be compared with any phone, coz this is not a phone, it's a 6.33 inch beast which is an internet ecosystem.\nRespect to Letv for making such a big phone with brilliant features.", "time": "02-29-2016 12:48 AM", "replies": []}, {"postID": "post5023158", "text": "Welcome to Android Central! Can you elaborate on what impresses you?", "time": "02-29-2016 12:55 PM", "replies": []}, {"postID": "post5023177", "text": "Who would want such a tiny tablet? I would prefer a larger screen on such a monstrosity.", "time": "02-29-2016 01:01 PM", "replies": []}, {"postID": "post5031575", "text": "yes. the 6.33 inch display... coming with 4GB RAM and 128 GB storage, NFC, Ir blaster, USB type c fast charging, Wi-HD , 21 MP rear and 4 UP camera.", "time": "03-04-2016 03:56 AM", "replies": []}, {"postID": "post5477275", "text": "How does letv phones run in comparison to some of the more well known flagships. On paper the look amazing I just wish they had an sd card slot", "time": "10-09-2016 12:32 PM", "replies": []}]}, {"title": "This is a big phone....", "thread": [{"postID": "post4935098", "text": "6.33\" screen size, this is one large phone. Sporting among the first SD 820 chipsets, this is going to be a very big hitter.Hands-on with the first Snapdragon 820 phone: The LeTV Le Max Pro | Android Central", "time": "01-06-2016 09:25 AM", "replies": []}, {"postID": "post5004634", "text": "Yes it is. I actually got to play with it a few weeks ago. Really, really nice form factor for being such a huge phone. Too bad it didn't get LTE in USA.", "time": "02-19-2016 04:22 PM", "replies": []}]}]
