[{"title": "Got the M!", "thread": [{"postID": "post6132837", "text": "So I bit the bullet and picked up the Axon M! It's my second day with it. If you guys have any questions I'd be happy to answer if I can. I'm still getting used to it and learning everything. I am coming from a Galaxy S7E in which I dropped and broke the screen on \nFigured I would try something different.\nSo Far my first experience is this phone is very uncomfortable to hold as a regular phone. The sharp edge nature of it kind of digs into my ear when talking. I ordered the Official ZTE case and waiting for that to come in as well so we can see if that will help or make a difference in hand feel.\nAlso if your the type that holds the phone between your ear and your neck to talk. Don't this thing will slip right out without the case. A headset or hopefully this case will be the only way to comfortably talk on the phone \nI'll get some pics and more soon", "time": "01-10-2018 06:30 PM", "replies": []}, {"postID": "post6132897", "text": "Here is a quick screen cap from today. Took it off the charger around 7:00 this morning and it's about 8:30PM now. Today was mostly phone calls. Probably a couple hours in total of calls. Some Screen on time, Checking e-mail, txt etc. Nothing too media intsenive", "time": "01-10-2018 07:34 PM", "replies": []}, {"postID": "post6133597", "text": "Got the official ZTE Case. I have to save this is a must have item for the Axon M. Without it the phone feels like it would be too easy to slip out of your hand. This provides just enough grip and makes it easier to flip open the 2nd screen as well.", "time": "01-11-2018 01:34 PM", "replies": []}, {"postID": "post6134363", "text": "One small annoyance i found is that if you are on the phone talking the data speeds really suffer. Say your talking and trying to browse the web, app store etc. It is very slow. \nThat does seem to make sense since this phone just doesn't have the available bands like my Samsung has but it kind of reminds me of the days when this was a carrier issue. Even connected to Wifi still yields the same results. Once your off hte phone call the data stream returns to normal cell or wifi.", "time": "01-12-2018 09:43 AM", "replies": []}, {"postID": "post6136578", "text": "So what made you go to the Axon M and not an S8/S8+?", "time": "01-14-2018 10:52 PM", "replies": [{"postID": "post6158053", "text": "Mainly just wanted to try something new. I also remote (VNC) into machines and having the double screen on the go seemed nice. It does work pretty good for what I need and the line doesnt really bother me too much. \nAt the end of the day I probably wouldn't go this route again. The few bugs and small issues I found kind of make it more annoying than useful.", "time": "02-08-2018 05:44 PM", "replies": []}]}, {"postID": "post6142693", "text": "I love mine. I think it feels great in the hand. Nice and solid to hold. Not as susceptible to slide out of your hand as the note 8 which I gave up for this. I'm just so excited to see something different for a change. I love surfing the web and watching TV now on my phone. Haven't touched my computer or tablet since I got it. Love it!!! Oh and the glass screen protectors were a bust. Made the phone look awful and the case didn't really work with them. Took them off and now I love the case and the phone!", "time": "01-22-2018 09:15 AM", "replies": []}, {"postID": "post6143826", "text": "I like finding/using unique gadgets and had this not ben locked to AT&T and if the price was right (unlocked) I'd consider it.\nOne thing I learned though when going with an \"off brand\" or one of a kind type gadget like this one is that it's a given that it won't be worth any money in a few short months if you decide to trade in or sell online. It's just a nature of the beast. Happened when I went with (at the time) the very nice Asus Zenfone 2, it was worth nothing within a year. Same is happening with my Axon 7, prices for it are dropping quick. \nI'm all for being different but I go into it knowing I will never get my money back, or if I do, it's pennies on the dollar.", "time": "01-23-2018 11:22 AM", "replies": [{"postID": "post6158057", "text": "Yup I agree. Wanted to try something new and different and get so many comments on it when I show people it's trick. A lot of issues I'm having though could likely be software. The Fingerprint scanner is sorry and doesn't work 75% of the time. I've registered multiple fingers over and over again with the same results though. And you don't want this for it's camera. If your not perfectly still and its bright out you can forget getting good pictures", "time": "02-08-2018 05:47 PM", "replies": []}]}, {"postID": "post6158116", "text": "So just a few general thoughts now that I have had a chance to use it for a few weeks.\nGood\n*Love the dual screen and use it frequently Use it for things like VNC to Desktop machines etc, Watching Videos on one screen while chatting is nice.\n*Battery life is fantastic on this thing. I can easily get a day + and have some left over when using the phone a good bit in day to day use. Phone, Chat some video etc. Dual screen use obviously wipes it out quicker though.\n*Easy to hold but the case is a must. The smaller screen really attributes to this but its slippery unless you have the leather case.\nMinor Gripes\n*Software needs a little work. Phone contacts doesn't obey rules (Show only Google Contacts for example, will still show all connected account contacts) I reported this to ZTE over twitter and they seemed responsive to look into it though.\n*Use of Android Auto will lock the phone up and force a restart once it's unplugged\n*Takes several seconds for the 2nd display to turn on\n*Camera / Selfie mode flipping gets old fast. Would love to have an option to default to selfie but it always goes to Regular picture mode first\nThe Bad\n*The Camera is bad. Even in well lit areas you have to hold the phone perfectly still. If you manage to get a good picture it works but it takes trial and error and I have to take pics multiple times sometimes to get a non-blurred shot. Night shots or low lit shots you can forget about.\n*The finger print scanner is about useless. Setup all 5 fingers multiple times and it barely recognizes and usually I just have to end up using the pattern after 3 tries to get into my phone. When it does get the print its slow.\nI'm on edge about keeping it. I think I might pick up a pixel 2 XL but not sure yet. The ZTE does work and it does most things decent but it doesn't really master any one thing. The dual screen is nice and I like having that feature. I rarely use my tablet anymore so it does have it's merits. The phone is pretty quick moving around and I haven't had any issues running apps other than android auto. Its worth a look if you are interested in the 2nd screen but I would probably skip this version and wait for either a software update or the next version if there is one.", "time": "02-08-2018 06:45 PM", "replies": []}]}, {"title": "Something different", "thread": [{"postID": "post6058587", "text": "Two displays, a very respectable processor, a smallish battery, not very much internal storage, and a fairly recent OS version. Specs are speculative at the moment, but if more or less accurate, and the price is right, would you be interested?https://www.androidcentral.com/our-f...ble-smartphone", "time": "11-07-2017 01:21 PM", "replies": []}, {"postID": "post6058877", "text": "I honestly think I would pass. The author makes a pretty good argument that the 3100 battery powering 2 screens may be a bit hard on overall battery life.", "time": "11-07-2017 04:14 PM", "replies": []}, {"postID": "post6080893", "text": "I am seriously considering this phone. The only time the 2 screens is an impact is when you are using both screens for multitasking or for watching a video on both. When it is a normal phone, only 1 screen is on. Every review of it seems to be glowing. I have not seen a screen on time test yet though.", "time": "11-22-2017 08:08 AM", "replies": []}, {"postID": "post6089619", "text": "power5...did you get this phone?", "time": "11-29-2017 12:10 PM", "replies": []}, {"postID": "post6090694", "text": "It does look super cool!", "time": "11-30-2017 08:16 AM", "replies": []}, {"postID": "post6142711", "text": "I got it and love it!", "time": "01-22-2018 09:27 AM", "replies": []}]}, {"title": "Nintendo DS Nostalgia!", "thread": [{"postID": "post6090703", "text": "So I was looking at the Axon M, and it hit me: it totally reminds me of my Nintendo DS!\nAlso, I just can't get over the fact that it can literally fold.\nDoes anyone else think it's reminiscent of a DS? Has anyone purchased it yet?", "time": "11-30-2017 08:21 AM", "replies": []}, {"postID": "post6142710", "text": "I have it and I LOVE it! Beautiful phone. Camera is a learning curve but not half as bad as reviews make out. So you flip the phone over for camera, no big deal. I think the phone is fantastic and innovative. I'm so happy to see something different again. I'm sure the next generation will be even better!", "time": "01-22-2018 09:25 AM", "replies": []}]}, {"title": "The battery on the Axon M", "thread": [{"postID": "post6058884", "text": "In the blog article: https://www.androidcentral.com/our-f...ble-smartphone\nthe author makes a very good observation: With a 3100 battery, how well will this hold up in day to day use powering 2 screens? Will it even make it through a day for an average user?\nThoughts?", "time": "11-07-2017 04:17 PM", "replies": []}, {"postID": "post6073618", "text": "Good question! I guess it's hard to say without any objective study of \"in the wild\" usage. 3100 isn't bad but, as you say, it's powering two screens and not just one! Who knows, maybe their processor will be apt at consuming less battery than other Axon iterations... I guess we'll find out soon!", "time": "11-16-2017 09:02 PM", "replies": []}, {"postID": "post6080854", "text": "Only 1 screen is on in normal phone mode. When opened or in tent form is the only time both screens work from what I have seen. So yeah, 2 1080p screens with slightly less battery than my Note3 is not going to last more than probably 4 hours of screen on time. Though my Note3 has about 5 generation older Qualcomm 800. So I am sure there is a little better power management, but lighting an LCD is still lighting an LCD.", "time": "11-22-2017 07:49 AM", "replies": [{"postID": "post6090697", "text": "Did you end up getting the phone? If so, how are you liking it?", "time": "11-30-2017 08:17 AM", "replies": [{"postID": "post6090708", "text": "Nah, decided on the oneplus 5T. Trust them to update OS more regularly and 5T has all top end new chips and a couple hundred cheaper. I expect my next phone will be some sort of flip folding screen morphing thing though. Considering all I usually do is consume media on it.", "time": "11-30-2017 08:30 AM", "replies": [{"postID": "post6090710", "text": "That's awesome! The 5T is super cool!", "time": "11-30-2017 08:31 AM", "replies": [{"postID": "post6090715", "text": "Yeah, I could not find a phone that hit so many check boxes and even come close to the price. S8 128gb and only 6gb ram is $800. Got my 128gb 5T with 8gb ram for $560. Really a no brainer and I doubt I will feel a loss for the 1440p screen when S8 doesn't even get dual camera like 5t.\nAnd no TouchWiz, yay.", "time": "11-30-2017 08:36 AM", "replies": [{"postID": "post6090720", "text": "Yup, great specs for a fraction of the price of other flagships! So glad you are liking it!", "time": "11-30-2017 08:38 AM", "replies": [{"postID": "post6090735", "text": "Ehh, get it tonight according to USPS. I am sure I will though. As I said, coming from a Note3 any phone would be an upgrade. Finally gave up on waiting for Microsoft to rebound and now that they finally threw in the mobile towel, it's upgrade time.", "time": "11-30-2017 08:51 AM", "replies": [{"postID": "post6090764", "text": "So exciting! Be sure to let us know your first impressions in the OP 5T forums!", "time": "11-30-2017 09:23 AM", "replies": []}]}]}, {"postID": "post6099612", "text": "I had an S8+ and I took it back. The camera was horrible on it.", "time": "12-07-2017 06:41 PM", "replies": []}]}]}]}]}]}, {"postID": "post6142700", "text": "Mine battery does ok. I use it constantly and it's only in the 20% area when I go to bed but it lasts. I watch a lot of TV too.", "time": "01-22-2018 09:18 AM", "replies": []}]}]
