[{"title": "[REVIEW] Incipio DualPro for the BlackBerry Motion", "thread": [{"postID": "post6182578", "text": "Two is usually better than one, unless of course you’re talking about golf, or maybe minutes on the clock until you get off of work (har har har). However, when it comes to phone cases, sometimes two really is better than one, and that’s the case with well… the case. What case is it you might ask? Well, it’s the DualPro by Incipio. Incipio has been making the DualPro case for quite some time and it’s one of their more popular series of cases. I have to admit that I happen to be a big fan of them. I started using the DualPro series case a while ago, and I loved the version for my BlackBerry KeyONE. In fact, I loved it so much that I decided to get one to review and use for my fancy new BlackBerry Motion.The Look: The look of the case is the timeless, integrated two-case system that provides tons of protection for your phone. It has a soft inner case that wraps around your phone and keeps it safe and warm, and then a secondary shell that’s made of hard plastic that helps add impact resistance and drop protection. The case does have seams, but it appears to be as almost seamless - for real; it looks and feels like a one-piece. There are several other two-piece case systems that I have used in the past, and many of them have a hard time sealing up properly and melding together; not so with the DualPro. The DualPro clicks into place and is comfortably snug, but oh so elegant. The version that I got is the Black on Black case, and it looks fantastic. The DualPro also comes in Iridescent Midnight Blue, which also ooks fantastic. The Feel: The case has a very unique feeling to it. In addition to being ultra protective, the patented Plextonium that forms the outer shell is svelte, and almost has a soft-to-the-touch feel. It’s not slick, but your finger glides over it with ease. In addition to having a unique, comfortable texture, it’s also not prone to scratches – at least they aren’t readily visible. The overall feel of the case is nice and it feels sturdy, yet form-fitting. Usually protective style cases are pretty bulky, but the DualPro has a really solid feel to it that I like, and just feels right when it’s on the phone. The buttons are nice and responsive, with a comfortable tactile feel. Last but not least, the cut-out for the USB-C port is great and gives you easy access to charge your phone.Security: Security is where the DualPro shines. It may be fancy and feel great, but it also has 10ft of drop protection – holy smokes. You can drop this thing from the same height as a basketball goal rim and it will still be ok – according to them. I’m not crazy enough to drop my phone 10ft. However, 10ft is easily above what many other cases in this price range and heft have to offer. The case has a shock absorbing inner core that keeps your phone safe when it counts and keeps you focused on more important things like living your life and enjoying your phone in a variety of situations. Conclusion: The Incipio DualPro is a great case that gives you flexibility with day-to-day life, when you otherwise might have to compromise on style or appearance to gain some added protection. However, with the DualPro, you can take what life throws at you and keep on keeping on. The aesthetics and form factor are excellent, it feels great and it has more protection than you can shake a stick at. Pros:\n-\tIt looks great and really molds to the phone. Aesthetics are solid,\n-\tThe Black and Blue colors really make the phone stand out.\n-\tSecurity is top-notch! 10ft of drop protection is crazy.Cons:\n-\tDoesn’t come in more colors – two is nice, but three or four could be better\n-\tIt’s not the cheapest case in the world ($29.99), but it’s well-priced\n-\tBecause of the rounded top of the Motion the top case seal looks a little odd. \nIf you’re interested in picking up one of Incipio’s DualPro cases for your BlackBerry Motion, you can check them out on http://www.incipio.com – they are currently priced at $29.99. Interested in getting one or you’ve used a DualPro case before? Sound off in the comments and let me, and others know what you think.", "time": "03-07-2018 10:13 PM", "replies": []}]}, {"title": "BlackBerry Motion Review", "thread": [{"postID": "post6166883", "text": "From a time long, long ago, when BlackBerries were the way of the future, I can still remember when I bought my first BlackBerry. My very first model was the BlackBerry 7100G. I had wanted a BlackBerry from the very first time I saw one, but I couldn’t afford one. By time I got the 7100, I had a pretty good job and was happy to pay Cingular (now AT&T) by hard earned money for this fancy new device and the additional fee for BIS. For the uninitiated, BIS stands for BlackBerry Internet Services, which was required to use mobile data at the time. The 7100 was my first BlackBerry, but it wasn’t my last. Fast forwarding through the years, the next BlackBerry I got was the Pearl, with its slick little trackball (I went through two of these phones because I used it so much that I blew out the trackball and contacts). I ended up skipping on the Bold series, opting for the iPhone because I wanted 3G internet. I patiently waited for the inevitable upgrade that was slow to come, and then finally pounced on the Z10 once BB10 was launched; it was love all over again. I was happy with the Z10, but I missed the physical keyboard so as soon as the Q10 came out, I switched to that. Over time, I owned the Z10, Q10, Z30, Classic, Passport in White, Black, SE model, as well as the ATT version, and finally after BB10’s glory days had begun to fade, I got a BlackBerry Porsche P’9982, and P’9983. I was even an early adopter of the bug-plagued Priv that I was proud to use, and then my hopes faded as BlackBerry outsourced the hardware division, and shuttered the doors on the BB10 factory. I was disheartened to say the least, and found it difficult to decide where to turn to for my next device. That was until the KeyONE was announced. I was a day-one adopter, pre-ordering the device and driving semi-recklessly down to Best Buy to pick it up on launch day; everything was right with the world again. I had my keyboard, I had the convenience key, and most importantly, I had my BlackBerry back – minus the screen that fell out of my phone after a few weeks, but that’s neither here nor there. The most important part of this story is that I finally had a real BlackBerry back in my hands. Sure, it isn’t exactly the same, but the nostalgic effect of BlackBerry Mobile and the well-built BlackBerry oriented version of Android made me feel right at home, especially after I enjoyed the Priv so much. The whole experience helped me to believe in BlackBerry again, and helped me to reestablish ties with the brand after everything seemed to spiral down the toilet over time. Enter stage right --- the BlackBerry Motion. \nThe BlackBerry Motion is an important device, because it marks the very first all-touchscreen model made by BlackBerry Mobile. It is as momentous as the release of the Priv, and the KeyONE, which are both unique and novel in their own way. From the first time I picked up the Motion and started using it, it was like the Z10 and Z30 experience all over again, except it felt comfortable and the dimensions finally snapped. I, and many other faithful BlackBerry users has been waiting and waiting for an upgrade to the Z30, and hoped for another true all-touch phone after the Passport and the Priv, but it never came. Well, I’m here today to tell you that it has arrived, and I’m also here to tell you about it.Pricing: The MSRP is $449, which is the best pricing I’ve seen yet on a new BlackBerry, and I think it fits. I was turned off a little bit by the high prices of the Priv and KeyONE on launch, I feel like this price is much more representative of the specs that are in the phone, as well what the device brings to the table.Specs:\n- The timeless Snapdragon 625 clocked @ 2.0ghz (the same processor that powered the KeyONE)\n- 4GB of memory (hallelujah!)\n- a 5.5” curved display, with 1920x1080 HD resolution, made with DragonTrail glass (403ppi)\n- Display is protected by the nano-diamond anti-scratch coating for enhanced protection\n- A 4,000 mAh battery --- awesome battery life\n- 32GB of internal storage (Expandable up to 400gb with an SD card)\n- Rear Camera: 12 MP, f/2.0, phase detection autofocus, dual-LED dual-tone flash\n- Front-Facing Camera 8MP f/2.2 with flash, and supports 1080p video @30fps \n- Runs Android 7.1 Nougat out of the box, complete with BlackBerry software suite and DTEK security\n- Records video at 30FPS for both 4k and 1080p\n- The first BlackBerry ever with IP67 water/dust resistance! \n- GSM unlocked for use with ATT and TMO, and their various MVNOsOverview and Performance: The performance for the BlackBerry Motion is very balanced. The SD625 is not exactly a beast when it comes to straight-line speed, but it’s a very efficient and able-bodied processor that really shines when it comes to multi-tasking, especially when it’s paired with 4gb of RAM, which is a nice addition from the original KeyONE. I very much enjoyed my experience on the KeyONE, but the overall performance was stymied a bit because of the 3gb of RAM. It was eventually corrected in later versions, and I’m happy that it transferred over to the Motion as well. I tried playing some games on the phone and it can get choppy, even on games a few years old like Boom Beach. It’s not enough it unplayable, but it is a bit annoying at times. The overall flow and utility of the user interface, the Productivity Tab and Hub, are unaffected, and work very well. The Hub was a big question mark for me, especially since the last time I really used it was on the Priv, which left me very unimpressed. The Hub finally seems to have the kinks worked out of it and works as it is intended to, and it was a delight to have it back again! In addition to all of this, this is the first ever BlackBerry with IP67 water/dust resistance – safe for up to 30 minutes in 3ft of water! Display: The display is excellent, at least in my opinion. One of my biggest hang ups with the KeyONE was the screen. It felt white-washed and bland, and was not an enjoyable experience as well. I actually had my expectations set fairly low for the Motion screen, so it was a nice surprise when I fired it up. The color balance is good. It’s not oversaturated, and it’s not bland. It’s a well-balanced color and tone ratio that does a good job for an LCD screen. I wasn’t disappointed, and I don’t think you will be either. Another nicety is the true, full-HD display, rocking a solid 402ppi, and 1920x1080 resolution. Video and graphics are crisp and look good. It’s definitely the best looking screen I’ve used on a BlackBerry, to date.\nBattery Life: The battery life on this phone is spot-on. It’s really hard to beat a 4,000mAh in your phone. On top of the serious battery capacity, the SD625 processor helps take it to the next level. The 625 is a very power efficient processor, and it’s also great for multitasking performance. I was initially hesitant and disappointed when I found out that they were using the same chip for the Motion, but that was until I used it. The experience isn’t watered down at all, and additionally, it’s really about usage. If you’re a gamer and you want to run the latest and greatest games, then this isn’t likely a good fit for you. However, if you’re a traditional BlackBerry user and you love long-lasting performance combined with efficiency, then this will be a good fit. I don’t usually like to test out my phones when it comes to multi-day use because I’m paranoid about being caught out without a charger, but the Motion held up well into day two for me on a single charge. It didn’t make it through two full days because I use my phones heavily, but it made it all the way to lunchtime the next day before I needed to plug it in. Fingerprint Sensor: The fingerprint sensor is good, and if you’ve read my reviews before then you know how much of a fan I am of front-mounted FPS’s. I hate having to reach around the back all the time, especially in instances like the S8/S8+ debacle. One area of disappointment in the Motion is the lack of accuracy. The KeyONE spacebar/FPS hybrid was next-world level good, and I think that set my expectation really high for the Motion. The Motion FPS is good, but it’s not Grrrrreeeaaat (thanks Tony the Tiger). However, it’s not bad… it’s just not fantastic. It will definitely let you know if your finger placement isn’t in the target zone by vibrating and refusing you unlock. Once you get your finger trained to the FPS placement, it’s perfectly fine. In addition to being a FPS, BlackBerry upped their game and made it a combination home button/notification scroller as well. While touching the home button works as an FPS, pressing down on the button performs the traditional home button function. As for the scrolling function, if you swipe down on the FPS once it pulls down the quick-option screen and notification, and an additional swipe will bring the notifications shade all the way down; how cool!Sound: The sound on the Motion is adequate. It’s not really anything to write home about but it works well for what it is. If you’re a serious sound jockey and really care about power and volume, then this probably won’t be a selling point for you. If you’re interested in good sound that won’t hurt your ears and provides an enjoyable sound experience, I think you’ll be happy with the speaker and sound quality. There is only one speaker on the phone and it’s a downward firing driver on the bottom of the phone. The placement is “ok”, but could be better. I find that many times I find myself cupping my hand over the speaker port and muffling the sound, which is not something I’m crazy about. However, it’s mostly the industry standard and the exact same thing you get out of Samsung devices, except it’s slightly better than that. So, marginal placement and adequate sound is the rating that I’ll give for the sound experience.Camera: The camera experience varies from ok, to painful. If the lighting is good, you can catch some decent shots. However, if it’s less-than-optimal lighting conditions, or low-light conditions, your happiness with the quality of the pictures this thing takes will quickly plummet. Additionally, I found that taking pictures of objects with reflective surfaces is not good either. It drastically dims the screen and takes pretty awful pictures. The only thing I can really say here is that they took the business model for phones to the extreme, as-in, it’s a work/productivity phone and isn’t designed around the camera. However, I would caveat that by saying that it should be better, and could have been better. The KeyONE camera was a bragging point for marketing, and I feel like that should have translated over to the Motion as well. I guess it’s one of the sacrificed specs that ended up on the chopping block for the $100 price reduction. On a positive note, the shutter speed is pretty snappy and it takes quick pictures, which is a bonus for me. Additionally, one cool photo feature that the Motion offers is the secure folder. While taking pictures, if you want to send a photo to the secure folder, place your finder on the home button (don't press it), and it will snap a picture and send it directly to your secure folder that requires either a fingerprint or PIN to access. Of course, regular snaps utilizing the shutter button go straight to the photo folder. Software: In today’s society where BlackBerry is now competing on the Android platform, there are some people (myself included), who really have to sit back and wonder, “why should I get a BlackBerry?” It’s not BB10 anymore, so why should I shell out the money when I could arguably get something better from another manufacturer? The biggest answer to that question is the software experience. Although the Motion is still running Android 7.1, I have to follow that up by saying that so is the Galaxy S8/8+, so let’s not throw it on the chopping block for that. The BlackBerry UI experience is deeply modified in important ways that takes time to move over to a newer version of Android. The assistant, the Hub, and the DTEK security suite are vital integrations into the OS, and really help secure BlackBerry’s place in the Android world. Sure, there’s something to be said for “stock Android”, but I believe that there is something to be said for modified UI’s, especially when done right; and the Motion does it right. It’s a pleasure to be able to swipe from the left, or the right (depending on your configuration) and open up the Productivity Tab, which features your email, the Hub, notifications and upcoming events on the calendar. The Productivity Tab has come a long way from the Priv, and is chock-full of customizations. You can make the tab larger or smaller, adjust placement on the screen, and even move it from one side of the screen to the other. I dream of a day when a simple swipe from the left will get me straight to the Hub, but for now this is definitely nothing to scoff at. The entire integration of the Productivity Tab into the UI is seamless and works like a charm. Along with the Productivity Tab and the Hub, the DTEK security suite makes a reappearance, as does the BlackBerry Software Suite, which I love. If you swipe over a few screens you can get to a host of BlackBerry gems, like notes, tasks, events, email, composing texts and BBM messages, and even check your data usage and battery level. The best part of the software suite is the BlackBerry touch keyboard, which I argue is the best in the business. If you’re another device, definitely use GBoard, but if you’re rolling with BlackBerry, you never need to look any farther because you’ve already got the best. It is a perfect and seamless translation from BB10, and I have sorely missed it. I love being able to swipe backward on the keyboard to erase, tap the space bar for suggestion and flick up on the selected text predictions that hover over the letters on the keyboard. If you’ve never used a BlackBerry touch keyboard, you’re certainly missing out; it’s a pure delight. \nIf you’re uninitiated to the BlackBerry Hub, then you’re also in for a treat. The Hub is just what the name is, a consolidated, easy-to-use hub that integrates all of your notifications, communications and events into one convenient locale. You can even customize it to prioritize the information/notifications that you want to see. You can even take it one step further and assign a customized color LED notification to the particular notification. For instance, you can make text message notifications Blue, BBM’s can be Yellow, email can be Green, and so on and so forth. The power of the LED and customization is strong with the Motion. Last but not least is the convenience key, which is unique to BlackBerry and configurable to your favorite apps. Although the placement could arguably get better, you get used to it quickly, and then it becomes second-nature. I personally use the convenience key for Slack, which I use all day long, and it’s incredibly neat, and nice, to be able to press the convenience key and pull the app up without a second thought. Software Conclusions? Game. Set. Match, BlackBerry.Conclusion: Overall, the BlackBerry Motion is a fantastic device and the experience is a gem among Androids. Every manufacturer tries to find ways to differentiate themselves from others, and tries to find a way to stand out from the crowd. Oft times though the additional features seem gimmicky, and not appealing at best; not so for BlackBerry. The Hub integration, the convenience key, the fancy front-mounted FPS with the emboldened BlackBerry logo, and so much more, really help create a unique offering that helps power you through the day. Sure, there are hang-ups (most notably the camera), but in the grand scheme of things for $449, I think the overall package and experience really help make this a worthwhile offering, especially if you’re a current BlackBerry user and are looking for the next leap in your device upgrade future. If you’re a BB10 user, past/present, then this is the next best thing, and my hope is that the experience will only get better and better. However, as-is now, the integration and experience are top-notch BlackBerry!\nIf you’re interested in picking up one of these delightful other-fruit phones, you can find them on Amazon and BestBuy for the everyday price of $449. If you have any questions or comments, please leave them down in the comment section. \nHere is my full video on my YouTube Channel - TechOdyssey:", "time": "02-19-2018 06:05 PM", "replies": []}, {"postID": "post6181739", "text": "This is a pretty nice flagship", "time": "03-07-2018 03:24 AM", "replies": []}]}, {"title": "Do you use a case on your BB Motion?", "thread": [{"postID": "post6140469", "text": "Ive ordered this phone and hoping its rugged enough to go without a case. Any thoughts on this? \nIf a case is needed what do you all recommend?", "time": "01-19-2018 12:10 PM", "replies": []}, {"postID": "post6144012", "text": "The phone is fine for me without a case. is a small bit smooth to hold. Ordered a pocket pouch just for protection in my pocket.", "time": "01-23-2018 03:43 PM", "replies": []}, {"postID": "post6144383", "text": "I think the BB Motion would hold up OK without a case too, but a screen shatter is my concern. I just received the CoverON flex guard TPU case. \nWas $8 on amazon and fits well. has a raised bezel to protect the phone when face down.", "time": "01-24-2018 12:33 AM", "replies": [{"postID": "post6170772", "text": "How is it? Did you get the clear or black case! Can you post photos?", "time": "02-24-2018 01:55 AM", "replies": [{"postID": "post6172251", "text": "Works great. Can't beat the price for what you get. I went with the clear.", "time": "02-25-2018 08:15 PM", "replies": []}]}]}, {"postID": "post6155364", "text": "I need a holster for my needs and picked up a blackberry dtek60 holster and it's a perfect fit", "time": "02-05-2018 08:04 PM", "replies": []}, {"postID": "post6156450", "text": "I have two incipio cases on the way. they were great for the K1, so I'm hoping they're just as good for the Motion. the phone is too slick without a case.", "time": "02-06-2018 11:50 PM", "replies": []}, {"postID": "post6160394", "text": "Got a generic pouch off ebay -- perfect fit, BTW. Use that till -- I hope -- Bixon comes out with a case for the motion.", "time": "02-11-2018 05:45 PM", "replies": []}]}, {"title": "BlackBerry Motion - Super Long Video Review", "thread": [{"postID": "post6161322", "text": "A sneak peak at the full video review I made for the BlackBerry Motion. Article forthcoming. I went super in-depth this go'round. Love the phone.", "time": "02-12-2018 08:17 PM", "replies": []}]}, {"title": "BlackBerry Motion Unboxing Video", "thread": [{"postID": "post6156451", "text": "Enjoy! I'm a little late to the party but hopefully it's helpful. Full review coming soon.", "time": "02-06-2018 11:51 PM", "replies": []}]}, {"title": "Skinomi installation video", "thread": [{"postID": "post6156447", "text": "I was trying to find a good screen protector for the motion and wasn't really feeling good about any of the purchase options on Amazon so I went with the good old Skinomi. I decided to make an installation video. Maybe other people might find it helpful.", "time": "02-06-2018 11:38 PM", "replies": []}]}, {"title": "Screen issues?", "thread": [{"postID": "post6151580", "text": "Anyone noticing small dark boxes when your screen is on a low brightness setting? It is especially noticeable with a light gray background in the upper right quadrant of the screen. Ive had the phone 2 weeks and am just noticing this... I think it is new.", "time": "02-01-2018 10:27 AM", "replies": []}, {"postID": "post6151919", "text": "Do they show up in a screenshot? If not, then see if you can take a picture of the screen using another device and post it here. It'd be helpful to see exactly what you're seeing.", "time": "02-01-2018 05:31 PM", "replies": []}]}, {"title": "BlackBerry Motion - you going to get one?", "thread": [{"postID": "post6007305", "text": "Anyone hear about the leak of the 'BlackBerry Motion' the other day? Any KEYone owners out there that'd jump for this to go full touch??\nMore info over at CB: https://crackberry.com/blackberry-motion-leaked", "time": "10-06-2017 08:58 AM", "replies": []}, {"postID": "post6007311", "text": "I saw pictures! It's a beautiful phone! I'm interested in learning more about it!", "time": "10-06-2017 09:00 AM", "replies": []}, {"postID": "post6007316", "text": "I hope the screen is bigger and shrink the bottom part where the fingerprint scanner is to make a larger screen & will it have wireless charging??????????????????\nLets get with the times tlc go big or close up shop!", "time": "10-06-2017 09:05 AM", "replies": [{"postID": "post6011459", "text": "I agree with these thoughts, slightly smaller chin and Wireless Charging", "time": "10-08-2017 08:48 PM", "replies": []}]}, {"postID": "post6007824", "text": "I most certainly heard about it 😃 @James Falconer I also made a thread about it in the \"rumoured devices\" subform a little while ago. Heading talked about the \"Krypton\". Maybe it can be moved here? \nWe still have a lot of unknown details but from the picture Evan Blass posted, it's got potential. A 4,000mAh battery is going to get a lot of thumbs up. Eagerly awaiting more details. Hopefully I can get my hands on one!", "time": "10-06-2017 01:41 PM", "replies": [{"postID": "post6010063", "text": "Yes,I love the big battery! And I really like the form factor.", "time": "10-07-2017 10:23 PM", "replies": []}]}, {"postID": "post6008301", "text": "If it's released with 4gb ram and 64gb rom and a decent camera as good as the KeyOne's... Definitely getting it 👌", "time": "10-06-2017 07:28 PM", "replies": []}, {"postID": "post6010120", "text": "I'm actually thinking about getting rid of my S8+ and going in on this. the battery is very enticing.", "time": "10-07-2017 11:14 PM", "replies": []}, {"postID": "post6010241", "text": "Nope, I prefer a pkb", "time": "10-08-2017 12:57 AM", "replies": [{"postID": "post6010588", "text": "You know, it's been at least four or five years since my BlackBerry Q10, and I still miss a physical keyboard... And my virtual keyboard typing skills are... Mediocre at best. 🤣", "time": "10-08-2017 09:10 AM", "replies": []}]}, {"postID": "post6034841", "text": "Maybe when my Dtek60 dies, but no earlier. Except for the water and dust proofing, not really much of a hardware upgrade and a lesser screen then the Dtek60. I'll live with marshmallow for now.", "time": "10-23-2017 06:00 PM", "replies": []}, {"postID": "post6046974", "text": "Any idea about speakers? Coming from Z30, I need stereo and good quality.", "time": "10-31-2017 08:13 AM", "replies": []}, {"postID": "post6047719", "text": "absolutely, I will it looks great 4000mah, water resistant, and secure hell yes", "time": "10-31-2017 05:09 PM", "replies": []}, {"postID": "post6050357", "text": "Got my Black Keyone and loving it 4/64", "time": "11-02-2017 12:03 PM", "replies": []}, {"postID": "post6054335", "text": "Pretty much resigned to getting one myself, 6ish days and counting. Productive, secure, 2-day battery, and it ain't going to cost an arm and a leg. Actually like the design big chin and all. And WOOHOO! no curved display, headphone jack and a front facing fingerprint scanner.", "time": "11-04-2017 09:10 PM", "replies": [{"postID": "post6063549", "text": "For me, I love having options. So getting a device that has a headphone jack is important. Sure it's nice to listen to music wireless but sometimes the battery goes flat and it's so nice to still have that cable option which doesn't require any charging. 😃\nSimilar thing goes for the IP67 water & dust resistance. I'm probably not going to use my phone while it's raining outside, but it's nice to know if I need to I CAN with no worries. Again, options. 😃", "time": "11-10-2017 01:41 PM", "replies": [{"postID": "post6065472", "text": "The Motion pretty much ticked all the boxes for me and that's what counts IMHO. And actually something about the design that is appealing.\nOrdered mine yesterday (no one in my area had available) and should arrive next week so can't wait. Been using my 2+ year old LG G4 again as my daily driver w/o issue so the Motion should be able to take over where the G4 left off, easily. Always got the GS7/GS7 Edge along w/three WP's to fill in the gaps if need be LOL.", "time": "11-11-2017 05:26 PM", "replies": [{"postID": "post6069005", "text": "That's so exciting! Congratulations on your shiny BlackBerry Motion! Let us know when it arrives, and how you are liking it!", "time": "11-14-2017 08:45 AM", "replies": [{"postID": "post6069107", "text": "Thanks and yeah it is exciting, if it ever arrives - I'm an impatient bugger LOL\nWill definitely give my thoughts once in hand and we've a chance to use it for a bit.\nI'm not a heavy hitter per se when it comes to using my phones (games, multiple apps open), we're actually quite anal about if don't say so myself hehehe. But looking forward to that battery because it might alleviate my battery drain phobia.", "time": "11-14-2017 09:57 AM", "replies": [{"postID": "post6069217", "text": "I definitely understand what you mean! I hate waiting for packages to come in the mail - especially when they're phones! \nYes, let us know about how it performs! I too don't usually have all my apps open and don't use my phone for intensive actions like gaming. \nWhat are the battery specs for the Motion? It really looks like an attractive device!", "time": "11-14-2017 11:13 AM", "replies": [{"postID": "post6069255", "text": "Battery specs are 4000 mAh rated at 32+ hours of battery life. Seen some users on CB that posted their battery life quick reviews, one person managed to squeeze out 36+ hours w/nearly 8.5 SOT, that's insane if so! This person is a casual user too sounding very similar to how I use my devices.", "time": "11-14-2017 11:39 AM", "replies": [{"postID": "post6069272", "text": "HOLY MACKEREL that's amazing!!", "time": "11-14-2017 11:47 AM", "replies": [{"postID": "post6134042", "text": "Not only is it amazing.. It's true. I'm an extremely heavy user. Yesterday I rolled with 10 hours and 34 minutes screen on time. 17 hours and 22 minutes of use.... 6 hours remaining on the battery when I went to bed. The average user could easily get almost two days", "time": "01-11-2018 11:15 PM", "replies": []}]}]}]}]}]}]}]}]}, {"postID": "post6065001", "text": "Had the KEYone and bad cellular reception and returned, not trying the Motion as will probably have bad reception as KEYone, never had a problem with phones made by Blackberry.", "time": "11-11-2017 12:39 PM", "replies": []}, {"postID": "post6065473", "text": "For some reason my message got double posted and can't find the \"delete\"... So had to put something in here.\nSure wish Mobile Nations would get things sorted out because every time something goes awry on their sites (Windows/Android Central) we feel like we're using Windows Phone with all its inconsistencies", "time": "11-11-2017 05:26 PM", "replies": [{"postID": "post6065993", "text": "Hope you enjoy your new Blackberry Motion  The waiting is always hard but the reward is worth it. With regards to deleting your post, if you are using the desktop site, you need to click the little \"Pencil\" icon on the top right corner. Then tick the delete message option at the bottom of the post.\nIf you are using the AndroidCentral App, Unfortunately you cant do that yet, only editing is available. Also, if you make a post, you cant add a picture to it after posting (using the App). There are always new versions coming out so I'm sure we will see these features in the future.", "time": "11-12-2017 03:19 AM", "replies": [{"postID": "post6066268", "text": "Thanks and I'm sure we will enjoy it.\nAs for deleting a post... Done it before many a times with this issue being on the desktop site using Edge/Firefox and only on Android Central, for now. The \"delete message\" option is not showing up under any circumstance even on my older posts. On the other hand, if I go to the Windows Central or CrackBerry and check one of my posts the option to delete is there which is weird.", "time": "11-12-2017 10:19 AM", "replies": []}]}]}, {"postID": "post6071974", "text": "Well mine arrived today, was sitting waiting for me when got home from work and on charge now . I'm actually more impressed seeing it in person so hopefully things continue \"up\" from here, time will tell.", "time": "11-15-2017 07:45 PM", "replies": [{"postID": "post6072901", "text": "That's always the best when you come home from work and there is a present on your bed. Just makes the day so awesome. It's been about 17 hours since your post. \nDo you have any initial comments about the device? 😃 Any things you would like improved or changed?", "time": "11-16-2017 12:31 PM", "replies": [{"postID": "post6074894", "text": "Yeah way more than 17 hours now but been so busy that really haven't had much time to toy with it fully, getting there slowly but surely now but still a ways to go before I can form a truthful and honest opinion.\nHere are some quick thoughts...\nLike:\n* Comfortable in hand (don't have huge hands) \n* Nice build quality, and looks premium\n* Weight balanced (for me), not heavy nor too light\n* Display is nice and crisp \n* Fingerprint Scanner is quick and consistent - better than my GS7/GS7 Edge\n* Pleased enough w/camera and its feature-set - only brief testing done\n* Mono-speaker volume, quality and clarity more than acceptable to me - no audiophile here.\n* Notification RGB LED\n* Blackberry software - DTEK, Hub, Privacy Shade, etc.\n* Battery \n* Overall phone has been very responsive but waaay to early for an assessment here \nUmm:\n* Chin is surely a bit big but is growing on me - top and bottom aren't equal causing it to stand out more\n* Volume rocker and convenience keys on left side would have been nice, I'm a lefty.\n* Convenience key location mistaken for power button, getting used to it now.\n* Brightness levels not up there with my GS7/GS7 but dove in fully aware of this\n* Camera - no OIS\n* No FM Radio - appears disabled at least here in Canada\nUp to this point I'm very pleased with what we've gotten for the price, and excited to commission it as my daily driver. Me being what I consider a light to medium user I haven't seen or experienced anything yet that doubts the Motion's abilities so it should easily live up to my expectations.", "time": "11-17-2017 07:52 PM", "replies": []}, {"postID": "post6074895", "text": "Yeah way more than 17 hours now but been so busy that really haven't had much time to toy with it fully, getting there slowly but surely now but still a ways to go before I can form a truthful and honest opinion.\nHere are some quick thoughts...\nLike:\n* Comfortable in hand (don't have huge hands) \n* Nice build quality, and looks premium\n* Weight balanced (for me), not heavy nor too light\n* Display is nice and crisp \n* Fingerprint Scanner is quick and consistent - better than my GS7/GS7 Edge\n* Pleased enough w/camera and its feature-set - only brief testing done\n* Mono-speaker volume, quality and clarity more than acceptable to me - no audiophile here.\n* Notification RGB LED\n* Blackberry software - DTEK, Hub, Privacy Shade, etc.\n* Battery \n* Overall phone has been very responsive but waaay to early for an assessment here \nUmm:\n* Chin is surely a bit big but is growing on me - top and bottom aren't equal causing it to stand out more\n* Volume rocker and convenience key on left side would have been nice, I'm a lefty.\n* Convenience key location mistaken for power button, getting used to it now.\n* Brightness levels not up there with my GS7/GS7 but dove in fully aware of this\n* Camera - no OIS\n* No FM Radio - appears disabled at least here in Canada\nUp to this point I'm very pleased with what we've gotten for the price, and excited to commission it as my daily driver. Me being what I consider a light to medium user I haven't seen or experienced anything yet that doubts the Motion's abilities so it should easily live up to my expectations.", "time": "11-17-2017 07:52 PM", "replies": []}]}]}, {"postID": "post6140460", "text": "I'm intrigued by this phone. I ordered one from Best Buy in the US that should arrive today. This will be my first Blackberry since the Blackberry Storm in 2007! \nI have to admit I havent been this excited about a device in a long time. theres lots of criticism on the processor and camera for this device but I doubt these will be annoyances for me. the only thing I think it's missing to be an ideal phone is wireless charging. For me, its about functionality to include battery life, weatherproof, and software. The BB motion looks to be their most complete phone yet at a very fair price point with some unique features. oh and thakfully it has a notification LED. I'm not a fan of \"always on\" screens as a replacement of the LED. its one of the reasons I wont buy a Motorola.", "time": "01-19-2018 11:56 AM", "replies": []}, {"postID": "post6146406", "text": "Got mine yesterday. T-Mo Wifi-calling works out of the box on the 100-2 version. And, better, it's incredibly stable. Compared with my previous phone, a Z10, this thing is a freakin' surfboard. The Blackberry bent Android software makes the phone very usable. Finger print/status bar scroll/home button is cool. The productivity tab or whatever it's called is great, and the programmable button on the side also, except haven't programmed it yet. And the battery is Godzilla. So far, so good.", "time": "01-26-2018 09:57 AM", "replies": []}, {"postID": "post6146549", "text": "Does VoLTE work on Tmo?", "time": "01-26-2018 12:59 PM", "replies": [{"postID": "post6146951", "text": "I have terrible reception at home so running on wifi-calling. Will get out in the unreal world tomorrow and let you know. But check this:https://forums.crackberry.com/blackb...obile-1110195/", "time": "01-27-2018 04:16 AM", "replies": []}, {"postID": "post6146980", "text": "Good question! I have my BB motion on T-Mobile and just checked. The option is there in settings and turned on but nothing is indicating during the call that VoLTE is on. The calls are very clear but I can't say for sure.", "time": "01-27-2018 05:54 AM", "replies": [{"postID": "post6147430", "text": "Ok, I can confirm VoLTE works on the motion on T-Mobile. You'll notice an HD symbol on the contact when the phone is ringing. It only seems to work when you call another person with VoLTE. Calls sound very good though.", "time": "01-27-2018 07:10 PM", "replies": []}]}]}, {"postID": "post6149498", "text": "Thanks for clarification, you can also get that app from the Play Store to test ithttps://play.google.com/store/apps/d...tmobile.band12", "time": "01-30-2018 06:02 AM", "replies": [{"postID": "post6149665", "text": "This app does not recognize my IMEI.", "time": "01-30-2018 09:52 AM", "replies": []}]}, {"postID": "post6149941", "text": "mine either", "time": "01-30-2018 02:15 PM", "replies": []}, {"postID": "post6149950", "text": "How's the performance? The 625 is a middleweight chipset and I'm worried it will be to slow before two years is up.", "time": "01-30-2018 02:23 PM", "replies": []}, {"postID": "post6150067", "text": "If you're coming from an 835 snapdragon you'll notice a slowdown in the speed of things but it is still a fluid experience. Just an occasional app freeze but no more than my S8 or LGV30 had. Overall a very pleasant experience. loving the battery life! 70% remaining at 6pm after a full workday!", "time": "01-30-2018 05:09 PM", "replies": []}]}, {"title": "Software update", "thread": [{"postID": "post6145563", "text": "I received a software update yesterday on BB motion. No noticeable changes other than a Jan 5, 2018 security patch. See attached.", "time": "01-25-2018 11:25 AM", "replies": []}]}, {"title": "Tim Schofield BlackBerry Motion unboxing", "thread": [{"postID": "post6074984", "text": "", "time": "11-17-2017 09:04 PM", "replies": []}, {"postID": "post6075255", "text": "Thanks for the video link Mike 😃 it's great to see more video reviews of the device. It seems like there is a general positive view on the device. Some do mention the big bezels on the top and bottom but that's ok, it gives you somewhere to hold while playing games.", "time": "11-18-2017 12:13 AM", "replies": [{"postID": "post6075918", "text": "The more I use the Motion the more impressed I become. Definitely oriented towards business and productivity (if one relies on BB's setup). In the short-term I've owned/used the Motion it feels like I can achieve more while doing less, if that makes any sense. Wonder if installing some of BB's apps on another non-BlackBerry device would result in a similar experience? Either way happy with the results so far.\nThe top bezel is minimal and actually pretty small when compared to my GS7/GS7 Edge, Lumia 830/650/950. Think our LG G4 is the overall winner here though although only by a slim margin. Obviously in today's world of bezel-less designs it will be considered large though.The bottom bezel IS the stickler for many and I'll admit it is hard to ignore when first took possession. Growing on me now with it no longer being a focal point so that was short-lived.", "time": "11-18-2017 03:00 PM", "replies": []}, {"postID": "post6075919", "text": "The more I use the Motion the more impressed I become. Definitely oriented towards business and productivity (if one relies on BB's setup). In the short-term I've owned/used the Motion it feels like I can achieve more while doing less, if that makes any sense. Wonder if installing some of BB's apps on another non-BlackBerry device would result in a similar experience? Either way happy with the results so far.\nThe top bezel is minimal and actually pretty small when compared to my GS7/GS7 Edge, Lumia 830/650/950. Think our LG G4 is the overall winner here though although only by a slim margin. Obviously in today's world of bezel-less designs it will be considered large though.The bottom bezel IS the stickler for many and I'll admit it is hard to ignore when first took possession. Growing on me now with it no longer being a focal point so that was short-lived.", "time": "11-18-2017 03:00 PM", "replies": []}]}, {"postID": "post6105958", "text": "I really like the look of this phone!", "time": "12-13-2017 02:42 PM", "replies": []}]}, {"title": "Places You Can Buy A Blackberry Motion!", "thread": [{"postID": "post6039292", "text": "There is a new Blackberry in the wild! Wahoo \nI'm sure many are wondering where exactly you can get your hands on one. For now, its only available in select areas but as time goes by, more and more retailers will start offering it.  Im really hoping to get one (or even win one!) but not sure if its coming to South Africa though. Crossing fingers.Canada:pdaplaza - $599 CADGermany:Saturn - €469 Incl. VAT.Mediamarkt - €469 Incl. VATUAEAxiom Telecom - 1,699 AEDUKClove - £399.00 inc. VATCarphone Warehouse - £399 Belsimpel - €469\nNeed A Case? There are some available of those two!IncipioDualPro Incipio Case - $29.99CARNABY ESQUIRE Incipio Case - $34.99", "time": "10-26-2017 03:55 AM", "replies": []}, {"postID": "post6040780", "text": "also available in pdaplaza.com in Canada. Price is listed at $599 and it's listed as being in stock by the end of October.", "time": "10-27-2017 12:39 AM", "replies": [{"postID": "post6040891", "text": "Awesome, Thanks for the heads up. Ill add it to the list", "time": "10-27-2017 04:20 AM", "replies": []}]}, {"postID": "post6069009", "text": "Awesome, there's a Canadian place to buy it! Would be weird if there wasn't though! Lool.", "time": "11-14-2017 08:46 AM", "replies": []}]}, {"title": "Where are the review videos?", "thread": [{"postID": "post6042531", "text": "I want to see how this phone performs. Barely anything on it yet.", "time": "10-28-2017 06:48 AM", "replies": []}, {"postID": "post6054347", "text": "I would have expected more by now too. Guessing since it's not an iPhone, Samsung, Pixel and so on it doesn't warrant a review. Or the fact its specs are somewhat dated and mirror (for the most) that of the KEYone no one is really interested.\nEither way think I'm getting one, power user I'm not so should cover all the bases for my needs - and has a headphone jack, might make it worth something down the road LOL.", "time": "11-04-2017 09:35 PM", "replies": []}, {"postID": "post6063535", "text": "As of today, there are a whole swarm of unboxing videos 😃 I guess today was \"Launch day\" for the land of YouTube. \nLook for a YouTube called \"SuperSaf TV\" he did quite a nice job. even showed of the secure photo locker & Privacy Shade. I'm sure many more will come soon. \nMaybe even a launch date for the USA.", "time": "11-10-2017 01:35 PM", "replies": [{"postID": "post6069008", "text": "Thank you for that information!  This phone looks awesome!", "time": "11-14-2017 08:46 AM", "replies": []}]}]}, {"title": "Blackberry Motion First Look Video", "thread": [{"postID": "post6018577", "text": "I'm really liking what I see.", "time": "10-13-2017 08:52 PM", "replies": []}, {"postID": "post6020881", "text": "Thanks for posting! Hopefully we get a couple more videos in the next few days and weeks. \nI kinda wish they did a little more explaining in the video. I know it was probably just a 'sneak peak' but still. For example, they were showing of 'Privacy Shade' but never said anything about it. \nHopefully in the next video we can see some water usage and maybe unlocking with the finger print scanner. 😃", "time": "10-15-2017 02:44 PM", "replies": [{"postID": "post6026811", "text": "Request was answered! Another video was posted. Have a look at 0:33 or around there. Blackberry Mobile was a little sneaky. Making references to BB10 devices", "time": "10-19-2017 03:28 AM", "replies": []}, {"postID": "post6029677", "text": "It is funny you got half of what you were looking for.", "time": "10-20-2017 04:04 PM", "replies": []}]}, {"postID": "post6029866", "text": "This is really tempting me. £399 at Carphone Warehouse! Great price.\nI love BlackBerry's thoughtful software additions to Android and the security is second to none.\nHow do you guys think this phone will perform speed wise? Like the KEYone?", "time": "10-20-2017 06:02 PM", "replies": []}]}, {"title": "Blackberry Motion Model Variants", "thread": [{"postID": "post6010300", "text": "This is not a final list and will be updated as we get closer to the official launch. For now, there is no mention of a CDMA version but hopefully there will be just so everyone has the ability to get one. Just gives a nice idea of what variants might be released. As for where the phone works, consult the band list and which networks you want to use it on before going with where the phone works best; you might find a model not intended for your carrier just happens to have perfect band support, although ancillary services like WiFi calling are not guaranteed.\nThe list:\nBBD100-1\nLTE: 1 / 2 / 3 / 4 / 5 / 7 / 8 / 12 / 13 / 17 / 19 / 20 / 26 / 28 / 32 / 38 / 39 / 40 / 41\nUMTS: 1 / 2 / 4 / 5 / 6 / 8\nGSM: 850 / 900 / 1800 / 1900\nCDMA: none\nWhere it works best: International GSM (South America, Asia, Europe, Africa, Oceania)\nBBD100-2\nLTE: 1 / 2 / 3 / 4 / 5 / 7 / 8 / 12 / 13 / 17 / 20 / 28 / 29 / 30 / 38 / 39 / 40 / 41 / 66\nUMTS: 1 / 2 / 4 / 5 / 6 / 8\nGSM: 850 / 900 / 1800 / 1900\nCDMA: none\nWhere it works best: Canada, United States GSM (AT&T/T-Mobile/etc.)Unknown: \nBBD100-3\nBBD100-6\nThanks @thuraskOriginal Post Here <---", "time": "10-08-2017 02:08 AM", "replies": []}, {"postID": "post6011470", "text": "The -6 is the dual SIM version of the -1.", "time": "10-08-2017 08:57 PM", "replies": []}, {"postID": "post6014366", "text": "Thank you for this!", "time": "10-10-2017 07:46 PM", "replies": []}, {"postID": "post6022836", "text": "Maybe it will get the T-Mobile 600 band", "time": "10-16-2017 07:41 PM", "replies": [{"postID": "post6026603", "text": "None of them have 71 listed, so probably not.", "time": "10-18-2017 10:28 PM", "replies": []}]}]}, {"title": "Blackberry Motion - It's picture time!", "thread": [{"postID": "post6010743", "text": "Hey Everyone, \nHere are a couple photos I've seen from around the inter-webs. Looks like a pretty awesome device  We should be seeing a lot more information in the next couple days. Big thanks to CrackberryKevin for the awesome shots!", "time": "10-08-2017 10:43 AM", "replies": []}, {"postID": "post6010781", "text": "wow.", "time": "10-08-2017 11:07 AM", "replies": []}, {"postID": "post6011458", "text": "I wish it had Wireless charging, but other than that, it looks good", "time": "10-08-2017 08:47 PM", "replies": [{"postID": "post6015087", "text": "That would have been nice. It's one of the reasons I bought my Priv. It's one of the few Blackberry devices that support it. \nHopefully going forward we can see some QI charging devices. I have high hopes for the Blackberry \"Juno\" early next year. 😃 crossing fingers.", "time": "10-11-2017 09:50 AM", "replies": [{"postID": "post6015658", "text": "Wow - another one coming out! Can't wait!", "time": "10-11-2017 05:27 PM", "replies": []}]}]}, {"postID": "post6012505", "text": "How about a picture CBK of a S8 or other New slab phone and Motion on top of it to see the size difference since we know you hae the Motion already", "time": "10-09-2017 03:22 PM", "replies": []}, {"postID": "post6014364", "text": "I'm in love with this phone! And I like the home button.  Do we know how big the phone is? It looks like a 5.2\"-ish device.", "time": "10-10-2017 07:45 PM", "replies": []}, {"postID": "post6014418", "text": "I thought it was 5.5", "time": "10-10-2017 08:27 PM", "replies": [{"postID": "post6014466", "text": "5.5\" is awesome!", "time": "10-10-2017 09:18 PM", "replies": []}]}]}]
