[{"title": "How to unlock oem of Lenovo S60-a?", "thread": [{"postID": "post6177891", "text": "I have been trying to unlock the oem of my lenovo S60-a... but i'm not able to find 《unlock oem》 option in ●develeper options●... what shall i do??\nAnd also the phone was updated from kitkat to lollipop....", "time": "03-03-2018 11:42 AM", "replies": []}]}, {"title": "How to turn on front flash to use face unlock in the dark", "thread": [{"postID": "post6166203", "text": "I am looking for way so that I can quickly turn on front flash so that I can unlock the phone using face-unlock in the dark. I unlocked the inbuilt android face-lock option using AutoInput app, it works good, but I want it to work in the dark or low light too. I have seen apps that can turn on rear flash using power button, so is there a similar thing for front flash?\nI have a Lenovo K8 Note", "time": "02-19-2018 01:40 AM", "replies": []}, {"postID": "post6166785", "text": "There are apps that will turn the front flash on - but from the screen, not from the buttons.", "time": "02-19-2018 04:20 PM", "replies": []}]}, {"title": "Why Lenovo Vibe K5 Note not rooting in Marshmallow??", "thread": [{"postID": "post6155587", "text": "I tried all the methods to root an Android phone but it always fails on Lenovo Vibe K5 Note.\nAnyone who has its solutions please comment.", "time": "02-06-2018 01:52 AM", "replies": []}]}, {"title": "Almost nothing is working.", "thread": [{"postID": "post6130817", "text": "I can't install my apps through the play store, I can't use the home and options buttons and I can only use the return button. When I set the lock screen to swipe it goes directly to the main screen, skipping the swipe. Using a Lenovo Vibe K5. It suddenly happened when I was charging my phone.", "time": "01-08-2018 08:23 PM", "replies": []}, {"postID": "post6131387", "text": "Welcome to Android Central! Moved from the Marshmallow forum to the Lenovo Android Phones forum, since this is likely a device-specific issue, not a general Marshmallow issue.\nDo the problems persist in Safe Mode? How to turn on safe mode on Lenovo Vibe K5 Plus", "time": "01-09-2018 11:54 AM", "replies": []}, {"postID": "post6134373", "text": "Yes. The problems persist.", "time": "01-12-2018 09:55 AM", "replies": []}, {"postID": "post6134496", "text": "Since it's still happening in Safe Mode, that suggests a problem with either the firmware or hardware. You could try a factory reset, but if the problem persists after that, then you'd have to try reinstalling the firmware (not sure how difficult that is on a Lenovo -- try searching the forums at XDA-developers.com, which is a good resource for that kind of thing) or bringing it to a repair shop.", "time": "01-12-2018 12:02 PM", "replies": []}]}, {"title": "battery \"keep awake\" after charging", "thread": [{"postID": "post6052243", "text": "Hi, Whenever i charge my P2 and after removing charger i see KEEP AWAKE as solid bar. upon using adb shell commands and GSM battery app, it is \"Kernel Wake lock smb1351\" which keeps my phone awake. if i reboot my phone, \"KEEP awake\" will not be there until i charge my P2 again.\nso whenever i charge my phone and after removing charger i get KEEP AWAKE which is really frustrating.\nanyone has any idea about this? and how to resolve this?", "time": "11-03-2017 01:19 PM", "replies": []}, {"postID": "post6052294", "text": "What do you mean by ‘P2’?", "time": "11-03-2017 01:58 PM", "replies": []}, {"postID": "post6056652", "text": "its lenovo p2.", "time": "11-06-2017 11:41 AM", "replies": []}, {"postID": "post6056670", "text": "Okay. Moved to the Lenovo forum.\nWelcome as a new member.", "time": "11-06-2017 11:54 AM", "replies": []}, {"postID": "post6086459", "text": "Thanks. Did you move my question to Lenovo forum or you want me to do that?\ncan you please send me the link for lenovo forum?", "time": "11-27-2017 09:32 AM", "replies": []}, {"postID": "post6086681", "text": "I did indeed move it. \nI’ll PM the forum link to you.", "time": "11-27-2017 12:08 PM", "replies": []}]}, {"title": "Unable to flash lenovo a3300 custom ROMs on lenovo a3000 using twrp.", "thread": [{"postID": "post6084006", "text": "Hi I am Rupesh from India and I have lenovo a 3000 H tab and due to various reasons like viruses i have flashed stock rom with Android version 4.4.2 and build number: A3000H_A442_V3.0.0 and also with twrp recovery manager.\nI want to install cyanogenMod on my tablet and so I visited XDA forums related to Lenovo a3000H and downloaded custom ROMS related to A3300 they are \n1) [ROM][6.0.1] Resurrection Remix v5.7.4 for A3300\n2) [ROM][UNOFFICIAL][MARSHMALLOW][Lenovo A3300]CM13 for A3300\n3) [ROM][GUIDE][A3300-H/HV] Cyanogen Mod 12.1 Android 5.1.1 Lenovo Tablet\nIn twrp recovery manager I tried to flash the above ROMS using install zip option by selecting the ROMS which are stored in external memory card of my device. Before flashing the above ROMS I have done factory reset, erased cache, DATA, System partitions in twrp recovery manager. For the above mentioned three ROMS I am getting errors such as \n1) zip verification failed\n2) no data present in zip file\n3) MD5 mismatch etc…\nUpon getting the above errors I have re downloaded the above mentioned ROMS and tried to flash but even no use I mean I am getting same errors.\nBefore flashing the above mentioned ROMS I have made full system backup in twrp recovery manager to external sd card. As the system is not even unable to boot after the above failures I have made restore in twrp recovery manager.\nI have tried to download the custom ROM related to A3000H but failed I mean failed to download the ROM from its download page. The ROM I tried to download from XDA forum is\n[ROM][4.4.4] CyanogenMod 11.0 for A3000-H [23/10/2015]\nActually I want to use my tablet mainly to read ebooks and rarely to browse internet.Currently my tablet is not working properly so please suggest how to flash ROM called [ROM][4.4.4] CyanogenMod 11.0 for A3000-H [23/10/2015] and if not possible try to suggest how to flash custom ROM related to A3300. If none of the ROMS specified in XDA forum is not suitable for my tablet then please try to suggest any other custom ROM which is suitable to my tablet.\nRegards,\nRupesh.", "time": "11-25-2017 07:19 AM", "replies": []}]}, {"title": "Lenovo Phab 2 is automatically switching on Mobile Data", "thread": [{"postID": "post5930729", "text": "I am facing an issue with PB2-650M on Android 6.0 Kernel 3.18.19+.\nWhen on wifi, it just automatically switches on the mobile data when wifi is out of range or even when the device sleeps. I am not 100% sure, what triggers it. But I see that the \"Data Connection\" icon from the pull down menu is active. The only alert I see is the dialog box seen below. \nI want an option to ALWAYS disable mobile data. This device is used by my mom and she keeps accidentally touching the screen and only realizes when the credit in the phone runs out. The provider also has no option to disable data usage on the number.\nThis reminds me of the wifi assist feature in iphone which can be easily disabled.", "time": "08-21-2017 11:39 AM", "replies": []}, {"postID": "post5930808", "text": "Welcome to Android Central. There is a setting that turns on mobile data if wifi signal gets below a cutoff. I would look for that, but you should be able to turn mobile data off in Settings, Network (may be different on your device).", "time": "08-21-2017 01:22 PM", "replies": []}]}, {"title": "Phab 2 Pro replacements", "thread": [{"postID": "post5911132", "text": "Deleted", "time": "08-03-2017 03:35 PM", "replies": []}]}, {"title": "Save photos to SD Card", "thread": [{"postID": "post5861737", "text": "Hi,\nI'm using Lenovo Vibe C2 and I need help how to save photos to portable SD Card. I know I can manually move that (I do that every week), but is there a way to automatically save them to SD Card? I don't see a option for that in Camera settings, and I know it's possible since I can do it, but it's annoying to move photos after taking them.\nI would like help asap", "time": "06-24-2017 05:40 AM", "replies": []}, {"postID": "post5861775", "text": "Without fail, whenever I have done that in the past (configure the camera app to save photos directly to an SD card), I have inevitably had some really important photos be corrupted. Like this one, of my wife and son greeting each other at the airport upon his return from a tour of duty in Afghanistan:\nSo, seriously, I do not recommend this.", "time": "06-24-2017 06:30 AM", "replies": []}]}, {"title": "Nougat Update", "thread": [{"postID": "post5707786", "text": "Hello guys\nI just wanted to know whether Lenovo will be updating the Lenovo K6 Power to Android Nougat? :/", "time": "03-10-2017 02:39 PM", "replies": []}, {"postID": "post5707910", "text": "the processor (snapdragon 430) supports nougat but it depends on lenovo intentions, it's not confirmed whether it'll get updated or not.", "time": "03-10-2017 04:27 PM", "replies": []}, {"postID": "post5708145", "text": "Is this device eligible for receiving Google Assistant?", "time": "03-10-2017 09:42 PM", "replies": []}, {"postID": "post5820685", "text": "Yes..", "time": "05-19-2017 03:12 AM", "replies": []}]}, {"title": "My K3 Note refuses to charge when in ON condition. Is there any solution?", "thread": [{"postID": "post5791755", "text": "My K3 Note refuses to charge when in ON condition but gladly obliges in switched OFF condition. The same thing happens when I connect my phone to the PC through USB cable for charging. I am using the original supplied Lenovo Adapter for charging. I tried a Nokia charger too but the problem persists. Went ahead and did a Factory Reset but the condition remained unaltered. Also tried to check my phone's charging problem with another fresh battery from my colleague's new K3 Note. No success there either. My software version is up to date. is there anything else which I may have missed trying? I am stranded as I have to moderate usage so that my phone battery lasts for the day. There has been times when I had to switch off my phone for charging during my working hours. Very embarassing when some important calls are missed during my phone's siesta. Is there a solution coming???", "time": "04-29-2017 10:06 AM", "replies": []}]}, {"title": "demi mode get out", "thread": [{"postID": "post5721352", "text": "My device is lenovo \nTrapped in demo mode give me solution \nPllllllllllllllllllllllllleeeeerrrrreeeeeeeeeeeeeaaaaaaaaaaassssssssssssseeeeeeeeeeeee any body I have urgent plzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzz\nIcant take my phone it makes me mad so plzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzzz any body help me get out of this crazy mode demo", "time": "03-22-2017 12:41 PM", "replies": []}]}, {"title": "[K80m, P90] App Permissions", "thread": [{"postID": "post5717165", "text": "Hello everybody! I bought my mom a K80m sometime ago and just yesterday she noticed that she couldn't send voice messages via WhatsApp. Turns out it says WhatsApp can't acces the microphone. I tried deleting the cache and data, updating Whatsapp, reinstalling it, nothing. I went to app permissions and it has everything enabled. Then I went to Facebook and tried to post directly from the camera. Nothing, I toched the icon but nothing would happen, not even an error. It seems that app can't access the phone's hardware, or that the apps don't have permssions enabled, but they do. Any thoughts? Thanks!", "time": "03-19-2017 10:14 AM", "replies": []}, {"postID": "post5717305", "text": "Welcome to Android Central! Some other app may be accessing the camera/microphone. Do you have a flashlight app installed? These are a common culprit.", "time": "03-19-2017 12:35 PM", "replies": []}, {"postID": "post5717365", "text": "Hi! thanks for the welcome! Unfortunately no, I don't have any flashlight or really too many apps installed. I even reseted all the app permissions to see if I could solve the problem but no luck there. It can't even make WhatsApp calls because it's not allowed to use the camera or microphone. I don't know what else to do!", "time": "03-19-2017 01:10 PM", "replies": []}, {"postID": "post5717562", "text": "Did you already try wiping the system cache partition? How to Enter Lenovo P90 Recovery Mode", "time": "03-19-2017 04:24 PM", "replies": []}, {"postID": "post5719107", "text": "I didn't, but I did factory restore it and when an app needed permissions for the first time now it asked me for them. Guess the factory reset was a more radical solution, but hey, it works for now. Thank you very much B. Diddy", "time": "03-20-2017 08:45 PM", "replies": []}]}, {"title": "[A6000] Dialer problem", "thread": [{"postID": "post5710338", "text": "Hi, i have lenovo A6000 plus recently i have started to experience issues with my dialer. If i enter the numbers and press dial button (sim 1 or sim 2), the call page opens and closes immediately and if i press the dial button again it is showing some random contact numbers and dial using sim 1 or 2 buttons are becoming navigation buttons (which we use to move up or down). Factory resetting helps only for a day or two and then the same problem comes again. \nI have the latest software installed on my phone", "time": "03-12-2017 11:31 PM", "replies": []}, {"postID": "post5710356", "text": "Welcome to Android Central! Moved to the Lenovo forum.\nDoes this happen in Safe Mode as well? How to turn on safe mode on Lenovo A6000", "time": "03-13-2017 12:17 AM", "replies": []}]}, {"title": "Rambling review of the Lenovo Phab 2...", "thread": [{"postID": "post5686746", "text": "Realizing Lenovo Phabs are niche and wouldn't attract a lot of Androidians based on size and less than favorable reviews elswhere, I decided to check into the large phone models anyway.\nI had been looking for a small LTE capable tablet that might fit into my wants/needs. \nMost devices dedicated as tablets I find are painful and uncomfortable to hold.\nI thought one handing a device under the 7-8 inch range would fit the bill much better for me. \nThis device is proving to be the answer.\nKeeping 2 things in mind:\nThe Phab 2 is very large for a phone (screen@ 6.4 inches).\nI paid $169.00 for it on sale from B&H Photo.\nAlso I'm unsure yet I don't believe the PB2 or it's counterparts will ever see Nougat from Lenovo.\nWith a Mediatek MT8735 processor@ 1.3 ghz and 3GB of LPDDR3 ram this device doesn't seem like it should be lighting any fires on screen obviously.\nAs far as backup device function the PB2 is attractive for my use with it's dual SIMs and 32GB of internal storage.\nIn addition for me it wins as a connected media consumption device also.\nThe size does make for ungainly handling in certain instances such as using as a camera in any form.\nHumans the size of the Hulk may enjoy this as a pocket friendly phone. \nFor most a 7 inch tall phone could be a real chore to have with you all day.\nUsing this as a phone is a no go for this user as this looks like the phone King Kong would use for calls.\nHuge isn't all bad however.\nThe PB2 is very good as an armchair device or while laying back to catch up before dozing off.\nThe low res screen at 720p to me is still sharp enough for reading or just about anything that renders well while browsing.\nYouTube's, HD video and streaming content are all pleasing from what I've seen.\nAudio is fine especially with Dolby Atmos built in.\nWatching Netflix or any other content using the speaker I find to be pleasing since the sound from the single speaker is full without much distortion.\nThe display does fall short in certain areas such as HD icons or some digital elements on screen that demand a high pixel count.\nThe Phab 2 is performing very well for me on T-Mobile data and Wi-Fi.\nStays connected and usually shows good signal strength in a few areas I've had problems with using other phones.\nI don't use this as a phone yet I find call quality acceptable the few times I've talked on it.\nThe front camera on this thing can go from unusable to not bad.\nLow light of course is the enemy of any smartphone camera.\nUsing the rear camera is a crap shoot.\nPics are anything from dismal to surprisingly good.\nAgain available light is probably the culprit.\nI've abandoned the Lenovo camera for Snap Camera (paid)\nSo far Snap has proven the camera is capable of a moderately improved pic taking experience.\nWhen it comes to features or performance of this thing which of course are crucial, I would say it's not so much the affordability or acceptable hardware that centers this phone correctly for users like myself...it's the size.\nLeft to right;\nLumia 925\nZTE Axon 7\nLenovo Phab 2", "time": "02-22-2017 01:44 AM", "replies": []}, {"postID": "post5686880", "text": "Thoughtful Review!", "time": "02-22-2017 06:27 AM", "replies": []}, {"postID": "post5689061", "text": "@kct1975\nThanx!\nLiking this device quite a bit", "time": "02-23-2017 08:21 PM", "replies": []}, {"postID": "post5690228", "text": "I purchased the Phab 2 Pro variant and really like it. Just wish there were more case options for it.", "time": "02-24-2017 07:45 PM", "replies": [{"postID": "post5690379", "text": "How is the the camera pic quality with your Pro version?\nI like the the PB2 so much I wouldn't mind advancing to the Phab 2 Pro myself.", "time": "02-24-2017 11:00 PM", "replies": [{"postID": "post5691263", "text": "I'm not big on pictures so I might not be the best one to answer this. To me the camera is ok, not so good in low light.", "time": "02-25-2017 08:23 PM", "replies": []}]}]}, {"postID": "post5690305", "text": "@ROE_HUNTER\nSame here with the regular Phab.\nBought 2 crappy cases that are less than pleasing to use.", "time": "02-24-2017 09:25 PM", "replies": []}, {"postID": "post5691281", "text": "@ROE_HUNTER \nThanks...much appreciated.", "time": "02-25-2017 08:42 PM", "replies": []}, {"postID": "post5698278", "text": "I purchased this more out of curiosity and I only paid $159+tax. I set the phone up and played some music through it and noticed sound only seems to be coming from the right speaker. Are there actually two speakers on the bottom? There are two speaker grills, but sound only seems to come out of the right speaker, not the left. When you listen to audio in general, cover up the right speaker with your thumb and let me know if there is sound coming out of the left speaker. Tech Support said my phone was defective and is shipping me another one. I read somewhere else that there may in fact be only one speaker. I talked to three separate people at Lenovo and none of them ever indicated there was only one active speaker. Each person indicated 'both should work'.", "time": "03-03-2017 02:44 PM", "replies": [{"postID": "post5699635", "text": "Yep, only one speaker, but I can say that one speaker sounds better than my Nexus 6 or Moto X Pure ever did. I have the Phab\n2 Pro", "time": "03-04-2017 10:23 PM", "replies": []}]}, {"postID": "post5698290", "text": "It's true the Phab 2 has one speaker on the right bottom.", "time": "03-03-2017 03:03 PM", "replies": []}]}, {"title": "Phab 2 3gb $169.99", "thread": [{"postID": "post5669943", "text": "Lenovo is selling this weird beast for $169.99...http://shop.lenovo.com/us/en/smartph...-series/phab2/\nNo idea how long the deal will last.\nI just grabbed one from Amazon for $199.99 and the day after I buy the price dumps.\nMaybe the prices will go lower.", "time": "02-06-2017 09:25 PM", "replies": [{"postID": "post5670962", "text": "I purchased the Phab 2 Pro a month ago. I love it. Awesome phone.", "time": "02-07-2017 08:20 PM", "replies": [{"postID": "post5670983", "text": "It is a pretty cool phone for my uncomplicated needs.\nI shopped and shopped until stumbling across this.\nFit perfectly for what I wanted it for.", "time": "02-07-2017 08:53 PM", "replies": []}]}]}, {"postID": "post5671126", "text": "Update:https://www.bhphotovideo.com/c/produ...cUvbUpU5671126\nNow $169.99 from b&H photo.\nPre-order no tax (outside NY) and free shipping.\nSecond update:\nAmazon US has also lowered the price to $169.99 USD\nUpdate again:\nPhab 2 deal is gone.\nB&H is back to 199 USD.\nStill waiting for mine bought at 169 USD on pre-order.\nCome on B&H Lol ...", "time": "02-08-2017 01:35 AM", "replies": []}, {"postID": "post5698300", "text": "Get it now for $159.00 http://shop.lenovo.com/us/en/smartph...bv0as6&irgwc=1\nwith coupon code PHABPHONE20", "time": "03-03-2017 03:09 PM", "replies": []}]}, {"title": "Opinions on the Lenovo Phab2 Pro", "thread": [{"postID": "post5674882", "text": "I think the size was big & well-fitting for the Google Tango technology. Perhaps a metaphor for big things to come?\nBattery was alright, but the software didn’t seem very stable. Kinda strange considering how good I've heard their Motorola software is.\nMy only main gripe aside from software is how Lenovo is selling it for $500. They'd either have to lower the price in order to get me on board, or someone would have to give one to me.\nWhat are your thoughts and opinions?", "time": "02-11-2017 03:19 PM", "replies": [{"postID": "post5678249", "text": "I have the Phab 2 Pro. I love the size, came from the Nexus 6 and I knew I wanted a larger phone. The screen is not AMOLED, but it is a very nice LCD. A lot easier to see outside than the Nexus. The battery lasts quite awhile for me. I did not buy this phone for Tango so I have only even tried one app for a few minutes. I can say this phone is definitely faster than the Nexus and every other phone I've had(Nexus 6, Moto X Pure, HTC One M8, Galaxy S3, Iphone 4). Rapid charge works great and it works with the rapid chargers I had for the Moto X Pure. Pics are OK, nothing special. I am not a big photo enthusiast so it's fine. The speaker sounds very good to me. The Dolby Atmos brings it alive. Oh! And this is the first phone I have had with a fingerprint scanner. I used to think \"Why do I need a fingerprint scanner???\" But now that I've had one I absolutely love it and it works flawlessly on this phone. \nA few things concern me. \n1. Audio Lag, when watching Youtube videos there is a definite audio lag. Netflix sometimes has a little lag and then sometimes its fine. I don't use my phone to watch videos that often so it hasn't bothered me as much as it probably should. Have only seen 2 others on the Lenovo forums with the same problem, no fix yet. If you turn off Dolby Atmos it gets better and sometimes fixes it for a bit. I have yet to try a factory reset, but others have with no Joy. I have not experienced any lag in games. \n2. Cases, there is a lack of cases for this phone. Basically there are 2 choices, a real thin TPU case that doesn't even have a lip to protect the screen and then a folding style case. I have the folding style case so at least there is some protection for the screen. \n3. Updates, I fear that updates will be few and far between for this phone. I will be amazed if it gets Nougat. Marshmallow runs very well on it. I have a had a couple of hiccups with different apps, but no more than any other phone. \nI am glad I purchased this phone. I love the big screen.", "time": "02-14-2017 05:02 PM", "replies": [{"postID": "post5678548", "text": "The problem i see is that most of it is \"nothing special\". When you take out Tango, it's just average in a lot of departments. Don't get me wrong, it sounds great and I'd buy one myself. But 500 dollars for something like that isn't enticing enough for me to buy it with my own money.\nThough, had I gotten a Phab2 Pro one way or the other, I'd probably love it. Huge 6.4 screen and 4000+ battery is an instant attraction for me. Just don't like that price tag due to a lot of it being \"nothing special\", yknow? Someone would either have to gift it to me or make that $500 price way lower.\nIn short, I love it but not enough to spend 500.", "time": "02-14-2017 10:41 PM", "replies": []}]}]}]}, {"title": "how to downgrade my lenovo A5000 from lollipop to kitkat?", "thread": [{"postID": "post5669200", "text": "Is there any way to return to kitkat officially without rooting....? I hate lollipop.... And I has just read a way to do it with Samsung \n..please tell me there is a way....", "time": "02-06-2017 09:30 AM", "replies": [{"postID": "post5669223", "text": "Factory reset?", "time": "02-06-2017 10:03 AM", "replies": []}]}, {"postID": "post5676901", "text": "Unfortunately it kept the lollipop....", "time": "02-13-2017 12:27 PM", "replies": []}]}, {"title": "Wifi in lenovo vibe k5 note", "thread": [{"postID": "post5452655", "text": "I'm trying to figure out how to get my lenovo k5 note to automatically connect to my wifi when I get home. I've noticed that it wont try connecting until I turn the screen on. If I'm not careful to flash the screen on briefly when I get home, my phone will stay on the cell network.\nKeep Wi-Fi on during sleep: Always\nBattery Saver: off\nIs there another setting that I'm missing? Is it even possible to get my phone to automatically connect to a wifi network without turning the screen on?", "time": "09-28-2016 03:14 PM", "replies": []}, {"postID": "post5454339", "text": "What other options are there in the Advanced Wi-fi menu? Is there any kind of \"Smart\" option? (Good rule of thumb--anything from a manufacturer or carrier that is called \"Smart\" is typically not.)\nSee if this happens in Safe Mode as well: How to turn on safe mode on Lenovo K5 Note", "time": "09-29-2016 12:22 PM", "replies": []}, {"postID": "post5662621", "text": "Hi Karimla,\nNormally, Mobile data should be turned off automatically by the system when WiFi is connected. If you're sure it's mobile data which is on, you could try some automation tools to handle this, e.g. Tasker (Condition: WiFi connected, Task: mobile data off).\nThanks", "time": "01-31-2017 03:43 AM", "replies": []}]}, {"title": "Lenovo zuk", "thread": [{"postID": "post5659438", "text": "Auto call recordings", "time": "01-28-2017 05:01 AM", "replies": []}, {"postID": "post5659440", "text": "what do you want?", "time": "01-28-2017 05:11 AM", "replies": []}]}, {"title": "Vibe K5 2 4G chips", "thread": [{"postID": "post5615065", "text": "My Vibe K5 shows 2 chips as 4G & 2G. It has to show both as 4G. Does version 5.1.1 support 2 4G chips? Or may it be a company problem?\nMario.\nThanks", "time": "12-20-2016 01:09 PM", "replies": []}, {"postID": "post5616890", "text": "Welcome to Android Central! Sorry, can you clarify what the issue is? Are you saying that you have a dual SIM phone, and that one SIM card shows up as on the 4G network, but the other one is only getting 2G? If so, I believe that is normal. https://forums.lenovo.com/t5/K-and-V...s/td-p/3343000", "time": "12-21-2016 11:05 PM", "replies": []}, {"postID": "post5635412", "text": "Only SIM1 supports 4G. SIM2 can only use 2G network. Can personally confirm with K5 Plus here in Vietnam.", "time": "01-08-2017 12:16 AM", "replies": []}]}, {"title": "Phab 2 Plus", "thread": [{"postID": "post5630450", "text": "Is the Phab 2 Plus going to have an USA release?", "time": "01-03-2017 07:00 PM", "replies": []}]}, {"title": "Lenovo Tab 3 Charging Screen Shows Wrong Time", "thread": [{"postID": "post5598659", "text": "My Lenovo Tab 3 has always shown the wrong time on the charging screen and to date, I've never been able to fix the problem. \nMy Tab is currently on Android 5.0.1\nHas anyone been able to solve this problem?", "time": "12-08-2016 09:54 AM", "replies": []}, {"postID": "post5598815", "text": "Moved to the Lenovo Tab 3 forum.\nThe date and time are correct in the status bar, though? Is this the stock lockscreen/charging screen, or could it be a 3rd party one?", "time": "12-08-2016 11:31 AM", "replies": []}]}, {"title": "need help.....", "thread": [{"postID": "post5568906", "text": "I have bought a rooted Lenovo K3 Note.Yesterday,I accidentally deleted my OS.\nI am stuck on boot animation.\nI still have Stock recovery but I can't put my phone into USB debug mode in order to flash factory image.\nIs it posseble to reinstall OS from service centre And \nHow much it would cost? plz.. HELP!", "time": "11-18-2016 11:57 AM", "replies": []}, {"postID": "post5569295", "text": "Since you have no means of downloading anything to the phone (it's hardware, but you probably deleted all the firmware), you're probably going to need a JTAG service to feed the ROM back into it. Look on eBay for lenovo k3 jtag service. The cost can range from $25 to $150, depending on how greedy and how good the service is. (High price isn't an indicator of experience, nor is it an indicator of greed.)", "time": "11-18-2016 03:56 PM", "replies": []}]}, {"title": "Phab 2 Pro sold out on Lonovo Site", "thread": [{"postID": "post5567643", "text": "I ordered the Phab 2 Pro from the Lenovo website last week but the ship date got bumped up to Nov. 23. Early this week the Phab 2 Pro disappeared from the Lenovo website. It was back briefly earlier today with a ship estimate of \"More than five weeks.\" This afternoon there is a \"Sold Out\" graphic on the Phab 2 Pro Lenovo order page. Loews website is showing unavailable for shipping or in store pickup. On a positive note, the case for the Phab 2 Pro is up on the Lenovo site for $15.\nSeems like they didn't make too many Phab 2 Pros.", "time": "11-17-2016 04:17 PM", "replies": []}, {"postID": "post5568881", "text": "Update: It's back now showing shipping in three weeks. I guess they are just having problems keeping track of their stock and production.", "time": "11-18-2016 11:39 AM", "replies": []}]}, {"title": "Lenovo Vibe Shot Z90-7", "thread": [{"postID": "post5446605", "text": "I know this is a phone for the Asian market, anyone using this in USA/Canada? Looks like the device will connect with 2600 MHz in North America. Want to see if anyone has one over on this side of the pond and how is LTE connection on the one band. It's a stylish phone, hard to find a case for it. Expansys is selling this device, but if it can't connect to LTE (Canada) then this is pretty much a 3g device. Anyone? Thanks.", "time": "09-25-2016 07:05 PM", "replies": []}]}, {"title": "Will the PHAB 2 Pro be coming to Sprint?", "thread": [{"postID": "post5271126", "text": "Any idea if this phone will be compatible with all the networks?\nPosted via the Android Central App", "time": "07-18-2016 02:34 PM", "replies": []}]}, {"title": "Will You Buy One?", "thread": [{"postID": "post5218836", "text": "I don't normally like large phones but this one has changed my thinking about them. The general specs and 6.4\" display make me strongly inclined to buy.", "time": "06-10-2016 03:43 PM", "replies": []}, {"postID": "post5218853", "text": "Thinking about it. Might go for the tablet, though, depending on how well it performs in actual reviews and if it's not too bulky.", "time": "06-10-2016 03:56 PM", "replies": []}, {"postID": "post5219346", "text": "I think I would get it because I can use it for work nearly everyday to take measurements of rooms and also map out rooms in 3D. I just hope I can use it without a phone plan but as an independent device.", "time": "06-10-2016 11:09 PM", "replies": []}]}, {"title": "Lenovo PHAB 2 Pro Tango preview: Consider our minds blown", "thread": [{"postID": "post5217061", "text": "Lenovo PHAB 2 Pro Tango preview: Consider our minds blown | Android Central", "time": "06-09-2016 03:29 PM", "replies": []}, {"postID": "post5218817", "text": "I'm surprised to find myself liking it. The current trend towards large phones at the expense of high-quality small ones is not to everyone's liking, but a 6.4\" device is something else.", "time": "06-10-2016 03:36 PM", "replies": []}]}, {"title": "How big is the Lenovo PHAB 2 Pro screen?", "thread": [{"postID": "post5218745", "text": "(not actual size, but to scale)\nScreen is 3.14\" x 5.58\" with an area of 17.50\". It's a monster!", "time": "06-10-2016 02:52 PM", "replies": []}, {"postID": "post5218804", "text": "My Nexus 7 is almost a hand-holdable device. In comparison, the Phab 2 will be easy.", "time": "06-10-2016 03:28 PM", "replies": []}]}]
[{"title": "How do I restore lost contacts.in Lenovo A7000 please provide good suggestions?", "thread": [{"postID": "post4751268", "text": "Hey everyone, im using lenovo a7000 i lost my contacts from list automatically. i couldn't able to get it. any solutipn for this. how to restore those contacts..please provide good suggestions", "time": "10-15-2015 11:56 AM", "replies": []}, {"postID": "post4751424", "text": "Welcome to Android Central! Do you remember which account those contacts were saved to? If it was your Google account, then they would've automatically synced with your Google Contacts in the cloud, and should be able to sync easily back to the device. If they were saved only to the local Device Account, those don't sync or backup anywhere automatically, so you most likely lost them for good. This is why you should always strongly consider saving all of your contacts to your Google account.", "time": "10-15-2015 12:53 PM", "replies": []}]}, {"title": "How can I fix a wifi connection problem on my Lenovo A 7000?", "thread": [{"postID": "post4742264", "text": "Problem regarding lenovo a 7000 wifi not work", "time": "10-11-2015 08:27 AM", "replies": []}, {"postID": "post4742285", "text": "Welcome. \nCheck this:http://forums.androidcentral.com/amb...-problems.html\nPosted via the Android Central App", "time": "10-11-2015 08:41 AM", "replies": []}]}, {"title": "Why am I getting the error message on my Lenovo lenovo has stopped?", "thread": [{"postID": "post4737039", "text": "why my lenovo mobile apearing on it this proplem lenovo has stopped", "time": "10-08-2015 01:50 PM", "replies": []}]}, {"title": "Why is my Lenovo charging so slow?", "thread": [{"postID": "post4736573", "text": "My Lenovo phone is charging very slow , and is blinking before turning off . Its jumping from 5 to 1 % in minute , and have 5 % after 1 hour of charging .", "time": "10-08-2015 09:44 AM", "replies": []}]}, {"title": "Why won't my Lenovo A6000 show any new updates?", "thread": [{"postID": "post4718909", "text": "Hi, \nMy lenovo a6000-I wont show any new updates in device information, im currently in a6000-I_s012_150515.. at first there was an update showing which is a6000-I_s014_150721.. i tried to download it twice but i always get an error un recovery mode.. and now i cant seem to get the update anymore..", "time": "09-30-2015 09:04 AM", "replies": []}]}, {"title": "Mi telefono movil lenovo s660 MID 66000011 no arranca?", "thread": [{"postID": "post4709945", "text": "Tengo hace 2 semanas un telefono movil lenovo s 660 MID 66000011, Y DE PRONTO SE APAGO Y NO QUIERE PRENDER DE NUEVO .NO ARRANCA.", "time": "09-26-2015 12:40 PM", "replies": []}, {"postID": "post4710302", "text": "I have 2 weeks lenovo s 660 MID mobile phone 66000011, and suddenly went off and NOT WANT TO START EARNING NEW .NO.\n[Google Translate.]\nPosted via the Android Central App", "time": "09-26-2015 04:30 PM", "replies": []}, {"postID": "post4710306", "text": "Hola, siendo un teléfono nuevo yo intentaría cambiarlo puesto que todavía está en garantía. Si no quieres, o puedes, hacer esto podrías intentar usar una batería nueva y ver si así funciona. Has intentado dejarlo cargando por varias horas?", "time": "09-26-2015 04:31 PM", "replies": []}]}, {"title": "Why can't I turn my Lenovo A 536 on?", "thread": [{"postID": "post4707829", "text": "When i was updating my lenovo A536 firmware update it failed.And now the phone is not booting.Help me out....", "time": "09-25-2015 11:33 AM", "replies": []}, {"postID": "post4707945", "text": "Welcome to Android Central! Does the screen come on at all? Was this an official system update pushed over-the-air by your carrier or by Lenovo, or did you install it manually?", "time": "09-25-2015 12:27 PM", "replies": []}]}, {"title": "Why aren't call logs showing in Lenovo A6000plus after Android upgrade?", "thread": [{"postID": "post4697985", "text": "As stated, before upgrade everything looks normal but after upgrade only one or 2contacts logs displayed not all. It's very difficult for me now. Please help me out", "time": "09-21-2015 07:29 AM", "replies": []}]}, {"title": "How can I upgrade my Lenovo A369 from 2.3.6 to 4.2.2 and can I expand the rom and ram?", "thread": [{"postID": "post4692738", "text": "my lenovo a369 were so low version .. I hope you can help me ... tq", "time": "09-18-2015 12:12 PM", "replies": []}]}, {"title": "Restricted access changed, voice service is blocked of Lenovo S90, how can I remedy this?", "thread": [{"postID": "post4682992", "text": "Anyone can help me with this issue. Please..", "time": "09-14-2015 10:55 AM", "replies": []}, {"postID": "post4683236", "text": "Welcome to Android Central! Any idea how that happened? Were you changing any settings, or did you recently install any new apps? Was someone else using your phone? Have you asked your carrier about this?", "time": "09-14-2015 12:29 PM", "replies": []}]}, {"title": "How can I fix a system update issue on my Lenovo A6000?", "thread": [{"postID": "post4680594", "text": "Hey guys....\nI ROOTED my lenovo a6000 with kingroot ,it was successful and king user was installed.\nAfter some days I unrooted it.\nThen I tried to install system update kraft 40>>>>>>it downloads and when I press install the phone restarts and starts installing,but soon it show an error \"status 7\" and installation aborts......\nWhat should I do to fix it,plz help...(now lollypop is available and I wish to install it)", "time": "09-13-2015 06:01 AM", "replies": []}, {"postID": "post4680782", "text": "Welcome to the forums. Can you describe the unroot process?", "time": "09-13-2015 08:53 AM", "replies": []}, {"postID": "post4681839", "text": "Hey guys....\nI ROOTED my lenovo a6000 with kingroot ,it was successful and king user was installed.\nAfter some days I unrooted it.\nThen I tried to install system update kraft 40>>>>>>it downloads and when I press install the phone restarts and starts installing,but soon it show an error \"status 7\" and installation aborts......\nWhat should I do to fix it,plz help...(now lollypop is available and I wish to install it)", "time": "09-13-2015 08:57 PM", "replies": []}]}, {"title": "Lenovo A6000 system update issue, why do I get an error message?", "thread": [{"postID": "post4680594", "text": "Hey guys....\nI ROOTED my lenovo a6000 with kingroot ,it was successful and king user was installed.\nAfter some days I unrooted it.\nThen I tried to install system update kraft 40>>>>>>it downloads and when I press install the phone restarts and starts installing,but soon it show an error \"status 7\" and installation aborts......\nWhat should I do to fix it,plz help...(now lollypop is available and I wish to install it)", "time": "09-13-2015 06:01 AM", "replies": []}, {"postID": "post4680782", "text": "Welcome to the forums. Can you describe the unroot process?", "time": "09-13-2015 08:53 AM", "replies": []}, {"postID": "post4681839", "text": "Hey guys....\nI ROOTED my lenovo a6000 with kingroot ,it was successful and king user was installed.\nAfter some days I unrooted it.\nThen I tried to install system update kraft 40>>>>>>it downloads and when I press install the phone restarts and starts installing,but soon it show an error \"status 7\" and installation aborts......\nWhat should I do to fix it,plz help...(now lollypop is available and I wish to install it)", "time": "09-13-2015 08:57 PM", "replies": []}]}, {"title": "Why can't I use my mobile data and internet services although I have net balance.my phone is Lenovo A319?", "thread": [{"postID": "post4679225", "text": "I have Vodafone services ..can u please help asap", "time": "09-12-2015 10:02 AM", "replies": []}]}, {"title": "My Lenovo A316i Google Play services has stopped, how can I fix it?", "thread": [{"postID": "post4676435", "text": "it affected my play store, viber, and other app games. I can't open it anymore and the google play services has stopped will pop up again. Any ideas? Thanks.", "time": "09-11-2015 03:03 AM", "replies": []}, {"postID": "post4676680", "text": "You could try clearing cache for Play Services in your settings - apps and then reboot your phone.", "time": "09-11-2015 07:08 AM", "replies": []}]}, {"title": "How do I get root access on my Lenovo a6000 upgraded to Android 5.0.2?", "thread": [{"postID": "post4676380", "text": "I have 'minimal adb and fastboot 1.2' also adb setup 1.3, root supersu 2.37 but nothing working", "time": "09-11-2015 01:42 AM", "replies": []}]}, {"title": "I have a Lenovo cell phone. It does not have invert color. Can I download an app?", "thread": [{"postID": "post4673580", "text": "Lenovo A5860 Android bersion 5.1", "time": "09-09-2015 07:10 PM", "replies": []}]}, {"title": "I have contact loss on my Lenovo A 6000 plus..how could I get it back..unfortunately I did not back up them?", "thread": [{"postID": "post4672144", "text": "sir i have check throgh net but got no solution", "time": "09-09-2015 06:52 AM", "replies": []}]}, {"title": "How do I see the name and number in my call log history?", "thread": [{"postID": "post4670011", "text": "i have updated my android system in Lenovo A6000 Plus. now we are facing issue on history. i am able to see only number in Call Log History and only Name in Contacts.\nis it possible to see Name and Numbers both for last call in call history.", "time": "09-08-2015 07:44 AM", "replies": []}]}, {"title": "Why aren't my contact names displaying while I get incoming calls?", "thread": [{"postID": "post4667934", "text": "i used lenovo A6000.i upgraded android kitkat to lollipop.the contact name not displayed while incoming call..", "time": "09-07-2015 08:18 AM", "replies": []}, {"postID": "post4667971", "text": "Same happens here.\nI have a Samsung Galaxy S5 with Android 5.0\nI think it´s a bug in Android 5.0\nThere is not update available in my Samsung to fix this.", "time": "09-07-2015 08:37 AM", "replies": []}]}, {"title": "How can I get rid of the data on Misc?", "thread": [{"postID": "post4667711", "text": "We have a Lenovo smartphone.", "time": "09-07-2015 04:40 AM", "replies": []}, {"postID": "post4667814", "text": "If you tap on the the misc files, do you get a list of files and apps? You can use that list to find out what apps are taking your storage. I recommend you to go to the specific apps settings and clear space from there (cache, media files, etc).", "time": "09-07-2015 06:58 AM", "replies": []}]}, {"title": "How can I get my Lenovo P70 to take photo on the volume button?", "thread": [{"postID": "post4667740", "text": "I want to connect my selfie stick with lenovo p70 mob but it need tge settings to make the vole picture to capture", "time": "09-07-2015 05:30 AM", "replies": []}]}, {"title": "Why aren't my Contact Names available in the Call Log and WhatsApp?", "thread": [{"postID": "post4667528", "text": "Hi.. I am using Lenevo A6000+. Yesterday I have upgraded it to Android 5.0.2. After this upgradation, I am not able to view contact's name in WhatsApp and Call logs. Pls help me to solve this problem.\nThanking you in anticipation.\nAvra", "time": "09-07-2015 01:40 AM", "replies": []}]}, {"title": "Why isn't my phone updating?", "thread": [{"postID": "post4661225", "text": "I have lenovo a6000 plus phone I downloaded the system update but after that it doesn't install and shows android system recovery (3e) massage . It give option reboot system now, apply update from adb,power down etc I trying every option but it not work now what can I do . I does not try wipe data/ factory reset because in phone memory there is some important photos and video's", "time": "09-04-2015 05:28 AM", "replies": []}]}, {"title": "Why am I unable to dial STD from my Android phone?", "thread": [{"postID": "post4658367", "text": "I am unable to dial STD from my android phone. where as I can dial the number with other device. presently I am using LENOVO -A536. Please advice.", "time": "09-03-2015 02:50 AM", "replies": []}]}, {"title": "Why is Instagram not working on my Lenovo A328?", "thread": [{"postID": "post4655519", "text": "every time i launch the instagram 7.5 app it just freezes then closes itself. I've tried installing old versions but they all do the same thing. Someone please help me", "time": "09-02-2015 06:54 AM", "replies": []}, {"postID": "post4656610", "text": "Welcome to Android Central! Did you install it from Google Play Store? If not, then it's possible the app isn't compatible, or not available in your region, and therefore installing it from some other source may not work.\nYou can also try going to Settings>Apps​, selecting Instagram, and Clearing Cache/Data.", "time": "09-02-2015 01:52 PM", "replies": []}]}, {"title": "How do I fix restricted access change on my Lenovo S90?", "thread": [{"postID": "post4650357", "text": "please help me with this problem.", "time": "08-31-2015 07:40 AM", "replies": []}]}, {"title": "Why does my Phone takes forever to open USB storage when connected to computer?", "thread": [{"postID": "post4649421", "text": "I have a Lenovo k3 note phone that runs on Lolipop. I recently rooted the device just to let you know. I am trying transfer data from my old sd card that i have backed up to my laptop, to my new 32 gb sd card. I was able to sync my phone to my laptop this morning perfectly fine. But now it, when I tap \"open the usb storage\" when i connect my phone to my laptop, it just continuously loads and doesn't open anything. I sat for 10+ minutes waiting for it to open but nothing worked and device did not show up o my computer. Its so frustrating! I have a lot of data that i need to get on my phone for everyday use. Can anyone help me?\nI've restarted the phone several times, i've turned adb debugging on and off but i still have no luck. I've removed the battery too. What else can i do? I cannot re download the enourmous amount of data that was on my previous sd card", "time": "08-30-2015 07:27 PM", "replies": []}]}, {"title": "My Android Lenovo K3 Note wifi is not detecting my router, what should I do?", "thread": [{"postID": "post4648165", "text": "in my phone if i turn on my wifi it is not dectecting any wifi routers and not showing ,if if turn on my wifi hot spot also it is not dectecting any wifi devices available to my phone what should i need to do my android version is 5.0 .........", "time": "08-30-2015 07:26 AM", "replies": []}]}, {"title": "How can I update the ota after I unroot on my Lenovo a6000 plus?", "thread": [{"postID": "post4645835", "text": "I have lenovo a6000 plus\nI was rooted my phone using kingroot then I unrooted my phone to get ota update .\nWhen i installing update after few seconds It shows error in installing a update.\nI tried so many times but isn't working. I frustrated by this . please help me is there any solution for this please help.....", "time": "08-29-2015 03:52 AM", "replies": []}]}, {"title": "How do I reboot my mobile?", "thread": [{"postID": "post4644656", "text": "i am using Lenovo A5000", "time": "08-28-2015 02:19 PM", "replies": []}, {"postID": "post4644888", "text": "Assuming it didn't actually freeze while updating (just during the download, or the root/ROM check), hold the power button down until it restarts (which could take up to 30 seconds).\nIf it restarts into nothingness, bring it to the carrier. Their update broke your phone, so they're going to have to refalsh the update (or th whole ROM - that's their problem).\nI hope you keep everything important backed up, because you might lose everything on the phone.", "time": "08-28-2015 04:12 PM", "replies": []}]}]
[{"title": "Why isn't my Lenovo A6000 Plus detecting the sim card in slot 1?", "thread": [{"postID": "post4643198", "text": "I have inserted a 3G&4G sim in slot 1.But both the sim not detecting.pls help me", "time": "08-27-2015 11:43 PM", "replies": []}]}, {"title": "My contact bar deleted, how can I get it back?", "thread": [{"postID": "post4626565", "text": "I have lenovo K3 Note. I have deleted Contact bar. Can anyone suggest me how can i back contact button as same as previous.", "time": "08-22-2015 04:21 AM", "replies": []}]}, {"title": "Why isn't my Lenovo a6000 Acore Android processor responding?", "thread": [{"postID": "post4613682", "text": "Sir I update my phone after updating it has coming android processor not responding if I click ok it asking again and again please tell me solution", "time": "08-17-2015 12:40 PM", "replies": []}, {"postID": "post4614497", "text": "Welcome to Android Central! The acore error is relatively common, and can be due to different causes, although it usually has to do with contacts. If you search these forums for \"acore,\" you'll find lots of threads, but unfortunately not one specific solution, since there can be different causes. Here's one potential solution: http://forums.androidcentral.com/t-m...ml#post4535537", "time": "08-17-2015 07:28 PM", "replies": []}]}, {"title": "How do I open the lock screen on my Lenovo smartphone?", "thread": [{"postID": "post4606387", "text": "my screen handphone already lock so,how to open lock screen in my lenovo smartphone.the phone need to into my email, but i already put , but cannot open.\nmy phone brand is lenovo 208T.", "time": "08-14-2015 01:00 AM", "replies": []}]}, {"title": "Why isn't my keyboard popping up - Lenovo K3 note?", "thread": [{"postID": "post4602449", "text": "I just received my 2nd Lenovo K3 note , and surprisingly I dot see keyboard pooping up. I just opened the package , switched on the phone ...while setup it asks to connect to Wifi, and when I select , keyboard is not popping up for me to enter password. I had then setup the phone without connecting to WiFi. but still I have no keyboard popping up. \nMy phone is running android 5.0 Lollipop.", "time": "08-12-2015 12:33 AM", "replies": []}]}, {"title": "How can I root my Lenovo p70-a smart phone?", "thread": [{"postID": "post4601070", "text": "i want to root my lenovo p70-a, because its not support sd card data moving independently. its default file browser working but its not good. i want to move files from ex file explorer but its not happening not deleting nor doing anything from ex file explorer due to lock of sd card default by company in android 4.4.4, so please help me. thanks. and i want also pc suite for this smart phone.", "time": "08-11-2015 08:22 AM", "replies": []}]}, {"title": "Why is my mobile switching off automatically?", "thread": [{"postID": "post4595249", "text": "i am using lenovo s920 with kitkat 4.2...the problem is my mobile is frequently swiitching off abot every 10-15 minutes.i have even tried factory reset but still no effect.what to do now.", "time": "08-07-2015 11:40 AM", "replies": []}, {"postID": "post4595306", "text": "Welcome to AC.\nAsk your network provider to check the SIM.\nIf it's good, there may be a fault with the phone.\nPosted via the Android Central App", "time": "08-07-2015 12:17 PM", "replies": []}]}, {"title": "Why do my incoming calls show as unknown and the number is not displayed?", "thread": [{"postID": "post4593144", "text": "my mobile is Lenovo A6000", "time": "08-06-2015 04:45 AM", "replies": []}, {"postID": "post4593177", "text": "Hello. \nIf it was your outgoing calls not displaying to those you call, that can be changed in Settings. \nIt may be your numbers in your Contacts list do not exactly tally with your callers, prefix numbers etc. \nIf you have recently moved device and had contacts only saved on the sim card, many new devices apart from Samsung do not recognise sim contacts as far as I know. \nYou would need to add them to Google Contacts or other. \nGo to Contacts/People - Menu - Contacts to Display.", "time": "08-06-2015 06:04 AM", "replies": []}]}, {"title": "Lenovo 319 is asking for a pin code. What is the pin code?", "thread": [{"postID": "post4581792", "text": "when i start to install internet settings asking\" input pin code\"like this", "time": "07-30-2015 07:29 AM", "replies": []}, {"postID": "post4581820", "text": "Welcome to AC.\nAre you setting up the phone? Have you set a lockscreen PIN?\nPosted via the Android Central App", "time": "07-30-2015 07:45 AM", "replies": []}]}, {"title": "My operating system has been deleted on my phone Lenovo A6000, how can I get it back?", "thread": [{"postID": "post4567966", "text": "Hello all ,\nmy operating system has been deleted on my phone lenovo a6000\nhe was asked me to update from kraft-a6000_S035_150507 to another \nbut the update has been failed idon't know why (updating failed please reboot your device and try again )\nafter that no any file on my phone", "time": "07-22-2015 03:18 PM", "replies": [{"postID": "post4567986", "text": "Have you contacted Lenovo? Seems like something failed during the update process and you'll probably need to have it replaced. \nLet us know what they say.", "time": "07-22-2015 03:29 PM", "replies": []}]}, {"postID": "post4567993", "text": "i tried to contact them but i can't find email or live support", "time": "07-22-2015 03:34 PM", "replies": []}]}, {"title": "How do I clean an s850 front camera of dust?", "thread": [{"postID": "post4562886", "text": "when i am taking photos with front cam it is so messed and everything is blur.and not\nable to clean and it is under warranty.", "time": "07-20-2015 12:11 AM", "replies": [{"postID": "post4563152", "text": "It's probably not dust inside the lens,just things on the outer camera. Try with some alcohol and a paper towel or with a very cheap perfume since it has a lot of alcohol on it.\nPosted via the Android Central App", "time": "07-20-2015 06:19 AM", "replies": []}]}]}, {"title": "My Lenovo A319 Android phone does not have an app drawer, can anyone help with this?", "thread": [{"postID": "post4535954", "text": "My Lenovo A319 android phone does not have app drawer, can anyone help with this. Thank you", "time": "07-05-2015 06:42 AM", "replies": []}, {"postID": "post4535989", "text": "If it's anything like my Lenovo tablet you just swipe from right to left to see all the apps. No drawer. It's like an iPad. There are ways to get an app drawer f you really want one. I use nova launcher and that creates one for you. \nSent from my iPhone using Tapatalk", "time": "07-05-2015 07:27 AM", "replies": []}]}, {"title": "How do you restore original settings upon pressing the never allow option in messaging for a Lenovo?", "thread": [{"postID": "post4525518", "text": "I cannot send messages to 211, 8888, etc.", "time": "06-30-2015 12:01 PM", "replies": []}]}, {"title": "Why does my phone go blank while call in progress?", "thread": [{"postID": "post4515271", "text": "I have lenovo A850. From last few days I am having problem of screen goes blank while receiving call or dialing a call. I am not able to end the call or view the screen. To end the call I have to remove the battery and then restart. Few day back I had formatted my phone. After that, problem resolved for almost 15 days. I have also installed certain apps. Now again the same problem started. I am fed up. Everytime I have to remove the battery to restart the phone. \nPlease guide me urgently.\nWith warm regards\nUsha H Vaghela.", "time": "06-25-2015 04:01 AM", "replies": []}, {"postID": "post4515277", "text": "Have you tried pressing the power button to restart the phone?\nYou could also use the recent apps function task manager to remove it from running. \nSent from my D5503 using Tapatalk", "time": "06-25-2015 04:06 AM", "replies": []}]}, {"title": "How do I stop the beep sound of a minute minder on my Lenovo A6000 during a call?", "thread": [{"postID": "post4515234", "text": "My phone set is Lenovo A6000", "time": "06-25-2015 03:04 AM", "replies": []}]}, {"title": "How can I get my Lenovo launcher working again, it has stopped responding?", "thread": [{"postID": "post4513641", "text": "help me to get rid of this", "time": "06-24-2015 09:33 AM", "replies": []}]}, {"title": "How do I change the language from Chinese to English in Lenovo mobile assistance?", "thread": [{"postID": "post4513081", "text": "I installed lenovo mobile assistance to my pc now language showing chines now to change to English .", "time": "06-24-2015 02:09 AM", "replies": []}]}, {"title": "My Lenovo S930 .The microphone is not working when making calls (so people don't hear me talking.). How can I fix it?", "thread": [{"postID": "post4507313", "text": "in lenovo 930 .The microphone is not working when making calls (so people don't hear me talking.). but its working when i connect handsfree earphones", "time": "06-21-2015 03:54 AM", "replies": []}, {"postID": "post4507414", "text": "Welcome to Android Central! The primary phone mic might have failed, or might be blocked by debris. Check the mic opening to see if it's clogged. Also, does it work on speakerphone?", "time": "06-21-2015 06:46 AM", "replies": []}]}, {"title": "How do I bypass the lockscreen if I have forgotten my pin in Lenovo A70000?", "thread": [{"postID": "post4497437", "text": "my mobile lenovo A7000 is not opening i had changed the pin but now i dont remember it", "time": "06-16-2015 12:36 AM", "replies": []}, {"postID": "post4497625", "text": "Log in to your Google account on a PC and use Android Device Manager to change your device security details.\nPosted via the Android Central App", "time": "06-16-2015 04:51 AM", "replies": []}]}, {"title": "Why isn't my Lenovo A6000 booting?", "thread": [{"postID": "post4490857", "text": "I have a lenovo a6000 which i have rooted recently when i tried to flash miui rom it successfully completed but it did not reboot when i press the power button it vibrates again and again in small interval.And if i tey to boot into recovery by pressing power button and volume up button it just vibrates again cant get into the recovery also can u guys help me\nThank you.........................", "time": "06-12-2015 08:49 PM", "replies": [{"postID": "post4495439", "text": "Welcome to Android Central!\nIt sounds like you hard bricked your phone, you may need to take it to a service center or contact Lenovo about replacing it.", "time": "06-15-2015 07:14 AM", "replies": []}]}]}, {"title": "I found that all my text messages are not delivering on time to the person whom I send them to. What could be the issue?", "thread": [{"postID": "post4465828", "text": "i am a lenovo s560 user...i found that all my text messages are not deliveringon time to the person whom i send..and even i recieves all the messages exactly 4 minutes later from the send time.i also think that all my messages are been forwarded,so how can i stop all these issues?", "time": "06-02-2015 02:16 PM", "replies": []}, {"postID": "post4465934", "text": "I would contact your carrier to see if they're having issues.", "time": "06-02-2015 02:46 PM", "replies": []}, {"postID": "post4466014", "text": "And also be aware that there's no \"on time\" with texting. It's not considered real-time communication. If it takes 4 minutes, it takes 4 minutes. (Voice is real-time, text and email aren't.)", "time": "06-02-2015 03:14 PM", "replies": []}]}, {"title": "Why can't my Lenovo p 780 load data messages in TWRP?", "thread": [{"postID": "post4447713", "text": "on my Lenovo P780 i flashed MiUI rom Version: 4.3.28 （V5） from official MIUI site. i flashed the rom using TWRP 2.7.1.1, after completion of process phone went into the bootloop so i tried to flash stock rom S228 on it, but in recovery i am getting error as E:Unable to mount '/data'. and in Recovery my internal memory is showing to be zero. Please help i dont know how to recover this partitions.", "time": "05-25-2015 01:44 PM", "replies": []}]}, {"title": "Why isn't my SD card being detected?", "thread": [{"postID": "post4430769", "text": "I bought a lenovo a536, i cannot transfer any files to my sd card..then my brother told that my sd card was not detected.. it still works on my old phone and can be detected in my laptop i tried to clean the pins still no go..i DL the SD insight app..it was detected by the app..my SD card is toshiba 8gb..please help\nThank you", "time": "05-16-2015 09:24 PM", "replies": []}, {"postID": "post4431090", "text": "Welcome to Android Central! Did you use SD Insight on the Lenovo phone, and it detected the card? When you go to Settings>Storage​, does it show up there as well?", "time": "05-17-2015 01:56 AM", "replies": []}, {"postID": "post4437139", "text": "hi..i use the sd insight and the card was detected, it shows up on the storage but the \"unmount SD card\" option is not highlighted..is there any other options that we can do in order to detect my sd card?thank you", "time": "05-20-2015 06:18 AM", "replies": []}, {"postID": "post4437624", "text": "That's unusual. In Settings>Storage, does it actually show you how much space is available on the SD?", "time": "05-20-2015 11:00 AM", "replies": []}, {"postID": "post4438834", "text": "That's unusual. In Settings>Storage, does it actually show you how much space is available on the SD? \n- yes..it also shows the total space of my sd card..then there is a pre installed file browser on my phone i can still view my old files..but the thing is, in order for me to transfer some files like games etc..i need to DL an app that allows me to transfer files right? when i tried that, the transfer to external storage is not applicable..", "time": "05-20-2015 09:32 PM", "replies": []}, {"postID": "post4438865", "text": "I don't understand why the Unmount option is greyed out. Try ES File Explorer to see if you can move the files around.", "time": "05-20-2015 09:47 PM", "replies": []}, {"postID": "post4439114", "text": "thank you for your support, i tried the ES file explorer i was able to transferred some of the files but the games i was not able to do so..i DL the app mgr III.. as i open it..it prompted a message that my cellphone does not have a real external storage. or the external storage is emulated . i have only basic games like candy crush, shadow fight etc..is there anything that we can do..", "time": "05-21-2015 02:08 AM", "replies": []}, {"postID": "post4439152", "text": "If you're trying to move apps to the external SD card, either the phone has to have that function natively, or you have to be rooted (in order to use apps like App Mgr III). You can tell if the phone has the ability to move apps to SD by going to Settings>Apps, selecting an app, and seeing if there is a Move to SD button. If there isn't, then the phone doesn't support that function (unless you root it). Even if it does have that function, you'd only be moving a small portion of the app.", "time": "05-21-2015 03:06 AM", "replies": []}, {"postID": "post4439168", "text": "thank you very much for your help..last thing..how to root my lenovo a536?will it be ok to root my phone even if its on postpaid plan?", "time": "05-21-2015 03:30 AM", "replies": []}, {"postID": "post4439687", "text": "I'm afraid I can't help you with that. Check out this thread: [Q] Root LENOVO A536? - XDA Forums", "time": "05-21-2015 10:23 AM", "replies": []}]}, {"title": "What do I do when my LENOVO phone keeps sending messages that says xxx has stopped working?", "thread": [{"postID": "post4434405", "text": "all the apps including messages and settings has stopped working , if I click any of them ,this message pops out \"unfortunately, whatsapp has stopped working.\" I can't do anything...please help me", "time": "05-18-2015 08:11 PM", "replies": []}, {"postID": "post4435145", "text": "Have you tried clearing the cache partition? Also did you install anything prior to this issue happening?", "time": "05-19-2015 07:19 AM", "replies": []}]}, {"title": "How do I root my China Android phone (Lenovo A850+ plus)?", "thread": [{"postID": "post4431692", "text": "Urgent\nplease help me", "time": "05-17-2015 12:29 PM", "replies": []}]}, {"title": "Google chrome- Sync: my password is not taking. Why?", "thread": [{"postID": "post4431102", "text": "Google chrome- Syncassword required. Even I type correct password the error is\"incoorect passpharse\" in my new lenova a 6000 phone.", "time": "05-17-2015 02:13 AM", "replies": []}]}, {"title": "How can I fix this problem android.process.acore problem?", "thread": [{"postID": "post4419493", "text": "My mobile is Lenovo P780. Kindly anyone please help me....... I am also facing problem of showing ContactManager has stopped & the process android.process.acore has stoped at the time when i switch ON my mobile & try to unlock my mobile. It happened after downgrading my mobile. I can't access nothing part of my mobile...... So guys please help me.", "time": "05-11-2015 09:53 AM", "replies": []}, {"postID": "post4419508", "text": "I'm not familiar with your device. But have you cleared the cache yet? \nA factory reset would be the last resort. \nSent From my Gold Platinum Galaxy S6 Edge", "time": "05-11-2015 10:01 AM", "replies": []}]}, {"title": "Are there any GMS Tools for Android Lollipop version?", "thread": [{"postID": "post4416300", "text": "I have Lenovo A7600-m , but I am using it in overseas where I need Google play aps and some devices, unfortunately I cannot use any Google aps in my Lenovo A7600-M,\nWould you please help me to solve this issue if any solution available ?", "time": "05-09-2015 03:30 PM", "replies": []}, {"postID": "post4416855", "text": "Apps that require that you be in a certain country to work won't work if you're not in that country. You could try a VPN server in the US, but some apps look at the origin IP, not the IP the connection is coming from, so that won't fool them.", "time": "05-09-2015 10:10 PM", "replies": []}]}, {"title": "Why is my Lenovo s920 stuck and can't on after king user install?", "thread": [{"postID": "post4402873", "text": "after king user install my smartphone stuck and can't on for a long time even in full charge batery . please help me , i can't use my handphone anymore .", "time": "05-02-2015 09:45 PM", "replies": []}, {"postID": "post4403115", "text": "Welcome to Android Central! Were you trying to root your phone using Kingo?", "time": "05-03-2015 01:50 AM", "replies": []}]}, {"title": "How can I get my Lenovo A536 system back?", "thread": [{"postID": "post4381787", "text": "Hello , pls help me  , i lost my system .. i update my phone . But its failed ! Then he said no command , omg . I try use everything recovery update , but still failed . Adb sideload too  , what can i do ? I dont use sd card . Plss help me  *Sory bad english yeah", "time": "04-23-2015 02:45 PM", "replies": []}, {"postID": "post4384041", "text": "Welcome to Android Central! Was this an official system update pushed by the manufacturer or carrier over the air? Or did you manually install it?", "time": "04-24-2015 01:13 PM", "replies": []}]}]
[{"title": "Why won't my phone go into recovery mode?", "thread": [{"postID": "post4356947", "text": "My phone is Lenovo P770. I found this CPU governor app thing and there was a box and I checked it. My phone suddenly hanged and superuser thing appeared. Then I tried pressing deny and my phone just hanged. I removed the battery and tried turning it on again. It's okay starting up but after like 30 secs it just hangs... I tried going to recovery mode but it'll just light up a bit and disappear. It won't work ack! HELP PLSSSS IM SO PISSED AT MYSELF FOR BEING AN *****.", "time": "04-14-2015 01:03 PM", "replies": []}, {"postID": "post4357045", "text": "Was your phone rooted at some point? I'm asking this because you mentioned a prompt about Superuser access. Either it is the CPU governor app saying your MUST install Superuser access to use the program or your device is already rooted and it is asking to grant Superuser access. \nEither way I'm not certain as to why your device is failing to enter recovery unless you are rooted and something was corrupted w/ your stock or custom recovery.", "time": "04-14-2015 01:50 PM", "replies": []}, {"postID": "post4357385", "text": "I'm with Paul - I'm not certain either. That's something that has to be worked on hands-on to diagnose. But if it comes to the worst, find the software tool Lenovo uses to flash ROMs, find the stock ROM for your phone, and try reflashing the ROM. (Your best source for information and files is probably going to be Lenovo P780 - XDA Forums - it's for the 780, but the devs there will probably know of any differences between the two, and where you can download what you need. Also any tricks Lenovo has [every manufacturer has different little button press combinations to use to restore a soft-bricked phone].)", "time": "04-14-2015 04:01 PM", "replies": []}]}, {"title": "Why can't I access the phone memory when connected to pc?", "thread": [{"postID": "post4329647", "text": "I am using lenovo S820. I got an update and upgraded my phone to kitkat 4.4.2. When I connect my phone to pc via usb cable. I cannot access the internal memory. I got this issue after upgrading. Please help", "time": "04-04-2015 07:19 AM", "replies": []}, {"postID": "post4330035", "text": "According to me ...... the memory card (SD) is actually busy with the PC and it cant be used with the phone at that time.....so.....u have the answer..................,,,,,,,,......it also happens to me on my phone with kitkat 4.4.2", "time": "04-04-2015 10:51 AM", "replies": []}, {"postID": "post4330125", "text": "I can access my sd card(memory card) from my computer when I connect it but I cannot acces my phone memory or usb memory from my pc.", "time": "04-04-2015 11:43 AM", "replies": []}, {"postID": "post4330228", "text": "When you first connect the cable to the pc, change the usb notification to MTP. \nSearch for new drivers from Lenovo. \nTry a different usb port. \nUnless you are reading the sd card while still in the device, try another cable. \nMake sure Lock Screen security is set to Swipe or None.", "time": "04-04-2015 12:41 PM", "replies": []}, {"postID": "post4332052", "text": "Thanks. Now I can access my phone storage as a drive on my pc with MTP option", "time": "04-05-2015 11:39 AM", "replies": [{"postID": "post4332080", "text": "Great. Welcome to Android Central.", "time": "04-05-2015 11:50 AM", "replies": []}]}]}, {"title": "Why did my Lenovo a6000 update stop after 98?", "thread": [{"postID": "post4325003", "text": "When i found update in my lenovo a6000 i done it 98% but after its stop and my data used almost 1 gb and 100 mb...now it is stable at 98% ....niw what should i do...plzzz help me", "time": "04-02-2015 02:13 PM", "replies": []}, {"postID": "post4325256", "text": "Welcome to Android Central! Try booting into Recovery Mode and wiping the cache partition, which won't erase any personal data. Follow the steps in this video, but instead of selecting Wipe Data/Factory Reset, make sure you select Wipe Cache Partition. When complete, then select Reboot System Now. Try updating the system again.", "time": "04-02-2015 03:48 PM", "replies": []}]}, {"title": "How do I update built-in apps?", "thread": [{"postID": "post4314133", "text": "How do I update My Twitter in My Lenovo phone? This spoil was built-in and when I check the Play Store, Twitter was available for download but it will say \"Duplicate Provider Authority\". Someone kind play help me with this...😃😃😃", "time": "03-29-2015 12:39 PM", "replies": []}, {"postID": "post4315175", "text": "Welcome to Android Central! If it's a special Twitter interface provided by Lenovo, then you have to either find the exact app in Google Play Store (which isn't always available), or you have to wait for Lenovo to update the app as part of an OTA system update.", "time": "03-29-2015 10:01 PM", "replies": []}]}, {"title": "Why can't I unlock my Lenovo A536?", "thread": [{"postID": "post4288728", "text": "some times my lenovo A536 locked. the power buttan not work to unlock my device", "time": "03-17-2015 12:44 AM", "replies": []}, {"postID": "post4288746", "text": "Welcome to Android Central! Are you saying it sometimes works, and sometimes doesn't? Or it just never turns on? Either way, you will probably have to bring it to a repair shop, or contact Lenovo if it's still under warranty.", "time": "03-17-2015 01:07 AM", "replies": []}]}, {"title": "Can I get some help getting my Lenovo A6000 to work on US Consumer Cellular on 4G LTE Speed?", "thread": [{"postID": "post4286945", "text": "Lenovo just released A6000 LTE Android (kitkat) smart phone in India and happen to be there at that time and bought myself one to use it here in US on my current Consumer Cellular network provider. Consumer Cellular uses ATT GSM bands.\nThey tired adding some APN settings but I am not able to get more than 2G speed on this 4G and LTE phone.\nCan someone please help me out to make it work at 4G or LTE speed on Consumer Cellular? I am in love with this phone and it's my first Android phone. I don't want to give up so easily. Not sure if there is a way to \"tweak\" the bands to work with here is USA if APN settings are not going to work. \nHere's the full spec of the phone: \nTechnology GSM / HSPA / LTE 2G bands GSM 900 / 1800 / 1900 - SIM 1 & SIM 2 3G bands HSDPA 2100 4G bands LTE 800 / 1800 / 2100 / 2600 TD-LTE 2300\n(Bands 1, 3, 7, 20, 40) Speed HSPA, LTE Cat4 150/50 Mbps GPRS Yes EDGE Yes\nOS Android OS, v4.4.4 (KitKat) Chipset Qualcomm MSM8916 Snapdragon 410 CPU Quad-core 1.2 GHz Cortex-A53 GPU Adreno 306", "time": "03-15-2015 10:22 PM", "replies": []}]}, {"title": "Why won't my Lenovo S90 show notifications by chat apps?", "thread": [{"postID": "post4282193", "text": "hello ,\ni just bought lenovo s90-u a few days ago .\nand the problem is when people using whatsapp,wechat...etc .\ni wont get any notifications .\ni must to keep running the apps only can receive msg notifications .\nhow can i fix it .?", "time": "03-13-2015 05:37 AM", "replies": []}]}, {"title": "Why is the camera of my Lenovo S90-t refusing to come up?", "thread": [{"postID": "post4278343", "text": "When you click on the camera, it will behave as if it is going to come up and hang with black background. When you click on the return button, it will bring out a message \"Lenovo SNAPit isn't responding. Do you want to close it? with option of 'wait' and 'ok'. When you click on wait, the camera will just hang there.", "time": "03-11-2015 05:39 AM", "replies": []}, {"postID": "post4278419", "text": "Try Settings, Storage, Cached Data, and clear the cache.\nConsider also the possibility that a third-party app, if you are using any, may be interfering with normal Camera function. If you can't think of a likely culprit, booting into Safe Mode would test that.\nPosted via the Android Central App", "time": "03-11-2015 07:22 AM", "replies": []}]}]
