[{"title": "Honor View 10 can it replace my Samsung Galaxy Note8?", "thread": [{"postID": "post6192769", "text": "Like the title of the post says, can the Honor View 10 replace my Note8.\nDon't get me wrong I love my Note8 but i did not enjoy the price of it, just short of a €1000.00. I have had Samsung Galaxy note's since Note3 and while always expensive I considered them good value for money for what the can do.,But not anymore in my opinion.\nI have an Honor View 10 arriving today and I paid less the half the price I paid for my Note8. I bought it because I broke my Note4 playing ingress. The reason I used a Note4 for Ingress was to protect my Note8 from accidents. Didn't want to risk my €1000.00 phone dashing around playing Ingress. So a broke Note4 had me looking for a replacement Ingress phone, so Honor View 10 purchased and is here today😁\nNow I am thinking if this phone is good I may just sell my Note8 while it's still worth a half decent amount and just use my Honor for all mobile duties. Without worrying about how much it will cost if I damage it.\nSo I will report back in a few days and give you my impression of the Honor View 10 against he Note8.", "time": "03-16-2018 03:40 AM", "replies": []}, {"postID": "post6196041", "text": "I am looking for to hearing your opinion. \nI sold my Note 8 and got the Pixel 2 XL and I don't regret it at all. I picked up the Mate 10 Pro last week and now I'm trying to decide if I should keep it or the Pixel. Don't get me wrong I like my Pixel but I miss having an IR blaster on phone. Especially when the kids lose the remote control. And the battery on the the Mate 10 is excellent. It easily outperforms the Pixel.", "time": "03-19-2018 06:36 PM", "replies": []}, {"postID": "post6196896", "text": "The view 10 is excellent, and pretty close to the note 8 except that it doesn't have a stylus, curved display, questionable updates, warranty support and security. And the note 8 camera is generally better though not twice as good. If those things aren't important then the view 10 is quite an excellent choice for those looking to save money,and not really far behind the note 8. In some things, it probably does better than the note 8 especially in the performance category.", "time": "03-20-2018 01:13 PM", "replies": []}]}, {"title": "Preorder goes live March 23rd for US", "thread": [{"postID": "post6187701", "text": "Anyone planning to continue pick this up still? Compared to international ver. We're couple months behind. \nI wonder if V10 stack up to new Sony Xperia XZ2........", "time": "03-12-2018 11:46 AM", "replies": []}, {"postID": "post6188012", "text": "I've had my eye on it just to try something different. Haven't placed my order yet but the pricing is right where I want to be and the freebies are a nice touch.", "time": "03-12-2018 02:55 PM", "replies": [{"postID": "post6188076", "text": "Yeah same here. The battery size is crazy and CPU are what in Mate 10/Pro", "time": "03-12-2018 03:47 PM", "replies": []}, {"postID": "post6191580", "text": "Crackberry Bla1ze in the house!!", "time": "03-15-2018 05:49 AM", "replies": []}]}, {"postID": "post6188608", "text": "I just ordered mine. I can't wait to test it out. I am looking forward to having an IR blaster again.", "time": "03-13-2018 12:24 AM", "replies": []}]}, {"title": "Save even more on your View 10 order", "thread": [{"postID": "post6188023", "text": "If you visit the Honor site - http://forums.androidcentral.com/e?l...token=f_dMCbHG and share a post, you can earn even more off your order. For example, I just got $30 off for sharing to FB.\nYou can even get one for $1 but I'm guessing those are rare lol", "time": "03-12-2018 03:03 PM", "replies": []}, {"postID": "post6188125", "text": "$469 is a heck of a deal.", "time": "03-12-2018 04:18 PM", "replies": []}, {"postID": "post6188172", "text": "I got a $30 off coupon too.", "time": "03-12-2018 04:53 PM", "replies": []}, {"postID": "post6188604", "text": "I just order mine View 10. $30.00 off is a great deal.", "time": "03-13-2018 12:19 AM", "replies": []}, {"postID": "post6188673", "text": "Purchased! Too bad they ran out earplugs.", "time": "03-13-2018 02:35 AM", "replies": []}]}, {"title": "Band Support", "thread": [{"postID": "post6188319", "text": "Does anyone know what bands/frequencies the US version is going to support. I'm not having the most luck finding anything current.", "time": "03-12-2018 07:05 PM", "replies": [{"postID": "post6188580", "text": "GSM:\n850, 900, 1800, 1900 MHz\nUMTS:\n850, 1700/2100, 1900, 2100 MHz\nLTE (FDD):\nBands 2, 4, 5, 7, 12, 17\nLTE (TDD):\nBands 38, 40, 41\nData:\nLTE-A, HSPA, HSUPA\nCheck with your carriers.", "time": "03-12-2018 11:43 PM", "replies": []}]}]}, {"title": "Honor View 10 or Huawei Mate 10/10 Pro?", "thread": [{"postID": "post6188131", "text": "Does anyone know if any reviewers have compared photos and videos taken with the View 10 and the Mate 10 Pro to determine the value of having OIS on the Mate 10? With about $300 dollars difference in price between them I wonder if the lack of OIS on the View 10 is that big of a deal.", "time": "03-12-2018 04:25 PM", "replies": []}]}, {"title": "Honor View 10 Review video", "thread": [{"postID": "post6188014", "text": "For those on the fence, thinking baout snagging one now that pre-orders are uphttps://www.androidcentral.com/honor...and-us-pricing", "time": "03-12-2018 02:57 PM", "replies": []}, {"postID": "post6188030", "text": "I just don't know if I can do a non AOD phone.", "time": "03-12-2018 03:12 PM", "replies": []}]}, {"title": "Honor v10 review after 2 days usage", "thread": [{"postID": "post6146488", "text": "1) Back button to close the app..\nIf we hit the back button to close the app, for ex whatsapp. It only minimizes, and do not close the app instead it still runs.\nThis is problamtic as the app is still running, which drainse the battery, and if we had open several apps, all those continues to run even thou if we hit back button.\n2) Navigation keys is sick which is not given on the body\n3) Camera Depth effect is ineffective. I mean user cannot take a depth effect.\n4) Motion gesture like taking screenshot opening apps is painful as we need to tap with Knuckle, and most of the time doesnt work at all. One plus 5t is simple as we just need to draw over the glass instead of tapping with knucles.\n5) User Interface (UI) is not simple.\n6) Honor is poor in sending updates,", "time": "01-26-2018 11:33 AM", "replies": []}, {"postID": "post6147024", "text": "great notes, thanks for sharing them", "time": "01-27-2018 08:03 AM", "replies": []}, {"postID": "post6147229", "text": "Lmao, this is a waste. UI is not simple? Well duh, it's EMUI, not stock. If you want simple, don't buy anything with a skinned version of Android. Back button doesn't close the app? Again, duh. Apps are kept in memory, if you want them closed, you have to hit the recents button and swipe them away. It's been like this for a long time in Android. This almost seems like a bash against Huawei/Honor or someone that has never used an Android.", "time": "01-27-2018 12:52 PM", "replies": [{"postID": "post6159885", "text": "Yah I was like \"what?\" When I read it too. Seems like he's new to Android", "time": "02-11-2018 12:29 AM", "replies": []}]}, {"postID": "post6148191", "text": "It sounds like you are not enjoying your V10 - I'm sorry about that! Are you thinking about returning your phone and getting another phone; perhaps from a different manufacturer?", "time": "01-28-2018 05:05 PM", "replies": []}, {"postID": "post6153294", "text": "Navigation keys is sick and not given on the body?? What??", "time": "02-03-2018 08:24 AM", "replies": []}, {"postID": "post6170340", "text": "1- Pressing back button is just to go back. Any app will continue to run in the background until you remove from recents. Even then, depending on the app it will still \"run\" in order to receive notifications\n2-FP scanner is fast. You can use the navigation button for back/home/recents if you choose, or the standard on screen nav-bar. We gave the user a choice\n3- We offer the infamous variable aperture mode, portrait mode for front and rear camera.. All aided by the f/1.8 and AI to have a smarter algorithm to differentiate foreground subjects from the background.\n4- You can capture a screenshot easily with a double knock of your knucle or the traditional way of holding power and Volume (-). \n5- EMUI 8 has come a long way from previous versions. Simplifying the UI and giving the user a choice of features to turn on. App tray, google now panel are available to use. Want a more clean look, there are theme options from the play store and launchers \n6- The Honor 7x is on February security patch and so is the Honor View 10. Honor View 10 already comes with Oreo and 7x will be receiving the Oreo update starting April 2018. Many devices dont even have Feb. security patch. so...", "time": "02-23-2018 02:13 PM", "replies": [{"postID": "post6170753", "text": "Did they add double tap to sleep on Emui 8? It's a must have feature.", "time": "02-24-2018 12:35 AM", "replies": []}]}, {"postID": "post6185354", "text": "Should be able to fix this with the app power/battery management settings in EMUI, right? Oreo has very granular settings on power management - I'm trying to remember exactly how it worked before with EMUI 5.0. Should be a \"power intensive\" toggle that can set the app to close when a lock screen occurs.", "time": "03-10-2018 11:56 AM", "replies": []}]}, {"title": "Why my emojis turn black on my Honor v10?", "thread": [{"postID": "post6161310", "text": "I apply a theme for my phone and suddenly my emojis turn black", "time": "02-12-2018 07:58 PM", "replies": []}, {"postID": "post6181104", "text": "Welcome to the forums! Does this persist in Safe Mode?", "time": "03-06-2018 01:25 PM", "replies": []}]}, {"title": "Share your honor V10 Pictures!", "thread": [{"postID": "post6135528", "text": "I just realized that there is no dedicated \"pictures\" thread here - so please, share your Honor View 10 pictures! The camera quality sounds excellent; so let's see what the camera can do!", "time": "01-13-2018 05:44 PM", "replies": []}, {"postID": "post6159883", "text": "Sad no one showed any pics yet", "time": "02-11-2018 12:28 AM", "replies": [{"postID": "post6165087", "text": "I know! I'm waiting anxiously!", "time": "02-17-2018 01:37 PM", "replies": []}]}, {"postID": "post6160616", "text": "Man! Been waiting for this phone for awhile. I'll post once I get it.", "time": "02-11-2018 11:55 PM", "replies": [{"postID": "post6165089", "text": "Awesome! Thank you!! Hope you like it!", "time": "02-17-2018 01:37 PM", "replies": []}]}]}, {"title": "what is the highest shutter speed in huawei honor v10", "thread": [{"postID": "post6159418", "text": "please anyone using honor v10 provide the info by going to the pro mode in their camera", "time": "02-10-2018 10:39 AM", "replies": []}]}, {"title": "Remvoving the plastic cover on top of screen", "thread": [{"postID": "post6144560", "text": "I was wondering if it is easy (& how) to remove that plastic layer on top of the main screen (placed on phone from factory) without causing any scratches or hurt to the main screen during the process.\nThanks", "time": "01-24-2018 08:15 AM", "replies": []}, {"postID": "post6144614", "text": "Is there a screen protector on it?", "time": "01-24-2018 09:49 AM", "replies": [{"postID": "post6144676", "text": "Yes, from the factory there's a built in protector.", "time": "01-24-2018 10:50 AM", "replies": []}]}, {"postID": "post6144770", "text": "Mmmm I'd be hesitant to try that. Shame to wreck the screen...\nWhy do you want to take it off?", "time": "01-24-2018 12:45 PM", "replies": [{"postID": "post6144771", "text": "I don't like it. I love to use my phone naked and enjoy it till it dies or a better model shows up. I think it can be removed because I've seen lots of reviews on youtube in which the phone appeared without it by looking closely to the borders (i.e. the reviewers ripped that plastic off) and in some other videos, it was there as is.", "time": "01-24-2018 12:49 PM", "replies": []}]}, {"postID": "post6144816", "text": "Well, peel off one corner gently and if it goes OK, take it all off...", "time": "01-24-2018 01:50 PM", "replies": []}, {"postID": "post6145054", "text": "I know the OnePlus 5T has a similar kind of plastic screen protector on it that comes straight from the factory, so to speak. You *should* be able to take it off, provided that you go slowly and are careful. You should be fine!", "time": "01-24-2018 07:03 PM", "replies": []}, {"postID": "post6145227", "text": "It will come off and won't damage the screen. My OP5 had one and I took it off because I thought it looked ugly and I had their faux carbon fiber case to protect the screen anyway.", "time": "01-24-2018 11:56 PM", "replies": [{"postID": "post6145410", "text": "Oh wow, it also came on the OP 5? I do like how OnePlus gives you accessories right out of the box.", "time": "01-25-2018 07:46 AM", "replies": []}]}, {"postID": "post6153289", "text": "According to GSM Arena review this phone like many other Honor and Huawei phones doesn't have an oleophobic coating underneath the protector. Why does Huawei keep doing this??", "time": "02-03-2018 08:21 AM", "replies": []}]}, {"title": "Where can you buy the View 10?", "thread": [{"postID": "post6099309", "text": "Is it available yet to purchase? Where can I buy it, and for how much?", "time": "12-07-2017 02:43 PM", "replies": [{"postID": "post6100667", "text": "Amazon - Best Buy - B&H. Just a few where I go to buy unlock devices.", "time": "12-08-2017 03:48 PM", "replies": [{"postID": "post6108794", "text": "You should also be able to buy it directly from honor. Just depends on who gives you the best deal.", "time": "12-16-2017 10:47 AM", "replies": []}]}, {"postID": "post6108792", "text": "Usa release date is January 8th. Price is rumored to be $600", "time": "12-16-2017 10:46 AM", "replies": []}]}, {"postID": "post6099316", "text": "https://www.androidcentral.com/honor-view-10", "time": "12-07-2017 02:49 PM", "replies": []}, {"postID": "post6121351", "text": "In Canada, it's available for pre-order from the Honor website.", "time": "12-29-2017 09:58 AM", "replies": [{"postID": "post6121539", "text": "Nice! How much is it for Canada?", "time": "12-29-2017 01:11 PM", "replies": [{"postID": "post6121576", "text": "Hmm, looks like I was still on the UK website earlier; yet it said it was the \"Honor Worldwide\" website. Strange...", "time": "12-29-2017 01:36 PM", "replies": [{"postID": "post6122018", "text": "That sucks. I was hoping that it was available in Canada for you to check it out", "time": "12-29-2017 11:18 PM", "replies": [{"postID": "post6122042", "text": "Me too! It looks like a fantastic phone!", "time": "12-29-2017 11:40 PM", "replies": [{"postID": "post6122290", "text": "Ugh... Too many good phone choices out there. I do really like this phone but I also like the mate 10 pro.", "time": "12-30-2017 10:17 AM", "replies": [{"postID": "post6122341", "text": "Yes, they are WAY too many good phones out there this year... So hard to choose which one to get next.", "time": "12-30-2017 11:39 AM", "replies": []}]}]}]}]}]}]}, {"postID": "post6145234", "text": "Ebay currently has the best prices. Amazon is absurd at like 770 for it.", "time": "01-25-2018 12:15 AM", "replies": []}, {"postID": "post6145437", "text": "Honor's global webpage seems to be selling the View 10 but it's still listed in Euros. Their US website didn't seem to have it listed; but perhaps I missed it while scrolling through. It is a gorgeous phone, to be sure.", "time": "01-25-2018 08:17 AM", "replies": [{"postID": "post6146205", "text": "You didn't miss it, its not there they only show the 7x and below. The UK store shows the view 10 the US page only shows the developer community thing and a place to get notified when its available. I got mine off ebay.", "time": "01-26-2018 04:52 AM", "replies": [{"postID": "post6146302", "text": "Hmm, weird that they don't sell it through their US store at the moment. Perhaps it has to do with Huawei not being able to make contract deals with US carriers... Blah.", "time": "01-26-2018 07:52 AM", "replies": [{"postID": "post6146561", "text": "It will be sold as unlocked. I called to see if any phone rep can give me the date. They mention early February . \nThe U.S store listed the phone but out of stock.", "time": "01-26-2018 01:17 PM", "replies": [{"postID": "post6146584", "text": "That's awesome! February is next week! Cool beans!", "time": "01-26-2018 02:06 PM", "replies": [{"postID": "post6148341", "text": "I bought the unlocked international version and it supports like 4 or 5 of att LTE bands. After some help from their device team they got the network to recognize it and I've got full LTE service. It however doesn't support but 2g or at least that's all I got when I was on T-Mobile network. Which sort of makes sense. I wouldn't hold my breath about a release because I talked to a rep when they lainched it and she said it could be more than six months before it's released and basically they just don't know especially with the US government so opposed to them working with US carriers and possible espionage", "time": "01-28-2018 09:54 PM", "replies": [{"postID": "post6148749", "text": "So glad your View 10 is up and running! How are you enjoying it so far? Yeah, I imagine it'll be a while before we see it in the States...", "time": "01-29-2018 11:48 AM", "replies": [{"postID": "post6148752", "text": "Yeah. It going be awhile since I called them again. She said ETA April. Hmmmmm.", "time": "01-29-2018 11:49 AM", "replies": []}]}]}]}]}]}]}]}]}, {"title": "So - who's going to pick up a V10?", "thread": [{"postID": "post6097916", "text": "Curious - who out there is going to pick up an Honor V10!? Looks like a pretty sweet phone. Thoughts on it, what do you like/not like?", "time": "12-06-2017 01:38 PM", "replies": [{"postID": "post6108809", "text": "For me, it is the price. The unlocked Note 8 was $500 for previous note 7 owners, with trade in of even a 5 year old phone. So if Huawei can offer a promotion significantly below that price then I would consider it. At the rumored $600... I will pass. \nObviously my situation is unique but I do find sales on different phones all the time. I will evaluate based on what I can get the phone for", "time": "12-16-2017 11:00 AM", "replies": []}]}, {"postID": "post6097982", "text": "I am. My alternative was Mate 10, but I'm happy they're giving this.\nPro---\nPrice\n3,700mhz battery\nUnlock \nFront finger scanner\nSlim body design\nCon\nWish it's 4000mhz battery", "time": "12-06-2017 02:29 PM", "replies": [{"postID": "post6108813", "text": "It's definitely a good alternative to the mate 10 especially since Huawei isn't releasing the mate 10 in the usa (they are only releasing the mate 10 pro)", "time": "12-16-2017 11:02 AM", "replies": []}]}, {"postID": "post6098097", "text": "I just ordered an LG G5, and comparing the specs, it seems as if the G5 has just a bit more - removable battery, USB 3 (and, thanks to Lineage, updatable to 8) - and a lot cheaper.", "time": "12-06-2017 03:55 PM", "replies": [{"postID": "post6108816", "text": "Well the g5 is also an older device. And it's lg. So of course it will be a lot cheaper.", "time": "12-16-2017 11:03 AM", "replies": [{"postID": "post6108885", "text": "Don't forget massive bootloop. I spent more time talking to rep than enjoy it.", "time": "12-16-2017 12:21 PM", "replies": [{"postID": "post6109178", "text": "Did it get fixed though? My g4 bootloped and lg usa said though luck since I had the h815.", "time": "12-16-2017 05:58 PM", "replies": [{"postID": "post6109316", "text": "Nope. I sold the device after it came back from repair.", "time": "12-16-2017 08:52 PM", "replies": [{"postID": "post6109873", "text": "I certainly don't blame you. I would not want to hang onto a phone like that even after it's fixed", "time": "12-17-2017 12:40 PM", "replies": []}]}]}]}]}]}, {"postID": "post6108906", "text": "From what I've seen about it spec-wise and based on overall hardware appearance, it looks like a gorgeous and smooth device.", "time": "12-16-2017 12:50 PM", "replies": [{"postID": "post6109183", "text": "It definitely looks really sleek and has great specs. I hope that the back is as nice or nicer than the honor 8 one", "time": "12-16-2017 06:00 PM", "replies": [{"postID": "post6109213", "text": "Yeah! The Honor 8's black is one sweet shade.", "time": "12-16-2017 06:47 PM", "replies": []}]}]}, {"postID": "post6145229", "text": "I did I purchased it the day after it was released. I love it coming from the OP5 the camera is better and I actually like EMUI after being a fan of stock android the last three phones (Moto X Pure, OP3T, OP5)\nBattery life is good so far and performance is great. I miss the alert slider and double tap of the power button to open the camera and the dev community of the OP but otherwise I'm an honor fan. I would love to be able to try out a mate 10 because of the larger battery and the AR abilities though.", "time": "01-25-2018 12:04 AM", "replies": [{"postID": "post6145436", "text": "So glad you are liking your V10! How does it feel in the hand?  And yes, EMUI is great! I really love it on my Honor 8. Super customizable and very fluid. I will miss the user experience when I upgrade (eventually).", "time": "01-25-2018 08:13 AM", "replies": [{"postID": "post6146207", "text": "Yep it is different than the relatively stock OOS but I like it. Much better than touchwiz on the Note 8 I had for a little bit and I LOVE having a fingerprint scanner on the front even though the v30 and 5t have excellent placement on the back, the front is still my preferred placement.\nI like it, I have large hands so using it one handed isn't an issue for me and being able to have a button to automatically pull down the notifications helps. It definitely feels weightier than my OP5 but I like that about phones. Its doesn't feel like the brick the Note 8 was though or like a demo phone like the v30", "time": "01-26-2018 04:56 AM", "replies": [{"postID": "post6146303", "text": "You're right - a little bit of weight adds a nice feel to a phone. It doesn't feel like you're holding something super fragile. I've never tried a fingerprint sensor on the front of a phone, but I imagine that it would certainly make things easier when checking notifications at a glance; when your phone is on a table or countertop. That button to pull down notifications is great! Glad you are enjoying your phone!", "time": "01-26-2018 07:54 AM", "replies": []}]}]}]}]}, {"title": "Notification Numbers rather than notification dots", "thread": [{"postID": "post6132064", "text": "I was wondering if it's possible to change notification dots to notification numbers in Honor V10 (which comes with EMUI 8) for apps like FaceBook, Pages Manager, whatsapp...etc?\nP.S. sorry that I created this question in a different section by mistake.", "time": "01-10-2018 04:01 AM", "replies": []}, {"postID": "post6135527", "text": "Hi there! My Honor 8 is running EMUI 5.0, so I unfortunately do not know a lot about the current new brand of EMUI. If there are no options to enable the numbers instead of notification dots on your display/theme settings, perhaps download a launcher that has those numbered badges. Honor's customer service is also an idea - perhaps contact them and see what they say?\nLet us know what happens!", "time": "01-13-2018 05:43 PM", "replies": []}, {"postID": "post6145235", "text": "You can. Its in options under notification methods its either icons or numbers.", "time": "01-25-2018 12:16 AM", "replies": []}]}, {"title": "Change honor v10 to english", "thread": [{"postID": "post6129317", "text": "I'm looking to change my v10 to English including voice assistant.", "time": "01-07-2018 08:12 AM", "replies": []}, {"postID": "post6130215", "text": "Welcome to the forums! You should find this setting by going to Settings --> Advanced Settings --> Language and Input.\nOnce you tap Settings, Advanced Settings is the third-last option on the screen. Language and Input is the second item on the next screen.", "time": "01-08-2018 09:07 AM", "replies": []}]}, {"title": "Honor V10 versus OP5T", "thread": [{"postID": "post6097017", "text": "Specs, size and price seem to be very similar.\nFor $500, seems to be a good phone. Also Huawei camera execution seems to be better than OP.\nSound off your thoughts here.", "time": "12-05-2017 07:28 PM", "replies": [{"postID": "post6108802", "text": "Has the price been confirmed for usa at $500? Most places I see either don't list usa or list $600 which I am assuming is the rough conversion from other regions", "time": "12-16-2017 10:54 AM", "replies": [{"postID": "post6108819", "text": "I am going by EUR = USD or slightly cheaper presumption. Hopefully it is cheaper than $500 which would be great.", "time": "12-16-2017 11:06 AM", "replies": [{"postID": "post6108837", "text": "I hope so. I mean they priced the honor 7x significantly lower than the 6x at launch so that they could be pushing some aggressive pricing to spark More interest in Huawei", "time": "12-16-2017 11:30 AM", "replies": []}]}]}]}, {"postID": "post6098136", "text": "I've never laid eyes on the OnePlus 5/5T, but from all I've heard, and from the specs of each, the V10 has the advantage.", "time": "12-06-2017 04:23 PM", "replies": [{"postID": "post6108806", "text": "Did Huawei say that the v10 has hd video on Netflix and the like? I know that the OnePlus 5 doesn't at the moment. OnePlus is working on it but no eta", "time": "12-16-2017 10:57 AM", "replies": [{"postID": "post6108817", "text": "No details yet. It would be nice if the V10 had it. Netflix is free for me since I have TMobile.", "time": "12-16-2017 11:05 AM", "replies": [{"postID": "post6108834", "text": "That's pretty awesome especially since Netflix keepsake upping the price. It's going up again next month.ugh.", "time": "12-16-2017 11:28 AM", "replies": []}]}]}]}, {"postID": "post6108908", "text": "Both are great options. \"Flagship killers\" for sure.", "time": "12-16-2017 12:51 PM", "replies": [{"postID": "post6109176", "text": "I really hope it comes to Verizon. I mean I can get a Verizon pixel 2 for $100 with 2 year commitment. Hopefully there will be a similar deal for the honor v10. Also I get that people don't like long term commitments but I don't plan to move from Verizon.", "time": "12-16-2017 05:57 PM", "replies": [{"postID": "post6109212", "text": "That would be great if it came to Verizon!", "time": "12-16-2017 06:46 PM", "replies": []}]}]}, {"postID": "post6111097", "text": "Honor V10 checks a lot of boxes for the price. Maybe they are waiting for the flash sales for the 7X to die down before announcing it, I guess.", "time": "12-18-2017 03:52 PM", "replies": [{"postID": "post6112072", "text": "At this point they are probably going to wait until CES to announce it.", "time": "12-19-2017 01:14 PM", "replies": []}]}, {"postID": "post6126582", "text": "Honor does have a very good camera. I'd say it's a pretty close race. I think either would be a great bargain.", "time": "01-04-2018 09:15 AM", "replies": []}]}, {"title": "The Honor View 10", "thread": [{"postID": "post6096885", "text": "There is a lot packed into this phone. 6 GB of RAM, and 128 GB of storage it's pretty good. The blog is listing a 499 Euro, and a 449 British pound price, but no USD yet.\nFor more info: https://www.androidcentral.com/honor-view-10", "time": "12-05-2017 04:10 PM", "replies": [{"postID": "post6108796", "text": "Rough conversion would be $600 usd, however Huawei might decide to adjust the price in the usa market.", "time": "12-16-2017 10:49 AM", "replies": []}]}, {"postID": "post6096973", "text": "Wow, this looks like a beautiful phone!", "time": "12-05-2017 06:19 PM", "replies": []}, {"postID": "post6097018", "text": "Looks like a January 8 release date from what I read over at either Gizmodo or Engadget.", "time": "12-05-2017 07:29 PM", "replies": []}, {"postID": "post6097230", "text": "This probably my first Honor phone. Can't get Mate 10 so I'm here we go.", "time": "12-06-2017 12:29 AM", "replies": [{"postID": "post6108798", "text": "The mate 10 isn't an honor phone though. Yes Huawei makes both but the honor line is a distinctly separate line", "time": "12-16-2017 10:50 AM", "replies": []}]}, {"postID": "post6097331", "text": "Phone looks sweet. Not sure about that front fps tho", "time": "12-06-2017 03:58 AM", "replies": [{"postID": "post6097491", "text": "It would take some getting used to, for sure!", "time": "12-06-2017 08:00 AM", "replies": []}, {"postID": "post6108799", "text": "I love the front fps! Back fps means that I have to pick up the phone to unlock every time when on my desk", "time": "12-16-2017 10:51 AM", "replies": [{"postID": "post6109410", "text": "Or dl aod app and double tap to wake up the phone.", "time": "12-16-2017 11:41 PM", "replies": [{"postID": "post6110912", "text": "That doesn't help with unlocking the phone with fps though.", "time": "12-18-2017 12:52 PM", "replies": [{"postID": "post6117466", "text": "Thank god the Honor V10 has face unlock", "time": "12-25-2017 08:55 AM", "replies": [{"postID": "post6117915", "text": "Waiting to get sued like One Plus???", "time": "12-25-2017 09:00 PM", "replies": [{"postID": "post6118476", "text": "It is only an issue if they infringed on a patented process in their implementation. Of course only they would know, but hopefully they were smart enough not to steal someone else's technology... Again...", "time": "12-26-2017 12:59 PM", "replies": [{"postID": "post6120952", "text": "Hopefully they don't violate any patents, for everyone's benefit.", "time": "12-28-2017 11:10 PM", "replies": [{"postID": "post6121543", "text": "Well companies that violate patents benefit obviously... Granted in an unscrupulous way", "time": "12-29-2017 01:12 PM", "replies": []}]}]}]}, {"postID": "post6118473", "text": "How well did it work? I tried it on an old Samsung and it was pretty meh. Was not accurate enough.", "time": "12-26-2017 12:57 PM", "replies": []}]}]}]}]}]}, {"postID": "post6098638", "text": "Wonder if it'll get release in US carrier's or just best buy like the 6x. I want to check it out in person", "time": "12-07-2017 03:50 AM", "replies": [{"postID": "post6099275", "text": "I wonder if they're doing promotion like Honor 7x.\nIt'll be unlock version, so no carriers support. Carrier is for big boy since they have enough cash to throw at them.", "time": "12-07-2017 02:09 PM", "replies": []}]}]}, {"title": "Honor V10 Battery Life", "thread": [{"postID": "post6097919", "text": "Anyone catch the battery life details on the Honor V10?? What's the size and what can we expect?", "time": "12-06-2017 01:38 PM", "replies": []}, {"postID": "post6099653", "text": "Battery size is 3,750 mAh with a 1080P screen.", "time": "12-07-2017 07:05 PM", "replies": [{"postID": "post6101411", "text": "My goodness, what an impressive battery size!", "time": "12-09-2017 10:00 AM", "replies": [{"postID": "post6101447", "text": "Indeed... the other Android manufacturers ought to follow their lead!", "time": "12-09-2017 10:37 AM", "replies": [{"postID": "post6101463", "text": "Absolutely!", "time": "12-09-2017 10:51 AM", "replies": []}, {"postID": "post6108789", "text": "I hope so too. Most have been stuck around 3000-3500mah. I am glad that honor was able to push the envelope a little bit here", "time": "12-16-2017 10:44 AM", "replies": [{"postID": "post6110553", "text": "Honor seems to always do unique things with their phones - hopefully this helps them stand out a bit. They are underrated and it's unfortunate.", "time": "12-18-2017 08:46 AM", "replies": [{"postID": "post6110914", "text": "Given that they are giving a good push right now in the united states, let's hope that that effort pays off. But they do need to work on the update situation too before that happens, imo.", "time": "12-18-2017 12:53 PM", "replies": [{"postID": "post6111057", "text": "Agreed. Hopefully they get the updates issue together; because Honor has a ton of great potential.", "time": "12-18-2017 03:13 PM", "replies": [{"postID": "post6111094", "text": "I really hope so. They really improved on their software from emui 4 to 5,and while not perfect, performs well enough. So they really need to improve on updates", "time": "12-18-2017 03:51 PM", "replies": []}]}]}]}]}]}]}, {"postID": "post6108788", "text": "That's a good size. Hope it gets stand out battery life. My moto z play has a smaller battery and can do 15-18 hr SOT. It also has 1080p", "time": "12-16-2017 10:43 AM", "replies": []}]}, {"postID": "post6111508", "text": "Yes, keep up on the updates. I agree 110%", "time": "12-19-2017 01:39 AM", "replies": []}]}, {"title": "Honor View 10 Camera - best yet?", "thread": [{"postID": "post6099305", "text": "Is the camera on the V10 the best Honor has ever produced? Obviously camera quality super important to me, but haven't dug too deep into the specs yet. Is it solid??", "time": "12-07-2017 02:37 PM", "replies": []}, {"postID": "post6103829", "text": "Does it have optical image stabilization (OIS)?", "time": "12-11-2017 03:17 PM", "replies": []}, {"postID": "post6104196", "text": "Nope", "time": "12-11-2017 08:57 PM", "replies": []}, {"postID": "post6108787", "text": "Best honor phone, probably, but also probably the most costly so that makes sense. It probably isn't as good as Huawei mate 10 pro, and Huawei makes honor... If that's what you are referring to.", "time": "12-16-2017 10:41 AM", "replies": []}, {"postID": "post6108917", "text": "From what I've heard it detects motion when it focuses and adjusts the shutter speed and iso accordingly to get the best photo. Is this feature in the Mate 10? In my opinion that is a great feature! I assume that works in the Automatic setting. \nIs this feature in the Mate 10 or any other phone? Not sure if it will replace OIS (time will tell), but it's a huge step forward. This phone may not need OIS?? Looking forward to the in-depth AC review.", "time": "12-16-2017 01:03 PM", "replies": [{"postID": "post6109171", "text": "That's pretty neat indeed. Hey if it works better than optical image stabilization then that's even better!", "time": "12-16-2017 05:54 PM", "replies": [{"postID": "post6109753", "text": "Just checked and the mate 10/10 pro also have this motion detection (AI?) feature. Those cameras also have OIS, so it will be very interesting to look at comparisons. OIS mostly addresses \"operator\" induced error, or shaky hands on the camera (a definite problem in this household!). A combination of OIS and motion detection might just be pretty darn good.", "time": "12-17-2017 10:37 AM", "replies": [{"postID": "post6110909", "text": "That would be great indeed. Especially for me because I like to take pictures of my active child.", "time": "12-18-2017 12:50 PM", "replies": []}]}]}]}]}, {"title": "Oreo or Nougat on the Honor V10?", "thread": [{"postID": "post6098891", "text": "Does the V10 ship with Oreo or Nougat?", "time": "12-07-2017 09:19 AM", "replies": [{"postID": "post6099270", "text": "Oreo with Emui 8.0.", "time": "12-07-2017 02:06 PM", "replies": []}]}]}, {"title": "Huawei officially reveals Honor V10", "thread": [{"postID": "post6090606", "text": "Huawei just revealed the Honor V10\nWith its specs, pricing is reasonable https://www.notebookcheck.net/Huawei....267316.0.html", "time": "11-30-2017 06:58 AM", "replies": [{"postID": "post6091766", "text": "Definitely looks well priced", "time": "11-30-2017 08:21 PM", "replies": []}]}, {"postID": "post6090975", "text": "Yeah, I'd love this phone, but I prefer software nav. I bet the 970 is a beast.", "time": "11-30-2017 12:26 PM", "replies": [{"postID": "post6091768", "text": "I like this better due to front fps", "time": "11-30-2017 08:22 PM", "replies": [{"postID": "post6091851", "text": "Back fps!! Oh how I miss that", "time": "11-30-2017 08:53 PM", "replies": []}]}]}, {"postID": "post6090998", "text": "I doubt we're gonna see this in US tho. sad face", "time": "11-30-2017 12:46 PM", "replies": [{"postID": "post6091771", "text": "Ugh. That sucks", "time": "11-30-2017 08:23 PM", "replies": []}]}, {"postID": "post6091856", "text": "Definitely a good price. We're missing a lot of good phones", "time": "11-30-2017 08:55 PM", "replies": []}]}]
