[{"title": "Does my screen protector have the rainbow effect?", "thread": [{"postID": "post6151245", "text": "So I got my phone a few days ago, it's the Sony Xperia XA1 Ultra. One day after that I noticed this splotch slightly off the center of my screen, it's like a rainbow and it moves when I press and drag my finger on different parts of the screen. It looks like a oil spill. So tech savvy people, is this my screen protector displaying the rainbow effect or is this an issue with my screen?", "time": "02-01-2018 12:45 AM", "replies": []}, {"postID": "post6151281", "text": "Most likely the protector if you have one on. Air trapped in there, most likely, or a spot that didn't quite stick. \nIf you don't have a screen protector on, however, then it is a problem with the glass sticking to the display panel, and that should be replaced under warranty.", "time": "02-01-2018 01:27 AM", "replies": []}, {"postID": "post6151296", "text": "I mean I do have a protector but I've never heard anyone saying anything about the splotch being able to move/spread, which is why I'm concerned. It's become notably bigger, so is it the rainbow effect?", "time": "02-01-2018 02:06 AM", "replies": []}, {"postID": "post6151297", "text": "It looks like this. I do have a tempered glass screen protector on there.", "time": "02-01-2018 02:09 AM", "replies": []}, {"postID": "post6151621", "text": "That is definitely the protector not sticking to that spot. It moves because the area just keeps lifting. You can ask the manufacturer for a replacement if they have that kind of warranty (the protector, not the phone). But yeah, nothing to be concerned about other than the nuisance of having that always on your screen. If it gets too bad, though (actually fully lifting) you might also notice reduced touch sensitivity on that area due to the added air layer between the screen and the protector, but that would mean that, somehow the protector has really lifted up and you're better off replacing it anyway.", "time": "02-01-2018 11:04 AM", "replies": []}]}, {"title": "Why isn't there a forum for XA1", "thread": [{"postID": "post5995348", "text": "We need our own dedicated forum for the XA1 just replace the XA with the updated XA1.", "time": "09-27-2017 02:18 PM", "replies": []}, {"postID": "post5995553", "text": "it's a brand new device and so think it needs sometime to gain popularity.", "time": "09-27-2017 05:06 PM", "replies": []}, {"postID": "post5996929", "text": "Exactly why it should be made so that XA1 users can get support with their new device.", "time": "09-28-2017 04:34 PM", "replies": []}, {"postID": "post5996951", "text": "Agree. I have a XA1 Ultra but no forum to post about it in.", "time": "09-28-2017 04:54 PM", "replies": []}, {"postID": "post6003971", "text": "I see the XZ series have their own forums and they are newer then the XA1 lol", "time": "10-04-2017 12:45 PM", "replies": []}, {"postID": "post6012967", "text": "No love for Sony. The BlackBerry Motion was unveiled today and there's already a sub-forum.", "time": "10-09-2017 08:32 PM", "replies": []}, {"postID": "post6013114", "text": "You have just started one ;-)\nThat looks a nice device!", "time": "10-09-2017 11:01 PM", "replies": []}, {"postID": "post6016844", "text": "The forum is here: https://forums.androidcentral.com/sony-xperia-xa1/\nEnjoy!", "time": "10-12-2017 02:48 PM", "replies": []}, {"postID": "post6082816", "text": "OK the forum is all up and running so all of you who have the XA1 head over there just follow James' link above and it will take you there ☺️", "time": "11-23-2017 11:23 PM", "replies": []}]}, {"title": "System UI is not working and my phone is unresponsive", "thread": [{"postID": "post5931097", "text": "I was juston storage and clearing the cache i then turned my phone off and it lit up saying System IU has stopped then it gave me two options to wait or close app so i clicked close app and nothing happened and now my phone is unresponsive what should i do. it is a Sony Experia XA it is quite a new phone", "time": "08-21-2017 05:13 PM", "replies": []}, {"postID": "post5931102", "text": "Mod Note: Thread moved for better visibility.", "time": "08-21-2017 05:18 PM", "replies": []}, {"postID": "post5931106", "text": "Welcome to the forums. You could try these steps.http://support.sonymobile.com/global...-on-my-device/", "time": "08-21-2017 05:21 PM", "replies": []}]}, {"title": "How to connect sony xperia xa to windows xp pc?", "thread": [{"postID": "post5917230", "text": "I already installed wmp 11 and sony pc companion too. Xperia companion doesn't work showing a message that its not a valid win 32 application . I have installed sony pc companion 2.1 but it wont start up. So can u pls mention how i can connect it? My windows version is SP3", "time": "08-08-2017 11:51 PM", "replies": []}, {"postID": "post5917322", "text": "Welcome to Android Central! It's probably not compatible with XP, which is a pretty old Windows version. I would strongly recommend upgrading your computer, because Microsoft no longer supports XP, including security updates. That leaves you wide open to cyberattacks.", "time": "08-09-2017 01:45 AM", "replies": []}]}, {"title": "what this icon mean on my sony phone?", "thread": [{"postID": "post5878656", "text": "i don't know with this icon, after i reset my phone\nthis icon come out", "time": "07-09-2017 04:36 AM", "replies": [{"postID": "post5878669", "text": "That symbol represents that the data saver is on.\nData saver prevents apps from accessing network in the background (when you are on mobile network, and not on Wifi), and saves you precious mobile data and battery. Go to quick settings and toggle the data saver switch if you want to turn it off.", "time": "07-09-2017 05:00 AM", "replies": []}]}, {"postID": "post5878678", "text": "and what happen to my front camera if mean like this", "time": "07-09-2017 05:11 AM", "replies": [{"postID": "post5878683", "text": "Maybe it's because you still have Data Saver on? Try turning off Data Saver and rebooting and see if it's still effecting you front camera.\nEither way as suggested it thinks the camera is being used by another application. Maybe start up in Safe Mode and see if it still gives the same error as well", "time": "07-09-2017 05:25 AM", "replies": []}]}]}, {"title": "BlackHorizontal lines on screen", "thread": [{"postID": "post5857912", "text": "My phone is an xperia xa and i accidentally got it wet. The only part that got wet was the uper half. Now after i dried it up everything's normal except that there's a horizontal line at the middle. A few hours later i noticed that it was flickering and then start to double then i tried to not use my phone for a while for about 5 hours while shut down, then when i turned it on there were still lines in the middle then shortly after more lines start to appear starting from the middle of the screen extending to the lowest part of the screen. When i screenshot it, nothing appears on the picture. What should I do? And what part of my phone has a problem?\nOn the first check there's moisture inside the phone and my camera looks foggy but now the moisture is gone from that part, the camera got inverted and the back cam doesn't work.", "time": "06-21-2017 04:27 AM", "replies": []}, {"postID": "post5857927", "text": "Really hard to diagnose over text, but this definitely sounds like a hardware issue (even more since you say the lines don't appear on a screenshot). Because of the flickering, I'd say it's either a connector that's, well, not connecting (water might have gotten inside and causing false contact), a damaged display driver, or worst case scenario, a damaged display panel. And the more you use your phone while wet the more damage you're doing, so power it off and either let it dry off in rice or desiccant bag for a few days or just take it straight to a repair shop to get diagnosed.", "time": "06-21-2017 04:57 AM", "replies": []}, {"postID": "post5857999", "text": "How much do you think would it cost for te repair?\nThank you for the reply", "time": "06-21-2017 06:54 AM", "replies": []}, {"postID": "post5858929", "text": "I really couldn't say... You can call a repair center and try to get an estimate from them on changing the whole display panel, which is, I believe, the most expensive option, and use that for reference. \nIf you're in the US and you have renter's or home owner's insurance (or device insurance), you can check your policy and phone damage is usually covered, BUT make sure that either the deductible is worth using your insurance and that your payments won't go up from filing a device claim.", "time": "06-21-2017 09:41 PM", "replies": []}]}, {"title": "Is it a good idea to buy Sony Xperia XA1 in India?", "thread": [{"postID": "post5756045", "text": "my first mobile phone was sony mobile but then i have moved to other brands. now i need to buy a new phone and they have just launched Xperia XA1 on OnlyMobiles.com \nWhat is your opinion about this phone? I have gone thru the detail specification. I found little bit expensive. What do you think?", "time": "04-12-2017 02:27 PM", "replies": []}, {"postID": "post5802252", "text": "XA1 costs 20k in India (about $300).\nFor that price you only get a 720p screen, a mediatek P15 chipset and 2300mah battery. \nSo its clearly overpriced.\nHere are some better alternatives. \nMoto G5 Plus - 16k ($250), better camera, full hd screen, 3000mah battery and SD625 chipset. \nLenovo P2 ($250) - 5000 mah battery and SD625 chipset. \nLenovo Zuk Z2 ($250) - SD820 chipset. \nSmartron srt.phone ($200) - SD625, 4GB ram.", "time": "05-05-2017 02:43 PM", "replies": []}]}, {"title": "streaming problem on Xperia XA ultra", "thread": [{"postID": "post5793085", "text": "Hi, i bought xperia Xa ultra couple of days back. but feeling unhappy to see the any vedio streaming performance on youtube and facebook. because i can see vedio started well but couple of second vedio hanged but sound is running smoothly. how to resolve the problem?", "time": "04-30-2017 02:50 AM", "replies": []}, {"postID": "post5795764", "text": "Welcome to Android Central! Does this happen on both wi-fi and mobile data? Does it persist in Safe Mode? How do I enable and exit safe mode? – Sony Xperia® XA support (United States)", "time": "05-01-2017 04:26 PM", "replies": []}]}, {"title": "should I buy sony xperia xa dual.i am from india", "thread": [{"postID": "post5468339", "text": "My budget is INR 20000. fingerprint sensor is not necessary should i buy this or chose other brands", "time": "10-05-2016 10:25 PM", "replies": []}, {"postID": "post5756050", "text": "I am also planning to buy Xperia XA1. Let others reply to our question about this phone. Their prices in India is little costly it seems.", "time": "04-12-2017 02:29 PM", "replies": []}]}, {"title": "Why does a Broken image keeps appearing when i take photos", "thread": [{"postID": "post5720237", "text": "I have sony xperia XA and everything worked fine,until one day i decided to shoot a video in airplane mode and the video wouldnt play. Since then every photo/video i take it appears as a broken image. Tried to do: clear data,restart phone and return album app to factory state there are still broken images everywhere!! So... Any suggestions,id really appreciate it! Thank you!!", "time": "03-21-2017 05:22 PM", "replies": []}, {"postID": "post5720751", "text": "Welcome to Android Central! Is the camera app set to save photos and videos to Internal Storage or an SD card?", "time": "03-22-2017 02:48 AM", "replies": []}]}, {"title": "Sony Xperia XA Ultra HD Calling T-Mobile", "thread": [{"postID": "post5667791", "text": "I have a Sony Xperia XA Ultra Model F3213. I was wondering if anyone knows if it's supports HD Calling. When I had my Moto X Pure Edition Model XT1575 unlocked which my Sony is also and I got it from Best Buy. My Moto X Pure would tell me if the call was HAD between my other T-Mobile lines. I don't see that indication on my Sony Xperia XA Ultra . I do know that my account requires no special provisions to use the features but not sure if it's a feature on this phone. Account level T-Mobile says as long as the phone supports it then it's good to go.\nAny help would be greatly appreciate", "time": "02-04-2017 05:20 PM", "replies": []}]}, {"title": "Keyboard vibration Xperia XA doesn't work", "thread": [{"postID": "post5650850", "text": "Hi,\nGot my device formated and since when the keyboard vibration doesn't work. :\nOption Vibrate on touch is on and Stamina modes for saving battery are off. \nCheers!", "time": "01-20-2017 06:15 PM", "replies": []}, {"postID": "post5651052", "text": "Welcome to Android Central! The Vibrate on Touch option is typically for the nav buttons (i.e., Home, Back, etc.), not the keyboard. Go to Settings>Language & Input, select your keyboard, and look in its settings. There should be a Haptic Feedback option there.", "time": "01-20-2017 10:38 PM", "replies": []}, {"postID": "post5653640", "text": "The curious thing about it is, it was working before I got it formated. I checked the seetings on the keyboard but nothing about it in there... Anyway, I'm starting to get used without the vibration while texting. \nThanks a mill for your answer!", "time": "01-23-2017 08:13 AM", "replies": []}, {"postID": "post5654557", "text": "Is Stamina mode on? Check your power-saving settings and make sure Stamina mode is off.\nAlso, when you go to Settings>Language & Input, are you tapping the gear icon next to your keyboard to get to the keyboard settings?", "time": "01-23-2017 10:00 PM", "replies": []}, {"postID": "post5655467", "text": "I've found the option on the Swiftkey Configurations...Thank you very much, it is working now! o/", "time": "01-24-2017 04:15 PM", "replies": []}, {"postID": "post5655555", "text": "Hello! Yes, Stamina was off, and there was no gear near the keyboard, however, I could find the option \"Use the Android defeault vibration\" on Swiftkey > Typing > Sound and Vibration.\nNow it is working. o/\nThanks anyway!", "time": "01-24-2017 05:40 PM", "replies": []}]}, {"title": "Touch Sensitivity", "thread": [{"postID": "post5641388", "text": "Has anyone else noticed the XA Ultra to be...Ultra sensitive to touch? I like the handset and it's good bang for the buck but I notice the touch sensitivity to be rather to high. When, I'm scrolling through page lists like Tapatalk, CNN, or any list links are 'clicked' or activated when I certainly don't expect or want them to be (and aren't on any of my other handsets). \nIs there a suggested fix? ...Not sure I can happily deal with it.", "time": "01-12-2017 01:32 PM", "replies": []}]}, {"title": "Ports on xa", "thread": [{"postID": "post5589912", "text": "There are two ports on my xperia xa ,one I know is for charging can the other one be used for printing?", "time": "12-02-2016 11:59 AM", "replies": []}, {"postID": "post5589925", "text": "There's the microUSB port, for charging, data, probably MHL and OTG. There's an earphone \"port\" (jack). If it's round and about 3.5mm in diameter, it's that.", "time": "12-02-2016 12:12 PM", "replies": []}, {"postID": "post5589960", "text": "Sorry I forgot about the earphone port. My phone has two ports on the bottom, the charge port and one more. I am wanting to be able to print from the phone so can I do from the charge port. Thanks for the reply.", "time": "12-02-2016 12:32 PM", "replies": []}, {"postID": "post5590004", "text": "Sorry I forgot about the earphone port. My phone has two ports on the bottom, the charge port and one more. I am wanting to be able to print from the phone so can I do from the charge port. Thanks for the reply.", "time": "12-02-2016 01:06 PM", "replies": []}]}, {"title": "where can i get a sim card holder tray for a sony xperia xa ultra?", "thread": [{"postID": "post5587734", "text": "I need to get a sim card holder tray for a sony xperia ultra does any know where i can find one tried looking all over online can't find one anywhere. can someone point me in the right direction?", "time": "12-01-2016 01:46 AM", "replies": []}]}, {"title": "What is the snapchat quality like on the Sony Xperia XA?", "thread": [{"postID": "post5578961", "text": "I'm thinking of swapping from my iPhone 5c to the Sony Xperia XA. I had an Xperia in 2013 & 2014 before I got my iPhone but I now want to get a bigger phone that won't make me broke ((like the iPhone 6's or 7's)). My main concern is the Snapchat quality on the Xperia XA due to remembering that the front camera quality on the Snapchat app on my old Xperia was terrible and seemed as though the image was zoomed in or cropped.", "time": "11-24-2016 08:43 PM", "replies": []}, {"postID": "post5579377", "text": "Mod note. Moved to the Xperia XA forum.", "time": "11-25-2016 06:02 AM", "replies": []}]}, {"title": "Can you tell le whey there is no headset/headphones icon on Xperia XA dual Sim ?", "thread": [{"postID": "post5547610", "text": "Hi all\nNew to Marshmallow OS\nAm using Sony Xperia XA Dual sim\nThe sound works fine but no icon when its plugged in.\nI dont see the headset/headphones icon on the top of the phone\nCan you help please ?\nThanks", "time": "11-05-2016 02:21 PM", "replies": []}, {"postID": "post5548339", "text": "Welcome to Android Central! I'm not directly familiar with that phone, but not all devices will show a headphone icon in the status bar when headphones are plugged in. My Nexus 6P does not show one.", "time": "11-06-2016 12:20 AM", "replies": []}]}, {"title": "Can you tell le whey there is no headset/headphones icon on Xperia XA dual Sim ?", "thread": [{"postID": "post5547605", "text": "Hi all\nNew to Marshmallow OS\nAm using Sony Xperia XA Dual sim\nThe sound works fine but no icon when its plugged in.\nI dont see the headset/headphones icon on the top of the phone\nCan you help please ?\nThanks", "time": "11-05-2016 02:18 PM", "replies": []}, {"postID": "post5547705", "text": "Mod note. Moved to the Xperia XA forum for more visibility.", "time": "11-05-2016 03:26 PM", "replies": []}]}, {"title": "Ended up just keeping both the XA and the X...", "thread": [{"postID": "post5372069", "text": "So in the end I just decided to keep both models as I ended up getting both at less than the price of just the X alone. Basically I've got $400 in both new unlocked devices so I'll just swap back and forth. By far I like the XA smaller subtle size and no side bezels. On paper the size difference seems to be nothing but in hand, the XA is hugely the better and easier one hander device although it's slower. Being new to Sony I'll just keep both and enjoy each model for what I need or mood I'm in. All that struggle to decide on which one and ironically I end up with both. Mainly or only due to the stellar deal I received. I have a feeling though that the XA will end up being my choice and the X will come into play down the road once the XA plays out.", "time": "08-27-2016 07:31 PM", "replies": []}, {"postID": "post5372238", "text": "I think that sounds like a good plan. I looked into the X because of your post, but I agree with you on the aesthetics. The XA looks nicer, even though the battery life isn't as great.", "time": "08-27-2016 08:23 PM", "replies": []}, {"postID": "post5372315", "text": "Yeah I agree. It definitely lags too performance wise. I simply do not get it. Why make a more appealing looking device but do so with it being the low end of your three main device showcase. The X and X performance should be the ones with no bezels on the sides and the ones that feel better in one hand with more rounded corners. Makes me wish I could land a job in product design and development. Most top end companie", "time": "08-27-2016 08:59 PM", "replies": [{"postID": "post5372338", "text": "Sorry. Most top end companies no doubt do well with innovation. It's why we buy their products. What many lack and really lots do in this world is not the knowledge but the lack of common sense which when coupled with knowledge produces incredible results and products that are perfect. If Sony which I believe their intention was to create a compact phone here with this series makes one more user friendly and eye appeal better looking then produces that best concept in the cheapest and lowest end device is nothing more than no thought put forth in it unless they purposely dis this BC of money which would be more of what's going on. They knew a $250 phone would be their money producer so more thought went into the XA than than both the X and Performance in terms of attractiveness. Either of those two concepts are in place. Could be both lol", "time": "08-27-2016 09:08 PM", "replies": []}]}, {"postID": "post5376112", "text": "Okay after spending some time with the X and the XA, the X is indeed quite superior in every way. So much that I just took my XA back and since I got the X for $199, I'm never looking back. I can live with it feeling a tad larger as the performance and screen resolution far outweigh that subtle size difference. If I do anything else with Sony would be the X compact that is rumoured so I'll sit back and wait on that if it happens. From what I read, it will be equal to the X Performance spec wise so depending on pricing, that 4.7 size would be perfect! Until then, I'm digging my X!!! Holding both phones side by side same picture, resolution was the key factor as to why I took the XA back. Being that noticeable to the naked eye was enough for me to let it go back. I take quite a few pics so resolution is a big deal to me. I'm used to the X now so I saved $199 and Saved even more on the X. At the right price, I highly recommend the X!!", "time": "08-29-2016 01:01 PM", "replies": []}, {"postID": "post5543743", "text": "I'm with you on this. I just bought an Axon 7 but I can't seem to let go of my XA Ultra. I love everything about that phone except the performance. It just doesn't have enough horsepower for my taste. The screen and build quality are great but the performance is just average.", "time": "11-03-2016 01:31 PM", "replies": []}]}, {"title": "Android Pay not working", "thread": [{"postID": "post5446760", "text": "Whn I tap the phone and enter my pattern it will keep asking me to do it ove and over again. I entered it five times. I tried it at the gas station and the grocery store. It's very frustrating.", "time": "09-25-2016 08:57 PM", "replies": []}, {"postID": "post5447054", "text": "Do you have Smart Lock on? If so, try turning it off, and unlock the phone with a PIN, password, or pattern. In this situation, Android Pay shouldn't require you to reenter your unlock method upon tapping the phone. This is not necessarily meant to be a definitive solution--it's more of a troubleshooting step.", "time": "09-26-2016 01:31 AM", "replies": []}, {"postID": "post5447416", "text": "No, the smart lock isn't enabled. I have the phone unlocked before even tapping it. I had no problem using it before on my c4 ultra. I just recently received a new card from Chase with the security chip. So i had to wait until they officially supported Android Pay to start using it again. I added my card to Pay and the bank sent me a confirmation telling me I'm good to go. I haven't been able to actually get it to work. Just asks for the pattern over and over again, but never works.", "time": "09-26-2016 08:21 AM", "replies": []}, {"postID": "post5447591", "text": "What happens if you remove the card, then add it back?\nAlso, you mention that the phone is unlocked before you tap to pay--I assume you initially unlocked with a pattern, correct?", "time": "09-26-2016 09:57 AM", "replies": []}, {"postID": "post5448204", "text": "I haven't tried that yet. Yes, I always unlock my device with a pattern.", "time": "09-26-2016 02:31 PM", "replies": []}, {"postID": "post5453314", "text": "So I deleted the card and added it back on. Still getting Pay to ask me to unlock it constantly. Haven't successfully used Android Pay yet. It's very frustrating since I don't know how to fix the problem.", "time": "09-28-2016 11:04 PM", "replies": []}, {"postID": "post5453409", "text": "Hmm, not sure what to try next. Maybe go to Settings>Security and Clear Credentials.", "time": "09-29-2016 12:47 AM", "replies": []}]}, {"title": "Questions for XA owners", "thread": [{"postID": "post5408181", "text": "Hey everyone,\nI'm currently in need of a budget phone and I can get a really good deal on an Xperia XA. But I just had questions for owners of the phone:\nHow is the mic? Does it take good voice recordings? I have a hearing impairment and due to this I often take voice recordings of 2 hour + university lectures so I need that to be decent.\nAlso, how loud is the sound through the earphones? I rarely listen to music with speakers, so that isn't an issue.\nAny other thoughts or issues? I am aware of the battery issue.\nThanks in advance for any help, I appreciate it!", "time": "09-10-2016 04:15 AM", "replies": []}, {"postID": "post5417329", "text": "Sorry you've not had an answer. I'll try my best to help. I briefly had the XA and minus me, I think by just bad luck getting two that had software issues, that it was an overall good phone for $250. The speaker phone you ask about is average to normal. Not overly low nor to me not loud enough but all phones lack the extra sound needed to talk and here by speaker. Screen resolution is decent at 720 and speed was average. Not bad. Overall if there is any way you can get best buy to knock $50 off, I'd jump on it. You'll enjoy the phone just as long as you don't have the luck I did with software messing up. I've since upgraded to the model up to the X and I will say that between the two there are very noticeable differences in speed and resolution. Had it not been for best buy offering me a free upgrade to the X for the 199 I paid in the beginning for the XA, that I would still have it. Hope this helps.", "time": "09-14-2016 02:16 AM", "replies": []}, {"postID": "post5449451", "text": "The mic(s) are very good - Sony's own Audio Recorder app does a fine job of recording stereo in high quality setting (there are other lower quality settings which use less space.)\nOverall it's a respectable mid-range device with practically no bezel at the side. I've had no regrets in the 6 weeks I've owned mine.", "time": "09-27-2016 07:41 AM", "replies": []}]}, {"title": "Decided to stick with my Sony XA. Skin case just arrived. Pics", "thread": [{"postID": "post5349860", "text": "I actually am on my third phone due to buggy software but the third one has worked perfectly. I really wanted the Z5 Compact but it's double the cost and plus I got mine for $199 at Best Buy. Here are some pics with the thin skin case. It's no longer slippery now. I've got a full glass screen protector coming and as well as a red case.", "time": "08-20-2016 03:41 PM", "replies": []}, {"postID": "post5349898", "text": "I wouldn't even put a screen protector on mine never mind a case - I don't find it slippy. Still, yours looks nice.\nThe case on my SE is a relic from a friend's 5S otherwise I wouldn't bother.", "time": "08-20-2016 03:57 PM", "replies": []}, {"postID": "post5381438", "text": "thats a very good case , was lookin for one case for my brother", "time": "08-31-2016 11:06 AM", "replies": []}, {"postID": "post5409846", "text": "Looking pretty good!", "time": "09-10-2016 07:37 PM", "replies": []}]}, {"title": "Exchanging my XA for the X (not performance model)", "thread": [{"postID": "post5353984", "text": "I just ordered the Experia X, same size as my XA but better specs. More ram and better resolution I believe. Faster processor. It set me back 525 vs my 200 for the XA. Is this a mistake or does anyone have experience with both of these models. Note the model I ordered is not the latest flagship. I believe it's body is identical to the XA I have but has a 650 Core processor and 3g ram. I'm having a difficult time on this move as I'm highly unfamiliar with Sony phones. If it were Motorola or apple I'd know. Any help would be greatly appreciated", "time": "08-21-2016 10:45 PM", "replies": []}, {"postID": "post5357553", "text": "Sony phones are pretty good in terms of reliability, especially the more high-end ones. I never had a problem with my Z3 Compact until it fell off my hospital bed one time too many.\nUpdates are good from Sony - they may be slow to update at times but you're pretty much guaranteed they'll keep their word and you'll get a solid version.\nIf you like the XA style (I love it) but want that extra performance, power and RAM, then I say go for it.", "time": "08-23-2016 04:14 AM", "replies": []}]}, {"title": "What colour will you be going for?", "thread": [{"postID": "post5191187", "text": "I think we have black, white, lime gold (which looks more like the gold on my note 5) or bros gold? \nI was tempted to go back to boring black, but the bro gold look isn't as bad or bright as I thought, and actually looks more on the copper side. \nWhat will you go for?\nPosted via the Android Central App", "time": "05-23-2016 02:36 AM", "replies": []}, {"postID": "post5193803", "text": "The lime gold, most likely if the price is right.", "time": "05-24-2016 03:06 PM", "replies": []}, {"postID": "post5305191", "text": "Price is not right. Far from it. Priced at $300 in my country when a $105 phone like Xiomi Redmi 3S beats it. Waste of momey, won't get any future android updates either as its mediatek cpu.", "time": "08-06-2016 12:15 PM", "replies": []}, {"postID": "post5351642", "text": "I only had the choice of the grey. Price didn't concern me - I consider it £240 well spent, and I have a physical shop to return to if anything goes wrong plus a 2 year guarantee (although by then I'll have something else); phone life, like real life is ephemeral.", "time": "08-21-2016 07:22 AM", "replies": []}]}, {"title": "Xperia XA", "thread": [{"postID": "post5011780", "text": "Looking over the specs sheet, I think this might be a good entry level phone, if that is what Sony is aiming for. It will depend greatly on the price point, though.Sony Xperia XA, X and X Performance specs | Android Central", "time": "02-23-2016 01:54 PM", "replies": []}, {"postID": "post5017784", "text": "I'm curious about it, but I agree that the price needs to be correct. If it launches at $400, it will probably be dead on arrival.", "time": "02-26-2016 11:24 AM", "replies": []}, {"postID": "post5333989", "text": "Anyone reads this please reply. I just bought the the XA today and now I'm on the fence about taking it back to best buy. Anyone have any advice?\nPosted via the Android Central App", "time": "08-16-2016 09:08 PM", "replies": [{"postID": "post5335783", "text": "What are your reasons? What was your previous device? Do you have buyer's remorse? Please provide more information so the community can help you.", "time": "08-17-2016 10:18 AM", "replies": [{"postID": "post5339311", "text": "I've wanted to try a Sony for a while now. I really wanted to pick up a Z5 Compact but being my first Sony I didn't want to spend that much. I opted for the XA. I do like it but it's a mid level phone and I have to keep that in mind. I'm used to top end specs. Size is good. I wished it had at least a 1080 screen resolution. It seems to be fairly fast. Im just not sure I'll keep it and wanted to get some feedback and advice from you guys before I return it to best buy. Should I invest in the Z5 Compact. I'm looking for around 5 inches plus or minus. Any thoughts on other Sony devices. I do like their look and software interfacing like I really do with Motorola Droid.", "time": "08-18-2016 12:24 AM", "replies": []}, {"postID": "post5339379", "text": "Plus just out of the blue the software starts doing its own thing. Flickering and such. Maybe I should take it back and look into a higher end Sony device. I hate this bc I like the phone and design. Software interface and now the buggy glitches is not a sign of at least this particular device to have reliable software. Could be that I just have a defective device.", "time": "08-18-2016 12:43 AM", "replies": []}]}]}, {"postID": "post5341908", "text": "I just got the XA last night. I had a Z3 (broke and no longer replaced at T-Mobile), a Z5 Premium that stopped working (international no warranty) and now this. I'm done spending tons of money on \"high end\" phones when this little thing does a lot of the same things. Size is perfect, but the only features it's missing that I liked from the Z5P are fingerprint sensor, and screen record. All the extra things like 4k recording, live record to YouTube I can live without. It still has the audio enhancements and a decent camera with the new quicker camera. The Z5 compact is a good little phone don't get me wrong, but what you're gonna get on that isn't worth the extra 250. I wanted the xperia x performance, but gave this a shot and it's great. Just need to do a real day battery life test. It's running out now cuz I can't put it down. Too busy learning what it has and doesn't have from my Z5P. I say keep it my friend. Oh yeah and waterproof on Z5 series was one of my reasons for getting that. These I hear are unofficially water resistent.", "time": "08-18-2016 01:52 PM", "replies": []}, {"postID": "post5349842", "text": "I tend to buy 2 new phones a year; this year I bought the XA the day after I bought the iPhone SE. I prefer it to the SE on a quotidian basis for my own eccentric reasoning: design and build quality are top notch; it's bezel-less edge beats the Sharp Aquos Crystal - it's the nicest phone I've ever held. Performance is mid-range, battery average. It''s my only android device after the Z3 Compact (I prefer it to that, too). I don't care about storage as I stream everything so the XA will never see a microSD card.\nStraight up - the SE is more of a beater device despite costing £119 more, £359 as opposed to £240, (which I don't consider expensive for the XA) but I've always tended to put modern style and minimalism above raw performance. I will use the iPhone as a second device but not that much. At least I'll get a good price when I move it on in 6 months or so.", "time": "08-20-2016 03:33 PM", "replies": [{"postID": "post5350698", "text": "I must ask, how do you deal with going from the battery life of the SE to the battery life of the XA? \nAll of the reviews I have read and watched said that the battery life is bad, while on the other hand, the SE battery life is really good. I wanted the XA originally but hearing about that battery life was a true bummer.", "time": "08-20-2016 09:04 PM", "replies": []}]}, {"postID": "post5351262", "text": "If it lasts a full day then that's fine with me; it's certainly not as good as the SE or my previous Z3 Compact, but I'm someone who doesn't get phone battery anxiety.\nIf it only got a few hours like some of the early android tablets, then I'd be annoyed. But for me, streaming music a lot, the battery is fine. I doubt they could have achieved the narrow, slim design if they had put a bigger battery in there. Already I'm bored with the SE - the 4\" screen isn't a problem for me, but the Sony with Nova Launcher Pro on it is just more exciting. Plus everyone I've encountered has asked WTF is that? then been most impressed when shown.", "time": "08-21-2016 02:07 AM", "replies": []}]}, {"title": "5 inch display with only 720p?", "thread": [{"postID": "post5191500", "text": "hey guys, I am really tripping on getting the new Xperia-series in my hands.\nThe XA looked like a nice entry phone, but I fear the 720p resolution a little.\nIn those early previews I've read, it says that they couldn't really tell that the display was only 720p, since they couldn't see any visible pixels.\nHowever, I still fear that it will be too pixelated on such a big screen.\nAnyone who have had this XA in their hands and tested with their own eyes?", "time": "05-23-2016 07:49 AM", "replies": []}, {"postID": "post5191539", "text": "Only way that should be a problem is VR. There have been many 5\" 720p phones, including the Moto G series, etc and none had issues with being too pixelated. The resolution wouldn't bug me too much, but the low RAM, low storage and complaints about a laggy camera app would bother me more. MediaTek's performance is an unknown to me but I know they're capable of making a quality SOC - I've just never used one.", "time": "05-23-2016 08:09 AM", "replies": []}, {"postID": "post5191646", "text": "In Denmark XA costs 255 USD, while X Performance costs 680 USD. Do you think X Performance is worth the extra price?\nWill the low RAM on XA be fatal?", "time": "05-23-2016 09:28 AM", "replies": [{"postID": "post5191686", "text": "Depends on your needs... Quality mid range $200-300 phones are pretty usable for most people. For those who need to have the best of the best, go with the high end.", "time": "05-23-2016 10:01 AM", "replies": []}]}, {"postID": "post5342043", "text": "Looks good to me. Maybe if I break out a magnifying glass I will see pixels\nPosted via the Android Central App", "time": "08-18-2016 02:21 PM", "replies": []}, {"postID": "post5349947", "text": "It's not an issue; I've actually found the screen to be better than what was written in many of the middling reviews of the device.", "time": "08-20-2016 04:12 PM", "replies": []}]}, {"title": "I just purchased this Xperia, HELP", "thread": [{"postID": "post5333977", "text": "Hello\nNot sure if this post will be seen but I just purchased this device. I like the size. I'm beginning to wonder if the device is even with it. I see potential and then I see the bad. Should I take it back to best buy and get something else?\nPosted via the Android Central App", "time": "08-16-2016 09:05 PM", "replies": [{"postID": "post5334212", "text": "Sorry about the delay. What is the issue?", "time": "08-16-2016 10:08 PM", "replies": []}]}]}]
