[{"title": "Printing issues", "thread": [{"postID": "post6196113", "text": "Aside from the Bluetooth problems Printing is becoming a nightmare. Set up all my printers they work for a day or two and then stop just like the Bluetooth issue. Anyone have a fix?", "time": "03-19-2018 07:45 PM", "replies": [{"postID": "post6196928", "text": "Are you connecting as cloud printers?", "time": "03-20-2018 01:24 PM", "replies": []}]}]}, {"title": "is the pixel book the future of android tablets?", "thread": [{"postID": "post6023641", "text": "is it safe to say, if you want a premium android tablet with pen support\nthe only logical future is the pixelbook?\nI think more chromebooks will offer pen support if it becomes a staple in the os\nmuch like the samsung chromebook pro and plus.\nIt is a shame since the samsung galaxy book 12.2 inch came out, there aren't really many android tablets that can match its size or capacity to multitask on the big screen...\nperhaps the pixel book is the way", "time": "10-17-2017 09:20 AM", "replies": [{"postID": "post6073227", "text": "Google announced a few weeks ago true multi window support to the pixelbook coming soon so I'm looking forward to that. When I say true multi window support I mean whether it's an android app or native Chrome OS app you can resize them without any issues like a traditional windows/mac desktops.\nAlso have you folks tried out the \"Crossover\" Android app from the Google Play store which allows you to install over 13000 windows Apps? I've already successfully installed Office 2010/Libre Office on my pixelbook. It's crazy to be able to run windows apps on it.. SO now i get to run Android, Chrome OS and Windows applications!!!! This is the best of all worlds! Please see screen shot below of my Office 2010 installing and live in action! Thanks .", "time": "11-16-2017 04:01 PM", "replies": [{"postID": "post6132269", "text": "can you install office 2016? to put it other way can you install applications that not available in their repo?\nI would like to install veracrypt and office 2016.\nalso do you have a link for this? \"Google announced a few weeks ago true multi window support to the pixelbook\" I am interested in knowing more about it", "time": "01-10-2018 09:21 AM", "replies": []}]}, {"postID": "post6118029", "text": "Honestly I hope so. Every Android tablet I had before my Pixelbook was a crushing disappointment that had weaker hardware than my phone at the time and never got updated.", "time": "12-26-2017 12:49 AM", "replies": []}]}, {"postID": "post6024430", "text": "it all depends what your going to use it that way. I think they will have low ends and high end which is the Pixel book.", "time": "10-17-2017 05:48 PM", "replies": []}, {"postID": "post6061006", "text": "For me, it's the future of laptops and mobile devices, period. As more options to operate web apps and work the cloud come, the less needed are large bulky operating systems.", "time": "11-08-2017 10:02 PM", "replies": []}, {"postID": "post6080091", "text": "In terms of windows apps.. I wouldn't be able to play overwatch on this thing right haha", "time": "11-21-2017 04:16 PM", "replies": []}, {"postID": "post6193008", "text": "Don’t think it’s the future of the tablets but it’s a damm nice laptop to use very impressed.", "time": "03-16-2018 09:06 AM", "replies": []}, {"postID": "post6195023", "text": "We're headed towards this world, even if the Pixelbook, or even Chromebooks in general, aren't the main interface. I think back to the days when Sun was pushing JavaOS or something and we laughed. But computing in general has become more and more \"thin client\" as the Internet has gotten faster and web apps more prevalent.", "time": "03-17-2018 09:27 PM", "replies": [{"postID": "post6196927", "text": "We are running more virtual apps at work than in the past... Makes life easier for the most part.", "time": "03-20-2018 01:23 PM", "replies": []}]}]}, {"title": "Android OS update????", "thread": [{"postID": "post6196592", "text": "So I love my Pixel Book and could use it as my daily driver for work if the Android OS was upgarded to 8.0. Sitting at Android 7.x will not allow any of the XenMobile or Blackberry apps to work with my companies policies. Any chance this could happen?", "time": "03-20-2018 08:41 AM", "replies": []}, {"postID": "post6196622", "text": "I thought that ran Chrome OS?", "time": "03-20-2018 09:14 AM", "replies": []}, {"postID": "post6196628", "text": "Mine is running 7.1.1 for app compatibility. Unfortunately I don't have any information about when it will be updated to 8.0 or 8.1.", "time": "03-20-2018 09:20 AM", "replies": [{"postID": "post6196635", "text": "I was thinking for a moment to flash Linux Android-x86, thinking that would help skip to 8.0, but even they (based on Lineage) are only on 7.1.", "time": "03-20-2018 09:25 AM", "replies": []}]}]}, {"title": "What sleeve are you using!", "thread": [{"postID": "post6168339", "text": "Love the look of the sleeve sold at the Google store but I think the price is over the top. I do like that it has pen holder built in.\nIs anyone using something different?", "time": "02-21-2018 10:21 AM", "replies": [{"postID": "post6168442", "text": "$100 for a sleeve is absurd! The Pixelbook itself is absurdly priced for similarly speced devices...damn you Google lol", "time": "02-21-2018 12:35 PM", "replies": [{"postID": "post6168458", "text": "I don't have an issue with Pixelbook price.", "time": "02-21-2018 12:52 PM", "replies": [{"postID": "post6168537", "text": "Have you seen either the Samsung Pro and/or Plus?...I'm not saying the pixel isn't a fine device...just comparatively speaking to others, it's grossly over priced.", "time": "02-21-2018 02:39 PM", "replies": [{"postID": "post6169168", "text": "Thanks for sharing your opinion, however this thread is about sleeve options.", "time": "02-22-2018 09:52 AM", "replies": [{"postID": "post6169172", "text": "It started with my opinion on the sleeve thank you very much.", "time": "02-22-2018 09:57 AM", "replies": [{"postID": "post6169201", "text": "I'm looking for feedback on alternative sleeve options", "time": "02-22-2018 10:27 AM", "replies": []}]}]}]}]}]}]}, {"postID": "post6169368", "text": "I purchased the Bellroy case from bellroy.com since Google store didn't have any in stock. Then I ordered the pen clip which I really like, that way if I don't care with the Bellroy sleeve I still have the pen. I justified the purchase by thinking the Pixelbook is so beuatiful it was worth spending extra and a great looking sleeve. Pixelbook fits great in the sleeve and I'm very happy with it.", "time": "02-22-2018 12:53 PM", "replies": [{"postID": "post6169472", "text": "Are you talking about the 30 dollar magnetic leather clip?", "time": "02-22-2018 02:27 PM", "replies": []}]}, {"postID": "post6169995", "text": "I ordered my Pixelbook i7 from Amazon so I ordered a leather sleeve at the same time. it is a classy dark green with an unsecured flap. There is a pocket for the pen on the outside. It is made by Cortana in Colombia. Stellar quality and it fits the Pixelbook perfectly.", "time": "02-23-2018 05:55 AM", "replies": []}, {"postID": "post6170076", "text": "Yes, it's the pen clip.", "time": "02-23-2018 08:30 AM", "replies": [{"postID": "post6170102", "text": "Looks nice...Does it bulk up the pen?", "time": "02-23-2018 09:04 AM", "replies": []}]}, {"postID": "post6170108", "text": "It does make the pen bigger but the way I hold it doesn't make feel different since I'm holding the uncovered portion. It does clip nice to the Pixelbook and is very secure.", "time": "02-23-2018 09:16 AM", "replies": [{"postID": "post6170156", "text": "Looks good...I might just buy the case though since there is a pen holder inside the case. Not as convenient as your setup.", "time": "02-23-2018 10:16 AM", "replies": []}]}, {"postID": "post6179413", "text": "Sorry, in my post above I went slightly mad. The excellent leather sleeve I bought with my Pixelbook is made by Capra. I got right the fact that it's hand-made in Colombia.", "time": "03-05-2018 05:52 AM", "replies": []}, {"postID": "post6179900", "text": "It is pricey but I'm going to go with the Pixelbook cover from the Google Store.", "time": "03-05-2018 02:02 PM", "replies": []}, {"postID": "post6186112", "text": "I am looking for a snap on cover rather than a case , anyone have any suggestions?", "time": "03-11-2018 06:54 AM", "replies": []}, {"postID": "post6196163", "text": "I just use a simple sleeve Amazon. It has a pocket on the front to hold my charger and headphones. It works great for my needs.", "time": "03-19-2018 08:37 PM", "replies": []}]}, {"title": "Getting my Pixel Book Tomorrow", "thread": [{"postID": "post6158136", "text": "The last Chromebook I owned was the OG Chromebook Pixel. I loved that thing, battery life starting going so got rid of it and have missed having a Chromebook.\nGet EXCITED", "time": "02-08-2018 07:00 PM", "replies": []}, {"postID": "post6158289", "text": "You are gonna love love love it!\nI gave my OG Pixel to my parents, which was a welcome upgrade from the old HP Chromebook 14 I had given them a while ago. They leave it in the kitchen plugged in, so battery life isn't an issue.", "time": "02-08-2018 11:56 PM", "replies": []}, {"postID": "post6158555", "text": "I've often thought about getting a Pixelbook. Good luck with it Chuck!", "time": "02-09-2018 09:35 AM", "replies": []}, {"postID": "post6158930", "text": "Got mine Wednesday ...it`s my 1st foray into Chrome/Pixelbook. This machine is just gorgeous and so bloody fast too. I`m finding it pretty straightforward to use Chrome/Android mix,taking a little getting used to but this Pixelbook is such a pleasure to use,I totally love it", "time": "02-09-2018 07:01 PM", "replies": [{"postID": "post6159343", "text": "Got mine Wednesday also.. . Love it so far.", "time": "02-10-2018 08:51 AM", "replies": []}]}, {"postID": "post6159033", "text": "I'm 2 weeks into owning my Pixelbook, it's a fantastic device, easily the best laptop I've ever owned.", "time": "02-09-2018 10:03 PM", "replies": []}, {"postID": "post6178477", "text": "I've had mine since Nov. 4th and absolutely love it. I use it everyday and coming from a surface pro 3 I don't regret switching not even one bit.", "time": "03-04-2018 01:22 AM", "replies": [{"postID": "post6179122", "text": "I just love that you turn it on and in seconds you are up and running", "time": "03-04-2018 07:48 PM", "replies": []}]}, {"postID": "post6185799", "text": "Just picked one up tonight and I am pleasntly suprised how well this laptop operates !", "time": "03-10-2018 08:55 PM", "replies": []}, {"postID": "post6195025", "text": "Joined the Pixelbook bandwagon today. I've been toying with the idea for a while now. Aging MBP (2011) that is not handling latest macOS very well (haven't even turned it on in weeks) plus recently acquired Pixel 2 and figured what the heck. Had an older Chromebook that I've been using in the evenings quite regularly and had a chance to play around with one at BestBuy a few weeks ago. Really a nice machine. I think it is a tad over-priced, but it really is great hardware. Might get a \"pen\" someday, but we'll see how well I get along without it.", "time": "03-17-2018 09:31 PM", "replies": []}]}, {"title": "BF specials?", "thread": [{"postID": "post6082257", "text": "Anyone know of any sales or special offers on the Pixelbook?", "time": "11-23-2017 10:16 AM", "replies": []}, {"postID": "post6087849", "text": "They have a special going on now that it comes with a google home https://store.google.com/us/?hl=en-US", "time": "11-28-2017 09:52 AM", "replies": []}, {"postID": "post6113500", "text": "I heard Google is knocking off $100 off the Pixelbooks and giving away a free Google home.", "time": "12-20-2017 07:51 PM", "replies": []}, {"postID": "post6193015", "text": "It’s on amazon for 899", "time": "03-16-2018 09:08 AM", "replies": [{"postID": "post6194083", "text": "I paid 999 and best buy lowered it to 899 a week later I called them and they credited me back 100.", "time": "03-17-2018 05:54 AM", "replies": []}]}]}, {"title": "Scrolling/Zooming on Android Apps", "thread": [{"postID": "post6192803", "text": "When using Android apps on my Pixelbook, there seems to be less functionality than when using apps through Chrome. I'm unable to scroll with the track pad but have to use the touchscreen. Also, I'm unable to zoom in on the apps using the track pad gesture. Is this just a baked in difference between using apps and Chrome or a problem with my Pixelbook? Are others experiencing these issues? Thanks.", "time": "03-16-2018 04:51 AM", "replies": []}, {"postID": "post6193006", "text": "Not all the apps are pixelbook ready I spoke to a google rep and they are changing daily google wants all apps to work on both phones and laptops. Apple has the same issues with iPad bs iPhone apps.", "time": "03-16-2018 09:04 AM", "replies": []}, {"postID": "post6193011", "text": "Yes, I have the same problem. I have to be careful to remember if I am on a Web application or in an Android app.", "time": "03-16-2018 09:07 AM", "replies": []}, {"postID": "post6193334", "text": "Ok. Thanks. Glad to know that my situation is not unique. And that Google is working on it.", "time": "03-16-2018 01:49 PM", "replies": []}]}, {"title": "Bluetooth on Pixelbook", "thread": [{"postID": "post6090214", "text": "I picked up a Pixelbook on Sunday 11-26 and so far I am enjoying it. My only complaint is the Bluetooth. I have the Jaybird X2 paired with it and the sound horrible. The sound is hollow, and I keep hearing a clicking noise. Is anyone else having trouble with Bluetooth?", "time": "11-29-2017 09:06 PM", "replies": []}, {"postID": "post6091630", "text": "I tried a different Bluetooth (the Plantronics 5200) and still had the same issue. I finally went to the Bluetooth settings, switched audio input for the Bluetooth to the internal mic, and the popping noise stopped. The audio output is excellent now.", "time": "11-30-2017 06:57 PM", "replies": []}, {"postID": "post6113501", "text": "I'm using a PH-BTH3 Headphones the link to a youtube review from unboxed therapy is below I think I paid $39 for them and they sound great. I also use them with my Pixel 2 XL. It even comes with 3.5mm wire as it suppoerts 3.5mm head jacks as well if you don't feel like going bluetooth.", "time": "12-20-2017 07:53 PM", "replies": []}, {"postID": "post6193012", "text": "I have a pair of Bose headsets and they work great so far but I notice the battery life on the headset is less when using the pixel book.", "time": "03-16-2018 09:07 AM", "replies": []}]}, {"title": "Battery life", "thread": [{"postID": "post6189077", "text": "My new pixel book is getting terrible battery life anyone else having issues? The battery can recharge very fast but discharged faster.", "time": "03-13-2018 11:03 AM", "replies": []}, {"postID": "post6190272", "text": "I don't have one yet. I have been contemplating since release and follow these threads. First thing I would try is to reset it.", "time": "03-14-2018 07:38 AM", "replies": []}, {"postID": "post6190438", "text": "Great device much better than MacBook for me hopefully I get the battery issue fixed hate to loose it because it’s flawless", "time": "03-14-2018 10:04 AM", "replies": []}, {"postID": "post6191379", "text": "No problems here. I am very impressed with my battery life. one thought: how is your reception? If your PB is often hunting for a signal that will impact battery life.", "time": "03-14-2018 11:53 PM", "replies": [{"postID": "post6192723", "text": "Great reception not a problem at all tried a reset with Google rep over the phone they have reccommend replacement.", "time": "03-16-2018 01:10 AM", "replies": []}]}, {"postID": "post6192151", "text": "I think I'd try a reset 1st...HTH, David", "time": "03-15-2018 02:43 PM", "replies": []}]}, {"title": "Contemplating Purchase", "thread": [{"postID": "post6173615", "text": "Hey all,\nIve been between the Pixelbook and Samsung Chromebook pro, and am getting ready to make a purchase.\nConvince me on either!", "time": "02-27-2018 05:54 AM", "replies": []}, {"postID": "post6173650", "text": "Never used a chromebook til I got my pixelbook, always had a pc or windows laptop. This is easily the best machine I've ever bought, extremely fast, absolutely beautiful and dead easy to get used to, its probably the Rolls Royce of chromebooks and to my mind worth every penny", "time": "02-27-2018 06:58 AM", "replies": [{"postID": "post6175354", "text": "Had my Pixelbook about 2 weeks. The pixelbook without a doubt it's more expensive however I believe that there's room for it to grow in terms of future as far as the hardware. Some can't justify the price but I'll tell you what....I'm pretty happy. It just feels good using it and the display is really beautiful. Best Buy should have one on display go check it out.", "time": "02-28-2018 08:13 PM", "replies": []}]}, {"postID": "post6173665", "text": "I'm kinda hoping that they bring out one with a detachable keyboard. (not a bluetooth one). Rumors, anyone?", "time": "02-27-2018 07:19 AM", "replies": []}, {"postID": "post6174030", "text": "I purchased the Pixelbook a couple months ago and I'm really happy with everything about it from design to performance. I was also considering the Samsung Pro but normally if I settle for a product because it's cheaper I end up regretting it. I'm glad I decided on Pixelbook and know it's going to last me for awhile.", "time": "02-27-2018 01:45 PM", "replies": []}, {"postID": "post6179888", "text": "I am still a Windows guy but I picked up one of these over the weekend and for day to day use, I can do everything on this device. It takes a bit to get used to and the Launcher needs more customizability options. Android Apps are running WAY better than I expected and even the games run full screen (if the game is designed for that) and that has been the most impressive thing. \nYes, it is expensive but oddly, it is worth it for the quality.", "time": "03-05-2018 01:45 PM", "replies": []}, {"postID": "post6182406", "text": "I know...the price tag is probably the only drawback...", "time": "03-07-2018 05:59 PM", "replies": [{"postID": "post6183332", "text": "It truly is and this may be cliche' in the reviews but from experience, the hardware is super nice...perhaps the best trackpad / keyboard combinations I've used.", "time": "03-08-2018 02:50 PM", "replies": [{"postID": "post6183349", "text": "Totally agree ^", "time": "03-08-2018 03:10 PM", "replies": [{"postID": "post6187547", "text": "I am shocked how much I am using the Pixelbook over my Surface Book. My biggest complaint (and not at all the fault of Pixelbook) is a lack of spell checker in OneNote.", "time": "03-12-2018 10:29 AM", "replies": []}]}]}]}, {"postID": "post6185745", "text": "I just picked up the pixelbook and so far very impressed it replaced my old macbook that my son broke lasty week.", "time": "03-10-2018 07:48 PM", "replies": []}, {"postID": "post6188129", "text": "I use grammerly it works every where I type on my pixelbook give it a try its in the playstore.", "time": "03-12-2018 04:23 PM", "replies": [{"postID": "post6189405", "text": "I sure will...thanks...\nThe spellcheck was about to go on my very shortlist of showstoppers on the PixelBook. The main show stopper is the lack of a child account. They removed it in January with an update and they said Google Family Link is coming but not ETA.", "time": "03-13-2018 03:47 PM", "replies": []}]}]}, {"title": "Printing from Pixelbook", "thread": [{"postID": "post6188127", "text": "Compared to a chrome book printing from my new pixelbook is a breezeno issues at all works every time. I use the brother app to scan doucments into any one of my file locations. This was a reason I did not purchase a chrome book.", "time": "03-12-2018 04:21 PM", "replies": []}]}, {"title": "4\nReally interested.", "thread": [{"postID": "post6005193", "text": "I like the idea of this particular Chromebook. Really like the way it looks and it's integration of Google Assistant. Anyone going to get one? Which model?", "time": "10-05-2017 03:06 AM", "replies": []}, {"postID": "post6005194", "text": "ignore the \"4\" typo lol", "time": "10-05-2017 03:07 AM", "replies": []}, {"postID": "post6005316", "text": "I may get the base model. Don't really like the price. But someone compared it to $1k phones these days, and it's not so bad when you look at it that way.", "time": "10-05-2017 06:33 AM", "replies": [{"postID": "post6007414", "text": "I also compare it to the $1200 Macbooks that people use for email, Facebook, and word processing only.", "time": "10-06-2017 10:04 AM", "replies": [{"postID": "post6008362", "text": "And buying crap on Amazon...which seems like what I do with my MacBook air😀", "time": "10-06-2017 08:09 PM", "replies": []}]}]}, {"postID": "post6007332", "text": "the base model is the only one that makes sense. you don't need more than it power for any app available. you don't need more than 4gb ram.... so even the base model is complete overkill.", "time": "10-06-2017 09:19 AM", "replies": []}, {"postID": "post6009685", "text": "thinking about it since I don't really do anything with my PC that I couldn't do with a chromebook, but wondering how well intel processor will run Android Apps. What does everything else think? I would only need the base model.\nI also really wonder if Goggle has something is coming along that will need this much power a chromebook", "time": "10-07-2017 04:59 PM", "replies": [{"postID": "post6010149", "text": "That's the $100,000,000 question right there. Fuchsia? AndroChrome? Chromedroid?", "time": "10-07-2017 11:43 PM", "replies": [{"postID": "post6013452", "text": "Visions of Fuchsia and Andromeda were dancing in my head when I placed my pre-order for a Pixelbook and pen, but I’m having second thoughts, and I’ll probably cancel the order. Now, I feel more like I'm trying to crash a party I wasn't invited to.\nI’m thinking now that Google’s real target Pixelbook demo is simply enterprise users who have to contend with saas software & multiple cloud services every day, especially enterprise users who currently use someone else’s cloud service more than they do Google’s. The specs, the build quality, the onboard storage options, the finally available Android apps, hell, even the integrated assistant make a lot more sense for people who need to travel and take their offices with them than for skatepunks who Photoshop (my takeaway from their presentation video, not how I identify).\nMuch as I’d like to think that I’m buying myself a front row seat to a supercharged version of Chrome OS by buying a Pixelbook, the reality is probably a whole lot more mundane, and I’m probably not going to get anything more than a really well made Chromebook for the money. Which is nothing to sneeze at. But it's also probably more chromebook than a fairly sedentary academic needs. (Until Adobe announces a full-dress version of Adobe CC optimized for Chrome OS.)", "time": "10-10-2017 08:28 AM", "replies": []}]}]}, {"postID": "post6017890", "text": "Since this runs android apps, does this mean I can save my netflix movies on here ( the downloadable ones)?", "time": "10-13-2017 11:22 AM", "replies": [{"postID": "post6020208", "text": "yes", "time": "10-15-2017 01:21 AM", "replies": []}]}, {"postID": "post6020212", "text": "I am really interested in Pixelbook. This will replace my ipad air which i won from my company 3 years ago.\nI will still keep my macbook pro for file encryption&backup, occasional video editing using imovies etc.\nwhen chromebook mature i will eventually get rid of my macbook as well.", "time": "10-15-2017 01:29 AM", "replies": []}, {"postID": "post6021515", "text": "So is editing a hosts file possible on this? What are the options for system wide network controls etc?", "time": "10-16-2017 12:02 AM", "replies": []}, {"postID": "post6187249", "text": "Needed a new laptop after my son broke my year old Mack book that is not repairable. I looked at both at best buy and ended up with the pixel book but I have 15 days to return if I don't like it. So far so good no real bad issues yet but not totally convinced it's the best choice yet it will take a few more days.", "time": "03-12-2018 06:08 AM", "replies": []}]}, {"title": "Run Windows apps via crossover app on your pixelbook", "thread": [{"postID": "post6059358", "text": "I just tested this and so far it works well. I have OpenOffice installed. I haven't installed any other apps, but so far it seems to allow you to run the application natively without the need of the crossover app. Feels very smooth and feels like i'm literally just using a windows laptop. See URL below from Android Central, thanks.https://www.androidcentral.com/cross...ps-chromebooks", "time": "11-07-2017 10:51 PM", "replies": []}, {"postID": "post6059368", "text": "I tried it with Quicken 2016 but it didn't work. It errored out while installing dependencies, before even getting to running the .exe installer. I didn't spend much time messing with it though; I will later.", "time": "11-07-2017 10:59 PM", "replies": [{"postID": "post6059371", "text": "Yeah for me it worked so far, test out OpenOffice see if that works. So far this seems promising though.", "time": "11-07-2017 11:02 PM", "replies": []}]}, {"postID": "post6073184", "text": "So guys I figured out how to install Office 2010 successfully and other apps that are having issues installing. Please see attached screen shot. \nI sent some feedback to the Crossover team via the Crossover android app and they replied. So supposedly for older software pre \"Crossover\" release such as Office 2010 you need to create an ISO image of the cd/dvd. Once you have the ISO image created I uploaded it to my Google drive, then downloaded it on my Pixelbook and voila I am now able to actually install it as before I wouldn't even get to the part where I could type the CD KEY. Hope this helps others, thanks.", "time": "11-16-2017 03:35 PM", "replies": [{"postID": "post6175949", "text": "Sorry for opening an old thread but can anyone tell me if Old school RuneScape will run using crossover? It is literally the only reason I don't have a Pixelbook", "time": "03-01-2018 01:34 PM", "replies": []}]}]}, {"title": "Play Movies doesn't work", "thread": [{"postID": "post6158216", "text": "Play Movies is preinstalled but doesn't play any movies. Based on my internet searches seems to be a known issue. The Chrome extension version works fine so I installed it. Movies Anywhere will play the movies I own so go figure. Hopefully Google will fix it.", "time": "02-08-2018 09:36 PM", "replies": []}, {"postID": "post6158291", "text": "We talked about this offline, but I figured I'd throw my two cents in here:\nMy Google Play Movies Android app works fine on my Pixelbook -- but this was after I first uninstalled it, and then reinstalled it to see if I could duplicate Mike's problem. Since it does work normally on mine, I wonder if it had to do with uninstalling the version that came with the Pixelbook. Or maybe I'm just special.\nAnother thing is to make sure Android System Webview is up to date.\nIn any case, I find that the Chrome app version of Play Movies works just fine (and is more optimized for the Chromebook screen). That's why I uninstalled the Android app pretty soon after I got the Pixelbook (along with the other Google Play Android apps like Play Books and Play Music).", "time": "02-09-2018 12:00 AM", "replies": [{"postID": "post6159349", "text": "Mine works one or two times then stops so you might want to check that it still works. The only thing that fixes it is a power wash but that just works for one or two attempts. Interesting term for a factory reset. I'll just use the chrome version for now.", "time": "02-10-2018 08:56 AM", "replies": []}, {"postID": "post6169479", "text": "Is your play store app still working?", "time": "02-22-2018 02:33 PM", "replies": []}]}, {"postID": "post6169361", "text": "So you're saying you were able to watch 2 shows and then it stopped working. I just tried for the first time and so far 10 mintutes in the movie and it's still working. In April I'll be traveling and want to be able to watch a few movies on it.", "time": "02-22-2018 12:47 PM", "replies": [{"postID": "post6169474", "text": "Never watched them in full.....I'm referring to the play store app. The chrome version is fine.", "time": "02-22-2018 02:29 PM", "replies": []}, {"postID": "post6171805", "text": "It's working fine after the last system update.", "time": "02-25-2018 12:08 PM", "replies": [{"postID": "post6171815", "text": "Thanks, I'm updating now.", "time": "02-25-2018 12:19 PM", "replies": []}]}]}, {"postID": "post6169492", "text": "Last I checked, yes -- but I'm not really running any Android apps so far, and it's just updating the Google and Android System Webview apps on a regular basis.", "time": "02-22-2018 02:49 PM", "replies": [{"postID": "post6169528", "text": "Last you checked was when I asked?", "time": "02-22-2018 03:43 PM", "replies": []}]}, {"postID": "post6169544", "text": "Yep. I can check again -- are you still talking about the Play Movies app?\nEDIT: Just reinstalled the Play Movies Android app, and it still works fine. Haven't tried watching a movie for an extended period of time, but it skips around without difficulty.", "time": "02-22-2018 03:53 PM", "replies": [{"postID": "post6169557", "text": "Bugs the hell out of me....I doubt my unit is defective", "time": "02-22-2018 04:01 PM", "replies": []}, {"postID": "post6169567", "text": "I found where it's a known issue.... Don't understand why it doesn't affect everyone....Google's workaround is to use chrome", "time": "02-22-2018 04:07 PM", "replies": []}]}, {"postID": "post6169663", "text": "Maybe try a Powerwash, or reinstall the system?", "time": "02-22-2018 05:49 PM", "replies": [{"postID": "post6169680", "text": "It works twice after a power wash but I never watch a whole movie then crashes again when you try it a third time.\nI think a full reinstall is a bit drastic at this point....most likely it's the app but just weird", "time": "02-22-2018 06:10 PM", "replies": [{"postID": "post6169708", "text": "But even so, it wouldn't take too long to do a recovery reinstall of the OS -- when I've done it in the past, it's taken maybe 20-30 minutes tops (including downloading the recovery image to a USB drive). Such a huge difference from reinstalling Windows, which can be a multi-day endeavor.\nIf I have the opportunity, I'll try watching a couple of full length movies on the app to see if it crashes.", "time": "02-22-2018 06:29 PM", "replies": [{"postID": "post6169745", "text": "I hear ya.... I might attempt it on the weekend. Got a full plate right now...lol", "time": "02-22-2018 07:32 PM", "replies": []}, {"postID": "post6169841", "text": "Official Responses from Google...They seem to be aware of the problem and when I expressed my views about re-imaging most likely not being necessary because I didn't think it would solve the problem they kind of agreed.", "time": "02-22-2018 09:59 PM", "replies": []}]}]}]}, {"postID": "post6169889", "text": "Cool, thanks for the update!", "time": "02-23-2018 12:02 AM", "replies": [{"postID": "post6170458", "text": "When to restart my unit on the train and a system update started to install. Could be coincidence but I tried the app and it's working at the moment.... go figure", "time": "02-23-2018 04:58 PM", "replies": []}]}]}, {"title": "Free loop for your Pen from Google", "thread": [{"postID": "post6143388", "text": "Go here to sign up for a free loop that attaches to your Pixelbook, which you can use to store your Pixelbook Pen: https://madeby.google.com/pen-loop-f...ook-promotion/", "time": "01-22-2018 09:03 PM", "replies": []}, {"postID": "post6160585", "text": "anyone get theirs yet?", "time": "02-11-2018 11:01 PM", "replies": []}, {"postID": "post6160665", "text": "I haven't gotten mine yet, but I have seen some people posting about it on G+.", "time": "02-12-2018 02:11 AM", "replies": [{"postID": "post6161216", "text": "Not yet ,although I`m in the UK so it may take a while to get here.", "time": "02-12-2018 05:21 PM", "replies": []}]}, {"postID": "post6161284", "text": "Hey, how about that -- got it today! Now all I have to do is get a pen.", "time": "02-12-2018 07:13 PM", "replies": [{"postID": "post6161316", "text": "How long ago you order?", "time": "02-12-2018 08:10 PM", "replies": []}]}, {"postID": "post6161321", "text": "Maybe 3-4 weeks ago? I think I posted around the same time I ordered it.", "time": "02-12-2018 08:15 PM", "replies": []}, {"postID": "post6163126", "text": "Got mine on Monday. I signed up the day it was announced. Just showed up, no email confirmation.", "time": "02-15-2018 06:46 AM", "replies": [{"postID": "post6163837", "text": "How's it working for you?", "time": "02-15-2018 10:49 PM", "replies": [{"postID": "post6164157", "text": "Haven't installed it yet. I'll post up this weekend about it.", "time": "02-16-2018 09:12 AM", "replies": []}]}]}, {"postID": "post6164796", "text": "Put the loop on. Meh it works, looks okay but does cause a small wobble when on a table. I rarely use my laptop on a table or deal but I'd you do the wobble may be noticable.", "time": "02-17-2018 04:46 AM", "replies": [{"postID": "post6167675", "text": "Not sure I'll use it. In addition to the wobble you mention I think it will look rather odd sticking out and might make it tougher to fit into a sleeve. Might be better to find a sleeve with a pocket", "time": "02-20-2018 03:06 PM", "replies": []}]}, {"postID": "post6167669", "text": "Since it was an afterthought it was bound to look like one.", "time": "02-20-2018 03:03 PM", "replies": []}, {"postID": "post6168696", "text": "Would something magnetic have been better? Or would that interfere with its function?", "time": "02-21-2018 05:38 PM", "replies": [{"postID": "post6169174", "text": "Belroy, same company that makes the sleeve makes a leather magnetic one that's 30 bucks", "time": "02-22-2018 09:58 AM", "replies": []}, {"postID": "post6169176", "text": "https://www.amazon.com/gp/aw/d/B077Y...cUvbUpU6169176", "time": "02-22-2018 10:00 AM", "replies": []}]}, {"postID": "post6168868", "text": "I think the loop is the dumbest idea yet. I have a Galaxy Book 12 without a place to store the pen. Internal storage is not only elegant but necessary.", "time": "02-21-2018 08:34 PM", "replies": [{"postID": "post6168903", "text": "It's not without precedent -- my wife's Surface Pro 3 also came with a penloop that could be stuck on. But I agree, it's not an elegant solution.", "time": "02-21-2018 09:42 PM", "replies": []}]}, {"postID": "post6169390", "text": "There you go. But they need to snazz it up a bit. Maybe put a racing stripe on it or something.", "time": "02-22-2018 01:10 PM", "replies": []}]}, {"title": "Try the Pixel 2 dongle on your Pixelbook for improved headphone audio", "thread": [{"postID": "post6156364", "text": "If you really want to hear an improvement in sound try the dongle from your pixel 2 phone. If you don't have a pixel 2, buy the dongle for 10 bucks..... it's worth the investment.", "time": "02-06-2018 09:01 PM", "replies": []}, {"postID": "post6156781", "text": "I tried that after you suggested it -- definitely worthwhile!", "time": "02-07-2018 10:53 AM", "replies": []}, {"postID": "post6157859", "text": "Thanks for the advice, I'm planning on using mine tonight for the first time at my son's hockey game.", "time": "02-08-2018 01:16 PM", "replies": []}, {"postID": "post6161253", "text": "Got to agree,seems to be a lot clearer and detailed sound", "time": "02-12-2018 06:37 PM", "replies": []}]}, {"title": "Bluetooth Problem Pixel 2XL", "thread": [{"postID": "post6157032", "text": "I can`t seem to connect my 2XL to my Pixelbook. I go thhrough the usual steps and \nthe phone and laptop seem to be paired but they just won`t connect to each other. Can anyone help please? Thanks,David.", "time": "02-07-2018 04:24 PM", "replies": []}]}, {"title": "Should I get a pixel book?", "thread": [{"postID": "post6139992", "text": "I am just debating on if I should get a one or wait, I have a windows personal laptop and I basically never use it for anything other than movies, Can I do everything on the pixelbook that I currently do on my pixel XL phone? Will all of my apps work, will Netflix and Hulu work? Does it work well using a mouse?\nPlease share your good and bad experiences to help me decide,, thanks", "time": "01-18-2018 09:41 PM", "replies": [{"postID": "post6142282", "text": "I received mine as a gift from my parents. Definitely does everything my Dell XPS 13 (which is a fantastic machine) can for my uses, plus runs Android apps (which is why I got it, because I wanted something to be a great tablet for me). \nMy only reservation is that if you don't have disposable money, there are two other Chromebooks that are similar enough to Pixelbook at half the price. Samsung Chromebook pro/plus has a stylus, and the Asus flip is a great device. If money is no issue, then the Pixelbook is definitely the way to go. Love mine, just don't know if it would have been my choice had I have been the one to pay for it.", "time": "01-21-2018 08:25 PM", "replies": []}, {"postID": "post6145836", "text": "Yes, yes and yes.", "time": "01-25-2018 05:00 PM", "replies": []}, {"postID": "post6152050", "text": "Android apps on ChromeOS are still hit and miss. Some work like real apps (windowed mode, or full screen). Others only work like phone apps. They are kind of small windows and questionably useful. \nI mean you can watch netflix in chrome so you don't really need that app, but yeah. \nI love my Pixelbook but it is kind of weird as a tablet because of the huge bezels and then the folded over keyboard. Although it ignores input in tablet mode, it's still weird to be holding it and randomly pressing buttons so I honestly don't use it as a tablet. \nIt is pretty great though and I have no real complaints other than that tablet mode and iffy android app support. I think devs will more than likely start optimizing their apps for chrome os now that its getting more popular. \nLike others have said, battery life is pretty great, build quality is great, keyboard is clicky and responsive.", "time": "02-01-2018 09:08 PM", "replies": []}]}, {"postID": "post6141668", "text": "I bit the bullet and got one. I F***ing love this machine. It's the best thing Google has ever made. The keyboard is amazing to type on, the screen is beautiful, I can do almost everything a window's computer can. Well, last time I used a Window's computer was several years ago, since I've been using chromebooks for years now. I'm sure you won't regret getting one at all.", "time": "01-21-2018 02:38 AM", "replies": []}, {"postID": "post6142648", "text": "Do you use it with a mouse? Does Bluetooth headphones work with it? Can you basically do everything on the pixelbook that you do on your phone? Have you tried hooking a larger display monitor to it? Netflix and Hulu? What kind of case or backup do you use?", "time": "01-22-2018 08:15 AM", "replies": []}, {"postID": "post6146056", "text": "I got one a couple of weeks ago, and it is SWEEEEEEEEET. Screen is terrific, keyboard is the best I've used, and it has power and storage to burn (and I have the lowest spec'd model). Netflix works fine -- I just use the web interface, not the app. For a lot of what I do, I can just use browser windows -- the Android apps tend to be redundant. But it's nice to have the option to install the Android app, in case there's some functionality there that isn't on the website.\nIt's likely that there are some apps for your phone that won't work on the Pixelbook, but that's the case as well for certain tablets. If you're wondering, you can list a few apps and I can search the Play Store on my Pixelbook to see if they show up as installable.", "time": "01-25-2018 09:43 PM", "replies": [{"postID": "post6151532", "text": "What makes it better though than other Chromebooks that cost less?", "time": "02-01-2018 09:46 AM", "replies": [{"postID": "post6151564", "text": "Oh, you can do pretty much the exact same things on a Chromebook 1/3 of the price of a Pixelbook. It just won't feel as nice. The screen and keyboard are best in class, the materials are luxurious, and the build is impeccable. It's like the difference between driving a Honda and a Bentley. \nI'd bet the majority of Macbook Pro owners use it just like they would a Chromebook, and they're spending significantly more for the potential they'll never use. So the price of a Pixelbook doesn't look so outrageous in comparison.Yeah, I saw that. Got mine too soon! But I seriously don't think I'd ever use the Pen.Unless you're doing some heavy duty development, the lowest spec'd model should give you power and space to burn.", "time": "02-01-2018 10:09 AM", "replies": [{"postID": "post6151612", "text": "Not worried about processing...just storage which is all the 200 gets you", "time": "02-01-2018 10:56 AM", "replies": []}, {"postID": "post6151666", "text": "I think I'm going to run to Best buy to look at it before I pull the trigger.", "time": "02-01-2018 12:05 PM", "replies": []}]}]}]}, {"postID": "post6147856", "text": "I'm debating getting one to be able to use Office apps. I feel like there are some advanced things I have built into some spreadsheets that aren't fully functioning with Google sheets. from what I've tried to read up on, edit capability within Office mobile app versions through the Play Store would require Office 365 subscription, but not 100% certain if this provided any real value beyond just being able to use the online version of Office to edit/update files. I was going to try and test this out with our current Chromebook, but sadly it's not a \"compatible\" device to enable the Android apps from the Play Store. \nthe other thing I'm curious about is the \"tethering\" I saw mentioned in the Google Store page the works via Bluetooth connection to a Pixel 2. Anyone know if this BYPASSES the need to have \"hot spot\" capability from AT&T? I know I can't currently turn those options on OR really activate them on our current account because we have an unlimited data plan being DirecTV customers also.\nReally like everything else I've read about the Pixelbook and nearly ready to pull the trigger on one.", "time": "01-28-2018 10:31 AM", "replies": []}, {"postID": "post6148787", "text": "Same here, could do with a bit or advice /feedback. I'm using a Toshiba i7 laptop which is running win 10 and a 500gb ssd. It's getting a bit old in the tooth and I fancy something a bit more modern. The Pixelbook seems to fit the bill quite nicely but I've no real experience with Chrome OS. I've got the new Pixel 2XL and have used Android since my first Android phone the HTC G1... Will this suit me? I do quite a bit of browsing, some photo editing and some document printing using Open Office... Any help appreciated, thanks, David", "time": "01-29-2018 12:26 PM", "replies": []}, {"postID": "post6148947", "text": "Chrome OS should be enough for you. It sounds like you don't do heavy duty photo editing that would require the full Photoshop suite, so there are plenty of options on Chrome that would work for you. Google Docs works pretty well with Microsoft Office files, although if a file contains a lot of custom formatting, it might need some tweaking once it's imported as a Google Doc.\nI currently use my Chromebooks for about 99% of my computing (which includes Citrix remote access to an electronic medical record charting system), so I get by pretty well without a PC!", "time": "01-29-2018 03:09 PM", "replies": [{"postID": "post6149048", "text": "Thanks for your reply...I have in mind to get the i5 256gb with the pen but could stretch to the i7 512gb.Any thoughts on my choice after using your machine for a few weeks? Thanks,David.", "time": "01-29-2018 04:54 PM", "replies": []}]}, {"postID": "post6149115", "text": "I have the lowest spec'd model (i5, 128 GB SSD), and it is more than enough for my needs. Unless you want to store lots of stuff locally, you probably don't need the 256 GB version. I'm not sure how useful the Pixelbook Pen is, unless you do lots of art or design work. My understanding is that there aren't many apps out there that make good use of the pen yet. You can always purchase the pen at a later date, so it might make more sense not to get it yet.", "time": "01-29-2018 06:36 PM", "replies": [{"postID": "post6149141", "text": "Thanks so much for your help...I`ve taken the plunge and ordered the i7 model with free pen from Amazon US. I`m in the UK and the price here with the pen is a whopping £1800. With the free pen offer in the US I`ve only paid £1476 (inc taxes) saving £324 ($455) well pleased! The only thing I may have is a US keyboard but might be able to change that using the input mode in settings,not that bothered though as I`ve used a US keyboard before.", "time": "01-29-2018 06:56 PM", "replies": []}, {"postID": "post6151538", "text": "Last time I was on their site the pen is on a free promo", "time": "02-01-2018 09:48 AM", "replies": [{"postID": "post6151564", "text": "Oh, you can do pretty much the exact same things on a Chromebook 1/3 of the price of a Pixelbook. It just won't feel as nice. The screen and keyboard are best in class, the materials are luxurious, and the build is impeccable. It's like the difference between driving a Honda and a Bentley. \nI'd bet the majority of Macbook Pro owners use it just like they would a Chromebook, and they're spending significantly more for the potential they'll never use. So the price of a Pixelbook doesn't look so outrageous in comparison.Yeah, I saw that. Got mine too soon! But I seriously don't think I'd ever use the Pen.Unless you're doing some heavy duty development, the lowest spec'd model should give you power and space to burn.", "time": "02-01-2018 10:09 AM", "replies": [{"postID": "post6151612", "text": "Not worried about processing...just storage which is all the 200 gets you", "time": "02-01-2018 10:56 AM", "replies": []}, {"postID": "post6151666", "text": "I think I'm going to run to Best buy to look at it before I pull the trigger.", "time": "02-01-2018 12:05 PM", "replies": []}]}]}, {"postID": "post6151543", "text": "I'm wondering if I should get the cheapest model as opposed to the middle one though someone else is paying for it", "time": "02-01-2018 09:51 AM", "replies": [{"postID": "post6151564", "text": "Oh, you can do pretty much the exact same things on a Chromebook 1/3 of the price of a Pixelbook. It just won't feel as nice. The screen and keyboard are best in class, the materials are luxurious, and the build is impeccable. It's like the difference between driving a Honda and a Bentley. \nI'd bet the majority of Macbook Pro owners use it just like they would a Chromebook, and they're spending significantly more for the potential they'll never use. So the price of a Pixelbook doesn't look so outrageous in comparison.Yeah, I saw that. Got mine too soon! But I seriously don't think I'd ever use the Pen.Unless you're doing some heavy duty development, the lowest spec'd model should give you power and space to burn.", "time": "02-01-2018 10:09 AM", "replies": [{"postID": "post6151612", "text": "Not worried about processing...just storage which is all the 200 gets you", "time": "02-01-2018 10:56 AM", "replies": []}, {"postID": "post6151666", "text": "I think I'm going to run to Best buy to look at it before I pull the trigger.", "time": "02-01-2018 12:05 PM", "replies": []}]}]}]}, {"postID": "post6149264", "text": "Woohoo! This probably won't work since you're in the UK, but since you're buying it from the US, maybe there's a chance: https://madeby.google.com/pen-loop-f...ook-promotion/", "time": "01-29-2018 09:55 PM", "replies": [{"postID": "post6149383", "text": "That code should work OK, if you scroll down the page it asks which country you're in, US, UK or Canada. Thanks again for your help, I take delivery on Monday 12th Feb, can't wait", "time": "01-30-2018 01:02 AM", "replies": []}]}, {"postID": "post6149497", "text": "I'm really.considering picking up a pixel book today from my local Best buy. I have a Samsung chromebook plus which is good but it does lag a little a stutter from time to time. I'm looking at the i5 base model. the Chromebook plus will suit my wife perfectly due to her being a light user on a Chromebook.", "time": "01-30-2018 06:00 AM", "replies": []}, {"postID": "post6149743", "text": "I picked one up, thinking I could evaluate whether it meets my needs for a week or so. Two hours later and I'm already sold - aside from all the web stuff (obviously!) it works perfectly with the Android MS Office apps (which I need for grading/lecturing). Even my fancy USB laser pointer/slide remote worked with plug and play simplicity with PowerPoint. Any heavy image editing or gaming will be done on my desktop, but as a laptop replacement (replacing a 2014 Macbook Pro) it does everything I could want.", "time": "01-30-2018 11:40 AM", "replies": []}, {"postID": "post6151545", "text": "Dammit...pen promo ends tonight and the person who would be buying won't have internet access until tonight", "time": "02-01-2018 09:53 AM", "replies": []}, {"postID": "post6151677", "text": "That's where I bought mine. Got a little back in Reward Zone money.", "time": "02-01-2018 12:18 PM", "replies": []}, {"postID": "post6151712", "text": "I was just going to look but I guess I could buy there.... I assume it's still serviced the same way but maybe RMAs are different.", "time": "02-01-2018 01:10 PM", "replies": []}, {"postID": "post6151750", "text": "You probably can't buy Google's Device Protection if you go through Best Buy, but in my experience, Chromebooks are less prone to failure or damage than phones. So I typically only get extra insurance for phones.", "time": "02-01-2018 02:15 PM", "replies": [{"postID": "post6151758", "text": "Yes...I'm aware but I wasn't going to bother with insurance", "time": "02-01-2018 02:24 PM", "replies": []}]}, {"postID": "post6151760", "text": "I'll bet Best buy only stocks the base model", "time": "02-01-2018 02:25 PM", "replies": [{"postID": "post6151767", "text": "I think you're right. I just searched for it at my local Best Buys, and there's no option for immediate pickup for the i7 version.", "time": "02-01-2018 02:30 PM", "replies": [{"postID": "post6151779", "text": "I have no intention of going with that one....the middle should be good and I even question that", "time": "02-01-2018 02:47 PM", "replies": []}]}]}, {"postID": "post6152008", "text": "Hell yeah you can. I upgraded from a surface pro 3 to a pixelbook and glad I did. I was using my windows tablet just for surfing the web, Netflix, streaming other content etc. I'm able to do all that with the pixelbook and there is wayyy more variety of apps on the google PlayStore vs windows app store. I also have a pixel 2 XL and I'm able to do everything on the pixelbook the same way except making cell calls. I love how I can have the same apps on both devices.", "time": "02-01-2018 07:55 PM", "replies": []}, {"postID": "post6152102", "text": "Is anyone running Crossover and MS Office 2016/365 apps for the Pixelbook? If so how's the performance of OneNote on it? I wouldn't mind jumping to a Pixelbook from my old android tablet (galaxy Note Pro) if I could also make the jump to better versions of MS apps yet still retain the ability to run android apps as well.", "time": "02-01-2018 10:16 PM", "replies": []}]}, {"title": "Does Google Handle the Warranty if Purchased Through Best Buy, B&H, etc.?", "thread": [{"postID": "post6151210", "text": "Exactly like the title says, if I purchase one of these from a store that isn't Google, how does the warranty work? Do I still go through Google if I have a warranty issue?\nThanks!", "time": "01-31-2018 11:04 PM", "replies": []}, {"postID": "post6151271", "text": "Yup, but it depends on the terms of the store. Best Buy, for instance, will do returns and warranty exchanges for 15 days (more if you're in a different level of their loyalty program), but once that's done, the remainder of the warranty term will be handled by the manufacturer. You can still go through the store where you purchased it, but they'll end up contacting the manufacturer if said initial period is done.\nIf you got extended warranty or insurance, then the terms of those policies and companies responsible apply.", "time": "02-01-2018 01:22 AM", "replies": []}]}, {"title": "Can I Run Firefox On The Pixel book?", "thread": [{"postID": "post6148174", "text": "As above and can I run SwiftKey too? Just some of my favourite apps. Thanks, David.", "time": "01-28-2018 04:45 PM", "replies": []}, {"postID": "post6148392", "text": "Yes, Firefox works as an Android app on the Pixelbook. I was also able to install Swiftkey, although I'm not sure if there's a way to use it in place of the Chrome OS keyboard.", "time": "01-28-2018 11:48 PM", "replies": []}]}, {"title": "Screen brightness?", "thread": [{"postID": "post6120306", "text": "I could be a bit dumb, but I searched the help manual on the Pixelbook, and can't find it in the settings either. \nDoes anyone know how to adjust the screen brightness on the pixelbook?", "time": "12-28-2017 10:15 AM", "replies": []}, {"postID": "post6120422", "text": "F6 keyhttps://support.google.com/pixelbook.../7504061?hl=en", "time": "12-28-2017 12:11 PM", "replies": [{"postID": "post6120843", "text": "LOL omg i'm a moron. Thanks man.", "time": "12-28-2017 08:29 PM", "replies": []}]}, {"postID": "post6137468", "text": "And if you hold down the alt key and press the screen brightness button F6 you can adjust the keyboard backlight level.", "time": "01-15-2018 11:15 PM", "replies": []}, {"postID": "post6147585", "text": "Anyone know a way to turn off auto brightness? In my office it seems to be going crazy and can't find a stable brightness to stay at.", "time": "01-28-2018 12:08 AM", "replies": []}]}, {"title": "using pixelbook or chromebook with dslr", "thread": [{"postID": "post6041879", "text": "So looking at buying a chromebook (most likely pixelbook) and one thing I was wondering about was if I want to download photos from my DSLR does is work with the Chrome OS just like when you transfer photos to Windows or Mac? If not, what all do you need to do?", "time": "10-27-2017 04:33 PM", "replies": [{"postID": "post6103033", "text": "Here is a video example of someone connecting their gopro camera to their chromebook.", "time": "12-10-2017 11:13 PM", "replies": []}]}, {"postID": "post6041995", "text": "I think all cameras support mac and windows without bugs.", "time": "10-27-2017 06:26 PM", "replies": [{"postID": "post6042757", "text": "But what about chrome os", "time": "10-28-2017 11:03 AM", "replies": []}]}, {"postID": "post6042954", "text": "I have limited Chromebook knowledge but I know you can store files on it, I doubt it will automatically import photos when attaching the camera like Windows can. Will probably need to remove the SD card from the camera and connect it to the Chromebook and drag the files over with the file browser they have.", "time": "10-28-2017 01:32 PM", "replies": []}, {"postID": "post6046397", "text": "hmmm. would think there's a transfer app or manager that would upload em in photos or drive. idk. good question", "time": "10-30-2017 06:56 PM", "replies": []}, {"postID": "post6060980", "text": "I have my pixelbook on order, but assume it should be simple. Just launch the file browser and move your image files where ever. But it depends on how you are hooking up your camera to USB-C - cable or SD card?", "time": "11-08-2017 09:33 PM", "replies": []}, {"postID": "post6113498", "text": "I can confirm this worked for me. I bought a USB to mini USB for my gopro and I am able to transfer videos and pictures from my GoPro Hero 4 Silver just fine. After the cable arrived I remembered I had a type C to USB adapter that came with my Pixel 2 XL and another that came with my Pixel XL. I could of just used that with the wire that came with the GoPro just fine.", "time": "12-20-2017 07:49 PM", "replies": []}]}, {"title": "Gaming on the Pixelbook", "thread": [{"postID": "post6089741", "text": "I'm really looking more for an Android tablet that'll be supported and updated, so right now it's either the Pixelbook or the Pixel C, the latter of which is almost out of support.\nHas anyone with a Pixelbook had any luck playing Android games? Particularly the more demanding ones. I keep hearing rumors that android apps still don't work very well on the Pixelbook since it's a Chromebook and not a pure Android OS Tablet.\nThanks!", "time": "11-29-2017 01:51 PM", "replies": [{"postID": "post6102986", "text": "Yes and so far they all run just as good as they do on my pixel 2 xl. Remember the hardware on the Pixelbook is more powerful then the hardware on the Pixel 2 phone. So far the only issue I ran into with only a few games is where the playstore says the app is not compatible with my device. This only happened to me with 2 apps so far which I don't even recall which ones they were. If your looking for Android performance the pixelbook is great. I've been using the pixelbook since early Novemeber. Also it's such a nice looking device and it's also a CHROME OS notebook of course.", "time": "12-10-2017 10:14 PM", "replies": []}]}]}, {"title": "pixelbook and hangouts", "thread": [{"postID": "post6048164", "text": "im about to lose my mind over this hangouts on the pixelbook thing. i have the extension in chrome and the app in the play store.  no matter what i do i cant just run hangouts at a time it seems. the extension and the app and even another hangouts seems to be open all the time in backround. i can close the video call , hit x and close the app . then turn around and either open the extension or the app again and boom im still right there just basically able to join a hangout im already in. it doesnt go away. im trying to figure out which is the best for hangouts. the app or the extension. and how to completely separate the two if possible. seems it was even same with you tube . i had a browser page open playing you tube and closed out the page and i could still hear you tube playing in the background on the desktop screen with nothing open. like it continued in the app . idk but this play store in the chromebook thing is crazy redundant . im guessing its only with apps that also have some sort of extension also. idk any help would be awesome. mainly about closing hangouts and there's still always one open somewhere,lol.", "time": "11-01-2017 01:05 AM", "replies": []}, {"postID": "post6048954", "text": "I use the Chrome OS app (not the Android app, and not the extension), which allows me to use the transparent UI (i.e., the chat bubbles that can be moved anywhere on the screen). I can also exit the app. I have to admit, though -- I'm still not entirely clear on how you want it to behave.", "time": "11-01-2017 02:17 PM", "replies": []}, {"postID": "post6049822", "text": "that sounds about right what I want it to do. the man. but, when u open the chrome app,hangouts, does the extension or the app also open? say u did what u said, then went to say the extension or the app and looked at it, would it be connected also? then again id have to close them all. seems the two options if installed also open and stay open when anything hangouts get opened. but im gonna try what u said. the bud. that's probably my solution. when I first started al this I had two extensions and a app all in my launcher , didn't know which was open or which one to cllse,lol. thx", "time": "11-02-2017 03:31 AM", "replies": []}, {"postID": "post6050251", "text": "Hangouts is directly tied to your Google account, so any instance of opening Hangouts (whether it's the Chrome app, Chrome extension, or the actual website) will show the same conversations that are active. To completely \"close\" Hangouts, you'd have to log out of your Google account.\nI think the Chrome app works best You can see the chat bubbles in the lower right. Clicking the bubble minimizes the window.", "time": "11-02-2017 10:50 AM", "replies": []}, {"postID": "post6051256", "text": "awesome bud. I been using it and it works great. much better. the only thing left is to possibly make the video chat window when video chatting the size of that little phone looking window u have there. so I hit the chrome appm hangouts and the dots come up and I can chat in that nice small window,,,but when I video chat from there its ,,boom,,,the whole screen and it looks like its open in the chrome browser full screen. I need the video chat small like that window also. and the only one I found that works that way is the actually play store app hangouts. id but the for helping.", "time": "11-02-2017 09:45 PM", "replies": []}, {"postID": "post6051316", "text": "I haven't tried this yet, but since the video chat has its own browser tab, you could always separate that tab, then snap it the right side of the screen. After snapping it, you could then drag the dividing line over to the right as much as you can go. The tab with the video chat would then take up about 1/5 of the screen on the right, while you could keep working on another tab that takes up the other 4/5 of the screen.", "time": "11-02-2017 10:38 PM", "replies": []}, {"postID": "post6064263", "text": "been learning. heres how it goes I guess, mostly. play store apps = tablet mode. web apps need laptop mode. and extensions ,not sure yet. but the green screen just seemed to be something a reboot and reconnection fixed. apps in laptop mode ,avoid. and web apps in tablet also avoid. im sure this is surely stuff that over the next year Google will be working on with software. im feeling highly positive about that. but even with these issues and even add another half a dozen. this this is amazing. and this place has dbrand type skins for it! https://www.xtremeskins.co.uk/?utm_c...m_medium=email ..got one on the way...AND this place has a ton of skins for the pen! skinit.com . got one of these coming too. I cant seem to connect to my Google home to pixel book just regular Bluetooth to use as a speaker though. but I CAN just barely whisper ,OK google, to the pixel book so my home or phone doesn't hear,lol. assistant is mad sensitive on this.", "time": "11-11-2017 12:03 AM", "replies": []}]}, {"title": "Google Store UK - Black Friday - Pixelbook and Google Home Mini", "thread": [{"postID": "post6063610", "text": "OK I'm new to the Google/Chrome/Android ecosystem, looking to pick up a Pixelbook and Google Home Mini - what's the chances of deals on the UK Google Store on Black Friday?", "time": "11-10-2017 02:25 PM", "replies": []}, {"postID": "post6063647", "text": "Sadly - Google stuff seems to have pretty stiff price controls... and I rarely if ever see any sale prices unless aged and they are closing something out.\nBut really, I have no idea!", "time": "11-10-2017 03:02 PM", "replies": []}]}, {"title": "Ron Amadeo's review of Pixelbook on Ars Technica", "thread": [{"postID": "post6006830", "text": "Sort of damning with faint praise. Well, definite praise for the hardware, pretty much zero for the software:https://arstechnica.com/gadgets/2017...remium-laptop/", "time": "10-05-2017 10:56 PM", "replies": [{"postID": "post6059360", "text": "check this out I have tested it and so far I'm running OpenOffice and steam with no issues and very smooth.https://www.androidcentral.com/cross...ps-chromebooks", "time": "11-07-2017 10:53 PM", "replies": []}]}, {"postID": "post6006937", "text": "He makes some good points, I guess. But then I wonder what he thinks about all of those people who buy a $2000 Macbook and use it primarily to check their email and Facebook feed, and maybe some light word processing?", "time": "10-06-2017 12:15 AM", "replies": []}, {"postID": "post6039554", "text": "Reviewers had nothing but negativity for the Pixel c. Best tablet I've ever owned! I'll be grabbing a pixel book.", "time": "10-26-2017 08:48 AM", "replies": []}, {"postID": "post6039559", "text": "Engadget actually has a really positive review.", "time": "10-26-2017 08:51 AM", "replies": []}, {"postID": "post6039701", "text": "Mine just shipped!", "time": "10-26-2017 10:19 AM", "replies": [{"postID": "post6041455", "text": "When you get your device, let us know what you think. I can wait for mine to arrive.", "time": "10-27-2017 11:48 AM", "replies": []}]}, {"postID": "post6041296", "text": "Nice! I'm waiting on a bunch of checks to come in and I'll order one.", "time": "10-27-2017 10:03 AM", "replies": []}, {"postID": "post6041436", "text": "I ordered from Amazon, because the insurance was 91.00 for three years with no deductible. It will not ship until the 31st.", "time": "10-27-2017 11:38 AM", "replies": []}, {"postID": "post6044606", "text": "I received mine on Friday. I love it so far. Great design, excellent screen, and it's lighter than I expected.", "time": "10-29-2017 05:22 PM", "replies": [{"postID": "post6048032", "text": "I just received my Pixelbook today on Halloween day! So far I'm loving this thing and can't seem to put it down. So far all the android apps I have installed are working great. The only negative thing I have to say which has been said one other reviews before is the audio The speakers are not great and sound more like my Pixel XL phone speaker 0 base mostly high treble. However it still fine watching videos on YouTube etc and it's very loud. I'm willing to sacrifice the sound quality for the ultra thin light weight look. This thing is truly amazing and I'm happy that I ordered one.\nThanks", "time": "10-31-2017 09:39 PM", "replies": []}]}, {"postID": "post6060988", "text": "No one can knock the hardware.\nAnd as far as the OS - chromebooks have been around for quite some time now. The debate is old and tired. You should already know what it can do when buying this machine. It isnt going to run some of your traditional PC/MAC apps. What it does do, will be better done than anything else. IF you still need those apps, you can run linux on it. These reviews that rip the software come from obvious newbs to the chrome OS. Comparisons to PC/Mac are lame - apples to oranges.\nThe only new thing is running all the android stuff, which is crazy awesome, for an on the go mobile device. All I will say about that is, in the end, you save all the money that this device costs by being able to use all those android apps already purchased. You arent going to have to buy licenses for software over and over.", "time": "11-08-2017 09:40 PM", "replies": [{"postID": "post6061085", "text": "Well said I agree!", "time": "11-08-2017 11:12 PM", "replies": []}]}]}, {"title": "Google Pixelbook", "thread": [{"postID": "post5986353", "text": "This is a rumored device to launch on October 4th along with the new Pixel phones, and a renewed Google Home.\nThis convertible laptop will, without surprise, come at a high price. Rumored to start at $1150 for 128 GB of storage going as high as $1750 for 512 GB.\nFrom the article on AC: https://www.androidcentral.com/google-pixelbook\nSure, all this is still in the air for a couple more weeks. Hopefully, we will find out more on the 4th.\nThoughts on this new device?\nI think it is a half step in the right direction. The price will keep a lot of people away.", "time": "09-21-2017 09:54 AM", "replies": []}, {"postID": "post5986377", "text": "I'll get one as long as it has a light bar. Without a light bar, it can pound sand.", "time": "09-21-2017 10:15 AM", "replies": []}, {"postID": "post5986507", "text": "Excuse me while I clean up my drooling.\nI'm guessing this is meant to be a reference device (like previous Chromebook Pixels), and perhaps will spur other manufacturers to come up with similar devices (that cost less).", "time": "09-21-2017 11:24 AM", "replies": []}, {"postID": "post5986811", "text": "It looks pretty cool and I'm definitely interested in getting one but will wait to see what the full list of specs are before. Also kinda wish the entry level storage option was 256gb. I know OEMs all want to put super fast flash storage in but I wouldn't mind having slightly slower flash storage if I could have double the storage side 😃", "time": "09-21-2017 02:17 PM", "replies": []}, {"postID": "post5989060", "text": "I'm currently on a Pixel C and have enjoyed it a lot over the last two years. More than happy to upgrade to this Pixelbook if it does happen.\nPrices seem pretty steep, but I plan on keeping it for a few years, so should work out ok.", "time": "09-23-2017 08:30 AM", "replies": [{"postID": "post5989561", "text": "Are you getting the base storage model?", "time": "09-23-2017 04:13 PM", "replies": [{"postID": "post5989565", "text": "Have we heard anything about specs or design?", "time": "09-23-2017 04:19 PM", "replies": [{"postID": "post5989567", "text": "AC link has a few models. From 128 to 512. Prices start at 1150.", "time": "09-23-2017 04:21 PM", "replies": []}]}, {"postID": "post5989927", "text": "Yeah I will be. 128gb will be plenty for me. The Pixel C only had 32gb and I never used it all. I have everything on Google cloud services (photos, videos, music etc) so I don't need the 256/512 gb storage.\nHoping this time round they get the software working right from the start as the Pixel C had issues at release.", "time": "09-23-2017 09:36 PM", "replies": [{"postID": "post5990014", "text": "The main difference here is that it'll be running Chrome OS, not Android (although it will presumably have Android app support out of the box). The Stable Chrome channel has been rock-steady for me, but you always the option of changing to the Beta or Dev channel to see what they're working on.", "time": "09-23-2017 10:53 PM", "replies": [{"postID": "post5990164", "text": "Oh right. Well in that case, this will be my first Chrome OS device too then.\nAssuming it runs Android apps, how well does it run them? As stable as android phone apps are?", "time": "09-24-2017 02:13 AM", "replies": []}]}]}]}]}, {"postID": "post5990168", "text": "I'll let others answer that, since I'm still patiently waiting for that ability to come to my Acer CB5-571 and Lenovo Thinkpad 13 Chromebooks ...", "time": "09-24-2017 02:17 AM", "replies": []}, {"postID": "post5992054", "text": "I know, I know. If ya gotta ask and all that, but still.\nSerious question: What makes this Pixelbook worth the $1150 - $1750 price range? (I mean other than physical build quality & materials) You can pick up a mighty decent & highly portable Windows laptop for that kind of money. So what's the draw of a Chrome OS notebook that runs Android apps?", "time": "09-25-2017 11:48 AM", "replies": [{"postID": "post5992111", "text": "For the original Pixel Chromebooks it was the spec sheet, build quality, etc. The appeal of ChromeOS, with or without Android, over Windows is that it's much more secure, it's a much lighter OS, it performs much better than Windows on like hardware, etc. A $2000 Windows laptop is going to be a very good laptop, providing that the customer does a bit of research and doesn't choose something that's just terribad garbage being covered up by shiny numbers in the spec sheet. An $1150 Chromebook I would expect to have very similar specs and to have performance that's on par. \nThere are two types of people that should be choosing Windows 10 (full version) over ChromeOS on laptops: Those who are seriously into PC gaming, yet still want to do so on a laptop for unknown reasons and those who need very specific applications that are only available on desktop. Examples of that include... pretty close to nothing. 7 years ago there was a big gap in the apps available, but Photoshop, Office, most everything that normal consumers are using are all available on ChromeOS now or through their own webapps, which obviously work in a browser. \nIn addition to security, Google also has a MUCH better privacy policy than Microsoft, who gives themselves permission to and actually does share user data with third parties in exchange for compensation. Google denies themselves that permission and actually sticks to their guns on it. \nThe more direct comparison, Windows 10 S vs Chromebook, Windows 10 S comes out looking like garbage because the Windows store sucks, it's apps are largely made up of total crap, spyware, etc while the largest app makers simply aren't supporting that system and it's still filled with many of the same security flaws as regular windows. In addition, somewhere around 4 times as many people choose Chrome over Edge and over 11 times as many people use Google to search rather than Bing. If you have to be restricted to one or the other, Chrome is the obvious better choice.\nFor me personally, it depends on what I need it for. Anything that I do that isn't gaming is going to be easy to do on ChromeOS, assuming I can get a Chromebook with sufficient power for graphics to watch movies occasionally. And for gaming, even the best gaming laptops suck compared to a comparably priced gaming PC, so my personal preference is a Windows PC and a Chromebook.", "time": "09-25-2017 12:31 PM", "replies": []}, {"postID": "post6060997", "text": "Here's my take... if you need to do something it cant do, then its just not for you... but you could still run linux on it and likely run that app.\nSo, for the money the hardware is spot on. That's all that needs to be said there.\nNext, the chrome OS - it is simply the best internet browsing experience of any machine when you combine the chrome OS and this hardware. Viruses are no issue when surfing. It is lightning fast. There is nothing better. These days, you can do almost anything on the cloud and with web apps.\nAndroid assitant - if you like it on your phone and the power and ease of use, imagine that on your laptop.\nAnd finally, Android Apps - greatest library of apps of all time and the bonus is you already have purchased them on your phone. With PC/Mac you might have to buy licenses all over again for certain apps. I for one accept our Google overlords LOL because of the vast integration across their entire platform. It's simply amazing what you can do when you know how to harness it and tie it all together.\nOh and I almost forgot. Say goodbye to devastatiing software crashes. Your fix is as quick as a few minutes by resetting the machine and logging in. Settings and everything is on the cloud. You can even set up a full backup that can be accomplished without looking around for backup and OEM DVDs to boot from. It's so simple and so fast to recover and set up from the start.", "time": "11-08-2017 09:55 PM", "replies": []}]}, {"postID": "post5992150", "text": "^^^This ought to be a blog post.", "time": "09-25-2017 12:55 PM", "replies": [{"postID": "post5992226", "text": "It's long enough", "time": "09-25-2017 01:41 PM", "replies": [{"postID": "post5992274", "text": "Needs moar wordz!", "time": "09-25-2017 02:16 PM", "replies": []}]}, {"postID": "post5992271", "text": "I think you mean a guest Editor's Desk article!\nOK. I'd have to see for myself how well desktop apps, esp. Adobe InDesign, work on Chrome OS before I took the plunge myself. Then again, I can't think of any Adobe apps I wouldn't rather use on a desktop attached to at least one honkin' big monitor.\nSo my TL;DR take away re. Chrome OS/Pixelbook boils down to security, privacy, web integration, anything's better than the Windows Store, and comfort in knowing that nobody's sticking you with a 25W power supply or suchlike crapola. Thanks.", "time": "09-25-2017 02:15 PM", "replies": [{"postID": "post5992292", "text": "Exactly. The way I use laptops, they're perfect. The stuff I want to do more... I get a desktop PC.", "time": "09-25-2017 02:23 PM", "replies": []}]}]}, {"postID": "post6004703", "text": "In for a penny, in for a pound. The instant tethering business got me. My Halloween treat will be Chrome OS on a new Pixelbook to keep my XL company. Any recommendations of apps and whatnot will be greatly appreciated.", "time": "10-04-2017 06:19 PM", "replies": []}, {"postID": "post6004707", "text": "That and it starting off $150 cheaper than expected... having a hard time not pulling the trigger. If only it had a lightbar...", "time": "10-04-2017 06:24 PM", "replies": []}, {"postID": "post6024588", "text": "I think for the price the pen should come with the device... there should also be a place on the pixelbook to store it. I also am shocked Google omitted a fingerprint scanner. although I think face unlock also makes a lot more sense on a laptop than a phone.", "time": "10-17-2017 08:05 PM", "replies": []}, {"postID": "post6024885", "text": "While I plan on getting a Pixelbook, I am having a hard time understanding why an i7 processor is necessary. What real advantages will we see?", "time": "10-18-2017 12:47 AM", "replies": [{"postID": "post6028456", "text": "That’s one of my question as well. I’d buy the i7, 16GB, 512GB in a heartbeat, if it would run Windows. I know people have run Windows 10 in a Chromebook and I wonder if Google is planning to expand the Android OS or offer Windows or full Linux in the future?", "time": "10-19-2017 10:06 PM", "replies": []}]}]}, {"title": "How do I change the default browser to open an external link in Twitter?", "thread": [{"postID": "post6054825", "text": "Using Twitter as an Android app on a Pixelbook. After opening an external link I accidentally chose Chrome as the default. Want to switch it back to the Twitter in-app browser. Doesn't seem to be anything in the Chromebook settings.", "time": "11-05-2017 08:12 AM", "replies": []}, {"postID": "post6056014", "text": "Moved to the Pixelbook forum for more specific traffic (although I could also move it to the general Chromebook forum, if you prefer).", "time": "11-05-2017 10:44 PM", "replies": []}]}]
