[{"title": "What color of the XA2 would you choose?", "thread": [{"postID": "post6137348", "text": "All of the colors are nice but what color would you get of the XA2?\nBlue, black, silver or pink? \nFor me, if the blue is like the one on the XZ1 Compact, that might be a hard choice for me to pass up...", "time": "01-15-2018 07:59 PM", "replies": []}, {"postID": "post6137354", "text": "My standard choice is black.\nI'm saving up for the Ultra", "time": "01-15-2018 08:07 PM", "replies": []}, {"postID": "post6137372", "text": "Black.", "time": "01-15-2018 08:43 PM", "replies": []}, {"postID": "post6139912", "text": "Ordinarily I'd choose black, but the blue one is calling my name!", "time": "01-18-2018 07:23 PM", "replies": []}, {"postID": "post6163567", "text": "Why no red love? Cmon sony!", "time": "02-15-2018 03:59 PM", "replies": []}, {"postID": "post6164593", "text": "There's a pink one... ? I wouldn't mind that.", "time": "02-16-2018 07:59 PM", "replies": []}, {"postID": "post6165274", "text": "hahaha no pink 4 me... better a black one and get a red case :F", "time": "02-17-2018 05:29 PM", "replies": []}, {"postID": "post6190953", "text": "Best Buy has the silver, it looks stunning.", "time": "03-14-2018 04:54 PM", "replies": []}]}, {"title": "Who’s interested in the XA2?", "thread": [{"postID": "post6135110", "text": "So, is anyone planning on getting one? It looks good on paper, especially in comparison to the XA1, and it has a fingerprint sensor, which is a first (as I understand it) in the US for Sony.", "time": "01-13-2018 07:25 AM", "replies": []}, {"postID": "post6135219", "text": "Everything looks great. I would like to see some camera reviews before deciding.", "time": "01-13-2018 10:44 AM", "replies": [{"postID": "post6135420", "text": "Exactly this.", "time": "01-13-2018 03:07 PM", "replies": []}]}, {"postID": "post6152541", "text": "I am on Ultra. Since Sony Announced it continues to support update to 2020. That's basically a two years cycle for me. \nMost OEM will dropped after 1 year.", "time": "02-02-2018 11:54 AM", "replies": []}, {"postID": "post6163563", "text": "i have pre order a black one...(No red love today sony  ) have a Redmi note 4 but wanted a mid tier little device... hope looks and feels good on my hand!", "time": "02-15-2018 03:53 PM", "replies": []}, {"postID": "post6164592", "text": "I'm definitely keeping an eye on it! I've always had a soft spot for Sony and HTC brands.", "time": "02-16-2018 07:58 PM", "replies": []}, {"postID": "post6166008", "text": "So... any with the phone? My courier say the phone ill be on miami 21 feb... maybe gonna take 1 week to arrive here :/", "time": "02-18-2018 05:55 PM", "replies": [{"postID": "post6167402", "text": "Sounds like you are getting it soon. I decided to pass on it personally.", "time": "02-20-2018 10:43 AM", "replies": []}]}, {"postID": "post6166043", "text": "Seen the ultra dual SIM intl version on eBay from seller \"nevermsrp\" for $419.00.\nWish T-Mobile would get the ultra so I could upgrade my phone.", "time": "02-18-2018 06:59 PM", "replies": []}, {"postID": "post6167809", "text": "well i think im gonna get it tomorrow! so fast arriving on Costa Rica! the great thing about this is, i can return the phone if i do not like it or if there is something better at the MWC  so ill keep update guys", "time": "02-20-2018 05:47 PM", "replies": []}, {"postID": "post6168347", "text": "Got mine yesterday. So far so good on every front. Good battery life, good camera, good display.", "time": "02-21-2018 10:29 AM", "replies": [{"postID": "post6169665", "text": "Got mine today! cant say something bcuz havent use it... but damn looks pretty and yeah feels good on my hand, not like my Redmi note 4... but hey i have receive an update from sony but cant see nothing online or her support page 216MB and hey u have remove the film plastic?", "time": "02-22-2018 05:57 PM", "replies": []}]}, {"postID": "post6178904", "text": "Im here again... what i can say? I LOVE THIS PHONE!! thursday receive a second update and now the battery works better(and hey they was working good but now better!) works so good on every im using it! cant say much about pictures bcuz i dont take much pictures but its a lot better compared to my xiaomi redmi note 4 (of course their price tag are different so this is something obvious) im looking some red case and a good screen fill or tempered glass but it seems everyone on amazon its a bad quality, sorry for no posting pics of the phone or some shots...", "time": "03-04-2018 03:07 PM", "replies": []}]}]
