[{"title": "Anyone experience blurry images on Instagram after v10.25.1 on 13Jun17?", "thread": [{"postID": "post5861459", "text": "Moto G4 phone (Android V7.0) with Instagram. Been taking and uploading images for years. Then after automatic download of 10.25.1 middle of this month, the image would look focused when I look at it on the screen, but blurred after snapping it. \nFiguring my phone was bad, I ported over to an identical G4 that Motorola sent back as a warranty replacement (mine went bad, warranty would take too long, so I paid for a new one, and eventually got a second new one back from Motorola/Lenovo). \nLoaded Instagram on the second G4, same thing. So I began to experiment. If I take the photo using camera, no blur. Seems to be something about the recent release.\nCurious, I then downloaded Instagram to a 3rd phone, a Moto G4+ that is my overseas phone (travel a lot, so I don't swap out sim cards, but instead keep overseas sim cards in additional phones). With either sim card, it gave clear shots using Instagram. So it suggests some conflict between the Moto G4 and something in the new release of Instagram.\nHas anyone experienced the same thing? Any fixes?", "time": "06-23-2017 09:09 PM", "replies": [{"postID": "post6106675", "text": "Hi! I'm having the same problem with Instagram with my Moto G4, did you find any solutions to it?? Thanks!", "time": "12-14-2017 08:09 AM", "replies": []}]}]}, {"title": "Why my battery is draining quickly to a certain percentage and then working fine?", "thread": [{"postID": "post6073385", "text": "I have a Moto 4g. It was working fine till now. All of a sudden I am facing problem with battery. \nIt's charging very slowly after 90 percent. And once I put it off at 94 percent or 90 percent it drains quickly to a certain percentage of battery , say 45. After that it drains normally. What should I do?", "time": "11-16-2017 05:46 PM", "replies": []}, {"postID": "post6075176", "text": "Welcome to Android Central! Not sure if this still works on modern phones, but try recalibrating the battery sensor software by charging up to 100%, then using it normally until it shuts off automatically from low battery. Then charge back up to 100% again. Does the battery seem to decrease more normally now?", "time": "11-17-2017 11:04 PM", "replies": []}]}, {"title": "Emails stopped working on Moto G4 Play", "thread": [{"postID": "post5996083", "text": "I work for an organisation and we have about 20-30 Moto G4 Play phones. \nFor no reason at all, at the end of August, they all just stopped working with email.\nNo changes have been made to the accounts.\nThe accounts are all Exchange Prem. \nWe use Outlook on the phones and they all just stopped working and kept prompting for credentials. \nWe have FR the phones but this has made no difference. \nI tried to contact Motorola but they deny any changes on their end. \nUnable to add the accounts on gmail as gmail says we dont have access to sync to the server. \nIf anyone could offer any help, this would be greatly appreciaited.", "time": "09-28-2017 03:29 AM", "replies": []}, {"postID": "post5997352", "text": "Welcome to Android Central! Moved to the Moto G4 Play forum.\nWhat happens if you remove the email account from a phone, then try to add it back again to the stock Email app? (Or is the Gmail app the stock email app?)", "time": "09-29-2017 12:22 AM", "replies": []}, {"postID": "post6000970", "text": "Hello\nWe have removed the accounts and added them back on the phone but that did not work.\nHowever for some reason, Outlook is accepting the accounts now?? O.o\nNo idea why it stopped on several devices at the same time. \nAny idea why the sync contacts option might be missing at all?", "time": "10-02-2017 08:07 AM", "replies": [{"postID": "post6001103", "text": "Not sure either -- maybe it was a server issue?Where are you looking? The Accounts section of the system settings?", "time": "10-02-2017 10:17 AM", "replies": []}, {"postID": "post6001103", "text": "Not sure either -- maybe it was a server issue?Where are you looking? The Accounts section of the system settings?", "time": "10-02-2017 10:17 AM", "replies": []}]}]}, {"title": "How do I turn off AP Fastboot Flash Mode?", "thread": [{"postID": "post5983719", "text": "Hi. I have a Moto G4 that came with the Amazon Prime ads. I tried to install an apk to get rid of them, but it didn't work. No problem. Except now my phone is always starts up with the AP Fastboot Flash Mode (Secure). I don't mind except that it is preventing me from installing the newest Android update. I tried doing a factory reset and it didn't help. Any advice? Shouldn't there be an easy way to go back to the default boot loader?\nThanks!", "time": "09-19-2017 07:09 PM", "replies": []}]}, {"title": "What a surprise!", "thread": [{"postID": "post5980697", "text": "I said one more chance after.my Moto X lack of updates.\nGreat phone but you get what you pay for and Lenovo lies.https://www.google.co.uk/amp/m.gsmar...news-27316.php", "time": "09-18-2017 02:48 AM", "replies": []}, {"postID": "post5981654", "text": "what!!! lenovo is actually screwing motorola, what a waste :/", "time": "09-18-2017 03:06 PM", "replies": []}, {"postID": "post5982673", "text": "Motorola has agreed to provide the Android Oreo upgrade to the G4 Plus after all the outcry.There is an article on Android Central too about this.", "time": "09-19-2017 08:41 AM", "replies": []}]}, {"title": "My phone shuts down completely after adb shell command", "thread": [{"postID": "post5968760", "text": "i recently rooted my phone and then after rooting it, i got stucked in twrp menu even after several restarts. I tried fixing this by using Adb shell command. and this completely shut down my phone instead, now i cant turn it on anymore. Using Moto G4+", "time": "09-11-2017 10:26 AM", "replies": []}, {"postID": "post5969548", "text": "when you connect it to the charger does it turn on?", "time": "09-11-2017 07:00 PM", "replies": []}]}, {"title": "My turbocharger isn't working.Can I gix it by myself ?", "thread": [{"postID": "post5968118", "text": "I have a Moto g4 plus and a turbo charger got along with the phone.The usb cable works fine but the main adapter's head fell down many times and is not working now. Can I open the adapter's and check if I can fix it ? If yes please guide me !", "time": "09-10-2017 09:18 PM", "replies": []}, {"postID": "post5969022", "text": "If you understand electronics, probably, but troubleshooting isn't something that can be \"taught\" over the internet, it needs many months of hands-on learning.\nSo, assuming that you're not a trained tech because you asked the question, I'd say no, you can't fix it by yourself. And the labor to fix it, even if there are no broken parts, would be a lot more than the price of a new charger.", "time": "09-11-2017 01:19 PM", "replies": []}]}, {"title": "Ghost Touches: Can anyone help me with my Moto G4?", "thread": [{"postID": "post5891509", "text": "I have had my Moto G4 for a little over a year now. A few months ago, my phone has been experiencing ghost touching here and there. \nNow, it has gotten worse. I have noticed that it only happens when I take it outside and sunlight directly or at times indirectly shines on it. \nWhen I'm inside of a building or under the shade of a tree (ceiling, umbrella, etc) it works just fine. This goes for any other activity, including charging. \nI went to a phone repairer who said the screen needs to be replaced, however, I want more input because it could be something else.", "time": "07-19-2017 03:22 PM", "replies": []}, {"postID": "post5892501", "text": "I feel you, I had to send my g⁴plus back twice because of the ghost touch. Now as of this month my year warranty is up and the placement g⁴plus I have now will ghost touch sometimes too, mainly if I'm using another charger and try to do stuff while plugged in. I just think that unfortunately this is an issue most of us will have to deal with using this phone. For most, simply turning off and on again will make it go away for a while.. \nOver the year of owning it, the following has seemed to help others.. \n1. try a new case / screen protector (some cases don't vent enough heat and may trigger ghost touch, some protectors are said to set off ghost touch) \n2. Try using only the Motorola chargers for the phone. \n3. if under warranty send it for a replacement", "time": "07-20-2017 10:54 AM", "replies": []}, {"postID": "post5926942", "text": "I kept waiting too long to send mine back in. I should be on my third (at least) G4. It makes me sad that Motorola didn't make changes to the device. If it was a known issue and the G5 was out and the issue resolved, why not send out G5 instead.", "time": "08-17-2017 06:26 PM", "replies": []}, {"postID": "post5964782", "text": "Mine got really bad with ghost touches last April, several months after I bought it. I didn't want to send it back. What helps is just to turn the screen off and on a few times. I think it's a hardware design flaw - the letters that pour out of the keyboard are the ones right over the sim and sd cards", "time": "09-08-2017 05:18 PM", "replies": []}]}, {"title": "Moto G5. Great phone but voice volume very low", "thread": [{"postID": "post5962369", "text": "Recently bought a Moto G5. Really pleased with it but incoming voice seems very quiet even though the side switch is set to full. Any suggestions?", "time": "09-07-2017 02:13 PM", "replies": [{"postID": "post5963088", "text": "Who is your carrier in what country? What device and Build number specifically, look in Settings - About Phone - Regulatory Information and note the XT16XX number, and in Settings - About Phone and scroll to bottom and note the Build number (NPN{something})?\nThere are some known issues with Verizon currently on this device and low volume/quality, and some VoLTE carriers as well. Moto is aware of it and is actively testing new firmware updates to rectify the issue.", "time": "09-07-2017 09:09 PM", "replies": []}]}, {"postID": "post5962439", "text": "Welcome to Android Central! Moved from the Moto G (2016) forum (which is for the Moto G4) to the G5 forum.\nIs it also too soft if you use a wired or Bluetooth headset?", "time": "09-07-2017 02:42 PM", "replies": []}, {"postID": "post5963563", "text": "Hi Ace Javelin\nCarrier Tesco (O2)\nCountry UK\nModel XT1675\nBuild NPP 25.137.15\nThanks \nDave", "time": "09-08-2017 05:42 AM", "replies": []}, {"postID": "post5963577", "text": "Hi B Diddy\nMuch better with wired headset\nthanks \nDave", "time": "09-08-2017 05:52 AM", "replies": []}, {"postID": "post5964084", "text": "Since it's a brand new phone, I assume there hasn't been enough time for debris to build up in the earpiece speaker opening.\nIt's difficult to know if it's abnormally quiet from a forum post -- do you know anyone else with a G5 that you can compare with? You could also try toggling VoLTE (aka Advanced Calling, HD Voice, Enhanced 4G) on or off, depending on what it's set to now.", "time": "09-08-2017 10:47 AM", "replies": []}, {"postID": "post5965211", "text": "The official Lenovo forums has a thread over 150 posts long regarding low volume... https://forums.lenovo.com/t5/Moto-G5...r/td-p/3664713\nPersonally, I am on AT&T in the US and have not experienced any noticeable reduction of audio from my previous phones, but then again AT&T does not support VoLTE on retail devices that are not AT&T branded.", "time": "09-08-2017 10:05 PM", "replies": [{"postID": "post5965220", "text": "Wait, there are other forums besides AC?", "time": "09-08-2017 10:10 PM", "replies": []}]}, {"postID": "post5968584", "text": "I see what you mean. Will take my phone back to the store. Shame because nice phone apart from not being able to hear lol\nthanks", "time": "09-11-2017 07:57 AM", "replies": []}, {"postID": "post5973020", "text": "One workaround suggested in the Lenovo support forum is to put the phone into speaker phone mode and turn the speaker volume down.\nThere is also a post or two over there that detail which file in the firmware to edit after rooting the phone to bump up the volume of the earpiece.\nFor most calls I don't have a problem with the low volume. Every once in a while I do have the issue and resort to the speaker phone and turning the volume down. In that Lenovo thread I posted my informal comparison of the max volume of a Droid Mini and the G5 Plus to show that the G5 Plus has a lower max volume than my previous phone, the Droid Mini.", "time": "09-13-2017 05:26 PM", "replies": []}, {"postID": "post5973675", "text": "Thanks for that bennor. Finally lost patience with it in busy city centre this week. Only require the basics on a phone preferring laptop or pad for other stuff. Now changed under cooling off period for cheap Galaxy J3. See how that goes.", "time": "09-14-2017 04:18 AM", "replies": []}, {"postID": "post6120750", "text": "Fix for MOTO G5 Plus Phone Volume - Simple Setting Change\nClick Green Phone Icon to get to the main Phone menu.\nOpen Settings (3 vertical dots upper right corner)\nSelect Settings then select Calls then Uncheck the Voice Privacy box [ ]\nThis will fix your telephone volume problem by deactivating the DEFAULT Volume Privacy buffer\nIf you would like a tad more volume: \nFrom the Call setting menu Go back one page to the Settings menu\nSelect Accessibility and checkmark the Turn on hearing aid compatibility box [x] \nIf you are having problems keeping any volume control level from falling from 100% back to 75%, \nsimply hold the volume dot at 100% and simultaneously select [OK] in the excessive volume message.\nHope this helps. Bob", "time": "12-28-2017 05:53 PM", "replies": []}]}, {"title": "Phantom Touches on new Motorola G4", "thread": [{"postID": "post5466256", "text": "I purchased my wife a Moto G (4th Gen.) Unlocked - White - 32GB from Amazon. She loves it but has reported to me that it goes haywire once in a while. I was finally with her when it happened and it looked like fast, phantom touches. Should I exchange it or is there a fix for this?", "time": "10-05-2016 09:31 AM", "replies": [{"postID": "post5466274", "text": "I would suggest clearing the cache partition. Follow the instructions provided on this page to clear the cache from recovery: https://motorola-global-portal.custh...,9686/kw/cache\nIf that doesn't work then consider contacting Amazon for a replacement.", "time": "10-05-2016 09:39 AM", "replies": [{"postID": "post5466298", "text": "I'll give it a try...thanks...", "time": "10-05-2016 09:49 AM", "replies": []}]}]}, {"postID": "post5466776", "text": "Does she have the phantom touch issue only when she's connected to the charger? or does it happen regardless to whether the phone is charging or not?", "time": "10-05-2016 12:12 PM", "replies": [{"postID": "post5467289", "text": "No, only when it is not charging...she just let me know it happened again...like berserk phone tapping hear the top by the notification slider for 5-15 seconds and then stops.", "time": "10-05-2016 02:59 PM", "replies": [{"postID": "post5467356", "text": "We are going to replace it...Amazon makes it easy...hope it was a fluke because she liked this phone...", "time": "10-05-2016 03:26 PM", "replies": []}]}]}, {"postID": "post5467855", "text": "yeah I just ask because my moto g3 had the ghost touch issue but I (and a few others I've seen report online) would only experience it while it was plugged into the charger. Disappointing, but I just dealt with it because I really love the phone and it didn't do it that often enough to drive me crazy. \nI think I may have noticed the ghost touch on my g4 plus too but again I figured it was because my phone was plugged in and it seems to happen less than the g3. \nI hope she gets a good one for a replacement. It's a shame because the ghost touch is not an uncommon issue, but there's also plenty of g4s that don't experience this. Guess it has to be luck of the draw with moto g's anymore", "time": "10-05-2016 06:56 PM", "replies": [{"postID": "post5480003", "text": "Got the new one this weekend...the next day, phantom touches...so we took the nice but cheap case off of it...no phantom touches...so good guess it is the case...", "time": "10-10-2016 01:29 PM", "replies": []}]}, {"postID": "post5599583", "text": "I've just reset my cache, took a case off and a screen cover off - trying to see if that helps. Really truly annoying.", "time": "12-08-2016 09:04 PM", "replies": []}, {"postID": "post5606100", "text": "I had to hard reset the device back to factory. There must have been an issue with an app or setting, because it started up again when I tried to restore everything.\nNow, with a reset and fewer apps installed, much better. Maybe a light issue of phantom/ghost touches - but nothing obvious.", "time": "12-13-2016 05:34 PM", "replies": []}, {"postID": "post5676263", "text": "I've had my Moto G4 from Amazon for almost 6 months. About 3 months ago I began experiencing random ghost touches, always after touching the power button to turn screen back on. These gradually increased in frequency and severity. Lately they would occur on 2/3 to 3/4 of my attempts to use the phone. The only thing I could seem to do was to repeatedly power the screen on and off until it stopped. It's been driving me nuts!\nOf course I'd tried rebooting the phone, then tried clearing the cache partition, to no avail.\nToday I saw in another forum what seemed to be a ridiculously simple solution: turning down the display brightness. I normally had been running it at 100%. I turned down the display brightness to 40-60% and the ghost touches became much less frequent. I then turned the display brightness to 30%, and the random ghost touches have completely stopped!\nSo glad to be able to use this great phone again!\nObviously there must be some hardware issue here that Motorola should solve at a production-quality level, but this is a simple workaround that is enabling me to use my phone without having the hassle of returning it to Amazon for a new one.", "time": "02-12-2017 11:51 PM", "replies": []}, {"postID": "post5677417", "text": "I am surprised by the number of reports of phantom/ghost touches on the G4 series. I have not experienced it (so far) on my G4 Play. \nBut this post has me wondering. I rarely have my brightness above 30%. Maybe THAT'S why I don't see the problem?", "time": "02-14-2017 12:22 AM", "replies": []}, {"postID": "post5677475", "text": "I've had mine since launch and like the above poster, I never have my brightness above 30%. So far I haven't experienced a single incident of 'ghost touch'.", "time": "02-14-2017 02:53 AM", "replies": []}, {"postID": "post5680889", "text": "Bought my unlocked G4 from BestBuy (Jan 4 2017). Three weeks later The Ghost appeared. Tried every \"fix\" from the internet. Most stable was no apps but still jumpy. Was after Bestbuys 14 day return for new unlocked no contract phone. Contacted Motorola and they did a replacement took less than a week. Moto paid postage both ways. Two weeks later with all apps loaded and still stable knock on wood.", "time": "02-16-2017 09:16 PM", "replies": []}, {"postID": "post5745664", "text": "Got my unlocked Moto G4 as one of a pair (one for wife, one for me) at Costco in November, 2016. This ghost stuff started happening to me a month or so ago. This is not happening on my wife's phone, though I do load & use lots more apps than she does. My \"fix:\" Turn off/back on and it goes away for a while. Might try that return that Moose 26 tried. (It's got a 1 year warranty, right? ) :-)", "time": "04-05-2017 06:48 PM", "replies": []}, {"postID": "post5747560", "text": "https://motorola-global-portal.custh...pp/mcp/service \nNo hassle, they know they created a few bad units.", "time": "04-06-2017 09:04 PM", "replies": []}, {"postID": "post5812145", "text": "Thanks - followed Moose26's link. Mentioned phantom touches in the explanation. They gave me a fedex label to send it back. 1 week later, replacement Moto G4.\nOf course I already used this issue as an excuse to upgrade to a G5, but now my kid gets a new hand-me-down G4.", "time": "05-12-2017 04:05 PM", "replies": []}, {"postID": "post5817647", "text": "The ghost touch problem cannot be solved by cleaning your cache or doing a factory reset. The best solution is to not use the Turbo Charger and to set your display to Adaptive Brightness. This will keep you phone cooler. You may occasionally still suffer from ghost touches, but it will be a rare occurrence.", "time": "05-16-2017 05:37 PM", "replies": []}, {"postID": "post5817649", "text": "Saw it too. But if it's a hot day or you are in your car where it is warm, the phantom touch will act up again. You can to replace it.", "time": "05-16-2017 05:39 PM", "replies": []}, {"postID": "post5829392", "text": "You can have your brightness on low, but if it's a warm day or you are in your car and its hot, the phone will start acting up again. Despite the brightness setting. The only real solution is to exchange it. I'm wondering if other Motorola models have the same problem.", "time": "05-26-2017 06:56 PM", "replies": []}, {"postID": "post5926954", "text": "I keep my screen brightness down to about like 10%. Several hours after taking it off any charger, I will still have issues. This is my second phone (first replaced via warranty). I bought my G4 from Best Buy on launch day so my warranty is done. I can try ditching my case as I know a rubber shell with a plastic surround isn't going to allow heat to easily dissipate.", "time": "08-17-2017 06:35 PM", "replies": []}]}, {"title": "All media associated with audio will not play", "thread": [{"postID": "post5921801", "text": "I use a Motorola G4, fully updated to the latest version, with no notable damage. I have never encountered any bugs/errors with the phone up until now.\nAbout two weeks ago I tried to use Google with voice using \"Ok Google\" and received no response. When pressing the microphone button I was prompted with \"Google is not available right now.\"\nGoogle worked fine in-app and I could search - my internet was working fine. I figured it was an issue with my microphone.\nLater I found my music would not play through play music. When I chose the shuffle option, it would seem my phone was attempting to play the song, but finding it was not possible and rapidly going through them until reaching the end of my playlist.\nFinally I found that video didn't work either. Boomerang loops on Instagram do, so I figured it was because they were audio free - other videos on Instagram did not work. When trying to record video, the phone says it \"failed\".\nI am now left with a phone that's speaker will not function, and even when plugging I'm external audio hardware such as speakers or headphones no audio will work, including making calls. It will not play videos associated with audio, even refusing to play on platforms such as VLC and YouTube. It will not record video, or register audio.\nOne might understand why this has left me a little miffed.\nIs this a problem that can be fixed by disabling some hidden away function in my phone? Or is it likely that I will have to send this back to the manufacturer?", "time": "08-12-2017 07:15 PM", "replies": []}, {"postID": "post5921965", "text": "Welcome to Android Central! Try wiping the cache partition: https://motorola-mobility-en-in.cust...p/30,6720,9686. If that doesn't work, does it also happen in Safe Mode? https://motorola-mobility-en-in.cust...p/30,6720,9686", "time": "08-12-2017 11:41 PM", "replies": []}, {"postID": "post5922698", "text": "I did all that you suggested, and it showed up some interesting results\nPartition Clear: I had to try this a couple times as my volume buttons fell off, I had to use a fork. I was a bit surprised at first, as I expected it would take between 5 - 10 minutes, however, it took just little under 3 seconds. I booted up the phone once more, but found no change\nSafe Mode: Safe mode presented more favourable results. I started by saying \"Ok Google\", and was pleasantly surprised to see the phone recognise the phrase and pull up Google. I could search using my voice, and my microphone seemed to function perfectly. Sadly the phone would not output audio from the speaker, but videos were no longer giving out error messages, and shuffling my music allowed the songs to play (in silence) until the end, without switching almost instantly to the next song. This sparked an idea, and I plugged my headphones in, and they worked fine.\nWould a fair assumption be that a third party application is causing audio related problems, and my speaker is just broken?", "time": "08-13-2017 07:54 PM", "replies": []}, {"postID": "post5922733", "text": "Update*\nI have just attempted to launch the phone in safe mode for the second time, and it is not performing in the same way it did originally, no sound, play music bugging out, headphones refusing to work.\nIf this information is of any use, the first time I loaded up safe mode it was the first time I had gotten the \"intro\", the video with the dog, lips, daft punk doing s backup ect.. \nI also tried uninstalling apps and completing another cache clear before going back into safe mode for a third time, no change.", "time": "08-13-2017 08:30 PM", "replies": []}, {"postID": "post5922804", "text": "Has the phone had any trauma, like drops? When you mentioned that the volume button fell off, that made me wonder if the phone has been knocked around a little, which would mean that anything is possible.", "time": "08-13-2017 10:30 PM", "replies": []}, {"postID": "post5923063", "text": "The phone has had drops, but none that I would have thought to damage the phone, all less than two meters. The phone also has a protective case.", "time": "08-14-2017 08:13 AM", "replies": []}, {"postID": "post5923284", "text": "Might have been enough to disrupt the speaker, perhaps by loosening a connection. If you're handy, you could try opening it up and seeing if anything is loose:", "time": "08-14-2017 12:16 PM", "replies": []}]}, {"title": "Moto g4 plus massive battery drain", "thread": [{"postID": "post5907602", "text": "I own a moto g4 plus since 5 months. I have two sims in phone, one of which runs on 4G VOLTE. Battery drain on this phone is crazy. Phone never lasts more than 18 hours, including total idle time of 7 hours during night. And I never get SOT of more than 3.5 hrs. I have no clue what's going wrong. I don't play games, don't have facebook app on my mobile. Still this. It's maddening and infuriating. I always have to carry my charger around. Does anyone have any remedy for this?\nRefer to below screen shots", "time": "07-31-2017 11:59 PM", "replies": []}]}, {"title": "Battery Stuck at 100%", "thread": [{"postID": "post5883281", "text": "Hi All\nNew to the forum, thanks in advance for any help/suggestions. \nI've a Moto G3 which has worked perfectly until recently. For a couple of weeks now the battery indicator is stuck at 100%. The battery depletes as normal but only ever shows 100%. I'm on android 6.0.1 (I recently updated from Lolipop but no change to this issue), I've cleared the cache partition, I've run a battery calibration app. I'm keen to avoid a full factory reset just for the hassle of losing everything on the phone. Has anyone any ideas of anything else I can try? \nThanks\nNB", "time": "07-13-2017 05:30 AM", "replies": []}, {"postID": "post5883741", "text": "Welcome to Android Central! One way to try recalibrating the battery sensor software is to charge up to 100%, then use the phone until it shuts down automatically from low battery. Then charge up again to 100%. Now see if the problem persists.", "time": "07-13-2017 12:06 PM", "replies": []}, {"postID": "post5883848", "text": "I think this happened to me last week (by accident - battery just ran out with no warning, still showing 100%!) but I'll try it again tonight/tomorrow and let you know. Thanks for the suggestion.", "time": "07-13-2017 01:30 PM", "replies": []}, {"postID": "post5884744", "text": "So I tried this but sadly no change. Anything else you can think of?", "time": "07-14-2017 08:58 AM", "replies": []}, {"postID": "post5884940", "text": "Welcome to the forums. Are you using any battery monitor app? Do you get the same readings? You could try safe mode to make sure that there's not a conflict with any third party app.\nAlso, you could try resetting app preferences in settings - apps - three dots top right and then restart the phone.", "time": "07-14-2017 11:10 AM", "replies": []}, {"postID": "post5884967", "text": "Another thought, do you have Developer Options or the System UI Tuner enabled?", "time": "07-14-2017 11:21 AM", "replies": []}, {"postID": "post5886420", "text": "Hi Javier\nThanks for your suggestions. Yes 3rd party battery monitor apps also show 100%, as does the phone's battery monitor even in safe mode. Resetting app preference didn't fix it either. I don't have developer options or system UI Tuner enabled. \nIf you've any other suggestions I'd be happy to try them and thanks for your thoughts so far.", "time": "07-15-2017 02:42 PM", "replies": [{"postID": "post5886447", "text": "That's not good news  It could be easier if safe mode fixed the problem. Anyway, you could try wiping the cache partition from recovery before going nuclear and hit factory reset. I've read several reports about a similar issue and only a factory reset managed to fix it. \nIf the cache partition wipe doesn't fix the problem you could also try clearing data for the settings app as a last resort before factory reset.", "time": "07-15-2017 03:03 PM", "replies": []}]}, {"postID": "post5886906", "text": "Already tried wiping Cache Partition - no joy. Tried to clear data for settings app but no change either. If I do try the full factory reset, is there any app (maybe linked to a laptop for example) that saves all my apps and memory that saves me having to reloads everything manually afterwards? Thanks.", "time": "07-16-2017 02:58 AM", "replies": []}, {"postID": "post5887916", "text": "There isn't any good all-in-one backup and restore app. You could use Helium to backup your app data. I always recommend taking advantage of your Google services to make sure that data is synced to your Google account in the cloud (i.e., using Google Contacts, Google Calendar, Google Photos, Google Keep, etc.). For SMS, use SMS Backup & Restore.", "time": "07-16-2017 11:36 PM", "replies": []}, {"postID": "post5888021", "text": "A batterie that never dies.lol give it too me", "time": "07-17-2017 04:19 AM", "replies": []}, {"postID": "post5888204", "text": "Thanks B Diddy. Have to work out if keeping it as is or doing a factory reset is the lower hassle solution. If/when I do it I'll update how it goes in case anyone else with a similar problem finds this post.", "time": "07-17-2017 08:37 AM", "replies": []}]}, {"title": "How do I get the disappearing keyboard back?", "thread": [{"postID": "post5881131", "text": "I'm a former iPhone user, happily making the transition to Android since I live in a Windows/Google-centric universe.\nOne maddening problem I'm having, however, on my Moto G plus (Android 7.0) is that when I dictate a text or email, and want to use the keyboard to clean up a mistake or two, I can't find it. The little-colored cursor icon appears and I tap it, but it just gives me more text options, not a keyboard.\nWhere does the keyboard go in these instances and how do I find it when I need it?\nIn settings, my Physical keyboard is set to \"Speech.\" What setting, widget, or whatever do I need to access in order to fix this problem?\nTried to search the forum for help on this but didn't turn up anything.\nThx for any help offered.\nBob", "time": "07-11-2017 08:11 AM", "replies": []}, {"postID": "post5881136", "text": "Welcome to the forums. You should have a physical keyboard also in Settings to choose from, though I have not used the speech function. I have moved your post to the Moto G forum for more help from fellow owners.\nIf you need additional help or have more questions or details to share, please join the site so you can reply in this thread. See this link for instructions on how to join Android Central.\nMod Note: Thread moved for better visibility.", "time": "07-11-2017 08:17 AM", "replies": []}, {"postID": "post5881402", "text": "Thx for the reply and for moving the question to the Moto G5 Plus forum. I didn't realize that existed.\nHopefully, someone there can help me sort this out.\nBob", "time": "07-11-2017 12:46 PM", "replies": [{"postID": "post5881463", "text": "Hello Bob! Thanks for registering and welcome to the forums! Let me ask a couple of question to be sure I completely understand your problem. Do you get a red mic icon when voice typing? If so, clicking on it should stop the voice typing and return the keyboard to the screen. As far as I know editing texts by voice commands is very limited to just a couple of Google programs and under some conditions.\nAlso, in your first post it wasn't clear which Moto model you have. It is the G5 plus, right? If so, we could move your thread to the specific forum.", "time": "07-11-2017 01:21 PM", "replies": []}]}, {"postID": "post5881566", "text": "Sorry, Moto G5 Plus. A great phone by the way. I can't get over how much better it is in many ways than my $650.00 iPhone 6s and costs 1/3 the price, unlocked.\nI'm not trying to edit by voice, just dictate. Then if I want to make a correction, I'd like to have access to the keyboard.\nAnyway, I just figured it out. If dictating by voice, I can't pause the dictation and then edit directly with the keyboard. I have to click off the dictation and then the keyboard appears. That's different from the practice on the iPhone which I'm accustomed to.\nNow if I can just figure out how to locate and send screen shots!\nThx for your help.\nBob", "time": "07-11-2017 03:03 PM", "replies": []}, {"postID": "post5881580", "text": "Glad you managed to resolve it! Yeah, the G5 plus is a great mid-ranger, my wife's got one and she loves it.\nAbout the screenshots, you can see them in the Google Photos apps under albums - screenshots. To post them here it will depend on which app you are using. See this guide.https://forums.androidcentral.com/sh...d.php?t=737130\nThere are a few tricks to make that phone even better that you can find around the forums. Feel free to ask anything you need.", "time": "07-11-2017 03:20 PM", "replies": []}, {"postID": "post5881670", "text": "Thx for the help and the link to the info on screenshots.\nBlessings,\nBob", "time": "07-11-2017 04:56 PM", "replies": []}]}, {"title": "Stuck in TWRP recovery on a Moto G4 running Nougat- Fix?", "thread": [{"postID": "post5847056", "text": "Problem: I unblocked my Moto g4 running Nougat and installed the latest version of twrp; everything was going well. Then I rooted my phone and installed superSU using twrp --- That is when the problem began and I can no longer boot into my regular system. Everytime my phone boots it boots into twrp recovery mode - \nWhat can I do to simply boot up into my regular Nougat system?", "time": "06-11-2017 02:31 PM", "replies": []}, {"postID": "post5878697", "text": "Did you ever find a fix for this I am in the same boat. Just boots to TWRP tried to use rsd lite but it will not detect phone!!!", "time": "07-09-2017 05:58 AM", "replies": []}]}, {"title": "Moto G4 screen malfunction issue", "thread": [{"postID": "post5877388", "text": "Hello. I'm having an issue with my Moto G4 that I bought 3 months ago. Last week my Moto was working fine. Then I turned on the screen and it was a mesh of gray and diffrent colored pixels, but it still responded to touch as I could hear the notifications and vibrated when I entered my password and shuffled throught the app drawer. I tried force rebooting the phone and it would always result in the same gray screen. By the end of the day the screen wouldnt turn on at all. I thought the battery had died so I charged it. The phone has power as I hear notifications and my alarm still goes off at the same time. It also responds to gestures such as the light karate chop. I haven't tried factory resetting because I cant see anything on the screen. Im not sure if this is a hardware issue or it was due to and update.", "time": "07-07-2017 11:43 PM", "replies": []}, {"postID": "post5878019", "text": "Welcome to Android Central! See if you can boot into Recovery and wipe the cache partition: https://mobilesupport.lenovo.com/us/...ution/MS110588. If the screen still doesn't turn on, then it's a hardware failure. Is the phone under warranty? If so, contact Lenovo.", "time": "07-08-2017 02:22 PM", "replies": []}]}, {"title": "Android Marshmallow not letting me to even check for software update on roaming celluar network.", "thread": [{"postID": "post5760813", "text": "My primary celular network is currently on roaming (in my country there is no additional data charge for roaming network).\nI don't have WIFI since it was ironically expensive as compared to mobile data so don't give me that suggestion. \nHow can I override this issue and update my phone over celular network on roaming? By the way I have already enabled data on roaming in celular network settings.", "time": "04-15-2017 01:11 PM", "replies": []}, {"postID": "post5760976", "text": "Welcome to Android Central! Did you get your phone directly from a carrier, or did you get it unlocked from somewhere else? If it's a carrier-specific phone, it usually needs to be on that carrier's network in order to get the official OTA system update.", "time": "04-15-2017 03:29 PM", "replies": [{"postID": "post5836760", "text": "It's not that we can't get an update but we are facing the problem that we can't update over a roaming sim it works only on wifi. We would like a solution for that as in some cases wifi Network can be paid n a lot expensive over cellular network Data usage.", "time": "06-02-2017 01:51 PM", "replies": []}]}, {"postID": "post5837576", "text": "Welcome to Android Central! I'm not sure if there's a way to get around that. Some manufacturers and carriers allow you to update using a program on your PC, but I don't think Moto has that. Which carrier do you have?", "time": "06-03-2017 11:35 AM", "replies": [{"postID": "post5838562", "text": "I recently got a Coolpad Note 3s with an Airtel India 4G sim. But I think I got the solution. We have to just click the software update button 5 to 6 times repetatively. It will start to search for update.", "time": "06-04-2017 12:32 PM", "replies": []}]}]}, {"title": "Do all contacts must be saved to Google", "thread": [{"postID": "post5780214", "text": "I am new to Android 6. I found that the contacts must be saved to Google now. Is there any way to avoid that and save to local memory?", "time": "04-23-2017 06:46 PM", "replies": []}, {"postID": "post5780415", "text": "Welcome to ACentral.com\n@oncinc: From my understanding the contacts are already-Saved\nin the Phone internal memory and saved to Google now is to \nprevent contacts lose..That's my opinion: Any other replies?", "time": "04-23-2017 08:30 PM", "replies": []}, {"postID": "post5794662", "text": "I had exactly the same problem - didn't want to save contacts in the cloud . Try using MyLocalAccount from the Playstore. It works well for me", "time": "05-01-2017 03:20 AM", "replies": []}]}, {"title": "Clearing cache", "thread": [{"postID": "post5787082", "text": "How often should cache be cleared? Got the Moto G4 near the end of March for my mum but she seems to always wanting to clear cache. She's sat here now clearing cache for all her apps. She's doing it one by one but surely clearing cache every month or every few weeks can't be good?", "time": "04-26-2017 07:18 PM", "replies": [{"postID": "post5788860", "text": "Clearing an app's cache is really only necessary when you're having a problem that app, as that might clear up the problem. But generally there's no real practical reason to continuously wipe app caches. Tell your Mum a) you love her dearly and b) that what she's actually doing is inadvertently making her mobile device work harder than it needs to by constantly wiping those caches -- each time she uses an app it needs its cache to function so by deleting those caches, every time she uses an app it needs to rebuild those deleted cache files.", "time": "04-27-2017 06:15 PM", "replies": []}]}, {"postID": "post5787139", "text": "You don't need to clear the cache on a regular basis. See this guide for some info about cache and different ways to clear it.https://forums.androidcentral.com/sh...d.php?t=558872", "time": "04-26-2017 07:42 PM", "replies": []}, {"postID": "post5787655", "text": "Thanks that was useful. So only need to clear cache if there is a problem with an app or after a system update?", "time": "04-27-2017 05:23 AM", "replies": [{"postID": "post5787671", "text": "Yeah, that's what I do. Also, you can check from time to time the cached data size (settings - storage), just in case it's getting too big. Depending on your usage, apps heavy on media files or browsers like Chrome could create big cache files. But if your phone is running fine you don't need to worry about cache. And never, ever, use a cleaner app", "time": "04-27-2017 05:43 AM", "replies": []}]}, {"postID": "post5788796", "text": "Well I've told my mum so hopefully she won't keep clearing the cache now. We never use cleaner apps either as I no there bad.", "time": "04-27-2017 05:39 PM", "replies": []}]}, {"title": "PLEASE!!! I need help w/my Modd G4 &undeleting a list from my notepad that I did NOT mean to delete", "thread": [{"postID": "post5757894", "text": "I went into my note pad where I have 2 lists-1) \"to buy\" and 2) \"to do\"...please don't laugh. I just recently switched over per my husband begging me for yrs to get rid of the paper lists which admittedly would be left all over the house, car, my purse and admittedly often lost. Anyhow, I had completed some of the tasks and wanted to delete them off the list. However, to my HORROR I accidentally deleted to entire \"to buy\" list...I'm so stressed out!!!! That list is very, very important to me and regardless how it's titled it's not just about trinkets I want to by for myself!! It's a very important list and am HOPING there is someway, anyway, to get it back. PLEASE, PLEASE help!!!! Thanks in advance.", "time": "04-13-2017 04:38 PM", "replies": []}, {"postID": "post5764130", "text": "Welcome to Android Central! If you were using the stock notepad app, then I'm afraid the list is gone. I strongly recommend using an app that automatically syncs to the cloud and has a Trashcan/Recycle Bin feature, like Google Keep. The stock notepad apps on most devices usually don't sync anywhere and don't have the ability to recover deleted notes.", "time": "04-17-2017 02:06 PM", "replies": []}]}, {"title": "Pattern lock glitch on 6.0.1, Marshmallow, moto G4", "thread": [{"postID": "post5748488", "text": "I changed the pattern lock on my Moto G4, it accepted the new pattern.\nHowever when I locked the phone and tried to unlock the phone with the pattern it would not unlock.\nI have tried many options for unlocking the phone using the Android Device Manager to no avail.\nI have tried the lock your device and change password option but it says \"your device is locked already locked with a password so we have not changed it\" or words to that effect.\nHas anyone else had this problem and found a work around?\nIs it a glitch in the Motoraola or Android programming?", "time": "04-07-2017 12:54 PM", "replies": []}, {"postID": "post5748552", "text": "Welcome to Android Central! Did you try your old pattern as well?", "time": "04-07-2017 01:37 PM", "replies": []}, {"postID": "post5751038", "text": "Hello B.Diddy,\nThank you for your reply that was the first thing I tried but there is no harm in trying again.", "time": "04-09-2017 11:27 AM", "replies": []}, {"postID": "post5761751", "text": "Hello B.Diddy,\nI retired the old pattern again and no it did not work.\nI think it is a fault in the Motorola programming myself but they won't admit that if they've left a glitch in the OS that effectively bricks your phone.", "time": "04-16-2017 03:56 AM", "replies": []}, {"postID": "post5762219", "text": "I wish I could help more, but if it's not accepting your pattern, and if it doesn't ask for your Google account information after enough failed unlock attempts, then I'm afraid you're stuck.", "time": "04-16-2017 11:11 AM", "replies": []}]}, {"title": "Data subscription change in progress", "thread": [{"postID": "post5754212", "text": "My phone is Moto g3 and mobile data is not working. I applied for MNP and changed my SIM from Vodafone to Airtel and since morning as soon as entered Airtel SIM, mobile data isn't working.. mobile data switch is greyed out and when i click on mobile data it shows \"mobile data change in progress\"..I have tried clearing the cache memory but it doesn't work..Tried restarting the phone, reinserting the SIM, doesn't work data is working on the SIM when. Tried on another phone..Kindly help ..I don't want tof factory reset and my phone is not in warranty", "time": "04-11-2017 11:50 AM", "replies": []}, {"postID": "post5754401", "text": "Welcome to Android Central! Are you sure you have the correct APN settings for Airtel? Which region of the world are you in?What is an APN, and how do I change it? | Android Central", "time": "04-11-2017 02:18 PM", "replies": []}]}, {"title": "Duplicate pictures", "thread": [{"postID": "post5722637", "text": "Recently I have a problem with my phone, it's showing duplicate (double) pictures everywhere, except that there's only one file for each of them, the only difference is that one path will be \"/sdcard/Whatsapp/Media/WhatsApp Images/photo1.jpg\" and the other one will be \"/storage/emulated/0/Whatsapp/Media/WhatsApp Images/photo1.jpg\"\nIf I edit either file, the changes will appear on the other. The file is the same, only the paths are duplicated. Everything was working fine a couple of days ago, I would only see one file of everything. It all started after someone turned on the phone without the extra SD card (formatted as internal storage) in it, then the paths were duplicated.\nI can see the duplicates on Google photos, Facebook, messenger and whatsapp.\nThere seems to be a similar case in this link: http://forums.androidcentral.com/google-nexus-7-tablet-2012/245386-pictures-showing-up-twice.html ; however, there's no clear solution to it.\nMy phone model is XT1641 and the current OS is Nougat 7.0 (I got the update about two weeks ago). \nAny help would be appreciated", "time": "03-23-2017 12:38 PM", "replies": []}, {"postID": "post5723384", "text": "Welcome to Android Central! When you say that you can see the duplicates on Google Photos, do you mean that when you're looking at the main screen, you see two of the same photo? Or are you just seeing two different file locations? /storage/emulated/0 is essentially the same as /storage/sdcard0 (which is the phone's Internal Storage).", "time": "03-23-2017 10:51 PM", "replies": []}, {"postID": "post5724313", "text": "I can see the two of them, you can see it in my screenshot.\nI can open either file; however, any changes I make to one of them will take place in the other, same thing goes for the folders.\nI can see the duplicates in Google photos, Facebook, FB messenger, FB groups, WhatsApp, etc.\nApparently, FX file explorer only shows one path, the one referenced to as sdcard.\nThanks in advance.", "time": "03-24-2017 03:18 PM", "replies": []}, {"postID": "post5724536", "text": "Wow, that's weird. So even after you reinserted that adopted SD card, the problem persisted? Does it help if you wipe the cache? https://motorola-global-portal.custh...p/30,6720,9686\nWe've certainly seen a number of issues raised in these forums about Adoptable Storage (i.e., formatting an SD card as Internal Storage) on Moto devices, and this might be yet another one, so you may want to think twice before continuing to use it.", "time": "03-24-2017 07:11 PM", "replies": []}, {"postID": "post5728513", "text": "Thank you for your reply. I've come to find out that about the SD card recently. The weird part is that my phone worked perfectly fine before updating to nougat. Then it started acting slow and weird (no notifications), so I decided to do a factory reset and after that it seemed to be more or less ok.\nThen this happened and no one has a clue. I have to keep rebooting the phone on a regular basis because using it becomes unbearable and doing so seems to do the trick at least for a while. I've also noticed that sometimes after the reboot, some apps will be missing from the home screen and I have to drag them again to it; some other times the apps will remain untouched like they were before powering off the phone, the charge runs out at an increased rate after the update (even when no longer using Google now) and the charge rate is also slower, so it will take longer to reach a full charge.\nI'm really hating lenovo and this phone...", "time": "03-27-2017 11:09 PM", "replies": []}]}, {"title": "Google Maps' arrow pointing to the wrong direction", "thread": [{"postID": "post5719241", "text": "the arrow is always pointing 90° to the left or right from the direction I'm going.\nI know the device do not have a compass, but in my old phone (Lumia 830) it do have a compass, but it was very very erratic, so I always used the navigation mode, that uses only GPS to determine the direction you're going, just like Pokemon go does it for example.", "time": "03-20-2017 11:48 PM", "replies": []}]}, {"title": "Will indian version of Moto G5 Plus work in USA?", "thread": [{"postID": "post5713941", "text": "I want to buy new Moto G5 Plus XT 1686 (Indian Verison). It supports UMTS: 850, 900, 2100 MHz; 4G LTE (B1, B3, B5, B8, B40) frequency bands. I am planning to move to United States for a couple of years for my studies and wanted to know if this phone will work with major carrier brands in US like Verizon, At&t, Sprint, etc.? Will unlocking the phone help?", "time": "03-16-2017 08:49 AM", "replies": []}, {"postID": "post5714077", "text": "Verizon and Sprint, no. TMO & AT&T it might, but not everywhere and not necessarily well.", "time": "03-16-2017 10:54 AM", "replies": []}]}, {"title": "How can I fix my camera problem on my moto g4 plus?", "thread": [{"postID": "post5713185", "text": "I use moto g4 plus since 6 months. There are many scratches on my camera glass. Hence camera is not focusing well. The pictures taken by the rear camera are not coming well focused and detailed. Please give me a suggestion what I have to do?", "time": "03-15-2017 02:48 PM", "replies": [{"postID": "post5713308", "text": "Get the back glass replaced. The scratches would mess up the camera.", "time": "03-15-2017 04:43 PM", "replies": []}]}]}, {"title": "Carrier Services App , What is it ?", "thread": [{"postID": "post5710895", "text": "Today my Moto G4 Plus received an app update in Play Store - ' Carrier Services'\nPeople have given 5 stars in rating and weird reviews for the app.\nDoes anyone have any idea what this app is for ? And why the weird reviews ?\nThanks !", "time": "03-13-2017 01:13 PM", "replies": []}, {"postID": "post5711250", "text": "There are a number of articles about it, like this one: http://www.droid-life.com/2017/03/13...vices-android/. No one is quite sure yet, but it seems like it'll help support RCS (rich texting).\nWeird reviews for apps like that are kind of a tradition now. Android System Webview also has some goofy reviews as well.", "time": "03-13-2017 06:59 PM", "replies": [{"postID": "post5711292", "text": "Thanks for the reply.\nWent through the article in the link.\nI was really puzzled about the long and weird reviews in Play Store. 😀", "time": "03-13-2017 07:45 PM", "replies": []}]}, {"postID": "post5711297", "text": "I think the practice originated with silly exaggerated reviews on Amazon, like for this outlandishly expensive Denon cable: https://www.amazon.com/Denon-AKDL1-D...cUvbUpU5711297", "time": "03-13-2017 07:50 PM", "replies": [{"postID": "post5711499", "text": "😀", "time": "03-14-2017 01:03 AM", "replies": []}]}]}, {"title": "Phone vibration broke!", "thread": [{"postID": "post5685744", "text": "A little while ago, maybe mid January, or sometime this month, the vibration broke on my phone. I don't understand why it has broke. I have rarely dropped my phone, I always set it down. I only throw it to place it down when there is lots of soft areas around. My phone has been in a case since January, so it's been pretty safe. The vibration will only work on my phone if I bang the palm of my hand around my camera area. If I l remove my hand away from the area I banged my palm on or around, the vibration will stop till I bang it again. About a week ago, the vibration came back on by it's self, but after an hour, it went back to not working. My keyboard does not work either on vibration, nothing does. No vibration for notifications, not a thing. My headphone jack also seemed to have messed up a bit after that happened too. I am in desperation of help to get this fixed. This phone is 2 months old. I have a Moto G4 Play. I cannot return it from where I got it from, because I only had a 14 day return. PLEASE HELP ME! Thank you.", "time": "02-21-2017 08:41 AM", "replies": []}, {"postID": "post5685821", "text": "Sounds like the vibration motor might be stuck/broke... you should still have a warranty from Motorola, even if you can't return it to the store you bought it from. I don't think you want to take it apart and see what's wrong so go straight through Motorola.", "time": "02-21-2017 09:48 AM", "replies": []}]}, {"title": "does moto g4 plus supports usb joystick?", "thread": [{"postID": "post5439130", "text": "When I try to connect moto g4 plus through joystick its not detected but all the other components were detected like pendrive,mouse through otg.\ncan anyone plzz help me regarding this", "time": "09-22-2016 11:45 AM", "replies": []}, {"postID": "post5676903", "text": "The same with my phone (also a Moto G4+), surfing in the net i found that some joysticks are plug and play in android (such as Xbox joysticks) but somo are not... in my case is a play 2 generic joystick, but i found that the xbox, bluetooth, and some original playstation joysticks works perfectly fine in android. So, you need an original joystick or one that worcks with bluetooth.", "time": "02-13-2017 12:30 PM", "replies": []}]}, {"title": "Call ended issue in moto g4", "thread": [{"postID": "post5671218", "text": "I have received a MOTO G4 32gb (unlocked) single sim phone from USA. I succeeded in calling with IDEA sim but not with JIO sim. Then it was set to factory reset settings. Later the phone not able to make a call or receive with any sim. It always show as ‘CALL ENDED’ while trying to call or receive a call. I would like to know whether it is the problem of unlock or any OS problem. But internet is ok. I am able to do whatsapp audio or video call and messaging. How to resolve this. Please help me.", "time": "02-08-2017 05:03 AM", "replies": []}, {"postID": "post5671511", "text": "Welcome to Android Central! What's the model number (in Settings>About Phone​)?", "time": "02-08-2017 10:42 AM", "replies": []}]}]
[{"title": "how do I turn off those \"amber alert\" notifications?", "thread": [{"postID": "post5670620", "text": "how do I turn off those \"amber alert\" notifications?\nsorry - I'm sure that this is a very basic question, but I had never even seen an android device until a few days ago, much less tried to use one.\nthanks!\nw\nthanks!", "time": "02-07-2017 01:47 PM", "replies": []}, {"postID": "post5670628", "text": "Welcome to the forums! You can maybe search for this in your \"Settings\" or \"Advanced Settings\" app/section; but I am unsure if Amber Alerts is something you can turn off.", "time": "02-07-2017 01:53 PM", "replies": []}, {"postID": "post5670632", "text": "Try this. Open the settings, tap on the magnifying glass top right, type 'amber', select 'show amber alerts' and see what options can be unchecked in there.", "time": "02-07-2017 01:56 PM", "replies": []}, {"postID": "post5670648", "text": "I have a Moto device, and here's where to find those settings on mine.", "time": "02-07-2017 02:10 PM", "replies": []}]}, {"title": "text message app keeps sending out auto message - why?", "thread": [{"postID": "post5669462", "text": "every time someone sends me a text, my app automatically sends them a text message:\n\"[Auto-Reply] I'm driving right now - I'll get back to you later.\"\nI have no idea why it's doing that! How do I get it to stop?\nthanks for any feedback!\nw", "time": "02-06-2017 02:06 PM", "replies": []}, {"postID": "post5669501", "text": "What app are you using for SMS/MMS?\nMost of them have some sort of auto-reply capability. I'm sure that if you dig through the app's Settings you will find it.", "time": "02-06-2017 02:33 PM", "replies": []}, {"postID": "post5669514", "text": "this is just the basic text message app that came pre-installed on the device.\nI have found the overall settings for the device in general, but I'm so new to android (3 days or thereabouts) that I do not know how & where to find the settings for a specific app.\nthanks again!\nw\nPS: my phone is a MOTO Z FORCE / verizon - brand new!", "time": "02-06-2017 02:42 PM", "replies": [{"postID": "post5670014", "text": "Try the 3 dots on the right upper corner of the screen in your app .You will get the app settings from there .", "time": "02-07-2017 12:16 AM", "replies": []}]}, {"postID": "post5670234", "text": "ah! Yes! \nI found those three dots last night -\nthe auto reply function was ALREADY turned off. \nSo I still have no idea why those auto messages would have been sent. BUT I turned them on and then off again, just to tell the system that they were supposed to be off...\nwe'll see if anyone tells me that they've received one of those weirdo messages again!\nthanks!\nW\nPS: I wish that I could make that entire function / feature disappear - I have no use for it at all, since I don't drive.", "time": "02-07-2017 07:28 AM", "replies": []}]}, {"title": "Facebook app help.", "thread": [{"postID": "post5661166", "text": "Mum was browsing Facebook fine on her new Moto G4 but she cleared the data & cache by accident & now we can't seem to log in at all no matter what we do. We have tried lots of different methods but can't seem to get in. We tried Facebook to send a code to log in but the code never arrives. What else can we do?", "time": "01-29-2017 07:20 PM", "replies": []}, {"postID": "post5661233", "text": "What happens when she tries to log in -- does it give an error message, or does it ask for some kind of confirmation code? Does it give any other option to receive the confirmation code (like via a backup email, rather than text message)?", "time": "01-29-2017 09:34 PM", "replies": []}, {"postID": "post5661583", "text": "There is no error code & no other way to send the confirmation code to another email. The only email on her account is her Gmail. She has 3 Facebook accounts but only uses one (need to delete the other two) but when we ask Facebook to send the code it never arrives. Sucks she can't remember her password. We click on forgot password & there's a way to get to her account by finding a friend so she types her email or phone number in & comes up with the wrong account so we click not me then it asks for a friend so type my name in then it brings up all 3 of her accounts we click on the right one & it says Facebook will send you a code to this email address but it never arrives. We have checked all of gmails folders for this code too but nothing.", "time": "01-30-2017 07:15 AM", "replies": []}, {"postID": "post5661728", "text": "You've already gone through these steps, right? https://www.facebook.com/help/132243...ef=faq_content. Did she have to answer a security question?", "time": "01-30-2017 10:10 AM", "replies": []}, {"postID": "post5661817", "text": "I'm trying that tonight after work. Think that's the only thing I haven't tried.", "time": "01-30-2017 11:39 AM", "replies": []}, {"postID": "post5662280", "text": "No security question showed up. I've filled out the form & they emailed me saying what other info they needed so I gave that info to them but how long will it take to get a reply?", "time": "01-30-2017 05:58 PM", "replies": []}, {"postID": "post5662358", "text": "Sorry, I don't know. Hopefully soon!", "time": "01-30-2017 07:21 PM", "replies": []}, {"postID": "post5662659", "text": "Had a reply this morning & managed to get into her account via the Facebook app. The correct account too. Thanks for your help.", "time": "01-31-2017 05:22 AM", "replies": []}, {"postID": "post5662889", "text": "Great! Did they have to do some sort of voodoo magic, or was there a setting that we missed?", "time": "01-31-2017 09:49 AM", "replies": []}, {"postID": "post5663515", "text": "😄 voodoo magic love it. I dunno what Fecebook did but sent us a link to reset her password. Didn't miss any settings anywhere.", "time": "01-31-2017 06:07 PM", "replies": []}]}, {"title": "I have a Moto G (2nd generation) which stops seeing the microSD card.", "thread": [{"postID": "post5656853", "text": "It works when first formatted and lasts about a week - then the phone can't see the card.\nIt does not seem to matter what size card I use as an extension to the internal storage - the same thing happens. \nThe only way out is to get it to forget the card and lose all the data - and start again by reformatting.\nYou can't access the data on a PC either as it has been formatted only for the phone.\nAndroid 6 latest available from Motorolla Build number MPB24 65-334-3", "time": "01-25-2017 06:59 PM", "replies": []}, {"postID": "post5661476", "text": "I have the same problem, I have had to factory reset a few times, it has twice been sent for repair, 2nd time report said they replaced screws. I have heard about other people having problems with the card reader.\nI went through 2 sandisk cards that the phone continually threw out and I now changed the make of card and the problem is now [app] has stopped working which will flash up over the top off whatever else is open at the time.\nI have had to put fb and messenger back onto internal memory which is already full of the usual bloatware included with the phone (no offense to those that do use it but personally I have no requirement for the Korean keyboard) & then there are the apps that do not give the option of external storage. I am up for an upgrade in April and cannot wait. \nDon't get me wrong, I like my Motorola but it is let down by the SD card reader, I was refused a replacement as this one had not had enough repair attempts, I have found it easier to reset and it works for a while then repeat.", "time": "01-30-2017 03:44 AM", "replies": []}]}, {"title": "SD card for the G4", "thread": [{"postID": "post5644258", "text": "Mum wants the Moto G4 but what type of SD card will she need? Will any SD card do or will it only take certain ones?", "time": "01-15-2017 06:09 AM", "replies": [{"postID": "post5645283", "text": "Motorola support recommends UHS-1 type sd card -\n'Performance warning\nWe recommend use of a high speed card , such as a UHS-1 type. Class 4 and Class 2 micro SD cards are not recommended for adopted internal storage usage. The performance of these cards is typically 10x slower than internal storage performance.\nIf your card it too slow, your device will warn your during the adoption process. If you encounter this dialog, we advise to upgrade your card to a UHS-1 card first.'\nThis is the link from Motorola Support about the type of sd card for Moto G4 -https://motorola-global-portal.custh...p/30,6720,9687", "time": "01-16-2017 06:13 AM", "replies": [{"postID": "post5660703", "text": "Thank you for the information. This is the answer to the question I was thinking about for my new G4 Plus.", "time": "01-29-2017 10:15 AM", "replies": []}]}]}, {"postID": "post5644530", "text": "When you put the card in, the phone should prompt you to format the card to work in that device. You should use a brand new blank card. Hope this works - I'm doing the same thing. \nETA: if it's a lower capacity card, it might not alert you to format the card. But as you get to the larger sized cards, you will probably need to format. You can probably format the card just by tapping yes on dialog prompts.", "time": "01-15-2017 12:26 PM", "replies": [{"postID": "post5644695", "text": "I just put in a 64 gb card and no prompt came on. I was hoping to format it to internal storage. Any suggestions????", "time": "01-15-2017 03:14 PM", "replies": []}]}, {"postID": "post5644699", "text": "Haha, I'm not sure. I'm trying to copy files to the card with no success, because the card doesn't make its own directory, like 1 instead of 0. \nBut anyway, I didn't get any prompts to format the card I don't think. It was simple plug and play, only I can't seem to copy files to it.", "time": "01-15-2017 03:21 PM", "replies": [{"postID": "post5644768", "text": "Figured it out. Heres the path. Settings>Storage>Tap your card storage>Upper right corner 3 dots(menu)>Settings. That gets you to the options.", "time": "01-15-2017 05:13 PM", "replies": [{"postID": "post5645213", "text": "Thank you, mobrules. I will try this after my phone charges.", "time": "01-16-2017 03:04 AM", "replies": []}]}]}, {"postID": "post5645297", "text": "Think she's gonna use the SD card as portable storage like I'm doing on my Moto X Force. At least then you can take it out.", "time": "01-16-2017 07:05 AM", "replies": [{"postID": "post5645492", "text": "Yes, thanks.  The last thing I did was copy files to a directory with my SD card part number as the name, and it worked. But I'm still not confident about it. Thanks again.", "time": "01-16-2017 10:01 AM", "replies": []}]}, {"postID": "post5645499", "text": "I have a 200 gb card in a Z Force, used as portable. The phone is 32 gb. I have used up half of it. If I find it getting used up I'll switch the card to internal. \nThis G4 is only 16 gb, I put a 64 gb card in it. I made it internal and quite a few apps transferred over. I can't imagine using more than 80 gb ever. I don't take photos much.", "time": "01-16-2017 10:10 AM", "replies": []}, {"postID": "post5651644", "text": "I have a sandisk 32gb UHS-1 card in my Moto G3, used as adoptable storage. The phone complained it was too slow, but since I needed the extra storage, I accepted it. It's working ok. Sometimes things get slow though.", "time": "01-21-2017 12:36 PM", "replies": []}, {"postID": "post5653529", "text": "I have a 64 GB sdxc card in my g4+ with no noticeable slowing of my phone. I can easily imagine running out of storage because everytime I used to think I was all set with plenty of storage, I still ran out of it. \nI bought a 100 (close to 100, but a bit more - too cold to check at the moment) GB microSD too, but I was worried about the card drawing too much resources, so it's good to hear it works out well.", "time": "01-23-2017 05:34 AM", "replies": []}]}, {"title": "Toast pop up not showing.", "thread": [{"postID": "post5657445", "text": "Got the Moto G4 yesterday & today is the first time the phone is charging but we didn't get the toast pop up saying turbo power connected. Is that supposed to pop up on this phone or not? It seems to be charging but not sure if it's turbo charging.", "time": "01-26-2017 09:51 AM", "replies": [{"postID": "post5658043", "text": "It does pop up on my Moto G4 Plus.However it started doing so from the second charge onwards for me.Also after charging is complete another pop up appears to say turbo charged to 100 ℅.", "time": "01-26-2017 06:42 PM", "replies": []}]}, {"postID": "post5658089", "text": "In the end the phone took 4 hours to charge so it definitely wasn't turbo charging. Is there a way to definitely make it turbo charge?", "time": "01-26-2017 07:49 PM", "replies": []}, {"postID": "post5658094", "text": "Are you using the supplied charger and cable? Some cables aren't capable of turbo charging.", "time": "01-26-2017 07:54 PM", "replies": []}, {"postID": "post5658119", "text": "Yep. We're using the charger that came with it in the box. It's brand new too.", "time": "01-26-2017 08:14 PM", "replies": [{"postID": "post5658216", "text": "The first charging on my Moto G4 Plus also took a long time.I too had doubts about the turbo charging.But it was fine from the next charge onwards.So you could wait for the next time you put your phone to charge.", "time": "01-26-2017 10:13 PM", "replies": []}]}, {"postID": "post5658400", "text": "Ok thanks will see what happens next time we charge it. Hopefully it turbo charges.", "time": "01-27-2017 05:20 AM", "replies": []}, {"postID": "post5659065", "text": "It's on charge now, I put it on & nope it's not turbo charging no pop up showed. I don't think the charger that came with it is a turbo charger. Went on Motorola's website & looked at the Moto G4's & it says turbo charger sold separately so may need to buy on from there website.", "time": "01-27-2017 05:32 PM", "replies": [{"postID": "post5659127", "text": "Ok. Moto G4 Plus came with a turbo charger in the box.\nCan you check the specifications on the charger that was given in the box ?\nIt says ' turbo power supply ' on my charger. So if yours is a turbo charger it should be mentioned on the charger.", "time": "01-27-2017 06:43 PM", "replies": []}]}, {"postID": "post5659551", "text": "Looked at my charger for my moto x force & it says turbo power but looked at the Moto G4's charger & it doesn't say anything like that on there. Don't think it came with a turbo charger. Took a close up picture of the plug so you can see.", "time": "01-28-2017 07:42 AM", "replies": [{"postID": "post5659690", "text": "It seems that Motorola is not supplying a turbo charger with Moto G4.\nHere is a close up photo of the charger that came in the box of my Moto G4 Plus.", "time": "01-28-2017 10:15 AM", "replies": []}]}, {"postID": "post5659720", "text": "I can see turbo power supply on your charger. So I'm guessing the charger that came with the G4 isn't a turbo charger. Will need to get one now so it can charge fast. Thanks everyone for all the help, appreciate it.", "time": "01-28-2017 10:38 AM", "replies": []}]}, {"title": "Share function, er, malfunctioning :-(", "thread": [{"postID": "post5651444", "text": "This has been driving me nuts for a few weeks now. I get as far as choosing how I want to share a link (Outlook normally) and punching in the recipient, then when I tap the right arrow to send, the browser just closes and doesn't send. It's been fine up til very recently. Grrr.\nAny ideas..?", "time": "01-21-2017 09:16 AM", "replies": [{"postID": "post5656869", "text": "Hi! Have you tried uninstalling and reinstalling the apps you use which are closing?", "time": "01-25-2017 07:15 PM", "replies": []}]}, {"postID": "post5657150", "text": "I haven't no. Will try that for sure :-)", "time": "01-26-2017 03:25 AM", "replies": []}, {"postID": "post5657674", "text": "Doh! It's an Android phone so I can't reinstall Chrome or You Tube cos they're Google products, just realised. I did reinstall Firefox tho but it's not made any difference.", "time": "01-26-2017 01:12 PM", "replies": []}, {"postID": "post5657680", "text": "Reinstalling Outlook now......", "time": "01-26-2017 01:14 PM", "replies": []}, {"postID": "post5657937", "text": "Yep, that's fixed it. Simples! Thanks so much.", "time": "01-26-2017 05:00 PM", "replies": []}]}, {"title": "Moto G4 Plus or Moto X Play? Gyro vs Compass?", "thread": [{"postID": "post5635190", "text": "Which is more useful in an everyday use? compass or gyro?", "time": "01-07-2017 08:35 PM", "replies": []}, {"postID": "post5635292", "text": "Duplicate, see response here: http://forums.androidcentral.com/gen...ml#post5635192. Thread closed to prevent parallel discussions.", "time": "01-07-2017 10:19 PM", "replies": []}]}, {"title": "G4 question", "thread": [{"postID": "post5634177", "text": "On the 16GB version of the Moto g4 how much memory do you actually get when you first boot up the phone & after the android 7.0 update?", "time": "01-06-2017 06:11 PM", "replies": []}, {"postID": "post5634211", "text": "I don't have my device at the moment. However, I don't believe it will be much different that what it had Marshmallow.", "time": "01-06-2017 06:44 PM", "replies": []}, {"postID": "post5634268", "text": "Do you no how much it had with Marshmallow? Don't have the phone at the moment but my mum is thinking if getting it.", "time": "01-06-2017 08:16 PM", "replies": []}, {"postID": "post5634271", "text": "Just got a G4 Play, and there was something like 10-11 GB free in Marshmallow 6.0.1 before I started loading it up with things.", "time": "01-06-2017 08:19 PM", "replies": []}, {"postID": "post5634539", "text": "If after android 7.0 there's the same memory then my mum should be fine. She downloads a few apps but seems to struggle with a phone advertising 8GB's. She seems to fill them up or ends up with very little memory left.", "time": "01-07-2017 05:53 AM", "replies": []}]}, {"title": "No security updates for G4 Play unlocked?", "thread": [{"postID": "post5626865", "text": "Our G4 play is still on the July security update and says up to date, yet my Z play has already had both August and December updates. \nAre Lenovo neglecting the G4 play?", "time": "12-31-2016 05:33 AM", "replies": []}, {"postID": "post5626894", "text": "Seems so.", "time": "12-31-2016 06:48 AM", "replies": []}, {"postID": "post5627150", "text": "If it's factory unlocked, there's no carrier updating it. The same thing happens is it was carrier-locked but you unlocked it and changed carriers. Only the original carrier will send out updates.", "time": "12-31-2016 12:34 PM", "replies": [{"postID": "post5627162", "text": "That's utter nonsense. Unlocked devices bought as unlocked get the update direct from Motorola. \nMy Z has had August and December updates and is also unlocked. \nJust the play which isn't getting updates.", "time": "12-31-2016 12:38 PM", "replies": []}]}, {"postID": "post5634272", "text": "Verizon sent down the October update on the XT1609, it's in-house prepaid Play variant. I just got mine today, and it was downloaded tonight. Do the unlocked XT1607s not have the October update yet?", "time": "01-06-2017 08:22 PM", "replies": [{"postID": "post5634479", "text": "Our play doesn't", "time": "01-07-2017 03:19 AM", "replies": []}]}]}, {"title": "Major headache with new sdcard and apps2sd", "thread": [{"postID": "post5627138", "text": "I have a new 32gb card installed in my rooted Moto G 4LTE. I've tried using minitool partition manager, links2sd partition manager, and apps2sd partition manager to try and create 2 partitions on the card. First partition using just over half the space is fat32 (portable storage) and the second half I have tried as ext3 and ext4 with the same results each time. The phone recognizes the first partition and mounts it just fine but it ALWAYS thinks the second partition is \"corrupted\" even though it is just fine.\nApps2sd is currently successfully using the second partition to link apps to. It sees the partition just fine. The Minitool program also sees it just fine but my phone system insists it's corrupted but I cannot \"fix\" it because if I do, it wipes the entire card and insists on making it EITHER portable (fat32) OR internal (ext3). In other words, it thinks the second partition is corrupt and wants to fix it by wiping it out and forcing a single partition on me.\nHow do I get this annoying false error to disappear? Every reboot of the phone leads to a message about the partition being corrupted and needing fixing.", "time": "12-31-2016 12:26 PM", "replies": []}, {"postID": "post5627141", "text": "First, stop trying to install apps to the SD card. Android is not designed for that. (Even in Marshmallow, it's a band-aid.) The SD card is made for file storage - songs, videos, documents, etc. Format the card as FAT32, store files on it and it should work.", "time": "12-31-2016 12:30 PM", "replies": []}, {"postID": "post5627176", "text": "It used to work fine. It certainly works fine on my rooted nook (Samsung Galaxy Tab 4). I HAVE to install apps to the sdcard because even with a fairly sparse install of apps I run out of system memory. I don't care if a developer doesn't want me to put it on my sdcard on my phone, I own the device and the apps will go where I need them to go so I can best use my device. \nI'd be willing to dig into the system files and edit something if it will eliminate the FALSE system interpretation that it is corrupted. In any case, your argument isn't really valid. I can setup the new card as EITHER portable or as \"internal\". The entire purpose of the internal storage setting is to allow memory hog apps and data to be saved onto the sdcard as if it is internal memory. The ONLY reason that some apps don't allow you to move them there at the start is the developer doesn't want you to. Not a valid reason. \nI can install the nook reader app, for instance, and it will allow me to install all my books onto the sdcard. The Kindle app, on the other hand, will not allow you to store YOUR books on YOUR sdcard because they fear piracy. There's nothing organic about the Kindle app that makes it impossible to store the books to the sdcard, just a stupid developer attempt to limit your use of your own books. Music apps and music are similar. If I go with the basic system and install just the bare bones of what I actually USE on my phone, then try to install a couple music apps with the music to go with it (in my case, not a huge number of songs, just those I like to listen to at the gym) I very quickly run out of system memory. So, I install apps2sd and move all of it to my sdcard so there's plenty of room for the base apps AND for my music. It is a must.\nThe most recent android itself has moved towards allowing integration of external memory into \"internal\" memory for this very reason: the problem of user memory running out very quickly for so many people. The fact that some (many) apps don't allow you to simply select to install to the card is purely a developer choice, not a system requirement for function. \nHere's the biggest deal. My phone has 4GB of internal storage. The Android OS is using 3.47GB of that. See the problem? The OS itself is hogging 87% of my system memory before I add anything to the phone! \nBut thanks for the reply anyway. I'll stick with using MY device and MY apps as I want, and NEED, to use them.", "time": "12-31-2016 12:52 PM", "replies": []}, {"postID": "post5627220", "text": "Which Moto G is this?", "time": "12-31-2016 01:47 PM", "replies": []}, {"postID": "post5627812", "text": "Moto G 3rd Gen. I just re-set it to factory and re-rooted it. This time I used TWRP to partition/setup the sd card. First partition fat32, second is ext3. The fat32 portion is immediately accepted by the system but the ext3 part is simply seen as \"new sdcard\" and a request to set it up (which means wiping it and repartitioning it back to one big partition that is either portable storage or internal storage. \nI need the portable fat32 part so I can easily transfer files back and forth via USB on my PC. I also need internal storage (ext3) so I can use it to extend the internal system memory. I suppose I could just give up and set it as 100% internal memory so apps2sd can do its thing and put what I want there but then I lose the ability to transfer files to/from my PC (unless I do it from linux(?). My nook (Galaxy Tab 4) accepts this partitioning scheme without hiccup but my moto g just wont deal with it. But it should.", "time": "01-01-2017 08:49 AM", "replies": []}]}, {"title": "Disable bloat including Amazon lock screen ads without root or flashing", "thread": [{"postID": "post5266381", "text": "I posted yesterday how to remove Amazon apps by flashing the stock file, however, if you are weary of flashing but want to disable some Amazon additions, or really any package, then you can just use the debloater tool here :http://forum.xda-developers.com/andr...bloat-t2998294\nFor those that need a little more detail :\n-Go to settings - about phone and tap on the build number 7 times to enable developer options. \n-Go to developer options and enable usb debugging. \n-go to the command prompt and type \"adb devices\" and make sure that you see your device\n-use the debloater tool linked to above. If you don't know how to setup adb, then you can refer to this guide :\nInstalling the Android SDK for Windows, Mac and Linux: A tutorial http://www.androidcentral.com/instal...linux-tutorial\nFor now I just disabled the Amazon apps that I don't use, and this also removed the Amazon lock screen ads. \nAs a friendly reminder, be mindful what you disable as it can really mess up your system and require a factory data reset to fix.", "time": "07-15-2016 07:48 AM", "replies": []}, {"postID": "post5266420", "text": "Nice Dpham!", "time": "07-15-2016 08:15 AM", "replies": []}, {"postID": "post5310355", "text": "after trial and error, it is com.amazon.phoenix.apk", "time": "08-08-2016 10:22 PM", "replies": []}, {"postID": "post5310873", "text": "Great information to anyone who has the amazon device!", "time": "08-09-2016 07:49 AM", "replies": []}, {"postID": "post5325038", "text": "Will this remove OTA updates?", "time": "08-14-2016 09:52 AM", "replies": [{"postID": "post5325061", "text": "You can still get OTA if you do this method.", "time": "08-14-2016 10:00 AM", "replies": [{"postID": "post5325223", "text": "This is great. And sorry to insist but I'm planning to give away mine and I want to be 100% sure that this won't affect OTA or any other thing. And thanks of course!", "time": "08-14-2016 10:57 AM", "replies": []}]}]}, {"postID": "post5610365", "text": "I tried following all the directions, but I'm stuck. The tool won't recognize my device (just shows red lights and buttons greyed out). My PC does, however, recognize my device in My Computer, and I downloaded the Motorola device manager. \nBy the way, even though I installed SDK tools per your suggestion, the command \"adb devices\" is not recognized in command prompt...\nAppreciate any help!\n(note: my goal is to turn the lock screen off -- I care less about the ads and more about having to swipe each time. I didn't have a lock screen on my old phone)", "time": "12-16-2016 02:00 PM", "replies": []}, {"postID": "post5623934", "text": "On The latest Motorola G4 (4th gen) It would not hide the com.amazon.phoenix.apk package. Is there a way to make it work on this Phone.", "time": "12-28-2016 02:47 PM", "replies": []}]}, {"title": "Trying to get started with Moto G4 and USB connection", "thread": [{"postID": "post5620506", "text": "I'm now trying to get started with a new Moto G4 \"Play\" and USB connection to my Windows 7 computer. I have downloaded and installed a Motorola Device Manager 2.5.4.exe. Plugging in the USB connection to the phone does not result in any listing on Windows Explorer. \"MotoHelper Agent\" is listed as \"show icon and notifications\" but there is a bubble that says \"This notification icon is not currently active.\" There is nothing about a USB connection under \"Storage & USB\" on the phone's screen. \nThe connection is needed to upload ringtones, wallpapers, etc. and to download photos. Help is needed because I can not find instructions on this. Thanks.", "time": "12-25-2016 12:55 PM", "replies": []}, {"postID": "post5620742", "text": "Go to Motorola - Mac & Windows Drivers, download the proper driver and install it on the PC.\nThen pull down the Notification bar on the phone and choose MTP.", "time": "12-25-2016 05:42 PM", "replies": []}, {"postID": "post5621062", "text": "> Go to Motorola - Mac & Windows Drivers, download the proper driver and install it on the PC.\nDone. \"Motorola Device Manager\" is listed on the Windows 7 Start menu. Selecting it results in the message \"Checking for new device software\" then \"There are no updates for your Device at this time. Current version N/A\"\n> Then pull down the Notification bar on the phone and choose MTP. \nThere is no \"MTP\" there.", "time": "12-26-2016 01:18 AM", "replies": []}, {"postID": "post5622352", "text": "Apparently the cable I started with is for charging only (these cables are not marked as to which is 'charging only' and which handle data.) I found another cable that results in a response from the Windows 7 PC (Its packaging, not the cable itself, says \"Charge devices and Sync data simultaneously.\") Now the Computer folder shows \"Mobile Devices.\" Selecting it shows it's empty. Selecting \"Motorola Device Manager\" in the start menu results in a message about checking for new device software, then \"There are no updates.\" It does say the current version is 24.171.1.harpia.retail.en.US\" instead of the \"N/A\" shown before. I'm still not seeing anything different on the Notification bar on the phone, such as \"MTP.\"\nWhat can I do from here to upload ringtone files from the computer to the phone, as well as other common files for graphics, etc. ?", "time": "12-27-2016 08:14 AM", "replies": [{"postID": "post5623417", "text": "On your Moto G4 Play pull down the Notification bar. You will see \"USB for charging Touch for more options\". Tap to choose more options and select the second one - \"Transfer files (MTP)\". More detailed guide you can find here.", "time": "12-28-2016 07:43 AM", "replies": []}]}]}, {"title": "Cell standby eating battery", "thread": [{"postID": "post5606371", "text": "Does anyone know why the Cell standby is eating the regular Moto G4's battery?", "time": "12-13-2016 10:07 PM", "replies": []}, {"postID": "post5606486", "text": "My G2 was doing that, I had to do a factory reset", "time": "12-14-2016 01:02 AM", "replies": []}, {"postID": "post5606573", "text": "I rather deal with this than a factory reset.", "time": "12-14-2016 04:11 AM", "replies": []}, {"postID": "post5606671", "text": "If you are backed up then it's not as bad as you think, if you have a Google account it automatically backs up", "time": "12-14-2016 07:08 AM", "replies": []}, {"postID": "post5619917", "text": "I had similar issues, my battery usage looked similar to that but my screen was at 5% and other little background OS stuff at 2% and it led to a 30% drop. See here http://forums.androidcentral.com/mot...ver-night.html", "time": "12-24-2016 04:32 PM", "replies": []}, {"postID": "post5620744", "text": "8% of 44% (which is 3.51%) over more than 12 hours? Tap the graph to get to the next page, just to see the mobile signal strength, but it's probably good. Some people would kill for 12 hours of just the phone staying on.", "time": "12-25-2016 05:44 PM", "replies": []}, {"postID": "post5622915", "text": "Go into application manager and delete all data for Google Play Services. You'll have to watch it and repeat periodically.", "time": "12-27-2016 05:46 PM", "replies": []}]}, {"title": "Moto G4 & Ford Sync", "thread": [{"postID": "post5521267", "text": "Hi all,\nAccording to the Ford Sync website, the Moto X and other Motorola phones are supported but not the Moto G. \nIs that really true? If so, what is it that makes them incompatible? Something hardware-related or software-related?\nI have Verizon as my carrier if that makes a difference.\nThank you.", "time": "10-24-2016 11:19 PM", "replies": []}, {"postID": "post5523186", "text": "Unless there's been a firmware change in the Sync software my parent's Ford has, my Moto G4 works great with it.", "time": "10-25-2016 03:29 PM", "replies": []}, {"postID": "post5607907", "text": "in fact, my g4 plus would connect over my wife's iphone 6s, even though her phone was set as primary, and further away.", "time": "12-14-2016 08:04 PM", "replies": []}]}, {"title": "Which Motorola phone on a budget? Less than 300.00", "thread": [{"postID": "post5317593", "text": "Moto G Plus (4th Gen.) Unlocked - Black - 64GB, 4GB RAM from Amazon at $289.00 or Moto X Pure Edition, 32GB Black, 3GB RAM at $299.00Any help would be appreciated.", "time": "08-11-2016 05:57 PM", "replies": [{"postID": "post5412018", "text": "If you need NFC, then Moto X.", "time": "09-11-2016 08:34 PM", "replies": []}]}, {"postID": "post5317657", "text": "It depends on what you want.\nBoth are good.\nThe X-Pure has a better processor but the 4 has a fingerprint sensor.Motorola Moto G4 Plus vs Motorola Moto X Pure Edition (2015) - Phone specs comparison", "time": "08-11-2016 06:24 PM", "replies": []}, {"postID": "post5318102", "text": "the fingerprint reader is worth upgrading to from any phone that doesn't have a good one, and the g4's is great", "time": "08-11-2016 10:01 PM", "replies": []}, {"postID": "post5321305", "text": "Thanks, grabbed the G4 plus and love it.", "time": "08-13-2016 04:19 AM", "replies": [{"postID": "post5347172", "text": "welcome to the club 🎉", "time": "08-19-2016 08:00 PM", "replies": []}]}, {"postID": "post5411874", "text": "Think that the G4 is the better buy. More RAM and octacore processor over hexacore with the MXPE. Fingerprint reader is a plus. The only thing it doesn't have that I would want is NFC.", "time": "09-11-2016 07:29 PM", "replies": [{"postID": "post5423171", "text": "Octacore but inferior processor. Plus the G4 and G4 plus have over heating issues which basically affects the camera, try using it under sun light and you'll know. Plus the fingerprint is only good for unlocking, no Android pay because of no NFC. Plus the camera quality is better on the Moto X. This is from personal experience since I owned both for a brief period.", "time": "09-16-2016 08:33 AM", "replies": []}]}, {"postID": "post5474942", "text": "I'm facing a similar decision today. G4 (not plus) vs. MPXE. About a $60 difference in price. Considerations for me are camera and battery life. . This will be a temporary device while I replace my Note 7. Considering a Oneplus 3 or Moto Z Play for the replacement when they become available for GSM carriers. No more $900 phones for me.", "time": "10-08-2016 11:20 AM", "replies": [{"postID": "post5476650", "text": "The Pure has NFC. So if you want to do mobile payments you may want to pick that one up instead.", "time": "10-09-2016 07:22 AM", "replies": []}, {"postID": "post5487852", "text": "You can either buy a G4 Play / non-Play or the Honor 5X if you don't want to spend much. Both of them do not have NFC so Android Pay is not supported.", "time": "10-12-2016 06:13 PM", "replies": []}]}, {"postID": "post5606400", "text": "NFC is nice but not a necessity... At least for me. Fingerprint scan to unlock is more attractive.", "time": "12-13-2016 10:43 PM", "replies": []}]}, {"title": "Can I Use the G4 Play on an existing Verizon account?", "thread": [{"postID": "post5500898", "text": "I went in to a Verizon store today and the rep (who actually seemed to know what he was doing) said that this was a prepaid phone, meaning I had to have a prepaid account for it to work. In other words, he said that this can't be activated on my current Verizon plan.\nDoes this sound correct? I can't just take the SIM card out of my Turbo 2 and shove in the G4 Play to use as my daily driver? Then just swap it back and forth between the 2 phones as desired?", "time": "10-17-2016 08:17 PM", "replies": []}, {"postID": "post5523197", "text": "If the G4 Play is indeed a prepaid phone, then yes, what he said is correct for Verizon. I think there is something they can do on their end after you've used it as a prepaid phone for many months to convert it to a postpaid plan however, without this, you will most likely hose your sim and have to go through a long and painful process to get a new one working again (past experience from earlier this year). I tried doing this with one of the cheap prepaid Verizon phones.", "time": "10-25-2016 03:32 PM", "replies": []}, {"postID": "post5529400", "text": "I purchased a G4 Play from Motorola directly, removed my sim from my current verizon phone, inserted into the G4 Play and it was working without any further actions. Brilliant & cheap phone.\nNot that it should matter...I'm on a Family share UDP plan.", "time": "10-27-2016 09:51 PM", "replies": [{"postID": "post5541195", "text": "I think that would be the Moto G4 Play unlocked as opposed to the really cheap prepaid version ($65 at Best Buy this week) that will most likely mess your sim up.", "time": "11-02-2016 10:25 AM", "replies": []}]}, {"postID": "post5591741", "text": "There are two Moto G Plays that will work on Verizon, the Verizon Prepaid and the Unlocked (not just GSM).\nThe unlocked one will work with no issues. \nThe Verizon Prepaid will need to be used on a prepaid line before it can be used on a postpaid line. https://forums.androidcentral.com/sh...d.php?t=638505", "time": "12-03-2016 06:12 PM", "replies": []}]}, {"title": "Moto g4 plus wont lock when left idle.", "thread": [{"postID": "post5571325", "text": "Hello. I am facing this problem with my moto g4 plus phone\nSometimes my phone won't lock automatically if left idle.\nI have adjusted it to 30 secs. It should sleep and lock accordingly. But it does not and the screen remains idle and on.\nI tried restarting my phone, the problem goes away but after some time I experience the same problem. Please help. Thank-you for listening.", "time": "11-20-2016 02:38 AM", "replies": []}, {"postID": "post5571435", "text": "http://forums.androidcentral.com/sho...d.php?t=525640", "time": "11-20-2016 06:24 AM", "replies": []}, {"postID": "post5585417", "text": "Have you set up the location under smart lock, or are connected to a Bluetooth device enabled under smart lock?", "time": "11-29-2016 03:20 PM", "replies": []}]}, {"title": "G4+ mic not working after oil bath", "thread": [{"postID": "post5578274", "text": "I have a Motorola G4+ that recently took a bath in motor oil. Long story short, it was in my pocket, oil change gone wrong, and it wound up soaked as well as my pants. \nI had a case on it, which protected it mostly, but there was obviously some oil in my speaker and microphone. Turned it off, have liberally sprayed the mic and speaker with electronics cleaner many times. \nAll is well, except the microphone does not appear to work during a phone call. \nWhat puzzles me, it picks up fine if I record video. I have a messenger app called WhatsApp, and if I record a voice message (and yell) it can be heard ever so faintly. Phone calls, text to speech text messaging, voice searches via Google, none seem to work. \nCan anyone shed any advice on this? Has anyone opened one up? I've dissected and repaired a couple Samsung phones and an LG G4, so I'm not terrified of opening it up if I can get the correct screwdrivers and the mic can be replaced or cleaned better. \nBut since video picks up fine, I'm now not sure that that is the issue. Are there multiple mics? Are there different sensitivity settings for different functions?", "time": "11-24-2016 10:05 AM", "replies": []}, {"postID": "post5578673", "text": "If there is an app that can work around it, since obviously the microphone(s) do work, I'm all ears. That would suffice. I use my voice to text often, but rarely hold phone conversations.", "time": "11-24-2016 03:40 PM", "replies": []}, {"postID": "post5581466", "text": "I'm beginning to wonder if my problem is due to the headphone jack.", "time": "11-26-2016 08:17 PM", "replies": []}, {"postID": "post5581892", "text": "Recap:\nWhatsapp messages can no longer be heard faintly. Now they just sound as static. \nOn a call, my audience hears nothing, but I hear an echo of what i say in my own ear. Voice search, text to speech does not work. Both mics appear to work when recording video. I sprayed the mic out liberally with electrical contact cleaner, but since it appears to pick up under certain situations, I'm inclined to believe it isn't clogged or muted with oil any longer. Which is also partly why I am reverting to wondering if it's a headphone jack malfunction.\nI've read of phones acting wonky when headphones are plugged in during a call.", "time": "11-27-2016 07:56 AM", "replies": []}]}, {"title": "Black screen after reboot.", "thread": [{"postID": "post5579592", "text": "Hello. My brother bought a Moto G4 at Best Buy last week. Everything was working just fine for him. Yesterday after we ate our Turkey dinner her took the phone out of his pocket and the screen was black. He rebooted the phone and the Moto boot screen appears like usual and then the screen goes black and nothing. I booted to recovery mode and cleared the cache and even did a factory reset and it didnt make a difference. Weird thing is screen displays fine when it boots, in recovery mode and the charging logo comes up when plugged in. It just won't display anything after it boots. Any suggestions? Our local Best Buy is out of stock and if we return it he won't have a phone. I'd rather fix it. Thanks.", "time": "11-25-2016 10:02 AM", "replies": []}, {"postID": "post5580494", "text": "Are you able to boot into Safe Mode? https://motorola-global-portal.custh...p/30,6720,9686", "time": "11-25-2016 11:57 PM", "replies": []}, {"postID": "post5580767", "text": "Nope  ended up taking it back.", "time": "11-26-2016 08:20 AM", "replies": []}]}, {"title": "Android Nougat for the Moto G4", "thread": [{"postID": "post5450637", "text": "http://www.droid-life.com/2016/09/27...lease-date-q4/", "time": "09-27-2016 05:09 PM", "replies": []}, {"postID": "post5452955", "text": "my g4 plus is getting an upgrade right now - no idea what it is, but should be ready in a few.", "time": "09-28-2016 06:20 PM", "replies": []}, {"postID": "post5453050", "text": "version MPJ24.139-64", "time": "09-28-2016 07:41 PM", "replies": [{"postID": "post5536925", "text": "yup. Currently 6.01 with security date of July 1,2016", "time": "10-31-2016 12:29 PM", "replies": []}]}, {"postID": "post5489073", "text": "Looking on the site (Android 7.0 Nougat update: when your phone will get it) it says October?? Whether that would be a US push or internationally?", "time": "10-13-2016 07:15 AM", "replies": []}, {"postID": "post5541434", "text": "Mine seems to be stuck at MPJ24.139-49 with the May security updates \nSystem update says I'm up to date.", "time": "11-02-2016 12:30 PM", "replies": []}]}, {"title": "Screen shot?", "thread": [{"postID": "post5304508", "text": "Does anyone know how to take a screen shot? Everywhere I've looked says to hold the volume down and power button at the same time it all it does for me is mute the phone.", "time": "08-06-2016 01:20 AM", "replies": [{"postID": "post5304956", "text": "Yeah, those are the right instructions, but it's all about timing. I find easier using both index fingers to hold the buttons with both thumbs making pressure on the left edge.", "time": "08-06-2016 09:45 AM", "replies": []}]}, {"postID": "post5304598", "text": "Hold for 3 seconds.\nPosted via the Android Central App", "time": "08-06-2016 02:52 AM", "replies": []}, {"postID": "post5304948", "text": "Everything I've ever seen was hold power button and press home button before the popup comes up... but maybe not. I don't have a Moto.", "time": "08-06-2016 09:41 AM", "replies": []}, {"postID": "post5304962", "text": "Ok. I'll give it a shot again. Thanks everyone.", "time": "08-06-2016 09:49 AM", "replies": []}, {"postID": "post5310466", "text": "Nope. Not working for me. I even watched a YouTube video on it. But still can't get it to work on my phone.", "time": "08-08-2016 11:38 PM", "replies": []}, {"postID": "post5347222", "text": "it's tricky. seems trickier than on my g³. I've gotten better at it. I basically use the method Javier P mentions, though I use the pointers and middle for the pressure support and thumbs to hit the buttons. If the volume popup shows I know right away I'll have to try again.", "time": "08-19-2016 08:14 PM", "replies": []}, {"postID": "post5354704", "text": "This, and be patient and hold the buttons for three seconds...", "time": "08-22-2016 08:02 AM", "replies": []}, {"postID": "post5534813", "text": "You have to press down volume + power at exactly the same time and hold for approx 3 seconds. \nOnce mastered its a useful tool which works on all Android devices", "time": "10-30-2016 03:02 PM", "replies": []}, {"postID": "post5538726", "text": "Use google on tap and then press the share button.", "time": "11-01-2016 09:17 AM", "replies": []}]}, {"title": "Does Facebook rotate on your G4?", "thread": [{"postID": "post5534831", "text": "Wife has a G4 Play and Facebook doesn't seem to rotate when holding in landscape. \nMy Z play rotates just fine so assuming it's a limitation of the G4/G4 play \nCan anyone confirm if they can run Facebook in landscape and which G4 version you have \nThanks", "time": "10-30-2016 03:09 PM", "replies": []}, {"postID": "post5535585", "text": "Do all other apps rotate to landscape as expected, like YouTube?", "time": "10-30-2016 10:24 PM", "replies": []}, {"postID": "post5536257", "text": "Yup, it's just Facebook. Everything else rotates as it should.", "time": "10-31-2016 08:18 AM", "replies": []}, {"postID": "post5536647", "text": "If no one else with a G4 responds, try going to Settings>Apps, select Facebook, and Clear Cache/Clear Data.", "time": "10-31-2016 10:36 AM", "replies": []}]}, {"title": "Why is Moto G4 voicemail playback volume so low?", "thread": [{"postID": "post5498267", "text": "Talking on phone is fine --- making and receiving calls. Problem is when someone (missed call) leaves a voicemail. The playback of the recorded message is VERY LOW ..to the point where it is barely audible.\nThis problem happens with ALL voicemail recordings...ALL the time.....cell and wifi.... Is there some fix ?", "time": "10-16-2016 08:11 PM", "replies": []}, {"postID": "post5501556", "text": "Welcome to Android Central! It might be a carrier issue -- have you spoken to them?", "time": "10-18-2016 04:20 AM", "replies": []}, {"postID": "post5509170", "text": "I noticed the same thing! I'm with T-Mobile and never had any problem with old phones so I don't think that's it... The speakers seem to be under par.. Is there a fix for that??", "time": "10-20-2016 03:21 PM", "replies": []}]}, {"title": "Moto G4 Charging Solution?", "thread": [{"postID": "post5488756", "text": "I have recently joined the Android family  and have a Moto G4. However I only got the Micro USB cable with it. Can I use either the flat plug Apple charger or even the larger 10w IPad charger to charge my Moto or would you not recommend it?", "time": "10-13-2016 03:34 AM", "replies": [{"postID": "post5489445", "text": "You can only charge the Moto G4 with the microusb cable. If you are referring to the actual brick that plugs into the wall, then I would only suggest using the included charge pack as it provides the Quick (Turbo) charge. If you use anything else it won’t allow Turbo charge to work and you could have issues.", "time": "10-13-2016 09:33 AM", "replies": [{"postID": "post5489917", "text": "In the UK you don't get the fast charger with the G4, only the G4+.\nI'm using a Samsung S6 fast charger, it works fine.", "time": "10-13-2016 12:05 PM", "replies": []}]}]}, {"postID": "post5489896", "text": "No Apple chargers will work - wrong connectors. Any Micro USB charger will likely work but to get the fastest charging use one with Quick Charge 2.0 capability.", "time": "10-13-2016 11:57 AM", "replies": []}]}, {"title": "Disable Moto Gestures, camera and flashlight on G4 plus", "thread": [{"postID": "post5467425", "text": "Is there anyway to disable these gestures, thanks", "time": "10-05-2016 03:50 PM", "replies": []}, {"postID": "post5467432", "text": "Try this. Open the Moto app from the app drawer, tap on the three stars top right, select 'Actions' and disable what you want.", "time": "10-05-2016 03:52 PM", "replies": []}, {"postID": "post5467485", "text": "thanks for your help!", "time": "10-05-2016 04:05 PM", "replies": [{"postID": "post5467508", "text": "Glad it helped. See you around the forums.", "time": "10-05-2016 04:12 PM", "replies": []}]}]}, {"title": "hey experts,something named As SettingExtRet has become my default launcher how to change it.", "thread": [{"postID": "post5429005", "text": "okay this situation goes like this, i was downloading videos from tube mate in my internal memory, as soon as internal memory goes full. Android default notification came up saying storage is not enough type thing. I just ignored it because generally when internal memory is full tubemate will stop the downloading. But as soon as the memory gets full my phone slow down, i get it is due to low internal memory, but My went off and started with some thing missing the android stack and home screen button are of no use now, my drag down notification bar is blank and not dragging down things. I came to find out that in Setting->Home-> SeetingsExtRet is selected as launcher, when i tried to change it is changes in just option, my default launcher is Go launcher which is currently running fine, but in settings it is showing some SettingsExtRet is set a default. only my back key is working due to i have close all the way back to exit from an application or to go to another app as android stack is not working. Please anyone know what is this SettingsExtRet and how to remove it. Thanks In advance.", "time": "09-19-2016 06:45 AM", "replies": []}, {"postID": "post5429197", "text": "Welcome to the forums. Have you tried uninstalling Go launcher to see if that allows a different selection?", "time": "09-19-2016 09:04 AM", "replies": []}, {"postID": "post5445320", "text": "yeah I tried Unistalling many also other than Go launcher. This thing has created some dummy account in my phone and even restricted me to reset my phone.", "time": "09-25-2016 12:35 AM", "replies": []}, {"postID": "post5447588", "text": "Sounds like you picked up some sort of virus. Your only solution may be a factory reset from the recovery menu.", "time": "09-26-2016 09:55 AM", "replies": []}]}, {"title": "Moto Maker UK", "thread": [{"postID": "post5435343", "text": "Hi two years ago I gave up on Moto Maker and used Amazon to buy my (now dying) 2014 X.\nI am replacing it with a 64 gig G4 Plus but thing's are not going too well.\nOrdered Saturday, pick my address from a drop down list and ordered.\nreceive email with first two lines of my address missing.\nThe only contact is third party chat who told me their systems can't change or update anything?\nI received a shipped with a tracking number that takes me to phone being built status? Has been like that since Monday.\nEmail says it will be delivered on Sunday, which I kind of doubt.\nWhat a state! anyone know which carrier they use?\nThey don't even know my address.\nI tried number on Post Office. Fed Ex and Yodel all unknown", "time": "09-21-2016 05:28 AM", "replies": []}, {"postID": "post5443564", "text": "Everything is exactly the same, nothing's changed. Still don't have my address. Website states being built, email saying shipped sent to me six days ago!\nClaimed money back from credit card.\nBe very wary buying from Moto Maker UK, everything seems to be beta and when it goes wrong you can only speak to third party chat company who cannot actually do anything.", "time": "09-24-2016 04:20 AM", "replies": []}]}, {"title": "Powering Off Vibration", "thread": [{"postID": "post5441207", "text": "Does anyone know the thinking behind the pointless vibration that occurs at the end of the power off cycle? Even better if there's a way to turn it completely off. Another stupid featureis the blast of bright life when I turn it on.\nI have a Motorola G (3rd Generation) Android version 5.1.1 but I've noticed the vibration with at least one other phone (LG).\nThanks in advance.", "time": "09-23-2016 06:21 AM", "replies": []}, {"postID": "post5441443", "text": "I think it's tied into the shutdown to give you a note that your phone has turned off when it runs out of battery... I think most of the phones I've had recently have vibrated when turning off.\nAs for disabling the feature, don't know", "time": "09-23-2016 08:34 AM", "replies": []}, {"postID": "post5443126", "text": "Thanks. It seems like a stupid feature. The problem with programmers is that they have to keep \"improving\" things which sometimes results in these superfluous features.", "time": "09-23-2016 09:06 PM", "replies": []}]}, {"title": "Using Miracast on Moto G4?", "thread": [{"postID": "post5360212", "text": "I'm trying to figure out the easiest way of streaming content to my TV without Wi-Fi. Miracast was my first guess but after over an hour of trying, I can't get the G4 to see my Sony TV that the LG V10 had no issues connecting to. Does anyone know if I'm missing something or if the G4 just doesn't work with Miracast. And if not, is there any other way of mirroring or sending videos to a TV without Wi-Fi?", "time": "08-23-2016 08:50 PM", "replies": [{"postID": "post5381979", "text": "I'm I'm not mistaken Motorola phones since, something like 2014(?), No longer support miracast. You'll need Google cast and a Chromecast or android TV I'm afraid.", "time": "08-31-2016 02:43 PM", "replies": []}]}, {"postID": "post5360759", "text": "You already tried these steps? - GTrusted", "time": "08-24-2016 02:19 AM", "replies": [{"postID": "post5411827", "text": "Sorry for the long delay but I did try that first. Turns out it doesn't ever see the TV. I ended up giving the phone to a relative and bought the Blu R1 HD. Haven't tried connecting it but I'd guess it'll have the same issue", "time": "09-11-2016 07:06 PM", "replies": []}]}, {"postID": "post5429018", "text": "micracast support has been removed in moto series, as while enabling micracast you will not able to connect to external INTERNET. only one of the options is viable in moto G phones either choose micracast, but while casting your wifi internet access is gone. you can enable micracast by changing some conf. files by rooting your device. Its totally your wish.", "time": "09-19-2016 06:56 AM", "replies": []}, {"postID": "post5441470", "text": "I had the same issue with Miracast. Having mostly fixed the issue, I would not recommend turning it on unless you already planned to root your phone. Like iambruv said, you have to root your phone, then flip a flag in one of the config files (I believe it's the same one that previous moto's had disabled). \nOnce this is done, Miracast will be enabled, however you can only cast non-protected content... so basically YouTube. Hulu/Netflix will cast, but only the audio. The reason has something to do with hdcp. I have not found a way to disable hdcp for the Moto G, only some vague mentions of having to recompile the kernel with the hdcp flag turned off, however without detailed instructions, I am not that adventurous. \nAlso, the Miracast is very hit or miss. My Sony Blueray player sometimes accepts it and when it does it is very laggy. Mostly I use a Microsoft HD-10 to cast to which works most of the time. Sometimes it will lag, but not nearly as bad as the other one, I just pause the video I'm watching and that normally fixes it.\nFor Netflix and Hulu, I've resorted to popping my sim into my Lumia 735 and that works really well for casting.", "time": "09-23-2016 08:44 AM", "replies": []}]}]
[{"title": "Moto G 4th Generation Bluetooth issues", "thread": [{"postID": "post5417213", "text": "Just purchased a Moto G 4th Generation from Amazon. Cannot link contacts phone book to our 2015 Mazda CX-5. Connects fine, but calls flip back and forth from phone to car, in spite numerous attempts to upload phone book, still fails. Deleted device, reset Mazda bluetooth, tried blueooth phonebook app........ say successfully uploaded but nothing there. Contacts are on phone, not SD card......help anyone?", "time": "09-14-2016 12:00 AM", "replies": []}, {"postID": "post5418195", "text": "Welcome to the forums. I'll move your thread to the Moto G 2016 forum for more visibility.", "time": "09-14-2016 11:36 AM", "replies": []}]}, {"title": "Gaming experiences on Moto G4", "thread": [{"postID": "post5295498", "text": "How's gaming on the Moto G4? \nSpecifically mainly Clash of Clans and a little of PokemonGo.\nLooking for first hand experiences on performance and battery life. \nThanks.", "time": "08-02-2016 01:17 PM", "replies": []}, {"postID": "post5300701", "text": "Ok, I ended up picking up a G4 from Bestbuy to try. It's my first Android phone since back when I switched from the very first Verizon Droid to iOS. \nPerformance on Clash of Clans is not bad when compared to my daily carry iPhone 6S. There is some lag when a raid hits it peak and the graphics are kicking in. Battery life seems fine for what I'm using it for (Mini mini cellular tablet). Heat doesn't seem to be an issue. \nMulti user accounts capability is pretty nice although doubling installing apps is probably going to kill my memory space fast. Screen is amazing for the price and kinda puts my 6S's screen to shame. GPS doesn't seem to work perfectly because the Smart Unlock doesn't always detect I'm at home. While sitting in my living room, it varies my location from on the street in the back, street in the front, neighbor's house, etc. \nI also tried my wife's Pokemon Go account on the G4. The game works fine but the avatar's positioning isn't smooth and bounces from place to place due to the GPS.", "time": "08-04-2016 11:39 AM", "replies": []}, {"postID": "post5347290", "text": "for the games I play(mekorama, 2048, angry birds, cartoon wars, Sega Genesis emulator, Doom 1 and 2, city racing 3d, smash hit) it's perfectly fine. I did try Asphalt 8 after reading that it was laggy on the g⁴ plus and it is kinda laggy with low frame rates. Kind of a bummer, but then again, my taste in games doesn't require much, so I'm alright.", "time": "08-19-2016 08:28 PM", "replies": []}, {"postID": "post5411872", "text": "You have to be careful when trying to assess how an Android smartphone handles graphically intensive games. I have found that sometimes it's not the device but the app and how it is optimized. When I played Modern Combat on my Note 7 it played better than when I played it in my Moto G4 Plus, but Real Racing 3 plays better on my Moto G4 Plus than the Note 7 and Note 5. Dead Trigger played perfectly. Gods of Rome played perfectly. Mortal Kombat I'd smoother on the Note 7, but not bad on the G4 Plus. Shadow Fight 2 is awesome on the G4.", "time": "09-11-2016 07:27 PM", "replies": []}]}, {"title": "Camera problems", "thread": [{"postID": "post5285889", "text": "I used the Moto G4 Plus camera outdoors and after extended constant usage in direct sunlight on a hot day, it starts to lag and sometimes won't even take a picture in 15-30 seconds, and sometimes it won't take a picture at all. I tried to force close and it still won't take pictures. Tried to restart the phone and it didn't work. I let it cool down for a fee minutes and it works again like normal. \nI have also had issue of the camera app closing on its own.", "time": "07-27-2016 05:48 PM", "replies": [{"postID": "post5286531", "text": "What do you consider an extended period? 5 minutes? One hour? Just wondering because from my perspective, an extended period of camera use would be anything more than two minutes...", "time": "07-28-2016 04:30 AM", "replies": [{"postID": "post5286783", "text": "Probably 15-20 minutes. It was progressively getting worse the longer I used it. At first it would just seem to focus very slowly", "time": "07-28-2016 08:35 AM", "replies": [{"postID": "post5287449", "text": "Do you think a Software update will fix this issue?", "time": "07-28-2016 03:22 PM", "replies": [{"postID": "post5287671", "text": "It is possible", "time": "07-28-2016 05:32 PM", "replies": []}]}, {"postID": "post5288157", "text": "OK so this \"issue\" is a totally hypothetical situation then for me \nBut not good in any way, let's just hope it is a software issue and soon to be solved with an update.", "time": "07-29-2016 01:05 AM", "replies": []}]}]}, {"postID": "post5321415", "text": "same here - I was trying to shoot video on a hot day, and the phone just basically locked up in the camera app, frames stuttering and I could not get out - sure wish there were a removable battery!\nI do have a case on, and maybe that contributes- but no reason this phone should heat up like this.", "time": "08-13-2016 07:05 AM", "replies": []}]}, {"postID": "post5285951", "text": "I'm going to try to snag my wife's phone and try to replicate. That's not a warm fuzzy.", "time": "07-27-2016 06:32 PM", "replies": []}, {"postID": "post5285993", "text": "I've had the same with my moto g4. Not awesome when you live in Florida.", "time": "07-27-2016 07:03 PM", "replies": []}, {"postID": "post5286260", "text": "I'll give this a test tomorrow as well and report back. Aside from the heat and taking photos, is anything running in the background (e.g. music, downloading, etc.)? Not that this makes it OK, but I want to see if I can get the same problem to occur.", "time": "07-27-2016 10:52 PM", "replies": [{"postID": "post5286269", "text": "Not that I am aware of.", "time": "07-27-2016 10:58 PM", "replies": []}]}, {"postID": "post5286726", "text": "I couldn't get the slowdown when at the park last night but I do feel some heat near the power button when using the camera a lot.", "time": "07-28-2016 07:53 AM", "replies": []}, {"postID": "post5347194", "text": "mine heated up during testing the video camcorder out at a recent concert. got damn near 110 degrees. That can't be good for battery life. I'm not much of a picture/video taker though, but still. \nFrom what I've gathered Motorola is aware of the issue and even pushed an ota update for their customers in India. There's some that say the ota update fixed it and others that say it hasn't fixed the issue. Maybe nougat update will get everything smooth and cool, but I don't know... not sure how that stuff works.", "time": "08-19-2016 08:07 PM", "replies": []}, {"postID": "post5400497", "text": "yesterday my Moto Camera app was updated to version 6.0.43.10 dated 26 August 2016. Hoping the bug fixes will resolve the heating issue", "time": "09-07-2016 02:04 AM", "replies": [{"postID": "post5403767", "text": "Yeah I got that update too, I didn't even think at the time that maybe it'll have a fix for the camera heat issue. Hopefully it does. I haven't tested it myself yet. Next time I use the video camera I'll pay attention.", "time": "09-08-2016 10:48 AM", "replies": []}]}]}, {"title": "Let's see your designs!", "thread": [{"postID": "post5271262", "text": "Post pics of your moto maker customized device!! I got black screen and hot pink back. Can't wait for it to get here! What did you guys and gals get?", "time": "07-18-2016 04:03 PM", "replies": []}, {"postID": "post5271300", "text": "I got the amazon version so just the plain color unfortunately.", "time": "07-18-2016 04:27 PM", "replies": []}, {"postID": "post5274168", "text": "Moto G Plus 4 GB / 64 GB version\nWhite/silver front\nCobalt blue back\nDark gray accent", "time": "07-20-2016 01:11 PM", "replies": []}, {"postID": "post5275236", "text": "White front and Foam color on the back. (64gig/4gig RAM version) Wife loves hers!", "time": "07-21-2016 06:56 AM", "replies": []}, {"postID": "post5365009", "text": "2gb version. I think, for my uses, that will suffice.", "time": "08-25-2016 11:45 AM", "replies": []}, {"postID": "post5385083", "text": "Update. The g4+ is awesome!\nThat is all\nAlso, poetic revolution case from eBay is equally awesome. Cheap, sturdy, well fitting, and aesthetically pleasing.", "time": "09-01-2016 05:36 PM", "replies": []}, {"postID": "post5400675", "text": "Just noticed they now have a bamboo back available, I prefer my Cobalt Blue though  :", "time": "09-07-2016 05:23 AM", "replies": []}]}, {"title": "Other Files", "thread": [{"postID": "post5395609", "text": "Guys I am new to android. Used iOS devices before Only bought this phone as a temporary replacement. But I am having a problem.\nWhat is Other files? It takes 4.5GB of my Internal Space.", "time": "09-05-2016 07:24 AM", "replies": []}, {"postID": "post5399510", "text": "Can you tap on other files?if so then it might give you more details", "time": "09-06-2016 05:21 PM", "replies": []}]}, {"title": "Motorola Moto G4 - Video s are not immediately working on whats app", "thread": [{"postID": "post5375172", "text": "I bought new Motorola Moto G4 (Android 6.0.1) and whats app video are not starting immediately after download completes. These are the steps. \n1. click on whats app video.\n2. download starts. \n3. wait for download to finish . \n4. when downoad finish click on the video again.\n5. It doesn't play the video, doesn't matter even if you keep on clicking for hours.\n6. Go back to any other screen and then come back to video (doen't matter if you come back immediately.) \n7. click on video then it starts playing the video. \nanybody else experiencing the same issue ?\nRegards", "time": "08-29-2016 05:45 AM", "replies": []}, {"postID": "post5384287", "text": "Any one else is facing the above mentioned issue with Mororola Moto G4 please ?", "time": "09-01-2016 12:35 PM", "replies": []}]}, {"title": "Problem downloading ebook to phone", "thread": [{"postID": "post5333742", "text": "I just got a Moto G4, my 1st smartphone, and since I like to read ebooks I installed Bluefire on it so that I could read them like I do on my IPod Touch and Samsung Galaxy Tab E. I noticed that when I downloaded the .pdf file to my computer and attached all my devices that the phone did show up as a device but there didn't appear to be a way to copy the file to it, as there is on my Galaxy tablet. I haven't been able to figure out how to do it. The phone does have an 8 gb SD card but no matter what I've done, I can't seem to get it to work. Help? Anybody?", "time": "08-16-2016 08:04 PM", "replies": []}, {"postID": "post5334857", "text": "Welcome to Android Central! After connecting via USB, swipe down the notification panel and look for a USB icon or option. Tap it and make sure MTP is selected. The phone should show up in Windows Explorer, and you should be able to drag and drop files to it.", "time": "08-17-2016 04:12 AM", "replies": []}, {"postID": "post5334918", "text": "Yay! That did it! Thanks so much, I really appreciate the help!", "time": "08-17-2016 05:07 AM", "replies": []}]}, {"title": "Motorola G 3 files lost", "thread": [{"postID": "post5316735", "text": "While transferring sdcard folder from internal memory to memory card, I merged files with the same name folder in the memory card. I lost the all my pictures after doing so. Even my whatsapp images from internal memory is lost! please help! \np.s. i tried recovery options but my phone doesnot support usb mass storage option.", "time": "08-11-2016 11:45 AM", "replies": []}, {"postID": "post5317889", "text": "Welcome to Android Central! Did you lose files on Internal Storage, the microSD, or both?\nDid you use a Move or Copy command? In general, Copy is much safer, in case something goes wrong with the operation--that way, the original files are left intact. Move will delete the original files.\nRecovering deleted files from internal storage is difficult and requires rooting: http://forums.androidcentral.com/amb...ted-files.html", "time": "08-11-2016 07:51 PM", "replies": []}]}, {"title": "Which would you choose, a G4 or G4 Plus?", "thread": [{"postID": "post5247900", "text": "I picked up the amazon ads one for $125. Seems like the best deal out there. The g4 plus is $250 granted with gc, but still is quite a bit more", "time": "07-01-2016 05:28 PM", "replies": []}, {"postID": "post5268015", "text": "I went with the plus. I went 4/64 GB. I like having the extra on board storage. Waiting for it to get here!", "time": "07-16-2016 10:35 AM", "replies": []}, {"postID": "post5268075", "text": "If it was my primary phone then I would probably get the 64/4 too", "time": "07-16-2016 11:23 AM", "replies": []}, {"postID": "post5275370", "text": "my vzw LG G3 died and I tried to move over to an iphone 6s plus on Sprint, but the network was so wretched horrible, and I just didn't feel right with iOS, that I switched back and was using an old Droid Razr Maxx for a week before I couldn't take it anymore.\nI was thinking about getting a used phone or an older phone, but I just said the G4 Plus at $300 with the Amazon Gift card was a great deal, and the biggest complaints about the phone are its build (e.g., case), then I don't care as long as the screen is solid and it can make calls and get emails without having me want to throw the phone onto the ground. I've always kept my phones in thick plastic/rubber cases anyway. I don't care for etched metal and polished glass.", "time": "07-21-2016 08:33 AM", "replies": []}, {"postID": "post5277551", "text": "Its an awesome device! You will enjoy it.", "time": "07-22-2016 01:50 PM", "replies": []}, {"postID": "post5280543", "text": "I picked up a G4 yesterday from Best Buy ($199) with a $50 gift card. Since I will be using the temporarily it will get the job done and will be given to my son. So far it's a solid device. But given that I'm on Sprint, I have yet to connect it because no Sprint store within the immediate area has, or wants to give me, the SIM card needed to activate the device on the network.", "time": "07-24-2016 06:36 PM", "replies": [{"postID": "post5281316", "text": "Sorry to hear this! Sprint CS was good most of the time I had them. However, that was 6-7 years ago now. We are now on att and we have no contract and never will again! Att has been great to us over the years though. With little to no real problems.", "time": "07-25-2016 07:13 AM", "replies": []}]}, {"postID": "post5280691", "text": "Wow, that sucks", "time": "07-24-2016 09:09 PM", "replies": []}, {"postID": "post5286230", "text": "Quick update: Received the new SIM from Sprint for my G4 and was able to activate the device via automated phone system. A little inconvenience, but up and running now.", "time": "07-27-2016 10:33 PM", "replies": []}, {"postID": "post5286271", "text": "Glad it's working!", "time": "07-27-2016 11:00 PM", "replies": []}, {"postID": "post5289189", "text": "I chose the G4. I had a Moto X Pure Edition to try out Android (my primary driver is the Lumia 950 XL) and ended up selling it. I bought a Moto G4 Plus 64/4 for a decent price but after reading all the overheating issues I decided to save some money and got the G4 32/2 from Amazon. Hopefully it doesn't disappoint.", "time": "07-29-2016 04:15 PM", "replies": [{"postID": "post5292950", "text": "We have had the G4+ for about 2 weeks now and we have seen no slow downs at all. The wife doesn't play any heavy games though. So for what she needs from it fit pretty perfectly. I know she would have liked a smaller screen but otherwise it has the RAM/space she needed. I think over all she will keep it for a good 2 years before she replaces it again. Its a great deal IMO even at the full $299 price tag.", "time": "08-01-2016 07:35 AM", "replies": []}, {"postID": "post5294262", "text": "The g4 and g4 plus have the same heat issues.", "time": "08-01-2016 10:09 PM", "replies": [{"postID": "post5294292", "text": "I have been using the G4 for a couple of days now and it does not heat as much as I expected, actually not much at all really. The reports of the G4 Plus heating may be due to the enhanced camera processing due to the upgraded camera. In fact my 950 XL heats (warms) more during charging than the G4.", "time": "08-01-2016 10:34 PM", "replies": [{"postID": "post5294841", "text": "The camera is only one instance. There are other overheating issues discussed in this forum like using the phone for gps navigation while charging. \nI would also bet playing cpu demanding games for extended periods of time time on a hot summer day outside would also cause problems.", "time": "08-02-2016 09:41 AM", "replies": [{"postID": "post5307347", "text": "The phone does act up while charging and doing anything in parallel. I did use maps yesterday for navigation and while the phone did eat up the battery quickly, it didn't heat up but was warm at most. I'll try using offline navigation using Here Maps instead of Google and see if it's the constant Network + GPS usage doing this as opposed to just using offline GPS. For gaming, I've tried Asphalt 8 and Injustice and it was still pale warm. \nI've had a real positive experience with this device overall, great battery life and screen, no sluggish behavior and everything works great. If the camera were not average (for the price its great) I would have kept this as my daily driver (it is since a week). I'm switching on to the 6P next week.", "time": "08-07-2016 01:36 PM", "replies": []}]}]}]}]}, {"postID": "post5294729", "text": "I'm sure we will see some patches to come to help out with the issue. The phone is great otherwise but we have not seen any over heating issues as of yet.", "time": "08-02-2016 08:24 AM", "replies": []}]}, {"title": "Kia 2017 Sportage .", "thread": [{"postID": "post5299133", "text": "I have a 2017 Kia Sportage. I just bought a Moto g6 with Android6.01 but it won't connect. I've tried everything listed in one of the 3 get to know your car books but nothing works. Any words of wisdom?", "time": "08-03-2016 06:59 PM", "replies": [{"postID": "post5299436", "text": "Have you spoke to the dealership at all or a toll free help line? Bring it in and see if they will help you with it", "time": "08-03-2016 09:58 PM", "replies": []}]}, {"postID": "post5300626", "text": "No I haven't spoken to the dealership. That was my next step if I didn't get any suggestions here. Thanks for taking the time to answer.", "time": "08-04-2016 11:16 AM", "replies": [{"postID": "post5301950", "text": "I wish I had an answer for you but you would probably need another that has the exact made and model vehicle as you.\nAt least at the dealership they will normally help you set it up before you leave the lot. At least they tried to when I was leaving with my new Jeep", "time": "08-04-2016 09:59 PM", "replies": []}]}]}, {"title": "Any third gen Moto G owners considering the Moto G4s?", "thread": [{"postID": "post5181794", "text": "So, who's considering upgrading to the G4, G4 Plus or G4 Play? \nFrom what I can tell the regular G4 is like moto G, the Play is a Moto E and the G4 is like a Moto X Play?\nPosted via the Android Central App", "time": "05-17-2016 10:59 AM", "replies": []}, {"postID": "post5182080", "text": "Moved to the Moto G (2016) forum.", "time": "05-17-2016 02:08 PM", "replies": [{"postID": "post5182288", "text": "Ah yikes. Sorry for putting in the wrong forum\nPosted via the Android Central App", "time": "05-17-2016 03:22 PM", "replies": []}]}, {"postID": "post5182085", "text": "Mod note: Updated the thread title to reflect OP's intent, Any third gen Moto G owners considering the Moto G4s?", "time": "05-17-2016 02:11 PM", "replies": []}, {"postID": "post5182126", "text": "I'm actually thinking of \"downgrading\" to this from a Droid Turbo 2. I think I'd appreciate the fingerprint scanner, apparently better camera (according to DxOMark), better battery life (low power processor and 1080p screen), and the fact that it's unlocked but works on Verizon more than I'd appreciate the higher specs and features of my current phone. I just need to see the price and decide whether I can deal with the lack of 1080p video recording and NFC.", "time": "05-17-2016 02:27 PM", "replies": [{"postID": "post5182447", "text": "Do you use Android Pay (or Android Beam) often?\nAlso, the Moto G Plus gets an 84 at DxOMark like the DROID TURBO 2.", "time": "05-17-2016 04:42 PM", "replies": [{"postID": "post5183412", "text": "Nope. Security on smartphones needs to improve significantly before I'll ever consider any Android mobile payment system. I assume you ask because of the lack of NFC on this phone. I'd only really miss it for transferring data from my other phone when setting it up, or as a backup method to transfer small files, so it isn't a big deal.\nI saw DxO's review, but I don't really trust their scores. They rated the HTC 10 as high as the S7, which isn't true judging by my experience playing with both phones and numerous camera comparisons online. Besides, they said the G4 Plus has good low light performance, which my Turbo 2 doesn't, and that's what I'm after.", "time": "05-18-2016 08:48 AM", "replies": [{"postID": "post5188111", "text": "Yep dxo cannot be trusted as an independent source. They are paid by the manufacturers.", "time": "05-20-2016 10:12 PM", "replies": []}]}, {"postID": "post5218090", "text": "I have a Moto G 1st Gen. My wife has a 3rd Gen. (I nearly bought a 3rd gen. Then I found out Lenovo cheaped-out and failed to get anything but the X PE certified on TMO's VoLTE, so it's significantly hobbled on their network.)\nAnswer: Not very likely. Read rajamass' review. The internal hardware may still be Motorola, but, other than that: They've significantly cheapened the phone. Gone is the high-quality case material, nicely-hand-fitting curved back (which lent a lot to grip), and IPX7 water resistance. Gone is the nice size. It's now Just Another Phablet.\nNot really seeing much to recommend it. They've ruined the product, IMO.\nI'm disappointed, but not surprised. This is pretty much what everybody expected would eventually happen. Now that Lenovo's fully taken-over: Apparently it has.You couldn't pay me to use Android Pay. I don't trust Android security that far. I barely trust it enough to put Android devices on my home LAN and put an encrypted keyring on it. (And, sometimes, I'm not so certain about that 2nd choice.)\nJim", "time": "06-10-2016 07:47 AM", "replies": []}]}]}, {"postID": "post5186686", "text": "I am considering it,only for the full HD display, not worth upgrading for anything else G3 has similar processor and ram.\nProbably good idea to wait for reviews.\nPosted via the Android Central App", "time": "05-20-2016 01:48 AM", "replies": []}, {"postID": "post5221518", "text": "I don't really see a reason to. 3rd gen is working just fine and not much of an upgrade.", "time": "06-12-2016 07:10 PM", "replies": []}, {"postID": "post5258928", "text": "Well, my third gen went kaput a few weeks ago so I finally got my new G4 plus (16gb). Fingerprint scanner is awesome for a £200 phone. Seems much better than the G3 for me so far. The screen is so much nicer IMO.\nPosted via the Android Central App", "time": "07-10-2016 01:47 PM", "replies": []}, {"postID": "post5286546", "text": "I had bought a Moto G3 16 GB / 2GB for my wife as a present to replace her ageing Galaxy S3, and I was blown away by it. No lagdroid experience like with the S3 (even when it was new years back), finally Android (Marshmallow) has become a decent phone OS, a great and super quick camera, and I really like the look and feel of the G3 since it is so similar to my current daily driver Lumia 920.\nI checked out the G4 in the stores to check the actual size of the phone which was perfect, so I ordered a custom (moto-maker) G4 Plus with 64GB / 4GB which basically ticked all my boxes.", "time": "07-28-2016 04:45 AM", "replies": [{"postID": "post5286724", "text": "You will like the device.", "time": "07-28-2016 07:52 AM", "replies": []}]}, {"postID": "post5286852", "text": "I upgraded from the g3 16/2 to the g4 plus 64/4. After one full week so far, no regrets. I'm think with a device like this, I should be all set until the g6 comes out.", "time": "07-28-2016 09:22 AM", "replies": []}, {"postID": "post5288164", "text": "Pff some three more hours waiting still before it is finally delivered here!", "time": "07-29-2016 01:12 AM", "replies": []}, {"postID": "post5294263", "text": "Did you get it yet?", "time": "08-01-2016 10:10 PM", "replies": []}, {"postID": "post5297699", "text": "Yes, fantastic phone for a fantastic price! My brother in law (apple fan with an iPhone 6) first comment was that my fingerprint scanner was instantaneous (as opposed to apples...).\nPerfect screen, and you really don't need more than HD, even on a 5.5\" screen. Even better it will use less juice. \nLove the glance, it's even better than glance on a Lumia! \nUnfortunately all the white screens are annoying. Even with night mode using the app \"Nova Launcher\" quite some screens are still annoyingly bright white.... Missing that clear black Windows Phone interface!\nPosted via the Android Central App", "time": "08-03-2016 09:28 AM", "replies": []}]}, {"title": "Moto G4 and G4 Plus on Straight Talk SIM. Will it work?", "thread": [{"postID": "post5293512", "text": "Reading from Motorola's website and the reviews, they work on all carriers. Will this work on Straight Talk? Motorola didn't specify it.", "time": "08-01-2016 01:38 PM", "replies": [{"postID": "post5293529", "text": "Yes it will. Straight Talk offers two (2) SIM cards: one for T-Mobile's network and one (1) for AT&T. Choose your SIM and simply insert it into the Moto G4 and you will be good-to-go. There isn't anything else you need to do so as long as the SIM is activated and ready to use.", "time": "08-01-2016 01:48 PM", "replies": []}]}]}, {"title": "Wakelock Detector (no root required)", "thread": [{"postID": "post5267077", "text": "I installed wakelock Detector to see if it would work, and it does work although you need usb debugging enabled and you need to check the box on the security key box that pops up. I didn't see the security key box at first so I revoked usb debugging authorizations in developer options, unplugged the cable,and plugged if back in and it worked. https://play.google.com/store/apps/d...etector.noroot\nFor those that need a little more detail :\n-Go to settings - about phone and tap on the build number 7 times to enable developer options. \n-Go to developer options and enable usb debugging.\n-go to the command prompt and type \"adb devices\" and make sure that you see your device\n-type \"adb tcpip 5555\"\n-use the wakelock Detector app from the play store \nInstalling the Android SDK for Windows, Mac and Linux: A tutorial Installing the Android SDK for Windows, Mac and Linux: A tutorial | Android Central", "time": "07-15-2016 04:25 PM", "replies": []}, {"postID": "post5267090", "text": "Nice. Have you had success with this on other phones?", "time": "07-15-2016 04:35 PM", "replies": [{"postID": "post5267097", "text": "It should in theory work on any device 4.4 or higher without root... But I found it to bea mixed bag. Works with some, not with others. Also, adb is very finicky. \nThe bad thing is without root, you gotta redo the adb thing each time you reboot the phone. Though, this shouldn't be a big issue as you should only need to use it when you have a wakelock issue.", "time": "07-15-2016 04:39 PM", "replies": []}]}, {"postID": "post5284478", "text": "I don't if it is allowed to share link to other forums,\nAnyway, Here is the guide about using Wakelock detector LITE without Root.[Guide] How to fix Android OS battery drain … | Samsung Galaxy Note5\nOnce you apply this command via adb, Non-Root solution is Permanent !\n>adb -d shell pm grant com.uzumapps.wakelockdetector.noroot android.permission.BATTERY_STATS", "time": "07-27-2016 02:21 AM", "replies": []}, {"postID": "post5286309", "text": "thanks, that's pretty awesome to get a permanent solution!", "time": "07-27-2016 11:30 PM", "replies": []}]}, {"title": "Problem with Google Play Music", "thread": [{"postID": "post5283131", "text": "I use the Google Play Music app, and sometimes when hit the \"play\" button, it looks like it is going to do something, then goes back to showing the \"play\" button, and trying this multiple times yields the same result. I also had an issue where I pressed play and it didn't do anything, so i just did something else...then 30 minutes later it started playing music. This is for music already downloaded to my phone. A force close doesn't fix the issue, only a phone restart. The non responsive playing issue happened on both my G4 and G4P. The 30 minute lag thing happend on my G4P.", "time": "07-26-2016 09:27 AM", "replies": []}, {"postID": "post5284989", "text": "Did you try clearing out the cache yet?", "time": "07-27-2016 09:18 AM", "replies": []}, {"postID": "post5285883", "text": "Yes.", "time": "07-27-2016 05:41 PM", "replies": []}, {"postID": "post5286107", "text": "had this issue with my moto g3 and my moto g4 plus. I'm thinking that it's unfortunately a glitchy app but not the device's fault. When it first happened on my g3, clearing the cache didn't work. After uninstalling and reinstalling, it did work, but it does it still every now and then then. Usually I'll just force stop it, and move on to other things, then when I come back to GPMusic later, it'll work again. \nDoesn't happen frequently enough for me to give up on the service, but it's still a nag, especially coming over from Spotify where everything just worked fine. Hopefully they'll iron out that issue.", "time": "07-27-2016 08:46 PM", "replies": []}, {"postID": "post5286259", "text": "Are you saving to the internal or external storage? If it's external could it be the SD card? Not sure why it would cause a delay like that, but something to think about?", "time": "07-27-2016 10:50 PM", "replies": [{"postID": "post5286270", "text": "I had it setup on multiple devices on sd card and it was fine.", "time": "07-27-2016 10:59 PM", "replies": []}]}]}, {"title": "Chrome crashes frequently", "thread": [{"postID": "post5281684", "text": "On both my g4 and g4p, Chrome crashes a few times a day. Sometimes I would open Chrome and it would just open a blank screen. Sometimes the app will open, but nothing will load. Closing tabs and reopening doesn't seem to make a difference. I have to force close Chrome and it works again for a while.\nI have tried to clear cache and app data multiple times, disable and enable it, uninstall the update from Google play and reinstall the update.", "time": "07-25-2016 11:29 AM", "replies": []}, {"postID": "post5286115", "text": "hm, not sure at all what the issue could be. I've had mine for 6 days and chrome hasn't crashed once. In the past, chrome would crash on me because of too much stuff in the memory, but this shouldn't be an issue with any model of the g4.", "time": "07-27-2016 08:52 PM", "replies": []}, {"postID": "post5286254", "text": "No Chrome crashes here. I'll use it a little more frequently to see if it happens and try and pinpoint what could be the problem.", "time": "07-27-2016 10:45 PM", "replies": []}]}, {"title": "Is there any way to make the fps turn the screen off?", "thread": [{"postID": "post5277801", "text": "I saw that the Droid z can make the screen turn off using the fps... Anyway to do it on the g4?", "time": "07-22-2016 04:37 PM", "replies": [{"postID": "post5281320", "text": "At the moment no. It could change with software updates and or XDA devs maybe. I might even check out their forums.", "time": "07-25-2016 07:15 AM", "replies": []}]}]}, {"title": "Bluetooth problems", "thread": [{"postID": "post5279002", "text": "So I have some problems with Bluetooth.\n1. When I make a call starting with Bluetooth then disconnect Bluetooth, I can hear the other person but they can't hear me. \n2. I have music playing through Bluetooth in my car. When receiving a Bluetooth call, the music would continue to play and I can also hear the other person talking and they can hear me. \n3. It doesn't show any track info. Guess, not a big deal though.", "time": "07-23-2016 02:33 PM", "replies": []}, {"postID": "post5280761", "text": "Can't help with #1, but when I have music playing in my car via Bluetooth and I get a call the music is automatically muted until the call is complete.", "time": "07-24-2016 10:09 PM", "replies": []}]}, {"title": "G4 vs G4 Plus in low light", "thread": [{"postID": "post5277883", "text": "I have both the models and took some pictures in low light. One with the stock setting and one increasing the light to maximum.", "time": "07-22-2016 05:32 PM", "replies": []}, {"postID": "post5277885", "text": "G4.", "time": "07-22-2016 05:32 PM", "replies": []}, {"postID": "post5278258", "text": "G4p top, g4 bottom. \nBoth set at maximum light", "time": "07-22-2016 11:48 PM", "replies": []}, {"postID": "post5278262", "text": "That G4 Plus sounds like the way to go but at $250 to $300 (MSRP), it lives in a crowded space.\nPosted via the Android Central App on the Moto X Pure Edition", "time": "07-23-2016 12:05 AM", "replies": [{"postID": "post5278301", "text": "Definitely... I mean the zte pro has 6\"fhd,fps,2gb ram, s617, and retails for well under half the Moto g4 plus retail price. Camera I would suspect that the g4 plus is better though. \nThe g4p is pretty good but,I wonder how it compares to the 5x camera. Personally I want a front fps so... My choices are more limited.", "time": "07-23-2016 12:48 AM", "replies": []}]}]}, {"title": "Is there any way to disable the data limit warning?", "thread": [{"postID": "post5277791", "text": "I got my g4p last night this morning I already got the data limit warning. On my Verizon phones I can disable the warning all together but here I couldn't find the option. I could raise the limit, but... I would just prefer to disable it.", "time": "07-22-2016 04:32 PM", "replies": []}, {"postID": "post5277805", "text": "Does yours not have this switch?", "time": "07-22-2016 04:43 PM", "replies": []}, {"postID": "post5277818", "text": "Yeah, you should have that toggle in settings - data usage, but in Moto devices it only shows up after you switch mobile data on.", "time": "07-22-2016 04:47 PM", "replies": []}, {"postID": "post5277874", "text": "I have the cellular limit disabled like in your screen shot but it still gives me the over data warning", "time": "07-22-2016 05:25 PM", "replies": []}, {"postID": "post5277876", "text": "Huh. That's really weird.", "time": "07-22-2016 05:27 PM", "replies": []}, {"postID": "post5277895", "text": "The triangle is the over data message.", "time": "07-22-2016 05:41 PM", "replies": []}, {"postID": "post5277904", "text": "Humm. I've been playing with those settings and I think you're right. The warning can't be disabled just raised. This is the quantity that gives scale to the data graph and maybe that's the reason. You can switch the data limit off but only change the warning threshold.", "time": "07-22-2016 05:49 PM", "replies": []}, {"postID": "post5278083", "text": "Right... It is a bug... If I set cellular limit off, then it should be off. Anyways, I set it to 100gb so I should be fine as my carrier has indicated that 100 gb is ok for the $24 /mo that I am paying for the data portion.", "time": "07-22-2016 08:13 PM", "replies": []}]}, {"title": "Moto g2 SD card fault", "thread": [{"postID": "post5277986", "text": "I have had a Moto g2 for about a year and it is about to go away for repair for the 3rd time. \nFirst time it started notifying SD card removed so I would take off back & slide card out & put back in for a temporary fix, this progressed to the point if you took SD card out it would tell you sim was removed, sent to tesco for repair.\nSecond time same fault started so dealt with Motorola direct and phone sent off again.\nIt started throwing SD card out again so onto online help with Motorola who suggested amongst other things that SD card was too high spec ??? & To go for a lower spec one, soft reset performed\nAgain the SD card started chatting thrown out so performed full reset from the startup menu and that lasted a couple of weeks and now it's happening again.\nMotorola won't replace as it has not been repaired enough times, they are arranging repair through lenovo.\nIt is a total PITA when it goes as I am without a phone for 10 days and this will be the 3rd SD card it has borked and I am getting just a bit irritated.\nAm I just unlucky or is this a common problem with these phones?", "time": "07-22-2016 06:41 PM", "replies": []}, {"postID": "post5278082", "text": "Mod Note, I will move this to the g2 forum for more visibility", "time": "07-22-2016 08:11 PM", "replies": []}]}, {"title": "Moto G4 not encrypted by default?!?!?", "thread": [{"postID": "post5273321", "text": "I believe Google requires any phone that comes with Marshmallow and has 512mb+ RAM have encryption enabled by default when a user does the first time setup. However, I just setup a G4 fresh out of the box and the phone is not encrypted. Yes, I created a secure pin during setup. Pretty sure this is a big no no with Google.", "time": "07-20-2016 12:30 AM", "replies": [{"postID": "post5273330", "text": "I don't think encryption comes turned on by default. Have you checked through the settings to see if it's an option?", "time": "07-20-2016 12:42 AM", "replies": []}, {"postID": "post5273337", "text": "AFAIK, encryption is still not completely mandatory on new Marshmallow devices.http://arstechnica.com/gadgets/2015/...r-new-devices/\nPosted via the Android Central App on the Moto X Pure Edition", "time": "07-20-2016 12:52 AM", "replies": []}]}, {"postID": "post5273982", "text": "It isn't required. I encrypted mine and didn't notice a difference in performance.", "time": "07-20-2016 11:28 AM", "replies": []}, {"postID": "post5276079", "text": "Encryption support is required if the devices meets certain criteria, which the G4 does. Encryption must be enabled by default if the device can perform encryption above 50MiB/sec. Perhaps the G4 can't do over 50MiB/sec, guess I should have timed how long it took to encrypt my phone and done the math.", "time": "07-21-2016 02:41 PM", "replies": []}]}, {"title": "I have no usb cable in moto g4 plus 32 GB black version", "thread": [{"postID": "post5275168", "text": "I have no usb cable in moto g4 plus 32 GB black version,I got direct turbo charger , while my friend got separate usb cable with white version", "time": "07-21-2016 05:54 AM", "replies": []}, {"postID": "post5275221", "text": "Are you asking what you should do or what cable / manufacturer you should get?", "time": "07-21-2016 06:47 AM", "replies": []}, {"postID": "post5275257", "text": "Any quality micro usb cable should suffice if you need to plug into a computer", "time": "07-21-2016 07:16 AM", "replies": []}]}, {"title": "Ringke TPU Bumper case $2 shipped", "thread": [{"postID": "post5271225", "text": "https://www.amazon.com/Ringke-Protec...cUvbUpU5271225\nCode :6NDOI7RH\nScroll down until you see the NEW box, select that, then Make sure to pick the one not fulfilled by Amazon (the one without the prime logo next to the store name)", "time": "07-18-2016 03:40 PM", "replies": []}, {"postID": "post5271252", "text": "Awesome! Ordering now!", "time": "07-18-2016 03:57 PM", "replies": []}]}, {"title": "Navigation while charging causes battery to get to 128°F", "thread": [{"postID": "post5267102", "text": "I was using Google maps for navigation with the phone on my dash and it got to 128°F pretty quickly while using a qualcomm quick charge 2.0 charger. The phone also ran really slow and was shutting down cores due to thermal overload. \nI tried to use my vent mount with the AC blowing and it ran pretty cool.", "time": "07-15-2016 04:42 PM", "replies": []}, {"postID": "post5267369", "text": "Strange that it would shut down cores and run slow. When I play games on my Note 4 and Note 10.1 2014 tablet (both Kitkat), temps hit 145 F with no ill effects... charging or not. Nav gets hot for sure, but I've not experienced any problems myself.", "time": "07-15-2016 08:17 PM", "replies": []}, {"postID": "post5267527", "text": "Samsung I find tends to throttle the least out of the manufacturers.", "time": "07-15-2016 11:04 PM", "replies": []}, {"postID": "post5267603", "text": "Yes, that might be the reason.", "time": "07-16-2016 12:55 AM", "replies": []}, {"postID": "post5267803", "text": "Moto G users in India have been reporting lots of problems with Moto Gs getting hot and slowing down when doing intensive things with the phone and/or quick-charging. This is one of the reasons I'm not going to jump on a 4th Gen. G right out of the gate. That an Lenovorola blaming it on India's weather \nYour vent mount experiment gave me an idea, though: Maybe somebody will come out with an A/C unit for the Moto G4?", "time": "07-16-2016 07:31 AM", "replies": [{"postID": "post5268096", "text": "The issue is the 617 processor which is using the 28nm process. The Exynos 7870 is pretty similar to the 617,except that it uses the 14nm process, which would run much cooler. Coupled with the a53 which is not really designed for high performance... Personally I would avoid any 617 phone if you are doing prolonged intensive processes. \nCharging and usage us a problem with many high end phones including my g4 and 10,so not really complaining there. The s7 and Note 5 though perform much better while charging....", "time": "07-16-2016 11:38 AM", "replies": []}]}]}, {"title": "Pedometer on S Health app causes wakelock?", "thread": [{"postID": "post5267088", "text": "I tried the wakelock Detector app and noticed that the largest minutes of wakelock came from the S Health pedo. I disabled this and the S Health wakelock minutes went almost to zero. Anyone else notice this?", "time": "07-15-2016 04:34 PM", "replies": []}, {"postID": "post5267152", "text": "It's just a guess, but it seems that it would be pretty difficult for a pedometer to count steps if it didn't keep the CPU awake...", "time": "07-15-2016 05:06 PM", "replies": [{"postID": "post5267214", "text": "It isn't an issue on my s7 edge. Though the s7 edge has the 820 with low power processor, I don't think that the 617 does.", "time": "07-15-2016 05:43 PM", "replies": []}]}]}, {"title": "Screen unlock issues", "thread": [{"postID": "post5266417", "text": "When I pick up the phone, it goes to a \"breathing\" screen or whatever it's called (black screen with just time and unlock and notifications showing). I swipe up to unlock but sometimes it would just take me to the regular lock screen or sometimes the screen would turn off and I would have to press the power button then swipe unlock. Anyone else have this problem?", "time": "07-15-2016 08:14 AM", "replies": []}, {"postID": "post5266507", "text": "Sounds similar to the s7's \"always on\" mode? Can you turn off that mode? I disabled (turned off) that feature on my s7.", "time": "07-15-2016 09:25 AM", "replies": [{"postID": "post5266812", "text": "Yes you can turn it off. I do find it useful so I don't want to go that route yet.", "time": "07-15-2016 01:05 PM", "replies": []}]}, {"postID": "post5266540", "text": "That's Moto Display in action and sometimes it can be a bit fussy \nThe usual way to unlock is swiping down (to the padlock), but the screen will lock again if the swipe is not 'a straight line' or you take longer that usual. And things are different if you have notifications or not. If you tap on a notification you can swipe in different directions:\n- right or left to dismiss is,\n- down to unlock\n- up to unlock and go straight to the notification.", "time": "07-15-2016 09:41 AM", "replies": []}]}, {"title": "Amazon version :Remove Amazon additions including lock screen ads", "thread": [{"postID": "post5263643", "text": "For those who bought the Amazon version for $125,you can remove the lock screen ads and amazon apps. MOTO G 4th Gen How to Remove the Amazon Lock… | Moto G4", "time": "07-13-2016 03:57 PM", "replies": []}, {"postID": "post5263723", "text": "Nice find!", "time": "07-13-2016 05:18 PM", "replies": []}]}, {"title": "Battery die while recording a video", "thread": [{"postID": "post5262316", "text": "My battery die while recording a video.\nThe video is in my phone but it can be played.\nAny thoughts on how to recover the video?", "time": "07-12-2016 07:59 PM", "replies": []}, {"postID": "post5262349", "text": "so you charged the battery again and you still can't play the video?", "time": "07-12-2016 08:24 PM", "replies": []}]}, {"title": "Moto G4 & G4 Plus are missing LTE band 17?", "thread": [{"postID": "post5244660", "text": "The Moto G4 & G4 Plus are missing LTE band 17 -- which in practically a necessity if you want to use it on AT&T in the U.S.\nThe G4 Play has band 17. Very strange...", "time": "06-29-2016 12:04 PM", "replies": []}, {"postID": "post5246457", "text": "It has band 12 which is a superset of band 17. Att broadcasts both band 12 and band 17. So you would be fine.", "time": "06-30-2016 04:32 PM", "replies": [{"postID": "post5247206", "text": "That is assuming band 12 remains enabled, and doesn't get Moto-G'd, as happened with the 2015 Moto models (and several other lower-end brands/models of phones) following their first update.", "time": "07-01-2016 08:19 AM", "replies": [{"postID": "post5248662", "text": "Blame T-Mo.\nPosted via the Android Central App on the Moto X Pure Edition", "time": "07-02-2016 11:32 AM", "replies": [{"postID": "post5248673", "text": "*shrug* The pro-Moto crowd says \"Blame TMO.\" The pro-TMO crowd says \"Blame Lenovorola.\" In the end the consumer ends-up with a crippled device--often finding out only after the fact.\nRegardless of whom is to blame: My goal is simply to raise the possibility, so yet more Lenovorola/TMO customers don't unwittingly fall victim to whatever you call this.", "time": "07-02-2016 11:40 AM", "replies": [{"postID": "post5248694", "text": "T-Mobile seems to be making it cost prohibitive for OEMs (not just Motorola and Lenovo) to be certified for VoLTE, thus Band 12 isn't supported or ends up getting removed. \nThe workaround? Buy a recent T-Mobile-branded device.\nPosted via the Android Central App on the Moto X Pure Edition", "time": "07-02-2016 12:04 PM", "replies": [{"postID": "post5249012", "text": "Or the makers of the less-expensive, low-to-midrange devices don't feel the return on investment is there. Hard to say which. I suspect a combination of the two, honestly.Yeahhhh... Nothing suspicious there, eh?\nIf I like the next generation smaller Nexus, and I find it affordable, I'll be kissing both Lenovorola and TMO hasta la bugger-off.", "time": "07-02-2016 06:04 PM", "replies": []}, {"postID": "post5249012", "text": "Or the makers of the less-expensive, low-to-midrange devices don't feel the return on investment is there. Hard to say which. I suspect a combination of the two, honestly.Yeahhhh... Nothing suspicious there, eh?\nIf I like the next generation smaller Nexus, and I find it affordable, I'll be kissing both Lenovorola and TMO hasta la bugger-off.", "time": "07-02-2016 06:04 PM", "replies": []}, {"postID": "post5251185", "text": "Keen observation. IMO, Legere's goal has been to steer custmers into buying phones from T-Mobile stores.\nPoint in fact: the 2015 pure has had tons of difficulty operating on tmobile VoLTE. But VoLTE works fine w Verizon.\nPosted via the Android Central App", "time": "07-04-2016 03:53 PM", "replies": []}]}]}]}]}]}]}, {"title": "[Finally] Moto G4 and Moto G4 Plus coming to the United States!", "thread": [{"postID": "post5243039", "text": "Unlocking More Choice in the U.S. with the Moto G Family - The Official Motorola Blog\nAlso: Check out our Moto G4 Plus review.Moto G4 Plus review: A memorable upgrade | Android Central", "time": "06-28-2016 10:19 AM", "replies": []}, {"postID": "post5243043", "text": "Boom! July 12th, Sound off if you're buying", "time": "06-28-2016 10:23 AM", "replies": []}, {"postID": "post5243096", "text": "I'm curious what the value prop is for a us buyer to choose the g4 plus over the nexus 5x?\nYou gain expandable storage and more ram for a worse camera, no nfc, and slower processors and gpu.", "time": "06-28-2016 11:05 AM", "replies": [{"postID": "post5243163", "text": "Preface: If updates are important to that particular buyer, always choose Nexus.\nThat said, prices for the Nexus 5X are coming down and the G Plus will be a tough sell ($250 roughly translates to the converted price of the Moto G (third gen) Turbo Edition). \nCarriers: both work on all major US carriers.\nCamera: G Plus ranks as high as the Nexus 6P over at DxOMark. I'd consider them equal. The big thing will be can the Moto G Plus open the camera and take a shot quicker than the Nexus 5X and Nexus 6P as that's what I've seen as the biggest knock on the Nexus cameras.\nNFC: With mobile payments growing, Nexus 5X all the way here. But if you don't use Android Pay or Android Beam, the spec is a wash. (I expect the fifth gen Moto G to have NFC as it slowly gains Moto X features)\nCPU/GPU: Unless you're gaming or using a Nexus 5X side-by-side, I doubt users will notice performance hits on the Moto G Plus.\nI think it comes down to, if you can get the Nexus 5X on sale, buy that one instead. If you absolutely need expandable storage and can get by without NFC, the cheaper Moto G Plus is still a good value.", "time": "06-28-2016 11:53 AM", "replies": [{"postID": "post5248454", "text": "Particularly since Lenovorola seems to be falling down on the job, in this respect, of late.Careful with that! We don't yet know if the G4s will be Moto-G'd on TMO, like the last generation of Motos was.If you check the Moto G4 threads over on the Lenovorola site: You'll find that it, likewise, is getting knocked for (sometimes) slow snap times.That will probably be the Moto Gs.\nI'm not awfully impressed with either the 5X or the Moto G4s. Since I don't need a new phone right now, I'm currently inclined to wait for the next Nexus phones.", "time": "07-02-2016 07:56 AM", "replies": []}, {"postID": "post5248454", "text": "Particularly since Lenovorola seems to be falling down on the job, in this respect, of late.Careful with that! We don't yet know if the G4s will be Moto-G'd on TMO, like the last generation of Motos was.If you check the Moto G4 threads over on the Lenovorola site: You'll find that it, likewise, is getting knocked for (sometimes) slow snap times.That will probably be the Moto Gs.\nI'm not awfully impressed with either the 5X or the Moto G4s. Since I don't need a new phone right now, I'm currently inclined to wait for the next Nexus phones.", "time": "07-02-2016 07:56 AM", "replies": []}, {"postID": "post5248454", "text": "Particularly since Lenovorola seems to be falling down on the job, in this respect, of late.Careful with that! We don't yet know if the G4s will be Moto-G'd on TMO, like the last generation of Motos was.If you check the Moto G4 threads over on the Lenovorola site: You'll find that it, likewise, is getting knocked for (sometimes) slow snap times.That will probably be the Moto Gs.\nI'm not awfully impressed with either the 5X or the Moto G4s. Since I don't need a new phone right now, I'm currently inclined to wait for the next Nexus phones.", "time": "07-02-2016 07:56 AM", "replies": []}]}]}, {"postID": "post5243104", "text": "Some people find Nexus boring and love the Moto features, though this still lacks moto voice, it does have the moto display which is a great feature. Is the camera worse? I thought it got very high marks this year.", "time": "06-28-2016 11:12 AM", "replies": []}, {"postID": "post5247908", "text": "id rather go for which ever one has more screen on time/battery life.", "time": "07-01-2016 05:31 PM", "replies": [{"postID": "post5248454", "text": "Particularly since Lenovorola seems to be falling down on the job, in this respect, of late.Careful with that! We don't yet know if the G4s will be Moto-G'd on TMO, like the last generation of Motos was.If you check the Moto G4 threads over on the Lenovorola site: You'll find that it, likewise, is getting knocked for (sometimes) slow snap times.That will probably be the Moto Gs.\nI'm not awfully impressed with either the 5X or the Moto G4s. Since I don't need a new phone right now, I'm currently inclined to wait for the next Nexus phones.", "time": "07-02-2016 07:56 AM", "replies": []}]}]}]
[{"title": "Delete selected pics in album at one go!", "thread": [{"postID": "post5227996", "text": "I m unable to find a delete option for selected pics in the album's. For example the what's app pics get downloaded to a what's app self generated album.. I can select the pics but there is no thrash or delete option available to delete at one go. There is only a move to folder and a copy to folder option..For camera pics there is no problem but for other album pics.. you have to delete one photo or video at a time..am I missing some option available.. need a way out as it's cumbersome to delete the huge WhatsApp pics which get downloaded everyday day, one pic at a time. Please help", "time": "06-17-2016 05:25 AM", "replies": []}, {"postID": "post5228095", "text": "Hello Sumita, welcome to the forums. Are you using the stock Gallery, Google photos or any third party app? For example, using Gallery this work for me. Open Whatsapp folder, long press on a picture to select it, tap on any other picture you want to delete, tap on the three dots top right, delete and confirm. Isn't this working in your phone?", "time": "06-17-2016 07:32 AM", "replies": []}]}, {"title": "Moto G 2016 wishlist", "thread": [{"postID": "post5181640", "text": "What would you like to see in the new Moto G? Sound off below.", "time": "05-17-2016 09:05 AM", "replies": [{"postID": "post5181838", "text": "They already announced it.", "time": "05-17-2016 11:23 AM", "replies": [{"postID": "post5182431", "text": "", "time": "05-17-2016 04:28 PM", "replies": []}]}]}, {"postID": "post5182003", "text": "Disappointed in the announcement. Am not a fan of big screen phones. First gen Moto G was perfect size. Had they kept the same size but kept improving the specs every generation that would have been cool. \nBut this race for big screened phablets leaves very little options for people who prefer small phones. \nAlthough the specs are decent and the price which is $200 in my country for 3gb/32gb Plus model. So it will sell well without a doubt.\nAnother thing is now that Motorola is owned by Lenovo, its has become an inferior company. Make no mistake the old Motorola who made Moto G 2013 and Moto X 2013 is no longer the same Motorola that we see today.", "time": "05-17-2016 01:24 PM", "replies": [{"postID": "post5191814", "text": "If you want a 4.5\" phone go for a Moto E or Moto G play. (4.5\" and 5\" respectively)\nPosted via the Android Central App", "time": "05-23-2016 11:25 AM", "replies": [{"postID": "post5218153", "text": "Perhaps you missed the part about \"Another thing is now that Motorola is owned by Lenovo, its has become an inferior company. Make no mistake the old Motorola who made Moto G 2013 and Moto X 2013 is no longer the same Motorola that we see today.\"\nEven the 3rd-generation models were a cut above, quality-wise. But typical Chinese disregard for quality is now taking over--exactly as many feared would happen when the sale to Lenovo was announced. I held my thoughts, at the time, hoping for the best. Unfortunately, it seems my hopes were in vain, much as I feared all along that they would be \nJim", "time": "06-10-2016 08:27 AM", "replies": []}, {"postID": "post5220654", "text": "Next gen Moto E is rumored to have a 5\" display.\nPosted via the Android Central App on the Moto X Pure Edition", "time": "06-12-2016 01:14 AM", "replies": []}]}]}]}, {"title": "Motorola India ships 2GB RAM/32GB storage instead of 3GB RAM model", "thread": [{"postID": "post5191984", "text": "This Moto G4 Plus with 3GB of RAM only has 2GB out of the box | Android Central", "time": "05-23-2016 01:21 PM", "replies": []}, {"postID": "post5191999", "text": "Ouch.", "time": "05-23-2016 01:30 PM", "replies": []}]}]
