[{"title": "Acer liquid zest plus...", "thread": [{"postID": "post6166862", "text": "Hi I was just wondering if I can use a 64G SD card in my phone even if they say max 32G ? Thanks", "time": "02-19-2018 05:38 PM", "replies": []}, {"postID": "post6167697", "text": "If the phone specifies that it's compatible with SDHC and not SDXC, then the 64 GB card probably won't work (or could be really buggy). The max storage for SDHC is 32 GB.\nI've found that the maximum SD card listed in official specs doesn't necessarily mean that a larger card won't work -- but they can't guarantee that it'll work correctly, so you're taking a risk if you use the card for important data.", "time": "02-20-2018 03:24 PM", "replies": [{"postID": "post6167705", "text": "Thanks", "time": "02-20-2018 03:29 PM", "replies": []}]}]}, {"title": "How i can update my micromax unite 4 plus 6.0 marshmallow into 7.1 or 8.0", "thread": [{"postID": "post6152299", "text": "I am using my mobile for nearly a year and i found that marshmallow version becomes old i want to update my mobile into latest versions \nSo plz tell me how i can update my mobile phone", "time": "02-02-2018 06:01 AM", "replies": []}, {"postID": "post6152562", "text": "Since that's not a flagship phone. it's over 18 months old and it was never slated to be updated, you probably won't see any newer versions for it. The Canvas Doodle 3 is the only Micromax for which there's even a Lineage Nougat (7) ROM.", "time": "02-02-2018 12:22 PM", "replies": []}]}, {"title": "How update android on 7.0", "thread": [{"postID": "post6113745", "text": "I have Acer liquid zest plus.\nWill i get an update to my android.\nMy android now is 6.0, will i get update to android 7.0 nougat", "time": "12-21-2017 04:04 AM", "replies": []}, {"postID": "post6114221", "text": "Welcome to Android Central! It looks like that phone was released around 5/2016, which means it's more than 18 months old. That's the general support lifespan of a flagship phone, so for a midrange or budget phone, the lifespan will generally be shorter. I doubt the phone will get an official update to 7.0, but you could search the forums at XDA-developers.com to see if anyone has developed a custom 7.0 ROM for that specific phone. It would require rooting, though.", "time": "12-21-2017 02:22 PM", "replies": []}]}, {"title": "Something wrong with the storage on my Android device. What could that be? --->>", "thread": [{"postID": "post5636156", "text": "It says that I have 3.10 GB free of 16.00 GB. But, by looking at the picture, it seems like I have much more free space then 3.10 GB. I purchased this tablet a couple of weeks ago and there should be plenty of space.\nhttps://s23.postimg.org/m47pxigx7/Screenshot_2017_01_08_16_04_49.png", "time": "01-08-2017 03:47 PM", "replies": []}, {"postID": "post5636532", "text": "Welcome to Android Central! Which tablet do you have? You posted in the Acer Android Phones forum -- it might help to move this thread to a more proper forum.", "time": "01-09-2017 12:07 AM", "replies": []}]}, {"title": "When i mount my SD card it becomes the default installation of OBB and Data file", "thread": [{"postID": "post5430863", "text": "How do i fix this? Everytime i mount my SD card it becomes the default installation of OBB and Data file\nMy phone is Acer Liquid z630\nI really want it to be Internal Storage since the loading and performance is faster that way\nMy internal storage has 4gb space left and the obb/data file is only 1gb\nIf i unmount the SD card the app/game will then recognize internal as the default location of OBB/Data file\nAlso the default write disk in the settings is phone storage\nOn es fle explorer:\nWhen SD card is unmounted - Internal is the Sdcard0 which is the default installation\nWhen SD card is mounted - The internal automatically changes to SDcard1 which should be the Sd card not the internal\nIs this the Phone model problem? or Android 5.1 problem?\nI really hate this since if i mount the SD card again the problem resurface", "time": "09-19-2016 07:19 PM", "replies": []}, {"postID": "post5435137", "text": "Welcome to Android Central! What do you mean that you want it to be Internal Storage? If you're talking about Adoptable Storage, where a microSD card can become integrated with the phone's onboard Internal Storage (which allows you to install more apps), then you can't do that, because it's a Marshmallow feature (and not all phones on Marshmallow can implement it). As it is, you can only use your SD card to save media and data files (like photos, videos, music, documents, etc.), which is what it's long been intended for. Some phones also allow you to \"move\" and app to SD, but this only moves a portion of the app.", "time": "09-21-2016 01:38 AM", "replies": []}, {"postID": "post5628652", "text": "I have the exact same problem, has anyone found a solution ?", "time": "01-02-2017 06:58 AM", "replies": []}]}, {"title": "Verify", "thread": [{"postID": "post5610131", "text": "How to bypass google verification in lallipop android.", "time": "12-16-2016 10:25 AM", "replies": []}, {"postID": "post5610135", "text": "No chance of that, sorry", "time": "12-16-2016 10:28 AM", "replies": []}]}, {"title": "Acer z530 custom rom", "thread": [{"postID": "post5585993", "text": "Hi guys need help for my acer z530 if there is an available custom rom like cyanogen for this phone, any suggestion will help thank you", "time": "11-29-2016 10:12 PM", "replies": []}]}, {"title": "Liquid Z6+ Octa core CPU", "thread": [{"postID": "post5387069", "text": "From MediaTek, the MT6737 clocks in at 1.25 GHz. It will be interesting to see how this performs in real life instances.\nWhat do you all think?", "time": "09-02-2016 10:26 AM", "replies": []}]}, {"title": "Acer Z6 Liquid", "thread": [{"postID": "post5386981", "text": "Will be an entry level device for roughly $130. I can't shake the idea that it may not make it to the North American market. But a 1 GB RAM and 8 GB internal device....not so sure. it's going to be a hit, either.\nJust wondering why 16 internal seems to be such a hurdle.", "time": "09-02-2016 09:55 AM", "replies": []}]}, {"title": "Acer's Z6 Plus with a massive battery!!", "thread": [{"postID": "post5386946", "text": "The Z6+ has a 4,080 mAh battery, making it one of the larger phone batteries to date. This should get most users well over a day on a single charge. Do you think this will start the road to 4k+ batteries in phones?", "time": "09-02-2016 09:47 AM", "replies": []}]}, {"title": "MM already installed....", "thread": [{"postID": "post5386923", "text": "But do you think Acer will keep up with at least security patches for the Liquid Z6? I am hoping they will.", "time": "09-02-2016 09:38 AM", "replies": []}]}, {"title": "Acer announces a new phone", "thread": [{"postID": "post5383783", "text": "And here it is: Acer announces Liquid Z6, Z6 Plus, and Iconia Talk S tablet at IFA | Android Central\nAnyone interested in getting one?", "time": "09-01-2016 09:24 AM", "replies": []}, {"postID": "post5385323", "text": "I'm going through a phase of liking lower-spec devices at the moment, so the Z6 is the one that will get my attention if our paths cross.", "time": "09-01-2016 07:13 PM", "replies": []}]}, {"title": "The Z6 Plus.....", "thread": [{"postID": "post5383799", "text": "At $275 and a questionable appearance in the North American Market, is this a good price point?\nSome of the specifications seem solid, but is the price low enough to attract most buyers?", "time": "09-01-2016 09:30 AM", "replies": []}]}]
