[{"title": "Why cant i get passed the EMUI reboot screen on honor 5c", "thread": [{"postID": "post5979231", "text": "It won't turn phone onto home screen at all, its just keeps circulating round back to EMUI reboot system now, wipe data, factory reset wipe cache partition, how can I fix this what's going on?", "time": "09-17-2017 04:23 AM", "replies": []}, {"postID": "post5985296", "text": "download UPDATE.APP and reflash the rom.", "time": "09-20-2017 04:28 PM", "replies": []}]}, {"title": "When Honor 5c get emui 5.1 update", "thread": [{"postID": "post5866148", "text": "Battery drainage is lot in Honor 5c and when it get the emui 5.1 update ??", "time": "06-28-2017 06:11 AM", "replies": []}, {"postID": "post5866295", "text": "Can you post screen shots of the battery stats to help us troubleshoot?\nWith regards to the update, according to a quick Google search, i found that Huawei said that it should have already been released. If you don't see it then I would contact Huawei cusro support to see why you aren't getting the update", "time": "06-28-2017 08:22 AM", "replies": []}]}, {"title": "Phone taking long to boot into recovery (after unlocking bootloader)", "thread": [{"postID": "post5824762", "text": "A few hours ago I unlocked the bootloader on my Huawei GT3 (Honor 5c, NMO-L22), and now I'm trying to boot into the custom recovery I flashed onto the phone. The phone just comes up with \"Your device has been unlocked and can't be trusted.\" and at the bottom says \"Your device is booting now\". I have waited more than an hour for it to boot, but it is in the same state. Please help me get into the custom recovery and possibly remove the bootloader unlock message. I can possibly give more details if required.", "time": "05-22-2017 08:09 PM", "replies": []}]}, {"title": "Honor 5C LTE Bands", "thread": [{"postID": "post5150538", "text": "Anyone find any information about the LTE bands that will be included in this phone?", "time": "04-28-2016 08:59 AM", "replies": []}, {"postID": "post5150572", "text": "Allegedly these, from gsmarena: LTE band 1(2100), 3(1800), 38(2600), 39(1900), 40(2300), 41(2500) - NEM-UL10  LTE band 38(2600), 39(1900), 40(2300) - NEM-TL00H  \nEdit: No idea why it pasted like that.", "time": "04-28-2016 09:22 AM", "replies": [{"postID": "post5150579", "text": "Hmm I hope they have a US version in the works. I would definitely buy one to try out.", "time": "04-28-2016 09:27 AM", "replies": []}]}, {"postID": "post5369030", "text": "Doesn't look like it. Would be interesting for those who want a slightly smaller phone.", "time": "08-26-2016 04:06 PM", "replies": []}, {"postID": "post5823252", "text": "4GLTE", "time": "05-21-2017 02:42 PM", "replies": []}]}, {"title": "No podcast app gets data from my connection. Why is that?", "thread": [{"postID": "post5725270", "text": "I have a Huawei Honor 5c and in the last 3 days my favourite podcast app can't download/update my podcasts. Before, it was perfect.\nI tried out about 5 other apps and I'm facing the same problem with all of them.\nI don't know why only the pod-apps can't do anything, but everything else works fine. I don't have any error messages, I did not do anything with Settings.\nI tried turning off, and then back on my phone/wifi and all of that stuff.\nAny ideas?", "time": "03-25-2017 11:56 AM", "replies": []}]}, {"title": "Honor 5C: Too similar to the Honor 5X?", "thread": [{"postID": "post5353521", "text": "With its big sister the Honor 5X making a statement across the world, is the Honor 5C an unworthy remix? Or is it an even more budget-friendly option that is a great addition to the Honor line?\nVoice your opinion below!", "time": "08-21-2016 08:02 PM", "replies": []}, {"postID": "post5369013", "text": "It seems to be for those who want a slightly smaller phone. Specs don't seem to be that different,other than screen size. Cpu is arguable because it is 16nm which should theoretically be more efficient, but it isn't qualcomm... Which isn't necessarily a bad thing", "time": "08-26-2016 03:59 PM", "replies": []}, {"postID": "post5658279", "text": "I have the 5c and even though I like the phone I would say that the 6x is better", "time": "01-27-2017 12:05 AM", "replies": []}]}, {"title": "Honor 5C: Is the Kirin 650 + 2GB RAM better than 3GB RAM?", "thread": [{"postID": "post5462622", "text": "Since time immemorial (OK, maybe not that long), we have been going about debating whether a higher RAM count actually helps improve performance. Does 6GB of RAM actually help a device perform better than a device that is, say, having 2GB or even 1GB RAM?In the grand scheme of things the answer will always be an obvious YES. A device having 6GB of RAM will definitely outperform a device having 1GB of RAM. Similarly, 8GB will outperform 6GB, 10GB will outperform 8GB, 12GB will…., you get the drift, right? Unless you actually want to shell out a fortune to own a device that features such high RAM count, the real question that you must be asking yourself is how much RAM is really essential for a device to perform optimally?But before that you must also ask yourself, what does RAM do exactly?According to Jerry Hildenbrand from AndroidCentral, “RAM (Random Access Memory) is storage used for a place to hold data. It’s like a big filing cabinet that keeps things ready for the CPU in your phone to present it to your eyes and ears.”\nHe is also of the opinion that, “Android can manage memory rather well and having up to 300 percent more RAM does makes a huge difference. But don't worry about RAM or about how many apps are running on your phone because it just doesn't matter anymore.” How can we weigh RAM as a measure of a device’s performance?One way of measuring performance of any device is to run benchmarking tests on it. This was also exactly what I did with the Honor 5C. I installed AnTuTu Benchmark and Geekbench 3 on the device and set about to see how exactly the device stood in terms of performance.This was what I found: In terms of the actual benchmarking results, the Honor 5C scored 52,908 points in the AnTuTu test. This score was higher than that of the Moto G4 Plus which had managed to score 42,229 points.Attachment 241349In the Geekbench 3 test, the Honor 5C scored an overall single-core score of 908 and a multi-core score of 3966. The Honor 5C's single-core score was significantly higher than the score of the Motorola Moto X (669). The phone's multi-core score was also higher than the score of the OnePlus 2 (3849). Attachment 241350Now here’s the part where you actually need to start paying attention.I mentioned that the Honor 5C outperformed the Motorola Moto X, Moto G4 Plus and the OnePlus Two in the benchmarking tests. Apart from the fact that these devices cost a lot more than the Honor 5C, the phones, except the Motorola Moto X, pack in more RAM than the Honor 5C (3GB/4GB in the Moto G4 Plus and 4GB in the OnePlus 2).\nIn comparison, the Honor 5C sports 2GB RAM. So how did it still manage to beat the other phones? The answer, like I said previously, is that RAM doesn’t really matter anymore. This holds especially true now that we have hardware that’s as amazing as the Kirin 650. Based on the revolutionary 16nm FinFET Plus Process technology, the Kirin 650 is definitely the defining edge when it comes to hardcore performance. It is the incredible combination of a 16nm SoC and 2GB RAM that helps the Honor 5C outperform even the best of ‘flagship’ smartphones!", "time": "10-04-2016 04:46 AM", "replies": []}]}, {"title": "New Honor 5C incoming", "thread": [{"postID": "post5150535", "text": "This looks like a pretty decently spec'ed phone coming out. Looks like it could be priced for around $155 which is a pretty good price for what you get.\nThe Honor 5C has a 5.2-inch IPS LCD screen with 1080p resolution and is powered by Huawei HiSilicon's Kirin 650 chipset. A mid-range unit, it's got eight low-power Cortex-A53 cores running at 1.7 GHz and 2GHz per cluster of four, supplemented by the ARM Mali-T830 GPU and 2GB of LPDDR3 RAM, along with 16GB of expandable storage, 3,000mAh battery The 5C measures 147.1 x 73.8 x 8.3mm and weighs 156 grams.\nA 13MP (f/2.0 aperture, 5P lens) camera on the back and 8MP one on the front. A fingerprint scanner on the back, it also has an FM radio receiver, and ships wth Android 6.0 Marshmallow, topped off with Huawei's EMUI 4.1 interface.", "time": "04-28-2016 08:57 AM", "replies": []}, {"postID": "post5150567", "text": "I do like that they are going toward the 5.0\" screen size. If they can tone down the UI as stated in Andrew's review of the 5X, this might be a good phone for a backup.", "time": "04-28-2016 09:21 AM", "replies": []}, {"postID": "post5369033", "text": "I would consider trying it out if it came to the usa", "time": "08-26-2016 04:07 PM", "replies": []}]}, {"title": "Honor 5C vs Honor 5X performance.", "thread": [{"postID": "post5150545", "text": "I am curious to what the performance difference will be between the two. \nHonor 5C: Huawei HiSilicon's Kirin 650 8 Core (Quad-core Cortex-A53@2.0GHz & Quad-core Cortex-A53@1.7GHz) 2GB of RAM\nHonor 5X: Qualcomm Snapdragon 616 8 Core (Quad-core 1.2 GHz Cortex-A53 & Quad-core 1.5 GHz Cortex-A53) 3GB of RAM", "time": "04-28-2016 09:05 AM", "replies": []}, {"postID": "post5150585", "text": "It will be interesting to see how this stacks up against other devices. I could only find that SoC on one other Huawei and that is in the P9, which hasn't been released yet.\nEdit: P9 lite.", "time": "04-28-2016 09:30 AM", "replies": []}, {"postID": "post5369027", "text": "The 650 is 16nm, which should be more efficient than the 616 which is 28nm", "time": "08-26-2016 04:05 PM", "replies": []}]}, {"title": "Honor 5C vs Honor 5X", "thread": [{"postID": "post5150542", "text": "I've got an Honor 5X handy (if you have questions ping me!), but have yet to spend some time looking at the 5C. Can someone compare the 5C vs. the 5X?", "time": "04-28-2016 09:00 AM", "replies": [{"postID": "post5150721", "text": "I hadn't seen the 5C before you mentioned it! Looks pretty awesome for a phone that price. Looks like they're using the in-house chip rather than the snapdragon that's in the 5X and 2gb of ram instead of 3. But the display is smaller, so maybe it will have even better battery life than the 5X?\nLooks cool! It will be interesting to see how the two compare performance wise.", "time": "04-28-2016 10:56 AM", "replies": []}]}, {"postID": "post5369024", "text": "The chip is 16nm, which in theory should be more efficient than the 28nm snapdragon", "time": "08-26-2016 04:04 PM", "replies": []}]}, {"title": "Apps Access Automatically Turned off", "thread": [{"postID": "post5205014", "text": "Hi Friends,\nGood evening, from last 2 months i am using Honor 5X and facing one problem.\nIn Setting --> Accessibility -> Apps ABC -> Access Turned on.\nafter enabling access to a apps, it's automatically getting offed.\nPlease help me how to resolved this issue.\nThanks.\nDevender Kumar", "time": "06-01-2016 10:39 AM", "replies": []}, {"postID": "post5369023", "text": "Have you figured this out? If not then I would suggest that you contact honor support.", "time": "08-26-2016 04:04 PM", "replies": []}]}, {"title": "How's the RAM management?", "thread": [{"postID": "post5246491", "text": "I have an Honor 5X, and have always felt that Huawei's RAM management is somewhat overaggressive. The goal is to prolong battery life, but I've found that over several months, performance seems to have bogged down more and more, which I think is directly related. I'm curious to know if the RAM management in the 5C will be similar--or perhaps, with the somewhat higher-powered processor, the sluggishness might not be as pronounced.", "time": "06-30-2016 05:00 PM", "replies": []}, {"postID": "post5258703", "text": "I am curious about this as well.", "time": "07-10-2016 09:51 AM", "replies": []}, {"postID": "post5369021", "text": "It would depend on how honor wrote the software. My moto g4 has a similar setup (cpu and ram) as the 5x, yet seemed to be much more fluid.", "time": "08-26-2016 04:03 PM", "replies": []}]}, {"title": "Honor 5C Android N", "thread": [{"postID": "post5291682", "text": "Is Honor 5C getting Android N or 7.0", "time": "07-31-2016 12:29 PM", "replies": []}, {"postID": "post5369016", "text": "I would hope so considering that it was released near when n was released.", "time": "08-26-2016 04:00 PM", "replies": []}]}, {"title": "Too much Bass", "thread": [{"postID": "post5290182", "text": "I just bought this phone (honor5c) and It's a good budget phone but for listening music it sucks. I listened music with my headphones and there is just too much bass. The bass takes over everything. When the 808 hits everything goes quiet except the bass. I listened trough my speakers and it's the same think. Can someone tell how to fix this?", "time": "07-30-2016 11:14 AM", "replies": []}, {"postID": "post5290686", "text": "Welcome to Android Central! Which music app are you using? Is there an equalizer setting?", "time": "07-30-2016 06:51 PM", "replies": []}, {"postID": "post5291246", "text": "Soundcloud,youtube, spotify", "time": "07-31-2016 06:12 AM", "replies": []}, {"postID": "post5291995", "text": "I got this problem solved. There was a setting called \"SWS\". I just turned it off", "time": "07-31-2016 04:42 PM", "replies": []}, {"postID": "post5369014", "text": "Glad it was an easy fix!", "time": "08-26-2016 04:00 PM", "replies": []}]}]
