[{"title": "Oreo on Xperia XA1 Ultra", "thread": [{"postID": "post6193027", "text": "Just received a system update this morning on my Xperia XA1 Ultra and what do you know...it's Oreo. Happy", "time": "03-16-2018 09:16 AM", "replies": []}]}, {"title": "January Security Patch 40.0.A.6.189", "thread": [{"postID": "post6146599", "text": "Hello fellow Xperia XA1 owners the new security patch is here. This patch addresses security issues in Spectre and Meltdown vulnerabilities. Please backup your phone beforehand and enjoy also as a side note which I have noticed everytime Xperia Transfer Mobile gets an update that means a system update is on its way. Usually within a week of the app update but today literally it was 10 minutes later after Xperia Transfer Mobile got updated.\nEnjoy all love as always Éire 💖", "time": "01-26-2018 02:23 PM", "replies": []}, {"postID": "post6175618", "text": "Hey! My Mom is in the US about to purchase this phone? Would you recommend it? Thank you Eire!", "time": "03-01-2018 06:06 AM", "replies": [{"postID": "post6181171", "text": "Hello to you and your mom. Yes I would recommend this phone its a beautiful and quick device.\nThe camera is brilliant in low light conditions. It comes with 32gb on board storage with an expandable micro SD card slot. I have a class 10 SD card with 32GB as I don't really need much storage as I have integrated OneDrive online storage for pics, videos and music. It has a SwiftKey keyboard with very good autocorrection and you can customise the colour, layout and style. Now I have to say the media volume through headphones is really low in comparison with my Microsoft Lumia 640XL but I don't use my Xperia XA1 as a media player I use it for Apps and games. Speaking of games the 3GB ram makes games run seamlessly and produced beautifully with the large wide-screen look of the phones screen. Videos look stunning on here also you can record in HDR which bumps up the resolution to 4K viewing. I could go on but bottom line she will love this phone and I wouldn't be surprised if you decide to buy this too.\nHope this helps if you have any more questions I'm here for you.\nÉire 💖", "time": "03-06-2018 02:32 PM", "replies": []}]}, {"postID": "post6183108", "text": "Thank you for the wonderfully helpful review. She got the Ultra version and she’s in LOVE with it. I come from a lumia 640 xl myself so I get your point. Hope everything’s great with you and your loved ones.", "time": "03-08-2018 11:54 AM", "replies": [{"postID": "post6183169", "text": "Aww thank you so much and you too hope your mother enjoys her new phone.\nLove Éire 💖💖💖", "time": "03-08-2018 12:41 PM", "replies": []}]}]}, {"title": "XA1 Bloatware", "thread": [{"postID": "post6154070", "text": "Hi,\nI'm thinking of buying the Xperia XA1, but I'm not a fan of bloatware, are there any users who could send a list/take screenshots of the bloatware pages this phone has?\nThanks", "time": "02-04-2018 06:51 AM", "replies": []}, {"postID": "post6156206", "text": "As requested but you can disable them so they are not using ram now they will be taking up space not much now but you cannot root it easily to remove the bloat but it still runs good great little phone i would recommend it!\nÉire", "time": "02-06-2018 05:12 PM", "replies": []}, {"postID": "post6166337", "text": "Thank you", "time": "02-19-2018 07:35 AM", "replies": [{"postID": "post6176163", "text": "No problem at all.\nÉire 💖", "time": "03-01-2018 05:57 PM", "replies": []}]}]}, {"title": "Alarm clock not working if device switched off", "thread": [{"postID": "post6147271", "text": "Before XA1 - actually a 3 days ago - I had my previous smartphone called Alcatel One Touch Pop C7 7041D. When I set my morning alarm and switched off the smartphone (and I really mean switched off not going into sleep mode: holding on/off button -> select 'switch off the device') it would automatically wake up at the specific time ringing the alarm for me (and it was its default stock clock/alarm).\nWith SONY XA1 I am unable to achieve this, the stock alarm does not wake up (= switching on) the device when I switched my SONY off.\nWhy is this happening? Like this feature was on all my latest phones prior to XA1 (like even 4 years ago or so) but not with the actual newest Android 7?!", "time": "01-27-2018 02:01 PM", "replies": []}, {"postID": "post6147292", "text": "Huh. I've never heard of that one! Usually off means off in any phone I've owned!", "time": "01-27-2018 02:39 PM", "replies": []}, {"postID": "post6147446", "text": "Some phones have the option in the clock app settings for the alarm to work even if you power off the phone.", "time": "01-27-2018 07:57 PM", "replies": []}, {"postID": "post6148703", "text": "You need to have your phone on in order for the alarm to work. It's a cumbersome issue but a small issue that can be resolved by just going into do not disturb mode and allow alarms only.\nHope your enjoying the Xperia XA1 other then that.\nÉire", "time": "01-29-2018 10:35 AM", "replies": []}, {"postID": "post6148723", "text": "My BlackBerry devices (and now my Honor 8) will turn on for the alarm to go off at my specified time; but many phones do not have this option.", "time": "01-29-2018 11:00 AM", "replies": []}]}, {"title": "Phone Screen Flashing when USB car charging?", "thread": [{"postID": "post6122688", "text": "I just purchased the XA1 Ultra and only when I attempt to charge the phone turned off and plugged into the cars usb port the whole display turns on and off (flashing) to a white screen and never stops doing this. If I charge with the phone turned on its fine. If I use the wall charger its fine also. Any idea's?", "time": "12-30-2017 06:05 PM", "replies": [{"postID": "post6124916", "text": "The voltage of the USB port may differ from that of the AC Charger. You may do a soft reset on your phone (holding power and restart device).\nThe other piece of advise would be try and use the same car charger that matches your phone not all car chargers give the same voltage out or some chargers may not work as efficiently.\nTry and charge your phone before it drops below 10% just for safety when driving at night and during the day do the same.\nNormally I'd let my battery die then charge to preserve battery life but in your case for safety when battery drops to 10% then charge it.\nHope this helps.\nÉire", "time": "01-02-2018 12:25 PM", "replies": []}]}]}, {"title": "December Security Patch 40.0.a.6.175", "thread": [{"postID": "post6117526", "text": "Check your Xperia XA1 as the December Security update is here. Minor bug fixes and performance improvements.\nHappy Christmas and a Happy New Year to my Android Central family 💝💝\nÉire", "time": "12-25-2017 10:51 AM", "replies": []}]}, {"title": "Sony Xperia XA1 not quick charging", "thread": [{"postID": "post6079690", "text": "My new Xperia XA1 is not quick charging using the original UCH12. I installed the ampere app to check. And the UCH12 doesn't charge any faster over the stock charger.\nWhat's even stranger, is that I already had this UCH12 with my previous phone, the Xperia Z5C, and it did use the quickcharge capabilities. \nI took it back out of storage and tested both devices with the ampere app. The Z5C was allowing a whopping 2550 amp! Whilst the XA doesn't come any further then just under 1000 amps.\nIs there some kind of hidden setting that I need to toggle??", "time": "11-21-2017 12:27 PM", "replies": []}, {"postID": "post6080483", "text": "mAmps, not Amps, but no, there's no setting. From 0% (which you should never let the battery drop to) to 50%, the charge will be higher. Above 50% (70% in some phones), it goes down to normal charge. (And since you should never allow a lithium battery to drop below 40%, it's more a gimmick than anything else, it won't go from 40% to 100% much faster.)", "time": "11-21-2017 08:57 PM", "replies": []}, {"postID": "post6085828", "text": "I have an Xperia XA1 and mine quick charges from 0% I always let my battery run out as this preserves the life cycle of the battery also quick charge batteries have a chip in them that when they charge from empty they get stronger and hold their charge longer. The battery instinctively knows the user and gets to know the users usage. These batteries are smart batteries now what I would suggest to you is back up your phone and then factory reset or hard reset the phone. Your better off not using third party apps to judge the health of your battery as the app may not be working with the latest info on your phone. The forum was only created for this phone only recently so it's not a stretch to think third party apps wouldn't have the schematics of our battery system. Factory reset it and then check to see if it works I if not and the phone still in warranty you could get a Sony center rep to fix or repair the battery.", "time": "11-26-2017 05:48 PM", "replies": []}]}, {"title": "Welcome to the forum.", "thread": [{"postID": "post6083080", "text": "If you have any queries regarding your device please feel free to post here and please keep comments friendly.\nÉire Sony Xperia XA1", "time": "11-24-2017 09:36 AM", "replies": []}, {"postID": "post6084973", "text": "Hi there! No comments or queries you just looked lonely here all by yourself so I thought I'd say hello! ;-)", "time": "11-26-2017 01:52 AM", "replies": []}, {"postID": "post6085819", "text": "Ha ha hello to yourself kind Sir. ☺️", "time": "11-26-2017 05:39 PM", "replies": []}]}, {"title": "November security patch 40.0.a.6.162", "thread": [{"postID": "post6082812", "text": "Just letting you all know that there is a security patch (40.0.a.6.162) hitting the XA1. I have noticed that the overall feel of the phone has improved drastically it opens and closes apps alot smoother and quicker. I haven't noticed too many more improvements but I'm sure you will all comment here.\nÉire ☺️", "time": "11-23-2017 11:19 PM", "replies": []}]}]
