[{"title": "Huawei p8 lite microphone too low on calls", "thread": [{"postID": "post6189381", "text": "Hi hopefully ths helps someone i had the same problem with low call microphone on huawei p8 lite. Turn up your microphone or allow microphone on WhatsApp ,problm solved.", "time": "03-13-2018 03:31 PM", "replies": []}, {"postID": "post6189434", "text": "So WhatsApp is playing with the mic level? That's a no-no in cellphones. (The outgoing voice level is a legal matter - \"developers\" who don't know that should stick to something they're good at - developing cellphone apps isn't it.)", "time": "03-13-2018 04:14 PM", "replies": []}]}, {"title": "Huawei P8 Lite Rescue Mode Recovery Problem?", "thread": [{"postID": "post6162267", "text": "Hi Sir!\nI am using huawei p8 lite.....I wanted to flash huawei p9 lite camera in my phone......for doing that I flashed twrp using flashify but nothing showed in recovery mode.......then I flashed huawei p8 lite stock recovery when I was using upgraded version I mean marshmallow version of android.........then I rebooted my phone and got stuck in recovery mode which says upgrade system again and error funtion 1 and 10........please help me out as soon as you can.....\nThanks.....", "time": "02-14-2018 04:37 AM", "replies": []}]}, {"title": "\"OK Google\" doesn't unlock phone", "thread": [{"postID": "post6160975", "text": "I've recently discovered this cool feature of unlocking the phone by just saying \"OK Google\" but it doesn't work.\nI set up everything and turned on the Voice Match option but it doesn't unlock. I tried to clear the cache and I tried to retrain the voice options multiple times.\nI have a Huawei P8 Lite 2017 please help me out!", "time": "02-12-2018 12:22 PM", "replies": []}]}, {"title": "How do I disable the lock screen pull up notification bar?", "thread": [{"postID": "post6154098", "text": "help. i use Nova Launcher. thanks", "time": "02-04-2018 07:43 AM", "replies": []}]}, {"title": "Random Screen Lock Wallpapers", "thread": [{"postID": "post4669509", "text": "i was using Magazine lock wallpaper feature. during first setting i was told that wallpapers from \"magazine unlock\" folder in gallery will be used and wallpaper will change every time i unlock the screen.\ni updated the folder with some new images and deleted some old, it stopped working. now im trying to reactivate but cannot find any settings regarding this. Help !", "time": "09-08-2015 12:40 AM", "replies": [{"postID": "post5506176", "text": "Swipe up from your lock screen.Then select covers.Add any pictures of your choice.", "time": "10-19-2016 03:55 PM", "replies": []}]}, {"postID": "post4669729", "text": "I think maybe you deleted some data file by mistake..or you can clear it totally and install it again..and you can change another lock screen wallpaper app.", "time": "09-08-2015 02:51 AM", "replies": []}, {"postID": "post4669731", "text": "i am not using any app. it is a default huwaei p8 functionality. also i did not delete any file , i only deleted images from that folder.\nAny idea what to do?\nthanks", "time": "09-08-2015 02:54 AM", "replies": []}, {"postID": "post4669850", "text": "I had a similar problem.... After updating the magazine covers though it seemed to fix itself. Check if there's an update available... When in default theme, lock and unlock phone, swipe up in lock screen to bring up quick icons, then settings, then update covers. Hope it works for you...\nSent from my HUAWEI GRA-L09 using Tapatalk", "time": "09-08-2015 05:30 AM", "replies": []}, {"postID": "post4669963", "text": "it says no pictures or text updates for magazine unlock", "time": "09-08-2015 07:13 AM", "replies": []}, {"postID": "post4673439", "text": "Hmmmm, my technical knowledge about this stuff is kinda limited, but the only other thing I can think of is maybe under theme customization you need to have Default (Magazine) selected in the lockscreen option for it to cycle through the magazine unlock pics.\nSent from my HUAWEI GRA-L09 using Tapatalk", "time": "09-09-2015 05:36 PM", "replies": []}, {"postID": "post4674020", "text": "Update: i managed to get it working.\non the lock screen , swipe up will show a menu with \"play , pause , next\" button , click Play and it started working.\nthnx for the help though", "time": "09-10-2015 12:52 AM", "replies": [{"postID": "post5168959", "text": "Hi, \nI am facing the same issue now with my new huawi , can u please advice with the steps, what to do to reach this swip option\nThx", "time": "05-09-2016 03:26 PM", "replies": [{"postID": "post5546619", "text": "I had the same issue but I fixed it a different way. \n1. Go to settings.\n2. Click on screen locks and passwords\n3. Click on screen lock style \n4. Choose magazine unlock.\nHope this helps.", "time": "11-04-2016 10:16 PM", "replies": []}]}]}, {"postID": "post5568268", "text": "Hi, I had same problem with my Huawei P9 lite,i moved some pics in magazineUnlock folder,and suddenly it didnt work anymore,here is the solutionelete any extra pic that you were added to the magazineUnlock folder,Install new theme from 'Themes' and remember to change your Screen lock style if it asks you whether you wanna keep it or not! (or maybe change your theme if you have some),Change your Screen Lock style to the magazineUnlock again,It should be OK by now,Now you can turn your old theme back. any questions:telegram ID: [redacted my Mod]", "time": "11-18-2016 03:57 AM", "replies": []}, {"postID": "post5569748", "text": "Welcome to Android Central! Thanks for the tip, but FYI, don't add any identifying information in your posts, for your safety and privacy. I redacted your Telegram ID.", "time": "11-18-2016 09:37 PM", "replies": []}, {"postID": "post5589973", "text": "im using the huawei p8 lite, i deleted all the magazine unlock photos and I cant update the photos. I want to get the feature back. Thanks in advance", "time": "12-02-2016 12:44 PM", "replies": []}, {"postID": "post5917589", "text": "How can you automatically change the screen lock wallpaper in Huawei Y5 every time you open your device", "time": "08-09-2017 07:58 AM", "replies": []}, {"postID": "post6152973", "text": "Try applying magazine unlock again in settings it will work definitely", "time": "02-02-2018 10:48 PM", "replies": []}]}, {"title": "Possibly a stupid question. Installing stock Android", "thread": [{"postID": "post6063593", "text": "I've posted before about the complete lack of support from Huawei before. Basically you hand them a load of money they supply hardware that's out of date out of the box, doesn't update and when you ask for support the answer is you have a phone, we have your money now f*** off.\nIs it possible to completely wipe a P8 lite 2017 and install a completely stock version of Android?", "time": "11-10-2017 02:13 PM", "replies": [{"postID": "post6063731", "text": "Completely stock, no, but there are some after market options that are closer to aosp.", "time": "11-10-2017 04:13 PM", "replies": []}]}, {"postID": "post6063615", "text": "It's possible to get close to stock, such as with Lineage OS. Check this link out as a place to start: https://www.xda-developers.com/huawe...ineageos-13-0/", "time": "11-10-2017 02:31 PM", "replies": [{"postID": "post6063736", "text": "Here's a link to the XDA-Developers threadhttps://forum.xda-developers.com/p8l...-14-1-t3542120", "time": "11-10-2017 04:15 PM", "replies": []}, {"postID": "post6063741", "text": "Aquila\nMany thanks for the post but I think this is for me. TBH think I've already made my mind up about the P8lite 2017 and we're not destined for a long and happy life together. Every time I pick it up I realise what a pile of crap it is. Its a mad world, my needs from a mobile phone are in reality modest I don't play games, don't have massive music collections, don't spend hours watching video, don't mind the low res screen at all yet will finish up with either a Google Pixel 2 or iPhone to get something that gets support and updated. Mad absolutely mad...", "time": "11-10-2017 04:17 PM", "replies": [{"postID": "post6063854", "text": "I agree there's not much I like about the P8Lite and I also think the Pixel 2 is an awesome device. In that similar sort of device size, shape and specs you can also find the Essential PH-1, OnePlus 5T, OnePlus 5, Razer Phone, etc. Best of luck!", "time": "11-10-2017 05:21 PM", "replies": []}, {"postID": "post6075366", "text": "Didnt know they released a P8 Lite 2017 model. I'm sorry to hear your issues. If your mind is already set for a different phone. Then by all means go ahead and sell the P8 Lite", "time": "11-18-2017 04:38 AM", "replies": []}]}]}, {"postID": "post6151765", "text": "Well still stuck with the P8 which, if anything i find an even more loathsome device but funds don't allow replacement. Obviously still no updates whatsoever...\nAs for alternatives ... OnePlus5T - that's a NO. Its Chinese and doesn't run stock Android so I'd be in the same boat as now, at the mercy of OnePlus to issue updates. Plus I'm not wild about Chinese phone manufacturers...\nPH1 - interesting but doesn't seem to be available in the Uk and looks like it only runs A7. Like the complete lack of logos though I don't like manufacturers littering MY devices with their name.\nSeems Google are really only game Android town. Need to save up a bit...", "time": "02-01-2018 02:30 PM", "replies": []}]}, {"title": "Horrible battery life: Overnight/standby battery drain.", "thread": [{"postID": "post4543662", "text": "I really wanted to like this device with its beautiful design and all of its impressive features and specs but one issue has kinda ruined the entire experience for me.\nI get terrible battery life specially on standby. Android System is what's eating up my juice and is often at 62% or so which I find very strange. Most Android smartphones I've used had Android System somewhere between 6% to 10% max. When I go to sleep with a 100% fully charged battery, I wake up with 65% or 70% left. That's with Wi-Fi, GPS, Bluetooth, mobile data and auto sync all turned off. I tried using the \"ultra\" power saving mode but to no avail. I even tried disabling some apps including most of Google's services, resetting the phone, clearing the cache but none of that helped. I sent it back to the warranty and they \"reinstalled\" the software or so they say but Android System is still using up more than 50% (it keeps changing but it's always above 50% or 60% and after a long time of standby during my sleep I then wake up only to find it hit 86%. Android System at 86%!!). The problem hasn't been fixed and I'm really, really frustrated mostly because I sold a perfectly functioning LG G2 for the P8.\nAny help will be really appreciated.", "time": "07-09-2015 06:50 AM", "replies": []}, {"postID": "post4543750", "text": "I have not seen any problems at all with battery life with the p8. Make a factory reset.\nSkickat från min HUAWEI GRA-L09 via Tapatalk", "time": "07-09-2015 07:43 AM", "replies": []}, {"postID": "post4543871", "text": "I did... That didn't help either.", "time": "07-09-2015 09:00 AM", "replies": []}, {"postID": "post4544121", "text": "Try going to your Application Manager, locating the app called 'Play Services' and uninstall updates. Then reboot. Those should re-update themselves.\nAlso try disabling Location History in Google Now (unless you REALLY use it). That usually helps people with Google Services and Android System eating up their batteries. \nAlso bear in mind that for the first few days your phone will not last as much as it's conditioning itself and setting things up.", "time": "07-09-2015 11:03 AM", "replies": [{"postID": "post4545650", "text": "I uninstalled Play Services, did a reboot, disabled Location History in Google Now and I'm still where I am. I've had the phone for almost two weeks now. I'm pretty sure that's enough time for it to \"condition itself\".\nWould you suspect this is a hardware issue or is that unlikely?", "time": "07-10-2015 03:14 AM", "replies": []}]}, {"postID": "post4545720", "text": "Dude\nJust go into stock recovery by pressing volume+ and power button\nNow you will see 3 option\nReboot system now\nwipe date/factory reset\nwipe cache partition\nYou firstly wipe cache partition and then wipe data/factory reset\nThen charge it full night and you will see your battery will increase all day usage. I use maximum my mobile for moderate use and 2 hours full use for 27 hours on battery.\nHopefully this will be helpful for you", "time": "07-10-2015 04:51 AM", "replies": []}, {"postID": "post4589536", "text": "hi! Similar issue with you. my P8 has horrible battery drain overnight as well ... \nWhen the sales person cut my micro SIM card into nano Sim card (human error). Causing the SIM card's chipset faulty. For few weeks my P8 drain battery like drink water ... scary ...\nbut after changed the new nano SIM card .. the problem is solved. All back to the normal ..\nhope this information can help you ...", "time": "08-04-2015 01:40 AM", "replies": []}, {"postID": "post4835385", "text": "It hurts me to say I totally agree, the device was really attractive, but the battery life is very disappointing... If a factory reset is done, will that not restore the phone back to default?", "time": "11-16-2015 11:19 AM", "replies": []}, {"postID": "post4860491", "text": "Hi, I have a problem with battery drain ( play service at 20-25%). I have already tried the reset, without restoring the backup, but I haven't solved anything. The p8 is very fantastic device. Have you any advice?", "time": "11-27-2015 03:59 PM", "replies": []}, {"postID": "post4868954", "text": "Hi guys, I've a problem with battery, I've the operative system and play service always over the first at 18% and the second over at 22%, also the stand-by is under 6%? I've try the hard reset but nothing has changed. Have you a possible solution? Thanks so much", "time": "12-02-2015 02:56 AM", "replies": []}, {"postID": "post4871323", "text": "I have the same issue with the battery drain problem any advice how to fix that?", "time": "12-03-2015 08:41 AM", "replies": []}, {"postID": "post4877393", "text": "I also had this issue, when i purchased the phone the first week it was lucky to make it a work day with 1hr of screen on. I figured it would be pointless factory resetting from boot as it was a brand new phone but I did it anyway and problem solved. I can get about 40 hours on with 3.5hrs sot now which i think is very impressive for a 2600 batt.\nThis is with facebook and messenger installed and unprotected aswell which are causing the most significant drain for me.", "time": "12-06-2015 09:43 PM", "replies": []}, {"postID": "post5153341", "text": "I've been having the battery drain issue for months. I'm talking by 3pm 0% battery life! I was searching for a cynogenmod rom to root my phone then, BOOM Huawei released an Android Marshmellow ROM. I installed the Beta Marshmallow 6.0.0 firmware immediately! \nI use both sim's, 3cx, Facebook messenger, Skype and a whole bunch of battery intense apps. My phone is normally down to 40-50% free at the end of the day.\nNow I've spotted at least one bug with this firmware, hidden Launcher/ home screen option. Which for me ment no more Google Now Launcher  I have user Air Launcher as a great alternative, after using it manually a few times it finds the hidden Launcher screen.\nHappy days! No more battery issues, no more weird vendor UI. Just a rock solid phone!http://consumer.huawei.com/my/mobile...y.htm?id=77864", "time": "04-29-2016 09:52 PM", "replies": []}, {"postID": "post5226331", "text": "Hi, I solved the problem. I did all of the stuff mentioned before (factory reset, wiping cache partition, turning off all google services - locations etc.) and none of them worked. \"Android system\" still consumed the most of my battery power. The problem in my case were with the SD card. Previously I had an Asus phone, and when I got the new what I'm currently using (Huawei P8 lite) I didn't format the SD card. Android keeps putting its files to the SD card to work properly, and I think the two different versions of Android's SD card files didn't like each other. I formatted the SD card with the phone and since then, no battery draining problems. I hope it works for you guys too.", "time": "06-16-2016 03:04 AM", "replies": []}, {"postID": "post6111881", "text": "Late reply, but I'd like to confirm mozdony00's post works 100% for me.\nHuawei P8 Lite 2017 - overnight battery drain was >20%\nI had swapped the 64GB card over from my old Honor 5C with existing data.\nBacking up data, re-formatting the card with the P8, and restoring data has completely fixed the excessive battery drain.", "time": "12-19-2017 10:29 AM", "replies": []}]}, {"title": "How do I disable screen lock on my P8?", "thread": [{"postID": "post4744046", "text": "When you have the pattern lock on how do you disable that ?", "time": "10-12-2015 03:40 AM", "replies": []}, {"postID": "post4744874", "text": "Welcome to Android Central! Go to Settings>Security>Screen Lock, enter your current pattern lock, then choose None or Slide. If you're unable to choose those, then go to Settings>Security and tap Clear Credentials.\nIf you encrypted your phone, you must have some kind of screen lock.", "time": "10-12-2015 12:42 PM", "replies": []}, {"postID": "post5491533", "text": "to remove all your screen lock settings go to settings > screen lock & passwords > password > pattern : set the pattern, set the ekstra pin when requested. push the power button twice to active the screen lock, provide the wrong pattern 5 times, choose the ekstra pin and enter the right pin.\nThis disables all screen lock settings.\nWorked for me", "time": "10-14-2016 01:20 AM", "replies": [{"postID": "post5676578", "text": "> wooah.. wow this worked for me..\nThank you!", "time": "02-13-2017 08:49 AM", "replies": []}, {"postID": "post5758901", "text": "Hello. Yes, this is the right method. It works for Huawei P9 Lite to. Thank you so musch.", "time": "04-14-2017 09:36 AM", "replies": []}, {"postID": "post5821788", "text": "Worked like magic for me\nThanks for letting us know.", "time": "05-20-2017 04:06 AM", "replies": [{"postID": "post5993583", "text": "This does not work on a Huawei Nova. The Backup PIN option is disabled and a timer starts after 5 incorrect patterns. Any help please?", "time": "09-26-2017 12:14 PM", "replies": []}]}, {"postID": "post6021908", "text": "It'c woooooorkiiiiiing. Tnx 1000x", "time": "10-16-2017 08:55 AM", "replies": []}]}, {"postID": "post5516443", "text": "It worked finally, thank you so much.", "time": "10-23-2016 09:24 AM", "replies": []}, {"postID": "post5636979", "text": "I have the same problem. Clearing all credentials doesn't solve the issue, although the \"5 times\" tip does work, but that is not a practical solution when the user wants to enable/disable screenlock fast.\nIs there really no better way? Why does Huawei/Android disable the None option?\nThank you.", "time": "01-09-2017 09:14 AM", "replies": []}, {"postID": "post5637454", "text": "Did you encrypt your phone?", "time": "01-09-2017 03:05 PM", "replies": []}, {"postID": "post5639733", "text": "No.", "time": "01-11-2017 08:44 AM", "replies": []}, {"postID": "post5639842", "text": "Go to Settings>Security>Device Administrators​. Is anything there checked on besides Android Device Manager?", "time": "01-11-2017 10:06 AM", "replies": []}, {"postID": "post5640075", "text": "There's only one item, \"Android Device Manager\", and it's set to \"Inactive\".", "time": "01-11-2017 01:17 PM", "replies": []}, {"postID": "post5640222", "text": "Is the phone connected to any work accounts? That may also force this kind of security.", "time": "01-11-2017 03:03 PM", "replies": []}, {"postID": "post5642814", "text": "I don't know what that is.\nThe issue popped out only after I enabled screen locking (through PIN), which I had never used until then :-/", "time": "01-13-2017 04:08 PM", "replies": []}, {"postID": "post5643022", "text": "By work accounts, I mean email accounts associated with your workplace. Oftentimes, these accounts require increased security on the phone.\nWhat happens if you switch from one form of lock to another, then go back to that menu? Does the None option become available again?", "time": "01-13-2017 08:53 PM", "replies": []}, {"postID": "post5643548", "text": "There are a few items in Settings > Accounts, but none are work-specific. Is there something there I should look for that might explain the problem?\nWhen switching from the Pattern screen-lock to PIN, the None option is still disabled.", "time": "01-14-2017 12:27 PM", "replies": []}, {"postID": "post5643694", "text": "If you have email accounts set up in your stock Email app, are they all personal accounts?", "time": "01-14-2017 03:39 PM", "replies": []}, {"postID": "post5649723", "text": "Yes. There's only one Gmail account in the stock Email app. I don't actually use the stock Email or the Gmail app: When I need to check my emails, I connect to my ISP's web-based email server.\nAFAICT, the issue occured shortly after I enabled then disabled PIN protection.", "time": "01-19-2017 04:23 PM", "replies": []}, {"postID": "post5649897", "text": "That's strange. Try wiping the cache partition: HUAWEI P8 - Recovery Mode - HardReset.info This won't erase any personal data.", "time": "01-19-2017 08:04 PM", "replies": []}, {"postID": "post5650728", "text": "As my P8 Lite isn't rooted, I only see those options:RebootDownload new version and recoveryShutdown", "time": "01-20-2017 03:44 PM", "replies": []}, {"postID": "post5650743", "text": "Sorry, I didn't realize you had the lite version. But the screenshots here still show a wipe cache partition option: HUAWEI P8 Lite ALE-L04 - Recovery Mode - HardReset.info. I wonder if they're showing a screenshot from a different device, or if that's from an outdated firmware.", "time": "01-20-2017 04:06 PM", "replies": []}, {"postID": "post5650765", "text": "I have the latest stock firmware (ALE-L21C432B584).\nMy mistake: I forgot that, for some reason, Android works differently when the phone is plugged into a USB port or not.\nAfter uplugging the USB cable, I have this menu:Reboot system nowWipe data/factory resetWipe cache partition.\nAfter choosing the last option and rebooting, I went back to Settings > Screen lock and passwords > General > Password… and \"None\" is still disabled.\nNext, I went into Settings > Advanced settings > Security, and hit \"Clear credentials\", before going back to the Screen lock and passwords section: \"None\" is still disabled.", "time": "01-20-2017 04:25 PM", "replies": []}, {"postID": "post5650869", "text": "Hmm, I'm stumped. My guess is that it's some glitch in the firmware. Try contacting Huawei support: 【Contact Us】 - Huawei Support - Huawei Official Site", "time": "01-20-2017 06:44 PM", "replies": []}, {"postID": "post5651261", "text": "Thanks for the help.", "time": "01-21-2017 05:12 AM", "replies": []}, {"postID": "post5689282", "text": "Thank you so much! This worked first time!", "time": "02-24-2017 01:17 AM", "replies": []}, {"postID": "post5777116", "text": "This worked!! thank you!", "time": "04-22-2017 10:12 AM", "replies": []}, {"postID": "post5791525", "text": "Since this page is in the top hits when googling for this issue, I'll add more infos.\nMy Huawei P8 Lite is currently running the stock ALE-L21C432B594. As shown above, I gave up trying to remove the Pattern lock some time ago because the None option was disabled and nothing worked to re-enable it.\nBut since it's a real pain when using the phone's GPS when cycling, I gave it another try today… and lo and behold, \"None\" is now available without my doing anything. Weird.\nAnyway, there is no \"Security\" item in \"Settings\": It's located under \"Advanced settings\". It might be because I enabled Developer Mode. The section is actually called \"Screen lock & passwords\" and it's located at the root when opening Settings.", "time": "04-29-2017 07:36 AM", "replies": [{"postID": "post5807460", "text": "The problem I have is that the lockscreen itself still is what I see when pushing the power button... \nPassword protection is finally gone, but the damn screen still pops up from time to time. \nSo if I install, let's say CM locksreen, just to get a working lockscreen (music control, weather aso.) the huawei lockscreen still pops up BEFORE the CM lockscreen, 4 out of 10 times.. \nThe huawei screen just swipes away, even if the CM screen is set to locked... still irritates me though..\nAnd believe me, I have tried the usual tips... the solution as I see it is to get the option \"screen lock\" under \"developer options\" to be toggable.. As of now I cannot toggle that switch due to it beeing \"grayed out\" and \"disabled by admin, encryption policy or cred storage\"... but the grayed out toggle is set 'to the right' - wich would indicate that the lockscreen screen should be removable altogether... yes??? But HOW do I do that????\nHelp pls.\nI'm on a \nP8 (gra-L09) \nEMUI: 4.0.1\nBuild: C432B393 (latest in my region)\nAndroid: 6.0", "time": "05-09-2017 12:52 PM", "replies": []}]}, {"postID": "post5815808", "text": "Guys I really needsome help. I cant disable my lock screen pin.", "time": "05-15-2017 01:44 PM", "replies": []}, {"postID": "post5929568", "text": "Excellent! It works for me.\nThanks!", "time": "08-20-2017 09:04 AM", "replies": []}, {"postID": "post5940785", "text": "adb shell\nsu\nsettings put secure lockscreen.disabled 1\nrm /data/system/locksettings.db\nrm /data/system/locksettings.db-shm\nrm /data/system/locksettings.db-wal\nreboot", "time": "08-27-2017 12:00 AM", "replies": []}, {"postID": "post5941198", "text": "Does that require root?", "time": "08-27-2017 10:29 AM", "replies": []}]}, {"title": "Help Picking a Phone", "thread": [{"postID": "post5109795", "text": "My Samsung Note 3 just died on me after less than 1.5 years of use. This was the 2nd Samsung that disappointed me after my S3 so I'm going with Huawei this time. However, I need some help choosing between the P8, P8 Lite, P8 Max, Mate 8, and Nexus 6P models. Overall, it seems that the P8 is a pretty decent phone, especially considering the price point. Therefore, is the P8 decent enough compared to the 6P and Mate 8 considering that it would be about $300 or more cheaper? I would say the things most important to me are screen size and camera quality. And if the P8 is a good choice, which variant should I get (P8 Lite, P8, P8 Max)?\nP8 Lite: $300\nP8: $370\nP8 Max: $550\nMate 8: $750\n6P: $650", "time": "04-07-2016 01:41 AM", "replies": []}, {"postID": "post5112255", "text": "It your considering the p8 lite, I'd highly recommend the gx8 or Honor 5x (both $199 and same specs) just looks different and better speced as for the others I have not used the p8\nAs for the brand, great support, slow with updates though and emui is a change, but I enjoy it\nPosted via the one and only Honor 5x", "time": "04-08-2016 07:18 AM", "replies": []}, {"postID": "post5942259", "text": "I'm about 2 months into P8 lite ownership and Android itself, previously used Apple (many years ago) and more recently Microsoft.\nAt first the P8 lite was OK but it was short lived experience of the P8 and Android deeply disappointing.\nThe P8 lite will be out of date out of the box and in all probability will never get an up to date version of Android, EMUI or a monthly security update. I'm now resetting mine as it wonty log into my Google a/c...\nI'll most lily revert to an old Lumi handset and wait the arrival of iPhone 8 - Apple offer updates and support....", "time": "08-28-2017 02:27 AM", "replies": []}, {"postID": "post5942271", "text": "Nexus. Mainly because as thr above poster said, the P8 is past thr support period for manufacturers for OS updates. However it will still likely get security updates. Google will support Nexus until the hardware isn't capable anymore.", "time": "08-28-2017 02:42 AM", "replies": [{"postID": "post5942332", "text": "Its 2 months old. Basically once you have given Hewaei your money they just want you to **** off, support you must be joking...", "time": "08-28-2017 04:47 AM", "replies": [{"postID": "post5942355", "text": "The P8 is a 2015 model.", "time": "08-28-2017 05:11 AM", "replies": [{"postID": "post5944180", "text": "Should have been more specific. Its a P8 Lite 2017 purchased band new from major high street chain in June 2017.\nAs a newbie with no previous experience of Andriod whatsoever I find the acceptance that there's no support, no updates from the manufacturers and that its perhaps unreasonable to expect support or updates rather curious.\nGiven that I've only had the device around 2 months I'm hoping that my experience with the platform improves, to swap now seems like a 100% write-off of purchase cost. From memory I did see the google Pixel in the shops, it was vastly more expensive, iPhone territory. Trying to maintain a positive outlook on Android but defo wont buy from another no name Chinese manufacturer again.", "time": "08-29-2017 06:56 AM", "replies": [{"postID": "post5944201", "text": "Huawei isn't no name. It's actually the 2nd largest Android manufacturer in the world. It's much larger than HTC or LG, possibly larger than them combined in term of Android sales. \nHowever, note that for Non Pixel phones, Google does not control the updates. This is in part with the fact that Android is open source. The OS itself is free to use by anyone. The only thing Google holds is access to Google services like the Google Play Store. \nWhich is why when you aren't using a Pixel, or a non flagship device, it's sort of understood that you're not getting ALL updates. Supposedly you should still receive monthly security updates, buy I think that's still in the hands of the manufacturer. This is a far cry from say, a Galaxy S5. That's a 3 year old Samsung flagship but it still received a security update last month. Manufacturers treat their flagships well since part of the overhead for it goes to software research costs going forward. They already charged you for costs of software updates you will receive next year. \nThing is with Android, you want to be treated with the same support from the manufacturer like Apple does with the iPhone, you better get the phone that's priced like an iPhone too. Getting the lower end models makes you like a second class citizen. \nIn defense of LG and Samsung though, they have stepped up in their update patterns, and now they also include mid range devices like the Galaxy A series and the LG Stylo series for updates to next Android versions. Samsung went as low range as the top of the line J series (budget series) in terms of updates. And they give announcements as to which devices will get the updates.", "time": "08-29-2017 07:18 AM", "replies": [{"postID": "post5945098", "text": "I think we in the forums emphasize updates... But the vast majority of people buying phones outside forums or tech sites don't really care that much about them. These bargain manufacturers are trying to cut corners wherever possible... Updates are an easy place.", "time": "08-29-2017 04:50 PM", "replies": []}, {"postID": "post5976823", "text": "That's astounding, that a company that sell unsupported crap like the P8 lite 2017 have such a big market share, astounding, absolutely astounding.\nMy fault entirely, should have done my homework before buying.", "time": "09-15-2017 04:30 PM", "replies": []}]}, {"postID": "post5945087", "text": "Not sure how it is where you were but in the USA, Honor,zte, and moto have well priced bargain phones. \nOf course you won't get the support or quick updates like on an iPhone or Pixel... Just comes with the territory", "time": "08-29-2017 04:46 PM", "replies": []}]}]}]}]}, {"postID": "post5943331", "text": "If updates are your number one concern, then get a pixel.", "time": "08-28-2017 04:35 PM", "replies": []}, {"postID": "post5943357", "text": "Definitely get a newer phone like the Honor 6X or even the Honor 8 for cheaper than $300", "time": "08-28-2017 04:49 PM", "replies": []}, {"postID": "post5946078", "text": "Not everyone cares about updates either. I've used to work at a phone retailer and I get a lot of customers who just wants a phone that works. Even a cheap $100 will do. And they don't get much updates", "time": "08-30-2017 06:55 AM", "replies": [{"postID": "post5946156", "text": "In the $100 price range though... They just want a phone what works. The OP has a significantly higher price range.", "time": "08-30-2017 07:58 AM", "replies": [{"postID": "post5946163", "text": "I said even $100 will do. But I've sold phone's around $300+ and they only cared about that it'll work as a phone should work; calls, text messages and emails.", "time": "08-30-2017 08:03 AM", "replies": [{"postID": "post5946168", "text": "Yeah, these are the people who get mad when an update changes things.", "time": "08-30-2017 08:09 AM", "replies": [{"postID": "post5946243", "text": "Or people who just want a phone. I've sold tons of the latest iPhone and Samsung phones cause theyre simply the newer phones out. They don't care about anything else.", "time": "08-30-2017 08:56 AM", "replies": []}, {"postID": "post5946454", "text": "In all fairness, some updates are forced on phones. It really shouldn't be.", "time": "08-30-2017 10:59 AM", "replies": [{"postID": "post5946457", "text": "The only times I hear about forced updates are in the US (I'm elsewhere). \nThe UA carriers really screw people over.", "time": "08-30-2017 11:00 AM", "replies": [{"postID": "post5946675", "text": "Yeah unfortunately in the USA, the carriers are very strong. You are lucky that you five have to deal with this.", "time": "08-30-2017 12:56 PM", "replies": []}, {"postID": "post5946748", "text": "Yeah unfortunately in the USA, the carriers are very strong. You are lucky that you five have to deal with this.", "time": "08-30-2017 01:21 PM", "replies": []}]}]}]}]}]}]}, {"postID": "post5976808", "text": "Update. Put a query into Hewaei along the lines of where are the updates...?\nResponse, I paraphrase - we only do fill version updates ie 6 to 7, 7 to 8 don't do incremental 7 to 7.1 type updates. As expected they offer no assurance as to when or even if my 3 month old phone will get Android 8. Obviously no monthly security update either.\nInstalled Heawei HiSuite (the current version v4.0.1.0) today to my fully patched and updated Win 10 box today and guess what, that doesn't talk to my phone at all just says connect phone by USB, poking around on the forums its not an uncommon issue but no solutions...\nSince factory reset a week or so ago the phone has behaved itself but time will tell...\nAndroid seems to be a reasonable platform and the Play Store is great (after the Windows store) but the handset manufacturers, oh dear...\nWhilst I'm not an intensive or power user with relatively modest requirements it seems that if I want a device that is maintained with updates and any level of support at all I do need to spend flagship money and if I'm doing that Apple are the only game in town, Android handset makers are just too unreliable and a gamble. I'd normally keep a handset for 2 - 3 years, this will be lucky to get to Christmas.", "time": "09-15-2017 04:23 PM", "replies": []}]}, {"title": "Can I change the lockscreen style of my Huawei P8?", "thread": [{"postID": "post5687608", "text": "I really got bored about my Huawei P8's screenlock and I wanna change it, but in the options there's just one screenlock choice and I already use it. Is there any possible way to download more screenlock style(s) or however?\nThanks before", "time": "02-22-2017 05:19 PM", "replies": []}, {"postID": "post5944172", "text": "I downloaded a jpg image to the <Magazine Unlock> via USB cable from my PC and used that", "time": "08-29-2017 06:42 AM", "replies": []}, {"postID": "post5956454", "text": "There are lockscreen apps in the Google Playstore", "time": "09-04-2017 09:51 PM", "replies": [{"postID": "post5957992", "text": "Do you have any suggestions?", "time": "09-05-2017 03:34 PM", "replies": [{"postID": "post5958230", "text": "I like the Next Lock Screen by Microsoft.", "time": "09-05-2017 05:19 PM", "replies": [{"postID": "post5960698", "text": "Thanks, i will take a look when I get a chance", "time": "09-06-2017 05:50 PM", "replies": []}]}]}]}]}, {"title": "notifications on huawei p8 2017", "thread": [{"postID": "post5941440", "text": "I got the huawei p8 2017 today but whenever I get a notification from twitter for example, I don't get the banner notification ?", "time": "08-27-2017 12:57 PM", "replies": []}, {"postID": "post5942334", "text": "Lucky you, mine pestered the hell out of me with notification of every little thing. Is there a way to globally turn ALL notifications OFF with the exception of the phone ring tone?", "time": "08-28-2017 04:49 AM", "replies": []}]}, {"title": "My huawei p8 camera pictures get super blurry even with tripod", "thread": [{"postID": "post5239256", "text": "I've tried to wipe cache. But that didn't work. Please help. https://goo.gl/photos/UbdCDUKvQkQcgeod6", "time": "06-25-2016 09:33 AM", "replies": []}, {"postID": "post5240012", "text": "Welcome to Android Central! Are they always blurry? Is the lens glass completely clean? Also, check to make sure the phone didn't come with a protective plastic film over the lens that was meant to be removed.", "time": "06-26-2016 02:02 AM", "replies": []}, {"postID": "post5244195", "text": "No when I open the camera app the picture is fine but after a second it goes really blurry so it can't be a protective film I have cleaned the lens but the it still is really blurry", "time": "06-29-2016 06:05 AM", "replies": []}, {"postID": "post5244715", "text": "Does it auto-focus at all? If not, there might be a problem with the camera's auto-focus mechanism.", "time": "06-29-2016 12:39 PM", "replies": []}, {"postID": "post5247167", "text": "How do I turn of auto focus then\nPosted via the Android Central App", "time": "07-01-2016 07:36 AM", "replies": []}, {"postID": "post5247875", "text": "I don't believe you can. The auto-focus mechanism is part of the camera module. I suppose you could try a manual camera app, but if these apps have some sort of manual focus feature, it probably still wouldn't work if the focus mechanism in the camera itself is faulty.\nJust thought of something else--does the camera have a macro setting? If so, make sure it's turned off.\nNot sure if this is a pattern, but I've found that the camera in my Honor 5X is not that great either, and has some trouble focusing, even with good lighting.", "time": "07-01-2016 05:11 PM", "replies": []}, {"postID": "post5249474", "text": "The problem is that the camera has been great until now. Before this I had a virus on my phone that deleted an system file so I had to unlock my phone so I dont know if I can go to my phone provider to check if its hardware or software thats the problem.\nPosted via the Android Central App", "time": "07-03-2016 07:51 AM", "replies": []}, {"postID": "post5249993", "text": "Have you tried any 3rd party camera apps?", "time": "07-03-2016 04:31 PM", "replies": []}, {"postID": "post5250620", "text": "Yes no difference\nPosted via the Android Central App", "time": "07-04-2016 06:56 AM", "replies": []}, {"postID": "post5251017", "text": "Ok, see if it persists in Safe Mode: http://consumer.huawei.com/ca/mobile...a.htm?id=55398", "time": "07-04-2016 01:06 PM", "replies": []}, {"postID": "post5317506", "text": "My camera worked fine until I upgraded my Huawei P8 I need to get it sorted. It starts focused but then blares out.", "time": "08-11-2016 05:11 PM", "replies": []}, {"postID": "post5318498", "text": "Exactly like me\nPosted via the Android Central App", "time": "08-12-2016 04:33 AM", "replies": []}, {"postID": "post5368572", "text": "Did you manage to fix this? I have the same problem. I have tried downgrading to Lollipop and doing a factory rest but still the same so I suspect it is a hardware problem with the OIS", "time": "08-26-2016 01:37 PM", "replies": []}, {"postID": "post5588412", "text": "Someone has managed to fix it? I also have a p8 and sometime it works perfectly, but once in 3 times it gets very blurry, for the first second it's okey, then it gets super blury.", "time": "12-01-2016 12:40 PM", "replies": []}, {"postID": "post5658062", "text": "I have the same problem. No one solve this problem ah?", "time": "01-26-2017 07:05 PM", "replies": []}, {"postID": "post5677161", "text": "Any solution? Someone? Same problem from here.", "time": "02-13-2017 05:18 PM", "replies": []}, {"postID": "post5688616", "text": "Same problem here. \nDid anyone managed to fix this? \nFirst second looks good, then autofocus screw everything up.\nI've tried cleaning the lens, reseting the phone, clearing cache, tapping on the camera, on the sides, on front of the phone. \nI'm about to throw it agaist the wall !", "time": "02-23-2017 01:16 PM", "replies": []}, {"postID": "post5931684", "text": "Me 2 everytime i take a photo it also makes a sound", "time": "08-22-2017 03:16 AM", "replies": []}]}, {"title": "No 4g/LTE after last update?", "thread": [{"postID": "post4653538", "text": "Hello! I have a Huawei P8. After it's last update I don't seem to be getting any 4g. Not 100% sure it's the update that caused it, as I didn't pay much attention to it seeing as I have made some configurations with warning me when my data usage is high etc and I might have been putting on a block. Now it's a new month and data usage is reset, but still no 4G, which lead me to believe it might be the update. I have tried turning it on/off, tried turning 4G on/off - but to no avail. Is there anything I can do? It's as if I have turned 4G/LTE/Mobile data (not sure which one you use) completely off seeing as I don't get Edge or det H+ symbol either.", "time": "09-01-2015 12:05 PM", "replies": [{"postID": "post5930682", "text": "Hi, did you manage to solve this, & if yes, how please?", "time": "08-21-2017 11:01 AM", "replies": []}]}, {"postID": "post4663357", "text": "Turn Wifi off and see if you get a data symbol. Some carrier setups just turn the symbol off so you know you're using wifi, not mobile data.\nIf not, bring it to your carrier. If their update broke your phone, they're liable.", "time": "09-04-2015 10:24 PM", "replies": []}, {"postID": "post4667961", "text": "That's the thing, when I turn WiFi off there's nothing. Not the mobile data symbol and of course not the WiFi symbol. I'll take it to the shop I bought it at maybe, thanks!", "time": "09-07-2015 08:30 AM", "replies": []}, {"postID": "post5930991", "text": "Have you done a factory data reset yet? Be sure to backup data before you do that", "time": "08-21-2017 03:36 PM", "replies": []}]}, {"title": "HELP PLEASE!!! (Huawei P8 Brick)", "thread": [{"postID": "post4989723", "text": "Yesterday I flashed twrp recovery but accidentaly I flashed a boot.img too so now when I turn on the phone I get an error saying:\nRESCUE MODEAttention!\nPlease update the system again\nFunc NO: 10 (boot image)\nError NO: 2 (load failed!)", "time": "02-09-2016 12:45 PM", "replies": [{"postID": "post5073001", "text": "I understand that\n- TWRP is installed on your phone\n- you have made a backup with TWRP.\nIs that right? In that case just enter Fastboot (keep Volume +, Volume -, Power pressed) and restore your backup.", "time": "03-20-2016 01:23 AM", "replies": []}]}, {"postID": "post5217868", "text": "When i restore the backup, i have a problemi: software install failed! Help me", "time": "06-10-2016 01:49 AM", "replies": []}, {"postID": "post5580948", "text": "do this first rollback to 5.0 and after isntall 5.0 again and it works for me", "time": "11-26-2016 11:25 AM", "replies": []}, {"postID": "post5909729", "text": "there is nothing to do.\ni can not go into the emui updater. it's always restart into the rescue mode", "time": "08-02-2017 03:26 PM", "replies": []}]}, {"title": "My Huawei P8 is not working..no power.", "thread": [{"postID": "post5883852", "text": "a week after i updated my Huawei P8 to B398, the power button is not working. i was irritated and attempted to reinstall the upgrade. However, when i do the soft reset...and after selecting the install update..my phone turned off and no longer turning on. i did try the soft and hard reset, press+hold all the buttons in diff combination, I recharged the phone on PC and wall with no success and no charging light. no sign of life totally. Does my baby P8 is dead?", "time": "07-13-2017 01:32 PM", "replies": []}, {"postID": "post5884138", "text": "That sucks. It seems like it is dead. Though I would contact Huawei customer service to see if there is anything additional that you can try, or provide you with a warranty replacement, if still under warranty", "time": "07-13-2017 05:50 PM", "replies": []}]}, {"title": "How do I delete miscellaneous files from Huawei P8 lite", "thread": [{"postID": "post5883956", "text": "Not the same as other androids. Nothing happens when you tap on miscellaneous files.", "time": "07-13-2017 03:03 PM", "replies": []}]}, {"title": "my huawei p8 lite navigation bar is not working. how can i restore it?", "thread": [{"postID": "post5875072", "text": "It looks like it has been disabled", "time": "07-06-2017 06:34 AM", "replies": []}, {"postID": "post5875346", "text": "This is for the p8, not sure if it is the same on your phone but hopefully it helps. https://www.manualslib.com/manual/99...8.html?page=21", "time": "07-06-2017 10:43 AM", "replies": []}]}, {"title": "Front camera stopped working", "thread": [{"postID": "post5181455", "text": "Hii. My front camera stopped working. I have a Huawei P8.\nIt worked just fine last night and everything and this morning, when I tried using it, I noticed it was frozen. Like the main camera would work perfectly, but then, when I switch to front camera, I get the last frame my main camera has captured and nothng else would happen. I tried restarting few times, also unistalling the apps that could possibly use camera.", "time": "05-17-2016 06:21 AM", "replies": []}, {"postID": "post5181482", "text": "Hi\nFind \"Camera\" in Application manager, and wipe cache. You can also enter recovery, and wipe the Cache Partition.\nHope this helps!\nChris", "time": "05-17-2016 06:59 AM", "replies": []}, {"postID": "post5181916", "text": "Hey, H3aTeRzz I tried doing what you told me but it didnt work. Thank you, tho", "time": "05-17-2016 11:57 AM", "replies": []}, {"postID": "post5182091", "text": "update: I also tried factory reset, still not working. means it is a hardware problem?", "time": "05-17-2016 02:13 PM", "replies": []}, {"postID": "post5182151", "text": "Welcome to Android Central! After the factory reset, did any apps automatically reinstall? If so, try booting into Safe Mode to make sure none of the installed apps are interfering. On most Android devices, while powered on, press and hold Power until the Power Off menu appears. Press and hold the Power Off selection until the Safe Mode prompt appears. Tap OK.", "time": "05-17-2016 02:33 PM", "replies": []}, {"postID": "post5828403", "text": "I'm having the same issue with my HTC Desire 626 and can't seem to figure out what it is. Like I'll go to put on my front camera and it freezes on whatever you could see in the back camera. I've tried everything at this point that I know of.", "time": "05-25-2017 08:49 PM", "replies": []}]}, {"title": "How can I change the keyboard settings ?", "thread": [{"postID": "post5816717", "text": "I have change by accident the size of my qwerty keyboard (device p8 lite) and it sucks!i've tried everything but nothing helped!\nP.s I don't want to use other keyboard but even if I do,the size is still wrong in other apps,in the calling pad,in the pin and everywhere!HELPPP", "time": "05-16-2017 05:47 AM", "replies": []}, {"postID": "post5817280", "text": "Welcome to Android Central! So you've already looked through all of the keyboard app's settings? Did you change the size of the entire keyboard, or the size of the letters on the keys only?", "time": "05-16-2017 01:07 PM", "replies": []}]}, {"title": "Please I have problem about my phone huawie p8 the screen don't go off", "thread": [{"postID": "post5766277", "text": "Please I have problem about my phone huawie p8 the screen don't go off even when I lock it. It still working makes my battery raining off after charging", "time": "04-18-2017 12:55 PM", "replies": []}, {"postID": "post5766637", "text": "Welcome to Android Central! How are you locking it -- by pressing the Power button? Does this happen in Safe Mode as well? How to turn on safe mode on Huawei P8", "time": "04-18-2017 03:04 PM", "replies": []}]}, {"title": "why is does't connect to pc", "thread": [{"postID": "post5726061", "text": "I connect my huawei p8 to my pc it shows a message in notification bar . I check and changed a option after that I does not connect to the pc . But it shows charging", "time": "03-26-2017 05:06 AM", "replies": []}, {"postID": "post5726450", "text": "choose \"Files\" from the notification.", "time": "03-26-2017 12:59 PM", "replies": []}]}, {"title": "Os service uses a lot of data", "thread": [{"postID": "post5692973", "text": "Im using Huawei p8.. Os service uses a lot of data, other apps r using less..kindly guide me to stop this issue", "time": "02-27-2017 10:30 AM", "replies": []}]}, {"title": "Tethering", "thread": [{"postID": "post5690745", "text": "Hi. I have Huawei P8. When Im tethering my mobile data to laptop then I internet on phone doesnt work, it works only on laptop. My wife have same phone but when she is tethering hers mobile data then she have internet while she is tethering to laptop. What setting I need to change on my Huawei to have internet on phone while Im tethering it to Laptop or somewhere else. Thanks.", "time": "02-25-2017 09:23 AM", "replies": []}]}, {"title": "re-setting or changing the \"Guest Mode\" password", "thread": [{"postID": "post4541264", "text": "I'm confused. When I got my new Huawei P8 phone, I discovered a setting that allows for two passwords--one for \"guests\" and one for me, the \"primary user\". Supposedly it allows me to limit access to certain apps and info when it's only signed in as \"guest\".\nBut I cannot for the life of me find out how I go back to the settings for this function. I can still sign in using both passwords (fortunately I remember them both). But all the instructions I get by googling this do not work with this phone. For example, I'm supposedly supposed to use a two-finger swipe down to enter these security settings. Nope. In fact I can't find anything at all that allows me to customize this function. Where did it go?\nThanks for any help.", "time": "07-08-2015 12:01 AM", "replies": []}, {"postID": "post4542177", "text": "From the manual:\n\"Disabling privacy protection\n1 On the home screen, touch Settings.\n2 Under All, touch Security.\n3 Touch Privacy protection.\n4 Enter the owner password, and then touch Next.\n5 Disable Privacy protection.\"\nDoes this work?", "time": "07-08-2015 11:23 AM", "replies": [{"postID": "post5304577", "text": "I cant see the option privacy protection", "time": "08-06-2016 02:13 AM", "replies": []}]}, {"postID": "post4547242", "text": "Unfortunately no. I found that sequence online too, but it doesn't match what shows up on my phone. For example, under Settings there is no \"All\", nor a \"Security\" heading. Closest I get is Settings>Privacy&Security>Screen lock & passwords. But that doesn't seem to reveal anything to do with the Guest password settings. Lots of features...and it's hard to find them all! This one seems well and truly lost somewhere deep in my phone. :-(", "time": "07-11-2015 12:10 AM", "replies": [{"postID": "post5618312", "text": "Hello, have you solved your problem with guest mode? I have the same on my device.", "time": "12-23-2016 06:59 AM", "replies": [{"postID": "post5619598", "text": "What Android firmware version are you using?", "time": "12-24-2016 09:35 AM", "replies": []}, {"postID": "post5622157", "text": "See response in your other thread: http://forums.androidcentral.com/and...ml#post5620624", "time": "12-27-2016 02:41 AM", "replies": []}]}]}, {"postID": "post4547251", "text": "Under privacy and security there should be a security heading. And at the very top of this should it say privacy protection. Touch this and you are there!\nSkickat från min HUAWEI GRA-L09 via Tapatalk", "time": "07-11-2015 12:26 AM", "replies": []}, {"postID": "post4899747", "text": "Go to dialer. On the right next to the call sign there is a bar. Press and choose privacy protection. Then you should enter the master pin. Next you can customize everything. Hope this will help you.", "time": "12-17-2015 08:34 AM", "replies": []}, {"postID": "post4931057", "text": "i need to de-activate guest mode on my phone but i dont have previous password", "time": "01-04-2016 04:23 AM", "replies": []}, {"postID": "post5050644", "text": "Please anyone can help me how to set a privacy protection in my Huawei y6 phone. \nEvery time I go to privacy protection and set a number code, I end up in my account and visitors account, and if I set the privacy apps, I try it but it doesn't work. Please help", "time": "03-10-2016 10:16 PM", "replies": []}, {"postID": "post5253179", "text": "Hi, please can you tell me if youve managed to disable \" Guest Mode\" on ur P8 lite? I'm stuck", "time": "07-06-2016 04:18 AM", "replies": [{"postID": "post5458175", "text": "I did this on my gionee p5w and it worked. Go to your phone settings >security settings >geust mode then on the space provided to enter you password leave it empty and double click directly below the blinking cusor. you would see your phone security question give the answer and you automatically exit guest mode.", "time": "10-01-2016 12:03 PM", "replies": []}]}, {"postID": "post5318994", "text": "Hi am using the GRA-TL00 but recently I upgraded the EMUI 4.0.1 , I can no longer find the Guest mode and privacy setting . can somebody help urgent.", "time": "08-12-2016 09:57 AM", "replies": [{"postID": "post5320625", "text": "Yeah, it looks like if u upgraded to Emui 4.0 privacy mode they remove it. What a waste", "time": "08-12-2016 07:00 PM", "replies": []}]}, {"postID": "post5352422", "text": "If you are stuck on guest mode press a wrong number in ur lock guest account its gonna say try again slide the screen to ur right then press add wedges and its gonna take you to some place then press home and done ur in ur regular screen oh and if u turn ur phone off its gonna take u back to guest so make sure that once ur in ur regular account make sure u take off guest mode to stop this from preventing", "time": "08-21-2016 12:19 PM", "replies": []}, {"postID": "post5621908", "text": "i want to remove guestmode password on my gionee s6s device but have no password", "time": "12-26-2016 08:08 PM", "replies": []}, {"postID": "post5661644", "text": "Guys I need all the help that I can get I can't switch back to my private mode on my Huawei Y5ll, it's stuck on guest mode", "time": "01-30-2017 08:36 AM", "replies": []}, {"postID": "post5662881", "text": "Not sure where it is exactly in a Huawei with EMUI-skinned Lollipop, but most pure-Android Lollipop phones will have it here: \nSettings > General > Privacy > Guest mode or Settings > Users > Guest (or similar)\nOnce there, choose your main/Google account from the list.\nIf that doesn't work, you'll need to do a factory/hard reset unfortunately, which will lose all your saved data, texts, etc. - so only do as a last resort:3 Ways to Hard Reset Huawei Phones\nDo return to let us know what worked / didn't work, as that will help others with similar problems.", "time": "01-31-2017 09:41 AM", "replies": []}]}, {"title": "[SOLVED] How to prevent Google Maps from uploading pictures?", "thread": [{"postID": "post5650727", "text": "Hello\nIf I take pictures while GPS is enabled, I get notifications from Google Maps to upload the pictures I just took:\nHow can I disable this feature?\nThank you.", "time": "01-20-2017 03:42 PM", "replies": []}, {"postID": "post5650734", "text": "Open Maps, tap Menu>Settings>Notifications>Your Contributions, and turn off the Adding Your Photos switch.", "time": "01-20-2017 03:46 PM", "replies": []}, {"postID": "post5650780", "text": "Thanks!", "time": "01-20-2017 04:40 PM", "replies": []}]}, {"title": "[SOLVED] GPS enabled, but no GPS tags in pictures?", "thread": [{"postID": "post5636198", "text": "Hello\nI actually have a Huawei P8 Lite.\nI notice that even with GPS enabled both in the phone (general Settings) and in Picture > Settings, it seems like pictures aren't geotagged:Enabled GPSOpened maps application to check that location is OKTook PictureCopied file from phone to computerOpened JPG in IrfanView > Image > Information: No GPS data. Clicked further on EXIF Info : No data.Tried with PaintShop Pro, to no avail.\nAny idea what's wrong?\nThank you.", "time": "01-08-2017 04:31 PM", "replies": []}, {"postID": "post5636442", "text": "Is location and mobile data on?", "time": "01-08-2017 09:46 PM", "replies": []}, {"postID": "post5636972", "text": "Yes. This is what I meant with \"Enabled GPS\". I double-checked that it's on through Settings > Advanced Settings > Location access. I'm correctly located when running a maps application before taking pictures.\nAnd mobile data is on as well.\nI tried it again today, and it worked:\nI don't know what changed between then and now. FWIW I might have used a GPS-based application (Maps.me) just before taking the picture. I'll double-check next time and see if that makes a difference.\nA couple more questions:\n1. Within the phone, is there a way to check that a picture is indeed geo-tagged?\n2. Is there a Windows application that can batch-read GPS data from a bunch of pictures?\nThank you.", "time": "01-09-2017 09:08 AM", "replies": []}, {"postID": "post5637467", "text": "If it stops working again, open your Camera, tap Menu>Settings, and look for a Save Location switch. Make sure it's turned on.", "time": "01-09-2017 03:12 PM", "replies": []}, {"postID": "post5638133", "text": "Yes, that's the thing with these new devices, you have settings in a few different places so you can get tripped up. Like B.Diddy says, make sure it's on in your camera settings...", "time": "01-10-2017 04:17 AM", "replies": []}, {"postID": "post5639731", "text": "There's no \"Save Location\" switch in my P8 Lite, but I see that the GPS option is indeed turned on after I enable GPS manually through the phone's general Settings section.\nThank you.", "time": "01-11-2017 08:43 AM", "replies": []}]}, {"title": "On the subject of randomly changing wallpapers", "thread": [{"postID": "post5605303", "text": "I have a folder of pictures I'd like to use as randomly rotating wallpapers. I already know how to achieve this, but the issue is that choosing one gives more-or-less the correct resolution whereas choosing a folder and having them rotate only displays a small part of the wallpaper. This is despite the fact that the wallpapers' resolutions are rather small - approximately 650x900. (Edit: it's worth making clear that all twentysomething of these pictures have the exact same resolution.)\nGiven that I know there is a size mismatch and the pictures will never display \"properly\", is there a way to set up the phone such that I can have the images rotating randomly and show the correct area?", "time": "12-13-2016 04:00 AM", "replies": []}]}, {"title": "When I receive a message while on a call I loose the other party", "thread": [{"postID": "post5600046", "text": "When I am in a telephone conversation with another person and I receive a message or WhatsApp I suddenly cannot hear the other person but they can hear me. I then have to disconnect the call and dial them again - until I get another message. I have a Huawei P8.", "time": "12-09-2016 05:49 AM", "replies": []}, {"postID": "post5600231", "text": "Mod note. Thread moved to the Huawei P8 forum for more visibility.", "time": "12-09-2016 08:54 AM", "replies": []}]}, {"title": "Where is my music option in HiSuite?", "thread": [{"postID": "post5600002", "text": "First time I got a smartphone, it is a Huawei p8 lite.\nI downloaded HiSuite as recommended for file sharing between computer and phone.\nEverything was there, pictures, videos, and so on. But no music folder as illustrated in the screen above. I remember last time I used my stationary somehow some folders just appeared and I could put the music in. But now it is just empty, can't find the folder anywhere on the PC.\nIt is difficult to hide my frustration with this. Something so basic, being such a great struggle for me.\nEvery bit of help is appreciated, and it is probably just some simple **** that I am not aware about as usual.", "time": "12-09-2016 04:21 AM", "replies": []}, {"postID": "post5600192", "text": "Either you don't have drivers installed on your PC or you didn't unlock the screen on the phone and set it up as a USB connection. It's not a problem with the device", "time": "12-09-2016 08:16 AM", "replies": []}, {"postID": "post5601062", "text": "Welcome to Android Central! I merged duplicate threads and moved them to the P8 Lite forum (one was originally in the P8 forum).\nYou really shouldn't have to use HiSuite. When you connect the phone via USB, swipe down the notification panel and look for a USB notification. Tap it and make sure MTP (or File Transfer) is selected. Then open Windows Explorer on your computer, and look for the P8 Lite device in the list. Open it, and you should see all of the user-accessible folders (including your Music folder).\nBe aware that if you're talking about music you downloaded from Google Play Music using the Play Music app, that won't show up. Those files are intended for offline use by the app only, and therefore aren't available to the user for manipulation.", "time": "12-09-2016 05:10 PM", "replies": []}, {"postID": "post5944190", "text": "I got a P8 lite 2017 too. Installed HiSuite to fully patched/up to date install of Win 10 and .... it doesn't do anything just tells me there's no phone connected when there is and its visible in Windows Explorer. User Win Explore to copy music over which worked fine. Cant see what HiSuite is supposed to be for, seems like half baked bloatware looking for a role in life...", "time": "08-29-2017 07:02 AM", "replies": []}]}, {"title": "Mobile network won't work on Huawei P8 lite with cricket in the US", "thread": [{"postID": "post5505480", "text": "I've bought an unlocked Huawei P8 lite in Hungary this february (2016) and I've used 4G mobile net for 6 months in Hungary with T-Mobile. Currently I live in Fort Worth, Texas, and I chose Cricket wireless as my mobile provider. I can start and receive calls but although I suppose to have 4G mobile net, the network speed is the following: \nping - 318 ms, download speed - 0.03 Mbps, upload speed - 0.01 Mbps.\nI've already tried to set the APN settings but it only worked with GPRS bearer.", "time": "10-19-2016 11:57 AM", "replies": []}, {"postID": "post5507908", "text": "Welcome to Android Central! It's probably because the phone doesn't support Cricket's LTE bands. Cricket uses Bands 2, 4, 17, and 30, while the P8 lite supports Bands 3, 7, 8, and 20.https://www.frequencycheck.com/carri...-united-statesHuawei P8lite - Full phone specifications", "time": "10-20-2016 08:14 AM", "replies": []}]}]
[{"title": "Upgrade to Marshmallow? Seems not possible :(", "thread": [{"postID": "post5491704", "text": "Huawei P8 Lite\nALE-L21\nALE-L21C02B181\nENUI 3.1\nAndroid 5.1.1\nI tried to upgrade using P8LiteC432B565UPDATE (renaming it to update.app in /dload folder).\nUpgrade finds it OK but spits the dummy \"incompatible software\".\nReading up it seems I need to first upgrade to B188. Unfortunately to only link to download which seems valid (google download it doesn't exist) is mega.nz.\nSadly the file seems corrupted. It's supposed to be 108MB but it downloads as 57MB and the enclosed APP file is zero length.\nSo I'm stuck with Lollipop unless someone knows where to get a valid B188 upgrade?", "time": "10-14-2016 04:22 AM", "replies": []}]}, {"title": "Need Apps advice on P8", "thread": [{"postID": "post5471813", "text": "Hi guys ,I am seriously thinking of getting a P8 Huawei (Not Lite) or P9 because I've heard that the 4g connection is superb.but I need some advice about app installations,I currently am using a Samsung Note 3 (4g connection is awful and apparently known to be awful for this phone) I run all the usual apps Facebook,Whatsapp,Sky sports etc but also others like KODI,MODBRO,UKTVNOW,PUFFIN BROWSER etc, now I know nothing about installed software,operating systems or things like that.so my question is will I still be able to download and install the type of Apps I have mentioned the same way as I do currently on my Galaxy Note 3. Many thanks in advance for any help/advice.....ps if needed I am in the UK.", "time": "10-07-2016 06:48 AM", "replies": [{"postID": "post5471893", "text": "Not true - mine works fine and always has.If an app runs on the Note 3, it should work on the P8 or P9, but not necessarily the other way (some of the newer apps won't run on older phones). (The apps you list are all on the Play store, so you should have no problem.)", "time": "10-07-2016 07:30 AM", "replies": []}]}, {"postID": "post5471970", "text": "Hi,many thanks for your advice,I only found out by searching various sites that a lot of people stated the Note 3 was pretty bad at connecting to 4 g ( obviously I would assume now Not everyone has the problem)...I thought it was just me till I tried various friends sims in my phone and all struggled to get above 3mb download and when popped back into their own phones downloads varied between 33-46mb,that's when I searched and found numerous Note 3 users reporting bad 4g connections,but hopefully you seem like one of the lucky ones ,so as I said I wanted some assurance on the Apps installation before I change phones and appreciate your reply and any others that can advise to,thank you.", "time": "10-07-2016 08:06 AM", "replies": []}]}, {"title": "Whatsapp notifications only when app is launched", "thread": [{"postID": "post4669788", "text": "Guys , my whatsapp notifications never show up if mobile is not touched for about 10 min. only when i launch the application after, all the notifications show up. they keep on showing until ,again , mobile is left for 10 or more minutes.\ni have tried almost all the settings etc. please guide.", "time": "09-08-2015 04:21 AM", "replies": []}, {"postID": "post4729896", "text": "did you get any solution?", "time": "10-05-2015 06:37 AM", "replies": []}, {"postID": "post4729992", "text": "Well sort off. \nmaybe i turned a service off or something , that is why it did that\nSo i did factory reset and it started working.", "time": "10-05-2015 07:50 AM", "replies": []}, {"postID": "post4860501", "text": "hello I solved putting WhatsApp app as protected, then going to save battery app with excessive consumption in the background, and click on WhatsApp and menu opens. I activated the buttons activation system and continues running after shutdown, and I cleared reminder intense consumption.\nSorry for my bad bad English", "time": "11-27-2015 04:08 PM", "replies": []}, {"postID": "post5440591", "text": "Thank you for helping me.", "time": "09-22-2016 09:30 PM", "replies": []}]}, {"title": "My phone can't find any available connections?", "thread": [{"postID": "post5222162", "text": "Since 2 days ago my Huawei phone can't find any wifi networks. It starts scanning, but nothing shows up, while other devices find at least 5-6 networks.\nDoes anyone know how to solve this?\nThanks!", "time": "06-13-2016 09:40 AM", "replies": []}, {"postID": "post5222186", "text": "You may need to do a factory reset on your phone if you haven't already.", "time": "06-13-2016 10:01 AM", "replies": []}, {"postID": "post5410383", "text": "Same to me, my huawei can't find any avaiable connection and i already do the factory reset but nothing change", "time": "09-11-2016 02:35 AM", "replies": []}]}, {"title": "Lock screen pull up quick launcher", "thread": [{"postID": "post5398784", "text": "Hi All  I've seen on video clips & photos the Lock screen pull up quick launcher having an additional row of short cuts, how do I get this? Is it in Settings,Themes or EMUI version? Many Thanks in Advance", "time": "09-06-2016 12:05 PM", "replies": []}]}, {"title": "Turn off fast photo", "thread": [{"postID": "post5224075", "text": "How do you turn off fast photo (pushing the volume down button twice), I take like 20 accidental pictures of my feet everyday. Thanks", "time": "06-14-2016 04:25 PM", "replies": []}, {"postID": "post5224428", "text": "Welcome to Android Central! I can't find it in the manual, but on my Nexus 6P (which is also made by Huawei), it's in Settings>Display (under \"Press power button twice for camera\"). Check there.", "time": "06-14-2016 09:17 PM", "replies": [{"postID": "post5225531", "text": "Thanks for the reply. However, there is no such option under Display settings on my P8.", "time": "06-15-2016 02:16 PM", "replies": []}]}, {"postID": "post5392629", "text": "Is there really no way to turn this off ?", "time": "09-04-2016 03:25 AM", "replies": []}]}, {"title": "Huawei P8 suddenly stopped working (Short circuit)", "thread": [{"postID": "post5358196", "text": "Hi everyone, \nA couple of days ago my Huawei P8 has suddenly stopped working. It just turned off, without falling or getting wet, or anything of that kind. The battery was almost full. \nI took my phone to one of the best labs in the zone, and after 3 days of checking it, they said its a short circuit that they can't find. They say it is weird cause the phone looks like new from the inside and everything is in place. \nDid someone had something like this? Is there any way to save the phone? and the memory inside it (Beside the Sim card)? \nThanks, \nTom", "time": "08-23-2016 09:44 AM", "replies": []}, {"postID": "post5360841", "text": "Welcome to Android Central! Although rare, these kinds of things can unfortunately happen to any phone, and the component involved can differ. It could be the Power button, the battery, or some circuitry on the motherboard. If they're certain that trying a new battery or replacing the Power button won't help, then I'm afraid you're stuck. Recovering data from a dead phone would probably require forensic data recovery specialists, who are not cheap.", "time": "08-24-2016 03:08 AM", "replies": []}]}, {"title": "P8 Lite Android 6.0 separate notifications/ringtone levels", "thread": [{"postID": "post5360768", "text": "Hi,\nnew owner of Huawei P8 Lite (B565) Android version: 6.0\nIs there any way to have separate levels of notifications / ringtone levels?\nAny apps that will work? (installed few without success)\nDo I need to root the phone and is it even possible to root this model?\nAny help much appreciated!", "time": "08-24-2016 02:29 AM", "replies": []}]}, {"title": "Why won't my Huawei P8 Lite boot?", "thread": [{"postID": "post4560987", "text": "I had my phone on and charging without the sim in it, but on WiFi so it would stay updated. Decided to switch back to it with my AT&T sim card. Turned it off, put the sim card in and then it wouldn't boot up. I took the sim card back out, same issue. Plugged it back in and no charge light is coming one. Tried powering it on while holding volume up key, then same while holding volume down key. Still nothing. Called support, they didn't try to help me fix it, just said they would send me a return label and to just send it in. Being a phone enthusiast who uses Android, Windows and Blackberry phones, I find it ridiculous that I can't do something to try and rectify the situation. Any suggestions?\nThanks, Johnny", "time": "07-18-2015 05:52 PM", "replies": []}, {"postID": "post4561558", "text": "Have you tried holding Power and Volume Up+Down for a minute or two? Up and Down together in other words, rather than Up or Down only.\nPosted via the Android Central App", "time": "07-19-2015 04:12 AM", "replies": []}, {"postID": "post4562112", "text": "Yes, I tried that also, still nothing. Will be sending it in Monday.", "time": "07-19-2015 12:55 PM", "replies": []}, {"postID": "post4593067", "text": "Hey, did you find a way to solve this ?\nMy p8lite doesn't boot anymore since it tried to OTA update...", "time": "08-06-2015 02:50 AM", "replies": []}, {"postID": "post5333412", "text": "Hey everyone. Well I had the same problem with Huawei P8 and the Sony Experia M2 (both phones are similar in design and build) and the fix was the same for both. You need to let the batter drain completely. And then and only then will the Flash EEPROM (Electric Eraseable Progamable Memory will flash itself. ) Or else it will loop over and over and wont allow a full reboot or a charge. Wait 1 week with out using it and you will see wala all is good. Also make sure you have a cable that is original or at the very least your phone charged with it and USB that you know never had issues with your phone. Some of you guys may have a imposter cable that is not recognized by the phone. The first sollution is a sure fix..", "time": "08-16-2016 06:33 PM", "replies": []}]}, {"title": "Cant access network settings (trying to enable roaming)", "thread": [{"postID": "post5305292", "text": "Model: P8\nCountry: UK\nNetwork Vodafone\nWhen I click on \"mobile Networks\" button, the screen freezes/goes slightly dark for a second and then just returns back to the same menu,\nI tried downloading a couple of apps which take you directly to the network settings menu but they react the same way, freeze/go slightly dark for a second and then back to the main screen.\nI'm only trying to enable the roaming, so if there are any other ways to just enable the roaming that would be great\nTried:\nResetting phone\nit is up to date and not rooted\nRemoving sim card and cleaning\nresetting phone again\nchecking with vodafone that roaming is allowed on my plan", "time": "08-06-2016 01:08 PM", "replies": []}, {"postID": "post5305679", "text": "After the factory reset don't setup the device - skip it. Also don't install anything. Go into the settings as the first thing and see if that works.", "time": "08-06-2016 05:00 PM", "replies": []}, {"postID": "post5311518", "text": "During the factory reset after the phone switches off i get a \"factory reset failed\" message come up and then after a restart, the phone behaves like it was properly restet with all the setup options occuring and all data gone, i skipped the options and tried the network settings and it acts exactly like it did before. I didn't install any apps or anything like that.\nedit: model number : GRA-L09", "time": "08-09-2016 12:23 PM", "replies": []}]}, {"title": "Notification Bar does not automaticaly switch to previous app if pressed", "thread": [{"postID": "post5308417", "text": "Don't know how this has stopped working.\nIf you keep the square icon on the notification bar pressed it should switch automatically to the previous app you were using. this is good for multi-tasking and you can quickly switch. \nProblem - if I keep it pressed, nothing happens. If I press it briefly I get the normal recent app list as normal. \nVery annoying and I cannot figure out what I have changed to stop this amazing feature. \nPlease help.", "time": "08-08-2016 04:33 AM", "replies": []}, {"postID": "post5308474", "text": "Which phone do you have? Did you have an update recently that could have caused the functionality to change?\nYou can try the basics:Rebooting the phoneClearing phone cache (reboot phone in recovery, wipe cache partion)\nThere are also some apps that provide the same functionality, this being the most popular one: https://play.google.com/store/apps/d...tcher&hl=en_GB", "time": "08-08-2016 05:49 AM", "replies": []}, {"postID": "post5308563", "text": "thanks for the response. I have a Huwai P8 and have done an update last week to V6 - EMUI 4.0.1 which did cause some issues with the \"Draw over other apps\" feature which a lot of people suffered with. I ended up doing clearing the phone and starting from scratch again which was frustrating. \nThe app switch feature was fine though after the update and worked. I was playing with various settings to tweak the phone, as you do, and then all of a sudden I realised it doesn't work anymore. \nI cleared the cache but its still not working.", "time": "08-08-2016 06:54 AM", "replies": []}, {"postID": "post5308734", "text": "That's unfortunate. If it stopped working after the EMUI update, that would most likely be the cause of the problem. I couldn't find any documentation to confirm it though.\nThe only other thing I can think of in terms of settings are launchers. Try changing it to see if the behavior of the recent apps button changes. Settings -> Apps -> Advanced Settings -> Default App Settings -> Launcher.", "time": "08-08-2016 08:44 AM", "replies": []}]}, {"title": "Action Launcher can't close recent apps", "thread": [{"postID": "post5303592", "text": "I recently installed Action Launcher 3 on my Huawei P8 and I have a problem with closing recent apps while using the launcher as my default launcher. For me to close recent apps I have to set the Huawei Home as the default close recent apps in that launcher for it to close.\nThis is problematic if an app crashes and I have to restart it. When I try to close it in Action Launcher and then open it again, it just resumes from where I left it. But if i do it from Huawei Home the app closes and I can reopen it.\nDoes anyone have an idea as to why this happens? Help will be much appreciated \nEDIT: I just found out that it's only when I try to quit all recent apps. It works fine when I quit them individually. But I still want to be able to quit all apps that are currently open from Action Launcher.", "time": "08-05-2016 03:08 PM", "replies": []}, {"postID": "post5304968", "text": "Have emailed the dev of the launcher?", "time": "08-06-2016 09:50 AM", "replies": []}]}, {"title": "P8 Lite Software Install stuck at 90%", "thread": [{"postID": "post5302681", "text": "Hi,\nI'm trying to unlock the bootloader so I can root my device, but with the phone plugged into the usb, it starts a software install (not sure what software it's installing). The only problem is the install gets stuck at 90%\nAll I see on my screen is a nearly complete blue circle, inside that there is a usb icon and 90% displayed. Underneath the nearly finished circle, it just says 'Huawei software installing', nothing else.\nI have tried unplugging the device and using the unlock command in command prompt but still, nothing happens.\nPlease help if you can,\nregards,\nfrustrated Huawei user", "time": "08-05-2016 09:01 AM", "replies": []}, {"postID": "post5303654", "text": "Moved to the P8 Lite forum.", "time": "08-05-2016 03:34 PM", "replies": []}, {"postID": "post5381932", "text": "I have the same problem. I followed this guide to root my Huawei p8 Lite. Step by Step guide to unlock bootloader and … | Huawei P8lite\nI running the script INSTALAR-ROOT-P8-LITE.bat. It was able to finish the step \"copy supersu\", but the phone couldn't reboot itself in the step \"adb.exe shell /sbin/recovery\". \nI aborted the script. Shut down the phone and press volume up, volume down and power button to reboot. The phone goes into \"Huawei software installing\" interface and stuck at 90%", "time": "08-31-2016 02:26 PM", "replies": []}, {"postID": "post5573850", "text": "same problem......", "time": "11-21-2016 03:44 PM", "replies": []}]}, {"title": "Huawei P8 Lite stuck in boot after update", "thread": [{"postID": "post5295622", "text": "I recently bought this phone and tried to update it with one of the Android 6.0 builds (the site I downloaded it from said it was an official one), so I put the files in the microSD, powered it off and started the updated, but after doing so the phone is stuck at the boot with the Huawei logo on it.\nIt keeps rebooting on it's own and even after I did a Factory Reset it still won't boot.\nIt also won't let me install a stock rom as the updater just says: \"Software install failed!\".\nMy phone is not rooted as I have no idea how to root a phone and I'm too scared of causing damages.\nAny way to solve this?\nI got the update files from here Download Huawei P8 Lite B581 Marshmallow Firmware [Single-SIM] [Europe] | Carbon Tesla\nThanks for your time.", "time": "08-02-2016 02:01 PM", "replies": []}]}, {"title": "EMUI 4.1 update for Huawei P8", "thread": [{"postID": "post5235390", "text": "I noticed last night there is a EMUI 4.1 update for my wifes P8 last night - have downloaded it but it appears to be a tar.gz file ( P8.kernel.[Android5.0]tar.gz ) ... what do I do with it now/how do I use it on the P8 phone to update the EMUI to 4.1 version on her phone? - if I try extracting it it just has an extension of .tar ( P8.kernel.[Android5.0]tar ) - so its not like an update.app that you put on the root of the SD card or anything like that.http://emui.huawei.com/en/plugin.php...=detail&mid=90", "time": "06-22-2016 01:05 PM", "replies": [{"postID": "post5235556", "text": "Was this an OTA update that showed up in the notification area of the phone? If it was then it should have downloaded and installed automatically. There isn't anything else you need to do to install it. If you downloaded the update from a website, or other third-party source then I would caution against installing it.", "time": "06-22-2016 02:52 PM", "replies": []}, {"postID": "post5281787", "text": "If you downloaded it from that link, it's not a firmware update, but only the \"Kernel Source Code\" - totally different things.\nHuawei have released a Marshmallow (Android 6.0 & EMUI 4) update for the P8 now - the \"Android5.0\" in the filename you downloaded kind of gives away the fact that this is not an update.\nCheck your phone internally for updates (like srkmagnus suggests) while it is connected to the internet: Settings > Update > Check for updates\nAlso open the HiCare app > Service tab > OS Upgrade Early Adopters\nAnd HiCare app > Me tab > Check for Updates", "time": "07-25-2016 12:30 PM", "replies": []}]}, {"postID": "post5281800", "text": "Duplicate post - please delete", "time": "07-25-2016 12:37 PM", "replies": []}, {"postID": "post5281810", "text": "Duplicate post - please delete", "time": "07-25-2016 12:44 PM", "replies": []}]}, {"title": "Huawei P8 - How do I disable the Islamic Calendar?", "thread": [{"postID": "post5231753", "text": "Phone displays Islamic Calender and cannot be switched off even when switching off all calendar options. \nWhen phone is connected to PC: File “F:\\.Calendar\\calendars\\calendar_list.xml” states Islamic Calendar, how do I update this to Australian / non-religious Calendar?", "time": "06-20-2016 07:42 AM", "replies": []}, {"postID": "post5273392", "text": "You can do it from settings just check it there", "time": "07-20-2016 02:26 AM", "replies": []}]}, {"title": "Why can't I play music through bluetooth or usb cable on my Volvo S40?", "thread": [{"postID": "post5242978", "text": "Hello Iv got a ne Huawei P8\nIv tried everything even different formats of the files (music) as i thought this was the problem. My Samsung worked 100percent, im really upset now iv tried everything Aux Cable but then says nothing is connected. I think its the phone or how i go about trying to play the music.\nIf there is any possible help would be greatly appreciated.\nTHank You\nx Long distance driver.", "time": "06-28-2016 09:33 AM", "replies": []}, {"postID": "post5243831", "text": "Welcome to Android Central! What model year is the S40? Is the car's stereo system the factory installed one, or aftermarket? Are you able to pair the phone successfully via Bluetooth? If so, go to Settings>Bluetooth, select the car system, and see if there is a Media Audio option. Make sure that's checked on. If there is no Media Audio option, then the phone can't connect to play music--this could a compatibility issue with either the phone or with the car stereo.", "time": "06-28-2016 09:13 PM", "replies": []}]}, {"title": "Huawei P8 UK warranty - are they replacing the screen or the entire phone?", "thread": [{"postID": "post5219887", "text": "Hi,\nI’m rocking my P8 from a few months now (I bought it from Carphone warehouse) and I noticed two problems with the display. First – there’s a brighter spot (0,1x0,1” or 2x2mm) clearly visible with white background like browser or settings menu. Second – it’s not exactly flat. Glass is slightly dented near the bezels, dents are clearly visible while looking at something using the glass as a mirror. I heard that quite a lot of people have this issue and it’s impossible to use protective glass right now because it simply won’t stick. Anyonelne has this issue? How’s Huawei’s service? Do they replace the screen or the entire phone? Do they still have spare P8s? (I’m a little bit optimistic here because I heard the LG ran out of replacement G3s and they were giving out the G4s). Thanks.", "time": "06-11-2016 11:10 AM", "replies": []}]}, {"title": "How to remove navigtion menu hovering button", "thread": [{"postID": "post5207099", "text": "Today, when i openend my Huawei p8 lite mobile phone (Apex launcher) a movable Button showed up. When clicked upon it opens a round menu with the Same options i can find in my navigation bar.\nIt Bothers me and i would like to remove is. Any idea how to do this?", "time": "06-02-2016 03:33 PM", "replies": []}, {"postID": "post5207114", "text": "Welcome to the forums. Could you post a screenshot with this menu opened? What happens if you long press on the floating icon? Check in your settings the running apps and see what's on that list. Do you have any RAM manager or cleaner app installed in your phone?", "time": "06-02-2016 03:41 PM", "replies": []}, {"postID": "post5207248", "text": "Pressing it for a longer time gives no reaction, doens't look like it is a running app..", "time": "06-02-2016 05:25 PM", "replies": []}, {"postID": "post5207264", "text": "Thanks for registering! I translated that toast on your first pic and it looks like a RAM cleaner is running. It could be from an app that you downloaded or from some stock feature in your phone. Do you have any cleaner or RAM booster in your phone? Clean Master, DU booster or similar? Have you tried checking your running apps in the settings?", "time": "06-02-2016 05:40 PM", "replies": []}, {"postID": "post5207667", "text": "The only thing I use for RAM cleaning is the standard app that came with the phone.\nI checked my running apps and from the ones running it doens't like like this is because one of these (some standard android apps, messenger, whatsapp...)\nI've been wondering if this is a stock feature but i've been through all of my settings and can't find anything that may result in this.\nThank you for your time btw", "time": "06-03-2016 01:10 AM", "replies": [{"postID": "post5207829", "text": "Which app is it? Is this a particular app that came preinstalled or an option in your general settings?Yeah, there's a big chance that this floating icon is a stock feature. It's caused by an app or system process that pushes toasts in Dutch (it's Dutch, right?). In how many places have you been able to change the language?\nThere's an easy way to be sure. Boot your phone into safe mode. If the icon is still there it means that it's a stock feature (or any app that came preinstalled), if not then the culprit is a third party app that you downloaded.\nI've never used this particular phone so I'm not sure where to find this feature in the settings. I'll get in touch with the moderators and see if they can move this thread to the P8 forum where it'll be more visible for other owners.\nJust a last thought. Have you recently updated any app from the Play Store or received a system update?", "time": "06-03-2016 05:30 AM", "replies": []}, {"postID": "post5207829", "text": "Which app is it? Is this a particular app that came preinstalled or an option in your general settings?Yeah, there's a big chance that this floating icon is a stock feature. It's caused by an app or system process that pushes toasts in Dutch (it's Dutch, right?). In how many places have you been able to change the language?\nThere's an easy way to be sure. Boot your phone into safe mode. If the icon is still there it means that it's a stock feature (or any app that came preinstalled), if not then the culprit is a third party app that you downloaded.\nI've never used this particular phone so I'm not sure where to find this feature in the settings. I'll get in touch with the moderators and see if they can move this thread to the P8 forum where it'll be more visible for other owners.\nJust a last thought. Have you recently updated any app from the Play Store or received a system update?", "time": "06-03-2016 05:30 AM", "replies": []}]}, {"postID": "post5207849", "text": "Wait, wait! I think I found it \nGo to settings - smart assistance - floating dock - switch it off.", "time": "06-03-2016 05:57 AM", "replies": [{"postID": "post5208002", "text": "You are a lifesaver! Thank you very much", "time": "06-03-2016 08:37 AM", "replies": [{"postID": "post5208027", "text": "Hahaha! You're welcome, glad it helped! See you around the forums.", "time": "06-03-2016 08:56 AM", "replies": []}]}]}]}, {"title": "Huawei p8 lite", "thread": [{"postID": "post5177194", "text": "I recently purchased a HUAWEI P8 LITE and all was great until yesterday, my phone will only connect to wifi if it is next to the router and its very slow, I googled the issue and it appears others are having the same problem but I cant find a fix etc anywhere.\nThe phone has all its current updates, can anyone help ?\nthanks in advance", "time": "05-14-2016 11:28 AM", "replies": []}, {"postID": "post5177979", "text": "Welcome to Android Central! Moved this to the P8 lite forum (was originally in the P8 forum).\nHave you already tried rebooting your router, by unplugging its power for 10 seconds, then plugging back in? Also, see this guide: http://forums.androidcentral.com/amb...-problems.html", "time": "05-15-2016 01:17 AM", "replies": []}]}, {"title": "Mobile Network Settings Not Working", "thread": [{"postID": "post5072971", "text": "Hi Forum,\nI can't use my mobile network settings on my P8 and I can't remember if I never had that access or it happened during my rooting/customizing activities. If I click on the settings there only a network reset seems to happen and nothing more, i.e. no menu opens. There are a lot of mobile network setting apps and widgets in the Play Store but all apps I tested show the same failure.\nI have a GRA-UL00 B180 C433. Meanwhile I also had flashed C470B180 but that didn't solve the problem.\nFor the moment my phone is running fine and I don't really miss the settings. But I have no access to the data roaming setting either and that might cause trouble when I will be travelling abroad. \nAny ideas?", "time": "03-20-2016 01:03 AM", "replies": []}, {"postID": "post5084265", "text": "Solution is here: Problem to install TWRP to the Huawei P8 with Mac OS X. - Page 3", "time": "03-25-2016 01:10 AM", "replies": [{"postID": "post5151803", "text": "I have the same problem with my P8, but mine is not rooted and it is the version GRA-L09B900C170. Anyone has a fix to it?", "time": "04-29-2016 01:03 AM", "replies": []}]}]}, {"title": "Issues moving big files into my P8", "thread": [{"postID": "post5146474", "text": "I plugged my p8 ascend with usb cable (huawei cable) to the pc (tried usb2 and usb3) to transfer an archive of 1.2gb but after a few sec, an error show up telling me that the device was disconnected, and so it is. Why it appens,and there is a way to do this?", "time": "04-26-2016 03:04 AM", "replies": []}, {"postID": "post5147398", "text": "Welcome to Android Central! Have you tried different USB cables or different USB ports? Make sure you're using a native port on the computer, not a hub.", "time": "04-26-2016 01:39 PM", "replies": []}, {"postID": "post5147717", "text": "USB can't handle a file transfer of that size (and hubs make it even worse). Use WiFi File Transfer instead.", "time": "04-26-2016 04:01 PM", "replies": []}]}, {"title": "Cellular connection when on wifi", "thread": [{"postID": "post5131405", "text": "I have a new P8 and it's my first huawei phone. I'm having a strange issue. When I'm connected to wifi, I get the \"3G\" logo and call quality is terrible. If I disconnect from wifi, I immediately get 4G and call quality is perfect. My other phones never even showed a cellular connection while on wifi and it was always 4G but for some reason I'm getting 3G while on wifi.", "time": "04-17-2016 11:14 PM", "replies": []}, {"postID": "post5131415", "text": "I don't own a P8, but I'll give my best answer.. When connected to Wifi, without wifi calling enabled, the only thing the wifi is handling is the data and not the voice. This is why, I suspect, you see the drop to 3G while on wifi. I'm not sure if the P8 has wifi calling, but it does help tremendously in my house to enable it, as I live in such a poor signal area.", "time": "04-17-2016 11:32 PM", "replies": []}, {"postID": "post5131422", "text": "I've got great signal in my house; full bars. I'm not aware of WiFi calling on the P8.", "time": "04-17-2016 11:53 PM", "replies": []}]}, {"title": "Calendar notifications Huawei P8", "thread": [{"postID": "post5122452", "text": "I am using the standard Huawei Calendar app. Somehow I am not able to set a ringtone for my calendar notifications, nor do any notifications for my meetings show up ever. When I go to settings and turn notifications for reminders on, the ringtone option stays grey (cannot set it different). Can anyone help me?", "time": "04-13-2016 09:57 AM", "replies": []}, {"postID": "post5124313", "text": "Welcome to Android Central! Open the Calendar app, tap Menu>Settings, and look through there for an option to set notifications.", "time": "04-14-2016 03:04 AM", "replies": []}]}, {"title": "Why does my new Huawei P8 battery drain so fast?", "thread": [{"postID": "post5077958", "text": "So today I got the huawei p8, absolutely gorgeous phone by the way, \nwhen i turned on the phone for the first time it was at 51 percent, this very very quickly went down,like it took 30 minutes of very little use, is this normal ? will the battery be okay when i fully recharge ? \nalso was it a good choice upgrading to the p8 from my huawei ascend g7? (just curious on your opinions)", "time": "03-22-2016 02:10 PM", "replies": []}, {"postID": "post5078035", "text": "Give it a few days to settle. Generally with new phones there are updates, and all sorts of services connecting combined with all the apps you are installing, plus you fiddling with your new shiny phone getting things set up the way you like. A couple of charges and you should be good.", "time": "03-22-2016 02:51 PM", "replies": []}, {"postID": "post5114225", "text": "If you are still facing battery draining problems on your P8 then here is a great resource to check out: Huawei P8 Battery Drain Problems & Fixes. Best of luck!.", "time": "04-09-2016 07:22 AM", "replies": []}]}, {"title": "My Huawei P8 is stuck in headset mode, how can I get out of it?", "thread": [{"postID": "post5112538", "text": "my phone huawwei P8 stuck headset mode permenent", "time": "04-08-2016 09:50 AM", "replies": []}, {"postID": "post5112879", "text": "Welcome to Android Central! Use a can of compressed air to blow out the headphone jack, and root around there with a toothpick to make sure it's clear of debris. If it's clear and the problem persists, then the jack is probably faulty, and needs to be replaced. You could try a factory reset first, but if the problem persists, then it's most likely a hardware problem.", "time": "04-08-2016 12:40 PM", "replies": []}]}, {"title": "p8 Themes menu", "thread": [{"postID": "post4862771", "text": "how do i get the themes option ? one of my friend has p8 and when i click on themes icon it says \"featured\" \"top\" \"category\" and \"more\" at the top whereas mine is standard with only \"themes\" written at the top.\nHe can search for more themes online while i have to put themes in to the folder manually. how does it work ? i have attached both screens to make it understand better", "time": "11-29-2015 02:12 AM", "replies": []}, {"postID": "post4862843", "text": "I actually have the exact same problem... Asked around and couldn't get an answer for this.\nPhone only shows local themes and no option to get more...?", "time": "11-29-2015 04:46 AM", "replies": []}, {"postID": "post4862871", "text": "Exactly. It only shows local themes.\ni copied the exact same files of the other p8 phoneto my phone HW Themes folder but still the same.\ni am surprised i couldn't find anything relating to this anywhere on the internet", "time": "11-29-2015 05:15 AM", "replies": []}, {"postID": "post5092031", "text": "Any updates on this?\nThanks in advance.", "time": "03-29-2016 05:40 AM", "replies": []}, {"postID": "post5107489", "text": "Mine doesn't have those tabs too when I bought it. When I inserted a sim it asked for access to IMEI and my HiCloud ID, I granted and the themes app refreshed with new themes and the categories.", "time": "04-06-2016 12:15 AM", "replies": []}]}, {"title": "Apps in SD card not updating through Play Store. Error 963. Huawei P8. Any Help?", "thread": [{"postID": "post4991074", "text": "Hi!\nThis is the issue: I moved some apps in the SD card and, while at first I didn't have any problems, one day only the apps stored in the SD card won't update and give me error 963 (while the apps on the phone update just fine). Then of course, if I move the apps back to the phone, they update successfully, but the point is that I would like to keep them in the SD card... \nOther courious fact: if I update one of these apps through the Huawei store (Hi App), the update is successful (but this store doesn't have all the apps I need...).\nDoes anyone know a solution?\nHope I've been clear enough,\nTommaso", "time": "02-10-2016 09:21 AM", "replies": []}, {"postID": "post4991375", "text": "You have to move them back to the phone to update them. Play Store doesn't handle chopped apps (the app isn't moved to the SD card, small pieces of it are.) Android was never designed to run apps from the SD card, so the play store app wasn't designed.to update them there.", "time": "02-10-2016 12:47 PM", "replies": []}, {"postID": "post4992402", "text": "Hi, I'm the guy who posted the question.\nThank you for your answer, if that's the only solution, I'll do what you say, but it still remains unclear why for some time the apps updated smoothly and then suddenly they stopped...\nThank you anyway for your answer!\nPosted via the Android Central App", "time": "02-11-2016 03:48 AM", "replies": []}, {"postID": "post5018059", "text": "Thank you for the answer, and for the lucid explanation. \nI do wonder, however, why updates have been completing successfully for many months, including apps that I have \"moved\" to the SD card. And in just the past 2-3 weeks updates have been failing. .. And... I hope Google eliminates this limitation of Android, otherwise the utility of the SD card is severely reduced. Meantime, we must limit our apps to the space available on device storage .. aargh.", "time": "02-26-2016 02:06 PM", "replies": []}, {"postID": "post5064574", "text": "I have the same issue - the apps will only update if I manually move them back to device storage. Just started happening a couple weeks ago. Did an Android update come out around that time? I'm stuck with this phone (Galaxy S5) until November so I can't just get a new phone with more internal storage. I have submitted an email through Play Store feedback, but haven't received a response. Very annoying!", "time": "03-16-2016 09:11 AM", "replies": []}]}, {"title": "Automatically sort app icons alphbetically?", "thread": [{"postID": "post5026616", "text": "Is there anyway to sort the apps on your phone automatically?\nI like to have them sorted that way, so when i download a new app and it's at the end of all my screens, i can move it to where its supposed to be alphabetically . However if i do this on a p8, it doesnt work. So i have to move individual icons back one space (starting from the end) to let my new app slot in.\nis there anyway to sort them alphabetically automatically? IIRC on some phones you just have to shake it and it does it for you", "time": "03-01-2016 10:58 PM", "replies": []}, {"postID": "post5026639", "text": "What launcher are you using?", "time": "03-01-2016 11:12 PM", "replies": []}, {"postID": "post5044240", "text": "Stock OEM launcher", "time": "03-08-2016 09:03 PM", "replies": []}, {"postID": "post5044310", "text": "Well, I know that the Google Now launcher will automatically alphabetize apps and I think (it's been awhile since I tried it) that Nova Launcher will as well. Try them and see what you think.", "time": "03-08-2016 09:34 PM", "replies": []}]}, {"title": "Connecting to a Mac", "thread": [{"postID": "post5040028", "text": "I have a P8 and want to back up my pix on to my iMac. Tried Android File Manager but 'no device' found. Tried several others, only Coolmuster picked up my P8. But that infected the f*** outta my Mac. So, back to square one.\nNeither of my Macs will detect it. Any ideas?\nOr is there another way round the pic back-up issue? (Have tried to download Dropbox app onto phone but not enough space....)", "time": "03-07-2016 01:38 PM", "replies": []}]}]
[{"title": "No correct notifications on lock screen. on P8", "thread": [{"postID": "post4988802", "text": "has anyone had the \"problem\" where you use the stock SMS app/Whatsapp and get a new message, only a speech bubble is seen on the lock screen. There's no text or anything of the message.\nSimilar problem with 3rd party SMS apps – dont even get a notification on the screen, just the status bar.\nSame situation as other apps as well (Facebook/Ebay etc)\nall situations, i've got all notifications turned on in settings (sound, status bar, lockscreen).\nLooks like i'm only getting notifcations by sound and on the status bar (hence i'm missing a lot of notifications since i'm not hearing/seeing them)\nis it because i'm still on an old firmware? Or how Huawei have done notifications?\nThere's nothing found to update to a new one....", "time": "02-08-2016 09:57 PM", "replies": []}, {"postID": "post5003517", "text": "Under Options -> Lockscreen and passwords, did you check the option \"show detailed info\"?\nPosted via the Android Central App", "time": "02-19-2016 01:37 AM", "replies": []}, {"postID": "post5012111", "text": "I cant even find that option", "time": "02-23-2016 04:43 PM", "replies": []}, {"postID": "post5021532", "text": "I took a screenshots of the steps you need to follow in your settings, it's in Dutch but the icons should be the same.\nPosted via the Android Central App", "time": "02-28-2016 05:07 PM", "replies": []}, {"postID": "post5024231", "text": "interesting.\ni get different options to your screenshots", "time": "02-29-2016 10:55 PM", "replies": [{"postID": "post5028425", "text": "Do you already have EMUI 4.0?", "time": "03-02-2016 05:21 PM", "replies": []}]}]}, {"title": "Huawei P8 intelligent Wi-Fi+ not working anymore, what could the solution be?", "thread": [{"postID": "post5025283", "text": "Hello everyone,\nSince a few weeks I'm in the possession of a Huawei P8. At first the Wi-Fi+ function worked perfect. When Wi-Fi was turned off, it would turn on automatically when I was in the vicinity of a known network. Unfortunately since a few days it seems to not work anymore. Does anyone else ran into this problem and perhaps knows a solution?\nThanks!", "time": "03-01-2016 11:27 AM", "replies": []}]}, {"title": "Gmail is missing from the notification center", "thread": [{"postID": "post5022309", "text": "hi,\ni do get notification from gmail on new emails, i hear a ring and see the gmail icon on the status bar.\nthe thing is that i don't see any visual notification when the screen is off. i know this can be set through the notifications center, but even though gmail app is installed it's missing from the list on that menu so can't set it up.\nby the way, all other settings was already made (gmail app settings for notifications & manage apps - gmail was set to be kept on at all times)\nany ideas on that ?", "time": "02-29-2016 03:20 AM", "replies": []}]}, {"title": "Laptop not connecting with P8", "thread": [{"postID": "post5014791", "text": "I have connected my P8 with my laptop and downloaded Hisuite but I cannot get them to connect. In my device manager the us a HUAWEi driver missing and I tried to search online to update but it fails", "time": "02-24-2016 10:49 PM", "replies": []}, {"postID": "post5016053", "text": "Welcome to Android Central! HiSuite should have installed the latest USB drivers. When you connect and swipe down the notification panel, do you see a USB icon? If so, tap it and select MTP.\nIf you don't see it, then try a different cable.", "time": "02-25-2016 01:47 PM", "replies": []}]}, {"title": "Huawei p8 - How can I get a dissappeared browser widget back on the home screen?", "thread": [{"postID": "post5015198", "text": "I am touching and holding a blank area on the home screen. The widgets option menu appears. However, I am not able to find the net browser widget to select an drag to the home screen. Help!?", "time": "02-25-2016 07:09 AM", "replies": []}, {"postID": "post5015935", "text": "Welcome to Android Central! Are you talking about an actual widget (i.e., one that shows your various bookmarks, and allows you to tap one to open the browser automatically to that page), or the shortcut icon?", "time": "02-25-2016 01:00 PM", "replies": []}]}, {"title": "No Hebrew language listed within the languages under Google Keyboard Settings on my Huawei P8", "thread": [{"postID": "post5012993", "text": "recently I bought the device, and even after updateing the google keyboard app, hebrew language isn't there.\nthx", "time": "02-24-2016 05:28 AM", "replies": []}, {"postID": "post5013864", "text": "Moved to the P8 forum.", "time": "02-24-2016 01:17 PM", "replies": []}]}, {"title": "no sound when i send a message with whatsapp and not only ,help ?", "thread": [{"postID": "post5011250", "text": "Hi\ni have noticed that with this settings\nin the preferences -> audio -> if i disable-> touch sounds\ni can't get any sound sending a message with whatsapp\ndoes somebody have the same issue?\nthanks", "time": "02-23-2016 10:31 AM", "replies": []}, {"postID": "post5011478", "text": "Are you talking about the system settings, or the WhatsApp settings?", "time": "02-23-2016 11:54 AM", "replies": []}]}, {"title": "Huawei P8 -call voice broken issue", "thread": [{"postID": "post4989159", "text": "Hi all\nMy Huawei P8 ,While calling I can hear but the person from other end can't hear some seconds and again he can hear the sound .its repeating every 1 minutes.\nI would be thankful to someone to give a solution for this problem .", "time": "02-09-2016 05:31 AM", "replies": []}]}, {"title": "help me the notification is always black", "thread": [{"postID": "post4971488", "text": "hi\ni have 2 problems\n1) my notification is always black , and i have problem to read it , my phone is european , single sim , came with android 5.0.1 and it's black\n2) second problem , when i send a message in whatsapp , there is not sound , on all my device , when i send a message i have a sound like hitting a tennis ball\n3) the audio player does not play aac audio files , in short mp4 (itunes audio files ) and there is no way to have the lyrics \ni tried to save lrc files with the same name of the song , but nothing\ncan you please help me?\nthanks", "time": "01-29-2016 02:53 AM", "replies": [{"postID": "post4979804", "text": "Welcome to Android Central!\nHave you tried doing a factory reset to see if that fixes the issues?", "time": "02-03-2016 07:46 AM", "replies": []}]}]}, {"title": "How do I upgrade my Huawei P8?", "thread": [{"postID": "post4954728", "text": "Hello Experts,\nJust bought a Huawei P8 which has software version GRA-L09V100R001C469B111. Googling makes me think it is an old version of software due to the last 4 digits of the build (B111), but I have not found a clear way to upgrade the telephone. \nThe Updater utility does not find any available upgrade. So, I would like to know if I can upgrade it to the latest version and how. Should I do it in steps, meaning loading different versions of software until I reach the last one? Or I could directly install the last one? Any way, where could I find those versions?\nThanks,\nRafael", "time": "01-18-2016 07:02 AM", "replies": [{"postID": "post4954935", "text": "If the update utility doesn't find an update, then there is no update available for the phone. The thing is with device manufacturers, they tend to add a customized user interface (UI). So when Google releases a new version of Android, it's up to the device manufacturer to decide if they are going to upgrade their custom UI to work with the new version of Android. If the device is fairly new, then chances are it will eventually get the update. But the older the device is the less likely it will ever see another update.\nWhat you want to look for is the date of manufacture of the hardware itself, not the software. Like I said before, the older it is the less likely you'll see an update anytime soon if ever. The best advice I can give is contact the manufacturer and see if an updated Android is in the works or not.", "time": "01-18-2016 09:44 AM", "replies": [{"postID": "post4957415", "text": "Where would find the date of manufacture on my P8? I know theres a beta version of marshmallow you can install on our p8's if you wanted to, Dam i wish i knew how to install it on my phone :-( I looked to tuturials but can't find nothing.", "time": "01-19-2016 07:08 PM", "replies": []}]}]}, {"postID": "post4954873", "text": "Unfortunately you can't update. Once there is an update you'll be notified to accept the ota via the phone.", "time": "01-18-2016 09:14 AM", "replies": []}, {"postID": "post4960801", "text": "There is a big thread on XDA about installing the marshmellow update. You need to update to b200 first then to the latest one. Works on all GRA-l09 as far as I know. You copy the update to your SD card in a special created folder then the utility picks it up.\nIm on B140 and was tempted to try this but there isnt a great deal of help available if anything goes wrong unlike for the galaxy series etc so Im just going to wait for the OTA.", "time": "01-21-2016 07:34 PM", "replies": [{"postID": "post4962520", "text": "Yea I'm gonna wait to,like you said if anything goes wrong i wouldn't know what to do lol.", "time": "01-22-2016 09:04 PM", "replies": []}, {"postID": "post4969589", "text": "That's if it ever comes\nPosted via the Android Central App", "time": "01-27-2016 06:45 PM", "replies": []}]}]}, {"title": "Smart cover quirk", "thread": [{"postID": "post4948052", "text": "Hi guys\nDoes anyone use a smart cover? I got a Nillkin one which is really nice and works fine apart from one major problem. Touch is not registered through the glass screen so I cannot change clocks, answer calls or anthing.\nIve double checked settings for this and cant understand why it wont work when everything else about it does such as the auto wake when opened and the clock in the window etc.\nAnyone else have anything similer?", "time": "01-13-2016 03:58 PM", "replies": []}, {"postID": "post4957809", "text": "I bought a knockoff smart cover, and this doesn't happen to me. Touchscreen works when the cover is closed. \nMaybe if you can try another smart cover or reset the software?", "time": "01-20-2016 01:00 AM", "replies": []}]}, {"title": "Phone Storage issue in Huawei P8 Max, why is it showing that I have less on my Laptop?", "thread": [{"postID": "post4957768", "text": "Huawei P8 Max has got Phone Storage Capacity - 8 GB but when connected to laptop through USB, it shows only 1 GB size in Laptop.\nPlease give inputs to sort this issue.", "time": "01-20-2016 12:24 AM", "replies": []}, {"postID": "post4957781", "text": "Welcome to Android Central! Show us the Settings>Storage menu: http://forums.androidcentral.com/amb...d-central.html. Is the Internal Storage partitioned into an App Storage area and an Internal SD area?", "time": "01-20-2016 12:36 AM", "replies": []}]}, {"title": "How is battery life on the Huawei P8?", "thread": [{"postID": "post4955579", "text": "Whats everyone getting?\nMy one is on 5.0 currently and started off quite good getting 48hours with 4 on screen but it has developed some Google play service bug now where this is using far and away the most battery. A factory reset resolved for a few days but its back again. I have disabled location reporting etc to no effect.\noff the charger at 730am and back on about 10pm 1hr sot and im in the 40-50% range now. uses about 8-10% overnight if left.\nThis sound comparable to anyone else or do I have a real problem here?", "time": "01-18-2016 05:52 PM", "replies": []}, {"postID": "post4957408", "text": "I just got mine two days ago so i can't answer you question, Im not a heavy user so I'm hoping my battery will last me the day!", "time": "01-19-2016 07:01 PM", "replies": []}]}, {"title": "Wich Huawei P8 color you like the most?", "thread": [{"postID": "post4369127", "text": "", "time": "04-18-2015 10:45 AM", "replies": []}, {"postID": "post4500059", "text": "Hey Belgian Guy!\nAlthough you have stated the correct colour schemes for the Huawei P8, the Carphone Warehouse in the UK have gone and put a spanner in the works!\nInstead of calling the mystic champagne model by its official name, they've decided to go with Huawei P8 White, probably because they have the exclusive launch for contract deals for this colour.\nIt's a little confusing for UK customers as it also has a light gold frame so could be mistaken for the gold Huawei P8 instead!\nThey've released their 'white P8' on EE, O2 and Vodafone deals as well as their own new network; iD Mobile which was previously Talk Mobile... \nThey've also launched a range of upgrade prices for customers wanting to upgrade to the white Huawei P8 whilst keeping their existing network and mobile number.\nAll said and done, and in answer to your poll, I prefer the mystic champagne edition Huawei P8 over the other colours", "time": "06-17-2015 09:00 AM", "replies": []}, {"postID": "post4507325", "text": "The mystic champagne is just the right tone of yellow not to get vulgar yet not to be to close to anonymously plain white. My vote goes to this colour!\nSkickat från min HUAWEI GRA-L09 via Tapatalk", "time": "06-21-2015 04:21 AM", "replies": []}, {"postID": "post4508025", "text": "Andrew Ramsey1,\nYeah, I bought my P8 in Belgium and indeed, they name the Mystic Champagne color 'gold' here. Probably it's a contract deal indeed \nI got a Titanium Grey one, I like the color alot. If I was a female I would have taken the mystic champagn to haha, but I prefer Titanium Grey as a male \nThe gold color is to overwhelming I find and the black is not visible enough, it makes the P8 not look that sharp.\nBut I understand why you prefer the Mystic Champagne, it looks very good and you see more difference compared to other smartphones.\nI wish more people would answer the poll haha.", "time": "06-21-2015 12:05 PM", "replies": []}, {"postID": "post4508029", "text": "gerhardw,\nGood choice, I prefer the grey, but the Mystic Champagne is my second favorite", "time": "06-21-2015 12:07 PM", "replies": []}, {"postID": "post4552888", "text": "I wanted the black one, but all they had was mystic champagne, so that's what I ended up with.", "time": "07-14-2015 09:30 AM", "replies": []}, {"postID": "post4954397", "text": "Grey, because i wasn't able to get black! lol", "time": "01-17-2016 10:31 PM", "replies": []}]}, {"title": "How can I reopen a forced closed app on my HuaweiP8?", "thread": [{"postID": "post4947034", "text": "I accidentally forced shutown a preinstaled app on a Huawei P8 and I don't know how I can reopen it. I restart the phone but with it's useless.\nthank you", "time": "01-13-2016 03:58 AM", "replies": []}, {"postID": "post4947037", "text": "Did you force closed the app or disable the app? FC an app doest take it off your device, it just makes it close out of RAM and stops the process it's doing. \nWhat app is this referring to?", "time": "01-13-2016 04:02 AM", "replies": []}, {"postID": "post4947069", "text": "I forced closed the app, not disable. It app Labels. \ntks", "time": "01-13-2016 04:43 AM", "replies": []}]}, {"title": "Merge contacts P8 Lite", "thread": [{"postID": "post4941797", "text": "I get lots of texts from a service which has 8 numbers, depending on which sub-service is sending the text. I have named all of these numbers the same.\nMy Contacts has all 8 numbers listed individually. I should be able to merge them, but Settings -> Merge duplicate contacts doesn't do it. Says there are no duplicates. Is there any way to do it manually?", "time": "01-10-2016 02:40 AM", "replies": []}]}, {"title": "Aiuto!! Sto impazzendo!!!!", "thread": [{"postID": "post4922221", "text": "Ragazzi il mio cellulare un huawei p8 lite non si connette più alle reti wifi anche se ha casa ho la rete wifi attiva e ci sono connesso con il pc, il p8 lite non la rileva proprio qualcuno mi puo dire per favore cosa devo fare? Vi prego sono sconvopto ho provato tutto,perfino a ripristinare le impostazioni di fabbrica cosa posso fare? AIUTO!!!!! 😢😢😢😢😢😢😢😢Ripeto sono sconvolto non so cosa fare!!! 😢\nPosted via the Android Central App", "time": "12-29-2015 03:45 PM", "replies": [{"postID": "post4922235", "text": "Hai provato a fare tutti i wipe anche da recovery?", "time": "12-29-2015 03:50 PM", "replies": []}]}]}, {"title": "Is it worth getting a Huawei P8 and putting on a custom ROM?", "thread": [{"postID": "post4406971", "text": "Hi,\nI (now) live in Europe and am considering the P8. Its camera and the breadth of LTE bands would be a good match for my uses, and the hardware review seems impressive.\nBut the reports about the ... quirks ... of the P8's software are disturbing, as I'm quite happy with Android 5.\nBased on experience with previous Ascend models, will it be easy to root the P8? Is there much of a developer community? And will I lose any of that nice hardware functionality (especially the camera) is I install a custom ROM?\nDoes the company care about the non-Asian market enough to want to do (or at least support) a more conventional-Android experience?\nIf this doesn't work out I just might wait for the OnePlus 2.\n(Any chance answering this on the podcast? I'm an avid listener, just not in real-time.)", "time": "05-05-2015 03:22 AM", "replies": []}, {"postID": "post4433719", "text": "I just bought one with that intention. But seems a bit scares for guides and roms for it just yet :P\nBut the Huawei Launcher is pretty horrible i can tell you that already. \nBut its rarely a problem to root and install custom roms for high end phones in my experince.\nIll give it a week or 2 for some to post guides and roms on XDA developers. seeing as it was just released as faar as i know.\nBut if you like ill keep you updated \nBut seeing how much access you have to files from the factory ! I Dont think it will be a problem.", "time": "05-18-2015 01:31 PM", "replies": []}, {"postID": "post4446941", "text": "Why wud you do it ?\nIt is great phone and soft is solid.. you cna call ,sms , surf ,email.. what such middle aged man wants more from phone??", "time": "05-25-2015 03:38 AM", "replies": [{"postID": "post4561191", "text": "You think middle-aged men are idiots or something? Middle-aged people grew up in the tech revolution, so they might want more than basic features. If they only had basic needs, an old, pre-smartphone Nokia might be all they need.", "time": "07-18-2015 09:05 PM", "replies": []}]}, {"postID": "post4449320", "text": "why would you not root an andorid?", "time": "05-26-2015 09:59 AM", "replies": []}, {"postID": "post4561282", "text": "I used to do all these things, but now I'm older I prefer stability over bleeding edge updates. My rooted phone with cyanogen crashed more than an old Windows pc, and a lot of the original functionality became buggy. \nRooting should only be done when you really want a feature that isn't available natively. \nSo far the only thing I'm missing in this phone is the double tap to wake.", "time": "07-18-2015 10:17 PM", "replies": []}, {"postID": "post4561441", "text": "The double tap to wake is present in the beta of the new firmware for the P8 that Huawei is currently testing. So it might just be present as an update in a not too far future!", "time": "07-19-2015 01:30 AM", "replies": []}, {"postID": "post4561887", "text": "That's nice. Just got an update today into build 150. Hopefully we'll get the 5.1 and double tap feature in the near future.", "time": "07-19-2015 10:05 AM", "replies": [{"postID": "post4562127", "text": "So, B150 for the P8? No sign of anything over B132 here in northern Europé with the GRA-L09. What region are you in? Or is it the GRA-UL00 or the GRA-UL10?", "time": "07-19-2015 01:08 PM", "replies": [{"postID": "post4567222", "text": "GRA-UL00. I'm in the Philippines.", "time": "07-22-2015 08:00 AM", "replies": []}]}]}, {"postID": "post4562118", "text": "Can also install a launcher, I have a P8 Lite and installed Nexus Launcher to bypass not having an Ap Drawer.", "time": "07-19-2015 12:58 PM", "replies": []}, {"postID": "post4567260", "text": "Ok, the dual sim version. Did you get double tap to wake up in the new firmware update?\nSkickat från min HUAWEI GRA-L09 via Tapatalk", "time": "07-22-2015 08:26 AM", "replies": [{"postID": "post4569562", "text": "Nope. Only stability updates and bug fixes for viber and line issues.", "time": "07-23-2015 12:05 PM", "replies": []}]}, {"postID": "post4920634", "text": "I have a question on the P8. Can I mover apps to the SD card???", "time": "12-28-2015 08:23 PM", "replies": []}]}, {"title": "My P8 mobile camera is upside-down, how can I right it?", "thread": [{"postID": "post4912132", "text": "the camera settings and taken photos are suddenly upside-down, can't change that and i have tried restarting the device. any ideas to correct it?", "time": "12-23-2015 04:52 PM", "replies": []}]}, {"title": "When will the Huawei P8 get the Lollipop update?", "thread": [{"postID": "post4716398", "text": "Hi ! Does anyone know when Huawei p8 receive 5.1 lollipop update ?", "time": "09-29-2015 11:04 AM", "replies": []}, {"postID": "post4716439", "text": "No idea. I'm also interested. I've had two updates so far, but it's still on 5.0.1. Updates are mostly viber fixes.", "time": "09-29-2015 11:25 AM", "replies": []}, {"postID": "post4716539", "text": "on my p8 have 5.0 !", "time": "09-29-2015 12:14 PM", "replies": []}, {"postID": "post4718332", "text": "Maybe it's because I've got the dual sim one.", "time": "09-30-2015 01:52 AM", "replies": []}, {"postID": "post4724338", "text": "Hi,\nMy \"big brother\" device, the P8max, received the 5.1.1 update 4 weeks ago, so it is surprising that the P8 has not been OTA updated from Huawei.\nScottyJavea\nPosted via the Android Central App", "time": "10-02-2015 01:01 PM", "replies": []}, {"postID": "post4729827", "text": "Does anyone know when exactly p8 will have lollipop update\nPosted via the Android Central App", "time": "10-05-2015 05:12 AM", "replies": []}, {"postID": "post4888159", "text": "No update yet\nPosted via the Android Central App", "time": "12-12-2015 02:36 AM", "replies": []}, {"postID": "post4888263", "text": "Guys! Have you see than it's possible to install the beta of marshmallow?", "time": "12-12-2015 05:47 AM", "replies": []}, {"postID": "post4891538", "text": "Hi guys, yesterday I have received OTA of Android Marshmallow. I have doing factory reset and now very well", "time": "12-14-2015 07:15 AM", "replies": []}, {"postID": "post4892008", "text": "How did upload the beta? And do you have the files or a link to download it? Please share\nPosted via the Android Central App", "time": "12-14-2015 11:48 AM", "replies": []}, {"postID": "post4903076", "text": "Hi, I haven't the file of beta, but on xda it's available. This is the discussion on xda http://forum.xda-developers.com/show....php?t=3268757", "time": "12-18-2015 10:33 PM", "replies": []}]}, {"title": "hauwei p8 lite update", "thread": [{"postID": "post4890205", "text": "dear sir when u released hauwei p8 lite lollipop5.1.1 update in gulf bcz samsung allready released few days be4 plz send me msg as soon as posible", "time": "12-13-2015 10:32 AM", "replies": []}]}, {"title": "change lock screen", "thread": [{"postID": "post4890073", "text": "Can someone help on how can I change my screen password. Under screen lock it doesn't give me the option to change password\nPosted via the Android Central App", "time": "12-13-2015 08:43 AM", "replies": []}, {"postID": "post4890082", "text": "What exactly do you see when you go to Settings > Screen lock & passwords > Password? Is the Password option greyed out?", "time": "12-13-2015 08:55 AM", "replies": []}]}, {"title": "P8 video recording with OIS, can I get some help?", "thread": [{"postID": "post4884921", "text": "Hi!\nI have problem when I tray recording video on my huawei P8. Whem I use OIS record I see some artefacts on screen. For sure it is not focus problem. it's look like hmmm.. hot air ( it goes to front of camera) leaked from something during very cold day.", "time": "12-10-2015 12:14 PM", "replies": []}]}, {"title": "How can I recover removed notifications on my Huawei P8?", "thread": [{"postID": "post4853566", "text": "Sometimes I accidentally swipe too quickly in my notification bar and erase some messages that I actually want to 're-see'. Does anyone know how I can recover these?\nThank you in advance.\n- Will", "time": "11-24-2015 03:59 AM", "replies": []}, {"postID": "post4866650", "text": "Hi Will, when you remove the notification you don't delete the message, or at least that's my experience of it. Can you not find the message or email?", "time": "12-01-2015 02:45 AM", "replies": []}, {"postID": "post4884897", "text": "Hi!\nI had this same issue. You should go to application and find app caled \"phone manager\" . Then you must clean data and here you go \nRegards", "time": "12-10-2015 12:01 PM", "replies": []}]}, {"title": "Camera mate s", "thread": [{"postID": "post4869085", "text": "Hi everyone, do you think it will it be possible to install the camera of mate s on p8?", "time": "12-02-2015 05:41 AM", "replies": []}]}, {"title": "P8 and stock email app not \"pushing\"", "thread": [{"postID": "post4864293", "text": "Hi Guys\nBought this phone the otherday and so far its great except for one issue. I am loving the stock email app as it looks great and is very fast compared to say Bluemail.\nProblem is my emails dont come in (one exchange one a home imap and one hotmail) unless I open the app and refresh the sync. I am sure this is because the app is being closed when the screen is off so first thing to do would be to set it to \"protected\" in protected apps right? except the stock email app is not listed in here.\nThere is nothing else I can find that might help with this. The exchange account seems to work ok when im on the work Wifi and this one has an option to always sync over wifi where as the others dont.\nI have them set to sync \"never\" which im guessing is push as there is no other option for that.\nHas anyone else run into this? im struggling to find much online regarding it although there is lots of mention of other apps not notifying....", "time": "11-29-2015 10:33 PM", "replies": [{"postID": "post4864480", "text": "Hi, I do you an very \"stupid\" question, have you put setting email for 3g/4g connection?", "time": "11-30-2015 02:01 AM", "replies": []}]}, {"postID": "post4864497", "text": "Yea everything is set correctly. I have mobile data always on and this allowed for email. If I install bluemail it works ok\nStock app only syncs exchange when on wifi or others when I open the app and refresh them manually\nSo annoying. Im on 5.0\nPosted via the Android Central App", "time": "11-30-2015 02:32 AM", "replies": []}, {"postID": "post4864571", "text": "Sorry, but I haven't this problem. I don't know the possible solution if all setting are correct", "time": "11-30-2015 04:26 AM", "replies": []}, {"postID": "post4865837", "text": "Ok an update on this.\nI have discovered that exchange accounts can be set to sync automatically(push) but IMAP accounts dont have this option. They do in third party clients just not the emiui 3.1 one it would seem which sucks.", "time": "11-30-2015 04:24 PM", "replies": []}]}, {"title": "Which has better camera p8 or honor 7?", "thread": [{"postID": "post4709391", "text": "Which has better photoes specially at low light conditions? The p8 or honor 7?", "time": "09-26-2015 06:47 AM", "replies": []}, {"postID": "post4709400", "text": "The P8 has a better camera under low light conditions, in my opinion, as it has real OIS. I have used both P8 and H7. In bright light I Think that the H7 has better detail. H7 has 20 MP vs. P8 13 MP.", "time": "09-26-2015 06:57 AM", "replies": []}, {"postID": "post4860560", "text": "but the p8's camera is very good for every photo. It's very detailed in macro and nocturnal", "time": "11-27-2015 04:53 PM", "replies": []}]}, {"title": "How can I fix an email problem in my Huawei P8?", "thread": [{"postID": "post4858231", "text": "i have the huawei p8 , the gmail works good with my pop3 mail setting , but when i try to use the mail from huawei p8 , it tells me that the pop3 setting is not working , the same port setting i use as the on i put in gmail , but i still have the same problem", "time": "11-26-2015 06:51 AM", "replies": []}, {"postID": "post4859445", "text": "Don't use POP3 unless you have a particular reason you need to. Use IMAP, the default for Gmail. It,'s capable of much more than POP3 anyway, especially Push email.\nJust let your email app do an automatic setup. It will configure the servers for you.", "time": "11-26-2015 11:16 PM", "replies": []}]}, {"title": "I have a Huawei P8 smartphone - peel remote control do not appear on my Playstore. Why?", "thread": [{"postID": "post4823762", "text": "people next to me at the same time with a Samsung P6 doing the saem search are able to find and to use it without any problem. \nReason ? : Peel inc. had to pay a fee to Google and they prefer not to do that????\nOther reason?", "time": "11-11-2015 01:05 PM", "replies": []}]}, {"title": "What could be the cause of the glass protector not sticking flush to the phone (P8)?", "thread": [{"postID": "post4814785", "text": "I have tried 3 times to put on a glass protector on my brand new P8. The protector does not stick flush to the screen on the top left and right corners and leaves bubbles. The store attendant that put the the glass protector advised me that the screen is/ or could be warped. The phone is brand new and has never fallen or anything.", "time": "11-09-2015 03:42 AM", "replies": []}, {"postID": "post4817331", "text": "It could still be warped (a manufacturing defect). How \"not flush\" is it? 1/8? Or a tiny bit? If it's almost flush, but just not seeming to stick, it could be that the adhesive in that corner picked up finger grease or something else that would stop it from sticking.", "time": "11-10-2015 02:43 AM", "replies": []}, {"postID": "post4817421", "text": "It is on the top right and left corners of the phone and it is quite a considerable size. I doubt it has anything prohibiting it from sticking because 3 different tempered glass protectors did the same thing. I know of other people with either the same phone or the p8 lite and the screen protector sticks flush to the screen. I wish there was a way to post a picture of it", "time": "11-10-2015 04:50 AM", "replies": []}, {"postID": "post4820118", "text": "I tried 3 different glass screen protectors all well known brands and they all had the same issue. The top left and right corners would not stick down. I gave up in the end and used a normal screen protector. It's got something to do with the phone unfortunately.\nPosted via the Android Central App", "time": "11-10-2015 04:42 PM", "replies": []}]}]
[{"title": "huwaie p8 lite", "thread": [{"postID": "post4812449", "text": "i have solution", "time": "11-08-2015 12:23 AM", "replies": []}, {"postID": "post4813815", "text": "Welcome to Android Central! Do you mean the bootloader or Recovery Mode? Does this keep happening whenever you try to reboot the phone?", "time": "11-08-2015 04:43 PM", "replies": []}]}, {"title": "Anyone experiencing stuttering/lag on Huawei P8?", "thread": [{"postID": "post4805005", "text": "Some apps like Google Play, Google Calendar, Weather Timeline... are stuttering for me when scrolling. Anyone has this, or is it just my phone? Brand new, updated to lollipop.", "time": "11-05-2015 06:38 AM", "replies": []}, {"postID": "post4805098", "text": "Google play does stutter a bit. But I think it's due to the items being loaded from the internet.", "time": "11-05-2015 07:23 AM", "replies": []}, {"postID": "post4812689", "text": "Yes, the only stuttering I have seen is the wait for stuff being get from online.", "time": "11-08-2015 05:36 AM", "replies": []}]}, {"title": "Hiding system apps or launcher", "thread": [{"postID": "post4749695", "text": "Are there any way to hide system apps?\nI use a lot of different apps instead of the system ones and just having them in a folder is crap imo.\nWas also considering using a launcher, but do they work well with the P8?", "time": "10-14-2015 04:02 PM", "replies": [{"postID": "post4774149", "text": "Point with two fingers and spread them and you are at the hidden apps screen. Point at the plus icon and add the ones you want to hide.", "time": "10-26-2015 12:55 AM", "replies": []}]}, {"postID": "post4749756", "text": "Do you mean hiding the apps from the drawer or disabling them? Using a custom launcher, like Nova, should be enough if you just want to hide them. To disable some apps that came preinstalled in your phone you can check if that's possible in settings - apps - all tab - select the app. Just make sure you don't disable any system app that your phone needs to work properly. \nBefore disabling any app make sure you know how to enable them back in case things go wrong.", "time": "10-14-2015 04:37 PM", "replies": []}, {"postID": "post4749810", "text": "It was exactly what I needed.\nThanks a lot", "time": "10-14-2015 05:17 PM", "replies": []}, {"postID": "post4749840", "text": "Glad it helped! See you around the forums.", "time": "10-14-2015 05:36 PM", "replies": []}, {"postID": "post4750711", "text": "If you just want to hide apps though, do a reverse pinch (to zoom in) anywhere on the home screen and you'll get the option to hide apps and see those you've already hidden...\nLaunchers work fine on mine by the way, I tend to go between Action 3, Nova and Aviate problem...", "time": "10-15-2015 07:01 AM", "replies": []}]}, {"title": "Sar value", "thread": [{"postID": "post4523724", "text": "Hello everyone. I bought the p8 and until now I am more than happy with the telephone. \nReading around I figured out that has relatively high sar values. \nAnyone else concerned? What is your idea?\nI thank you in advance\nSent from my HUAWEI GRA-L09 using Tapatalk", "time": "06-29-2015 03:49 PM", "replies": [{"postID": "post4523739", "text": "use headphones. i like the Apple EarPods for $29.\ngood luck.", "time": "06-29-2015 03:55 PM", "replies": []}]}, {"postID": "post4523757", "text": "I've been using two way radios at a much more dangerous frequencies, right up against my skull, for 58 years. If anything happens to my brain, I'll let you know. It seems to be functioning, though (although I do have my senior moments - but I've earned the right.)\nThe radiation absorbed from a cellphone isn't ionizing so all it's doing is creating heat - probably enough to measure - with very sensitive instruments - for about an area of your skin about the size of a postage stamp. Stepping out into the noon sunshine in the summer for 10 seconds is far more dangerous than 24 straight hours of a cellphone call - UVB is ionizing to a slight extent.\nYour body absorbs electromagnetic radiation all the time, unless you live in a totally dark cave in the middle of nowhere - we evolved to accept that from the time our first amphibian ancestors set foot on dry land. What's important is whether the radiation is ionizing or not - the stuff from cellphones isn't, the stuff outside (from the sun) is. You've heard of sun poisoning, you've never heard of cellphone poisoning. (SAR is just a governmental \"we're addressing the problem\" response to a lot of Luddite FUD. If you're being seen doing something the idiots are satisfied - even if what you're doing is totally ineffective against a non-problem.)\nThe number of people who have died of cellphone exposure is probably equal to the number of non-medical-researchers (or terrorists) who died of smallpox last year - about 0.", "time": "06-29-2015 04:04 PM", "replies": []}, {"postID": "post4525466", "text": "Thanks for your prompt reply. I am normally using bluetooth headphones for talking on the phone. I am mostly using it for reading news and forums as i am not talking a lot on the phone.\nMy main concern is my daughter that sometimes is using it for playing games.", "time": "06-30-2015 11:30 AM", "replies": []}, {"postID": "post4736035", "text": "I'm new to this forum and apparently I'm not allowed to include any links in my comments until I reach a certain amount of posts.\nAnyway, \nif you want to learn more about the dangers of non ionizing radiation just look up the following articles and videos with Google:\n\"Florida Attorney Dies From 3 Different Cell Phone Induced Cancers\"\n\"Mobilize Official Trailer #2 (2014)\"\n\"Brain Tumor Victims on Cell Phone Safety\"\n\"Cell Phones & Cigarettes: What do they have in Common?\"\n\"BioInitiative Report 2012\"\n\"Prof. Olle Johansson on WiFi - Irreversible sterility within five generations\"\nI know many people will find this stuff disturbing, but I think that the bitterest truth is better than the sweetest lie...", "time": "10-08-2015 01:44 AM", "replies": []}]}, {"title": "English Android OS on Huawei P8", "thread": [{"postID": "post4669297", "text": "I purchased Huawei P8 recently but most of stuff is in Chinese. Though i have changed the language to English , but i was checking if there is way to root to English through google knowing google does not works in China ?", "time": "09-07-2015 10:07 PM", "replies": []}]}, {"title": "No messenger works when on mobile data", "thread": [{"postID": "post4616250", "text": "hello,\nI bought huawei P8 just a week ago. I do not receive any notification whatsoever when not on WiFi. before I had Samsung Galaxy S3 and didn't have this issue, so it is not my provides setting (only change I made was SIM from micro to nano).\nI have gmail account, hangouts, viber, whatsapp, facebook messenger and no notification.\nI read the whole manual and haven't found an answer. \nDoes anyone have a clue what this could be?", "time": "08-18-2015 03:14 PM", "replies": []}, {"postID": "post4616286", "text": "Welcome to Android Central! Do you actually receive messages and emails over mobile data, but just don't get notifications for them?", "time": "08-18-2015 03:32 PM", "replies": []}, {"postID": "post4616320", "text": "No, when I open any of those messengers/gmail I'm not able to download new messages. Like it wasn't working on mobile data. Attaching screenshot where you can see that all my applications are OK'd for WiFi and Mobile data.", "time": "08-18-2015 03:46 PM", "replies": []}, {"postID": "post4617115", "text": "Does mobile data work at all? Are you able to surf the web on your browser using mobile data only?", "time": "08-18-2015 11:32 PM", "replies": []}, {"postID": "post4618201", "text": "yes. Browser, facebook...works without an issue. Just messengers don't. Here is a picture with viber screen when on mobile data...stil \"connecting\".", "time": "08-19-2015 09:41 AM", "replies": []}, {"postID": "post4618845", "text": "It may still be worth checking your APN settings and making sure they're correct. What carrier do you have?", "time": "08-19-2015 11:33 AM", "replies": []}, {"postID": "post4619244", "text": "I do have Orange Slovakia. I called them and they advised to insert new nano SIM card to old phone where it worked just fine. I'll do that tomorrow to find out if the issue is related to the SIM card or no(I hope that I haven't throw away the micro SIM adapter).", "time": "08-19-2015 01:15 PM", "replies": []}, {"postID": "post4620730", "text": "On your P8, make sure the APN settings match what's in this link: Mobile Phone Carrier Settings for Orange - Slovakia", "time": "08-19-2015 09:56 PM", "replies": []}, {"postID": "post4641270", "text": "I solved it. I reset to factory settings and it works. After that I installed latest update and it still works. Looks like previous update install went bad. So all good now. thanks for helping me out.", "time": "08-27-2015 09:48 AM", "replies": []}]}, {"title": "P8MAX", "thread": [{"postID": "post4627308", "text": "Hi, all! I'm new to this Forum so I hope that I'm in the right place... I am a real novice when it comes to the android system and phones in general. I have a Samsung Galaxy Note II through Verizon that I have been using for years. I don't know how to do things like root, etc. I have seen the Huawei P8MAX and really want one... knowing as little as I do, what are my chances of buying this phone and using it successfully as is out of the box? I don't even know the best place to buy one - I see them on ebay... and, especially, I don't know what USA cell service provider would be the best for this phone! Can anyone help or at least point me to the place to find 5hese answers? Thanks for your time! \nSent from my SCH-I605 using Tapatalk", "time": "08-22-2015 12:47 PM", "replies": []}, {"postID": "post4628541", "text": "Anyone?... Anyone?...\nSent from my SCH-I605 using Tapatalk", "time": "08-23-2015 12:00 AM", "replies": []}, {"postID": "post4628844", "text": "If an admin would create a new sub-forum under Huawei for the P8Max perhaps you will get more response.", "time": "08-23-2015 05:25 AM", "replies": []}, {"postID": "post4629493", "text": "Thanks, Jerry. That's why I wondered if I was in the right place... but I had no choice! I hope Admin will do that!\nSent from my SCH-I605 using Tapatalk", "time": "08-23-2015 12:32 PM", "replies": []}]}, {"title": "MMS Problem", "thread": [{"postID": "post4621218", "text": "Hi\nWhen i receive a MMS from someone everything seems ok.\nBut if the MMS contains a Picture and i click it, the Picture is then opened in some sort of video viewer and it will not display .\nAll i get is a White screen and if if press it, i get a movie slider at the bottom that indicates that what i have opened is a 5 second movie.\nPushing play does not do anything. Does not show Picture and does not move movie timer.\nIf i long press the Picture and select to save it, i can see it by going to folder viewer and finding it there. If i select the Picture there, it get's displayed as it should. I was thinking that i had a bad file link that linked Pictures to the video viewer but it selects Picture viewer allright when going thru the folder viewer.\nAnyone else had this problem.", "time": "08-20-2015 03:48 AM", "replies": []}, {"postID": "post4622429", "text": "Welcome to Android Central! Are you certain the sender sent a photo rather than a video? Make sure they're sending a photo. If they accidentally took a video instead of taking a picture, then tried to send you that video, the system might compress it severely (since the filesize limit for MMS is about 1 MB), leading to what you're seeing.", "time": "08-20-2015 01:00 PM", "replies": []}]}, {"title": "MMS Problems", "thread": [{"postID": "post4610254", "text": "I'm using my Huawei P8 GRA-L09 on T-Mobile USA and am having some MMS problems. MMS only send or receive successfully in the default stock messaging app. If I try to use Hangouts or Google Messenger they fail. I've double checked my APN settings, reset them, everything I can think of. It seems like a bug in the software.\nI'm using stock B170. Is anyone else having a similar issue?", "time": "08-15-2015 09:06 PM", "replies": []}, {"postID": "post4610256", "text": "Had similar problems I stated using Textra, give it a try \nSent from my HTC One_M8 using Tapatalk", "time": "08-15-2015 09:08 PM", "replies": []}]}, {"title": "Relock problem", "thread": [{"postID": "post4572389", "text": "Hello everybody. I've unlocked the bootloader of my Huawei P8 because i need root. Unfortunately i need to send my device to huawuei assistance because i noticed a little defect of the display. So i've reflashed the stock recovery ,reflashed the stock firmware (with the application \"updater\") putting into the integrated memory (because i haven't an SD) the folder \"dload\" .After that i've done also a factory reset with the stock recovery. So to relock the bootloader i try to launch the command by terminal:\n\"fastboot oem relock code\" \nBut i have this error : FAILED (remote: root type is risk)\nPlease help me.", "time": "07-25-2015 04:51 AM", "replies": [{"postID": "post4572393", "text": "You really need a SD card for this to work. It says so in the manual. Sorry.\nSkickat från min HUAWEI GRA-L09 via Tapatalk", "time": "07-25-2015 05:02 AM", "replies": [{"postID": "post4572404", "text": "So with an sd card and the original fw can I reset all the device by original recovery and solve the situation of relock?", "time": "07-25-2015 05:26 AM", "replies": []}]}]}, {"postID": "post4572799", "text": "You can probably relock the bootloader, I have not tried or heard of someone who has done so but it probably should work. A support tech person can most likely still see that it has been unlocked as most phones returns \"relocked\" from a query on the bottloader status if it is relocked. the chance that support will look into this with regard to a screen issue is close to none\nSkickat från min HUAWEI GRA-L09 via Tapatalk", "time": "07-25-2015 11:48 AM", "replies": [{"postID": "post4575519", "text": "Thanks I will contact them to inform about the problem and if they say \"the bootloader is unlocked\" i can reply that was my dog to do it", "time": "07-27-2015 05:37 AM", "replies": []}]}]}, {"title": "The unlocking of the screen P8 does not always work", "thread": [{"postID": "post4559976", "text": "The unlocking of the screen P8 does not always work . Sometimes I have to slide my finger more than once to access the phone . Anyone else feel the same difficulty ? Are there any suggestions ? thanks", "time": "07-18-2015 02:07 AM", "replies": [{"postID": "post4559983", "text": "I had this problem too before I noticed that there is a rather stiff plastic protection sheet over the display that makes response a lot worse. Look at the speaker, if there is an oval cutout around the sensor, the speaker and the camera you have to remove the sheet.\nSkickat från min HUAWEI GRA-L09 via Tapatalk", "time": "07-18-2015 02:14 AM", "replies": []}]}, {"postID": "post4560006", "text": "In the setting you can disable the lockscreen and only use the security screen if the unlocking feels troublesome.\nSkickat från min HUAWEI GRA-L09 via Tapatalk", "time": "07-18-2015 02:37 AM", "replies": [{"postID": "post4560121", "text": "Thanks for you reply. I change the lock screen style to \"before the dawn\". It's not perfect but it works better.", "time": "07-18-2015 06:29 AM", "replies": []}]}, {"postID": "post4560123", "text": "No plastic...", "time": "07-18-2015 06:32 AM", "replies": []}, {"postID": "post4560268", "text": "You can also go to Themes and scroll to the far right and select Customize at rhe bottom and then select Lock screen and as effect select \"none\". That made it better for me.\nSkickat från min HUAWEI GRA-L09 via Tapatalk", "time": "07-18-2015 08:53 AM", "replies": [{"postID": "post4561691", "text": "Now it's perfect. :=) \nI havent seen that option. Thanks", "time": "07-19-2015 07:29 AM", "replies": []}]}]}, {"title": "Android System eating up my battery", "thread": [{"postID": "post4543969", "text": "I recently bought a new phone, the Huawei P8 and I get terrible battery life specially on standby. Android System is what's eating up my juice and is often at 62% or so which I find very strange. Most Android smartphones I've used had Android System somewhere between 6% to 10% max. When I go to sleep with a 100% fully charged battery, I wake up with 65% or 70% left. That's with Wi-Fi, GPS, Bluetooth, mobile data and auto sync all turned off. I tried using the \"ultra\" power saving mode but to no avail. I even tried disabling some apps including most of Google's services, performing a factory reset and clearing the cache but none of that helped. I sent it back to the warranty and they \"reinstalled\" the software or so they say but Android System is still using up more than 50% (it keeps changing but it's always above 50% or 60% and after a long time of standby during my sleep I then wake up only to find it hit 86%. Android System at 86%!!). The problem hasn't been fixed and I'm really frustrated.\nAny help will be very much appreciated.", "time": "07-09-2015 09:46 AM", "replies": []}, {"postID": "post4544668", "text": "Please use the thread you already created.http://forums.androidcentral.com/hua...ml#post4543662", "time": "07-09-2015 02:52 PM", "replies": []}]}, {"title": "Status bar data speed", "thread": [{"postID": "post4535845", "text": "The demo model in the store where I bought my p8 had a data speed meter in the status bar, but mine hasn't got this and I can't find it anywhere in the settings. Does anyone know how to bring it up?", "time": "07-05-2015 04:05 AM", "replies": []}, {"postID": "post4535857", "text": "I use \"Network monitor mini\" that does that. Works great and can be customised to your needs. The free version is more limited and the paid pro version gets you all the good stuff. \nSkickat från min D6603 via Tapatalk", "time": "07-05-2015 04:33 AM", "replies": []}, {"postID": "post4536433", "text": "I remember seeing and testing this before I updated to the B132 firmware but now I can't find it. Must be either moved deep down or removed. What firmware do you have?", "time": "07-05-2015 12:09 PM", "replies": []}, {"postID": "post4536695", "text": "I have B132 and I vaguely remember having the indicator before I updated, so maybe they removed it with the update.", "time": "07-05-2015 02:58 PM", "replies": []}, {"postID": "post4542353", "text": "They DID remove it. From the manual:\n\"1 On the home screen, touch Settings.\n2 Under All, touch Display.\n3 On the Display screen, you can:\n(....................................)\n• Touch Display network speed to display or hide the current network speed.\n(....................................)\"\nAnd this sure is gone!", "time": "07-08-2015 12:46 PM", "replies": []}]}, {"title": "Spotify & lock screen", "thread": [{"postID": "post4529839", "text": "I can't get Spotify to show up on the lock screen although I have turned on lock screen notifications in the settings menu. Spotify appears in the drop-down notifications, but not on the lock screen, which is really annoying since I have to unlock my device in order to pause or skip a track. Not really great while driving etc. Does anyone know a solution?", "time": "07-02-2015 10:23 AM", "replies": []}, {"postID": "post4529865", "text": "Go to the Settings, Power saving (in the second Group), scroll up from the bottom part of the screen to see all the alternatives. Deselect the option Screen Saver to save Power. Then select Protected apps and make sure Spotify is protected by moving the slider to the right.\nI have to translate from my native language so the wording of the alternatives may not be exact, sorry for this!", "time": "07-02-2015 10:36 AM", "replies": []}, {"postID": "post4529916", "text": "Thank you for answering, but unfortunately it still doesn't work", "time": "07-02-2015 10:58 AM", "replies": []}, {"postID": "post4529976", "text": "I use Spotify for hours every day and I have never felt the need to use my phone to pause, skip track or adjust volume. All this is easily done with the buttons of the headset (any headset) or the controls of the cars controls without touching the phone. \nNow if I enable the lockscreen I see that there is nothing from Spotify on my lockscreen either.", "time": "07-02-2015 11:27 AM", "replies": []}, {"postID": "post4535841", "text": "I contacted Huawei in my home country, and it is indeed not possible to control spotify from the lock screen at the moment without installing another lock screen like Next lock screen, but Huawei said that they hope this will be dealt with in a future update.", "time": "07-05-2015 03:59 AM", "replies": []}]}, {"title": "Android Wear lock screen issue", "thread": [{"postID": "post4531856", "text": "I hope someone can help me with this.\nI'm loving my Huawei P8 and haven't had any issues up until now. I recently purchased a Asus Zenwatch.\nthe watch works fine if I leave my phone screen open. I can go into the Android Wear app and select to push notifications from the android wear watch and Zen Phone manager and it works a treat. Then when I lock my phone screen it stops, I have to go back into the app and select to push notifications again.\nI think I have tried everything. I have checked under protected apps to make sure the Zenwatch manager and Android wear are set to run after closing the screen, which they are.\nI have factory reset the watch a number a times and reconnected. Uninstalled and reinstalled the Android wear app etc. but it still does the same.\nHas anyone else had this problem? Right now the watch is useless with this phone and I don't think it's the watches problem but the way the Huawei P8 handles push notifications.\nThanks\nMike", "time": "07-03-2015 04:25 AM", "replies": []}, {"postID": "post4531926", "text": "Do you have the Screen saver to save power on under Power saving, scroll down the under part of the screen. If this is active all apps will be stopped as the screen is shut down.\nSkickat från min HUAWEI GRA-L09 via Tapatalk", "time": "07-03-2015 04:42 AM", "replies": []}, {"postID": "post4532235", "text": "Thanks for the quick response.\nI have had a look in the power saving options but I cannot find anything relating to a screensaver. Am I in the right place?\nThanks", "time": "07-03-2015 05:31 AM", "replies": []}, {"postID": "post4532590", "text": "Have you swiped up from the bottom part of the screen to se the whole page?\nSkickat från min HUAWEI GRA-L09 via Tapatalk", "time": "07-03-2015 06:16 AM", "replies": []}, {"postID": "post4532645", "text": "Thanks again for your quick response Jerry\nI'm really struggling to find the screensaver you have mentioned. I'll explain where I am going step by step.\nFirst I click into settings:\nI then click into Power Saving:\nI then swipe up:\nThis is all I see, I can't see any options for screensaver. Maybe I'm just being stupid.\nThanks\nMike", "time": "07-03-2015 06:36 AM", "replies": [{"postID": "post4532707", "text": "That was strange! Mine looks like this (I have firmware B132 and Before that B110 and it looked the same):\nThe one with the slider says \"Screen saver to save Power\" (Swedish version of P8).\nWhat is your firmware version? It is in the last entry of the settings.", "time": "07-03-2015 07:20 AM", "replies": []}]}, {"postID": "post4532744", "text": "Thanks again. Glad I wasn't being stupid. I'm pretty sure there is nothing set preventing all apps from running in the background. I still get my email notifications on my phone and whatsapp with the screen locked. The problem appears to be the Android Wear app.\nI have sent an email directly to Huawei about this and will see what they have to say. I'm sure others must be having the same problem, and with them releasing their Huawei Watch in the near future which is based on android wear I'm hopeful they will fix it.\nThanks again for your help.\nMikae", "time": "07-03-2015 07:52 AM", "replies": []}, {"postID": "post4532815", "text": "OK, would be nice if you came back here when you find a solution! Not to be to conspiratorial, but Huawei is about to release a watch of their own ( www digitaltrends com\\wearables\\huawei-watch-news : replace spaces with dots and backslash with slash. I'm not alowed to post links yet!) \nThey seem to have some problems…. Don’t know if this has anything to do with your problem.", "time": "07-03-2015 08:52 AM", "replies": []}, {"postID": "post4532886", "text": "It looks like it's a known issue with lollipop 5.0 on the P8. I have just read an article regarding the Ascend Mate 7 running 5.1 and it mentions issues with lollipop 5.0 on the P8.\nwww androidauthority com\\ascend-mate-7-running-lollipop-shown-off-on-video-614625\\\nI also can't post links :-)", "time": "07-03-2015 09:39 AM", "replies": [{"postID": "post4532889", "text": "Ok, nice, then all we have to do is hurry up and wait for 5.1 for the P8! \nSkickat från min HUAWEI GRA-L09 via Tapatalk", "time": "07-03-2015 09:42 AM", "replies": []}]}]}, {"title": "Notification access/lockscreen problem", "thread": [{"postID": "post4482299", "text": "I just purchased the Huawei P8 phone. I have really big problems with lock screen notifications. They are very unreliable, sometimes they appear right away, sometimes it takes a while, and most of the time I can't get any notifications if my phone screen is on sleep. Only way to get them is to wake up the phone from the power button.\nAlso, I tried to download 3rd party lockscreen apps, but all of them ofcourse need Notification access, this works at first. But once I push the power button (to put the phone to sleep) all the Notification access permits reset, so therefore the lockscreen application doesn't work. This also handicaps other apps such as PushBullet.\nThis is a very big inconvenience since I need my email and whatsapp notifications immediately. \nAll the help is appreciated!\nTuomas.", "time": "06-09-2015 01:08 PM", "replies": []}, {"postID": "post4482736", "text": "Welcome to Android Central! Is your system up to date? I saw this about a system update, but only in China apparently: Download Ascend P8 B131 EMUI 3.1 Firmware Update [UL00/TL00/CL00/CL10] | Carbon Tesla", "time": "06-09-2015 04:31 PM", "replies": []}, {"postID": "post4518968", "text": "Start Settings and select Energy saving, scroll down to Protected apps and find the app you have a problem getting notifications from and make it run even as the screen is off. You can also set all apps to run or not run as screen is off by the menu button at the bottom.\nTook me some time to understand that it was this that prevented a game I use to notify me when the other player had made a move!", "time": "06-27-2015 12:39 AM", "replies": []}]}, {"title": "Packaging screen protection", "thread": [{"postID": "post4511228", "text": "Did anyone else miss the plastic cover on the screen? It took me two weeks before I noticed that there was a transport protection film on the screen of the P8!\nI noticed that the screen was i not as bright as I had hoped, but I remembered seeing in a review that someone said that the screen could be a bit brighter so I just let it go. Yesterday I happened to touch the screen with an adhesive tape and the rather stiff sheet of plastic came off! And, boy, did the screen get bright! I just cannot believe that this is supposed to stay on as a screen protector since it did not stick very hard once it was lifted.\nMy P8 now feels like a whole different phone!", "time": "06-23-2015 01:35 AM", "replies": []}]}, {"title": "How can I install Facebook app Huawei P8?", "thread": [{"postID": "post4482801", "text": "Hello guys,\nI'm new on the forum and hope its ok to post this problem here.\nGot a Huawei P8 today, installed a bunch of apps, except Facebook. Gives me the following error:\nCan't install Facebook due to an error (Error trying to get information from the server [RPC:S-2:AEC-2 P5NJ-3JBN-LGOTQ])\n(I translated, but it should be something like that).\nAny ideas what might be? I tried via Wi-Fi and 4G, installed facebook messanger, but Facebook main app always gives this error.\nThanks in advance for your help!", "time": "06-09-2015 05:02 PM", "replies": []}, {"postID": "post4484893", "text": "Welcome to Android Central! Go to Settings>Apps>All​, select Google Play Store, and Clear Cache/Clear Data, then Force Stop. Do the same for Download Manager. Now try again.", "time": "06-10-2015 01:17 PM", "replies": []}]}, {"title": "Mobile Standby", "thread": [{"postID": "post4471347", "text": "Hi all\nI purchased this phone a week ago and I have to say I'm impressed with the overall package. However one thing that has baffled me is the mobile standby percentage. Its the highest consuming battery user. I work in London so travelling underground I expect the signal to go etc. But looking at the images it shows that its on for majority of the day. As I'm writing I'm at 64% which to my surprise is good considering it was disconnected from the charger at 7 this morning. Could this just be a glitch in the software or do I have something to be worried about??? \nOn a completely separate note does anyone know of any good cases for the phone. I can't seem to find anything relatively nice.\nSorry about the long post.\nPosted via the Android Central App", "time": "06-04-2015 02:45 PM", "replies": []}, {"postID": "post4471375", "text": "Your phones radio is on standby making contact with the network. Nothing to worry about as long as you don't see mega price effects on the battery. \nRegarding the case, are you looking for something rugged or slim?", "time": "06-04-2015 02:53 PM", "replies": []}, {"postID": "post4471411", "text": "Oh OK that had me worried that it was constantly looking for a signal and would eventually have a adverse effect on the battery. In terms of the case looking for something slim. I've got a very basic gel case on at the moment and was looking for something better look wise and protection wise. None of the big companies make cases for this phone.\nPosted via the Android Central App", "time": "06-04-2015 03:06 PM", "replies": []}, {"postID": "post4476588", "text": "Just noticed today. Can't be right? I knew this was causing issues (previous post) but surely this is a glitch in the software. Anyone else experience this? My battery has lasted me all day and I've only put it on charge late at night.\nPosted via the Android Central App", "time": "06-06-2015 08:59 PM", "replies": [{"postID": "post4476676", "text": "Your time on battery is outstanding so something has to take up the % that the battery is using. For instance, even if you were sleeping and not burning many calories, your heart beating might take up 60% of the calories you used, even though the actual calories burned might not be a lot since you were sleeping. Make sense?\nDoesn't look like there is any unusual drain at all - I'd give anything to have that kind of battery performance! Post your Screen on Time as an additional screenshot next time so we can evaluate that.", "time": "06-06-2015 09:47 PM", "replies": []}]}, {"postID": "post4478048", "text": "So I guess this is all fine! Im surprised. Mobile standby today is at 5%.\nPosted via the Android Central App", "time": "06-07-2015 05:03 PM", "replies": []}]}, {"title": "Camera quality: some Huawei P8 photo samples", "thread": [{"postID": "post4417544", "text": "Here are some photo samples of P8... \n1st image: indoor\n2nd image: indoor\n3rd image: outdoor\nMore high resolution photos: Huawei P8: camera photo samples (image gallery)", "time": "05-10-2015 09:23 AM", "replies": []}, {"postID": "post4459358", "text": "Camera looks impressive! Am seriously considering getting this.\nPosted via AndroidNigeria.com.ng", "time": "05-30-2015 04:53 PM", "replies": []}]}, {"title": "Nova Launcher", "thread": [{"postID": "post4439319", "text": "Does anyone know if the Nova Launcher will force an App Drawer on an Huawei phone? I like the P8 a lot, but I would prefer an App Drawer.", "time": "05-21-2015 06:31 AM", "replies": []}, {"postID": "post4439337", "text": "Yes, with Nova you'll have different options to custom the app drawer.", "time": "05-21-2015 06:49 AM", "replies": []}, {"postID": "post4439382", "text": "Thanks Javier. I have Nova on my HTC M8, but the phone UI is built with an App drawer, unlike the Huawei P8. Just want to see if anyone with a Huawei phone has managed to get an app drawer with their Huawei phone.", "time": "05-21-2015 07:40 AM", "replies": []}, {"postID": "post4439554", "text": "I think it should work without problem. I've seen a couple of videos with the P6 running with Nova and they have the app drawer. And if you read the P8 reviews you find comments from owners that installed Nova straight away.", "time": "05-21-2015 09:15 AM", "replies": []}]}, {"title": "first benchhmark points of P8", "thread": [{"postID": "post4377087", "text": "The benchmark scores of P8 are as high as other flagships in the market. \nBut the one that was tested has Kirin 930 instead of 935. \nIt just got 12000+ points of Quadrant, which is not so good. \nsource, more info: http://gsminsider.com/2015/04/huawei-p8-benchmark-scores", "time": "04-21-2015 07:18 PM", "replies": []}]}, {"title": "Huawei's new phone: The P8", "thread": [{"postID": "post4359545", "text": "A quick glance at the specs: \n-An 8 core 64 bit processor\n-16 GB internal\n-3 GB RAM\n-5.2 inch screen\n-2600 mAh battery\nThis looks like it might be a solid device, although, I have not heard of the processor before.\nWhat do you guys think?\nLinks: Huawei Ascend P8 announced: metal-bodied flagship with 8-core, 64-bit CPU | Android CentralHuawei Ascend P8 specs | Android Central", "time": "04-15-2015 09:47 AM", "replies": []}, {"postID": "post4359571", "text": "Obviously I haven't used the device yet, but on paper it looks pretty sweet. I would like to see 32GB become the new base storage, but I understand that some people are perfectly happy with 16GB. I'd also welcome a slightly thicker device (or curved) to support a larger battery. The big news here (for US consumers) is that they seem ready to target the US market.", "time": "04-15-2015 09:56 AM", "replies": []}, {"postID": "post4360392", "text": "Sounds good on paper, I agree that 32GB should be the norm instead of 8GB and 16GB.", "time": "04-15-2015 02:41 PM", "replies": []}]}]
