[{"title": "Does Asus Zenfone 3 support OTG?", "thread": [{"postID": "post6190121", "text": "Hello, \nDoes Asus Zenfone 3 support OTG? \nThank you for answers.", "time": "03-14-2018 04:27 AM", "replies": []}, {"postID": "post6190250", "text": "I can't imagine a Type C port that could not do OTG...\nI can't find it listed as a spec, but take it as a given.\nYou probably need an appropriate adapter cable, however, that has the correct pin combination enabled for full support.ASUS Zenfone 3 USB OTG Support - Tech Guide", "time": "03-14-2018 07:14 AM", "replies": []}, {"postID": "post6190761", "text": "I have an OTG at home that works, however, when I tried it with an adapter for an Asus port it did not work.", "time": "03-14-2018 02:15 PM", "replies": []}]}, {"title": "Why my camera on asus zenfone3 not working?", "thread": [{"postID": "post6159444", "text": "I upgrade os to aero. But my camera disabled. When I run it. I have this massage. \nCamera failed to lunch. Reboot your device.", "time": "02-10-2018 11:48 AM", "replies": []}, {"postID": "post6159493", "text": "An OTA upgrade?", "time": "02-10-2018 01:46 PM", "replies": []}]}, {"title": "help me to flash the firmware of ASUS ze 552kl.", "thread": [{"postID": "post6136696", "text": "I downloaded the latest firmware. How to flash this? Help...", "time": "01-15-2018 05:22 AM", "replies": []}]}, {"title": "ASUS ZenFone 3 ZenFone 552kl.ASUS ZenFone 3 ze 552kl.", "thread": [{"postID": "post6032464", "text": "Whenever I open any apps, the pull down notification panel is displaying automatically and stop the app. Help me..", "time": "10-22-2017 11:42 AM", "replies": []}, {"postID": "post6032681", "text": "Welcome to Android Central! Moved from the Nougat forum to the ZenFone 3 forum.\nCan you give more details? Are you saying the notification panel automatically comes down as soon as you start an app, and then the app exits or freezes?", "time": "10-22-2017 02:03 PM", "replies": []}, {"postID": "post6033394", "text": "The notification panel automatically comes down, when I'm trying to use my phone, open some apps and it just keeps coming down which is making the app no problem. I've tried re-starting it, soft- hard reset and safe mode but the problem is there.", "time": "10-22-2017 10:23 PM", "replies": []}, {"postID": "post6033477", "text": "Do you have a case or screen protector on?", "time": "10-23-2017 12:32 AM", "replies": []}, {"postID": "post6033498", "text": "no. I don't use a case or screen protector.", "time": "10-23-2017 01:40 AM", "replies": []}, {"postID": "post6033515", "text": "Since it's happening in Safe Mode, it's a problem with either the firmware or the hardware. Is the phone still under warranty?", "time": "10-23-2017 02:17 AM", "replies": []}, {"postID": "post6033644", "text": "yes. It's a new phone. I think this problem begins after the last update.", "time": "10-23-2017 05:25 AM", "replies": []}, {"postID": "post6034530", "text": "At this point, it's probably best to contact ASUS for warranty replacement.", "time": "10-23-2017 02:39 PM", "replies": []}, {"postID": "post6035406", "text": "Thanks", "time": "10-24-2017 01:56 AM", "replies": []}, {"postID": "post6132156", "text": "I downloaded the latest firmware. Kindly advice me how to flash this?", "time": "01-10-2018 07:20 AM", "replies": []}]}, {"title": "Wired audio cutting out after around two hours", "thread": [{"postID": "post6122952", "text": "I use my phone to play the sounds of wind and rain to help me sleep at night. It's usually plugged into my speakers to do it. However, a while ago audio started cutting out, usually after around two hours (perhaps exactly but I'm not concious enough at night to check that). The app playing the sound behaves as if it was still playing but there's no sound coming from the speakers. I can only resume playback by unplugging the jack and plugging it in again. \nAt first, I thought that it's a problem with the app but the same thing is happening with another one. The speakers are all right too, nothing happens during the day, when they're connected to my laptop. Same thing is happening with my wife's phone, which is also a zenfone 3max. It does not happen when I'm using a bluetooth speaker.\nIt's supremely annoying, the sudden silence wakes me up quicker than any unexpected sound. What can I do with that?", "time": "12-31-2017 02:36 AM", "replies": []}, {"postID": "post6123026", "text": "What is the name of the app?", "time": "12-31-2017 06:24 AM", "replies": []}, {"postID": "post6123064", "text": "The app I'm currently using is called Rain Sounds ( https://play.google.com/store/apps/d...ersounds&hl=en ), the one I used before is called A Soft Murmur ( https://play.google.com/store/apps/d...ftmurmur&hl=en )", "time": "12-31-2017 07:39 AM", "replies": []}]}, {"title": "Anyone here have the Zenfone deluxe 5.7 inch?", "thread": [{"postID": "post5975510", "text": "I've been looking at the Zenfone deluxe that's 5.7 inches. Does anyone here have that model and if so can you tell me how you like it? How is the performance and the screen resolution? I know they make two different models one that I think is 499 and one that's 699 I think. What are the differences between the two models for such a price difference? Next month I'm getting a second device and I want it to be a larger screen phone so that I can watch movies on and YouTube with it. The Zenfone deluxe is one that I've been looking at but I've never owned an Asus phone before. Any advice would be greatly appreciated.", "time": "09-15-2017 12:10 AM", "replies": []}, {"postID": "post6055924", "text": "I am happy to tell you my experience with this phone. I have the 5.7 with 6 gigs of ram and 64 gigs on internal memory. Most reviews of this phone claim that 6 gigs of ram is more than enough and I'm sure it is however, from the box the phone has so much pre installed software that it shows 2.7 gigs already in use of about 5.7 useable. All that being said, I actually love the ASUS UI and I use the memory booster and battery saver apps. It doesnt clutter my home screen or anything. \nThe resolution is 1920x1080 with 386 ppi. It's a beautiful picture with rich vibrant colour.\nAs far as the processor, the snapdragon 820 is a quad core and much faster than the 635 octacore. The 821 is supposed to be 10% faster. I believe it comes the the ZenFone AR and the ZenFone 3 deluxe special edition. My phone can be found for $379 but ASUS sells it for $499 right now. The camera is 23MP rear and 8MP front. Super beautiful pics. \nI love the phone. The down side is the 3000 mAh battery. The zoom comes with a 5000 but I think the specs required the space for the better hardware. A worthy trade off in my opinion making the ASUS ZenFone 3 deluxe a super machine!", "time": "11-05-2017 09:43 PM", "replies": []}, {"postID": "post6055930", "text": "Also, the 5.7 deluxe came with Android 7.0 nougat, rather than 6.0 marshmallow as all available info says it comes with.", "time": "11-05-2017 09:46 PM", "replies": []}]}, {"title": "Backup options for Zenfone 3, please help", "thread": [{"postID": "post6034982", "text": "Hello everyone. Looking for help in backing up my Zenfone 3.\nReason is, I must send my phone for warranty due to a hardware issue and even though I asked ASUS NOT to update my firmware (still have the original firmware), I have a bad feeling it will get returned factory reset with the latest update.\nThe reason is not relevant to this thread, but no other firmware past the original firmware the phone came with works properly with the 2 SIM cards I'm using. I tried.\nSo, is there please an option to backup my Zenfone 3 that most importantly, will keep my original firmware I have now and I can restore it if my phone will come back with the latest firmware? Something like a clone that allows me to restore it exactly the way I have it now before I must send it.\nOnly other possible obstacle is that my phone is not rooted or bootloader unlocked and I don't wish to do so, as I had no need, and I'm not even sure if ASUS allows that if I need to have it warrantied.\nPlease help? Any software out there or method I can use to just purely clone/copy my phone and be able to restore it once I receive the phone back?", "time": "10-23-2017 07:34 PM", "replies": []}]}, {"title": "Asus Zen fone C", "thread": [{"postID": "post6020465", "text": "IMEI number missing after hard reset, both SIM are not working, please help!!", "time": "10-15-2017 09:12 AM", "replies": []}, {"postID": "post6020537", "text": "Welcome to the forums. Was the device rooted?", "time": "10-15-2017 10:13 AM", "replies": [{"postID": "post6020556", "text": "No", "time": "10-15-2017 10:28 AM", "replies": []}]}, {"postID": "post6020598", "text": "A reset shouldn't wipe the IMEI number. You might need to contact ASUS about this.", "time": "10-15-2017 10:59 AM", "replies": []}]}, {"title": "Zenfone 3 Max (ZC553KL) – 5.5-inch FRP bypass MODEL : ASUS_X00DD", "thread": [{"postID": "post6009495", "text": "Hello There\nI am trying to unlock Asus FRP Lock, i saw a lot of tutorials and all of them came to the same result but mine didn't, In the end of every tutorial there's the 3 dots where they press on them and they hit Sign-in, Well....these 3 dots are not shown on my screen i don't know what's the problem...", "time": "10-07-2017 02:53 PM", "replies": []}, {"postID": "post6010194", "text": "Sorry, but we don't allow discussions on how to bypass security features. Thread closed.", "time": "10-08-2017 12:15 AM", "replies": []}]}, {"title": "i need help.. please", "thread": [{"postID": "post5977694", "text": "Hey\nI Bought refurbished zenfon 3 max.\nwhen I turn on the device I am not seen ant operation system. instead, i see a Japanise\\ English old fashion menu with many tests such as GPS, USB, radio, headphones and more...\nsomeone know what should I do to fix it? (Except asking for my money back)\nthanks in advance", "time": "09-16-2017 01:08 AM", "replies": []}, {"postID": "post5991996", "text": "Have you found a solution to your problem yet? Try doing a soft reset on the phone (press and hold the Volume Up and Power buttons until the phone shuts down - it should restart afterwards) to see if anything changes.", "time": "09-25-2017 11:01 AM", "replies": []}]}, {"title": "Problems accessing a web-site with ZenFone 3?", "thread": [{"postID": "post5970091", "text": "I made a website as a curtesy for a friend. Now he has the problem that he can not access his website with his Asus ZenFone 3. He thinks it's the web site, I think it's his phone \nI don't have such a device but access works with Apple and other android ... \nAre there any known issues with the Asus ZenFone 3?", "time": "09-12-2017 05:38 AM", "replies": []}, {"postID": "post5977482", "text": "Welcome to Android Central! Which browser is your friend using -- the ASUS Browser? Ask him or her to try it on Chrome or some other browser (like Firefox, Opera, or Dolphin).", "time": "09-15-2017 10:12 PM", "replies": []}, {"postID": "post5979200", "text": "Thank you, this was exactly the issue.(I did not know that ASUS has such a thing). After installing Firefox, I noticed that there is also Chrome ...... Everything works fine we can close this now.", "time": "09-17-2017 02:55 AM", "replies": []}]}, {"title": "Saving voicemails to sim card?", "thread": [{"postID": "post5936349", "text": "Hey everyone, hoping someone can help out with this problem or at least confirm their phone does the same thing.\nSo whenever I get a voicemail it gets saved to the sim card. When this gets full I stop getting messages. I found this weird since any other android phone I've had doesn't do this. To delete the messages off the sim card I have to go into the stock text messages app settings to delete them, which means I can't use a different messaging app.\nI called asus tech support and after an hour with them they told me that this is a \"feature\". Apparently the zenfone 3 saves voicemails to the sim card on purpose and this can't be changed.\nCan anyone else confirm this is the case with their phone? Or if not does anyone know how to fix this?\nThanks.", "time": "08-24-2017 01:51 PM", "replies": []}]}, {"title": "Asus Zenfone 3 Toplu Sms Sorunu Çözümü", "thread": [{"postID": "post5927596", "text": "Bayram gibi özel günlerde çoklu sms gönderiminiz varsayılan olarak ayarlı gelmiyor. Bu yüzden mms olarak yapabiliyorsunuz. Aşagıdaki işlemleri adım adım uygulayarak sorunu çözebilirsiniz.\nMesajlar>Ayarlar>Gelişmiş>Grup mesajları>Toplu kısa mesaj", "time": "08-18-2017 10:50 AM", "replies": []}, {"postID": "post5927705", "text": "thanks for this guide but could you please write an english version?", "time": "08-18-2017 12:42 PM", "replies": []}]}, {"title": "Rooting without computer", "thread": [{"postID": "post5894196", "text": "Hi there, I need to root my 3 Max with nougat (Android 7.0) without a computer and without bricking it. If anyone has done this or knows how to, please tell me how you did it! Thank you in advance!", "time": "07-21-2017 12:52 PM", "replies": []}, {"postID": "post5894231", "text": "Check XDA.", "time": "07-21-2017 01:25 PM", "replies": []}]}, {"title": "Did the ZenFone 2 convince you to go for the 3?", "thread": [{"postID": "post5246496", "text": "The ZenFone 2 was ASUS's big play to become a major smartphone maker. Overall, I felt it was a very good phone and an excellent value, with two notable drawbacks: (1) tons of ASUS bloat (which, to their credit, they have gradually been removing or paring down), and (2) very slow Android version updates (still waiting for Marshmallow--although ASUS has pushed quite a few updates to fix various bugs, so at least they're paying attention).\nMy question to ZenFone 2 owners is: Did ASUS make a strong enough case to you to stick with them and get one of the ZenFone 3 variants when they come out next month? Especially now that there are so many phones that offer high specs at a relatively low price?", "time": "06-30-2016 05:10 PM", "replies": []}, {"postID": "post5258702", "text": "I honestly think I am going to pass. I have MM on my ZF2, but that was after unlocking the bootloader, flashing TWRP, and flashing CM13.", "time": "07-10-2016 09:50 AM", "replies": []}, {"postID": "post5262000", "text": "To be fair....now that the ZF has a SnapDragon, perhaps Android will not be the #1 consumer of the battery.", "time": "07-12-2016 03:33 PM", "replies": []}, {"postID": "post5262615", "text": "True. Just think how much better the ZF2 would've been if it had a Snapdragon instead of an Atom!", "time": "07-13-2016 01:12 AM", "replies": [{"postID": "post5263077", "text": "Right up until I flashed CM, I thought the kernel had something to do with the excessive drain. No much changed after CM.", "time": "07-13-2016 09:20 AM", "replies": []}]}, {"postID": "post5517235", "text": "Yes and No. I purchased the ZF2 Intel model with lots of storage with the expectation of using it as my primary communication device for two years. But 9 months later the wifi interface started disappearing and has gotten so bad that after 1+ year of usage that it barely works long enough to download app updates from the play store. It often looks like a software issue but there are also some clues that point to bad hardware. I have never rooted but have considered doing so with the assumption of getting access to troubleshooting tools and logs to better see what is happening. Right now I am looking for a new phone and do not want to reward Asus with my next purchase but I might due to price/performance. I like the processor choice of the snapdragon 625 but dislike the glass case back. If the ZF3 still had the lightweight back with dual sim and simultaneous microSDXC and removal battery I think it would be most appealing for many consumers.\nI am okay with a little bloatware, especially if they are relatively simple and fundamental apps; like the FM radio tuner, photo gallery viewer, contacts, etc. A few good choices could provider a better out-of-the-box experience for the first time buyer or someone who lives in a place with slow or spotty internet connections. I don't mind moving the unused Apps over to some corner of the phone as long as they don't take up too much space or run.\nI would also like faster Android updates, but having the latest is not so critical since most of the interaction is with individual apps. I prefer software stability and performance more than any flashy OS feature.\nI have been considering higher end phones such as the ZTE Axon 7, OnePlus 3 and lower end ones like the Moto G4. If the Axon 7 included a FM radio or the OnePlus 3 supported mircoSD they would probably win out but since they do not I am back to looking at the ZF3 but due to past issues and glass case I may ultimately go with the Moto G4 (Plus or non-Plus). Still researching before making a purchase.", "time": "10-23-2016 03:39 PM", "replies": []}, {"postID": "post5554424", "text": "I am actually trying to decide between the Zenfone 2 and the Zenfone 3 for an unlocked device upgrade. I have researched that there is quite a bit of bloatware on the 2, but that some of those apps can be deleted. It's hard to make a choice between the two. Maybe my wallet will make it for me... .", "time": "11-09-2016 08:50 AM", "replies": [{"postID": "post5564902", "text": "Well ill say this... I did own the z2 was nice just today got me the z3 and wow this phone is awesome and way way better than z2... From build quality to how well it just works smooth and bloody fast, great for multitasking. \nIt's crazy how much phone u get for us money and honestly not as much in junk apps preinstalled as on z2 most are unable or can be uninstall or disabled. \nI'm running nova beta on my but the stock theme store has lots of cool stuff. \nHere is my setup.", "time": "11-15-2016 08:51 PM", "replies": [{"postID": "post5570319", "text": "Wow, that is a great setup! And thank you for your input - I really appreciate it! I think I will go with the 3.  Thanks again!", "time": "11-19-2016 10:32 AM", "replies": []}]}]}, {"postID": "post5590048", "text": "I've been using the ZF2 for about a year now, and just shattered the screen this week. I had a ZF3 on the way anyway, so not a huge deal, but I do worry about the extra glass face. Will probably do the \"responsible\" thing and actually use a case this time. \nThe fingerprint sensor was really the only thing I was missing from the ZF2. A premium build quality was also missing, so that's two things that would make it a worthwhile upgrade for me. OIS is nice and all, but I don't take a ton of pictures.", "time": "12-02-2016 01:48 PM", "replies": [{"postID": "post5590464", "text": "Sorry to hear that your screen broke, but that's exciting news about your new Zenfone 3! Enjoy!", "time": "12-02-2016 07:34 PM", "replies": []}]}, {"postID": "post5833989", "text": "In the begining, no, i was thinking in the same way that you guys.\nBut the ZF2 glass have broken last week and I decide to buy a Zenfone 5.5 64GB.\nAnt it was a really nice choice. ZF3 is much better than ZF2 in all of aspects. Don't get me wrong, I still think that ZF2 is a good smartphone with very low cost. But there's nothing to compare with ZF3.\nZF3 is faster, more responsive and smothier. Looks like it have a much better RAM management to0 because apps don't reset even with a very high usage.\nThe camera have no comparison at all. It's not the best camera, but much, much, much better than ZF2 camera.\nAnd the battery, OMG, the battery. With ZF2 at 12pm I had only 20% or 25%. With ZF3 i can get 70% at the same time. Using in the same way, maybe more because it's a new smart and you want to use it much more than usual.\nThere's no Fast Charge, but you will never need to charge it before sleep. Never. And even without a Fast Charge, the charge is fast. 1% by minute on 2a==5v charger. More than enough. Yeah, would be nice a QC/Turbo/Fast Charge, but theres no real need on it in this particularly smartphone.\nZF3 screen is much better. Much brighter if you want, more detailed and can be really dark if you want too, much darker than ZF2. It is a really nice screen, you can see it on GSM Arena review.\nAnd, of course, Android 7. Asus have made a better UI, much more reliable, beatiful and responsive.\nSo if you are satisfied with ZF2, that is a good smartphone even these days, keep it. But if you want something better, have a look on ZF3, because it is really much better.", "time": "05-31-2017 06:31 AM", "replies": []}]}, {"title": "Asus Zenfone 3 Zoom", "thread": [{"postID": "post5807943", "text": "Hi, is there a forum for this phone? It was just released in the US today and but I couldn't find any threads on it. Sorry in advance I missed it....", "time": "05-09-2017 07:51 PM", "replies": [{"postID": "post5808920", "text": "As of yesterday there was no forum created for the 3 Zoom.\nI was interested in getting some general discussion about this phone going also & posted this thread yesterday. http://forums.androidcentral.com/ask...ml#post5807825\nMaybe a moderator could link our to threads together & we can get some activity going?", "time": "05-10-2017 12:22 PM", "replies": []}]}, {"postID": "post5816990", "text": "Still no article about this phone on Android Central.... The initial reviews I've seen have been pretty positive. Some say that the cameras beat out the Moto G5 plus and come pretty close to the iPhone 7. Hopefully they'll upgrade to Nougat soon.", "time": "05-16-2017 10:25 AM", "replies": []}, {"postID": "post5829405", "text": "I've only seen a couple thread posts concerning the Asus Zenfone 3 Zoom. Sorry! I'm in the market for a new phone myself and the 5000 mAH battery sounds nice. The Asus Zenfone 3 Zoom doesn't seem to be getting much in the way of publicity except for some articles talking about the battery or obscure reviews on YouTube. Nothing against them, but I'd love to see JerryRigEverything do a durability test on this device and Mr. Mobile do another amazing review if possible! I'm hoping there'll also be news on a Nougat update sometime soon considering I'm coming from a Moto X (2014) that has started to act up in the battery department. Great phone and customization but I want to move on from Marshmallow to see what Nougat has to offer. I've also heard that the ZenUI isn't the greatest when it comes to skins and that the Asus Zenfone 3 Zoom is getting this odd white line appearing on some owners' screens. \nI'm also waiting to see how the Moto X4/Moto X 2017 and OnePlus 5 turn out though. I'll probably end up picking something else up soon before either device have released since I'm getting a bit tired of waiting. Leaks can only do so much! I have some difficulty when it comes to Qualcomm Snapdragon chipsets. I've heard that the 625 is excellent but their numbering systems seem convoluted, so I can never tell if I'll still be getting a good deal if it it's not a smartphone with the SnapDragon 821 or 835. ¯\\_(ツ)_/¯\nIf you haven't seen it already, Geekception did an interesting review on the phone, camera and gaming performance. Here's the review and the other two videos are separate. He put the Zenfone 3 Zoom up against the iPhone 7 in the camera test. There wasn't much extended gaming or even temeperature checks in the gaming performance test though.\nHere's to what may (hopefully) happen in the coming weeks!", "time": "05-26-2017 07:14 PM", "replies": []}]}, {"title": "Asus Zenfone 3 Zoom", "thread": [{"postID": "post5716431", "text": "I was really disappointed that the Zoom 3 was never released in Feb. Now that's it's being pushed back to quarter 2 for upgrades, do you know when within Q2 that it might be released in the US?\nI was personally fine w/ the specs though I wouldn't complain about a camera upgrade. I thought the SD625 was a snappy enough processor & really liked the $400 price point for that phone.\nAlso, any idea what area(s) they might upgrade?", "time": "03-18-2017 03:14 PM", "replies": []}, {"postID": "post5718414", "text": "Totally forgot about that phone until just now! Sorry –*no inside scoop on anything ASUS-related. Wish they'd make more of an effort to push their stuff here in the States, as they do make some interesting handsets. I agree with you that a Snap 625 + $400 price point = win.", "time": "03-20-2017 11:16 AM", "replies": [{"postID": "post5719173", "text": "Thanks for the response. Any other dual rear camera phablets you might be looking forward too in 2017? \nI agree for a company that makes some nice smartphones, there's not enough brand recognition in the US w/ that area.", "time": "03-20-2017 10:01 PM", "replies": []}, {"postID": "post5826620", "text": "Funny you said this was a win at $400 because it comes out even cheaper at $329 and has good reviews but still no mention at all on android central. The only thing I can figure is that it's being ignored because it's shipping with Marshmallow. Even so, it still seems like a good deal. Not everyone needs the latest and greatest OS.", "time": "05-24-2017 11:55 AM", "replies": []}]}]}, {"title": "ASUS ZenFone3 Deluxe 5.5\" How does the 625 CPU perform on the ZS550KL?", "thread": [{"postID": "post5710314", "text": "I was wondering how the 625 CPU performs on this phone, really don't need the 5.7\" screen of the ZS570KL and I am not sure that the difference in the 820 vs the 625 is worth the $100 difference in price. Was looking for opinions from owners of the 5.5\" ZS550KL. Thank you.", "time": "03-12-2017 11:06 PM", "replies": []}, {"postID": "post5814469", "text": "I've only had mine for about a week and the only lag I am noticing with the 625 is occasionally loading the homescreen when jumping out of a more intensive app. Otherwise any differences are too small for me to notice between the 625 and my previous Samsung GS6.", "time": "05-14-2017 01:37 PM", "replies": []}]}, {"title": "Do i must download Asus software update?", "thread": [{"postID": "post5805216", "text": "The three things that it's updating I don't even use. ( Fingerprint sensor, power Master app, and pattern screen lock.)", "time": "05-07-2017 08:11 PM", "replies": []}, {"postID": "post5806326", "text": "I'd check the Zentalk forums to see if anyone is having any issues with the update. If not, then go ahead and do it -- they often throw in a few other bugfixes with each update. In addition, it probably also contains a more recent Android security patch.", "time": "05-08-2017 05:34 PM", "replies": []}]}, {"title": "My data connection is enabled but not working it doesn't show any signal like \"3g or 4g\".", "thread": [{"postID": "post5805400", "text": "Guys help me. I'm using Asus Zenfone 3 ZE552KL. I tried all the things i can do like the apn i change it and also reset it to default. Also i tried to change my sim card but with the same network in just two days it's gone and nothing displays on my phone. But when i try other network's sim card it works. It started all of this when i try VPN for my unlimited internet. I think it's the reason behind all of this and i don't know what to do. I'm from the philippines btw, the sim card i'm using that is not connecting is Talk n Text. I'm asking for your help guys. Thank you...", "time": "05-08-2017 12:37 AM", "replies": []}, {"postID": "post5806312", "text": "Welcome to Android Central! Moved from the Nougat forum to the Zenfone 3 forum.\nWhich version do you have? It looks like are at least 4 different regional variants: https://www.asus.com/Phone/ZenFone-3...pecifications/\nGo to Settings>Mobile Networks>Preferred Network Type​. What is is set to?", "time": "05-08-2017 05:26 PM", "replies": []}]}, {"title": "New Zenfone3 screen flickers. Return?", "thread": [{"postID": "post5789464", "text": "Just got a Zenfone 3 Asus from Best Buy and noticed a couple times screen is flickering. Should I return it?\nIs LG better?", "time": "04-28-2017 02:54 AM", "replies": []}, {"postID": "post5790160", "text": "if it's still under warranty so yes you should contact them.", "time": "04-28-2017 12:02 PM", "replies": []}]}, {"title": "How to purchase a theme using zenfone 3?", "thread": [{"postID": "post5748589", "text": "I don't have a option to purchase themes in the theme store using my zenfone 3. All the paid themes show unavailable for download. I would like to buy themes so I am wondering what the problem is with my phone.", "time": "04-07-2017 01:56 PM", "replies": []}]}, {"title": "What bloatware exist on the newer nougat update?", "thread": [{"postID": "post5707409", "text": "I'm thinking about buying the Zenfone 3 Zoom when it becomes available for purchase but before I settle on my decision, I'd like to know from you please what bloatware, for those who updated to the latest nougat, that can be uninstalled completely and which that can't be uninstalled? (i.e. disabled only).\nI've heard that Asus kinda responded to the complaints about their bloatware so I'd like to know how far they complied with these complaints because I might continue searching for another phone if I'm unable to get rid of the garbage!", "time": "03-10-2017 09:56 AM", "replies": []}, {"postID": "post5711254", "text": "I purchased one Zenfone 3 (not zoom though) for my dad and I only noticed one strange internet browser that can be removed. Other than that there is really nothing that striked me (there is some Asus utilities that you may never use, but they will never get in your way)\nIn fact when you set up the phone, it does ask you what additionnal software you want to download.\nThe default texting is 'Android messages' and the default email client is Gmail, the default browser is Chrome.\nIt's a nice and good phone (I do have a S7 edge myself and this Asus does support the comparison)", "time": "03-13-2017 07:02 PM", "replies": []}, {"postID": "post5711611", "text": "Thanks for your feedback. I'm very surprised because what you say conflicts with what so many people are complaining about. That is bloat that they can't uninstall. Anyway, I'll be waiting for more feedback from people who actually bought any of the latest zenfone 3 series and installed the latest update to confirm about the status of bloatware. I'll never ever spend my hard money on a good hardware phone but loaded with software that I can't control! I hope Asus finally takes into account such a major complain.", "time": "03-14-2017 05:22 AM", "replies": []}, {"postID": "post5712410", "text": "ok. Let me know if you want the list of asus apps installed before I give the phone to my dad around March 22.\nThe only thing that may be an issue : right after nougat update, the 'Apps 4 U' folder that I deleted when I first set up the phone (contained puff browser that I unistalled, instagram and another app I forgot), was recreated and this time there was two games in there, I also uninstalled them. Since then this folder has not returned.\nI also made my cousin purchase an Asus tablet and there was nothing crappy on it too (I recommended this tablet because of the kids mode asus has)", "time": "03-14-2017 06:46 PM", "replies": []}]}, {"title": "Car charger and Car Play", "thread": [{"postID": "post5709643", "text": "I just bought my ZenFone 3 max and would agree about the robust battery life.\nI seem to have the same problem I have with other Samsung phones in that when you are in the car you have to buy a high output charger to be able to keep this thing charged. The phone was dying at the end of the day and I hooked it up to the car through the output of my new Malibu, and is was charging,but not enough to charge faster than what I was using with the phone screen on.\nWhat kind of charger do you need here?", "time": "03-12-2017 08:50 AM", "replies": []}]}, {"title": "Zenfone 3: Introduces OIS & EIS", "thread": [{"postID": "post5386203", "text": "OIS & EIS in Zenfone 3\nToday, I'd like to introduce you to my second post on Android Central. Like the earlier post, this post revolves around Zenfone 3, too! A camera enthusiast, I'd like to talk about the device's key camera features, which I believe really stands out. Not sure, how many of you would agree with me, but just a perspective! \nBefore I could go ahead with the device's camera details, let me introduce you to the basics of Photography! \nHow we should ideally shoot a photo: Look or select a subject of our choice, compose a good frame, focus over the subject, and finally control and balance the shutter speed and aperture, following which you could shoot! FYI, this is just the little we can see and witness on the out, but there's so much happening on the inside while we begin to shoot the picture. Let me take you through something that you may have probably missed out on:\nThe very second you press over the shutter button , not only would it open up but would also let in light, as per the shutter speed given. Whatever however happens during this process is that even the slightest shake or blur would result into a blurry image. Here's how the blur takes place: When you click the shutter button, the shutter immediately lets in light, during this process, the slightest shake will hamper the shutter from the process and will therefore deliver a blurry image.OIS (Optical Image Stabilization)\nIn situations, such as mentioned above, the only solution to such blurry images is OIS. The Zenfone 3 fortunately comes with OIS, how awesome is this right? Although, before we could begin understanding the working of OIS, let's understand how the shutter speed works.\nI often look at the Shutter Speed as a mouth that opens and closes as per the speed assigned by the person. In other words, higher the shutter speed, the less light it would let in. When you shoot with a high shutter speed, you would not end up with a blurry image. However, when it comes to a low shutter speed, because the shutter stays open for long, it lets in more light and therefore increases the chance of a shaky image. \nMoving on, Let's now understand how the OIS works:\nWhat's the Role of OIS and how it could better your Zenfone 3 Camera Experience?\nLet's admit the fact that we're human are bound to error, especially when it comes to the camera. We cannot always control or shake unless we make use of a super stable platform or tripod to shoot. However, OIS in such situations could help rescue a shaky image. If you're wondering how, little help you with this bit: OIS works through something called gyroscopic sensors that are seen within the lens. The main function of the gyroscopic sensor is to sense if the image and sensor aren't aligned as it should. \nWhat the OIS system does is that it further makes use of two gyros within the lens, usually for Pitch(camera rotation from left to right) and Yaw(Up and down movement). \nHere's a little demonstration I picked up from one of the ASUS write ups. \nAs you can see in the image above, both images have been tested with the OIS and without. You'll be able to tell the difference\nHere's an additional demonstration to help you understand how OIS works! (Video clip picked from an ASUS related article) EIS (Electronic Image Stabilization)\nIf however, you're someone who loves working with videos, like I do, sometimes, the Zenfone 3 still makes a good choice. Based on my hands on with the phone, I can personally say that it's great with videos. This is because the device comes with the EIS feature. \nHere's how Zenfone 3 would better your video experience: \nUnless you've got real steady hands or own a tripod, you're going to end up with shaky videos. \nThis is when the EIS function comes handy. Through the help of a light sensing chip, the EIS system reduce possible shakes or moves. Just for your knowledge, Videos are actually made up of endless images that come together and make a video. Once the image makes its way to the chip and if a camera shake is detected through the sensors and is comprehended by the system, it responds immediately by moving the image accordingly. Example: If the camera shakes towards the right during a pan or otherwise, the system will eliminate or correct this shake by moving it to the left.\nHere's a small demo to help you understand the stability seen through EIS in videos:", "time": "09-02-2016 05:34 AM", "replies": []}, {"postID": "post5649604", "text": "Hello.\nFor photographs wat is the best: Huawei Nova (not Plus) or the Asus Zenfone 3 ZE520KL ?", "time": "01-19-2017 02:33 PM", "replies": []}, {"postID": "post5670647", "text": "Very nice write up, please let us know how the phone is holding up.\nThank You", "time": "02-07-2017 02:10 PM", "replies": []}]}, {"title": "Is the ZE552KL compatible with Freedom (WIND) Mobile?", "thread": [{"postID": "post5597619", "text": "So, my shiny new ZenFone 3 came in today, and I'm having issues connecting to Wind Mobile (now known as Freedom Mobile) up in Canada. Anyone have success connecting to Wind with the Z552KL? Yeah, there's a spec sheet with band support listed, but they've got like a dozen different regional models here. I THINK this is a Taiwanese version (seeing TW on a few of the serial numbers on the back). Any help here would be great.", "time": "12-07-2016 04:45 PM", "replies": []}, {"postID": "post5597691", "text": "https://apn-canada.gishan.net/settin..._zenfone_3.php", "time": "12-07-2016 05:52 PM", "replies": []}, {"postID": "post5599336", "text": "Good luck with this! If you need any more help, I suggest contacting Wind or going to your carrier with your device so they can point you in the right direction. Keep us updated, and congratulations on your Zenfone 3! I can't wait to buy mine!", "time": "12-08-2016 05:16 PM", "replies": []}, {"postID": "post5663300", "text": "I have an Asus Zenfone 3 Z012DC (Canadian Version bought at Staples) and it connected to the Freedom/Wind network no problem. I'm worried that your model isn't compatible with the frequency bands used by Freedom.\nEdit: Admittedly, I was having trouble getting it to send MMS and took a look at the link provided by Sergiusz Jasper above. I would try going into your settings and making sure they match the ones from the link. It fixed my MMS issues and could possibly get you on the network. GOOD LUCK!!", "time": "01-31-2017 02:53 PM", "replies": []}]}, {"title": "How to lock/secure boot.", "thread": [{"postID": "post5635569", "text": "Hello guyz I have asus zenfone 3(ZE552KL) Indian piece. I want to lock my phone in such a way that even if someone tries to factory reset it (after switching it off and using power button + volume button) would require a password to do so ( I mean that phone should require password/or similar to load the boot file even for the factory reset options).It is android marshmallow original ROM. I am trying to avoid rooting since the phone is just 4 days old and hence in warranty and also because I am amature in these things at this stage.", "time": "01-08-2017 06:15 AM", "replies": []}, {"postID": "post5636544", "text": "Welcome to Android Central! Android has a Factory Reset Protection feature, where if a phone is factory reset without first properly removing the associated Google account, then the user has to enter that account's name and password in order to proceed to the Setup Wizard. Is that enough for you, or is it more important to prevent someone from even doing a factory reset? The problem with the latter is that any app that could do this would most likely require root, and also not be effective against a factory reset attempt through the Recovery Menu.", "time": "01-09-2017 12:19 AM", "replies": []}]}, {"title": "Zenfone 3 KE520KL or Xiaomi Redmi Note 4", "thread": [{"postID": "post5538348", "text": "Hi guys! As I can't choose a flagship phone for this year ever since they recalled my Note 7, I plan to buy a midrange phone and I'm having a tough time deciding which one to get. Anyone care to help? Which is more worth it? \nGetting either \na secondhand Zenfone 3 32gb/3gb 5.2\" for 215usd\nor a brand new Xiaomi Redmi Note 4 64gb/3gb for 195usd\nThanks in advance!", "time": "11-01-2016 03:28 AM", "replies": []}, {"postID": "post5580902", "text": "Hi there! \nI may have a biased opinion here, as I am currently researching the Zenfone 3 as a potential upgrade in the New Year; but I think both choices could work well.\nYou can now buy used or refurbished phones from various avenues and be very happy with them - and lots of them come with warranties or guarantees - but if you do get the Zenfone, make sure to have a warranty or receipt or any kind of information with regards to returns or exchanges. \nSorry that this response is so late! Did you end up deciding on a phone?", "time": "11-26-2016 10:38 AM", "replies": []}, {"postID": "post5635575", "text": "I am using Asus zenfone 3(ZE520kl) (5.2 inch one). It's too good. I haven't used redmi note series phone but I guarantee that you won't be disappointed by the asus phone.", "time": "01-08-2017 06:19 AM", "replies": []}]}, {"title": "Zenfone 3: Introduces 4K", "thread": [{"postID": "post5375180", "text": "Zenfone 3: Introduces 4K\nIf you're someone who loves taking home memories, those you would be able to cherish several years down the line, the Zenfone 3 camera comes across as quite a decent device to invest in. \nForget about investing in expensive camcorders or video recorders, the Zenfone 3 would suffice all needs. I can proudly say this- having tried and tested the phone. It's amazingly good! \nEvery time I shoot a video through the Zenfone 3, I always associate it to luxury. Here's why: The device supports 4k Video recording and tags along optical image stabilizers and electronic image stabilizers. These stabilizers ensure shake-free photos and videos. \nIf you're however not familiar with the term 4K, the below write up explains it:\nPixels that are also recognized as tiny dots of light, work together to complete a given video you ideally watch on your screen. In order to view perfect 4K Videos, the phone display works around 4,000 pixels around the screen area and 2,160 pixels in the vertical pattern. Amazing right?\nIf we compare 4K with a Television set, common Television sets (not those high end expensive sets) deliver about 1080p HD TV, while 4K through smartphones deliver up to 2160p. This would mean that 4K videos deliver nothing but clear and sharp images, four times the amount of pixel when compared to a common television set. Hope it's not too confusing, I tried breaking it down for you! \nThis may come as a surprise to you but 4K isn't actually new! 4K has been out and alive ever since 2003. No sooner, did it come to cinema in the year 2011. Fortunately for us, it soon came to home theatres till 2012.\nIt's good to see Zenfone 3 with 4K honestly, given the fact that just a few devices in the market tag along this super cool feature. \nIf you're thinking of buying the Zenfone 3, in all honesty, I'd recommend the buy. Let's consider a few advantages of the 4k display that I've personally come across:\n1. Stabilizes shaky videos\n2. You could expect to capture sharp images and videos\n3. Don't bother about blurred pics especially through a zoom\nThe big question however revolves around the device being able to accommodate such high end videos. I'd say, the Zenfone 3 would be able to accommodate, our opinions would however differ. \nA one second video for example would require a good 11MB space while a 10 minute would require 7GB. Considering these, the Zenfone 3 comes with an inbuilt storage of 32GB. I think if you backup your data regularly, you shouldn't face storage space issues. What's even better, the Zenfone 3 Deluxe and Ultra come with a good 64GB space. \nI'd reckon that there's ample amount of space, that Zenfone 3 offers. It's a good deal, isn't it?", "time": "08-29-2016 05:55 AM", "replies": []}, {"postID": "post5375261", "text": "It is nice that they added it but honestly I don't use 4k video recording even though I have had devices since 2013 that supported it", "time": "08-29-2016 06:43 AM", "replies": []}, {"postID": "post5375314", "text": "It always comes in handy, considering we all love Quality videos", "time": "08-29-2016 07:10 AM", "replies": []}, {"postID": "post5559844", "text": "Thank you, OP! This is very good to know, as I am seriously considering buying a Zenfone 3. And my hands sometimes shake a bit while videotaping or taking pictures, so this kind of image stabilization would be great for me!", "time": "11-12-2016 03:41 PM", "replies": []}]}, {"title": "Release Date-July 12", "thread": [{"postID": "post5246682", "text": "According to GSMArena, the Zenfone 3 line will first be released in Taiwan July 12, but no other countries have been announced yet. Judging by when cases for the Zenfone 3 Ultra on Amazon will be released, I imagine the rest of the world will get these phones during the month of July as well.", "time": "06-30-2016 08:21 PM", "replies": []}, {"postID": "post5254873", "text": "Although i just got the OnePlus 3 a week or so ago i am tempted to also get the Deluxe model. It looks like a stunning device.", "time": "07-07-2016 08:14 AM", "replies": []}, {"postID": "post5554431", "text": "Four months later and it still seems like a stunning device and experience!", "time": "11-09-2016 08:57 AM", "replies": []}]}]
[{"title": "Zenfone 3 flip and the cases", "thread": [{"postID": "post5447687", "text": "I am new to the Zenfone, but one thing I have noticed is there have been what look to be identical cases (flip cases) for past models.\nI am considering the Zenfone 3, but am wondering if official flip cases are made by other companies who market under their own name, such as seen in this Italian video comparing an ASUS snd a Nillkin case.  \nAnyone know?\nI have seen other models that also look the same, such as TopAce, etc. Nillkin gets the most hits. Are they the makers of the official case?\nRelated question. Will a flip case take a tempered glass screen protector? I tend to think no since there is also a protective screen built into the case. As such, maybe better to get a good number or other case with a tempered glass protector? bUt I hear the zenfone 3 is partly curved and may be a challenge for such glass protectors.What do others have to say?", "time": "09-26-2016 10:36 AM", "replies": []}, {"postID": "post5554430", "text": "Hi! I'm sorry, I can't really answer most of your questions! However, I have heard that curved screen/glass edges do make screen protector purchases/usage a bit complicated. I believe I had read some Edge users on here lamenting about it being difficult to find good screen protectors for that reason. \nHowever, I would suggest buying screen protectors either from Asus themselves or any that are in some way endorsed by Asus. Or get someone to install the protector for you so it's on them if anything is not installed properly! \nI am curious: did you end up purchasing the Zenfone 3? How are you liking it? Hope you found a case and screen protector that are to your liking!", "time": "11-09-2016 08:56 AM", "replies": []}]}, {"title": "Zenfone 3 pricing not as competitive as Zenfone 2", "thread": [{"postID": "post5361565", "text": "The ASUS Zenfone 3 just launched here in the Philippines and it's a bit pricier than I anticipated. The 5.2 inch version costs around $399 while the the 5.5 inch version costs around $449. While it's still a better bang-for-buck than many phones from brands like Samsung, I was honestly expecting the price to be lower, especially since the price mentioned last May in the global announcement was $249 for the 5.2 inch version. I'm really disappointed in ASUS for this massive deviation. The Zenfone 3 lacks that \"great deal\" feel that the Zenfone 2 had when it was released. It seems ASUS is moving Zenfone from a budget brand to a more premium brand like Samsung. What do you think? How do you feel about ASUS heading in Sony's direction?", "time": "08-24-2016 10:09 AM", "replies": [{"postID": "post5459857", "text": "Well of Asus is moving in Sony's directions definitely it's gonna end up like Sony. Sony is having problems of low sales due to same fact. The pricing is just not right. They always keep their phones pricing higher than the competitors. That's the reason their sales have gone down drastically.", "time": "10-02-2016 02:34 PM", "replies": []}]}, {"postID": "post5361675", "text": "I agree that it's disappointing--unless the phone turns out to be amazing, and gets updated regularly! I still find my Zenfone 2 to be a really good phone, but it's a shame that ASUS seems to have given up on Marshmallow for it.", "time": "08-24-2016 10:43 AM", "replies": []}, {"postID": "post5373133", "text": "The Zenfone 3 5.2\" version was great for me the last 3 weeks. Very fast, good battery life (about more than 6 hours of screen on time with 15% left), better than expected camera, beautiful design and feel great in hand. And I'm lucky enough to get it with just around $320 with a promotion for early buyers, in Vietnam.", "time": "08-28-2016 07:54 AM", "replies": []}, {"postID": "post5373139", "text": "", "time": "08-28-2016 07:56 AM", "replies": []}, {"postID": "post5373168", "text": "", "time": "08-28-2016 08:07 AM", "replies": []}, {"postID": "post5451313", "text": "if they only stick to their pricing like in the previous ones, it will sell like pancakes and they'll overtake other brands in terms of market share. they should've conquered the market first before imitating Samsung's pricing.", "time": "09-28-2016 02:25 AM", "replies": []}, {"postID": "post5507704", "text": "The pricing is a disaster. Zenfone Laser is $300 with Snapdragon 430 should have been $150.\nZenfone 3 5.2 inch is $350 with Snapdragon 625 should have been $200,Zenfone 5.5 inch is $400 should have been $250,Zenfone Ultra with 6 inch 1080p display and Snapdragon 652 is $750 are you freaking kidding me Asus?? Should have been $350 and finally Zenfone Deluxe with 6gb ram, 256gb storage and Snapdragon 821 is $1000 LOL. Should have been $500.\nAsus thinks they are Apple when they are worse than Xiomi.", "time": "10-20-2016 06:54 AM", "replies": []}, {"postID": "post5554426", "text": "Looking at the price of the 2 versus the 3, yeah, it's a little scary! Trying to decide which of the two to get, and it looks like the 2 might win out. However, both phones are still nowhere near the cough-up-of-cash that is Samsung and Apple. :P", "time": "11-09-2016 08:53 AM", "replies": []}]}, {"title": "Zenfone 3 Laser now available in US and Canada", "thread": [{"postID": "post5440031", "text": "The Zenfone 3 Laser can now be purchased on Amazon.", "time": "09-22-2016 04:55 PM", "replies": []}, {"postID": "post5449149", "text": "Is Amazon safe when buying products? Coz I saw a post on fb about a man buying an iphone 7 and later on, he receive an iphone 3 and iphone 4 plus a polymerization card which is unfortunate, I want a Zenfone 3 Laser but I fear that it could happen to me.", "time": "09-27-2016 02:27 AM", "replies": [{"postID": "post5457778", "text": "If you're buying from Amazon itself, yes. If it's a reseller on Amazon, you have to look at the seller ratings.", "time": "10-01-2016 07:02 AM", "replies": []}, {"postID": "post5496206", "text": "I feel like any kind of buying and selling site like Amazon has some bad apples; but as long as you do your research on your seller and you have a clear and honest agreement about pricing, returns, etc, then you should be fine.  Good luck!", "time": "10-15-2016 09:15 PM", "replies": []}]}, {"postID": "post5507695", "text": "This phone is a fail. $300 for Snapdragon 430 are you kidding me? Redmi 3S has the same specs for $105.", "time": "10-20-2016 06:48 AM", "replies": [{"postID": "post5522744", "text": "I googled that phone, was seriously considering buying it for that price (that you quoted at $105 USD). In Canada, only place I can get this phone is amazon.ca for $378.45CAD, wheras the ZenFone 3 Laser on amazon.ca is $299.98CAD. Where did you get it for $105?? Even with exchange rate it would be a good deal.", "time": "10-25-2016 12:57 PM", "replies": [{"postID": "post5522878", "text": "That's the price in India. You could also try importing it from other countries. Some of these Google links might help. http://www.google.co.in/search?hl=en...onal+shipping+", "time": "10-25-2016 01:42 PM", "replies": []}]}]}]}, {"title": "ZenFone 3 Laser - blue dot", "thread": [{"postID": "post5509867", "text": "Just bought the ZenFone 3 Laser... when in the camera app, I can see a blue dot on the screen, it moves around as I move the phone. After taking a picture, the blue dot is there somewhere. Anyone else can reproduce?", "time": "10-20-2016 07:59 PM", "replies": [{"postID": "post5522709", "text": "I'm the OP. Just wanted to specify that the blue dot showed up when facing a bright light source, like the sun, light bulbs, etc. I returned the phone (Best Buy) and didn't get a replacement. Will wait to see if it's a one-off or production line issue.", "time": "10-25-2016 12:47 PM", "replies": []}]}, {"postID": "post5509895", "text": "Mod note. Moved to the Zenfone 3 forum for more visibility.", "time": "10-20-2016 08:08 PM", "replies": []}]}, {"title": "Asus Zenfone 3 Bricked No Bootloader", "thread": [{"postID": "post5510499", "text": "Hello,\ni've tried to root my phone (asus zenfone 3 MAX) by uing this guide on youtube \nnow my phone is bricked (black screen when i turn it on, the phone vibrates from time to time)\nalso bootloader is missing / can't enter recovery menu\ndoes someone here know how to fix it? :-/", "time": "10-21-2016 01:31 AM", "replies": []}]}, {"title": "Zenfone 3 approved by FCC", "thread": [{"postID": "post5329892", "text": "Hey everyone,\nAccording to Pre Order Zenfone 3 - Zenfone 3 Review, Where To Buy, Deals, and News, Zenfone 3 models have passed through the FCC, and should be on sale within 6 weeks.", "time": "08-15-2016 05:43 PM", "replies": []}, {"postID": "post5334360", "text": "Glad to see there's some news as to when these might be available. They are in the running for my next, along with the Robin and Nexii.", "time": "08-16-2016 11:06 PM", "replies": []}]}, {"title": "ZenFone 2 Successor", "thread": [{"postID": "post5201966", "text": "A sleek metal and glass design and good performance from the Snapdragon 625 - and without a hefty price tag - the ZenFone 3 is an exciting development of the earlier model.ASUS ZenFone 3 preview: High-end, mid-range and just plain enormous | Android Central", "time": "05-30-2016 08:50 AM", "replies": []}, {"postID": "post5201984", "text": "Alex makes a good point in now that Qualcomm is the chip in the phone, what price point is this device going to be? We will have to wait and find out.", "time": "05-30-2016 09:10 AM", "replies": []}, {"postID": "post5204628", "text": "Any word on possible release date? After seeing the zf3 in the sapphire and aqua my wife and I are probably going to get those instead of new iPhones. We could get 2 phones and two zenwatch 2s for less than the cost of one ip6s.", "time": "06-01-2016 04:54 AM", "replies": []}, {"postID": "post5207689", "text": "As per rumors the Zenfone 3 will be launched in 2nd week on August 2016. \nYou can be updated about all the news here :ZenTalk", "time": "06-03-2016 01:36 AM", "replies": []}]}]
