[{"title": "hello sir, i'm using honor 4x rooted device indian version.", "thread": [{"postID": "post6005891", "text": "I tried to install twrp recovery using official app but my phone got stuck in fastboot rescue mode i cant go back my phone is unlocked please me out to solve this problem.\ni tried holding power button but it shows honor logo and again goes back to fastboot rescue mode\nplease help me sir \nTHANKS....", "time": "10-05-2017 12:47 PM", "replies": []}, {"postID": "post6006877", "text": "Moved to the Honor 4X forum.", "time": "10-05-2017 11:25 PM", "replies": []}]}, {"title": "Why my mobile won't start..?", "thread": [{"postID": "post5995641", "text": "i have honor G620S-Ul00 4.4.4 it won't start i keep press vol+power button 15 sec but it does't work at all it only shows android it won't turn on help me to fix this problem..", "time": "09-27-2017 06:12 PM", "replies": []}, {"postID": "post5997364", "text": "Welcome to Android Central! It's likely a problem with the firmware or hardware. Unfortunately, there may not be much you can do. I assume it's no longer under warranty, correct?", "time": "09-29-2017 12:37 AM", "replies": []}, {"postID": "post5997430", "text": "Maybe the battery is died or the connection is short.", "time": "09-29-2017 04:12 AM", "replies": []}]}, {"title": "Huawei Honor 4C battery drain problem. Is there a solution?", "thread": [{"postID": "post4570915", "text": "Huawei Honor 4C battery is draining so fast even when not in use. Over night the battery drops by 50-60%. Tried resetting to factory. But no use. Android OS, Android System apps using almost 50% of battery. Any solution??", "time": "07-24-2015 06:45 AM", "replies": [{"postID": "post4708070", "text": "Hello sir...there is not any solution to this battery drainage...simply sell this phone in olx.", "time": "09-25-2015 01:28 PM", "replies": []}, {"postID": "post5020511", "text": "", "time": "02-28-2016 03:22 AM", "replies": []}, {"postID": "post5020520", "text": "", "time": "02-28-2016 03:36 AM", "replies": []}, {"postID": "post5626633", "text": "Hello \nI m A huawei 4c user...I dont Have a issue to this Mobile ..it is a Best Mobile as well... Battery is also pretty well Even In Normal Or High Use.... Everything Us Good in This Mobile ...Just a Little Bit Problem Is Storage !!But can U Buy A Memory card...Then The Problem solve!!I advise You to buy This Mobile In weight of terms!!It is also At Low price But Similar To 30,40 thousands Mobile!!", "time": "12-30-2016 09:17 PM", "replies": []}]}, {"postID": "post4571010", "text": "Welcome to AC.\nWakelocks are probably responsible. Sometimes the problem can be fixed by a simple Power Off and Restart. Try that first and tell us if that does it.\nPosted via the Android Central App", "time": "07-24-2015 07:45 AM", "replies": []}, {"postID": "post4700825", "text": "Same problem here. I RMA'd my phone so we'll see if they'll give ma new phone or fix the current bug. \nHonor 4x", "time": "09-22-2015 08:52 AM", "replies": []}, {"postID": "post5020518", "text": "Hi sir, I'm the honor 4c user, facing the same problem the battery drain 50% over night, I just found the solution very easy. When you are going to sleep you need to switch on the airplane mode for 5 second then off it. Hope this information will help you.", "time": "02-28-2016 03:34 AM", "replies": []}, {"postID": "post5130074", "text": "Sir I am having the same problem. Please help with a better solution.", "time": "04-17-2016 04:50 AM", "replies": []}, {"postID": "post5130077", "text": "Sir I have bought new honor 4c one month ago and I am having this problem too, my battery is draining very fastly even on normal usage of phone. Can you please help me? You help will be highly appreciated.", "time": "04-17-2016 04:55 AM", "replies": [{"postID": "post5270586", "text": "Simply turn your your phone to airplane mode when you go to sleep I worked for me.", "time": "07-18-2016 09:00 AM", "replies": []}]}, {"postID": "post5976895", "text": "Guys close all your running apps.run your phone manager and restrict all the apps that runs bacground.close your data if your not using your phone.background apps is the one draining your battery fast.", "time": "09-15-2017 04:51 PM", "replies": []}]}, {"title": "The best micro SD card for my honor 4x?", "thread": [{"postID": "post5634415", "text": "Hi, my phone is \" Huawei honor 4x \" and i want to buy a fast sd card to use on it for now, and also I want to pick up something that doesn't get worn out (speed) in soon future if I wanted to use it on an faster phone that supports its full speed. \nMy current sd card is a 16gb \"class 6\" (Read:6mg/s, Write:2mg/s) that I guess is the reason my phone is a little slow. \nSo I found this \"Lexar high-performance UHS-I U3 Class 10 633x microSDHC 32gb\" and my question is does it perform well on honor 4x? please share your thoughts and your experiences with me, thanks", "time": "01-07-2017 12:54 AM", "replies": []}, {"postID": "post5634769", "text": "SD cards are not phone specific. Hard to go wrong with most ultra class 10's. My preference is SanDisk, but sure Lexar will be just fine.", "time": "01-07-2017 10:44 AM", "replies": [{"postID": "post5635511", "text": "ok sure, how about Samsung and Kodak? do you have any opinion about them?\ncuase I see some people are not happy with lexar on their phones, it seems it's better to buy a samsung for a phone\nI would really be thankful to know others expriences", "time": "01-08-2017 04:11 AM", "replies": [{"postID": "post5860941", "text": "I have had good luck with Samsung and sandisk cards. I would just make sure that you get an authentic card as some fakes can be of poor quality", "time": "06-23-2017 12:28 PM", "replies": []}]}]}, {"postID": "post5942297", "text": "scan disk class 10 is best", "time": "08-28-2017 03:55 AM", "replies": [{"postID": "post5943349", "text": "Which one? Sandisk makes multiple class 10 cards", "time": "08-28-2017 04:44 PM", "replies": []}]}, {"postID": "post5943870", "text": "SanDisk Ultra MicroSDHC UHS-I Class 10", "time": "08-29-2017 12:10 AM", "replies": []}]}, {"title": "Honor 4c sim signal problem", "thread": [{"postID": "post5915582", "text": "I have a honor 4c .its sim signals hide .there is no service masseg show .my device is unrooted and dual sim .same problem in both sim . Also reset but problem sam. Any solotion \nThanks", "time": "08-07-2017 03:31 PM", "replies": []}, {"postID": "post5915731", "text": "Have you tried another sim card?", "time": "08-07-2017 05:55 PM", "replies": []}, {"postID": "post5915802", "text": "My sim is working on another device proper", "time": "08-07-2017 06:45 PM", "replies": []}]}, {"title": "How to update andriod 7..1 In honor 4x?", "thread": [{"postID": "post5903884", "text": "could anyone let me know how to update honor 4x to andriod 7.1?", "time": "07-29-2017 02:36 AM", "replies": []}, {"postID": "post5904593", "text": "There is no official update to 7.1 unfortunately. There are methods that require root but I would only recommend that for the expeirnced user as you can brick the phone.", "time": "07-29-2017 03:17 PM", "replies": []}, {"postID": "post5907645", "text": "thank you dpham00, is there any way to update my honor 4x to VOLTE From LTE?", "time": "08-01-2017 01:17 AM", "replies": [{"postID": "post5908164", "text": "I have found this which may help youhttps://club.hihonor.com/in/announce...honor-4x.16219", "time": "08-01-2017 01:01 PM", "replies": []}]}, {"postID": "post5910507", "text": "thank you for being so kind dpham00", "time": "08-03-2017 06:51 AM", "replies": [{"postID": "post5910588", "text": "No problem, just let us know if it solves your problem!", "time": "08-03-2017 08:03 AM", "replies": []}]}, {"postID": "post5911667", "text": "ya Sure dpham00. But I think its unsolvable it seems... anyhow thank you and will let you know if i get my problem resolved.", "time": "08-03-2017 11:56 PM", "replies": [{"postID": "post5911684", "text": "Sorry to hear that. Hopefully someone who has experienced this problem can come in and help you solve it. Sorry I couldn't help more.", "time": "08-04-2017 12:14 AM", "replies": []}]}, {"postID": "post5911711", "text": "Ok anyhow thank You for taking time to help me dpham00", "time": "08-04-2017 12:56 AM", "replies": []}, {"postID": "post5911714", "text": "dpham00 rooting my device honor4x will give a solution to my problem?", "time": "08-04-2017 12:58 AM", "replies": [{"postID": "post5912028", "text": "There are a number of 7.1 roms for the honor 4x, not sure if volte works but it would solcd your original question of getting to 7.1.https://forum.xda-developers.com/honor-4x/development", "time": "08-04-2017 08:07 AM", "replies": []}]}, {"postID": "post5912921", "text": "thank you dpham00 for helping me again. Will try out the link you provided, i think that would help me to fix my problem..", "time": "08-05-2017 02:29 AM", "replies": []}]}, {"title": "I can't install apps on my honor 4x", "thread": [{"postID": "post5902941", "text": "When I install apps in my app installer it doesn't works it only shows installing. It shows that for many long and the app will not be installed", "time": "07-28-2017 10:53 AM", "replies": []}, {"postID": "post5903812", "text": "Welcome to Android Central! Moved from the KitKat forum to the Honor 4X forum.\nAre you installing from the Play Store, or from some other source? Does this happen on both wi-fi and mobile data?\nTry going to Settings>Apps>All, select Google Play Store, and Clear Cache/Clear Data, then Force Stop. Do the same for Download Manager. Now try again.\nIf that doesn't work, try going to Settings>Accounts-Google, select your Google account, and remove it completely from the phone. Then add it back again, and see if that helps.", "time": "07-29-2017 12:58 AM", "replies": []}]}, {"title": "Phone locked", "thread": [{"postID": "post5861813", "text": "Hii guys\nMy phone is locked even iam pressing vol+ &pwr button it shows android logo an then shows imaje not verified an then again the phone is locked plzz help me guys..\nI am using honour 4x", "time": "06-24-2017 07:16 AM", "replies": []}, {"postID": "post5862847", "text": "Welcome to Android Central! What does that \"not verified\" screen look like? Take a picture of it and post it here -- you'll need to register on this forum first.\nDid you root the phone, or do anything else unusual before this happened?", "time": "06-25-2017 10:57 AM", "replies": []}]}, {"title": "my honor 4x does not registering on 3g and 4g in all operaters", "thread": [{"postID": "post5743143", "text": "It only registering on 2g network", "time": "04-04-2017 12:31 PM", "replies": []}, {"postID": "post5860939", "text": "Which carrier are you using it on? If you are in the USA then it doesn't really support 3g/4g unfortunately", "time": "06-23-2017 12:27 PM", "replies": []}]}, {"title": "4G Network issue in honor 4x after installing custom ROM", "thread": [{"postID": "post5836300", "text": "I installed custom ROM on my Honor 4x now having 4g network issue, my jio is detecting but there is no network and service but 2g & 3g is working fine.\nI tried with different ROMs lineageOS, cyanogenmod & MIUI now i am using mokee but still getting same issue  can someone help me to solve this issue", "time": "06-02-2017 05:49 AM", "replies": []}, {"postID": "post5836302", "text": "🙋Have you contacted the ROM's developer?", "time": "06-02-2017 05:55 AM", "replies": [{"postID": "post5836313", "text": "how can i contact to ROM's developer?", "time": "06-02-2017 06:10 AM", "replies": []}]}]}, {"title": "unlocking bootloader", "thread": [{"postID": "post5441280", "text": "i try flashing a update recovery using fastboot command but it give me errorcommand not allowed)...so i checked the internet for the solution and it say my bootloader is locked....but on fastboot mode it say my phone is unlocked and i checked the fastboot oem and it show that my bootloader is unlocked...it cofuse me..and another problem is i cant reset and enter recovery mode on my phone it just stuck on honor logo...i try install update.app using sd card but it wont start just stuck on honor logo....my phone is rooted...please help me if someone know how to solve this problem....tq\nsorry for my bad english....", "time": "09-23-2016 07:10 AM", "replies": []}, {"postID": "post5441861", "text": "Usually if you contact the manufacturer they will tell you how", "time": "09-23-2016 10:56 AM", "replies": []}, {"postID": "post5447073", "text": "i have sent email...but the reply not give much help..", "time": "09-26-2016 01:52 AM", "replies": [{"postID": "post5634420", "text": "Hi, I'm curious did you find any solution? same problem here", "time": "01-07-2017 01:01 AM", "replies": []}]}]}, {"title": "How can I get my phone out of fastboot & rescue mode?", "thread": [{"postID": "post4884626", "text": "my honor 4x going in fastboot&rescue mode \nand no sweech off becose bettry not fix \nplse help me", "time": "12-10-2015 10:00 AM", "replies": []}, {"postID": "post4884819", "text": "Welcome to Android Central! What options do you see on the Fastboot screen? Is the phone rooted and modified in any way?", "time": "12-10-2015 11:34 AM", "replies": []}, {"postID": "post5552637", "text": "same problem to me\nphone is locked in fastboot and rescue mode", "time": "11-08-2016 07:49 AM", "replies": []}, {"postID": "post5571231", "text": "Can you please please explain what actually you all did ?!", "time": "11-20-2016 12:00 AM", "replies": []}, {"postID": "post5628970", "text": "I am having the same problem. What I did was i tried installing a custom recovery on a rooted huawei Che1-L04. Since the phone was rooted using Kingroot so the bootloader is locked. After flashing when I rebooted my phone, it entered into fastboot&Rescue mode showing that the phone is locked. I did the adb trick for fastboot but to unlock the bootloader I need the oem key and for that i need to enter the product id on huawei website to request the unlock key but for the product ID u need to dial a no. which I cant cuz my phone is stuck in fastboot. All i want to know is any other way of getting the product id of my phone except than dialing any no. which i cannot do due to my phn being stuck in fastboot mode. I desperately need help asap. Contact me on [phone number removed by moderator] if anyone has a solution.", "time": "01-02-2017 12:54 PM", "replies": [{"postID": "post5633456", "text": "try contacting huawei support, I was trying to find out if the PID is somewhere on the phone box, but It wasn't, good luck", "time": "01-06-2017 06:28 AM", "replies": []}]}, {"postID": "post5633529", "text": "Yeah I have contacted them through call and online chat service and the have forwarded the request but I havnt received the key yet.", "time": "01-06-2017 07:49 AM", "replies": []}]}, {"title": "Unique signal problem, how can I fix it?", "thread": [{"postID": "post5109884", "text": "I am using honor 4x from past 1 year. From last week I am facing a unique issue. SIM 2 signal is not working with Vodafone in some areas of the city (for example it will not work in my home). Vodafone Signal is perfect with other mobiles in my home. Same Vodafone sim is working perfectly when I go to office (just 3 KM away from home). I tried to swap SIM-1 & 2. My BSNL SIM works normal either in SIM-1 or SIM-2 slots. Following things I tried. Put Vodafone SIM in SIM 1 - Same problem. Tried some other Vodafone SIM - Same problem. Put the Vodafone SIM in another mobile - Works perfectly. Calling to that Vodafone number while in home - Message says \"Seems you dialed a wrong number\". Changed the Vodafone SIM for same number - No luck, it wont work in home. Experimented with lot of setting changes - No luck. It works, without any settings changes it works normally in my office.\nCalled Vodafone call center - No use, they never heard such problem . Can any one suggest me what could be the problem.", "time": "04-07-2016 03:47 AM", "replies": []}, {"postID": "post5594163", "text": "Welcome to Android Central! I'd try asking Vodafone for a replacement SIM.", "time": "12-05-2016 02:53 PM", "replies": []}]}, {"title": "Huawei Honor 4a/x SCL-TL00 stuck on FATBOOT&RESCUE MOD. How to fix?", "thread": [{"postID": "post5264761", "text": "My phone Huawei Honor 4a, SCL-TL00 4glite. \nIt was delivered loaded with Chinese bloatware and no access to Google infrastructure.\nI rooted it with Kingroot after unlocking the bootloader using HUAWEI website. I then flashed a twrp recovery, using fastboot . I prepared the Cyanogenmod ROMs and the Google bits on an SC card, ready to go. I rebooted the phone a couple of times using fastboot reboot, then tried to access the recovery mode using power+volumeup keys and it went straight into Fastboot&Rescue mode. It now will connect to fastboot but is not recognized by adb. I can flash to it (I tried a couple of alternative recovery images and they flashed ok, but made no difference). The question is - how do I get the phone to boot normally? I have tried manual reboots using different key combos, I have removed the battery, left it for 24 hours and retried. I have googled this and there seem to be plenty of examples of it happening, but none properly resolved on various forums.\nPlease help me.\nIs there anyway to factory reset or just flashing stock kernel? My phone is unlocked and rooted.", "time": "07-14-2016 08:30 AM", "replies": []}, {"postID": "post5266052", "text": "Moved to the Honor 4X forum.", "time": "07-15-2016 12:59 AM", "replies": []}]}, {"title": "honor 4c marshmallow update", "thread": [{"postID": "post5031881", "text": "if anyone installed it...tell me the procedure\nPosted via the Android Central App", "time": "03-04-2016 08:07 AM", "replies": []}, {"postID": "post5242782", "text": "Mj b btain", "time": "06-28-2016 07:20 AM", "replies": []}]}, {"title": "Echo in sound", "thread": [{"postID": "post5231993", "text": "Just wondering. I bought one used Honor 4x. It has changed battery, new lcdmodule with spkr. Because it had echo ( sometimes j when calling. \nBut, problem is still there ! IfI call to someone, he or she hear own voice, like echo. It goes over after 30 s. But it is odd. What to do ?", "time": "06-20-2016 10:14 AM", "replies": []}, {"postID": "post5232121", "text": "HI\nDo you have a case on it? It could be caused by the case. If that's not it, then I would suggest doing a factory reset of the device, to see if that helps.\nChris", "time": "06-20-2016 11:52 AM", "replies": []}]}, {"title": "Why are incoming calls showing as unknown on my Honor 4x?", "thread": [{"postID": "post4478877", "text": "i have contact list with numbers and i'm using airtel and docomo sims .if calls cmes for docomo means i'm gettn the no but for other num i'm not getting.\ni have tried exchng sim slots it dnt wrk", "time": "06-08-2015 04:42 AM", "replies": [{"postID": "post4486835", "text": "Welcome to Android Central!\nDo you have the entire number with area code or country code in that contact?", "time": "06-11-2015 09:00 AM", "replies": []}]}, {"postID": "post5229254", "text": "I have the same problem and I have saved my contacts in the international format. When I get a call, only the national number format is shown and the phone doesn't connect the number to the contact saved with the international format.", "time": "06-18-2016 12:10 AM", "replies": []}]}, {"title": "Honor 4x Outgoing Voice issue", "thread": [{"postID": "post4581523", "text": "I am facing one strange issue.\nwhen I make call to people, People are not able to listen my voice.whereas I can listen their voice. this happens with one or two calls in two or three days. rest all the calls are ok.\nI am not able to understand where is the issue. can anyone help me?", "time": "07-30-2015 03:02 AM", "replies": []}, {"postID": "post4895573", "text": "Hi.. I am also facing the same issue with my Honor 4x. While making or receiving calls, people on the other end can't hear my voice for few seconds and after 3-4 seconds voice again gets normal. I had submitted my handset to service centre also but the problem still exists. Can anyone help?", "time": "12-15-2015 12:43 PM", "replies": []}, {"postID": "post5183545", "text": "I am facing same problem from the very beginning of my purchasing of the phone . Is there any solution for this issue ? \nWill be the problem gradually increasing or will be the same as a little issue? plz help .", "time": "05-18-2016 10:08 AM", "replies": []}]}, {"title": "where is the data of apps location after updating the apps which moved to sd card before??", "thread": [{"postID": "post5181747", "text": "when i update any app which i already move it to sd card before , i find it go back again on phone memory.\nMy question is when this happens , is the data still on sd card or move also to phone memory??", "time": "05-17-2016 10:29 AM", "replies": []}, {"postID": "post5181828", "text": "When apps on SD card are updated, they go back (all of it) to internal memory. Only files that the app's specific settings have saved directly to SD Card stay there. You can move the app back to SD Card (although the main app file will always reside in internal memory), but if you update again, since all app installs and updates are handled in the internal memory, it will be moved back.", "time": "05-17-2016 11:18 AM", "replies": []}]}, {"title": "Honor 4X - PHONE LOCKED", "thread": [{"postID": "post5089689", "text": "Hi, My huawei 4X went to Fastboot & rescue mode unable to turn on. It shows \nFastboot & rescue mode\nPlease connect cable to your computer and open hisuite\nPhone locked.\nI tried connecting my phone to system, Hisuite not recognising my phone it shows \"not connected\"\nPlease Help...", "time": "03-28-2016 01:44 AM", "replies": []}, {"postID": "post5091067", "text": "Moved to the Honor 4X forum.", "time": "03-28-2016 03:27 PM", "replies": []}]}, {"title": "wifi not functioning", "thread": [{"postID": "post5078892", "text": "I have huawei honor 4x. it use lollipop 5.1.1. wifi is connected but i can't use internet. it doesn't accept dhcp and i should use static. but i can't enter internet. please help me.it's rooted", "time": "03-22-2016 09:02 PM", "replies": []}, {"postID": "post5081292", "text": "Welcome to Android Central! Are you running the stock ROM or a custom ROM? Does this happen on any wi-fi network, or only one particular one? Does it connect to mobile data without problem?", "time": "03-23-2016 05:41 PM", "replies": []}]}, {"title": "Can I set band frequency issue of Chinese Honor 4x in Pakistan?", "thread": [{"postID": "post4973266", "text": "I purchased honor 4x in china but it is not picking up 3g and 4g in pakistan, Is there any solution to fix this problem, Its bands frequeny does not adjust with 3g and 4g frequency in pakistan.", "time": "01-30-2016 08:20 AM", "replies": []}, {"postID": "post4973429", "text": "What model is your phone?", "time": "01-30-2016 10:36 AM", "replies": []}, {"postID": "post4975477", "text": "The frequency is determined by the hardware, there's no software change you can make that will change it. We need to know not only the model of your phone, but the name of your carrier. (If it's Warid, the only one that seems to offer 4G in Pakistan, the phone has to be model LO4.) Mobilink, Telenor, Zong (Paktel) and Ufone offer 3G, and your phone should work with them. (Warid doesn't offer 3G at all, only 4G.)", "time": "01-31-2016 06:34 PM", "replies": []}, {"postID": "post5015652", "text": "bro i am from Pakistan...you cant change the frequencies... thats the truth..\nPosted via the Android Central App", "time": "02-25-2016 10:56 AM", "replies": []}]}, {"title": "Camera Error:Cannot Connect to Camera-Honor 4x. How can I get this working?", "thread": [{"postID": "post4989047", "text": "Device details\nModel number:Che1-L04\nBuild number:Che1-L04C900B321\nAndroid version:5.1.1\nWhen I am opening camera it shows cannot connect to camera.But front cam is working.And when I restart my mobile both front and back cams working properly working.I don't know how to resolve it.please help me out.\nHoping for favourable reply\nThank you", "time": "02-09-2016 01:35 AM", "replies": []}, {"postID": "post4989086", "text": "Try Safe Mode.", "time": "02-09-2016 03:19 AM", "replies": []}, {"postID": "post5008329", "text": "How can I access Safe Mode.What does it really mean? can u Elaborate", "time": "02-22-2016 12:33 AM", "replies": []}]}, {"title": "Escape Fastboot&Rescue Mode - Huawei Honor 4a?", "thread": [{"postID": "post4986902", "text": "Help with this one appreciated, please. Phone is Huawei Honor 4a, SCL-AL00, Qualcomm. It was delivered loaded with Chinese bloatware and no access to Google infrastructure. I rooted it with Kingroot after unlocking the bootloader using DC Unlocker. I then flashed a recovery image for the phone from Cyanogenmod, using fastboot . I prepared the Cyanogenmod ROMs and the Google bits on an SC card, ready to go. I rebooted the phone a couple of times using fastboot reboot, then tried to access the recovery mode using power+volumeup keys and it went straight into Fastboot&Rescue mode. It now will connect to fastboot but is not recognized by adb. I can flash to it (I tried a couple of alternative recovery images and they flashed ok, but made no difference). The question is - how do I get the phone to boot normally? I have tried manual reboots using different key combos, I have removed the battery, left it for 24 hours and retried. I have googled this and there seem to be plenty of examples of it happening, but none properly resolved on various forums.", "time": "02-07-2016 03:41 PM", "replies": []}]}, {"title": "how to reset Honor 4X?", "thread": [{"postID": "post4965382", "text": "how to reset Honor 4X, actually my brothers phone is freezing from 2-3 days.", "time": "01-25-2016 01:08 AM", "replies": []}]}, {"title": "Hisilicon kirin 620 octa-core only ever using 4 cores even when cpu load is 100, what should I do?", "thread": [{"postID": "post4449901", "text": "Hi, \nI own a huawei honor 4x (che2-l11), in the uk, and it has a kirin 620 octa-core processor, where all 8 cores run up to 1.2ghz. Looking at the CPU information on antutu, it only ever showed 4 cores being active, cores 0,1,2 and 3, and never cores 4,5,6 and 7. Also, even though it showed them as 'sleep', it still shows they are operating at 99%. So, I installed CPU-Z, and it showed that cores 0,1,2 and 3 were on, and cores 4,5,6 and 7 were 'stopped'. So I started an antutu benchmark, and cores 4,5,6 and 7 still did not turn on, even when CPU load was 100%. Also, one week, it started giving me antutu scores of around 26000, not 31000. Is this a problem? Should I return the phone to amazon?", "time": "05-26-2015 02:23 PM", "replies": []}, {"postID": "post4700845", "text": "Hey!\nMaybe you have a power saver on that doesn't let it run all the 8 cores? I don't think it's really a problem. You should look for a program like UnparkCPU or something similar to that. Maybe they are just asleep or just turned off, surf around in settings? I used the UnparkCPU on my AMD based PC and it worked fine then. Just make sure the battery won't drain extremely fast.", "time": "09-22-2015 09:00 AM", "replies": []}, {"postID": "post4898209", "text": "I have same problme man,what i need to do ? ;(", "time": "12-16-2015 02:48 PM", "replies": []}]}, {"title": "Why can't I exit from the FASTREBOOT & RESCUE MODE in Huawei Honor 4x?", "thread": [{"postID": "post4553324", "text": "unknowingly i pressed the power and volume control, and ended up in a white screen with android logo with \" FASTREBOOT & RESCUE MODE\". please help me \nhow to get back to normal mode.?", "time": "07-14-2015 01:44 PM", "replies": []}, {"postID": "post4891248", "text": "Don't get stresses just use volume. button to go up and down and power button to select that item. To get out of it choose the first opt. That is reboot phone\nPosted via the Android Central App", "time": "12-14-2015 12:08 AM", "replies": []}]}, {"title": "Upgrade to Android 5.1?", "thread": [{"postID": "post4776780", "text": "Hi,\nI'm thinking of buying Honor 4x and I really don't understand all the models that are available (Che-L11 and so on...). Can someone explain all the different models to me and tell me:\n- Will there be an Android 5 update for all Honor 4x models\n- Will there be an Android 5 update that won't be beta (the one that was released on October 20th is a beta release and only for Indian market)\nThis is really important to me because Honor 4x is a phone that meets all my needs, but it currently lacks Android 5.", "time": "10-27-2015 03:07 AM", "replies": []}, {"postID": "post4836991", "text": "5.1.1 already available, check hihonor.com", "time": "11-17-2015 12:10 AM", "replies": []}, {"postID": "post4883653", "text": "My Honor 4x is 5.0.2", "time": "12-09-2015 08:17 PM", "replies": []}, {"postID": "post4884317", "text": "You must tell us which build you have/want to buy. \nNot every model has already got the lollipop update. \nI have the Africa/Middle East build and I'm still stuck with 4.4.2.\nIn the other words: where are you?", "time": "12-10-2015 06:48 AM", "replies": []}]}, {"title": "Music quality drops down when screen turns off.", "thread": [{"postID": "post4883175", "text": "Hi guys. \nI was forced to buy a cheap smartphone while on vacation.\nUnfortunately, I'm currently in Egypt so my choices were very limited. \nI decided to go with Honor 4X (Che2-L11...C185B056)\nI'm quite happy with the phone. It was super cheap and performance and the display are decent. \nHowever, I'm stuck with idiotic problem. \nWhen I listen to music (Huawei Music app and Google Play Music tested) and lock the screen drastically the quality of sound drops down. It sounds like a completely different file with much lower bitrate.\nThe phone runs Android 4.4.2 (the lollipop update is apparently unavailable for my build)\nAnyone?\nCheers, \nAdam\nPosted via the Android Central App", "time": "12-09-2015 03:57 PM", "replies": []}, {"postID": "post4883230", "text": "Welcome to Android Central! Does the phone have any battery-saving modes turned on?", "time": "12-09-2015 04:13 PM", "replies": []}, {"postID": "post4883610", "text": "Thanks \nNope. That crossed my mind too. \nThe phone is in \"full power\" mode. \nPosted via the Android Central App", "time": "12-09-2015 07:52 PM", "replies": []}]}, {"title": "Can I get some help with a bricked Huawei Honor?", "thread": [{"postID": "post4647183", "text": "I have an huawei honor 4x, deleted some system files so media stopped playing\nTried flashing the stock ROM, didnt work plus in middle of process phone rebooted & took me to a white screen with \"Huawei Recovery 1.0\" title, a light blue usb connector and it said \"software updating, please wait... DONOT unplug usb or press any key\", and below that a loading bar. This bar filled up to almost the end, and stopped.\nReset the phone by holding the power button 10 seconds, took me to this screen again. Again, bar filled till almost end and stopped. I gave it a whole hour to fill, but no, stuck on end.\nI rebooted phone like 20 times, same thing happens.\nIs there a solution?? did break my phone?\nPlease, Im a big noob (and bad english too) so give me as max detail as u can, with all links.\nThank you everyone!", "time": "08-29-2015 07:01 PM", "replies": []}, {"postID": "post4673178", "text": "have you found a way to solve it?\ni have exactly the same problem here", "time": "09-09-2015 03:35 PM", "replies": []}, {"postID": "post4848133", "text": "Have u guys gone mad ....how can a ROM be modified .........its just impossible to delete system files ....it will automatically appear again or it will just come back again .......\nMaybe a system restar could help\nPosted via the Android Central App", "time": "11-21-2015 02:58 PM", "replies": []}, {"postID": "post4848135", "text": "Sorry a system reset ....( factory rest)\nPosted via the Android Central App", "time": "11-21-2015 02:59 PM", "replies": []}]}]
[{"title": "How unlock honor 4c with mi band?", "thread": [{"postID": "post4752589", "text": "Yesterday install update Android 5.1. How to configure using the unlocking mi band?", "time": "10-16-2015 01:39 AM", "replies": []}]}, {"title": "Need help!! Battery is suddenly draining in a great deal in my Huawei Honor 4x. How can I solve this issue?", "thread": [{"postID": "post4648940", "text": "I am using huawei honor 4x for over one month now. My phone loses charge in a great deal when I am not using it (when the screen is off). It's like 20% in 6-7 hours. some days i find the phone dead in the morning. It basically started since I am using both sim slots. Is it normal? Cause while I was using single sim the phone never consumed a single percent of charge while the screen was off. i can't tell what is eating the battery so much when i am not using the phone.\nDid anyone face this issue and solved it? Please help. Thanks in advance.\nN.B. I do check that there is nothing running on the background and all the settings are set to optimize.", "time": "08-30-2015 02:46 PM", "replies": []}, {"postID": "post4648944", "text": "Have a look thro' the following article :-How to Optimize Your Android Phone’s Battery Life Using Greenify", "time": "08-30-2015 02:49 PM", "replies": []}, {"postID": "post4648948", "text": "Welcome to the forums. Sounds like the second sim has a weak signal. Or perhaps there is a data plan connected to SIM #2, and there is no data radios in the second sim slot? Either way, that is like the phone straining to find a signal which is always a battery killer.", "time": "08-30-2015 02:50 PM", "replies": []}, {"postID": "post4664243", "text": "hi im using honor 4x mobile my sudenly runing media server its during my phone battery life how to stop thwe media server runing plz help to me\nregards\nkarthi", "time": "09-05-2015 11:04 AM", "replies": []}, {"postID": "post4700815", "text": "I bought my phone like 8 days ago. And suddenly the battery experience wasn't the best. It showed me that i can do only 15 hours with 100% battery and 21 hours in Ultra mode. So i checked what was eating up my battery and saw that Android OS was using ~45% and Android System ~20% of my battery. So i RMA'd it and we'll see, if they give me a new phone or fix the bug. That bug is actually Google's fault because Google owns Android. I even did a factory reset and went straight to see if it's still there and yep...", "time": "09-22-2015 08:49 AM", "replies": []}]}, {"title": "I can't connect to wifi no matter what I try, what am I doing wrong?", "thread": [{"postID": "post4616984", "text": "Iv'e just bought a new phone (Huawei Honor 4x) and I am trying to connect to the wifi at my local tafe, and I have tried all the settings reccommended by the tafe, followed step by step instructions that have worked for others, but it still comes up with authentication problem, even after entering the corrext proxy and port number. Any help?", "time": "08-18-2015 10:09 PM", "replies": []}, {"postID": "post4617185", "text": "Welcome to Android Central! Does it connect to other wi-fi networks that don't require a proxy?", "time": "08-19-2015 12:14 AM", "replies": []}, {"postID": "post4617415", "text": "Please try Wheres my WiFi app from Google Play, it helped me with my WiFi starting issue.", "time": "08-19-2015 03:52 AM", "replies": []}, {"postID": "post4683901", "text": "Try this:\n1- Do a long press on the WIFI network name and choose ignore\n2- Connect to it again", "time": "09-14-2015 05:14 PM", "replies": []}]}, {"title": "Can I get some help flashing a rom to an Android device?", "thread": [{"postID": "post4631779", "text": "First of all, my english is not that good so if you don understand something please ask me, I will try to explain it.\nHere is my problem.\nI got a new cellphone last week, an Huawei Honor 4x, with Android 4.4.2\nAs I never tried android (always sticked with ios) I rooted and messed up with some system files in >system>etc>audio and deleted a bunch of folders so now... I have no audio at all.\nSpotify and music players simply wont play any audio. Cant hear ringtone nor speaker when talking. When I open chrome to play a vid, app crashes. Youtube app doesnt play videos.\nI am a complete noob, but I understand I have to flash a new rom.\nPLEASE! tell me STEP BY STEP what I have to do.\nI tried all, there is no clockworkmod recovery compatible with my huawei honor 4x in RomManager so please, show me or make a guide on how to flash my Huawei.\nthank you everyone!", "time": "08-24-2015 12:22 PM", "replies": []}]}, {"title": "Home, back and options buttons are not working", "thread": [{"postID": "post4551369", "text": "hi,\nMine is a new \"honor 4x - Indian Edition\" bought just 2 months before.\nNow the home, back and options buttons are not working.\nI also tried factory reset, but no-use.\nPlease suggest a fix. \nI don't want soft links, I want to fix that issue.", "time": "07-13-2015 12:39 PM", "replies": []}, {"postID": "post4551457", "text": "If they're hardware buttons (being 'hard' ones or capacitive ones) and they're not working, I'm afraid this is more of a hardware issue than something you can fix with software...", "time": "07-13-2015 01:39 PM", "replies": []}]}, {"title": "Why is my download manager downloading but showing an error message?", "thread": [{"postID": "post4526741", "text": "I'm using Huawei Honor 4x in which the download manager version 4.4.4-eng.jenkins.20150215 is not getting downloaded and displaying error message.\nCould any one support to over come this. Because of this my play store is not opening.\nAnticipating your support.\nTnx- Raghul", "time": "07-01-2015 01:07 AM", "replies": []}, {"postID": "post4527844", "text": "Welcome to Android Central! Go to Settings>Apps>All​, select Download Manager, and Clear Cache/Clear Data, then Force Stop. Now try again.", "time": "07-01-2015 01:10 PM", "replies": []}]}, {"title": "Why can't I access my call log during a call?", "thread": [{"postID": "post4497540", "text": "I am using Huawei Honor 4X mobile for the past 1 month. It is running on latest version of EMUI 3.0 Che1-L04V100R001C900B130. The problem is, I cannot access my call log during a call. It is really a very big problem for me.\nIs it just my mobile problem or i didn't explore the mobile very much? Any 4X users help me? I checked with other handsets running on EMUI (honor 4C, my friend’s 4X). They are also having this problem. \nYour feedback is highly appreciated.", "time": "06-16-2015 02:39 AM", "replies": [{"postID": "post4503927", "text": "Welcome to Android Central!\nIt could be that the manufacture disable the option for some reason.", "time": "06-19-2015 06:39 AM", "replies": []}]}]}, {"title": "Why doesn't my AT&T sim work properly on my Honor 4x phone?", "thread": [{"postID": "post4425048", "text": "I am currently in Boston ,and my huwai honor 4x phone is not working which has at&t sim in it . I doesn't show any signal .", "time": "05-13-2015 07:14 PM", "replies": []}, {"postID": "post4425377", "text": "Welcome to Android Central! I don't think that phone is compatible with the bands AT&T uses. According to these specs on Amazon, the Honor 4x uses the 1800 and 2100 MHz bands for LTE, and uses WCDMA for 3G (which isn't supported by AT&T's network, which is GSM). The only overlap appears to be the 1900 MHz GSM band (2G).", "time": "05-13-2015 10:02 PM", "replies": []}]}, {"title": "Merge/Link contacts in Honor 4x", "thread": [{"postID": "post4362872", "text": "I bought honor 4x a couple of weeks ago and I've been banging my head on how to merge/link contacts. I got 400 odd contacts from google and facebook (some are same contacts with different names). I am trying to manually link some contacts. I choose the contact -> edit. I am not able to find the link/merge contact option. I have now ended up with multiple entries and I am not able to merge them.\nWhere the hell is the link/merge option?? I have tried a lot and am frustrated.", "time": "04-16-2015 04:43 AM", "replies": []}, {"postID": "post4375322", "text": "This is odd. Still no replies.... Am I the only the facing this issue???", "time": "04-21-2015 05:43 AM", "replies": []}]}, {"title": "Huawei Honor 4X", "thread": [{"postID": "post4266308", "text": "This seems like a solid device. Some of the specs are really good, and has a similar screen size to the LG G3: Honor 4X unveiled, coming in Q2 for €200 | Android Central\nIt is questionable if it is coming to the North American market.", "time": "03-04-2015 10:18 PM", "replies": []}]}]
