[{"title": "9 MAGICAL features that makes Honor Magic totally drool-worthy!", "thread": [{"postID": "post5618287", "text": "Honor Magic! The name says it all! Please read on to know how the phone lives up to its name.\nHere are some cool features that make the device work like true magic!1. WiseScreen Sensor\nThe intelligent sensor system allows you to activate your phone smartly. The moment you pick up the phone, the sensor on the phone’s frame and the front infrared camera recognize your hand and your eyes, and put the phone into action by activating the screen. When you put down your phone, or place it in your pocket, the screen goes off in one second. 2. Intelligent Face Code Recognition\nNew message notification will only show up for pre-registered faces to ensure users’ privacy.3. Honor Magic Live\nHonor Magic Live smart engine does not only understand the users’ needs, but helps to organize their life. By detecting external factors such as touch, direction, brightness, speed, distance and location, Honor Magic does not only function passively on your demand, but also provides active services beyond your imagination.(A) Smart Services: Customized recommendations for your daily activities\nScenario 1: Imagine when you are chatting about movies with your friends on Wechat*, Honor Magic will then be able to recommend the latest blockbusters for you.\nScenario 2: Imagine when you are on the road, Honor Magic automatically recognizes that you are driving and will prompt a reminder for you to switch the device to driving mode.\nScenario 3: DeepThink - Press and hold the home button and Honor Magic will offer multi-facets information based on the current webpage you visit.(B) Smart Display: Presenting information the instant you need it\nScenario 1: Once you use Honor Magic to order a cab, the driver’s license plate information will be shown on the display under locked screen mode.\nScenario 2: Once you arrive at the theatre, Honor Magic will automatically display the ticket booking number.\nScenario 3: When you approach the parcel collection counter, Honor Magic will automatically display the tracking number.(C) Magical Transformation: Activating functions to fit in your surroundings\nScenario: When you’re in the dark, the auto lock screen will prompt the flashlight button which can brighten the room with a gentle swipe.4. My Pocket\nSwipe up from the bottom of the screen to activate the ‘save’ and ‘share’ button so you can collect and share your favorite articles, music and videos.5. 3D Glass Curved Design\nHonor Magic boasts of an ergonomic design with its double 3D glass covers and Class-A curvy style which reflects bright, shining lights.6. Magic Touch: Effortless navigation with one key\nBesides being Honor’s first smartphone with front home button which also serves as fingerprint scanner, Honor Magic’s home button is an all-in-one key replacing the “back” and “overview” buttons, enhancing the actual screen size considerably.\nYou may navigate around, such as unlock the phone, return to previous page, browse history and return to the home screen, simply by touching, double tapping or swiping on the same key.7. Fast charging\nThanks to the introduction of a special graphite molecular structure of the new battery materials - and the new charging design, Honor Magic achieves an incredible boost. It only takes 20 minutes to juice up the battery to 70% and 10 minutes to charge up to 40%. With Honor Magic, your days of worrying about low batteries are over.8. 2K AMOLED Curved Screen\nHonor Magic features a stunning 5.09-inch 2K AMOLED curved screen which presents the vivid world in all its color.9. Dual 12MP Parallel Lens\nHonor Magic boasts of 12MP dual lens camera, one lens captures black and white image while the other one captures color images - the former guarantees detail and the latter delivers vibrant color. The dual lens work together to effortlessly capture clear and vibrant images.", "time": "12-23-2016 06:15 AM", "replies": []}, {"postID": "post6111503", "text": "wow, some really nice features. I would like to see some of these incorporated in phones here in the US.", "time": "12-19-2017 01:24 AM", "replies": []}, {"postID": "post6112332", "text": "I agree. Those are some nice features. Hopefully we will see turn in the states", "time": "12-19-2017 06:19 PM", "replies": []}]}, {"title": "The Magic unveiled - Honor magic", "thread": [{"postID": "post5617030", "text": "After winning the contest held by Honor Club India, I got an opportunity to experience the event live in Shenzhen, China. This post is all about the launch coverage of Honor magic phone.\nEvent started around 2 PM China time (11.30 AM India Time) and the fans were excited to the fullest. We met fans from many colleges, universities and many other people at the Hotel and the event hall.\nRegistration counter at the event- Only for media and few fans as almost all fans were already enrolled in hotel.\nSmall bunch of people (less than 2% of what we had in actual launch hall)\nJust before the event was started....empty chairs but there were none after all fans and media person entered. We had massive crowd, fans and media persons during the launch and was a mega hit. \nSome gathering but only 1/3rd here as event was not yet started (panorama effect)\nEntire event was presented and Phone was launched by Honor Global President, Mr. George Zhao. \nPhone design and everything is just awesome but many of you may feel the cost of the phone is little bit on higher side but trust me that justify the phone design and features.\nPhone runs on Android 6.0 out of the box with screen resolution of 1440X2560 and 5.2 inch display, powered by Octa core HiSilicon Kirin 950 processor. Phone is packed with a massive 4 GB RAM coupled with 64 GB internal memory. Phone display looks stunning and design is somewhat reworked and looks really stylish. Phone feels extremely premium with glossy finish and is curvy so fits the palm well and is very sleek. \nPhone also supports fast charging with USB type C port.\nPhone is priced at 3699 RMB and is available on Tmall.com, vmall.com JD.com and suning.com", "time": "12-22-2016 02:17 AM", "replies": []}, {"postID": "post5618445", "text": "Very cool! I wonder if/when the Magic is coming to North America??", "time": "12-23-2016 09:42 AM", "replies": [{"postID": "post5619489", "text": "nothing on such plan disclosed yet James, as soon as get info, I will share but seems you will info prior to me.", "time": "12-24-2016 07:29 AM", "replies": []}]}, {"postID": "post5653376", "text": "unfortunately i've just got honor 8 before i know magic....", "time": "01-23-2017 12:26 AM", "replies": []}, {"postID": "post5653387", "text": "Cool coverage", "time": "01-23-2017 12:37 AM", "replies": []}, {"postID": "post5982524", "text": "Did this phone ever took off ? How many did they sell", "time": "09-19-2017 05:49 AM", "replies": []}, {"postID": "post6092239", "text": "Guess it never took off", "time": "12-01-2017 03:51 AM", "replies": []}]}, {"title": "Honor Magic- Photo Gallery ( Part 1)", "thread": [{"postID": "post5621101", "text": "Hello Folks,\nHere are some of the photos taken during the Honor Magic launch event. There are many photos but would only post for the phone and none from launch event. This is part 1 of this series as there are many photos to share. For more pics, check the part 2 thread.", "time": "12-26-2016 02:46 AM", "replies": []}]}, {"title": "Honor Magic- Photo Gallery ( Part 2)", "thread": [{"postID": "post5621100", "text": "Hello Folks,\nHere are some of the photos taken during the Honor Magic launch event. There are many photos but would only post for the phone and none from launch event.", "time": "12-26-2016 02:43 AM", "replies": []}]}, {"title": "Honor Magic Hands-on Review : Every Bit Works Like MAGIC!", "thread": [{"postID": "post5619688", "text": "During my visit to China for Honor’s 3rd anniversary carnival, I got a chance to witness the launch of Honor Magic on 16th December, 2016 and lay my hands on the device for a quick review. Without beating around the bush, here’s what you need to know about Honor Magic:Operating System- Magic runs on Android 6.0 with Honor Magic Live software out of the box and is completely different than EMUI but feels much lighter and smoother for sure. Huawei developers must have re-structured everything in the backend for a fresh look, design, smoothness and performance.Hardware- It is powered by Kirin 950 CPU processor, coupled with 4GB RAM for better performance and multitasking with 64 GB of internal memory. I opened all the apps but did not feel any lag or delay while doing so (Thanks to one of the support staff over there who helped me changing the language to English so that I could use and navigate across the settings).Display- The 5.09-inch device has a screen resolution of 2K (yes, you read it right, not 720P or 1080P. But way better!) and a 3D glass structure to give more strength and look to the device. Screen pixels look extremely real, vivid, sharp and crystal clear.Look and feel- It looks extremely premium in hand with completely re-structured design and a glossy finish. It looks awesome from any given angle and perfectly nestles into your palm for its decent size and the friendly bezel design. I felt comfy holding the glossy phone without any trouble or fear of the phone slipping off my hand.Battery- It is powered by a 2900 mAH battery with Huawei’s Magic Power Fast-charging technology which could charge the phone up to 70% in just 20 minutes.Camera- It has 12 MP dual cameras with RGB+Monochrome support which is capable of taking good pictures even in low light. I took a couple of shots and selfies too.Connectivity - It supports the latest Wi-Fi bands and Bluetooth 4.2 and micro USB 2.0. Type C charging port helps in quick charging.\nPricing- It is available on Vmall.com, tmall.com, JD.com and suning.com at 3699 RMB, roughly around 36,200 INR.\nPlease share your thoughts on the same.", "time": "12-24-2016 11:32 AM", "replies": []}]}, {"title": "Honor Magic- Quick specifications.", "thread": [{"postID": "post5617039", "text": "Hey Guys,\nThis post is to quickly summarise the necessary specification of Honor Magic phone.Operating System- Android 6.0 with Honor Magic Live software Display- 5.09 InchScreen resolution- 2K screenAdditional screen info- Double 3D glassesCamera - Dual lens 12MP cameraProcessor- Kirin 950 CPURAM- 4GBInternal Storage- 64GB Battery - 2900mAh battery capacity Additional battery info- Huawei Magic Power (Fast-charging technology) Connectivity- 02.11ac WiFi, Bluetooth 4.2, micro USB 2.0Camera rear- 12MP dual-lens rear cameraCamera front- 8MP front camera\nA magic photo taken from Magic, through magic and that's the Magic for you", "time": "12-22-2016 02:32 AM", "replies": []}]}, {"title": "Honor Celebrates Third Anniversary with Honor Magic", "thread": [{"postID": "post5617035", "text": "Continues to bring bold innovation to Digital Natives Shenzhen, China, December 16, 2016 – Honor, the world’s leading smartphone e-brand for digital natives, celebrated its third-year anniversary with the launch of Honor Magic, a device packed with disruptive technology set to redefine expectations of smartphones.\nHonor owes its continuous success to its legions of fans all over the world. To express its gratitude to them, Honor is committed to exploring frontier areas of technology to ultimately create outstanding mobile experiences for them. The Honor Magic, the latest addition to Honor’s lineup of cutting-edge devices, exemplifies that very endeavor, and marks the culmination of Honor’s extended R&D efforts in bringing the best of technology to its customers\nUnderpinned by an unwavering commitment to innovation and quality, Honor’s footprint has increased considerably in the space of just three years to span 74 different countries and regions to this day, with sales revenues topping US$6 billion and 40 million units shipped globally in 2015.The Futuristic Honor Magic\nHonor is constantly exploring new technology applications. The Honor Magic breaks new ground by incorporating artificial intelligence designed to understand and analyze users’ data in order to provide intelligent interactive features.\nPowered by a Kirin 950, the Honor Magic features a 5.09-inch 2K AMOLED curved screen. The Honor Magic also sports a stylish and ergonomic design, with a 3D curved glass body.\nDesigned to support a more intuitive mobile user experience, the Honor Magic boasts intelligent sensor and recognition technology. The WiseScreen sensor enables users to unlock their phone by simply picking up and looking at the screen, the display will automatically turn off and the screen will lock when put down or put in a pocket. The FaceCode intelligent recognition feature, on the other hand, ensures total privacy by only revealing message notifications to the pre-registered face.\nTo further improve user experience, the Honor Magic houses the Honor Magic Live system, which anticipates users’ needs and facilitate their daily lives by offering a whole host of predictive information. The Honor Magic Live system is, for instance, able to formulate a range of customized recommendations based on users’ social conversations via instant messaging apps-- conversations revolving around movies will trigger blockbuster recommendations.\nHonor Magic’s Smart Display proactively retrieves and displays practical information, anticipating users’ need. For example, ordering a cab with Honor Magic will trigger the driver’s license plate number to be displayed on the screen.\nTo make it a truly round-the-clock companion, the Honor Magic uses Huawei Magic Power, a revolutionary proprietary speed charging technology, which recharges 70% of the battery in 20 minutes, and 40% in 10 minutes. \n“The Honor Magic encapsulates our commitment to cutting-edge innovation and technology,” said George Zhao, president of Honor. “Through this launch, we at Honor are telling our fans around the globe that we are genuinely committed to challenging ourselves and willing to disrupt the status quo to ultimately be able to bring the best mobile-internet experience to them.”", "time": "12-22-2016 02:28 AM", "replies": []}]}]
