[{"title": "Camera raw", "thread": [{"postID": "post5744297", "text": "Does anyone know if the camera supports raw using 3rd party camera apps ( like Manual Camera or Camera FV-5) ??", "time": "04-05-2017 04:14 AM", "replies": []}, {"postID": "post5744341", "text": "Maybe someone could load the app \"Manual Camera Compatabily\" from the app store. Its free and simply checks what manual functions (including raw support) the camera supports.", "time": "04-05-2017 05:32 AM", "replies": [{"postID": "post6015451", "text": "No it does not support RAW, just ran that app", "time": "10-11-2017 02:49 PM", "replies": [{"postID": "post6180215", "text": "I thought the XZ did support RAW through 3rd party apps like ProShot, or FV5...\nOr is that the XZ Prem", "time": "03-05-2018 07:10 PM", "replies": []}]}]}, {"postID": "post6066020", "text": "Perhaps this could be added as an enhancement in a future software update. RAW files are just so useful.", "time": "11-12-2017 04:33 AM", "replies": []}]}, {"title": "Battery - Really?", "thread": [{"postID": "post6144363", "text": "I love this phone for the most part but I barely used it today and my battery drained so quickly it's kind of hard to believe. I can still return the phone but would hate to do that if there is a solution to the battery issue. Is it because of the Oreo update?", "time": "01-23-2018 11:58 PM", "replies": []}, {"postID": "post6144438", "text": "How old is the phone?\nDuring the update it drains a lot of current (high cpu usage), but after next charge it should go normal.\nLooks like other people have similar problems after oreo update. See this threadhttps://talk.sonymobile.com/t5/Xperi...8/td-p/1282105", "time": "01-24-2018 03:55 AM", "replies": [{"postID": "post6144832", "text": "I've had the phone less than a month. The battery life is declining and it does seem related to the Oreo update which I performed over a week ago. It's really too bad, such a nice quality phone, I really like the design. Camera is funky in macro mode but no phone is perfect. Thank you for the link.", "time": "01-24-2018 02:09 PM", "replies": [{"postID": "post6151023", "text": "WOW thanks for the link too. I have have not had issues with mine and I did the update 3 months ago", "time": "01-31-2018 06:19 PM", "replies": []}]}]}, {"postID": "post6180214", "text": "Did you do a full factory reset...\nIt is widely known that when you do a major OS update/downgrade (from old to new) you should do a full wipe and factory reset.. Just make sure you back everything up first", "time": "03-05-2018 07:08 PM", "replies": []}]}, {"title": "How to set home screen on Oreo 8.0", "thread": [{"postID": "post6118598", "text": "I have 3 screens on Xperia XZ with Oreo 8.0.0, and my home screen after some add and remove of icons and screens end up being the first one from the left.\nI want to change the home screen to be the middle screen, i.e. screen #2 .\nIf I press and hold a blank area on any of those 3 screens while on screen management it merely jumps to that screen exiting the manager.\nHow do we set the home on 8.0?", "time": "12-26-2017 03:06 PM", "replies": []}, {"postID": "post6180213", "text": "My New XZ arrives tomorrow, but if memory serves from my XZ Premium.(which died on me).. \nIf you press and hold the screen so it goes into Settings, Widgets and Screen select mode, scroll to the screen you want.. the select it as home...", "time": "03-05-2018 07:05 PM", "replies": []}]}, {"title": "Finger print reader on new phones", "thread": [{"postID": "post6131583", "text": "The new phones shown at the CES show have the fingerprint reader on the back. I hope the is not the future for the new high end phones to be shown in Spain", "time": "01-09-2018 03:24 PM", "replies": []}, {"postID": "post6131629", "text": "That's how the trend has been going for several years now", "time": "01-09-2018 04:21 PM", "replies": []}]}, {"title": "Sony updates", "thread": [{"postID": "post5885164", "text": "How good is Sony about updating their phones with security updates and android versions?", "time": "07-14-2017 02:04 PM", "replies": []}, {"postID": "post5885178", "text": "Usually pretty good actually. I got the security update for my XZ within weeks of it being announced and the same on the XZ Premium!", "time": "07-14-2017 02:19 PM", "replies": []}, {"postID": "post5922227", "text": "I remember the updates being OK on my Z3C and Z2 but now that things are monthly are they keeping up every month or are they hitting every 2-3 months, or worse?", "time": "08-13-2017 09:35 AM", "replies": [{"postID": "post5922402", "text": "No idea but my xy premium received June, July, and August updates so far.", "time": "08-13-2017 01:23 PM", "replies": []}]}, {"postID": "post6033565", "text": "I guess September also", "time": "10-23-2017 03:37 AM", "replies": []}, {"postID": "post6039305", "text": "Xz premium received oreo", "time": "10-26-2017 04:20 AM", "replies": []}, {"postID": "post6131579", "text": "My phone updated to Oreo months ago and Sony seems to update monthly", "time": "01-09-2018 03:20 PM", "replies": []}]}, {"title": "Why is there lag time with the 'back key'", "thread": [{"postID": "post6111046", "text": "I am using android Oreo on Sony Xperia XZ (F8331) and I am experiencing a delay when using the 'back' button in some apps especially the camera. Is this a common issue thus far?", "time": "12-18-2017 03:08 PM", "replies": []}, {"postID": "post6111939", "text": "Welcome to Android Central! Does this also happen in Safe Mode? https://support.sonymobile.com/globa...399b11c00699b/", "time": "12-19-2017 11:02 AM", "replies": []}]}, {"title": "Full Adhesive Tempered Glass for Sony Xperia XZ Premium?", "thread": [{"postID": "post6046576", "text": "", "time": "10-30-2017 09:38 PM", "replies": []}, {"postID": "post6047597", "text": "Where can I buy this in India", "time": "10-31-2017 03:39 PM", "replies": []}]}, {"title": "My Review of the XZ Premium", "thread": [{"postID": "post5847388", "text": "Weird that there isn't a forum after even the review from AC is out, so thought I'll just share this here. Had the phone for a while for review, and I liked it more that I though I would. I was really hating on the bezels, the chrome finishing, etc. But I got hold of the black unit, and ended up liking it.\nIt's still way too big for me, and the bezels are rather big, but it's around the same as the U11 or the iPhone 7 Plus, so it's not really an outlier here. Other than that, the phone is really solid. The 4k screen is an overkill for normal viewing distance, but it's still amazing to look close up and see how dense this screen is. \nThe performance is really good too, with Sony's UI being pretty lean, almost close to stock android. The touch response, app launch speeds, gaming performance are all top notch, and feels speedier than the Galaxy S8 and LG G6. The battery life is surprisingly decent too despite the 4K screen. Sony is probably upscaling 1080p most of the time unless there is a need to display native 4k. Average around 5 hours of Screen on time over a full day of use. Or once I tried really heavy use with lots of gaming and some camera use, got 7.5hours screen on time over 10 hours of use. Pretty decent.\nCamera is going to be a bit polarising. Some like the image processing, some just hate it. I used to hate Sony's processing and their camera UI having used most generations of their phones like the Z3, Z3 Compact, Z3+, Z5, Z5 Compact, X, and X Compact. But I can definitely see the improvements over the years. I have no issue with their daylight shots now in full auto mode.\nI do agree with Andrew in his review that Superior auto mode can be a bit finicky, but it worked fine for me most of the time. I also find that there is a setting to change the touch to focus to adjust the brightness too, so essentially spot metering. For me the camera works better that way, but pity that there isn't an easy way to slide and adjust exposure like most phones.\nThe only downside is that low light shots still isn't up to par compared to the other flagships. It still looks good to me, but just that when you pixel peep, it's easy to tell that the camera has to go for higher iso and faster shutterspeed to compensate for the lack of OIS. The aperture not being as wide, might be a factor too. So the images doesn't seem to have as much details with softer edges, more grain, and noise. But it's still good looking enough though.\nIt does have other things to make up for that drawback though. Sony's steadyshot in daylight and 1080p looks mightily steady, and might be the best stabilisation I've seen on a phone. And the 960fps camera is extremely fun to play around with. It can be challenging to get the timing right, but incredibly satisfying once you do.\nI have the full resolution images on Google Photos shared here:https://photos.google.com/share/AF1Q...JPWUVJMkZBSG13\nAnyway, sorry for the really long post, but just want to share my thoughts on the phone. For those who don't want to read, i do have a video review up as well.\n(the lack of a fingerprint sensor to me is a deal breaker in the US though) \nHopefully when a XZ Premium sub-forum does come about the mods can help to move it to the correct spot.", "time": "06-11-2017 10:57 PM", "replies": []}, {"postID": "post5847396", "text": "Just to add on a bit, I have seen a few other reviews since then, and mine's probably a bit more positive than others. I have no doubt that it has its flaws, and on paper the Galaxy S8 is probably one of the best phones around. Looks stunning too. But when it comes down to actually using the phone in a day to day situation, the XZ premium is just as good to me. Performance feels smoother, and interface looks cleaner too. And the unique feature (960fps) is actually really fun to use. Sony does have some ways to go still, and i totally get some of the hate around, but it's not a bad phone.\nAlso in Singapore where I live, the price of a XZ premium at resellers are around SGD850, so around 615USD? And it's actually a little bit cheaper than the S8. So it's actually not a bad deal here. At 799USD and without fingerprint sensor, you should probably avoid it.", "time": "06-11-2017 11:10 PM", "replies": []}, {"postID": "post5848181", "text": "Thank you for your review. I really want to want this phone, but I absolutely cannot accept that forehead and chin. I do not know what Sony are playing at, with this design in 2017.\nHoping the XZ1/Compact will FINALLY hit the spot.", "time": "06-12-2017 03:35 PM", "replies": [{"postID": "post5849783", "text": "Thanks! For me I find it still acceptable in 2017 (barely), but come later half the year, we'll probably see even more phones with thinner bezels. So in 2018, I think they'll be in trouble if they stick to the thicker bezels. \nFor me the XZP is way too big for me too, so while I like it, it's not something I would use. But if there is a XZ1 Compact, i'll be totally on-board. Love their compact series.", "time": "06-14-2017 02:16 AM", "replies": []}]}, {"postID": "post5848787", "text": "Nice review. I have tried the phone myself and found it quite good actually. What's holding me back is the lowlight camera performance. Maybe that noise and grain can be fixed through and update ? OIS is not always necessary just look at the Pixel (I have the XL).\nThe XZ P is only a 1.3 mm taller than my XL so its bezels are not unusually large.", "time": "06-13-2017 03:25 AM", "replies": [{"postID": "post5849785", "text": "Yeah, lowlight is probably the weakest link for the whole camera experience. I'm guessing part of the reason for that grain is due to the use of a higher ISO and faster shutter speed since it doesn't have OIS. Not helped that the aperture is 2.0 compared to other flagship phones around. Unless they change their image processing to be more like Google's HDR+ mode perhaps.\nSize wise the iPhone 7 Plus is around the same size too actually, along with HTC U11. It's a big phone with bigger bezels, but for now it's actually still considered the norm considering at this point in time, the only other 2 mainstream flagship with super thin bezels are the G6 and the S8. But it's not going to stay that way for long though. haha.", "time": "06-14-2017 02:24 AM", "replies": [{"postID": "post5850791", "text": "For me, the weakest link is the insane amount of sharpening done by the camera that introduces tons of nasty artifacts and also no raw output.", "time": "06-14-2017 06:30 PM", "replies": []}]}]}, {"postID": "post5851548", "text": "Can someone show me a clear example of the oversharpening? Thanks.", "time": "06-15-2017 01:04 PM", "replies": []}, {"postID": "post5851578", "text": "Does the group texting; single text thread, not where it sends to everyone individually, work on the new XZ Premium? I understand group text was built actually to send a single text to each person, not build a chat room. However all my Samsung phones did the single group text. I don't understand how theirs works and the Sony doesn't. Aren't the both using Android messaging? I'm trying textra now but hate using a 3rd party app. I'd rather not. Is the problem the app or the Sony phones? I have the XZS!", "time": "06-15-2017 01:26 PM", "replies": []}, {"postID": "post6033576", "text": "Hi Alex\nHave been following your videos on YouTube named xplod566\nYes the phone is mighty good.camera at low light is a hit or miss but yeah the phone is premium build and so does the features os etc of the phone", "time": "10-23-2017 03:44 AM", "replies": []}, {"postID": "post6045317", "text": "Hey Alex,any update on the review of the Oreo.How is the battery too", "time": "10-30-2017 05:31 AM", "replies": []}]}, {"title": "ZX premium getting Oreo 23 October", "thread": [{"postID": "post6034810", "text": "https://www.google.com/amp/www.pocke...-today.amphtml", "time": "10-23-2017 05:35 PM", "replies": []}, {"postID": "post6036346", "text": "SWEET! Thanks for the headsup!", "time": "10-24-2017 02:30 PM", "replies": []}, {"postID": "post6038532", "text": "My phone was just updated to Oreo. I can see changes in the menu already", "time": "10-25-2017 04:48 PM", "replies": []}]}, {"title": "Sony Xperia XY Premium VS Samsung Galaxy S8 full review", "thread": [{"postID": "post5919257", "text": "Hello AC fellows,\nI found this review vs S8! Check it out!", "time": "08-10-2017 12:34 PM", "replies": []}, {"postID": "post5925311", "text": "I bought the Sony earlier this summer and I loved the size and form factor, but I soon realized how much I missed having the fingerprint reader and also missed having separate volume controls for ringtone/system/notifications etc. Also, and most importantly, the Sony does NOT support WiFi calling and that was a deal breaker for me. \nSo I ended up returning the Sony and getting the unlocked S8 and the S8 blows the Sony away and it's cheaper as well.", "time": "08-16-2017 08:32 AM", "replies": [{"postID": "post5930354", "text": "This is incorrect. Carriers use a custom ROM to enable WiFi calling for their network or use an app. It's not the best way but it enable carriers to maintain control.\nThis is mostly an Android issue as Apple seems to have bypassed this problem.", "time": "08-21-2017 04:23 AM", "replies": [{"postID": "post5944415", "text": "The unlocked Axon 7 and S8 I bought from Best Buy over the last couple of years both had wi-fi calling built in. Neither were tied to a carrier.", "time": "08-29-2017 09:50 AM", "replies": []}]}, {"postID": "post5952546", "text": "How does it blow it away please?", "time": "09-02-2017 10:53 AM", "replies": [{"postID": "post5964655", "text": "It doesn't.", "time": "09-08-2017 03:39 PM", "replies": []}, {"postID": "post6033562", "text": "I guess he compares it by looking at the screen.\nWell It didn't look like the 4K was active at that time !", "time": "10-23-2017 03:35 AM", "replies": []}]}]}, {"postID": "post5925518", "text": "I have wifi-calling on mine.", "time": "08-16-2017 11:57 AM", "replies": [{"postID": "post5925520", "text": "Do you have t-mobile?", "time": "08-16-2017 12:01 PM", "replies": []}]}, {"postID": "post5925551", "text": "Telenor. Norway.", "time": "08-16-2017 12:20 PM", "replies": [{"postID": "post5925563", "text": "Oh I see. I don't think we have WiFi calling in USA for xy premium.", "time": "08-16-2017 12:27 PM", "replies": [{"postID": "post5930355", "text": "You probably will if you buy the phone from the carrier.", "time": "08-21-2017 04:23 AM", "replies": []}]}]}, {"postID": "post5968675", "text": "See my notes above. Great form factor for sure, but lacking key components for me. No wi-fi calling, no fingerprint scanner, lacking more detailed volume control features.\nHad the Sony had all those item, I'd still be using it. Sadly Sony doesn't offer them so I felt it wasn't worth the cost of keeping. \nThe S8 has all the above features and many more and makes for a more pleasant user experience.", "time": "09-11-2017 09:22 AM", "replies": [{"postID": "post6033560", "text": "Here in India we have WiFi calling,fingerprint scanner,for volume there are apps so no issue.", "time": "10-23-2017 03:34 AM", "replies": []}]}]}, {"title": "No outgoing call sound when people call me", "thread": [{"postID": "post5999177", "text": "Hi. Quick question I've been unable to find an answer for\nJust upgraded to a new xperia xz premium. When people call me my phone rings like normal and when I answer I can talk to them like normal however when they ring me they get silence on their end until I answer or it goes to voice mail. Not sure if this is a phone setting that needs adjusting or an optus carrier setting. Thanks in advance if anyone can help", "time": "09-30-2017 05:32 PM", "replies": []}, {"postID": "post5999528", "text": "Welcome to Android Central! I'd guess that's an Optus issue. Give their support team a call.", "time": "10-01-2017 01:45 AM", "replies": []}]}, {"title": "Sony Xperia XZ Premium - My Review", "thread": [{"postID": "post5871271", "text": "Just to give a bit of background, this year I've owned a Sony Xperia XZ, Samsung S8, iPhone 7 Plus, BB KEYone (still got that, love it) and used to work in a phone shop so I've had a good look at the likes of the LG G6 and HTC offerings... \nBeen using the XZ Premium for a couple of days solidly now so thought I'd post a few thoughts.\nI have to say I'm particularly impressed with it for a number of reasons, but mainly because it pretty much does everything well, and in some cases really well.\nThe phone is pretty big, as you can see in the photos the chin and forehead are quite large, but in everyday use it isn't quite as bad as pictures would have you believe. Strangely enough.\nIt's heavy, but it isn't too heavy. I used an iPhone 7 Plus with a pretty bulky case on for months so this is fine for me.\nThe chrome is a bit out there, as it is basically a mirror, but I think this version looks so much better than the shiny black.\nThe phones screen is basically the star attraction for me. I don't think I've ever used a mobile phone with as good a screen. Colours are just amazing, they look natural, smooth and crisp and no matter what you are looking at on this phone, it looks great.\nThis leads me onto another reason I love it - customisation. I love changing my wallpapers, and this phone basically looks good no matter what wallpaper you throw on. The more colourful the better though for me, as it really shows that display off. Also, Sony themes have always been a reason I've liked their devices. I downloaded a Spider-Man one which coincides with the new film and it's pretty cool. Doesn't change things too much, such as buttons etc (as some go wayyyy overboard) but the moving wallpaper is awesome.\nBattery life so far has more than surpassed my expectations. I am really pleased at how all the big manufacturers recently are managing to get a lot more out of their batteries than previous devices. I can't think of a flagship this year that has been criticised for poor battery (could be wrong?) which is great to see.\nWith the 4k display here, I expected to be needing the charger come 8pm, but no such case at all. You can see what kind of usage I'm getting below. Huge thumbs up.\nThis was unplugged at around 7am.\nCamera. Well I half expected to be disappointed but I couldn't be more wrong. Sony really do seem to have taken some strides compared to the XZ that I had last year. I don't really know what they'e done, but this is now a much more reliable shooter than that was. It takes photos pretty quickly and whilst there is still too much processing done after the shot is taken, results can be impressive. Attached some below.\nThese ones were all taken in fairly low lighting. Both outside and in. I used the phone at a wedding and a lot of people were complimenting the front facing camera as we took selfies (I won't share those... haha). They all had iPhones... I'm saying nothing.\nReally impressive results. It hasn't disappointed me once yet, and it has been used in real social instances where I wouldn't want it to let me down. Very impressed.\nI have been tinkering with the slow motion video recording and it can be tricky if you need to slow the video down at the exact second. However tonight I nailed it with my sister throwing the dog a treat which I slowed down at the exact time he dived and caught it in his mouth!  It looks great. I'll upload that when I figure out the best way, might just have to be YouTube. It's such a cool feature.\nAs I mentioned when I got the phone, the speed of the device is blazing. No slow down or hang up at all which I knew was going to be the case after reading a lot of reviews which all said the same thing.\nIt handles everything you can possible throw at it with ease, and I'm comparison I can now notice the very small hiccups and stutters on my KEYone.\nI'm a big fan of Sony putting Google now into their software so when you swipe to the left of the home screen you're right there. I think that's a great feature to be built into the phone, and I use that almost daily.\nThings I don't like?\nWell I could really do without all of that Sony bloatware. We're lucky in the UK that carriers don't add anything to devices like they do in the US. But Sony has about 9 apps for all sorts of different things and it is just excessive and annoying. They notify me all the time, despite me being sure I had turned them off. You can disable them, and also delete them but it's annoying that they are there. Although things like Sony's weather app looks really good:\nI don't like there is no night filter built into the OS. Loads of Android devices do this now and I would get a lot of use out go it. Shouldn't have to be downloading a third party one.\nOn screen buttons. Annoying as you lost a good bit of screen. Not a problem with some devices but when you have that chin, and then the space for buttons and then your on screen keyboard, typing can get a bit 'reachy' despite lowering the VKB height. I can't lower it too much, otherwise it is basically unusable as I'm no fan of VKB at the best of times! \nNo double tap to wake? Why Sony. It was on my XZ? Double tap to sleep is there, but no wake. Odd.\nNo lock screen notifications. This goes hand in hand with the above. My KEYone had lock screen notifications and when I had a notification the screen would kind of half come on and just display a black background with white text detailing the notification. None of that here. So this is where double tap to wake would help so I could easily reach over when it's on my desk to quickly check if I was needing to reply to something. Instead I have to press the power / unlock button to do that, which is really annoying.\nThose niggles aside, I am enjoying this phone a lot. I should have known seeing how much I liked the XZ, but this is in a whole other ball park. I personally think it is one of the best looking phones in years, which is odd given the criticism\nit has had because of the bezels. But for me, it's a winner in the looks department.\nHope this helps anyone who is considering the phone .\nSorry for the length of post, I do tend to go one when I get excited about new tech!", "time": "07-02-2017 05:26 PM", "replies": [{"postID": "post5927955", "text": "How's it going with your XZ premium now? 2 months since you purchased it.\nAm currently looking into it as a possible purchase.\nThanks.", "time": "08-18-2017 04:34 PM", "replies": []}]}, {"postID": "post5872084", "text": "Great review! Love the pics as well. I have a Pac-Man ghost lamp, similar to that Mario lamp you have.", "time": "07-03-2017 01:28 PM", "replies": []}, {"postID": "post5882238", "text": "Great review. I just ordered mine. A international model on Amazon. Long time user of the Sony Xperia Z5 Premium.", "time": "07-12-2017 08:36 AM", "replies": [{"postID": "post5882917", "text": "Congratulations I think you going to love it. \nHad mine a week and wow it's fast and smooth. \nAlways had Samsung Note series Phone or more recently am S7edge,but Sony have really impressed me.", "time": "07-12-2017 06:45 PM", "replies": []}, {"postID": "post5904093", "text": "I assume this will be GSM only (T-mobile, metro pcs) and more. Also I've read that the USA version will not have fingerprint reader enabled. Any truth to this?", "time": "07-29-2017 08:21 AM", "replies": [{"postID": "post5905369", "text": "The US model will only be bought by the uninformed. International version is cheaper, has working FPS and is available for fast delivery from many online retailers including Amazon prime.", "time": "07-30-2017 09:16 AM", "replies": [{"postID": "post5916502", "text": "Does international model have all the US LTE bands?", "time": "08-08-2017 11:44 AM", "replies": []}]}]}]}, {"postID": "post5887118", "text": "Are them bezels bothering you at all? \nThanks for the fantastic review. I will wait for Sony's releases in September before deciding.", "time": "07-16-2017 08:51 AM", "replies": []}, {"postID": "post5887258", "text": "Great review!!", "time": "07-16-2017 10:55 AM", "replies": []}, {"postID": "post5887937", "text": "Great review, I own the s8, htc u11, op5 and pixel xl and the xz premium is the best one out of all of them for me. Hands down this is one underated phone. The screen is certainly the best in class, battery life is amazing, camera is fantastic, reception is the best lowest db out of all my other phones, and its very comforfable to use. Personally I use the face recognition to unlock my phone and the sony does it faster than my fingerprint, love the side button placement as well. Its just a real impressive blazing fast device.", "time": "07-17-2017 12:58 AM", "replies": []}, {"postID": "post5896606", "text": "If only it would work on Verizon....", "time": "07-23-2017 11:50 AM", "replies": []}, {"postID": "post5902528", "text": "I loved my Z5 but it had serious heat issues with the back glass getting red hot and at least here in Australia the Android updates were woefully slow which is a security concern at the least. The chrome on the sides really gets up my nose when I held it but you're right the screen is nice to look at. Thanks for the review.", "time": "07-28-2017 02:08 AM", "replies": []}, {"postID": "post5904853", "text": "Yes no fingerprint reader on us models but if you load the European os it will work. Google it. Great phone. The review is accurate. Notice the improvements in every aspect over my previous phone Sony Experia Z5 Premium.", "time": "07-29-2017 07:19 PM", "replies": [{"postID": "post5904854", "text": "", "time": "07-29-2017 07:21 PM", "replies": []}]}, {"postID": "post5994661", "text": "Erm the distortion issue is something you might want to take into account. Other than that its an awesome phone... Owh and the missing double tap to wake...", "time": "09-27-2017 04:33 AM", "replies": []}]}, {"title": "where is the XZ1 section?", "thread": [{"postID": "post5991832", "text": "Anyone have an idea?", "time": "09-25-2017 08:22 AM", "replies": []}, {"postID": "post5991914", "text": "At this point, There isn't one. I can send this request to @James Falconer, who can make a forum.", "time": "09-25-2017 09:45 AM", "replies": [{"postID": "post5992429", "text": "Thx. I'm interested in this phone (Compact especially).", "time": "09-25-2017 04:28 PM", "replies": []}]}, {"postID": "post5992240", "text": "Well considering it's out for sale in many regions and in the US as well, I think it makes sense. Thanks\nBtw, i find it kind of rediculous that the pixel 2 has had a section for weeks and not even announced.", "time": "09-25-2017 01:49 PM", "replies": []}]}, {"title": "Sony Xperia XZ: A 2017 review of a stunner phone", "thread": [{"postID": "post5838474", "text": "Hey all\nIve never had much luck with Xperias, in fact, every one ive owned (including an earlier XZ) has always had camera issues (mainly ISO and poor focus), however, after returning my HTC U Ultra I took a chance .. and am I happy I did...\n- I know its a SONY but I gotta say.... The Camera on this phone is stunning, amazing DIS (even if you move, just re-tap the physical shutter button- it refocusses).. its actually got better stablisation than some OIS devices)... and unlike 80% of other phone cameras, it actually focusses where you tell it too \"touch the screen\" , which means when doing MACRO shots of flowers or small objects.. it actually focusses on that area producing some awesome Bokeh and almost \"3D\"-like effects. \nHowever, the camera in \"Superior Auto\" can be hit and miss, but very simple adjustments in Manual Mode is what makes it amazing.. so Outdoors.. ISO 50 / 100 ... Indoors (daytime) 200 / 400 .. and lowlight..800... but IMO, dont go higher than 800 ISO for any situation.. and thats all you need really, the rest, youll learn as you go... IMO, if you learn to use this camera, it can be truely stunning \n- White Balance is accurate, with lush greens and lovely blue skies,, shutter is nice and fast and low-light is actually really good...\n- The stereo speakers are reasonably loud and punchy, but not too harsh or tinney.. although the waterproof membranes prevent a fatter, rounder mid-range.. but theyre great for podcasts or late night listening... Sadly, ringtones and notifications still not that loud.. I wish SOY would sort that out. \n- The 1080p Screen is excellent and gets very bright.. it actually looks like the image is floating on the screen at times, even in direct sunlight its very good.. but like every phone could be better.\n- Ive only had this phone 2 days so cant comment on Battery life, but so far its pretty good..\n- The UI is clean and fast, and incorporates Google Now and Assistant as a main home screen, so no fiddling with multiple companions and assistants.. SONYs Walkman player, audio section and excellent headphone audio is here as well, with Spotify built in.. if you want it.. although I prefer the more mature UI of Deezer..\nIm really pleased with it.. and at the moment, your can get it for really cheap to contract £24 a month in UK, plus its running build 41.2.A.2.223 (711), so the OS has matured with lots of fixes over the months.. something which the XZs and XZ premium wont have had.\nI was offereed the XZP when I bought this, but wouldve had to pay an extra £150 upfront, was almost tempted, but so glad I didnt.. because who needs 4k on a 5.5\" screen anyway\nCheers", "time": "06-04-2017 10:47 AM", "replies": [{"postID": "post5842895", "text": "Is this a XZ or XZs ?\nI have a XZ and the only complaint that i have with the camera (well actually two) is: \n- the extreme oversharping and associated artifacts.\n- no RAW output available", "time": "06-08-2017 02:43 AM", "replies": []}]}, {"postID": "post5839456", "text": "Well, I'm still on the fence between the XZP, XZS and the U11. The vanilla xz isn't even in the question now that the s is part of the equation. The camera is really the deciding factor. Just waiting for all the flow of camera comparisons. Then I'll choose and have to decide, if I go Sony, if the 4k HDR screen is worth it.", "time": "06-05-2017 10:42 AM", "replies": []}, {"postID": "post5841896", "text": "I just bought the XZS and I can agree with just about everything! I love the phone! However I am still playing with the camera! Sometimes hit and miss. For the most part it's fantastic. But i have compared some lower light with my wife's S7 and the S7 wins, not by a lot but it does. I will continue to practice with manual etc. I love being in control and actually using the camera's capabilities to fit the setting! I was going to ask something along the lines of what I should be using so your post does help! Does anyone recommend lowering the MP's? Use the 19 (4:3) or Drop it to the 17 (16:9) or even to the 12? Thanks!", "time": "06-07-2017 07:39 AM", "replies": []}, {"postID": "post5842885", "text": "Why does Sony STILL struggle with low light?", "time": "06-08-2017 02:27 AM", "replies": []}, {"postID": "post5844788", "text": "You'll have to play around with the Sony cameras for a bit.\nNot that it's a bad camera, but it's one that requires quite a bit of hands-on time and understanding to really take advantage of it. \nDon't hesitate to play around, experiment and have fun. Of course, it's disappointing that the Superior Auto mode isn't really.....Superior, but you can get better results with some coaxing.", "time": "06-09-2017 12:55 PM", "replies": []}, {"postID": "post5845353", "text": "OK.Love my xzs, however how can I group text? Where it all stays in one thread and doesn't send single SMS. This is an unlocked phone but I have checked all apn settings etc. No I do not want textra or any third party apps. Thanks", "time": "06-09-2017 10:13 PM", "replies": []}, {"postID": "post5938532", "text": "Which country are you in? I had a US XZs on AT&T and I could not send group MMS unless I was using the US firmware. I tried all of the other regions so I could use the fingerprint sensor but I couldn't send group MMS. Not having a working fingerprint sensor and no double tap to wake were enough for me to send it back. My XZ can do all three with non-US firmware.", "time": "08-25-2017 02:43 PM", "replies": []}, {"postID": "post5981597", "text": "Rather than me writing a 2nd review... \nIve just upgraded to the XZPremium.. and its fantastic.. Im in the UK, and Im running UK Unbranded build 7.120 (Security: Aug), and the same stands for this phone as for my previous XZ, with additions....\nOn my XZP, Im not seeing any distortion or warping on images taken with the default camera app, although I did read that SONY had released an Update to fix this.. The images are clean and crisp, with great white Balance.. however I have noticed slight softening and even mushy at the far edges of the images on RARE occasions, but IMO, its the subject that i take the shot for and the far edges dont concern me... but you do get this with wide angle lenses anyway. A good ratio ide say would be 1 - 5% from the edge is acceptable... anything over 5% ide replace your xz, but what is surprising with the camera is the Superior Auto Mode ACTUALLY works.. yep, its true.. Every single xperia phone Ive ever owned... its always been tinckering with the , ISO, EV.. of Manual to get something reasonable, however, SONY, have actually pulled this one off, so well done SONY, although according to SONY and web reviews, they say the XZPrem camera tech has been re-built from scratch, instead of just an Upgrade / Update.\nAudio is also fantastic, nice rounded sound at about 70-80% volume, using the phone body as a chamber (The phone vibrates in hand), but again... I had read many complaints about the Audio, especially, ringtones and Notify volumes being too quiet, so whether SONY have listened and theyve increased the volumes, I cant say... but to me... they sound great loud enough \nFor Music, its not as loud, but quality is on par, if it not better than an iPhone 7+, yet not quite as punchy or loud as the HTC U11. But best of all...\nIT HAS A HEADPHONE JACK... YAYY, Thank you SONY for the Love, and not being Stupid.. Speaking of Headphones and Audio, the sound is stunning.. and the Noise Cancelling is in the phone as well as a High End DAC, so Your headphones really do sound fantastic.\nAnd the best till last.. That Screen.. Its gorgeous, although scaled down to 1080p on day-today running, it really looks great on 4k, when you can find some that is .\nBattery life is V.good, on light to moderate use, I get 2 - 3 days out of a full charge and a 1 and a half on heavy use, so im happy.\nDont get me wrong, its not perfect.. occasionally the camera messes up big time and some images have bad camera shake, even though you were rock still... ringtones can sound very Compressed and wierd through the speakers,.... it can feel massive and awkward in the hand with no real style or shape (ala HTC or Samsung), but its all worth it IMO.\nI highly recommend this phone, it looks gorgeous (Deep Sea Black) and, even though the shape remains the typical SONY Slab of Glass.. it turns heads and is a welcome sight from the morass of iPhones and Samsungs everywhere, so its nice to feel a bit unique and different.", "time": "09-18-2017 02:43 PM", "replies": []}, {"postID": "post5981809", "text": "Thanks for this review. I'm debating on getting an XZ1 when they're released. Was this a difficult choice for you? knowing the XZ1s are out any day.", "time": "09-18-2017 04:34 PM", "replies": [{"postID": "post5981956", "text": "No, not at all... Im a big fan of phablets in general.. my sweet spot for me being 5.5 to 5.7\", plus.. alot of phones now are getting thinner and thinner, which IMO, is pointless because 1) easier to drop and too flimsy... and 2)when I spend £600+ on a phone, I like to feel Ive got my monies worth with a bit of weight and size. \nThe advantage to a bigger phone, is better Audio... bigger body and surface area of the device, gives a better spread of sound over a slightly larger area. The body of the device acts as an echo chamber, so thicker bigger bezels and body gives better all-round depth. While the Xperias have front facing speakers, the principles for the iPhone 7+, HTC U11 & U Ultra (Main Woofer on the bottom, earpiece Tweeter on the top) acts in the same way.\nHave no Regrets", "time": "09-18-2017 06:06 PM", "replies": []}]}]}, {"title": "Why isn't there an XZ Premium forum?", "thread": [{"postID": "post5735579", "text": "And is anybody eyeing it up?\nFor me, bezels are just too horrible. Sadly.", "time": "03-31-2017 12:24 PM", "replies": [{"postID": "post5742732", "text": "This would be one phone that could possibly pull me away from HTC this year. Pricing aside, I'm willing to pay the money, I will definitely be giving this a consideration around Xmas time. Comparing it to the HTC Ocean. One of these two phones will take my money later this year. Guaranteed!!!", "time": "04-04-2017 08:57 AM", "replies": [{"postID": "post5743241", "text": "Me too, most likely between the XZ Premium and HTC 'Ocean'.\nWhat do you make of the Premium's top and bottom bezels though??", "time": "04-04-2017 01:31 PM", "replies": [{"postID": "post5743445", "text": "To be completely honest with you , bezels have never bothered me. To me, it is a necessary evil for the ergonomics of a device. I believe that in order for me to properly use my device throughout the day , I have to have those bezels there.", "time": "04-04-2017 03:21 PM", "replies": [{"postID": "post5750684", "text": "On the black version the bezels are less noticeable than on the chrome version. Black always makes things look slimmer and discreet!", "time": "04-09-2017 04:00 AM", "replies": [{"postID": "post5753895", "text": "Yeah, not sure I would ever go with a chrome or silver phone. I had all dark HTCs(desire hd, m7, M8, 10) and a Sony Xperia TL. The only silver phone I had was the M9. And I quickly regretted it. I wish I had gone with the gun metal. So for me, it's always dark phones.", "time": "04-11-2017 07:36 AM", "replies": []}]}]}]}]}]}, {"postID": "post5736107", "text": "There are so many different Android devices out there that it's unfeasible to have a subforum for every single one. Subforums are generally created based on a phone's popularity and demand. You could send a request here, if you'd like: Contact | Android Central", "time": "03-31-2017 04:39 PM", "replies": [{"postID": "post5952480", "text": "Merely bumping this post. Nothing more", "time": "09-02-2017 10:06 AM", "replies": []}]}, {"postID": "post5736880", "text": "But this is obviously going to be a major flagship of the year...", "time": "04-01-2017 02:35 AM", "replies": []}, {"postID": "post5737829", "text": "By all means, send a request using that link above. For now, just keep posting in the main XZ forum. (I don't have any direct control over creating new subforums.)", "time": "04-01-2017 04:02 PM", "replies": []}, {"postID": "post5763395", "text": "There's now a OnePlus 5 forum and that will be launched after the XZ Premium", "time": "04-17-2017 08:24 AM", "replies": []}, {"postID": "post5777230", "text": "Can someone please request this subforum.", "time": "04-22-2017 11:12 AM", "replies": []}, {"postID": "post5777607", "text": "I like the looks of this phone. It doesn't look like all the Samsung clones out there. I already pre-ordered mine from the UK.", "time": "04-22-2017 01:58 PM", "replies": [{"postID": "post5777761", "text": "When is it going to be available in the UK?", "time": "04-22-2017 03:19 PM", "replies": []}, {"postID": "post5777792", "text": "From Clove?", "time": "04-22-2017 03:38 PM", "replies": [{"postID": "post5777811", "text": "Just checked. Expected 1st week in June", "time": "04-22-2017 03:49 PM", "replies": []}]}]}, {"postID": "post5788849", "text": "I went with unlocked mobiles.com. I think they said they would be available on May 22.https://www.unlocked-mobiles.com/sim...e-p-87511.html", "time": "04-27-2017 06:12 PM", "replies": [{"postID": "post5798327", "text": "Is this site shipping to the US? I will definitely be buying the European model. Because the fingerprint scanner.", "time": "05-03-2017 05:27 AM", "replies": []}]}, {"postID": "post5797554", "text": "Think I'll be going where the new HTC instead.\nThe more videos I see of it, I can't accept the bezels on the XZ.", "time": "05-02-2017 03:50 PM", "replies": [{"postID": "post5799307", "text": "So you've decided huh? I'm so undecided right now. I am having conflicting thoughts. I think it'll come down to the camera and the edge sense capabilities.", "time": "05-03-2017 05:35 PM", "replies": [{"postID": "post5804256", "text": "I still go back and forth LMAO!\nThe XZ seems like an incredible bit of technology. Bezels are painful when you look at your phone hundreds of times a day.\nThe U 11 looks really nice, you seen that render of the red one?\nLet's see. ANYTHING to keep me away from Samsung. Which I've managed to do since I had the Soul U900 nine years ago.", "time": "05-07-2017 05:17 AM", "replies": [{"postID": "post5804632", "text": "That red render I saw in XDA. It's beautiful. The XZ Premium is stealing me away for the front facing speakers and the camera. Samples of the camera, saw some on phone arena, are stunning! The U 11 has to impress me in the camera department to get me to go full-fledged Bluetooth. I still have some great wired headsets and Sony will accommodate them well. The bezels don't bother me. It's just top and bottom for the front speakers. Right now for me it's really only going to come down to camera, I think.", "time": "05-07-2017 10:48 AM", "replies": [{"postID": "post5804671", "text": "The every photo sample I've seen from the Premium has been stunning. It could be camera of the year. I can forgive the relatively slow shutter speed Sony is known for if the camera produces that kind of quality.\nYou know the HTC will come with a USB C headphone jack adaptor?\nThe Xperia has high res audio like the HTC right? Are they comparable? If so, the front facing speakers of the Sony may just sway me.", "time": "05-07-2017 11:15 AM", "replies": [{"postID": "post5804697", "text": "Well if they continue the current Sony trend, they have a custom DAC that produces comparable, if not superior, audio quality. I know it'll come with the dongle but I charge and listen at the same time for at least an hour and a half every day. But, if the camera is on the same level and the edge sense seems practical, I will go HTC.", "time": "05-07-2017 11:45 AM", "replies": [{"postID": "post5804702", "text": "Gotcha.", "time": "05-07-2017 11:54 AM", "replies": []}]}]}]}]}]}]}, {"postID": "post5799309", "text": "Edit. Double post", "time": "05-03-2017 05:35 PM", "replies": []}, {"postID": "post5802204", "text": "Yes they will ship to the US. They say two day shipping, but I'm not going to hold them to that. I don't care what the company, whenever they say 2 day shipping you can count on a week at least. LOL\nI want the fingerprint scanner also without having to flash a ROM. I figure since they speak English in the UK that the worst thing is that a few words may be spelled differently than what we are used to. You know colour instead of color.", "time": "05-05-2017 02:08 PM", "replies": []}, {"postID": "post5804759", "text": "Bezels mean I can hold the phone and not accidentally open up apps. Bezels on this phone mean front facing stereo speakers. The camera looks to be a real winner, and a dedicated camera button adds usability. Can't wait for this phone to come out!", "time": "05-07-2017 12:53 PM", "replies": []}, {"postID": "post5806928", "text": "With you on this phone. Can't wait. This is a beautiful phone with some great tech. I pre-ordered already!", "time": "05-09-2017 07:03 AM", "replies": []}, {"postID": "post5811869", "text": "Enjoying the tumbleweed here.\nIt's because there's virtually **** all US market for Sony that it's so dead here, right?", "time": "05-12-2017 01:39 PM", "replies": [{"postID": "post5813110", "text": "I'd believe that to be a strong reason for the lack of a XZ Premium forum. \nEither way I'll wait for the reviews before I decide between the U11 and the XZ Premium. Although if Nokia launched their flagship soon it'll be a tougher choice", "time": "05-13-2017 11:18 AM", "replies": []}]}, {"postID": "post5813633", "text": "Holding out for HTC, but this seriously has my mind in a daze. This is surely to be a very hard decision between the two this year...\n\"We love being surprised as much as we like being impressed. And Sony just delivered!\"-GSMArenahttp://m.gsmarena.com/sony_xperia_xz...ew-1610p10.php", "time": "05-13-2017 07:52 PM", "replies": [{"postID": "post5814308", "text": "Thanks for this. I'm a bit concerned about:\nExcellent audio quality on an external amp with average loudness. Unfortunately, loudness is less than stellar with headphones.\nStereo loudspeakers sound nice but they scored Below Average in our loudness test.", "time": "05-14-2017 10:45 AM", "replies": [{"postID": "post5814378", "text": "I'm not. Most everything I have is Bluetooth now. Just bought a pair of beats wireless. My car is Bluetooth. I'm stoked for the camera experience. I'm only worried that the camera might not have a 16 second exposure like my HTC 10 does. I take lots of pics of the Stars and I'd be remiss if I didn't have that feature on my next phone. Other than that, I'm almost drooling... Haha", "time": "05-14-2017 11:46 AM", "replies": []}]}]}, {"postID": "post5817260", "text": "It's going to be extra tough now that I saw the HTC u11 scored the highest score in dxomark... Damn", "time": "05-16-2017 01:00 PM", "replies": []}, {"postID": "post5819933", "text": "Damn I wasn't even considering the HTC U11 but I am now. However I am still interested in the Sony Xz Prem. Price could be better though. The U11 is only $649. I also don't mind the bezel on top and bottom. Pick your phone up and see where you thumb goes? Kind of in the lower third. Not at the very bottom. I like where the home, back, and multitasking button are on the Xz Prem. Reaching at the very bottom with your thumb is a bit uncomfortable for me. Camera is huge for me and it seems some people don't like the Sony's? Is it near the top? They seem more true in color etc. I don't know anymore, I can't decide. Just trying to stay away from Samsung, won't ever buy apple, and I am always looking for something new, I tend to get bored ha. Might check out the new Nokias too!", "time": "05-18-2017 01:05 PM", "replies": []}, {"postID": "post5819985", "text": "https://www.forbes.com/sites/davidph...llThingsMobile\nThis may have just won me over on the HTC u 11.", "time": "05-18-2017 01:40 PM", "replies": []}, {"postID": "post5820776", "text": "HTC looks like a great phone too. It's going to be a tough call either way. Seems like all the flagships are extremely competitive. Whichever you choose, please post your thoughts and enjoy. I'm still going for the Sony. Awaiting my preorder.", "time": "05-19-2017 06:22 AM", "replies": []}, {"postID": "post5823949", "text": "Now it looks like this September they will be announcing three new phones. I am now thinking of waiting and seeing how much the XZ1 will be and if it will be waterproof. Sony Xperia XZ1, XZ1 Compact, and X1 key specs leaked - Gizbot", "time": "05-22-2017 07:36 AM", "replies": [{"postID": "post5826507", "text": "Me too. I was expecting something in September, even though the Premium is out very shortly before that!\nMaybe these new phones will have more palatable bezels?", "time": "05-24-2017 10:22 AM", "replies": []}]}, {"postID": "post5826518", "text": "Yeah I feel like the XZ1 may be a better fit for myself. Hoping it's a little cheaper than the premium too. And its not quite and big as the premium etc. I personally don't want a 6 plus inch phone. And like you said maybe the bezels will be a bit better although I don't really mind them that much! I have that new phone bug though right now and waiting sucks! ha", "time": "05-24-2017 10:37 AM", "replies": [{"postID": "post5826613", "text": "The U11 has got my attention on lock for now, but I'm aiming to get a new phone by around October, so Sony stands a big chance.", "time": "05-24-2017 11:45 AM", "replies": []}]}, {"postID": "post5826663", "text": "We'll that decides it for me. I'm pre ordering a sapphire blue U11. It's a waste of time Sony releasing the XZ Premium when the XZ1 has the same if not similar specs.\nAt least the U11 won't be obsolete before it's launched unlike the premium", "time": "05-24-2017 12:36 PM", "replies": []}, {"postID": "post5829013", "text": "I pre ordered my Xz Premium Black today. It should arrive on June 9th.", "time": "05-26-2017 11:37 AM", "replies": [{"postID": "post5830600", "text": "UK Amazon have it for pre-order arriving 1st June!", "time": "05-28-2017 03:48 AM", "replies": []}]}, {"postID": "post5829281", "text": "Probably a dumb question but im going to ask. If I currently have a Samsung S5. Yes I'm always behind, usually buy last year's model, but hell I'm way behind. Would you consider the Xperia Xzs a big upgrade from S5", "time": "05-26-2017 04:08 PM", "replies": [{"postID": "post5830593", "text": "An enormous upgrade... How is this a question?!", "time": "05-28-2017 03:39 AM", "replies": [{"postID": "post5830660", "text": "Haha thanks! That is what I wanted to hear!", "time": "05-28-2017 06:23 AM", "replies": []}]}, {"postID": "post5830911", "text": "Absolutely! I've got an XZ right now and I used to have an S5 [Upgrading soon to an XZ Premium]. The XZ's easily a better phone, but if you can afford the extra hold out for the XZ Premium! It's got more ram [which is actually way more important than how much storage space it has]. Having said that the XZ is a great phone, also I've come to loath that cartoon interface they call \"Touch Wiz\" ☺️", "time": "05-28-2017 11:36 AM", "replies": []}]}, {"postID": "post5830597", "text": "I've ordered the black XZ Premium odd Amazon. The black is actually mostly cos I'm giving my silver XZ to my girlfriend, so I don't really want two really similar looking phones hanging arround ☺️", "time": "05-28-2017 03:43 AM", "replies": []}, {"postID": "post5830810", "text": "Guys I need your help. Still can't decide between this and the U11. Are the huge bezels bothersome in real life?", "time": "05-28-2017 10:04 AM", "replies": []}, {"postID": "post5835213", "text": "Got the XZS in the mail yesterday. Pretty pumped! Have not activated it on AT&T yet, but I have connected to wifi and tested it out. Pretty awesome phone! I'm glad that I was able to give this one a go at a good price and test it out before going to the premium or the next version of the xperias that are supposed to be announced this year. I think that I will be using the XZS for quite some time. By the time I need something new the Premium should cost less ha! Now does anyone know where I can get the american charger? ha I have the international with a adapter and it will suck in the long run! Thanks!", "time": "06-01-2017 07:55 AM", "replies": []}, {"postID": "post5863556", "text": "Android Central is doing their job bury this device, from the missing forum to the negative headlined articles, it shows. There is no forum here so difficult to find out about it, and secondly no local store has it on display so I can't go look at it first.\nBasically I was wondering if anyone is using the G8141 on T-Mobile and if there's any issues or manual setup needed. I'm also wondering if it has a live\\living images feature because that's the best feature ever on the lumia 950. I was looking at the LG G6 premium but somehow my lumia 950 has much better colors when looking at the screen and I'm not sure why.", "time": "06-25-2017 11:14 PM", "replies": []}, {"postID": "post5863734", "text": "Just got mines a few days ago I love it and I did get the htc 11 as well both are great however I'm leaning more on the Sony whatever you do buy from amazon not Best Buy get the international version fingerprint scanner works", "time": "06-26-2017 06:50 AM", "replies": [{"postID": "post5863786", "text": "Please tell us why you prefer the Sony to the HTC as many of us are torn between the two.\nDo the bezels bother you? Thanks.", "time": "06-26-2017 07:51 AM", "replies": []}]}, {"postID": "post5866107", "text": "The HTC button placement is too low for me for some reason I just like how the Sony looks the screen is bananas. The HTC I will give props for its speakers it's LOUD!!!!!! Its purely subjective as for as liking it you won't go wrong with either plus the HTC is a few dollars cheaper than the. Sony. Camera wise I haven't use them yet so I'll haveta to check them out", "time": "06-28-2017 04:13 AM", "replies": []}, {"postID": "post5866421", "text": "Thanks. I really wanna know how the audio quality and loudness is on the Sony, compared with the HTC... let me know when you get the chance. Thanks.", "time": "06-28-2017 09:55 AM", "replies": []}, {"postID": "post5866884", "text": "As I posted I the HTC thread, (I was toying between the U11 and the XZ Premium), I chose Sony and picked the device up today in Luminous Chrome. \nGorgeous, gorgeous phone. \nI get some role don't like the bezels and all, but the phone is just too sexy. \nSome pics. [\nSexy, right? \nWill post some more thoughts and pics as I progress with it. Testing that camera and slo-mo video should be fun too! \nShame there's no XZ Premium thread. Little annoying.", "time": "06-28-2017 05:00 PM", "replies": []}, {"postID": "post5869094", "text": "Great stuff. I suppose the fact that the US gives no hoots about Sony phones means there will be no subforum for this one.\nSad.", "time": "06-30-2017 02:12 PM", "replies": []}, {"postID": "post5869912", "text": "I like it it's a cool phone", "time": "07-01-2017 10:56 AM", "replies": []}, {"postID": "post5917935", "text": "So... Do we have an answer to the initial question ? Why isn't there an XZ Premium forum ?", "time": "08-09-2017 12:11 PM", "replies": [{"postID": "post5918034", "text": "Maybe there just aren't enough people that have this phone to warrant it's own forum?", "time": "08-09-2017 01:31 PM", "replies": [{"postID": "post5919962", "text": "Maybe. \nBut for example when the HTC 11 forum has been created, I'm not sure a lot of people had it. \nI wonder if it was not created before it even came out. \nSame for some other smartphones.", "time": "08-11-2017 12:43 AM", "replies": []}, {"postID": "post5927102", "text": "Yet there is a forum for some random never heard of phones like the LG Joy? What the hell is that anyway?\nATTENTION ANDROID CENTRAL FORUM ADMINISTRATORS: WHY IS THERE NO FORUM FOR THIS FLAGSHIP PHONE FROM A MAJOR ELECTRONICS MANUFACTURER?", "time": "08-17-2017 09:56 PM", "replies": []}]}, {"postID": "post5918344", "text": "Still no answer. They're going to have to add fine print at the bottom of Android Central that says \"Android Central excluding Sony flagships\".\nAnyway I noticed the price dropped $100 but I still haven't been able to see one at a local store so I'll probably wait.", "time": "08-09-2017 05:10 PM", "replies": []}]}, {"postID": "post5926422", "text": "They already have a Nokia 8 forum, but no XZ premium? Odd", "time": "08-17-2017 09:19 AM", "replies": []}, {"postID": "post5927342", "text": "Did anyone send feedback to the link @B. Diddy provided on page 1?", "time": "08-18-2017 05:49 AM", "replies": []}, {"postID": "post5952144", "text": "Similarly, why isn't there a forum for XZ1 and XZ1c?", "time": "09-02-2017 02:24 AM", "replies": []}, {"postID": "post5952475", "text": "lol still no XZP forum...been using it for 3 weeks now.i have questions but wtf do i ask.lol", "time": "09-02-2017 10:03 AM", "replies": [{"postID": "post5952543", "text": "How do you like the Premium?", "time": "09-02-2017 10:53 AM", "replies": []}]}, {"postID": "post5957351", "text": "@Eggmundo - you can find the XZ Premium forum here: https://forums.androidcentral.com/so...ia-xz-premium/\n@B. Diddy @Golfdriver97 Any other forums we should add - please let me know!!\nThanks all!", "time": "09-05-2017 11:12 AM", "replies": []}, {"postID": "post5957364", "text": "Moved this thread to the new XZ Premium forum -- thanks @James Falconer!", "time": "09-05-2017 11:15 AM", "replies": []}, {"postID": "post6026872", "text": "How do you like the XZ Premium. I watched a YouTube review on that phone yesterday as a matter of fact and it's simply amazing. You must be thrilled with it. 4k screen. Man on that video the screen was so sharp and crisp. I thought the overall look of the phone was awesome. The bezels didn't bother me plus they've got to have them for the front facing stereo speakers. Hopefully I'll be able to jump up there and grab one. Today I'm slated to receive my Sony Xperia X Performance in by UPS around 10ish this morning. I can't wait for it although it's not the XZ Premium. Man I want one of those bad. Awesome phone but Xpreria X Performance will have to do right now with the 820 processor in it. I bet that 835 runs so smoothly. I can only imagine.", "time": "10-19-2017 05:19 AM", "replies": [{"postID": "post6033564", "text": "I am using it .India.\nIts balzing fast comapred to SD820", "time": "10-23-2017 03:36 AM", "replies": [{"postID": "post6034042", "text": "Yeah that 835 is top notch. I've used it before in the S8 and it was very fast.", "time": "10-23-2017 10:53 AM", "replies": []}]}]}]}, {"title": "Messaging app not working", "thread": [{"postID": "post5940231", "text": "My girlfriend is having issues with the built in messages app. It comes up but when she goes to type a message the keyboard doesn't appear, then it comes up with a message saying 'mesaaging isn't responding' then it says wait or quit. Anyone able to help?", "time": "08-26-2017 04:29 PM", "replies": []}, {"postID": "post5940246", "text": "Try Settings, Apps. Find the messaging app then force stop, clear cache and clear data. Reboot and see if that helps.", "time": "08-26-2017 04:45 PM", "replies": []}, {"postID": "post5941364", "text": "I tried it this morning before she went to work and it didn't work unfortunately just downloaded android messages and she's using that for now. I'll try and figure it out", "time": "08-27-2017 12:05 PM", "replies": []}, {"postID": "post5945875", "text": "i have same issue my sony xz is not respond sms app .try this go to play store and uninstall chrome web browser .issue is chrome browser !", "time": "08-30-2017 12:54 AM", "replies": []}]}, {"title": "My new Sony XZs", "thread": [{"postID": "post5909436", "text": "Well, so far the phone has certainly exceeded my expectations. It's snappy, fast and no lag. Considering the reviews out there knock the design (old same Sony) it's a very comfortable design. Fits nicely in my hand along with my pocket. \nIt's lightweight and has the prefect 5.2\" screen size well for me anyway. \nI went ahead and purchased the silver color which is much more attractive than boring black. \nThe color is very similar to a stainless steel and or a metallic look. \nI'm very happy with my purchase and, the fingerprint sensor works really well. I have the G8232 version and the fingerprint sensors are active.", "time": "08-02-2017 11:01 AM", "replies": []}, {"postID": "post5909461", "text": "Glad you like it! How's the camera?", "time": "08-02-2017 11:26 AM", "replies": []}, {"postID": "post5909532", "text": "In the past 12 months, I've used two phones. The Honor 8 from Huawei and the HTC U11. About two years ago, I had the Sony X and XZ and the cameras were always amazing. I've looked back and some photos taken to compare the X and XZ to the Honor 8 and HTC U11 and Sony ready does make a nice camera. Now the XZs is even better. The 4k video well, it blows others away. \nSony really doesn't get credit at times like the normal players such as Samsung and Apple. It's a shame because Sonys phone are built and designed well.", "time": "08-02-2017 12:06 PM", "replies": [{"postID": "post5909814", "text": "It always seems that Sony isn't willing to bolster its hardware with adequate marketing support. The phones (which, I agree, mostly get high marks from reviewers) therefore never get much penetration into major markets, which in turn leads to more losses for Sony, which leads to less willingness to give marketing support.", "time": "08-02-2017 04:39 PM", "replies": [{"postID": "post5909847", "text": "I agree with you 100%. What phone are you using?", "time": "08-02-2017 05:10 PM", "replies": []}]}]}, {"postID": "post5909962", "text": "I have a Nexus 6P. Haven't used a Sony phone myself yet. My previous daily drivers were an ASUS Zenfone 2, Nexus 5, and if you really want to go back in time, a Droid Razr Maxx and a Droid Incredible.", "time": "08-02-2017 06:43 PM", "replies": []}, {"postID": "post5910058", "text": "Nexus 6p good phone so I've heard. Will you be getting the Pixel 2?", "time": "08-02-2017 08:05 PM", "replies": []}, {"postID": "post5910250", "text": "At this point, I'm quite happy with my 6P, so it might be a little while before I upgrade. But if the Pixel 2 ends up blowing everything out of the water, I might not be able to resist!", "time": "08-03-2017 12:36 AM", "replies": []}, {"postID": "post5916735", "text": "Love my Xzs! I have had it for a few months now and I don't regret the choose to buy it. Can't wait to see what they come out with next. Also interested to see if they will change the design at all!\nAwesome 960fps night Fire shot I took!https://www.facebook.com/jared.welle...4581314997364/", "time": "08-08-2017 01:48 PM", "replies": []}, {"postID": "post5936998", "text": "I had an XZs for a couple weeks. I loved it. It was everything the XZ should have been. 4 GB of RAM. 64 GB of built-in storage. But I ended up returning it. It was almost the perfect Sony phone for me (I don't like glass backs so XZ Premium is out). I bought the US version and switched to a different firmware to enable the fingerprint sensor. It worked great on my XZ and worked great on the XZs. However, I soon found out I couldn't send group MMS messages with the XZs unless I had the US firmware. I could with my XZ. I then noticed the fine print about the XZs not having \"double tap to wake.\" So, I had to make a decision. Fingerprint sensor and no group MMS, No fingerprint sensor and group MMS, or stick with my XZ which could do both. Considering how much I despise group SMS text messages I didn't want to subject my friends and family to that horror just so I could have a fingerprint sensor. The fingerprint sensor is too handy, particularly when I need to unlock my phone really quickly. And double tap to wake is handy when I just want to see the notifications.\nI still miss my platinum XZs. But at least my XZ has no camera bump... But the fingerprints on my mineral black!", "time": "08-24-2017 08:06 PM", "replies": []}]}, {"title": "XZ premium and tempered glass screen protector compatibility?", "thread": [{"postID": "post5922223", "text": "I can't really tell from pictures but can you use a normal tempered glass protector on this phone and have it cover the whole screen without pulling up (halo) around the edges? Looks like the edges might be rolled but I can't tell if that's before or after the screen edge. \nThis was one of my biggest annoyances with the Pixel XL. A wet apply bestskinsever just isn't the same as tempered glass.\nI'm on construction sites regularly and things happen.", "time": "08-13-2017 09:30 AM", "replies": []}]}, {"title": "My XZs gets really warm", "thread": [{"postID": "post5914450", "text": "Hi everyone. I've had my Xperia for about one week now. It's a great phone. While surfing (no games played) the phone gets really warm. Around 104F. \nPhone doesn't have a cover yet so I do think think it should be getting that warm. \nI've reset everything back to factory reset with a fresh setup. \nI'm using Ampere app and watching the temp etc. Battery 🔋 is certainly affected by the heat for sure. \nAny other suggestions?", "time": "08-06-2017 02:55 PM", "replies": []}, {"postID": "post5914767", "text": "How's your cell signal? If it's poor, that could cause things to heat up.\nAlso, does this happen in Safe Mode? If not, then some app you installed might be going rogue.", "time": "08-06-2017 10:08 PM", "replies": [{"postID": "post5914962", "text": "The cell phone coverage seems to be steady. Other phones same location didn't ha enough this problem. This model of phone I purchased on Ebay. The fingerprint sensor is enabled which I'm wondering if this is a European version! It was enabled out of the box. It came had a weird three pronged plug so I'm wondering if this version setup is making the phone warm? \nThe phone works great and has LTE coverage.", "time": "08-07-2017 04:52 AM", "replies": []}]}, {"postID": "post5914813", "text": "I had the Sony Xperia Z5 Premium before I bought the xzp. It got real warm but Sony built in cooling for that chip. The XZ Premium is way cooler.", "time": "08-06-2017 11:35 PM", "replies": []}, {"postID": "post5914963", "text": "It could be some form of bloatware/malware. Check your running applications/services and see if you notice something suspicious. Regular scan with Malwarebytes is also recommended\nPhone heat usually correlates to either intensive gaming or malware. Not always obviously, but there is a possibility.", "time": "08-07-2017 04:58 AM", "replies": []}, {"postID": "post5915053", "text": "Thanks for the tip. No malware found.", "time": "08-07-2017 07:43 AM", "replies": []}, {"postID": "post5915363", "text": "When it heats up, does anything in the Battery stats show up as using an inordinate amount of battery?", "time": "08-07-2017 12:46 PM", "replies": []}, {"postID": "post5915396", "text": "Here you go", "time": "08-07-2017 01:07 PM", "replies": []}, {"postID": "post5915432", "text": "How about the phone's own Settings>Battery​ screen?", "time": "08-07-2017 01:25 PM", "replies": [{"postID": "post5915464", "text": "", "time": "08-07-2017 01:43 PM", "replies": []}]}, {"postID": "post5915676", "text": "I see that Cell Standby is 4%, and your cell signal is only 2 bars. It's still possible that poor cell signal is causing an issue. Charge up to 100%, then use it normally until it's down to about 30%. Then show us a screenshot of GSam's cell signal strength graph.", "time": "08-07-2017 05:02 PM", "replies": []}, {"postID": "post5920464", "text": "the XZ/XZS does get warm due to its metal body, remember, metals are extremely good conductors of heat.\ni do have a modified thermal engine if you are rooted, it utilises the msm_therm sensor, which is much more accurate than what sony is using(emmc_therm)", "time": "08-11-2017 11:45 AM", "replies": []}]}, {"title": "No Wi-Fi calling on XZ Premium?", "thread": [{"postID": "post5883457", "text": "My Axon 7 was dying so last night while at Best Buy I stumbled on the XZP and thought it was a great replacement for my A7. I got it all set up last night and I'm tinkering with it today and stupid me I didn't research enough and discovered there is no ability to use WiFi Calling with this phone or did I miss it in settings somewhere? \nMy A7 had it and it worked perfectly on T-Mobile. So does the feature exiast with the XZP?? \nMy other mistep was discovering that it doesn't offer fingerprint lock/unlock. \nI fear this will go back to BB and I'll have to start my search over, thinking maybe the Mate 9 or S8 unlocked. \nThoughts?", "time": "07-13-2017 08:32 AM", "replies": []}, {"postID": "post5883484", "text": "Off hand I can't find any settings that would enable WiFi calling on the Xperia XZ Premium, or any mention of the feature. \nAs you're probably already aware WiFi calling is provided by your service provider, so it's not a software enabled feature, however there's more than one way to enable system services. \nIt could require some form of configuration file to be pushed onto the device, or it could simply not be possible on this handset.\nUnfortunately your not going to know for sure unless you ask your service provider. \nGood luck and hope it all works out. \nBarry", "time": "07-13-2017 08:55 AM", "replies": [{"postID": "post5917894", "text": "It has to be available from the provider and the handset must also support it in order for it work properly.", "time": "08-09-2017 11:50 AM", "replies": []}]}, {"postID": "post5883686", "text": "Thanks.\nThe more I'm using this phone, the more I'm ready to return it I think.\nI really miss the fingerprint reader. I hate not having WiFi calling (which I use on several occasions) and I hate that it doesn't offer separate volume controls for Ringer, Notifications, Media, etc. Instead it combines phone ringer AND notifications, stupid way to do it. \nSo I think I'll go grab the unlocked S8 from BB who is giving out a $200 gift card too and will price match. \nI really hoped this phone would be better suited for my needs than it turned out to be.", "time": "07-13-2017 11:30 AM", "replies": []}, {"postID": "post5888193", "text": "Update. I returned the XZ and did end up with with the unlocked S8 ($200 BB gift card) locked in my decision. The S8 hs been rock solid so far. So many more features as well.", "time": "07-17-2017 08:27 AM", "replies": []}, {"postID": "post5900630", "text": "Think overall you will be happier with the S8 anyway. \nCan't believe that a phone in the price bracket of the XZP doesn't have voWifi.", "time": "07-26-2017 01:54 PM", "replies": []}, {"postID": "post5905362", "text": "If going the route of the XZP the best bet is to go with an international version. They can be had for $600-$650 on Amazon with prime shipping and the FPS works great. I have an S8+ but the XZP has taken over the primary phone role for me.", "time": "07-30-2017 09:13 AM", "replies": []}, {"postID": "post5917908", "text": "I kind of figured that", "time": "08-09-2017 11:58 AM", "replies": []}]}, {"title": "Cellular Data Usage crashing", "thread": [{"postID": "post5913554", "text": "Hello, \nI am using a vanilla UK unlocked Xperia XZ. Android v7.1.1.\nThe settings app always crashes whenever I try and access/track my data usage (over cellular). \nCan anyone help at all?", "time": "08-05-2017 06:48 PM", "replies": []}, {"postID": "post5913563", "text": "Does this also happen in Safe Mode? How do I enable and exit safe mode? – Sony Xperia™ XZ support (English)", "time": "08-05-2017 06:56 PM", "replies": []}]}, {"title": "Good comparison video of S8 vs XZP", "thread": [{"postID": "post5862063", "text": "", "time": "06-24-2017 12:11 PM", "replies": []}, {"postID": "post5884006", "text": "Thanks great review", "time": "07-13-2017 03:56 PM", "replies": []}]}, {"title": "Android pay, sony Xperia xz premium", "thread": [{"postID": "post5866849", "text": "Hi,\nI'm thinking of buying the premium version of the phone but many reviews (US I think?) say that android pay does not work on the phone because of its software. Does anyone else have this problem? Has anyone payed for an item with Android pay successfully on their Sony xz premium?\nThanks.", "time": "06-28-2017 04:19 PM", "replies": []}, {"postID": "post5867388", "text": "A link to one of the reviews that this issue is stated would be nice.\nI can't seem to think of a reason why Android Pay would be an issue as it only requires NFC, which the XZP has and your device needs to have security enabled.", "time": "06-29-2017 04:17 AM", "replies": []}, {"postID": "post5867994", "text": "http://www.androidauthority.com/sony...review-751299/\nIts just in the negatives. I didn't believe it at first, but with them being quite a respectable android news websites I'm unsure.", "time": "06-29-2017 01:07 PM", "replies": [{"postID": "post5868527", "text": "It's strange that I can't find any other review indicating this issue. Though other reviews have other things that I find weird as 'negatives'. I also don't see anyone saying anything in other forums.\nIt could simply be an app issue rather than a ROM issue that Android Authority is indicating. It's possible that because the phone is so new that the app wasn't updated to work with it properly. Either that or they rooted the phone for some reason.\nThe best way to ensure if Android Pay will work with XZP would be to contact Sony or Google on a forum/email and point them to the review you linked here. That way you get the best answer rather than someone having no issues and some having many issues.", "time": "06-30-2017 02:11 AM", "replies": []}]}]}, {"title": "Where are my notification sounds located?", "thread": [{"postID": "post5858976", "text": "I just replaced my Sony Xperia Z3 phone with an Xperia XZ Premium. Enjoying the new phone so far except for one thing: the notification sound that I used on my Xperia Z3 (\"Event\") is not included on my Xperia XZ Premium.\nI was hoping that I could copy this particular notification sound from my old phone to my new phone, but I was unable to find where built-in notification sounds were stored, using both the File Commander app on the phone and connected to my computer and using the Windows File Explorer. Notification sounds added by other apps were in an obvious location, but the built-in ones were nowhere to be found--nowhere to be found by me anyway.\nSo, where are the built-in notification sounds located on my old Xperia Z3? More importantly, is it possible to transfer them to my new phone, or am I going to have to settle for a notification sound that I don't like as much as my beloved \"Event\"?", "time": "06-21-2017 10:29 PM", "replies": []}, {"postID": "post5860790", "text": "Welcome to the forum. Went thru this with another poster a while ago and neither of us could find the ringtones. Presume they are stuck in a protected folder or names are encoded somehow. Suggest you look at the thousands of tones available online and see if you can find the one you like. Might also be worthwhile to contact Xperia tech support.\nIf you need additional help or have more questions or details to share, please join the site so you can reply in this thread. See this link for instructions on how to join Android Central.", "time": "06-23-2017 10:32 AM", "replies": []}, {"postID": "post5860805", "text": "Mod note. Thread moved to the Xperia XZ forum for better visibility.", "time": "06-23-2017 10:36 AM", "replies": []}, {"postID": "post5867399", "text": "You need root access to access the folder where the ringtones/sounds are kept.\nIf you do a search you will find a couple of places that have all the Z3 sounds as a ZIP download. I found a couple but I'm unsure if the download works as the site is blocked for me (I'm at work).", "time": "06-29-2017 04:32 AM", "replies": []}]}, {"title": "Any of you guys ever used Sony Xperia before?", "thread": [{"postID": "post5822642", "text": "Okay there is not much interaction over on the Sony threads like this forum. So I pose the question for you guys if any of you have used or had either the Xperia X or X Performance? I want a 5 inch phone. These two fit the bill. They also on Amazon are going for good prices. Which of the two would you educated guys go for. The Xperia X has a 650 processor and performance has a 820 but there is a $100 dollar price difference. Which would you guys opt for? I ask here for a specific reason and it's because the intelligence level on this forum is high. Let me know your suggestions. Thanks​ to all for allowing me to ask this question here. I tried the Sony boards and got nothing.", "time": "05-20-2017 11:01 PM", "replies": []}, {"postID": "post5823385", "text": "Sony phones in the US can't use fingerprint scanners but are no cheaper than their international counterpart models.", "time": "05-21-2017 04:41 PM", "replies": []}, {"postID": "post5823408", "text": "I haven't seen a sony phone in person since 2014 or 2015, they are very unpopular in the US.", "time": "05-21-2017 05:15 PM", "replies": []}, {"postID": "post5823421", "text": "I have not used Sony devices personally, but I know they are good devices. You can't go wrong with either, IMO.", "time": "05-21-2017 05:21 PM", "replies": []}, {"postID": "post5823567", "text": "Dconn, I actually used the Xperia X which I really liked and used on a daily basis. Not a bad phone overall. Frustrating for me I had to unlock with a code or password no finger print touch. In Europe and Asia finger print works well, banned in the U.S. for some reason. Must be a patent problem I guess.\nThere's a way to make this work in the U.S. It's on the XDA's website though I didn't have the guts to try it.\nAfter the X I bought the XZ and hated it. Slow, clumsy and the battery was awful. I traded it on eBay and purchased the honor 8 which I use today.\nI've heard​ the XA1 is a good little phone for $299 but no fingerprint user available and the battery might be suspect on daily use.\nHope this helps!", "time": "05-21-2017 07:43 PM", "replies": [{"postID": "post5823814", "text": "I'm thinking about jumping out and on the X Performance this time around. I too have had the X and I liked it. I can live without a fingerprint scanner so I'm good there. I just hope to see noticable differences in performance between the X and performance. I can pick the white performance up on Amazon right now for $360 which for a flagship speced phone isn't a bad price or I can go as low as $277 on the X it self to save if I want to. Another one I'm considering is the Sony compact but the 720 resolution is a deal killer for me on it or that would be the phone I went for.", "time": "05-22-2017 02:41 AM", "replies": []}, {"postID": "post5825016", "text": "I also want try the Sony x compact as well. It's a bit more expensive and although this really doesn't matter much on a 4.6 display, 720p just bothers me for a top end device.", "time": "05-23-2017 03:22 AM", "replies": [{"postID": "post5827202", "text": "I'm with you here on this point. The compact needed to be at least 1080p and I'd already had gotten that device. That said the 720 display killed it for me too.", "time": "05-24-2017 10:11 PM", "replies": []}]}]}, {"postID": "post5826838", "text": "I really want to try an Xperia phone. I'd love to have the XZ, XZS or XZ premium to try for a couple weeks. Not many used ones out there either. I can't pull the trigger for full price yet. Just can't. Youtube reviews are general pretty good. The XZ1 and XZ1 Compact are supposed to be announced this Sept and sound like they might be strong contenders.", "time": "05-24-2017 03:32 PM", "replies": [{"postID": "post5827124", "text": "Yeah, I'd love to use a Sony phone too! It will be interesting to see how the Compact series fares in the fall.\nI personally think Sony devices are cool and underrated. My brother had one a few years back and I loved it!", "time": "05-24-2017 08:39 PM", "replies": []}]}, {"postID": "post5832998", "text": "I'm out on the Sony Xperia. They just discontinued the line.", "time": "05-30-2017 10:25 AM", "replies": []}, {"postID": "post5832999", "text": "Along with the compact too! They just released that one too!!", "time": "05-30-2017 10:25 AM", "replies": []}, {"postID": "post5834474", "text": "Mod note: Moved out of the Honor 8 forum to an Xperia forum since this is not about the Honor 8.", "time": "05-31-2017 02:36 PM", "replies": []}, {"postID": "post5835392", "text": "Just bought the XZS off ebay for a pretty good price and I'm loving it so far. International version with fingerprint scanner. Have yet to activate it on AT&T. Hopefully I won't have any issues there. Will keep posted on my experience with the XZS!", "time": "06-01-2017 10:39 AM", "replies": []}, {"postID": "post5840272", "text": "i have hade always had but then was was it Ericsson later sony-ericsson and now is it sony but is still swedish teknologi love xperia X dont know how many Eriksson.sony-ericsson.and Sony xperia tack för mej or thanks for me mvh conny", "time": "06-06-2017 01:08 AM", "replies": []}, {"postID": "post5840273", "text": "i have hade always had but then was was it Ericsson later sony-ericsson and now is it sony but is still swedish teknologi love xperia X dont know how many Eriksson.sony-ericsson.and Sony xperia tack för mej or thanks for me mvh conny ps Sony Xperia Z5 still have it lov wen u can film in K4 soo ******* nice agen. Conny", "time": "06-06-2017 01:08 AM", "replies": []}, {"postID": "post5840409", "text": "Im using Xperia X since 5 months, I did not experience any problem so far like crash problems, lagging issues etc. It works all games,applications very well ,so performance is not bad,and it has nice camera. It is nice phone for its price, it worths. I wish it has the ability of working under water", "time": "06-06-2017 06:14 AM", "replies": []}, {"postID": "post5840601", "text": "I've used the XZ before. It was a solid device.\nHonestly, wait for the XZ1. The Compact is rumored to return to the usual \"high-end specs in a small body\" ethos.\nThe XZ Premium is nice, though. I legitimately want to give it a shot, moreso than some other phones.", "time": "06-06-2017 09:52 AM", "replies": []}, {"postID": "post5853685", "text": "I love Sony phones. I had Z3 from T-Mobile and Z5 Premium. I broke both and told myself no more expensive phones. Got an axon 7 for 400 because x performance was way too much. Now that its 350 on Amazon I would say X performance all the way. Great size, great processor, Sony's bare OS is great because I like simple. Camera I'm sure is great. Nobody is taking pics for NatGeo on their phone so let's not get into a pissing competition a out camera quality. Fingerprint can be activated by flashing a UK rom from Sony onto it. Don't buy international stock without warranty. That boned me over with my Z5P", "time": "06-17-2017 10:17 AM", "replies": []}, {"postID": "post5854510", "text": "Sony stopped making entry level phones for developing markets which i think was a bad business move. Phones like Moto E and G series are quite popular and selling millions so not having that market is bad decision. \nIf Sony manages to make a decent $150 phone with decent specs then i would give Sony a chance. \nAs it is right now, Sony phones are a rip off for the price. Less than HTC but more than most other brands.", "time": "06-18-2017 05:22 AM", "replies": []}, {"postID": "post5860380", "text": "I, ve got mine on contract with 02 and although the fone, s brilliant 02 customer service is ****. With a big S.", "time": "06-23-2017 01:26 AM", "replies": []}]}, {"title": "Bluetooth stop working after 30 seconds on my brand new Xperia XZ", "thread": [{"postID": "post5829561", "text": "Bluetooth stop working after 30 seconds on my brand new Xperia XZ .\ni have another Xperia XZ too but this one work perfectly with the same bluetooth devices. My brand new Xperia XZ still connect to bluetooth device, but sometime even if connected the device is not working at all or it works for around 30 second.\ni tried to erase cache in storage option. i booted in safe mode, same problem in safe mode. Right now im trying with xperia companion software on PC to repair my phone.\nAny ideas ? thanks for help", "time": "05-26-2017 11:33 PM", "replies": []}, {"postID": "post5831343", "text": "Welcome to Android Central! Is the Bluetooth radio turning off after 30 seconds, or do the connected Bluetooth devices become disconnected? Is this happening while the screen is on, or while the screen is asleep?", "time": "05-28-2017 07:44 PM", "replies": []}]}, {"title": "My Xperia XZ being delivered today.", "thread": [{"postID": "post5826622", "text": "Getting my XZ today and wondering about flashing the UK firmware. How is the fingerprint sensor in practice? Would it be worth it?\nHave gotten used to it with other phones but if a pita to activate or use won't even attempt it.", "time": "05-24-2017 11:56 AM", "replies": []}, {"postID": "post5827382", "text": "The fingerprint scanner on the XZ is great. It works really well. Just be sure when you're setting it up that you think about all the different ways you may unlock the phone with that one finger.\nYou can have additional fingerprints as well in case you use your other hand or a different finger. I have three setup on mine.", "time": "05-25-2017 03:52 AM", "replies": []}, {"postID": "post5828425", "text": "I received mine earlier this week and flashing the firmware from the US version to Customized NOBA was super simple. Not sure if instructions or links to programs are allowed here but use FlashTool and google the directions. Takes little under and hour.\nThe user interface and operating system feels exactly the same minus the cell reception icon is only 4 bars vs 5 bars and the fingerprint reader is active. Its super fast and responsive and you can program multiple fingers. I did this depending on the hand I am holding the phone in.", "time": "05-25-2017 09:05 PM", "replies": []}]}, {"title": "Notification bar swipe down stopped working", "thread": [{"postID": "post5822779", "text": "My phone is a few weeks old with no damage and the notification bar suddenly stopped working in portrait. Still OK in landscape Sony xperia xz. It is a real pain. I have restarted phone in safe mode. Some factory reset. Used software fix in xperia companion and nothing works. Any known fixes before I take my phone back?", "time": "05-21-2017 02:23 AM", "replies": []}]}, {"title": "Alex found this the phone Sony needed 6 months ago...", "thread": [{"postID": "post5389377", "text": "His list of pros:\n-Impressive 1080 display\n-Solid performance\n-Good all around camera\n-water resistant\n-well designed software\nBut is that enough to breath life back into Sony? I for one think they need to take the kid gloves off and come up with a solid device at a reasonable price point.Sony Xperia XZ review: Return of the flagship | Android Central", "time": "09-02-2016 10:32 PM", "replies": []}, {"postID": "post5725321", "text": "When you compare the XZ to SONYs last Z line efforts.. I think theyve done a great job and are going the right way..\nThe camera is fantasti, and takes some impressive shots... the white balance and colour balance is very true.. and can easily match the iPhone and Galaxy s7 , theyve added Shutter Speed to the manual mode and you can use any mode at 20 & 23MP now (except Scenes.. which are still held at 8MP).. I own the Forest Blue version and Im very happy with it..\nMy ONLY gripe is the speakers are STILL too quiet on the ringer/Notify, yet they are great and quite loud on music,, Its got great software/OS and it runs smoothly\nIMO, SONY did a good job with the XZ,.. and like HTC... theyre back on the right path", "time": "03-25-2017 12:55 PM", "replies": []}, {"postID": "post5725443", "text": "The specs, the software, that's like 10% of the story. \nMarketing your phone and giving people many options to buy it is the other 90%.", "time": "03-25-2017 03:35 PM", "replies": [{"postID": "post5731245", "text": "Thats actually very true.. and to be honest, SONY are pretty bad for pushing their phones with next to no advertising.. take the Xperia z4 (z3+ in EU).. there was nothing, theyd rather spend the money on the PS4.\nYet the XZ is such a great phone, the 1080p screen is really bright and is excellent.. Great camera but if theyd just improve the actual camera software a little ... theyd be doing even better... even in 2017, you still cant record more than 10 mins of 4K video.. i mean really SONY!!", "time": "03-29-2017 03:56 PM", "replies": []}]}]}, {"title": "Buying advice", "thread": [{"postID": "post5655035", "text": "I'm trying to device between the ZX and the oneplus 3t. Similar specs but Sony is waterproof and a better camera but 3t is a lot cheaper. \nAny advice appreciated.\nP.S Coming from a Nexus 6P", "time": "01-24-2017 09:29 AM", "replies": []}, {"postID": "post5716548", "text": "I was also in your shoes today, but Ive settled on an XZ, because...\n- Camera is stunning since Laser AF, Light Spectrum sensor and 5-axis EIS/DIS.. Still no OIS though, but I dont find that an issue on the XZ, the 6P did great without OIS \n- Camera now has Shutter Speed added to Manual mode, yet White Balance doesnt use a Kelvin Scale, you can\n- Speakers on the XZ are improved, yet IMO still struggle to give a decent ringtone/Notiy volumes... XZ speaker are VERY good... but No where near the power of the 6P speakers\n- Sony UI even more stock since 7.0 update, even includes Google Now as a screen\n- Screen is excellent for a 1080p and REALLY vright\n- Its a 2900MAH Battery, but Ive heard of people getting 1 - 2 days or moderate use\n- XZ has SD Card slot\n- 5.2\" screen rather than 5.5\" might feel like a toy if your coming from a 6P..\nI considered the 3T as well, but it was the vastly improved camera and audio that swung me to the XZ..\nIf you can try both, but i like SONY devices \nFeel free to ask anymquestions", "time": "03-18-2017 05:39 PM", "replies": []}]}]
[{"title": "Sony Xperia XZ review", "thread": [{"postID": "post5384841", "text": "The XZ looks so good but just not sure I can buy into Sony these days. - Sony Xperia XZ review: Return of the flagship | Android Central", "time": "09-01-2016 03:50 PM", "replies": [{"postID": "post5446156", "text": "I don't know what going wrong with Sony. They were the first to introduce the water resistant phones into the market aspecially the 6.4 inch phablet they had come up with, it was great but somewhere Sony has lost. Don't see where. Everything is good but Sony is not changing its UI and software features. Other brands have overtaken.", "time": "09-25-2016 02:05 PM", "replies": []}]}, {"postID": "post5387554", "text": "I certainly don't see anything wrong with the styling, and the specs are good.", "time": "09-02-2016 12:10 PM", "replies": []}, {"postID": "post5443532", "text": "Any chance T mobile will carry this?", "time": "09-24-2016 03:30 AM", "replies": []}, {"postID": "post5444478", "text": "It's unlocked and will work on both T-Mobile and AT&T.", "time": "09-24-2016 02:41 PM", "replies": [{"postID": "post5465308", "text": "How about verizon? Thanks", "time": "10-04-2016 11:03 PM", "replies": []}]}, {"postID": "post5445463", "text": "this or lg v20? ☺", "time": "09-25-2016 03:34 AM", "replies": []}, {"postID": "post5445474", "text": "This Sony is very overpriced and the camera software is not very good.", "time": "09-25-2016 03:47 AM", "replies": []}, {"postID": "post5458300", "text": "I think LG for the camera/manual video, audio recording & removable battery. Sony for waterproof/speakers. Tho \"waterproof\" will probably be advertised as splash/rain resistant as previous xperias had problems with it, and are no longer shown taking pictures under water in ads:Sony changes stance on waterproof phones: Do not use underwater | Xperia Blog\nI guess V20 wins, unless it gets bootloop problems, which I hope it won't.", "time": "10-01-2016 01:34 PM", "replies": []}, {"postID": "post5476865", "text": "Nope, won't work on CDMA networks.", "time": "10-09-2016 09:26 AM", "replies": []}, {"postID": "post5507411", "text": "I'm seriously considering this phone. But yeah, still not available in our country.", "time": "10-20-2016 02:07 AM", "replies": []}, {"postID": "post5580596", "text": "cool. I would like to buy xz", "time": "11-26-2016 02:29 AM", "replies": []}, {"postID": "post5590944", "text": "Sony rolling out Nougat to XZ now, and the price have been reduced lately. So it can be a nice option.", "time": "12-03-2016 04:57 AM", "replies": []}, {"postID": "post5670524", "text": "Well I have bought it ☺️👍 And I am so excited about it's performance.. 😎 👍 Regards Lars DK73 🇩🇰", "time": "02-07-2017 12:28 PM", "replies": []}, {"postID": "post5699164", "text": "The camera is great on Xperia xz. I just bought it last week. It's fast, works on T-mobile network. I bought a protective case and still waiting for screen protector.", "time": "03-04-2017 11:25 AM", "replies": []}]}, {"title": "How to i fix the screen of my sony xperia xz dual?", "thread": [{"postID": "post5697049", "text": "I have my xperia xz dual for a month and then sudden happened in the screen, like there is lcd problem. And i dont know how it came out like that. i will send to you the picture of my phone with the screen problem. Hope for your reply. Thanks.", "time": "03-02-2017 03:53 PM", "replies": []}, {"postID": "post5697548", "text": "Welcome to Android Central! You'll need to register on the forum if you want to post an image. http://forums.androidcentral.com/gen...d-central.html", "time": "03-03-2017 12:37 AM", "replies": []}]}, {"title": "Both Yahoo Mail app as Gmail app not working", "thread": [{"postID": "post5475369", "text": "Transferring data from my old (Z3 Compact) to my new XZ did not go smooth by Xperia Transfer Mobile through the cloud when it didn't get past step 3 from 5 during downloaden to the XZ.\nNow I have noticed that the Yahoo mail app doesn't work: every time I click on an email, the app just stops. I removed it.\nLater on the same thing happens with the Gmail app.\nDon't know if I can provide any additional information, but this sucks.\nEdit: As of today everything seems to be working. I switched I don't know how many times between the web version and the mobile version. After I synchronized Google I noticed I could read the Gmail messages again. I thought well maybe the same will happen with Yahoo. \nSo far so good.\nMy phone also couldn't connect to the Wifi network. After adding the device with WPS (PIN + Mac adress) on the router it finally worked.", "time": "10-08-2016 03:10 PM", "replies": []}, {"postID": "post5477824", "text": "Welcome to Android Central! Glad to hear everything is working now. Let us know if any new issues arise!", "time": "10-09-2016 04:04 PM", "replies": []}, {"postID": "post5672833", "text": "Well I have no problem with my XZ. Working as it could 😀👍", "time": "02-09-2017 01:52 PM", "replies": []}]}, {"title": "For a device with a 2900 mAh battery", "thread": [{"postID": "post5389424", "text": "I think this will be a fun little phone. I'm curious to see what the price points will be on this and the Compact.", "time": "09-02-2016 10:47 PM", "replies": [{"postID": "post5449088", "text": "2900 mAh seems a little short to me. Won't last long enough, but then again for a screen of that size maybe it will. They should never compromise on battery. One of the most important things everyone needs. A large battery. Hope the new Sony devices help them in their sales. They need it.", "time": "09-27-2016 01:08 AM", "replies": []}]}, {"postID": "post5415441", "text": "Same here. I'm also wondering if it will be worth replacing my Xperia X I just got. I'm liking it a lot so the compact is going to really have to hit me hard to swap to it over my X. My X has 1080p too. I like a small phone so 4.6 vs 5 real world is a huge difference. Processors are the same and I think the cameras are the same too. I just wished they would have just stepped up to 1080p on the compact but then again smaller screen may not be able to notice any difference. I know I for sure could between the XA and my X. I started with the XA but ended up with the X. Sony will probably have it priced $100 over market value. I'd be surprised if they didn't.", "time": "09-13-2016 10:29 AM", "replies": []}, {"postID": "post5460802", "text": "Overpriced like always", "time": "10-03-2016 04:21 AM", "replies": []}, {"postID": "post5493571", "text": "It does sound cool! I've always wanted a Sony phone... So you never know! Maybe my next upgrade will be a Sony one.", "time": "10-14-2016 06:52 PM", "replies": []}, {"postID": "post5672823", "text": "Well I say that I just love it. I'm loving it's performance and I keep it for a long time 😀👍", "time": "02-09-2017 01:48 PM", "replies": []}]}, {"title": "Double tap to wake very buggy", "thread": [{"postID": "post5503400", "text": "This feature works maybe one time out of 10! It is the same with my friend's XZ too so I can't see how it's a hardware fault.", "time": "10-18-2016 05:41 PM", "replies": []}, {"postID": "post5505041", "text": "I've found that this problem only occurs when the screen has timed out by itself. If I press the power button to turn the screen off then the double-tap to wake feature works as intended. If the device is left alone and the screen powers off by itself then the double-tap to wake takes numerous attempts.\nCan anyone confirm similar behaviour with their XZ?", "time": "10-19-2016 09:54 AM", "replies": []}, {"postID": "post5507596", "text": "I have similar issue with my z3v. I think for me it's stamina mode enablement so the benefits far out way the down side of the double tap to turn on the screen.", "time": "10-20-2016 05:22 AM", "replies": [{"postID": "post5507626", "text": "I have stamina mode switched off like it was by default.", "time": "10-20-2016 05:47 AM", "replies": []}]}, {"postID": "post5520276", "text": "Yes, I just found out that after you turn the screen off by yourself and the double tap, it's really easy. It only takes two light taps. \nWhen the screen is turned off by itself, I noticed that your taps must not be too quick/ too short. Slower tapping seems to be better and maybe touch it with almost your whole fingerprint if that makes sense to you, instead of hitting it with just the tip of your finger.", "time": "10-24-2016 04:51 PM", "replies": []}]}, {"title": "Battery saving Mode", "thread": [{"postID": "post5509340", "text": "Dear all, \nI just bought The xperia xz about a week ago. One of the reasons for my choice was the battery saving Mode which promisses to preserve the battery by loading only up to 90% while you are sleep in and charging the Last 10% the last hour before wakeup. So far this function didn't enable itself allthough I made sure it is switched on and the alarm is set at the same time at weekdays. Has anyone seen this function in real life yet? How long until it switches itself on? \nThanks \nGeorge", "time": "10-20-2016 04:18 PM", "replies": []}, {"postID": "post5519932", "text": "It took a little over a week before my xz did so. I think you just have to give it some time.", "time": "10-24-2016 02:55 PM", "replies": []}]}, {"title": "Intermittent problem with people hearing me.", "thread": [{"postID": "post5472790", "text": "(Please note I've posted this exact question on the Sony Support website, but suspect they'll thank me for my question and suggest I call my local support centre)\nSince getting my XZ on Wednesday, I've had several people comment that I appear to sound very distant (or become silent) intermittently during calls; they can still hear background noise apparently, but it sounds like I've either moved a very long way from the mouthpiece or I've covered it with my hand (neither is actually happening). \nHaving had a quick Google, it seems this is a relatively frequent problem with Sony handsets. Perhaps it's true of other Android handsets too, but it was certainly never an issue with my previous Blackberry Priv. \nThe Google search suggested that turning off noise supression was a possible solution, but there's no option to do that as far as I can see. \nAs I say, this has happened on several occasions, whether I've had full 4G signal, or been connected via my femtocell (with a super-fast fibre connection). \nI know the ability to make calls seems to be quite low down the list nowadays, but it's quite important to me. Any ideas?! Other than this, it's a lovely handset!", "time": "10-07-2016 12:58 PM", "replies": []}, {"postID": "post5473366", "text": "Welcome to Android Central! Is the phone in a case? If so, make sure it isn't blocking the secondary/noise-cancelling mic, which should be located somewhere at or near the top of the phone.", "time": "10-07-2016 05:08 PM", "replies": []}, {"postID": "post5474116", "text": "Thanks for the reply. The phone is as naked as the day it was born...due partly to Sony not releasing cases at the same time as the phone! But it can't be that. \nI played around last night leaving myself voicemail messages (I don't have friends) and could hear the problem in a few messages...but not all. I then started to cover and uncover the secondary mic, but it seemed to make no difference....the sound would still drop out but not with any correlation to whether the secondary mic was covered. \nA bit more googling suggested turning \"Ok Google\" off, which I've done and so far the problem's not happened again. Whilst it makes no sense that something like \"Ok Google\" could make a difference, neither did the thought that Sony would knowlingly release phones with this problem, so it does seem to make sense to me that it's a non-Sony-software related issue. I'll see how I get on!", "time": "10-08-2016 01:27 AM", "replies": []}]}, {"title": "Sony's Latest 5.2\"", "thread": [{"postID": "post5387547", "text": "Sony are famous for the quality of their Triluminos display technology, the prowess of their phone cameras, and excellent battery life. Sony fans will be pleased by this latest offering, which continues those trends....and perhaps other buyers too.", "time": "09-02-2016 12:09 PM", "replies": [{"postID": "post5449091", "text": "Sony is coming out with a few new devices but I doubt that's gonna help them. The poor sales have really affected the company. It's the price point. Sony always keeps their phones prices higher then the rest of the companies. That's the reason for the poor sale.", "time": "09-27-2016 01:12 AM", "replies": [{"postID": "post5449279", "text": "I'm in the UK, where their higher-end devices are indeed rather steeply-priced, though they're not alone in that. Wait, and prices may sometimes be reduced, but it's regrettable to have to do that. Right now, the Xperia X Compact has caught my eye, but considering the specs, the price of about £360 is a bit offputting.", "time": "09-27-2016 05:47 AM", "replies": []}]}]}]}]
