[{"title": "Anyone else really interested in the XZ premium", "thread": [{"postID": "post5693058", "text": "I haven't owned a Sony since the Xperia z2 I am really liking the XZ Premium . Anyone else thinking about buying it?", "time": "02-27-2017 11:50 AM", "replies": []}, {"postID": "post5693299", "text": "Certainly looking...tired of glass backed phones though....all of them!", "time": "02-27-2017 04:06 PM", "replies": [{"postID": "post5693302", "text": "Same here not a huge fan of the glass but it's looks pretty nice", "time": "02-27-2017 04:07 PM", "replies": []}]}, {"postID": "post5696547", "text": "I was disappointed in the phone because it didn't have wireless charging and could not be used for VR headsets. I will stick with my Sony Xperia Z5 Premium till the Note 8 is released. I have to admit that I love the look and performance of XZ", "time": "03-02-2017 08:34 AM", "replies": [{"postID": "post6002908", "text": "Well I got the zx premium and love it. Fast and battery lasts all day. It's a beautiful phone", "time": "10-03-2017 04:33 PM", "replies": []}]}, {"postID": "post5699157", "text": "I just purchased Xperia xz and I love it so far. Especially camera! The pictures are unbelievable, very clear. You can take a quick pictures of moving objects with no smear. I upgraded from Xperia z3. I'm still learning the phone and it takes a while. \nThe phone is very fast with T-mobile network. I have some issues though with transferring my photos and contacts from my old phone. I'm still working on it. \nI got a good deal last week on xz since xz premium will be selling soon.", "time": "03-04-2017 11:17 AM", "replies": [{"postID": "post5836289", "text": "Don't you store your pictures on the SD card", "time": "06-02-2017 05:19 AM", "replies": []}]}, {"postID": "post5830588", "text": "Totally! Pre ordered a couple of weeks ago. Supposed to be arriving June 1st!", "time": "05-28-2017 03:31 AM", "replies": []}, {"postID": "post5972160", "text": "I almost bought it last week at BB. It was discounted $100 and had 24 months interest free on your BB card. I passed on it and got a XA1 Ultra for half the price of the XZ Premium. I have a iPhone 7+ and Samsung S8+ so i wasn't really looking for a flagship. I just wanted a current Sony to play around with. The XA1 Ultra is exactly what I was looking for.", "time": "09-13-2017 08:39 AM", "replies": []}]}, {"title": "Is there an alternative to Sony Companion", "thread": [{"postID": "post5898663", "text": "I have a Sony Xperia Z5 Premium Dual and want to find a program that I can install so that I can edit my contacts, send texts etc. from my laptop. The very old Sony software allowed this but I can't find a new one on line.", "time": "07-25-2017 01:16 AM", "replies": []}, {"postID": "post5902823", "text": "Microsoft Outlook", "time": "07-28-2017 09:05 AM", "replies": []}]}, {"title": "My phone just updated to Android 7.1.1", "thread": [{"postID": "post5872940", "text": "Anyone else?", "time": "07-04-2017 08:15 AM", "replies": []}, {"postID": "post5873097", "text": "The XPERIA phones got 7.1.1 not too long ago, so others may have received it as well.", "time": "07-04-2017 10:55 AM", "replies": []}]}, {"title": "Anyone get Nougat update yet", "thread": [{"postID": "post5711627", "text": "Sony is supposed to be rolling it out", "time": "03-14-2017 06:20 AM", "replies": []}, {"postID": "post5754426", "text": "I got updated to Nougat today. Bad news is that my phone started dropping my cell service a week ago. It also stopped data and will not recognize 4G. Looks like I will get a S8+ next month. I was planning to wait for the Note 8 in Sept", "time": "04-11-2017 02:34 PM", "replies": [{"postID": "post5794740", "text": "Fixed the issues I had with the phone. It was a sim card", "time": "05-01-2017 05:39 AM", "replies": [{"postID": "post5818769", "text": "Hi, I've been having this for a couple weeks now - are you on Tmo? I was looking at getting a different phone because of this, but if a new sim card worked for you, I might try doing that as well.\nThanks.", "time": "05-17-2017 03:36 PM", "replies": [{"postID": "post5823553", "text": "Posts your results please. I am ATT", "time": "05-21-2017 07:36 PM", "replies": []}]}]}]}]}, {"title": "sony xperia charging doesnt shows slowly charging while connected through usb to pc....and why?", "thread": [{"postID": "post5748893", "text": "hai friends,\nI just want know whether slowly charging is message is necessary to pop up or else no need.\nExactly how much time it takes to charge from 0-100% through sony xperia given quick charge 2.0.\nThanks in advance.", "time": "04-07-2017 06:06 PM", "replies": []}]}, {"title": "Xperia Z5 Premium will charge in recovery mode but not when turned on?", "thread": [{"postID": "post5732838", "text": "Hey All,\nUntil today my Xperia was working fine. Never any problems. Infact, I took it off charge this morning at 100% as normal. Obviously throughout the day the battery ran low so this evening I tried to charge it again but it would not charge. The only thing out of the ordinary that I did today was try to connect it to my car charger, I had tried this before and it didn't work, and indeed again today it did not work.\nI took it to the shop and they just assumed it was the port and said I would have to take it to the Sony shop to repair it. While I was there the battery went to 0% and switched off. I plugged it to the wall at home and the charging symbol showed on the screen and a red light, it also went in a loop of showing the Sony screen, like the phone was attempting to turn on, and then back to the battery screen. It didn't show a % but it showed the battery with a small bit of red at the bottom.\nI tried entering recovery mode where the phone vibrated 3 times and the red light turned blue. I got 25% charge in an hour this way and I turned on the phone which loaded normally but still will not charge.\nSo, basically the phone will only charge in recovery mode. Is there any fix for this or any explanation as to what has happened? I don't think it can be the port because it does charge, just not when it is turned on. Very inconvenient. Thank you very much in advance.", "time": "03-30-2017 09:31 AM", "replies": []}, {"postID": "post5739851", "text": "Have you tried a different cable?", "time": "04-02-2017 05:23 PM", "replies": []}]}, {"title": "Z5 Premium Have The Pre Installed Screen Protector? If Using Glass Screen Protector Take Off?", "thread": [{"postID": "post5602860", "text": "Wow-just saw video that Sony has pre installed screen protector. I always use the glass screen protectors and have one on now. Is there one of theses on the Z5Premium and if so do you recommend removing if using glass screen protector. This is the one you peel off and SONY logo comes off. Saw this on youtube. \nWouldn't you get better colors and sensitivity if removed and using glass?\nIf there is a thread on benefits on or off please forward, but let me know about if it is on before I try to remove??\nAppreciated, thanks!", "time": "12-11-2016 07:42 AM", "replies": []}]}, {"title": "Sony Xperia Z5 Premium Dual E6883 Looking To Replace S7 Edge-Yes or No?", "thread": [{"postID": "post5566892", "text": "I had the Note 7 and went back to the S7Edge-looking for replacement until the New Galaxy comes out in April?\nThis phone actually looks pretty interesting and looks great. Been reading and wondering if it is a worthy replacement.\nAlso looks like buying this in US might be tricky? I do have correct carrier for phone.\nCould someone please advice and or give information to assist with decision?\nMuch appreciated!\nThanks.", "time": "11-17-2016 07:23 AM", "replies": []}, {"postID": "post5587987", "text": "I love mine but miss wireless charging. Got mine on Amazon", "time": "12-01-2016 07:11 AM", "replies": []}]}, {"title": "New 4K Sony phone coming?", "thread": [{"postID": "post5559720", "text": "Will we see a new Sony Xperia Z7 Smartphone with 4K display at CES 2017 -", "time": "11-12-2016 01:48 PM", "replies": []}]}, {"title": "Who is still happy with their Sony Experia Z5 Premium", "thread": [{"postID": "post5552141", "text": "I still love mine. I would have gotten the note 7 if I had not gotten this phone and I would be having to settle for a Galaxy 7", "time": "11-07-2016 09:34 PM", "replies": []}]}, {"title": "I must be unlucky", "thread": [{"postID": "post5391864", "text": "I bought my z5 premium last nov when it was launched in japan. My screen went pink strips in jan 2016 but was fine after i softreset the device, than the headphone jack died in feb 2016, went the device in for repair and was fixed.\nFast foreard to end july the phone could not connect to my asus AC router even if i am standing in front of it only restart will help. Also the bluetooth had intermitten sond distruption when i am connect to my car audio systems which i did not have before marshmallow update. \nOn aug 21 st my headphone phone jack broke again and i have to sond my device again for repair, and i told the service staff all the issues i had and this time sond changed the mother board, screen, side cover/frame..... So now i have almost new phone and i hope i will not have any issues with it for a while.....", "time": "09-03-2016 07:14 PM", "replies": []}, {"postID": "post5392590", "text": "Let's hope! Maybe you should buy a lottery ticket--your luck has got to change!", "time": "09-04-2016 02:52 AM", "replies": []}, {"postID": "post5392663", "text": "For one day the phone is working great, some how the battery charging is much faster than before", "time": "09-04-2016 04:07 AM", "replies": []}, {"postID": "post5427265", "text": "Ok, my headphone Jack stopped working, but I'm reluctant to have it serviced by Sony as they charge a hefty fee if they deem it was \"your fault\" after all!", "time": "09-18-2016 08:54 AM", "replies": [{"postID": "post5475577", "text": "I wonder how can they blame you for their hardware failure? As they told me the something that it may cost $10/- to $800/- and I told them it's under warranty and I am not paying a single cent..", "time": "10-08-2016 05:05 PM", "replies": []}]}]}, {"title": "DEAD Z5P", "thread": [{"postID": "post5342082", "text": "the phone just stopped working and nothing is working to revive it. 3 months old and no warranty because I bought internantional model. Took it to local repair and seeing if they can fix it. Picked up an XA from best buy to have warranty\nPosted via the Android Central App", "time": "08-18-2016 02:29 PM", "replies": []}, {"postID": "post5347237", "text": "Sorry \nLet us know if you get it fixed. I would replace mine with a Note 7", "time": "08-19-2016 08:17 PM", "replies": []}, {"postID": "post5350312", "text": "Monday I'll find out what's up. I really loved that phone, but I think I'm done buying flagship phones just because they cost too much.\nPosted via the Android Central App", "time": "08-20-2016 06:28 PM", "replies": []}, {"postID": "post5412148", "text": "The cell phone repair shop says it's dead. Motherboard issue and I never had warranty since the phone was never sold here in the USA", "time": "09-11-2016 09:30 PM", "replies": []}]}, {"title": "How's the camera?", "thread": [{"postID": "post4799842", "text": "I'm thinking about getting a z5 and i wonder what you think about the camera, is it the best camera on a smartphone as dxomark says?", "time": "11-03-2015 11:55 AM", "replies": [{"postID": "post4857587", "text": "I came from lumina 1020 as it died.. Camera is good its not been 24 hours but what I see I like..", "time": "11-25-2015 08:56 PM", "replies": []}]}, {"postID": "post4841112", "text": "I too had some doubts about this. \nI have comes from the G4 and i had some real doubts when I attended the press event before the phone was released. I wasn't too impressed and then when I saw the dxomark review, I was stunned. I found that the units at the event, wouldn't even focus on a close up item and the pics appeared grainy\nI will test it more over the coming weeks and let you know", "time": "11-18-2015 02:45 PM", "replies": []}, {"postID": "post4841140", "text": "From what I have heard, It does not have as good of a low light camera, but it does do rather well in daylight. I have not had a hands on with it cause it is kind of hard to find.", "time": "11-18-2015 02:56 PM", "replies": [{"postID": "post4963461", "text": "It has to use a high iso to take low light images, and it also lacks image stabilisation, but then so do some of the best lenses I own. On the positive side it has an f/2.0, 6 element lens [f/2.0 is a decent aperture, and should let in a fair amount of light, but it's pretty standard these days]. Most pro level zoom lenses are f/2.8, but this isn't a Zoom as it's a fixed focal length so it would be classed as a prime. A decent prime would be around f/1.4 - 1.2... The zoom is done digitally, not by manipulating the lens element's. I've really just scraped the surface of the camera, but in the right conditions it can take stunning images. In full manual mode it's definitely up there with the best mobile cameras I've used, but it also surfer's from the same mettering problems as other mobile camera's. It's not that great with at dealing with background lighting conditions, and the lack of any clipping alerts in the camera interface is, I think, a big oversight on Sony's part. If you want your gear to be used you need to provided the right tools, but like I said, I'm still just getting started on the camera :-)", "time": "01-23-2016 04:03 PM", "replies": []}]}, {"postID": "post4880282", "text": "Maybe somebody take preview?", "time": "12-08-2015 11:42 AM", "replies": []}, {"postID": "post4955584", "text": "Really should start reading the dates on posts. Just excited about my new phone :-)", "time": "01-18-2016 06:00 PM", "replies": []}, {"postID": "post4970835", "text": "I'm thinking about trading my S6 Edge plus for the premium, just not sure if the camera will live up to the s6.\nPosted via the Android Central App", "time": "01-28-2016 03:00 PM", "replies": [{"postID": "post5104842", "text": "GS6 camera is very good, it maybe a 13MP but the software is remarkable...", "time": "04-04-2016 06:41 PM", "replies": []}]}, {"postID": "post4977604", "text": "The camera is very good, crisp images providing the lighting is good!", "time": "02-02-2016 02:52 AM", "replies": []}, {"postID": "post4994150", "text": "i love the camera, here is some pics.", "time": "02-12-2016 11:49 AM", "replies": []}, {"postID": "post4994165", "text": "some more pics, the best premium phone ever had!!", "time": "02-12-2016 12:02 PM", "replies": []}, {"postID": "post5105657", "text": "Yeah the 16mp is great. I love how every one of my pics on the z5 just seems to come out great with my kids.\nPosted via the Android Central App", "time": "04-05-2016 06:29 AM", "replies": []}, {"postID": "post5107540", "text": "Love the camera.\nPosted via the Android Central App", "time": "04-06-2016 01:53 AM", "replies": [{"postID": "post5108035", "text": "Me too", "time": "04-06-2016 08:50 AM", "replies": []}]}, {"postID": "post5410840", "text": "A couple pics from my Z5P:", "time": "09-11-2016 10:01 AM", "replies": []}]}, {"title": "Accessing data with touchscreen unresponsive... or unwarranted repair?", "thread": [{"postID": "post5365149", "text": "Hello there,\nI have a bad dilemma in front of me currently; that's either sending my phone for repair and lose all my data (hell no!), or send it to some third-party but lose warranty. Ugh.\nFew days back I've had an accident where my stupid suitcase tripped me over with phone in hand. Smashed my screen badly, but music I listened to still kept playing xD And more importantly, the display is still working, and so are the side keys - camera can still be activated.\nI reached out for support in the official Sony Chat, but we sort of ran out of options. I mean fella #1 suggested USB OTG cable, which I've ordered, but no cursor showed up when I connected it today. And then fella #2 tells me on Android 5 it will only work if you enable it in Options... And of course how the hell to do this when the touchscreen is unusable and whole thing is locked -_- Bloody vicious circle.\nNow as a last resort, I am reaching out to you guys, but won't be at all surprised if I indeed have to send it for repair to someone non-Sony. Is there really no secret tricks with side keys or something? I am prepared to do lots of fancy stuff just to get to my data.\nThe reason why I badly don't want my data to be wiped is because it's months' worth of work of photos, with many important ones out there. A large portion of those were on my SD card, which I've already secured - but because of the amount of stuff I've racked up, many were no longer fitting on the external memory card and so had to be on the internal storage. Letting them go is simply NOT an option.", "time": "08-25-2016 12:23 PM", "replies": []}, {"postID": "post5365238", "text": "Hi there, \nUnfortunately options for an unresponsive phone are limited. But let's see if some will work. \nFirst, the OTG cable they suggested is the best way to go, BUT you'll need a mouse to go with that. Make sure it's a standard USB mouse that won't require any drivers or extra power or it won't work. \nSecond, when you connect your phone to a computer, can you see the files? My guess is 'no' unless the phone has been unlocked, but if you weren't using a lockscreen, then that's one way to do it. If your phone is locked, you can try unlocking it remotely from the Android Device Manager (from the Play Store, go to the gear icon, you should see it there; for this to work Android Device Manager should not have been disabled as a device administrator on your phone). \nOther than that, not a lot you can do I'm afraid. But for future reference, I strongly suggest backing up your pictures to a cloud service. Saves a lot of headaches after accidents like these", "time": "08-25-2016 12:53 PM", "replies": []}]}, {"title": "My phone just did a update", "thread": [{"postID": "post5356194", "text": "Anyone else? \nAndroid 6.01 \nBuild #\n32.2.A. 0.253", "time": "08-22-2016 03:44 PM", "replies": []}]}, {"title": "\"No Running Apps\" in Multitasking Window", "thread": [{"postID": "post5286494", "text": "Hi guys, I've googled anbd trawled forums and can't seem to believe no-one else is having this issue, but after the recent patch, shortly after a reboot, all running apps disappear from the multi tasking window. The apps are still running as if I open them from the icon they open where left off, but the multi tasking window doesn't display anything. I've not installed anything new, the only change has been the recent patch (I'm on O2). \nAnyone else having the problem? Know of a fix (other than continuously rebooting! lol)\nModel: E6853\nVersion: 6.0.1\nPatch Level: 1/4/16\nBaseband: 8994-FAAAANAZQ-00046-27\nBuild No: 32.2.A.0.253\nKernel Version: 3.10.84-perf-gf1cfa5f / BuildUser@BuildHost #1 / Mon May 30 18:41:52 2016", "time": "07-28-2016 03:20 AM", "replies": [{"postID": "post5291175", "text": "Same here on a E6683 with Build 32.2.A.0.253", "time": "07-31-2016 03:53 AM", "replies": []}]}, {"postID": "post5288538", "text": "No issue here.", "time": "07-29-2016 08:52 AM", "replies": []}, {"postID": "post5293844", "text": "I have experienced the same thing and I too have been Googling and trying to find others talking about it. I thought it was me because I can't believe that others are not complaining or at least mentioning it. Would love to know if this \"change\" was intentional.", "time": "08-01-2016 04:47 PM", "replies": []}, {"postID": "post5310713", "text": "Is it just me or does this problem appear to have resolved itself without any further updates the last few days?", "time": "08-09-2016 05:41 AM", "replies": []}, {"postID": "post5316817", "text": "I take it back. Still a problem.", "time": "08-11-2016 12:17 PM", "replies": []}]}, {"title": "Heat issue after Marshmallow update", "thread": [{"postID": "post5141123", "text": "Anyone else having this issue or know how to solve it?", "time": "04-22-2016 03:43 PM", "replies": []}, {"postID": "post5144172", "text": "How hot? This processor in our phone runs hot. It is why Samsung used their own processor in the S6 phones. Sony used a heat sink to resolve this issue. Sometimes mine is warm but never what I would call hot.", "time": "04-24-2016 05:47 PM", "replies": [{"postID": "post5159882", "text": "Did the clean install fix the issue?", "time": "05-04-2016 07:38 AM", "replies": []}]}, {"postID": "post5145438", "text": "I can feel the heat in my pocket and my battery doesn't last as long after updating to Marshmallow. So I'm trying to figure out if these are to separate issue or along the same lines because this has only been happening after Marshmallow update. It use to get warm/hot before if I'm power using it but not just sitting idle on the table or in my pocket. I don't really see any apps running in the background that would be different after the update but it's becoming very annoying.", "time": "04-25-2016 12:21 PM", "replies": []}, {"postID": "post5146098", "text": "Never hot.. Warm maybe.", "time": "04-25-2016 08:12 PM", "replies": []}, {"postID": "post5149511", "text": "Do a clean install of marshmallow using pc companion.\nPosted via the Android Central App", "time": "04-27-2016 03:36 PM", "replies": []}, {"postID": "post5153023", "text": "Ok. I'll try that!", "time": "04-29-2016 04:22 PM", "replies": []}, {"postID": "post5160749", "text": "I actually just did a factory reset yesterday and seems to working fine again with no heat issues. So, we'll see if that continues.", "time": "05-04-2016 03:38 PM", "replies": []}, {"postID": "post5310898", "text": "I also had this issue. Every morning after switching it on I could feel the phone quite hot in my pocket. Hot enough to make it really annoying. Did a clean install and although it was a pain in the back side reinstalling apps and restoring photos, contacts etc, it worked a treat. No more heating issues. Also the battery seems to be lasting longer. After 6 hours switched on,I was on 75% tops. After reinstalling marshmallow I'm normally around 90-95% . Best advice I ever read around here.thanks", "time": "08-09-2016 08:03 AM", "replies": []}, {"postID": "post5313545", "text": "Great news that the reset worked", "time": "08-10-2016 08:34 AM", "replies": []}]}, {"title": "headphone jack", "thread": [{"postID": "post4958169", "text": "Has anyone else's headphone jack stopped working? I believe it's software related as using soundabout to force music through the jack works. Really frustrating problem given the phone is 8 weeks old. I've tried the usual things and even a factory reset.\nPosted via the Android Central App", "time": "01-20-2016 07:56 AM", "replies": []}, {"postID": "post4958186", "text": "When you did a factory reset did you test the headphone jack before or after the system reinstalled all your apps? I probably know the answer to that one, but it's perhaps worth considering. If you reinstalled all the apps that you already have it could be that one of them is messing up the audio..\nIf you can't solve it, and it's only 8 weeks old, I'd get in touch with Sony or whoever you bought the handset from...\nAll the best \nBarry", "time": "01-20-2016 08:11 AM", "replies": []}, {"postID": "post4958465", "text": "Hi Barry I did factory reset but as soon as I logged into my Gmail account apps were auto downloaded. Perhaps I should try again without signing in!\nPosted via the Android Central App", "time": "01-20-2016 11:24 AM", "replies": []}, {"postID": "post4958835", "text": "Your apps are all backed up to your Google account, which is controlled by the Gmail address you use to log in with. I'm not sure if the device will let you continue without a Google account, I suppose if it won't you could just try creating a new one...\nA factory reset is a big thing, but it would be the most effective way to rule out a rogue app. \nYou might want to consider going through individual apps that have any kind of control over the audio..\nUninstall them one by one and reboot the phone to make sure that any services the app might have started won't be running [I recently uninstalled a taker module only to find that the service it spawned was still running].\nGood luck, and let me know if you get it sorted out!\nBarry", "time": "01-20-2016 03:12 PM", "replies": []}, {"postID": "post4959006", "text": "I used to have a problem with sound, but I figured that it was the cord not the phone.\nTry other headphone cords.\nI had bought one not to long ago and it didn't work period. My phone notified me saying to pick up a different pair of headphones(basically)\nSony Xperia Z5 Premium Dual", "time": "01-20-2016 05:21 PM", "replies": []}, {"postID": "post4979496", "text": "No, there is a bug in the whole Z5 range of phone's to do with audio. I'll try to find the link again! I came across a notification from some guy doing a degree in computer science who's investigating it for XDA who's looking for bug reports. I also now think the battery drain has nothing to do with the chipset, or the screen! I think there's a failure in one of the service's. My battery dropped by 50% last night with no radio services enabled, SOT, or active apps. Google and a few other things are however in the sleep white list for the power management in order to alow my smartwatch 3 to work, which kind of makes me think that it could easily be one of them, and given that the Sony smartwatch 3 is having sudden unexpected battery drains [and Google is the one common denominator] it could be a problem with the latest Google Now app!", "time": "02-03-2016 03:38 AM", "replies": [{"postID": "post5104853", "text": "Mine just did... yesterday I sent my Z5 premium for repair... seemed like the screen was out of the frame 1/2 mm. I took my Z5 premium for snowboarding trip this winter for 4-5 times and had few big falls maybe the shock dislodged the screen and audio jack?????", "time": "04-04-2016 06:45 PM", "replies": []}]}, {"postID": "post5307381", "text": "That's literally the best reason I've ever heard for a blasted screen ☺", "time": "08-07-2016 01:58 PM", "replies": []}]}, {"title": "Rooting Problems", "thread": [{"postID": "post5251660", "text": "Hey All,\nI got an Xperia Z5 Premium a little while ago and wanted to root it. Previously I had an Xperia T2 Ultra which I rooted with ease. However, I cannot root the Z5 Premium and I don't know why.\nI unlocked the Bootloader and verified that in the Service Menu where it says ''Bootloader Unlocked: Yes''.\nHowever, when I try to root, and I must admit I am using a ''One Click'' solution as I did with the T2 Ultra, it says ''Root Failed''.\nI installed Root Checker which tells me: ''Sorry ! This device does not have proper root access'' so there's definitely something not right.\nCan anyone point me in the right direction?\nThanks in advance.", "time": "07-05-2016 05:25 AM", "replies": []}, {"postID": "post5251829", "text": "Welcome to the forums. I think a better approach would be to flash a custom recovery, like TWRP, and then install a superuser .zip file.", "time": "07-05-2016 08:15 AM", "replies": []}, {"postID": "post5253108", "text": "Thank you for your welcome and thank you for your reply. I am cautious of performing the root manually as I don't want to end up bricking the phone. Is it safe?", "time": "07-06-2016 02:28 AM", "replies": [{"postID": "post5253402", "text": "If you can find a version of TWRP fro your device, everything should be alright. There is always a small chance of bricking the device before this happens but there is a small chance of bricking devices with OTA updates too.", "time": "07-06-2016 08:43 AM", "replies": []}]}, {"postID": "post5253450", "text": "Check out the xda-developer forums. It has the best technical people", "time": "07-06-2016 09:12 AM", "replies": []}, {"postID": "post5291482", "text": "Did you ever root it? I want to root mine too, but I don't want to lose my license keys I keep hearing about. Only reason I want to root is for the unlimited hot spot feature I used to do on a Nexus 5. About to get a tablet radio for my car and don't want to be limited to 3GB of hotspot\nPosted via the Android Central App", "time": "07-31-2016 09:58 AM", "replies": []}]}, {"title": "Sony just did a Xperia update to my phone.", "thread": [{"postID": "post5149322", "text": "Anyone else get the update? It was to update those using marshmallow", "time": "04-27-2016 01:51 PM", "replies": []}, {"postID": "post5149454", "text": "How big is the update?", "time": "04-27-2016 02:56 PM", "replies": []}, {"postID": "post5149507", "text": "Its 97mb I got it today as well doesn't appear to have changed much.\nPosted via the Android Central App", "time": "04-27-2016 03:35 PM", "replies": []}, {"postID": "post5157728", "text": "Yeah, got it too, didnt understand what the change was\nPosted via the Android Central App", "time": "05-03-2016 12:46 AM", "replies": []}, {"postID": "post5169589", "text": "When it happend to my z5 few weeks back I got double tap to sleep, stamina mode...", "time": "05-10-2016 12:44 AM", "replies": [{"postID": "post5245604", "text": "How's the battery, m still hesitant about doing the udpate?", "time": "06-30-2016 03:37 AM", "replies": []}]}, {"postID": "post5274604", "text": "All I know it fixed was my Bluetooth audio skipping issue. Looks like it messed up my screen record though.\nPosted via the Android Central App", "time": "07-20-2016 07:03 PM", "replies": []}, {"postID": "post5275053", "text": "Its draining the battery visibly faster", "time": "07-21-2016 02:09 AM", "replies": [{"postID": "post5275419", "text": "No problem with my battery life", "time": "07-21-2016 08:56 AM", "replies": []}]}, {"postID": "post5275528", "text": "My battery seems fine too. Only when I increase screen brightness I'll notice more battery drain.\nPosted via the Android Central App", "time": "07-21-2016 09:57 AM", "replies": []}]}, {"title": "Unknown alarm and how can i get rid of it", "thread": [{"postID": "post5242072", "text": "there is an 2:35 alarm for everyday which i cannot see on my clock app. Can someone help me about it? \nHere are screenshots http://imgur.com/a/5oDqa", "time": "06-27-2016 04:34 PM", "replies": []}, {"postID": "post5242088", "text": "Do you have any third party alarm clock apps installed?", "time": "06-27-2016 04:51 PM", "replies": []}, {"postID": "post5242108", "text": "nope", "time": "06-27-2016 05:07 PM", "replies": []}, {"postID": "post5242116", "text": "What about any app to take notes? I remember a similar issue and it was related to an app called 'To Do Remainder'.", "time": "06-27-2016 05:15 PM", "replies": []}, {"postID": "post5242193", "text": "Nope. Nothing new. Just Google keep. Also I have tried to wipe clock data and delete cache. Nothing worked", "time": "06-27-2016 06:34 PM", "replies": []}, {"postID": "post5242220", "text": "You could try a couple of things to find out which app created this alarm.\n- Not an easy one, you need to stay awake just before the alarm goes off  About 5-10 minutes before the alarm time you get an 'upcoming alarm' notification. Swipe down from the status bar, long press on it and tap on 'app info' to be sure which one is sending it.\n- Access your notification log and scroll down the list until you find the alarm. In some devices you need a custom launcher to create a widget to access this log. Long press on the screen, tap on 'widgets', scroll down until you find settings, drag it to the screen and select 'notification log'. If your stock launcher doesn't include this option you could try with Nova or some notifications manager from the Play Store.\nTell us how it goes.", "time": "06-27-2016 07:02 PM", "replies": []}, {"postID": "post5242223", "text": "Another thought. What happens if you tap or long press on different places inside the clock widget? Do you get any extra info specially if you tap on the alarm?", "time": "06-27-2016 07:06 PM", "replies": []}, {"postID": "post5242606", "text": "Nothing shown in notification log. Also nothing happens when I long press or tap on alarm clock. Its like a ghost", "time": "06-28-2016 03:24 AM", "replies": []}, {"postID": "post5242701", "text": "That's weird. Any alarm should register in the notification log after its triggered. Not sure what else to suggest. Just a question. That clock widget with the app shortcuts, is it stock or from a third party app? \nThe screenshot shows Bluetooth enabled, are you using a watch or a similar device? If so, can this paired device manage alarms on its own?", "time": "06-28-2016 05:40 AM", "replies": []}, {"postID": "post5242710", "text": "I was using sony smartwatch 2 before and now gear s2. But it was there before s2. I also deleted all the sony sw apps and clear the data.", "time": "06-28-2016 05:53 AM", "replies": []}, {"postID": "post5244711", "text": "Why not do a hard reset on the phone after you have backed up your data", "time": "06-29-2016 12:36 PM", "replies": []}]}, {"title": "Waterproof", "thread": [{"postID": "post5230319", "text": "Just came back from a pool party. Took a dive with my Z5P to the 12ft. Blew it out and let's see how it is in the morning\nPosted via the Android Central App", "time": "06-19-2016 01:06 AM", "replies": []}, {"postID": "post5232398", "text": "Hi\n??? The suspense is killing me :-D", "time": "06-20-2016 02:51 PM", "replies": []}, {"postID": "post5235571", "text": "Many of the Xperia™ smartphones are waterproof and protected against dust, so don’t worry if you get caught in the rain or want to wash off dirt under a tap, but remember: all ports and attached covers should be firmly closed. You should not: put the device completely underwater; or expose it to seawater, salt water, chlorinated water or liquids such as drinks. Abuse and improper use of device will invalidate warranty. The device has Ingress Protection rating IP65/68. For more info see Water and dust protection – all you need to know – Sony support (English). Note that some have a capless USB port to connect and charge. On these, the USB port needs to be completely dry before charging.", "time": "06-22-2016 02:58 PM", "replies": []}, {"postID": "post5236896", "text": "It's been almost a week and everything is fine. I know I broke the rules on how deep I went, but it's was quick. The ports were kind of sealed with my Ringke case. Blew it out asap and all is good.\nPosted via the Android Central App", "time": "06-23-2016 01:13 PM", "replies": []}, {"postID": "post5238438", "text": "Glad that everything is OK. Next time you should get a Samsung S7 if you want to go swimming", "time": "06-24-2016 02:58 PM", "replies": []}]}, {"title": "the international version doesn't have all bands in U.S.?", "thread": [{"postID": "post5026653", "text": "Mine showed me the LTE network signal is not good while my att note 5 and iPhone have full bats of signal...\nPosted via the Android Central App", "time": "03-01-2016 11:20 PM", "replies": []}, {"postID": "post5027977", "text": "What's the exact model number for the international Z5 Premium? Look up its LTE band compatibility on the web, and compare them to the ones that AT&T uses (2, 4, 12, 17).", "time": "03-02-2016 01:44 PM", "replies": []}, {"postID": "post5040874", "text": "Using mine on AT&T in the states, and I'm on Band 17 mostly. It never shows LTE, but 4G all the time. Never dropped a call, missed a text or have issues with data.\nTry LTE discovery app.", "time": "03-07-2016 06:40 PM", "replies": []}, {"postID": "post5043858", "text": "If I remember correctly, international models of gsm phones show 4G for LTE and HSPA+ for 4G\nPosted via the Android Central App", "time": "03-08-2016 06:38 PM", "replies": []}, {"postID": "post5046099", "text": "Mod Note, Cleaned up some posts. if you have nothing to add, please move on.", "time": "03-09-2016 01:12 PM", "replies": []}, {"postID": "post5046554", "text": "Same with signal strength. Sometimes on Band 2, I will get 3 bars. Usually just one or 2 bars on Band 17, but never a performance issue.", "time": "03-09-2016 03:44 PM", "replies": []}, {"postID": "post5215973", "text": "Can someone please suggest a model that works on T-mobile?\nPosted via the Android Central App", "time": "06-09-2016 12:25 AM", "replies": []}, {"postID": "post5229669", "text": "I use E6853 on T-Mobile. I run into the same thing the other user stated. Might show 2 bars, but performance doesn't seem to be affected. I also work on the border so I constantly switch back and forth between T-Mobile and Telcel. If you're in a bigger city then you will have no problems with this phone. In all honesty, I would probably go with Z5 and not the premium. I got it for the 4K, but it's a feature I never use. It's like going back to 2007 when I was loading movies onto my BB. That's what I hear you have to to do watch 4K movies. I used to be a power user, but now I'm more into it just being a communication device and a cast device at home.\nPosted via the Android Central App", "time": "06-18-2016 11:22 AM", "replies": []}]}, {"title": "My Sony Xperia Z5 premium fingerprint locked, what shall I do?", "thread": [{"postID": "post5182556", "text": "I have a new Sony xperia Z5 premium and the fingerprint was set by some one. I'm on a mission when I wanted to use, keep receiving a message \"fingerprint function locked\". what shall I do?", "time": "05-17-2016 06:08 PM", "replies": []}, {"postID": "post5183652", "text": "Go to settings app. Then click security. You can find the fingerprint function there", "time": "05-18-2016 11:16 AM", "replies": [{"postID": "post5228883", "text": "Dude the phone is locked how do you want to him to go to settings???", "time": "06-17-2016 05:24 PM", "replies": []}]}, {"postID": "post5228882", "text": "Fingerprint lock can't be set without a password... You can still unlock it with password", "time": "06-17-2016 05:23 PM", "replies": []}]}, {"title": "Sony just updated their software again", "thread": [{"postID": "post5226826", "text": "Seems quicker.\nXperia Z5 Premium: New software is available\n.\nThere is a software update (v. 32.2.A.0.224) available for your device. Update your device’ s software and enjoy new features, better performance, speed and bug fixes. You can update the software today using your computer or wait until it’ s available directly in your device (often within a couple of days). It's easy and no backup is needed.\nThis software includes:\nAll of the latest bug fixes and performance updates\nImproved battery life\nImproved camera functionality and stability\nImproved sound handling\nImproved handling of Bluetooth connected devices", "time": "06-16-2016 10:37 AM", "replies": []}]}, {"title": "XPeria Z5 Blue Screen System Error problem", "thread": [{"postID": "post5212827", "text": "I sold my Z5 Premium on Ebay after using FlashTool64 and restoring the system rom with Russia localization (RUS), I don't know if it was the exact localization or if this matters. Before it was rooted with a custom ROM/Kernel also not sure if that matters also. Anyways I used it as stock for a while and it seemed to work fine but once I system resetted it and shipped it off I get a message from the buyer that the phone is getting blue screens with the words system error after a minute booting. I read on some forums that the solution is to do a system repair via the Sony Software will this actually work? Any tips here thanks", "time": "06-07-2016 12:41 AM", "replies": []}, {"postID": "post5215386", "text": "You might want to go to xda-developer forums and look for a answer there. It is the premier technical forum", "time": "06-08-2016 03:14 PM", "replies": []}]}, {"title": "Sony Xperia Z5 premium earphone plug not working,please help", "thread": [{"postID": "post5177108", "text": "My phone not detecting earphone", "time": "05-14-2016 10:06 AM", "replies": []}, {"postID": "post5177985", "text": "Do other headphones work? Or do those headphones work in other devices?", "time": "05-15-2016 01:20 AM", "replies": []}, {"postID": "post5178118", "text": "Mine broke after 2 months and I had to send it back to Sony for repair...", "time": "05-15-2016 04:24 AM", "replies": []}]}, {"title": "Z5 premium or s7 edge? HELP!", "thread": [{"postID": "post5147262", "text": "Hi everybody.\nI'm about to buy a new smartphone but I'm still hesitating. I had an Xperia SL and I like Sony. I was going to choose the Z5 premium but some comments say the camera in the S7 edge is better. I saw some picture of the two phones and I have this impression too. Which one do you recommend me? In the Xperia SL, there were multicolour led notifications and each one has it's colour; facebook blue, SMS white, messenger green... I fear to not find this on the Samsung and the problem of the best camera. This is the only thing that prevents me from choosing.", "time": "04-26-2016 12:41 PM", "replies": [{"postID": "post5147964", "text": "S7 has always on screen (something like glance on Windows phone so you don't have to look for led you can see the notifications on screen..\nI am using z5 premium and I was using the 43 megapixel lumina 1020 and the camera is not bad on z5", "time": "04-26-2016 05:52 PM", "replies": []}]}, {"postID": "post5147749", "text": "Both cameras are great. S7 has better low light due to its lower pixel count but larger pixel size", "time": "04-26-2016 04:18 PM", "replies": []}, {"postID": "post5149505", "text": "100% S7. The premium has to many issues for me to recommend. I.e. The headphone socket that is broken on a massive amount of phones tge bluetooth stutter the screen also sparkles in direct sunlight and looks ridiculous. I've not used the S7 but it looks great.\nPosted via the Android Central App", "time": "04-27-2016 03:34 PM", "replies": []}, {"postID": "post5151027", "text": "I do not have Z5P yet, it's on its way to ship to me, however, I have feeling those pictures being used to compare to against S7, probably be auto mode setting pictures.\nI understand snap pictures you'd more likely use auto mode for a quick snap, but don't forget, Xperia will have wider range of manual setting for taking 1 good picture, unless that's something you don't really care for, then maybe def. s7 for you?", "time": "04-28-2016 01:59 PM", "replies": []}]}, {"title": "Finger print scanner", "thread": [{"postID": "post5119913", "text": "Hi does anyone have had issues with the finger print scanner? sometimes mine does not recognise and I end up with the too many attempts message.\nPosted via the Android Central App", "time": "04-12-2016 08:07 AM", "replies": []}, {"postID": "post5119935", "text": "This has to do with the marshmallow update. If you have a screenlocker app that force locks the screen then the fingerprint doesnt work. If you let it timeout as per your setting then fingerprint works. This has something to do with the revised security.", "time": "04-12-2016 08:18 AM", "replies": [{"postID": "post5136174", "text": "Perfect, this solves my issue. Hoping the lock screen app will find away to work with good lock. But for now, I'll use the power key lock\nPosted via the Android Central App", "time": "04-20-2016 05:39 AM", "replies": []}]}, {"postID": "post5120040", "text": "No its due to too cold ❄ finger tips...", "time": "04-12-2016 09:05 AM", "replies": []}, {"postID": "post5120550", "text": "Try relearning the finger. Mine is only a issue if my fingers are wet or dirty or I have been eating finger food like frys", "time": "04-12-2016 01:07 PM", "replies": []}, {"postID": "post5120719", "text": "Yeah after posting the thread I worked on it and I tried to find out why. It looks like when fingers are clean it works perfectly. But if touched with a dirty or wet finger tip it will not work and also you have to wipe the sensor to clean it up. I do not think there is an issue with the hardware or software here.\nPosted via the Android Central App", "time": "04-12-2016 02:18 PM", "replies": []}]}, {"title": "Will 4K Netflix work on a Z5 Premium?", "thread": [{"postID": "post4873228", "text": "Will 4K netflix work on a Z5 Premium?\nThanks", "time": "12-04-2015 08:48 AM", "replies": []}, {"postID": "post4877699", "text": "Well I read that almost everything is scaled for this phone - majority of apps run at standard (Full HD?) resolution, so I doubt it.\nI doubt Netflix would bother for one device...", "time": "12-07-2015 03:47 AM", "replies": []}, {"postID": "post4977611", "text": "Currently, Android does not support 4K. Its a bummer, but i hope to see apps upscaled in the future", "time": "02-02-2016 02:57 AM", "replies": [{"postID": "post4998210", "text": "Maybe the marshmallow release", "time": "02-15-2016 05:54 PM", "replies": [{"postID": "post4998966", "text": "Marshmallow still dont support 4k. I hope it won't soon. If android supports it, many OEM will make a jump to 4k screens even if the battery technology is not advance yet. The 4k screen will just make battery life worse.\nPosted with ❤Love❤", "time": "02-16-2016 09:02 AM", "replies": []}]}]}, {"postID": "post5136163", "text": "I no its an old post but if you subscribe to Netflix it should, I can watch netflix on my Z5 premium no bother.", "time": "04-20-2016 05:28 AM", "replies": []}]}]
[{"title": "Does the z5 dual fall under the premium spec?", "thread": [{"postID": "post5112103", "text": "I am buying a z5 dual sim to run my business line and personal line from. Is this phone under the premium device?", "time": "04-08-2016 04:53 AM", "replies": []}, {"postID": "post5112143", "text": "Premium as in \"flagship\" or the Z5 Premium with the 4K display?\nIf it's the former, then yes. The Z5 is considered a flagship device, though it's Sony's late-2015 flagship. If it's the latter, then no. The Z5 Dual has a 1080p IPS display.\nThe Premium variant would be called \"XPERIA Z5 Premium Dual\".", "time": "04-08-2016 05:38 AM", "replies": []}, {"postID": "post5112577", "text": "Ok, The one I am looking at is the 6683 variant. There is not much talk about the dual sim on this forum. Just wondering if anyone has one. I love the dark green color and features it has. I am jumping ship from windows phone to android, WP is SOOOOOOOO far behind and I cannot do what I need to do with one.\nI need to take payments from customer via square. Paypal has a version but its much more expensive, and does not work well in Canada, I want to have good home automation control, tied to one system with windows phone, many versions available with android, I want to use wearables, again, One working version (band) with windows, many many versions work with android. I want to use Sirius xm app and good off road mapping, NONE available on windows phone.", "time": "04-08-2016 10:13 AM", "replies": []}, {"postID": "post5112898", "text": "I am not sure you can run two operating systems. Dual Sims I thought means that two provider both Android", "time": "04-08-2016 12:52 PM", "replies": [{"postID": "post5112932", "text": "A phone with a dual-SIM slot means that you can run 2 separate lines on the same phone, regardless of operator.\nIt's very useful if you have a personal line and a business line but you don't want to lug an extra phone. Also very useful for travellers who rely on local SIM cards to avoid roaming charges.", "time": "04-08-2016 01:06 PM", "replies": []}]}, {"postID": "post5112934", "text": "OP, if you get either the Z5 Dual or the Z5 Premium Dual, both should meet your usage needs quite well.\nPretty much every wearable, your home automation stuff, SiriusXM and GPS should work plenty fine on the Z5.", "time": "04-08-2016 01:08 PM", "replies": []}, {"postID": "post5114213", "text": "Yeah, I know. that's refreshing. The z5 dual will be better for battery life than the higher spec'ed premium as well. I am excited to have some new tech stuff.", "time": "04-09-2016 07:04 AM", "replies": []}]}, {"title": "24 Hrs with the Z5 Prem.. Initial Impressions..", "thread": [{"postID": "post5104639", "text": "Hey all\nJust got my Z5 Prem Chrome yesterday (unlocked and Unbranded, but on O2 UK) and I wanted to give my first impressions...\nOn set up I logged onto Wifi and downloaded MM 6.0 (build 163) so I cant comment on 511.\nThe screen is Gorgeous, I have it set round about 50 - 60% and in daylight.. I can see it fine, Sunlight.. well every phone struggles in bright Sunlight.\nMusic Player has an awesome and quite cool UI, sounds Great through the Speakers but can distort if set too loud.. but I used to own an M8 then an M9.. so Im a little bit spoiled by them... The speaker audio lacks the bass and fullness of the M9, but to me the Z5s sound sweeter and more musical than the M9s, but I reckon the Z5 issue maybe the weterproofing membrane they put on the Z5 speakers.. but theyre still good and a joy to listen too.\nBut where true quality lies is in the Headphones.. and man.. Is the sound amazing in headphones... and this is where you know you have a Walkman.. Wow.. blew my mind and blows away any phone or Ive ever used including the 24-bit G4 and M9. Ive tried both a set of LG Quadbeat 3s and Sennheiser 400s.\nAnd now for the major question.. and thankfully.. Yes the Camera is good, in fact it can be truely awesome... coming from a G4,. I can see how the G4 over-sharpened and over-processed its images, but the Z5 has a fantastic colour reproduction and accurate white balance. Lack of OIS isnt a big issue Ive found.. the images arent over sharpened and do have a \"realness\" to them.. they arent as \"sharp and crispy\"\" as the G4 or S6 but this is a good thing and the camera can turn out some beautiful shots. \nOne thing I will say about \"Auto Mode\", part of the reason for the softness, especially when zooming in is that the camera tends to set the ISO very low... even as low as 40, probably in order to combat noise... but this has an opposite effect as well.. in that it softens the image right down, this is something to be aware of as some people like crispy images and can give the impression of the camera under performing. In order to combat this.. Use Manual mode and set your ISO manually.\nFor everyday use 8Mpx is great and strangely enough... theres not that big a jump between 8 and 20mpx,, but the difference is there. One thing i did find with the camera is it can over-expose alot of the time.. but using Manual Mode and dropping the EV down half a stop (0 - 0.5) or even a full stop (0 - -1) fixes this.\nAlso, unlike the standard Z5, the Prem model, at least mine anyway, doesnt suffer from the poor camera quality alot of forum threads have mentioned.\nIm still on my first battery charge after 24 hrs (Im a light to mod user), but as with all new phones.. the battery needs 1-2 full cycles to fully \"wake up\", but so far Im quite pleased with it.\nSo im very happy with my new Z5 premium, and its hard to pick out an exact fault, other than the extremely low ISO settings, but Its fast, its fluid.. no lag, but coming from a G4 or S6, the camera imaging is \"different\".. but in a good way, but not worse.. it doesnt have the harsh over-processing, Great Music player.. and contrary to some forum posts.. Ringtones and Notifications are plenty loud enough, even with Volume set at 80 - 90% and with \"Increased Ringtone\" toggle \"OFF\"\nWouldve also been nice to see SONY include a set of Noise Cancelling headphones in the Box as a Premium.. or Wireless QI charging as standard on the Premium model, but in truth I guess Ide rather have the bigger screen and unlike trhe vanilla Z5, the camera that works.\nHope this helps you make a desicion....\nHave Fun", "time": "04-04-2016 04:56 PM", "replies": []}]}, {"title": "Mobile Data Issue", "thread": [{"postID": "post5081007", "text": "I'm not sure if this is a common Android issue, or specific to my device/carrier.\nSince I've had this phone, mobile data is so spotty. When I'm on a call, no data, randomly and most of the time, no data. Is there a solution for this or something I'm missing?\nI came from BB10 which was constantly providing mobile data and I almost want to snap this phone in half because it feels like every time I want to do something that requires mobile data it doesn't work.\nANY suggestion would be appreciated. I just updated to 6.0 this morning and I almost want to say it's worse. It's almost as if when I don't have LTE I have no data. I haven't seen this sub-par behaviour for years.\nPosted via the Android Central App", "time": "03-23-2016 03:53 PM", "replies": []}, {"postID": "post5092404", "text": "I think people need more data to help you. What carrier. What model phone and your location would help", "time": "03-29-2016 09:40 AM", "replies": []}, {"postID": "post5099038", "text": "This ended up being a weird carrier issue that was resolved on the tech support end\nPosted via the Android Central App", "time": "04-01-2016 04:35 PM", "replies": []}, {"postID": "post5102103", "text": "Congrats", "time": "04-03-2016 01:20 PM", "replies": []}]}, {"title": "Rumors are we get marshmallow in two weeks", "thread": [{"postID": "post5021222", "text": "Let's hope the postings are true", "time": "02-28-2016 01:38 PM", "replies": []}, {"postID": "post5021291", "text": "Definetly, I'm ready!", "time": "02-28-2016 02:36 PM", "replies": []}, {"postID": "post5026553", "text": "I just got my notification for the OS update...\nDownloading now hope it's MM 6.0....", "time": "03-01-2016 10:04 PM", "replies": []}, {"postID": "post5026944", "text": "Did you get marshmellow?", "time": "03-02-2016 04:54 AM", "replies": []}, {"postID": "post5033167", "text": "Sony Xperia Z5 series get Android Marshmallow in Japan - GSMArena.com news", "time": "03-04-2016 05:26 PM", "replies": []}, {"postID": "post5038857", "text": "Anyone in the UK got the update yet? Twitter said March 7th.\nPosted via the Android Central App", "time": "03-07-2016 07:25 AM", "replies": []}, {"postID": "post5039427", "text": "The 7th started yesterday in Japan. No update on my phone which came from HK", "time": "03-07-2016 10:19 AM", "replies": []}, {"postID": "post5040040", "text": "Marshmallow update is rolling out to global Sony Xperia Z5 devices | Android Central\nOn its way", "time": "03-07-2016 01:41 PM", "replies": []}, {"postID": "post5046815", "text": "So far nothing OTA in New England still, and I even tried Sony Bridge on Mac, with no luck. \nAnyone in the states able to get it?", "time": "03-09-2016 05:32 PM", "replies": []}, {"postID": "post5049539", "text": "Still no update in UK on unbranded. Crazy really some carrier branded phones in the UK have it already such as Vodafone and O2.\nPosted via the Android Central App", "time": "03-10-2016 03:00 PM", "replies": []}, {"postID": "post5049588", "text": "Mine has come through this evening.. 02 UK", "time": "03-10-2016 03:19 PM", "replies": []}, {"postID": "post5051201", "text": "Nothing yet in UAE", "time": "03-11-2016 05:16 AM", "replies": []}, {"postID": "post5052358", "text": "Just got it in Canada.. International version\nPosted via the Android Central App", "time": "03-11-2016 01:22 PM", "replies": []}, {"postID": "post5052992", "text": "Downloading now in New England!", "time": "03-11-2016 06:11 PM", "replies": []}, {"postID": "post5053991", "text": "Got it in UAE yesterday", "time": "03-12-2016 07:00 AM", "replies": []}, {"postID": "post5056234", "text": "Still not arrived.\nPosted via the Android Central App", "time": "03-13-2016 07:47 AM", "replies": []}, {"postID": "post5056245", "text": "Try using your pc for the update. Mine would not do OTA, but when it was released for my model, on my Mac with Sony Bridge it was immediately available.", "time": "03-13-2016 07:51 AM", "replies": []}, {"postID": "post5056371", "text": "Tried on both Mac and pc. Still not there.\nPosted via the Android Central App", "time": "03-13-2016 09:21 AM", "replies": []}, {"postID": "post5056527", "text": "It must not be released for your model- which is identified not by actual model number, but by a number associated with your model number which is found by entering through the dialer. That's how they roll out the updates, by that number. \nIt's spelled out quite well on xda if you want to go that far.", "time": "03-13-2016 10:40 AM", "replies": []}, {"postID": "post5057025", "text": "Anyone getting double folders in the photo app? I like organizing my pics in folders and all are saved on the sd card, but ever since the update, some of my folders are being duplicated? \nThe weird thing is, it's only thru the photo viewer app. When I view it from pc or any other app, all is good.\nPosted via the Android Central App", "time": "03-13-2016 01:51 PM", "replies": []}, {"postID": "post5061338", "text": "Still waiting....\nPosted via the Android Central App", "time": "03-15-2016 02:23 AM", "replies": []}, {"postID": "post5061352", "text": "Yep....Just noticed it....annoying", "time": "03-15-2016 02:39 AM", "replies": []}, {"postID": "post5069153", "text": "Still patiently waiting, in Canada on Bell...\nPosted via the Android Central App", "time": "03-18-2016 07:15 AM", "replies": []}, {"postID": "post5069356", "text": "Reggie's Avatar\nReggie said:\nYesterday 07:37 PM\nToday I got the notice that marshmallow was available. I put it off till I was home. Phone feels quicker. Not sure what other features are new", "time": "03-18-2016 09:16 AM", "replies": []}, {"postID": "post5074068", "text": "Yeah I've had it a few days and think its a great update far better than lollipop\nPosted via the Android Central App", "time": "03-20-2016 03:27 PM", "replies": []}, {"postID": "post5079448", "text": "Yay it finally arrived!\nPosted via the Android Central App", "time": "03-23-2016 05:16 AM", "replies": [{"postID": "post5099749", "text": "My Z5P is awesome with 6.0.\nPosted via the Android Central App", "time": "04-02-2016 03:05 AM", "replies": []}]}]}, {"title": "Z5 Premium Very Quick Review after 1 week", "thread": [{"postID": "post4847135", "text": "Had it for a week, previously LG G2 (awesome phone).\n- Took me a while to get use to size but now its fine.\n- Fingerprint on power button awesome idea, plus fact you can register 5 prints because I pick up the phone in different ways.\n- Double tap to wake - thanks goodness as I loved this on the G2.\n- Screen - amazing of course.\n- Battery - Get 1 day with normal use as I did with my G2, so, 2 days really is bit a marketing stretch. Looking for ways to optimise this so if anyone has tips/tricks please share.\n- Went for pure black.", "time": "11-21-2015 04:56 AM", "replies": [{"postID": "post4900268", "text": "If you had it to do over would you still get the pure black or another color? I am about to purchase one this week but I am stuck between all three colors, I like black but that is so standard , the chrome looks really good but man that mirror look with finger prints seems like it will look a mess all of the time, and gold looks good as well just wondering if it is as shiny as the chrome hell I can't decide looking for advice as I could potentially go with any of the three.", "time": "12-17-2015 12:43 PM", "replies": []}]}, {"postID": "post4847983", "text": "I noticed you mentioned it took getting use to as far as size. Would you prefer larger? I really am trying to get use to it also, as I came from a z ultra 6.4 inch... Wasn't the lgg2 5.5?", "time": "11-21-2015 01:58 PM", "replies": []}, {"postID": "post4848390", "text": "I agree getting used to the f.print scanner was a learning curve. I was pressing the button and keeping it pressed in which was resulting in a number of failed attempts. I now press, release but rest finger on and it works nearly all the time.\nI find the speaker really low but i was coming from a HTC and so thats to be expected.\nI too agree with the battery life only really being a full day....maybe a 36 hours tops.", "time": "11-21-2015 05:05 PM", "replies": []}, {"postID": "post4849005", "text": "Coming from an HTC M8 & M9 as well, I too am finding the speakers quiet on the Z5P. \nThe size wasn't so bad (I was using a bb passport on the side) so I guess that prepared me for the size. \nI get about 1.5 days. Not a power user, but a couple of videos, a lot of web browsing, messaging constantly, is what my typical day looks like. \nI'm really liking the phone... My only gripe is I wish the premium came in matte.\nPosted via the Android Central App", "time": "11-22-2015 01:01 AM", "replies": []}, {"postID": "post4903443", "text": "Chrome for certain. Whilst it does attract fingerprints it looks amazing polished.\nPosted via the Android Central App", "time": "12-19-2015 06:53 AM", "replies": []}, {"postID": "post5027716", "text": "I am going for a black one later this week as well and coming from the s6 edge plus I was called crazy from some of my friends but I am a Sony fan and I think its the sexiest device out there.\nPosted via the Android Central App", "time": "03-02-2016 11:58 AM", "replies": []}, {"postID": "post5028098", "text": "I went with gold since it's a color I have never had. Not liking it as much as I thought. Would go with black if I was doing it over - even with the fingerprint issue", "time": "03-02-2016 02:39 PM", "replies": []}, {"postID": "post5029395", "text": "What about the fingerprint issue? Is it only the Gold xperia?\nPosted via the Android Central App", "time": "03-03-2016 06:05 AM", "replies": [{"postID": "post5030326", "text": "I was referring to other posts. I have not had any fingerprint issues", "time": "03-03-2016 01:12 PM", "replies": [{"postID": "post5064720", "text": "Reggie how is the battery life now after owning it for a while? Is it still holding up?", "time": "03-16-2016 10:07 AM", "replies": []}]}]}, {"postID": "post5065389", "text": "It has been great. Much much better than my Note 4 Edge. I read emails in the morning and surf the Web with chrome and my charge lasts all day. Even if I play some games.", "time": "03-16-2016 02:13 PM", "replies": []}, {"postID": "post5068629", "text": "Today I got the notice that marshmallow was available. I put it off till I was home. Phone feels quicker. Not sure what other features are new", "time": "03-17-2016 09:37 PM", "replies": []}]}, {"title": "How do I hide top status bar in Xperia Z5 Premium?", "thread": [{"postID": "post4847126", "text": "Basically when I go into an app I want the status bar to hide, I could do this on my LG G2. How can I do it on the Z5 please? Thanks", "time": "11-21-2015 04:48 AM", "replies": []}, {"postID": "post4847966", "text": "Unfortunately I don't believe is available from stock settings without root. Try nova launcher. I've been doing it with dolphin browser while surfing.", "time": "11-21-2015 01:52 PM", "replies": []}, {"postID": "post4851236", "text": "Doesnt look possible with Nova either. Guess root or hope marshmellow has this in.", "time": "11-23-2015 05:17 AM", "replies": []}, {"postID": "post4851323", "text": "Yeah, with Nova or other launchers you can hide the status bar just in your home screens. Some apps, not many, let you enable the immersive/full screen mode. News apps, feeds readers, video player, some games, etc are some examples. Search in your apps settings for this feature.", "time": "11-23-2015 06:54 AM", "replies": []}, {"postID": "post4984370", "text": "This is dependant on the app developer. \nFor example, in the guardian newspaper app, the status bar dissappears when scrolling. \nDo you mean stock apps? \nYou could use the display settings to hide all status bar icons if you want a 'clean' screen.\nPosted via the Android Central App", "time": "02-05-2016 04:21 PM", "replies": []}, {"postID": "post5046826", "text": "If your good with ADB commands, there is a thread on xda showing how to do it without root. I did it. Screen is much nicer in immersive mode, but you have to swipe up or down to get the buttons or status bar back.http://forum.xda-developers.com/z5-p...-mode-t3283439", "time": "03-09-2016 05:36 PM", "replies": []}]}, {"title": "new owner", "thread": [{"postID": "post4844946", "text": "Just got my premium coming from an lg g3. Wow the screen is amazing so vibrant and the phone is blisteringly fast. Battery life no way is it 2 days I'm down to 66%after 2 hours screen time. \nPositives - screen, speed of the phone, it remains cool no lag at all. Music player is so much better then the LG one. Look at feel of the phone -chrome!\nNegs - battery life looking at about 6hrs sot\nPosted via the Android Central App", "time": "11-20-2015 07:56 AM", "replies": [{"postID": "post4845319", "text": "Who did you buy your device from?", "time": "11-20-2015 10:24 AM", "replies": []}, {"postID": "post4857581", "text": "Battery drain is bad but it's been one day for me so I will give a week of use and charging..", "time": "11-25-2015 08:54 PM", "replies": []}, {"postID": "post4980388", "text": "I'll be happy if I get close to 5 hours of sot, 6 would be fantastic.\nPosted via the Android Central App", "time": "02-03-2016 01:00 PM", "replies": []}]}, {"postID": "post4845748", "text": "Mobiles.Co.UK\nPosted via the Android Central App", "time": "11-20-2015 01:14 PM", "replies": []}, {"postID": "post4847045", "text": "What network you on??? Carrier please\nPosted via the Android Central App", "time": "11-21-2015 02:27 AM", "replies": []}, {"postID": "post4847139", "text": "Totally agree on battery life get a day like I did with my G2. Perhaps Marshmallow will help (?). I am on Vodafone UK.", "time": "11-21-2015 05:00 AM", "replies": []}, {"postID": "post4847156", "text": "Phone is not locked to any network I'm currently on Vodafone but have an o2 sim also.\nPosted via the Android Central App", "time": "11-21-2015 05:31 AM", "replies": []}, {"postID": "post4848007", "text": "Yea this battery really is disappointing as it's one of the primary reasons I purchased it. My phone is warm as Hell all the time unless the screen is off! Put it never under performs it's super powerful but def. Gets pretty hottt!", "time": "11-21-2015 02:14 PM", "replies": []}, {"postID": "post4849017", "text": "What are your settings like? \nI get at least 1.5 days out of mine. 1-2 videos, web surfing, messaging constantly (bbm, whatsapp, texts) and maybe 1-2 15min phone calls is what my day typically looks like.\nReally liking the phone, my only gripe... Wishing it came in matte\nPosted via the Android Central App", "time": "11-22-2015 01:07 AM", "replies": []}, {"postID": "post4850054", "text": "Matte nooooo shiny is good.\nPosted via the Android Central App", "time": "11-22-2015 02:01 PM", "replies": []}, {"postID": "post4850130", "text": "As long as you are comfortable with it sliding about then its fine. But if not...get a case", "time": "11-22-2015 02:50 PM", "replies": []}, {"postID": "post4850141", "text": "I usually keep my phones naked but does anyone recommend a particular case\nPosted via the Android Central App", "time": "11-22-2015 02:58 PM", "replies": []}, {"postID": "post4850810", "text": "Too pretty to put a case on it on my opinion.... I have the chrome one.. \nAnyway, abit off topic but do anyone noticed that under sunlight or very bright light, u can practically see the individual display components.... Pentile matrix thingy? or whatever it's called.... \nNot sure how to describe this, but it's as though the screen is glittering under direct sunlight", "time": "11-22-2015 09:57 PM", "replies": []}, {"postID": "post4851080", "text": "I didn't want an all singing and dancing case so got a clear case from ebay. I had to be careful because with a case on, its right on the limit of what my in car holder will take. \nYeah I have noticed the same thing with the screen....", "time": "11-23-2015 01:46 AM", "replies": []}, {"postID": "post4851382", "text": "Yes at first I thought the phone was faulty but it seems to have disappeared or I've not noticed it again.\nPosted via the Android Central App", "time": "11-23-2015 07:44 AM", "replies": []}, {"postID": "post4971020", "text": "I think I've had mine for about a week and a half [bad bad memory] and I've done a software repair using PC companion, discharged and recharged it like a rubber band [like all the way], and there has been some improvement in performance, but I still just about maybe get a day if I'm lucky. I've kind of got used to it now co's Qualcomm Quick Charge 2.0 is so damned quick it's unreal, even from a battery pack you can basically get the battery back up to a decent level on a drive to the petrol station :-)", "time": "01-28-2016 05:41 PM", "replies": []}, {"postID": "post4977601", "text": "Bought mine from amazon, and the battery life seems to be absolutely fine, providing youre not playing games all day", "time": "02-02-2016 02:51 AM", "replies": [{"postID": "post4986578", "text": "I just ordered mine from Amazon too. Gold color - first phone that wasn't black. I am on AT&T and currently using a Note 4 edge. I was going to wait and see the new S7+ but just fell in love with this phone after seeing the pictures of Samsung phone leak out. No date on shipping yet but Friday when I ordered they had 10 in Stock and today only 5", "time": "02-07-2016 10:47 AM", "replies": []}]}, {"postID": "post4995166", "text": "If it is from \"voltage converter store\" on Amazon, I got my chrome one in 4 days. Almost as good as Prime. However- the box was not sealed and the phone was in Chinese, with no setup sequence. Turned it on right to the home screen. Reset it and set it up properly. Working fine. Not sure why it was open box and I have an email into them. \nUsing a clear tpu case after dropping it on day 2 with a devilcase on. Phone survived just fine. The tpu makes it so I can hold the damn thing without feeling like I will drop it. Also have tempered glass front and back.", "time": "02-13-2016 09:01 AM", "replies": [{"postID": "post4995231", "text": "Yes I got mine from the same place. I had to Google how to select English and there was a great video that showed how do so. Yes the box was opened. I suspect it was to put a USA charger in the box vs the one that would be there for Asia.", "time": "02-13-2016 09:56 AM", "replies": []}]}, {"postID": "post4995308", "text": "Good point- I actually had an adapter taped to the box. It goes in a US outlet, but it looks to be an adapter to Euro style plug. I would think it would be a USA to Euro style being that they included the fast charger, which is almost as good as the turbo charger on my moto x pure. Glad to hear Im not the only one with the \"open box\" conspiracy. Lots of Chinese/Japanese(cant tell, not knowing the language) apps on the phone as well, same for you?", "time": "02-13-2016 11:01 AM", "replies": [{"postID": "post4998091", "text": "Yes lots of Chinese apps. The charger in the Sony box had a correct us plug but strangely the part number on it when Googled has a different plug configuration when one looks at the pictures. I also had an adapter outside of the Sony box that was for international to US plug.\nLoving the phone. Had to learn some things (like how to create folders for apps) as some things are different than my old Note 4 Edge", "time": "02-15-2016 04:12 PM", "replies": []}]}]}, {"title": "carry on network of Sprint?", "thread": [{"postID": "post4667273", "text": "Any news about available to carry this device to sprint market? I did search on google, not found it yet and it seem too early to announcements. And also i posted facebook to ask a question to see if they reply it. And lastly what about you guy? Anyone\nPosted via the Android Central App", "time": "09-06-2015 09:50 PM", "replies": [{"postID": "post4986595", "text": "Sprint is CDMA not gsm so I doubt it will work. Though lte should work if the radio bands for Sprint LTE match those of the phone. But LTE is not all over in all of the different networks", "time": "02-07-2016 11:00 AM", "replies": []}]}]}, {"title": "Image viewer/Slideshow app for 4K stills?", "thread": [{"postID": "post4978000", "text": "I’m a 3D photographer who has purchased a Z5 Premium to view my image pairs in a Cyclopital ViewVaster viewer. I read a number of reviews on-line which mocked the Z-5’s 4K screen as being “overkill” or “making no visible difference”, but when viewing stereoscopic pairs under magnification the Z-5 Premium screen looks amazing and is worth every penny. \nThe “Album” app Sony includes to view stills is not well designed for what I want to do. The worst thing about it is that in slideshow mode it does a lame “Ken Burns” pan-and-zoom when changing images that ruins the 3D viewing experience. Album sllideshows also don’t seem to display images in full res. When viewing images individually it takes the Z5 about two seconds to go from a low-res preview to the full resolution. \nDoes anyone know of a image viewing or slide show app that is designed for viewing 4K stills? I tried QuickPic which has a nice slideshow presentation, however I haven’t been able to get it to display images at higher than HD resolution.", "time": "02-02-2016 09:32 AM", "replies": []}]}, {"title": "screen on time?", "thread": [{"postID": "post4970838", "text": "Just wondering what people are averaging on this thing with mixed daily usage.\nPosted via the Android Central App", "time": "01-28-2016 03:01 PM", "replies": []}, {"postID": "post4971379", "text": "I average around 5 hours\nPosted via the Android Central App", "time": "01-28-2016 11:24 PM", "replies": []}, {"postID": "post4976212", "text": "4h 45m to 5h 36m", "time": "02-01-2016 07:26 AM", "replies": []}, {"postID": "post4977599", "text": "5-7 hours generally", "time": "02-02-2016 02:49 AM", "replies": []}]}, {"title": "New Z5 Premium loosing power fast!", "thread": [{"postID": "post4955576", "text": "Hi all,\nI won this fantastic Z5 Premium off Sony for a photogh I submitted to their poetry in moments competition, and so far love the phone. I've only really got one issue. The battery life! Before they sent it to me I did some research and found out it had Qualcomm quick charge 2.0, so bought an Aukey charger. When I first got the phone the power widget was showing around 2.5 days battery. Now after 3 to 4 days use its showing 22 hours after a full charge [from around 30% to 90-94%]. I've got 4 screens with mostly widgets and folders of icons. I've also got tasker running, but I can't see how that could be draining the battery as it's only got three really simple active profiles with no tasks or scenes. Also checking the battery usage it doesn't even show up on the stats, with the screen using 40% of battery. I've also got Greenify installed and set up. Anyone have any suggestions please [which don't involve selling the handset and buying an S6 Edge]?\nI've added a photo of my rabbit Ghibli just for fun and co's I love him...", "time": "01-18-2016 05:49 PM", "replies": []}, {"postID": "post4955589", "text": "My Z5 premium battery drain was bad for first week but it's very stable now do not drain like mad anymore... Most likely the battery needs to be recharged for several times to get to full power (my guess only).", "time": "01-18-2016 06:04 PM", "replies": []}, {"postID": "post4956036", "text": "Thanks for answering! Can I ask if you use a Qualcomm fast charge 2.0 charger and does it cause any problems?", "time": "01-19-2016 01:42 AM", "replies": [{"postID": "post4956253", "text": "I can't answer that but I did used my 2.5a charger on my z5", "time": "01-19-2016 07:00 AM", "replies": []}]}, {"postID": "post4956412", "text": "Ok, just let the handset go down to 19%, charged it with charger that came with the phone to 95% and it's now showing 1 day and 1 hour. Is this because I used the charger that came with the phone [The standard Z5 Premium charger is non Qualcomm Quick Charge 2.0 compatible].", "time": "01-19-2016 09:01 AM", "replies": []}, {"postID": "post4957344", "text": "I tried charging it with the official charger [UCH-20] and it took around the same time to charge as it usually does with the Aukey Qualcom Quick Charge 2.0 charger. I've deleted a load of widgets, and a couple of pages and I'm going to see if that makes a difference.", "time": "01-19-2016 06:04 PM", "replies": []}, {"postID": "post4962701", "text": "For anyone interested in this topic, I contacted Sony support last night who told me to do a software repair using the PC companion app. Since then [touch wood, fingers crossed] I've noticed some improvement in the battery performance and in the performance of the device as a whole. For one thing the screen is no longer using up 45% of the power, and is now closer to 19% which is less than half.of what it was. The downside to this is that it will wipe out all your data and settings, the upside is that you can save everything to the SD card and it does an incredible job of restoring everything, right down to the desktop layout. I'll post the procedure here latter on because I've got to got a shot I need to be at in a few moments, but please don't try this before I do as the instructions on the PC companion app are incorrect and could apparently mess up your phone. I know, brilliant design, right! Anyway back soon.", "time": "01-23-2016 02:22 AM", "replies": []}, {"postID": "post4972699", "text": "Ok, not sure how long I've had this handset now, bur the good news is that things are starting to settle down! Another thing I did that's seemed to make a difference is to clear the cache. I'm now getting through a day [in general] without having to recharge until the evening, and I've even reinstalled tasker. \nGood luck 🍀", "time": "01-29-2016 07:47 PM", "replies": []}]}, {"title": "Fingerprint Scanner - Any issues?", "thread": [{"postID": "post4860472", "text": "I have come across this video about the guy from pocketnow having issues with the scanner not working correctly for him. I haven't had any major issues with it after setting it up properly but what about you guys?", "time": "11-27-2015 03:40 PM", "replies": []}, {"postID": "post4860520", "text": "I have 3 different fingers registered and one of them is my 7 year old son and all the three are working fine on my z5 premium... May be it's a faulty device for the guy on the video or maybe it's a user issue...", "time": "11-27-2015 04:18 PM", "replies": []}, {"postID": "post4880357", "text": "factory rejects", "time": "12-08-2015 12:19 PM", "replies": []}, {"postID": "post4912925", "text": "No issues here.", "time": "12-24-2015 03:54 AM", "replies": []}, {"postID": "post4938986", "text": "No issues..,set up two fingers on one hand...will set up a few on the other hand", "time": "01-08-2016 12:41 PM", "replies": []}, {"postID": "post4956038", "text": "Zero issues, works so much better than my S5 did. It's like night and day...", "time": "01-19-2016 01:45 AM", "replies": []}]}, {"title": "Really two day battery life?", "thread": [{"postID": "post4787266", "text": "Wow sony is really innovating they are able to get 2 days of battery in one charge on a 4k screen with a powerful phone. \nIm sure this is not bs right? Xperia™ Z5 Premium – 4K smartphone - Sony Xperia (Global UK English)", "time": "10-29-2015 06:01 PM", "replies": []}, {"postID": "post4787344", "text": "3430 mAh battery, 5.5\" 4K IPS screen, SD810 ... this is NOT going to last \"power users\" for 2 days. So they're saying something to the effect of users getting between 5 and 10 hours of usage in a 40 to 48 hour period. The \"power users\", depending on all the typical conditions, should probably expect 5 to 9 hours of SOT in a typical high usage day. Here is their statement on battery: ****Battery life has been measured against Sony Mobile Communications AB’s smartphone usage profile, defined in September 2014 to represent the typical smartphone user’s active condition, including but not limited to a range of usage scenarios (calling, texting, web browsing, social networking, game playing, music listening, picture taking, picture browsing, online video watching, video recording and playback).Now, the September 2014 AVERAGE user... here's what they say about that: Typical Smartphone User usage profile. This involved using the device for approximately 5 hours in a 24-hour period, for a range of typical usage scenarios (calling, texting, web, social networking, games, camera, music and video).For context, the Moto X 2013 with a 4.7\" 720p AMOLED screen and SD600/2 lasted the average user between 20 and 24 hours and average SOT was between 3 and 4 hours. OF COURSE I am speculating, I don't have this device and haven't seen any serious reviews - this is based on analyzing their statements, what we know of the specs and what we know about how batteries actually function under load. The biggest two drivers of batteries suffering are typically poor idle (Apple has this fairly well under control) and the screen's power draw. If Sony has these two things under control (I assume they're most of the way there if they're making these claims) - then we can expect VERY solid battery life. But let's also be reasonable about what to expect. I'd hate to see people expect to get 10+ hours of SOT over a 24-48 hour period and then rage against the device because it's not there yet.", "time": "10-29-2015 06:36 PM", "replies": [{"postID": "post4787352", "text": "I just have a really hard time believing a 4K screen will have good on screen time. The jump from 720p to 1080p cut battery life in half and jump to 1440p made it even worse getting 3-4 hours SOT now with most modern larger phones. With 4K i expect 2 hours SOT.", "time": "10-29-2015 06:39 PM", "replies": []}]}, {"postID": "post4787719", "text": "There is some info out there stating that it will not be running 4K resolution all the time. Only during certain functions, such as 4K video.\nPosted via the Android Central App", "time": "10-29-2015 09:34 PM", "replies": []}, {"postID": "post4801790", "text": "I doubt you can get decent battery life with a 4k resolution phone. It would be really battery hungry to power up 4k", "time": "11-04-2015 04:12 AM", "replies": []}, {"postID": "post4835433", "text": "I have just gotten my unit and once all my music has downloaded tonight, I will be testing the battery out so I will report back in a few days", "time": "11-16-2015 11:35 AM", "replies": [{"postID": "post4835977", "text": "What color did you get? What are your first impressions? Tell us everything!\nPosted via the Android Central App", "time": "11-16-2015 02:47 PM", "replies": []}]}, {"postID": "post4841088", "text": "Hi,\nSorry for the delay. SO it took an age to get my music downloaded from Google Play to my memory card. All because the phone doesn't use as much data as fast when the screen is off as when its on....soo it took nearly 48 hours! i\nSo I got my unit in black and while yes it is a real fingerprint magnet, I don't really care. I don't have a case for it at the moment but I think that I will get one because one drop and both glass panels are gonna smash. \nI'm coming from the G4 and so the first noticeable thing is the weight difference....\nThe screen is nice and bright for me. I don't have it cranked right up - there is really no need. I don't know yet how the screen is gonna affect battery life. I will know over the next week or so. \nThe software is clean and I like that. I was a HTC user before getting the G4 and i really liked sense but having now used different systems, I can honestly say, I don't need all the bells. I had gotten used to some of the smart settings that the G4 had and I thought I would have to get tasker to have the same things but Sony has smart settings too so Waze will start up as soon as the car bluetooth starts up. (Love it)\nI haven't had time to use the camera at the moment but i will (part of my job) in the next couple of days so I will let you know more in depth when I do. But coming from the great camera of G4, the shots on this seem alright. \nBattery will be tested over the will be tested too as of tomorrow. I wouldn't say that I'm a power user but I am a heavy user with my email syncing every 5 mins along with phone calls, podcasts, music and the like. I have all my photos going up to dropbox. My G4 was very bad with battery life and I had the brightness down as low as possible so I hope that the Z5 gets through a day. \nAfter a week, I will do a new post with my thoughts", "time": "11-18-2015 02:39 PM", "replies": [{"postID": "post4900274", "text": "Any updates on the camera yet?", "time": "12-17-2015 12:47 PM", "replies": []}]}, {"postID": "post4901433", "text": "Soo completely forgot to update regarding my time with the phone so far. \nRight so its been a month now and I have had more than enough time to get used to the phone. \nFirst things first. So I had an issue with the phone and my wifi router in that after the epic amount of time it took to download all the music, it then suddenly stopped connecting to the router and when it did connect, it would then kill my wifi connection so I had to stop using it and only use mobile data. There was an update 4 days ago and it seems to have fixed this issue (whatever it was). \nThe battery life on this phone is great. Yes the screen is going to be the biggest drain on the battery because of the size but I am getting through a day with no issues and during the weekend I can get to nearly 2 days. Depending on your usage, 36 hours should not be out of reach for any user. Coming from an G4 in which I was worried to use the phone because the battery would drain so quickly with any kind of usage, the Z5 is a real pleasure to use. \nI find the Sony OS really clean and simple to use which is nice. I liked a few things from the G4 such as the smart settings and its nice to see that Sony have the same sort of thing. I have found that the camera app does take a second or two to open which can be a little bit annoying if you want a quick picture but other than that I have had no slow down at all. \nThe camera is the biggest thing on any phone that I have because I take pictures for work. Having the G4 coming from a M8 was a massive jump and while i knew suspected it wouldn't be as good as the G4, the Z5 is good and I have no real complaints. Daytime shots are good with no worries at all. Night time shots suffer from noise which will annoy some but its not a massive deal breaker for me. \nSo example shots, I'm happy with it. \nOther things - Speaker isn't the loudest.\nBluetooth works well with my car and my portable speaker. \nI have it in a case so its not a fingerprint magnet. \nThe phone hasn't overheated (did get warm on initial set up and downloading of apps etc but that's expected)", "time": "12-18-2015 03:26 AM", "replies": []}, {"postID": "post4902783", "text": "Thanks for the update, I ordered the chrome version and it has shipped should have it on tuesday can't wait.", "time": "12-18-2015 05:51 PM", "replies": []}, {"postID": "post4939007", "text": "When are we going to hear about your chrome Z5P @nokia4life?", "time": "01-08-2016 12:50 PM", "replies": [{"postID": "post4939040", "text": "Well I got and liked it some what, the design great chrome great the camera was good not great. My major issue was the reception and I posted this in other threads on android central and XDA it seemed to have full bars in my house however when I would go outside I would have 1 bar and when traveling it would take for ever to connect a call or use data. I know it isn't the att sim because it's the same one in my iPhone 6plus, nexus 6p and note 5 all which have superb reception cellular and wifi but this phone could not hold it. Second Bluetooth when connected to my CLA-45 would be spotty music would sound like a scratched cd skipping constantly again the other three phones connected rarely had this issue. The icing on the cake as of two days ago I got a pop up saying 95% memory used mind you I have not added pretty much anything so why did this happen well I gave up. I sold it on swappa yesterday for 590.00 took a loss of 80.00 bucks but oh well I couldn't live with that when these other phones especially the note 5 with 32gb memory same as the z5 never came close to 95% memory used same apps. Couldn't compare the iPhone and nexus because both if this have 128gb. So sad to see it go will wait for Sony next great thing.", "time": "01-08-2016 12:59 PM", "replies": []}]}, {"postID": "post4955547", "text": "Ok, I'm using a Aukey Qualcom fast charge 2.0 charger with a Z5 Premium, and I'm getting just about a day if I'm lucky. I'm running tasker, but I can't see how that L would drain the battery, particularly given that there's only 3 realy basic active profiles. I charges this thing to 93% less than am hour ago, and it's already down to 82%! Any ideas or suggestions. I've got screens which are mainly widgets, and on the time it's taken to write this it's bow gone down.to 79%", "time": "01-18-2016 05:24 PM", "replies": []}, {"postID": "post4955551", "text": "P.S It's the chrome version ;-) and yes, it does look uber cool 😎", "time": "01-18-2016 05:27 PM", "replies": []}]}, {"title": "Bad Radios", "thread": [{"postID": "post4910703", "text": "What is up with this phone the radio signals go from full bars to zero does this with WiFi as well.", "time": "12-23-2015 02:21 AM", "replies": []}, {"postID": "post4910897", "text": "I don't have issues with the GSM radio but my WiFi can't connect to my home router where my Samsung GS4 could..", "time": "12-23-2015 05:28 AM", "replies": []}, {"postID": "post4911169", "text": "Mine had the issue with the wifi but the update the other week seems to have fixed the problem and now its working perfectly fine. See if that works for you.", "time": "12-23-2015 08:55 AM", "replies": []}, {"postID": "post4912355", "text": "I just did an OS update and hope it will fix the issue..", "time": "12-23-2015 07:09 PM", "replies": []}, {"postID": "post4913996", "text": "I think it will do. I have had no issues at all with any WIFI points since the update.", "time": "12-24-2015 06:03 PM", "replies": []}, {"postID": "post4938979", "text": "Had this for about 3 weeks and I have not noticed any issues with radios...connects fine all round", "time": "01-08-2016 12:38 PM", "replies": []}]}, {"title": "Xperia Z5 Premium on T-Mobile, how can I get the data working on it?", "thread": [{"postID": "post4841924", "text": "Hey quick question. Is there anyone who can help me with this issue? I have an Xperia Z5 Premium and I cant get it to work with T-Mobile LTE. I inserted my sim card, followed the procedure, restarted my phone etc. but it still doesnt show any data signal at all. Is there an additional process you have to go through. I went to the APN settings and updated it but all i get now is edge (2g) I had the Z3 before and was getting around 35-100 Mbps in my area. now i cant even load a web page. Can you (or anyone reading this) help me out. I sold my z3 just hours before my z5 came, which was a mistake since now i really cant do anything with my phone (besides use it on WiFi and call). Any help will be appreciated. Thanks in advance. \nbtw my phone model is Sony Xperia Z5 Premium E6853", "time": "11-18-2015 10:17 PM", "replies": []}, {"postID": "post4855783", "text": "So from what I am understanding, you are only able to make calls on the regular network and use wifi with no data?\nHere are the correct APN settings:\nName: T-Mobile US LTE\nAPN: fast(dot)t-mobile(dot)com\nProxy: <Not set>\nPort: <Not set>\nUsername: <Not set>\nPassword: <Not set>\nServer: <Not set>\nMMSC: \nMMS proxy: <Not set>\nMMS port: <Not set>\nMMS protocol: WAP 2.0\nMCC: 310\nMNC: 260\nAuthentication type: <Not set>\nAPN type: <Not set> OR Internet+MMS\nAPN protocol: IPv4/IPv6\nAPN roaming protocol: IPv4\nEnable/disable APN: <greyed out unless there are multiple APN's>\nBearer: Unspecified\nReplace the (dot) with an actual period. The website does not allow me to type links since I have less then 10 posts. Update that and you should be able to get data. You can also go into setting -> More -> Internet settings (the last thing on the page) and that will get the settings by itself. Let me know if these options work for you.", "time": "11-24-2015 11:30 PM", "replies": [{"postID": "post4917093", "text": "I didn't actually know where to find the settings that you're talking about, but by going into settings>Internet Settings, it says you can download the settings via Wi-Fi. So you still solved my problem. Thanks hoosiers7120!", "time": "12-26-2015 09:50 PM", "replies": []}]}, {"postID": "post4855796", "text": "Forgot to type this in\nMMSC:http://mms.msg.eng.t-mobile.com/mms/wapenc", "time": "11-24-2015 11:38 PM", "replies": []}, {"postID": "post4917092", "text": "***", "time": "12-26-2015 09:49 PM", "replies": []}]}, {"title": "WIFI Issues", "thread": [{"postID": "post4854907", "text": "Hi guys, \nHas anyone noticed a issue with their phone and connecting to WIFI?\nI have noticed that my phone had an issue when it was connected to a router that was using WEP2 as its security. It would cause the router to lose all internet connection until it was restarted. \nIf you have then change your security in your router settings to just WEP and it will work perfectly fine after that.", "time": "11-24-2015 03:20 PM", "replies": [{"postID": "post4857579", "text": "My router is using WEP2 and it's fine...", "time": "11-25-2015 08:51 PM", "replies": []}]}, {"postID": "post4855657", "text": "Can you change to WPA2-PSK instead? That's the best, most secure protocol to use.", "time": "11-24-2015 10:02 PM", "replies": []}, {"postID": "post4856912", "text": "That's what my router was on and it was causing so many issues.\nI have read other forums which have people reporting issues with other sony Z models so i just wanted to throw it out there just in case", "time": "11-25-2015 01:23 PM", "replies": [{"postID": "post4857927", "text": "Was it WPA2-PSK/AES or WPA2-PSK/TKIP? AES is preferred.", "time": "11-26-2015 02:18 AM", "replies": []}]}, {"postID": "post4857983", "text": "WPA2-PSK/AES - correct. It wasn't just my router, I connected to a router in the apartment next door and it was the same issues. I don't know why but now I have changed the settings, its perfectly fine", "time": "11-26-2015 03:08 AM", "replies": []}, {"postID": "post4860902", "text": "I just found out my z5 can't connect to my Asus AC router while my Samsung S4 could 300 meter away from my home...", "time": "11-27-2015 10:15 PM", "replies": [{"postID": "post4862071", "text": "This sounds like it may be a different issue than what the OP posted about. The OP says that the router itself completely loses the internet connection when his Z5 is connected. If you're saying that you just can't connect your Z5 to the router, then you may want to create a new thread about your issue.", "time": "11-28-2015 03:39 PM", "replies": []}]}, {"postID": "post4861170", "text": "I don't know what the issue is...mine has started playing up again so i have just turned the WIFI off for the time being.", "time": "11-28-2015 03:09 AM", "replies": []}, {"postID": "post4862068", "text": "Is the router's firmware completely up to date?\nAnd also, on the other hand, if you recently updated the firmware, you could try downgrading it again. I've had issues with prior routers where the updates actually messed things up, and it worked again after downgrading the firmware.", "time": "11-28-2015 03:38 PM", "replies": []}, {"postID": "post4862859", "text": "I will give that a go and see if that corrects the issue", "time": "11-29-2015 05:03 AM", "replies": []}, {"postID": "post4899266", "text": "Seems like the recent sony update has fixed the problem with my phone and the router. It has been connected for the past 2 days with no issues.", "time": "12-17-2015 02:02 AM", "replies": []}]}, {"title": "The Z5 Premium", "thread": [{"postID": "post4656342", "text": "A hybrid sized device, weighing in at 5.5\" 4K display. The hardware in it is pretty respectable.\nFrom the blog: Sony Xperia Z5 Premium specs | Android Central\nI will honestly pass on this one. Anyone who is interested though?", "time": "09-02-2015 12:45 PM", "replies": [{"postID": "post4712601", "text": "Extremely tempted. When I bought the Z1 I felt it ticked more boxes than any other 2013 smartphone. Didn't quite feel that way about the next two Xperias so while I tinkered with them a lot I didn't pull the trigger to upgrade. Now the Z5 is ticking all my boxes again. I feel better about this phone on paper than anything the other brands have releases in 2015. We'll see how it plays out when it's actually launched.\nI have an approach to Android that a lot of forum members would likely dislike and disagree with in that I view the iPhone as the gold standard for quality, reliability, hardware design, optimization, and fine attention to detail. For me, the Xperia line has always been Android's iPhone, not Samsung in those regards. When everyone complained about the s810 thermal issues, Sony's hardware team put heat distribution built into the Z5 and eliminated it. When everyone complained about bugs on 5.02 Sony software engineers patched them in that version it while Google took until 5.11.\nSo why do I even use Android in the first place? Simple preference for what the OS can do for the things I use a smartphone for. I don't really have any loyalty though, the day I can't buy an Android phone that matches my quality criteria I would switch and swallow the missing capabilities.", "time": "09-27-2015 05:58 PM", "replies": []}]}, {"postID": "post4656647", "text": "The pixel density of 806ppi together with Sony's display technology are presumably intended with VR in mind. Exciting stuff. \nPosted via the Android Central App", "time": "09-02-2015 02:00 PM", "replies": [{"postID": "post4657102", "text": "Good point on the VR idea. It might be where Sony is headed.", "time": "09-02-2015 04:15 PM", "replies": []}]}, {"postID": "post4658563", "text": "I ditched the Z3 for the LG G4, as I felt Sony was standing still whilst all around them seemed to be far more innovative.\nIt's interesting that many are criticising them for a 4K display, saying it's pointless in a hand held device, but Sony can't really win. I recall many doubters of 1080p before it became the norm, and and then the same for 2K. It's the nature of tech. that it's always being pushed further. They've also gone for the first side mounted fingerprint reader as well as losing the flaps for the IP rating (as they did in the far more incremental Z3+/Z4). Sure, I wouldn't mind a different design language, as Samsung have done, but then Samsung was notorious for being rubbish for that, so the only way was up. If they went for aluminium or plastic they'd be accused of copying HTC/LG.\nIf for one will be tempted by the Z5 premium if the actual performance lives up to the potential.", "time": "09-03-2015 06:29 AM", "replies": []}, {"postID": "post4672940", "text": "on the sony website they now have it so you can register for any of the Z5 phone. i'm just hoping i'll be able to use it on T-mobile/ Metropcs network.", "time": "09-09-2015 01:28 PM", "replies": []}, {"postID": "post4857590", "text": "I am loving it....", "time": "11-25-2015 08:58 PM", "replies": []}, {"postID": "post4857663", "text": "I'm coming over from Blackberrry OS and when comparing specs, this phone made number one on my list. But I've never used any android phone, and I know that no matter what the camera on this is going to kick any Blackberry that's ever been made. I'm very interested in this phone, it looks a little more complicated to get my hands on it compared to a Samsung though.", "time": "11-25-2015 09:44 PM", "replies": []}]}, {"title": "Z5 on Tmobile?", "thread": [{"postID": "post4731582", "text": "Would this phone work with tmobile's network? I'm done with Samsung and want to give Sony a try.\nPosted via My Note 4", "time": "10-05-2015 10:41 PM", "replies": []}, {"postID": "post4731613", "text": "I can't wait!!! Me too I've tried everything and I think the Z5 Premium wishing they would get this phone hopefully..\nPosted via the Android Central App", "time": "10-05-2015 11:06 PM", "replies": []}, {"postID": "post4738629", "text": "Tmo has already announced they will not be carrying any of the Sony Z5 phones. Read about it here: T-Mobile says it has no plans to offer Sony Xperia Z5 » TmoNews \nIf you want one you will have to buy an International Version from a 3rd party seller. You will also not get Band 12 and wifi calling. You will get updates straight from Sony.", "time": "10-09-2015 09:34 AM", "replies": []}, {"postID": "post4751997", "text": "Just got my Z5 Tuesday. Not sure about the band 12, but Wifi calling does work and it works great.", "time": "10-15-2015 05:22 PM", "replies": [{"postID": "post4752221", "text": "Hmmm, wifi calling works.....that's interesting........in a good way! Band 12 is not that big of an issue for me right now because according to TMo's map, it will be awhile before it arrives in Chicago. A TV station owns band 12.\nAny issues with heat / getting hot? BTW, I'm assuming you are using TMo?", "time": "10-15-2015 07:44 PM", "replies": []}]}, {"postID": "post4753556", "text": "Awesome phone. No heating issues at all and I've been constantly on it for the last 3 days. Gets a little warm like all phones do. We have Band 12 here in northeastern PA but I don't know how I can tell if it works. Right now according to LTE discovery app I'm on band 4 LTE(just downloaded it this morning) and it's fast. I had the Z3 and one particular bar I frequent, as soon as I'm inside there I had no service. Then they updated to the 5.0 lollipop with the band 12 and all of a sudden I had all bars and LTE .Was there last night and the Z5 had all bars and LTE so I'm guessing maybe it does. The wifi must be built in to the 5.1.1 because that's the first thing I checked. Put it in airplane mode with wifi on and made phone calls and texts and it worked very very well. I got mine from Clove. E6653. Gold. 24 month warranty. Free bluetooth wireless speaker. Ordered Friday and came Monday actually, but owed duty and was never notified by DHL so it got rescheduled for Tuesday. Also got insurance on it through Worth Ave Group. I love this phone!!! And yes I'm on T Mobile.", "time": "10-16-2015 12:47 PM", "replies": []}, {"postID": "post4756294", "text": "Is this the Z5 you have?\nDid it come with UK charger?", "time": "10-17-2015 10:37 PM", "replies": []}, {"postID": "post4778733", "text": "How did you get wifi calling to work? it doesn't even show up in the settings menu.", "time": "10-27-2015 12:43 PM", "replies": []}, {"postID": "post4835659", "text": "Band 12 is working on T-mo! I have not been able to see any settings for wi-fi calling nor have I been able to make a wi-fi call, anybody can help?\nthanks\nAC", "time": "11-16-2015 12:47 PM", "replies": []}, {"postID": "post4841916", "text": "hey quick question. Did LTE start working as soon as you inserted the sim card or was there an additional process you had to go through. I currently have the Z5 premium and it supports T-Mobile LTE. However when I insert my sim card in, it shows no data signal whatsoever. I went to the APN settings and updated it but all i get now is edge (2g) I had the Z3 before and was getting around 35-100 Mbps in my area. now i cant even load a web page. Can you (or anyone reading this) help me out. I sold my z3 just hours before my z5 came, which was a mistake since now i really cant do anything with my phone (besides use it on WiFi and call). Any help will be appreciated. Thanks in advance", "time": "11-18-2015 10:11 PM", "replies": [{"postID": "post4843427", "text": "Off your topic, but if you don't mind, where did you get your Z5 Premium from? I'll be buying one soon and was curious.", "time": "11-19-2015 01:42 PM", "replies": []}]}, {"postID": "post4844384", "text": "I bought mine from valuebasket.com. After purchasing it I went off to read several reviews of the website as I had never been not heard of it before. It was actually pretty bad. Many consumers had very negative experiences and it had an overall rating of 2.6 out of 5 stars. I was completely stunned after reading people's reviews and comments but nevertheless, I gave it a try. I was sitting in class (I'm a college student) while surfing their website and I was ready to click the place order button. But at the same time I was utterly confused if I should use my money somewhere else. I looked to my left and the kid next to me was where in a Nike shirt with the logo \"Just Do It\". I looked back at my phone and without thinking I did it. I placed the order and shortly after I received an automated email from value basket stating that my order was being processed and would take up to 5 days. After 3 days I received another email stating that phone had been shipped. I was under the influence that this company was shipping It from the US since their website had a US domain. Apparently not. It was coming from Hong Kong. I was furious as I thought shipping would take weeks more. Fortunate for me, my phone arrived in 2 days. I was astonished as I quickly opened the package to make sure it was really the Sony Xperia Z5 Premium that I had long awaited. What a zest full moment it was. I began playing around with it and couldn't get over the 4k screen. I had a quite different experience then everybody else at value Basket as I had really received the phone and in just 5 days of placing the order. Also after writing on this forum, I updated the apn settings and I go finally got lte. I had the Htc one m9 before and I would get somewhere around 25-32 mbps tops on my home. With this phone however, I'm hitting 70 and above! The only tiny let down is that it doesn't show me the lte signal but instead the regular 4g one. I honestly don't mind though. But yes this is the story of how I purchased the Sony Xperia z5 premium. I'm quite happy I did and would recommend it to all of you. And as for the question someone posted about over heating, I can assure you it does not. I had the m9 and sometimes it would get so hot I couldn't hold it anymore. However this phone is a totally different experience. Sony did an amazing job placing dual copper pipes minimizing heat and I'm telling you it works great. I'm a heavy user and for me this phone hardly even gets warm. The camera is astonishing and mind blowing. I'd say in some conditions it beats the note 5 as well as my brothers s6 edge plus. It's a beast of a phone. Honest opinion. I am actually doing a short review on it. You guys should check it out.\nPosted via the Android Central App", "time": "11-19-2015 10:52 PM", "replies": [{"postID": "post4845349", "text": "Cool! I'm planning on using my Z5 Premium with Tmoblie as well. Where did you find the APN settings for Tmobile?", "time": "11-20-2015 10:39 AM", "replies": []}]}, {"postID": "post4855768", "text": "Have you figured out how to turn Wifi Calling on? I recently just got my Z5 (D6853) and I am not unable to find those settings.", "time": "11-24-2015 11:17 PM", "replies": []}]}, {"title": "Pre orders now available on CPW", "thread": [{"postID": "post4770035", "text": "Sony Xperia Z5 Premium contract deals and offers from £49 per month | The Carphone Warehouse", "time": "10-23-2015 03:41 PM", "replies": []}]}, {"title": "Z5 premium coming to US markets?", "thread": [{"postID": "post4661951", "text": "I really want one but im in the US and im on T moble does anyone have a clue?\nPosted via the Android Central App", "time": "09-04-2015 11:22 AM", "replies": [{"postID": "post4667272", "text": "I heard it possible not carry anytime. However it too early to announcements. Check back for tmobile's details\nPosted via the Android Central App", "time": "09-06-2015 09:50 PM", "replies": []}]}, {"postID": "post4678785", "text": "you can always purchase from Sony website unlocked it has all band support \nSent from my SM-N920I using Tapatalk", "time": "09-12-2015 03:19 AM", "replies": []}, {"postID": "post4687847", "text": "Being on T mobile you should be able to use the UK version and it should work just fine. I would compare the frequencies of the UK version versus T mobile.", "time": "09-16-2015 10:13 AM", "replies": []}, {"postID": "post4704859", "text": "Hi - I know the Z ultra is slated for 3/2016 on T-Mobile If i'm correct their waiting for a Z6 announcement it should have the right prosser 820 with 4G ram. that was supposed to be in the Z5 but we all know about the screwup with qualcomm that's why they went with the 810 which had problems. T-Mobile had to many complaints with that processor as well as something to do with frequency bands. So sit tight I as well as many others can't see T-Mobile missing this product and I doubt they will.", "time": "09-24-2015 12:44 AM", "replies": [{"postID": "post4713441", "text": "Sony tweaked the Z5 so that there aren't any issues with the s810. Problem solved.", "time": "09-28-2015 06:23 AM", "replies": []}]}]}, {"title": "Z5 Premium is not as waterproof as Z3? Why?!", "thread": [{"postID": "post4659676", "text": "It seems the Z5 Premium might not be waterproof anymore which is a bummer. \nI was really hoping for it to have the same disclaimer as the Z3: \n*The Xperia Z3 is waterproof and protected against dust as long as you follow a few simple instructions: all ports and attached covers are firmly closed; you can’t take the phone deeper than 1.5m of water and for longer than 30 minutes; and the water should be fresh water. Casual use in chlorinated pools is permitted provided it’s rinsed in fresh water afterwards. No seawater and no salt water pools. Abuse and improper use of device will invalidate warranty. The phone has an Ingress Protection rating of IP65 and IP68. \nBut alas, no full submersion for the Z5:\n**** The Xperia Z5 Premium is waterproof and protected against dust, so don’t worry if you get caught in the rain or want to wash off dirt under a tap, but remember: all ports and attached covers should be firmly closed. You should not put the device completely underwater or expose it to seawater, salt water, chlorinated water or liquids such as drinks. Abuse and improper use of device will invalidate warranty. The device has Ingress Protection rating IP65/68.\nThink they'll update the disclaimer closer to launch or is it really that much less waterproof now that they have an open USB port?", "time": "09-03-2015 02:22 PM", "replies": []}, {"postID": "post4662886", "text": "It still has the same ip 65/68 rating as Z3/Z3+. So it should be just as waterproof as previous models.", "time": "09-04-2015 06:08 PM", "replies": []}, {"postID": "post4670714", "text": "Official responce from Sonys Xperia forums (apparently I can't post links)\nHi guys!\nOur new Xperia Z5 is protected from water ingress according to the IPx5/x8 standard, which is the highest water protection featured in mobile handsets. The tests for this rating also include the slow submersion in a fresh water tank up to 1.5m for a duration of 30 minutes. Moving or operating the device while it is submerged is not tested during the laboratory tests. There are also many environmental factors which we could not assess (e.g. water movement or water pressure changes during the movement), if a device is used underwater. Therefore we recommend not submerge our Xperia Z5 in water.", "time": "09-08-2015 01:30 PM", "replies": []}, {"postID": "post4670895", "text": "Using the generic Micro USB and Mic rubber caps can avoid most of this possible scenarios. I bought a 40 items package (10 mic & 10 micro USB of each color) for my S6 Active, so now that I already sold it, I'm planning to use them in any other Waterproof devices I buy, like the Z5.\nJust in case you don't know what I'm talking about, check this, they even look better in person than in the pictures.20x Silicone 3 5mm Micro USB Cell Phone Port Plug Cover Cap Anti Dust Protector | eBay", "time": "09-08-2015 03:05 PM", "replies": []}]}, {"title": "Did reporters really see the 4K Display?", "thread": [{"postID": "post4664583", "text": "Came across this article today, and it implies reporters were duped into thinking they were getting hands on with the Z5 Premium and it's 4K Display. Don't be fooled by Sony's 4K smartphone; it's 100% hype\nI'm quite sure the folks at Android Central would have been sure to determine which device they were looking at when proclaiming the 4K Display was amazing, but thought I'd put this out there to see what others think.", "time": "09-05-2015 03:02 PM", "replies": [{"postID": "post4667274", "text": "Sony squeezed out to about 800 dpi. No **** and idk if battery able to handle it?\nPosted via the Android Central App", "time": "09-06-2015 09:51 PM", "replies": []}]}]}, {"title": "More details about the Z5 premium", "thread": [{"postID": "post4656160", "text": "Here is a PDF with even more information on the technical side of things. http://dl-developer.sonymobile.com/d...E6853_WP_1.pdf\nPosted via the Android Central App", "time": "09-02-2015 11:33 AM", "replies": []}, {"postID": "post4656243", "text": "Surprise move by Sony. I love seeing technology being pushed forward like this. A 4K display keeps them well a head of the competition for a while. My only slight concern is the S810, I would have liked to see something that was a bit less troublesome, but hopefully the issues have been fixed after all this time. \nFeels like the first really big upgraded phone of the fall of 2015. My Note 4 is running perfectly and I don't need to buy a new phone now, but if I was in the market for a new phone, I would easily consider this over the Note 5. At least it has the sd card slot and some cutting edge technology.", "time": "09-02-2015 12:07 PM", "replies": []}, {"postID": "post4657127", "text": "This is an interesting phone. Given that this is a flagship device with a 4k screen, it is going to be expensive and I'm a little disappointed that Sony decided to use only 3gb of ram on this device.\nPosted via the Android Central App using my Xperia Z3", "time": "09-02-2015 04:21 PM", "replies": []}, {"postID": "post4657660", "text": "I would much prefer functions like OIS and always listening over 800+ PPI\ndreaming of electric sheep", "time": "09-02-2015 07:48 PM", "replies": []}]}]
