[{"title": "Huawei P8 Mate cannot store word files anymore", "thread": [{"postID": "post6181772", "text": "I have a Huawei P8 mate. earlier it was no problem storing for instans word files on my phone or SD-card. But I cannot do it now. -And there is a lot of storingspace, so that´s not the problem. I suspect HiSuite for making the problems, but I really don´t know and how to fix it. I think I´m nearly an IT_neanderthal ;-) BTW", "time": "03-07-2018 04:57 AM", "replies": []}, {"postID": "post6182055", "text": "Welcome to Android Central! Can you clarify -- do you have a Huawei P8, or a Huawei Mate 8? They're not the same phone.\nBy \"word files,\" are you talking about Microsoft Word documents using the Microsoft Word app? If you're getting an error message, what exactly does it say?", "time": "03-07-2018 10:20 AM", "replies": []}]}, {"title": "Soundcloud stops when screen locks", "thread": [{"postID": "post6144820", "text": "In my Huawei Mate 8, I have not checked soundcloud to stop on screen-lock to save battery but still it stops. Sometimes it doesn't but sometime it does. It just random. I have done following but still issue exists:Uninstalled soundcloud; restarted phone; installed soundcloud againFactory reset phone\nPlease note that other music apps run even screen is locked they never stoped like Strava, Google Music etc.", "time": "01-24-2018 01:52 PM", "replies": []}]}, {"title": "Lcd blinking when voice playing time", "thread": [{"postID": "post6143736", "text": "Huawei mate 8 whtsapp voice playing time lcd blinking \nany solution for this case?", "time": "01-23-2018 09:43 AM", "replies": []}]}, {"title": "Oreo", "thread": [{"postID": "post6000202", "text": "Is there any chance the Mate 8 will get Android Oreo?", "time": "10-01-2017 02:32 PM", "replies": []}, {"postID": "post6000259", "text": "I think yes", "time": "10-01-2017 03:33 PM", "replies": []}, {"postID": "post6001104", "text": "A chance...yes but a pretty slim one, imo", "time": "10-02-2017 10:18 AM", "replies": []}, {"postID": "post6001336", "text": "Thanks for the responses. Is it not custom and practice for Android phones to get two operating system updates?", "time": "10-02-2017 01:24 PM", "replies": [{"postID": "post6014545", "text": "They did promise a while back 2 os updates for every phone here in the states, but I'll believe it when I see it.", "time": "10-10-2017 10:46 PM", "replies": []}]}, {"postID": "post6022645", "text": "Huawei has, apparently, committed to providing more frequent updates.", "time": "10-16-2017 04:49 PM", "replies": [{"postID": "post6022785", "text": "They committed to quarterly updates on the 5x...I am pretty sure it's on a year old or older patch. Oh and it's still on marshmallow.", "time": "10-16-2017 06:59 PM", "replies": [{"postID": "post6022809", "text": "Yeah, how they treated the 5x does not bold well. Hopefully they change things up for the better with the newer phones.", "time": "10-16-2017 07:24 PM", "replies": [{"postID": "post6023522", "text": "Infrequent updates are a deal breaker for me.", "time": "10-17-2017 08:17 AM", "replies": [{"postID": "post6025171", "text": "I don't think it's acceptable when they are pushing phones in the same price range as Samsung and Apple. At a lower price tag like in their previous phones, then it's more tolerable", "time": "10-18-2017 08:07 AM", "replies": []}, {"postID": "post6091496", "text": "How important is it to you? I've had phones that don't get updates frequently but that didn't changed my ways on using a phone.", "time": "11-30-2017 05:15 PM", "replies": [{"postID": "post6099138", "text": "I guess I just like to feel that I am up-to-date! It's not like my phone suddenly got worse when Oreo came out.", "time": "12-07-2017 12:33 PM", "replies": []}]}]}, {"postID": "post6092114", "text": "So far the 6x is getting updates. Just not all of the models.", "time": "12-01-2017 12:36 AM", "replies": []}]}]}, {"postID": "post6092113", "text": "Yes they did only for the latest Mate series", "time": "12-01-2017 12:36 AM", "replies": []}]}, {"postID": "post6040823", "text": "It would be the next model to follow the Android O Update after Mate 9 phones.", "time": "10-27-2017 02:06 AM", "replies": [{"postID": "post6091416", "text": "Let's hope that you are right", "time": "11-30-2017 04:42 PM", "replies": []}]}, {"postID": "post6090550", "text": "I believe it will sometime next year", "time": "11-30-2017 06:09 AM", "replies": [{"postID": "post6091418", "text": "Well this year is almost over, so it is unlikely to be this year", "time": "11-30-2017 04:42 PM", "replies": [{"postID": "post6091493", "text": "Be optimistic! It will happen! Just oh so very unlikely", "time": "11-30-2017 05:13 PM", "replies": []}]}]}]}, {"title": "Locks screen by itself for no reason", "thread": [{"postID": "post6049837", "text": "Hey so my Huawei Mate 8 sometimes locks the screen by itself when i'm using it and sometimes it won't unlock after this happens. what can i do?\nthanks", "time": "11-02-2017 04:10 AM", "replies": []}, {"postID": "post6050310", "text": "Welcome to Android Central! Any magnets near the phone? If so, it might be triggering the smartcover sensor.", "time": "11-02-2017 11:32 AM", "replies": []}, {"postID": "post6050837", "text": "Got a PM from the OP, who was having difficulty responding within the thread: \"there are no magnets near the phone but it seems to have stopped doing it for now...i have a magnet in my car that i stick the phone to when i'm driving and this never happens when i do that so i dont think it would be about magnets.... do you have any other ideas?\nthanks for your help\"\nHard to say, unless it happens again. If it does start happening again, see if Safe Mode gets rid of it: How to turn on safe mode on Huawei Mate 8. If it does, then something you installed is probably causing that instability -- you'd have to uninstall apps one by one to figure out which one.", "time": "11-02-2017 04:59 PM", "replies": [{"postID": "post6073185", "text": "Has the op pm you further with regards to this issue?", "time": "11-16-2017 03:36 PM", "replies": []}]}, {"postID": "post6072532", "text": "Has the issue reappeared again?", "time": "11-16-2017 07:35 AM", "replies": [{"postID": "post6073187", "text": "It is unlikely that the op will respond given that he or she is having problems posting here", "time": "11-16-2017 03:36 PM", "replies": []}]}, {"postID": "post6073239", "text": "That's true. I'll pm the op and find out", "time": "11-16-2017 04:12 PM", "replies": []}, {"postID": "post6080144", "text": "Any response yet?", "time": "11-21-2017 04:49 PM", "replies": []}, {"postID": "post6081988", "text": "Ah forgot to pm the OP\nGimme a min", "time": "11-23-2017 03:21 AM", "replies": []}, {"postID": "post6092228", "text": "No response", "time": "12-01-2017 03:42 AM", "replies": []}]}, {"title": "Huawei Mate 8 Android update", "thread": [{"postID": "post6049838", "text": "When is the Huawei Mate 8 finally gonna get the Android 7 update? And the new EMUI ?\nThanks", "time": "11-02-2017 04:12 AM", "replies": [{"postID": "post6068223", "text": "What carrier are you on? I believe the Nougat rollout went out to every model", "time": "11-13-2017 06:01 PM", "replies": [{"postID": "post6068500", "text": "Maybe his phone was stuck. My honor 8 was stuck for months on older software", "time": "11-13-2017 09:32 PM", "replies": [{"postID": "post6068589", "text": "Didnt know that was possible", "time": "11-13-2017 10:56 PM", "replies": [{"postID": "post6069453", "text": "Yeah had to use ff to get it going", "time": "11-14-2017 01:12 PM", "replies": []}]}]}]}]}, {"postID": "post6064514", "text": "I believe the Mate 8 should of received the Nougat update long time ago", "time": "11-11-2017 06:33 AM", "replies": [{"postID": "post6065217", "text": "Really? I was not aware of it.", "time": "11-11-2017 03:38 PM", "replies": [{"postID": "post6065349", "text": "I searched online before commenting. Should've got it way back in the year. I'll get a link to show", "time": "11-11-2017 04:38 PM", "replies": [{"postID": "post6068087", "text": "Ok thanks for the info", "time": "11-13-2017 04:56 PM", "replies": []}]}]}]}, {"postID": "post6065354", "text": "YouTube", "time": "11-11-2017 04:43 PM", "replies": [{"postID": "post6068088", "text": "Thanks for the video proof", "time": "11-13-2017 04:57 PM", "replies": []}]}, {"postID": "post6070432", "text": "They're slacking !", "time": "11-15-2017 01:44 AM", "replies": [{"postID": "post6071375", "text": "They definitely are", "time": "11-15-2017 01:39 PM", "replies": []}]}, {"postID": "post6071612", "text": "Devs are taking a vacation break", "time": "11-15-2017 04:17 PM", "replies": [{"postID": "post6073190", "text": "Huh? What are you referring to?", "time": "11-16-2017 03:37 PM", "replies": []}]}, {"postID": "post6073240", "text": "Devs of ff", "time": "11-16-2017 04:12 PM", "replies": []}, {"postID": "post6080143", "text": "Oh that's quite possible. Hopefully they come back soon", "time": "11-21-2017 04:48 PM", "replies": []}, {"postID": "post6080652", "text": "Hopefully they don't forget to come back 😁", "time": "11-22-2017 01:09 AM", "replies": [{"postID": "post6081411", "text": "That is definitely another possibility", "time": "11-22-2017 02:30 PM", "replies": []}]}, {"postID": "post6081450", "text": "It is althought I doubt they'll forget it", "time": "11-22-2017 03:26 PM", "replies": []}]}, {"title": "mate 8 NFC stop working", "thread": [{"postID": "post6027486", "text": "Hi my Huawei mate 8 NFC scan dosent work it cant read cards or tags it worked last week\nThanks for the help", "time": "10-19-2017 12:27 PM", "replies": []}]}, {"title": "Original LCD screen replacement", "thread": [{"postID": "post5352026", "text": "Hello,\nCan anyone at least provide a link where I can buy original OEM mate 8 LCD panel?. I've seen most on Amazon which are all third-party manufactured, sadly. Same for AliExpress and eBay. They all don't have the Huawei logo on the front. Many thanks.", "time": "08-21-2016 09:48 AM", "replies": []}, {"postID": "post5996786", "text": "I had the same problem, eventually bought an after market one, it was awful, very dim with poor colours. So I bought a second hand phone from eBay, I intend to swap the screen with my own, but the phone is in such good condition, I'm just leaving it as is. It's a Chinese phone, but it works beautifully 😁. So in essence, you'll be very lucky if you can buy an original screen 😕", "time": "09-28-2017 02:37 PM", "replies": []}]}, {"title": "Why are my huawei Mate 8 and P9 not charging fast after upgrading to Nougat", "thread": [{"postID": "post5929200", "text": "I recently upgraded both of my mate 8 and p9 to Nougat. After upgrading it some times doesn't even fully charge in 24 hrs. Some times it even further discharges while charging. Both of the phones become hot while charging.\nUsing charging current measuring Application like Ampere I have noticed some times a maximum charging current of 120 mA or 90 mA. While before upgrading this current used to be above 1700 mA. \nSome times after restarting the phone or plugging and unplugging the charger several times the charging current becomes normal and reaches to a maximum value of 1800 mA in both phones. But after a while the issue resumes.\nI have tried several solutions like\nFactory resetting\nSwitching between several chargers\nSwitching between charging cables\nTrying different wall sockets for charger\nBut all of the above solutions have failed.\nI also visited huawei customer care center but they said that they can not handle this issue and it may be solved in future upgrades.\nThe issue is not only with my phones but my neighbor also has amate 8 he is also facing the same issue with his phone after upgrade.\nI am very worried as i have just recently bought my phones and now i have to sell it again at lower prices.\nIf any one know about the solution kindly share with me. Thank u.", "time": "08-19-2017 10:39 PM", "replies": []}, {"postID": "post5930998", "text": "If it's happening in your phones and in your friend's phone then it is probably a software issue, especially after all the troubleshooting you did. You can try to revert back to old software and update again, or just keep the old software until Huawei fixes this problem", "time": "08-21-2017 03:42 PM", "replies": []}, {"postID": "post5975705", "text": "I have not noticed any problems with my Mate 8.", "time": "09-15-2017 05:32 AM", "replies": []}]}, {"title": "What should i do?", "thread": [{"postID": "post5799138", "text": "I Have a Huawei mate 8 NXT-L29C185B190. Couple of months ago I rooted my android. With TWRP and unlocked bootloader. I by mistake formated my phone with TWRP and then all my data including the Huawei mate 8 themes and icons were gone. The icons were like the older versions of android(messed up). Just a minute ago I got an OTA update. So I removed my root by SuperSU and then tried to update it. But then it redirected me to TWRP. I didn't what to do so I rebooted the device. What should I do? (The update is not installed)", "time": "05-03-2017 04:07 PM", "replies": []}]}, {"title": "Problems in mirror share", "thread": [{"postID": "post5738846", "text": "After my phones update to android 7 ,emui 5 ,the mirrorshare does not working . My phone appears on the half screen of my tv....and before the latest update was working good. My phone is a huawei ascend mate 8.\nMay someone help me with that?", "time": "04-02-2017 04:46 AM", "replies": []}]}, {"title": "Huawei Mate 8 - Birthday Notifications from Contacts App", "thread": [{"postID": "post5712360", "text": "Hey,\nI recently updated my Mate 8 to Android 7.\nEver since, I have been receiving Birthday notifications from the Contacts app. These notifications are 1 week early (fine), but I do not see any settings for a way to change or disable these notifications.\nI'm hesitant to disable notifications for the Contacts app (through system > app settings), as I'm not sure what effect this will have on missed call notifications, etc.\nJust wondering if anyone else has had a similar issue, and if anyone knows a solution.\nThanks for any help.", "time": "03-14-2017 05:29 PM", "replies": []}]}, {"title": "My Huawei mate 8 can't update apps", "thread": [{"postID": "post5698046", "text": "i bought huawei mate 8 from china last feb-2016 , the model is NXT-AL10 actually over 10 months everything with that phone was going perfect except for the last month , google play store can't update apps or download new apps , the email application already installed on phone is stopped sync, i try everything but i failed so if you have any idea that could help me that will be great , thanks", "time": "03-03-2017 10:53 AM", "replies": []}, {"postID": "post5701466", "text": "Welcome to Android Central! Did the phone come with the Play Store installed, or did you have to install it yourself? If the phone was intended for the Chinese market, it likely didn't have the Play Store already, so if you had to install it yourself, you might have to install the latest update to the Play Store app, or possibly Google Play Services.", "time": "03-06-2017 01:09 PM", "replies": []}]}, {"title": "How I can see the current LTE band that my mate 8 is connected?", "thread": [{"postID": "post5685324", "text": "Hi.\nOn mediatek based phones, samsung galaxy s6-s7 and iphones is easy with the engineering menu or field menu....\nSo does anyone know on how do I check the LTE band I'm connected to with mate 8 ?\nOn Mate 9 with Android 7 with network cell info https://play.google.com/store/apps/d...s.cellinfolite\nit shows the bands. \nWith mate 8 with Android 7 is not possible.\nAny help will be appreciated !", "time": "02-20-2017 09:03 PM", "replies": []}, {"postID": "post5685417", "text": "Have you tried LTE Discovery?", "time": "02-20-2017 10:26 PM", "replies": [{"postID": "post5685629", "text": "Yes it is not working in Europe as they do not have in their database the exact configurations.", "time": "02-21-2017 06:18 AM", "replies": []}]}]}, {"title": "General Huawei Mate 8 Performance Issues", "thread": [{"postID": "post5646286", "text": "Hi,\nI've had the Mate 8 for about 4 months now, and have been experiencing a few performance issues:1. Unresponsive touch screen.\nTouch screen will frequently ignore touches. I will often have to double or triple touch.2. Slow app launching times.\n4-5 (sometimes up to 10) second delays when launching apps (IMDB, Boat Browser, Wunderlist). The app will open, but the screen will be blank (white, black or grey) for a few seconds before the app fully loads.3. Cannot Wake Device.\nOccasionally (once a week) the phone will freeze/lock-up while asleep. It heats up and cannot be woken (power button, fingerprint scanner are unresponsive). Force reboot (long press power button) required. This is happening more and more frequently (3 times in last 24 hours). It appears to be some sort of memory leak.\nIs anyone else having the same issues? Anyone know of solutions on how to improve/fix any of these issues? Did I get a lemon?\nThanks for any help.", "time": "01-17-2017 12:52 AM", "replies": []}, {"postID": "post5646859", "text": "I don't have a Mate 8, but I do have an Honor 5X, so there's probably some similarity there. In terms of slow app launching times, does your phone have the same aggressive RAM-management system settings as my Honor 5X does? If so, that can contribute to sluggish app opening, because if the system is constantly closing apps from RAM, that means any time you open a new app, it has to open back into RAM (and possibly rebuild its cache, if the system is also clearing that regularly). The Honor 5X has an option for \"Protected Apps,\" which protects an app from this kind of management -- try protecting your frequently used apps and see if that helps.\nIn terms of the touchscreen, try booting into Safe Mode to see if the problem stems from a 3rd party app you installed vs the system or hardware: http://consumer.huawei.com/ca/suppor...a.htm?id=55398", "time": "01-17-2017 12:09 PM", "replies": []}, {"postID": "post5676954", "text": "I have had my Huawei Mate 8 for a few months now, have not had these issues. Now running EMUI 5.0, Android 7.0. with with Nova Launcher, very responsive..", "time": "02-13-2017 01:18 PM", "replies": []}]}, {"title": "Mate 8 Internet Issue with T-Mobile, can I get some help?", "thread": [{"postID": "post5041596", "text": "I just bought my Mate 8 with build number NXT-L29C636B103, but I have been experiencing mobile data issues with my T-mobile carrier that only when I get 4G symbol, I can go online. Whenever I am getting either 3G or H+, I can not connect to internet at all.\nI have tried my wife's T-mobile phone, at the same location, her phone will get 4G LTE, my phone will have 4G, whenever she is getting 4G, I am getting H+ or 3G, which I can not go online anymore but on her phone, it still works.\nIs is because of the version of the Mate 8 I am getting or the setting is wrong, please help. I have 5 more days to return this phone if it does not work out. (I really like this phone a lot............)", "time": "03-08-2016 12:15 AM", "replies": []}, {"postID": "post5041621", "text": "Welcome to Android Central! Go to Settings>Wireless & Networks>Mobile Networks>Preferred Network Mode, and tell us what it's set to.", "time": "03-08-2016 12:40 AM", "replies": []}, {"postID": "post5041657", "text": "It was set as LTE/WCDMA/GSM auto", "time": "03-08-2016 01:02 AM", "replies": []}, {"postID": "post5042537", "text": "Check the APN settings and make sure they're correct for T-Mobile: https://support.t-mobile.com/docs/DOC-2090", "time": "03-08-2016 11:00 AM", "replies": []}, {"postID": "post5618022", "text": "I am running an AT&T and a T-Mobile sim, both show the 4G symbol.", "time": "12-22-2016 09:28 PM", "replies": []}]}, {"title": "USB to PC - Cannot See All Folders on SD Card (can see some)", "thread": [{"postID": "post5599296", "text": "Hey,\nIm having a weird problem with my Mate 8.\nWhen I connect it to a PC via USB, and select \"Files\" from the notification tray on the phone... On the PC, I can see and access my phones internal storage and SD card. But I cannot see all folders. For example, I have a \"My Docs\" folder on my phone's SD card. There are 9 other folders within this \"My Docs\" folder. But on the PC, I am only able to see 2 out of the 9 folders.\nI have tried uninstalling and reinstalling the USB drivers, which didn't help.\nThis problem occurs or 2 PCs, Windows 7 64bit & Windows 8.1 64bit.\nHas anyone else experienced this before? Anyone know a fix?\nThanks for any help.", "time": "12-08-2016 04:42 PM", "replies": []}, {"postID": "post5599882", "text": "Do the folders in question have names that begin with a period? A period at the beginning of a folder name flags it as hidden. In Windows Explorer, look for the option to show hidden files/folders, and see if they pop up.", "time": "12-09-2016 01:45 AM", "replies": []}, {"postID": "post5599929", "text": "Thanks for the reply B.Diddy.\nI do already have hidden folder display enabled. And the folder's names do not have a . prefix. \nDid you have an Mate 8?", "time": "12-09-2016 02:32 AM", "replies": []}, {"postID": "post5600356", "text": "Sorry, no, I don't have a Mate 8.\nIf you Unmount the card, remove it, and insert it into the computer's SD reader, are you able to see all of the folders then?", "time": "12-09-2016 09:56 AM", "replies": []}]}, {"title": "Privacy Protection Missing", "thread": [{"postID": "post5368702", "text": "hello..!!! \nI could not find privacy protection in my new huawei mate 8. \nThank u and please help me with this issue.", "time": "08-26-2016 02:14 PM", "replies": []}, {"postID": "post5368796", "text": "Welcome to Android Central! I didn't see anything in the manual about it. http://consumer.huawei.com/ch-en/sup...n.htm?id=66563. Did a previous Huawei phone have this? Are you sure it wasn't a 3rd party app feature?", "time": "08-26-2016 02:40 PM", "replies": []}, {"postID": "post5576015", "text": "Sorry that I am not sure what you mean that.", "time": "11-22-2016 08:59 PM", "replies": []}]}, {"title": "Factory Screen Protector?", "thread": [{"postID": "post5455979", "text": "Hey, \nJust wondering if anyone can confirm whether or not I should remove the pre-applied screen protector? I read one review that said it should be removed, but haven't found much other info online. \nI would normally just leave it on, but this on in particular is overhanging just a bit on the left hand side, and my thumb catches it when trying to swipe open the left slide out menus. \nSafe to ditch it? \nThanks for any help.\nPs, I just wanted to add, it seems really well stuck on, so I'm not sure if it's supposed to stay put or not.", "time": "09-30-2016 07:32 AM", "replies": []}, {"postID": "post5456384", "text": "I took mine off, only because I don't use them- maybe take this one off and buy one that fits better?", "time": "09-30-2016 11:09 AM", "replies": []}, {"postID": "post5457135", "text": "Thanks for the reply pinkvikchick. \nIs this the screen protector you mean (factory installed one)?", "time": "09-30-2016 06:42 PM", "replies": []}, {"postID": "post5519496", "text": "Yeah! the above members are right. I'd say take the phone \nto your-Carrier and they can Remove that useless plastic \nfilm and sell and installed-1 for you: go For it..SeeYa!", "time": "10-24-2016 12:09 PM", "replies": []}]}, {"title": "I have a question about Huawei Mate 8 dual window option!", "thread": [{"postID": "post5469610", "text": "So I know that fresh out the box Huawei Mate 8 doesn't support apps like Facebook, Twitter, Viber, Youtube etc in it's ''Dual Window'' mode, is there any update or way to make these apps work with dual window option.I heard that there are firmware updates but can I get them trough system settings update or doing some manual work.", "time": "10-06-2016 11:31 AM", "replies": []}]}, {"title": "can I root the Mate 8 to get rid of Emui ?", "thread": [{"postID": "post4979571", "text": "Is there a way to root a Mate 8 to get rid of some of the EMui bloatware? IS CyanogenMod13 perhaps for it?", "time": "02-03-2016 04:57 AM", "replies": [{"postID": "post5363636", "text": "Just install nova launcher and set it as the default launcher. Simple solution.", "time": "08-24-2016 11:19 PM", "replies": []}]}, {"postID": "post5273313", "text": "There is some info regarding this on the xda developer forums BUT it is complex due to Huawei locking the bootloader in a way which can only be done over the air... \nAlso there seems to be loads of issues with it. I personally found it too difficult to even get the boot loader unlocked without learning to read pages and pages of Mandarin Chinese, an effort I'm not willing to go to just for a rooted phone", "time": "07-20-2016 12:05 AM", "replies": []}]}, {"title": "Battery life on the Mate 8", "thread": [{"postID": "post5013932", "text": "Had the phone a week now and not that impressed, it's about the same as my note 5, which got me through the day just fine, but I was expecting better from this phone, so I'm a bit disappointed. Anyone else have any thoughts on this?", "time": "02-24-2016 01:38 PM", "replies": []}, {"postID": "post5015031", "text": "That's weird. Mine lasts all day and then some. I only compare it to my Nexus 6P because that's the only other phone I've been using lately and the Mate 8 definately whoops the 6P. Bigger screen but the Mate 8 is only 1080p and has a 4000mah battery. Could reception be the problem?", "time": "02-25-2016 03:57 AM", "replies": []}, {"postID": "post5016075", "text": "I get good reception at work and home. I swapped back to the note 5 today, and with near identical usage , when I got home from work, I was one 84%, just about the same on the mate 8 the day before. \nEasily enough to get through the day, but I was expecting better from this phone 😕\nPosted via the Android Central App", "time": "02-25-2016 01:54 PM", "replies": []}, {"postID": "post5038953", "text": "I advise getting Greenify to close down any wasteful apps running in the background. Also turn off Bluetooth and Wifi if you're not using them, every little helps.", "time": "03-07-2016 07:49 AM", "replies": []}, {"postID": "post5261650", "text": "Had mine a week,great battery life. 100% at 9 am, been watching videos, live sport etc all day. It's now 5pm. I'm on 74%. Brilliant. I'm a heavy user too. Loving it!\nPosted via the Android Central App", "time": "07-12-2016 10:59 AM", "replies": [{"postID": "post5273180", "text": "I don't get how this is possible. \nI leave my phone overnight after full charge with no WiFi, no mobile data and good signal with zero use and I wake up 9 hours later to 58%. \nI have disabled everything possible and set all apps to accept optimizations. The battery life is as bad when I'm using it if I'm not using it. Have only had this thing two weeks and fairly disappointed to say the least considering my blackberry z10 with 1800mAh battery could last me up to 2 days without needing a charge. \nIs there something wrong with my device?", "time": "07-19-2016 10:07 PM", "replies": []}]}, {"postID": "post5277564", "text": "Yep, 4000 mAH here as well. \nJust drains like a kitchen sink with the plug pulled out.", "time": "07-22-2016 01:55 PM", "replies": []}, {"postID": "post5278442", "text": "Even if I don't use mine at all and have no network connections open it drains around 7% in an hour... \nI don't get it I have turned off every stinking app, and disallowed anything from running when the screen is off and yet still cannot get even a full day out of the largest phone battery known to man.", "time": "07-23-2016 05:31 AM", "replies": []}, {"postID": "post5292805", "text": "I faced the problem as you last few days ago.\nI charged 100% full before sleep, turn off wifi, mobile data, apps and everything, but when I wake up my phone drop to 60%.\nYou can try backup everything of your mate 8, and factory reset it.\nCheck the \"Consumption Level\" in the Battery Manager. Mine one was the \"Android System (Multiple Apps)\" keep running on 70++% caused the problem. After factory reset it keep at 20-30%.", "time": "08-01-2016 06:00 AM", "replies": [{"postID": "post5293898", "text": "Yep! This was the problem. Just factory reset my phone and Voila! Android system returns to 20-30 % instead of the 80-90% it has been at since I got it. Thankyou!", "time": "08-01-2016 05:30 PM", "replies": []}]}]}, {"title": "WiFi hotspot disables my 3g/4g, how can I fix this?", "thread": [{"postID": "post5274761", "text": "Hello everyone,\nNew user here but long time forum reader.\nI have an Huawei Mate 8 and I'm having the issue below and hope someone can help shed some light on this.\nWhen WiFI Hotspot is activated the 3G/4G doesn't work - Chrome would say \"you are offline - your device is offline.\"\nAny insight on how to fix this issue is greatly appreciated.\nThank You\nEddie", "time": "07-20-2016 09:12 PM", "replies": []}, {"postID": "post5274867", "text": "Sorry I should clarify:\nWhat I mean is when I enable WiFi Hotspot/Tethering on my device, anyone connected to enabled hotspot provided by my device will have full internet access.\n(i.e. I turn on Wifi hotspot and my friend will connected to my phone's hotspot and he will have full internet access with no issues. However, when the hotspot is enabled on my device I cannot access the internet on the device itself)\nThis started a few days ago; I was able to enable WIFI Hotspot on my phone and use Chrome on my device simultaneously. But now I can only do one or the other.\nI hope this helps with describing the issue I'm having.\nThank You", "time": "07-20-2016 10:37 PM", "replies": []}, {"postID": "post5275125", "text": "R\nTry wiping system cache before doing a factory reset.", "time": "07-21-2016 04:09 AM", "replies": []}, {"postID": "post5275715", "text": "I've tried everything, wiped the cache, wiped the whole phone even on TWRP and reflashed a new ROM on it", "time": "07-21-2016 11:20 AM", "replies": []}, {"postID": "post5275718", "text": "I also thought it might be a Carrier issue, so I plugged my sim into my old OnePlus Two and the wifi hotspot worked fine whereby both the person accessing my wifi and my phone works", "time": "07-21-2016 11:21 AM", "replies": []}]}, {"title": "Help lock screen", "thread": [{"postID": "post5254715", "text": "Hi, just jumped from Nexus 6 to M8, loving it. 2 probs, how do I change the horrible lock screen, also, I do not connect to WiFi automatically, I have to go into settings to turn on WiFi again. Thanks, any help appreciated.\nPosted via the Android Central App", "time": "07-07-2016 05:05 AM", "replies": []}, {"postID": "post5261644", "text": "Sorted.\nPosted via the Android Central App", "time": "07-12-2016 10:57 AM", "replies": []}]}, {"title": "Where an I get a M8 in the UK,", "thread": [{"postID": "post5029962", "text": "I'm looking to buy a new M8 in the UK not Chinese version. Any ideas please? Compatable with o2. \nThank you.\nPosted via the Android Central App", "time": "03-03-2016 10:55 AM", "replies": []}, {"postID": "post5030480", "text": "You can buy my phone if you want, I live in the UK, I have had some issues with notifications, but a factory reset has sorted this. I fancy getting the S7 edge!\nPosted via the Android Central App", "time": "03-03-2016 02:36 PM", "replies": []}, {"postID": "post5256926", "text": "I ordered two from Wonda Mobile. First one came within a week but the second one was deleyed and took about three weeks. Both working well though and and have international OS.\nPosted via the Android Central App", "time": "07-08-2016 05:46 PM", "replies": []}]}, {"title": "Google Keyboard consumed 23 GB Wifi and 3.5 GB 3G Huh!!", "thread": [{"postID": "post5237848", "text": "Hi Folks, First time use Android Phone \"Mate 8\" My mobile Internet Package suddenly ended within week! i checked \"Traffic Use Ranking\" and discovered Google Keyboard consuming 1.7GB (3G) and 5.7GB (Wifi)\nTwo Question Please\n1. What this app is download or uploading !!\n2. I restricted Mobile data and background data and roaming data .. will this resolve my issue ? and if \"YES\" what limitation will happen after restricted internet to the app ?\nThanks", "time": "06-24-2016 07:44 AM", "replies": []}, {"postID": "post5237925", "text": "Welcome to the forums. Wow, that's a lot. I use the Google keyboard, a lot, and never seen such a high data usage. Have you been downloading new language packages or dictionaries for the keyboard? Even so, it's a lot. Can you see in your settings if the data is background or foreground? These are my stats, for a whole month.", "time": "06-24-2016 09:01 AM", "replies": []}, {"postID": "post5237949", "text": "Another thought. Maybe the sync process got stuck. I'm not sure if the settings are in the same place on the Mate 8, but they must be similar. Go to settings - language & input - Google keyboard - dictionary - make sure that 'sync learnt words' is off.", "time": "06-24-2016 09:14 AM", "replies": []}, {"postID": "post5238500", "text": "After i restrict the app from using data, mobile still downloading from website \"gstatic.com\" the only way i found to stop the mobile from downloading by disable google keyboard completely !\nDaily\nWeekly\nMonthly \nStorage details \nPersonal Dictionary\nLanguage & Input Settings", "time": "06-24-2016 03:47 PM", "replies": []}, {"postID": "post5238523", "text": "Thanks for registering! That's weird! You don't even have the Google keyboard set as default (or were those screenshots taken after you disabled it?). About the gstatic, as far as I know it's related to captive portals, like when you're connected to a hotel WiFi and such. No idea why it would use so much data. \nHave you already tried to force stop the Google keyboard, clear data and restart the phone? \nNot sure what else to suggest short of a factory reset. I'll check around with the Ambassadors team and see if they have any ideas.", "time": "06-24-2016 04:14 PM", "replies": []}, {"postID": "post5238539", "text": "I just visited gstactic.com and it's full of spam, it wanted to download all sorts of crap onto my phone. I recommend you do a factory reset as Javier mentioned above, it should solve your issue  also welcome to Android Central", "time": "06-24-2016 04:28 PM", "replies": []}, {"postID": "post5238603", "text": "Yes those screenshots after i disabled google keyboard. i did restart but didn't turn it on again.", "time": "06-24-2016 05:35 PM", "replies": []}]}, {"title": "Huawei Mate 8 dual sim battery, why is it draining so fast?", "thread": [{"postID": "post5183191", "text": "Huawei Mate 8 dual sim battery after the last update become fast loos with normal use\nbefore that it takes full day now less then 10 hours ??\nthank you", "time": "05-18-2016 05:52 AM", "replies": []}, {"postID": "post5186102", "text": "Welcome to Android Central! Charge up to 100%, then let it drain to 20-30% with normal usage, without charging in between. Then show us:\n1. The main Settings>Battery screen.\n2. The fullscreen battery graph screen (which shows Awake time and Cell Signal Strength).\n3. The Screen category (to see total Screen On time).\n4. The Cell Standby category, if present (to see Time Without Signal).http://forums.androidcentral.com/amb...d-central.html", "time": "05-19-2016 06:04 PM", "replies": []}]}, {"title": "Displaying the year of the date in the clock widget in Huawei mate 8", "thread": [{"postID": "post5151645", "text": "Currently, the year is not being displayed in the clock widget on the screen. How can you do customization of displaying the year of the date? for example I want to display it as follows : name of the day, day, month and the year. For example Fri 19 Feb 2016, using the following format : ddd dd MMM yyyy", "time": "04-28-2016 09:34 PM", "replies": []}, {"postID": "post5167640", "text": "Is there any way to display the year?\nplease help.", "time": "05-08-2016 09:42 PM", "replies": []}, {"postID": "post5179080", "text": "Not sure how to do that sorey\nPosted via the Android Central App", "time": "05-15-2016 07:10 PM", "replies": []}]}, {"title": "Science popularization: Is the black border on the phone screen unavoidable?", "thread": [{"postID": "post5091824", "text": "Science popularization: Is the black border on the phone screen unavoidable?\nToday I going to share some knowledge about the black border on the phone screen.\nHave you noticed that there is a \"black border\" between the phone screen and the frame? \nIn fact, this is not an issue particular to the cell phone. We can see \"black borders\" on the screens of other common digital products, such as tablets, PC and TV.\nWhat on earth is the black border? Is it necessary?\nAccording to Baidu.com, the black border is artificially designed, and its nomenclature is BM area. While being assembled, the screen of each phone has error and can't be absolutely aligned. If the screen frame is aligned with visible edges of BM area, bright borders will appear around the screen. Therefore, the primary function of the BM area is to prevent light leakage. Some phone screens show obvious light leakage due to the issue of screen assemble and the BM area cannot effectively conceal it.\nCan the black border on the phone screen be narrowed?\nThe width of the BM area is affected by three factors: The width of the LCD screen frame (a); the gap between the LCD screen and the front cover (b); and width of the dispensed adhesive between the panel and the front cover (c).\n1）\tFirst, the width of the LCD screen is determined by the component itself and the choice of the manufacturers. Currently, the width of the LCD screen of the mainstream manufacturers is between 1 and 1.4mm;\n2）\tThe gap between the LCD screen and the front cover is affected by assembly technology. The greater the technology, the closer the gap.\n3）\tThe width of the dispensed adhesive can't be narrowed infinitely. The best technology of the industry can make it as narrow as 0.4 to 0.5mm. Excessive narrowing the width of the dispensed adhesive may affect the reliability of the LCD components, and the adhesive of the lens may break off.\nThe black border is widely existing, and the width of the black border is generally above 1.7mm. To narrow or eliminate the black border is depends on the technological breakthroughs in components, assembly and adhesive. Many manufacturers (I will not reveal their names) have managed to narrow the border to the largest extent. This actually harms the interest of the consumers!\nSince the black border can't be narrowed, is there any method to visually conceal the black border?\nThe general practice of the industry is to paint the black border in the same color with the glass panel in order to hide the black border. When the screen is lit up, the screen seemingly has no black border. But when the screen is turned off, the physical border of the phone looks wider. Currently, iPhone 6s Plus is using this technology. Meanwhile, we have noticed that some manufacturers have adopted a different method--using curved glass to weaken the black border. \nLet’s use Huawei Mate 8 as an example, the actual width of its black border is 1.7mm, representing an advanced level in the industry. At the same time, it has adopted 2.5D drilled and cut float glass, which effectively narrows the width of the black border visually but will not affect the visual effect of the physical frame of the phone. \nHuawei is killing two birds with one stone!", "time": "03-29-2016 12:51 AM", "replies": []}, {"postID": "post5091975", "text": "Why does this make me feel like you work for or with Huawei? Do you?", "time": "03-29-2016 04:07 AM", "replies": []}, {"postID": "post5093885", "text": "Not because I post a lot about Huawei, i already work for them. I'm just an advocate.", "time": "03-30-2016 01:17 AM", "replies": [{"postID": "post5097706", "text": "That should be disclosed because this post basically sounds like spam.", "time": "03-31-2016 09:26 PM", "replies": []}]}, {"postID": "post5107817", "text": "Cool to know why, you can already and the border by getting a black fronted phone \nPosted via the one and only Honor 5x", "time": "04-06-2016 07:15 AM", "replies": []}]}, {"title": "Future update to include 4k recording, is this possible?", "thread": [{"postID": "post5092533", "text": "Hi Guys,\nDoes the HiSilicon Kirin 950 chipset support 4k recording? If it does, would it be possible that the future firmware update to include 4k recording feature in this Mate 8?", "time": "03-29-2016 10:49 AM", "replies": []}]}]
[{"title": "Is it worth getting the 4GB Ram model over the 3?", "thread": [{"postID": "post4986204", "text": "Besides the internal storage increase, would you notice any difference ?\nPosted via the Android Central App", "time": "02-07-2016 05:15 AM", "replies": [{"postID": "post5088318", "text": "If you are a heavy user, I am sure you will when e.g. playing games, running multiple heavy apps like Facebook, Chrome, Microsoft Excel etc...\nIf I were getting this phone, I'd go straight to the 4GB RAM variant, why get the 3GB RAM one when the 4GB is not that much more costly, and you get more internal mem and a phone that is more 'futureproof'. Just my 2c.", "time": "03-27-2016 09:49 AM", "replies": []}]}, {"postID": "post4986234", "text": "I do not have the phone but you will not notice any difference at all. I have a phone with 3GB of RAM and one more RAM not going to do any difference.", "time": "02-07-2016 05:59 AM", "replies": []}, {"postID": "post4986766", "text": "More RAM will not make any difference in speed, but will eliminate more screen refreshes with multiple apps open. More RAM is never a bad thing. \nGC\nPosted via the Android Central App", "time": "02-07-2016 01:34 PM", "replies": []}, {"postID": "post5006953", "text": "I cant notice any difference from my old galaxy s6 edge+ with 4gb ram and my mate 8 with 3gb ram.\nYou get what you give. Dont forget to live.", "time": "02-21-2016 11:47 AM", "replies": []}, {"postID": "post5006957", "text": "I notice no difference between my old galaxy s6 edge+ with 4gb ram and my new mate 8 with 3gb ram. Nothing at all.\nYou get what you give. Dont forget to live.", "time": "02-21-2016 11:49 AM", "replies": []}]}, {"title": "Sexy!", "thread": [{"postID": "post4893417", "text": "Wow this device is insane\nPosted via the Android Central App", "time": "12-14-2015 07:14 PM", "replies": []}, {"postID": "post4894143", "text": "Details! We wanna hear details! What do you like about it? Any reservations so far?", "time": "12-15-2015 01:07 AM", "replies": []}, {"postID": "post4918246", "text": "Beautiful device!", "time": "12-27-2015 03:46 PM", "replies": []}, {"postID": "post4918253", "text": "This device intrigues me. Love the specs. And the pictures of it look great. Looks too good to be true.", "time": "12-27-2015 03:50 PM", "replies": []}, {"postID": "post4948443", "text": "To be honest, I don't really see that much difference between mate 7 and mate 8. Yeah, there are some things, like the 2.5D display and bla bla, but I have the 7 gold version, and it's just wonderful. I use to have the 2gb and I switched to 3gb , and everything seems better. Way more premium! Maybe 9 will be an 100% real update. \nWhat I didn't like about the 8, is that they made the battery capacity smaller.. From 4100 to 4000. \nDo you own the phone? Anyone who had the 7 before and now have the 8 , so he/she can compare?\nPosted via the Android Central App", "time": "01-13-2016 09:05 PM", "replies": []}, {"postID": "post5085423", "text": "Late response but this phones is awsome\nPosted via the Android Central App", "time": "03-25-2016 02:11 PM", "replies": []}]}, {"title": "Notifications", "thread": [{"postID": "post5020515", "text": "I'm surprised no one has brought this up yet. \nI find notifications (especially email) to be a bit hit and miss. I have googled this to death and made all the recommended changes to permissions, wifi settings etc, and it still can't rely on them. \nIs anyone else having issues and come up with a permanent solution, apart from rooting ?\nPosted via the Android Central App", "time": "02-28-2016 03:29 AM", "replies": []}, {"postID": "post5020945", "text": "I get the notifications on the phone fine after setting each app I want to my notifications from to 'protected' in the battery manager settings. The problem I have is getting the notifications reliably on my Moto 360 watch. Sometimes the notifications arrive fine, other times they are delayed by many minutes, and other times they never show up. It's frustrating and makes the watch pretty much unusable with this phone.", "time": "02-28-2016 10:14 AM", "replies": []}, {"postID": "post5021042", "text": "What model of the mate 8 you have?", "time": "02-28-2016 11:21 AM", "replies": []}, {"postID": "post5026563", "text": "I have the international version.", "time": "03-01-2016 10:10 PM", "replies": []}, {"postID": "post5028115", "text": "This could be a deal breaker for me, what's the point of having a phone where the notifications don't work property, seriously thinking of ditching this phone. Apart from the notifications not working properly , I can't get battery monitor wiget app to work when the screen is off, and even GSam battery monitor doesn't work all of the time, even though in both cases permissions are correctly set!", "time": "03-02-2016 02:45 PM", "replies": []}, {"postID": "post5030498", "text": "Factor reset has sorted my issues 😁\nPosted via the Android Central App", "time": "03-03-2016 02:44 PM", "replies": []}, {"postID": "post5080650", "text": "In case anyone is having the same issues I was with using an Android wear watch with the Mate 8 and missing notifications on the watch, I found an unlikely solution. Install the \"Feel the Wear\" app from the Google play store. Everything works perfectly for me after that. For the record, my watch is a 2nd Gen Moto 360.", "time": "03-23-2016 01:42 PM", "replies": []}]}, {"title": "What model to buy for the UK?", "thread": [{"postID": "post4986867", "text": "I'm considering buying this phone and I want the 4GB model. I've been looking at the at the EGlobal UK website Advanced search :: Search results - eGlobal Central UK - Online Shopping Store with Low Price on All Latest and Branded Consumer Electronics and Gagdets\nI'm not sure which one to buy, some are NXT-AL10's, others do not have model number, anyone from the UK bought one these?", "time": "02-07-2016 03:08 PM", "replies": []}, {"postID": "post4991798", "text": "Ok found it, have ordered NXT-L29 gold 64 gb 😂", "time": "02-10-2016 05:34 PM", "replies": []}, {"postID": "post4992840", "text": "In theory, all the models have the LTE bands for the UK only question I've seen revolve around whether there is English as an option on the phone unless you speak mandarin?", "time": "02-11-2016 12:13 PM", "replies": []}, {"postID": "post4993982", "text": "Exactly, just wanted to make sure I got the international one with the playstore installed. Should receive it Wednesday next week 👍\nPosted via the Android Central App", "time": "02-12-2016 09:25 AM", "replies": [{"postID": "post5046234", "text": "Let us know how you get on, I'm wanting to go from nexus 6 to M8.\nPosted via the Android Central App", "time": "03-09-2016 01:55 PM", "replies": []}]}]}, {"title": "Where can I buy a Mate 8 from?", "thread": [{"postID": "post4883418", "text": "I can't find any on ebay or on any online stores?\nI am in Brisbane, Australia.", "time": "12-09-2015 05:24 PM", "replies": []}, {"postID": "post4889184", "text": "I think it's available in China market only right now. Maybe search alibaba somehow? Good luck", "time": "12-12-2015 05:17 PM", "replies": []}, {"postID": "post4898106", "text": "Buy Huawei Mate8 at best price in honormi shop - HONORMI--Top Brand Mobile International Shop\nor Ali Express\nThere are some on ebay already, but the markup is definitely high. I'm hoping that, if the markup stays the same (after the International announcement at CES), that I can ask my relatives to purchase for me, directly from the Huawei Store in the Philippines. I'm planning on purchasing, for my transition to T-Mobile (from Sprint). Only thing that has made me hesitate is wanting to try out T-Mobile's LTE range extending device, prior to making the jump.", "time": "12-16-2015 02:02 PM", "replies": []}, {"postID": "post4943119", "text": "Is honormi.com legit. I can't find any reviews anywhere.", "time": "01-10-2016 09:59 PM", "replies": []}, {"postID": "post5017050", "text": "guys be careful, don't buy a phone from China, i had one , it is a nightmare, because overtime you like to dial a number the phone hooks up with China Yellow pages and give you suggestions and and and , i now bought one on my way back ( quick stop in Dubai ) in the mall, perfect , because the 4RAM and 64GByte is not available in Switzerland or Germany ....yes the China version has been with 128GByte but , you can't have everything in life . \nand the fact that you place a 200GByte SD Card in the phone makes is perfect.", "time": "02-26-2016 12:57 AM", "replies": []}]}, {"title": "Does the 1080p screen resolution affect your decision?", "thread": [{"postID": "post4958499", "text": "Given that the Huawei 6p is $500, and the Mate 8 is roughly $650, it is interesting that Huawei decided not to go with a QHD screen like on the 6p,given that the Mate 8 is more expensive than the 6p.\nThe reviews I have read of the Mate 8 also indicated that the display was just ok.", "time": "01-20-2016 11:48 AM", "replies": []}, {"postID": "post4958568", "text": "I wouldn't really have that much of an issue with it. Looking at the specs, it still has a 367 ppi screen density... that is, by no means, bad. Provided the screen's other characteristics are good, then the lower resolution shouldn't really affect one's experience all that much. Sure, it might not look so nice if you bust out your Google Cardboard all the time, but for most everything else...", "time": "01-20-2016 12:25 PM", "replies": []}, {"postID": "post4979574", "text": "Unfortunately yes it does I'd prefer QHD....", "time": "02-03-2016 04:59 AM", "replies": []}, {"postID": "post5002537", "text": "I have to disagree, coming from the note 5,I'm very impressed with the mate 8 😂\nPosted via the Android Central App", "time": "02-18-2016 11:54 AM", "replies": []}, {"postID": "post5008464", "text": "It affected mine, in a positive way. qhd is useless on a phone, imo. The screen on my mate 8 is great, no complains here.", "time": "02-22-2016 03:04 AM", "replies": []}]}, {"title": "Android Central Huawei Mate 8 Review", "thread": [{"postID": "post4958416", "text": "Huawei Mate 8 review | Android Central\nHardware and performance are getting a general thumbs up with software still needing a total back to basic approach. The battery in this thing is ridiculously huge. Anyone considering this device?", "time": "01-20-2016 10:50 AM", "replies": []}, {"postID": "post4985443", "text": "I am, but I'm waiting to see what the S7 and LG G5 bring before I take the plunge!", "time": "02-06-2016 01:25 PM", "replies": []}, {"postID": "post4994940", "text": "Can't be bothered waiting, ordered from Wonda Mobile ☺\nPosted via the Android Central App", "time": "02-13-2016 03:03 AM", "replies": []}, {"postID": "post4999943", "text": "I have one and absolutely love it! Battery is my top priority in a device then the camera. Both are absolutely wonderful!", "time": "02-16-2016 07:17 PM", "replies": []}, {"postID": "post5002530", "text": "How many charge cycles did it take to get the battery life up to optimum, I'm on my first, and it's not that good 😮😕\nPosted via the Android Central App", "time": "02-18-2016 11:52 AM", "replies": []}, {"postID": "post5004891", "text": "I'd say 3 or 4 and you're good. Use the battery manager also.", "time": "02-19-2016 08:57 PM", "replies": []}, {"postID": "post5005170", "text": "Cheers for that 👍\nPosted via the Android Central App", "time": "02-20-2016 03:58 AM", "replies": []}]}, {"title": "Will it be available in the USA in the future?", "thread": [{"postID": "post4958473", "text": "Just wondering if it would be available in the USA in the future? I couldn't find a definitive answer only that it isn't available now. I ask because specs indicate usa lte support.", "time": "01-20-2016 11:31 AM", "replies": [{"postID": "post5001262", "text": "To be able to sell it here Kirin 950 would have to be approved for sale in the U.S. (And the LTE bands work just fine. lol)", "time": "02-17-2016 03:45 PM", "replies": [{"postID": "post5001429", "text": "True, but the only thing legally required would be for them to get it through the fcc...", "time": "02-17-2016 05:40 PM", "replies": []}]}]}, {"postID": "post5001607", "text": "I ordered one earlier today from Amazon. Came out to $643.50 for the 32GB with 3GB RAM option in dark grey. I guess that's the only way of obtaining one here in the U.S. and since it plays nicely with AT&T LTE, I figured why not? Come to think of it, maybe I should have waited for MWC. Maybe they'll announce a version there for USA? Anyway, if you feel like getting one I say do it! That 6 inch screen looks awesome!", "time": "02-17-2016 08:20 PM", "replies": []}]}, {"title": "Camera", "thread": [{"postID": "post4989228", "text": "Is it really as bad as all the reviews say it is?\nPosted via the Android Central App", "time": "02-09-2016 06:47 AM", "replies": []}, {"postID": "post4999946", "text": "Only if you want to shoot 4k video. Otherwise it great!", "time": "02-16-2016 07:18 PM", "replies": []}, {"postID": "post5000807", "text": "Hope you are right, phone is coming today 😂\nPosted via the Android Central App", "time": "02-17-2016 10:37 AM", "replies": []}]}, {"title": "Does the lack of 4k video shooting affect your decision to get this phone?", "thread": [{"postID": "post4958506", "text": "Just curious if the lack of 4k video shooting affects anyone's interest in buying the phone? It seems a bit odd for a high end device, given that my note 3 supported it.", "time": "01-20-2016 11:53 AM", "replies": []}, {"postID": "post4958531", "text": "Since I have nothing that would display 4k video (the human eye can't see the difference between HD and 4k on a 12\" screen) no. If I had a 4k TV larger than 65\", it might, but that's the minimum it would take to see the difference, unless you're looking at individual pixels, not the entire picture. They're making the cameras better than they have to be, just as a selling point. If we see an 8k video in the future, we'll be looking at waterless water.", "time": "01-20-2016 12:08 PM", "replies": []}, {"postID": "post4958546", "text": "Nah.... I don't have much of a use for 4K at the moment. The things take up way too much space and there's nothing I have that would even be able to display it. Yes, I know you can oversample it back to 1080 and have a (slightly) higher quality video, but again, I don't have an issue with the quality of native 1080 videos.", "time": "01-20-2016 12:16 PM", "replies": []}, {"postID": "post4985444", "text": "I have had several phones with 4k video recording but I mostly use 1080p at 60fps, so no, it doesn't put me off.", "time": "02-06-2016 01:27 PM", "replies": []}]}, {"title": "Why can't I activate my Huawei Mate 8?", "thread": [{"postID": "post4960539", "text": "Got BNIB and opened it up. Popped in VZW SIM and it won't activate. I recieved an error indicating \"This phone is compatiable with China Telecom cards only. Please install a China Telecom Card.\nUgh, please Help!!", "time": "01-21-2016 03:54 PM", "replies": [{"postID": "post4965709", "text": "Welcome to Android Central!\nThe Mate 8 does not support Verizon CDMA. It does not have CDMA radios, its only for GSM carriers like AT&T and T-Mobile.", "time": "01-25-2016 08:03 AM", "replies": []}]}]}, {"title": "Can't activate Brand New Huawei Mate 8, can I get some help?", "thread": [{"postID": "post4960535", "text": "Got BNIB and opened it up. Popped in VZW SIM and it won't activate. I recieved an error indicating \"This phone is compatiable with China Telecom cards only. Please install a China Telecom Card.\nUgh, please Help!!", "time": "01-21-2016 03:52 PM", "replies": []}, {"postID": "post4960551", "text": "Your phone is sim locked as you have discovered. It can be sim unlocked. There are many on line companies offering this service for a fee. Search with Google. Once unlocked you can use any provider's sim", "time": "01-21-2016 04:02 PM", "replies": []}, {"postID": "post4960570", "text": "Also this doesn't have lte band 13 (Verizon primary lte) and cdma. So even if it worked, it would be extremely limited on Verizon.", "time": "01-21-2016 04:13 PM", "replies": []}, {"postID": "post4960619", "text": "Thanks I'll check around. I also contacted Huawei.", "time": "01-21-2016 04:52 PM", "replies": []}]}, {"title": "Sensible Screen Resolution", "thread": [{"postID": "post4958649", "text": "Many of us are used to 1440p displays on recent devices, but can't help wondering how those devices would perform if they'd been given 1080p instead. A touch more zip, a longer battery life? 1080p on a 6\" display looks fine....think Lumia 1520, Galaxy Note 3. This feature on the Mate 8 is not necessarily a step backwards.", "time": "01-20-2016 01:18 PM", "replies": [{"postID": "post4959033", "text": "Note 3 and lumia 1520 were both 2013 devices. An efficient QHD panel such as the one in the note 5, won't use much more battery than a fHD display.", "time": "01-20-2016 05:42 PM", "replies": []}]}, {"postID": "post4958687", "text": "I...don't know how I feel about this haha. I've seen phones with 1080p displays side by side the denser ones (same screen size) and back when I had the 1080p screen I couldn't tell, but now that you put them side by side... you do notice it! Or at least, I do. Things just look better and up close (something I must absolutely do when I'm not wearing my glasses at night since everything 6 inches away from me is a complete blur... yes, I'm almost blind haha  ) you DEFINITELY see the difference. \nBut I agree, a 1080p screen isn't that bad, and it would help tremendously with battery life and performance.", "time": "01-20-2016 01:44 PM", "replies": []}, {"postID": "post4958698", "text": "a 1080p screen is best because help batter life", "time": "01-20-2016 01:47 PM", "replies": []}, {"postID": "post4960253", "text": "But take the same QHD tech and put less pixels in it... and it should, in theory, improve battery consumption from the display. As to how significant that difference is, I don't know.", "time": "01-21-2016 12:42 PM", "replies": []}, {"postID": "post4960316", "text": "I think it depends on the user too. SpookDroid notices the difference. I can't see any difference on a 55\" LCD TV screen at normal viewing distance between HD video and 4k video unless I get close enough to see individual pixels - and with plastic implants in my eyes, II have near-perfect vision. There's nothing I can't read on my Note 3 - maybe if someone comes out with an app with a 1 pt. font I'll have a problem, but that's difficult on paper too.\nAs for the battery, it also depends on the screen technology. An Amoled screen's power drain is mostly influenced by color - if it's displaying black, even an 8k screen will be drawing nothing. But if it's all white, a 4k screen with more pixels will be drawing a LOT more current than an HD screen. Straight LED screens will draw a little more for more pixels, but not enough to save more than a few minutes of battery by making it a 1080 screen.\nThe big advance is going to be in batteries. Once the automotive industry solves their problem (you don't see many cars with lithium batteries - they fail too often and are too expensive to replace), the cellphone battery industry can use the same chemistry or physics (whatever is developed) to give us 10,000 mAh batteries in the same size as the current 3,000 mAh ones, and for not much more money. Then we'll stop worrying about another 10 minutes of SoT.", "time": "01-21-2016 01:18 PM", "replies": [{"postID": "post4960578", "text": "Yup, that needs to be solved first. In higher capacities, these things tend to catch fire haha. Tesla and every Chinese Hoverboard manufacturer can attest to that!", "time": "01-21-2016 04:18 PM", "replies": []}]}]}, {"title": "Mate 8 Specs", "thread": [{"postID": "post4959338", "text": "They don't look too bad. The 4,000 battery is quite nice!Huawei Mate 8 specs | Android Central", "time": "01-20-2016 09:49 PM", "replies": []}]}, {"title": "Huawei Mate 8 Hand on and review", "thread": [{"postID": "post4959332", "text": "From the blog, we have the hands on and review of the Mate 8.\nThe hands on: Hands-on with the Huawei Mate 8 | Android Central\nAnd the review: Huawei Mate 8 review | Android Central", "time": "01-20-2016 09:47 PM", "replies": []}]}, {"title": "November launch", "thread": [{"postID": "post4861455", "text": "Huawei Mate 8 was set to launch on the 26th. From the blog: Huawei Mate 8 now poised for official launch on November 26 | Android Central\nAnyone thinking of getting one?", "time": "11-28-2015 09:09 AM", "replies": []}, {"postID": "post4862270", "text": "Shouldn't they just call it the M8? Oh wait, I guess HTC wouldn't like that ...", "time": "11-28-2015 05:23 PM", "replies": []}]}]
