[{"title": "Alcatel-Lucent u5", "thread": [{"postID": "post6029659", "text": "Can anyone tell me what this phone is like\nPosted via Android Central App", "time": "10-20-2017 03:54 PM", "replies": []}, {"postID": "post6182647", "text": "Based on a review from a computer magazine:\n-slow CPU\n-crappy camera\n-subpar TFT LCD display\n- small RAM amount causes slowdowns like crazy\n_------------------------------------_\nSpecs:\nMT6737M (4x Cortex A53 1.1GHz)\n1GB RAM\n854x480 5\" TFT LCD\n8GB Storage\n2050mAh battery\n5mpx main cam, 2mpx selfie cam\n_________________________\nOnly get this if you can't afford anything better.", "time": "03-08-2018 01:11 AM", "replies": []}]}, {"title": "Ads by Twitter - but I have an Alcatel, no boot to safe mode", "thread": [{"postID": "post6164385", "text": "Hey team, I tried to research before I posted this. I am trying to hang on to my Alcatel Idol4s until the new CAT phone comes out this year. \nMy file manager has ads. OK, I can deal with that. My photos constantly want me to use Candy...annoying but I can't delete it. \nI constantly get Adsbytwitter that pop up. I saw a post with the fix but it said boot to safe mode. Alcatel does not have safe mode as an option. \nI want to get rid of this phone but need more time. \nCan't post a pick but the support says it is @twitteradshelp but the website for support is https://t.co/LzKAEaA1Vq", "time": "02-16-2018 01:46 PM", "replies": []}, {"postID": "post6164394", "text": "Welcome to Android Central! Just to be sure -- this doesn't get you into Safe Mode? How to turn on safe mode on Alcatel Idol 4s", "time": "02-16-2018 01:52 PM", "replies": []}, {"postID": "post6177142", "text": "OK thanks. Got to safe mode. Now to find the culprit.", "time": "03-02-2018 03:26 PM", "replies": []}]}, {"title": "What does it mean when a Alcatel One-Touch Evolve has a White LED light when i charge it", "thread": [{"postID": "post6171838", "text": "So a few days ago i went to the best buy bin and i found this Alcatel One-Touch Evolve and it had no sim card or a back cover but it did have the battery. And when i brought it home the battery kept on falling out. and yes it is the RIGHT battery. so i tried to tape the battery inside the phone, but it wont turn on. and i do have 2 other sim cards if needed. and when i try to charge the phone a white LED light comes on at the top and i dont know what that means... and i dont know if its Water damaged or if the battery is bad. please get a hold of me ASAP!! i really want this phone to work. Thanks!!!", "time": "02-25-2018 12:43 PM", "replies": []}, {"postID": "post6172133", "text": "Welcome to Android Central! In case the phone needs the back cover to be intact, you could buy a replacement cover for about $10: http://forums.androidcentral.com/e?l...token=TAWIndqd.\nReplacement batteries are also cheap (about $10): https://www.amazon.com/Alcatel-Batte...cUvbUpU6172133. It's hard to know if your battery is actually dead, so it's worth a try.\nUnfortunately, there's no way to tell if the phone has water damage (unless perhaps if you open the whole thing up).", "time": "02-25-2018 06:22 PM", "replies": []}, {"postID": "post6172782", "text": "Ok, but when i put on the back cover on the phone does the battery still need to be taped up? and can i tape a old cover from a old phone onto the alcatel??", "time": "02-26-2018 11:48 AM", "replies": []}, {"postID": "post6172869", "text": "My guess is that the battery doesn't have to be taped in place with the back cover on -- but you won't know until you try. Since every phone is different, you really need the back cover designed for that phone in order for it to fit properly.", "time": "02-26-2018 01:19 PM", "replies": []}, {"postID": "post6173733", "text": "ok great thanks for the tip", "time": "02-27-2018 09:05 AM", "replies": []}]}, {"title": "How to root alcatel onetouch pixi 3 10 3G tablet android version 5.1 help?", "thread": [{"postID": "post6172370", "text": "I have tried every single rooting apps but all failed and also I tried many guides from Internet too but still failed please help", "time": "02-25-2018 10:46 PM", "replies": []}]}, {"title": "My phone keeps shutting off when I plug it in?", "thread": [{"postID": "post6153601", "text": "Hello, this is my first time posting here. I've been looking on other forums and people have similar issues but I haven't been able to find an answer to my problem.\nI own an Alcatel Onetouch Idol 3 5.5, I've had it for 2 years now. My phone has been absolutely fine, until a system update that happened around 2-3 weeks ago. Not only did I get tons of bloatware installed on my phone that was uninstallable, but I also began getting this issue with the charging.\nWhen I plug in my phone it suddenly shuts off. When this first started, I was able to turn it on again and it would charge normally. When it began to get worse, I did a whole reset of my system to see if that would fix anything. It did for a few days, but then went back to the same issue. \nI looked up online and found that people said to use the default charging cable. I was not using the default cable since it couldn't clip into the phone anymore and would slide out.\nUsing the original cable again, it seemed to be going fine for about a day, I could plug it in and it would charge normally, but then the issues began happening again on just a random charge. I also tried with another cable, it did the same exact thing.\nNot only does it turn off when it's charged, but when I turn it on after it shuts off, it says the phone has 0% battery, but doesn't have a low battery warning. When I try to plug it in, it won't say it's charging, and it doesn't shut off. My phone works normally in this mode, but if it actually reaches real 0% then it abruptly shuts off rather than warning me or doing the shut off animation. \nThe only way to see my actual battery is to let it charge when it's completely off. The phone runs normally when it's turned on, and the battery doesn't drain incredibly fast or anything. But plugging it in once it's low will cause the phone to shut off again.\nI was wondering if this is a problem with my battery and if I should replace it? Or is this something else?", "time": "02-03-2018 02:59 PM", "replies": []}]}, {"title": "Alcatel owners, are your Gallery and other apps being replaced by sketchy versions?", "thread": [{"postID": "post6149425", "text": "I've been seeing this in the news today, which is mind-bogglingly awful -- are all Alcatel owners affected?https://androidcommunity.com/alcatel...ampaign=buffer", "time": "01-30-2018 02:48 AM", "replies": []}, {"postID": "post6149427", "text": "Blatant and overt invasion of privacy...", "time": "01-30-2018 02:50 AM", "replies": []}, {"postID": "post6149429", "text": "For Alcatel's sake, I hope this is because someone stole the app keys, and not because Alcatel thought it'd be a good idea to foist awful and invasive apps on its customers -- especially core apps. But none of the possibilities instill any kind of confidence.", "time": "01-30-2018 02:54 AM", "replies": []}]}, {"title": "Why don't my phone read micro SD card?", "thread": [{"postID": "post5840169", "text": "I have a Alcatal one touch the storage is full i purchased a new micro SD card and when I mount it tells me to format card and it still can't be read.", "time": "06-05-2017 09:54 PM", "replies": []}, {"postID": "post5840905", "text": "Welcome to Android Central! The SD card could be corrupt, defective, or counterfeit. Can your computer read it?", "time": "06-06-2017 01:05 PM", "replies": []}, {"postID": "post5846361", "text": "I had that same problem had to format it using my laptop then it works fine.", "time": "06-10-2017 07:21 PM", "replies": []}, {"postID": "post6140787", "text": "My Alcatwel Also does not save anything. I thought that these AD cards came formated when pyrchased new. There was no mention in or on the packaging to format.\nI guess it will not hurt to format it and try again as it is not working now without formatting it! \nThanks for the suggestion!", "time": "01-19-2018 07:03 PM", "replies": []}]}, {"title": "i recently installed a system update & think i have a bug. How can i fix this?", "thread": [{"postID": "post6140350", "text": "i recently installed a system update, the notification bar home and recent button will not work. Another glitch play store continuously says download pending, and no download. I do not have a laptop/desktop, my phone is my only resource. Ive asked around for help, this seems to be my best option. Is more information needed, im new to android central, i apologize, please help.", "time": "01-19-2018 09:48 AM", "replies": []}, {"postID": "post6140529", "text": "If your carrier does phone repairs, and the update came in over the air, bring it to them and ask if they can please reflash only the update (not the whole ROM unless you like backing up and restoring files).\nIf you manually installed the update, just install it again.\nIf it's the update itself that has the bug, there's nothing you can do but wait for the next update - the one that fixes the bugs. Until than you could back everything up (which you should have done already - if the phone falls into a lake, gets run over or gets stolen, you lose your data if you don't have it somewhere) then flash the older version of the ROM. (Since you didn't tell us which phone you have, no one can guess which method you use - each manufacturer has its own.) You'd have to have at least a laptop, but you can borrow one for 10 minutes or so - you won't be making any permanent changes to it.\nIf none of those work for you, you're stuck until the next update.", "time": "01-19-2018 01:17 PM", "replies": []}, {"postID": "post6140696", "text": "i apologize, its an alcatel fierce 4.", "time": "01-19-2018 04:45 PM", "replies": []}, {"postID": "post6140709", "text": "i am assuming it is when i installed the update, not sure. all i know is the issue im having, which is home recent buttons not working notification bar not pulling down. \nty", "time": "01-19-2018 04:54 PM", "replies": []}]}, {"title": "How do I Verify a Gmail account?", "thread": [{"postID": "post6139248", "text": "I just activated a Tracfone Alcatel Pop Icon LTE 2 w/ 1200 M/T/D and 365 days service. I did the SETUP immediately after I was told it was activated. When I set up the google account on this phone it was fine. I received a SMS from Tracfone with the phone number and confirmation of activation. The Phone # in the Settings>About Phone the phone Number matches what was given to me in the SMS. I did notice that there is an MID number in the About Phone that is 10 digits. The first 6 numbers are the same as the phone number I received from TracFone and in About Phone.\nI cannot find the thread that I read on this site and forums but something about the MID being related to the network the the phone is assigned to, which is Verizon. Half of the members mentioned that their phone numbers had changed. Others said it matched that MID. Anyways, after setting up the GMail account in the setup wizard I did check some settings and looked around on the phone and had no problems.\nAfter a reboot on the phone I received a message pop up from google saying that my phone number had changed from when i did the setup wizard. It said I now have to Verify the GMail Account to sign in. Never had to verify a gmail account before. What do I have to do...other than Reset the phone. I never did that before either. Will resetting the phone keep my new Phone number and activation with the minutes and Airtime that came bubdled with the phone? What do I have to verify and how? I used another Gmail account as a back up for this new GMail Account! \nI do not even know where that popup message is now as it had a link to send a code to my backup email. It also mentioned that I will have to reset my password. I really hate Google. They do not have support and their Help instructions are poor at best!\nAs you can surmise I am totally new to Android and Smartphones . I also only used one gmail account as a back up to my MS Office's Outlook.\nAlso, I just checked my backup gmail account to see if there is any problem with that. I could sign in but there was a security message in my In box regarding doing a security check as there was one security issue. I hope nothing is wrong on that account\nI did remember that I did not send the Verify Code link to my back up email account and it did say that the code was only good for 10 days. What did i get into?\ni have to find that link so i can get the code and reset the password on the new account within 10 days or I'll be locked out forever. It takes me that long to learn all this stuff between work and home functions. PLEASE HELP!\nAny and All help would be greatly appreciated!\nThanks in advance!", "time": "01-18-2018 02:57 AM", "replies": [{"postID": "post6140546", "text": "See https://en.wikipedia.org/wiki/Mobile...ication_number for more information, if you're interested.Just so we're noth speaking the same language, \"reboot\" ,eams turning the phone off, then turning it on, or restarting it.Don't reset the phone! You'll lose any pictures, music, personal information you've entered, etc.Yes, but that's about all it will keep - and you'll still have to verify your Google account.Assuming this isn't another Google glitch (a few weeks ago I kept getting verification requests for a couple of accounts no matter how many times I verified them), just go to your Google account in a web browser (on the phone, a computer - anywhere) and log in - address and password.Okay, but make sure you type in the Google address by hand, Following a link to a site that looks exactly like a Google site - but isn't - is phishing - and someone will get your Google password. Look in email to see if there's an email in the backup account. (BTW, there should be only one Google account on the phone. You can have as many email accounts as you like. Even if the addresses are the same, a Google account and an email account are different to the phone.)I get that way sometimes too.Well ... they do - on a website. Which usually has the wrong answers. None at all would be better.For you too? I thought it was only because I've only been in the computer business for 45 years, so maybe I still had a lot to learn (removing tongue from cheek now). I can get through them, but sometimes it's a waste of time anyway. As I said, I got mail-bombed a while back with verification requests.It's not you - trust me.No, that was you connecting witgh a new device (your new phone number).Go to https://myaccount.google.com/securit...p-verification Google will send your phone a verification code. Use it. Done.", "time": "01-19-2018 01:36 PM", "replies": []}]}]}, {"title": "My question used com.android.contacts, com.android. dialer, com.android.mms, ect?", "thread": [{"postID": "post6137456", "text": "Would these things show up in, My Activities, if you didn't use them, or could anybody else from a phone make this happen? I believe I know the answer to this question, but my gf keeps insisting she is not using these things even when I show. Plus would this stuff show up under, my activities, if she was using hidden apps or something I couldn't find? Thank you for any help or advice on this matter", "time": "01-15-2018 10:47 PM", "replies": []}, {"postID": "post6138004", "text": "Could they show up? Yes. Android itself runs apps because it needs their processes for another app that's running. (Which is why \"RAM cleaners\" don't actually work, which you can prove by using an app that allows you to manually \"remove\" apps from RAM).", "time": "01-16-2018 01:51 PM", "replies": []}]}, {"title": "alcatel idol 4 screen mirror without Wi-Fi", "thread": [{"postID": "post5518519", "text": "So I just got an idol 4 the other day from cricket and have been trying to figure out a way to cast the screen to my TV without a wifi signal. I would like to use this in my camper or in my fish House while using my LTE network only I have tried a few different options with no luck I've seen in other threads. wondering if anyone has the phone and has figured out a solution as mhl is not supported. Miracast on it requires a wifi signal to pick up anything I tried the fire stick method but again Miracast on the phone requires wifi. I've been researching other means and can't seem to find much would really appreciate some insight on this issue so I can watch Netflix and other streaming services.", "time": "10-24-2016 04:34 AM", "replies": []}, {"postID": "post5518610", "text": "Welcome to Android Central! Give the Microsoft Wireless Display Adapter a try. Follow these steps to cast the screen: https://support.google.com/nexus/answer/2865484?hl=en", "time": "10-24-2016 06:14 AM", "replies": [{"postID": "post6118554", "text": "I've now tried this adapter sans wifi with two different phones (Note8 and Nokia 8), it does not work. See complaints for the accompanying app in the Windows Store. \n3 weeks of online searches and I still can't mirror my phone's screen to a TV without wifi...", "time": "12-26-2017 02:17 PM", "replies": []}]}, {"postID": "post6119934", "text": "Oh, I'm sorry to hear that. Good luck with your ongoing search!", "time": "12-27-2017 11:00 PM", "replies": []}]}, {"title": "Screen overlay detected Alcatel Fierce 4", "thread": [{"postID": "post6047995", "text": "I couldn't find any answers so I decided to try uninstalling some apps that I really don't use anymore... After I did that, the message \"Screen overlay detected\" message stopped popping up.", "time": "10-31-2017 09:01 PM", "replies": []}, {"postID": "post6048993", "text": "See if this helps: https://www.howtogeek.com/271519/how...or-on-android/", "time": "11-01-2017 02:33 PM", "replies": []}]}, {"title": "One Touch Pixi 3 4.5 3G 4027A - Max memory card size?", "thread": [{"postID": "post5594730", "text": "Hello there,\nDoes anyone knows what would be the biggest memory card that I can put in this phone?\nThank you", "time": "12-05-2016 09:38 PM", "replies": []}, {"postID": "post6036268", "text": "8 gig anything higher phone will freeze", "time": "10-24-2017 01:28 PM", "replies": []}]}, {"title": "LED Notifications off after factory reset for Alcatel pixi 4(5)", "thread": [{"postID": "post5982473", "text": "I have an Alcatel Pixi 4(5) and after a factory reset the led blinking notifications stopped (for calls, texts, emails, etc.). I tried to enable them from the menu, but the option is not present in the \"sound and notifications\". The only available notifications are for the low battery and the battery charging.\nAny help how to have them back on?\nCheers.", "time": "09-19-2017 04:23 AM", "replies": []}, {"postID": "post5983350", "text": "Welcome to Android Central! Is it under Settings>Device>Notification Light? If not, how about Settings>Accessibility?\nIs there a search function in the Settings menu? If so, search for \"notification light\" or \"notification led.\"", "time": "09-19-2017 03:48 PM", "replies": []}, {"postID": "post5984184", "text": "Hi B. Diddy\nthere is not in any of these two places. Searching for notification light, takes me to the \"sound and notifications\" section of the menu, where there is no such option.", "time": "09-20-2017 04:04 AM", "replies": []}, {"postID": "post5984651", "text": "What if you search for \"LED\"?\nOne potential workaround is to install a 3rd party app like Light Flow.", "time": "09-20-2017 10:38 AM", "replies": []}, {"postID": "post5984837", "text": "I see no results when search for LED . Thank you for the app, I'd really like to have it as before though, without third party app.", "time": "09-20-2017 12:24 PM", "replies": []}]}, {"title": "Why Phone Shuts off or Reboots when volume is high ?", "thread": [{"postID": "post5973183", "text": "if i play something the phone shuts off or reboots\nif the music or the movie is loud the phone shuts off or reboots\nand i hear some popping before that\nbut when i plug in the phone into wall charging nothing is happening\nand when the volume is not high enough or in the middle again nothing is happening\ncould someone plz explain why", "time": "09-13-2017 07:04 PM", "replies": []}, {"postID": "post5977437", "text": "Welcome to Android Central! Which phone? Does it happen in Safe Mode as well?", "time": "09-15-2017 09:42 PM", "replies": []}]}, {"title": "Rooting Alcatel Fierce 4, want to get rid of File Manager that suddenly showed up", "thread": [{"postID": "post5958616", "text": "Not quite sure just where this \"File Manager\" suddenly came from..... \nIt just suddenly appeared one day, & I can neither dismiss nor swipe left or right, nor delete, or uninstall....\nI tried & it just comes back & phone won't let me install Rooting app....UGH!!!", "time": "09-05-2017 08:54 PM", "replies": []}, {"postID": "post5958751", "text": "Moved from the Oreo forum to the Alcatel forum.", "time": "09-05-2017 10:21 PM", "replies": []}]}, {"title": "Alcatel U5 - Pulse Notification Light?", "thread": [{"postID": "post5955505", "text": "Does anyone know if there is a pulse light for the Alcatel U5? \nAccording to some sites (like Argos) there is, but I'm really struggling to find an option for it on all the phone settings (Notifications/Apps/Sound etc).\nThe pre-installed app Phone Guard has a Pulse Notification Light setting but when enabled there is still no light. \nAny help would be appreciated.", "time": "09-04-2017 10:45 AM", "replies": []}, {"postID": "post5957312", "text": "Welcome to Android Central! This comparison suggests that it does not have an LED notification: Alcatel U5 5044T vs Huawei GR5 2017 32GB - Phone More\nPhonearena.com also just mentions \"haptic feedback\" under the Notifications heading, without mentioning any LED. https://www.phonearena.com/phones/Alcatel-U5_id10448", "time": "09-05-2017 10:58 AM", "replies": []}]}, {"title": "YouTube without YouTube!!", "thread": [{"postID": "post5555647", "text": "Is it possible to watch YouTube videos without YouTube? I have YouTube but with the Google/Adobe thing I can't use it.", "time": "11-10-2016 03:57 AM", "replies": []}, {"postID": "post5555666", "text": "Works just fine via Chrome Browser.\nAlso, youtube app isn't very intrusive, so why not just use that anyways?", "time": "11-10-2016 04:22 AM", "replies": []}, {"postID": "post5555693", "text": "My YouTube won't work. When I try it tells me \"an error occurred Retry\"", "time": "11-10-2016 04:55 AM", "replies": []}, {"postID": "post5944276", "text": "I got it!\nlet me give you some fixes:\n1. clear YouTube app data/cache\n2. remove ALL accounts and re-add them again TWICE\n3. uninstall updates and reinstall system update TWICE\n4. uninstall google play services updates and reinstall it's updates\n5. do the SAME thing on your computer and then reboot your device\nif the problem priests, do the SAME thing on your device and computer.\nthat it! enjoy!\nwas this answer helpful?\nYes | No", "time": "08-29-2017 08:30 AM", "replies": []}, {"postID": "post5953101", "text": "That's just insane to get one app working.", "time": "09-02-2017 06:31 PM", "replies": []}]}, {"title": "5s review", "thread": [{"postID": "post5905840", "text": "Doesn't seem that great Alcatel Idol 5s review - Android Authority", "time": "07-30-2017 04:42 PM", "replies": []}]}, {"title": "Fierce 2 won't factory reset", "thread": [{"postID": "post5904480", "text": "Whenever I try to factory reset my OneTouch Fierce 2, nothing happens. This happens no matter what method I use to factory reset. When I do it through the settings menu, the phone just turns off, boots up to the Fierce splash screen, then turns off again. If I try to do it with the power and volume buttons, it just turns back on without loading any sort of recovery screen. Either way the phone still has all of my settings and data that I want wiped. I can't seem to find anyone else with a similar problem after hours of searching on Google. How do I fix this?", "time": "07-29-2017 01:36 PM", "replies": [{"postID": "post5904574", "text": "That's odd. Try following these steps and see if it helps: https://support.t-mobile.com/docs/DOC-31288\nYou may also want to try erasing all the data on the internal/external SD card to see if that helps. Let us know if you have any luck.", "time": "07-29-2017 03:00 PM", "replies": [{"postID": "post5904581", "text": "I've already been to that website and followed those directions exactly, and formatting the SD hasn't helped either.", "time": "07-29-2017 03:10 PM", "replies": []}]}]}]}, {"title": "Phone stuck in unfixable boot loop?", "thread": [{"postID": "post5890461", "text": "PHONE: Alcatel One Touch Fierce XL\nThis morning, I woke up to find that my phone shut off while I was sleeping. No problem, it's died in my sleep before, but I just wanted to make sure. I held down the power, and sure enough, it turned on. But to my dismay, it started going into the boot-loop cycle.\nI tried everything. Going into Android System Recovery and factory resetting, then wiping the cache, and nothing worked. Finally my friend told me to put an update onto my SD card, which I did, but for some reason, there was no option to install the update from the SD card/external device.\n--------------------------------------------------------------------------------------------------------------------------\nAndroid system recovery <3e>\nLMY47V release-keys\nPress the volume key to select,\npress the power key to confirm.\nreboot system now\nwipe data/factory reset\nwipe cache partition\npower down\n--------------------------------------------------\n(Android mascot with chest open with \"!\" triangle above him with \"No command.\" written under him)\n--------------------------------------------------------------------------------------------------------------------------\nThat was exactly what was on my screen. I hadn't rooted my phone prior, but I did enable Developer Mode and Debug Mode a month or so before this all happened.\nIf anyone has a solution to this, please, please tell me what it is. I'm on the verge of having a mental breakdown because I can't fix it.", "time": "07-18-2017 09:39 PM", "replies": []}, {"postID": "post5891362", "text": "the easiest way to solve this is by flashing a whole new rom.", "time": "07-19-2017 01:34 PM", "replies": []}, {"postID": "post5891711", "text": "Well, how do I do that?\nIf it involves using an SD card to put the ROM onto my phone and downloading it through Recovery mode via \"download content via SD card\" (or something like that), once again, my phone doesn't have that option. If you looked at what my phone said specifically on the Recovery mode screen, you would know that.", "time": "07-19-2017 06:05 PM", "replies": []}]}, {"title": "Help with my Alcatel", "thread": [{"postID": "post5861493", "text": "I bought a phone from a friend I'm not able to contact anymore and it's asking for a Google account synced with the phone that I don't have access to. How can I bypass it?", "time": "06-23-2017 09:39 PM", "replies": []}, {"postID": "post5862940", "text": "Welcome to Android Central! You can't. That's Google's Factory Reset Protection, intended to prevent thieves from stealing a phone and doing a simple factory reset to make it their own. You'll have to track that friend down and ask them to give you their password.", "time": "06-25-2017 12:09 PM", "replies": []}]}, {"title": "Noise issues w/ Plantronic bluetooth headphones w/ Alcatel phone", "thread": [{"postID": "post5854168", "text": "I have an Alcatel OneTouch Idol 3, and lately whenever I listen to a Podcast, there is a screeching, squealing sound that lasts a split second, every couple of minutes when I use my Plantronics bluetooth headphones.\nI do NOT get this noise when I listen to my stored music, only when I listen to a podcast.\nHelp!", "time": "06-17-2017 07:23 PM", "replies": []}, {"postID": "post5857351", "text": "Welcome to Android Central! Moved from the Sprint Epic 4G forum (not sure how it got there) to the Alcatel forum.\nDoes this happen with any podcast app, or only a certain one? Which app are you using?", "time": "06-20-2017 03:56 PM", "replies": []}, {"postID": "post5857579", "text": "I am using CastBox. I was wondering if the problem might not be with the app.", "time": "06-20-2017 07:35 PM", "replies": []}, {"postID": "post5858272", "text": "It could be. Have you tried other podcast apps? If it seems to be a CastBox issue, send them some feedback through the app, or send an email: contact@castbox.fm", "time": "06-21-2017 11:07 AM", "replies": []}]}, {"title": "Something wrong with screen 0_0", "thread": [{"postID": "post5852537", "text": "I don't know what this is called, but it happened last night while I was typing with my on-screen keyboard. 75% of the screen is like this. Has anyone else had this problem or know what this is? How do I fix this?", "time": "06-16-2017 10:13 AM", "replies": []}, {"postID": "post5854370", "text": "Welcome to Android Central! Sorry, but it's hard to tell what's abnormal, owing to how busy the wallpaper is. (And I assume the whole photo is backwards, and you're not having issues with the screen itself showing mirrored images.) Can you point out your main concern?", "time": "06-17-2017 11:32 PM", "replies": []}, {"postID": "post5854951", "text": "I agree with B Diddy. Change the background to a simple color. Do a screen shot instead of mirror, if you can.", "time": "06-18-2017 04:35 PM", "replies": []}]}, {"title": "Why does my phones volume control not wrk on most of my screens?", "thread": [{"postID": "post5828192", "text": "I have an Android Alcatel OneTouch Pop Icon A564C (service thru Net10) & the volume buttons on the side of my phone, Do Not Wrk most of the time! They only wrk sparadically, when they want too!!\nDoes Anyone have a similar problem & Does anyone know how to fix this issue/glitch/problem???", "time": "05-25-2017 05:09 PM", "replies": []}, {"postID": "post5828370", "text": "Welcome to Android Central! Does this persist in Safe Mode as well? https://support.t-mobile.com/docs/DOC-30928", "time": "05-25-2017 08:34 PM", "replies": []}, {"postID": "post5829061", "text": "No it doesn't happen in safe mode, but I'm not sure how to figure out which app is creating the problem. If I uninstall all my apps I will lose important data, & I'm not willing to lose the data when I'm not totally sure which app is at fault.", "time": "05-26-2017 12:27 PM", "replies": []}, {"postID": "post5831029", "text": "That can be tough to figure out, then. You could start by focusing on apps that might have some control over the buttons (like media apps or any 3rd party camera apps).", "time": "05-28-2017 01:52 PM", "replies": []}]}, {"title": "Metropcs Fierce XL possible to upgrade to Marshmallow 6.0?", "thread": [{"postID": "post5618752", "text": "I have a 5.x lollipop Fierce XL.. is there a method to safely upgrade to Marshmallow 6.x?\nI cant seem to find one.. i see notes on using kingroot to root (i've never rooted before).. but some reports are that it slows things down and i'm not seeing that rooting helps to achieve 6.x upgrading?\nThanks in advance", "time": "12-23-2016 02:58 PM", "replies": []}, {"postID": "post5828107", "text": "Any changes on this front to at least get to version 6.0?", "time": "05-25-2017 03:59 PM", "replies": []}]}, {"title": "Screen overlay problem", "thread": [{"postID": "post5824608", "text": "the Assistive Touch is giving me a screen overlay problem with all my apps what can I do I need the app because my home buttons do not work I have an Alcatel Fierce 4", "time": "05-22-2017 05:11 PM", "replies": []}]}, {"title": "how do i get my alcatel fierce xl off of a bootloop ?", "thread": [{"postID": "post5816601", "text": "has a non removable battery and will not let me complete a hard reset", "time": "05-16-2017 02:02 AM", "replies": []}, {"postID": "post5817293", "text": "Welcome to Android Central! Did you try the hardware key factory reset? https://support.t-mobile.com/docs/DOC-29491", "time": "05-16-2017 01:14 PM", "replies": []}]}, {"title": "Can I assign ringtones to contacts on my Alcatel Fierce 4 Android phone?", "thread": [{"postID": "post5792171", "text": "I want to assign ringtones to some of my contacts. Any way I can do that on this phone?", "time": "04-29-2017 02:03 PM", "replies": []}]}, {"title": "Is the Alcatel One Touch Pop Qi enabled", "thread": [{"postID": "post5790933", "text": "model A995L", "time": "04-28-2017 08:23 PM", "replies": []}]}]
[{"title": "How to root Alcatel Pixi 4 - 7'' (TCL 9003A)", "thread": [{"postID": "post5788877", "text": "I've tried using the quick root apps but they all failed, I figured there must be another method. Does anyone know how to do this?", "time": "04-27-2017 06:20 PM", "replies": []}, {"postID": "post5789445", "text": "Moved to the Alcatel forum.", "time": "04-28-2017 02:31 AM", "replies": []}]}, {"title": "What is the ALCatel 5056", "thread": [{"postID": "post5760224", "text": "What does this phone look like", "time": "04-15-2017 05:36 AM", "replies": []}, {"postID": "post5760248", "text": "Welcome to Android Central.", "time": "04-15-2017 05:57 AM", "replies": []}]}, {"title": "Alcatel fierce xl", "thread": [{"postID": "post5749813", "text": "How can I turn on my phone when my power button and or volume buttons are broken", "time": "04-08-2017 01:14 PM", "replies": []}, {"postID": "post5749949", "text": "Welcome to Android Central! If the phone doesn't automatically power on when you plug it into a wall outlet, then you'll have to bring it to a repair shop.", "time": "04-08-2017 03:25 PM", "replies": []}]}, {"title": "Fitbit won't sync", "thread": [{"postID": "post5748753", "text": "Alcatel One Touch won't sync with my Fitbit. Could it be the phone? Did not have a \nproblem with my Note 2. Tryed to switich phones and I'm not gettin NOTIFICATIONS.", "time": "04-07-2017 04:00 PM", "replies": []}]}, {"title": "How do you root an Alcatel Onetouch Idol 3 6039S?", "thread": [{"postID": "post5728051", "text": "I have a Alcatel Onetouch Idol 3 6039S, running 6.0.1 and tried Knigroot and failed to root it. I also have a mac and no pc. Preferably a method that involves no computer connection and I have no TWRP. Any ideas or solutions? Thanks\n-Ahlix", "time": "03-27-2017 04:51 PM", "replies": []}]}, {"title": "Removing message not sent notification", "thread": [{"postID": "post5722186", "text": "I have an Alcatel one touch fierce 2. Every time I open my messaging app I get a notification in my notification bar that says messages not sent. I tried to download Handcent SMS and delete from there and reboot phone no luck still getting message", "time": "03-23-2017 04:54 AM", "replies": []}, {"postID": "post5723553", "text": "Go to Settings>Apps, select the Messaging app, and Clear Cache. If that doesn't help, try Clear Data as well, although I'm not sure if this will also delete any saved messages that are important to you.", "time": "03-24-2017 02:38 AM", "replies": []}]}, {"title": "what are the stickers for on the inside of my cell phone its a Alcatel one touch", "thread": [{"postID": "post5718800", "text": "One of the stickers said GPS na SPD another said yaris5na spd", "time": "03-20-2017 03:59 PM", "replies": []}]}, {"title": "i wanted to know is my alcatel one touch 5054 Qi compatable", "thread": [{"postID": "post5708706", "text": "i need to get a wireless charger what do recommend", "time": "03-11-2017 11:30 AM", "replies": []}, {"postID": "post5709282", "text": "Welcome to Android Central! What's the exact model number? If it's the 5054N (Fierce XL) then no, and the battery is non-removable, which means you wouldn't be able to add it on as a kit. If it's the 5054S (Pop 3), then it might be possible as a kit, since it seems to have a removable battery -- but you'd have to search to see if anyone has done it.", "time": "03-11-2017 09:37 PM", "replies": []}]}, {"title": "how to fix Alcatel one touch 4015T, unroot it or unbrick it", "thread": [{"postID": "post5684541", "text": "can't download application, can't login to Google play with new or existing account, no phone dialer, no browser, only way to call have to send a message to that number,can't hit the back button when on web, and can't hit messages on Facebook it will kick me off the web, only way to get on web is thru Swype on .messages", "time": "02-20-2017 09:07 AM", "replies": []}, {"postID": "post5685061", "text": "Welcome to Android Central! Moved from the KitKat forum to the Alcatel forum.\nDid you modify the phone in any way after rooting it? Like installing a custom ROM, or deleting system apps?", "time": "02-20-2017 04:52 PM", "replies": []}, {"postID": "post5695960", "text": "Use Alcatel's Mobile Support Tool, i used it when i decided to stop messing around with custom ROMS and i didnt have a backup of my original stock rom. Just find and download the version for your phone here:Alcatel mobile | Global - Software Upgrade Install it and then follow the instructions on the program, hope i helped.", "time": "03-01-2017 06:38 PM", "replies": []}]}, {"title": "sms skin apps won't stick as default- fierce4", "thread": [{"postID": "post5682585", "text": "Hey \nI started with Textra and loved it. Then I noticed, even though it's set as default, I have to tap it to use it every time I open my messages. That's just annoying. Something I'm doing wrong?\nThank you...", "time": "02-18-2017 10:39 AM", "replies": []}]}, {"title": "How to access Special Characters (not symbols)", "thread": [{"postID": "post5657080", "text": "I have passwords for online accounts that use these special characters - ` ~ | ! { } ^ - but I cannot seem to find them on my Alcatel Fierce 4 Phone. \nI tried the suggestion of holding the c for a second, but that does not bring up special characters, only symbols. I hope there is a way, so I do not have to change all my passwords (150 of them) to use the phone for the accounts. \nCan anyone help with this? \nThanks Rick", "time": "01-26-2017 12:27 AM", "replies": []}, {"postID": "post5658505", "text": "You have to enable them in the keyboard settings usually...", "time": "01-27-2017 07:56 AM", "replies": []}]}, {"title": "Alcatel Fierce 4 Display connector BURNT!", "thread": [{"postID": "post5657478", "text": "I was working on a customers Alcatel fierce 4 which was working fine, but had no backlight at all. Could still see the display when held in light. I powered it down and disassembled it. When I disconnected the display from the motherboard, I noticed that 2 of the prongs on the motherboard and display connecter were burnt. They were solid black, along with a little bit of burn damage around the base of the connector. The phone is only a few months old. It is cracked, however. I cleaned the display connector and the slot on the motherboard very cautiously and thoroughly. This has worked on different phones before. However when I powered this device back on, I got the normal boot up vibration, and the metroPCS sound. Still no display backlight. I turned the device around and looked for any signs of burning from the display connector, and I saw light smoke coming from it. I immediately unhitched the battery and disconnected the display, and sparks shot out of the display connector. The phone has no drop damage whatsoever except for a cracked screen. Any ide what's going on?", "time": "01-26-2017 10:18 AM", "replies": []}]}, {"title": "Trying to give root permission to Alcatel One Touch pixi three", "thread": [{"postID": "post5648411", "text": "So I am trying to root my phone this way I can transfer my apps to my SD card fully. Model number A463BG. Android 4.4.2. . please help", "time": "01-18-2017 02:18 PM", "replies": []}, {"postID": "post5648429", "text": "Rooting will not let you \"transfer your apps to your SD card fully\", in fact, it has nothing to do with whether the developer turned off \"Move to SD card\" or not. It will allow apps that won't run without root permission to run - but they're running now, and without root permission, so you evidently don't have any apps that require root permission.", "time": "01-18-2017 02:27 PM", "replies": []}, {"postID": "post5648602", "text": "Moved to the Alcatel forum.", "time": "01-18-2017 05:13 PM", "replies": []}]}, {"title": "Phone resisting encryption", "thread": [{"postID": "post5647360", "text": "Hello,\nI have a OneTouch Idol Mini, which runs Android 4.2.2. I was not happy with the stock ROM, and wanted to install another, so some attempts to root the phone were made, however, nothing worked, so I factory reset the phone and now would like to encrypt my storage again.\nThis has proved problematic. On my first attempt, the phone started the encryption process (green security Android appeared) but then quickly got caught in a reboot loop in which the errors 'Unfortunately, System UI has stopped' and 'Unfortunately, Android Keyboard has stopped' appeared between each reboot. Having encrypted my phone before, I knew that this much rebooting was not normal for the process, and force-shut-down the phone. I let it cool down (it was very warm) then turned it back on, and nothing seemed amiss, all my data was intact and the phone behaved as it should.\nI factory reset the phone again for a fresh start, and tried again to encrypt it. This time, it rebooted once, then froze on the second reboot (on the 'smart move' screen, ironically). After a long wait to ensure it wouldn't recover, I turned it off again. It still boots up and functions just fine.\nClearly something below the surface isn't working properly, but hard resets don't seem to have an effect on it. Is there anything I could do (through adb perhaps) to get my phone to survive an encryption attempt?\nAny advice would be appreciated!", "time": "01-17-2017 06:49 PM", "replies": []}]}, {"title": "I'm new", "thread": [{"postID": "post5642143", "text": "hi what is this", "time": "01-13-2017 03:52 AM", "replies": []}, {"postID": "post5642175", "text": "Hi and welcome to Android Central - what are you referring too? the site or the forum that you are in?", "time": "01-13-2017 04:48 AM", "replies": []}]}, {"title": "i cant delete 2 songs from my phone.", "thread": [{"postID": "post5627044", "text": "so, my phone is an Alcatel One Touch Idol 3 and there's 2 songs that i can't delete. when i delete the songs, they reappear on the phone as if nothing had happened to them, i don't know what this is, i tried to put the phone from fabric, but they are still there. and i don't know what to do. when i delete them on the next reboot of the phone there they are, like nothing happened.", "time": "12-31-2016 10:28 AM", "replies": []}, {"postID": "post5627083", "text": "Interesting.\nHave you ever used those songs as ringtones? That is the only thing I can think of.", "time": "12-31-2016 11:05 AM", "replies": []}, {"postID": "post5631549", "text": "no, i haven't. i have't usedthem as ringtones. and i can't get rid of them. no matter what i do, they appear again. i'm just out of options here and i need help. by the way, thank you for answering.", "time": "01-04-2017 03:37 PM", "replies": []}]}, {"title": "alcatel fierce stuck in boot loop, how can i fix it?", "thread": [{"postID": "post5609462", "text": "please advide", "time": "12-15-2016 07:57 PM", "replies": []}, {"postID": "post5609749", "text": "Welcome to Android Central! Moved from the OneTouch Pop Up forum to the general Alcatel forum.\nAre you able to boot the phone into Safe Mode? https://support.t-mobile.com/docs/DOC-33016", "time": "12-16-2016 01:14 AM", "replies": []}]}, {"title": "Alcatel Onetouch Pixi - camera has no focus", "thread": [{"postID": "post5603277", "text": "all photos are blurry, there are no settings for focus, and I don't know what to do", "time": "12-11-2016 03:07 PM", "replies": []}, {"postID": "post5603427", "text": "Which exact OneTouch Pixi model do you have? It looks like at least some of the models lack autofocus: Alcatel OneTouch PIXI First specs. You tend to see that with very cheap entry-level phones.", "time": "12-11-2016 05:24 PM", "replies": []}]}, {"title": "Alcatel Onetouch Pixi - ZERO apps capable of transferring to my sd card", "thread": [{"postID": "post5598251", "text": "I tried formatting the card before already, and still no luck. what do I do? only 4gb of space was open on the internal storage, so I can barely do anything without transferring some apps over.", "time": "12-08-2016 03:06 AM", "replies": []}, {"postID": "post5599905", "text": "Welcome to Android Central! Moved from the RAM forum to the Alcatel forum.\nNot all devices support the ability to move apps to SD. Your phone is very much an entry-level phone, and with 4 GB of internal storage, probably only about 1 GB is actually usable by you, since the rest is taken up by the system. Unfortunately, you can't do much with these phones besides make calls, browse the web, and have a few relatively small apps installed. Even if you could move apps to SD, you could only move a portion of each app, not the whole thing.\nSee this guide for tips on how to maximize the storage you have: http://forums.androidcentral.com/amb...-warnings.html", "time": "12-09-2016 02:05 AM", "replies": []}]}, {"title": "Fierce 4 random notification and headphone jack", "thread": [{"postID": "post5566194", "text": "I've got two questions. Since I got this phone about a week ago, I've been getting randon notification sounds with no obvious connection to any app. I finally caught it in the act today as I was driving and randomly connecting and disconnecting to xfinity wifi as I drove along...seems every time I drop out of a wifi connection and back into straight data, I get this notification....kind of annoying as you drive around as there are xfinity hotspots everywhere. Anyone else had this and how can I disable it.\nAlso, aux cord issues...previous phone had zero issues connecting to my car stereo to play music from my phone, with the fierce 4 I've had little to no luck getting it to recognize that I've attached an aux cord and when I do the sound is very so-so...volume drops in and out depending on whether my music program is in full screen or not. Tried to attach to my wife's car, no issues at all that I can hear. Is the new phone combined with an older (2007) car the issue? Previous phone was fierce xl and had no problems. This is my second Fierce 4 with the same issue, starting to think it isn't the phone on its own...maybe a combo of the cord and the age of the car? Wife's car is 2012 and works fine with same aux cord.\nThanks for any assistance\nKris", "time": "11-16-2016 04:08 PM", "replies": [{"postID": "post5583069", "text": "Same problem with my new fierce 4", "time": "11-28-2016 08:15 AM", "replies": []}]}]}, {"title": "Why do I keep getting a download pending message everytime I try to download or update an app.", "thread": [{"postID": "post5555609", "text": "I have an Alcatel One-Touch and I resently done a factory reset on it. Now when I try to download or update an application in Google Play it says.Download Pending. An never downloads or updates. How do I fix this??", "time": "11-10-2016 02:52 AM", "replies": []}, {"postID": "post5555635", "text": "I also have a same issue with my redmi 2 prime anyone can give a solution for it", "time": "11-10-2016 03:43 AM", "replies": []}]}, {"title": "Phone won't start up anymore?", "thread": [{"postID": "post5545758", "text": "(My phone is an 'Alcatel Onetouch' (Virgin Mobile))\nSo, my phone was working fine yesterday. But its battery power ran out overnight and was dead. So I plugged it into the charge this morning and once it reached 20% charged I unplugged it from the charger and tried to turn it on. It shows the 'Alcatel OneTouch' logo and then moment later shows the animation into the Virgin Mobile logo and it just seems to stay there. I have even tried removing the battery and placing back in and the same still occurs.", "time": "11-04-2016 01:02 PM", "replies": []}, {"postID": "post5546775", "text": "Try charging undisturbed from a wall outlet for at least 4-6 hours, then try powering on again.", "time": "11-05-2016 12:33 AM", "replies": []}]}, {"title": "unlocking alcatel one touch cell phone sim card", "thread": [{"postID": "post5296461", "text": "how can i unlock my cell phone", "time": "08-02-2016 08:33 PM", "replies": []}, {"postID": "post5298107", "text": "Welcome to Android Central! Moved to the Alcatel forum.\nDo you mean you want to carrier-unlock the phone so that you can use it on a different carrier? Or is the SIM card password-protected?", "time": "08-03-2016 11:50 AM", "replies": []}, {"postID": "post5544766", "text": "I want to carrier-unlock my phone. Please help", "time": "11-04-2016 03:16 AM", "replies": []}]}, {"title": "Slow downloading", "thread": [{"postID": "post5522159", "text": "I have an alcatel pixi glitz, I have had it for 2 weeks, the first 2 or 3 days, no problems. Then all at once can't get in the play store, can't get on you tube, and I wasn't able to send texts but cld receive them, texting is fine now. Still no you tube. I have updated, factory reset, updated, but when i am able to get in the play store, downloading is a nightmare. It sometimes takes 3-4 hours to download one thing, and thats after it restarting (on its own) 2 or 3 times. Is there something else i can do, cause yelling at it and threatening it doesnt work. Plz help.", "time": "10-25-2016 09:38 AM", "replies": []}, {"postID": "post5525184", "text": "Is this happening on wi-fi, mobile data, or both?", "time": "10-26-2016 11:02 AM", "replies": []}, {"postID": "post5542320", "text": "It is happening on mobile data, I haven't tried WiFi yet.", "time": "11-02-2016 08:05 PM", "replies": []}, {"postID": "post5543519", "text": "It should be pretty easy to test wi-fi. If you don't have a wi-fi network at home, then go to your nearest Starbucks or something.", "time": "11-03-2016 11:45 AM", "replies": []}]}, {"title": "Alcatel One Touch Android", "thread": [{"postID": "post5542544", "text": "How to move pictures from gallery to my SD card", "time": "11-02-2016 10:41 PM", "replies": []}, {"postID": "post5543433", "text": "Welcome to Android Central! The pictures aren't stored in the Gallery -- they're on a directory in your Internal Storage (/DCIM/Camera, if they were taken by your phone's Camera app). The Gallery scans all storage areas for photos and builds a database of them, and then displays the photos regardless of where they're stored.\nYou can copy or move photo files from Internal Storage to the SD card using a file manager app (if your phone doesn't have a native file manager app installed, try a 3rd party one like Total Commander). Or you can connect the phone to your computer via USB cable and use Windows Explorer to drag and drop the files.", "time": "11-03-2016 11:06 AM", "replies": []}]}, {"title": "Is the acatel fierce 4 rootable?", "thread": [{"postID": "post5535782", "text": "hello, new here...have SOME experience with android etc however I cannot seem to root this phone at all...spent 34$ to unlock it to begin with and now every program that claims to have a root for it...virus...or I get a :cannot read 301,302 etc\nanyone have success with this phone??? for now it just back to theme and launcher changes..\nacatel fierce 4 5056n 6.0.1 metro pcs..\nANYBODY...please help it is driving me crazy", "time": "10-31-2016 12:19 AM", "replies": []}]}, {"title": "I have an Alcatel Onetouch.", "thread": [{"postID": "post5513574", "text": "I have looked but can't find screen rotate, am I missing it or does it just not have it?", "time": "10-22-2016 12:53 AM", "replies": []}, {"postID": "post5514041", "text": "There's usually a toggle in the Quick Settings (swipe down from the top of the screen with two fingers). If you don't see it there, then go to Settings>Accessibility and look for the Auto-Rotate option there.", "time": "10-22-2016 08:48 AM", "replies": []}]}, {"title": "Do SD cards work with Alcatel Phones?", "thread": [{"postID": "post5510731", "text": "I've had two different ones now & have yet to get anything to transfer or download to my SD card. Am I doing something wrong? How hard can it be?", "time": "10-21-2016 06:10 AM", "replies": [{"postID": "post5513045", "text": "Yep no problem with my allura.", "time": "10-21-2016 08:00 PM", "replies": []}]}, {"postID": "post5510811", "text": "They do work but are meant for media not apps", "time": "10-21-2016 06:50 AM", "replies": []}]}, {"title": "Alcatel One Touch Pop Icon", "thread": [{"postID": "post5510717", "text": "This phones model # is A564C. I have two of them. One I purchased brand new at WalMart through the Straight talk program when you had to use their specified phones & the other I purchased at a later date after that had changed but I purchased the identical phone from the straight talk website as a reconditioned phone because that way I'd already know how to use it, would have 2 batteries plus the reconditioned phone was only $19.95 and had the same warranty as a brand new phone. I am also disabled, on a very tight fixed income & the nearest WalMart where I could purchase a new one was an hour from my home & the first one had cost me nearly $150.00. The problem I'm having is this... When I bought the first phone I could find nowhere on the box where it said how many GB of memory or space it had on it so I bought an SD card to go along with it but never could get anything 5o go onto the SD card. The memory seemed to fill up fast & I'd have to delete things. The same thing is happening with the new or 2nd phone. Can someome PLEASE HELP me figure out how to get things to go on to my SD card? I'm really tired of having such limited space on my phone that I continually have to delete things before I can add anything new. Please help!?! \nSincerely & desperately,\nlcurrie78", "time": "10-21-2016 05:59 AM", "replies": []}, {"postID": "post5510991", "text": "A quick Google search indicates that this phone had 4gb internal which is ok insufficient for any current phone. With that said, you can try to use the apps2sd app to move apps to the SD card. You can use a file browser like solid explorer to move media to the SD card.\nStraight talk also has a byop program, you can get something like the Blu r1 Amazon edition 16 GH internal for $60, which would be ac much better phone.", "time": "10-21-2016 08:09 AM", "replies": []}]}, {"title": "Battery draining without using the phone", "thread": [{"postID": "post5486555", "text": "Hello. I use Alcatel one touch idol 2 and I haven't experienced problems with my battery before. My android is 4.2.2. Suddenly, since a week my battery drains really fast without even touching the phone. I looked at different threads for solution, but nothing. I think I disabled every kind of tracking my location or things like this. I'm losing battery even in Power Save mode and in Flight mode, so nothing helps.\nWhat I found interesting is that my phone is ALWAYS wake up, his time in \"Deep sleep\" is 0s. I think something is causing the phone to be awake even when I lock it and don't use it. I tried to remove different apps, but that also didn't help.", "time": "10-12-2016 10:58 AM", "replies": []}, {"postID": "post5486729", "text": "Perhaps it's broken?", "time": "10-12-2016 11:53 AM", "replies": []}, {"postID": "post5488715", "text": "I think that some app is keeping my phone always awake and on screen. Is there a way to see exactly which app is causing this?", "time": "10-13-2016 02:41 AM", "replies": []}]}]
[{"title": "Where can I get the firmware for a Tracfone Alcatel OneTouch Phone?", "thread": [{"postID": "post5458661", "text": "I am in desperate need of a firmware restoration. I had my phone rooted and deleted some stock firmware to free up space. I need that stock software back. I contacted Tracfone customer support, and they said they couldn't give me the firmware. It has to be somewhere online, right? It's android version 4.1.2. Model A851L.\nHere is the long story of what I'm going through:http://forums.androidcentral.com/ask...ml#post5457448", "time": "10-01-2016 07:20 PM", "replies": []}, {"postID": "post5458702", "text": "If they haven't provided it online, it probably isn't available.", "time": "10-01-2016 07:53 PM", "replies": []}, {"postID": "post5460704", "text": "Which One Touch phone is it? I see some sites identify the A815L as the One Touch Sonic, but other sites say the Sonic is the A851L.", "time": "10-03-2016 02:17 AM", "replies": [{"postID": "post5461248", "text": "Thanks for pointing that out. I meant to say A851L (just edited it).", "time": "10-03-2016 10:22 AM", "replies": []}]}, {"postID": "post5461250", "text": "Check out your other thread where I suggested an Alcatel website to look at.", "time": "10-03-2016 10:23 AM", "replies": []}]}, {"title": "Alcatel One Touch Idol wi-fi problem", "thread": [{"postID": "post5421726", "text": "Hey. Sorry if any of this sounds stupid, I'm not exactly knowledgable when it comes to tech of any kind & english isn't my first language, but I'll try to explain the issue as best as I can.\nA couple of days ago I noticed my phone had lost connection with the wi-fi at home, or so I thought. The bars that are usually blue when the internet is ok are now constantly white as it is when the phone is searching for a network/hasn't connected to a specific one. Turns out it is connected to it, but not everything loads. For example I can view videos from the browser or the drive app, but if I try to open the youtube one it says \"please check your network connecton\" and a message saying that com.google.process.gaps has crashed appears. Same message appears sometimes for google play services I think. I don't get notifications from apps such as twitter anymore, but with some effort the phone manages to load the app itself.\nI haven't had the chance to connect to another network to see if the problem persists. I don't use mobile internet often and I don't recall installing a new app on the day that the problem occured. There are other devices at home that don't have that problem.\nAny help would be greatly appreciated.", "time": "09-15-2016 05:34 PM", "replies": [{"postID": "post5431885", "text": "Welcome to Android Central!\nHave you tried rebooting your router?", "time": "09-20-2016 07:04 AM", "replies": []}]}]}, {"title": "No Service After ROM Install - Alcatel One Touch 5020T (Evolve - MT6575 chipset)", "thread": [{"postID": "post5314391", "text": "The Back Story (Short Version)\nI was given a Alcatel One Touch 5020T - summer 2015. Stuck in a boot loop [Logo screen]\nInstalled VIP M'POP-Rom.zip - No problem. Unlocked carrier (Originally WIND mobile - popular minor carrier here in Southern Ontario)\nVIP M'POP-Rom was very stable for 8 months, started rebooting - often when display timed-out. Suspected a rogue app as the culprit and reinstalled VIP M'POP-Rom.zip as originally. No Cellular Service since. \nTried flashing various stock roms - no service. My current measurement parameter (to gauge how close I am to solution) is to open Android Settings [via *#*#4636#*#* or Engineer Mode apk] and verify if I can turn off the radio (modem). \nWith the current Greek stock rom (I'm in Canada) - using Engineer Mode apk - it appears all software is installed for the modem chip.\nRe-Installed VIP M'POP-Rom.zip - No service. \"Radio\" can still respond to on/off through android settings.\nBT & WiFi radios - OK\nThe current rom recognizes my SIM & phone#. IEMI -OK.\nI was amazed how little info on this topic was discovered during countless searches.\nDevice Detail:\nAlcatel One Touch 5020T-2AWNCA1 - TCT Chipset MT6575\nFirmware version: 4.1.1 (Jelly Bean)\nBaseband version\nMAUI.11AMD.W1222SP.V15.F5.P11\nKernel version 3.4.0\nCustom Build Version: 010 01 - Country: US", "time": "08-10-2016 01:28 PM", "replies": []}]}, {"title": "Alcatel 5017B lollypop 5.1.1(root advice please!!)", "thread": [{"postID": "post5292595", "text": "I have been looking for a way to root my Alcatel 5017B with lollipop\nAndroid version 5.1.1 .\nI used kingoroot to root my phone and it was very problematic. Root checkers would say I was rooted but when I went about to use certain applications that required root it would tell me that I wasn't rooted. I also went to use a different super user and it soft bricked my phone so it wouldn't got past the 2nd start up screen (boost mobile screen) but was able to recover it simpley with holding power and down volume button. Ive google google googled and I'm sick and tired of being led to spam and adds and not finding any real results (pay for our code, take this survey etc etc ad in finitum) my goal is to fully unlock my phone so I can switch from boost. ( nation wide best 4g ? Yeah right, Bs. If I lived in the cities maybe) if anyone has info or has rooted, unlocked or changed the ROM and other customizatin on this same phone , let me know , but as far as rooting is , if I could just be pointed in the right direction I'd be more than happy. Thank you\nOh BTW I have no PC to plug it into so I need something with out a PC.", "time": "08-01-2016 02:11 AM", "replies": []}]}, {"title": "Why won't my Alcatel recognize on my PC so I can add the abd sideload?", "thread": [{"postID": "post5266027", "text": "Trying to reprogram the phone because it has nothing on it it was completely wiped even of all it's programs so I have tried everything in the list and when I try to plug in to the PC it will not recognize it", "time": "07-15-2016 12:40 AM", "replies": []}, {"postID": "post5266241", "text": "You'll need to add the driver to the PC.", "time": "07-15-2016 05:33 AM", "replies": []}]}, {"title": "Deleted: wpa_supplicant.conf - Wifi not working - duh!", "thread": [{"postID": "post5214784", "text": "Ok so my wifi was not working, so I rooted my phone, installed Root File Manager, and followed some GENIUS advice I found on Youtube. \nI renamed the file wpa_supplicant.conf to \"wpa_supplicant1.conf\" and the file subsequently disappeared. I tried to replace it by creating a new file with the same title, but it didn't stick. Somehow, the changes that I make with Root File Manger either are not correctly executed or are not visible within the program.\nOk so here's my plea: Can someone please either 1) enlighten me on how to find / recover these files ~or~ 2) reply with the bare bones content of the file for me to painstakingly type into a new one? ~or~ 3) suggest a fix that this suuuuper green novice hasn't thought of?\nThanks in advance for your help!", "time": "06-08-2016 09:04 AM", "replies": []}, {"postID": "post5214903", "text": "I would try to backup any important data and do a factory data reset", "time": "06-08-2016 10:08 AM", "replies": [{"postID": "post5248317", "text": "Pretty sure that file resides on the system partition.\nFactory reset won't help.\nOP: Sorry for the late reply, where exactly (folder) did you delete the file from?\nEdit: Found it in the /custpack folder, so, yeah, factory reset isn't going to undo that snafu.\nIf the OP still needs the file, i'll upload it for you.\nWorst case scenario, it won't work. 😕", "time": "07-02-2016 02:36 AM", "replies": []}]}]}, {"title": "Alcatel 20.12g Developer Options if phone is unlocked where they are?", "thread": [{"postID": "post5183194", "text": "Hi there,\nto unlock this phone is somewhat complicated, but now I don't find the developer options to ajust the USB debugging mode, because I want to connect my phone with the PC, for example to use the WonderShare-Program, to install apk-files.\nThanks for help me.\nGreetings\nWolfgang", "time": "05-18-2016 06:00 AM", "replies": []}, {"postID": "post5186095", "text": "Welcome to Android Central! Go to Settings>About Phone​ and tap Build Version 7 times. If the Developer Options menu is available to the user, that should activate it.", "time": "05-19-2016 06:02 PM", "replies": []}]}, {"title": "Alcatel Pop Astro. Disable/freeze without root.", "thread": [{"postID": "post4973837", "text": "Current versions of the Alcatel OneTouch Pop Astro (5042T) have no root method.\nWhile older versions could be rooted with Framaroot, TMO/TCL has since patched that option away.\nBe that as it may, i've stumbled upon the next best thing.\nA privliged shell that will allow...\nThe ability to display (most of) the contents of the /data partition.\nThe ability to disable any preinstalled app with package manager.\nNote, this should also work with other models of MTK based phones that have EngineerMode.\n1). Open the dialer and press *#*#825364#*#*\n2). This opens MTK EngineerMode.\nSwipe left to the Connectivity tab, tap CDS Information.\n3). This opens Common Data Service.\nTap Network Utility.\nIn the top field is the option to input shell commands.\nNo, you can't remount /system as rw but you can use the following commands to debloat the system.\nls /data/data\nThis displays installed packages which are needed for the next command.\n(i made screenshots of the ls output to make it easier for me to reference the list.)\npm disable-user -0 com.vender.packagename\nor\npm disable com.vender.packagename\nThe advantage of the first pm command is that every disabled app will be shown in System Settings/Applications under the disabled column.\nThis makes it faster and easier to track which apps are disabled, in the event that a problem arrises.\nTo re-enable an app use this command.\npm enable com.vender.packagename\nThat's that, let me know how you get along.\ni'll add my list of safely disabled apps to this thread at a later date.", "time": "01-30-2016 04:12 PM", "replies": []}, {"postID": "post4973915", "text": "Good find.", "time": "01-30-2016 05:03 PM", "replies": [{"postID": "post4973980", "text": "Thank you much.\nLet me know how it works out for you.\nIf you find any other advantageous commands to run in that shell, please share 'em.", "time": "01-30-2016 05:46 PM", "replies": []}]}, {"postID": "post4974116", "text": "5042T - Safely disabled. No adverse wakelocks. (So far)\nchecked with GSam Battery Monitor (Free in the Play Store).\nThough disabling apps is generally safe, (worst case senario, a factory reset will undo changes) i advise doing research on apps you're unsure of before disabling them.\n(*) Disabled through EngineerMode shell.\nOtherwise, disabled using native function in System settings/Applications.\nAndroid Keyboard (*)\nApp Source\nAuto Dialer (*)\nBasic Daydreams\nCalendar\nCalendar Storage (*)\nChrome\ncom.android.backupconfirm (*)\ncom.android.browserprovider (*)\ncom.android.providers.partnerbookmarks (*)\ncom.android.sharedstoragebackup (*)\ncom.jrdcom.fota (*)\ncom.jrdcom.launcher.resource (*)\ncom.jrdcom.partnerbrowsercustomizations (*)\ncom.mediatek.batterywarning (*)\nCompass\nConfigUpdater\ndemo stub\nDevice Unlock\nDrive\nExchange Service (*)\nFace Unlock\nFacebook\nGmail\nGoogle Backup Transport\nGoogle Calendar Sync\nGoogle Partner Setup\nGoogle Play Books\nGoogle Play Games\nGoogle Play Movies & TV\nGoogle Play Music\nGoogle Play Newsstand\nGoogle Search\nGoogle Text-to-speech Engine\nGoogle+\nGuest Mode (*)\nHangous\nHelp Me\nKingsoft Office\nLookout\nMaps\nMarket Feedback Agent\nMTK Thermal Manager (*)\nMTKLogger (*)\nMTKThermalStress (*)\nONETOUCH Launcher (*)\nOperatorPlugin\nPicasa Uploader\nPico TTS\nPrint Spooler\nRootPA (*)\nScheduled power on & off (*)\nSearch applications' provider\nStorage Cleaning Assistant\nStreet View\nSwype\nSystem updates (*)\nT-Mobile My Account\nT-Mobile Name ID\nT-Mobile TV\nTalk Back\nTo Do (*)\nTwitter\nVCalendar\nVisual Voicemail\nWeather\nWiFi Direct (*)\nWireless emergency alerts (*)\nYouTube\nHaving just discovered the possibilities of the EngineerMode shell yesterday, (1/29/16) this is of course, a work in progress.\ni'll update as i further experiment...", "time": "01-30-2016 07:34 PM", "replies": []}, {"postID": "post5016415", "text": "Great news for those of us that are rockin' the Pop Astro.\nIf you have custom build version A3CUMC1 you can finally root this phone. KingRoot v4.80.C135.b242 has it covered.\nIf you have the newest custom build version, A3FUMF0 you may still be in luck. Check out this thread at XDA for more info.[Q] Alcatel Onetouch Pop Astro? (5042T) | Android Development and Hacking\nHappy rooting, my friends.", "time": "02-25-2016 05:02 PM", "replies": []}, {"postID": "post5020559", "text": "For those interested, i've uploaded the KingRoot apk mentioned above, along with a few files that somebody may find useful to my G Drive. Enjoy.https://drive.google.com/folderview?...9zM0hqRG8#list", "time": "02-28-2016 05:07 AM", "replies": []}, {"postID": "post5121069", "text": "Hi. Thanks for this info! I'm not so savvy with this kind of thing but I did manage to get to the CDS. From there though, it's not so clear to me what to do. \nI entered the ls /data/data in the first field but it didn't seem to do anything. Is that a lower case letter \"L\" or an upper case letter \"i\"? I tried both but neither seemed to do anything.\nBeyond that, the next step is also unclear. Does the \"pm disable-user...\" go in the second field?\nI'm really wishing there was an easier way to root this device. Unfortunately I have build version, A3FUMF0, which as far as the last post in this thread suggests, has not way to root as of yet.\nThanks for any help you can offer!", "time": "04-12-2016 04:57 PM", "replies": [{"postID": "post5121713", "text": "No problem, let's see if we can get this working for you.\nThe ls is a lower case L.\nAfter you type in the command, for example, ls /data/data make sure you're hitting the Run button with the selection box to the right of that button as SHELL.\nHitting the return key on the keyboard won't execute the command.\nOnce you get the list of package names you'll need to either write them down or do screenshots to quickly reference the names.\nYou'll have to clear anything typed into that top line before attempting to execute the next command.\nAs for rooting the A3FUMF0 build version, you could always give it a try and see what happens.\nIf you do, install KingRoot, turn on USB debugging and give it a shot.\nIf you have any more questions, by all means, feel free to ask.\nPosted via the Android Central App", "time": "04-12-2016 11:32 PM", "replies": []}]}, {"postID": "post5121781", "text": "Steinamite, i uploaded the complete list of package names to my gDrive account for you, hope it helps. (Link below)\ni've been working on a list of safe to disable apps for a while now, though it's coming along slowly.\nAs soon as it's done, i'll link to it in this thread.https://drive.google.com/file/d/0Bzp...w?usp=drivesdk", "time": "04-13-2016 12:35 AM", "replies": []}, {"postID": "post5123505", "text": "Thank you for responding! So, I took screenshots of the long list that appeared when I entered in ls /data/data. By the way, it looks like there is a space after the ls. is that right? I typed that in with a space.\nOK, so after I took screen shots, do I enter pm disable-user -0 com.vender.packagename into the same line once I clear it of the first command? If so, I tried that and received an error message and a bunch of other stuff that I couldn't understand.", "time": "04-13-2016 05:22 PM", "replies": [{"postID": "post5123600", "text": "Correct, there is a space.\nFor package manager, i'll use Facebook as an example.\nWith the input line empty, you'd type:\npm disable-user -0 com.facebook.katana\nHit the Run button.\nHere's the catch, you won't see any output of text on screen unless you typed something in wrong, in which case you'll get an error. My bad, i should have mentioned that earlier.\nYou can display disabled packages by typing:\npm list package -d\nRemember to clear the input line each time.\nAs for rooting, you could try KingRoot, though i don't know if it will work.\nOne of my earlier posts has a link to my gDrive, where you can download the app.", "time": "04-13-2016 06:12 PM", "replies": []}]}, {"postID": "post5123549", "text": "By the way, I don't suppose there is now a way to root this device since your earlier post in January, eh? That would be so nice.", "time": "04-13-2016 05:44 PM", "replies": [{"postID": "post5170294", "text": "So how's the disabling working out for you?\nAny luck with KingRoot?\nWorking on that safe/unsafe disable list still, upload it to my Gdrive for you when i'm through.", "time": "05-10-2016 11:12 AM", "replies": []}]}]}, {"title": "Alcatel One Touch elevate", "thread": [{"postID": "post5166672", "text": "How do I turn off unblocker?", "time": "05-08-2016 08:02 AM", "replies": []}, {"postID": "post5167044", "text": "Please see discussion in your other thread: http://forums.androidcentral.com/gen...ml#post5166658. Thread closed to prevent parallel discussions.", "time": "05-08-2016 12:55 PM", "replies": []}]}, {"title": "I accidentally formatted my whole entire phone ,how can I get it working again?", "thread": [{"postID": "post5162289", "text": "I was mounting my sd card to the pc then it said it cant read the disk and do you want to format it, it was a brand new sd card so i decided to format it but i didnt i just formatted my entire system phone.\nIts not turning on anymore but it connects to the PC i installed cwm on the phone but since it wont turn on i cant access it.\nI have an Alcatel pop d3,\nI really need your help", "time": "05-05-2016 12:17 PM", "replies": []}, {"postID": "post5162292", "text": "Does adb recognize the device? Do you have recovery?", "time": "05-05-2016 12:19 PM", "replies": []}, {"postID": "post5162322", "text": "yes it does and i have cwm recovery, but its not turning on i dont know why", "time": "05-05-2016 12:27 PM", "replies": []}]}, {"title": "Why do my phone sometimes kick out numbers it is a Alcatel Pixie 3 I paid $91 for", "thread": [{"postID": "post5146371", "text": "Sometimes when I use my phone I look up for a number in my contacts I don't see it so evidently it takes it out automatically somehow then I get access to the same number again reload it back in and later on in the week or the month to come I have multiple of that same number so why does it take it out anyway from the beginning it is a Alcatel Pixi 3 Android phone let me know please it doesn't quite often I'm just now starting to pay attention to it my friend asked me do I sleepwalk I don't know but I hope not.", "time": "04-26-2016 12:30 AM", "replies": []}, {"postID": "post5146381", "text": "What I meant to say it happened kind of often when I put my phone in my pocket or something it is a Alcatel Pixi 3. And the previous message I said doesn't but I meant to say it does happen often thank you.", "time": "04-26-2016 12:36 AM", "replies": []}, {"postID": "post5146504", "text": "Welcome. \nI'll request that your two posts be merged to avoid confusion.", "time": "04-26-2016 03:44 AM", "replies": []}, {"postID": "post5147664", "text": "Welcome to Android Central! Where are you saving your contacts to--your Google account or the local Phone account? You can tell by selecting a contact in the Contacts app and editing it--it will tell you which account it's associated with at the top.", "time": "04-26-2016 03:36 PM", "replies": []}]}, {"title": "Where do my downloads go on my Android One Touch fierce", "thread": [{"postID": "post5114045", "text": "I download music and I see the download on the home screen but after I play it the link goes away and I don't know where to find the download", "time": "04-09-2016 03:00 AM", "replies": []}, {"postID": "post5117050", "text": "Welcome to Android Central! Where are you downloading music from? Is it one of the major music services, or some random website? Do you see the file in the Downloads app, or in the Download directory using a file manager app? If you used a specific app, it might have its own specific download directory.\nA word about \"free mp3 downloader\" apps or sites (in case that's what you're using)--those are of questionable legality. The Terms of Service on one site I looked at specifies that (a) none of the music is on their server, which means they essentially search other filesharing servers for the music, and that means no vetting for malware, and (b) the site is intended for \"fact finding,\" and the user must delete any downloaded music after fact finding is done. Otherwise the user is essentially stealing the music (unless it's public domain--and no current popular music is public doman). Of course, there's no way for them to enforce that, so in general here at AC, we discourage using those sites.", "time": "04-10-2016 07:21 PM", "replies": []}]}, {"title": "How do I unlock a pin-lock screen for my Alcatel One Touch?", "thread": [{"postID": "post5110628", "text": "I forgot my four digit-pin number", "time": "04-07-2016 11:57 AM", "replies": []}, {"postID": "post5110790", "text": "Try here:http://forums.androidcentral.com/sho...d.php?t=640158", "time": "04-07-2016 01:07 PM", "replies": []}]}, {"title": "Why my phone alcatel one touch soleil indicating low memory but there's a lot of memory", "thread": [{"postID": "post5095678", "text": "in the settings there are 14.47GB free memory of SD card and 2.34GB Internal storage but when i play my candy crush games( the only games on my phone because of problem) it indicates a low memory.... so i coudnt play... what should i do.", "time": "03-30-2016 09:42 PM", "replies": []}, {"postID": "post5097371", "text": "Welcome to Android Central! Free internal storage is the most important. See this guide: http://forums.androidcentral.com/amb...-warnings.html", "time": "03-31-2016 05:29 PM", "replies": []}]}, {"title": "[OneTouch Inspire 2] I can't access my settings in any ways is there a fix??", "thread": [{"postID": "post5079907", "text": "I'm using Alcatel One touch Inspire 2 5020A after sending my phone through a mobile service the bootloop was fixed by there was something that wasn't fixed which was the settings i can't access my settings menu because it keep saying \"no applications can perform this action.--- Process %1$a is not responding.\" please is there a fix to it cause i hate it when sending my phone to mobile service again...", "time": "03-23-2016 09:36 AM", "replies": []}, {"postID": "post5080912", "text": "Welcome to Android Central! That sounds like it could be a firmware issue. Try booting into Safe Mode, which temporarily disables all 3rd party apps. On most Android devices, while powered on, press and hold Power until the Power Off menu appears. Press and hold the Power Off selection until the Safe Mode prompt appears. Tap OK.\nIf the problem disappears in Safe Mode, then something you installed is causing the problem. You may have to uninstall apps one by one until the problem disappears. If the problem persists in Safe Mode, then it's more likely to be a hardware or firmware problem.", "time": "03-23-2016 03:17 PM", "replies": []}, {"postID": "post5081686", "text": "didn't work i guess it has a problem with firmware is there a fix for it??, actually i could fix my phone but the problem is without the settings i couldn't access the developers option to activate usb debugging so if possible is there a fix for it??", "time": "03-23-2016 09:34 PM", "replies": []}, {"postID": "post5088769", "text": "Good question--I'm not sure. For that kind of thing, you might have more luck in the forums at xda-developers.com.", "time": "03-27-2016 03:03 PM", "replies": []}]}, {"title": "Why Alcatel One Touch Fierce XL is nowhere to be found in Alcatel site?", "thread": [{"postID": "post5080281", "text": "I was on Alcatel.com and I couldn't find the One Touch Fierce XL in the list of devices? Was this phone pacifically for a particular Telecommunications company?", "time": "03-23-2016 11:38 AM", "replies": []}, {"postID": "post5080800", "text": "Are you talking about this? Alcatel | ALCATEL ONETOUCH Fierce™ XL", "time": "03-23-2016 02:33 PM", "replies": []}]}, {"title": "Why can't I find space bar on my recently purchases Alcatel mobile please help so fed up?", "thread": [{"postID": "post5076085", "text": "Cannot access space bar or numbers when writing text. Jumps from one place to another grrrrr!!!!???? Has a life of its own!", "time": "03-21-2016 04:46 PM", "replies": []}]}, {"title": "My Alcatel Phone is giving me Unfortunately contacts have stopped. Can you help get this working?", "thread": [{"postID": "post5069947", "text": "Trying to add contact from text to phone contacts.", "time": "03-18-2016 01:01 PM", "replies": []}]}, {"title": "Why does the Wi-Fi turn on without my touching the icon switch?", "thread": [{"postID": "post5061730", "text": "On my Alcatel A564C Smartphone with Android 4.4.2, sometimes the Wi-Fi and the Data Connection turn on without my selecting the \"On\" icon switchs. Any suggestions why this happens? Thanks.", "time": "03-15-2016 07:56 AM", "replies": []}, {"postID": "post5062447", "text": "Welcome to Android Central! Go to Settings>Wi-fi, tap Menu>Advanced, and look for an Allow Scanning option, and turn that off.", "time": "03-15-2016 12:19 PM", "replies": []}]}, {"title": "Alcatel one touch fierce cant send video via text message. Says its to big. How to set .", "thread": [{"postID": "post5058200", "text": "When I try to send a video with this Alcatel one touch fierce 2 it says video is to big. Mms or email. Ive had other phones that you can set your video up to do this but I cant figure out how to do this on this one.", "time": "03-13-2016 10:34 PM", "replies": []}, {"postID": "post5060322", "text": "Welcome to Android Central! The maximum MMS attachment filesize is around 1 MB, which is too small for most videos to be sent with any kind of quality. The best way is to upload the video privately to some place like YouTube or your Google Photos in the cloud, then share the link with the recipient.", "time": "03-14-2016 05:23 PM", "replies": []}]}, {"title": "5042T KingRoot to SuperSU guide.", "thread": [{"postID": "post5054533", "text": "In a previous thread, i shouted from the roof tops that the 5042T finally has a rooting method.http://forums.androidcentral.com/alc...hout-root.html\nHaving done the above, i've been using KingRoot's SU app for a couple weeks.\nWhile it certainly gets the job done, it just can't compete with SuperSU. (Imho)\nThen of course there's the worry surrounding what data it collects and sends back to China.\nKingRoot however, isn't keen on having their SU app replaced and makes it notoriously difficult to do so.\nAfter days of searching and reading and putting it off, i finally got the nerve up to try the method i devised.\ni'm happy to say that it worked and went way smoother than i had envisioned.\nSo, if you have the 5042T with KingRoot but would rather have SuperSU, head on over to my G drive.\nEverything you need should be there.https://drive.google.com/folderview?...mJrbW5lZVFuWFE", "time": "03-12-2016 11:12 AM", "replies": []}]}, {"title": "Why don't any of my apps work on my Alcatel OneTouch Pixi?", "thread": [{"postID": "post5042338", "text": "I have just bought the phone topped it up , and I cant text friends call friends , use my data , and to some it all up cant do anything", "time": "03-08-2016 09:38 AM", "replies": []}, {"postID": "post5042839", "text": "Welcome to Android Central! What carrier do you have? Does your plan include texting and data? Is the phone's mobile data turned on? What other apps aren't working--only the ones that require a data connection?", "time": "03-08-2016 12:49 PM", "replies": []}]}, {"title": "How do I get into my Alcatel One Touch privacy protection phone?", "thread": [{"postID": "post5041557", "text": "Trying to get in my phone but it lock on privacy protection lock", "time": "03-07-2016 11:44 PM", "replies": []}, {"postID": "post5041636", "text": "Welcome to Android Central! Did you set the privacy protection lock, or did someone else? Or did it suddenly and inexplicably appear?", "time": "03-08-2016 12:48 AM", "replies": []}]}, {"title": "Battery Time Remaining", "thread": [{"postID": "post4990259", "text": "I have Alcatel One Touch Pixi Glitz with KK. I like the look of the Lollipop settings battery time remaining, but Kit Kat doesn't have it. Is there any way to replicate it using an app? Also I don't have root and don't want to risk it, either.\nPosted via Android Central App", "time": "02-09-2016 07:43 PM", "replies": []}, {"postID": "post5040741", "text": "Hello?\nPosted via the Android Central App", "time": "03-07-2016 05:33 PM", "replies": []}, {"postID": "post5040743", "text": "Found out I can't root\nPosted via the Android Central App", "time": "03-07-2016 05:35 PM", "replies": []}]}, {"title": "texts turn into @.", "thread": [{"postID": "post5028266", "text": "If I send a text longer than a couple of sentences the person I'm texting will only get an \"@\". Why did this all of a sudden start and how do I fix it. I've tried resetting my phone. Twice. Thanks!!", "time": "03-02-2016 03:57 PM", "replies": []}, {"postID": "post5028354", "text": "Is this by any chance happening on AT&T and between you and an iPhone? If so, that seems to be an issue that seems random and so far I haven't seen anyone solve it. It happened to me and a friend when I had the Note 3...changed to Note 4 and still happened. He changed networks and never happened again. And all reports I've seen come from people texting iPhones and most of the time if the message includes emoji.", "time": "03-02-2016 04:41 PM", "replies": []}]}, {"title": "Alcatel Android Phones", "thread": [{"postID": "post5016889", "text": "I want to share about this Alcatel Andoid phone because I have been using this phone since high school and this kind of phones are very reliable and user friendly. I have nothing to say against Alcatel. Great phone!", "time": "02-25-2016 09:50 PM", "replies": [{"postID": "post5026134", "text": "Welcome to Android Central!\nThanks for sharing!", "time": "03-01-2016 05:56 PM", "replies": []}]}]}, {"title": "Why can't I read my Alcatel a845l clipboard?", "thread": [{"postID": "post4990525", "text": "I can't read my clipboard!?", "time": "02-09-2016 11:57 PM", "replies": []}, {"postID": "post4990934", "text": "Check this:http://forums.androidcentral.com/sho...d.php?t=639479\nPosted via the Android Central App", "time": "02-10-2016 07:56 AM", "replies": []}]}, {"title": "annoying text notification!!!!!!!!!!", "thread": [{"postID": "post4971053", "text": "ALCATEL ONE TOUCH POP CON A564C while on a call, if I receive a text message my phone will start blaring my ringtone notification!!!! I have looked in message and dialer settings and cant find anyway to turn it off DURING A CALL......PLEASE HELP!!!!!!!!!!!!!!", "time": "01-28-2016 06:14 PM", "replies": []}, {"postID": "post4971073", "text": "I don't have a ONE Touch to test, but on my phone it's in the Phone app's Settings, under CALL ALERTS. There I have an option to allow or restrict notifications/alarms to sound off during a call.", "time": "01-28-2016 06:28 PM", "replies": []}]}, {"title": "Alcatel OT Idol Mini Root", "thread": [{"postID": "post4958042", "text": "How to root my Alcatel OT Idol Mini? I've tried lots of app but my phone still not rooted.\nPosted via the Android Central App", "time": "01-20-2016 05:48 AM", "replies": []}]}, {"title": "Why won't messages download on my Alcatel One Touch?", "thread": [{"postID": "post4957442", "text": "My stock message app wont let me download the images", "time": "01-19-2016 07:27 PM", "replies": []}, {"postID": "post4957454", "text": "Welcome to AC! \nWhat happens when you try to download them? Does it just say \"downloading\" for a long time or does it give you an error right away? \nAre you sure that mobile data is turned on?", "time": "01-19-2016 07:35 PM", "replies": []}]}]
[{"title": "Why do Android phones have so little internal memory?", "thread": [{"postID": "post4952228", "text": "I recently purchased a Alcatel A456C smartphone with only 4GB memory. I have installed a Micro SD card, but have now discovered that I cannot move any apps,etc. to SD Card. What a weird setup.", "time": "01-16-2016 10:14 AM", "replies": []}, {"postID": "post4952269", "text": "Limited device memory is not peculiar to Android devices.", "time": "01-16-2016 10:46 AM", "replies": []}, {"postID": "post4952292", "text": "It's not Android just some budget phones cuts areas where they can to make the phone affordable as possible.", "time": "01-16-2016 10:59 AM", "replies": []}]}, {"title": "Why won't my Alcatel download anything?", "thread": [{"postID": "post4914867", "text": "it won't download anything off the net and it won't allow me to downloads. It strarts the prosses and it fails .", "time": "12-25-2015 11:34 AM", "replies": []}, {"postID": "post4915065", "text": "Is this true with both wifi and mobile data?", "time": "12-25-2015 02:42 PM", "replies": []}, {"postID": "post4915066", "text": "When it fails,do you get an error or anything? Has it ever worked for you?", "time": "12-25-2015 02:44 PM", "replies": []}]}, {"title": "Can someone help me update my device plz?", "thread": [{"postID": "post4864419", "text": "I have a Alcatel one touch sonic LTE A581L I keep getting a pop up telling me I need to update my phone but when I try I keep getting an authentication failure plz help", "time": "11-30-2015 12:44 AM", "replies": []}, {"postID": "post4864638", "text": "Welcome.\nIt may be malware. Tell us more about what it says before we go any further.", "time": "11-30-2015 05:59 AM", "replies": []}, {"postID": "post4865488", "text": "it says authentication failure please contact service provider", "time": "11-30-2015 01:35 PM", "replies": []}, {"postID": "post4879648", "text": "How can I update my zte savvy without computer\nPosted via the Android Central App", "time": "12-08-2015 03:52 AM", "replies": []}]}, {"title": "How can I unbrick my mtk 6573 Alcatel ot 985n?", "thread": [{"postID": "post4877868", "text": "my alcatel 985n idea aurus brick by wrong flash file which flash by sp tool", "time": "12-07-2015 07:24 AM", "replies": []}, {"postID": "post4878048", "text": "Welcome to the forums. I'm not too familiar with flashing ROMs on an Alcatel, but if you can find the stock ROM file, can you boot into the bootloader?", "time": "12-07-2015 09:21 AM", "replies": []}]}, {"title": "My Alcatel Android phone went black and I can't swipe the screen to unlock it. What should I do?", "thread": [{"postID": "post4730738", "text": "I was downloading a free wallpaper on the internet on my alcatel phone. I don't know if it was a coincidence that it happened then or if I got a virus. The screen is black now and I try to swipe it and it won't swipe. I can't make any calls or texts. I can only answer calls. I can't get the phone to go any farther but go to a black screen even when I turn it off and back on. I've also tried taking the battery out and back in. What should I do or what is the problem", "time": "10-05-2015 01:49 PM", "replies": []}, {"postID": "post4852743", "text": "my mobile alcatel one touch idol ultra went black I cant swipe to unlock what will I do?", "time": "11-23-2015 06:15 PM", "replies": []}]}, {"title": "Idol 3 5.5 for $140", "thread": [{"postID": "post4838553", "text": "Deleted, moved to Idol 3 forum.", "time": "11-17-2015 02:03 PM", "replies": []}]}, {"title": "Why isn't my Alcatel Flash 2 mobile phone turning on after update?", "thread": [{"postID": "post4823604", "text": "after a small update of 32 mb(some wireless update) my phone is not switching on, only showing the boot screen for more than 4 hours. what should I do now?", "time": "11-11-2015 12:27 PM", "replies": []}, {"postID": "post4825259", "text": "mine too", "time": "11-11-2015 10:31 PM", "replies": []}]}, {"title": "Alcatel idol2s", "thread": [{"postID": "post4764545", "text": "Iam using alcatel idol 2s.volume automatically decreasing I could not find eny solution fro internet.I tried my self and found speaker connection loose rectify the issue now working fine enybody have facing the same try it", "time": "10-21-2015 10:06 AM", "replies": []}, {"postID": "post4764762", "text": "Welcome to Android Central, and thanks for that tip! I moved this thread into the main Alcatel forum.", "time": "10-21-2015 11:29 AM", "replies": []}]}]
