[{"title": "Safe to open back cover of phone while it's on?", "thread": [{"postID": "post6181355", "text": "Was wondering if it was safe to take back cover of phone off and look at the contents inside while the phone is on or is there an laser or something that can harm me / vision .. sorry posted this before but couldn't find the post again .", "time": "03-06-2018 05:27 PM", "replies": []}, {"postID": "post6181498", "text": "Yes.", "time": "03-06-2018 08:18 PM", "replies": []}]}, {"title": "Zenfone 3 unusable - how to recover from ZenUI Launcher crashing at startup?", "thread": [{"postID": "post6154018", "text": "On my Zenfone 3 I've had a number of ZenUI Launcher crashes but always gotten past them, until now.\nAsus ZenUI launcher is now consistently crashing on startup, so there is no way to do anything on the phone, no access to any menus or settings (that I know of).\nAny advice on how to get past this? (and as next step, can this crap be uninstalled?)", "time": "02-04-2018 04:46 AM", "replies": []}, {"postID": "post6154022", "text": "You can't uninstall it without root, and even if you uninstall it, the phone will stop working altogether because the Launcher is the user interface you are actually seeing when you use the phone. If your phone is connected to the internet, logon to your Google account on a PC and open the Play Store website. Look for a third party launcher, like Nova, then install it to phone from the PC. Clicking on install on the website pushes the app to the phone. Once installed you will have a second launcher on your phone to use instead of ZenUI", "time": "02-04-2018 04:57 AM", "replies": []}, {"postID": "post6154032", "text": "Thanks! But if I push a new launcher to the phone from Play Store I assume it won't automatically become the default launcher? And then I'm still stuck at ZenUI Launcher crashing, as I can't access any settings on the phone to switch launcher.", "time": "02-04-2018 05:23 AM", "replies": []}, {"postID": "post6154040", "text": "I did try pushing Nova launcher from Play Store and actually managed to get it activated on the phone. Thanks a lot!! My phone was just a brick with this ZenUI Launcher loop.", "time": "02-04-2018 05:41 AM", "replies": []}, {"postID": "post6154041", "text": "Glad you sorted it out. I usually keep another launcher on the phone just in case one crashes.", "time": "02-04-2018 05:48 AM", "replies": []}]}, {"title": "How to set lockscreen wallpaper on asus zenfone go", "thread": [{"postID": "post6148487", "text": "I just want to know how to set lockscreen wallpaper on asus zefone go. In gallery, when i set the wallpaper, there's only option for the homescreen but not the lockscreen. I also searched on settings>lock screen but there's no option for changing or setting the lockscreen wallpaper. I already searched on the settings>display>wallpapers but there's no option for lockscreen wallpaper. I also tried on themes. But the homescreen and lockscreen is also the same. I dont know how to set only the lockscreen.\nI hope that my question will be answered cause I've been searching this on google but there's no result for my phone version. My phone is Asus Zenfone Go or Asus x014d. Please answer this. Thank you in advance!", "time": "01-29-2018 04:21 AM", "replies": []}, {"postID": "post6148911", "text": "Try Wallpaper Wizardrii - it does lock screens also.", "time": "01-29-2018 02:37 PM", "replies": []}]}, {"title": "My phone wont turn on", "thread": [{"postID": "post6110765", "text": "good day everyone\nI have some problem i my asus zenfone 5.. i already change the pin charger and also the battery but still my phone wont turn on..do u guys have any opinion about this?", "time": "12-18-2017 11:12 AM", "replies": []}, {"postID": "post6111131", "text": "Plug the charger in and leave it overnight. If the battery is really dead, it could take an hour before it even starts charging. (It's almost 4 years old - the battery usually doesn't last that long.)\nIf that doesn't get it working, it has to go into a repair shop or back to ASUS - there's nothing you can do by yourself to fix it.", "time": "12-18-2017 04:15 PM", "replies": []}]}, {"title": "I can't scroll down notification bar why?", "thread": [{"postID": "post5914996", "text": "When I open any application notification bar can't scroll down when I'm on home screen it properly works on my asus t00j", "time": "08-07-2017 06:07 AM", "replies": []}, {"postID": "post5915128", "text": "Welcome to the forums. Have you tried a reboot?", "time": "08-07-2017 09:11 AM", "replies": []}, {"postID": "post5915271", "text": "Yes many times and also factory reset my phone but problem still coming", "time": "08-07-2017 11:37 AM", "replies": []}, {"postID": "post5915619", "text": "Are you using a stock ROM?", "time": "08-07-2017 04:00 PM", "replies": []}, {"postID": "post5916179", "text": "Don't know but I'm using default rom of asus t00j after that problem comes I upgraded my rom kitkat to lollipop from asus.com but problem still coming", "time": "08-08-2017 05:19 AM", "replies": []}]}, {"title": "Android Nougat for old phone", "thread": [{"postID": "post5905328", "text": "is it good if i update to Android Nougat for my zenfone 4.5 (T00Q) ?....Just asking hehe", "time": "07-30-2017 08:39 AM", "replies": []}, {"postID": "post5905444", "text": "Welcome to the forums. There may not be a ROM for that device. Your best bet would be Lineage.", "time": "07-30-2017 10:20 AM", "replies": []}]}, {"title": "Firmware without Google installer", "thread": [{"postID": "post5831890", "text": "Phone ASUS_X550 T550KLC\nVersion Android 5.1.1 Lollipop\nPhone bought in China\nI'm italian. version\nThis phone had many bugs with old software, i've update at new version ASUS_X550 (T550KLC) Software Image Version: CTCC_12.0.1.42 and all the problems it had had were resolved . Unfortunately, the new software does not have Google installe account inside, so I can not access Play Store.I tried installing Google installer after I loaded the new software but google install does not go, it hangs.There is somebody can help me to solve this problem.\nThanks\nRegards\nPietro", "time": "05-29-2017 10:34 AM", "replies": []}]}, {"title": "Unfortunately, Asus launcher has stopped?", "thread": [{"postID": "post4870647", "text": "My Asus Zenfone 5 keep popping out the msg 'Unfortunately, Asus Launcher has stopped'. And when it happens , I can't press anything. I've tried to restart but sometimes it will take a long time to start-up. So I keep restarting so sometimes the restart will success. Even after I restart it, the msg still popping out, it doesn't help to restart. Next, I've tried to use hard reset (recovery&factory reset). But the problem still occurs. What should I do? That must be something wrong in the device itself because no matter how many time you reset it the launcher stop msg keep popping out. \nPlease help me to solve it! Any help is appreciated.\nIf can, please also tell me if that problem can be solve if send to repair? Even if it sent to repair, about how much is the price? (Malaysia Ringgit)", "time": "12-02-2015 09:54 PM", "replies": [{"postID": "post5282320", "text": "", "time": "07-25-2016 07:25 PM", "replies": []}]}, {"postID": "post4870702", "text": "Welcome.\nTry downloading and installing a different launcher from the Play Store. \nIf no go, get back to us right here for more suggestions.", "time": "12-02-2015 10:26 PM", "replies": []}, {"postID": "post4870998", "text": "Thank you! But the problem is it keep popping out you can't even press anything!!!\nDo you need me to send a video so you will understand how the condition is??\n* I registered already so you will see the different name", "time": "12-03-2015 03:49 AM", "replies": []}, {"postID": "post4881839", "text": "Hey,\nFor the problem, our suggestion is to follow the below step:\nGo to Settings => Select Apps => All =>Select Zen UI services and Power saver => Clear cache and clear data and Reboot.\nWipe cache partition from recovery & make sure your device is on the latest firmware version.\nFor More FAQ's & related question check :ZenTalk wish you a Merry Christmas", "time": "12-09-2015 04:33 AM", "replies": []}, {"postID": "post4896932", "text": "I had his problem too, but not a big deal... \nWHat you can do is go to settings->apps->launcher-> clear cache. (If this doesn't work then you can try another method)\nFollow the same method and then fore stop it and restart it again.. \nDone!", "time": "12-16-2015 01:13 AM", "replies": []}, {"postID": "post4913998", "text": "We are experiencing the same problem...the trouble is you cannot open settings, or any of the apps to fix the problem. \nHELP!", "time": "12-24-2015 06:05 PM", "replies": []}, {"postID": "post5803261", "text": "I got the same problem with my ASUS ZENFONE C .. after I update my system .. now I cant use it.. it keeps popping UNFORTUNATELY STOPPED every apps I click.. \nAny Help guys ?", "time": "05-06-2017 11:27 AM", "replies": []}]}, {"title": "USPS --\"delivered to military agent\". what is this", "thread": [{"postID": "post5752888", "text": "sent my zenpad to asus service center, but says \"delivered to military agent\". it went to grapevine, tx. why would it go to a military agent?", "time": "04-10-2017 03:22 PM", "replies": []}, {"postID": "post5753371", "text": "I did some internet research and found out it could be a number of things but often it just means that \"the front desk\" signed for your package NOT there addressee. You might try calling the service center and/or the USPS on the next business day and trying to find out what is up.", "time": "04-10-2017 08:51 PM", "replies": []}]}, {"title": "But how in ZenFone", "thread": [{"postID": "post5719486", "text": "My full touch screen not work", "time": "03-21-2017 07:34 AM", "replies": []}, {"postID": "post5720779", "text": "Welcome to Android Central! Which Zenfone? There are quite a few models.\nTry booting into Safe Mode: https://www.asus.com/support/faq/1005163. If the problem persists, then the screen is faulty and needs to be replaced.", "time": "03-22-2017 03:07 AM", "replies": []}]}, {"title": "Asus zenfone 5 bricked, Need help!", "thread": [{"postID": "post5698852", "text": "I have an asus zenfone 5, When I try to turn it on I just see a USB logo and then screen goes off. \nWhen i press the volume up and power It shows asus logo and powered by android\nplz help me\nI want to fix it can anyone help me save my money?", "time": "03-04-2017 04:48 AM", "replies": []}]}, {"title": "Why is my Asus Zenfone 5 not producing any sound?", "thread": [{"postID": "post4435469", "text": "music , calls and notifications .... no sound", "time": "05-19-2015 10:02 AM", "replies": []}, {"postID": "post4435549", "text": "Welcome to Android Central! Do you hear sound through headphones (either wired or Bluetooth)? If so, the main speaker might have failed. Do you ever hear sounds from the main speaker any more?", "time": "05-19-2015 10:49 AM", "replies": [{"postID": "post5686805", "text": "My zenfone Max is the same . Call speaker is working but the speaker at the backbis not . I am using headsets everytime I want to listen to music or to watch movie .. Is there ay workaround that I can do myself to fix it?", "time": "02-22-2017 04:18 AM", "replies": []}]}, {"postID": "post4926489", "text": "help pls", "time": "12-31-2015 09:59 PM", "replies": []}, {"postID": "post5214575", "text": "My phone is not producing any sound sometimes. Please tell me why this happens", "time": "06-08-2016 06:13 AM", "replies": []}, {"postID": "post5215392", "text": "Welcome to Android Central! Perhaps you could give us more details, like answering the questions I had posed in Post #2 of this thread.", "time": "06-08-2016 03:19 PM", "replies": []}, {"postID": "post5333001", "text": "Yes, the sound can be heard when i put speakers on", "time": "08-16-2016 04:10 PM", "replies": []}, {"postID": "post5351336", "text": "Hello sir, I've Asus zenfone 5. For a few days I'm facing a annoying problem. During conversation the person from other side didn't get any sound or voice I delivered. If I turn the speaker on then they get sound. But it is very boorish making conversation turning the speaker on in a public place. Pls help me out of this problem.", "time": "08-21-2016 03:29 AM", "replies": []}, {"postID": "post5360905", "text": "Check the firmware version if thats updated, also go to settings => Sound & Notification => Other sounds = > Enable Dial pad tones.", "time": "08-24-2016 04:24 AM", "replies": []}, {"postID": "post5687130", "text": "Welcome to Android Central! As I asked in that previous post, do you ever hear any sounds from the main speaker any more? If not, then the main speaker is probably faulty and needs to be replaced.", "time": "02-22-2017 10:37 AM", "replies": []}]}, {"title": "Help TPU back cover and screen protector", "thread": [{"postID": "post5642813", "text": "Help and sorry for my bad english. Are same for both ZB500KG (my phone) and ZB500KL TPU back cover and screen protector? \nIn Italy i find only cover and screen for ZB500KL.\nThanks!", "time": "01-13-2017 04:07 PM", "replies": []}, {"postID": "post5642823", "text": "Welcome to Android Central! They should be the same:https://www.asus.com/Phone/ZenFone-Go-ZB500KG/gallery/https://www.asus.com/Phone/ZenFone-Go-ZB500KL/gallery/", "time": "01-13-2017 04:14 PM", "replies": []}, {"postID": "post5642915", "text": "Thanks for reply!\nIn specifications the measures are not the same.\nThey differ by a few millimeters...", "time": "01-13-2017 05:50 PM", "replies": []}, {"postID": "post5642998", "text": "Oh, you're right. Sorry, I didn't look carefully at the specs. I'm not sure, then. It sure seems odd that two variants of the same phone model would have different dimensions!", "time": "01-13-2017 08:00 PM", "replies": []}]}, {"title": "Guys.. I really Need Help... My Phone Just Automatically Shutsdown and Not Powering Up after Plu", "thread": [{"postID": "post5636739", "text": "Guyzz.. need Help Phone Not working anymore after i plug it into a new Powerbank .... Any Solutions ... and Remedies??? Plzz Help.. \nSMartphone : Asus Zenfone..", "time": "01-09-2017 05:18 AM", "replies": []}, {"postID": "post5636943", "text": "You have your standard charger came with your phone ? If yes, plug that and see whether the phone is indicating charging.\nPost the results here.", "time": "01-09-2017 08:38 AM", "replies": []}, {"postID": "post5637391", "text": ".. Thanks for replying ..... umm still not working ma'am/sir.. even if i plug my Asus charger i cannot power up the phone and the phone is not indicating that its charging ...", "time": "01-09-2017 02:26 PM", "replies": []}, {"postID": "post5637438", "text": "Have you tried a soft reset? Don't worry, you won't lose any data. Press and hold down the Power button for approximately 8-10 seconds. See if that does anything.\nKeep us updated!", "time": "01-09-2017 02:52 PM", "replies": []}, {"postID": "post5637472", "text": "Welcome to Android Central! Are you saying that the phone was working and charging normally until you plugged it into a new powerbank?\nMy guess is that either the battery or the microUSB port failed. You probably need to bring it to a repair shop.", "time": "01-09-2017 03:16 PM", "replies": []}, {"postID": "post5637582", "text": "Thanks For replying sir/ma'am...but its still not working i tried it over 1 min but still not powering up..", "time": "01-09-2017 04:48 PM", "replies": []}, {"postID": "post5637584", "text": "Thanks For Replying sir... i once tried bringing it into the repair shop but they seems can't figure out the problem .... they check the Battery tried over again but its still the same .... maybe i'll recheck it again .. on a skilled Technician ... Thanks ..", "time": "01-09-2017 04:51 PM", "replies": []}, {"postID": "post5637652", "text": "Ask them to test the battery and the charging port. It's also possible that the motherboard has failed.", "time": "01-09-2017 05:29 PM", "replies": []}, {"postID": "post5637939", "text": "They already tried it . sir .. but it seems it still not working .... they've. already check the battery .. but still not working... i think the main problem is the Motherboard...", "time": "01-09-2017 10:44 PM", "replies": []}, {"postID": "post5638044", "text": "That's too bad. Is this the original Zenfone? I'm assuming it's no longer under warranty.", "time": "01-10-2017 01:02 AM", "replies": []}, {"postID": "post5638244", "text": "Yes Sir . it's the Original Zenfone.... Too bad my Warranty already pass.. because its only 7-days", "time": "01-10-2017 07:19 AM", "replies": []}, {"postID": "post5638332", "text": "From where did you get your phone? I would still bring it back to the store and see what they can do for you.", "time": "01-10-2017 08:50 AM", "replies": []}]}, {"title": "Why is my Asus Zenfone black screen blocked when I call or receive call?", "thread": [{"postID": "post5218347", "text": "my Asus Zenfone after the last update 2 days ago of android has a black screen blocked when I call or receive call. I was told by asus to reboot the system cause the problem is android I did that and after it updated android again the same problem is back. Can someone tell me how I can get this fixed.", "time": "06-10-2016 10:50 AM", "replies": []}, {"postID": "post5628820", "text": "Hi!! My asus phone is zenfone go and unfotunately the LCD i guess got damaged that's why the screen is sometimes going black or sometimes it just acts really weird. It still touches though and functioning well except for the screen which most of the times not showing anything. Ive consulted couple of repair shops about replacing the LCD but im really having doubts of replacing it bec I may just waste my money for LCD replacement and still get the same issue. Now my question is, is it practical to replace the LCD or just buy a new phone instead? Thanks to whoever can provide ma an answer. That would be a great help.", "time": "01-02-2017 10:20 AM", "replies": []}]}, {"title": "Echo filtering not working during phone call", "thread": [{"postID": "post5381985", "text": "Hello there,\nI'm using my ASUS ZenFone 5 T00F about 2 years. But last two months I'm a problem.\nThe remote person who listens to my talk by phone call facing a lot of noise when I'm outdoor. I've changed my phone microphone but problem not solve.\nWhen I'm using WhatsApp or Facebook messenger or another app then the phone is pretty well. The only problem occurs when I call someone by the phone call.\nI've reset phone two times and also downgraded Lollipop to Kitkat. After resetting sometimes calls is ok but after one day or less than one-day same problem started.\nWhat can I do? Please advise me.\nThanks", "time": "08-31-2016 02:44 PM", "replies": []}, {"postID": "post5382117", "text": "Welcome to Android Central! Is the phone in a case? If so, make sure make sure the secondary mic (which is probably along the top of the phone) isn't blocked. A blocked secondary mic might cause problems with noise cancellation.", "time": "08-31-2016 03:30 PM", "replies": []}]}, {"title": "Email icon disappeared after reset - How can I get it back?", "thread": [{"postID": "post5164951", "text": "Email Icon is disappeared after the reset of my Asus mobile. how to get again email \nicon.\nwe can see or open a more the mail account in one email icon.", "time": "05-07-2016 02:47 AM", "replies": []}, {"postID": "post5165084", "text": "Hi, the app could be missing from the home screen, can you locate the app when you open the app drawer on the home screen? if you can, long press on the app and this will allow you to place the app on the home screen again. \nWere you using the Gmail app or the one that was pre-loaded on the phone?", "time": "05-07-2016 06:33 AM", "replies": []}, {"postID": "post5351165", "text": "Go to Application tray, press Edit at the top right hand side of the screen and you should be able to see the missing app icon. It worked for me with my Samsung Galaxy smartphone.", "time": "08-21-2016 12:53 AM", "replies": []}]}, {"title": "I have an ASUS ZENFONE C 1A charger, if I buy a 2.1A charger, will it damage the battery of phone?", "thread": [{"postID": "post5275150", "text": "Can i buy a charger of different company of 2.1A?", "time": "07-21-2016 05:11 AM", "replies": []}, {"postID": "post5275159", "text": "Welcome to Android Central!\nIt will heat the phone and if it reaches high temps the battery can be damaged\nBest regards,Mikey. I hope you found what you were looking for.\nSent from my Samsung Galaxy S7 Edge SM-G935F.", "time": "07-21-2016 05:36 AM", "replies": []}]}, {"title": "My Asus Zenfone 5 cannot get any connections, why?", "thread": [{"postID": "post5274086", "text": "cannot get wi fi connection and cannot update software", "time": "07-20-2016 12:24 PM", "replies": []}, {"postID": "post5274807", "text": "Welcome to Android Central! Is it only wi-fi you're having problems with? What about mobile data (unless you're using it as a wi-fi only device)?\nDoes this happen with any wi-fi network? See this guide for some tips: http://forums.androidcentral.com/amb...-problems.html", "time": "07-20-2016 09:57 PM", "replies": []}]}, {"title": "New Phone, Can't Sync ANY Google Accounts?", "thread": [{"postID": "post5274255", "text": "I just replaced my android phone. It a ASUS Zenfone 5. I connected it to my wifi and then it did a major update. After it restarted I added my Gmail account that I used on my previous Zen phone and it's also my youtube account but it will never sync? \nSo then made 3 brand new google accounts through my phone but they never sync! Yet I can log into them through the phone browser or on my laptop.\nSo basically none of my apps will work because this phone won't sync google accounts?\nI tried via wifi and mobile data. Please does anyone know what the problem might be?", "time": "07-20-2016 02:25 PM", "replies": []}]}, {"title": "How do I save pictures from texts to my gallery?", "thread": [{"postID": "post5274151", "text": "I have a ASUS Zenfone", "time": "07-20-2016 12:59 PM", "replies": [{"postID": "post5274178", "text": "Welcome to the forums. Are they pictures sent via MMS or from a different texting app? In general, if you tap or long press on the picture a menu should open with the 'save' option included.", "time": "07-20-2016 01:21 PM", "replies": []}]}, {"postID": "post5274158", "text": "Welcome to Android Central!\nCan you describe a little bit more what you want to do? \nBest regards,Mikey. I hope you found what you were looking for.\nSent from my Samsung Galaxy S7 Edge SM-G935F.", "time": "07-20-2016 01:06 PM", "replies": []}]}, {"title": "My phone restarts when I press the power button (Zenfone 5 running on Lollipop 5.0) how can I stop this?", "thread": [{"postID": "post4462682", "text": "My phone was water damaged and when I had KitKat 4.4.2 , Wi-Fi and Bluetooth , Camera weren't working but I could lock my screen. When I updated to Lollipop , my device keeps restarting when it's on the lock screen or simply doesn't let my phone to be locked! I can't lock my phone at all and so I have to keep my screen ON forever! Is there a solution for this? Thanks in advance", "time": "06-01-2015 10:11 AM", "replies": []}, {"postID": "post4462855", "text": "Welcome to Android Central! Unfortunately, water damage can be unpredictable and progressive, so it's hard to say what you can do to fix this. It might just be the Power button, but the problems might still persist even after replacing it.", "time": "06-01-2015 11:28 AM", "replies": []}, {"postID": "post5248648", "text": "I don't have any water damage or any hardware damage to my phone. but I am having the same problem after I upgraded my zenfone 6 to lollipop from KitKat. please advice", "time": "07-02-2016 11:23 AM", "replies": []}]}, {"title": "Need help! for Asus Zenfone 5. No display. Not charging. Vibrates randomly.", "thread": [{"postID": "post5181904", "text": "Hello everyone. Please help me.\nMy phone hang while watching a video. I refresh it by turning it off. But to my surprise, as far as I can remember, the screen turned black (slowly) as it turned off. So I open it after a few minutes, but sadly it never open since. I tried to charged it but no response. I plugged it on my laptop but no response. Except that it vibrates when I plugged it on. Then after a few minutes, no response again.\nI have a feeling that my phone is charging while attached to my laptop, because the back feels hot (but not too hot).\nSo what shall I do about this issue? Can someone please tell me that my last option is to get it fix at the asus service here in the Philippines?\nplease. I really need help.", "time": "05-17-2016 11:51 AM", "replies": []}, {"postID": "post5182078", "text": "Welcome to Android Central! Plug it into a wall outlet and let it charge undisturbed overnight. Then try powering on by pressing and holding Power for at least 15-20 seconds. If nothing happens (or if the battery still gets hot while charging), then the battery may have failed. You'd have to bring it to a repair shop to replace the battery (or to further investigate the problem).", "time": "05-17-2016 02:08 PM", "replies": []}]}, {"title": "Asus Zenphone 5, Why does it randomly made loud buzzing noises during calls?", "thread": [{"postID": "post4553050", "text": "Asus Zenphone - 5 phone has randomly made loud buzzing noises during calls. Sounds similar to speakers that make a buzzing noise in between talking and gap in our speech.", "time": "07-14-2015 11:14 AM", "replies": [{"postID": "post4558501", "text": "Welcome to Android Central!\nDoes it do the same thing while talking on speaker phone while on a call?", "time": "07-17-2015 06:49 AM", "replies": []}]}, {"postID": "post5163387", "text": "I have the same problem here", "time": "05-06-2016 02:47 AM", "replies": []}, {"postID": "post5163388", "text": "In my case it does the same thing while talking on speaker phone while on a call, help please", "time": "05-06-2016 02:48 AM", "replies": []}]}, {"title": "Why does my Asus ZenFone 5 stuck at logo after update?", "thread": [{"postID": "post5094119", "text": "Hi everyone, i ask for your help cause i have a common problem but the fixes i found in the forum didn't work for me: my ZenFone 5 stucks at \"Asus\" logo with a \"loading loop\" wheel below that.\nI know this post may be long but i beg you to read all steps:\n1) Phone stucks at logo, but could enter recovery (pressing vol + down), i've updated it via external SD card (official firmware but didn't work) then i've wiped data and did a factory reset. Phone still stucks at logo.\n2) Now i can't even enter recovery mode... when pressing vol + down it shows 2 options but whatever i choose the phone reboots. If i press vol + up it says \"CSC mode, long press power to restart. Phone still stucks.\n3) Now (after some time) the phone's screen doesn't show anything, nor charging icon or notification led when recharging, but strangely the computer recognizes it as a device when connected via USB cable, and the led turns on when i do this.\nA friend told me to follow a guide that says to install \"Intel Soc USB driver\", i did that. After installing, when connecting the device, this should pop up in the Device manager: http://s5.postimg.org/feo7yfj4m/cloverview.jpg but doesn't show to me.\nI've also tried Asus flashtool guide... at step 4 it says to click in the box icon and choose the firmware RAW file, so i've downloaded a raw firmware for the ZenFone 5, but oddly it doesn't let me choose any raw file.\nNote: the phone is recognized by the pc as \"QHSUSB_BULK\", so i've tried to update its driver with qualcomm drivers, and now it's recognized as \"Qualcom MMC Usb storage device\". But i think i've did a wrong thing cause my friend told me i should have choosed some kind of official driver\nThanks in advance for your help", "time": "03-30-2016 06:17 AM", "replies": []}, {"postID": "post5094906", "text": "Moved to the ZenFone forum.", "time": "03-30-2016 01:16 PM", "replies": []}]}, {"title": "How can I fix unfortunately, WeQR has stopped?", "thread": [{"postID": "post4879773", "text": "every time i turn on my tablet, it keeps on showing this message on the screen. i can't unlock my tablet. it buggs me a lot. \nhelp!~", "time": "12-08-2015 07:01 AM", "replies": []}, {"postID": "post4881161", "text": "Welcome to Android Central! I've seen WeQR mentioned before, and it sounded like malware. Are you able to boot into Safe Mode? Safe Mode function has been added to Android system since Android 4.1. Similar as the Safe Mode function in Windows system, when the Android device starts up to access Safe Mode, only the factory pre-installed applications will be loaded. This functi", "time": "12-08-2015 06:33 PM", "replies": []}, {"postID": "post5085367", "text": "i can't get into my tablet, i cant unlock it or do anything, everytime i tap ok, it pops back up immediately\n*it's version 4.2.2", "time": "03-25-2016 01:40 PM", "replies": []}]}, {"title": "(Urgent) Why does my Asus Zenfone 5 stuck at logo after firmware update?", "thread": [{"postID": "post5082262", "text": "Sorry guys if i ask for help, i've tried ton of fixes but still didn't resolve it, seems like other ppl had this problem but the fixes don't work for me...\nProblem 1: Zenfone 5 stucked at \"Asus logo + loading wheel\" after turning on (i could enter in recovery mode but not droidboot)\nWhat i did --> entered recovery, updated firmware via external SD, formatted phone and wiped cache\nProblem 2: Zenfone 5 still stucks at logo, but now when i press vol+up it says \"CSC mode, long press power to restart\" and when i press vol+down it shows two options, and whatever i choose the phone reboots.\nProblem 3: Zenfone 5's display is always black, doesn't show anything when charging or after pressing any button, but the PC recognizes it as \"QHSUSB_BULK\" device\nWhat i did --> searched for guides, tried to update QHSUSB_BULK's drivers with Qualcomm drivers, and then it's recognized as a disk drive \"Qualcom MMC Usb storage device\". \nWhat happened --> a person told me i choose the wrong drivers, and i have to download drivers from official site, but which ones?\nThis person also suggested me to follow \"asus flashtool\" guide, but when i press the \"box\" to open a RAW firmware it doesn't let me choose the raw firmwares i downloaded.\nThis person also suggested me to follow the guide called \"Hard Bricked Zenfone Unbrick (Last method to try) \nBut in step 3 it says i should get \"Intel Soc USB driver\" and that doesn't show in my computer management\nSorry if i wrote too much, i really beg for your help, thanks in advance", "time": "03-24-2016 07:53 AM", "replies": []}]}, {"title": "HELP! My phone can't move apps to SD card", "thread": [{"postID": "post5055722", "text": "I have an ASUS Zenfone 5 which is not rooted. One day, all my photos (taken from the camera) are gone. But my saved pictures are still there. When I installed an app, I usually move it to external sd card using app2sd. It gave me notifications that the app can be moved. But when I tried to move it, the button \"Move to SD Card\" is greyed out and unclickable.Now I don't have enough space to download apps! I have an ASUS T00F Android 4.4 and my SD card is a sandisk 8gb card. I'll appreciate all kind of help\nPosted via the Android Central App", "time": "03-12-2016 09:25 PM", "replies": []}, {"postID": "post5057373", "text": "Welcome to Android Central! Run SD Insight to make sure the card is valid, and not counterfeit. If it's valid, Unmount the card in Settings>Storage, remove the card, and insert it into your computer and run chkdsk to look for bad sectors: http://forums.androidcentral.com/amb...d-sd-card.html", "time": "03-13-2016 04:09 PM", "replies": []}, {"postID": "post5061446", "text": "Then, what should I do next? The app showed me all of the datas and I already know the chkdsk command. But I'm afraid I will lose all my files. Will it delete my files??\nPosted via the Android Central App", "time": "03-15-2016 03:53 AM", "replies": []}, {"postID": "post5062271", "text": "Are you saying that SD Insight confirmed the card is valid, and not counterfeit?\nYou can always back up all of the SD card data onto your computer hard drive before running chkdsk.", "time": "03-15-2016 11:16 AM", "replies": [{"postID": "post5063223", "text": "Yeah, of course. It showed all of my datas. I'll show you the pic later. For the command, do you need to conmect the phone to pc or use a micro sd reader?\nPosted via the Android Central App", "time": "03-15-2016 05:32 PM", "replies": []}]}, {"postID": "post5062296", "text": "Try to connect your SD Card to pc, does it recognise your SD Card? Can you move some files from/to your SD Card?\nOr just take a pict and put to sd card, does it save?\nIf it's not, maybe your SD Card is broken.", "time": "03-15-2016 11:23 AM", "replies": []}, {"postID": "post5062524", "text": "Merged threads. Please continue the discussion in this thread, rather than creating new threads with the same question--thanks!", "time": "03-15-2016 12:46 PM", "replies": []}, {"postID": "post5063289", "text": "Yeah, I'll try it later. Thanks for the suggestion\nPosted via the Android Central App", "time": "03-15-2016 05:57 PM", "replies": []}, {"postID": "post5063296", "text": "That's the pictures. And I've just noticed something. I'm using LINE Camera, but when I move the storage to SD card it says it can't. I'll give the pic later.\nPosted via the Android Central App", "time": "03-15-2016 05:59 PM", "replies": []}, {"postID": "post5064890", "text": "I was under the impression that App2SD and similar apps required root. You can use it on an unrooted phone?", "time": "03-16-2016 11:13 AM", "replies": []}, {"postID": "post5065844", "text": "Yeah. I was thinking the same. Then my friend told me it's working on his phone, which is an unrooted phone\nPosted via the Android Central App", "time": "03-16-2016 05:31 PM", "replies": []}]}, {"title": "Can I take photosphere on an Asus Zenfone 4?", "thread": [{"postID": "post5028968", "text": "anybody have an apps for do that?", "time": "03-02-2016 10:03 PM", "replies": []}, {"postID": "post5030266", "text": "Welcome to Android Central! Photosphere requires a gyroscope, which the Zenfone 4 doesn't have, so it won't be possible.", "time": "03-03-2016 12:50 PM", "replies": [{"postID": "post5030862", "text": "whether there are applications that do not require a gyroscope?", "time": "03-03-2016 05:30 PM", "replies": []}]}, {"postID": "post5033583", "text": "I really doubt it. Photospheres require the phone to know if it's pointing up, down or straight ahead. That requires a gyroscope. I don't think any of the other sensors (like the accelerometer) can emulate that.", "time": "03-04-2016 09:14 PM", "replies": [{"postID": "post5047234", "text": "How about \"360 panorama\" apps by occipital??", "time": "03-09-2016 07:58 PM", "replies": []}]}, {"postID": "post5049070", "text": "You could always try installing it from Google Play Store. If the Play Store says it's incompatible, it probably also needs a gyroscope.", "time": "03-10-2016 12:23 PM", "replies": [{"postID": "post5053337", "text": "360 Panorama has been removed from google play. But now im using 360 panorama and work perfectly without gyro... \nI hope someone update this apps for better experince \nThank you very much", "time": "03-11-2016 09:02 PM", "replies": []}]}, {"postID": "post5056542", "text": "Do you have a link to the apk?", "time": "03-13-2016 10:45 AM", "replies": [{"postID": "post5061467", "text": "Sorry i can't post the link now..\nBut you can search in google \nType '360 panorama by occipital' than search \nGood luck", "time": "03-15-2016 04:14 AM", "replies": []}]}]}, {"title": "ASUS mobile data goes off after entering sleep mode, why?", "thread": [{"postID": "post5041837", "text": "i have seen my friend's phone,ASUS zenfone(i don't remember which one he used)while he locked his phone its mobile data goes off and every messages from wechat won't pop-up until he unlock his phone", "time": "03-08-2016 04:23 AM", "replies": []}, {"postID": "post5043750", "text": "Welcome to Android Central! It probably has to do with the power saving mode.", "time": "03-08-2016 06:04 PM", "replies": []}, {"postID": "post5044621", "text": "Check under Auto start Manager if the Application is not in deny list also make sure the device is not in super saving mode as the network gets disabled.", "time": "03-09-2016 01:16 AM", "replies": []}]}]
[{"title": "How can I turn my Asus Zenfone 5 off so that it will charge?", "thread": [{"postID": "post4792635", "text": "please help me guys, i really dont know what to do about it", "time": "10-31-2015 05:53 PM", "replies": []}, {"postID": "post4792648", "text": "Hi and welcome to AndroidCentral. \nYour device should charge even if it is on.", "time": "10-31-2015 05:59 PM", "replies": []}, {"postID": "post4839565", "text": "Recalibrate battery\nTo recalibrate battery,charge your phone to 100% without interruption.\nthen discharge it normally till 0%(phone gets switched off).\ncharge it to 100% in switched off condition and keep it in that state for a little more time.\nnow switch on your phone in charged condition and unplug when ASUS logo appears.\nkeep the phone unused for 5 mins.\nyou will get far better battery life as the battery stats.bin file will be updated.\nYou may log on to zentalk forum to post your problem.", "time": "11-17-2015 11:32 PM", "replies": [{"postID": "post4997124", "text": "Posted via the Android Central App", "time": "02-14-2016 10:42 PM", "replies": []}]}, {"postID": "post5017977", "text": "Longpress power button until it offs mate.", "time": "02-26-2016 01:19 PM", "replies": []}]}, {"title": "How do I recover data from damaged device thru USB?", "thread": [{"postID": "post5003669", "text": "Dear Expert,\nI got a real tough problem with my Asus-Zenfone-5 Android device.\nThe device had got badly damaged and the only thing it is willing to do now is to show on screen the charging process sign (A battery icon) when the cord is pluged to ELECT.\nWhen I connect the device by USB to my pc It doesn't recognize it at all and Showing \"Unknown device\" at that certain port.\nCould anyone Help me please in getting my data out of this device?\nThanks a lot\nYossi", "time": "02-19-2016 06:03 AM", "replies": []}]}, {"title": "How to straighten an upside down video rec. on a Asus Zenfone selfie?", "thread": [{"postID": "post4997376", "text": "I was holding the camera recording button to the left as I was to take the video in a hurry.", "time": "02-15-2016 05:56 AM", "replies": []}]}, {"title": "Fail to save Network Error", "thread": [{"postID": "post4979400", "text": "I am unable to connect to WIFI after a factory reset in my Asus Zenfone 4 .\nit shows \" Fail to save Network\"", "time": "02-03-2016 01:06 AM", "replies": []}, {"postID": "post4987469", "text": "Hey Sinu Nair,\nCheck if your router is not blocking your device.\nTry factory resetting your device & your router.\nCheck with a different router & also with a different device with the same router.", "time": "02-08-2016 03:09 AM", "replies": []}]}, {"title": "Hi, my Zenfone 5 a501cg is dead. No Droidboot. Only Android recovery. Please help. What should I do?", "thread": [{"postID": "post4981455", "text": "I flashed the wrong recovery and rom. After that, my zenfone 5 is dead. No droidboot. It has only android recovery. Cannot do any fastboot commands. I tried using Phone flash tool, Asus Flash Tool and even xFSTK-Downloader. But no luck.", "time": "02-04-2016 01:56 AM", "replies": []}, {"postID": "post4982313", "text": "You have hard bricked your phone. Your motherboard is now corrupted. GOTO to service centre. If you have warranty it will be done for free, but if you don't they charge lot of money.\nPosted via the Android Central App", "time": "02-04-2016 12:26 PM", "replies": []}]}, {"title": "How do I fix my Zenfone 5 lite A502CG Hard Bricked?", "thread": [{"postID": "post4977857", "text": "i update manually my zenfone 5 lite a502cg 1.i download the latest firmware 2. i install all requirements . 3 after that i turn off my phone and then i press volume up + power botton = Droidboot then i choose recovery after that my cellphone has rebooting itself and i saw No command and i tap volume down and volume up im here now in Android system recovery or Fastboot then i choose apply update from ADB and next step i open fastboot falsh tool in my computer and i type in command adb sideload UL-ASUS_T00K-WW-2.21.40.29-user.zip after 100% i see in my cellphone update failed or error install aborted i reboot system now and i stock in ASUS IN SEARCH OF INCREDIBLE powered by android and ican't access in droidboot Fastboot only", "time": "02-02-2016 07:39 AM", "replies": []}]}, {"title": "Root ASUS mobile?", "thread": [{"postID": "post4973307", "text": "Hello Support, how can I root my Asus Zenfone 5 T00K ?", "time": "01-30-2016 09:02 AM", "replies": []}, {"postID": "post4973358", "text": "Use this apps kingroot or kingo root or for pc iroot", "time": "01-30-2016 09:44 AM", "replies": []}]}, {"title": "Upgrade android version for ZenFone 5", "thread": [{"postID": "post4971529", "text": "Does anybody get android 5.0 for ZenFone 5?", "time": "01-29-2016 03:34 AM", "replies": []}, {"postID": "post4971984", "text": "1. It's up to the manufacturer and the carrier - they both have to write parts of the update.\n2. Since the phone isn't a flagship, and it's almost 2 years old, I doubt that many, if any, carriers will update it to 5.0.", "time": "01-29-2016 09:57 AM", "replies": []}]}, {"title": "wechat isn't compatible", "thread": [{"postID": "post4964643", "text": "After i formatted my asus zen5, i try to installed back my wechat, but it says that, \"your device isn't compatible for this version\" how can i fix this problem..\nPosted via the Android Central App", "time": "01-24-2016 01:34 PM", "replies": []}]}, {"title": "wechat compatible", "thread": [{"postID": "post4963970", "text": "Why i can't install my wechat after i formatted my asus zen5..it says \"this device isn't compatible for this version\"\nPosted via the Android Central App", "time": "01-24-2016 01:26 AM", "replies": []}]}, {"title": "zenfone 4 64gb memory card?", "thread": [{"postID": "post4955611", "text": "I've used 3 micro sd cards and they seem to stop my music from playing as the files aren't correct? This can't be right, as the phone can accept 64gb cards. Can any of you owners tell me which memory card you're all using? Thanks.", "time": "01-18-2016 06:26 PM", "replies": []}, {"postID": "post4956875", "text": "Did you get all of the cards from the same seller? If so, they might all be counterfeit. Run SD Insight to check their validity.", "time": "01-19-2016 01:19 PM", "replies": []}, {"postID": "post4962526", "text": "Hi tried this on my main phone and the card isn't even legit lol, great app, thanks.", "time": "01-22-2016 09:11 PM", "replies": []}]}, {"title": "Hidden nuplayer option", "thread": [{"postID": "post4602118", "text": "Hi. Few days ago I update my Zenfone 5 to Lollipop. Today I wanted to turn off nuplayer but I cant find this option in developer settings. I used search and my phone found it but it's hidden.", "time": "08-11-2015 07:04 PM", "replies": []}, {"postID": "post4956644", "text": "Could you solve this problem?", "time": "01-19-2016 11:37 AM", "replies": []}]}, {"title": "How to partition internal memory ?", "thread": [{"postID": "post4952200", "text": "Hello. I am using Asus Zenfone Go zc500tg . Although the internal memory of the phone is 8gb , I can only use 4gb of it. The other 4gb is being used by the system . Is there anyway I can partition the internal sd card and use the full 8 gb as my internal memory?", "time": "01-16-2016 09:51 AM", "replies": []}, {"postID": "post4953190", "text": "Welcome to Android Central! That 4 GB used by the system is taken up by system files. The OS has to be stored somewhere. The internal storage that a phone is advertised with is never the total that is available to the user--it's always some number that's lower (and yes, this is also the case with iPhones). 8 GB phones usually have about 3-4 GB available to the user.", "time": "01-17-2016 02:44 AM", "replies": []}]}, {"title": "Asus Zenfone 5 application updates, why don't they finish?", "thread": [{"postID": "post4949608", "text": "I need help when i go to play store and try to update my apps they only go to about 50-70% and then stops. I tried already to turn on location or logout from google account or turn off and on phone. Also i had checked all settings and everything looks fine. There is no any messages saying that is something wrong.", "time": "01-14-2016 02:40 PM", "replies": []}, {"postID": "post4949826", "text": "Welcome to Android Central! Does this happen on both wi-fi and mobile data?\nTry going to Settings>Apps>All, select Google Play Store, and Clear Cache/Clear Data, then Force Stop. Do the same for Download Manager. Now try again.", "time": "01-14-2016 04:43 PM", "replies": []}]}, {"title": "Asus Zenfone 2 cant Fast Charging anymore", "thread": [{"postID": "post4931149", "text": "Hi, sorry..\nI need help..\nMy phone cant Fast Charge..\nMy phone 4gb ram.\nI usualy charge only 90 minutes for 90% battery.\nNow 10% to 100% battery 3 to 4 hours..\nAny wayout ?", "time": "01-04-2016 06:04 AM", "replies": []}, {"postID": "post4931376", "text": "Hi, welcome to the forums! Does the problem persist after a reboot? I had a similar problem with my phone and it worked again after a power off & on.", "time": "01-04-2016 08:56 AM", "replies": []}, {"postID": "post4934251", "text": "Mine Couldn't fast charge anymore too.\nI made an update Just yesterday, (I was thinking that may be the cause *Shrugs*)\nI am using the Adaptive charger provided by Azus. And had tried different cables too.\nI have rebooted my device, and even Let it charged while power is off overnight. everything seemed not working. Normally It takes 1 hour before it get fully charge, now, 10 hours?! That sucks!", "time": "01-05-2016 06:57 PM", "replies": []}]}, {"title": "How can I remove the guest mode icon from my Asus Zenfone?", "thread": [{"postID": "post4931909", "text": "i once used guest mode on my asus zenfone 2 laser ze550kl. after i switched back, there still is icon at bottom left corner of start screen \"Guest Mode\". How can i remove it ? thanks \nP.S. it cant be clicked on", "time": "01-04-2016 02:12 PM", "replies": []}]}, {"title": "Zenfone 6 Facebook Interface", "thread": [{"postID": "post4931779", "text": "Hii everyone with zenfone 6\nMay i see screenshot of your facebook homepage\nThank you", "time": "01-04-2016 01:04 PM", "replies": []}]}, {"title": "Why is that there is a blinking red light on the top RIGHT(near on the front cam) of my Zenfone 4 ?", "thread": [{"postID": "post4920800", "text": "even there's no up coming call? How to stop it? please help me.", "time": "12-28-2015 10:33 PM", "replies": []}, {"postID": "post4921053", "text": "Welcome to Android Central! That's where the regular LED notification light is, right? Blinking red often indicates battery trouble--have you noticed any?", "time": "12-29-2015 02:56 AM", "replies": []}]}, {"title": "HP: Zenfone 4A450CG : why is it when I restart Unfortunately, ZenUI Launcher has stopped appears?", "thread": [{"postID": "post4907754", "text": "lastnight i updated the system", "time": "12-21-2015 07:21 PM", "replies": []}, {"postID": "post4907836", "text": "Try to clear cache in the bootloader", "time": "12-21-2015 08:19 PM", "replies": []}]}, {"title": "Frozen screen, destroyed power button. What do I do?", "thread": [{"postID": "post4897154", "text": "my phone's screen has frozen for almost 2 hours already and my power button isn't working. i can still receive messages and calls but i cannot answer them. please help, my phone is an asus zenfone 5 lite.", "time": "12-16-2015 06:00 AM", "replies": []}, {"postID": "post4897164", "text": "There are apps AFAIK to change how to power up a device but as yours is frozen you won't be able to install so you will need to get it professionally repaired", "time": "12-16-2015 06:06 AM", "replies": []}]}, {"title": "Slow charging, random screen wake ups and USB connections not working. What could the problem be?", "thread": [{"postID": "post4812485", "text": "My phone, Asus Zenfone 5 (A501CG), takes too much of time to charge (6-7 hours).\nAlso, the screen wakes up randomly every 5 seconds (approx.).\nThe phone doesn't connect to a PC (it's not recognized) and OTG doesn't work either.\nIn Settings, it shows that the phone is charging on USB even when it's charging on AC.\nIt happens in safe mode too.\nWhat can be issue?\nCan a faulty micro-USB port cause this?\nPlease help me.\nThis has rendered my phone useless.", "time": "11-08-2015 01:01 AM", "replies": []}, {"postID": "post4813805", "text": "Welcome to Android Central! Try wiping the cache partition: [TUTORIAL] Zenfone 5 Cache Wipe Partition..-ZenFone5", "time": "11-08-2015 04:34 PM", "replies": []}, {"postID": "post4888481", "text": "Same problem here too D:\nPosted via the Android Central App", "time": "12-12-2015 08:53 AM", "replies": []}]}, {"title": "Zenfone 5 (android L) charging speed", "thread": [{"postID": "post4876382", "text": "Is every ZenFone 5's charging speed slow or just mine? My battery charged about 10% every half hour, about 4 hour to fully charged. Zenfone 5 user, please tell me?\nPosted via the Android Central App", "time": "12-06-2015 08:11 AM", "replies": []}, {"postID": "post4879679", "text": "@ iScreamSoda\nTry to re-calibrate battery\nTo re-calibrate battery, charge your phone to 100% without interruption, then discharge it normally till 0%(phone gets switched off).\nCharge it to 100% in switched off condition and keep it in that state for a little more time now switch on your phone in charged condition and unplug when ASUS logo appears keep the phone unused for 5 mins, you will get far better battery life as the battery stats.bin file will be updated.", "time": "12-08-2015 05:15 AM", "replies": []}, {"postID": "post4888478", "text": "What do you mean by discharge it normally? Just keeping the phone's screen on without using app or what? I don't get it tho...\nPosted via the Android Central App", "time": "12-12-2015 08:51 AM", "replies": []}]}, {"title": "How do I root my ZenFone 5 t00j kk 4.4.2?", "thread": [{"postID": "post4877383", "text": "I've tried lot of apps but it's not working give solution to root my phone....", "time": "12-06-2015 09:34 PM", "replies": []}, {"postID": "post4877678", "text": "Have you tried watching tutorials on YouTube?", "time": "12-07-2015 03:29 AM", "replies": []}]}, {"title": "Can I get some help with a serious issue?", "thread": [{"postID": "post4850192", "text": "i've rooted my asus zenfone 5 lollipop, and i've also uninstall some system apps..,\nthen, i factory reset my phone, hoping the deleted system apps got recovered..,\nbut, no..,\nthe deleted system apps are my keyboard.., i've tried to boot load, but it does not open.., i'm out off idea guys,\nplease help..,", "time": "11-22-2015 03:27 PM", "replies": []}, {"postID": "post4857887", "text": "Hi Guest,\nIf you have rooted your phone, the warranty is voided.", "time": "11-26-2015 01:06 AM", "replies": []}, {"postID": "post4876324", "text": "Try Download an original rom amd flash it\nPosted via the Android Central App", "time": "12-06-2015 07:19 AM", "replies": []}]}, {"title": "Why is my Zenfone 5 flashing USB logo when booting?", "thread": [{"postID": "post4866839", "text": "Good day everyone.\nI have a problem regarding my zenfone 5. I hope you can help me.\nearlier, I tried to system upgrade(through update) my zenfone 5, but it failed.\nnow, everytime I try to open it, it only flash a USB logo(flash it for about half a second) and it's not opening.\nwhat should I do??", "time": "12-01-2015 06:15 AM", "replies": []}, {"postID": "post4867597", "text": "Welcome to Android Central! I think I saw that somewhere else, either here on AC or on Google+. It might mean that the USB port has failed.\nHave you posted your question on the ZenTalk forum? You might get a more direct response from ASUS there: ZenTalk", "time": "12-01-2015 12:38 PM", "replies": []}, {"postID": "post4868941", "text": "Hi Guest,\nI suggest you to go to the service center to check.", "time": "12-02-2015 02:37 AM", "replies": []}, {"postID": "post4876153", "text": "Hi, Press and hold your power button and volume up button together and see it works or not \nPosted via the Android Central App", "time": "12-06-2015 02:08 AM", "replies": []}]}, {"title": "Why can't I seem to upgrade Android?", "thread": [{"postID": "post4870388", "text": "im using Asus zenfone 5 T00J with kitkat that have been rooted.. since now lolipop has been release, i cant upgrade it in normal way.. can anybody teach me???", "time": "12-02-2015 07:11 PM", "replies": []}, {"postID": "post4870996", "text": "You can't update it via OTA as you rooted your phone. Try flashing a ROM.", "time": "12-03-2015 03:47 AM", "replies": []}]}, {"title": "Why doesn't my Asus Zenfone 5 charge?", "thread": [{"postID": "post4792680", "text": "can you please help me", "time": "10-31-2015 06:12 PM", "replies": []}, {"postID": "post4792918", "text": "Welcome. \nI'll have to guess a little at what the question is. \nIf you have more than one device, and they charge okay from the same charger, except for your Asus Zenfone 5, then that phone may have a dirty or damaged USB port connector, among other possibilities.\nBut perhaps I've guessed the question wrong?\nPosted via the Android Central App", "time": "10-31-2015 08:41 PM", "replies": []}, {"postID": "post4839559", "text": "try to factory reset your device.\nIf the issue still persist, you will need to visit the service center.", "time": "11-17-2015 11:28 PM", "replies": []}]}, {"title": "Faded colour on zenfone 5 help?", "thread": [{"postID": "post4837804", "text": "My zenfone 5 A501cg is showing very much faded colours after i finished charging.\nIt didn't happened previously.\nI viewed screenshot on other phone and it was perfect.\nSo plz suggest some solution?", "time": "11-17-2015 09:53 AM", "replies": []}, {"postID": "post4838491", "text": "Welcome to Android Central! Is every screen faded? Does it persist after a reboot?", "time": "11-17-2015 01:44 PM", "replies": []}, {"postID": "post4839477", "text": "Make sure you are on latest FOTA version.\nWipe cache partition and if issue still persist, factory reset your device.\nTry SMMI test:\nGo to Calculator=>type \" .12345+= \"\nyou will be entered to SMMI_TEST", "time": "11-17-2015 10:15 PM", "replies": []}]}, {"title": "My Zenfone 6 just died yesterday, I cant turn it on anymore. What should I do?", "thread": [{"postID": "post4823558", "text": "I was having a call yesterday when my phone just shut automatically. I tried everything but it didn't work . it happens to me everytime but it only took a minute and then i can turn it on already. But now its been 1 day already and its still not working. I cant turn it on. Please help me to fix my phone", "time": "11-11-2015 12:15 PM", "replies": []}]}, {"title": "How do I retrieve my pictures, they all went in the garbage pail (this is the first phone I've ever had)?", "thread": [{"postID": "post4805244", "text": "The phone is an Asus", "time": "11-05-2015 08:34 AM", "replies": []}, {"postID": "post4806785", "text": "Welcome to Android Central! Which garbage pail are you talking about? Did you delete them while using the Gallery app? Or the Google Photos app?", "time": "11-05-2015 05:27 PM", "replies": []}]}]
[{"title": "Why isn't my Asus Zenfone R opening PDF files?", "thread": [{"postID": "post4733872", "text": "Its showing The document can not be opened because it is not a valid PDF document. Though in other device it is opening.", "time": "10-07-2015 01:33 AM", "replies": []}, {"postID": "post4798869", "text": "Hey AC Question,\nYou can download an application called qpdf reader from playstore the device might be having issue or the pdf file might have gone corrupt.", "time": "11-03-2015 04:04 AM", "replies": []}]}, {"title": "Why can't I send a picture message on Zenfone 2E?", "thread": [{"postID": "post4715586", "text": "I recently bought an ASUS Zenfone 2E and I haven't been able to send or receive any picture messages and I don't know why. Can someone help me out? I have AT&T", "time": "09-28-2015 11:48 PM", "replies": []}, {"postID": "post4715773", "text": "What you mean u can't send picture? I assume this is MMS. You have to configure APN for this. I can't post link. But go to google and type \"at&t mms android\".", "time": "09-29-2015 03:57 AM", "replies": []}, {"postID": "post4746349", "text": "I am having issues with the same phone as well, but I have made 1 discovery. You need to go to settings and then Data. Slide the data \"switch\" to ON. This will allow you to text send and receive pictures but unfortunately your phone will keep asking you Sign-in to Network. I am currently try to figure out how to make that stop.\nThis all stems from not having a data plan, but I think there must be a way around it.", "time": "10-13-2015 07:01 AM", "replies": []}, {"postID": "post4798858", "text": "Hi anniefears,\nYou need to enable data for sending picture & check if your MMS APN settings are correct", "time": "11-03-2015 03:48 AM", "replies": []}]}, {"title": "How do I restore the date and time display panel on my Zenfone4?", "thread": [{"postID": "post4788128", "text": "on zenfone4", "time": "10-30-2015 01:58 AM", "replies": []}]}, {"title": "How do I restore the time and date panel in the home panel on my Zenfone 4?", "thread": [{"postID": "post4788125", "text": "this is for zenfone 4 home page date & time display", "time": "10-30-2015 01:53 AM", "replies": []}]}, {"title": "I deleted Misc Files and lost some data, how can I recover it?", "thread": [{"postID": "post4784605", "text": "I deleted my misc files because i think misc same like cache but i lost my data and some note, how to recover that files \nPS: I never do back up in my zenfone 5", "time": "10-28-2015 09:55 PM", "replies": []}, {"postID": "post4784845", "text": "Welcome to Android Central! It's not advisable to delete things unless you're absolutely certain of what they are. You're probably out of luck. Recovering deleted files from Internal Storage requires rooting (which in itself might overwrite that data). See this guide: http://forums.androidcentral.com/amb...ted-files.html", "time": "10-29-2015 12:25 AM", "replies": []}, {"postID": "post4784940", "text": "B. Diddy is correct. Don't delete anything you're not absolutely positive you know it's OK to delete.\nYou may end up having to reinstall the OS. Chances of recovering those files are poor. See this:http://forums.androidcentral.com/one...ml#post4768111", "time": "10-29-2015 01:11 AM", "replies": []}]}, {"title": "How to disable Android 5.0 Asus Zenfone 7 K01N Emergency Alert?", "thread": [{"postID": "post4768663", "text": "How to disable Android 5.0 Asus Zenfone 7 K01N Emergency Alert", "time": "10-23-2015 01:06 AM", "replies": []}]}, {"title": "Google Maps navigation crashing frequently on Zen Phone 2E after latest Maps update", "thread": [{"postID": "post4756211", "text": "Recently I updated Google Maps on my Zen Phone 2E and now I can't use navigation any more due to frequent hangs and crashes. What can I do? Can I downgrade Maps? Is this a known problem and will Google issue an update soon?", "time": "10-17-2015 09:15 PM", "replies": []}, {"postID": "post4756500", "text": "Welcome to Android Central! Try going to Settings>Apps>All, select Maps, and Clear Cache/Clear Data, then Force Stop. If that doesn't work, then try a cache partition wipe: New Steps to Wipe Cache in Zenphone 2-ZE551ML", "time": "10-18-2015 02:09 AM", "replies": []}, {"postID": "post4756604", "text": "Thank you, I tried your first step, and the next time I drive I will see if I can use the navigator again. If not, I will try your second step. It may take me a few days to make enough trips in the car to really test the navigation.", "time": "10-18-2015 04:56 AM", "replies": []}]}, {"title": "How to disable Android 5.0 Asus Zenfone7 K01N Emergency Alert: Low Zone 80?", "thread": [{"postID": "post4741761", "text": "After I upgrade my Asus Zenfone7 K01N from Android 4.4 to 5.0, the Emergency alerts saying \"LOW ZONE 80%\" always pop up. It really annoy me because it disturbing me from typing text, and also disturbing me when I watch videos. Why did this happen? and how to disable the alerts? Thanks in Advance", "time": "10-10-2015 11:53 PM", "replies": []}, {"postID": "post4741845", "text": "Welcome to Android Central! I've never seen a message like that on my Zenfone 2. Is that all it says?", "time": "10-11-2015 12:45 AM", "replies": []}, {"postID": "post4742368", "text": "Yes. That is all it say. Sometime it say \"LOW ZONE 80%\" and sometime \"LOW ZONE 25%\". The percentage number is random. This is the screenshot of the emergency alert", "time": "10-11-2015 09:30 AM", "replies": []}, {"postID": "post4743050", "text": "That's weird. \"Emergency Alert\" suggests it's from the Emergency Broadcast System, or something similar. Go into your Call Settings and look for those emergency alert settings. See if you can turn any of them off. I don't have my Zenfone 2 in front of me right now, so I can't tell you the exact menu location yet.", "time": "10-11-2015 03:46 PM", "replies": []}, {"postID": "post4743421", "text": "The problem is now solved. The emergency alert did not appear anymore after I take out my sim card from my Asus and change it with another sim card. I think my sim card cause this problem and not the update. Thanks for helping me with this. Cheers\nPosted via the Android Central App", "time": "10-11-2015 06:53 PM", "replies": []}]}, {"title": "How do I sync an Asus Zenfone calendar to Microsoft Outlook including the contacts and schedules?", "thread": [{"postID": "post4721694", "text": "Same question here...", "time": "10-01-2015 10:24 AM", "replies": []}]}, {"title": "Why won't my Asus Zenfone 4 uninstall apps?", "thread": [{"postID": "post4694360", "text": "I hv asus zenfone 4. Whenever i want to uninstall apps or clear the app's data, my phone jst restart itself. & annoyingly, after it restart, the app that i've choose to uninstall is still there;not uninstalled yet. Anyone knw whats wrong with my phone & how to fix it?\nI'm sorry for my bad english, but please help me.\nThank you.", "time": "09-19-2015 09:25 AM", "replies": [{"postID": "post4715777", "text": "What yours OS version? First think you should do is upgrade it. Most of time it's solve problem like this. If not let me know, i will try help you.", "time": "09-29-2015 03:59 AM", "replies": []}]}]}, {"title": "ZenFone 5 not waking up / unlocking", "thread": [{"postID": "post4703566", "text": "Basically, I'll be doing something on my phone and decide to lock it and if I try to unlock it straight away nothing happens and the phone appears to be none-responsive. I can see the backlight for the screen turning on as the phone tries to unlock but nothing happens..\nIts becoming a problem because if i lock the phone by mistake I cant get back on for 5+ minutes sometimes without rebooting the phone.\nIt might be worth noting that I had this issue a while back and it fixed itself after a few months of usage, but I recently factory reset my phone and for some reason the issue came back (It probably has something todo with one of the pre-installed apps or settings)\nRunning android version 4.4.2 (is rooted but the problem was happening before the root)\nAny help is appreciated, thanks in advance!", "time": "09-23-2015 01:04 PM", "replies": []}, {"postID": "post4711370", "text": "It's hard to say what is wrong with your device. I have once similar problem (but no root). I update software and now i don't have such problem. If you don't want to go for 5.0 make sure you have the newest version of 4.4.2, i think they fix it in newer version.", "time": "09-27-2015 04:47 AM", "replies": []}]}, {"title": "Unable to transfer files in my mobile using USB cable.", "thread": [{"postID": "post4707112", "text": "I am currently using zenfone 5 (A501CG). I have recently replaced the battery through local technician. Now i am unable to see my device in computer after connecting it using the USB cable.", "time": "09-25-2015 02:26 AM", "replies": []}, {"postID": "post4711367", "text": "They might factory reset. You have to:\nSettings -> Storage ->Icon in right top corner -> MTP", "time": "09-27-2015 04:40 AM", "replies": []}]}, {"title": "Why is my battery drain so fast and heated fast?", "thread": [{"postID": "post4709092", "text": "my asus zenfone 5 battery drain so fast and heated fast and become hang i have used only for six month i have used it happen by version or too much app install", "time": "09-26-2015 12:10 AM", "replies": []}, {"postID": "post4709211", "text": "Welcome to Android Central! Charge up to 100%, then let it drain to 20-30% with normal usage, without charging in between. Then show us:\n1. The main Settings>Battery screen.\n2. The fullscreen battery graph screen (which shows Awake time and Cell Signal Strength).\n3. The Screen category (to see total Screen On time).\n4. The Cell Standby category, if present (to see Time Without Signal).http://forums.androidcentral.com/amb...d-central.html\nWhat you're describing often ends up being a failing or defective battery, so you might have to look into getting it replaced.", "time": "09-26-2015 02:00 AM", "replies": []}]}, {"title": "Why won't my ASUS Zenfone boot?", "thread": [{"postID": "post4687146", "text": "I tried turning on my zenfone 2 and it's stuck on the loading screen!!!! And even when I try to get to recovery mode through pressing power button and volume up button, it's still stuck on the same loading page!!! Help!!!", "time": "09-16-2015 12:15 AM", "replies": []}]}, {"title": "How to unlock a locked Asus Zenfone 5?", "thread": [{"postID": "post4679178", "text": "I forgot my pattern on asus zenfone 5 (android 5.0) with USB debugging enabled but I unfortunately did not authorize any computer. Now I am unable to get my device unlocked which contains some important data related to my project and other crucial information. I also do not have any option to turn my data pack ON or my wifi ON. If you could help me with either\n1. Unlock my device without loosing data\n2. Turn ON wifi\n3. Turn mobile data pack ON\nI would be very much thankful to you. \nPS: I haven't used my mobile for the past 10 days since it got locked.", "time": "09-12-2015 09:31 AM", "replies": []}]}, {"title": "My Asus Zenpad S 8.0 refuses to play uploaded mp3s & other audio properly. What could the problem be?", "thread": [{"postID": "post4679161", "text": "After installing the sd card, I moved some music into a specified folder for music, but on playback, the Asus player skips and skews, as if the files were corrupted. The same files play perfectly through my PC and laptop. \nAnyone got any clues as to the problem and/or fixes?", "time": "09-12-2015 09:23 AM", "replies": []}]}, {"title": "Asus Zenfone 5 firmeware & battery questions, can I get some help?", "thread": [{"postID": "post4678820", "text": "1) How do I check the firmware version of my Asus Zenfone 5 LTE?\n2) My Zenfone 5's battery is draining alarmingly fast, does it have to do with the Android 4.4.2 i.e. will updating to Lollipop help?", "time": "09-12-2015 04:22 AM", "replies": []}, {"postID": "post4678891", "text": "Welcome to AC.\n1) Look in Settings, About Phone.\n2) What do your battery usage stats indicate? Make a screenshot of them before you need to recharge and post it here. We'll try to diagnose.\nPosted via the Android Central App", "time": "09-12-2015 06:22 AM", "replies": []}]}, {"title": "On my Asus Zenfone 5, when I install some large games, why does it say unfortunately stopped working ?", "thread": [{"postID": "post4678741", "text": "when i install some heavy or some best quality game in my asus zenfone 5 and open it said unfortunately stopped working or sometime it open but stuck or it doesn't run .why? somebody please tell me why and please solve it.", "time": "09-12-2015 02:29 AM", "replies": []}]}, {"title": "Why am I unable to connect to a hot spot?", "thread": [{"postID": "post4669901", "text": "Hi.\nI created a hotspot using the command prompt.\nThe hotspot is successfully being created. Other devices are able to detect the hotspot,but they are not connecting to the network.\nMy phone-ASUS ZenFone 5 has detected the hotspot and the SSID is being displayed, I typed the password and there is an error saying ‘Authentication problem’.\nI have attached a screenshot regarding the same.\nPlease help.\nThank you.", "time": "09-08-2015 06:24 AM", "replies": []}]}, {"title": "How do I restore my app & data back up of Zenfone 4 on any other phone?", "thread": [{"postID": "post4666942", "text": "I used to own a Asus Zenfone 4 400cg, i had its data backed up with its proprietary Back up app i backed up all my data and have the backed up apps and their data with me which is in .abu1 extension.\nI lost my phone a few days back and wanted to retrieve data but was unable to restore the apps and their data.\nI even tried the Backup app port of Asus Zenfone 4 but was still unable.\nWill you be able to help me in retrieving/ restoring apps and data.\nDoes the data need to be extracted?\nOr i am screwed and would need to buy Asus zenfone again to get my data back.", "time": "09-06-2015 06:08 PM", "replies": []}]}, {"title": "How do I remove unwanted mods on my Zenfone 5 which I installed, when they create some problems?", "thread": [{"postID": "post4658208", "text": "i install multi user mod on my zenfone 5 it works fine but on main user it not work and says \"system ui has stopped working\". i want to delete it. but it disable command also does not work.i want my system as prev in lollipop update factory reset not work.i remove data and cashe also.please help.", "time": "09-03-2015 12:19 AM", "replies": []}]}, {"title": "Asus phone unsuccessful root!!!! Can I get some help?", "thread": [{"postID": "post4644104", "text": "When i root my asus zenfone 5 t00j then i remembered that i was doing wrong method. Then i stop rooting in half. And now i don't get factory reset through settings or nor through hardware buttons. Plz help me. I 'm very thankful to u..", "time": "08-28-2015 10:20 AM", "replies": []}, {"postID": "post4644135", "text": "Welcome to the forums. You are probably going to have to flash the stock ROM, and then start all over.", "time": "08-28-2015 10:32 AM", "replies": []}, {"postID": "post4652543", "text": "I didn't understand.. can U plz explain brifly.. thankX", "time": "09-01-2015 02:02 AM", "replies": []}, {"postID": "post4653065", "text": "Reflashing means essentially to reinstall Android all over again.", "time": "09-01-2015 09:03 AM", "replies": []}, {"postID": "post4656056", "text": "but how sir i had downloaded ROM file from official website", "time": "09-02-2015 10:49 AM", "replies": []}, {"postID": "post4656329", "text": "You can use ADB on Windows or Linux to push the files. You will have to set up your PC for ADB. There are lots of YouTube videos about setting up ADB. \nYou already have the file? What type of file is it?", "time": "09-02-2015 12:42 PM", "replies": []}]}, {"title": "Can I manually keep up-to-date OS and apps on my rooted ZenFone?", "thread": [{"postID": "post4482175", "text": "Hello,\nI am aware, that Asus does provide instructions on how to root their Zenfone 5. that Asus also provides firmware downloads from their Support website.\nHowever, per Asus, I would stop receiving automatic updates from Asus if I were to root my phone. \nThus, what I'd like to know is, after having rooted my phone: Will I be able to manually keep my phone firmware up-to-date by fetching the firmware file from Asus Support site and manually applying the firmware update myself? Will I be able to update my non-Asus apps from PlayStore just like I can do now on my unrooted phone?\nEverytime I ask Asus this question, they give me a blanket and somewhat unhelpful response, saying something to the effect of, \"We don't advise you to root your phone as you will lose your warranty and stop receiving automatic updates.\" \nI have already upgraded to Lollipop / 5.0 last week, and I don't think Asus will be releasing Android M. So, I'm thinking of taking the plunge and rooting my Zenfone 5. \nWould greatly appreciate your advice.\nMany thanks,\n/pi_ni", "time": "06-09-2015 12:20 PM", "replies": [{"postID": "post4489297", "text": "Welcome to Android Central!\nMore than likely you will not be able to tell the phone to fetch the update. If it does manage to download the update it will more than likely fail to install. If you tried to flash the update yourself to the phone from the firmware they have on their site more than likely you will lose root access if it doesn't fail to install.", "time": "06-12-2015 07:53 AM", "replies": []}]}, {"postID": "post4642926", "text": "Thanks\nPosted via the Android Central App", "time": "08-27-2015 09:20 PM", "replies": []}]}, {"title": "I cant hear the sounds after the phone calls disconnected anymore", "thread": [{"postID": "post4636795", "text": "Hey everyone,\nI want to ask you about problem with my asus zenfone 5. I recently updated my android version from kitkat to 5.0 lollipop (i find the way to upgrade it from asus official website) and i found a little bit problem thats bugging me.\nNow, when someone calls me via normal phone calls and when they end the calls i cant hear any sounds that indicating that the phone calls is over anymore. You know sounds like (tut or beep). So can anyone told me what can i do with my phone setting? I really appreciated your help. Thx", "time": "08-25-2015 07:29 PM", "replies": []}]}, {"title": "Asus Zenfone 5 Original Video Player", "thread": [{"postID": "post4628660", "text": "Video player won't play Video from the internet (Android 5.0)", "time": "08-23-2015 01:38 AM", "replies": [{"postID": "post4630880", "text": "", "time": "08-24-2015 03:08 AM", "replies": []}]}]}, {"title": "My Zenphone 5 cannot connect to PC", "thread": [{"postID": "post4331926", "text": "Whe n I connect zenphone 5 to PC, the PC does not recognise the device.\nThe message in the PC is Unknow USB device. I have down load Intel Android Driver but it not work. Please help me!", "time": "04-05-2015 10:23 AM", "replies": []}, {"postID": "post4333338", "text": "Welcome to Android Central! Have you tried a different cable? Can you also try connecting to a different Windows PC?", "time": "04-06-2015 12:00 AM", "replies": []}, {"postID": "post4563326", "text": "Same problem - almost - mine doesn't register at all. Tried both my linux desktop and laptop, and a windows PC. tried all my usb ports and more than 1 cable.\nThis happened before and I solved it once by using a different USB port, and another time by switching to MTP. right now it's on MTP.\nI wouldn't mind re-learning how to reinstall the device drivers, but my problem started with being unable to access the files. I need to back them up somehow before going through with this. And I'm reluctant to back them up on the cloud. \nCan anyone help?\nTHX", "time": "07-20-2015 08:38 AM", "replies": []}, {"postID": "post4586909", "text": "I think it doesn't really work. You need to use a special cable (forgot the name) in order for your phone to work on your Smart TV", "time": "08-02-2015 12:41 PM", "replies": []}]}, {"title": "In my YouTube app, why isn't the audio and video synchronizing -Asus Zenfone 5 Lollipop?", "thread": [{"postID": "post4582129", "text": "i have an asus zenfone 5 and i upgrade it to 5.0 but after upgradation the youtube app doesnt work good the audio and video not synchronize properly there is delay between them .i tried to find the solution over internet in many site and blog but i cant find anything so if you know about anything then suggest me !! \n-THANK YOU !~!", "time": "07-30-2015 10:47 AM", "replies": []}]}, {"title": "Where do I post a report on a bad phone and service?", "thread": [{"postID": "post4377646", "text": "Asus Zenfone 5 with bad camera two phones brought one great one very bad, photo's to proove difference and was told had two year warranty and ASUS agree its a hardware problem but tell me its not there problem,\nI would like to inform everyone about the dismal service ASUS supply and the fact that they say its not there problem with emails to proove them denying responsibility.\nRegards Peter", "time": "04-22-2015 02:13 AM", "replies": []}, {"postID": "post4378058", "text": "Welcome to Android Central.\nI'm sorry if you've had a bad experience but we'd need more details and preferably both sides of the story for this to be of any use. I'll pass your comments on though.\nPosted via the Android Central App", "time": "04-22-2015 08:33 AM", "replies": []}, {"postID": "post4378252", "text": "If you are wondering about anywhere to report ASUS, perhaps the Better Business Bureau.", "time": "04-22-2015 09:57 AM", "replies": []}, {"postID": "post4380118", "text": "ASUS doesn't seem to care about customer service. I've had run-ins with them before (a desktop with an expansion slot but \"the customer isn't supposed to open the computer\" kind of stupidity, and they have no idea what escalation or level 2 means), so I've just stopped buying their products. I'll praise companies with good customer service (and have here, many times), but I won't deal with companies that make getting a warranty replacement a full-time job.\nIf enough people took that attitude (the general attitude of the American public seems to be \"well, you can't expect everything to work right\"), the bad companies would be out of business.\nYou do have legal recourse when it comes to a warranty (it's a legally binding contract), but even for a flagship device, it's not worth the expense. If you win, you lose. If you lose, you lose more.", "time": "04-22-2015 11:54 PM", "replies": []}, {"postID": "post4383113", "text": "Thanks for all the replies \nI was just wanting to let people know that they need to think twice about buying a ZENFONE 5\nas they are not a consistent product.I have allready started legal proceedings with the supplier not that I am expecting to get far,But we will see.\nRegards Peter", "time": "04-24-2015 05:20 AM", "replies": []}, {"postID": "post4571604", "text": "I'm using asus zenfone6 android kit Kat 4.4 version, I have a problem I'm unable connect conference call in my phone", "time": "07-24-2015 02:03 PM", "replies": []}]}, {"title": "Asus Zenfone 5 - Improved brightness after updating to Lollipop", "thread": [{"postID": "post4561675", "text": "Hi! \nI just noticed that after updating my phone to Lollipop the brightness improved. Is that also the case on your phone?\nPosted via the Android Central App", "time": "07-19-2015 07:13 AM", "replies": []}]}, {"title": "Asus ZenFone C ZC451CG ROM", "thread": [{"postID": "post4552020", "text": "hello there.\nI'm just getting a new phone for my brother. the phone run quiet well for daily use but too much build in bloatware.(Asus web browser, MYASUS,ect)\nI'm thinking about uninstalling those apps but seems can't. I'm looking for Cyanogenmod ROM but no luck for this model.\nany idea to remove those bloatware. it take too much space in storage.\nSent From My Lumia 930 Using Tapatalk", "time": "07-13-2015 07:36 PM", "replies": []}]}]
[{"title": "Asus Zenfone 5 :- why can't I type the letter Y?", "thread": [{"postID": "post4550565", "text": "im using Zenfone 5 LTE past 6 months. i cant manage to type letter Y. Other alphabets able to type. can you update me what the issue? the phone is still new in condition.", "time": "07-13-2015 02:40 AM", "replies": []}]}, {"title": "How can I root my Asus Zenfone 6 Z002?", "thread": [{"postID": "post4487202", "text": "Pls help m", "time": "06-11-2015 11:14 AM", "replies": []}, {"postID": "post4550462", "text": "You can find it on xda forum.\nThey have step by step method.\nPosted via the Android Central App", "time": "07-13-2015 12:00 AM", "replies": []}]}, {"title": "Is an Asus Zenfone 5 a good buy?", "thread": [{"postID": "post4274651", "text": "is asus zenfone 5 a better buy than any other phone in that range?", "time": "03-09-2015 09:10 AM", "replies": [{"postID": "post4274695", "text": "Are there any other phones you are considering? If you are looking for the best buy off-contract then that may not be the phone to go with. Others are available for around the same price range, including newer models such as the Moto G (2015). Let us know what carrier you plan on using and what other devices you are considering and we'll try to provide a little more specific help.", "time": "03-09-2015 09:40 AM", "replies": []}]}, {"postID": "post4547962", "text": "If you can handle the poor battery life(while you run large apps) it is the best buy for that price. \nYou won't be getting any other cell phone with such features at such price\nPosted via the Android Central App", "time": "07-11-2015 01:10 PM", "replies": []}]}, {"title": "Why am I unable to receive calls?", "thread": [{"postID": "post4460838", "text": "I am Using Asus Zenfone 5. Whenever someone calls me up and i pick up the call, i can't hear a damn thing what the other person is saying, but when I call them up, i can hear everything, so I am able to make calls but unable to recieve (as in i can't hear anything). Please help.\nReally looking fwd for a solution. Thanks", "time": "05-31-2015 11:49 AM", "replies": []}, {"postID": "post4547958", "text": "I had a similar problem with my galaxy grand. If you have any third party call recording apps installed, uninstall it. \nIf that doesn't work disable Asus built in call recording feature. \nElse perform a factory reset. \nIf it doesn't work you better visit an authorised service centre\nPosted via the Android Central App", "time": "07-11-2015 01:07 PM", "replies": []}]}, {"title": "What Zenfone should I get?", "thread": [{"postID": "post4540879", "text": "should get the zenfone 2 2gb model or the 32gb model with 4gb of ram and it got the cpu with 1.8ghz", "time": "07-07-2015 07:18 PM", "replies": []}]}, {"title": "Asus zenfone6 a601cg", "thread": [{"postID": "post4528106", "text": "Dear Franz,I have un beliveable smart phone of ASUS....Asus zenfone6.But after updating my phone i was facing problem of call droping issue rapidly....ie,5 mins,10 mins,and again and again...but frnz now problem hasbeen solved.....plz network settings either 2g,or 3g but dont select 2g/3g option....call drop issue will resolve...try it...\nThanks\nFalguni", "time": "07-01-2015 03:04 PM", "replies": []}, {"postID": "post4528940", "text": "Welcome to Android Central, and thanks for your tip! Although that's more of a workaround--hopefully ASUS will release a patch in the near future to correct that.", "time": "07-01-2015 10:27 PM", "replies": []}]}, {"title": "When is the Asus Zenfone selfie going to be released in India?", "thread": [{"postID": "post4527167", "text": "I am keen to buy asus zenfone selfie thus i am eagre to know the release date in India.", "time": "07-01-2015 08:43 AM", "replies": []}, {"postID": "post4527210", "text": "Welcome to the forums. It looks like it won't be released for a few more months. Asus Zenfone Selfie ZD551KL - Full phone specifications", "time": "07-01-2015 09:01 AM", "replies": []}]}, {"title": "New Zenfone 2 doesn't activate with H2O.", "thread": [{"postID": "post4472434", "text": "I bought the new Asus Zenfone 2 ZE551ML. I tried connecting to my provider H2O and my Sims weren't able to connect. I tried the same Sim in my old phone and it's activated.\nI was told the Asus Zen 2 and H2O were good to go.\nI talked to Asus and gave him all the info like what bands etc and waiting for him to get back to me.\nI live in LA, heavily populated. My service goes through AT&T with H2O as my MNVO.\nThis is depressing.\nMy bands are 850/1900 for 3G+HSPA, i'm also covered for 4LTE.\nWhat's the problem?", "time": "06-05-2015 01:06 AM", "replies": [{"postID": "post4487718", "text": "Welcome to Android Central!\nYou may need to set up the APN settings for H2O.https://www.h2owirelessnow.com/mainC...taManualConfig", "time": "06-11-2015 02:25 PM", "replies": []}]}]}, {"title": "How do I root my Asus Zenfone 4?", "thread": [{"postID": "post4477056", "text": "how to root asus zenfone 4", "time": "06-07-2015 05:13 AM", "replies": [{"postID": "post4485117", "text": "Welcome to Android Central!\nGive this thread a look and see if it gets you rooted.How to Root ASUS Zenfone 4 | Android Development and Hacking | XDA Forums", "time": "06-10-2015 03:02 PM", "replies": []}]}]}, {"title": "Zenfone 5 ISO not working properly", "thread": [{"postID": "post4465228", "text": "Hello guys! So, I'm having this issue with my Zen 5 where manually setting the ISO turns everything black! Completely dark! \nI have a Lumia 730 for comparison and ISO works as it should! \nAnyone experienced the same? Do I have a faulty device? \nAlso I must say, disappointed with low-light performance after all the advertising I've seen and even some reviews, thought it would be better, but it's complete crap!\nMaybe because I'm used to the great quality of Lumia cameras?", "time": "06-02-2015 10:12 AM", "replies": []}]}, {"title": "Asus Zenfone 2,4,5,6 users, let share your experience here", "thread": [{"postID": "post4413642", "text": "Hii, I'm using Asus Zenfone 5 with 2GB ram and 16GB rom. Overall, this smartphone is so good, no lag and had good performance on HD games. Multitasking is good too, with 2 gigs of ram which is big enough for me. And latest new from Asus, Zenfone 4,5,6 will get Lollipop update on mid May 2015. What do think guys? Are you using this smartphone too?? Share your experience here.\nNote : Sorry if my english looks bad, it's not my native language.\nPosted via the Android Central App", "time": "05-08-2015 07:34 AM", "replies": []}, {"postID": "post4413646", "text": "Everything is good except battery life. Has to recharge twice per day when use it heavily. I own a Zenfone 4.", "time": "05-08-2015 07:37 AM", "replies": []}, {"postID": "post4418784", "text": "The Zenfone 5 is one of the most popular phones right now in the Philippines. My 8-month experience with two of them has been really good. Battery is manageable with proper use. Performance is well above average. Looks can be stunning, depends on if you use a case or not, and what case you use. And the frequent software update is a big plus. I got mine in Jellybean, has been updated to Kitkat, and we're now expecting the Lollipop update anytime this month.\nA very good phone over-all.", "time": "05-10-2015 11:56 PM", "replies": []}, {"postID": "post4435019", "text": "im using zenfone5.. i want to ask how to change backround in messages mine doesnt have a personalize setting.. they say i should update the latest asus message in the app store but when i do it says that my device isnt compatible.. how come? imin kitkat OS", "time": "05-19-2015 06:05 AM", "replies": [{"postID": "post4460217", "text": "Try Asus Zensupport. Theirs an app for that too. Maybe they can help. Or you can sideload it.", "time": "05-31-2015 03:15 AM", "replies": []}]}, {"postID": "post4460215", "text": "I've got the Zenphone 4 (4.5\" screen version) and it works great. No issues. Nice to see the Asus continually updates all of their apps unlike some others ( I'm talking to you HTC)", "time": "05-31-2015 03:13 AM", "replies": []}, {"postID": "post4460975", "text": "I'm using zenfone 4 and i'm facing notification sound problem, when the phone is locked/sleep, it doesnt ring any notification sound but the calls, alarm, etc is works fine, and everything juat works fine when the screen is on.", "time": "05-31-2015 12:55 PM", "replies": []}]}, {"title": "Notification bug", "thread": [{"postID": "post4460954", "text": "I am Zenfone 4 user, i'm having problem with the notification sound, when it's locked or \"sleep mode\", the notification sound is partially audible or nothing comes up at all when i receive a text message or IM or anything, call ringtone and alarm work just fine, i did some research through the net and nothing seems work, i'm tired of doing factory reset. Any suggestion?", "time": "05-31-2015 12:49 PM", "replies": []}]}, {"title": "Why does my clock screen display randomly on my Zenfone 5?", "thread": [{"postID": "post4441337", "text": "I have a Zenfone 5 for almost a week and I'm noticing that from time to time when unlocking the phone or even when using it, suddenly the clock (where you can set alarm, world clock, timer) opens by itself.\nAny guess why this is happening?\nThanks", "time": "05-21-2015 11:18 PM", "replies": []}, {"postID": "post4442531", "text": "Welcome to Android Central! Are you accidentally tapping on a clock widget?", "time": "05-22-2015 01:07 PM", "replies": [{"postID": "post4443444", "text": "No, the problem occrus even when using the phone, not only when I'm unlocking.", "time": "05-22-2015 11:19 PM", "replies": []}]}, {"postID": "post4443471", "text": "Yes, but you can also have a clock widget on a homescreen, so that's why I was asking. You don't have any clock widgets on your homescreen?", "time": "05-22-2015 11:43 PM", "replies": []}]}, {"title": "Asus ZenFone 4, ZenFone 5, ZenFone 6 Android 5.0 Lollipop Update Delayed", "thread": [{"postID": "post4441607", "text": "Asus has announced that the ZenFone 4, ZenFone 5, and ZenFone 6 smartphones' scheduled Android 5.0 Lollipop update has been delayed.\nThe Taiwanese company was expected to rollout the Android 5.0 Lollipop updates in mid-May for the popular Asus ZenFone 4, ZenFone 5, and ZenFone 6 smartphones. The company confirmed the news via its official ZenTalk forum and revealed that issues in verification delayed the update.Source", "time": "05-22-2015 04:41 AM", "replies": []}]}, {"title": "Can I get some help with several problems with my recently bought Zenfone 5 lite?", "thread": [{"postID": "post4417674", "text": "A couple of days ago I bought a Zenfone 5 lite because I wanted to switch from IOS to Android and I have the following problems:\n- It won't connect to my uni's wifi. I tried several times (also in airplane mode) but it just doesn't work. It shows that there's good signal strength, but when I try to connect it, it says ''connecting...'' . After a minute it says ''saved, secured with 802.1x''. Then again ''connecting...''. And it keeps repeating this over and over. I really don't know what to do.\n- The clock shows ''Eastern Time'' with a wrong time.\n- I don't know how to download my itunes library on the phone.\n- It puts all the pictures I've taken and I've downloaded from my notebook in one single file.\n- I cannot take screenshots, I tried by clicking the turnoff button and the volume button at the same time and by clicking the home button and the turnoff button, but neither of those works.\n- It doesn't show the messages I received on the screen when the phone is locked.\nIf anybody could help me that would be much appreciated.", "time": "05-10-2015 10:40 AM", "replies": []}]}, {"title": "for use ReverseTethering computer to android", "thread": [{"postID": "post4401086", "text": "what can i do for accept superuser request in asus zenfone 5 without root", "time": "05-01-2015 10:15 PM", "replies": []}, {"postID": "post4401179", "text": "You won't get a request from Superuser unless su makes it - and if su is installed, the phone is rooted. (That's what rooting is - installing su.)\nIf an app needs root and the phone isn't rooted you have 2 choices - don't use the app or root the phone.", "time": "05-01-2015 11:01 PM", "replies": []}]}, {"title": "My Asus Zenfone 5 will connect to my pc but not transfer. How can I get this working?", "thread": [{"postID": "post4398884", "text": "i transfer video avengers 2 pc to mobile not transfer then display media foundation protected pipeline EXE has stopped working.", "time": "04-30-2015 09:32 PM", "replies": []}, {"postID": "post4398944", "text": "Welcome to Android Central! How did you transfer the video? If it was any way besides the approved methods (like using UltraViolet), then we can't help you here--copying DVDs/Blu-Ray discs violates copyright law (even if you own it and copied it for your own use), and shouldn't be discussed here.", "time": "04-30-2015 10:15 PM", "replies": []}]}, {"title": "On my Asus Zenfone C Mob, why does my display light go off when I am on a call?", "thread": [{"postID": "post4368305", "text": "In my mob if i calls to some one my screen light is off..so i cant able to c the call s out gng r not..bcse of tat i cant cancel the call also..whn thy end the call at tat tym my screen light s on..plss hlp", "time": "04-17-2015 10:32 PM", "replies": []}, {"postID": "post4368335", "text": "Welcome to the forums. If you hit the power button, does that bring the screen back on? Do you have a screen protector on? If so, it may be interfering with the proximity sensor.", "time": "04-17-2015 10:59 PM", "replies": []}]}, {"title": "How can I fix an authentication problem?", "thread": [{"postID": "post4339203", "text": "I've been trying to connect to my school wifi with my asus zenfone5 but couldn't connect it . It keep appear \"authentication problem\"", "time": "04-08-2015 07:41 AM", "replies": []}, {"postID": "post4339382", "text": "Welcome to the forums.\nI would try entering the password again. There may have been a typo somewhere.", "time": "04-08-2015 08:50 AM", "replies": []}]}, {"title": "Latest zenfone", "thread": [{"postID": "post4329712", "text": "What is the latest and greatest zenfone and where can I get it?", "time": "04-04-2015 07:58 AM", "replies": [{"postID": "post4330471", "text": "Welcome to Android Central!\nThe Zenfone 2 is the latest Zenfone to be announced. Check out the article below on it.ASUS's ZenFone 2 overview is super intense, like the phone | Android Central", "time": "04-04-2015 02:51 PM", "replies": []}]}]}, {"title": "Is there any way to update my Asus Zenfone 5 to Lollipop?", "thread": [{"postID": "post4300186", "text": "asus zenfone 5 is suitable for lolipop ?", "time": "03-23-2015 06:02 AM", "replies": []}, {"postID": "post4300589", "text": "Asus promised that it will be updated. There's no date so far and it'll depend if your phone is unlocked or not and your country. There're some roms available out there. You can check if there's one suitable for your phone.", "time": "03-23-2015 10:49 AM", "replies": []}]}, {"title": "Can a company check if I rooted my phone?", "thread": [{"postID": "post4300088", "text": "I need to know if I unroot my phone and flash offical frimware of my phone(ASUS Zenfone 5), can the company check if I've ever rooted my phone or not, and will my rooted phone be locked when I update Android version from ASUS this April", "time": "03-23-2015 04:09 AM", "replies": []}]}, {"title": "Do all ASUS Zenfone's (5) have a cracking sound coming from the speaker?", "thread": [{"postID": "post4286061", "text": "I have a question to ASUS Zenfone 5 users.\nI'm witnessing a problem when I'm talking on the phone. When the volume is turned almost all the way up, sometimes I can hear a bit of a crackling sound coming from the speaker. Do all Zenfones suffer from that, or is it just mine? Thanks.", "time": "03-15-2015 10:46 AM", "replies": []}]}, {"title": "How long should I charge my phone which i just bought?", "thread": [{"postID": "post4280237", "text": "it's a new asus zenphone 5. I bought it just now. it's totally new. how long should i keep it on charge for the first time?", "time": "03-12-2015 06:11 AM", "replies": []}, {"postID": "post4280304", "text": "To 100%. Leaving it charging for longer than that will do no harm, and may do good.\nPosted via the Android Central App", "time": "03-12-2015 07:19 AM", "replies": []}, {"postID": "post4280332", "text": "Best to charge the phone for 24hrs switched off.....\nthanks", "time": "03-12-2015 07:31 AM", "replies": []}, {"postID": "post4280352", "text": "http://forums.androidcentral.com/sho...d.php?t=500054", "time": "03-12-2015 07:51 AM", "replies": []}, {"postID": "post4280453", "text": "The phone stops charging once it hits 100% so its really not doing anything\nMoto X 2014", "time": "03-12-2015 08:59 AM", "replies": []}]}, {"title": "On my Asus Zenfone 5 - 8GB - (updated to Android KitKat 4.4.1) I got the 'Screen Of Death' 'Blank Screen', is there anyway of coming back from this?", "thread": [{"postID": "post4276097", "text": "Last night my friend connected his Asus Zenfone 5 to his PC but he had some problem connecting it. So, he used an OTG cable to connect his pendrive. But that too didn't work. So pulled the OTG cable out and locked the screen manually. After a while when he tried to unlock it, he couldn't. The screen was dead blank and did not respond. Even the backlight for the home button didn't glow. When he tried calling the number, it was not reachable. I surfed in the internet about this, and i read about Sleep Of Death(SoD). But to fix that problem they said to hold the power button for 10-15 seconds. I tried that too. Nothing happened. Zenfone 5 has an in-built battery, so i cannot pull the battery out to make sure the device is off. I don't even know if the phone is still on or off. He updated 'ASUS Call Screen', 'Skype' and 'Camera' from Google play officially, the previous day. What should we do?\nAny kind of help is appreciable.\nThank you so much in advance...!", "time": "03-10-2015 01:20 AM", "replies": []}]}, {"title": "The Asus Zenfone", "thread": [{"postID": "post4178398", "text": "From CES 2014:First look at the ASUS Zenfone 4, 5 and 6 | Android Central\nSome info comparing the phone released last year to give reference tot he Zenfone 2.\nThe 2 looks like it might be a nice little device considering the low price point.", "time": "01-14-2015 09:00 AM", "replies": []}, {"postID": "post4205895", "text": "Asus Zenfone 5 value for money\nPosted via the Android Central App", "time": "01-30-2015 08:57 AM", "replies": []}]}, {"title": "How do I disable talk to speech?", "thread": [{"postID": "post3803134", "text": "hello...im having problem right now, im using asus zenfone 5...and this pop up always came out, \"unfortunately, google talk to speech engine has stopped...i dont know whats wrong but i dont want this function very annoying i try to disable this function and searching it everywhere but still nothing, please help me", "time": "07-31-2014 11:50 AM", "replies": []}, {"postID": "post3803181", "text": "Welcome to Android Central! Does a reboot help at all?\nIf not, make sure Google Text-to-Speech is fully updated. Go to the Google Play Store, and search for Google Text-to-Speech. If it says \"Update,\" then tap on it. If you've never updated it before, the Play Store usually won't prompt you for the first update--you have to find it yourself (an odd bug that Google has never fixed).\nIf you're fully updated and it's still happening, try going to Settings>Apps>All, select Google Text-to-speech Engine, and Clear Cache/Clear Data, then Force Stop. Now see if it happens again. If you never use Text-to-Speech, you can Disable this app as well.", "time": "07-31-2014 12:11 PM", "replies": []}]}]
