[{"title": "Why is my temp not there", "thread": [{"postID": "post6189881", "text": "I have a Moto z2 force. Have had no problems with it until now. The weather clock widget is show me how long it's been raining. How do I get the temp back in place of the rain time.", "time": "03-13-2018 10:14 PM", "replies": []}, {"postID": "post6189897", "text": "Are you talking about the Command Center widget that came preinstalled on the phone? I think the Moto Command Center always shows when it's currently raining, and how long it's been raining and how long it will continue. Then it periodically shows the current temp.", "time": "03-13-2018 10:23 PM", "replies": []}]}, {"title": "camera quality.", "thread": [{"postID": "post6126324", "text": "What is everyone's thoughts on the camera? I find it to be good but not great. In my opinion this phone is amazing I am just having a hard time not being tempted by the pixel 2 camera. Any thoughts ?", "time": "01-03-2018 11:44 PM", "replies": [{"postID": "post6126399", "text": "There's no comparison between the two, Pixel 2 along with the 2 XL have a better camera. If I am not mistaken, the Pixels have optical image stabilization and digital image stabilization, which the the Z2 Force lacks. As well, the Pixels have a smaller aperture which makes it take better pictures in low light. I have noticed that my V20 takes better pictures than the Z2 Force.", "time": "01-04-2018 02:24 AM", "replies": [{"postID": "post6127491", "text": "I definitely agree with this, but the LG V20 is a pretty top notch camera. \nI have the Moto Z2 Force and a Huawei Mate 9 and the LG V20. \nI would say the LG V20 is easily the best camera, but I think the Moto Z2 Force is better than the Huawei Mate 9", "time": "01-05-2018 04:38 AM", "replies": []}]}]}, {"postID": "post6126523", "text": "I have the 2016 Force, but relatively speaking I think Motorola took a step back in 2017 compared to other flagships. It looks like they emphasized the dual camera options over quality of images.", "time": "01-04-2018 07:55 AM", "replies": []}, {"postID": "post6127309", "text": "has anyone tried any other apps that helped out. I tried the Google camera by downloading the apk and that seemed to work a little better. was wondering if there was something better?", "time": "01-04-2018 09:46 PM", "replies": []}, {"postID": "post6145269", "text": "This mobile phone camera is good as compare to others. I have same mobile and camera clarity is similar as iPhone.", "time": "01-25-2018 01:42 AM", "replies": []}, {"postID": "post6184356", "text": "After owning 3 moto phones, the orginal turbo, turbo2 & Zforce I finally threw in the towel with their camera's. Every year they state much improved, nah. I have found they can't compare to my s7edge that I upgraded to the s8+. Sorry there is just no comparison, the Samsung's win hands down!", "time": "03-09-2018 01:21 PM", "replies": []}]}, {"title": "Swype is dead. Does that mean anything to us?", "thread": [{"postID": "post6172893", "text": "Title says it all. Does this mean anything to us Moto users if we haven't installed the Swype KB? What is Moto doing for its swipe ability? Is it Swype or their own implementation? Anyone know? Thanks.", "time": "02-26-2018 01:45 PM", "replies": []}, {"postID": "post6172912", "text": "If you never installed Swype as a standalone, you should be non-plussed by the news. And even if you did, it only means you won't get any more updates or won't be able to install in a new phone, but the keyboard won't magically stop working (except for any cloud features, not sure if it had any). \nNow, for companies that licensed Swype tech for their own keyboards, that is a different story (for instance, older Samsung keyboards were powered by Swype, and then they switched to SwiftKey in newer models and it's what's currently underneath their keyboards now). Depending on the license agreement they had with Swype, any support and future updates will still go through the manufacturer, just with additional support from Swype based on their contract.", "time": "02-26-2018 02:05 PM", "replies": []}, {"postID": "post6172925", "text": "Right. I get that. I was just wondering if Moto's implementation of its swipe KB had any dependancies on Swype that we should be aware of.", "time": "02-26-2018 02:18 PM", "replies": []}, {"postID": "post6173019", "text": "Even if they did, it would be no different if the app were still around: once their support contract is up, and their support cycle for the Z2 is done, no matter how much Swype would have still worked on, it would have never made it into your Z2. Same thing for the disappearance of the app (since the company is still around): If your keyboard has Swype tech built in, it would still work and would still be active up until the service contract is up (and that might have been up way before the app was even dead).\nPast Moto devices just bundled the Swype keyboard with the stock keyboard app; not sure about the Z2. BUT if it is powered by Swype, it'd say so in the Settings when you enable the gliding input method.", "time": "02-26-2018 03:30 PM", "replies": []}, {"postID": "post6174104", "text": "Swiping keyboards were never for me.", "time": "02-27-2018 02:54 PM", "replies": []}, {"postID": "post6180237", "text": "I didn't think they were for me either till I actually gave it a try. Now I don't do it the old tappy way. Just saying.", "time": "03-05-2018 07:40 PM", "replies": []}]}, {"title": "power button broke", "thread": [{"postID": "post6179602", "text": "anyone have this issue? mine feels like it is broken. it is loose and clicks funny now. I remember clicking it the other day and it felt like it didnt want to click but then did. I think that may have been when it broke. button had some wiggle to it before it click.\nReached out to Moto they sent me a new unit charged me $24.99 premium fee with a $400 credit hold if i dont send back old unit. WTF?? \nDo they really need to charge the $24.99 because I didnt want to send old phone back first?", "time": "03-05-2018 09:38 AM", "replies": []}, {"postID": "post6179609", "text": "In my opinion, the Advance Exchange fee is well worth the price and no other manufacturer offers it that I am aware of. Like all other manufacturers, Moto offers a free service where you send your broken phone to them and then they send you the replacement. But they also offer an advance replacement program where they send you the new phone first, in good faith, that you will return the broken phone. It's a choice, we don't have to use it or pay the $24.99. I don't think anyone else offers that choice, you have to send your broken phone first. I have used their Advance Exchange program many times and the fee is well worth it for me, to have the replacement phone on my doorstep in 72 hours. And then deal with the broken phone.", "time": "03-05-2018 09:43 AM", "replies": []}]}, {"title": "battery life.", "thread": [{"postID": "post6065190", "text": "So I've heard a lot of reviews about the battery in this phone. Most of them bad, but that's not my experience. I've been getting 6 hours of SOT. Anyone else having similar results?", "time": "11-11-2017 03:27 PM", "replies": [{"postID": "post6137720", "text": "Six hours is a pretty good feat - for most phones, it seems! Congratulations!", "time": "01-16-2018 09:06 AM", "replies": []}, {"postID": "post6178954", "text": "Get the battery mod", "time": "03-04-2018 04:22 PM", "replies": []}]}, {"postID": "post6065579", "text": "I have been crushing it in battery life. I am very surprised at how good it is.", "time": "11-11-2017 06:53 PM", "replies": []}, {"postID": "post6065805", "text": "835 chip plus clean UI for the win I guess.", "time": "11-11-2017 11:04 PM", "replies": []}, {"postID": "post6067363", "text": "I've been getting great battery life compared to last gen phones, compared to this gen I'd say it's a bit below average. \nVery happy to see Android phones are finally performing well out of the box.", "time": "11-13-2017 08:13 AM", "replies": []}, {"postID": "post6068976", "text": "I've heard the battery life is pretty good!", "time": "11-14-2017 08:27 AM", "replies": []}, {"postID": "post6070893", "text": "I get near 6 hours of screen on time every day with around 15 percent left. The stand by battery life is insane too. I would say the battery life is great.", "time": "11-15-2017 09:39 AM", "replies": [{"postID": "post6071592", "text": "6 hours SOT is very good for a battery under 3000 mAh! Thank you for your review!", "time": "11-15-2017 04:11 PM", "replies": []}]}, {"postID": "post6071637", "text": "Right lol. And this is without any type of battery mod. This phone is great and is very underrated.", "time": "11-15-2017 04:29 PM", "replies": []}, {"postID": "post6072264", "text": "8 hours of work with 40 min of screen time and I only lost 12%. had a smartwatch connected the whole time as well. loving this phone", "time": "11-15-2017 11:21 PM", "replies": [{"postID": "post6072563", "text": "Wow! Phenomenal!", "time": "11-16-2017 08:02 AM", "replies": []}]}, {"postID": "post6081395", "text": "I've also been impressed by this phone's battery life. Those many reviews critical of the smaller battery size vs first generation were needlessly premature, did not take the Snapdragon 835 power efficiency into account. Real life performance is what matters.\nAlso, the reviews stating Z2 Force requires Mods for complete battery life or other flagship features are off-base. I don't anticipate ever owning any Mod, frankly. Wireless charging is now pretty pointless with USB-C fast charging. And 3 amp capable 10,000 mAh external power packs like Anker sells are a better option than any of the battery Mods, IMO, nearly same size and weight with triple the recharge capacity.", "time": "11-22-2017 02:18 PM", "replies": []}, {"postID": "post6082516", "text": "I had a Galaxy s8 before this. this battery lasts way longer", "time": "11-23-2017 02:56 PM", "replies": []}, {"postID": "post6085597", "text": "These positive sentiments on battery life are interesting. I had the original Moto Z Force and didn't think the battery life was good at all. And that was with a 3500 mAh battery. The 835 must be far more efficient than the 820.", "time": "11-26-2017 02:15 PM", "replies": [{"postID": "post6085930", "text": "I've heard really good things about 835 and battery life, for multiple phones. The new processor must be able to conserve battery or work more efficiently at doing so.", "time": "11-26-2017 07:40 PM", "replies": []}]}, {"postID": "post6086574", "text": "I'll have to check my SOT but I got the phone 17 days ago and after 8 hours at work, I'll have 50-65% battery and that includes 1-1.5 hours in the gym every morning streaming tunes to my BT connected headphones.\nOverall, I am VERY impressed with the battery!", "time": "11-27-2017 10:56 AM", "replies": [{"postID": "post6086676", "text": "A great battery testimony!", "time": "11-27-2017 12:02 PM", "replies": []}]}, {"postID": "post6106008", "text": "I left the Moto z2 force to try the OnePlus 5t. i liked it but ultimately came back to the z2 force for the battery life. this phone is the most underrated phone of 2017.", "time": "12-13-2017 03:52 PM", "replies": []}, {"postID": "post6122251", "text": "I think you'll find that most of the complaints about the Z2 Force's battery we're done by people who reduce the battery to a single number and nothing else. Like other folks my real world experience tells me the Z2 Force's battery life is just fine thank you.\nIt's not quite as good as my G5 plus, but then no phone I have ever used came close to that beast.", "time": "12-30-2017 09:16 AM", "replies": []}, {"postID": "post6122480", "text": "So I’m thinking of getting this phone with my next Jump upgrade, but it’s literally hinging entirely on battery life right now.\nDoes anyone know how it compares to other phones?\nSo far in this thread it’s been G5 Plus > Z2 Force > OnePlus 5T. But how does it compare to the Galaxy S8+ or iPhone 8 Plus?\nWhat I really need is an average battery life of 6 hours SOT and pretty decent standby time. Would the Z2 fit that bill?", "time": "12-30-2017 01:30 PM", "replies": []}, {"postID": "post6122723", "text": "I had had the s8+ and iPhone 7 plus and this gets better battery then those.", "time": "12-30-2017 06:40 PM", "replies": []}, {"postID": "post6122878", "text": "battery life is even better after the Oreo update.", "time": "12-30-2017 11:25 PM", "replies": [{"postID": "post6131430", "text": "I would echo that. Since 8.0, I'll EASILY be at 60+% after a full day at work and streaming audio for at least an hour in the gym before work.", "time": "01-09-2018 12:30 PM", "replies": []}]}, {"postID": "post6124675", "text": "battery has been great so far. went almost 2 full days of use on charge.", "time": "01-02-2018 09:10 AM", "replies": []}, {"postID": "post6137672", "text": "I normally get 4 to 5 hours sot but always have a smartwatch and headset connected and stream audio and video often", "time": "01-16-2018 08:05 AM", "replies": []}, {"postID": "post6147859", "text": "Just my two cents.. I don't know what magic Lenovo is doing with this, but it is getting better battery life than my Note 8.", "time": "01-28-2018 10:33 AM", "replies": []}]}, {"title": "Wireless charging", "thread": [{"postID": "post6153709", "text": "Has anyone found a wireless charger that fast charges your Z2 Force? Every charger I try gives me the charging slowly alert.", "time": "02-03-2018 06:07 PM", "replies": []}, {"postID": "post6174738", "text": "I wasn't aware you could wirelessly charge this phone", "time": "02-28-2018 09:44 AM", "replies": [{"postID": "post6176445", "text": "You need a wireless charging Moto Mod.", "time": "03-02-2018 12:27 AM", "replies": []}]}]}, {"title": "really? no headphone jack?", "thread": [{"postID": "post6173221", "text": "Wow I guess we really didn't research this phone at all...so there is no headphone jack? Is that what the dongle included is? Is that easy to find and buy another? I just know that's gonna be lost", "time": "02-26-2018 06:30 PM", "replies": [{"postID": "post6174107", "text": "No headphone jack.\nYes. Welcome to the dongle life. \nYes - if you shop online.", "time": "02-27-2018 02:56 PM", "replies": []}]}, {"postID": "post6173238", "text": "If the phone comes with an USB-C adapter, then yeah, it's a fairly common (if not too cheap) item to find, but I'd suggest you go the BT route. It's gonna be better down the road, and whether we like it or not, that's where most devices are going: No audio jack.", "time": "02-26-2018 06:52 PM", "replies": [{"postID": "post6173242", "text": "Thanks...What is the \"BT\" route?", "time": "02-26-2018 06:53 PM", "replies": []}]}, {"postID": "post6173246", "text": "Bluetooth headphones/devices.", "time": "02-26-2018 06:58 PM", "replies": [{"postID": "post6174118", "text": "Thanks!", "time": "02-27-2018 03:04 PM", "replies": []}]}, {"postID": "post6173309", "text": "I shall resist. Bluetooth for conversations not music.", "time": "02-26-2018 07:59 PM", "replies": [{"postID": "post6173316", "text": "Then stock up on USB-C adapters hehe. I hope it doesn't go away either (still like the idea of not running out of battery and still be able to listen to music) but the audio jack does seem to have its days numbered.", "time": "02-26-2018 08:07 PM", "replies": []}]}, {"postID": "post6173637", "text": "\"Sans headphone jack\" seems to be a growing trend among smartphones manufacturers. The next phone I'm getting won't have one - I guess I'll see how well I can adapt... LOOL that wasn't meant as a pun, but still... 😜", "time": "02-27-2018 06:37 AM", "replies": []}, {"postID": "post6174267", "text": "I picked up a few extra official Moto brand dongle USB-C to aux adapters on Amazon for a couple bucks each. There are other brands available, but the Moto brand adapters are not hard to find if you want some spares.", "time": "02-27-2018 05:47 PM", "replies": [{"postID": "post6174410", "text": "I'm not finding that on Amazon. Was that a while ago?", "time": "02-27-2018 09:27 PM", "replies": []}]}, {"postID": "post6174418", "text": "About 3 months.", "time": "02-27-2018 09:42 PM", "replies": [{"postID": "post6174737", "text": "bummer don't see anymore", "time": "02-28-2018 09:43 AM", "replies": []}]}, {"postID": "post6175227", "text": "btw I can't find any. not even on ebay..am I wording it correctly? type C to headphone dongle? can anyone send me a link please if you find any...thanks!!", "time": "02-28-2018 06:07 PM", "replies": []}, {"postID": "post6175399", "text": "https://www.amazon.com/gp/aw/d/B01N0...cUvbUpU6175399", "time": "02-28-2018 09:23 PM", "replies": [{"postID": "post6176231", "text": "Awesome, thank you so much!", "time": "03-01-2018 07:03 PM", "replies": []}]}]}, {"title": "do any cases worth\nDo any cases work with this phone??", "thread": [{"postID": "post6173125", "text": "My daughter got this phone today on sale from Verizon. Got a mod (extra battery one) and am just realizing that most cases prob will not work with this phone. She is an art student and really needs a case. Any out there that will work with this phone? Thanks for any help", "time": "02-26-2018 04:44 PM", "replies": []}, {"postID": "post6173365", "text": "If she needs a case that works with the mods try thishttps://www.amazon.com/gp/aw/d/B0752...cUvbUpU6173365https://www.amazon.com/gp/aw/d/B075W...cUvbUpU6173365\nSpigen has always been my preferred brandhttps://www.amazon.com/gp/aw/d/B074P...cUvbUpU6173365https://www.amazon.com/gp/aw/d/B074B...cUvbUpU6173365", "time": "02-26-2018 09:31 PM", "replies": []}, {"postID": "post6173390", "text": "Thanks! so basically either a bumper (that works with a mod on) or a case? She has the battery mod and the Alexa speaker. Are the bumpers protective enough though? She is pretty hard on her phones. also...you can charge with the bumper on right?", "time": "02-26-2018 09:57 PM", "replies": [{"postID": "post6173428", "text": "I use a bumper on my Z. I can charge and swap mods at anytime with no issue. I also put a screen protector on mine and would recommend it if she is hard on devices.", "time": "02-26-2018 11:05 PM", "replies": [{"postID": "post6174124", "text": "Ok so we put a tempered glass screen protector on and I ordered her the bumper on Amazon. Question...does the bumper help hold the mod on much? I know they're magnetic, just wondering if the phone is dropped will the mod go flying off?", "time": "02-27-2018 03:07 PM", "replies": [{"postID": "post6174175", "text": "The bumper does not hold the mods in place. The magnets are STRONG, but I imagine with a big drop, they would pop off. The mods are very well built though. I guess the camera mod or projector could get damaged if any.\nSent from my XT1635-01 using Tapatalk", "time": "02-27-2018 04:09 PM", "replies": [{"postID": "post6174406", "text": "Thanks!", "time": "02-27-2018 09:21 PM", "replies": []}]}]}]}]}, {"postID": "post6173684", "text": "do the bumpers get the phone up off the camera when on its back?", "time": "02-27-2018 08:16 AM", "replies": [{"postID": "post6174102", "text": "No.", "time": "02-27-2018 02:54 PM", "replies": []}]}, {"postID": "post6174271", "text": "I have dropped my Z Force twice, both times onto concrete. And yes the style shell mod went flying across the floor. But absolutely no damage to the screen! Gotta love that.", "time": "02-27-2018 05:49 PM", "replies": [{"postID": "post6174407", "text": "That's great to hear. My daughter's last Motorola also had the shatterproof screen and she dropped it, Didn't shatter lol but huge crack across half the screen", "time": "02-27-2018 09:24 PM", "replies": []}]}]}, {"title": "Voice memo", "thread": [{"postID": "post6170077", "text": "I noticed that this phone doesn't have a voice recorder app, does anyone have a suggestion for a good voice recording app. Thanks", "time": "02-23-2018 08:30 AM", "replies": []}, {"postID": "post6174109", "text": "\"Hey Google, remind me to ...\"", "time": "02-27-2018 02:57 PM", "replies": []}]}, {"title": "Ugh..fell in the water...", "thread": [{"postID": "post6168795", "text": "Hubby had this phone 3 whole days...and dropped it in the water on the beach.....sigh. It's pretty much a brick now. Any chance in hell it can be resurrected whatsoever?? We put it in good ol rice for a couple days, and nuthin. I'm pretty sure we're totally out of luck, but thought I'd ask anyway. Looking for a miracle here!\nThx, Beth", "time": "02-21-2018 06:50 PM", "replies": []}, {"postID": "post6168855", "text": "It's probably fried.", "time": "02-21-2018 08:14 PM", "replies": []}, {"postID": "post6173644", "text": "Hi, Beth! I'm sorry, it is most likely toasted if it has not been recovered using the rice method.", "time": "02-27-2018 06:47 AM", "replies": []}, {"postID": "post6173653", "text": "Thanks guys...kinda figured but had to ask. ☺", "time": "02-27-2018 07:01 AM", "replies": []}]}, {"title": "Notifications", "thread": [{"postID": "post6172718", "text": "I've noticed that I turned off my notifications for my texts and turned them bad on later. Now I get to vibration and/or sound when I get a text or call . I do get a notification on the top bar but I don't get a preview of the text on my screen. I've had this happen before twice. Once I had to hard reset my phone. The other the notifications came back on there own. Anybody else experiencing this?", "time": "02-26-2018 10:24 AM", "replies": []}, {"postID": "post6173640", "text": "Hi! So, you're wanting to get a text message preview when a message comes in? Have you rooted through your SMS settings to see if that specific setting had been disabled? Are you using the native SMS app that came with your phone?", "time": "02-27-2018 06:42 AM", "replies": []}]}, {"title": "Z2 Force my best smartphone yet, Moto or other", "thread": [{"postID": "post6150091", "text": "Purchased at Best Buy Oct 2017, so have now used it daily for over three months. This is my third Motorola and Android smartphone (2015 Droid Turbo 2 and 2013 Droid Maxx, prior).\nI can't say enough positive things about this phone: Super responsive (iPhone X fast, perhaps?), excellent battery life, very fast Turbo charging, great Motorola camera app (much improved from earlier versions), very useful fingerprint sensor, usable voice recognition (both Google Assistant and Moto Voice), and more.\nMany misinformed web reviews (even from some of the most popular tech sites) almost steered me away from the Z2 Force, but I'm glad ignored them. \nCriticism of the Z2 Force's smaller physical battery size vs. original Z is off base, battery life is actually higher due to much more efficient Snapdragon 835 processor and other components. Also, most reviews over focus on Moto Mods, which I consider fairly useless (I own none), but the Z2 is still a great flagship phone without them.\nThe Z2's front fingerprint sensor is brilliant with Moto \"One Button Nav\" enabled to use finger swipes that are much faster than the standard Android home, app, and back buttons, plus it increases screen real estate for apps. It's also very fast for locking and unlocking with a quick touch -- I truly don't see how iPhone X FaceID can be faster or easier than this.\nPhysical size and weight of this phone is ideal if you use a protector case. Without one, it's too thin to grip, but that's the point of its design. IMO, most other smartphones become *too* thick with protective cases.\nVerizon's flexible glass screen protector is inexpensive and makes the Z2's plastic shatterproof screen look and feel as nice as any glass phone screen. I love that this Z2 (and my prior DT2) is shatterproof, it's already survived several hard drops with zero damage.\nThe new Moto camera app is a great improvement, very easy to use and some great features, and I now prefer it to iPhone and Google Camera apps. I especially love the Moto Action \"quick capture\" twist hand gesture to open the camera app (had this on DT2, as well), by far the fastest method I've ever used. I can twist the phone while coming out of my pocket, and the camera app will be open and ready to take a picture by the time I have it aimed at the subject (and while everyone else is still fumbling with their iPhones). I've snapped many great \"fleeting moment\" vacation shots thanks to this capability.\nThe Z2's dual camera lens Depth Mode effects are also fun. I've generated some very artistic blurred and black and white background style shots. Action mode multiple exposure works great too, very fast and easy to review and discard unwanted shots.\n(FYI, I've posted example depth mode photos in the sticky photo thread on this forum.)\nThe Z2 Force camera is still deficient vs other flagship phones in low light, esp. with its lack of optical image stabilization (OIS). But outdoor daylight shots are great. And FWIW, there are also some pretty positive reviews of the Z2 camera app's Professional mode by advanced photographers, too.\nThe \"chop-chop\" Moto Action hand gesture for flashlight on/off is brilliant, something I use multiple times every day on nighttime dog walks, in dimly lit rooms, in dark cabinets, etc. Seriously, it makes for the best flashlight I've ever owned, since it's instantaneous to turn on, very bright, and always in my pocket!\nMotorola also improved voice recognition by enabling both Google Assistant (\"OK Google\") and Moto Voice (\"Show Me\") to wake and unlock the phone hands free, something very few other brand smartphones can do. Moto Voice \"Show Me\" is a handy complement to \"OK Google\", I do use it regularly to open apps with my voice, near instantaneously, esp. when the phone is locked. \"OK Google\" on this Z2 works virtually the same as on my Google Home (in fact, both respond together when I'm home, which works fine). \nOther than low light camera improvements, the only other missing feature I anxiously await on my next Moto flagship phone (Z3 Force?) is IP68 waterproofing, which will be a de facto flagship trait in 2018 and beyond.", "time": "01-30-2018 05:58 PM", "replies": [{"postID": "post6153749", "text": "I know reviewers are heavily biased towards sasmung phones, i clearly didnt considered it in my list , but once i got hands on it, the snappy performance got me, i got one for around 375$ with free projector, after using for 2 months ,i think its far better performance than my Samsung phones.\nThe only problem for me is screen scratch issues which i know before buying it, had 3 tempered glasses before buyijg it. Battery is amazing . I play vainglory alot. It can definitely take the 5 to 6 games without any heat.", "time": "02-03-2018 07:07 PM", "replies": []}]}, {"postID": "post6150438", "text": "@KeithLa\nYou're absolutely correct in that alot of other reviews put a heavy focus on the MODS, I don't think I would need them. Thanks for commenting on the smaller battery and battery life. The reviews had me on the edge about this.\nI'm still using the original turbo and will be looking to get a new phone down the road. This phone still works great but, it will be 4yo this October and I've been reading several reviews on the Z2. \nI'm been with Motorola since they had the Krazr, then several BB models and now the Turbo. I was considering Samsung but, your review saved me. \nThank you for your review.", "time": "01-31-2018 05:41 AM", "replies": []}, {"postID": "post6150698", "text": "You're welcome! Of course, by October you'll have more and even better choices available, perhaps even a Moto Z3. Either way, any new phone you get, sooner or later, will run much faster and last longer vs. your 3+ year old DT. (Unless you've replaced your battery, I'm guessing your battery life is way down by now.)\nTo be 100% clear, I didn't use a first gen Moto Z, so can't directly compare my Z2 Force battery life to one of those. But there are others on this forum doing so, plus many reporting better battery life than other current flagships they've used.\nIf you like the unique Moto gesture, voice, and display features on your DT, I think you'll really appreciate Moto's refinements and additions to them.\nOne thing last summer's Z2 Force reviews did get right, at the time, was complaints about its full retail price. On Best Buy + Verizon promotion last Oct, I paid closer to US$500 for mine, and then sold the free promotion Instashare projector Mod on eBay for $150.\nIf low light camera quality is important to you, then Samsung probably performs much better on that.\nOn Moto Mods, I can't help observing that nearly all of them have standalone counterparts -- Bluetooth speakers, compact digital cameras, Polaroid printers, battery packs, etc. -- that are a lot better and cost much less. And I don't see how snapping a speaker or projector onto the phone an advantage, if you then can't hold and use your phone, and have to fumble around removing/replacing its regular protective case to add the Mod.", "time": "01-31-2018 11:10 AM", "replies": []}, {"postID": "post6152294", "text": "You are spot on about the battery. I have been using my LG V20 since November, but I switched back to the Z2 Force when the Oreo update came out.\nBattery life is rock solid.", "time": "02-02-2018 06:00 AM", "replies": []}, {"postID": "post6153587", "text": "Heavy user.... and this phone is Rock solid in build and performance. Battery is more than expected for sure. Easy day and a half of use before I have to charge. The turbo charge is super fast. Best phone I've ever had. Verizon flex screen protector and I can't tell any difference that's is a plastic screen. Z2 Force is a Excellent Phone. .", "time": "02-03-2018 02:27 PM", "replies": []}, {"postID": "post6153594", "text": "I've seen the main criticisms of the Moto Z2 Force being:\n- lower battery life because of the smaller battery than the previous generation Force\n- dated design due, mainly 16:9 and significant bezels vs. 18:9 and reduced bezels\n- Moto Mods restricting design updates\n- camera not up to par with the current generation (S8, G6) or even previous generation (Pixel)\nThey're valid concerns, in my opinion.", "time": "02-03-2018 02:37 PM", "replies": []}, {"postID": "post6164597", "text": "So glad you are enjoying your Z2 Force; and that the battery life is good for you! You're right about the Snapdragon 835 making battery life better. That specific processor is supposed to be very good at that.", "time": "02-16-2018 08:02 PM", "replies": []}, {"postID": "post6169616", "text": "I feel this is bang on. I've been using mine for long enough that I don't even think about upgrading it. It's that solid. At the end of the day, I usually have 76-65% battery left. \nI think it truly is a hidden gem and Moto doesn't do enough press about it. I also think the media is biased against Moto and ONLY looks at Samsung and iPhone. For those in the media reading this, get a clue. Take off the blinders and do your JOB and look at other devices. Yes its EASY to talk Samsung and iPhone, but life DOES exist outside Samsung and iPhone. Those of us that have the Moto these days know that.\nMy ONE and ONLY complaint is that the Z2 Force isn't waterproof. Is it a big deal? Not really. (Until that accident happens and then it IS a big deal...)\nI see it as I've got a GREAT device and I love it. I really don't care what others have, it works GREAT for me!\nAs for the mods go, the ONLY thing I would have to say is that is the BEST implementation of accessory tech IN THE MARKET. I LOVE the battery packs out there. They are subtle and sublime and don't really add much to the phone, yet significantly increase battery. I pretty much laugh at people that carry chargers and A/C adapters now. I keep mine in my coat pocket in case I need it. If I do, just pop it on the back and keep going with my day. The combo of the phone and the battery pack is still very slim and I can use it like as if it wasn't even there. It's part of my EDC and I love the sense of security it gives me, not that I need it very often, but I know it's there.", "time": "02-22-2018 05:04 PM", "replies": []}, {"postID": "post6170625", "text": "Got the phone as a backup during a CyberMonday deal at T-Mobile for 300. I have always liked Motorola take on a clean version of Android, I had previously owned a G series phone as a backup. I had used a LG V20 as my primary phone since launch, and was planning to upgrade to a V30. But after using the phone for a few weeks I kept it as my primary phone. The reasons why, the Android skin that Motorola applies is very lightweight, no lags, no stutter or freezes. The battery life has been great, not like the one on the Moto Z Play, but still great. The size of the phone is good for my needs, not too big nor too small. Also, I like the fact that Motorola still implemented the micro sd card, that is one feature that has kept me from getting a Google phone. There are few things that hopefully we will see in the next Z phone that would be good implementations. Such as waterproofing, better camera performance especially in low light, improved technology with there shatter proof displays and probably a much bigger battery. When I first bought a Z line phone was for my dad and it was the Moto Z Play. At that moment I did believe the mods where to expensive for what they offered. But with the Z Play we got the JBL speaker for free, at this point I have bought three style shells, the gamepad, incipio offgrid wireless battery pack, Turbo pack, Folio Mod, JBL 2 speaker, Hasselblad camera and i received the Insta Share Projector for free. I haven't spend over 300 in all the mods that I have, point is if you ever bought a Moto Mod full price, the you are doing it wrong. I have used all the mods in different scenarios, I swap between the style shells to provide a different look to my phone, the wireless battery pack when I'm at work, the Turbo pack during long days, my kids use the Insta Share Projector when we camp also in a cook out during the Super Bowl I was able to project the game as if we had a big screen, the Hasselblad camera has been used as well when camping and the JBL 2 speaker I use it at nights when listening to music. The Z2 Force is a great phone, even more if you can get at a discount price even better. When it comes to the mods all have their purpose, the ones a have bought have served me well so far and if you can get them for cheap even better. For example, Best Buy has the Hasselblad Camera Mod for 150 and if you buy three select mods they knock 25% off the price of all the mods. So again, if you are buying the mods at full price you are doing it wrong.", "time": "02-23-2018 10:07 PM", "replies": []}, {"postID": "post6171482", "text": "first day since Oreo that I haven't used the turbo mod. down to 10% battery with 4hrs of sot and 17hrs off charger. no top up today.", "time": "02-24-2018 11:56 PM", "replies": []}]}, {"title": "8.0", "thread": [{"postID": "post6092849", "text": "Look what pops up when I checked for a Software Update", "time": "12-01-2017 04:44 PM", "replies": []}, {"postID": "post6093043", "text": "Well, that's reassuring.", "time": "12-01-2017 08:29 PM", "replies": []}, {"postID": "post6095574", "text": "So the question is, WHEN? And what will it buy us? I mean there have been plenty of updates that turned out to be less than useful.", "time": "12-04-2017 12:47 PM", "replies": []}, {"postID": "post6114526", "text": "Got 8.0 delivered today on Moto Z2 Force on Verizon.", "time": "12-21-2017 09:13 PM", "replies": [{"postID": "post6115424", "text": "Congrats!", "time": "12-22-2017 06:55 PM", "replies": []}]}, {"postID": "post6114839", "text": "Down loading now. Merry Christmas from Verizon. :-)", "time": "12-22-2017 07:53 AM", "replies": []}, {"postID": "post6115212", "text": "for those of you who already got it, how is it going?", "time": "12-22-2017 01:59 PM", "replies": []}, {"postID": "post6115606", "text": "just got the notice for it. installing now", "time": "12-22-2017 11:07 PM", "replies": []}, {"postID": "post6115732", "text": "Didn't get a notification, but Oreo update was available upon check for system update in Settings. I have Z2 Force on Verizon. Update downloaded swiftly, installed in background, and prompted for restart, finished in under fifteen minutes, perhaps less.\nThis was already a fast phone, but after update I'd swear it's running even snappier, unlocking, starting and switching between apps, loading photos and webpages. Even camera shots seem a little faster, but that could be my imagination.\nNotification bar, Settings, and Phone app changes are most noticeable so far. I use (and love) Action Launcher so haven't yet tried Oreo home screens and icons.\nNot crazy about the persistent notification about background apps running, e.g. Pebble app. Not sure if there's a setting page to disable that.", "time": "12-23-2017 02:23 AM", "replies": []}, {"postID": "post6116878", "text": "Manually downloaded it. Only thing seems to be that when some of my contacts call me, it doesn't show their name, only their number. Doesn't seem to be consistent across all contacts though.\nI'm also getting a notice I haven't received before.\nFrom Message+:\nSyncing messages\nTemporary background processing.\nI can't clear this nor do away with it. It just keeps popping up at random times.", "time": "12-24-2017 10:14 AM", "replies": []}, {"postID": "post6120289", "text": "So I've been running 8.0 for a few days now. I like the little notification pip next to an app that has a notice. Other than that, I can't really say there's much I see as ground breaking. Am I missing something?", "time": "12-28-2017 09:55 AM", "replies": []}, {"postID": "post6120478", "text": "Did anyone loose their Google feed on the left of the homescreen? I did a factory rest after I got 8.0 and now that is gone. I have to open the Google app now to see the feed. Any thoughts?", "time": "12-28-2017 12:51 PM", "replies": []}, {"postID": "post6120723", "text": "T-Mobile seems to be rolling out the update as well, downloading the update right now.", "time": "12-28-2017 05:17 PM", "replies": []}, {"postID": "post6121279", "text": "If I swipe left from the home screen, I still have the Google homescreen.", "time": "12-29-2017 09:02 AM", "replies": []}, {"postID": "post6121284", "text": "Ummm... someone mentioned better battery life with 8.0. I didn't really pay attention to that until I got home last night. Typical use. Nothing out of the ordinary and I had almost 72% battery! FANTASTIC!!! I'm going to see if this is the case again today, WOW!", "time": "12-29-2017 09:04 AM", "replies": []}, {"postID": "post6121302", "text": "The T-Mobile Moto Z2 software update page now says \"Phase: T-Mobile Testing: Version 8.0 Oreo.\" Only one of my two T-Mobile Moto Z2s got the update.", "time": "12-29-2017 09:23 AM", "replies": []}, {"postID": "post6121896", "text": "updated my z2 force and I am noticing worse battery life. it could be that the system is being optimized still but I will keep you guys up to date.", "time": "12-29-2017 07:38 PM", "replies": []}, {"postID": "post6122733", "text": "I figured out my Google feed issue, I just had to enable it in the homescreen settings.", "time": "12-30-2017 06:58 PM", "replies": []}, {"postID": "post6122853", "text": "24 hours after the update and battery is back to being amazing again.", "time": "12-30-2017 10:39 PM", "replies": []}, {"postID": "post6124674", "text": "just activated my TMO Force 2 and 8.0 was ready to download. Great to see this phone is receiving it already! Dont think many others are on Oreo yet.", "time": "01-02-2018 09:09 AM", "replies": []}, {"postID": "post6125177", "text": "So now I did notice a strange bug after updating to 8.0. Every time I call my wife she can't hear me. It started with her S7, but today it happened to my mom's S7 as well. The bug doesn't appear to happen in any other phone, since I call my V20 and both sides can hear each other. If I call the phones that can't hear me in a conference call, then at that point they can hear me. Is any one else having a similar issue?", "time": "01-02-2018 04:59 PM", "replies": [{"postID": "post6126290", "text": "Do you have Wi-Fi calling enabled? If so try disabling it and do you then get the same behavior?", "time": "01-03-2018 10:43 PM", "replies": [{"postID": "post6126330", "text": "Same result, I have already factory reset the device as well. Store reps were not helpful either, so they just summit a warranty exchange.", "time": "01-03-2018 11:50 PM", "replies": []}, {"postID": "post6126331", "text": "Same result, I have already factory reset the device as well. Store reps were not helpful either, so they just summit a warranty exchange.", "time": "01-03-2018 11:52 PM", "replies": []}]}]}, {"postID": "post6127122", "text": "My second Moto just got Oreo and T-Mobile has officially announced it.", "time": "01-04-2018 06:12 PM", "replies": [{"postID": "post6130242", "text": "Great! And, cute kitty pic!", "time": "01-08-2018 09:47 AM", "replies": []}]}, {"postID": "post6127227", "text": "i am downloading now", "time": "01-04-2018 08:00 PM", "replies": []}, {"postID": "post6127782", "text": "i made a video of the install: \nThis app gets rid of the annoying notification:https://play.google.com/store/apps/d...sysnotifsnooze", "time": "01-05-2018 11:08 AM", "replies": []}, {"postID": "post6128242", "text": "I also called someone who had an s7 today and they could not hear me. I call this person all the time and since 8.0 it does not work.", "time": "01-05-2018 08:15 PM", "replies": [{"postID": "post6128415", "text": "I disabled VoLTE in the call settings since my replacement phone is doing again the same thing as my previous phone. Doing so fixed the problem, by any chance do you have T-Mobile?", "time": "01-06-2018 01:51 AM", "replies": [{"postID": "post6128630", "text": "Yes I do have t\nmobile.", "time": "01-06-2018 10:26 AM", "replies": [{"postID": "post6128784", "text": "Did it work by disabling VoLTE?", "time": "01-06-2018 01:32 PM", "replies": []}]}]}]}, {"postID": "post6128938", "text": "Yes it did. Thank you.", "time": "01-06-2018 05:04 PM", "replies": []}, {"postID": "post6161174", "text": "anyone else location services and nfc randomly turn off?", "time": "02-12-2018 03:53 PM", "replies": []}, {"postID": "post6170281", "text": "Just got the Oreo update on my AT&T Moto Z2 Force. Liking it so far!", "time": "02-23-2018 12:56 PM", "replies": []}, {"postID": "post6170557", "text": "Just received a new update from T-Mobile that seems to have fixed issues with calls made over VOLTE, but it is still on the December security patch.", "time": "02-23-2018 07:44 PM", "replies": []}]}, {"title": "Get a screen protector", "thread": [{"postID": "post5928452", "text": "Dropped my phone 3 feet on to a tile floor and a small chunk of the screen came out. I contacted moto and they will replace my device luckily.\nI had a glass screen protector on order too bad they didn't have them in stock.", "time": "08-19-2017 07:29 AM", "replies": []}, {"postID": "post5929164", "text": "Oh no! So glad that Motorola is going to replace it for you, and that everything is working out! At least now you have a screen protector en route to protect your next phone!", "time": "08-19-2017 09:16 PM", "replies": []}, {"postID": "post5929170", "text": "I recommend the Verizon Flexible Glass", "time": "08-19-2017 09:20 PM", "replies": []}, {"postID": "post5931813", "text": "I tried to get AT&T to do the warranty since its part of the manufacturer warranty but they said no. Hopefully it's back by the end of the week.", "time": "08-22-2017 06:36 AM", "replies": []}, {"postID": "post5932566", "text": "Shipped phone back on Monday it's scheduled to be returned to me on Thursday a brand new device.", "time": "08-22-2017 05:53 PM", "replies": [{"postID": "post5932674", "text": "So glad it will be returned to you on Thursday! Keep us posted!", "time": "08-22-2017 07:49 PM", "replies": []}]}, {"postID": "post5936499", "text": "+1 for the Verizon flexible glass protector, fits perfect, covers everything, feels great. I had bought some shield IQ glass protector from Amazon which are junk. Go with the Verizon flexible one even though expensive at $25.", "time": "08-24-2017 03:24 PM", "replies": []}, {"postID": "post5936856", "text": "I bought a 2 pack of screen protectors off eBay for $7.99. They have the black around the edge to match the phone and the install very easily. Bought a Body Guards from AT&T and it broke while in my pocket and had lots of scratches after only 2 days.", "time": "08-24-2017 06:51 PM", "replies": [{"postID": "post5941678", "text": "Wow my bodyguardz seems to hold up good and I am in construction and my device gets banked around all day I would get a warranty replacement from them its got a lifetime warranty.", "time": "08-27-2017 04:07 PM", "replies": []}]}, {"postID": "post5938820", "text": "New phone arrived brand new added glass screen protector works great nice to know it has a 4 year screen warranty.", "time": "08-25-2017 06:22 PM", "replies": []}, {"postID": "post5941368", "text": "protector is a must with any Shattershield phone.", "time": "08-27-2017 12:07 PM", "replies": []}, {"postID": "post5941677", "text": "I use a screen protector on almost every device saves on deductible when insurance claim is used.", "time": "08-27-2017 04:05 PM", "replies": []}, {"postID": "post6002574", "text": "had the zagg but didn't like the fit. put the Verizon flexible glass on and like it much better. easier to use the one button nav too which I'm starting to enjoy", "time": "10-03-2017 12:34 PM", "replies": []}, {"postID": "post6002873", "text": "Definitely slap a tempered glass protector on this thing. Still upsetting Lenovorola hasn't put factory tempered glass on the top layer of their 5 part super unbreakable horse-proof helicopter-proof screen. Need to Google Flagship.", "time": "10-03-2017 04:07 PM", "replies": []}, {"postID": "post6003113", "text": "I'm guessing they thought it would be easier to have a screen protector in stores vs making one and expecting people to order replacements through them. I've dropped my phone and few times and am perfectly find with the trade off so I do not worry about a broken screen.", "time": "10-03-2017 07:17 PM", "replies": []}, {"postID": "post6007109", "text": "The screen protector on my new device has worked well so far moto should sell the protector with every new device.", "time": "10-06-2017 05:35 AM", "replies": []}, {"postID": "post6016901", "text": "Aftermarket tempered glass protector is life. Moto actually sells the outermost layer of the shatter-proof screen as a replacement, not that the layer is in any way a \"screen protector\" lol. I actually peeled it off my Z Force 1 before I sent it back.", "time": "10-12-2017 03:27 PM", "replies": []}, {"postID": "post6034246", "text": "I just got mine Friday, and I already have a few deeper scratches,. How can a \" unbreakable \" screen scratch so easily?", "time": "10-23-2017 12:29 PM", "replies": [{"postID": "post6047346", "text": "Because \"unbreakable\" has a different definition than \"un-scratchable\"", "time": "10-31-2017 12:19 PM", "replies": []}, {"postID": "post6066824", "text": "These Moto phones with Shattershield are notoriously easy to scratch. It is one of the main reasons I prefer glass rather than plastic as a screen.", "time": "11-12-2017 06:59 PM", "replies": [{"postID": "post6128507", "text": "So what happens if that shattershield were to be peeled off and used with the glass under it? Is it a gorilla glass?", "time": "01-06-2018 06:59 AM", "replies": [{"postID": "post6128516", "text": "No. Basically instead of Gorilla Glass, moto used shatter shield which is a plastic based screen. It trades scratchability for being shatterproof because it's plastic. I guess Moto figured most people will be putting screen protectors on anyway, lets make it shatterproof instead of scratch resist.", "time": "01-06-2018 07:31 AM", "replies": [{"postID": "post6130244", "text": "I actually wouldn't mind this at all. That's a great and innovative move from Moto. I'd take that screen and then slap a tempered glass screen protector on it. 😃", "time": "01-08-2018 09:48 AM", "replies": [{"postID": "post6130716", "text": "The problem I'm finding is that plastic isn't as smooth as glass so putting a tempered glass protector into the screen results in areas it doesn't completely come in contact with so you run into bubbles or it not fully adhering. Plastic protectors work better on this screen because they are malleable unlike glass.", "time": "01-08-2018 05:37 PM", "replies": [{"postID": "post6130725", "text": "You do have a point - it's hard to get a tempered glass screen protector to \"behave\" like its plastic counterparts.", "time": "01-08-2018 05:47 PM", "replies": []}]}]}]}]}]}]}, {"postID": "post6136073", "text": "I got an incipio glass protector off ebay 7.99", "time": "01-14-2018 11:58 AM", "replies": []}, {"postID": "post6136815", "text": "Gadget Guard Black Ice Edition Tempered Glass is what i went with. it is good so far but hate the lip that adds to the edges of the screen.", "time": "01-15-2018 08:31 AM", "replies": [{"postID": "post6162415", "text": "so stupid screen protector broke already. i got a couple of chips along the edge and started picking it and the protector cracked. i hate the lip the glass protector gives phones. anyone have any luck with thinner plastic protector??", "time": "02-14-2018 10:02 AM", "replies": []}]}, {"postID": "post6137670", "text": "I really like the supershieldz from amazon, i read reviews that they may crack easily which i have kids so they all seem to crack easy lol, but i contacted them and told them they cracked and a few days later a new 2 pack was at my door", "time": "01-16-2018 08:03 AM", "replies": []}]}, {"title": "wired head set???", "thread": [{"postID": "post6156986", "text": "whats everyone using?\napple earbuds no work with type c connector. need something that will also work with my moto g5 plus. i know adapter is going to be needed for phones. just looking for something cheap to use at work and be able to switch between the two.", "time": "02-07-2018 03:18 PM", "replies": []}, {"postID": "post6158726", "text": "just for phone calls? i use these cheap samsung ones and i love them:\nSamsung Active InEar Headphoneshttps://www.amazon.com/gp/product/B0...cUvbUpU6158726", "time": "02-09-2018 01:02 PM", "replies": [{"postID": "post6160760", "text": "they work well with the type c adapter?", "time": "02-12-2018 07:15 AM", "replies": [{"postID": "post6160769", "text": "All non Apple headsets 'should' work with the adapter.\nOr you could look into cheaper bluetooth ones. The Tronsmart S1 is a decent buy with a lot of battery.", "time": "02-12-2018 07:28 AM", "replies": []}, {"postID": "post6161496", "text": "Yes I plug them into the dongle and they work the same way they work in my LG V20 or Huawei Mate 9 that have a headphone jack", "time": "02-13-2018 05:28 AM", "replies": [{"postID": "post6161550", "text": "ok awesome. buying now.", "time": "02-13-2018 07:56 AM", "replies": []}]}]}]}]}, {"title": "Verizon: ODX27.109-34 (Oreo, Dec 2017 Security Patch)", "thread": [{"postID": "post6158029", "text": "http://forums.androidcentral.com/e?l...token=6bq_hv9r\nSoftware Version: ODX27.109-34\nAndroid Security Patch Level: 2017-12-01", "time": "02-08-2018 05:08 PM", "replies": []}]}, {"title": "Verizon: ODXS27.109-34-4 (Jan 2017, Meltdown, Spectre Security Patch)", "thread": [{"postID": "post6150982", "text": "Did anyone else just get prompted to update their OS? I had a prompt to restart. Droid version still reports 8.0.0. Anyone else?\nOn Verizon.", "time": "01-31-2018 05:37 PM", "replies": []}, {"postID": "post6151083", "text": "Mine is updating right now on it's own. Says Security Update.", "time": "01-31-2018 07:09 PM", "replies": []}, {"postID": "post6151871", "text": "Security updates don't increment the version number.", "time": "02-01-2018 04:45 PM", "replies": []}, {"postID": "post6152268", "text": "I can't connect to the car's Bluetooth now.", "time": "02-02-2018 05:33 AM", "replies": []}, {"postID": "post6152378", "text": "Dec 1 2017 update? im on tmo thats what im at now", "time": "02-02-2018 08:49 AM", "replies": []}, {"postID": "post6158026", "text": "http://forums.androidcentral.com/e?l...token=CupaRzSY\nSoftware Version: ODXS27.109-34-4\nAndroid® Security Patch Level: 2018-01-01, including Meltdown and Spectre security patches\nUpdating thread title to reflect version.", "time": "02-08-2018 05:05 PM", "replies": []}]}, {"title": "Bumper for Z2 Force that works WITH mods", "thread": [{"postID": "post6096689", "text": "Does anyone have a link for a specific bumper for the Z2 Force that works with mods? There are a bunch out there, but most do not look like they work with mods. Does anyone know of one? Preferrably one I don't have to Dremel once I get it. Thanks!", "time": "12-05-2017 12:33 PM", "replies": []}, {"postID": "post6096982", "text": "How about this one?http://forums.androidcentral.com/e?l...token=qvdT_GQU\nI use the Verizon clear bumper on my Z Force and it works really good, no issues using Moto Mods with the case. And it's held up pretty good over the last year of use.", "time": "12-05-2017 06:37 PM", "replies": []}, {"postID": "post6099413", "text": "Picked one up yesterday at the local Verizon store. Seems to work just fine w/o having to use the Dremel. Thanks!", "time": "12-07-2017 04:09 PM", "replies": []}, {"postID": "post6128020", "text": "I have the black version of this one http://a.co/cA1uPvz works with projector mod, but had to dremel for style shells. Small plastic lip on the bottom got in the way.", "time": "01-05-2018 03:15 PM", "replies": []}, {"postID": "post6128042", "text": "I been using this one for the past weeks.https://www.amazon.com/gp/prod...mp;...cUvbUpU6128042", "time": "01-05-2018 03:43 PM", "replies": []}]}, {"title": "Back plates??", "thread": [{"postID": "post6125674", "text": "what back plates is everyone using? I just purchased the Incipio with the cloth and it definitely helps with slippery issues of the phone. \nJust curious as to what everyone went with. Moto brand etc??", "time": "01-03-2018 08:39 AM", "replies": []}, {"postID": "post6125698", "text": "I rotate between the Moto brand light Oak, washed Oak and the Moto Wireless Style Shell (nylon material). My wife uses the Moto Wireless Style Shell floral pattern only.", "time": "01-03-2018 09:19 AM", "replies": []}, {"postID": "post6125739", "text": "For style I use the black nylon, leather and charcoal oak. When I need more juice, I use either the Incipio offGrid or the turbo pack.", "time": "01-03-2018 10:08 AM", "replies": []}, {"postID": "post6126002", "text": "do any of them work with magnetic car mounts?", "time": "01-03-2018 03:18 PM", "replies": []}, {"postID": "post6128014", "text": "Use the Wireless charging herringbone cloth back as default. Cloth feels very premium to me.", "time": "01-05-2018 03:12 PM", "replies": []}]}, {"title": "Quiet snapchat mic", "thread": [{"postID": "post6119690", "text": "Anyone notice their voice recording, specifically on Snapchat, is quiet? Few of my buddies are giving me **** about my voice being much quieter than anyone elses. Confirmed this after swapping phones with each other over Christmas.", "time": "12-27-2017 04:37 PM", "replies": []}, {"postID": "post6125524", "text": "I have the same problem", "time": "01-03-2018 04:41 AM", "replies": []}]}, {"title": "App and Audio Problems with Moto Z2 Force", "thread": [{"postID": "post5982851", "text": "While in an app, I.E. Facebook it will go to my contacts Lyft or another app. People can't her me when I am laying down as well. Anyone else have that problem?", "time": "09-19-2017 10:38 AM", "replies": []}, {"postID": "post6125521", "text": "Same here but mine will just turn on while my phone is locked, it'll randomly open a Moto Loop app, Lyft, Kik Messenger, Moto Slides app or Uber", "time": "01-03-2018 04:34 AM", "replies": []}]}, {"title": "SD Card - Using external SD card as internal storage", "thread": [{"postID": "post6098503", "text": "I have formatted the SD card multiple times, but I haven't been able to get the option to use the SD card as internal storage. Any ideas of what might be going on?", "time": "12-06-2017 11:26 PM", "replies": []}, {"postID": "post6098596", "text": "Is that device capable of doing that?", "time": "12-07-2017 02:10 AM", "replies": []}, {"postID": "post6101916", "text": "On the T-Mobile owners manual says that it is capable of it. I know it's not the SD card either since is the same one I used on a Moto G5 Plus as adoptable storage.", "time": "12-09-2017 07:53 PM", "replies": []}, {"postID": "post6108886", "text": "Do you really need the SD card as internal though? I have a moto z, and just ordered this one.... Now my line of thinking this has a 64gb drive on it, which is great for apps and such. If you have a normal SD card then you cn still control where you put music and videos, where as when as internal storage is set the phone still decides. Just my ,02 cents. I do know that it should go internal since the motorola updates are pretty much the same.", "time": "12-16-2017 12:22 PM", "replies": [{"postID": "post6111147", "text": "Not really but since I got the gamepad I was thinking of installing all the games I have bought during the years. Which is close to 100GB of data.", "time": "12-18-2017 04:55 PM", "replies": []}]}, {"postID": "post6121354", "text": "I don't know if this a SD card problem or a phone problem. My phone let me delete some photos on it. I get this message, it's so annoying", "time": "12-29-2017 10:00 AM", "replies": []}]}, {"title": "Moto voice", "thread": [{"postID": "post6049891", "text": "I just recently set up the Moto voice option, then tried it out ..,. Nothing phone doesn't do anything. Am I supposed to hit s certain button?", "time": "11-02-2017 06:16 AM", "replies": []}, {"postID": "post6050370", "text": "RRHMJ23, what voice commands are you giving it, exactly? The new Moto Voice on Z2 Force only responds to \"Show Me\" commands, e.g. \"Show me the calendar\", my day, my appointments, my next meeting, <app name>, etc.\nFor hands-free voice to make calls, send texts, ask Google questions, etc., you now need to set up Google Assistant voice control, then you can say \"OK Google...\" to perform all the usual Google Assistant functions.\nFor Moto Voice and OK Google to wake and unlock your phone, Trusted Voice must be enabled in Settings->Security->Smart Lock. \nAnd, Smart Lock (Google) and Smart Lock (Moto Voice) must be enabled in Settings->Security->Trust agents.", "time": "11-02-2017 12:07 PM", "replies": []}, {"postID": "post6062954", "text": "Wow so it's true they got rid of the core features of Moto voice. That's the only reason I bought a Moto phone. My MXPE still has the full featured Moto voice, but when I'm done with it, it looks like pixels will be in my future from now on.", "time": "11-10-2017 03:48 AM", "replies": []}, {"postID": "post6063249", "text": "J Dubbs, no hands free voice capabilities have gone away, they've only been expanded with the combination of Show Me and Google Assistant. Together they do everything Moto Voice used to, and more, even faster. \nI don't understand the complaints here about voice control, honestly. It's only better now. I suspect this has been confused by users who haven't yet discovered Google Assistant.", "time": "11-10-2017 09:38 AM", "replies": [{"postID": "post6064417", "text": "What I was talking about was Moto voice reading out my calls and texts to me, and letting me respond hands free through my Bluetooth or over the speaker phone. After coming from a Windows phone with Cortana I am extremely spoiled by features like those..... and from what I'm gathering Lenovo is getting rid of them.\nI would love to be wrong on that though ;-)", "time": "11-11-2017 03:38 AM", "replies": []}]}, {"postID": "post6063471", "text": "I've tried Moto voice. Half the time it doesn't respond to me. Same goes for Google. Is there a way to turn up the response or mic however it picks up my voice", "time": "11-10-2017 12:46 PM", "replies": []}, {"postID": "post6063903", "text": "RRHMJ23, what commands are you giving it? Have you retrained both Moto Voice and Google Assistant? They need to be done separately. For me, Show Me works very fast opening apps, much faster than scrolling in the app drawer.", "time": "11-10-2017 05:44 PM", "replies": []}, {"postID": "post6064634", "text": "you used to be able to put Cortana on Android phones. Microsoft even had their own laundry now", "time": "11-11-2017 08:40 AM", "replies": []}, {"postID": "post6064814", "text": "J Dubbs, all those capabilities still exist, and I'd argue work best on Moto, because they can be invoked 100% hands free with phone locked and on battery using Trusted Voice (to my knowledge, neither Siri not Cortana do that, but I may be out of date).\nThe only difference now is that texting and dialing is invoked directly with n Google Assistant, which works a lot faster than the previous Moto Voice ->Google Now indirect method.", "time": "11-11-2017 10:36 AM", "replies": []}, {"postID": "post6065601", "text": "Sorry don't have experience using moto voice.", "time": "11-11-2017 07:13 PM", "replies": []}, {"postID": "post6089621", "text": "I have confirmed that all my settings match these and neither Ok Google or Moto Show me works.", "time": "11-29-2017 12:11 PM", "replies": []}, {"postID": "post6089692", "text": "That's a bummer, if I were you I would contact Motorola support. As far as I know, OK Google and Show Me voice recognition should work on all Moto Z2 Force devices, at least in the USA, I'm not sure about other countries and languages. \nNote, I am seeing Moto Voice Show Me voice recognition needing to be retrained every week or so, which does seem like a bug, and I can't correlate it with any particular app updates, reboots, etc.\nAlso, that OK Google Trusted Voice Smart Lock capability that unlocks the phone automatically also seems to have a bug that causes it to disengage periodically.\nClearly, there are bugs in the voice assistants, but again it's not that they've been removed from the Moto lineup.", "time": "11-29-2017 01:06 PM", "replies": []}, {"postID": "post6094244", "text": "There was an update to Moto voice not too long ago. I haven't retrained mine since. I'll have to see if the update fixed things. It seems that they both work hit n miss", "time": "12-03-2017 08:40 AM", "replies": []}, {"postID": "post6108888", "text": "Should still be there, I have the latest on my Moto Z and it is there under assistant I think it is. I speak my opening command and i comes up, yes pretty much comes up though with google command listening but works great. I use it a lot when driving. Just got to make sure you have it set up to listen at the right times etc...", "time": "12-16-2017 12:25 PM", "replies": []}, {"postID": "post6112899", "text": "Ok, so I need to take it back, voice command is there but it is under \"ok Google\" now as said previously by someone else. Moto Z2 Force and the Moto Z even though with same OS is different. Ya kind of sucks to not have personalized name but it still all works he same.", "time": "12-20-2017 08:32 AM", "replies": []}]}, {"title": "Equalizer?", "thread": [{"postID": "post6111686", "text": "Did a quick forum search and couldn't find any info about the \"Audio Effects\" equalizer app. It exists on my Z2 Force- it appears in Settings > Apps > System Apps- but doesn't show up in the app drawer. I can't find how to open it... \nSince Spotify doesn't have its own equalizer its audio is flat and horrible. Been this way since I bought it.\nI do have Google Play Music disabled. It doesn't rely on that, does it? If so, is it effective outside the Play Music app?", "time": "12-19-2017 07:01 AM", "replies": []}, {"postID": "post6111688", "text": "I think it relies on the Play Music app. On my Z Force and Z Play the only way to adjust the Equalizer Settings is through Play Music.", "time": "12-19-2017 07:04 AM", "replies": []}, {"postID": "post6111689", "text": "The Audio Effects app can be opened only from player apps, not from the app drawer. In Spotify try in Your library - cog/settings icon top right - equalizer.", "time": "12-19-2017 07:07 AM", "replies": []}, {"postID": "post6111882", "text": "Thanks guys. Google Play Music doesn't need to be enabled, i just had to access it through Spotify. Disappointed I cant create a custom EQ setting but it's better than nothing.", "time": "12-19-2017 10:30 AM", "replies": []}]}, {"title": "Z2 Force battery with battery mod", "thread": [{"postID": "post6028882", "text": "Hey everybody,\nI have a 4 day old Z2 Force I had the Zforce which I used with incipio battery mode. I could hardly get through a whole day on the Zforce but on the Z2force I am getting much better battery life results. I now usually end up with 30% to 40% of battery life left after 12 hrs of use on the Z2 compared to 7% left on the older Zforce. Even with the smaller battery. I am now using the settings g on the mod that says efficiency mode which may be the difference. Just thought I would give my experience so far on the new phone in comparison to the old one. Your mileage may vary though.", "time": "10-20-2017 08:31 AM", "replies": [{"postID": "post6035335", "text": "It's probably the 835.\nEfficiency Mode only tries to get the phone to 80% which means it will charge the phone less often.", "time": "10-24-2017 12:36 AM", "replies": []}, {"postID": "post6111683", "text": "You go through 60-70% juice per day WITH the mod? holy crap! I have that left WITHOUT a battery mod. I have the newer Moto battery mod, which is better than the incipio in every way (larger capacity, turbo charges the phone faster, and it itself turbo charges) and can go probably 48 hours of standard usage with it. I'm usually in a good signal area and don't play games or watch videos much, tho. I also don't do social media, which always drains batteries in the background. \nFor example i was in NYC a few weekends back. Woke up with 100%, took off charger and left hotel at 10am with the battery mod. Didn't return until the following day at 11am and still had 50% left. My friends' phones (iphone 6? and SGS6) were dead by midnight. I don't buy things based on other peoples' opinions, but they were extremely jealous of my z2 setup.", "time": "12-19-2017 06:56 AM", "replies": [{"postID": "post6111853", "text": "Which is the newest battery mod? The one with 3490mAh? Or the 2220mAh?", "time": "12-19-2017 10:10 AM", "replies": []}]}]}, {"postID": "post6030648", "text": "the 835 chipset is much more efficient..I agree I have the Incipio mod as well but I find out I rather take it off and use just a plain case which make the phone much lighter..I can do that because the Z2 has amazing battery life.", "time": "10-21-2017 07:22 AM", "replies": []}, {"postID": "post6030920", "text": "It would seem the battery concerns for the Z2 Force having a smaller battery are mostly alleviated. I still haven't seen a good straight comparison of the Z2 Force camera against last year's underrated Z Force camera. I realize this one has the party tricks with the pseudo depth of field effects. The Z2 Force also being lighter and thinner.", "time": "10-21-2017 11:21 AM", "replies": []}, {"postID": "post6034647", "text": "The battery life is much better than I expected. A lot of the reviews just blasted this phone, but it seems to be just a tad worse than my Oneplus 3T. I have the Tumi battery mod and it's great to have for longer days or when I'm out playing Pokemon Go.", "time": "10-23-2017 03:38 PM", "replies": []}, {"postID": "post6035538", "text": "Yup, the 835 is so good I generally don't need the battery mod.\nIt is a shame all the reviews jumped all over the specs instead of actual real world use", "time": "10-24-2017 05:57 AM", "replies": []}, {"postID": "post6042880", "text": "I must say I am very impressed with the battery life. I came from a s8+ and barley notice a difference. the s8+ is still slightly better but this phone is no slouch.", "time": "10-28-2017 12:47 PM", "replies": []}]}, {"title": "Moto Z2 keyboard sensitivity adjustment", "thread": [{"postID": "post6109614", "text": "As you know the Moto Z2 force is subject to scratches, after I installed a tempered glass protection it developed slow keyboard detection. How can I adjust the keyboard sensitivity?", "time": "12-17-2017 07:42 AM", "replies": []}, {"postID": "post6110826", "text": "Welcome to Android Central! Is it just the keyboard, or is it screen touches in general? Not all screen protectors work well -- you may want to try using a different one.", "time": "12-18-2017 11:49 AM", "replies": []}]}, {"title": "Casting your screen", "thread": [{"postID": "post6037244", "text": "Is there something you need to do to cast ( screen share) your screen . My old phone with uld start searching for compatible devices when I turned the option on. This phone automatically says no devices available. They is no button to search for devices.", "time": "10-25-2017 01:47 AM", "replies": []}, {"postID": "post6039066", "text": "It searches automatically as well. What are you trying to cast to? It will only cast to a Chromecast device, not Miracast.", "time": "10-25-2017 11:28 PM", "replies": []}, {"postID": "post6047154", "text": "Oh. It only cast to Miracast I don't know if my tv supports that. My old phone casted just fine", "time": "10-31-2017 10:13 AM", "replies": []}, {"postID": "post6079638", "text": "Assuming it's like the 1st gen Moto Z (and most current Android), they've droppped Miracast support. You'll need a device like a Chromecast to cast the screen, and some apps are set up to not allow casting due to copyright issues (or app developers just being a pain about such things...)", "time": "11-21-2017 11:53 AM", "replies": []}, {"postID": "post6108889", "text": "Ya no Miracast which is stupid, I was looking for that when i got my new car stereo that supported that, and well Moto does not. Pretty much have to use Chromecast", "time": "12-16-2017 12:27 PM", "replies": []}]}, {"title": "Deleting photos", "thread": [{"postID": "post6056123", "text": "I was trying to delete photos, I clicked a photo and pressed delete, a message comes up that says \" photos doesn't have access to delete items on your SD card. Go to gallery app to continue delete.”. I don't see the gallery app on the phone. What am I doing wrong my other phones I was about to delete any photo no matter where they're stored.", "time": "11-06-2017 12:47 AM", "replies": []}, {"postID": "post6057274", "text": "Make sure you assign the correct permissions to whatever app you are attempting to use by going to settings/apps", "time": "11-06-2017 06:37 PM", "replies": [{"postID": "post6107307", "text": "Still having the same problem. This is the message I get. Anybody know what's up.", "time": "12-14-2017 08:27 PM", "replies": []}]}]}, {"title": "Motorola Z3 Line?", "thread": [{"postID": "post6101553", "text": "Anyone hear anything about the successor to the Moto Z2 line? I'm anxiously anticipating!\nHere's a link I found while doing some research - apparently, Motorola has confirmed that its current mods will indeed work with the upcoming successor to the Motorola Z2 line. That's good news for anyone who's invested heavily in the modular world. Hopefully this \"trusted reviews\" link is TRUST-worthy! 🤣Moto Z3: Moto Mods support confirmed for 2018 flagship | Trusted Reviews", "time": "12-09-2017 12:18 PM", "replies": []}, {"postID": "post6101579", "text": "I trust it. Moto has announced numerous times that the first 3 Z phones would all be backwards compatible with Mods. So the Mods from the Z, Z2 and Z3 series will all be compatible. They have been pretty out front with those statements so I doubt they will change plans now. As far as the Z3 itself, I have not seen any news. I think all we can guess at this point is a Z3 Force model and a Z3 Play model.", "time": "12-09-2017 12:39 PM", "replies": [{"postID": "post6101594", "text": "That's great to know! Thanks!", "time": "12-09-2017 12:58 PM", "replies": []}]}, {"postID": "post6104520", "text": "If T-Mobile ever fixes the group text issue, then I won't really see a reason to upgrade to the Z3.\nThe Z2 Force is pretty solid", "time": "12-12-2017 07:29 AM", "replies": []}]}, {"title": "Water repellent nano coating", "thread": [{"postID": "post5944273", "text": "Has anyone tested out the nano coating?", "time": "08-29-2017 08:28 AM", "replies": []}, {"postID": "post5944600", "text": "probably shouldn't submerge this phone", "time": "08-29-2017 12:16 PM", "replies": []}, {"postID": "post5945092", "text": "True. I meant had anyone had it in light rain or has anyone splashed it", "time": "08-29-2017 04:48 PM", "replies": []}, {"postID": "post5950165", "text": "One time when I was off work it was a little harder than light rain but screen(phone) performs the same. I'm using a Z Play but the coating should be the same thing but I don't submerging it is a good idea.", "time": "09-01-2017 04:13 AM", "replies": []}, {"postID": "post5952067", "text": "I've splashed it when washing dishes. nothing happened. the water didn't seem to phase it at all", "time": "09-02-2017 12:16 AM", "replies": []}, {"postID": "post5952083", "text": "Don't dunk it.", "time": "09-02-2017 12:49 AM", "replies": []}, {"postID": "post5992550", "text": "I've used my phone in the rain several times without a worry. Not having an IP rating doesn't scare me. Besides, who thinks it's a good idea to submerge a phone they paid several hundred dollars for? And those phones with IP ratings do not warranty against water damage.", "time": "09-25-2017 05:50 PM", "replies": []}, {"postID": "post6101054", "text": "Once you done nano coating on the car then water, acid rain, dangerous air particle will not affect the paintwork at all. Nano coating works like anti-static which means air dust will never be able to put on the cars paintwork. If you do get a scratch on the paintwork, it will easily disappear with a bit of light polishing.\nCar coating preserve your car paint and it is not going to be damaged by bird droppings, scratches, stone chips, dust, dirt, bugs, tar or graffiti paint. \nIt provides you high durability, high gloss, hydrophobic properties, UV protection and self-cleaning capabilities.", "time": "12-09-2017 12:42 AM", "replies": []}]}]
[{"title": "Moto Z2 Force screen is pealing off!!", "thread": [{"postID": "post6078240", "text": "After two months my screen is pealing off!! normal use I had a screen protector on it and it's pealing off. Anyone else have this problem? We need to get a class action going!\nMoto Z2 Force screen pealing off after two months of normal use. Anyone else having this issue? I love the mods but the screen is garbage.\nPicturehttps://twitter.com/Stencilpro123/st...73286164459520", "time": "11-20-2017 12:29 PM", "replies": []}, {"postID": "post6078267", "text": "Your outer layer (the lens) is peeling off?", "time": "11-20-2017 12:49 PM", "replies": []}, {"postID": "post6078351", "text": "Duplicate threads merged and moved from the Z Force forum to the Z2 Force forum.", "time": "11-20-2017 01:55 PM", "replies": []}, {"postID": "post6079598", "text": "Seeing as how I haven't heard this from anyone else, calling for a class action lawsuit is rather silly. Looking at the picture it almost looks like a thin plastic screen protector coming off, vs the lens, though I'm not sure. Either way it's a practically new phone, so get ahold of Motorola and have them make it right. Warranties exist for a reason.", "time": "11-21-2017 11:16 AM", "replies": []}, {"postID": "post6082664", "text": "After looking at the picture, I am perplexed. What is the piece That's actually peeling away there? It doesn't look like the stock outer layer lens. An aftermarket screen protector maybe?", "time": "11-23-2017 06:32 PM", "replies": []}, {"postID": "post6083732", "text": "These phones ship from the factory with a screen protector (Moto calls it an outer lens but I doubt it is much more than your typical screen protector film). I suspect most people put an aftermarket screen protector over-top of the factory lens. In this case it looks like it could be the lens peeling up. A class action lawsuit for this is a bit far-fetched...", "time": "11-24-2017 09:32 PM", "replies": [{"postID": "post6087299", "text": "Is that not the shatter shield peeling in his picture ? It's a defect.", "time": "11-27-2017 08:56 PM", "replies": [{"postID": "post6099445", "text": "I will admit that I'm using the Moto Z Force OG edition. I assumed that the new model uses the same setup but I'm not having the same issue at all with the OG.\nI'm still trying to figure out how this warrants a lawsuit. Is this or isn't this the outer layer that is considered removeable/replaceable? If so, that seems to be what is defective (not the phone?), and it would be quite simple for Moto to make it up to you all. I hope they are listening...\nOn a related note, the replacement lens for the Z is $29.99 (and hard to get I hear). I thought that was expensive, but I just noticed the comparable lens for the Z2 is $49.99  And on top of that, I guess you can't yet replace them yourself, as the only option for the Z2 is to send them in for repair. That's quite unfortunate...", "time": "12-07-2017 04:33 PM", "replies": []}]}]}, {"postID": "post6088262", "text": "Mime is doing the same thing. I agree a class action is needed. There has not been any misuse, its a design flaw. Motorola support wanted $49 and for me to mail it in for repair. Not only does the outer layer peal off with normal use, it scratches super easy. There isnt much benefit from a nonbreakable svcreen when its all scratched up because its made of soft plastic.", "time": "11-28-2017 02:53 PM", "replies": []}, {"postID": "post6088265", "text": "They refused my warranty request for the same issue. Thus a class action is whats needed!", "time": "11-28-2017 02:55 PM", "replies": []}, {"postID": "post6099312", "text": "I'm having the same issue but it's the border around the entire screen. It's mostly peeling around speaker which cuts my ear! So annoyed... If there's going to be a class action let me know.", "time": "12-07-2017 02:45 PM", "replies": []}]}, {"title": "Disapearing texts", "thread": [{"postID": "post6095292", "text": "I've noticed that sometimes my text threads have disappeared. I looked in my achived and there not there.", "time": "12-04-2017 07:19 AM", "replies": []}, {"postID": "post6098480", "text": "Is there any way of setting how many texts u can get in a thread before deletion? I don't understand why my threads are disappearing. Ugh. It's so annoying", "time": "12-06-2017 10:52 PM", "replies": []}]}, {"title": "Second Generation Motorola Moto Z and Moto Z Force (Moto Z2, Moto Z 2017)", "thread": [{"postID": "post5745321", "text": "https://twitter.com/evleaks/status/849685759691042816\nfunction loadx(data) {\n  document.write(data.html);\n}", "time": "04-05-2017 02:49 PM", "replies": []}, {"postID": "post5755805", "text": "https://twitter.com/Slashleaks/statu...14469492854785\nfunction loadx(data) {\n  document.write(data.html);\n}\nMotorola Moto Z2 / Z2 Force press render « SLASHLEAKS", "time": "04-12-2017 12:07 PM", "replies": []}, {"postID": "post5758732", "text": "Think there will be any changes to specs?", "time": "04-14-2017 08:04 AM", "replies": [{"postID": "post5759173", "text": "Snapdragon 835 at minimum. Maybe it starts at 64GB instead of 32.", "time": "04-14-2017 12:29 PM", "replies": []}]}, {"postID": "post5760894", "text": "So the headphones jack makes a comeback?https://mobile.twitter.com/OnLeaks/s...23808450387968\nfunction loadx(data) {\n  document.write(data.html);\n}\nhttp://www.androidauthority.com/excl...s-video-764254\n(Or is this the second gen Moto Z Play since that had a headphone jack?)", "time": "04-15-2017 02:32 PM", "replies": []}, {"postID": "post5799629", "text": "Looks interesting, but so far the Z2 Play (or whatever the Play's ensuing iteration is called) is holding my attention from the Motorola line.", "time": "05-03-2017 08:46 PM", "replies": []}, {"postID": "post5802206", "text": "Looks like the Z2 Play will have a smaller battery. If so, there goes my interest in this device. Camera to be improved, though it will have less resolution. More on board memory too.No one has ever accused the Moto Z lineup of being too bulky; in fact, Motorola’s first generation of modular phones are some of the slimmest handsets available. But that isn’t stopping the Lenovo subsidiary from shaving precious thickness off of the Android 7.1.1 Nougat-powered Moto Z2 Play.\nThat reduction in depth, however, will come at a somewhat steep price, according to marketing material reviewed by VentureBeat: a model whose predecessor is renowned for its capacious 3510mAh battery is going to offer a much more conservative 3000mAh pack. That has the effect of reducing maximum listed usage time from 50 hours down to 30 hours.https://venturebeat.com/2017/05/05/m...-battery-life/", "time": "05-05-2017 02:08 PM", "replies": [{"postID": "post5802471", "text": "Hmm, will keep an eye on this situation. Thanks for the update!", "time": "05-05-2017 05:58 PM", "replies": []}]}, {"postID": "post5802984", "text": "There goes my interest in the Z Play 2. I'll hang on to my original Z Play longer than anticipated.", "time": "05-06-2017 07:03 AM", "replies": []}, {"postID": "post5814575", "text": "https://twitter.com/evleaks/status/863580163153461249\nfunction loadx(data) {\n  document.write(data.html);\n}", "time": "05-14-2017 04:00 PM", "replies": []}, {"postID": "post5814831", "text": "The new Moto X looks very interesting, especially if the 3800 mAh battery rumor is true.", "time": "05-14-2017 07:51 PM", "replies": []}, {"postID": "post5818904", "text": "Looks like there will be a regular Moto Z2 (besides the Play and Force).https://twitter.com/evleaks/status/864487036857798661\nfunction loadx(data) {\n  document.write(data.html);\n}\nhttps://twitter.com/evleaks/status/864254499711569920\nfunction loadx(data) {\n  document.write(data.html);\n}", "time": "05-17-2017 05:05 PM", "replies": []}, {"postID": "post5818910", "text": "Lenovo Moto Z2 breaks cover: check it out here", "time": "05-17-2017 05:07 PM", "replies": []}, {"postID": "post5820140", "text": "Exclusive: Here’s a new look at the Motorola Moto Z2 Force", "time": "05-18-2017 04:04 PM", "replies": []}, {"postID": "post5820411", "text": "Not enough of a change, in my opinion. Moto needed to reduce the screen bezels and increase the overall screen real estate (e.g. Galaxy S8). I'll be sticking with my original Z Force until the Note 8 is released. 🙄", "time": "05-18-2017 08:27 PM", "replies": [{"postID": "post5820447", "text": "With Moto Mods, they're not putting the FPS on the wrong side.", "time": "05-18-2017 09:04 PM", "replies": [{"postID": "post5820470", "text": "Agreed, but they could have certainly removed their logo from the bottom and expanded the actual screen along all four sides.", "time": "05-18-2017 09:22 PM", "replies": []}]}]}, {"postID": "post5834413", "text": "Moto Z2 lineup: all the rumors in one place (Update: more Moto Z2 and Z2 Play pics leak)", "time": "05-31-2017 01:40 PM", "replies": []}, {"postID": "post5893877", "text": "I'm extremely disappointed. I've been waiting for the Force Z2 to come out and possibly upgrade my 2 1/2 year old Droid Turbo. But the rumor is that the battery will be only 2,730 mAh in size, down from 3,500 mAh in size in the Force Z. It's an obvious ploy to sell battery pack mods.https://venturebeat.com/2017/07/20/t...s-worst-specs/", "time": "07-21-2017 10:05 AM", "replies": [{"postID": "post5893907", "text": "I can understand your disappointment. I was upset to hear the same until you really start thinking about the end results. Allow me to explain...\nLast August, I needed a replacement for my Note 7 {brief moment of silence} ️ and headed over to Best Buy. That's when I first held the Moto Z and the Z Force. The salesperson took a power pack out of the box and let me feel both phones in my hand. I immediately thought \"I wish I can have the slim Moto Z form factor with the same RAM, camera and processor as the Z Force\". All because the battery pack allows you to have the best of both worlds! \nIt seems that the Z Force 2 is the answer to last year's prayers. My only gripe is that the bezels are still rather wide on the latest version and I was hoping for something slimmer.", "time": "07-21-2017 10:17 AM", "replies": []}]}, {"postID": "post5897953", "text": "Not very excited about the smaller battery...2730mah seems awfully small especially for the s835. Let's see how moto will tweak it for battery life. \nDual cameras is cool, hopefully they will be able to do an iPhone like portrait mode.https://www.google.com/amp/s/www.and...z2-force%3famp", "time": "07-24-2017 02:51 PM", "replies": []}, {"postID": "post5899096", "text": "Confirmed. 2,730 mAh battery.\nConfirmed. f2.0 dual rear cameras, 12 MP. I see no mention of optical image stabilization. [f2.0? Really?]\nI think I'll pass. https://www.androidcentral.com/moto-...-edition-specs", "time": "07-25-2017 10:40 AM", "replies": []}, {"postID": "post6096124", "text": "Definitely a pass for me on any Moto. Very disappointed.", "time": "12-04-2017 10:35 PM", "replies": []}, {"postID": "post6097026", "text": "dude these parts are from forever ago. the Moto z2 force outpaces the s8 and s8+ in battery life. I'm very happy", "time": "12-05-2017 07:43 PM", "replies": []}]}, {"title": "Flash on Chrome", "thread": [{"postID": "post6094138", "text": "I know you can't use flash on Chrome, best browser with flash ?", "time": "12-03-2017 03:47 AM", "replies": []}, {"postID": "post6094332", "text": "For me, Firefox. (It's a personal choice - you have to find the one you like best.)", "time": "12-03-2017 11:00 AM", "replies": []}]}, {"title": "No 3.5mm headphone jack - deal breaker or not?", "thread": [{"postID": "post5899440", "text": "There's no 3.5mm headphone jack like the z force droid, will this be a deal breaker for you? Personally, I haven't used 3.5mm headphones in years so it doesn't bother me, but i can see it as a downer for those that do. There is an usb c to headphone jack in the box but that seems very easy to lose, IMO.", "time": "07-25-2017 03:31 PM", "replies": [{"postID": "post5899807", "text": "Yes.... Deal breaker.", "time": "07-25-2017 09:20 PM", "replies": [{"postID": "post5899826", "text": "According to to the T-Mobile site it includes the adapter.", "time": "07-25-2017 09:53 PM", "replies": [{"postID": "post5899846", "text": "I actually read the post wrong", "time": "07-25-2017 10:10 PM", "replies": []}]}, {"postID": "post5899870", "text": "Andrew's retail box had the adapter.", "time": "07-25-2017 10:27 PM", "replies": [{"postID": "post5904654", "text": "I read the post wrong", "time": "07-29-2017 04:17 PM", "replies": []}]}]}, {"postID": "post6087878", "text": "I absolutely hate registering and creating new accounts, let alone having to give feedback to companies that should already be doing their own research, so for me to even do this shows how invested I am in this topic.\nDeal breaker to the point that I would rather get a basic flip phone and move to an audio device. Things I care about in a phone by rank:\n-Listening to music (headphones)\n-Storage\n-Ease of use on the interface\n-Access to emails and maps/traffic\nRegarding this topic, yes I know how Bluetooth works and I have a nice JBL box in my home for portable use around the house as needed; patio, kitchen while cooking, maybe in the bedroom while reading. So I do use that functionality. Yes the sound quality is less and I notice that. This is why I often use the headphone jack in the car rather than the Bluetooth for music.\nWhen I use the headphone jack by rank:\n-At work (up to 10 hours per day)\n-Car trips (daily)\n-Snowboarding (up to 6 hours per day when snowboarding plus plug in time in the car for the commute to and from the slopes)\n-Gym (one hour per day)\n-Travel ( I travel for work and pleasure, always use headphone jack while in the airport and on the plane)\nI'm not going to add additional time (and cost) to charge an under performing headset continuously during these times. My life and time are too valuable to waste more time charging devices I never asked for in the first place.\nI don't watch Star Wars or porn on my phone so not sure why we need 4k definition on phones. Really people, on phones? So give me a basic display in a small platform and I'll keep the headphone jack. Thanks.", "time": "11-28-2017 10:18 AM", "replies": []}]}, {"postID": "post5899486", "text": "Deal breaker!", "time": "07-25-2017 04:21 PM", "replies": []}, {"postID": "post5899515", "text": "Deal breaker for me. I have a Motorola g4 plus and have been tracking the z2 force eagerly for some time. I can't believe they reduced the battery and took off the headphone jack. \nI use Bluetooth headphones during my work commute, but sometimes its not practical to fire up the headset (like if I want to listen to something at work, I want the option to plug in my earbuds without some stupid adapter).\nThis phone is a hard pass for me. I will probably just try to catch the g5 plus next time it goes on sale.", "time": "07-25-2017 04:41 PM", "replies": []}, {"postID": "post5899636", "text": "Wasn't a deal breaker when I bought the first Moto Z Force.", "time": "07-25-2017 06:22 PM", "replies": []}, {"postID": "post5901514", "text": "didn't phase me on the first one, I just put the adapter on my headphones and left it there, never even noticed it", "time": "07-27-2017 09:00 AM", "replies": []}, {"postID": "post5901656", "text": "If it comes with the adapter, not a deal breaker. But it's an unnecessary hassle to need an adapter. Just another detraction from this phone.", "time": "07-27-2017 11:14 AM", "replies": []}, {"postID": "post5901683", "text": "Bluetooth headphones, in my experience, are way behind wired microphones. They're fine for conversations but not music. Maybe if you favor gargantuan base that might make a difference. I don't know. \nDeal breaker!", "time": "07-27-2017 11:40 AM", "replies": [{"postID": "post5901719", "text": "I've got a set of bluetooth headphones. Great for listening to music or podcasts while doing other activities. Yes, wired headphones have better sound quality, but if you are listening to music on your phone and expecting hi-fidelity you're doing it wrong. If I'm going to seriously listen to music it's a home system with real speakers, not a headset plugged into a phone.", "time": "07-27-2017 12:10 PM", "replies": [{"postID": "post5902257", "text": "Respectfully, I disagree. A good set of wired headphones can, in my experience, produce outstanding sound from a premium phone.", "time": "07-27-2017 08:10 PM", "replies": [{"postID": "post5904326", "text": "Yes, a phone with headphones can trick your brain into thinking it is hearing good music. Listening to music is about the movement of air, specifically sound waves that move the eardrum and resonate with the body. You aren't moving a lot of air with headphones. Couple that handicap with a compressed .mp3 music file that people typically listen to on their phones and you've got compromised sound quality.", "time": "07-29-2017 11:05 AM", "replies": [{"postID": "post5904656", "text": "Good headphones are not handicaped....far from it and not all mp3 files are high compression. Personally I prefer FLAC files but the right headphones can make a good MP3 pure ecstasy.", "time": "07-29-2017 04:22 PM", "replies": []}, {"postID": "post5908236", "text": "I don't usually carry my home sound system around at work.", "time": "08-01-2017 02:02 PM", "replies": [{"postID": "post5908877", "text": "Yes, well I did qualify my statement by saying, \"if you're going to seriously listen to music it's got to be a home system.\" Do you spend significant time at work listening to music?", "time": "08-01-2017 11:31 PM", "replies": [{"postID": "post5910143", "text": "A signicant time working out. Bluetooth headphones at work for calls.", "time": "08-02-2017 09:37 PM", "replies": []}]}]}]}]}]}]}, {"postID": "post5903789", "text": "You can get some good extra adapters off Amazon for pretty cheap. It's a little inconvenient, but I haven't found it to be a problem with my Z Force 1. I bought a few extra adapters & have them where I'm most likely to use them. I got some nice over ear headphones a little while back, and they came with a headphone amp. I need the amp with my laptop, but my phone w/adapter pushes hard enough that I don't hear a difference with vs without the amp. So if the Zf2 is the same, at least it's good quality / strong audio.", "time": "07-29-2017 12:20 AM", "replies": []}, {"postID": "post5904694", "text": "Headphones are inherently deficient because they do not move the volume of air that musical instruments at a live performance will move or a good set of speakers will move. It's simply impossible to get the dynamic range with headphones or that feeling of being affected by bass notes.\nAlso I have never heard the words 'mp3' and 'pure ecstasy' in the same sentence. I'm glad you can enjoy it.", "time": "07-29-2017 04:57 PM", "replies": [{"postID": "post5904702", "text": "Well then you probably haven't listened to a good MP3 from a phone equipped with a Quad DAC and high resolution studio headphones. Granted that FLAC or lossless files sound better but decent MP3 is not as bad as some people make it out to be. In any event you don't have to agree and I won't try to convince you.", "time": "07-29-2017 05:03 PM", "replies": []}]}, {"postID": "post5908115", "text": "Not a deal breaker for me. I use BT at home, work, and my truck. I never plug in.", "time": "08-01-2017 12:20 PM", "replies": []}, {"postID": "post5908117", "text": "For me, as long as these phones don't have a great DAC anyway, it doesn't matter. I do wish they shipped more phones for example, with the DAC from the LG V20, and if they did, the headphone jack would be the only way to enjoy it. Unfortunately it seems that for most users, audio quality is not a priority. The product managers at these companies who choose not to ship the DAC or to remove the headphone jack are not likely doing this in a vacuum.", "time": "08-01-2017 12:22 PM", "replies": []}, {"postID": "post5908149", "text": "Not a deal breaker. Have had the HTC 10 and U11 for some time now and the functionality of active noise cancellation (both through the U11's handset and through JBL Aware-C earphones) more than makes up for the lack of a headphone jack. Bigger deal breakers are: (1) no removable sdcard; and (2) not working on Verizon. Incidentally, in discussing the 10 v. the U11 with prospective buyers, I mention the headphone jack, but the lack of a CDMA radio in the U11 is likely more of a big deal.", "time": "08-01-2017 12:48 PM", "replies": []}, {"postID": "post5908204", "text": "The headphone jack is necessary. I wouldn't buy a phone without one.\nI own bluetooth headphones, and they are handy and portable. But I've always got a reliable set of normal headphones in my bag, incase the battery dies in the bluetooth.\nIt's also worth noting that switching your bluetooth headphones between different devices throughout the day can be tedious. With normal headphones, you just unplug it and move on.", "time": "08-01-2017 01:32 PM", "replies": []}, {"postID": "post5908215", "text": "Not a deal breaker for me. If I use a wired headset, it's always the same one so the adapter would always be connected. No big hassle here. I'm all for ditching the headphone jack in favor of USB C.", "time": "08-01-2017 01:42 PM", "replies": []}, {"postID": "post5908226", "text": "Deal-breaker. I've got an excellent noise-cancelling headset, running off Bluetooth for up to six hours on a charge. When the battery goes, I hook up the cable. I also resort to this when I fly (a lot), as the toys have to be in flight mode.", "time": "08-01-2017 01:49 PM", "replies": []}, {"postID": "post5908293", "text": "I am honestly kind of torn. I can understand why they may want to shift to USB C, but at the same time, there hasn't been enough time nor inclination by the general consumer base to warrant such a change.", "time": "08-01-2017 02:45 PM", "replies": [{"postID": "post5908590", "text": "Exactly....and even if they wanted to make it thinner the could have gone with a subminiature adapter which would keep the audio separate from the USB.", "time": "08-01-2017 06:27 PM", "replies": [{"postID": "post5908603", "text": "Or even refreshed the jack to a flat panel.", "time": "08-01-2017 06:38 PM", "replies": []}]}]}, {"postID": "post5908663", "text": "Deal breaker! Loss of a valuable feature is not supposed to be considered good at all.", "time": "08-01-2017 07:51 PM", "replies": []}, {"postID": "post5908789", "text": "When I'd first heard of this trend - with Apple, and then HTC - it just seemed strange to me. Why get rid of something so useful? But now, it doesn't bother me. As long as I'd get an adapter, I'd be set. Plus, I never listen to music/watch videos while charging my phone; so this type of thing would not be an inconvenience for me. But I do see how it could be one for others. But for me personally, I am A-OK with it.", "time": "08-01-2017 09:54 PM", "replies": []}, {"postID": "post5908827", "text": "Not a deal breaker at all. I use bluetooth for almost everything, except my headphones at the gym.", "time": "08-01-2017 10:18 PM", "replies": []}, {"postID": "post5908935", "text": "My phone is my iPod.\nI could manage, I suppose, but why manage? Why use a dongle?\nIt matters to me.", "time": "08-02-2017 01:15 AM", "replies": []}, {"postID": "post5909826", "text": "It isn't a deal breaker but there was no reason for Moto to remove the headphone jack - especially when it is included in the Z2 Play.", "time": "08-02-2017 04:46 PM", "replies": []}, {"postID": "post5909909", "text": "My issue would be that when I generally have time to listen to music, I'm also needing to charge my phone. \nI guess there would need to be a dongle that would allow me to do that.", "time": "08-02-2017 06:04 PM", "replies": []}, {"postID": "post5910087", "text": "Here's a story about learning to accept this new world without headphone jacks. My work gave me an iPhone 7 when they came out. The no headphone thing bothered me and it also came with tracking software so I needed my own personal phone. So I bought a moto G4. It was my media player and personal phone, great phone. Then on Swappa I saw a Moto Z cheap and I had been wanting to play with Google daydream. So I bought it. In the days waiting for it to arrive I read some reviews. I know, I should have read them first, but I was blinded of dreams of VR and more power. I realized it had no headphone jack. I was a little upset. I hadn't been paying attention to the android world very well and I didn't think android had this headphone killing thing going on. But it hasn't been that bad. I did buy a 2 pack of headphone to usb c adapters and 2 of these bluetooth to 3.5 mm adapters. So it's a problem that can be solved with money and preparedness. But I know one day I'll be burned. I'll be on an airplane and I won't have the usb c adapter and the bluetooth adapter will be dead. But I'll just solve it by playing the same thing on the iphone and the moto at the same time and holding them to opposite ears.", "time": "08-02-2017 08:26 PM", "replies": []}, {"postID": "post5912222", "text": "This is a potential deal breaker for me. Having used the pixel for the better half a year, I've had issues with Bluetooth. Google has been notorious for having crap Bluetooth. A perfect example would be how the quality is with Google Play Music. It will consistently pop and click when listening to music. People have recommended turning off wifi to reduce interference. This is still an issue to this day despite having claimed they fixed it. \nIn addition while this may not be an issue to some my car Ford Sync system is notorious for crapping out and the Bluetooth feature constantly drops. The only fallback I've had in this scenario is using the headphone jack, and I thank God it's there. Some people have older cars which do not have Bluetooth, what about there people? They shouldn't have to buy all these extra accessories as a workaround for a lack of a headphone jack. \nThere are other phones out there which have achieved being waterproof with the headphone jack so it's certainly doable. If taking it out due to space being a premium, then perhaps they should consider making the phone a big thicker. Phones these days are too damn slim IMO and I feel like the battery capacity is suffering as a result of these designs. Make them thicker for the headphone jack and make bigger batteries!\n</end rant>", "time": "08-04-2017 11:33 AM", "replies": []}, {"postID": "post5914761", "text": "It's a bummer they didn't include USB-C headphones. Would have been nice.", "time": "08-06-2017 09:57 PM", "replies": []}, {"postID": "post5914764", "text": "Definite deal breaker for me, I'm not a big fan of Bluetooth headphones", "time": "08-06-2017 10:06 PM", "replies": []}, {"postID": "post5922788", "text": "comes with adapter. also can't remember the last time I used my headphone jack. I stream to multiple Bluetooth devices (3 cars plus 2 speakers) and don't even know where my earbuds are.", "time": "08-13-2017 10:11 PM", "replies": []}, {"postID": "post6089058", "text": "Dealbreaker for sure. I don't need something else to charge every day. \nAlso, bluetooth headphones have too many potential points of failure.", "time": "11-29-2017 01:32 AM", "replies": []}]}, {"title": "Cyber Monday now $350 off at Best Buy, all US carriers", "thread": [{"postID": "post6034474", "text": "OP NOW OBSOLETE -- SEE END OF THREAD FOR CYBER MONDAY UPDATE) \nI took advantage of this deal in-store on Oct 19, still posted on bestbuy.com as of today (Oct 23). In-store Verizon rep's printed info said $200 off, but he honored $300 off based on the website. Website says only $200 off for the other carrier versions.\nThis promotion required a new 24 month device payment plan on an upgrade eligible line, plus $30 line upgrade fee (what a joke, shame on you, VZW), plus state sales tax on full $756 retail price. Unclear if this $300 off promotion includes free projector mod, that's not stated on bestbuy.com but in-store rep said it is included.\nThis is a gamble whether or not there will be even better Black Friday promotions on this phone. What were the best deals available for it on Verizon back at launch?", "time": "10-23-2017 02:13 PM", "replies": []}, {"postID": "post6085231", "text": "No Black Friday deal on this phone at Best Buy, though the weekend before the Z2 Force was down to $16.71 per month for 24 mos. -- Their best deal I have seen.\nFor Black Friday, they have the Z2 Play for under $8/mo.", "time": "11-26-2017 09:19 AM", "replies": []}, {"postID": "post6086725", "text": "As of today, Cyber Monday 2017, Best Buy has $350 off Z2 Force Edition on multiple US carriers. http://forums.androidcentral.com/e?l...token=kzkRw0Ls\nIncludes free InstaShare projector fulfilled by Motorola (I sold mine on eBay for over US$100 last week).", "time": "11-27-2017 12:53 PM", "replies": []}, {"postID": "post6086801", "text": "Tmobile has it for $300 full price. Think I may pick it up as a backup. That price is too good to pass up.", "time": "11-27-2017 01:45 PM", "replies": []}]}, {"title": "Z2 turbo charging <> Qualcomm QuickCharge: 5V 3A+ chargers needed", "thread": [{"postID": "post6034546", "text": "Does anyone understand how Motorola changed turbo charging on the Z2 Force, vs. earlier devices such as Droid Turbo 2?\nI've determined my QC 2.0 AC and car chargers do *not* turbo charge my Z2 Force, whereas QC 3.0 chargers do, including an iClever 24W AC adapter, RavPower 36W car charger, and Anker PowerCore 10000 with QC 3.0.\nUsing a Kill A Watt EZ meter, I've physically measured the Z2 Force turbo charge drawing ~13-15W on the iClever 24W AC adapter, and ~13-16W with the included 15W TurboPower AC adapter. (Measurements taken at <70% battery.)\nI'm particularly surprised the Motorola TurboPower 25W adapter bundled with my 2015 Droid Turbo 2 will *not* turbo charge Z2 Force -- no turbo charging notification, and drawing just 10W.\nInterestingly, Z2 Force takes longer to negotiate and enter turbo charging than the DT2, on all adapters, incl. the included one.\nDoes anyone know a software way to determine if the phone is turbo charging? I do not see it in GSam Battery Monitor, Ampere, or any other battery related app.\nBottom line, I'm glad I started purchasing QC 3.0 chargers over a year ago, even though my DT2 only supported QC 2.0.", "time": "10-23-2017 02:45 PM", "replies": []}, {"postID": "post6034614", "text": "QC 3.0 is backwards compatible in the sense that QC 3.0 chargers will charge your QC 2.0 devices. The other way doesn't always work because of changes to whether it prefers to overvolt or push amps, etc. QC 2.0 has 4 static modes available, but generally chooses between 5V 2A, 9V 2A and 12V 1.67A for 10, 18 and 20 W with the actual max power being at about 18W regardless of which setting it is choosing. QC 3.0 also has a practical max power of 18W but can vary the voltage dynamically from 3V to 20V with either 2.5A or 4.6A for current. \nThe short answer of this is, a QC 3.0 device is looking for 2.5A minimum as \"quick charging\" and a QC 2.0 charger cannot push more than 2A. A non Moto charger that is QC 2.0 i s going to show up as a max of 2A and therefore will never be considered Turbo Charging. The Moto 25 charger is slightly more nuanced, as detailed below.\nThe TurboPower 25 Charger does things slightly different, allowing for a max of 25W output, with 5V 2.85A, 9V 2.85A and 12V 2.15A modes. Depending on where it is in its steps, it's potentially only delivering 2.15A (with a max of 2.85A) even though it's capable of pushing to 25W, it's still doing so in a way that is recognized by the phone as being at a low voltage. If I recall correctly, the Turbo Chargers only \"turbo charge\" Moto devices. Otherwise they function as QC chargers for non Moto devices. The newst Moto Devices, which use the Moto TurbPower 30 (USB C) are able to accept 5V with a variable current up to 5.7A and they support USB PD. The TurboPower 30 charger supports that perfectly and will also rapid charge non QC devices that are compatible with PD. \nDumb question, but how are you able to charge the Z phones with the TurboPower 25? I thought that was a hard wired microUSB charger.", "time": "10-23-2017 03:12 PM", "replies": []}, {"postID": "post6034636", "text": "Aquila, thanks much, that's an awesome (and fast!) response. From what you wrote, plus what I'm finding on other forums (seems this question dates back to last year's Z Play), what I'm piecing together is that my Z2 Force is turbo charging on my QC 3.0 chargers not because of the QC 3.0 spec, per se, but rather because those all deliver at least 3A at 5V. My QC 2.0 chargers and Motorola TurboPower 25 all deliver <3A at 5V, insufficient to invoke turbo charging on the Z2 Force. \nIs that the right way to look at it?\nTo answer your question: Belkin USB-C to Micro-USB adapter, Belkin USB-C™ (aka Type-C™) to Micro USB Adapter\n(Oh, and here's one more fun power supply tidbit: I discovered the Motorola TurboPower 25 adapter does not work on Alaska Airlines in-seat AC power, but the lower wattage QC chargers do.)", "time": "10-23-2017 03:30 PM", "replies": []}, {"postID": "post6034674", "text": "Yes that is right, the lower amperage supplied by QC 2.0 compatible and even the original Turbo Charger 25 is simply too low to be flagged as fastest charge even if the voltage is high enough to be pushing essentially the same total wattage.", "time": "10-23-2017 03:56 PM", "replies": []}, {"postID": "post6035330", "text": "TurboPower is just a brand name. \nMicroUSB Motorola phones with TurboPower Charging use Qualcomm Quick Charge 2.0/3.0.\nUSB C Motorola phones with TurboPower Charging use USB-PD 5V 3A as the minimum for fast charging though the first gen Moto Z Force Droid can also support a faster 5V 5.7A (non-standard?) charging profile via the TurboPower 30 USB-C charger for even faster charging.", "time": "10-24-2017 12:32 AM", "replies": []}, {"postID": "post6035347", "text": "Thanks Ry, also helpful info. Is there any way way to identify third party AC, car, and portable pack chargers that deliver at least 5V 3A for turbo charging? If not then this seems like an unfortunate regression from Qualcomm QC logoed power accessories, which were easy to find. Anything equivalent for USB PD, perhaps?\nAlso, might there be any benefit to purchasing a higher power USB PD charger than 15W?", "time": "10-24-2017 12:48 AM", "replies": []}, {"postID": "post6082138", "text": "Ok so... What adapters should we be buying. For home and the car. Anybody have the links. Thanks", "time": "11-23-2017 07:56 AM", "replies": []}, {"postID": "post6082423", "text": "For car, I just ordered this $9.99 \"RAVPower 40W 3A Car Charger Adapter with Dual QC USB Ports\": http://a.co/877npKb. (I also own the previous 24W version, turbo charges my Moto Z2 Force properly but only one of the ports supplies 15W).\nOn AC, this $12.99 \"24W iClever BoostCube+ Qualcomm Certified QC 3.0 USB Wall Charger\" also turbo charges my Moto Z2 Force properly: http://a.co/feSNBAs\nThere are probably other compatible 15W chargers that would a bit smaller/lighter.", "time": "11-23-2017 01:02 PM", "replies": []}, {"postID": "post6084011", "text": "So basically as long as it's QC 3.0 and at least 15w. It'll work ?", "time": "11-25-2017 07:25 AM", "replies": []}, {"postID": "post6084349", "text": "Doesn't need QC 3.0, just at least 3 amps at 5V. Note, many 18+ watt QC chargers don't output more than 2.4A at 5V, so won't fast charge the Z2 Force despite their power rating (since QC relies on higher voltages).", "time": "11-25-2017 01:21 PM", "replies": []}]}, {"title": "Searching text messages", "thread": [{"postID": "post6078774", "text": "My old phone had the ability to search your old texts for certain words or phrases and would bring them up. Does this phone have that option or maybe a app that would help ?", "time": "11-20-2017 07:28 PM", "replies": []}, {"postID": "post6078848", "text": "Are you using Android Messages or Verizon Message +, both come loaded on the phone I believe. Android Messages does have a search option. I'm not sure if Message + does or not.", "time": "11-20-2017 08:04 PM", "replies": []}, {"postID": "post6078988", "text": "Textra allows you to search your texts.", "time": "11-20-2017 10:31 PM", "replies": []}, {"postID": "post6081391", "text": "+1 on Textra, search works great.", "time": "11-22-2017 02:14 PM", "replies": []}, {"postID": "post6082135", "text": "Thanks. I'll try those, my carrier is TMobile and I'm using the stock message app.", "time": "11-23-2017 07:52 AM", "replies": []}]}, {"title": "new Software update from T-Mobile for moto Z2 forces", "thread": [{"postID": "post6072344", "text": "https://support.t-mobile.com/docs/DOC-35970", "time": "11-16-2017 01:38 AM", "replies": []}, {"postID": "post6073498", "text": "Anyone actually get it yet?", "time": "11-16-2017 07:30 PM", "replies": []}, {"postID": "post6073535", "text": "nope", "time": "11-16-2017 08:01 PM", "replies": []}, {"postID": "post6074322", "text": "not yet", "time": "11-17-2017 11:09 AM", "replies": []}, {"postID": "post6078924", "text": "disappointed in this update! seriously it's still on the old security patch!", "time": "11-20-2017 09:21 PM", "replies": []}, {"postID": "post6078961", "text": "I got mine today, on the August security patch", "time": "11-20-2017 09:56 PM", "replies": []}]}, {"title": "Moto Z2 Force screen pealing off!", "thread": [{"postID": "post6078240", "text": "After two months my screen is pealing off!! normal use I had a screen protector on it and it's pealing off. Anyone else have this problem? We need to get a class action going!\nMoto Z2 Force screen pealing off after two months of normal use. Anyone else having this issue? I love the mods but the screen is garbage.\nPicturehttps://twitter.com/Stencilpro123/st...73286164459520", "time": "11-20-2017 12:29 PM", "replies": []}, {"postID": "post6078267", "text": "Your outer layer (the lens) is peeling off?", "time": "11-20-2017 12:49 PM", "replies": []}, {"postID": "post6078351", "text": "Duplicate threads merged and moved from the Z Force forum to the Z2 Force forum.", "time": "11-20-2017 01:55 PM", "replies": []}, {"postID": "post6079598", "text": "Seeing as how I haven't heard this from anyone else, calling for a class action lawsuit is rather silly. Looking at the picture it almost looks like a thin plastic screen protector coming off, vs the lens, though I'm not sure. Either way it's a practically new phone, so get ahold of Motorola and have them make it right. Warranties exist for a reason.", "time": "11-21-2017 11:16 AM", "replies": []}, {"postID": "post6082664", "text": "After looking at the picture, I am perplexed. What is the piece That's actually peeling away there? It doesn't look like the stock outer layer lens. An aftermarket screen protector maybe?", "time": "11-23-2017 06:32 PM", "replies": []}, {"postID": "post6083732", "text": "These phones ship from the factory with a screen protector (Moto calls it an outer lens but I doubt it is much more than your typical screen protector film). I suspect most people put an aftermarket screen protector over-top of the factory lens. In this case it looks like it could be the lens peeling up. A class action lawsuit for this is a bit far-fetched...", "time": "11-24-2017 09:32 PM", "replies": [{"postID": "post6087299", "text": "Is that not the shatter shield peeling in his picture ? It's a defect.", "time": "11-27-2017 08:56 PM", "replies": [{"postID": "post6099445", "text": "I will admit that I'm using the Moto Z Force OG edition. I assumed that the new model uses the same setup but I'm not having the same issue at all with the OG.\nI'm still trying to figure out how this warrants a lawsuit. Is this or isn't this the outer layer that is considered removeable/replaceable? If so, that seems to be what is defective (not the phone?), and it would be quite simple for Moto to make it up to you all. I hope they are listening...\nOn a related note, the replacement lens for the Z is $29.99 (and hard to get I hear). I thought that was expensive, but I just noticed the comparable lens for the Z2 is $49.99  And on top of that, I guess you can't yet replace them yourself, as the only option for the Z2 is to send them in for repair. That's quite unfortunate...", "time": "12-07-2017 04:33 PM", "replies": []}]}]}, {"postID": "post6088262", "text": "Mime is doing the same thing. I agree a class action is needed. There has not been any misuse, its a design flaw. Motorola support wanted $49 and for me to mail it in for repair. Not only does the outer layer peal off with normal use, it scratches super easy. There isnt much benefit from a nonbreakable svcreen when its all scratched up because its made of soft plastic.", "time": "11-28-2017 02:53 PM", "replies": []}, {"postID": "post6088265", "text": "They refused my warranty request for the same issue. Thus a class action is whats needed!", "time": "11-28-2017 02:55 PM", "replies": []}, {"postID": "post6099312", "text": "I'm having the same issue but it's the border around the entire screen. It's mostly peeling around speaker which cuts my ear! So annoyed... If there's going to be a class action let me know.", "time": "12-07-2017 02:45 PM", "replies": []}]}, {"title": "z2 force or note 8?", "thread": [{"postID": "post5930580", "text": "So as much as like the idea of the z2 zorce And the new mods, im not crazy from a price stand point.\nAt current price point would I be better off waiting for note 8 or do you think prices will drop on z2 when note 8 is announced?", "time": "08-21-2017 09:24 AM", "replies": []}, {"postID": "post5930740", "text": "Prices will drop. They do on every flagship including Samsung.", "time": "08-21-2017 11:47 AM", "replies": []}, {"postID": "post5930806", "text": "I'd go for the Note 8 honestly.", "time": "08-21-2017 01:21 PM", "replies": []}, {"postID": "post5930839", "text": "One problem w/Z2 Force is that after you add a handful of mods you've exceeded the S8 & S8plus in price.", "time": "08-21-2017 01:47 PM", "replies": []}, {"postID": "post5930996", "text": "I think Motorola screwed the pooch on this one by not having 6 gigs of RAM on the US version I guess decision time will be Wednesday or soon thereafter when the Note 8 is officially announced and see if any deals hit the streets on the Z2 Force let me put it to you this way if the price points are about the same between the two then it's a no-brainer to get to Note 8", "time": "08-21-2017 03:42 PM", "replies": []}, {"postID": "post5931205", "text": "I can't comment much on the Note 8, but I am very happy with my Z2 Force. I initially didn't like the camera of the Z2 but a recent update seems to have improved picture quality. Plus, Motorola added some really great photo and video editing software to the camera app. the rest of the software experience of the phone is typical Moto quality, meaning it is excellent. The hardware is also high quality.", "time": "08-21-2017 06:48 PM", "replies": []}, {"postID": "post5940930", "text": "This device runs better than my S8 plus did. I don't think the note 8 will be any different at all plus the price is not worth it to me. The Galaxy line is a nice device but the moto is amazing to me.", "time": "08-27-2017 05:14 AM", "replies": []}, {"postID": "post5941175", "text": "I am happier with my Z2 Force than I was with my S8+. \nMost of the same principles would still apply. Sammy has a better camera, but the Z2 is still pretty solid. \nNote 8 will be just as breakable as the S8+, so you have to worry about that. \nBattery is a moot point, bigger on Sammy, but lighter software on Moto, same 835. Probably about the same battery life.", "time": "08-27-2017 10:15 AM", "replies": [{"postID": "post5979954", "text": "What's better on the Z2force ?? I am s8 plus... curious", "time": "09-17-2017 03:55 PM", "replies": [{"postID": "post5985827", "text": "Front facing speaker\nSmaller battery charges quicker\nMod system which works with earlier mods\nFront camera flash\nFront easier to reach fingerprint sensor\nNear stock Android\nCosts less especially with recent promotions\nA little more manageable in the hand\nShattershield display and metal build", "time": "09-20-2017 10:35 PM", "replies": []}]}]}, {"postID": "post5941289", "text": "I have had every flagship this year and can honestly say Z2 force is the worst. Bought this since I got a great deal 50% off, but still not that happy overall. \nIf you get at a good price sure but not worth the high price they are charging since at that price you get better phones in most departments. The only reason you would want Z2 force is if you are excited about Moto Mods and can't leave without them.", "time": "08-27-2017 11:22 AM", "replies": []}, {"postID": "post5948064", "text": "Very few differences between the note and the plus to spend a $1000 on a new phone. I can honestly say the z2 force is a faster and smoother device all around.", "time": "08-31-2017 07:42 AM", "replies": []}, {"postID": "post5968658", "text": "For sure the price on the Z2 Force will drop. The long-awaited Note 8 will cost a pretty penny once it's dropped as well. But like other users have said, you can always wait and grab them at a reduced cost later! Plus, Black Friday and Christmas deals are right around the corner! I'd keep an eye on Best Buy and Amazon sales, too!", "time": "09-11-2017 09:07 AM", "replies": []}, {"postID": "post5970176", "text": "The z2 force is a solid top android device with no lag and plenty of speed. The only issue is the shutter on the camera could be improved otherwise its an awesome device which I highly recommend.", "time": "09-12-2017 07:44 AM", "replies": []}, {"postID": "post6003124", "text": "having both phones I like the simplicity of the Moto software so much better...but then again I'm used to it", "time": "10-03-2017 07:38 PM", "replies": []}, {"postID": "post6003477", "text": "Well I used Jump on Demand to jump from the Moto Z2 Force to the Note 8.\nLess than 2 weeks later I took it back and jumped from the Note 8 back to the Moto Z2 Force\nWhile the screen size is nice on the Note 8 (although I still prefer 16:9), after having a Moto Z2 Force and a Huawei Mate 9, the Note 8 felt sluggish.\nThe Note 8 also couldn't compete in the battery life department", "time": "10-04-2017 05:31 AM", "replies": []}, {"postID": "post6065206", "text": "I also jumped from the note 8 to the z2 force. the note is too expensive and this phone competes on an even level", "time": "11-11-2017 03:33 PM", "replies": []}, {"postID": "post6069464", "text": "I have both and am equally happy with both.", "time": "11-14-2017 01:24 PM", "replies": []}, {"postID": "post6071624", "text": "Looking at another Moto device for wife's nearly dead Turbo (1)....because I think they still have the best radios. And I love the twist and cam is on, etc. Tho' I've read some troubling reports about inability of some of them to connect to wifi. Is there anything to that?", "time": "11-15-2017 04:22 PM", "replies": []}, {"postID": "post6073824", "text": "I've heard of Wifi issues specifically on the Sprint version with certain routers. Hopefully they'll be able to do a software update to fix it. I've been using the phone since launch and haven't had any issues that have been brought up in the forums. I've even switched carriers (VZW to Tmo).", "time": "11-16-2017 11:48 PM", "replies": []}]}, {"title": "WIFI Woes", "thread": [{"postID": "post5963707", "text": "I had a Motorola Turbo 2, pretty much the same as this Z2 Force with a much better battery. I changed, surprisingly, for the fingerprint security.\nAnyhow, I notice that, even though I have 3-4 bars on my wifi icon, I cannot get decent connectivity on the far side of my house. I had no issues with the Turbo 2. Anyone having similar experiences?\nThanks!", "time": "09-08-2017 07:24 AM", "replies": []}, {"postID": "post5968653", "text": "Hello! Does this issue also occur with other devices in the home? Have you tried resetting your WiFi router?", "time": "09-11-2017 09:05 AM", "replies": [{"postID": "post5968736", "text": "No other devices have the problem including my old phone.", "time": "09-11-2017 10:10 AM", "replies": []}]}, {"postID": "post5972217", "text": "I'm having the same issue, fails to pick up where other devices have no problem.", "time": "09-13-2017 09:18 AM", "replies": [{"postID": "post5972493", "text": "Yea its wierd and anoying as heck. I've been testing a few things today with no solution.", "time": "09-13-2017 12:11 PM", "replies": []}]}, {"postID": "post5973094", "text": "That's crazy.. My wifi works better then ever on my Z2 .I can get a signal outside in my front and backward where my iPhone had problems..", "time": "09-13-2017 06:13 PM", "replies": [{"postID": "post5973164", "text": "That's like comparing a Cray to a TI30 lol", "time": "09-13-2017 06:55 PM", "replies": []}]}, {"postID": "post5977488", "text": "Same issue here. Disconnects and reconnects continuously. I had no problem with my turbo", "time": "09-15-2017 10:18 PM", "replies": []}, {"postID": "post6000252", "text": "I have issues also with my Verizon Z2 Force, it has trouble with certain 802.11AC 5GHz access points, like the enterprise Sophos access point at work and an enterprise TPLINK EAP245. It connects at high data rates with a strong signal but then soon degrades to no throughput, disconnect and reconnects.. On the other hand, it does good with 2.4GHz networks and with my ASUS RT-AC68 router at 5GHZ , A Moto G5 plus has no problems on the same networks, same channels, I tried swapping out my Z2 Force with a warranty replacement but the 2nd phone did exactly the same thing. Still hoping for a software patch.???", "time": "10-01-2017 03:27 PM", "replies": []}, {"postID": "post6000290", "text": "Just got system upgrade. I hope this clears things up", "time": "10-01-2017 03:53 PM", "replies": []}, {"postID": "post6071630", "text": "No one's said anything since 10/1. Did the update fix this?", "time": "11-15-2017 04:25 PM", "replies": []}]}, {"title": "Corrupt sd card", "thread": [{"postID": "post6057983", "text": "A message that my SD card is corrupt popped up on my phone yesterday,. I've had this SD card for a very long time. I don't wanna lose the data on it. The phone says tap to fix. Will it erase the card ?", "time": "11-07-2017 07:09 AM", "replies": []}, {"postID": "post6058036", "text": "probably will format it if you tap it and erase it", "time": "11-07-2017 07:52 AM", "replies": []}, {"postID": "post6058303", "text": "What?", "time": "11-07-2017 10:54 AM", "replies": []}, {"postID": "post6058605", "text": "Tap to fix will format it and erase everything", "time": "11-07-2017 01:32 PM", "replies": []}, {"postID": "post6059022", "text": "How do I get around this. I don't wanna lose what's on the card. And why would the card be working fine and all the sudden go bad ?", "time": "11-07-2017 06:16 PM", "replies": []}, {"postID": "post6059729", "text": "getting around it is probably getting a new card. as for getting stuff of it, you can try moving it to a computer with a full size sd adapter. anything more than that is beyond my knowledge.", "time": "11-08-2017 07:45 AM", "replies": []}, {"postID": "post6065910", "text": "You could try reseating the card in the phone. If you have another phone try putting it in there and see if it works ok. I wouldn't give up on that card without trying all options available.", "time": "11-12-2017 12:49 AM", "replies": []}, {"postID": "post6067453", "text": "I grabbed the stuff off it on my computer and reformatted it. But the phone still says it's corrupt. Is it the phone ?", "time": "11-13-2017 09:32 AM", "replies": []}]}, {"title": "Google Cam HDR", "thread": [{"postID": "post6065575", "text": "Anybody tried this app? How the results compares with the default camera?", "time": "11-11-2017 06:51 PM", "replies": []}, {"postID": "post6065804", "text": "I'm interested in this also.", "time": "11-11-2017 11:03 PM", "replies": []}]}, {"title": "Front camera", "thread": [{"postID": "post6057209", "text": "I've noticed that the camera hole is not centered behind the screen. It's kinda odd looking. Is that just the way it is or a defect?", "time": "11-06-2017 05:58 PM", "replies": []}]}, {"title": "Copy/ paste", "thread": [{"postID": "post6049424", "text": "My old phone had a clipboard feature, I could copy something and it would store it in a section no matter how many things I copied. Then I could paste it later. Does this phone have a feature like this. It helped a lot when texting", "time": "11-01-2017 07:28 PM", "replies": [{"postID": "post6049431", "text": "Out of the box, it does not.", "time": "11-01-2017 07:31 PM", "replies": []}]}]}, {"title": "Moto Z2 Force - Moto Photo Editor but it isn't showing up as a app on my phone?", "thread": [{"postID": "post6047232", "text": "I have an SD car installed. I have checked \"apps\" in settings - it appears here as well, but not in my app menu to use.???", "time": "10-31-2017 11:03 AM", "replies": [{"postID": "post6047249", "text": "Welcome to the forums. This Photo Editor app can only be used for photos taken with Depth enabled in the camera settings. Once you take a photo with this feature enabled you'll get the option to edit it using the Moto Editor (Depth) or Photos editor (Google Photos).", "time": "10-31-2017 11:14 AM", "replies": []}]}, {"postID": "post6047281", "text": "THANK YOU!", "time": "10-31-2017 11:32 AM", "replies": [{"postID": "post6047313", "text": "Thanks for registering and welcome as a new member! Let us know if you need any help using this editor.\nI moved your thread to the Z2 Force forum for better visibility.", "time": "10-31-2017 11:58 AM", "replies": []}]}]}, {"title": "Achive/delete text", "thread": [{"postID": "post6046218", "text": "I've noticed that if swipe left or right on a text thread it'll send that text into archive. Is there any way you can change it to delete the texts swiped.", "time": "10-30-2017 04:54 PM", "replies": []}]}, {"title": "My Take on the Z2F: A great phone that is held back by its camera app.", "thread": [{"postID": "post5978048", "text": "I can not believe that a 2017 flagship phone can have such a laggy camera app.\nVery disappointed in myself for not taking the time to really use the camera within my return period... so thats on me.\nBut still.... hope an update fixes it.", "time": "09-16-2017 09:08 AM", "replies": [{"postID": "post5979503", "text": "Sorry to hear that... How is the battery life?", "time": "09-17-2017 10:16 AM", "replies": []}]}, {"postID": "post5978075", "text": "When did you get the phone?", "time": "09-16-2017 09:29 AM", "replies": []}, {"postID": "post5978182", "text": "over 2 weeks ago.", "time": "09-16-2017 11:04 AM", "replies": []}, {"postID": "post5989177", "text": "My camera works great no issues here at all.", "time": "09-23-2017 10:18 AM", "replies": []}, {"postID": "post5992538", "text": "I also think the camera is great. One thing I've noticed is that pictures turn out a lot better after you tap to focus. Also mess around with the auto HDR to find what works best. When on all the time it does have a delay in low lighting situations.\nOverall it's a fantastic camera and a very underrated phone.", "time": "09-25-2017 05:44 PM", "replies": []}, {"postID": "post6002892", "text": "Eyy Both the camera and app are huge strides for Motorola considering what both used to be in their previous phones.", "time": "10-03-2017 04:23 PM", "replies": []}, {"postID": "post6034884", "text": "I have a Moto X Pure, I would be interested to hear if any Z2 Force owner has experience with the Pure, and whether they feel the camera is an upgrade", "time": "10-23-2017 06:32 PM", "replies": [{"postID": "post6035136", "text": "I have the 2016 Z Force and the Moto X Pure and comparison shots strongly favor the Z Force. So I would hope the 2017 would be even better.", "time": "10-23-2017 09:15 PM", "replies": []}]}]}, {"title": "Amazing device", "thread": [{"postID": "post5927420", "text": "With all the negative reviews of the moto z2 force I have to disagree totally. The device is snappy and fluid actually better than my S8 plus was and that was an amazing device. The killer feature is the one button navigation with fingerprint sensor no need to reach around the back and look for the sensor anymore. The moto mods are awesome I picked up the extra battery and Wireless back plus the projector came with the device.\nI highly recommend this device to anyone you can't go wrong. The only add on should be a glass screen protector because the screen on this device has a plastic top screen which scratches.", "time": "08-18-2017 07:29 AM", "replies": [{"postID": "post5927653", "text": "Completely agree with this. It's a very underrated device. It is the most fluid phone that I've ever used.", "time": "08-18-2017 12:04 PM", "replies": []}]}, {"postID": "post5927501", "text": "Have there been a bunch of negative reviews? I loved my Moto Z Force (the original). I wouldn't put it or it's successor above the S8/S8+, BUT that does not mean it's not an awesome phone in it's own right! I'm not AS sold on the Moto Mods though, I had the backup battery which I did use, and the Projector which other than to \"showoff\" I really didn't use. I probably would have liked the JBL Speaker Mod but I already had an Amazon Tap which could bluetooth to ANY phone or just connect to WiFi and work. Any other brand bluetooth speaker would be better too because it would connect to ANY phone, can you say, UE Boom? lol", "time": "08-18-2017 08:56 AM", "replies": []}, {"postID": "post5927603", "text": "I played with the Z2 Force yesterday at Verizon with my Z Force from @pkcable on hand and the comparison was awesome. I seriously considered walking out of there with one.", "time": "08-18-2017 11:01 AM", "replies": []}, {"postID": "post5927882", "text": "I haven't seen a single review that knocks the speed or the software experience, that's not the issue. The issues are the battery size and the camera performance, primarily.", "time": "08-18-2017 03:12 PM", "replies": []}, {"postID": "post5928133", "text": "They knock the device in general saying there are better devices out there. The camera is great in my opinion.", "time": "08-18-2017 08:02 PM", "replies": []}, {"postID": "post5928159", "text": "I'm glad you are liking your phone! I personally think it's a good device. I've always had a soft spot for Moto.", "time": "08-18-2017 09:06 PM", "replies": []}, {"postID": "post5928240", "text": "Well no one complaining about the software, performance and that's always been Motorola strong performance and same here. For $720 you can't have subpar camera, no water proof etc. Personally think not a buy at $720 but if you can find for a cheaper price then you can overlook some negatives in camera and other areas.\nI do like the Moto mods, but they too are on the expensive side. Motorola is very close on having a perfect phone for few years but they can never get the camera right. Even HTC who was struggling with camera nailed the camera this year with U11, leaving only Moto still with a subpar camera on a flagship.", "time": "08-18-2017 11:30 PM", "replies": [{"postID": "post5930533", "text": "Conceptually speaking I liked the moto mods, BUT you can get a better standalone projector, and you can get a better standalone bluetooth speaker, etc And thus not handicap yourself should you decide to switch phone brands.", "time": "08-21-2017 08:29 AM", "replies": []}]}, {"postID": "post5928250", "text": "The negative reviews are because of its price and what you get. Personally from what I've seen, it should be priced around $100 less, or maybe more. The competition at that price point has better cameras, bigger batteries, and water proofing. \nThere's no complaints on the performance or software.", "time": "08-18-2017 11:48 PM", "replies": []}, {"postID": "post5932322", "text": "I disagree with battery complaints for a couple reasons. The battery actually big enough for this phone to go all day. Also when they say that this phone should be able to stand on its own merits with out any mods...well why buy this phone if you don't want mods? \nI will agree with camera complaints though. Sure, this one is fine, but the pics from my wife's S8 are noticeably better.", "time": "08-22-2017 02:28 PM", "replies": []}, {"postID": "post5932474", "text": "I thought Motorola closed the camera gap significantly with the Z Force Droid last year, but it sounds like it's widening again this year. No OIS stabilization was a warning sign, although the Pixel camera was good because of excellent EIS.", "time": "08-22-2017 04:44 PM", "replies": []}, {"postID": "post5936863", "text": "I have no issues with the camera and photos look great. I came from iPhone because of the mods. I have not been disappointed and have purchased the Incipio battery case and JBL speakers mod. Still waiting for the projector mod. \nSure you can carry around an extra device or snap it on the back and take just your phone.", "time": "08-24-2017 06:56 PM", "replies": []}, {"postID": "post5953029", "text": "Going on almost a month and this phone is amazing great device love the mods.", "time": "09-02-2017 05:26 PM", "replies": []}, {"postID": "post5967824", "text": "I couldn't agree more with you, OP. I think the new Moto Z2 phones have gotten a bad rep of late; but they are actually underrated and very good quality-wise.", "time": "09-10-2017 05:02 PM", "replies": []}, {"postID": "post6034898", "text": "Many reviewers/commenters we're not happy with the lesser battery vs the previous Force. I actually think the design is a good hybrid of last year's Z and Z force. \nI think it feels better in hand than either of those two (the Force had some sharp edges.) And the 5oz weight and thickness are great. It is the same battery and screen size as my Moto X Pure but 1.2 oz lighter and it is thinner. For me it is an improvement.", "time": "10-23-2017 06:43 PM", "replies": [{"postID": "post6035132", "text": "To be accurate, the Pure has a 5.7\" screen, the Z line is 5.5\".", "time": "10-23-2017 09:12 PM", "replies": []}]}]}, {"title": "Question about the camera lens", "thread": [{"postID": "post6033983", "text": "So I was considering upgrading to the Z2 force from my keyone as the performance is \"meh.\" I had the original moto z Droid and liked it a lot, but it had one issue. The camera lens would get scratched to high hell even with the mods attached. I ended up having to put a dbrand on it. Is this second version any different? Or should I order a dbrand in advance? Thanks!", "time": "10-23-2017 10:23 AM", "replies": [{"postID": "post6034642", "text": "I haven't noticed any on mine, I've had it few weeks and I mostly just use style shells, the battery mod I only use occasionally. Doesn't seem to be worse than any other phone I've had.", "time": "10-23-2017 03:34 PM", "replies": []}]}]}, {"title": "Jelly scrolling effect", "thread": [{"postID": "post6007016", "text": "I have the Z2 Force since yesterday and i've noticed a freaky jelly effect. It is really annoying. Has anyone else noticed this?", "time": "10-06-2017 02:38 AM", "replies": []}, {"postID": "post6007390", "text": "You know that's been a publicised issue for awhile now. Something to do with on upside down led. But I've had mine since launch day and I still don't know what to look for.", "time": "10-06-2017 09:50 AM", "replies": []}, {"postID": "post6007526", "text": "Maybe i had a pre unit but my item had a crazy jelly scrolling", "time": "10-06-2017 10:53 AM", "replies": [{"postID": "post6034239", "text": "My unit has it as well but it is better and more tolerable than what i noticed on my oneplus 5.", "time": "10-23-2017 12:28 PM", "replies": []}]}]}, {"title": "Z2 Force vs. 2016 Z Force?", "thread": [{"postID": "post6030941", "text": "I've had the 2016 Z Force for a little over a year and I'm still happy with it. I know the spec differences and I've held a Z2 Force and played with it a Verizon store. I'm asking anyone who has owned both their opinion whether there is a significant difference. I'm particularly interested in camera quality as the 2016 Z Force camera is underrated and has OIS while the 2017 has the dual camera set-up with depth of field effects. I anticipate some really good Black Friday deals coming up, but waiting another year seems quite reasonable if I can avoid the temptation for something shiny and new.", "time": "10-21-2017 11:36 AM", "replies": []}, {"postID": "post6031088", "text": "no significant difference. only got the 2 for more storage", "time": "10-21-2017 01:16 PM", "replies": []}]}, {"title": "Sprint Z2 Force won't update", "thread": [{"postID": "post6025521", "text": "I received a notification that an update was available. I let it so it's thing but after several attempts it will not update. I'm not rooted anymore (I had to root for SIM unlock), and my bootloader is even locked. Stock boot.img is installed, but nothing. Any tips?", "time": "10-18-2017 11:33 AM", "replies": []}, {"postID": "post6025576", "text": "Hmm, I was going to suggest wiping the cache partition, but apparently Lenovo removed that from the Recovery menu.", "time": "10-18-2017 12:14 PM", "replies": [{"postID": "post6030960", "text": "I'm wondering, since I've used an ADB command to hide the navbar if that has something to do with it? I know it can be turned off with the one button nav, but I have glitches with Action Launcher.", "time": "10-21-2017 11:53 AM", "replies": []}]}, {"postID": "post6031041", "text": "Are you wondering if the ADB command also hid the wipe cache partition option? I doubt it, since the support sites I looked at didn't show a wipe cache partition option at all in the Recovery Menu.", "time": "10-21-2017 12:45 PM", "replies": []}]}, {"title": "Apps safe to uninstall or disable?", "thread": [{"postID": "post6028414", "text": "Just picked up the Verizon Moto Z2 Force. What's apps are safe to disable or uninstall?", "time": "10-19-2017 09:39 PM", "replies": []}, {"postID": "post6028700", "text": "If you don't need the app and data on it, you can diable or uninstall it. Uninstalling WhatsApp won't affect the system.", "time": "10-20-2017 04:41 AM", "replies": []}]}, {"title": "Clearing System Cache Through Recovery", "thread": [{"postID": "post6002887", "text": "Sadly, there is no way to clear system cache when you boot into recovery. The option is missing from the list.\nOnly way is through storage > apps.\nwamp wamppp", "time": "10-03-2017 04:20 PM", "replies": []}, {"postID": "post6004627", "text": "They took it away on Oreo on the Pixel, but I didn't think that would be the case on other devices. What version is the Z2 Force running?", "time": "10-04-2017 05:22 PM", "replies": []}, {"postID": "post6016908", "text": "Watsup Diddy. The Z2 Force is running 7.1.1 It was still there on the Z1 after the update to 7.1. Does wiping the cache through storage accomplish the same thing or is it different?", "time": "10-12-2017 03:29 PM", "replies": [{"postID": "post6020414", "text": "Clearing the cached data from the storage settings and wiping the cache partition from recovery are different processes and remove different files, but things are changing in some recent phones (mostly Google phones).\nThe Z2 Force was the first non-Google phone to use the new partition system and include seamless updates. With this new system the cache partition is not longer required.https://www.xda-developers.com/moto-...mless-updates/", "time": "10-15-2017 08:21 AM", "replies": []}]}, {"postID": "post6021037", "text": "Thank you. Does this mean we can look forward to less corruption from new updates? I used to always factory reset after most updates on my previous phones, and when I did not, something definitely screwed up.", "time": "10-15-2017 04:51 PM", "replies": [{"postID": "post6021110", "text": "It's possible. Personally, I've never done a factory reset after a system update. Never needed it, wiping the cache partition and clearing cached data is been always enough for me.", "time": "10-15-2017 05:57 PM", "replies": []}]}]}, {"title": "New Moto Z2 Force - is camera supposed to take awful pics?", "thread": [{"postID": "post5986383", "text": "I have a new phone... This phone is terrific, except for one big problem. The pics from it are literally the worst I have ever seen from any phone or digital camera (with the possible exception of $5 Tracfones). Everything is dark and dreary. The usual pictures I would take of my house with blue sky and clouds in the background comes out with whitewashed sky and dark house/yard. Both indoor and outdoor are awful. How are people getting nice pics to post in the pics thread? I'm not getting anything like that at all.\nI also have Moto G4 and X Pure... Pics are great on those. My previous LG G4 took great pics. Same for the really old HTC Evo 4G.\nOne thing I noticed is the pic saved into the gallery is much worse than what I was seeing on the screen at the time I clicked the shutter. It's as if it overlayed the B&W camera image over the color and just made it awful. Can that be disabled? If I could make it generate an image only from the color camera, I suspect it will be much better.", "time": "09-21-2017 10:19 AM", "replies": []}, {"postID": "post5986606", "text": "Could you show a few examples and then perhaps using another device or a camera to show how it should've been?\nThe Z2 doesn't have the world's best phone camera, but it should be more than capable enough.", "time": "09-21-2017 12:10 PM", "replies": []}, {"postID": "post5986655", "text": "I will once I am home during daylight... I need to get some examples that are worthwhile. At the office now. Does anyone know of some setting to disable the BW camera or would another camera app bypass it? Although if it is too low level, perhaps bypassing is impossible if any use of the camera apis is just going to pass through the stuff that combines the camera images.", "time": "09-21-2017 12:40 PM", "replies": []}, {"postID": "post5987051", "text": "Okay, the conditions for photos were not optimum since the sun was setting with heavy cloud cover. But, I took a few dozen side by side comparison photos between my Z2 and my old LG G4. Now, while doing this, I learned a few things:\nFirst, the photos are only looking crappy while viewed on my Z2 (despite the screen otherwise looking amazing). When transferred to the PC and compared side by side on dual monitors, they actually look good, even slightly better than the LG. I'm not sure I understand how this could be happening. Although, I do notice something when I try to view a photo on the Z2... it very briefly shows me a good image for a fraction of a second then immediately replace it with a darker dreary image. I think the good image was the first pass then it does some more rendering of the image and says \"Ta dah!!! Here's the finished crappy image!\" Although, this is my first time encountering an image viewer that actually worsens the image in the second pass.... it's supposed to make it better!\nSecond, there's this round thingy in the center of the camera screen. I had just been ignoring it. If I click it so the circle becomes selected/highlighted, the image I'm seeing is then brighter and more colorful. The images I was taking yesterday were not done with this circle thingy in use. I do realize the little dot on the circle can be grabbed and make the image brighter/darker, although I'm surprised that the camera's default without this feature in use was so dark. My wife's Moto X Pure also has this feature but we never saw any dark dreary images from it by default.\nSo, I think I can stand down my initial panic that a $600 phone ($200 off at Best Buy now) had an awful camera, just a confusing camera. I'll still wait for a nice sunny day to do some more comparisons, but this is looking encouraging. Thanks for entertaining my ramblings about this. And, if anyone knows what's up with the 2-pass image viewer thing in the camera, I'd be interested in what anyone might know about it.", "time": "09-21-2017 05:23 PM", "replies": [{"postID": "post5987123", "text": "That’s your focus and exposure.\nYou tap and slide it to set your focal point and tell the camera what to exposure for. You then slide the little sun for extra fine tuning.", "time": "09-21-2017 06:42 PM", "replies": []}]}, {"postID": "post5987053", "text": "(Ha... sorry about the 2 user names... I've been posting between Tapatalk and the PC, and didn't realize Tapatalk signed me in as a user I had forgotten about. I'm the same person!)", "time": "09-21-2017 05:24 PM", "replies": []}, {"postID": "post5987105", "text": "Is your phone set for any kind of adaptive display? It may automatically be adjusted the screen settings when viewing the photos and that's why they look different.", "time": "09-21-2017 06:25 PM", "replies": []}, {"postID": "post5987135", "text": "Oh...! You're referring to the \"adaptive brightness\" toggle? Yes, I had that on. I had thought it would be similar to (or the same as) the check box normally found on the screen brightness slider (where is that check box anyway??) Yes, with it checked off it looks much better when viewing photos. It never occurred to me that feature would somehow dynamically adjust the brightness based on what I'm viewing, rather than simply detecting how much light is in the room.\nWell, I can live with that feature off, although it would be handy if the display dimmed when I went into the dark. But not at the expense of weird stuff happening with the appearance.\nThanks, everyone here is very helpful!", "time": "09-21-2017 06:49 PM", "replies": [{"postID": "post5987435", "text": "If you were talking about the circle in the camera viewfinder, that's what I mean by what I said.\nThough if you're taking photos in the sun, make sure the screen is at its maximum brightness.", "time": "09-22-2017 12:01 AM", "replies": []}, {"postID": "post6009401", "text": "What I do on my iPhone (don't worry, I'm switching to Android soon) is leave what they call \"Night Shift\" on by default, and toggle it off when viewing photos or videos.", "time": "10-07-2017 02:09 PM", "replies": []}]}]}, {"title": "Is there no case that fits with mods?", "thread": [{"postID": "post5938628", "text": "I just want a plastic bumper that goes around the outside rim of the phone and protects it from drops. Whats the point of having a modular phone if it doesn't work with a case? Then any time I want to use the battery/speaker/projector I have to take off the case and walk around with it in my pocket. The whole idea was less things in my pocket. \nI dropped it in the driveway already and chipped the metal around the rim. Luckily the screen protector I got is really good and doesn't have a single scratch or mark after whacking and then sliding down my asphalt driveway hill. \nThere is this one on verizon;https://www.verizonwireless.com/accessories/vzw-two-tone-bumper-for-moto-z2-force-edition/\nBut for one its sold out, and also there's contradictory answers when you scroll down the page to the one person who asked if it works with mods.", "time": "08-25-2017 03:43 PM", "replies": []}, {"postID": "post5938713", "text": "the bumpers Verizon sells will work with the mods", "time": "08-25-2017 04:53 PM", "replies": []}, {"postID": "post5939138", "text": "disagree. hard to get the mods off with the bumper because plastic goes inside the area at the bottom where you peel it off", "time": "08-25-2017 10:25 PM", "replies": [{"postID": "post5941370", "text": "Sounds like a similar problem they had with their first gen Moto Zs. They ended up revising the bumpers.", "time": "08-27-2017 12:08 PM", "replies": [{"postID": "post5941591", "text": "Exactly, this is the same as the first iteration of the old z force bumper", "time": "08-27-2017 02:50 PM", "replies": []}]}]}, {"postID": "post5943485", "text": "I have the Verizon bumper and it works great. There is a small lip on the bottom so I have to slide my wireless charging mod down as I put it on but it works fine. The speaker mod actually has a notch on the bottom right where the lip is so it's no problem at all putting it on and off.", "time": "08-28-2017 06:17 PM", "replies": []}, {"postID": "post6004433", "text": "I used a dremel tool and modified the verizon bumper a little. Works well with the mods I have.", "time": "10-04-2017 03:53 PM", "replies": []}]}, {"title": "JBL SoundBoost 2", "thread": [{"postID": "post6002884", "text": "Just wanted to start a post about this mod, and hear some feedback. \nIn my opinion, it produces better sound quality than its predecessor and may even be slightly louder.\nOne qualm about how the Z2 and this interact... Even with auto-rotate turned off, the moto display still rotates when in landscape mode position and there is a significant lag after unlocking and switching to the portrait position, sometimes even freezing in landscape. No options within the moto suite or jbl settings to change rotation features .\nOverall, I love the new shape and colors, and I rock this mod as my DD because I flip the kickstand out for extra grip all the time, since Moto stopped giving us soft touch paint on the sides of their phones (Droid Maxx/Turbo and previous)", "time": "10-03-2017 04:18 PM", "replies": []}, {"postID": "post6003474", "text": "I am pretty impressed with the 1st gen, so I bet the 2nd gen is pretty good", "time": "10-04-2017 05:26 AM", "replies": []}]}, {"title": "free projector mod shipped", "thread": [{"postID": "post5961090", "text": "My projector shipped today and should be here tomorrow. Submitted on the 10th of August, approved the 25th.", "time": "09-06-2017 09:48 PM", "replies": []}, {"postID": "post5962501", "text": "Just had mine approved, after being kinda jerk'd around.", "time": "09-07-2017 03:14 PM", "replies": []}, {"postID": "post5962814", "text": "Submitted the 11th, still hasn't been approved.", "time": "09-07-2017 06:40 PM", "replies": []}, {"postID": "post5963045", "text": "Mine arrived by FedEx ground, shipped directly from Motorola warehouse. Excited to try it out", "time": "09-07-2017 08:47 PM", "replies": []}, {"postID": "post5968818", "text": "Got mine saturday and have been impressed so far. Not very good with lots of light but really good in dark room. Worth the price for sure.", "time": "09-11-2017 11:16 AM", "replies": []}, {"postID": "post5972225", "text": "Had mine denied because their automated system couldn't find the date of purchase on my bestbuy.com receipt. Had to resubmit to support and waiting on an update.", "time": "09-13-2017 09:23 AM", "replies": [{"postID": "post5974268", "text": "Same thing happened to me and quite a few others: https://forums.lenovo.com/t5/Moto-Z-...d/td-p/3795189. Reaching out to them on that thread may help speed the process up.", "time": "09-14-2017 11:31 AM", "replies": []}]}, {"postID": "post5988559", "text": "Just got the update that they reviewed my paperwork and everything is approved.", "time": "09-22-2017 06:30 PM", "replies": []}, {"postID": "post6002879", "text": "So the reps at Verizon will tell you to immediately start the claim process on motorolarewards once you purchase the Z2. However, my claim was denied because Motorola requires a wait period of two weeks before they approve a claim to make sure that you're actually keeping the device. Sadly, they reject any claim put in beforehand, and you have to call them up and resubmit everything all over again. I can't complain too much, because they are giving me a free $300 projector mod lol.", "time": "10-03-2017 04:12 PM", "replies": []}, {"postID": "post6002978", "text": "I put mine in right away no problems.", "time": "10-03-2017 05:35 PM", "replies": []}]}]
[{"title": "How durable is the fingerprint scanner?", "thread": [{"postID": "post5926723", "text": "Can it take some pressure? People that use my phone think you click the button like an iPhone.", "time": "08-17-2017 02:18 PM", "replies": []}, {"postID": "post5926725", "text": "I am going on a few days and it seems durable to me no issues here.\nI also have it set to do all the capacitive buttons also.", "time": "08-17-2017 02:19 PM", "replies": []}, {"postID": "post5926747", "text": "I like getting the extra screen real estate with the one button nav. Luckily no one has really pressed hard. More like they start to push a little and go huh?", "time": "08-17-2017 02:39 PM", "replies": []}, {"postID": "post5928188", "text": "the only thing I don't like about the one button nav is the back functionality. it doesn't seem to minimize the keyboard when I want to. maybe I'll play with it more", "time": "08-18-2017 09:45 PM", "replies": []}, {"postID": "post5929166", "text": "I'm no expert, but it should be able to take a little bit of abuse. My Honor 8's fingerprint sensor also doubles as a button so I very often click that thing like nobody's business!", "time": "08-19-2017 09:17 PM", "replies": []}, {"postID": "post5936873", "text": "Really like the home button the fingerprint recognition is fast and I like that the button both turns on and off the phone.", "time": "08-24-2017 06:59 PM", "replies": []}, {"postID": "post5938830", "text": "Works great for me and I use the one button option on mine.", "time": "08-25-2017 06:33 PM", "replies": []}, {"postID": "post5939680", "text": "one of the best features of this phone is the one button nav. Not as easy to do if the fingerprinter reader is on the back.", "time": "08-26-2017 10:16 AM", "replies": []}, {"postID": "post5944022", "text": "Some dust got stuck in the crease of the fingerprint scanner so I tried to get it out with the corner of a post it. Since it's solid state I assume this shouldn't bother it?", "time": "08-29-2017 03:48 AM", "replies": []}, {"postID": "post6002895", "text": "Motorola used high quality fingerprint readers on both the z force and z2 force. +1", "time": "10-03-2017 04:25 PM", "replies": []}]}, {"title": "New update 9.30.2017", "thread": [{"postID": "post5998985", "text": "So, today I see the system update notification, and decided to see what was being updated. As you can see in the screenshots, the new version is NDXS26.122-58-8-4.\nI cannot find any information about this update. The current version shown on Verizon's website is NDX26.122-58-8, which as you can see, is currently installed on my device.\nAnyone have any info on this new update?", "time": "09-30-2017 01:55 PM", "replies": []}, {"postID": "post5999067", "text": "I got the exact same thing. The \"new\" update just popped up on my screen. Is this legit or a virus? Please help.", "time": "09-30-2017 03:27 PM", "replies": []}, {"postID": "post5999070", "text": "DJ, did you follow through with the new update, or are you still trying to find more information. Thanks!", "time": "09-30-2017 03:29 PM", "replies": []}, {"postID": "post5999184", "text": "Check the Lenovo site. Article dated 28th - article # MS123697", "time": "09-30-2017 05:46 PM", "replies": []}, {"postID": "post5999263", "text": "well it updated on mine and if u tap it says no need already a developer​. WTH!", "time": "09-30-2017 07:32 PM", "replies": []}, {"postID": "post6002220", "text": "hopefully T-Mobile gets it and it fixes the text issue", "time": "10-03-2017 08:52 AM", "replies": []}, {"postID": "post6002254", "text": "This might just be nothing more than a security patch. That's it.", "time": "10-03-2017 09:23 AM", "replies": []}, {"postID": "post6002867", "text": "I saw the \"background installation\" notification and I face palmed. Thankfully I did not need to do a factory reset, because it wasn't a major update, but that has me thinking... Are all the updates on this phone going to just install themselves in the background like that? I have automatic software update disabled in developer options, but it didn't prevent it. Has anybody come across any type of system app that is able to be disabled to prevent updates? There were previous Vzw Moto phones that allowed such a process to be disabled via OEM app menu without rooting.", "time": "10-03-2017 04:00 PM", "replies": []}]}, {"title": "Not available on any UK carriers?", "thread": [{"postID": "post5999982", "text": "Does anyone know if this is or will be?", "time": "10-01-2017 12:02 PM", "replies": []}]}, {"title": "Cases", "thread": [{"postID": "post5989614", "text": "What cases are you folks recommending for daily use? My first case caused an echo so looking for a new one. Wish I could remember which case it was I got. No mods so far. Thinking about the cover mod that allows wireless charging.\nThanks", "time": "09-23-2017 05:15 PM", "replies": []}, {"postID": "post5992529", "text": "My favorite is the UAG - https://urbanarmorgear.com/collectio...nt=47795074127.\nIt's slim, lightweight, and seems to offer a good amount of protection. I'm still waiting for someone to make a good bumper case that works with mods. The one from Verizon is terrible.", "time": "09-25-2017 05:36 PM", "replies": []}, {"postID": "post5993028", "text": "I took the bumper case from Verizon and modified with a Dremel tool. Works very good now with or without mods.", "time": "09-26-2017 02:07 AM", "replies": []}]}, {"title": "Echo on phone calls", "thread": [{"postID": "post5988715", "text": "Getting a bad echo on my Z2 Force. Have lowered volume. But no idea what to do. Any help appreciated. FYI the phone is in a case but cannot remember the brand. Thanks", "time": "09-22-2017 09:07 PM", "replies": []}, {"postID": "post5988825", "text": "Does the echo happen when you take it out of the case? For at least some phones that had an echo, it was an issue with the case.", "time": "09-22-2017 11:09 PM", "replies": [{"postID": "post5989598", "text": "Thanks! removed the case and it seems fine. Guess a new case is in order. Will explore recommended cases.\nThanks so much.", "time": "09-23-2017 05:02 PM", "replies": []}]}, {"postID": "post5989309", "text": "might be the advanced calling. some people say that sounds like an echo", "time": "09-23-2017 11:43 AM", "replies": []}, {"postID": "post5989626", "text": "Great! I'm not quite sure why some cases do this. It might have to do with the case incorrectly blocking the secondary mic, which might then interfere with the noise cancellation feature.", "time": "09-23-2017 05:29 PM", "replies": []}]}, {"title": "No notification light?", "thread": [{"postID": "post5986766", "text": "I have been puzzled all day why the notification light doesn't blink when a message arrives. This is the only way I can tell when I get a message in vibrate mode... I can't have my phone beeping all day while in the office.\nSo I did a search... The claim is this phone doesn't have notification lights and relies on Moto Display? Great except the display only shows me a clock... No mention of what the notification may be about. The notification light is normally multicolored so I can color code it per app. I have the feature on and no apps are blocked. Is there something else I am missing?\nOh it also doesn't vibrate on notification so I can't just set it on my desk and listen for the buzz. Yes it is on. Yes it works if I am u locked and using the phone. But if I lock screen and leave it sitting there, I get utter silence from it. I turned vibration strength up to maximum.", "time": "09-21-2017 01:43 PM", "replies": []}, {"postID": "post5987153", "text": "Well I have been experimenting with it at home sending messages to myself from the PC. The active display seems to be mostly doing what I like now. Icons appear for notifications. My only complaint now is the display activates if I wave my hand over it but not if I just leave it sitting there. I would like it to flash something at me regularly if there are any notifications even if I am not waving at it.\nI did see the play store has many apps that claim to activate the LED or even the flash bulb for notifications but I see quite a lot of negative comments about root being required and doesn't work on all phones. So I haven't tried any of those yet.\nIf I can solve that, my new phone will be near perfect. (Perfection achieved by finding a case with a kickstand that also won't interfere with adding mods. I'm guessing I can't meet all those goals simultaneously.)", "time": "09-21-2017 07:02 PM", "replies": []}, {"postID": "post5987295", "text": "there is an Indiegogo mod that will eventually be released called The Edge mod which is basically a notification strip that can be adjusted for colors and pulses and things like that. perhaps you can look into that when it becomes available later this year or early next year", "time": "09-21-2017 09:37 PM", "replies": []}, {"postID": "post5988307", "text": "Hello! While it's true that some of those apps may not work as desired, or may require rooting, I'd still recommend downloading one and give it a try! One trick I always do is look at the number of download the app in question has. If it's had a lot, then chances are it's an app that either works well most of the time or is trusted enough that masses of Android users will download it and use it. Of course, there's always an exception, but if you see an app that has 10,000 downloads, at least you know it could be good enough to be of use to 10,000 users!", "time": "09-22-2017 02:23 PM", "replies": []}]}, {"title": "Loving the Z life again", "thread": [{"postID": "post5967217", "text": "Last year I didn't get the Z Force at launch, but at some point Best Buy had a great deal that included the Incipio and the JBL mods for free.\nI picked up the Verizon Moto Mods Carrying Case and I had the Verizon Flexible Glass Display Protector and life was pretty good. When I switched to T-Mobile I had to trade it in as part of the Carrier Freedom deal.\nSo when Tmo announced they had the Z2 Force on Jump On Demand I jumped on the deal.\nThis past week I picked up the Gamepad mod and I am reminded how much I love the Z series and this whole Mod life.\nAs I have posted several times, I got the Verizon Flexible Glass Display Protector for my Tmo Z2 Force and it works like a champ. Screen feels good, looks good, and no scratches and no case.\nAt night I put on the Incipio wireless charging battery mod, and put my Z2 and mod on my Tylt Vue wireless charger. When I wake up both the Z2 Force and the Incipio are fully charged. I take the Incipio off an put on my Style Shell and go about my day. Generally at lunch time I slap on the JBL and listen to Howard Stern or a podcast while I eat. Then depending on my battery status and/or plans for the rest of the day, I either put on my Style Shell or Incipio. For the past few nights I have found myself enjoying the Gamepad.\nI know these other features can be replicated by other products, but it is just not as cool and easy as the Mod system.\nLike I have a Samsung Level Box Mini for a Bluetooth speaker that works pretty good, in general I really like the whole Level series from Samsung and the associated app. However, there is still the occasional hiccups with Bluetooth that I just don't see with the Mod system.\nNot really a point to this, just commenting that I had been away from the Z-series and the Mod system for about 6 months and it is good to be back", "time": "09-10-2017 09:12 AM", "replies": []}, {"postID": "post5967794", "text": "First z for me and best device to date for me.", "time": "09-10-2017 04:51 PM", "replies": []}, {"postID": "post5967820", "text": "So glad you are loving the Moto Z2 Force! I've heard really good things about it. Enjoy!", "time": "09-10-2017 05:00 PM", "replies": []}, {"postID": "post5970543", "text": "Good stuff!", "time": "09-12-2017 12:27 PM", "replies": []}, {"postID": "post5985817", "text": "I like mine I just got as well, though the battery life, for me at least is considerably different. The snapdragon 835 makes the device fly though.", "time": "09-20-2017 10:29 PM", "replies": []}, {"postID": "post5986901", "text": "Well, if T-Mobile could fix the group messaging issue, I would be loving my Z more", "time": "09-21-2017 03:25 PM", "replies": []}]}, {"title": "Clock on/off/on/off/on/off/on/off...forever!", "thread": [{"postID": "post5963711", "text": "I have my Z2 force charging on a stand next to my bed. The screensaver/clock appears and disappears with annoying frequency! I think it is the air movements around my bedroom that is being detected by the sensor but its driving me nuts. Any way to reduce the sensitivity?\nThanks!", "time": "09-08-2017 07:26 AM", "replies": [{"postID": "post5964756", "text": "I think you can turn off notifications during do not disturb. If you set this properly (maybe to turn off 15 minutes before you get up) you may be able to eliminate this. I haven't tried it because my phone is across the room and it doesn't bug me", "time": "09-08-2017 05:04 PM", "replies": []}, {"postID": "post5974282", "text": "Are you talking about active display (the circular clock, with a blue battery level circle, and light blue gradient background)? Or the actual \"Screen saver\" set in the display settings?", "time": "09-14-2017 11:36 AM", "replies": [{"postID": "post5974483", "text": "Active display.", "time": "09-14-2017 01:29 PM", "replies": []}]}]}, {"postID": "post5963953", "text": "I don't think there is a way to change the sensitivity. I never ran the screensaver option on any of my phones, but I thought it was supposed to go on and off.", "time": "09-08-2017 09:48 AM", "replies": []}, {"postID": "post5965050", "text": "Maybe you're talking about the active display. It's just terrible on this phone. I hate they got rid of the ir sensors the turbo 2 had. Best thing I've found is to disable \"show when approached\" or something in the Moto settings.", "time": "09-08-2017 08:18 PM", "replies": []}, {"postID": "post5967183", "text": "I adjusted Do Not Disturb and I think it improved the issue", "time": "09-10-2017 08:49 AM", "replies": []}, {"postID": "post5974590", "text": "Ah... I know it shows each time you get a notification (supposed to eventually stop for that single notification after some time passes) or if the notification keeps resetting itself. I have do not disturb setup on mine so mine stays dark all night except the screensaver clock. \nIn order for it to trigger via the sensor an object has to be pretty close. I can't trigger mine with my hand or any other object more than a foot away from the sensor. Does your fan happen to sit on the stand or is close enough to cause the stand to vibrate (or when/if its oscillating?)? Mine triggers on vibrations pretty easily. Lastly, (I must ask, lol) is there anything interfering with the sensor (screen protector missing the cutout)? \nHaving said of all of that I went and tested it out for myself thinking no way air could trigger the sensor. I stand corrected. I have a pedestal fan that sits 1 foot away from my nightstand and ~3 away from my phone. To my surprise the fan at full blast pointed directly at the phone triggered active display like crazy. Fan at a medium setting about the same, and at lower setting slightly less. Turning the phone away from the wind still triggered AD, but less often in all 3 speed settings. Blocking the wind from hitting the phone stopped AD from displaying abnormally. At night I place my phone on my old tylt vu charger, but my fan doesn't point directly at my phone (minimal wind from my fans).", "time": "09-14-2017 02:24 PM", "replies": []}]}, {"title": "200.00 off at Best Buy", "thread": [{"postID": "post5953704", "text": "Right now thru Monday, Best Buy has the Z2 Force for 200.00 off with device payments on Verizon. Not sure about the other carriers, but this might get me to upgrade from my Z droid.", "time": "09-03-2017 07:11 AM", "replies": []}, {"postID": "post5953747", "text": "That is a good price for a great device", "time": "09-03-2017 07:59 AM", "replies": []}, {"postID": "post5953778", "text": "Verizon had it even cheaper when it came out. better sales will be coming, like last year's z for 125$", "time": "09-03-2017 08:14 AM", "replies": []}, {"postID": "post5953894", "text": "True, but this 200.00 comes off the top. Makes the phone 556.00 and you can pay it off right away and not lose the bill credits for 24 months", "time": "09-03-2017 09:27 AM", "replies": [{"postID": "post5954285", "text": "That's one thing you have to watch with Verizon versus Best Buy.", "time": "09-03-2017 01:24 PM", "replies": []}]}, {"postID": "post5956441", "text": "True true. I won't be being another phone for a while because of those credits.", "time": "09-04-2017 09:44 PM", "replies": []}, {"postID": "post5968655", "text": "OMGOSH what a good deal!", "time": "09-11-2017 09:05 AM", "replies": []}, {"postID": "post5968969", "text": "Just called my local best buy about this. The sale is still going on but they don't know when it will end. The girl I talked to in mobile said they get updated sale lists each morning so on some sales/deals they only know they have ended when it stops showing up on their sale lists.", "time": "09-11-2017 12:48 PM", "replies": []}]}, {"title": "Eclipse", "thread": [{"postID": "post5931269", "text": "Here is what my Z2 force did with the totality.", "time": "08-21-2017 07:40 PM", "replies": []}, {"postID": "post5931421", "text": "Well done!", "time": "08-21-2017 10:19 PM", "replies": []}, {"postID": "post5968659", "text": "Wow, that's beautiful!", "time": "09-11-2017 09:08 AM", "replies": []}]}, {"title": "Active Display. Loved it on Turbo 2, hate it on Z2 Force.", "thread": [{"postID": "post5932341", "text": "Ok, so far I really like this phone. But after a few years with my Turbo 2, I'm finding the active display on the Z2 Force really bad and annoying. \nI hate the way that it turns on every 5 seconds, in the dark, on the table. I absolutely have to turn this phone upside down or off at night. I loved my Turbo 2 as a bedside clock. Its off most of the time, but if I wanted the time, I just wave my hand over my nightstand and the active display would turn on, telling me the time. Also, did they remove the IR sensor? This phone doesn't seem nearly as responsive to waving my hand over it as the Turbo 2, which oddly is a feature I really grew accustomed to.\nThe other thing that really bugs me about this Active Display, is that its not completely black outside of the information you're looking at. There's a blue gradient at the top that makes the screen way too bright.\nAnyone else notice this? Is there any way to fix sensitivity?", "time": "08-22-2017 02:40 PM", "replies": []}, {"postID": "post5933880", "text": "Agree with all of your complaints. Way too sensitive to motion. I've had mine come on on the nightstand a few times as well, although not a consistent issue. I could do without the blue gradient. It would be great if the sensitivity/bug fixes were as simple as an update to the Moto app...we'll see.", "time": "08-23-2017 02:00 PM", "replies": []}, {"postID": "post5938612", "text": "yes, I am also having this problem. Very annoying, coming on all the time at night in a dark room across from my bed on the table because cars are driving past and the ambient light in the room is changing slightly. But way too sensitive\nand then doesn't turn on when I wave my hand over it on a bright sunny day. unless I really wave my hand like 5 times right in front of it, but then why don't I just press the button on the side and save some time", "time": "08-25-2017 03:35 PM", "replies": []}, {"postID": "post5945131", "text": "I've turned Active Display off since writing this, and after being used to it from the Turbo 2, I find it's a feature I really miss. I think I'm going to look into some always on apps. Ironic that I have to look at a third party solution on a phone that it should be native to.", "time": "08-29-2017 05:10 PM", "replies": []}, {"postID": "post5959464", "text": "I am usually asleep so it doesn't bother me at all.", "time": "09-06-2017 09:00 AM", "replies": []}, {"postID": "post5962712", "text": "Its bright enough to keep me awake, or wake me up.", "time": "09-07-2017 05:38 PM", "replies": []}]}, {"title": "Wired headset compatibility", "thread": [{"postID": "post5960301", "text": "one of the updates with the latest Tmo update was \"Wired headset compatibility\"\nI'm actually about to start a new job that will involve working remote. I'm used to being on conference calls in an office, using a headset with a deskphone. Something like Plantronics\nI just thought about that, and I'll be on my cell phone more now. Any good recommendations for a wired headset for long conference calls?", "time": "09-06-2017 02:24 PM", "replies": []}, {"postID": "post5960681", "text": "check this one out:https://www.amazon.com/dp/B01IER9P1K...cUvbUpU5960681", "time": "09-06-2017 05:40 PM", "replies": []}, {"postID": "post5961757", "text": "that one isn't bad, but I would prefer a more classic style, but I'll keep that in mind.\nhave you used it with your Z2 Force?", "time": "09-07-2017 09:36 AM", "replies": []}]}, {"title": "strange battery curve", "thread": [{"postID": "post5955397", "text": "Phone died over night. It was around 70% going to bed at 1am and dead by 10am. 9 hours with no use. \nGraph shows no wake locks but a normal use curve like something was still running. No apps look to have heavy use though. Weird. \nDid the same thing the night before with the battery mod on it.", "time": "09-04-2017 09:36 AM", "replies": []}, {"postID": "post5955400", "text": "Other graph", "time": "09-04-2017 09:37 AM", "replies": []}, {"postID": "post5955402", "text": "Other, other graph", "time": "09-04-2017 09:38 AM", "replies": []}]}, {"title": "security update today", "thread": [{"postID": "post5945577", "text": "Got a security update today on Verizon, up to August patches. Cool thing was that it installed in the background and then just had to quickly restart, first time I saw that and it meant very little downtime for my phone.", "time": "08-29-2017 08:55 PM", "replies": []}, {"postID": "post5946364", "text": "Yeah I got the same update on sprint yesterday. Hopefully Motorola keeps it up.", "time": "08-30-2017 10:07 AM", "replies": []}, {"postID": "post5947997", "text": "I'm still on June through AT&T.", "time": "08-31-2017 06:50 AM", "replies": []}, {"postID": "post5951761", "text": "Still on June for T-Mobile", "time": "09-01-2017 07:28 PM", "replies": []}, {"postID": "post5951888", "text": "Just got an update on AT&T", "time": "09-01-2017 09:04 PM", "replies": [{"postID": "post5952244", "text": "Thanks for the heads up, I just checked and updated mine too.", "time": "09-02-2017 05:56 AM", "replies": []}]}, {"postID": "post5952084", "text": "Motorola kept up on the first generation Zs, with the carrier version usually getting the update faster. \nUnless you're wanting day 1 security updates as Google releases them, Motorola (and Samsung) seem to be doing just fine.", "time": "09-02-2017 12:51 AM", "replies": []}, {"postID": "post5952550", "text": "I'm guessing TMobile might have to wait a bit so Motorola can fix the RCS problem.", "time": "09-02-2017 10:55 AM", "replies": []}]}, {"title": "Which screen protector Flexible vs Tempered? or ZAGG?", "thread": [{"postID": "post5901979", "text": "As we know the Shatterproof could be prone to scratches. Back when the 1st gen came out, a lot of people on AC recommended a Flexible Glass Screen Protector from Verizon:https://www.verizonwireless.com/accessories/flexible-glass-display-protector-moto-z-force-droid/\ni got that one based on the forum recommendations, and I thought it was awesome. There does not seem to be the same one available this year. this time the Verizon one is Tempered instead of Flexible:https://www.verizonwireless.com/accessories/vzw-tempered-glass-display-protector-moto-z2-force-edition/\nAnd they have a Zagg one:https://www.verizonwireless.com/accessories/zagg-invisibleshield-glass-plus-moto-z2-force-edition/\nwhich one to get?", "time": "07-27-2017 03:51 PM", "replies": []}, {"postID": "post5919857", "text": "In case anyone looks for this, it turns out the Verizon branded one is actually a Flexible Glass Display Protector, just like last year:\nit works great, feels great, can't even tell it is on:", "time": "08-10-2017 09:48 PM", "replies": []}, {"postID": "post5919934", "text": "I'm not too happy with zagg. it bugs me around the fingerprint sensor. probably will switch to the other", "time": "08-10-2017 11:36 PM", "replies": []}, {"postID": "post5920222", "text": "I tried the Zagg first and it would not stick in the corners, especially around the bottom, no matter what I tried. I removed it and tried the Verizon one mentioned above and it works much better. Wish I hadn't wasted my money on the Zagg.", "time": "08-11-2017 08:03 AM", "replies": [{"postID": "post5920556", "text": "i remember last year there were a lot of complaints about the Zagg, which is how I ended up trying the Verizon one", "time": "08-11-2017 01:25 PM", "replies": []}]}, {"postID": "post5920356", "text": "I had the Verizon employees install the zagg. after three tries, they got it right and it is perfect.", "time": "08-11-2017 10:24 AM", "replies": [{"postID": "post5920949", "text": "So if I buy it at the Verizon store do you think the employee would install one on my non-verizon Z2?", "time": "08-11-2017 09:15 PM", "replies": [{"postID": "post5920967", "text": "That's an interesting question. They ask for my phone number when I buy things and the receipt shows up online.", "time": "08-11-2017 09:36 PM", "replies": []}, {"postID": "post5920988", "text": "They did for me. Mine is a T-Mobile and when they asked for my phone number I just said it is not a Verizon phone. \nI lied and said it was a work phone", "time": "08-11-2017 09:59 PM", "replies": []}]}]}, {"postID": "post5920975", "text": "Verizon employees will put it on as a courtesy. they won't promise perfection if they screw it up", "time": "08-11-2017 09:46 PM", "replies": [{"postID": "post5920991", "text": "Last year they broke one trying to put mine on and they scrapped it and opened up a new one and put it on for me.", "time": "08-11-2017 09:59 PM", "replies": []}, {"postID": "post5920995", "text": "This is not correct, especially if you have a good relationship with the salesperson.", "time": "08-11-2017 10:03 PM", "replies": []}]}, {"postID": "post5932316", "text": "https://smile.amazon.com/gp/product/...?ie=UTF8&psc=1\nThis is the one I got. Super happy with it, flawless installation. It perfectly fits the screen, no bubbles whatsoever. I like how you can slide it around a bit before letting it set, ensuring proper positioning. And I've had a matte screen protector on my Kindle for years, love it on my phone as well.", "time": "08-22-2017 02:24 PM", "replies": []}, {"postID": "post5940461", "text": "Picked up the bodyguardz glass from AT@T worked great", "time": "08-26-2017 07:08 PM", "replies": []}]}, {"title": "AC's Andrew reports scratches on the screen after a few hours usage.", "thread": [{"postID": "post5899308", "text": "Not a good sign...", "time": "07-25-2017 01:15 PM", "replies": []}, {"postID": "post5899313", "text": "Yeah that looks bad and they should feel bad.", "time": "07-25-2017 01:24 PM", "replies": []}, {"postID": "post5899435", "text": "Yeah, that's why you should immediately put a screen protector on it, but that is particularly bad for it to be that quick.", "time": "07-25-2017 03:25 PM", "replies": []}, {"postID": "post5899459", "text": "Problem is that it is a screen protector.", "time": "07-25-2017 03:51 PM", "replies": [{"postID": "post5899471", "text": "I know that. But it's no longer user replaceable and more expensive than a regular screen protector. They made a big improvement in the visibility at least from the Turbo 2 to the Z Force. Not sure they had much farther to go this time.", "time": "07-25-2017 04:03 PM", "replies": [{"postID": "post5904655", "text": "Everything I read said that it's 100% replaceable.", "time": "07-29-2017 04:20 PM", "replies": [{"postID": "post5904835", "text": "No longer user replaceable, but you can send the phone in to have it replaced. The vagaries of English.", "time": "07-29-2017 07:02 PM", "replies": []}]}]}]}, {"postID": "post5899637", "text": "That's not at all surprising with ShatterShield.", "time": "07-25-2017 06:23 PM", "replies": []}, {"postID": "post5900362", "text": "this forum had a great recommendation for the 1st gen, it was a Verizon branded one they applied in store. I had it and it worked great.\nhopefully they make the same one for the Z2", "time": "07-26-2017 10:02 AM", "replies": [{"postID": "post5901724", "text": "So buy this phone and then immediately slap a screen protector on the shatterproof screen to \"protect it\" for $25? No thanks.", "time": "07-27-2017 12:12 PM", "replies": [{"postID": "post5901860", "text": "Par for the course with the DROID TURBO 2, Moto X Force, Moto Z Force Droid.", "time": "07-27-2017 01:54 PM", "replies": []}, {"postID": "post5901988", "text": "Look on any device forum here and everyone is slapping screen protectors on their phones. Screen protector keeps it from getting scratched, just like any other phone. This phone is Shatterproof, unlike any other phone", "time": "07-27-2017 03:58 PM", "replies": [{"postID": "post5901989", "text": "I've never used a screen protector. Not on my Droid 2 Global, not on my Droid Razr Maxx, not on my Turbo. I've never gotten a scratch on the screens. I never used a case until my Turbo, and only because the ballistic nylon was slippery.", "time": "07-27-2017 04:00 PM", "replies": []}, {"postID": "post5902029", "text": "It is shatterproof unlike other phones, but it is also prone to scratches, particularly deep scratches, far more than any other phone. The tradeoff isn't worth it. The chances of me needing the Shattershield are very slim, but the chances of me needing scratch protection are very high", "time": "07-27-2017 04:39 PM", "replies": []}]}]}]}, {"postID": "post5902031", "text": "The tail is really wagging the dog when it comes to the mods versus the new Z2 Force.", "time": "07-27-2017 04:39 PM", "replies": []}, {"postID": "post5936901", "text": "I have had mine for 1 week and used it extensively with not a single scratch on the display and I even carry it around in my front pocket. Just put a screen protector on today just in case. Love the phone and the snappy response of apps and fingerprint scanner. Battery gets me through the day and then some.", "time": "08-24-2017 07:11 PM", "replies": []}]}, {"title": "Is the battery size too small?", "thread": [{"postID": "post5897961", "text": "I realize that battery size isn't the only aspect affecting battery life but i just feel that 2730mah is a bit small... I don't think that the battery life will match the moto z force.", "time": "07-24-2017 02:56 PM", "replies": []}, {"postID": "post5898762", "text": "That's also a concern for me... I don't want to have less battery life than my current phone (Samsung S7).", "time": "07-25-2017 05:33 AM", "replies": []}, {"postID": "post5898878", "text": "Heck yeah. Going from 3500 to 2730 is horrible.", "time": "07-25-2017 08:03 AM", "replies": []}, {"postID": "post5899248", "text": "I definitely wish they didn't decrease the battery size, but real life tests will determine the effects of the diminutive battery... Though I don't have high expectations and a battery mod will likely be essentially required. Which would be why they included the projector mod and not a battery mod for the promotion.", "time": "07-25-2017 12:40 PM", "replies": []}, {"postID": "post5899280", "text": "As a former Verizon rep I can tell you the 2 main reasons people bought a Motorola phone instead of Samsung. One was durability, they had actual Kevlar on them and took a beating. The other was battery life, people loved the large batteries. \nI think this will hurt their sales.", "time": "07-25-2017 01:01 PM", "replies": []}, {"postID": "post5899526", "text": "Yes. This was a short sighted way to promote their stupid mods. They are probably banking on people purchasing the battery mod in order to get the same battery life that the last gen phone already had. Incredibly stupid. I hope other people vote with their wallets and skip this crappy release \nI am on the fence about what to buy instead. Leaning towards a g5 plus as a stopgap till next year, but I really don't want to give Moto any more of my money.", "time": "07-25-2017 04:47 PM", "replies": []}, {"postID": "post5899635", "text": "I think it's too small.", "time": "07-25-2017 06:22 PM", "replies": []}, {"postID": "post5899760", "text": "Of course it's too small. Is this a trick question?", "time": "07-25-2017 08:27 PM", "replies": [{"postID": "post5926940", "text": "I don't think its a trick question, but for me that is way too small.", "time": "08-17-2017 06:22 PM", "replies": []}]}, {"postID": "post5899763", "text": "It seems like we may have seen the last Droid as well. I'm not sure if the licensing agreement ran out or not between Lucas and Verizon. Motorola and Droid were a great combination but I think it's time for something new.", "time": "07-25-2017 08:32 PM", "replies": []}, {"postID": "post5899790", "text": "it seems like everyone is in agreement. battery is way too small. consumers who are battery aware want bigger batteries.", "time": "07-25-2017 09:01 PM", "replies": []}, {"postID": "post5914480", "text": "This is Lenovo's premium flagship and you downgrade the battery to 2730mamp. Why, that was the # 2 best selling feature outside of the shattershield. Does this make any kind of sense? For me, I definitely think this will effect sales without question!", "time": "08-06-2017 03:23 PM", "replies": []}, {"postID": "post5914887", "text": "I think Motorola backed themselves into somewhat of a corner when they released the original thicker Z Force and Z Play. Both great phones, but for most people too thick to use with Moto mods on any regular basis. And the whole idea behind the Z lineup was modularity.\nThe one original Z phone that really worked well with this concept was the Moto Z / Z Droid. But after they decided they'd have to thin down the Z Force and Z Play to get customers interested in purchasing more Moto mods, there was no longer the need for the Moto Z / Z Droid in this year's lineup.\nThat's my take on what's currently going on. I'm sure they would not have lowered the battery sizes on either of the new phones if they could have made them thinner without doing so. It was all about the mods, which is really the point of the phone to start with.", "time": "08-07-2017 01:46 AM", "replies": []}, {"postID": "post5915891", "text": "in order to mass market the phone they compromised and made it thinner, effectively making a Moto Z with shatter shield. \nI have the z as a work phone and z Force as my phone. I like using the z for longer periods because of the lightness. \nhands in with the Z2 Force, it's crazy light. yeah battery might not be as good but with a turbo charger and a mod, it doesn't have to last the whole day. just long enough to get home and I'll top it up when I'm making dinner. no big deal", "time": "08-07-2017 08:09 PM", "replies": [{"postID": "post5921412", "text": "Exactly. But to be honest I am getting better life with this than with my S8 plus. Not sure why, other than less garbage software on top.", "time": "08-12-2017 11:57 AM", "replies": []}, {"postID": "post5921435", "text": "Battery mods are great and all, but I haven't had a phone with less than 3000mah since my S3 in 2012. Smaller battery equals more charge cycles over the same period of time, which means replacing the phone sooner.", "time": "08-12-2017 12:11 PM", "replies": []}]}, {"postID": "post5921630", "text": "I think the fact that capacity is generally lost over time (although I'm somewhat of a believer of keeping a phone between 40 and 80%) so a smaller sized battery over time can be a concern.", "time": "08-12-2017 03:53 PM", "replies": []}, {"postID": "post5922583", "text": "That's the one caveat as to why I'm not purchasing it to replace my S7 Edge. Battery life. Even with the mods, the current mAh is unacceptable.", "time": "08-13-2017 05:41 PM", "replies": []}, {"postID": "post5922633", "text": "I've had no problem with battery life thus far, even without a mod. Moto must have done a great job with software optimizations.", "time": "08-13-2017 06:28 PM", "replies": [{"postID": "post5922658", "text": "Same for me.", "time": "08-13-2017 06:58 PM", "replies": []}, {"postID": "post5922798", "text": "I was very concerned about battery life but I've had the phone since Tuesday and it's really not bad. I'll still waiting for the new turbo power battery mod to be available on the Verizon business portal. it's not in stock in any vzw store in a 500 mile radius but is available online on the consumer site. emailed my rep about it today. hopefully he can order one for me tomorrow. even if the stock phone ends up with decent battery life I can keep the mod in my car or pack for day trips and not have to worry", "time": "08-13-2017 10:20 PM", "replies": [{"postID": "post5922807", "text": "With a phone that thin you may also want to consider the new (and currently available) external Power pack mod from Moto. It's 2200mah and is really low profile. I absolutely love it on my OG z Play. That'd give you an effective 5000mah give or take. Plenty.\nPlus best buy has them 10% off an already great price. Food for thought.", "time": "08-13-2017 10:34 PM", "replies": [{"postID": "post5922812", "text": "the new battery mod from Moto is 3500 and is the same thickness, supposedly, as the 2700mah one from last year. also it can be turbo charged itself via usb-c and also turbo charges the phone at 15w. it's a big improvement on both the previous battery mods. it's supposed to be out now for Verizon customers but I've only seen it for sale on the consumer website.", "time": "08-13-2017 10:38 PM", "replies": [{"postID": "post5923078", "text": "Yeah, there are advantages to the turbo mod. Just depends on your needs/prefs I guess. For me, a mod as thick as the 2016 z play is just too chunky to leave on all the time. And carrying it around separately to occasionally quick charge the phone is a bit of a hassle imho. I'd rather have something that I can just treat as part of the phone and forget it's there that provides all day battery life plus some.\nHopefully the thing drops for you soon. They delayed the launch back in spring and have missed their updated release date.", "time": "08-14-2017 08:28 AM", "replies": []}]}]}]}]}, {"postID": "post5922720", "text": "I love the Moto series, but a battery of that size does concern me.", "time": "08-13-2017 08:16 PM", "replies": []}, {"postID": "post5923234", "text": "we went on a weekend get away and left the house with 83 percent and after six straight hours of full on screen navagation I still had 9 percent left. So I think that was very good. THen saturday left the cabin at 8:15am with 100 percent and got back at 8:30pm and still had 15 percent left. Jt did normal activities. Anyway those are my real world reviews.", "time": "08-14-2017 11:15 AM", "replies": [{"postID": "post5923241", "text": "Those seem like good numbers to me. Thanks for sharing!", "time": "08-14-2017 11:26 AM", "replies": [{"postID": "post5923735", "text": "Thanks for those stats! Not bad at all - very good!", "time": "08-14-2017 08:37 PM", "replies": []}]}]}, {"postID": "post5926718", "text": "I have had the Force since 8/9 and through my normal day at work (7 AM to 4 PM) I have been getting home with 50% plus. By bed time I still have 35%. Yesterday I had 5+ hours screen on time and played 3D flight sim for a good hour. The battery life on this phone is stellar.", "time": "08-17-2017 02:13 PM", "replies": []}, {"postID": "post5932307", "text": "What gets me is all these people complaining about the battery, yet no comment about actual battery life. My wife got the S8 and I have the Z2. These phones go toe to toe on actual battery life. Also, another thing that bugs me, is everyone saying \"This phone should be able to stand on its own without any mods at all.\" Really? You're going to get a Moto Mods phone and not get any mods? Then why get one? Get the S8, or upcoming X. \nI think Moto decided that you will run a mod, and a mod usually has 1,000 mAh built in, at the very least. Thereby giving you 3720 mAh battery. And that little bit of thickness makes a difference. After using my Z2 Force for a bit, I picked up the Z2 Play at the store and it felt super thick. Most of the time, now, I just run a style shell because the built in battery is enough. Though I did pick up a battery mod at Best Buy that was on clearance, I don't really have any need for it unless I'm going to Disneyland or something where I might see heavy usage (stupid lines) without any chance of charging the whole day.\nI will say about style mods though, I wish they had metal plates or something built in so I can use my magnetic car mount. As it is, I have to carve out a spot to put the metal plate. Looks fine when its on the phone, but it was a pain to do.", "time": "08-22-2017 02:18 PM", "replies": []}, {"postID": "post5932609", "text": "I'm on track for 13 hours with 6 hours of screen on time. Coming from S8+, the Z2 Force is better battery life.", "time": "08-22-2017 06:30 PM", "replies": []}, {"postID": "post5932629", "text": "I get a full day of heavy use plus I picked up the battery mod which add even more battery life.", "time": "08-22-2017 06:48 PM", "replies": []}, {"postID": "post5932662", "text": "I came from Z Force and always used an incipio off grid pack in efficiency mode. I am an average to moderate user and most days the pack was just kicking in around six in the evening, 80% for installed battery and pack was between 80-90 at end of each day.\npicked up Z2 Force and use it with Moto Turbo pack also in efficiency mode.\nMost days, like today, internal battery is still above 80% well into the evening. It is 8:30 PM and internal battery is still 85%.\nBottom line is that for my usage patterns I am getting as good or better than my year old Z Force was getting.\nAlso of note the Z2 Force with Turbo pack is slimmer and lighter than the Z Force with the Incipio pack. \nAnd while we are at it I used a Skinomi glass screen protector on both models with a Verizon bumper. The Z2 bumper is better designed in fit and appearance and still allows mods to be installed or removed while in place.", "time": "08-22-2017 07:32 PM", "replies": [{"postID": "post5932815", "text": "How does the Moto turbo pack compare in weight and thickness to the Incipio power pack?", "time": "08-22-2017 10:18 PM", "replies": []}]}, {"postID": "post5932736", "text": "I'm rock'n the S8 and it lasts me all day. The 3300 should compensate for the larger screen. I think I'll be okay with my usage.", "time": "08-22-2017 08:57 PM", "replies": []}, {"postID": "post5933433", "text": "Have not measured it but I would say it is very close to same dimensions and weight, certainly not thicker. The bevelling makes it seem thinner but I think that is optical illusion. The Verizon bumper for the Z2 has corners that are slightly thicker on mod side that also make installed mods seem thinner.\nof note the Moto turbo mod has a USB C charging connection for charging while not on the phone.", "time": "08-23-2017 10:37 AM", "replies": []}]}, {"title": "Will you use a screen protector?", "thread": [{"postID": "post5899339", "text": "For those who are buying or planning to buy this phone, are you planning to use a screen protector?\nGiven that the screen scratches easily like the previous years but unlike the previous years, the stock screen protector (lens) isn't user serviceable, personally, if I where to get a Z2 Force, then I would get a screen protector. What about you?", "time": "07-25-2017 01:42 PM", "replies": []}, {"postID": "post5899438", "text": "Absolutely necessary the first day.", "time": "07-25-2017 03:28 PM", "replies": []}, {"postID": "post5899638", "text": "It is a must with ShatterShield.", "time": "07-25-2017 06:23 PM", "replies": []}, {"postID": "post5900363", "text": "yup, had one on my Z Force and never had any issues", "time": "07-26-2017 10:02 AM", "replies": []}, {"postID": "post5903135", "text": "didn't use one on my z force but did replace the shatter shield once. since word has this one won't be user replaceable yes I will be", "time": "07-28-2017 01:23 PM", "replies": []}, {"postID": "post5908798", "text": "Yes, I would absolutely get a screen protector. I'm clumsy enough bumping into table corners and walls - I don't need my phone to suffer for my weirdness! 😜", "time": "08-01-2017 09:56 PM", "replies": []}, {"postID": "post5916972", "text": "confirmed it will scratch with a fingernail", "time": "08-08-2017 06:38 PM", "replies": []}, {"postID": "post5916979", "text": "It's a trade off. Making the screen harder to resist scratches makes it more brittle. But making it shatterproof makes it easier to scratch. IMO Corning got the formula best with GG3, but they had to try to make it even harder and thinner and this so they got the easily shatterable GG4, and GG5 is less easy to break than GG4, but easier to scratch.", "time": "08-08-2017 06:48 PM", "replies": []}, {"postID": "post5917107", "text": "yeah but I can't scratch the Z Force with my finger. the new design is a bit of a disappointment. liked being able to replace the lens myself if needed", "time": "08-08-2017 09:07 PM", "replies": []}, {"postID": "post5917202", "text": "Definitely plan on using a screen protector, just not sure whether to use plastic or splurge on glass.", "time": "08-08-2017 11:04 PM", "replies": [{"postID": "post5917280", "text": "Well the advantage of glass is that it helps preventing the screen to shatter, but you already have shatterproofing... Then again plastic scratches so you're gonna be replacing it more often...", "time": "08-09-2017 12:57 AM", "replies": [{"postID": "post5917516", "text": "I think it's mostly a feel thing or preference between glass and plastic when it comes to a phone with Shattershield.", "time": "08-09-2017 06:35 AM", "replies": []}]}]}, {"postID": "post5931190", "text": "The Armor Suite screen protector has been my favorite for the past several years", "time": "08-21-2017 06:38 PM", "replies": []}]}, {"title": "Sprint Moto Z2 Force", "thread": [{"postID": "post5919472", "text": "I have it in my hand. I will be happy to answer any questions, with the stipulation that I won't have a full picture of battery life until I use it for a few days.", "time": "08-10-2017 02:47 PM", "replies": []}, {"postID": "post5919488", "text": "I'm interested in the camera, particularly if you have another relatively newer phone for comparison shots. Thanks!", "time": "08-10-2017 03:10 PM", "replies": []}, {"postID": "post5919504", "text": "Ok. I'll be taking some shots this weekend so please check back!", "time": "08-10-2017 03:31 PM", "replies": [{"postID": "post5919518", "text": "I will. Thanks!", "time": "08-10-2017 03:44 PM", "replies": []}]}, {"postID": "post5920270", "text": "So I've had the phone close to 24 hours.\nSome quick initial impressions:\n1. Battery life. I'll need to use the phone for at least a week before I'm ready to call it \"good\" or \"bad\", but so far I have no complaints.\n2. Camera. I have to warn you that I am not super picky about smartphone cameras. Generally all the previous Motorola's I have owned have suited my limited needs. That being said the few shots I have taken so far have been fine for me. I will post some after I have a good variety taken over the weekend.\nThe Good:\n1. Software. Motorola continues to knock this area out of the park. Phone has the standard Motorola interface we have come to love over the past 4 years. It is buttery smooth and I haven't encountered a single stutter yet. There has been one pleasant surprise: while I don't think it is the full google pixel app, the phone app does now incorporate local searches much like the google version. Very nice feature that I have been side loading for the past few years. One Button Nav: I understand this feature isnt for everyone I suggest that you give it a try. It's awesome once you get used to it. There was a software update waiting when I first turned the phone on. It claimed to fix a \"battery meter\" problem. The update was performed in the background and required a reboot at the end, which is the first time I have encountered this process. Very convenient compared to the old method that took away your phone for the duration of the update.\n2. Hardware. After all the hoopla about reduced battery size for thinness this phone is beefier than I was expecting. It is not as thin feeling in my hands as I was led to believe by most of the reviews.\n3. Here's a pleasant little quirk: the included charger does the 5V\\3A (PD) quick charging as well as Qualcomm quick charge 2.0. I'm not sure if any other charger out there can do that.\n4. Display: very good, no complaints. After the hoopla over the scratch ability, the first thing I did upon opening was to put a cheap glass screen protector on. So far despite being only $6 it has been doing the job. I do not have the \"crinkling\" sound some reviewers have reported. I'm inclined to believe that particular problem was confined to pre-production models.\nThe Bad:\nSo a couple of nitpicks that I want to relay:\n1. SD card. For whatever reason (maybe because of Sprint?) you can't make the SD card integrated storage. This is the first time I've run into this restriction on a Motorola phone, and it's annoying.\n2. Sprint bloatware. Lots of it. Good news is that almost all of it is deletable or can be disabled. \n3. Here is a minor annoyance. Recently Sprint released a MySprint app on the Play Store. On other Sprint phones, the My Sprint app would download and automatically replace the old Sprint Zone app. For some reason on this phone when I downloaded the My Sprint app, the Sprint Zone app remained, so I have both. Annoying.\nSo that's all I have for now. Overall, I am extremely pleased with my purchase, especially at Best Buy's price.", "time": "08-11-2017 08:46 AM", "replies": []}, {"postID": "post5920506", "text": "So I just got an update that confirmed that the google phone is in fact the default phone app!", "time": "08-11-2017 12:35 PM", "replies": []}, {"postID": "post5927915", "text": "So, I thought I'd check back in with an update as I've now had the phone for a week.\n1. Battery life: Perfectly acceptable. I'm averaging 4-4.5 hours of screen time. This is a step down from the Moto G5 Plus I recently had, but that's not a fair comparison as the G5+ had the best battery life of any phone i've ever owned, including the 3900 Mah Droid Turbo.\n2. Camera. Acceptable for my uses. I'm posting some pictures below. I'm not picky when it comes to cameras and this one has adequately performed everything I've asked it to.\n3. everything else I mentioned is holding up. The software is superb and the hardware is solid.", "time": "08-18-2017 03:51 PM", "replies": []}, {"postID": "post5929171", "text": "mine is Tmo not Sprint, but i would agree with you that the battery life and camera are much better than expected. Solid device that got beat up in the reviews, somewhat unfairly", "time": "08-19-2017 09:23 PM", "replies": []}, {"postID": "post5929587", "text": "I thought I'd comment on a few Sprint specific things:\n1. Sprint Zone/My Sprint apps. This situation never really resolved itself. I removed the Sprint Zone app via an adb method (it's out there) and downloaded the My Sprint from the Play Store and it works perfectly.\n2. APN settings. This is the first Sprint phone I've owned that allows the user to access APN settings. I'm not quite sure what that signifies.\n3. Dialer: As I stated the default dialer is the google one that includes the \"nearby\" places feature. Very useful, and from what I gather none of the other versions of the Z2 force include the nearby places feature.\n4. Voicemail. Sprint's standard android voicemail app is included. It includes adds unless you want to pay extra. Annoying.\n5. Wifi calling is a part of the software, and it works fine. The only drawback is that Sprints HD voice codec is disabled when wifi calling is enabled. Recently Sprint's Samsung S8 phones were updated to \"calling plus\" which is a VoLTEish service that allows data and voice calls simultaneously. I'm hoping this software is pushed to the Z2 in the near future.", "time": "08-20-2017 09:36 AM", "replies": []}, {"postID": "post5929811", "text": "I have the same issue with sprintzone and mysprint on my keyone. I ended up just using sprint zone", "time": "08-20-2017 01:51 PM", "replies": []}, {"postID": "post5929828", "text": "Yeah, its weird. On my HTC 10, sprint zone updated and became my sprint.", "time": "08-20-2017 02:03 PM", "replies": []}]}, {"title": "Moto Z2 Force Usage", "thread": [{"postID": "post5925760", "text": "I have had the Moto Z2 Force since launch and have found the phone to be pretty good- not great, but pretty good. Battery life is surprisingly good. I previously had a Moto Z Droid and battery life does not seem significantly reduced, comparatively. I am a pretty heavy user and generally average 4-5 hours of SOT with both phones. Also notable is the battery drain over night is nearly non-existent. \nThe camera is a completely different story. The new camera is utter garbage in anything but excellent light. Evening lighting in a living room results in grainy photos no matter how hard you try. HDR is a waste of time because it requires such a slow shutter that pictures are always blurred. I have minimal video experience, but it also seems lower quality than the original Z Force. \nThe phone looks and feels phenomenal in person and I actually appreciate the reduced weight. I actually don't use a style she'll most of the time because it feels so great already. I do use a bumper case just in case I drop it- I don't want scratches on the metal or screen. Speaking of, I prefer to use Armor Suit screen protectors for the Moto Z line due to it's flexibility for the plastic screen. \nThe last thing I want to mention is that the New Z2 Force should realistically be compared to the non-Force line last year considering it's size and camera setup. The Force last year was a Droid- meaning Verizon had a hand in the final specs. I do think Motorola failed with their pricing of the new Z2 Force, but the actual phone is far more similar to the Z than the Z Force Droid.", "time": "08-16-2017 03:35 PM", "replies": []}, {"postID": "post5926292", "text": "I find the camera to pretty much be on par with most new devices myself. I take all types of photos for work and they are all great photos.", "time": "08-17-2017 06:25 AM", "replies": []}, {"postID": "post5926408", "text": "I find the photos to be of very high quality as well. I have been very pleased with this phone coming from a nexus 6. the moto apps are worth it in my opinion.", "time": "08-17-2017 08:58 AM", "replies": []}, {"postID": "post5926490", "text": "i also like the camera", "time": "08-17-2017 10:29 AM", "replies": []}, {"postID": "post5926548", "text": "I like my new Z2 Force, it's been working great so far. \nI had one hiccup - I had to reboot the Z2 last night because it would not auto connect with my Google WiFi at home. After the reboot it was magic again as well as everything else.", "time": "08-17-2017 11:48 AM", "replies": []}, {"postID": "post5926721", "text": "This Phone has worked great for me. It really flies when you are scrolling or playing games. Battery is great no issues at all. I did have it lock up twice after I switched to the Moto swipe left to go back and right to apps. After I went back to on screen buttons I have had no problems.", "time": "08-17-2017 02:18 PM", "replies": []}, {"postID": "post5926731", "text": "I haven't had any issues with hangups or freezing, even with the fingerprint swipe options", "time": "08-17-2017 02:26 PM", "replies": []}, {"postID": "post5927896", "text": "I'm generally pretty unimpressed with the camera as well, coming from a Nexus 5X that punched way above it's weight in the camera department. It has some very notable strengths - in VERY dark lighting with a very steady hand, and HDR enabled, you can take some impressive pictures. Medium indoor lighting, especially when you're trying to snap a quick picture of something and not completely steady, are a complete crapshoot. Autofocus does seem to be extremely fast in all conditions.\nImage stabilization in video recording is completely useless; it's constantly cropping and shifting the frame abruptly. 1080p60 video with a steady hand looks infinitely better, however ironically the autofocus in video mode is TOO fast and also leads to the frame jumping around a lot as it tries to refocus. \nOverall the software experience as it relates to the camera could use a lot of refinement.\nI'm pretty happy with the rest of the device experience though. As many of the professional reviews noted, it seems like the performance is on par with any other SD835 device. I have quickly come to love Motonovo/lenovarola's custom android touches such as gestures and the expanded usability of the fingerprint scanner. Being able to preview notifications, action or dismiss a notification, and then relock the device without even picking it up and all while using a single finger is absolutely a revelation.", "time": "08-18-2017 03:26 PM", "replies": [{"postID": "post5929173", "text": "yeah, I shot a video in 4K and it was super shakey. 1080p at 60fps has been solid for me", "time": "08-19-2017 09:24 PM", "replies": []}]}]}, {"title": "Camera lens", "thread": [{"postID": "post5928112", "text": "Is the metal ring around the camera lens slightly raised?", "time": "08-18-2017 07:27 PM", "replies": []}, {"postID": "post5928122", "text": "Yes but a mod will eliminate the bump around the camera.", "time": "08-18-2017 07:40 PM", "replies": []}, {"postID": "post5928127", "text": "I tried the nylon style shell but it was too slippery and didn't sit entirely flush and annoyed me. The battery mod is too heavy and expensive. And I don't really need it. I have chargers all over the place and the battery on this is awesome. I thought about getting the OG style shell but I am worried it'll have a gap and I'll just end up taking it off. I like the look of the phone naked", "time": "08-18-2017 07:50 PM", "replies": []}, {"postID": "post5928128", "text": "Also thanks for the reply", "time": "08-18-2017 07:52 PM", "replies": []}, {"postID": "post5928161", "text": "the Moto style shells fit fine. no gap. just for the light wood one on Amazon. I have the dark wood and both nylon ones. fit just fine", "time": "08-18-2017 09:13 PM", "replies": []}]}, {"title": "Z2 Force Preorders have begun, starting at $750", "thread": [{"postID": "post5899282", "text": "For those interested, you can preorder the Z2 Force now. How many have ordered?https://m.androidcentral.com/where-b...-force-edition", "time": "07-25-2017 01:02 PM", "replies": []}, {"postID": "post5899306", "text": "Passing. Hope it's awesome for those who get it!", "time": "07-25-2017 01:14 PM", "replies": []}, {"postID": "post5899310", "text": "All the Moto Mods make me REALLY want one but Moto Display would drive me insane. I wish they'd just set it as Always On Display instead of it only coming on with notifications or interaction with the phone. The Hasslebad mod really interested me too but from what I saw in YouTube reviews it was worse than the built in camera", "time": "07-25-2017 01:19 PM", "replies": [{"postID": "post5900551", "text": "The Hasselblad is only good for the zoom.", "time": "07-26-2017 12:48 PM", "replies": [{"postID": "post5919572", "text": "How bulky is that thing?", "time": "08-10-2017 04:41 PM", "replies": [{"postID": "post5919611", "text": "It fits well, but is chunky enough. You wouldn't want to leave it on there, just when you know you'll be using it.", "time": "08-10-2017 05:15 PM", "replies": [{"postID": "post5926947", "text": "I would probably rather carry a separate camera", "time": "08-17-2017 06:28 PM", "replies": []}]}]}]}]}, {"postID": "post5900353", "text": "i am in the process of getting it via JOD right now with T-Force", "time": "07-26-2017 09:57 AM", "replies": []}, {"postID": "post5902213", "text": "I got my order in today", "time": "07-27-2017 07:31 PM", "replies": [{"postID": "post5914661", "text": "When and from where did you order?", "time": "08-06-2017 07:14 PM", "replies": [{"postID": "post5918225", "text": "sorry, i just saw this...\nI ordered it via T-Force on Twitter for T-Mobile", "time": "08-09-2017 03:36 PM", "replies": []}]}]}, {"postID": "post5915520", "text": "after lots of back and forth, decided to wait for a month or two.", "time": "08-07-2017 02:32 PM", "replies": []}, {"postID": "post5917725", "text": "Ordered mine from Best Buy last week to take advantage of that deal. Best Buy's shipping system is wonky. Originally said that both the phone and the free JBL would be delivered 8/10. But then the JBL somehow slipped to 8/28. But I actually got the JBL yesterday, and now the phone estimated delivery is 8/14.", "time": "08-09-2017 09:32 AM", "replies": []}, {"postID": "post5919359", "text": "Just activated my Sprint model from best buy.", "time": "08-10-2017 01:29 PM", "replies": []}, {"postID": "post5919492", "text": "I received the AT&T model I preordered from BB. I also got the price match with Moto, which helped a lot. I used the Z2 Play, so I knew what to expect with the Force, but I have to say that I like it. I will have to test out the camera and battery life, although so far the battery has been fine. The phone is so thin and light that even with the Mods (backs, battery packs), the phone is not very thick or heavy, which is nice. As someone reported in another thread, the shattershield top layer is not flush with the phone around the fingerprint sensor and creates a little bit of an edge, which is somewhat annoying. Using the sensor instead of the onscreen buttons is great and works really well. I will report back later after more use, but so far so good.", "time": "08-10-2017 03:16 PM", "replies": []}, {"postID": "post5919762", "text": "Wow, that's not a bad price!", "time": "08-10-2017 07:56 PM", "replies": []}, {"postID": "post5919911", "text": "i got my Z2 Force today, so far it is pretty cool", "time": "08-10-2017 10:54 PM", "replies": [{"postID": "post5920209", "text": "Awesome! What's your favourite part about it so far?", "time": "08-11-2017 07:42 AM", "replies": []}]}, {"postID": "post5920565", "text": "I have had several Moto devices in the past, Moto Maxx, Droid Turbo, Z Force Droid, Nexus 6, and more. They have always had a lame duck for a camera, and often had very low in-ear volume for phone calls.\nBoth of those appear to be fixed, so I'm pleasantly surprised. And I love a front facing finger print scanner", "time": "08-11-2017 01:33 PM", "replies": [{"postID": "post5920785", "text": "Glad phone call volume and camera features are great on the phone! I have yet to use a phone with a front-facing fingerprint scanner, but I imagine that it'd be a very convenient placement!", "time": "08-11-2017 05:45 PM", "replies": []}]}, {"postID": "post5923339", "text": "the one button nav is my favorite feature. But all the moto actions are pretty sweet so that is worth a lot right there. I have been very pleased with this phone. Camera and battery are both way better then the reviews are giving this phone.", "time": "08-14-2017 01:01 PM", "replies": []}]}, {"title": "Shattershield display, more harm than good?", "thread": [{"postID": "post5906769", "text": "Yikes....Interesting read: The Moto Z2 Force&#039;s &#039;unbreakable&#039; screen may be a deal breaker\nI'm afraid this screen will be a deal breaker for many people. While it doesn't crack, there are plenty of other issues with it.\nThe key to Motorola's unbreakable displays is that they are composed of plastic instead of glass. This was the case last year with the original Z Force, but the new phone doesn't seem to use the same materials in the screen. I've only had this phone for about a week, but there are already several visible scratches on the display. David has also picked up some deep gouges in his screen.\nNow, you would expect a few scratches on a screen made of plastic—it's more resistant to impact but much softer than glass. However, the plastic Moto used this year is obviously softer than what it employed in 2016. My Moto Z Force review unit has been clunking around in a drawer with other phones for most of the last year, and it's barely scratched at all. That's in addition to being actively used for a few weeks last year. After less than a week, the Z2 Force is already more scratched. The scratches aren't always visible when the screen is on, but when the light hits at the right angle, you'll see them.\nI'm not even sure how most of these scratches happened. The phone has been in my pocket or on my desk the whole time. Well, I guess I do know how one of them happened. You see, when I first noticed the scratches, I did what I would do with any phone—I ran my fingernail across the area to see if it felt like a scratch or just some gunk that would come off. I confirmed they were, in fact, scratches, but also accidentally added a new scratch with my fingernail. This should not happen ever, but especially not on a phone that costs $800.\nSince I have the previous Z Force handy, I was able to compare the screens directly. On the Z2 Force, a fingernail is enough to scratch the display. This is not true of last year's Z Force. I can't think of any reason Motorola would downgrade the materials, but that's what it did.\nFrom what we understand, Motorola changed the design of the ShatterShield screen this year to make it thinner. Part of that process included bonding the plastic cover to the display. Thus, you can't remove it like you could on the Z Force. So, if it gets massively scratched up, you would need to replace the entire AMOLED panel instead of just a plastic sheet.\nThe adhesive holding the plastic layer in place seems insufficient, too. Of the two units we've tested, both make a \"crinkling\" noise when you press in certain places. The plastic appears to be popping up slightly after being pressed down, like the adhesive isn't strong enough to hold it. The sound is very noticeable around the fingerprint sensor and at the top near the earpiece.", "time": "07-31-2017 11:47 AM", "replies": [{"postID": "post5908426", "text": "Yikes! I was very interested I this phone when I was looking to upgrade. I ended up going with a different manufacturer but this makes me sad. An 800 phone shouldn't have a screen that's as easy to scratch as it seems to be. \nThat said, with this knowledge, I would probably still add a tempered glass screen guard and be happy with it as long as my unit doesn't crackle.", "time": "08-01-2017 04:37 PM", "replies": []}, {"postID": "post5908586", "text": "All of what you are saying, the small battery and high price add up to a disaster.", "time": "08-01-2017 06:25 PM", "replies": []}]}, {"postID": "post5907170", "text": "That is disappointing it is worse this year and not acceptable. However, I think people have been saying since the first Shattershield screen with the Droid Turbo 2 that a screen protector is mandatory. We can argue it's silly to put a screen protector on top of basically another screen protector but there it is. Plus the more recent iterations of GG have been more shatter resistant but less scratch resistant so if you don't want scratches on a screen put a protector on it.", "time": "07-31-2017 03:50 PM", "replies": []}, {"postID": "post5908624", "text": "What does a plastic screen feel like compared to glass. I have zero experience.", "time": "08-01-2017 07:01 PM", "replies": [{"postID": "post5908632", "text": "The same, no noticeable difference. O have been using Shattershield for over a year & half on two different phones and can't tell the difference between it and a Gorilla Glass screen.", "time": "08-01-2017 07:17 PM", "replies": []}, {"postID": "post5926943", "text": "Because there's an oleophobic coating it should feel smooth. Needs a glass protector anyway so it almost doesn't matter.", "time": "08-17-2017 06:26 PM", "replies": []}]}, {"postID": "post5908633", "text": "Shattershield being easy to scratch is not new. The manufacturer (Moto) recommends always using a screen protector for this very reason. To me it's simple....you want scratch resistant / proof screen, get a Gorilla Glass screen. You want shatter proof (but not scratch resistant) screen, get a Shattershield. Life is all about choices and it's good that we have both versions of screens available for those that prefer either type.\nThe Moto Z2 Force is definitely on my \"want list\" for 2017, easily scratched screen or not.", "time": "08-01-2017 07:18 PM", "replies": [{"postID": "post5908640", "text": "Except it seems the Z2 force scratches easier than previous shatter shield devices which is not good.", "time": "08-01-2017 07:29 PM", "replies": [{"postID": "post5908652", "text": "\"Seems like\" being the key phrase. Maybe the author of the article just wasn't familiar with Shattershield? I'm not sure, but an inexpensive glass screen protector will keep the screen from scratching easily and you still have the benefit of Shattershield, so still a win in my book.", "time": "08-01-2017 07:43 PM", "replies": []}, {"postID": "post5924746", "text": "And it may also be more difficult to shatter or damage in a fall, we really don't know the full story. The turbo 2, which was the first to use this screen tech had a user replaceable screen protector on it when sold.", "time": "08-15-2017 06:57 PM", "replies": [{"postID": "post5924753", "text": "The Z Force and Z2 Force still have a user replaceable outer lens...like the Turbo 2. It's still a 5 layer design screen, and the outer layer (lens) is still replaceble.", "time": "08-15-2017 07:08 PM", "replies": [{"postID": "post5924757", "text": "Do you have a source? Most i have seen say the outer layer on the Z2 force is not user replaceable, but it is replaceable by Motorola or carrier.", "time": "08-15-2017 07:13 PM", "replies": [{"postID": "post5924772", "text": "Official source...No. So please disregard that last post by me.", "time": "08-15-2017 07:45 PM", "replies": []}]}]}]}]}]}, {"postID": "post5924321", "text": "I think it'll be the main reason I don't buy this phone. Bummer, because I was looking forward to it after my Moto Z", "time": "08-15-2017 11:40 AM", "replies": [{"postID": "post5924350", "text": "What's the reason you will not buy it?", "time": "08-15-2017 12:01 PM", "replies": [{"postID": "post5924703", "text": "The plastic shattershield screen.", "time": "08-15-2017 05:25 PM", "replies": [{"postID": "post5924708", "text": "Oh...OK. This is just my 2 cents, but if you want Shattershield you have to deal with the 5 layer design and understand that the outer layer (the lens) is a soft plastic layer that will scratch if unprotected. A decent screen protector keeps the lens from scratching and you have a shatter proof screen that you don't have to worry about dropping and breaking. Or...stick with traditional Gorilla Glass, which is very scratch resistant but prone to shattering and cracking since it is a hardened glass.\nIt's awesome to have choices. After having Shattershield for over 2 years now I will never buy a phone with Gorilla Glass as long as Moto continues to make Shattershield.", "time": "08-15-2017 05:34 PM", "replies": [{"postID": "post5924714", "text": "I agree that it's a great option if you want it, but I just prefer the gorilla glass. Much easier to not need a screen protector and feels better to use.", "time": "08-15-2017 05:49 PM", "replies": []}]}]}]}]}, {"postID": "post5924375", "text": "Just add glass screen protector problem goes away", "time": "08-15-2017 12:27 PM", "replies": []}, {"postID": "post5924720", "text": "I have not noticed any difference when using my Shattershield screens compared to the Gorilla Glass screen on my work cell phone. They seem about the same on the fingers. It's not like the outer layer is mushy soft. 😀", "time": "08-15-2017 05:59 PM", "replies": []}, {"postID": "post5924770", "text": "everywhere I've seen says not user replaceable", "time": "08-15-2017 07:41 PM", "replies": []}, {"postID": "post5924920", "text": "I just know the Turbo 2 one came off and could easily be replaced, I worked for Verizon at the time. I can't comment on the Z Force.", "time": "08-15-2017 11:33 PM", "replies": []}]}, {"title": "Just picked up AT&amp;T Z2 Force", "thread": [{"postID": "post5924628", "text": "I just picked up the new Z2 Force from my local AT&T store very nice device very surprised how well moto did with this device. Purchased wireless mod back from best buy which work nice and acts as a case/back on the device.\nGoing on my first full day and I am extremely impressed with this device it works better than my S8 plus does.", "time": "08-15-2017 04:05 PM", "replies": []}, {"postID": "post5926437", "text": "i also recently had a S8+ and got the Z2 Force, and I'm very impressed", "time": "08-17-2017 09:32 AM", "replies": []}, {"postID": "post5926757", "text": "Same. Used my JOD on T-Mobile to go from the S8+ to the Z2 Force. Not regretting the decision at all. This is a very underrated device.", "time": "08-17-2017 02:46 PM", "replies": []}, {"postID": "post5926804", "text": "Very underestimated device IMO smooth as butter with no lag at all.", "time": "08-17-2017 03:25 PM", "replies": []}]}, {"title": "Motorola.com: Buy a Z2 Force a Projector Moto Mod for Free", "thread": [{"postID": "post5899596", "text": "Personally i will be waiting for something better to come along as I don't have much of a use for a projector, but it's a decent deal if you want one.http://forums.androidcentral.com/e?l...token=hUo2ZW_A", "time": "07-25-2017 05:49 PM", "replies": []}, {"postID": "post5899632", "text": "http://forums.androidcentral.com/e?l...token=uOMYTeD2https://motorola.rewardpromo.com/", "time": "07-25-2017 06:19 PM", "replies": []}, {"postID": "post5899672", "text": "Cool promotion. But the use of a fulfillment house smacks of a scam. How many people never get the promised rebate or product. Answer: lots.", "time": "07-25-2017 06:58 PM", "replies": [{"postID": "post5899799", "text": "Its legit...I wouldn't worry. The promotion itself isn't all that good. The projector just isn't all that great.", "time": "07-25-2017 09:10 PM", "replies": []}]}, {"postID": "post5924279", "text": "I got my phone and entered in my information and got a Tracking Number on Thursday.\nI went to this site to track the status: https://status.rewardpromo.com/motorola\nNo combination seems to work to get a status update. I get an error.If I call that number it says: The number you have dialed is not in service.\nAnyone know any other ways of getting in touch with them?", "time": "08-15-2017 10:59 AM", "replies": [{"postID": "post5924826", "text": "The right site ends in /MotorolaMobility. For some reason that last word makes a difference for me at least.", "time": "08-15-2017 09:14 PM", "replies": []}]}, {"postID": "post5924821", "text": "that's not the right site. https://status.rewardpromo.com/MotorolaMobility is where you need to go.", "time": "08-15-2017 09:12 PM", "replies": []}]}, {"title": "Moto Z2 Force Camera Reviews", "thread": [{"postID": "post5919868", "text": "Pocket Now (Juan Bagnell):", "time": "08-10-2017 10:03 PM", "replies": []}, {"postID": "post5920380", "text": "That seemed like a balanced review. I like reviews with comparison shots in different lighting conditions. So compare it to last year's Force, Pixel, and this year's S8 and G6 for example.", "time": "08-11-2017 10:42 AM", "replies": []}, {"postID": "post5920621", "text": "I can notice the difference between the 21mp and 12mp and lack of ois between this and last year's.", "time": "08-11-2017 02:27 PM", "replies": [{"postID": "post5920646", "text": "That's probably true. The Z Force 2016 has an underrated camera, although a little slow. Paired with the NX camera app ported from the Pixel, low light shots are very good also.", "time": "08-11-2017 02:58 PM", "replies": []}]}, {"postID": "post5924119", "text": "The 2016 Z force had a DXO rating of 87... Thats in the same league as some top tier 2017 smartphones. I honestly think Motorola took a step in the wrong direction this year.", "time": "08-15-2017 08:31 AM", "replies": []}]}, {"title": "Screen", "thread": [{"postID": "post5920498", "text": "Now that people have the phone in their hands, I'm curious to see what you all think about the screen. Have you picked up scratches already? It's the main thing stopping me from using JOD to go to this phone.", "time": "08-11-2017 12:23 PM", "replies": [{"postID": "post5920514", "text": "I don't have it, but just like last year's, put a screen protector on it or you will get scratches. If you like the feel of glass, put a tempered glass screen protector on it.", "time": "08-11-2017 12:45 PM", "replies": []}]}, {"postID": "post5920558", "text": "i put on the Verizon Flexible Glass Display protector before I even touched the screen. I got it via JOD on Tmo, but took it straight out of the box to the Verizon store and bought their screen protector \nI went to Verizon and got a Verizon branded Flexible Glass Screen Protector.\nI had last years version and I loved it. It was a bit confusing since the website says Tempered Glass, and even the receipt says it.\nHowever I loved last years and this one feels just as nice", "time": "08-11-2017 01:28 PM", "replies": []}, {"postID": "post5920587", "text": "How does it feel compared to a traditional tempered glass screen protector?", "time": "08-11-2017 01:51 PM", "replies": [{"postID": "post5920606", "text": "well i can't answer that, I've never used a tempered glass screen protector. Generally i dont use screen protectors, I only did last year on the Z Force because of Shattershield, and it felt fine. This one feels the same, I dont notice any difference", "time": "08-11-2017 02:11 PM", "replies": []}]}, {"postID": "post5923353", "text": "My son put the sparin glass protector on mine before I even turned it on. I haven't noticed any issues with it being there. If this one scratches too much then I will put the next one on. I do like the looks of the verizon brand because it has cutouts of each of the senors and or speaker and or flash, So the fit might be a little more true if you get it lined up correctly.", "time": "08-14-2017 01:27 PM", "replies": []}, {"postID": "post5923665", "text": "I would up getting it and using the Incipio tempered glass screen protector. I'm pretty pleased with it thus far.", "time": "08-14-2017 06:52 PM", "replies": []}]}, {"title": "Missing Smart Lock - Trusted Places", "thread": [{"postID": "post5922803", "text": "I have a trusted device set up but trusted places is missing... is it just me?", "time": "08-13-2017 10:29 PM", "replies": []}, {"postID": "post5923382", "text": "I have it, on vzw. Check to see how your location settings are configured; is it in high accuracy mode? I have no idea if that's a dependency but it would stand to reason. You're also missing trusted voice, which makes me think this is a broader permissions issue. Also why does trusted face say 'disabled by administrator?' Is your profile not the device administrator?", "time": "08-14-2017 01:50 PM", "replies": []}, {"postID": "post5923399", "text": "Are you using an exchange email though your employer? I had that at first on my new phone. I ended up using Outlook for my exchange email instead of Gmail. Was able to set up home as a safe location this morning, location is set on high accuracy. Can't say if it was changing email or location settings that changed it, but those were the only changes I made. Hope that helps.", "time": "08-14-2017 02:12 PM", "replies": []}]}, {"title": "getting a replacement", "thread": [{"postID": "post5922251", "text": "so my Tmo version and for some odd reason it won't work with Tmo Visual Voicemail.\nI take the sim out, slap it in my Mate 9, visual voicemail works fine.\nTmo had me wipe the cache, reset, all that. They even wiped my voicemail. still wouldnt work.\nT-Force stalled me out the first day, had me try stuff for hours, but on day 2 i complained and they gave me no hassle. shipping out a brand new device, should be here this week", "time": "08-13-2017 10:11 AM", "replies": []}, {"postID": "post5922253", "text": "on the Z2 it wont even activate the visual voicemail, just errors out everytime", "time": "08-13-2017 10:12 AM", "replies": [{"postID": "post5922547", "text": "I was having the same issue with my Moto Z on AT&T. Kept trying to set it up and got the error message every time. Then instead of trying the setup again I just opened the app and the voice mail was set up despite the error messages I was seeing.", "time": "08-13-2017 04:57 PM", "replies": [{"postID": "post5923136", "text": "on Tmo anytime I opened that app it would go right to the setup page and error, no input from me.", "time": "08-14-2017 09:27 AM", "replies": []}]}]}, {"postID": "post5923160", "text": "just got an update, new Z2 Force should be here tomorrow", "time": "08-14-2017 10:04 AM", "replies": []}]}, {"title": "Notification bar question", "thread": [{"postID": "post5922190", "text": "Does anyone know if it is possible to remove the T-Mobile symbol from the notification bar?", "time": "08-13-2017 08:51 AM", "replies": []}, {"postID": "post5922224", "text": "Try: settings/cellular networks/show mobile networks (toggle off).", "time": "08-13-2017 09:31 AM", "replies": [{"postID": "post5922263", "text": "Thanks! Worked like a charm!", "time": "08-13-2017 10:19 AM", "replies": []}]}]}]
[{"title": "Jelly screen scrolling effect?", "thread": [{"postID": "post5921784", "text": "Anyone who has the phone experiencing the \"jelly screen scrolling\" effect?https://www.xda-developers.com/moto-...-developers%29", "time": "08-12-2017 06:58 PM", "replies": []}, {"postID": "post5921795", "text": "Not here.", "time": "08-12-2017 07:06 PM", "replies": []}, {"postID": "post5921833", "text": "No.", "time": "08-12-2017 08:04 PM", "replies": []}, {"postID": "post5921876", "text": "I can hardly see it on the videos. seems like a non issue", "time": "08-12-2017 09:17 PM", "replies": []}, {"postID": "post5921891", "text": "Nope", "time": "08-12-2017 09:50 PM", "replies": []}, {"postID": "post5922252", "text": "nope, my screen is pretty great. i only have the issue with Visual Voicemail that I made a thread about here:https://forums.androidcentral.com/mo...ml#post5922251", "time": "08-13-2017 10:12 AM", "replies": []}]}, {"title": "i made an unboxing video", "thread": [{"postID": "post5920554", "text": "I got my Z2 Force yesterday, made an unboxing video:", "time": "08-11-2017 01:24 PM", "replies": []}, {"postID": "post5920705", "text": "great job", "time": "08-11-2017 04:14 PM", "replies": [{"postID": "post5921923", "text": "hey thanks", "time": "08-12-2017 11:06 PM", "replies": []}]}, {"postID": "post5920845", "text": "Nice. How are you liking the device so far?", "time": "08-11-2017 06:56 PM", "replies": [{"postID": "post5921925", "text": "i really like it. I just got a Huawei Mate 9 last week, which I loved. I pre-ordered the Z2 Force, and I kind of got cold feet after the bad reviews. so i picked up the Mate 9 and i love it, so I thought I would not be impressed by the Moto Z2 Force, but it is pretty great", "time": "08-12-2017 11:08 PM", "replies": []}]}]}, {"title": "Launch day deals?", "thread": [{"postID": "post5918596", "text": "Anyone know of any launch day deals for the verizon z2force. I remeber when zforce came out best buy dd a big 300 off with device payment and jbl soundboost mod.. Verizon deal isnt bad but hate the credit over 24 month thing", "time": "08-09-2017 10:16 PM", "replies": [{"postID": "post5918619", "text": "The Verizon bill-credit deal is currently the best deal, IMO. \nI'd keep waiting..", "time": "08-09-2017 10:48 PM", "replies": []}]}, {"postID": "post5918601", "text": "I'm surprised that Best Buy doesn't have anything good going. Verizon may have a good Labor Day sale and by Black Friday there may be some serious deals.", "time": "08-09-2017 10:25 PM", "replies": [{"postID": "post5919764", "text": "You have a good point! Those holiday/big shopping day sales are great opportunities to showcase new devices.", "time": "08-10-2017 07:57 PM", "replies": []}, {"postID": "post5920392", "text": "Best Buy's Verizon Black Friday deals last year were insane: Pixel $240, Moto Z Droid $120.", "time": "08-11-2017 10:55 AM", "replies": [{"postID": "post5920428", "text": "Why wait til black Friday? if Motorola and Verizon and best buy really wanted my $$$$ they would be having better deals heck by black Friday we will probably have a new phone that makes this one ancient", "time": "08-11-2017 11:19 AM", "replies": [{"postID": "post5921388", "text": "They want your money. \nJust not that bad.", "time": "08-12-2017 11:39 AM", "replies": []}]}]}]}, {"postID": "post5918606", "text": "im surprised too i want to get the z2 but dont know if i should order via vzw site now or wait til the morning to order", "time": "08-09-2017 10:33 PM", "replies": []}, {"postID": "post5919159", "text": "Best Buy was offering a projector mod AND the old version of the JBL Sound Boost if you pre-ordered the Z2 Force. If I had been in serious market for the Z2 Force at the time I think I definitely would have pre-ordered with Best Buy.\nAlas, all they're running now is the projector mod with purchase, and as an owner of the projector mod it's almost worth it. I like steep discounts though. Just not patient with bill credits through Verizon. Commit for two years? No way!", "time": "08-10-2017 11:37 AM", "replies": []}, {"postID": "post5919190", "text": "I forgot to mention when I posted that Best Buy has recently been doing \"Phone Friday\" as of August. Last week they had the iPhone SE on sale for $200 off. Maybe BB is waiting for Phone Friday.", "time": "08-10-2017 12:02 PM", "replies": []}, {"postID": "post5919220", "text": "your right about the bill credits I would rather have the up front discount...", "time": "08-10-2017 12:15 PM", "replies": []}, {"postID": "post5920397", "text": "For anyone on, or thinking of switching to Sprint, Best Buy has a good deal on the Z2 Force.http://forums.androidcentral.com/e?l...token=Ffhz7kSN\nEdit. I don't know why pasting links on the AC mobile app is such a pain, but the deal is easy to find on bestbuy.com", "time": "08-11-2017 11:00 AM", "replies": []}, {"postID": "post5921258", "text": "well just got the newspaper this morning and the ads always come early no deal in the Best Buy ad next week on the Z2 Force only mention of the free projector mod in the ad", "time": "08-12-2017 08:44 AM", "replies": []}, {"postID": "post5921752", "text": "they would have to discount it a few hundred for me to consider it.", "time": "08-12-2017 06:18 PM", "replies": []}]}, {"title": "format internal storage?", "thread": [{"postID": "post5920880", "text": "Is it possible to format the sd card as internal storage?", "time": "08-11-2017 07:37 PM", "replies": []}, {"postID": "post5920948", "text": "not on mine, unfortunately.", "time": "08-11-2017 09:13 PM", "replies": [{"postID": "post5920964", "text": "Same. Was just wondering if it was my SD card or not. Thanks", "time": "08-11-2017 09:35 PM", "replies": []}]}]}, {"title": "Moto Z2 Force Hands-On Reviews, Initial Impressions, Unboxings", "thread": [{"postID": "post5899437", "text": "Daniel put together a nice hands on review for those interested.https://m.androidcentral.com/moto-z2-force", "time": "07-25-2017 03:27 PM", "replies": []}, {"postID": "post5899457", "text": "For early first impressions that seems fair to me.", "time": "07-25-2017 03:51 PM", "replies": []}, {"postID": "post5899607", "text": "Another from mr mobile https://m.androidcentral.com/mrmobil...-moto-z2-force", "time": "07-25-2017 05:56 PM", "replies": []}, {"postID": "post5900808", "text": "The Verge (Chris Welch):", "time": "07-26-2017 04:19 PM", "replies": []}, {"postID": "post5900809", "text": "Mr. Mobile (Michael Fisher):", "time": "07-26-2017 04:19 PM", "replies": []}, {"postID": "post5900813", "text": "Droid-Life (Tim):", "time": "07-26-2017 04:20 PM", "replies": []}, {"postID": "post5900814", "text": "Engadget (Chris Velazco):", "time": "07-26-2017 04:21 PM", "replies": []}, {"postID": "post5900815", "text": "CNet (Scott Stein):", "time": "07-26-2017 04:21 PM", "replies": [{"postID": "post5900831", "text": "I don't frequent CNET. They mix malware with their downloads for a few extra bucks.", "time": "07-26-2017 04:40 PM", "replies": []}]}, {"postID": "post5900816", "text": "9to5Google (Greg Barbosa):", "time": "07-26-2017 04:21 PM", "replies": []}, {"postID": "post5901234", "text": "I think Motorola gave up on trying to compete. They make great hardware, but their designs are trash and the moto mod concept is really holding them back. Motorola phones could be so much more appealing if they tried to compete.", "time": "07-27-2017 01:17 AM", "replies": [{"postID": "post5901745", "text": "The pitched the Z2 Force to all four (five if you count US Cellular) US carriers and they all accepted. This is how you sell to US consumers in 2017. Sounds to me like they're trying to compete versus carrier exclusives, unlocked-only, limited retail.\nThis is the battle for third place in the US.", "time": "07-27-2017 12:27 PM", "replies": [{"postID": "post5901928", "text": "I don't see releasing a mediocre phone on all carriers as competing. I don't understand why Motorola is so good at budget and midrange phones and so bad at flagships.", "time": "07-27-2017 02:58 PM", "replies": [{"postID": "post5914082", "text": "Mike, I don't think you understand what Ry is saying here. The vast majority of the US public buys its phones at carrier stores. If you want to accuse Motorola of not competing it was in 2015 when not a single carrier carried Motorola's flagship. The simple fact is that you have to be in the stores if you want to sell in the US.\nWe get that specs are the overriding factor you consider when buying a phone, and that's fine for you. But the vast majority of the people who go into carrier stores will never know nor care that this phone has a smaller battery than its predecessor. All they will care about is whether the phone will last all day, and most reviews have confirmed that it will.", "time": "08-06-2017 08:48 AM", "replies": []}]}]}]}, {"postID": "post5901754", "text": "Ars Technica (Ron Amadeo): \nsounding like he hates life...", "time": "07-27-2017 12:32 PM", "replies": []}, {"postID": "post5901757", "text": "T-Mobile (AskDes):", "time": "07-27-2017 12:33 PM", "replies": []}, {"postID": "post5901760", "text": "Android Authority (Nirave Gondhia):", "time": "07-27-2017 12:34 PM", "replies": []}, {"postID": "post5901761", "text": "Danny Winget:", "time": "07-27-2017 12:34 PM", "replies": []}, {"postID": "post5901983", "text": "this phone is not mediocre, that is absurd. Battery is smaller than desired, but it is far from mediocre", "time": "07-27-2017 03:54 PM", "replies": [{"postID": "post5901998", "text": "It's definitely mediocre. Poor design, small battery, non-user-replaceable screen that is easy to put deep scratches into, a middle-of-the-road AMOLED display, no headset jack, an average camera, gimmicky fingerprint sensor gesture controls instead of capacitive buttons, no wireless charging, and no water resistance rating. I would rather buy a OnePlus 5 or even the Moto Z2 Play over the Motorola Z2 Force.", "time": "07-27-2017 04:11 PM", "replies": [{"postID": "post5902026", "text": "I obviously haven't used the Z2 Force, but I'm afraid there's a lot of truth there. I can only hope the Z3 is better or I'm likely going Pixel as I don't care for Samsung or LG and the other companies require a fair number of compromises.", "time": "07-27-2017 04:38 PM", "replies": []}]}, {"postID": "post5904659", "text": "I don't think its mediocre but if I were in the market for this phone last years model is a better deal.", "time": "07-29-2017 04:25 PM", "replies": []}]}, {"postID": "post5904842", "text": "Agree it's not mediocre, it's got good specs in terms of SOC and storage, like the design as well. But you are looking at close to $900 plus dollars after tax, if you want a phone with decent battery capacity since you have to get the battery mod. I tend to purchase pretty much every flashing on impulse ( have U11, S8 and XZ premium). I didn't have any impulse feeling to spend $900 on this phone. Waiting for Note 8, iPhone and Pixel now, passing Motorola this time around since don't feel like supporting their braindead decisions.", "time": "07-29-2017 07:06 PM", "replies": []}, {"postID": "post5916653", "text": "Android Authority (Lahn Nguyen):", "time": "08-08-2017 01:07 PM", "replies": []}, {"postID": "post5916655", "text": "Phone Arena (Stephen S.):", "time": "08-08-2017 01:08 PM", "replies": []}, {"postID": "post5916656", "text": "Engadget (Chris Velazco):", "time": "08-08-2017 01:10 PM", "replies": []}, {"postID": "post5916658", "text": "The Verge (Chris Welch):", "time": "08-08-2017 01:10 PM", "replies": []}, {"postID": "post5916660", "text": "Mr. Mobile (Michael Fisher):", "time": "08-08-2017 01:11 PM", "replies": []}, {"postID": "post5916664", "text": "Techno Buffalo (Robert Rosenfeld):", "time": "08-08-2017 01:11 PM", "replies": []}, {"postID": "post5916667", "text": "The Unlockr (David Cogen):", "time": "08-08-2017 01:11 PM", "replies": []}, {"postID": "post5916668", "text": "Pocket Now (Juan Bagnell):", "time": "08-08-2017 01:12 PM", "replies": []}, {"postID": "post5916670", "text": "9to5Google:", "time": "08-08-2017 01:12 PM", "replies": []}, {"postID": "post5916671", "text": "Myriam Joire:", "time": "08-08-2017 01:12 PM", "replies": []}, {"postID": "post5919457", "text": "I checked it out at Verizon but didn't learn much since the Hasselblad was attached to it and they were unwilling/unable to take it off. So I didn't get a feel for it. I didn't like the way the Shattershield felt on the edges of the screen and around the fingerprint sensor, but with a screen protector on it, I doubt it would be an issue. I couldn't test the native camera app and the Hasselblad wouldn't even work for whatever reason.", "time": "08-10-2017 02:37 PM", "replies": []}]}, {"title": "What I learned from the Moto Z2 Force Reviews", "thread": [{"postID": "post5912418", "text": "After reading many Moto Z2 Force reviews online I was disappointed. Many of them were negative but that wasn’t what made me disappointed. What made me disappointed was the lack of diversity among those tasked with writing reviews and their lack of inquisitiveness.\nI couldn't find an online review written by a female. I’m sure women buy smartphones as often as men do. There was also not much diversity in age. I'm sure that smartphones are used by people of all ages. The narrow perspective is disappointing.\nMany of them complained about things they didn't like but didn't inquire about why a decision was made. I'm glad some of them asked those questions but I wish more of them did. Maybe the company will just give marketing spin as an answer but at least it gives more insight.\nFor example, many of them complained about the lack of a headphone jack. They realized that the Moto Z2 Play includes a headphone jack and is just a hair thinner than the Z2 Force. Perhaps Motorola opted not to include it because they think wireless audio or digital output is the direction of the industry. Perhaps they wanted to use that space for some other component in the screen. All they had to do was ask...\nAnother thing I found puzzling was how some of them viewed Moto Mods. It’s okay if the reviewers think the current mods are too expensive or the mods are not useful for them. But the Z series phones were designed with mods in mind. That is why they have keep the same shape, have the exposed connector pins and why the camera is raised. If they take some time to understand the \"Moto Mod\" platform and understand it at a basic level they are really not able to give a thoughtful review.\nI hope in the future there will be a more diverse set of reviewers and more inquiring of why product design decisions were made. Then there will be different use cases and viewpoints presented that can give the readers more insight when determining which phone to buy.", "time": "08-04-2017 02:19 PM", "replies": [{"postID": "post5917712", "text": "Oh god not the PC police.. There are tons of females that review phones, you obviously didn't look hard enough", "time": "08-09-2017 09:28 AM", "replies": []}]}, {"postID": "post5912471", "text": "The primary issue that led to the negative reviews was the retail price. If the phone was $650 or less, the reviews probably would have had a different conclusion, more similar to the reviews of the Z2 Play. From those reviews, the Z2 Force seems to be a decent phone, but at $720 (or higher -- $810 at AT&T), it does not make enough sense. If a person likes Moto and/or likes the idea of the mods and the cost is not an issue it seems like a good phone. If they do not sell like Moto would like and the price comes down, the Z2 Force may be one of the better phones at its price point. The standard battery life, although it seemed better than expected by the reviewers, and the camera will be its weakest points.\nI will try it out when released. Hopefully, Moto/Lenovo will provide regular updates, although their track record has not been good.", "time": "08-04-2017 03:32 PM", "replies": []}, {"postID": "post5912641", "text": "Why did they downsize the battery!", "time": "08-04-2017 07:23 PM", "replies": [{"postID": "post5912724", "text": "To sell more battery mods.", "time": "08-04-2017 08:43 PM", "replies": []}]}, {"postID": "post5912741", "text": "To make it thinner. if someone wants to add more battery they can but battery life is supposed to allow most users a full day. Not everyone wants a thick heavy phone. Some people wouldn't mind a 5000mAh internal battery on a flagship but perhaps there's a reason why most manufacturers aren't doing that.\nMost people go into a store to try a phone and they pick it up and feel it. Size, weight, texture, appearance is what they notice and I guess bricks don't sell so well.", "time": "08-04-2017 09:14 PM", "replies": []}, {"postID": "post5914474", "text": "I really wanted this phone. Then they downgraded the battery 2730mamp. The shattershield can be scratched with fingernail. They dropped the price to 720.00. So if you purchase the battery it's over 800.00. As much as I wanted this phone I guess I'll take a pass!", "time": "08-06-2017 03:15 PM", "replies": []}, {"postID": "post5914755", "text": "I have a Z for a work phone and a Z Force for a personal phone. I like using the Z for the lightness. I like my Force for the battery. If I didn't need the memory I'd be happy to stay with the current Force. That being said, bringing it to all carriers it makes sense to have most of the best of both worlds. It would be nice to have at least 3000mAh. Turbo charger and battery mod, I can get by.", "time": "08-06-2017 09:48 PM", "replies": []}, {"postID": "post5916999", "text": "I don't understand the negativity as well. Most of the reviews I seen placed the battery life slightly better than the galaxy s8. I also think the mods make this phone very practical. With the small/thin size of the phone, the mods won't add an extreme amount of bulk to the device.", "time": "08-08-2017 07:11 PM", "replies": []}]}, {"title": "Will you get the Moto Z Force 2?", "thread": [{"postID": "post5897959", "text": "I will be honest... I probably won't get this unless it gets great battery life which is unlikely due to the smallish battery. \nWith that said, i might pick one up if i can get one for a great deal, and use a mod...\nWhat about you?", "time": "07-24-2017 02:55 PM", "replies": []}, {"postID": "post5897979", "text": "If I find a great deal, yes. For my young children the reassurance of the screen being more durable is great. But at full price, can't do it.", "time": "07-24-2017 03:15 PM", "replies": []}, {"postID": "post5898761", "text": "I've been waiting for a phone that's more appealing to me than my Galaxy S7 to upgrade. I'm glad the new Moto Z will be offered on AT&T.", "time": "07-25-2017 05:32 AM", "replies": []}, {"postID": "post5898881", "text": "No. I don't want to use a mod to get all day battery life.", "time": "07-25-2017 08:03 AM", "replies": []}, {"postID": "post5899117", "text": "i will get it on T-Mobile if JOD does not have a down payment", "time": "07-25-2017 10:51 AM", "replies": []}, {"postID": "post5899532", "text": "I haven't owned a flagship phone in ages. Im currently on a moto G4 plus which I like, but has a cracked screen (still fully functional though). Before this I had purchased a refurbished Samsung Galaxy S5, which I loved, but somewhat ironically died via water damage (3rd party case wasn't installed properly and broke the water seal).\nI had been following the z2 force for some time and I was sure this would be the phone I would splurge for. The shatter proof screen, long battery life, and dual cameras were my main focuses.\nBut now ? Crappy battery life. Not waterproof (I think?). No headphone jack. This is not the phone I wanted at all. I could care less about the stupid mods.\nI will stick it out and wait for the next generation of phones to come out I guess. Sorry Moto but you blew it in my eyes.", "time": "07-25-2017 04:55 PM", "replies": [{"postID": "post5899671", "text": "No phones are waterproof and Moto phones were among the first to be water resistant. The Z2 does carry the same protection as prior models, which is a nanocoating on the components. Just like every other phone in the world, prudent users are going to avoid intentional contact with liquids.", "time": "07-25-2017 06:58 PM", "replies": [{"postID": "post5899688", "text": "No phones are 100% water proof but there are phones on the market like the galaxy s8 which offer better water resistance. Hell even the old galaxy s5 and Sony Xperia offered better water resistance. One of the drawbacks of having a removable battery was that it limited a phone's water resistance capabilities. Well this z2 force has no removable battery, no headphone jack, yet the best they can do is \"nano coating\"? Really ?", "time": "07-25-2017 07:13 PM", "replies": [{"postID": "post5899731", "text": "Do they want people swapping mods on wet phones?", "time": "07-25-2017 07:55 PM", "replies": [{"postID": "post5899740", "text": "No. And they probably don't want people having good battery life without the mods either.", "time": "07-25-2017 08:03 PM", "replies": []}]}]}]}]}, {"postID": "post5899634", "text": "I'll probably get it, but not right away.", "time": "07-25-2017 06:22 PM", "replies": []}, {"postID": "post5899745", "text": "Moto hasn't had a problem with battery life since at least 2013. mAh isn't how they do it. At least not alone.", "time": "07-25-2017 08:11 PM", "replies": [{"postID": "post5900155", "text": "The Moto X Pure didn't have a good battery life, then it also had the 808 so you can blame it on the processor.\nOn a general note, manufactures should really put a larger battery than trying to R&D on aesthetics. Or work on Google on OS optimizations, like iOS optimizes battery life and sleeping apps.", "time": "07-26-2017 06:46 AM", "replies": [{"postID": "post5900157", "text": "I guess I didn't get to use mine that long, but mine was totally acceptable.", "time": "07-26-2017 06:48 AM", "replies": [{"postID": "post5900172", "text": "I didn't keep mine for long either, probably a month or so. I didn't manage to squeeze more than 3 hours of SOT on moderate to heavy usage. Though, I did like the phone's features a lot, definitely one of the best phones on my list (N6P, S7E and S8+).\nEdit: Clarified comment about not keeping long.", "time": "07-26-2017 06:58 AM", "replies": [{"postID": "post5900175", "text": "Wow that is bad, I wouldn't have been ok with that.", "time": "07-26-2017 06:58 AM", "replies": []}]}]}]}]}, {"postID": "post5899794", "text": "Honestly this wasn't the phone for me to begin with since it doesn't offer much I can't get elsewhere and I don't need mods. Cutting the battery down in size was the wrong direction for me and just adds to the reasons I won't buy this phone. Sadly I was a long time customer of Moto until about a year and a half ago.", "time": "07-25-2017 09:08 PM", "replies": []}, {"postID": "post5900039", "text": "My best guess as to why they slimmed down there Z Force 2 and Z2 Play is because they were too thick and heavy to realistically use with Moto mods on an all day basis. So they made them both thinner in the hope of customers purchasing more mods to go with them.\nThis is why I purchased the Moto Z Droid. It just made sense to me to get the thinner phone if I was going to purchase a modular phone and then add mods. If I wasn't going to use any mods, then why get this type of phone to start with.\nThat said, the only one I've really used is the battery mod, which I leave on 24/7. Definitely doable with the thin Moto Z.", "time": "07-26-2017 02:33 AM", "replies": []}, {"postID": "post5900050", "text": "I don't see the option to pre order the non carrier unlocked version on Motorola.com\nWhat's the story with it, are they not selling the non carrier version at launch?", "time": "07-26-2017 02:56 AM", "replies": []}, {"postID": "post5900339", "text": "The lack of water resistance is hard to understand since everyone else is able to do it (the new X is rumored to have it), and these phones are supposed to be tough, shatter proof, etc. I don't get it.\nThe battery is a problem too. \nWe will see how this, and the mods, sell.", "time": "07-26-2017 09:42 AM", "replies": []}, {"postID": "post5900587", "text": "My top two priorities for a phone are battery and camera. The Force Z2 is underwhelming on both counts.", "time": "07-26-2017 01:16 PM", "replies": [{"postID": "post5900649", "text": "Have photo samples gone up yet?", "time": "07-26-2017 02:07 PM", "replies": [{"postID": "post5900731", "text": "To be fair, nothing in-depth has come out yet. So we'll have to wait to see what the two camera set-up produces beyond the gimmicky depth of field shots.", "time": "07-26-2017 03:02 PM", "replies": []}, {"postID": "post5900750", "text": "f2.0 aperture with no OIS and 12MP.\nDon't need to see them to know low light photos will be blurry and noisy. This is 3 year old technology.", "time": "07-26-2017 03:16 PM", "replies": [{"postID": "post5900761", "text": "I agree with this.", "time": "07-26-2017 03:30 PM", "replies": []}]}]}, {"postID": "post5904666", "text": "Why do we need to buy a mod to make up for poor battery life?", "time": "07-29-2017 04:30 PM", "replies": []}]}, {"postID": "post5900791", "text": "Not a large sensor size either. Unless the two cameras work together to improve image quality.", "time": "07-26-2017 04:03 PM", "replies": []}, {"postID": "post5900804", "text": "I truly considered this phone, but it seems like a step down in many ways. I'm honestly disappointed in the specs. I really am.", "time": "07-26-2017 04:16 PM", "replies": []}, {"postID": "post5901568", "text": "Seems more like a circa 2015 phone.", "time": "07-27-2017 09:40 AM", "replies": []}, {"postID": "post5901819", "text": "I was actually considering getting this a couple months ago when I heard T-Mobile would be carrying it. Was gonna use my jump from the S8+ to it. Heard so many good things about last year's model and the mods are what really intrigued me including the projector and the gaming one coming out later this year. Now reading about the specs I've changed my mind. A 2750mAH battery down from 3500mAH, 4GB of RAM(Chinese model has 6GB) and only 64GB internal storage(Chinese model has 128GB). Plus no real water resistance. And they want to charge people $700 for it? No thanks. The battery is probably the deal breaker for me. If they had kept it at 3500 I would have probably got it anyways despite the other downgrades. Oh but hey, you can buy the battery mod for $80 and double your battery life. Great! Now I can't use any other mod if I want adequate battery life. \nI think this is a missed opportunity by Lenovo with the phone now being available on all the major carriers.", "time": "07-27-2017 01:26 PM", "replies": [{"postID": "post5901862", "text": "They didn't remove the headphone jack. The first Moto Z Force didn't have one either.", "time": "07-27-2017 01:55 PM", "replies": [{"postID": "post5901903", "text": "My bad. I edited my comment. I got confused with the other Motorola Z phone that uses mods and has the headphone jack.", "time": "07-27-2017 02:37 PM", "replies": []}]}]}, {"postID": "post5905376", "text": "How is the battery life? Do we have good reviews on that front?", "time": "07-30-2017 09:24 AM", "replies": []}, {"postID": "post5905814", "text": "I ordered one on VZW because I am on unlimited data and the price was $360 and a free projector mod.", "time": "07-30-2017 04:26 PM", "replies": [{"postID": "post5906608", "text": "that is such a great deal, it is crazy", "time": "07-31-2017 09:20 AM", "replies": [{"postID": "post5906927", "text": "The only thing not great about it is that it is a device credit and if you pay it off early you'll end up paying the remaining months at full price.", "time": "07-31-2017 01:27 PM", "replies": []}]}]}, {"postID": "post5908794", "text": "Moto devices have intrigued me off and on for a while now. Who knows at this point! If I could have two or even three daily drivers, I'd be set haha. They look great though. Hope they do well this year!", "time": "08-01-2017 09:55 PM", "replies": [{"postID": "post5910655", "text": "There's a 12 step program", "time": "08-03-2017 08:48 AM", "replies": []}]}, {"postID": "post5910772", "text": "The reviews are pretty brutal so far. You have the screen that scratches, although Moto said the review units are not like the consumer units. You have a slow camera with issues in low light because of no OIS. The battery is actually a little better than expected given its capacity. The lack of a real water resistance rating is getting old. The lack of a headphone jack, that's the way they're going. Maybe by Black Friday there will be some great deals and perhaps a little improvement software wise with the camera, although that's probably wishful thinking.", "time": "08-03-2017 10:10 AM", "replies": []}]}, {"title": "The plastic lens is not user replaceable", "thread": [{"postID": "post5899311", "text": "Last year, moto let you replace the plastic lens, but this year the plastic lens is not user replaceable. You can send it into Motorola to get it replaced though...\nTo clarify, the plastic lens is essentially a plastic screen protector that is the top layer of the display on the z2 Force.", "time": "07-25-2017 01:21 PM", "replies": [{"postID": "post5904670", "text": "That's really bad.... Just hope people buying it know to put a protector on it on it. In all honesty Gorilla Glass 5 is poor against scratches as well. I made the mistake of taking my screen protector off thinking my V20 screen would be as tuff as my Droid Maxx....boy was I wrong.", "time": "07-29-2017 04:34 PM", "replies": [{"postID": "post5904723", "text": "I can guarantee you that the moto z2 Force screen will scratch much much easier than a phone with gorilla Glass 5. Of course somerh small like sand would still scratch gg5.", "time": "07-29-2017 05:27 PM", "replies": [{"postID": "post5904729", "text": "My V20 had a scratch that you can feel 1 week after removing the screenand it wasn't from a drop. There were also fine scratches that buff out and return after touching so those are in the oleophobic coating. I realize the shatter shield is much easier to scratch and it was a major reason I stayed away from purchasing anything Moto with it.", "time": "07-29-2017 05:31 PM", "replies": []}]}]}]}, {"postID": "post5899639", "text": "Don't use it until you get a protector on it. \nJust like the first Moto Z Force.", "time": "07-25-2017 06:24 PM", "replies": []}, {"postID": "post5904839", "text": "I would put a screen protector on a phone anyway so it's not a big deal to me.", "time": "07-29-2017 07:05 PM", "replies": []}, {"postID": "post5905838", "text": "I find it easier to have screen protectors on my phone, better to be safe than sorry. I also havr cases on mine, but I'm not 100% sure whether my V20 needs one.", "time": "07-30-2017 04:40 PM", "replies": []}]}, {"title": "Moto Z2 Force Edition full specs", "thread": [{"postID": "post5899178", "text": "Android Central released the full specs for Z2 Forcehttps://m.androidcentral.com/moto-z2...-edition-specs\nOperating SystemAndroid 7.1.1 Nougat\nDisplay5.5-inch 1440p Super AMOLED\nShatterShield shatterproof display\nProcessorQualcomm Snapdragon 835 octa-core\nGPUAdreno 540\nRAM4GB (U.S.) \n6GB (ROW)\nStorage64GB (U.S.) \n128GB (China)\nExpandableYes, up to 2TB\nBattery2730mAh\nChargingUSB-C \n15W TurboPower fast charging\nWater resistanceWater-repellent nano-coating \nNot waterproof\nRear Camera 112MP (1.25µm pixels) color sensor \nf/2.0, PDAF \nlaser-assisted autofocus\nRear Camera 212MP (1.25µm pixels) monochrome sensor \nf/2.0, PDAF \nlaser-assisted autofocus\nFront Camera5MP f/2.2 \n85-degree wide-angle lens\nFront-facing dual-tone flash\nConnectivityGigabit LTE (X16 baseband) \n802.11 a/b/g/n/ac dual-band \nBluetooth 5.0 (after Android O update) \nMoto Mods support\nSecurityOne-touch front fingerprint sensor\nSIMNano-SIM slot\nNetworkU.S. unlocked (AT&T / T-Mobile): LTE: B1, 2, 3, 4, 5, 7, 8, 12, 17, 20, 25, 26, 28, 29, 30, 38, 40, 41-Japan & China, 66, 252, 255 \nU.S. Sprint: CDMA: BC 0, 1, 10 LTE: B1, 2, 3, 4, 5, 7, 8, 12, 17, 20, 25, 26, 28, 29, 30, 38, 40, 41-Japan & China, 66, 252, 255 \nU.S. Verizon & US Cellular: CDMA: BC 0, 1 LTE: B1, 2, 3, 4, 5, 7, 8, 12, 13, 17, 20, 25, 26, 28, 66 \nROW: CDMA: BC 0, 1, 10 LTE: B1, 2, 3, 4, 5, 7, 8, 12, 17, 18, 19, 20, 26, 28, 34, 38, 39, 40, 41-Japan & China TD-SCDMA: BC34, 39\nDimensions155.8 x 76 x 6.1 mm\nWeight143 g\nColorsSuper Black \nFine Gold \nLunar Grey (T-Mobile-only)", "time": "07-25-2017 11:36 AM", "replies": [{"postID": "post5900590", "text": "This is a typo. The camera is a dual lens with 12 MP on both lenses.\nUnfortunately, the lack of optical image stabilization is not a typo.", "time": "07-26-2017 01:19 PM", "replies": []}]}, {"postID": "post5899192", "text": "Impressive but the screen is too small for me. Like the concept of\nthe mods but the only thing I'm interested in is the projector. Battery is a no go. Anemic. \nLove what they're doing just wish I could be more enthusiastic about the actual product. Want as many viable competitors e/Samsung as possible.", "time": "07-25-2017 11:46 AM", "replies": [{"postID": "post5904661", "text": "The projector is not that great.", "time": "07-29-2017 04:26 PM", "replies": []}]}, {"postID": "post5899197", "text": "Small battery, no real water protection, no headphone jack and an $800 price tag. Disappointed to say the least.", "time": "07-25-2017 11:52 AM", "replies": [{"postID": "post5900640", "text": "Small battery so you buy the battery add on.", "time": "07-26-2017 02:04 PM", "replies": [{"postID": "post5900685", "text": "You buy the battery pack and then are prevented from using the camera mod. That's a no go.", "time": "07-26-2017 02:29 PM", "replies": []}]}]}, {"postID": "post5899200", "text": "Postscript: the weight is 143 g while the S8 is 173. Not a hugh difference. I imagine with certain mods we're talking a couple of pounds (exaggeration). I personally don't mind the extra heft and weight but I expect alot of consumers will.", "time": "07-25-2017 11:57 AM", "replies": []}, {"postID": "post5900565", "text": "I wonder if the TurboPower 30 will charge this faster.", "time": "07-26-2017 12:57 PM", "replies": []}, {"postID": "post5900647", "text": "I believe the rear camera is Sony IMX 386 (12 MP, 1/2.9\" RGB and Monochrome sensors, 1.25µm pixel size)", "time": "07-26-2017 02:06 PM", "replies": [{"postID": "post5900753", "text": "Yes, 2014 is calling and they want their camera back.", "time": "07-26-2017 03:17 PM", "replies": [{"postID": "post5900795", "text": "Who was using a dual setup with similar specs in 2014?", "time": "07-26-2017 04:08 PM", "replies": [{"postID": "post5900824", "text": "I am referring to 12MP, f2.0, and no OIS.", "time": "07-26-2017 04:32 PM", "replies": []}]}]}]}, {"postID": "post5900732", "text": "Without OIS they better have awesome EIS like the Pixels do. It will need better processing overall to compete with other flagship phones.", "time": "07-26-2017 03:04 PM", "replies": []}, {"postID": "post5901512", "text": "isn't the Sony IMX 386 the same camera that is in the Pixel that everyone loveS?", "time": "07-27-2017 08:58 AM", "replies": [{"postID": "post5901686", "text": "It is a different sensor. Pixel uses a 378 which uses a larger sensor and has larger pixels. Plus the Pixel camera has outstanding processing. We'll see how the Z2 Force does. I think the Z Force 2016 camera, while not the best, is very good at least.", "time": "07-27-2017 11:46 AM", "replies": []}]}, {"postID": "post5901991", "text": "to be clear, I know jack about cameras. I had the Z Force, and i actually wasn't crazy about it. I liked the V20 and S8+ better, but at the time, the Z Force scored very high on DXO (this was before everyone hated them due to One Plus):https://www.digitaltrends.com/photog...-moto-z-force/", "time": "07-27-2017 04:02 PM", "replies": []}]}, {"title": "The Additional Expenses with a Moto Z2 Force", "thread": [{"postID": "post5901711", "text": "Disclosure: I've used Moto phones for the past seven years. Current phone is a Droid Turbo 1 which is still peforming well although it has battery charging fatigue and I sometimes can't get through a whole day anymore. \nI almost bought a Moto Z Force Droid and I really wanted to like the Moto Z2 Force. \nLooking at this forum and knowing what I know from reading the Z Force forum, here are some things I figure someone would need to buy to bring this thing up to flagship status. \n1. Battery pack mod. Moto put a 2,730 mAh battery in the Z2 Force, down from the 3,500 mAH battery in the original Force Z. So I'd need a battery mod to get through a whole day. Since I have a Tylt wireless charger, I'd want one that could charge wirelessly. Either the Tumi or the Incipio. That's an additional expense of $89 or $99 depending on which was purchased.\n2. Screen Protector. It's ironic that the Z2 Force comes with a shatterproof screen that is also easily scratched. The flexible glass protector from Verizon is frequently cited as the one to get, so that's another $24.99.\n3. USB-C headphones. Technically not needed if I use the dongle adapter included but hey, eventually I'm going to need USB-C headphones so that's another $29 to $39.\n4. Style shell back. Maybe I think the Z2 Force is too thin and hard to handle or I want to protect the protruding camera lens housing. Or I want to change the look of the phone when the battery mod is not installed. Better get a style shell back. That's $19.99 or $24.99. I could get the wireless charging back from Moto for $39.99.\nSo, let's see...that's an additional $163 to $202 extra to bring this phone up to speed. If I only opted for the battery pack mod and a screen protector that's another $125 extra.", "time": "07-27-2017 12:06 PM", "replies": []}, {"postID": "post5901741", "text": "What accessories did you buy for your DROID TURBO?", "time": "07-27-2017 12:22 PM", "replies": [{"postID": "post5901746", "text": "Two cases. One was a Tudia case, I think it was $12.99, the other was minimal bumper case, $4.99. I'm still using the minimal case. I got the Tylt wireless charger as a Christmas gift and I use it primarily for my Nexus tablet. I've used it for my Turbo less than a dozen times.", "time": "07-27-2017 12:27 PM", "replies": []}]}, {"postID": "post5902750", "text": "For my Z Force I have bought both moto nylon style shells, an incipio one, the car dock, the projector and mophie mod.\nI will be getting the game pad, wireless charge style shell, and probably other style shells. \nBut I am also keeping my Z Force in case the new one doesnt work as well.", "time": "07-28-2017 08:01 AM", "replies": [{"postID": "post5902827", "text": "i have my old Incipio with wireless and the original JBL speaker mod. I'll probably pick up a wireless charge shell, and just keep my eyes out for any sales.\nIn a world without removeable batteries, having a battery mod is next best thing (maybe even better)", "time": "07-28-2017 09:07 AM", "replies": []}]}, {"postID": "post5903794", "text": "Re 1: While it's likely to be nice to have a battery mod, improved efficiency may mean the smaller battery doesn't result in a proportionally shorter battery life. Time will tell. The Tumi wireless battery pack is currently $60 from Verizon.\nRe 2: It probably won't take long for Amazon to have some pretty decent screen protectors for more like $10 for 2, but anyone buying on or really near launch day will probably need the $25 Verizon one. BTW, don't put too much value in a \"lifetime warranty\" on a screen protector. They'll charge you $10 shipping for replacements, so you'll be paying basically the same money you would for a new one (or pair, possibly) from Amazon anyway. The warranty is a gimmick IMO.\nRe 3: I don't think I'd bother with USB-C headphones, personally. You can get extra USB-C to 3.5mm adapters on Amazon pretty cheap, so just buy a few & put them with your fav headphones you already have and convert them. If you need new headphones anyway, you might go USB-C, but it might be just as well to go Bluetooth. The USB-C headphones won't work with a lot of other audio equipment, so it's a pretty specialized purchase.\nRe 4: You should be able to find the Incipio style shells for more like $10. Just depends on what you like & how much you want to spend.", "time": "07-29-2017 12:35 AM", "replies": []}]}, {"title": "moto going in the wrong direction.", "thread": [{"postID": "post5901964", "text": "Am I the only one who just wants a droid turbo with sd835, usb-c,fingerprint scanner, and waterproof?\nreally not that much to ask..\ninstead we get a phone I don't even consider close to ugprade worthy from my 2014 phone, its a downgrade in many aspects to me.\nand not sure what they made the droid turbos screen out of.. but the thing is the only phone I havent used with a screen protector+case and its like flawless still.. drop the thing all the time.", "time": "07-27-2017 03:38 PM", "replies": [{"postID": "post5901987", "text": "Another Droid Turbo owner here. I want a big battery, a fingerprint scanner and a camera with OIS and f1.7 lens. Waterproofing would be nice but it does not concern me too much. An SD card slot would be fine, but if the phone came with 128 GB I wouldn't need it. As it is my 64GB phone isn't full yet after almost three years.\nMy Turbo's gorilla glass 3 screen is flawless. No scratches, chips, or defects on it. I don't have a screen protector.\nIf I could get an OEM 3,900 mAh battery that I knew would be as good as my battery was three years ago I'd probably install it and go another 2 years with it.\nI'm severely disappointed in the Moto Z2 Force. Guess I will be looking at Pixel 2 and Note 8. They are true flagships.", "time": "07-27-2017 03:57 PM", "replies": []}, {"postID": "post5902417", "text": "..it has three of the four things you asked for.", "time": "07-27-2017 11:16 PM", "replies": [{"postID": "post5902526", "text": "He wants those things in a Droid Turbo", "time": "07-28-2017 02:04 AM", "replies": [{"postID": "post5902890", "text": "No, he wants all of those things on a new flagship from Moto.", "time": "07-28-2017 10:20 AM", "replies": []}]}]}]}, {"postID": "post5902074", "text": "I thought about buying a replacement battery online and installing it in my droid turbo, but I was worried about quality too.\nz2 force is off the table for me, which sucks because it was my front runner.\nI am waiting on pixel 2 or nokia 8 if it comes to verizon", "time": "07-27-2017 04:59 PM", "replies": []}, {"postID": "post5902346", "text": "It's unfortunate that Motorola is releasing half-hearted flagship efforts. There was a time when they made the best flagship Android phone on the market. Now they just can't be bothered", "time": "07-27-2017 09:44 PM", "replies": []}]}, {"title": "Z2 Force getting BT 5.0 when Android O released", "thread": [{"postID": "post5899838", "text": "Just noticed this little info about BT. Says it has 4.2 out of the box but will get 5.0 after the O update.", "time": "07-25-2017 10:00 PM", "replies": []}, {"postID": "post5900364", "text": "good find", "time": "07-26-2017 10:03 AM", "replies": []}, {"postID": "post5901100", "text": "Interesting find. And mentioning O already is a good sign.", "time": "07-26-2017 10:01 PM", "replies": []}]}, {"title": "US version with lower specs than international... why?", "thread": [{"postID": "post5899697", "text": "I read that the US version will ship with weaker specs than the international version. Why ? Why not release the higher end version in the US as the top tier phone ? (Z2 force plus)\nDoes anyone know if it would be possible to buy the international version and activate it in the US?", "time": "07-25-2017 07:20 PM", "replies": []}, {"postID": "post5899733", "text": "If it supports the correct bands, I don't see why not.\nI have not looked admittedly into the details, as to what differs but it wouldn't surprise me if one with less bands was available for the reason that it could be actually forced to be an exclusive on a specific network, because it simply won't work fully or even at all on the services provided by another.\nCertainly that is the case now with some devices, that they only operate on some providers.", "time": "07-25-2017 07:59 PM", "replies": []}]}, {"title": "All four major USA carriers will carry the Z2 Force", "thread": [{"postID": "post5898041", "text": "According to Evan Blass, the Z2 Force will be available on all four major USA carriers! Great news for those outside of Verizon who want a shatter proof screen.https://", "time": "07-24-2017 04:06 PM", "replies": []}, {"postID": "post5898494", "text": "good for moto/lenovo !", "time": "07-24-2017 09:57 PM", "replies": []}, {"postID": "post5898497", "text": "This is awesome news! Thank you for sharing!", "time": "07-24-2017 10:01 PM", "replies": []}, {"postID": "post5898519", "text": "Screen can still shatter, it's just far more durable than most and feels like plastic instead of glass. Personally disappointed they shrunk the battery down.", "time": "07-24-2017 10:18 PM", "replies": []}, {"postID": "post5899646", "text": "That's how you sell phones in the US.", "time": "07-25-2017 06:28 PM", "replies": []}]}, {"title": "T-Mobile is going all in with deals for the Moto Z2 Force", "thread": [{"postID": "post5899109", "text": "Pre-order is up:https://www.t-mobile.com/cell-phone/motorola-moto-z-force-edition-2nd-gen\nblog post:https://newsroom.t-mobile.com/news-a...ile-aug-10.htm\nGot a buy one get one free promo (with added line)\nI'm waiting to hear JOD pricing", "time": "07-25-2017 10:46 AM", "replies": []}]}]
