[{"title": "Photos taken with your P20 Pro", "thread": [{"postID": "post6212915", "text": "Some lucky people should be recieving their new toys in the next day or two. Looking forward to seeing photos taken with those amazing camera's. Please post them here for us to see.", "time": "04-04-2018 01:23 AM", "replies": []}, {"postID": "post6212931", "text": "And P20 Pro have very good camer, but still have some problems. Plese if you recive some new update ples post here or open new thread.", "time": "04-04-2018 01:49 AM", "replies": []}, {"postID": "post6214006", "text": "I can't wait, I will be sure to post some pictures.", "time": "04-05-2018 03:48 AM", "replies": []}, {"postID": "post6215210", "text": "Well, here's a rather disturbing one of me with the selfie camera to start with...", "time": "04-06-2018 09:38 AM", "replies": []}, {"postID": "post6215359", "text": "Only three pics taken so far. \nTo test out the zoom feature I stood at my front door and took all 3 standing in the same spot. One with no zoom, one at 3x one at 5x. \nI live on a new build estate hence the housing developer flags showing ha. There's lots still being built behind me so that's why there's still a sales office and flags!\nPretty good, I reckon!", "time": "04-06-2018 12:09 PM", "replies": [{"postID": "post6215402", "text": "That zoom is crazy good. Where in the country are you? England?", "time": "04-06-2018 12:29 PM", "replies": [{"postID": "post6215478", "text": "Indeed I am.", "time": "04-06-2018 01:51 PM", "replies": []}]}]}, {"postID": "post6215414", "text": "The zoom is awesome. It will take some time to get used to actually using a phone zoom again.", "time": "04-06-2018 12:47 PM", "replies": []}, {"postID": "post6215626", "text": "Low light now it's dark here in the UK. \nTest compared to iPhone X.\niPhone X shot:\nP20 Pro shot (night mode):\nThe night mode on this is truly great.", "time": "04-06-2018 04:09 PM", "replies": []}, {"postID": "post6215652", "text": "This was in a very dark spot. My honor 8 would have been a blurry noisy mess!\n(this wasn't even night mode, it was just auto)", "time": "04-06-2018 04:39 PM", "replies": []}, {"postID": "post6215714", "text": "Lowlight mode at around quarter past 8 PM. (sunset at around half past 7) I am impressed.", "time": "04-06-2018 06:43 PM", "replies": [{"postID": "post6216261", "text": "Great photo. Humber Bridge from Hessle Foreshore?", "time": "04-08-2018 02:14 PM", "replies": [{"postID": "post6217415", "text": "Yes, love the view of that bridge.", "time": "04-09-2018 06:18 PM", "replies": []}]}]}, {"postID": "post6215715", "text": "First one, auto.\nSecond, night shot.\nThird one, 5x zoom (obviously not the same scene )", "time": "04-06-2018 06:43 PM", "replies": []}, {"postID": "post6216267", "text": "Point and shoot.", "time": "04-08-2018 02:24 PM", "replies": []}, {"postID": "post6216776", "text": "are you all using the camera with AI turned on ?\nanyone tried out pro mode yet?", "time": "04-09-2018 03:19 AM", "replies": []}, {"postID": "post6216891", "text": "Some zoom examples.\nSo impressed with the capabilities here.\nNo zoom:\n3 x zoom:\n5 x zoom:\nNo zoom:\n3 x zoom:\n5 x zoom:\nI love playing with this setting!", "time": "04-09-2018 07:39 AM", "replies": [{"postID": "post6216922", "text": "I can't believe how much detail is preserved even right up to 5x", "time": "04-09-2018 08:41 AM", "replies": [{"postID": "post6216960", "text": "Crazy isn't it?", "time": "04-09-2018 09:24 AM", "replies": []}]}]}, {"postID": "post6216893", "text": "Wow that camera is awsome.", "time": "04-09-2018 07:40 AM", "replies": []}, {"postID": "post6216994", "text": "Can the 3x/5x be used in conjunction with night mode?", "time": "04-09-2018 10:07 AM", "replies": [{"postID": "post6217018", "text": "It doesn't have the dedicated zoom button in night shot, nor HDR and some of the other modes. Just the normal pinch to zoom function which is essentially just cropping.", "time": "04-09-2018 10:37 AM", "replies": []}]}, {"postID": "post6217020", "text": "Mother's dog.", "time": "04-09-2018 10:37 AM", "replies": []}, {"postID": "post6217052", "text": "Well Apple, LG, Samsung, Sony, etc have all got some catching up to do. \nThanks for sharing these photos. Keep them coming please.", "time": "04-09-2018 11:23 AM", "replies": []}, {"postID": "post6217431", "text": "Wow! I love these photos! Super excited that some people are getting their hands on the device already! Cool beans!!", "time": "04-09-2018 06:35 PM", "replies": []}]}, {"title": "Post your P20 / P20 Pro Home Screens!", "thread": [{"postID": "post6216370", "text": "Because why not?!\nHere's mine:", "time": "04-08-2018 04:52 PM", "replies": [{"postID": "post6216501", "text": "Did you install the Pixel Launcher apk!?", "time": "04-08-2018 08:05 PM", "replies": [{"postID": "post6216754", "text": "Yeah! I love this launcher!", "time": "04-09-2018 02:38 AM", "replies": [{"postID": "post6217211", "text": "Sorry to be a pain but could you point me in the right direction to where you got the correct apk from for the pixel launcher.\nThanks", "time": "04-09-2018 01:59 PM", "replies": []}]}]}, {"postID": "post6216765", "text": "That 2nd photo is giving me serious phone envy. I promised my wife I'd hold off a few months but I'm seriously struggling now.\nBTW does the front FPS sensor still double as a Home Button? My P10 did but the Mate 10 Pro doesn't. Just give it a tap and it should take you back to your home screen.", "time": "04-09-2018 03:00 AM", "replies": [{"postID": "post6216798", "text": "Hahaha the struggle is real for us phone fans. \nAnd yeah the home 'button' can remove the on screen nav buttons which is why they don't show on my screen grab and photo as I have turned them off. \nSo the button is tapped once to go back, tap and hold to go home and swipe over it left or right to bring up open apps. It's amazing. One of my favourite things about the phone. It makes the big screen seem even more immersive.", "time": "04-09-2018 04:48 AM", "replies": []}]}]}, {"postID": "post6216770", "text": "Back to good old nova.", "time": "04-09-2018 03:13 AM", "replies": []}, {"postID": "post6216809", "text": "I tried the gesture controls on the home fps but kept hitting back when I wanted to go home.", "time": "04-09-2018 05:16 AM", "replies": []}]}, {"title": "I want this phone!", "thread": [{"postID": "post6205506", "text": "Wow after looking at what the camera can do I'm all over this. But I wish they added the wireless charging i'm surprised this didn't come with that option. So impressed with the Camera  i'm ready to move away from Samsung.\nAnyone else?", "time": "03-27-2018 12:01 PM", "replies": [{"postID": "post6206872", "text": "Don't waste your money. All that hardware and still a smudge fest. Dxo was paid for the score and review of this camera.", "time": "03-28-2018 04:33 PM", "replies": [{"postID": "post6206889", "text": "Yawn. Are you still banging that same troll drum? Move along", "time": "03-28-2018 04:44 PM", "replies": []}, {"postID": "post6207021", "text": "Go away.", "time": "03-28-2018 07:43 PM", "replies": []}]}]}, {"postID": "post6205922", "text": "I wish Huawei offered an American version of this phone! But maybe the Mate 20 Pro will have the same killer optics along with the rumored in-screen fingerprint sensor? Hmm..", "time": "03-27-2018 06:09 PM", "replies": [{"postID": "post6217061", "text": "Word is that Huawei wanted to bring the phone stateside for Verizon and AT&T but our government wouldn't allow it due to security concerns.", "time": "04-09-2018 11:30 AM", "replies": []}]}, {"postID": "post6207239", "text": "So Huawei are just as bad as Samsung for updates right?\nonly thing holding me back, that and maybe a lot of £ for a screen that is not QHD. OP can get away with it at their price point but £850 does seem a lot.", "time": "03-29-2018 01:46 AM", "replies": [{"postID": "post6207477", "text": "I know it's not much cheaper but CPW quoted £799 for the Pro sim free today", "time": "03-29-2018 09:56 AM", "replies": []}]}, {"postID": "post6207273", "text": "Probably gonna get the Pro, but Huawei really needs to maintain their updates much better, it's pretty poor tbh.", "time": "03-29-2018 03:21 AM", "replies": []}, {"postID": "post6207295", "text": "Mine is coming next week. Agree that Huawei need to do better on security updates. Hoping treble will help a bit.", "time": "03-29-2018 04:45 AM", "replies": [{"postID": "post6208107", "text": "Yes a regular unbiased person we can count on for honest thoughts about the camera. Honestly I've been all over the hashtag on Instagram for the Huawei P20 Pro and the photos have just been gorgeous.", "time": "03-29-2018 09:56 PM", "replies": []}]}, {"postID": "post6207439", "text": "Releasing on 8.1is a good start. The S9 released on 8.0 despite project treble.\nDoes it have an SD card? The reviews I have read are inconsistent on this.", "time": "03-29-2018 09:14 AM", "replies": [{"postID": "post6207509", "text": "Nah. No micro sd slot", "time": "03-29-2018 10:33 AM", "replies": []}]}, {"postID": "post6207567", "text": "CPW don't have the twilight one though.\nNo micro SD is a showstopper for me though. Some reviews referenced a hybrid SIM slot and others have called out no SD card.", "time": "03-29-2018 11:46 AM", "replies": [{"postID": "post6207624", "text": "Yeah I asked Huawei on Twitter about the Twilight colour yesterday and they said we can only preorder the Black or Blue here in the UK and Twilight MAY come at a later date. Bit of a bummer that. No Micro sd doesn't bother me personally. My Mate 10 Pro is 128gb and I've still got just under 100gb left to play with but I get that it's more important to a lot of people. Defo no hybrid sim though. Many regions get dual sim but we only get single although it is possible to rebrand it online and buy a dual sim tray to activate the second sim", "time": "03-29-2018 12:48 PM", "replies": []}]}, {"postID": "post6209195", "text": "Maybe I'm just being cynical but doesn't anyone else find it strange how little coverage this phone has had on Android Central on the main page? Considering the camera set up is revolutionary and it's all over other tech sites there's only a few news items about it after the announcement yet OnePlus 6 and Xioami Mi Mix2 etc got loads of coverage around the same time. I'm wondering if Android Central are actively not promoting Huawei amid all the US Government spying paranoia? Or maybe I'm just being paranoid?", "time": "03-31-2018 03:57 AM", "replies": [{"postID": "post6215375", "text": "Android central is pretty American centric. Phones that don't get released over there don't get nearly the same level of coverage. For example, the recent Nokia phones have received fairly little love compared to others.", "time": "04-06-2018 12:19 PM", "replies": [{"postID": "post6216986", "text": "Know of any other active less biased forums/communities?", "time": "04-09-2018 09:58 AM", "replies": []}]}]}, {"postID": "post6211908", "text": "The lack of memory expansion (or 256 GB option) is a real shame for sure. I would have preordered by now if it had either.", "time": "04-03-2018 01:25 AM", "replies": []}, {"postID": "post6213901", "text": "...Car/Ware emailed me back 2day...said they WON'T ship ANY Huawei P20's unless there's a UK address...all the bands (LTE, etc.) will work on any SIM-FREE P20's over here (US)...waiting to hear if their 'no-US-ship' policy is because of the US govt riff w/Huawei on Chinese spying or if it applies to ALL their phones to the states ?", "time": "04-04-2018 10:26 PM", "replies": [{"postID": "post6213904", "text": "Wow I'm going to set aside a few hundred dollars now. I may wait until the beginning of January around my birthday to upgrade. If the Google Pixel 3 does not offer anything to rival my interests I'll be getting the P20 Pro or Galaxy S9+ assuming that LG doesn't bring anything new to the table which they are totally capable of or some other manufacturer doesn't introduce something that really caters to mobile photographers. Nokia is another one I'm keeping my eye on but so far I think I still prefer this phone just for the sheer amount of shooting options it has and being able to take full advantage of that 40mp sensor in a modern smartphone.", "time": "04-04-2018 10:32 PM", "replies": [{"postID": "post6213961", "text": "You sound a lot like me. I'm hanging off on the P20 Pro for a bit. The price will drop significantly in the next few months just like all their previous phones. I'm also letting the hype die down a bit too so I can see how it performs after it's had some software updates too. I really wanted the Pixel 2 XL but the screen issues put me off and I got the Mate 10 Pro instead which I do love but I stupidly picked up a Pixel 2 XL in a store I was in the other day and man I wanted to take it home. So yeah I'll see what the Pixel 3 brings and it'll be a straight choice between that and the P20 Pro with price probably being a huge difference in the P20's favour.\nAlso hoping the Nokia 9 rumours the past few days weren't just an April Fools joke", "time": "04-05-2018 01:22 AM", "replies": [{"postID": "post6214070", "text": "Yeah that would be so cool.", "time": "04-05-2018 06:10 AM", "replies": []}]}]}]}, {"postID": "post6214079", "text": "I'd want this phone for sure but I'm already getting the Pixel 2. Plus I've been using a Huawei/Honor phone for the past 16 months and am looking for a change.\nBut I gotta say, this phone looks sweet.", "time": "04-05-2018 06:31 AM", "replies": [{"postID": "post6214087", "text": "Yeah the Pixel 2 is still a great choice and cheaper than a lot of phones right now. Especially flagships.", "time": "04-05-2018 06:36 AM", "replies": [{"postID": "post6214095", "text": "For sure!", "time": "04-05-2018 06:43 AM", "replies": []}]}]}]}, {"title": "p20 being ignored?", "thread": [{"postID": "post6215912", "text": "Don't want to get too deep into AC conspiracies but do we think the p20 and pro are being ignored? Since announcement there has been precious little information or hype about these phones. Contrast this with the op6 which is getting regular news stories. Even the S8, a year old phone is getting more coverage than the p20. I know the S8 has sold millions but still.\n*Tinfoil hat off tin hat on*", "time": "04-08-2018 03:23 AM", "replies": []}, {"postID": "post6215918", "text": "I thought and said the same myself a few days ago. It's as if it's being overlooked so AC/Mobile Nations aren't seen to be promoting Huawei against US Government advice. Kinda unfair when this site is used worldwide and not just in the US where Huawei are seen to be the bad guy", "time": "04-08-2018 04:07 AM", "replies": [{"postID": "post6215922", "text": "Isn't AC US based? So even if it has a worldwide audience, it's servers and actual office is in the US?", "time": "04-08-2018 04:39 AM", "replies": [{"postID": "post6215934", "text": "Absolutely but it's certainly not a US focused site. We're always being notified of devices and services in different markets like India etc.\nAC should be impartial and if they are actively overlooking Huawei or any other manufacturer for any reason I'd rather they just be honest and make a statement saying so, rather than just ignoring the elephant in the room", "time": "04-08-2018 04:53 AM", "replies": [{"postID": "post6215936", "text": "Actually it was a question. Not a defense of AC. I'm not US based myself. But considering things, I wouldn't really be surprised. \nSent from my SM-G960F using Tapatalk", "time": "04-08-2018 04:55 AM", "replies": [{"postID": "post6215937", "text": "Ahhh apologies", "time": "04-08-2018 04:59 AM", "replies": []}]}]}]}]}, {"postID": "post6215927", "text": "It is very strange, particularly when the UK site I read have been all over it.\nI love my P20 Pro, so the only reason can be the government recommendations affecting their editorial decisions.", "time": "04-08-2018 04:45 AM", "replies": []}, {"postID": "post6216003", "text": "Even the big US reviewers like Mr. Mobile and MKBHD haven't reviewed it yet. I think it's because they have only just got devices to look at and I don't even think that they're from Huawei direct. \nIt is strange that review content is low as it is already touted as being one of the best of 2018 (So far) so it'll be good to hear those guys thoughts when they do review it. \nAlthough I'm not really bothered about MKBHD's impressions as it isn't made by Google, so he won't like it.", "time": "04-08-2018 07:58 AM", "replies": [{"postID": "post6216010", "text": "Well we saw how the Mate 10 Pro review went by Marques....", "time": "04-08-2018 08:08 AM", "replies": []}]}, {"postID": "post6216012", "text": "I've had the same thought too. They didn't put out P20 Pro Dxomark article out but they sure did with another phone being tied with IPhone X Dxomark. But didn't mentioned it's the same rating as Huawei Mate 10 Pro. Just wait till Pixel 3 comes out and they'll be all over that Dxomark into the front page.", "time": "04-08-2018 08:14 AM", "replies": []}, {"postID": "post6217001", "text": "I just asked this in another thread, but does anyone know of any active forums that are less biased?", "time": "04-09-2018 10:11 AM", "replies": []}, {"postID": "post6217016", "text": "The lack of reviews so far is disappointing. Especially since there were such attractive pre-order offers around. There'd have been about ten articles here alone if this was even a oneplus phone.", "time": "04-09-2018 10:35 AM", "replies": []}]}, {"title": "P20 Emotion UI 8.1", "thread": [{"postID": "post6216877", "text": "So moved from I-phone to the P-20 - love it - but come across a weird issue.\nOn my i-phone i had a lot of websites bookmarked as icons on the home screen. I Started doing this on the P20 - but when re-starting it they dissapear \nJust to be clear im creating these bookmarks in chrome and adding to homepage.\nAnyone got any ideas ?", "time": "04-09-2018 07:08 AM", "replies": []}, {"postID": "post6217013", "text": "Creating them and then adding them, or just pressing the add to home page option?\nI use nova launcher and it worked fine on that, not sure why it wouldn't on the stock launcher.", "time": "04-09-2018 10:32 AM", "replies": []}]}, {"title": "UK: Pre-order the Huawei P20 and get free Bose QC35 II headphones", "thread": [{"postID": "post6205425", "text": "Not a terrible deal at all!https://www.androidcentral.com/deal-...-ii-headphones", "time": "03-27-2018 10:41 AM", "replies": []}, {"postID": "post6206687", "text": "That's very tempting! Although I've only had my mate 10 Pro for 1 month.....!", "time": "03-28-2018 12:46 PM", "replies": [{"postID": "post6213307", "text": "I'm still in my grace period so I'll sent my Mate 10 Pro back on Friday once the postman brings the P20 Pro.", "time": "04-04-2018 11:02 AM", "replies": []}]}, {"postID": "post6207294", "text": "Ordered through EE, getting the P20 pro, Bose headphones, unlimited minutes and text and 10gb data for £30 a month and £50 upfront. Friends and family discount helped!", "time": "03-29-2018 04:43 AM", "replies": []}, {"postID": "post6213359", "text": "I've also ordered with EE. \nShould be here Friday. \nAnyone else order tracking moved off 'Order Confirmed'? \nDriving me insane I want some movement haha.", "time": "04-04-2018 11:52 AM", "replies": []}, {"postID": "post6214273", "text": "Got my dispatch. \nShould be here tomorrow.", "time": "04-05-2018 10:14 AM", "replies": [{"postID": "post6214603", "text": "Me too! Looking forward to tomorrow!", "time": "04-05-2018 05:36 PM", "replies": []}]}, {"postID": "post6215980", "text": "Got lucky and preordered mine on Thursday night. Collected it from Curry’s/Carphone Warehouse today. The process for claiming the headphones is a little convoluted (but well worth the effort).", "time": "04-08-2018 07:11 AM", "replies": [{"postID": "post6216327", "text": "I thought that, but realise it is after the statutory 14 day return window from release day.", "time": "04-08-2018 03:42 PM", "replies": [{"postID": "post6216417", "text": "Well observed.... I suppose that’s just sensible business. I’m quite liking the P20, so far. I’m not sure whether or not I’ll regret not going for the Pro, but I tend to think in terms of sufficency, these days. The last phone that truly knocked my socks off was the Samsung Galaxy S3...", "time": "04-08-2018 06:09 PM", "replies": [{"postID": "post6216757", "text": "Ahh you went for the non Pro version? How is it treating you? \nI personally much prefer the size of the non Pro version to the Pro but thought I'd be giving up too much in the camera if I went for the reg P20. \nWhat has the camera been like for you? I wonder if night mode is as good on that as it is on the Pro.", "time": "04-09-2018 02:49 AM", "replies": []}, {"postID": "post6216773", "text": "I thought about the regular P20, but I'm glad I went for the pro, the camera feels rediculously capable so far.", "time": "04-09-2018 03:17 AM", "replies": []}]}]}]}, {"postID": "post6216784", "text": "The Camera on the bog standard P20 is an enhancement of the P10, with a larger sensor (or so I’m told). It seems to be either close or on a par with the best from Samsung, Google and Apple, whereas the Pro pulls ahead (quite significantly). I carry around a proper camera, so a phone with the oomph to process the raw files from that was my main priority (and the bog standard 20 certainly delivers oomph). That said... Loving the black and white!", "time": "04-09-2018 03:45 AM", "replies": [{"postID": "post6216799", "text": "You'll have to get some of your shots uploaded so we can see what it's capable of!", "time": "04-09-2018 04:50 AM", "replies": [{"postID": "post6216818", "text": "There is a thread for P20 photos.", "time": "04-09-2018 05:26 AM", "replies": [{"postID": "post6216883", "text": "Yeah that's what I meant. To post in there.", "time": "04-09-2018 07:23 AM", "replies": []}]}]}]}]}, {"title": "Cases & accessories.", "thread": [{"postID": "post6215935", "text": "The P20 Pro comes with a Huawei branded clear tpu case, but I have ordered myself a second case and some tempered glass screen protectors, will show those off as they arrive.\nThe included usb-c earphones are pretty great and there is a usb-c to jack dongle included. \nAnyone got any accessories worth mentioning?", "time": "04-08-2018 04:55 AM", "replies": [{"postID": "post6216005", "text": "It comes with a case? Mine didn't? \nAlthough a glass screen protector is fitted already so are you putting one on top of the pre-installed one?", "time": "04-08-2018 08:00 AM", "replies": [{"postID": "post6216055", "text": "The pre installed protector on mine is plastic.\nThis is the case that came in the box with mine.", "time": "04-08-2018 09:25 AM", "replies": [{"postID": "post6216096", "text": "Ha no way. I got no case in my box. That's frustrating where did you order from out of curiosity? \nAnd oh right it doesn't feel plastic to me I quite like it. Good to know though, thanks.", "time": "04-08-2018 10:25 AM", "replies": [{"postID": "post6216324", "text": "I ordered mine from Three UK.\nI could be wrong about the pre installed screen protector, but it definitely feels like plastic to me. I'll probably not use a screen protector after a while anyway.", "time": "04-08-2018 03:40 PM", "replies": []}]}]}]}]}, {"postID": "post6216217", "text": "I watched a few unboxings on YouTube. Some had cases and some didn't. My Mate 10 Pro came with one too and I assumed they all did now. They're great cases even if it's just to keep the phone safe until better or more expensive ones arrive. I took the screen protector off after a few days purely because I couldn't swipe across the screen very smoothly.", "time": "04-08-2018 01:21 PM", "replies": []}, {"postID": "post6216779", "text": "Case that I ordered turned up. Feels really nice and has a good lip to protect the screen when the phone is face down.\nThis one is the Bosewek one.", "time": "04-09-2018 03:26 AM", "replies": [{"postID": "post6216800", "text": "Looks good that.", "time": "04-09-2018 04:50 AM", "replies": []}]}]}, {"title": "P20 pro AOD", "thread": [{"postID": "post6216291", "text": "Wondering if the AOD on the P20 pro is improved at all vs. the mate? Mainly if 3rd party apps maybe now show?", "time": "04-08-2018 02:52 PM", "replies": [{"postID": "post6216326", "text": "I haven't seen any showing, but I only found the setting to turn it on a few hours ago.", "time": "04-08-2018 03:41 PM", "replies": []}]}, {"postID": "post6216371", "text": "They don't show unfortunately. \nJust the Huawei apps - phone calls etc. \nPretty rubbish really. Seems odd that they don't give you the choice, at the least.", "time": "04-08-2018 04:53 PM", "replies": []}, {"postID": "post6216383", "text": "I'm still hoping they add 3rd party app support with an update. Samsung did the same when they only had stock app support for Always On Display with the S7 to begin with.\nSaying that, Huawei have being using their Always On Display this way since the Mate 9 Pro and don't seem in a rush to change it anytime soon.\nWeirdly Google Play Music is a 3rd party app that I've noticed also shows 'Now Playing' information on the Always On Display and not just with the Huawei Music App.", "time": "04-08-2018 05:16 PM", "replies": []}, {"postID": "post6216788", "text": "It does (on the M10 pro) make the AOD pretty pointless IMO. I am only getting sms and phone calls, the stock email app does not even work.\nIs worrying that they do not seem in a rush to fix and maybe it is buried in the settings and hard to find for a reason.", "time": "04-09-2018 04:11 AM", "replies": []}]}, {"title": "Don't like the notch? Shut it off", "thread": [{"postID": "post6205451", "text": "https://twitter.com/WhatTheBit/statu...32516927217665\nStill looks kind of odd though. Should be more rounded like the images shows. Maybe they'll fix it later.", "time": "03-27-2018 11:01 AM", "replies": []}, {"postID": "post6205520", "text": "I may well keep the notch IF I had that phone, BUT I love that they are offering the option. Now if only Trump would let me buy a Huawei phone! I'M KIDDING Trump fans, don't crucify me! lol", "time": "03-27-2018 12:10 PM", "replies": []}, {"postID": "post6216777", "text": "They have done a great job with the notch to be honest.\nIt doesn't bother me at all, I've kept it on as it will auto hide for some apps anyway. very well implemented. good job Huawei.\nNote: I also turn off the virtual keys for maximum screen estate", "time": "04-09-2018 03:20 AM", "replies": []}]}, {"title": "P20 Pro Battery", "thread": [{"postID": "post6216355", "text": "The battery life truly is spectacular.\nMost of this screen on time has been watching streamed videos!\nAt it still says I'm likely to get another 15hrs!", "time": "04-08-2018 04:26 PM", "replies": []}, {"postID": "post6216391", "text": "I got 7 hours over about 1 day 10 hours of usage \nIt outlasted my pixel 2xl", "time": "04-08-2018 05:30 PM", "replies": []}, {"postID": "post6216410", "text": "Mate 9 10 and now P20 Pro are the champions of battery life, I'll probably get the P20 pro, as i like my Mate 9 so much and i can trust a good combo of camera, batt life and performance.", "time": "04-08-2018 05:55 PM", "replies": []}, {"postID": "post6216758", "text": "I can confirm that the P20 Pro battery has also been amazing for me. Yesterday I also got close to 7 hours screen on time and that was without auto brightness or any dispaly settings turned on to help save power. \nBeen really impressed with it so far.", "time": "04-09-2018 02:50 AM", "replies": []}, {"postID": "post6216775", "text": "I think I can safely say I'm a power user. The battery was on 2% when I went to bed", "time": "04-09-2018 03:18 AM", "replies": []}]}, {"title": "P20 pro vs xz2", "thread": [{"postID": "post6207366", "text": "Hi guys sory to ask but im in for one of these both look anazing most important for me is music and camara will be important as soon to be having a baby any help would be appreciated both rolling out good pre order deals aswell", "time": "03-29-2018 07:30 AM", "replies": []}, {"postID": "post6207991", "text": "P20 Pro for sure.", "time": "03-29-2018 07:31 PM", "replies": [{"postID": "post6208070", "text": "Because why for sure ?", "time": "03-29-2018 09:03 PM", "replies": [{"postID": "post6208224", "text": "Sony phone cameras have traditionally been very subpar, I think the difference is only bigger this time with P20 Pro's setup.", "time": "03-30-2018 02:27 AM", "replies": []}]}]}, {"postID": "post6208391", "text": "Thought this was supposed to be one of the biggest gains on the xz2 from previous sonys", "time": "03-30-2018 07:20 AM", "replies": []}, {"postID": "post6208400", "text": "P20 Pro all the way. Camera is top drawer", "time": "03-30-2018 07:26 AM", "replies": [{"postID": "post6208821", "text": "Top shelf? Never heard top drawer before.", "time": "03-30-2018 02:42 PM", "replies": [{"postID": "post6208875", "text": "Nah Top Drawer is a well used phrase too. At least here in the UK anyway. Top Notch is another but notches at the top are a bit of a swear word around here lately 🤬", "time": "03-30-2018 03:46 PM", "replies": []}]}]}, {"postID": "post6208975", "text": "But the P20 doesn’t do 4K HDR 10 bit (for all you video shooters ). The Sont is the first phone to shoot 10 bit HDR. :-p", "time": "03-30-2018 06:20 PM", "replies": []}, {"postID": "post6209182", "text": "Im using a P20 Pro and the camera is phenomenal. The level of zoom and the detail you get is next level and the night mode has enabled me to get pictures where everyone else has struggled. \nIn terms of music this phone has Dolby Atmos and the stereo speakers are ridiculously loud without being tinny.", "time": "03-31-2018 02:47 AM", "replies": [{"postID": "post6209193", "text": "That's one thing I hoped would be improved. My Mate 10 Pro dual speakers are quite good but they could definitely be louder and a bit fuller sound so this is good to know before I switch", "time": "03-31-2018 03:51 AM", "replies": []}, {"postID": "post6209689", "text": "Post up some photos for us please.", "time": "03-31-2018 06:08 PM", "replies": []}, {"postID": "post6214977", "text": "Can you test out PC mode/EMUI desktop, thanks.", "time": "04-06-2018 03:26 AM", "replies": []}]}, {"postID": "post6215929", "text": "The sound quality with headphones is awesome.", "time": "04-08-2018 04:46 AM", "replies": []}]}, {"title": "How do we get one?", "thread": [{"postID": "post6205953", "text": "I haven't been this excited about a phone in a while. Even more so than the SO/+ with the dual aperture camera systems and stereo speakers. My big question is what is the easiest way to get one of these in the U.S.? I really like what Huawei displayed today ,although I would really caution them to get a presenter who is really comfortable with English or simply get a translator for the guy cause he bombs every single presentation. I'm all about the camera and it seems (we'll have to see real world, non DxOMark hyped results, that Huawei has delivered everything in that department. I have longed for a manufacturer, namely Nokia, to revive the tech behind the legendary classic Nokia Lumia 1020 outfitted with today's horsepower and processing prowess. This set up seems to be the closest thing to that all in a beautiful form factor with a battery larger than everything it will be competing with. So let's keep the conversation going. Post your experiences buying unlocked phones or particularly Huawei phones. I think I will at least give Google and to a lesser extent LG a chance to respond before jumping through hoops to get this phone but it is all the way at the top of my list as of now. I'm using a V20 now.", "time": "03-27-2018 06:58 PM", "replies": [{"postID": "post6205959", "text": "This I want to know too!! Just saw the knotchless story on it today and am entruiged.", "time": "03-27-2018 07:09 PM", "replies": []}]}, {"postID": "post6207127", "text": "eBay, Gearbest, or any of the other Chinese reseller sites. Expect to pay a premium though.", "time": "03-28-2018 09:46 PM", "replies": [{"postID": "post6207128", "text": "That's what I'm afraid of and the biggest hurdle to getting one of these phones. May just have to settle for US flagships. Such a shame too. I really appreciate what Huawei did here. Maybe this will light a fire under Google and maybe even LG to do something special later this year. Thinking LG V40 or Pixel 3. But I'm going to exhaust my options before giving up on the P20 Pro if the real reviews hold up beyond the initial hype.", "time": "03-28-2018 09:49 PM", "replies": [{"postID": "post6207153", "text": "Yes, I too worry about paying a premium price. The phone looks spectacular but I'm afraid to shell out that much cash.", "time": "03-28-2018 10:43 PM", "replies": [{"postID": "post6207168", "text": "Me too. I think the positive here is that other guys that will be available here will step their game up. Hopefully that's the effect these phones will have on the competition.", "time": "03-28-2018 10:56 PM", "replies": []}]}]}]}, {"postID": "post6207187", "text": "Bh photo might carry it as well. They're carrying the mate 10 pro. We'll just have to wait and see. There's always Swappa, at some point someone will have one up for sale on there. Most likely at a huge markup though. Some of those Swappa sellers are dumb.", "time": "03-28-2018 11:24 PM", "replies": [{"postID": "post6207627", "text": "Oh, good point! I totally forgot about B&H!", "time": "03-29-2018 12:50 PM", "replies": []}]}, {"postID": "post6207444", "text": "Clove UK has the P20 Pro up for preorder. They ship to the US.", "time": "03-29-2018 09:19 AM", "replies": [{"postID": "post6207463", "text": "Cool. Thanks for the info. I'll check them out.", "time": "03-29-2018 09:43 AM", "replies": [{"postID": "post6209387", "text": "It's almost a grand from Clove. I'll be waiting lol.", "time": "03-31-2018 10:13 AM", "replies": [{"postID": "post6209394", "text": "Umm no.lol  I'll be waiting as well or just stick around for Google's third attempt which will no doubt be great. But that 40mp. Just switch right to pro mode and go with it. I'm still amazed by how much detail my old Lumia 1020 captured from a trip from last year. On the phone it looks pretty good but when I uploaded the RAW files into Lightroom  they were just gorgeous.", "time": "03-31-2018 10:20 AM", "replies": [{"postID": "post6209404", "text": "Yeah I checked it out at Clove's site. £685 which is $960. Forget that lol. I'll wait for swappa/eBay/b&h to see what prices are out there. I probably won't even get one if Huawei doesn't update emui for the better.", "time": "03-31-2018 10:30 AM", "replies": []}, {"postID": "post6211211", "text": "I had been thinking about getting the 1020 for the hell of it at one point. I know it has no value for anything other than Photos but it's a legendary shooter", "time": "04-02-2018 10:34 AM", "replies": []}]}]}]}]}, {"postID": "post6207479", "text": "I'm going to wait for the full reviews to come out because of course companies have a tendency to over hype themselves. This is an interesting little comparison here. I want to see if Huawei sends out an update for the 4k electronic stabilization but I think Samsung definitely wins in this department being able to shoot at 60fps in 4k with pretty stable footage. But for photos, the P20 just has so much more richness in the camera app. They showed the one picture example in the presentation that was a whopping 58 second exposure which is bonkers for a phone. My V20 can do 30 seconds already. Anyway just some observations. Here's the quick comparison.", "time": "03-29-2018 10:02 AM", "replies": []}, {"postID": "post6209361", "text": "Night mode vs the lowlight champ Pixel 2. Huawei is the only manufacturer right now that has clever enough processing to maintain highlights even better than Google. That's amazing. I think for social media it will be unbeaten as everything loses some resolution and zooming in won't matter.https://www.theverge.com/2018/3/30/1...ison-low-light", "time": "03-31-2018 09:37 AM", "replies": []}, {"postID": "post6209399", "text": "Here are a few even though it won't do it justice on here.", "time": "03-31-2018 10:23 AM", "replies": [{"postID": "post6211215", "text": "Good Lord, are those really from the 1020?? Beautiful!", "time": "04-02-2018 10:35 AM", "replies": [{"postID": "post6211222", "text": "Thanks. Yep edited in Lightroom Classic from RAW but even on the phone without the edits the pictures look great. I love the flexibility of the RAW images you can still put out from 1020. I think I'm going to just wait for the Pixel 3 this year or...don't get me wrong this is probably too good to be true but some of this could be true and hopefully at least in the camera department seeing that Huawei's shown that's it's very possible now. https://www.phonearena.com/news/noki...flash_id103752", "time": "04-02-2018 10:40 AM", "replies": [{"postID": "post6213061", "text": "Congratulations on the exceptional photography. You've got a great eye. Hopefully Nokia does release a triple camera 9. I've gotten some great results with the V30 despite the small sensor size & LG's supposed post processing issues. I just ordered Canon's EOS 7D Mark 1 yesterday. My first legit shooter. I used the Pixel 2 for a little but no manual/pro mode was a deal breaker for me. Keep up the great work You almost convinced me to get a 1020 at one point lol", "time": "04-04-2018 07:02 AM", "replies": [{"postID": "post6213110", "text": "Thanks a lot. I whip it out from time to time. Turned out to be useful on that trip too. But looks like you're getting into serious category with Canon. Nice one.", "time": "04-04-2018 07:56 AM", "replies": [{"postID": "post6214351", "text": "I'm def excited, but glad it all worked out for you too keep it up", "time": "04-05-2018 12:04 PM", "replies": []}]}]}]}]}]}, {"postID": "post6213097", "text": "I did love my 1020. I'll never forget how hard it was to hold though with it being so top heavy and with the huge camera module on the back.", "time": "04-04-2018 07:44 AM", "replies": []}]}, {"title": "What about the P20 lite?", "thread": [{"postID": "post6209188", "text": "Looking at the specs the lite looks an absolute bargain, it also has SD card support and the FPS on the back (which many prefer)\nClearly the chip is not as powerful but the lite does seem to be flying under the radar.", "time": "03-31-2018 03:09 AM", "replies": [{"postID": "post6214011", "text": "Probably because most of the hype is about the triple lenses on the pro.", "time": "04-05-2018 04:07 AM", "replies": []}]}]}, {"title": "Will the P20 Pro work on Tmo (us) ?", "thread": [{"postID": "post6206235", "text": "Im seeing mixed reports... any info ??", "time": "03-28-2018 03:46 AM", "replies": [{"postID": "post6207445", "text": "Would love an answer to this as well. It looks like it has the supported bands but the main question is will it work with VOLTE out of the box.", "time": "03-29-2018 09:19 AM", "replies": []}]}, {"postID": "post6208180", "text": "To piggy back will it work on AT&T?", "time": "03-30-2018 12:45 AM", "replies": [{"postID": "post6211206", "text": "I'd say there's a better chance that they are compatible then not. They're both gsm but I didn't check the specifics.", "time": "04-02-2018 10:29 AM", "replies": [{"postID": "post6212563", "text": "The P20 does have compatible TMobile bands. The question really is whether it will support VOLTE out of the box. Sadly, it probably won't.", "time": "04-03-2018 04:20 PM", "replies": []}]}]}]}, {"title": "Availability in Canada", "thread": [{"postID": "post6206458", "text": "Anybody know who's going to be carrying the Huawei P20 Pro in Canada I don't see any of the carriers listing it at all.\nThanks", "time": "03-28-2018 09:33 AM", "replies": [{"postID": "post6208000", "text": "https://www.itworldcanada.com/video/...ech-first-look\nIt looks like Huawei’s P-Series is here to stay in Canada. After a limited release last year with the P10, the Chinese smartphone maker will be bringing the P20 and P20 Pro to Canada later this year across all major carriers.\nCanadian availability and pricing is yet to be announced, but the P10 last year came to Canada in June after a similar release (the P20 and P20 Pro are available in select markets today), so expect a similar time frame.\nAnd it looks like the problems Huawei is having in the United States don’t extend to Canada – both the P20 and P20 Pro will be available at Rogers, Telus, Bell, Videotron, Koodo, Fido, and Virgin.", "time": "03-29-2018 07:35 PM", "replies": []}]}, {"postID": "post6211307", "text": "that's great news thanks.", "time": "04-02-2018 11:57 AM", "replies": []}]}, {"title": "Huawei P20 Pro Leaves All Other Smartphone Cameras In The Dust", "thread": [{"postID": "post6205919", "text": "I always take DXO with a grain of salt, but this is looking mighty good.https://www.dxomark.com/huawei-p20-p...nding-results/", "time": "03-27-2018 06:07 PM", "replies": []}, {"postID": "post6209802", "text": "Won't see this in the front page", "time": "03-31-2018 09:32 PM", "replies": []}]}, {"title": "Does p20 pro have always on display?", "thread": [{"postID": "post6208836", "text": "I've watched quite a few videos of the p20 pro. Despite rumours before the release, none of the videos I've seen appear to indicate that the p20 pro has an always on display. I'm trying to decide between the s9+ and the p20 pro but not having an always on display is a dealbreaker.", "time": "03-30-2018 02:57 PM", "replies": [{"postID": "post6208878", "text": "It does. BUT for the clock, date and battery level as well as stock app notifications like sms and music. 3rd party apps don't show notifications yet and only show on the notification led. Basically the same as Samsung had when it came out for the S7", "time": "03-30-2018 03:50 PM", "replies": []}]}, {"postID": "post6208891", "text": "Thanks so much for that! \nIf it has a notification LED that's good. My current Windows phone doesn't.\nIt's a really hard decision as to which phone to purchase. Unfortunately the variation of the S9 here in New Zealand is using the Exynos chip and therefore the battery life is absolutely terrible according to all the reviews I've read (Qualcomm 845 battery life seems really good, but that's not what's sold here). If it wasn't for that I'd probably get the S9.\nThe P20 Pro looks really good in terms of battery life. Overall the camera looks good. \nI'm used to being able to take 20 megapixel photos with my windows phone and the quality of some photos is far better than my wife gets out of the S8. So 40 megapixels is quite appealing. However the images I've seen from P20 Pro are over processed on portraits and seems to over sharpen compared with the S9.\nSo pretty big dilemma really.\nAppreciate your answer, it really helps narrow things down.\nThanks,\nStefan", "time": "03-30-2018 04:07 PM", "replies": [{"postID": "post6208921", "text": "Always on Display is a big deal for me too. I came from a long line of Windows Phones too with Glance so it's been a must have feature for me too. I think you'd be happy with either of the S9+ or P20 Pro. I had the S8, S8+ then the Note 8 but have the Huawei Mate 10 Pro just now with the same battery as the P20 Pro and it's an absolute beast.", "time": "03-30-2018 04:50 PM", "replies": []}]}]}, {"title": "Does it support EMUI Desktop/Easy Projection?", "thread": [{"postID": "post6207986", "text": "Do any of you have a review unit and can confirm whether it has EMUI Desktop/Easy Projection? Thanks.", "time": "03-29-2018 07:30 PM", "replies": []}, {"postID": "post6208602", "text": "I watched the presentation and it 100% DOES have", "time": "03-30-2018 11:27 AM", "replies": []}]}, {"title": "Huawei P20 + P20 Pro hardware specifications", "thread": [{"postID": "post6205430", "text": "https://www.androidcentral.com/huawe...-p20-pro-specs", "time": "03-27-2018 10:44 AM", "replies": []}, {"postID": "post6205891", "text": "Any idea when it'll be on sale? Price?\nHow about pricing info for the Porsche Design Mate RS? I really *REALLY* want that one!https://consumer.huawei.com/en/phone...esign-mate-rs/", "time": "03-27-2018 05:41 PM", "replies": []}]}, {"title": "Video: Huawei P20 and P20 Pro hands-on preview: The rise of triple cameras", "thread": [{"postID": "post6205427", "text": "Or the full post if you prefer - https://www.androidcentral.com/huawe...-hands-preview", "time": "03-27-2018 10:42 AM", "replies": []}]}]
