[{"title": "Opinions, Reviews", "thread": [{"postID": "post6144994", "text": "Been looking at getting one of these since they came out. For those of you that have one, was it worth the $400? What do you use it most for?\nIdeally, I'd like to use it for playing music in my living room and as a sound bar type device (unsure if I've seen confirmation on that capability).\nI'm debating waiting a few months to see if the price drops. But also considering just picking up another regular home devices.", "time": "01-24-2018 05:36 PM", "replies": [{"postID": "post6147256", "text": "There's a reddit thread about using it as a soundbar. They said it was possible, but it was a bit inconvenient. My local best buy had one on display though, may want to make some calls to check it out. Personally I wasn't super impressed, but i'd have to take it home and listen to it in a better environment with my own music to make the final call.", "time": "01-27-2018 01:30 PM", "replies": []}]}]}, {"title": "Google Home Max Pre-Order", "thread": [{"postID": "post6070854", "text": "Anyone know when this will go on Pre-Order? I heard the 13th but alas, that came and went...it did just pass through the FCC so looks like it is close now.", "time": "11-15-2017 09:15 AM", "replies": []}, {"postID": "post6079903", "text": "I\"m going to guess some time in December. I'm on the waiting list but if I remember at the google store the worker there said sometime end of nov to dec. Just trying to save money now haha.", "time": "11-21-2017 02:42 PM", "replies": []}, {"postID": "post6081423", "text": "I want one but I just don't listen to music enough to swallow the price lol.", "time": "11-22-2017 02:44 PM", "replies": []}, {"postID": "post6086909", "text": "I really hope that they make an announcement also that it works with your chrome cast to act as a speaker for movies", "time": "11-27-2017 03:37 PM", "replies": []}, {"postID": "post6087816", "text": "So IDK if anybody saw this, but on the best buy website it says the release date is 12/11/2017http://forums.androidcentral.com/e?l...token=YAAdHUNd", "time": "11-28-2017 09:32 AM", "replies": [{"postID": "post6088097", "text": "Cool...guessing there may be no pre-order for it and it is just available on the 11th...ready for it...I've migrated from Echo to Home so Google, don't let me down!", "time": "11-28-2017 01:00 PM", "replies": []}]}, {"postID": "post6100095", "text": "Is it too early to call the Google Home Max \"Vaporware\"?", "time": "12-08-2017 08:23 AM", "replies": [{"postID": "post6101678", "text": "Yeah, 12/11 got here and no... Oh wait, it isn't 12/11 yet. We don't know.", "time": "12-09-2017 02:28 PM", "replies": []}]}, {"postID": "post6103244", "text": "FINALLY. Best Buy has the Google Home Max for ordering online...free shipping with Wednesday delivery date. Best Buy had that date listed but removed it several days ago, which added to the uncertainty of the Max.", "time": "12-11-2017 07:41 AM", "replies": [{"postID": "post6114959", "text": "Let us know how you like it . I have watched some reviews and people seem to really enjoy it.", "time": "12-22-2017 09:47 AM", "replies": [{"postID": "post6115174", "text": "Right off the bat...yes...the sound quality is quite good. Even when roaming the house, you can hear the richness of the bass in other rooms. It is so very good and while it didn't knock my socks off, it has met and exceeded some expectations. If you are in the Google Home/Assistant world and want the best sounding speaker with Assistant, this is it for sure. It is HUGE and it may not fit where the smaller Home or Mini's are accustomed to go.", "time": "12-22-2017 01:19 PM", "replies": [{"postID": "post6115198", "text": "Nice. Yeah I plan to get one someday. I have a Google home and 2x Mini ones around my house. I use Assistant on my Pixel 2 XL along w/ the Homes a ton for things like home control (Nest/Phillips Hue lights/etc.)\nI def. wouldn't mind a good music speaker to use while cleaning the house .", "time": "12-22-2017 01:47 PM", "replies": []}]}]}]}, {"postID": "post6104747", "text": "Mine arrives today", "time": "12-12-2017 11:12 AM", "replies": []}]}, {"title": "Google Home Max", "thread": [{"postID": "post6005027", "text": "Google announced a larger version of the Google Home. It looks like a decently built unit. I wouldn't mind getting one, but I would like to hear the sound from it before being deciding.\nFrom the blog: https://www.androidcentral.com/googl...-filling-sound\nAnyone else interested?", "time": "10-04-2017 10:30 PM", "replies": []}, {"postID": "post6006691", "text": "I am definitely interested in this. I was going to with Sonos but Google just may have changed my mind.", "time": "10-05-2017 09:05 PM", "replies": [{"postID": "post6007850", "text": "Thinking of getting one no matter what? Wouldn't mind hearing your thoughts on it.", "time": "10-06-2017 01:56 PM", "replies": []}]}, {"postID": "post6014510", "text": "I'm buying one of these for sure. but not until they go on sale, $400 is a hard pill to swallow.", "time": "10-10-2017 10:08 PM", "replies": [{"postID": "post6017372", "text": "Especially if you want two", "time": "10-12-2017 11:23 PM", "replies": []}]}, {"postID": "post6019987", "text": "I'm considering getting one tho. my living room projector does Bluetooth audio... so having only 1 wire and a speaker that plays music on its own seems awesome.\nnext evolution should be the ability to have 2 front speakers and 2 home minis as rear and play surround sound from Chromecast ultra! that would be sick!", "time": "10-14-2017 09:22 PM", "replies": []}, {"postID": "post6021173", "text": "Better off waiting for true reviews for this type of product. You can probably get a 250.00 system with similar sound to this system. Just use the google assistant on your phone and say ok google to control bluetooth speakers that don't have google speakers built in. Its just that simple.", "time": "10-15-2017 06:49 PM", "replies": [{"postID": "post6042033", "text": "Yeah, I just saw that JBL came out with the Link 300. That thing looks pretty nice too and it's only $299.", "time": "10-27-2017 06:59 PM", "replies": []}]}, {"postID": "post6024933", "text": "I sometimes get pretty significant promotional discounts on tech through my work- for the right price I might be tempted, but not for full retail. I have no real justification for owning one other than pure nerd appeal, and that's not worth $400.", "time": "10-18-2017 02:37 AM", "replies": []}, {"postID": "post6071548", "text": "I want to see reviews from AV or audio websites, but if it performs well and they add the ability for it to sync with a Chromecast (to act like a soundbar) I will definitely pick one up.", "time": "11-15-2017 03:40 PM", "replies": [{"postID": "post6074282", "text": "Is a Google Home. You can group it with a chromecast by default. I don't bother with my regular Home because it's in my living room with my stereo.", "time": "11-17-2017 10:33 AM", "replies": [{"postID": "post6074464", "text": "I know that, but after the unveiling Google engineers indicated that they were looking into making Home Max work directly with an individual Chromecast so it could function as a soundbar for a TV, and this would almost guarantee a sale in our household as we've been looking for a good sounding sound bar to go with a TV in a room that doesn't currently have a Home unit in it.\nThe rest of our Home units are already synced with a Chromecast Music that is plugged into floor-standing speakers for whole-home audio, but I specifically want the \"soundbar\" usage model for the room that a Home Max would potentially go in.", "time": "11-17-2017 01:07 PM", "replies": []}]}]}, {"postID": "post6103725", "text": "Anyone know how long the power cord is?", "time": "12-11-2017 02:11 PM", "replies": []}]}]
