[{"title": "Nokia 7 Plus a mediocre device", "thread": [{"postID": "post6174530", "text": "After the success of Nokia 6 and 8, Nokia launched 7 plus, another mediocre device. They could have made it in the league of awesome Nokia 8 Sirocco", "time": "02-28-2018 02:38 AM", "replies": [{"postID": "post6174822", "text": "What do you think makes it 'mediocre'? It looks pretty darned good to me. The only negatives I could come up with are these:\nSlower CPU (~15% slower than a SD835)\nNot waterproof\nNo wireless charging\nSingle speaker\nNo optical image stabilization\nAm I overlooking any other negatives?", "time": "02-28-2018 11:19 AM", "replies": []}]}, {"postID": "post6174532", "text": "I'm disappointed as well. I'm hoping they will release other new devices that are high-end with great cameras.", "time": "02-28-2018 02:46 AM", "replies": []}, {"postID": "post6174587", "text": "The 7 Plus will surely replace my Moto Z Play, it has stock android, fast updates(Android One), new chipset , headphone jack, pretty good cameras, big battery, i live in Europe and it will surely be released here, at 400 EURO i can't find a better replacement at this price. There are other alternatives at higher prices,not sure why are you complaining LOL", "time": "02-28-2018 05:31 AM", "replies": []}, {"postID": "post6174589", "text": "I think the 7 plus looks like a fantastic device and I'm extremely disappointed that it won't be coming to the US!", "time": "02-28-2018 05:37 AM", "replies": [{"postID": "post6183516", "text": "i am curious what the down-side to importing the Chinese variant would be - it supports two of AT&T's LTE bands>", "time": "03-08-2018 06:21 PM", "replies": [{"postID": "post6183547", "text": "When I looked a week ago it only supported one T-Mobile band so that doesn't work for me. I think you could potentially have gaps in speed and coverage.", "time": "03-08-2018 07:09 PM", "replies": []}]}]}, {"postID": "post6179943", "text": "I'd like to hear others thoughts on this phone. I'm in the market to replace my moto g4 plus and liking the look of this. I've been generally happy with the g4 plus but also had some niggles (mainly support from motorola wasn't great and only 1 year warranty). I'm not a flagship kind of guy.", "time": "03-05-2018 02:46 PM", "replies": []}, {"postID": "post6180830", "text": "It's only mediocre if you look at it as a flagship phone, which this is not as that's why the Nokia 8 exists.", "time": "03-06-2018 09:13 AM", "replies": []}, {"postID": "post6180869", "text": "Why would they make it the same league as the 8 Sirocco? This is like saying that the Galaxy A8 is mediocre, should have been S8 level. Or the Moto G is mediocre, should have been same level as Moto Z. You see the problem?", "time": "03-06-2018 09:40 AM", "replies": [{"postID": "post6180966", "text": "Exactly, for what it is this is a fantastic device. OK, it's not for everyone but it's still a decent choice.", "time": "03-06-2018 11:14 AM", "replies": []}]}]}, {"title": "Nokia 7 plus live chat with Nokia support", "thread": [{"postID": "post6183443", "text": "Hi\nJust had a live chat with Nokia to ask about official retailers and when it may be available for sale direct via website. As expected they were a bit vague about release date and said \"early April\". However the live chat person said it would be 399 euros plus applicable taxes. I asked therefore if it would be around 350gbp PLUS tax they replied \"probably\". I noticed clove are taking pre orders at £291 plus vat coming in at £350 total. I'm hoping clove are right and Nokia live chat person was wrong (especially with the unsure \"probably\"!!!)", "time": "03-08-2018 04:29 PM", "replies": []}]}, {"title": "Nokia 7 Plus - the almost-flagship with a mid-range price", "thread": [{"postID": "post6172792", "text": "The 7 plus looks good!\nOnly 400 euros \n6\" IPS screen, 1080x2160 \nZeiss optics: 12MP wide angle, 13MP telephoto (2x zoom); 16 MP front cam\nSnapdragon 660\nmicroSD slot (or dual SIM)\n64GB/4GB, \nFingerprint reader on back\nUSB-C charging port\n3800mAh battery \nHeadphone jack!! (unlike the 8 Sirocco..)\nRelease date: April 2018\nOnly downsides:\nSlower CPU (but apparently only ~15% slower than a SD835)\nNot waterproof\nNo wireless charging\nSingle speaker\nNo optical image stabilization\nSubjective: I'd prefer the Nokia 6 shape", "time": "02-26-2018 11:58 AM", "replies": []}, {"postID": "post6172804", "text": "@Joe920 - you going to get one??", "time": "02-26-2018 12:09 PM", "replies": [{"postID": "post6173055", "text": "If it ends up coming to the USA and if the camera turns out to be excellent then it's definitely one of the few contenders. \nMinimum requirements for me: \n- great camera\n- 128GB storage OR microSD expansion\n- clean and secure OS with 'all the apps', so either iOS or pure android\n- headphone jack\nThose last two really limit the choices! iPhone and Pixel both dropped the headphone jack, so that leaves the few vendors that produce pure Android phones. The Essential phone ALSO dropped the headphone jack, and the camera wasn't great. \nIf I do end up replacing my iPhone 6S Plus it looks like it will be either the Nokia 7 Plus, maybe the iPhone SE 2 if it shows up with a headphone jack, or a used Pixel XL (1st gen) with 128GB. \nAm I missing any contenders here? In the meantime I'm really looking forward to some camera samples.", "time": "02-26-2018 03:54 PM", "replies": [{"postID": "post6180833", "text": "If it's anything like the rest of the Nokia range it should be a world phone, so you could import one if it isn't sold in the US.", "time": "03-06-2018 09:16 AM", "replies": []}]}]}, {"postID": "post6172884", "text": "yeah looks really good for the price...this one will sell really well...", "time": "02-26-2018 01:38 PM", "replies": []}, {"postID": "post6172947", "text": "Crossing my fingers that this gets a release in the US.", "time": "02-26-2018 02:46 PM", "replies": []}, {"postID": "post6173325", "text": "The only other one would be the Moto X4? \nBut yeah, if this comes to the US im ordering. I've been waiting for the Nokia return since I had to leave Windows Phone.", "time": "02-26-2018 08:20 PM", "replies": []}, {"postID": "post6173918", "text": "I just noticed, looks like this one doesn't have OIS. That's one of the things that made night time imaging on the ole' Lumia 1020 so amazing.", "time": "02-27-2018 11:55 AM", "replies": []}]}]
