[{"title": "Display protection", "thread": [{"postID": "post6180730", "text": "Is the HTC u ultra comes with gorilla glass protection both front and rear ??", "time": "03-06-2018 07:17 AM", "replies": []}, {"postID": "post6181216", "text": "Welcome to Android Central! This review says it's on the front and back. HTC U Ultra review: This gorgeous device is just too big, shiny and expensive Review | ZDNet", "time": "03-06-2018 03:02 PM", "replies": []}]}, {"title": "Now a great value option for mid-range money", "thread": [{"postID": "post6150396", "text": "You can now pick these up for £299 at Argos in the UK. Compared to similar priced mid-range (lower spec) models this is excellent value. Just picked one up and happy with my purchase.", "time": "01-31-2018 02:31 AM", "replies": []}]}, {"title": "why my phone is stuck in bootloop or restart loop ?", "thread": [{"postID": "post6133411", "text": "i am trying to open my phone it is stuck in restart loop ,also nothing happen when i go to recovery mode it also stuck to restart loop then i reed that i can recovery my phone by RUU but my phone couldn't be discovered in my laptop \nreminder that i bought this mobile about 4 months new from russia but iam not there right now i am in anthor country", "time": "01-11-2018 10:14 AM", "replies": []}, {"postID": "post6133784", "text": "If you're going to be back in Russia before the warranty expires, buy or rent a temporary phone until then, then bring it to the seller and ask them to repair or replace it.\nIf not, you can possibly pay to have it fixed where you are now. (Depending on the manufacturer and the two countries involved (Russia and where you are now), you might even be able to get it fixed under warranty where you are.)", "time": "01-11-2018 04:58 PM", "replies": []}]}, {"title": "Re-purchased my UK U Ultra.. A quick Question?", "thread": [{"postID": "post6040166", "text": "Hi Folks\nIve just replaced my U Ultra, after trying the U11, I just couldnt get away with the 11.. I prefer the bigger screen and speakers of the ultra..\nI'm in UK and bought it pre-owned BNIB and Unlocked/Unbranded..\nWhat is the latest Unlocked UK firmware version?.\nThanks all", "time": "10-26-2017 03:17 PM", "replies": []}]}, {"title": "Android updates? maybe not", "thread": [{"postID": "post6023328", "text": "Does anyone think the Ultra will receive software updates, or will HTC leave the Ultra in the dust and only focus on the U11?", "time": "10-17-2017 04:32 AM", "replies": []}, {"postID": "post6023334", "text": "I think it will receive orio", "time": "10-17-2017 04:42 AM", "replies": []}, {"postID": "post6023335", "text": "Now it is not in dust on noughat most phones is the same", "time": "10-17-2017 04:43 AM", "replies": []}]}, {"title": "3000mAh battery is standard for 2017", "thread": [{"postID": "post5714306", "text": "The U Ultra has often been criticized for it's relative small battery. But as it seems, the S8 won't have a bigger battery, either. Seems to be the standard for this year - and no big deal, either. Battery life has been consistently decent for me - easily lasts through the day - every day.", "time": "03-16-2017 02:39 PM", "replies": [{"postID": "post5715892", "text": "I think battery size is considered being small or large relative to the device its being used in  For example a device with a 5.7\" inch QHD display + a secondary screen with a 3,000 mAh battery i would consider average but a device with a 5.0\" inch 720p display having 3,000mAh i would consider very large. So its all perspective in my mind. \nAs long as the artery lasts me the whole day, i don't mind how big or small it is.", "time": "03-18-2017 01:54 AM", "replies": []}, {"postID": "post5793971", "text": "I think we have reached the limit for size and with the S8, we've seen innovation on software enough to increase battery life. Without increasing battery capacity mind you.", "time": "04-30-2017 04:09 PM", "replies": []}]}, {"postID": "post5714307", "text": "3000 is a HUGE battery... but the size of the battery is sort of an irrelevant number. If the battery life sucks, then either the software sucks or the battery was too small.", "time": "03-16-2017 02:40 PM", "replies": [{"postID": "post5714711", "text": "Weirdly, lots of reviews say battery life is fine, but XDA developers say it's atrocious. Not sure what the difference in testing methods is - mine has been consistently good, comparable to the iPhone 7 Plus it replaces.", "time": "03-17-2017 12:17 AM", "replies": [{"postID": "post5748964", "text": "Xda are power users, may be for that baterry sucks for them.", "time": "04-07-2017 07:19 PM", "replies": []}]}]}, {"postID": "post5714728", "text": "It's standard for a device that is small in comparison.\nRemember, screen-size should be compared to the device's overall dimensions. Far too many people assume that the screen size reflects the device's overall dimensions when in fact, the size of the bezel needs to be taken into account.\nThe truth is, a 3000mAh battery is just too small for the U Ultra's dimensions. \nThe U measures 6.39 inches on height, 3.14 inches on width and 0.31 inches on depth (that's 162.4mm on height, 79.8mm on width and 8mm on depth if you're eager to know how it's like with the metric system). The similarly sized Huawei Mate 9 measures 6.18 inches on height, 3.11 inches on width and 0.31 inches on depth (that's 156.9mm on height, 78.9mm on width and 7.9mm on depth in the metric system).\nNotice that the Mate is slightly smaller overall, and yet it packs a humongous 4000mAh battery. \n3000mAh is large on its own, but in the overall size of the U Ultra, it's rather petite. You might get solid results out of it, but once you use a phone like the Mate 9, you start to wonder how HTC thought that 3000mAh is fine for a device that huge. It's even more damning when you know that there's no headphone jack and HTC didn't even bother to make full use of whatever space it frees up.\nAlso note that it has to power not just a 5.7\" QHD display but a secondary 0.2\" ticker display as well. That's a whole 5.9\" of display space to power. And since IPS LCD hasn't caught on much in terms of display efficiency compared to OLED, it's just not as efficient as its OLED counterparts.\nI'm happy that you get solid runtime out of your U Ultra, but I can't and won't let HTC off the hook for packing a rather anemic battery for such a huge phone.", "time": "03-17-2017 12:50 AM", "replies": []}, {"postID": "post5715233", "text": "I don't think I'd classify the 3000 mAh battery in the U Ultra as \"small\" but it's definitely not what you'd originally expect for a phone of this size. For comparison, LG gets a 3200 mAh in the LG V20 (near identical dimensions to the U Ultra) and it's removable. LG gets a 3300 mAh non-removable in the much smaller LG G6, and OnePlus gets 3400 mAh in the OnePlus 3T.\nI never experienced bad battery life, but I think it's an expectation thing — people think if they're going to use a phone this big, it should have a really big battery. With the optimizations HTC has done, 3000 mAh makes it through a day on the U Ultra, but it definitely isn't the battery life champion some had hoped considering its physical size.", "time": "03-17-2017 12:13 PM", "replies": [{"postID": "post5715375", "text": "I still think they should've stuffed a bigger powerpack.\nIt's not that it's bad. It's just average. And with a phone THAT large, you really start to wonder why that chassis space isn't even used to more potential", "time": "03-17-2017 02:00 PM", "replies": []}]}, {"postID": "post5757225", "text": "I think a lot of it also boils down to bias and subjectivity. Some people will just prefer to dislike certain brands and manufacturers; so they will criticize one specific thing about said brand and ignore the same \"thing\" in a brand they like. The mobile device game is a harsh and critical one...", "time": "04-13-2017 09:30 AM", "replies": []}, {"postID": "post5759140", "text": "When a small (by today's standards) phone like Redmi 3S can pack in a 4100mah battery, what excuse do you think HTC can give for putting in just a 3000mah in Ultra? \nIn fact what excuse does any other brand can give for not putting a huge battery in their phones. \nWhat good is a dead phone? Every android smartphone must have atleast a 4000mah battery or bigger. U Ultra should have had a 5000mah battery but instead they chose to focus on being razor thin.", "time": "04-14-2017 12:05 PM", "replies": []}, {"postID": "post5929163", "text": "3000 mAh does seem to be the standard... I think some people will indeed use their own device biases to determine which specs are \"bad\" versus \"good\" - even if a device they like has that same specification.", "time": "08-19-2017 09:14 PM", "replies": []}]}, {"title": "Does U Ultra only support its own type-c headphone or I can just buy the expensive adapter?", "thread": [{"postID": "post5865102", "text": "and also only type-c power bank? These are a lot of trouble and money!", "time": "06-27-2017 09:59 AM", "replies": []}]}, {"title": "HTC U Play - Android Version", "thread": [{"postID": "post5845831", "text": "Hello,\nWill HTC U play be updated with Android 7?\nThanks,\nAshley", "time": "06-10-2017 10:04 AM", "replies": []}, {"postID": "post5845959", "text": "I think so ! it's a young phone only 4 months old", "time": "06-10-2017 11:56 AM", "replies": []}]}, {"title": "New OTA for UK and EU 1.62.401.1", "thread": [{"postID": "post5835152", "text": "Hi all just saw this on the Internet so checked my Software updates button on my phone and along came this update makes up for not getting the last update here in the UK as we now have the May security update to. No real reports of much changed so far but no negative reports either that I have seen feel free to try for yourself.\nMarc", "time": "06-01-2017 06:47 AM", "replies": []}, {"postID": "post5835207", "text": "Yep, just got it myself.(unlocked UK) .. Big update.. In fact 2 updates...\n1.09.401.4 -> ...401.13 (267MB), followed by ..1.62.401.1 (610MB) MAY security\nso huge update... \nBeen waiting for this.. I know in the 1.15 US update there was better 2nday display functionality, shortcuts, better battery life and Sense Companion was supposed to be improved... but havent tested yet so cant confirm this...\nWhen it boots up... the letter \"U\" rotates and spins round into a \"C\" on HTC.. so new boot sequence and splash screen .. not really an update... but looks damn Cool and sexy .. hehe \nThanks HTC", "time": "06-01-2017 07:42 AM", "replies": []}, {"postID": "post5836205", "text": "Hi all, \nA short while after the update completed I received a message from EE my provider saying I now have WiFi calling, now that really is a big deal for me as my bedroom doesn't get the best signal strength and now I no longer need to worry about it.\nMarc", "time": "06-02-2017 02:44 AM", "replies": []}]}, {"title": "Buy a USB-C to 3.5mm adaptor here", "thread": [{"postID": "post5817688", "text": "After a bit of searching I found this link for an official USB C - 3.5 mm adaptor, which HTC will ship from the US to the UK / EU:HTC Accessories | HTC United Kingdom\nHope this helps anyone", "time": "05-16-2017 06:18 PM", "replies": []}, {"postID": "post5817726", "text": "Thank you for sharing this with other members!", "time": "05-16-2017 07:08 PM", "replies": [{"postID": "post5818106", "text": "No worries, happy to help \nI still think HTC couldve just put one in the box, rather than having to pay an extra £10 on top of an already expensive £650 device... \nits this kind of thing that annoys people, such a small and cheap extra.. lets just hope HTC learn from this and put an adaptor in with the HTC U 11", "time": "05-17-2017 06:44 AM", "replies": []}]}]}, {"title": "Can I flash this on UK Ultra", "thread": [{"postID": "post5817639", "text": "Hey folks\nIm in UK and the 1.15 update with 2nd'ary display notifications and improved battery life still hasnt arrived OTA yet, but I came across this link on XDA:https://www.androidfilehost.com/?w=f...70e2264a624713\nDoes anyone know if this will work on a UK unbranded U Ultra..\nThanks", "time": "05-16-2017 05:23 PM", "replies": []}, {"postID": "post5817714", "text": "Ive tried to download this file 3 times and unpoacked with both winrar and 7-zip... each time theyre corrupt, so its a no go, waiting for the OTA to arrive", "time": "05-16-2017 06:53 PM", "replies": []}]}, {"title": "U Ultra case.", "thread": [{"postID": "post5706880", "text": "Has anyone found a case for this phone yet? All of the case manufacturer I usually by from have nothing out, so I decided to give this one a try.\nHTC U Ultra Case, LK Ultra [Slim Thin] Scratch Resistant TPU Rubber Soft Skin Silicone Protective Case Cover for HTC U Ultra (Clear) https://www.amazon.com/dp/B01MY7OK04...cUvbUpU5706880", "time": "03-09-2017 10:14 PM", "replies": []}, {"postID": "post5706941", "text": "I'm planning to just use the case that comes in the box. Looks minimal and shows off the blue color. Minimal protection I know but with uh oh protection I'll probably take that risk.", "time": "03-09-2017 11:24 PM", "replies": []}, {"postID": "post5707120", "text": "The included one is indeed minimal, but in combination with a decent glass screen protector it's really good enough. Mine already fell off a bookshelf and survived unscathed :-)", "time": "03-10-2017 03:53 AM", "replies": []}, {"postID": "post5711076", "text": "But to keep this alive: any suggestions for ultra thin cases? I wouldn't want to add too much bulk. It's already a big phone ...", "time": "03-13-2017 04:08 PM", "replies": []}, {"postID": "post5781930", "text": "Hi all I picked up my U Ultra 4 days ago and as always I needed a decent case for it I really didn't like the one in the box unlike the one that came with my M8. I found this one from Spigen on Amazon and it fits really well without adding too much bulk. It negates the Camera bump so is easier to use laying flat on a desk or table top plus it looks really good and is comfortable to hold whilst adding more than enough protection IMHO you can see it at the link below.https://www.amazon.co.uk/dp/B01NBWMR...cUvbUpU5781930\nMarc", "time": "04-24-2017 01:53 PM", "replies": []}, {"postID": "post5804569", "text": "I have two cases for the U Ultra and depending on the situation I use both. The first one is a soft and is much better than the included hard case:https://www.amazon.de/gp/product/B06...ndrocentr0a-21\nand the second one:https://www.amazon.de/gp/product/B01...ndrocentr0a-21\nI have also found an official HTC leather flip case:https://www.amazon.de/HTC-Alpine-Lea...ndrocentr0a-21\nI haven't bought it yet, but it is nice to see that HTC is making a wallet case for the Ultra. I just don't understand why it is not advertised on HTC's website.", "time": "05-07-2017 09:52 AM", "replies": []}]}, {"title": "Secondary Display clock stuck on 24 hour format", "thread": [{"postID": "post5725379", "text": "I'm not sure how many others are having this problem with the U Ultra, but mine is. I chatted online with HTC support and after going through several troubleshooting steps to no avail they finally discovered this was a known issue. They said the fix should be available in the next update but they couldn't tell me when it would be available.", "time": "03-25-2017 02:11 PM", "replies": []}, {"postID": "post5788200", "text": "It's fixed. Mine isn't showing 24-hour time.", "time": "04-27-2017 12:13 PM", "replies": []}]}, {"title": "Color temperature?", "thread": [{"postID": "post5780007", "text": "How have you configured the color temperature setting? I find the default setting to be too warm and I have set mine to two steps on the right, towards cold.\nPlease share your setting here. Thanks", "time": "04-23-2017 04:46 PM", "replies": []}]}, {"title": "My Review on the HTC U Ultra", "thread": [{"postID": "post5694962", "text": "Well, there doesn't seem to be much activity or review for this phone just yet (since it hasn't been release worldwide yet), so hope you guys won't mind me sharing mine. I did a video review for the phone, but if you want a more summarised version, just read below to save time. \nIn a nutshell, i would say this is a really decent smartphone. The camera is actually remarkably good, with consistent performance and natural looking colours. The performance is decent. The software experience, other than HTC's skin, works mostly similar to stock Android with some google apps as the default. The design is pretty striking too in the sapphire blue variant, albeit having big bezels.\nBut it's a phone that I probably wouldn't recommend most people to get at this point in time with the newer phones announced, or going to be announced soon. Especially not at its asking price.\nWhen I compare it to devices like the V20, Mate 9, Google Pixel, Galaxy S7 Edge (all of which I've tested myself), there isn't really anything that is particularly impressive on the U Ultra. Even when comparing it to the HTC 10 it's not a clear win for the U Ultra. While the U Ultra has a bigger screen, better rear camera, it loses the headset jack (not a huge deal for me, but some people might not like it), loses the OIS on the front camera, and the battery life doesn't seem be be as good (with the second screen on).\nAnd i'm still comparing it to devices from 2016 at this point. I can't help but feel like the phone came out a bit too late. It's still a really nice phone for most people I think, but for the more tech savvy, the only reason to go for the U Ultra would probably be the design and someone who wants a bigger HTC flagship device.\nIf you watched my video, you'll probably find it a bit on the negative side of things, and I really can't help it. I've been a fan of the company's product since the One X. And really its main series of smartphone has been constantly decent (except for the One M9 IMO), and perhaps a little bit too constant considering how much other manufacturers have improved. But in the past years of so, its product lineup has been somewhat of a mess (HTC 10 Lifestyle, Desire 10 Pro, One M9+, One E8, One E9+, One ME, One X9, One A9, etc). \nThis makes the U Ultra more heartbreaking disappointing to me considering how much expectations I had from the company. Especially after what I considered to be their return to form with the HTC 10. Anyway, hope this review will be helpful for those considering to get this phone. It's still a good phone, but perhaps I was just expecting a bit too much. If only the phone was priced more reasonably.\nAnyone already got the phone or thinking about it? Will love to hear your thoughts on the phone too!", "time": "02-28-2017 11:04 PM", "replies": []}, {"postID": "post5694994", "text": "THanks for the review.. I subbed.", "time": "02-28-2017 11:56 PM", "replies": []}, {"postID": "post5699032", "text": "Well done!", "time": "03-04-2017 09:13 AM", "replies": []}, {"postID": "post5699166", "text": "I've had mine for a while now. The only downside for me is the lack of a headphone jack. Considering that it won't work with any of the USB-C adapters I tried, this is a fatal flaw. Other than that it's pretty much the same as the LG G6 hardware wise and has the exactly same price. While 749$ isn't exactly cheap, it seems that all manufacturers have together decided to hike the prices this year. I believe the U Ultra will end up being one of the more moderately priced phones this year. The Huawei P10 Plus costs more, the S8 and the Sony XZ Premium will both be considerably more and the new iPhone will likely go for over a grand. The problem with the U Ultra is that it's fairly mainstream. It's the same device as the LG G6 and the Huawei. So why would anyone buy the one without the headphone jack if the others all have it and cost the same?\nThe 821 processor is a non-issue by the way. Early benchmarks of the S8 with its 835 are fairly discouraging. The S8 is barely faster than the S7. The 821 might actually turn out to be the better choice as it's quite low power and runs very cool. \nThe battery in the U Ultra isn't huge, but it lasts a full day and charges extremely fast.\nThe question remains: why buy this one rather than, say, a Pixel XL or an LG G6? Since they're all the same, it really doesn't matter. The second screen is very gimmicky and really does absolutely nothing for me. The lack of a headphone jack and no adapter available plain sucks. If it were priced 100$ less, it'd probably sell OK, but as it stands now, this will be a failure for HTC, IMO. One that could easily be fixed, though: make it a bit cheaper and send the buyers an audio adapter.", "time": "03-04-2017 11:25 AM", "replies": [{"postID": "post5699972", "text": "Thanks for the review! Yeah, the price is just a bit hard to swallow for what it does in my opinion. I would just go with the Pixel XL for this kind of money. Or cheaper options like V20, Mate 9 or even the HTC 10 still holds up well and offers similarly decent experiences.", "time": "03-05-2017 08:44 AM", "replies": []}, {"postID": "post5708473", "text": "Great review!\nI have been wondering when this will land here in South Africa, but knowing HTC, it will be months. I'm sad to here it does not have a 3.5mm jack, HTC were many years ago the anti-Apple of Android OEMs while Samsung were creating iPhone look alikes with the 1st Galaxy S.\nNow HTC seem to want to do everything Apple does and it is not helping them at all.Early S8 benchmarks? The phone and is not even announced let alone released, the Snapdragon 835 is still not in final form either even the Sony Xperia XZ Premiums at MWC were nowhere near production products, so i imagine any benchmark of the 835 would be crap as:\n1. No benchmark has been updated to fully​ support the SoC\n2. The phones being run on these benchmarks are on Beta Software at best, lol , of course the benchmarks will be horrible.\nPeople make this same mistake every year, and the 1sr reaction is that the new SoC is bad, and then it's benchmarked in a retail device and blows everything out the water.", "time": "03-11-2017 07:20 AM", "replies": [{"postID": "post5708890", "text": "Benchmarks aren't everything. The U Ultra fares worse in Geekbench than the S7 EDGE and the iPhone 7 Plus, yet in real-life use it just feels a lot zippier than either one of these.", "time": "03-11-2017 02:48 PM", "replies": [{"postID": "post5708896", "text": "Indeed, that is the other argument.\nWe can't judge anything strictly on benchmarks, i personally don't even look at them anymore, I am not even sure what the new standard scores are in AnTuTu or Geekbench, some of these benchmarks even go out of style, LOL, remember Quadrant!!? That thing was thee benchmark in the Gingerbread days.\nAll I am saying is that we can't judge a device that has to even be announced or released, especially with figures achieved on devices are not even final.\nThe other argument is can we even compare iPhone and Android benchmark scores when the 2 OSs work so differently!? It all gets rather messy.", "time": "03-11-2017 02:55 PM", "replies": []}]}]}]}, {"postID": "post5699490", "text": "There is no audio adapter in the box?", "time": "03-04-2017 07:12 PM", "replies": [{"postID": "post5699838", "text": "Nope. And there doesn't seem to exist a compatible one at the moment, either.", "time": "03-05-2017 04:50 AM", "replies": [{"postID": "post5700171", "text": "Interesting. What adapters have you tried?\nI'm very interested in this because it's probably be best clue we have to what HTC will do in their next flagship, though no guarantee it will be the same. In particular I'm interested in whether they have a decent DAC and amp in the phone and can output analogue audio via the USB-C, or whether they output only digital audio which then requires a DAC and amp in the dongle (like Apple, and since nobody wants to pay good money for a dongle that means using cheap components). I could live with the former, the latter would be a deal-breaker for me.", "time": "03-05-2017 12:21 PM", "replies": []}]}]}, {"postID": "post5700749", "text": "I don't have any adapters to try, but my friend tested a few when he still had the phone and nothing worked. I received a software update to this app by HTC afterwards though, not sure if it helps. I use primarily wireless earbuds, so I almost never 3.5mm earphones.https://play.google.com/store/apps/d...c.fwupdatetoolAudio Jack Adapter ToolkitToolkit to support USB-C Digital to 3.5mm Audio Jack Adapter firmware update.", "time": "03-05-2017 11:01 PM", "replies": [{"postID": "post5701543", "text": "I tried after the update and the adapters still don't work. I tried one made for Motorola phones and another generic one", "time": "03-06-2017 02:32 PM", "replies": []}]}, {"postID": "post5700882", "text": "Thanks. Unless it's poor wording that does imply active components in the adapter, which isn't encouraging for my preferences.", "time": "03-06-2017 03:47 AM", "replies": []}, {"postID": "post5701663", "text": "It's curious that they sell an adapter for the Bolt but if you look for accessories for the U Ultra it's described as \"coming soon\" (or was yesterday). Genuinely different adapters, or a bookkeeping error?", "time": "03-06-2017 04:12 PM", "replies": [{"postID": "post5702804", "text": "Yeah, not listed in Europe. HTC Europe told me there isn't one.", "time": "03-07-2017 11:54 AM", "replies": []}, {"postID": "post5709006", "text": "I just received the U Ultra 3.5mm adapter. It is the same adapter as the Bolt.", "time": "03-11-2017 04:44 PM", "replies": [{"postID": "post5709017", "text": "Is this something you can buy of Amazon or it needs to be this particular one. I assume any USB C to 3.5 mm Jack should be fine and I rather buy from Amazon with fast prime shipping than direct from HTC.", "time": "03-11-2017 04:56 PM", "replies": [{"postID": "post5709106", "text": "I ordered this one form HTC. It was under the Ultra accessories section. I don't know if any other will work. I am actually waiting for my Ultra to come Monday to make sure this one works.", "time": "03-11-2017 06:27 PM", "replies": [{"postID": "post5709496", "text": "If it works, would you be willing to buy one and forward it to me in Switzerland if I PayPal you the amount in advance? I'm kind of bummed (and desperate) because HTC doesn't offer an adapter in Europe and third party ones don't seem to work. Also, sorry for asking you so bluntly :-/", "time": "03-12-2017 03:37 AM", "replies": [{"postID": "post5709641", "text": "Yes I will. I will let you know if it works tomorrow.", "time": "03-12-2017 08:49 AM", "replies": [{"postID": "post5711079", "text": "Thank you!\nMore reviews in now - largely confirm my impression: battery life is fine. Light bleed seems to be present on all of them and seems to have to do with the secondary screen construction. To be honest, it's a very minor issue (and I'm quite fussy with my screens) and compared to the very often present color casts and tint issues on AMOLED screens, it's nothing.\nOther observations: it's fast, fast, fast. Very much like the Pixel - absolutely no lag whatsoever, extremely fast app open time and excellent memory management. \nAlso, Google Assistant now working like a charm, I can even control my Samsung Smartthings devices with it.", "time": "03-13-2017 04:11 PM", "replies": []}]}, {"postID": "post5711084", "text": "I got my phone today. This adapter work great. When I plugged the adapter into the phone, it immediately gave an update message. After the update, I got another message letting me know that the adapter is using the phone as an power supply.", "time": "03-13-2017 04:17 PM", "replies": []}]}]}]}]}]}, {"postID": "post5702309", "text": "The review mentioned what is main primary con about HTC U Ultra: HTC U Ultra FAQ, Pros, Cons.", "time": "03-07-2017 04:01 AM", "replies": []}, {"postID": "post5703150", "text": "Yeah, you have to look at the US site to see it at all.", "time": "03-07-2017 04:18 PM", "replies": [{"postID": "post5703191", "text": "Here is a link:http://forums.androidcentral.com/e?l...token=0sQU8MW9", "time": "03-07-2017 04:48 PM", "replies": [{"postID": "post5704275", "text": "Doesn't help me as I can't order from there", "time": "03-08-2017 11:22 AM", "replies": []}]}]}, {"postID": "post5703804", "text": "Do the included earbuds work with other USB-C devices? \nThe HTC Bolt doesn't have a jack too, and its included earbuds don't work with other USB-C devices.", "time": "03-08-2017 05:31 AM", "replies": []}, {"postID": "post5705329", "text": "J Will's unboxing of the U Ultra.https://www.youtube.com/shared?ci=54kaOMDuGww", "time": "03-08-2017 08:39 PM", "replies": []}, {"postID": "post5707121", "text": "another full review.", "time": "03-10-2017 03:54 AM", "replies": []}, {"postID": "post5707798", "text": "Honestly, considering the feedback here (or lack thereof) and elsewhere, I'd seriously be surprised if this phone were selling.", "time": "03-10-2017 02:48 PM", "replies": []}, {"postID": "post5735286", "text": "All fair points made. I love my Ultra though. By all reasonable measurements this isn't a phone I should love but (for me) it is the story of the sum exceeding the parts. I've sold my OP 3T and my Mate 9 is for sale; that's how much I like my Ultra. \nThe battery is and always will be a concern. Perhaps One will finally allow Android to challenge iOS in lingetivity but until then my iPhone 7 Plus will remain the only device I own that doesn't make me battery anxious. \nMy only other concern is updates, already I'd want a newer security patch as I'm still on January.", "time": "03-31-2017 09:48 AM", "replies": []}, {"postID": "post5775531", "text": "Glad the camera is functioning well, and that users are enjoying it! I've always had a soft spot for HTC.", "time": "04-21-2017 05:15 PM", "replies": []}, {"postID": "post5776822", "text": "I got the Ultra yesterday and I am still in the honeymoon phase with it, but here are my first thoughts:\nWhat I like:The design is amazing. I have the black version and it is absolutely stunning. Fingerprints are not an issue and the device feels great in the hand. Much better than the HTC 10The second display is not a gimmick. It is very useful for notifications, and for quick shortcuts to contacts and apps. I use it a lot in these two days. Of course, important is to see what happens with usage when the novelty wears off. I really like it so farThe fingerprint sensor works very well, better than on the HTC 10Battery life: The press has been complaining about the 3000mAh battery of the Ultra, but it lasts the whole day with no issues. It is interesting that the same press doesn't have a problem with the Samsung S8 and its battery capacity..I wonder why is this happening (bias or money from Samsung)Audio quality is great. The speakers are really good and the sound through the usb-c speakers very very goodThe camera is great, better than on the HTC 10.The UI: Typical Sense, very fluidThe display is amazing. Very good brightness and sunlight visibility\nWhat I don't like:The device is very big. 90% of the time I don't mind that, but some people might have issues with the size of the device.The capacitive buttons could be placed better, more central.The Sense companion is useless so far. That might change in the future, but I wouldn't keep my hopes up. We will see.\nOverall, this is a top device and the press is just flat out lying about it. I understand that HTC doesn't have the marketing power of Apple or Samsung, but the press should try to be more objective. I watched the review video of the S8+ from Android Central and I was really mad. It was like a marketing pitch from Samsung. I wonder why this is happening..\nAndroid Central and other members of the press are not treating all manufacturers in the same way. \nLet me give you some examples:\nThe S8 has a small battery for its display size? No problem. It is a Samsung device so this regression is not important.\nThe HTC U Ultra has a small battery? All hell breaks loose. HTC didn't deliver\nThe S8 hat a badly positioned fingerprint sensor? It's ok, don't worry. It's a non issue..If other OEMs did that, the press would punish them hard.\nThe S8 has an Edge display which causes a lot of trouble because people might accidentally press the sides/edges of it. \nThe S8 has a UI which drops frames and is not as fluid as the Pixel or other devices (just read Ars Technicas review).\nWhy Android Central? I understand that you are a company that needs to make money, but you should be more objective.\nNo device is perfect, but when you present the same topic differently, depending on the device you are testing. Very sad.\nAnyway, the HTC U Ultra is a great flagship and it deserves much better sales..", "time": "04-22-2017 07:56 AM", "replies": [{"postID": "post5779268", "text": "Thanks for this.\nWhat do you mean by USB C speaker?? Is it not the same speaker setup as in the 10? \nIs audio as good or better than on the 10, both through headphones and through the speakers?\nHow do you compare the Ultra to the current hype jobs overall?\nAlso, what is Sense Companion?", "time": "04-23-2017 10:58 AM", "replies": []}]}, {"postID": "post5779175", "text": "Hi all,\nI had my M8 for a little over 3 years and loved it but decided I wanted a new phone and at first was drawn to the Pixel XL but there was something that just didn't feel right about it to me really not sure what it was but it was there. Also I really don't like AMOLED screens despite what the majority seem to feel so that was another thing that drew me to the U Ultra. I also have no light bleed anywhere on the screen and have to say I have mine on full brightness nearly all of the time and tend to use dark wallpapers so if it was there it would of shown up by now and the screen is absolutely brilliant being bright and clear. I managed to get an awesome deal on a 2 day old Black U Ultra although I think I would of still got one even if I had to pay full price to me HTC just build awesome phones and this one doesn't disappoint on build quality. I am finding the 2nd display to be really useful and a good addition and also don't get all the negative reviews and general hate that so many are giving for this phone. I chose this over any of the other so called flagship phones and have no regrets at all and seriously don't get all the fuss made about only having a Snapdragon 821 as I really think the differences between it and the 835 are going to be so slight as to not really be worth worrying about. Same goes for the battery size non issue IMO as I'm sure everyone would be complaining about how much heavier the phone would be with a larger battery and the fact it has fast charging sort of negates this issue to IMO plus it easily lasts me a day anyway. So despite what so many claim I actually think the U Ultra is a great flagship smartphone/phablet and can and will hold its own against the usual suspects but of course others are free to disagree.\nMarc", "time": "04-23-2017 10:16 AM", "replies": []}, {"postID": "post5779803", "text": "I meant USB-C earphones and not speakers.\nI think that the Ultra is a bit louder but I would say that both devices deliver a very good audio experience. \nSense Companion is HTC's AI, like Google Assistant, but it works by making suggestion according to your lifestyle (apparently). I am not getting a lot of value from Sense Companion for the moment, but I don't mind since all AI are not very useful..\nThe Ultra is a top device and if this were a Samsung device everyone would rave about it. The press concentrates on things that are not really important. The press is forgetting the value of a really fluid user experience, a great design and overall package.", "time": "04-23-2017 03:03 PM", "replies": [{"postID": "post5779903", "text": "I agree completely with your last sentence.\nIt's as if it's a crime to make a smooth, tasteful and well thought out experience, gimmick free.", "time": "04-23-2017 03:54 PM", "replies": []}]}]}, {"title": "Sd card HTC ultra", "thread": [{"postID": "post5769322", "text": "I just got my HTC ultra where do I buy a sd card I would like THE largest yet practical card. And price make and who to buy it from thanks John Herold DallAS tx.", "time": "04-19-2017 02:11 PM", "replies": []}, {"postID": "post5771135", "text": "Hello!\nThe HTC U Ultra is compatible up to 2TB expansion for the SD card slot. I love companies that make this claim because a 2TB card hasn't come to market yet . For me, 128 GB is always plenty of room, but your mileage may vary. Below is a great article from the folks here at AC describing the differences between cards and then I've placed another article about the best ones for Android. I personally really like Scan Disk or PNY as a brand, but the ones listed in the article are all very reliable. Hope this helps!Android and SD cards: The Ultimate Guide | Android CentralBest MicroSD Card For Android | Android Central", "time": "04-20-2017 08:11 AM", "replies": []}]}, {"title": "U ULTRA Video Screenshots???", "thread": [{"postID": "post5732044", "text": "I like having the option to film a video then capture screenshots. \nThis is excellent for pets n children that don't stay still.\nMy One M9 done this, no issues.\nThe U ultra however, when you pause, it stays in the middle of the screen making it impossible to not get an obstructed screenshot.\nIs there something I'm not doing or has HTC just buggered that up for me?", "time": "03-29-2017 11:01 PM", "replies": []}]}, {"title": "Bluetooth keeps turning itself off", "thread": [{"postID": "post5727646", "text": "I'm not exactly sure why, but the bluetooth keeps shutting itself off. That is my only compliant about this phone other than no IP rating. It's been a great phone. The camera is not 2107 level, but I have a DSLR for that. It's fast, and the battery life is great!", "time": "03-27-2017 12:21 PM", "replies": []}, {"postID": "post5727889", "text": "Does the Bluetooth radio actually turn off, or does it just drop the connection to your Bluetooth device?\nDoes this happen in Safe Mode? HTC U Ultra - How do I restart my phone into Safe mode? - Support | HTC United States", "time": "03-27-2017 03:21 PM", "replies": []}, {"postID": "post5731159", "text": "It just shuts off. I haven't tried safe mode yet.", "time": "03-29-2017 03:32 PM", "replies": []}]}, {"title": "HTC U Ultra(Unlocked US Variant) seeing VoLTE on at&t?", "thread": [{"postID": "post5711800", "text": "Anyone purchase this phone for use on at&t? Are you seeing VoLTE like the the unlocked a9 and 10 did?", "time": "03-14-2017 10:32 AM", "replies": []}, {"postID": "post5711875", "text": "I'm using it on T-Mobile but I don't see any reason why it won't if the previous unlocked HTC variants supported it. Think very few people have this device so best is to reach out HTCUSA on Twitter and ask them as well.", "time": "03-14-2017 11:29 AM", "replies": [{"postID": "post5712180", "text": "bhatech, how do you like the U Ultra? I know you are, like me, kind of a phone \"junkie\" who tries a lot of different phones.", "time": "03-14-2017 03:04 PM", "replies": [{"postID": "post5712204", "text": "I love the design and audio. Feels great in the hand without the case but with the included case it's little slippery and difficult to handle.\nSound thru the U Sonic earphones is phenomenal, speakers are good. It's​ snappy and camera is good but not better than Pixel both in camera and smooth feel. I'm loving the second display a lot especially notifications show up, shows next event, music controls etc. Not must have but it definitely doesn't hurt.\nOverall solid phone, battery life average, but being honest they will have hard time convincing lots of people pay this much money. They should have included headphone jack, waterproofing and wireless charging. With those features I think they would have sold in some meaningful numbers among tech enthusiasts. I'm actually more excited about what they do for HTC 11. Generally it's a hard sell for anything not Samsung or Apple, so HTC can't have missing features what other competitors have to even sell in some quantities.", "time": "03-14-2017 03:25 PM", "replies": [{"postID": "post5712462", "text": "Thanks a lot. It looks really good and I may try it. I am just concerned about its massive size. I have used the V20, Mate 9 and iPhone 7 plus and to think it is a little bigger than all of them is a little scary. It looks like it may feel a little smaller than some of them with the smooth and rounded edges, kind of like the jet black 7+ does not feel as huge as it is. It is pricey and that is unfortunate. I have lost interest in the S8 unless there is a surprise we do not know about and the G6 looks pretty good and I will probably try it, but I am just not a huge fan of LG. They have too many quality control issues and always seem to have some shortcoming in their phones. The Pixel could have been great, but Google just fell a little short. If I like the U Ultra, I will probably use it and the G6.", "time": "03-14-2017 08:11 PM", "replies": [{"postID": "post5712594", "text": "The U Ultra is almost comparable to iPhone 7 plus in size. If you can handle iPhone 7 plus, you can handle the U Ultra. I think they will have the HTC 11 again closer to 5.1 to 5.3 inches range and this is their phablet. If size bothers your I think HTC is planning a 835 device in summer. I'm thinking sometime around July we might see the HTC 11. And G6 does look like a good option as well.", "time": "03-14-2017 11:28 PM", "replies": []}]}]}]}]}, {"postID": "post5712639", "text": "It isn't really wider than the 7 Plus, so wouldn't worry about the size, really. The price is a different matter. Here in Switzerland, it's (sadly) pretty average. Most handsets cost between 700 and 1100$ here, so 750 is actually not too bad :-) what worries me more is the light bleed, which seems to be a general manufacturing issue and at premium handset prices, that's a big no-no. Still better than the purple tint I had on my Pixel XL, though :-)", "time": "03-15-2017 12:44 AM", "replies": []}, {"postID": "post5712798", "text": "No VoLTE on AT&T. The US Unlocked version of the phone is pretty much identical to the International variant. There is not AT&T stuff baked in like the HTC 10 had. I've had it for a week now, and although I love the build quality, the software isn't as smooth compared to my Pixel XL and the camera isn't as good for capturing toddlers in motion. I'm 95% sure I am going to send it back today. Especially since I can get it for $650 on eBay if I really want it, and that is for the dual SIM version with the same bands as the AT&T unlocked.", "time": "03-15-2017 07:47 AM", "replies": []}, {"postID": "post5714310", "text": "Agreed on the camera, zy2jdmbfan. The image quality is very good, but the auto focus is too slow and not accurate enough. It takes fantastic still pictures but for photographing kids running around in dimly lit rooms, it's not fast enough. \nAs for the performance - I've had the Pixel XL before and can't see any difference whatsoever. It's still blazing fast after 2 weeks!", "time": "03-16-2017 02:41 PM", "replies": []}]}, {"title": "HTC Sense Companion now live!", "thread": [{"postID": "post5712085", "text": "Sense Companion just turned itself on on mine. Not sure yet what it does, though 😁", "time": "03-14-2017 02:07 PM", "replies": []}, {"postID": "post5712209", "text": "Yeah I got the update yesterday but decided not to use it since got to share all my personal info etc with HTC sense. I'm mean I'm already sharing everything with Google and assistant is present on this phone so no reason for me to share all the data with one more company like HTC. At least with Google the data I share will be somewhat useful since it's cross platform service but with HTC sense companion it's only with HTC devices. I don't know how I feel about this, for now I decided to give it a pass.\nSame with Samsung with their bixby service they will launch with S8. I'll stick with Google since I move between various devices and assistant will provide me more value.", "time": "03-14-2017 03:32 PM", "replies": []}, {"postID": "post5712637", "text": "Yeah, these are all valid arguments. I fail to see why each manufacturer has to come up with its own half-baked AI solution all of a sudden, considering that Google and Microsoft already have stuff that works extremely well. The same can't be said for Apple, but there third-party services aren't an option, either, so they get away with it :-)", "time": "03-15-2017 12:41 AM", "replies": []}]}, {"title": "Cant Manually adjust Exposure in Autp Mode? - Frustrating..", "thread": [{"postID": "post5707606", "text": "The camera on the U Ultra is fantastic.. Yep, finally HTC have done it at last.. However, an issue Ive encountered is.. In Auto mode, you have the option of adjusting Exposure value by means of a slider on the screen without having to open Pro mode .. similar to the cameras on the Motorolas.\nNow is it me or is anyone else having problems adjusting that slider once youve tapped the screen to focus.. So.. holding your finger on the focus ring and dragging up and down doesnt work, it just. activates the \"AE and AF Lock\"... or tapping the screen to focus then trying to re-tap on the Exposure bar.. doesnt work either, that just re-focuses somewhere else .. \nIn the camera settings there is \"Touch to expose\" toggle, but I want to be able to focus and set exposure independently and quickly\nHas anyone else figured the skill yet or is it a bug?", "time": "03-10-2017 12:41 PM", "replies": []}, {"postID": "post5707794", "text": "I can confirm that behavior. Seems to be a bug. As for the camera quality: it's been a mixed bag for me. In low light, my iPhone 7 Plus' shooter is definitely better. In decent light, I'd say the Ultra is ahead. \nWhat they have done, however, is speed. This is one fast SOB of a phone. I've just compared the load times for the apps between the Ultra and the iPhone 7 Plus and the Ultra came in first almost every time. It's blazingly fast.\nReception (both cellular and WiFi) is also absolutely fantastic. I get 4 bars of WiFi where the iPhone barely manages to hold on to the signal. Same goes for LTE", "time": "03-10-2017 02:46 PM", "replies": []}, {"postID": "post5711455", "text": "Im glad im not the only one, but Ive found the solution.. for now... \nWhen you tap t9 focus, you have to re-tap that on- screen bar instantly.. 100th of a second lightning fast.. then drag.. So HTC need to increase that re-touch / re-tap to drag time... but ive posted a comment on their HTC Camera app on Play store.. maybe others could if you guys are having this same issue.. place a comment, so they fix it \nI havent used an iphone since the iP6, but I agree Low light could use some work, but its a stunning come back from HTC and I dont regret my purchase one bit, best phone Ive bought in months.. and thats saying somethings.. I change phones ALOT \nIve always liked HTC ever since the ONE X days so lets just hope that this current \"HTC hate\" Samsung 835 SoC bu+t kissing that sweeping reviews at the moment dies out soon.. it would be nice to see HTC get some love ..", "time": "03-13-2017 11:18 PM", "replies": []}, {"postID": "post5711456", "text": "Like all HJTCs, connectivity is first rate, both Cell ane Wifi, I also get full 4 or 5 bars...", "time": "03-13-2017 11:19 PM", "replies": []}]}, {"title": "Is anyone pre-ordering the U Ultra", "thread": [{"postID": "post5693259", "text": "After seeing the LG G6 I have decided to pre-order the U Ultra. Is anyone else making the leap.", "time": "02-27-2017 03:27 PM", "replies": [{"postID": "post5699170", "text": "Yeah, I already have it. It's pretty much the same as the G6 minus the headphone port. I prefer HTC's UI, however.", "time": "03-04-2017 11:30 AM", "replies": []}]}, {"postID": "post5699958", "text": "For what it's worth..G6 is IP68 as well..", "time": "03-05-2017 08:21 AM", "replies": [{"postID": "post5699989", "text": "I will admit the IP68 rating is a nice feature and one that I would not mind having. But I started only buying unlocked phones because T-Mo charges a 20 dollars fee for the privilege of buying a phone from them. \nThe feature I need the most is Wi-Fi calling. The Nexus, Pixel, and HTC phones are the only unlocked phones that I have found that is compatible with that feature.", "time": "03-05-2017 08:57 AM", "replies": [{"postID": "post5701125", "text": "I wonder how long that's going to last given T-Mobile's unceremonious but quiet dumping of the 10 last year. Is T-Mo selling any HTC phones these days?", "time": "03-06-2017 09:33 AM", "replies": []}]}]}, {"postID": "post5704639", "text": "Got tempted and ordered today even though I don't need this. Says will ship March 10 hoping they will ship on Thursday since I'll get on Friday instead of Monday if they ship on Friday.\nOrdered the blue sapphire.", "time": "03-08-2017 02:25 PM", "replies": [{"postID": "post5705201", "text": "I pre-ordered on 2/24 and there is still no ship date showing.", "time": "03-08-2017 07:33 PM", "replies": [{"postID": "post5705207", "text": "It won't show up on your order I think. They updated their website today, orders will ship March 10th. There is a chance it can ship Thursday as well according to @HTCUSA twitter account. All orders will be shipped out by Friday I guess.", "time": "03-08-2017 07:34 PM", "replies": []}]}]}, {"postID": "post5705243", "text": "I haven't, but I'm very interested in seeing this phone in action. Always looking out for my next upgrade choice!", "time": "03-08-2017 07:49 PM", "replies": []}, {"postID": "post5706826", "text": "I just got tracking info. My U Ultra will be here Saturday.", "time": "03-09-2017 08:55 PM", "replies": []}, {"postID": "post5706863", "text": "Got tracking number, ordered Wednesday morning with overnight shipping. Shipped today for delivery on Friday. Blue color, HTC.com US order.", "time": "03-09-2017 09:50 PM", "replies": [{"postID": "post5706887", "text": "I ordered on 2/25 with overnight shipping. I got tracking number tonight to be delivered Saturday. Blue from HTC US.", "time": "03-09-2017 10:19 PM", "replies": [{"postID": "post5706894", "text": "You should get Friday not Saturday. Also they ship by FedEx standard overnight which delivers on weekdays only. Did you check tracking detail ?", "time": "03-09-2017 10:22 PM", "replies": [{"postID": "post5706907", "text": "I just checked the details. It is end of day Saturday.", "time": "03-09-2017 10:37 PM", "replies": [{"postID": "post5706908", "text": "Yeah they shipped yours via FedEx home which delivers on Saturday. Did you opt for overnight? Mine is FedEx standard overnight not FedEx home. I had opted for next day delivery during order.", "time": "03-09-2017 10:39 PM", "replies": [{"postID": "post5706933", "text": "I did select overnight.", "time": "03-09-2017 11:10 PM", "replies": [{"postID": "post5706935", "text": "Weird u should call them and ask you to refund the $10 they charged for overnight \nThey shipped Thursday and you are getting Saturday which is not overnight. Atleast lucky you are getting only one day late instead of Monday. But still you paid overnight so should have got Friday.", "time": "03-09-2017 11:14 PM", "replies": [{"postID": "post5706954", "text": "I agree, I thanks I will do that.", "time": "03-09-2017 11:36 PM", "replies": []}]}]}]}, {"postID": "post5707160", "text": "Kind of ticked off right now. The notification shipping notification I got was for the 3.5mm USB C adapter and not the phone. As far as I can tell, my card had not been charged yet so that means it has not shipped.", "time": "03-10-2017 05:16 AM", "replies": [{"postID": "post5707346", "text": "Wow that sucks sorry man. Call them and at least try to score some freebies because of the delay. I know not ideal but let them know they you are unhappy and everyone else's orders are shipped.", "time": "03-10-2017 08:44 AM", "replies": [{"postID": "post5707915", "text": "The rep with HTC was basically useless. I just ended up placing another order today. The HTC rep said I should get my order by the 15th.", "time": "03-10-2017 04:32 PM", "replies": [{"postID": "post5707916", "text": "What happened to your previous order?", "time": "03-10-2017 04:33 PM", "replies": [{"postID": "post5707923", "text": "It is still in a pending status on PayPal. HTC is blaming PayPal and PayPal is blaming HTC for the order not going through. I just said forget and placed another order. The charge has already went through with this order.", "time": "03-10-2017 04:38 PM", "replies": [{"postID": "post5707927", "text": "Grr... good luck. Hopefully you get your device soon", "time": "03-10-2017 04:40 PM", "replies": []}]}]}]}]}]}]}]}]}]}, {"postID": "post5706905", "text": "I got my shipping info this morning. The Saphire Blue beast will be here tomorrow.", "time": "03-09-2017 10:35 PM", "replies": []}, {"postID": "post5707796", "text": "What makes things worse: the USB C adapter probably won't work anyway :-/", "time": "03-10-2017 02:47 PM", "replies": []}, {"postID": "post5707907", "text": "Got the phone just now. Feels great, blue is sexy and it's a shame I have to put some case on this. Just feels great to pick up and hold. Setting up things now and playing around.", "time": "03-10-2017 04:22 PM", "replies": [{"postID": "post5707925", "text": "Let me know how you like it once you get a chance to play with it.", "time": "03-10-2017 04:40 PM", "replies": [{"postID": "post5707933", "text": "Feeling good as of now but that's because it's new shiny toy \nGot to see how it feels after few days. It's little bigger than pixel xl and feels little tough to handle with case. Without case it looks stunner and even feels nice and balanced to hold. Just listening to the ultra sonic ear phones it comes with and damn impressed. Display looks fine, nowadays all of them look good. Initial impressions at least is great, need you see how I feel after the new phone hype dies down.\nEdit: I do see light bleed where the secondary display meets the main display. More prominant under some darker background. Some reviews mentioned this and it's present. Personally never bothered me, but I think lot of people are going to be pissed especially given the price.", "time": "03-10-2017 04:44 PM", "replies": [{"postID": "post5708194", "text": "I have the same issues but strangely it's more visible in bright pictures and it's in the area below the camera, directly adjacent to the secondary screen. doesn't bother me, but it's there.", "time": "03-10-2017 10:53 PM", "replies": [{"postID": "post5708211", "text": "That's right I didn't explain properly, it's below the camera area adjacent to secondary screen.", "time": "03-10-2017 11:16 PM", "replies": []}, {"postID": "post5708216", "text": "That's right I didn't explain properly, it's below the camera area adjacent to secondary screen.", "time": "03-10-2017 11:18 PM", "replies": []}]}]}]}]}, {"postID": "post5707936", "text": "( duplicate)", "time": "03-10-2017 04:46 PM", "replies": []}, {"postID": "post5708255", "text": "Man just a few hours already starting to feel this phone is too big. Trying to use now without the case.", "time": "03-11-2017 12:35 AM", "replies": [{"postID": "post5708435", "text": "What was your previous phone? It's barely bigger than the iPhone 7 Plus. You get used to it in now time, don't worry.", "time": "03-11-2017 06:46 AM", "replies": [{"postID": "post5708646", "text": "I currently have the pixel XL and iPhone 7 plus along with this. Those were feeling big but after using this Pixel XL feels very comfortable \nThose were already on the limit in terms of comfortable use. \nI think needs few days to get used to this. One thing for sure listening to music on this via the bundled earphones puts to shame listening to music on the pixel XL. I don't know if it's the combination of the DAC and earphones or one of them, it's just awesome.", "time": "03-11-2017 10:25 AM", "replies": []}, {"postID": "post5708785", "text": "You are right, I just measured both iPhone 7 plus and U Ultra both with the cases. They are same to same in terms of height and width. Crazy how big the iPhone bezels are even compared to the U Ultra. Without the cases U Ultra is slightly tall and wide but not by much. Anyway not using both phones without case.", "time": "03-11-2017 12:56 PM", "replies": []}]}]}, {"postID": "post5708756", "text": "Ordered last night.", "time": "03-11-2017 12:28 PM", "replies": []}, {"postID": "post5708813", "text": "Can you post a pic with both phones on?", "time": "03-11-2017 01:24 PM", "replies": [{"postID": "post5708869", "text": "Here you go", "time": "03-11-2017 02:31 PM", "replies": [{"postID": "post5711147", "text": "Thanks!!", "time": "03-13-2017 05:01 PM", "replies": []}]}]}, {"postID": "post5708872", "text": "Here is with the pixel XL", "time": "03-11-2017 02:34 PM", "replies": [{"postID": "post5708888", "text": "The Pixel XL is slightly smaller, but it's not the most comfortable phone to hold. I think the U Ultra is quite ok without the case. While I like the one bundled with it, it does make it less comfortable to hold. I just wish peel would make a case for the U Ultra.", "time": "03-11-2017 02:45 PM", "replies": [{"postID": "post5708891", "text": "Yeah that's why I was feeling it little bigger because the case I have on iPhone 7 plus is comfortable and grippy. The one which comes with the ultra definitely makes it harder to grip. Need to look out for better grippier slim case.\nPixel XL is tough to hold without the case, but I have the Google's $35 case and it definitely makes the phone grippy and very comfortable to use.", "time": "03-11-2017 02:49 PM", "replies": []}]}]}]}, {"title": "Share Photos Taken by the HTC U Ultra!", "thread": [{"postID": "post5689467", "text": "It's still a bit quiet here, so I'll help kick things off until more people get their hands on the U Ultra.\nBasically it's a similar sensor to the Pixel, so it produces expectedly decent result.", "time": "02-24-2017 07:04 AM", "replies": []}, {"postID": "post5689478", "text": "Awesome let's see them", "time": "02-24-2017 07:28 AM", "replies": []}, {"postID": "post5691319", "text": "More shots to share.", "time": "02-25-2017 09:57 PM", "replies": []}, {"postID": "post5691523", "text": "These photos are really good.", "time": "02-26-2017 05:04 AM", "replies": []}, {"postID": "post5699173", "text": "Produces fine pictures, but the camera focuses slower than the Pixel's, especially in low light", "time": "03-04-2017 11:32 AM", "replies": []}, {"postID": "post5708584", "text": "This is just now from my backyard. Nevermind. I can't get the damn pic to upload. Nor can I delete this. 😄", "time": "03-11-2017 09:28 AM", "replies": []}]}, {"title": "Post pics here.", "thread": [{"postID": "post5706828", "text": "Please disregard. there is already a thread started.", "time": "03-09-2017 08:59 PM", "replies": []}]}, {"title": "HTC U Ultra FAQ, Pros, Cons", "thread": [{"postID": "post5702307", "text": "HTC U Ultra sports with 4GB RAM, 64GB ROM, Android Nougat, HTC Sense Companion AI, 16MP Selfie Camera, Fingerprint Scanner. The Major Con about the device doesn't had 3.5mm Headphone Jack.", "time": "03-07-2017 04:00 AM", "replies": []}, {"postID": "post5705445", "text": "I would also say just 3000 mAh on such a large device with high res screen is also surprising. That's the major negative for me along with no waterproofing.", "time": "03-08-2017 09:56 PM", "replies": [{"postID": "post5705776", "text": "3000-3200 mAh seems to be the trending battery spec this year.", "time": "03-09-2017 05:28 AM", "replies": []}]}, {"postID": "post5705828", "text": "unfortunately yes, although I have to say that the Ultra's battery life is ok. Gets me through a full day - and the battery charges very quickly.", "time": "03-09-2017 06:23 AM", "replies": []}]}, {"title": "HTC Ultra is up for sale now", "thread": [{"postID": "post5640986", "text": "With little fanfare the HTC Ultra is up for sale on HTC's website\nHere is the link to the specs...HTC U Ultra Unlocked | HTC United States", "time": "01-12-2017 07:12 AM", "replies": []}, {"postID": "post5641391", "text": "I think this is officially the most I've ever hated a device on launch day.", "time": "01-12-2017 01:34 PM", "replies": []}, {"postID": "post5641645", "text": "3000 MaH battery? I'm going wait for good review. \nWith this price I can go buy Mate 9.", "time": "01-12-2017 03:51 PM", "replies": [{"postID": "post5643524", "text": "Yeah, I wouldn't worry too much about the battery. The Snapdragon 821 is really efficient and runs quite cool. The QHD screen at 5.7 is quite large though. I think it will be fine but nothing amazing. \nWould have been very happy with 3,400mAh.\nA droid a day, keep the apple away.", "time": "01-14-2017 11:48 AM", "replies": []}]}, {"postID": "post5646079", "text": "I just preorder it", "time": "01-16-2017 08:49 PM", "replies": []}, {"postID": "post5646554", "text": "Anyone pre order", "time": "01-17-2017 08:18 AM", "replies": [{"postID": "post5693510", "text": "I just pre-ordered the blue one.", "time": "02-27-2017 07:27 PM", "replies": []}]}, {"postID": "post5651421", "text": "not the HTC one 11", "time": "01-21-2017 08:50 AM", "replies": []}, {"postID": "post5652984", "text": "I'm having issues pulling the trigger on this. It has a lot of great little software gimmicks but only a 3000mah battery for a 5.7\"QHD device?? That doesn't seem like a good pairing at all", "time": "01-22-2017 04:12 PM", "replies": []}, {"postID": "post5653582", "text": "The battery, design and a few hardware choices just make this thing really strange to me. I'm still holding out hope they have a 2017 specd phone coming that pays proper homage to the One series roots.", "time": "01-23-2017 06:51 AM", "replies": []}, {"postID": "post5655018", "text": "Honestly, the thing I hate most about this phone is the d-bag ad copy. I doubt even most 10-year-olds would find that clever. HTC put good money into guaranteeing a widespread FU in response.\nBut if my N6s crapped out on me tomorrow, I would consider the Ultra as a replacement, obvious identity crisis and all. It's really too bad it's going to be plowed under in a few months as the 835-SoC phones start to trickle in.", "time": "01-24-2017 09:16 AM", "replies": []}, {"postID": "post5657280", "text": "It's pretty, but I'm not interested. However, I'm looking forward to the reviews.", "time": "01-26-2017 07:22 AM", "replies": []}, {"postID": "post5659092", "text": "Yeah I still think the 821 soc performance will be very close to the 835 in real world use. Just as the 820 vs 821 I did pre order the Ultra O may cancel cause it's not being shipped till mid March thats crazy", "time": "01-27-2017 06:07 PM", "replies": []}, {"postID": "post5666056", "text": "I'm not sure why everyone is already hating on it. It looks great to me, however, I'd probably wait to buy it until I see reviews and for the price to drop a bit.", "time": "02-02-2017 11:02 PM", "replies": [{"postID": "post5666308", "text": "My list of missed opportunities on this device would start with the following:\nRipped off Samsung general body design and it looks just as bad if not worse - when they already had one of the best looking designs\nRipped off LGs second screen \nFront fingerprint scanner \n3000 mAh battery in a huge phone\nLCD screen instead of AMOLED \nQuick Charge 3.0\nCapacitive buttons\nSmall internal storage (64)\nMicro SD card slot \nDoesn't work on many networks, for the US market won't work for most consumers\nSnapdragon 821 is fine, it's a good chip but it's also last year's chip. \nThey don't say if they support seamless updates - any phone that doesn't support it in 2017 = no buy because this will force it obsolete\nI think that's a good start. What this device appears to be is a white flag from HTC saying that they have no idea what consumers want and so they will go straight into copying mode from devices that got positive feedback at the end of 2016. I have no interest in accepting HTCs surrender, let alone paying them for it, jumping on board and going down with the ship. They can sink by themselves or they can build a compelling device. This one just reeks of mediocrity and misguided confusion about what makes a 2017 device desirable.", "time": "02-03-2017 07:38 AM", "replies": [{"postID": "post5666447", "text": "Haha, well you definitely have your reasons! I understand and see your points - but I'll reserve final judgment until I can actually see and play with it. It sounds like a lot of your disdain for it just the mentality that you perceive HTC has. I don't see it that way. But that's what makes Android great - options!", "time": "02-03-2017 09:38 AM", "replies": [{"postID": "post5666449", "text": "I think I'm still stuck on how awesome HTC has been and being frustrated with their downward spiral. I'd love for them to just not release some of these devices, conserve their resources and focus on one or two really great phones per year.", "time": "02-03-2017 09:41 AM", "replies": [{"postID": "post5666470", "text": "I think that could be said for a lot of Android OEMs. I think most would be wise to have a budget phone, and a small and large flagship. I love the options in Android, but it seems like many OEMs think like little kids - quantity over quality.", "time": "02-03-2017 10:05 AM", "replies": []}]}]}, {"postID": "post5666460", "text": "Good point, and something that hadn't occurred to me. I doubt seamless updates would register with most consumers, but if they are supporting seamless updates, throwing a little consumer education into the marketing would be much more effective than all the cutesy \"what it does for U\" malarkey. \nI'm also curious to find out more about the audio set up in the U Ultra. I read something yesterday that claimed the DAC & onboard speaker set-up weren't going to be the same as those in the 10 (and not in a good way).\nEdit: These are the articles I saw yesterday:http://newatlas.com/lg-v20-vs-htc-u-...parison/47665/http://newatlas.com/apple-iphone-7-p...parison/47478/", "time": "02-03-2017 09:53 AM", "replies": []}]}]}, {"postID": "post5682915", "text": "Surely this release is about the 835 only being available to Samsung early doors, it allows HTC to release in the summer when the chips are available?", "time": "02-18-2017 04:43 PM", "replies": []}, {"postID": "post5687009", "text": "Ended up with a blue one here in Singapore just to test it out and give it a review. Sales started ytd only. The blue looks pretty stunning, almost metallic.", "time": "02-22-2017 08:58 AM", "replies": [{"postID": "post5688299", "text": "Can we see a front shot I ordered the blue as well", "time": "02-23-2017 08:43 AM", "replies": []}, {"postID": "post5690390", "text": "Where did you get yours from?", "time": "02-24-2017 11:18 PM", "replies": [{"postID": "post5690416", "text": "I'm in singapore, and the sales of the phone started here a few days back.", "time": "02-24-2017 11:50 PM", "replies": []}]}]}, {"postID": "post5689461", "text": "Here are some more shots of the phone. \nFor me I love it that the front of the phone is black. Hides the bezel. Unlike the Google Pixel which has a white for the front panel. Even the Quite Black version has a grey bezel instead of a black one which doesn't look as nice to me. ¯\\_(ツ)_/¯", "time": "02-24-2017 06:57 AM", "replies": [{"postID": "post5690322", "text": "How do you like the U Ultra so far. I am thinking about getting one.", "time": "02-24-2017 09:50 PM", "replies": [{"postID": "post5690414", "text": "It's a really solid phone and the finishing is really striking to look at. But if you compare it to other devices, it won't be the best phone out there. Basically does everything well, but nothing great?", "time": "02-24-2017 11:49 PM", "replies": []}]}]}, {"postID": "post5690313", "text": "Man, I think this phone is absolutely stunning. I think I will go with the white but it is so hard to choose as they are all freaking beautiful.", "time": "02-24-2017 09:40 PM", "replies": []}, {"postID": "post5699154", "text": "I've had mine for a week, if anyone has any questions. I think the biggest downside is the lack of the headphone jack. I've tried this with various USB-C adapters and the phone won't work with anything. I always get an error message telling me that it only works with the original HTC headphones. This is completely nuts - they really have to start selling (or bundling) a USB-C headphone adapter that works. \nIt's a pity, because otherwise this is a fantastic device. Beautiful screen and build, blazingly fast. Battery life is decent as well, despite the relatively small battery. The camera is fantastic. \nBut without a headphone adapter available for it, nobody will buy it. I ended up shedding out another 300$ for Bose QC 35 headphones just so I can avoid the headphones that came with it. The latter are quite alright but I hated earbuds.", "time": "03-04-2017 11:12 AM", "replies": [{"postID": "post5699496", "text": "They have the adapter on HTC's website for $11.99. They should have included one in the box. That is a big fail on HTC in opinion.", "time": "03-04-2017 07:22 PM", "replies": [{"postID": "post5699839", "text": "Doesn't seem to be available in Europe", "time": "03-05-2017 04:51 AM", "replies": []}]}]}]}, {"title": "Warning!!! Amazon international version is DUAL SIM does not have US LTE . Seller misquoted bands.", "thread": [{"postID": "post5690605", "text": "So recently I bought the HTC U ultra International version from amazon(https://www.amazon.com/dp/B06X928N4G...cUvbUpU5690605 ). No Go. Its the DUAL SIM VERSION. It DOES NOT HAVE THE US or CANADIAN LTE BANDS 2, 4, 12 and 17. So anyone trying it buy it DO NOT buy it if you want to use it in the USA/CANADA/ LATIN AMERICA. Also the seller has misquoted the bands on the website. It is ALSO DUAL SIM. \nThe only one on Amazon that has the US LTE bands is the following. It is the SINGLE SIM MODEL. (https://www.amazon.com/dp/B01N35POJA...cUvbUpU5690605). I asked the seller and IT WILL WORK. So anyone buying be careful and learn from my experience.\nThey also charged me a 20% restocking fee for the international version saying i did not verify the correct bands before buying. If your stated LTE bands are incorrect to begin with, how can you even make that argument? Guess i have my work cut out contesting that restock fee.", "time": "02-25-2017 06:40 AM", "replies": []}]}, {"title": "Verizon?", "thread": [{"postID": "post5640910", "text": "Any details on when or if the U Ultra will be on Verizon? It looks awesome.", "time": "01-12-2017 05:40 AM", "replies": [{"postID": "post5640988", "text": "Looks like it is GSM only so not for Verizon or Sprint...", "time": "01-12-2017 07:16 AM", "replies": []}]}, {"postID": "post5640915", "text": "Doesn't look like it. Got this off of HTC's site. No CDMA or Band 13. While it does have B2 and B4. I'm almost certain that VZW VoLTE uses B13. \nNetwork\n2G/2.5G - GSM/GPRS/EDGE\n850/900/1800/1900 MHz\n3G UMTS\nAWS/850/900/1900/2100 (B4/B5/B8/B2/B1), HSDPA 42, HSUPA 5.76\n4G LTE (up to 600Mbps)\nFDD: Bands B1/B2/B3/B4/B5/B7/B8/B12/B17/B20/B28\nTDD: Bands B38/B39/B40/B41 with 2CA, 3CA\nVoLTE, Wi-Fi Calling\nSupport Cat 11 LTE, download up to 600 Mbps, upload up to 50 Mbps", "time": "01-12-2017 05:47 AM", "replies": []}, {"postID": "post5641867", "text": "GSM only? HTC continues its death spiral. No support for Sprint who probably has more loyal HTC users in the US than others or America's largest carrier. These guys continue to prove they are not business savvy and are dying a slow death along with Sears/Kmart. Maybe Eddie Lampert should buy HTC....", "time": "01-12-2017 07:16 PM", "replies": []}, {"postID": "post5641991", "text": "You're right, and it's such a shame as they make the best phones. They have no idea how to market nor how to support their hardcore fans. As an example, they should have included the Ice View for free with the 10. Would have moved units, for sure. It's plastic - not expensive to make. Set them apart from the pack (even though the features are lacking) but it was at least unique. Unfortunately, I think they're just going through the motions as they circle the drain. Love HTC and I've owned every flagship since the original Incredible but my next phone will probably be Pixel. The customer service I received on the M9 (ok phone, but had its problems) really pissed me off.", "time": "01-12-2017 09:40 PM", "replies": [{"postID": "post5645089", "text": "Thanks to everyone that replied but does this mean it will never come to Verizon ? Like have they said if they will make one for Verizon and Sprint??", "time": "01-15-2017 11:58 PM", "replies": []}]}, {"postID": "post5666316", "text": "It will not be coming to Verizon or Sprint. The closest thing we have for an indication is an HTC \"source\" saying that HTC USA is basically done. It seems somewhat likely we may not see another HTC phone intended for North America.", "time": "02-03-2017 07:42 AM", "replies": [{"postID": "post5666412", "text": "Sad to say, that actually makes a lot of sense for HTC (or at least for whoever is micromanaging them into the ground). For the past 3-4 years, it's seemed like HTC has been pulling too many punches or punching nothing but air in the NA market, especially when it comes to marketing their devices.", "time": "02-03-2017 09:12 AM", "replies": [{"postID": "post5666415", "text": "It is unfortunate. Several of their devices were REALLY good. HTC One (M7), HTC 10 both were excellent IMO. They just have a problem grabbing traction.", "time": "02-03-2017 09:14 AM", "replies": []}]}]}]}]
