[{"title": "Finger print setting disappeared from my next-bit robin", "thread": [{"postID": "post6062876", "text": "I am Shocked, suddenly fingerprint setting disappeared from my nexbit robin,\nplease any body help how can i get it back.", "time": "11-10-2017 12:38 AM", "replies": []}]}, {"title": "One+3, Nexus 6P or Robin?", "thread": [{"postID": "post5266921", "text": "I'm debating what my next phone is going to be. I have an HTC M7 and it's still running good but the battery is starting to go so I'm looking to get a replacement. I like the size and feel of this phone, I'm not looking for a phablet. HTC 10 is not is an option as it's just too expensive, even with the discount is still $600. I can get the 6P for a good price, they have sales seemingly every other month. I'm concerned about it's size.. So it's kind of between the Robin and One+3. Any thoughts", "time": "07-15-2016 02:27 PM", "replies": [{"postID": "post5266973", "text": "Since you said that you don't want a phablet, the 6p might be really annoying for you.\nThe Robin and the 1+3 are both good in their own right. What are some of the most important things that you would like to have in a phone, aside from size?\nI have the Nextbit Robin curremtly and I'm liking it, but if you can answer that question for me, that would help me to help you.\nBoth the Nextbit OS and Oxygen OS are nice and fairly close to Nexus level, but 1+3's OS (oxygen) has some more add-ons.", "time": "07-15-2016 03:03 PM", "replies": []}, {"postID": "post6018921", "text": "Nice job rocking an M7 for so long! Besides my Pre 2, and probably even more than that, the M7 is my favorite phone. I only made it until the spring of 2015 before I switched. I got my wife and mother in law the Robin last month and while my mother in law hasn't used it yet, my wife loves hers coming from an iphone 5s. For $120 now the phones are a great deal.", "time": "10-14-2017 06:18 AM", "replies": []}]}, {"postID": "post5268022", "text": "I have concerns about the battery life and how well the cloud storage works. What if you need an app or photo and you are not in a good wifi or cell area. What happens? Are you sol until you get a good signal? Does the battery last a whole day on moderate use? How is the build quality of the phone?", "time": "07-16-2016 10:44 AM", "replies": [{"postID": "post5268660", "text": "Out the box, the battery life of the Robin doesn't last a day with my experience. Maybe 12 hours at most. With tweaks, I get a day and some. As for the cloud storage, I disabled it so I can't answer. I do know that cloud backup only happens when you are on wifi and plugged in. There was an issue with the paint chipping on the Midnight one but that has been fixed. Some have reported having the device can slightly bend, but I haven't had this issue.\nSince the size is a true concern for you, I would recommend ordering a Robin from Amazon who allows returns. Out of your choices, I have to be honest and say that the camera on the Robin is weaker than the other two.", "time": "07-16-2016 09:27 PM", "replies": []}]}, {"postID": "post5268050", "text": "I'd get the OnePlus 3 over Robin due to better build quality. You could also wait to see if the Nexus Marlin and Sailfish by HTC are better options.", "time": "07-16-2016 11:04 AM", "replies": []}, {"postID": "post5269298", "text": "Excellent, thank you.", "time": "07-17-2016 12:09 PM", "replies": []}, {"postID": "post5269767", "text": "My Robin is a nice phone, but the build quality is on the weaker side of things.", "time": "07-17-2016 06:43 PM", "replies": []}, {"postID": "post5364605", "text": "I have been using a 6P for about a year now and I can say without any caveats that it is by far the best phone that I have ever owned. I also just bought my wife a Nexbit Robin when they were on sale at Amazon recently. Which so far from what I have seen, it is a very nice device. It seems very smooth and I honestly love the unusual design and UI. The camera is definitely a step down from her old phone but it is still good enough for what she uses it for. Also for her the battery doesn't quite make it through the day, but she uses her phones pretty heavily. For example she used to have a Galaxy S6 with a 3500mah battery case that wouldn't make it through the day either. So it's hard to beat up the robin too much based on her usage. Especially considering the internal battery alone is lasting about as long or even a little longer than the Samsung + external battery did.\nHowever performance wise the Robin can't come close to matching the 6P. Yes the 6P is a little on the large side, but once you get used to it, it's not bad. Although honestly if there were one thing I could change about it, it would still be to make it smaller, because it is larger than I really like. However the benefits of the 6P are that it has a stellar camera, a very fast processor, decent battery life and it is going to get system updates much faster and for a longer time, than anything else out there. \nPersonally my opinion is that if the price is not a factor for any of these phones get the 6P, it's definitely worth the premium. However if you want to save a few dollars and don't mind a slightly slower but more quirky and interesting device the Robin is not a bad choice either. It is a very good midrange device just don't expect the performance of a flagship phone. \nHonestly I haven't used a One+ phone so I cannot personally recommend or detract from it, but if I had to guess it would probably slot somewhere in between the 6P and Robin in terms of features specs and price and might be a decent compromise between the two. \nAlso since you are looking don't forget to look at the Nexus 5X. Performance wise it basically has the same specs as the Robin, but with the same camera sensor and system updates as the 6P, and in a smaller package. Honestly we had originally planned on getting my wife a 5X, but when the Robin went on sale it was just such a great deal it was hard to pass it up, plus she just really liked the styling of the Robin.", "time": "08-25-2016 09:39 AM", "replies": []}, {"postID": "post5401541", "text": "I went with robin, picked up a brand new one from Mercari for $240. So far I'm loving it, no android phone has ever had this kind looky lu effect. Every time someone sees my mint robin they ask what kind of phone is that and it's so awesome. I haven't used the cloud feature yet and I'm running Nova launcher on it. Battery life has not been an issue for me, I'm not a heavy user. I bought the Robin quick charger directly from Nextbit and that has been working great. It charges the phone from 10% to 100% in about an hour and 15 minutes. So far so good with the Robin.", "time": "09-07-2016 12:56 PM", "replies": []}, {"postID": "post5401566", "text": "I ruled out the Nexus 5X because I've heard it had so may problems, it looks like they've fixed all those issues with updates but I didn't want to deal with it. Not to mention limited to 32gb and no sd card. I know the Robin doesn't have sd card either but I can always upload my photos and videos to the cloud, 100GB worth if need be. Also, I just like the like the look of the Robin, I've never been a big fan of LG.I think LG's phones are as boring as iphones.", "time": "09-07-2016 01:08 PM", "replies": []}, {"postID": "post5581407", "text": "You can get a sweet deal on a Le Eco Pro 3...under $300, Snap 821, 4 gb ram, 1080 5.5 display. Use the google launcher app for a near stock experience. My son loves his.", "time": "11-26-2016 07:04 PM", "replies": []}]}, {"title": "How long do you get to keep the cloud storage?", "thread": [{"postID": "post5930223", "text": "do you get to keep it for good? Any deadlines on when the service ends?", "time": "08-20-2017 10:25 PM", "replies": []}, {"postID": "post6018918", "text": "Nextbit said they would continue support the phone until 2/2018 so my guess would be then. I can't find anything official though about the storage though.", "time": "10-14-2017 06:09 AM", "replies": []}]}, {"title": "nextbit robin screen wont turn and not charging....", "thread": [{"postID": "post6003359", "text": "My Robin phone is unable to boot up. My Robin has just went into \"Black Screen\" mode, with no charging light indication and no display stating the phone is undergoing charging. Yesterday, my Robin is \"Black Screen\" when My Robin phone charged overnight.\nI try these methods, but my phone still \"Black Screen\" mode and unsuccessful\ntry booting into fastboot mode. volume down + power\nchange the new type-c cable\ncheck the nextbit charger that still normally operate\nPlease help me! Thank you!", "time": "10-04-2017 12:51 AM", "replies": []}, {"postID": "post6004555", "text": "Welcome to Android Central! Uh-oh, the battery or motherboard may have failed. Is it still under warranty? Given that support for the Robin is winding down, I'm not sure you'll have much luck with Razer/Nextbit -- you may just have to bring it to a repair shop.", "time": "10-04-2017 04:54 PM", "replies": []}, {"postID": "post6017648", "text": "no-one wants to repair my phone..i don't know why...but is there anyway to check the battery is working or not...", "time": "10-13-2017 08:13 AM", "replies": []}]}, {"title": "Problem with updating Nextbit robin from Android 7.0 to Android 7.1.1", "thread": [{"postID": "post5980360", "text": "It shows there is an official update for Android 7.1.1, and it has downloaded and verified. When I click on restart and install, it starts the countdown \"Rebooting in x seconds\". Nothing happens after countdown", "time": "09-17-2017 08:36 PM", "replies": []}, {"postID": "post5980416", "text": "Moved to the Nextbit Robin forum.", "time": "09-17-2017 09:06 PM", "replies": []}]}, {"title": "Nextbit Robin replacement SIM tray", "thread": [{"postID": "post5924948", "text": "Anyone got a spare Nextbit Robin replacement SIM tray or know where I can find one?\nThanks!", "time": "08-16-2017 12:12 AM", "replies": []}, {"postID": "post5925043", "text": "Try eBay or do any internet search places have them.", "time": "08-16-2017 01:58 AM", "replies": []}, {"postID": "post5929285", "text": "Thanks, done that before posting, no luck..", "time": "08-20-2017 01:13 AM", "replies": []}]}, {"title": "still worth buying in 2017?", "thread": [{"postID": "post5723969", "text": "I'm going to be getting a new phone here soon, and so far none of the releases look interesting and with Samsung going to all curved glass is the nextbit worth buying in 2017 to get me to next year or maybe a little after?", "time": "03-24-2017 10:33 AM", "replies": []}, {"postID": "post5723971", "text": "Depends what you're looking for  I just took the plunge and I'm totally excited with a phone so unique and doing its own thing. Being it's supposed to have support until Feb 2018, you should be good  For the price (got mine for 149), it's hard to beat, really.", "time": "03-24-2017 10:35 AM", "replies": []}, {"postID": "post5723983", "text": "Thanks I find it interesting also and was considering either it or the Nexus 5x but I'm thinking at 149 I am gonna go after it also I really like the style they went with what color did you end up getting?", "time": "03-24-2017 10:53 AM", "replies": []}, {"postID": "post5723990", "text": "Yeah, they're pretty similar in specs (Robin has 3GB RAM vs Nexus 2GB). I went with mint. It wasn't an easy choice, but the mint just seemed more \"robin\" like! I also ordered the midnight bruises case, so it's kinda like having the best of both, in a way.  Either color is really pretty, though. I just thought mint was more unique.", "time": "03-24-2017 10:59 AM", "replies": []}, {"postID": "post5728809", "text": "OP, if you're choosing between the 5X and the Robin, the Robin is a better performer. The 5X does have the better camera and fingerprint scanner, but it isn't aging as well from what I've heard.\nRobin looks nice...I own the mint one. If you can get the red + black or the red + yellow models (both are hard to find), that's as unique as the mint.", "time": "03-28-2017 07:13 AM", "replies": []}, {"postID": "post5735882", "text": "Thanks for response, I think I have planned on getting Robin to get me through atleast this year. Especially after seeing what Samsung is putting out (I hate curved screens) I have pretty much ruled out every big name this release cycle.", "time": "03-31-2017 02:53 PM", "replies": []}, {"postID": "post5737811", "text": "OP, you want one new, mint or used? I may be willing to part with my used one at a decent price (especially if you are in the US).", "time": "04-01-2017 03:46 PM", "replies": []}, {"postID": "post5816527", "text": "As someone who as owned this phone for awhile, if price is a factor of the purchase, the phone is good for the price. However, if you want a quality phone, consider waiting a few weeks/months as there are a few phones coming out after Google I/O. I like (but not love)my Robin as it was a good phone for the price. There is now a warp on the frame as it was a plastic phone with a metal frame that is normal (or so Robin claimed when I contacted them). So my phone rocks slightly as the frame has warpped in the first few months, but the over feel/working of the phone has been acceptible.", "time": "05-16-2017 12:48 AM", "replies": []}, {"postID": "post5847456", "text": "I have mint Robin and I love it, it's not the most powerful phone but its still running well and I can't get over how unique it is. All of the other designs look boring in comparison.", "time": "06-12-2017 01:11 AM", "replies": []}, {"postID": "post5850994", "text": "Ordered mine yesterday, Mint, and will receive it today. Got the Amazon Prime sale of $118. My Nexus 5 is on its last legs and I couldn't afford a new phone, so getting this for such a steal will tide me over for quite some time. And it will have 7.1.1 plus security patches through February 2018.\nI had been looking at the Robin pretty much since release but as noted couldn't afford a new phone plus my Nexus was fine at the time. Completely psyched to be getting it now.", "time": "06-14-2017 11:13 PM", "replies": []}, {"postID": "post5914851", "text": "For the bargain price of around 120 it's a no brainier if you need a cheap fast phone, not to mention it has the latest nougat and NFC. The build is all plastic though and keep it mind all warranty and support has but cut off from the company after being taken over by Razer.", "time": "08-07-2017 01:11 AM", "replies": []}]}, {"title": "Poor audio in recorded videos.", "thread": [{"postID": "post5535605", "text": "Received my Mint Robin couple of weeks ago and I'm loving it. Had a Nexus 6 but just too big! I use it to make short demo videos for our clients. Nexus was always fine but Robin audio sounds like it's under water. I think it's an encoding issue. I have tried many different apps with no success. I love Cinema FV5 but can't get good audio. Camera photos are fine, Camera FV5 is my favorite.\nCan someone please suggest a cure for the audio?\nThanks!", "time": "10-30-2016 10:34 PM", "replies": []}, {"postID": "post5535687", "text": "Welcome to Android Central! Just to be sure -- have you checked the secondary mic opening to make sure it isn't clogged by lint or other debris? Also, if you use speakerphone to call someone, does the other person also think you sound like you're underwater?", "time": "10-30-2016 11:20 PM", "replies": []}, {"postID": "post5558871", "text": "Hi, the 2 mic opening are on top and on the bottom, correct? Both clear \nSpeakerphone is perfectly clear both directions. Speakers sound great for podcasts, YouTube, music fine. Monitoring the audio on headphones is fine. It's just the resulting audio on the recording that is bad. It's the same poor quality you get when ripping a DVD with Handbrake. It seems to be a problem with the encoder.", "time": "11-11-2016 09:32 PM", "replies": []}, {"postID": "post5561604", "text": "You may be right. This might be worth a call or email to Nextbit support: https://help.nextbit.com/hc/en-us", "time": "11-13-2016 10:33 PM", "replies": []}, {"postID": "post5634540", "text": "Hi everybody,\nI have Huawei nova plus and experiencing same problems. I just can't stend the audio quality on my recorded videos. It has some kind of background noise reduction or something which makes the audio of videos very awful. \nthanks in advance.", "time": "01-07-2017 05:54 AM", "replies": []}]}, {"title": "Nougat Beta", "thread": [{"postID": "post5576755", "text": "Any of you guys in the beta program. Have you gotten the Nougat beta yet? How's it running? \nI'm downloading the update now. I'll post back to let you know how it's going.", "time": "11-23-2016 09:40 AM", "replies": []}, {"postID": "post5617779", "text": "How do you enroll in the beta program?", "time": "12-22-2016 04:11 PM", "replies": [{"postID": "post5617958", "text": "🗽Welcome to ACentral : Review this AC-Tech article..to find \nthe \"Know how\" to enroll as Beta tester in Android OS\nLink: How to enroll in the Android Beta Program | Android Central..", "time": "12-22-2016 08:07 PM", "replies": [{"postID": "post5623510", "text": "that is for nexus phones and nexbit is not a nexus phone nexbit they will have there own beta programe if they have one", "time": "12-28-2016 09:00 AM", "replies": []}]}]}, {"postID": "post5627958", "text": "https://community.nextbit.com/t5/Com...gat/ba-p/32329https://docs.google.com/forms/d/e/1F...RtKpQ/viewform", "time": "01-01-2017 12:24 PM", "replies": []}]}, {"title": "B&H Photo now sells the Nextbit Robin", "thread": [{"postID": "post5562484", "text": "Found this while browsing around the site. Very cool! Not sure why one is more than the other though.https://www.bhphotovideo.com/c/searc...100+3602808655", "time": "11-14-2016 11:37 AM", "replies": []}]}, {"title": "Updates?", "thread": [{"postID": "post5490347", "text": "Has the Robin been keeping up with the monthly Google security updates?\nAre they promising Nougat anytime soon?", "time": "10-13-2016 02:47 PM", "replies": []}, {"postID": "post5493839", "text": "They don't do updates monthly, they do it every other month. When I had a Robin, the security update available when the update is released has been included in it.", "time": "10-14-2016 08:43 PM", "replies": []}, {"postID": "post5499662", "text": "Thanks. Good to know. Getting my wife something new in the near future and the Robin as well as the N5x are in the running. She's coming from a N5 and wants something close to that size. I was waiting to see how much the Pixel was going to cost but it's obviously in a whole different place now.\nAnyone who has had both have any opinions?", "time": "10-17-2016 11:32 AM", "replies": []}]}, {"title": "How are you liking your Robin?", "thread": [{"postID": "post5075762", "text": "I just spent my first full weekend with my Robin and I have to say, I'm quite impressed. The camera is definitely alright and the battery held up each day. So far my only complaint is that my USB cable is garbage and I'm having to use the one from my 950.", "time": "03-21-2016 01:27 PM", "replies": []}, {"postID": "post5086343", "text": "I'm really liking mine so far as well. I was initially worried with performance, but haven't really got any hiccups yet. I admit I haven't taken many photos yet, but the ones I have aren't bad at all.\nPosted via the Android Central App", "time": "03-26-2016 02:12 AM", "replies": [{"postID": "post5090226", "text": "Agreed - the thing is lightning fast... except the camera app. But the camera isn't as poor as most people made it out to be. \nIt was mentioned somewhere that they're speeding up the camera app in the next update, so we have that to look forward to as well.", "time": "03-28-2016 09:15 AM", "replies": []}]}, {"postID": "post5099199", "text": "Just received mine this week. Darn what a great product. My friends are asking what type of phone is that is really elegant looking. Midnight blue is the color I have. Some new software updates I see are heading our way soon!\nPosted via the Android Central App", "time": "04-01-2016 06:06 PM", "replies": []}, {"postID": "post5145376", "text": "Yeah! I love the phone. It gets a ton of attention. And I'm not missing the app drawer as much as I thought I would.", "time": "04-25-2016 11:42 AM", "replies": []}, {"postID": "post5153903", "text": "I hope you don't mind me using this thread for first impressions and later edit or type a new response.\nFirst impressions: \nThis device is huge. I normally use an iPhone SE so yeah.\nI love the colors and design of this phone. Green!!\nAlso really liking the launcher.\nWhoa the sound is probably one of the best I have ever heard on a phone.\nThe power button is really flush against the phone.\nI didn't know what to expect for the corners but the corners don't feel sharp in the hand.\nI just set it up last night so that is all for now.\nFinal impressions:\nI no longer have this phone.\nLoved the look and the concept but had to return it after dealing with it being stuck in airplane mode.\nNot interested in doing a factory reset every time this happens.\nPosted via the Android Central App", "time": "04-30-2016 11:25 AM", "replies": []}, {"postID": "post5163105", "text": "Just got mine during the Amazon sale and so far I'm very happy with it! The build and hand feel are surprisingly good, the tastefully done UI is the first android skin I've liked in a long time. \nMy timing was also good because of the recent updates, and I think the speakers sound excellent, and the camera, while not up there with the leaders, is solid.\nSo, first impressions are very positive, we'll see how it goes over the next few weeks. \nPosted via the Android Central App", "time": "05-05-2016 09:15 PM", "replies": []}, {"postID": "post5163258", "text": "I couldn't pass up 100 dollars off either!  Mine is coming tomorrow, well I guess later today since it's after midnight here, lol! Had I ordered it 1 hour earlier I could have even gotten it already with same day shipping! lol", "time": "05-06-2016 12:04 AM", "replies": []}, {"postID": "post5164234", "text": "I really like mine; two gripes though.\n1) Wish it had double tap to wake.\n2) The speakers are too loud with the latest update.", "time": "05-06-2016 01:23 PM", "replies": [{"postID": "post5164486", "text": "You aren't serious about number 2 are you or are you saying the speakers distort?\nPosted via the Android Central App", "time": "05-06-2016 04:39 PM", "replies": []}]}, {"postID": "post5164585", "text": "Actually I think I just figured out what you are talking about. I just played a couple of YouTube videos and it was too loud on its lowest setting. This is only the second day I have had it and I didn't listen to it prior to the update. This will be very annoying in situations where you are in a very quiet environment and want or need a low volume and level one sounds like level 5 on other phones.\nPosted via the Android Central App", "time": "05-06-2016 06:44 PM", "replies": [{"postID": "post5171814", "text": "I agree about this. Someone posted a temporary fix on the Nextbit forums. Install DSP Manager Lite and save a preset to fix the sound thing. Moving all of the things to the left would adjust the sound to be the way you want it to be. I did that myself. Let me take a screenshot and add it to this post on mobile.", "time": "05-11-2016 09:09 AM", "replies": []}]}, {"postID": "post5166922", "text": "Happy to find out it will be fixed on the next update, but its hard to fathom how the last update was released with this oversight.\nPosted via the Android Central App", "time": "05-08-2016 11:35 AM", "replies": []}, {"postID": "post5171832", "text": "Sorry to double post but it wouldn't let me add the image to my last post.\nPosted via the Android Central App", "time": "05-11-2016 09:23 AM", "replies": []}, {"postID": "post5173836", "text": "The loudness of of the device is not the issue for me, it's great, however, when I place the volume at the lowest possible setting, it is still really loud. At least on my unit, after the update, there is not a big difference between the volume settings. It's loud, or really loud to the point where the sounds starts to crack.", "time": "05-12-2016 10:49 AM", "replies": [{"postID": "post5174135", "text": "I agree. I like the DSP but I think I will only use that when I plan to listen to audio. It being on ALL the time is a serious battery drain. I'm on my 2nd full day, (it's been 3 1/4 days now) and I need to see how the battery is without that running and draining the battery noticeably enough.", "time": "05-12-2016 02:19 PM", "replies": []}]}, {"postID": "post5174271", "text": "I've had it for four days. Fantastic phone so far!\nPosted via the Android Central App", "time": "05-12-2016 03:28 PM", "replies": []}, {"postID": "post5176393", "text": "Okay, so I felt like I should adjust/update my impressions. I was really disappointed that the Robin was stuck in airplane mode, and I felt so cheated of wanting to try it. Of course, I returned it and got my money back. Then it went on sale recently and since I felt the way I did, I decided to give it a second try.\n(Whoops, didn't mean for it to be this long)\nThe tl;dr version:\n-Liking almost everything about this device, including that VoLTE and Band 12 on T-Mo.\n-Not liking daily charging and the MMS not working with WiFi connected\n-My dislikes are so annoying that it has me debating if I want to keep this\nThe long version:\nThankfully this try is better. It's been 4 days and I find that I am mostly liking it a lot. It's actually making me rethink how I view Android. Really a fan of the UI. I'm satisfied with the camera and the speakers. I did install the DSP Lite thing that I suggested upthread but I decided not to use it anymore because it drains the battery. My workaround for now is to set the volume at low (it's not really so low but eh). Call volume is pretty good on speaker and in general.\nI'm on T-Mobile, so the VoLTE and Band 12 was a super important thing for me to have or else I would have passed on this device (more so the latter thing and not the former though). My work kind of sucks for reception big time, so WiFi calling was important and I was nervous about this. At work, I have not lost reception once. \nThe Robin has been mostly pleasant, my only issues are the following two things:\n-Battery life. I have had to charge my Robin every day, and I don't really like that. Coming from the SE which I charge every other day, this is a huge adjustment. If there's something I can do about this, I would be open to hearing it, but I'll rather not flash another ROM.\n-MMS issue with WiFi connected. This seems to be a issue for not just me. I randomly get MMS (from my friends, coworkers, and sis, but my coworkers are the most likely, more so group texts over images though). The scary thing about this is that I wouldn't even know if I have a MMS until I toggle the WiFi off. Luckily, I have 10gb of data but this is annoying for sure.\nSo I'm on the fence about keeping this for my two annoyances mainly. Generally though, I enjoy the sound, the UI/launcher, camera, and of course, the look of the phone.", "time": "05-13-2016 07:16 PM", "replies": [{"postID": "post5178321", "text": "I'm glad you gave it a second chance! Yeah, battery life is a solid day. I'm running CM 13 on it now and it's vastly improved my battery life, but how I use the phone, it's definitely a solid day and night out (which I rarely do) and no more. Plus, if you don't want to Rom your phone, that's no option anyway.\nI was also having mms issues before and now no longer. There are some things cm isn't good at, but they did fix the things Nextbit was bad at.\nPosted via the Android Central App", "time": "05-15-2016 08:46 AM", "replies": [{"postID": "post5179144", "text": "Thank you, me too! Really didn't think that I would enjoy it so much, never saw myself enjoying an Android phone this much.\nAh dang, the fact that this fixed both things has me curious now. \nVoLTE is too valuable for me though to lose. Even so, I'm curious what things you say that CM isn't good at though.\nEdit: Someone posted a workaround for the MMS thing on the Nextbit forums that actually isn't too bad, and it seems to work for now.", "time": "05-15-2016 08:05 PM", "replies": [{"postID": "post5179864", "text": "Eh, basically what's not great about CM is stability. Things crash from time-to-time. I have found that Google Now, Chrome, and the Swype are affected the most. I haven't tried other keyboards yet since it's intermittent, but it has been a minor annoyance. I should try others.\nI don't know how CM does so much better asleep than the Nextbit software with regards to the battery.\nAlso, CM now updates OTA for nightly builds. Updating the build is cake and you can do it every day if you want! Ha", "time": "05-16-2016 08:42 AM", "replies": []}]}]}]}, {"postID": "post5187883", "text": "I got one off of Amazon when they were having the $100 off. I like it as it is nice and fast and the feel in my hand is nice. So far, so good on my experience with it so far.", "time": "05-20-2016 07:06 PM", "replies": []}, {"postID": "post5192416", "text": "My wife has one in Midnight. She loves it compared to the LG G4 she had before. Her biggest gripe right now is battery life. She gets about 3/4 of a day before she has to charge it. I installed Sound Profiler to control the loud audio problem.\nPosted via the Android Central App", "time": "05-23-2016 05:56 PM", "replies": [{"postID": "post5192591", "text": "Yeah the battery life is the only thing that annoyed me about it. I'm too used to phones that give me a day and some of battery life.\nSent from mTalk", "time": "05-23-2016 08:23 PM", "replies": []}]}, {"postID": "post5261667", "text": "So I couldn't let go, ended up buying another Robin to keep. Making tweaks for the battery life makes me like it so much more now. No more fast charge in the morning and running to a charger in the evening, thankfully. I get about 20-24 hours of usage (so literally about a day) which is something I can deal with.", "time": "07-12-2016 11:13 AM", "replies": []}, {"postID": "post5263117", "text": "what tweaks did you do?", "time": "07-13-2016 09:53 AM", "replies": [{"postID": "post5263222", "text": "I did a couple of things, I'll just quote my post:I also have Wifi to not be connected when the phone is sleeping but you don't have to do that. I only do that because my wifi at work is so varied. Since I have been doing this, I always get at least 20 hours on one charge. 20 hours is with me using it a lot and I can't put it down unless I'm sleeping or really busy with work or doing something that I need serious focus for. In actuality, it's more like near 23-24 hours. I'm just someone who generally charges on 30 something percent, so generally a day and some is what I get.", "time": "07-13-2016 11:26 AM", "replies": []}]}, {"postID": "post5264785", "text": "International version of Nextbit Robin\nUse in Hong Kong since 2 weeks ago.\nPros:\n- headphone jack audio is great, IMHO\n- unique design\n- no bloatware\n- fingerprint censor is fast and responsive\n- latest June security patches are available\nCons:\n- process intensive apps cause the phone hot on both sides\nOther (not a complain):\n- Octopus apps does not support the phone (Hong Kong provider issue)\n- not able to play .ts file due to codecs missing\nOverall the OS is solid and lightweight. It would be nice if we can have control over the cloud storage. It gives you choices and allows user to install other OS (i.e. CM, AOSP).", "time": "07-14-2016 08:45 AM", "replies": []}]}, {"title": "Cyanogen Mod 13 for the Nextbit Robin", "thread": [{"postID": "post5170099", "text": "Guys! You can download and install CM13 on the Nextbit Robin. It's a bit of a process, but if you want, here is what I had to do on my Windows 10 PC:\nFirst you'll want to ready your computer:\n1) Download and install the USB Drivers for the Nextbit Robin\n2) Download and install ADB and Fastboot\n3) Download TWRP Recovery\n4) Download the newest CM13 nightly ROM\n5) Rename the TWRP download to twrp.img and the CM13 download to cm.zip and make sure you know where they are\n6) Download your preferred gapps package (google apps) Pick ARM64 in the first column, 6.0 in the second, and decide which version in the third\nNow you need to ready your phone:\n1) Go to Settings>About Phone and find the build number. Tap on that a bunch (I think it's 7 times to be exact) until it congratulates you on being a developer\n2) Go to Settings>Developer options and toggle on/active Android debugging (or ADB)\n3) In Settings>Developer options there should also be a toggle to allow bootloader unlocking. Make sure that's on/active as well\nWe have both devices ready. At this point, connect your Nextbit to your computer. You should get prompted on your phone on whether or not you want to allow your computer to access your phone. I've found that it's best to check the box to always allow and allow the computer access to the phone. Now we can send commands to your Nextbit from the command line using ADB.\nNow, with your Nextbit connected to your computer, open the folder on your computer that has the file twrp.img. Hold control and right click in this window; this should allow you to open a command prompt in this folder. WARNING: THE NEXT STEPS WILL WIPE YOUR DEVICE - MAKE SURE IMPORTANT FILES ARE BACKED UP\nNow in the command prompt type: ADB reboot bootloader\nYou'll see your device reboot into the bootloader. It should be in fastboot mode by default\nOnce the device installs, in the same command prompt type: fastboot -i 0x2c3f oem unlock\nIt should give you a warning at this point that you're going to wipe everything and whatnot. If you want an unlocked bootloader, agree.\nIt will wipe everything and you'll have a Robin that feels brand new, but the bootloader will be unlocked.Congrats! You've unlocked your bootloader! Now we'll work on the custom recovery.\n1) Once your Robin has booted, we need to get back to the bootloader screen if we're not there. Press and hold the volume down and power button together. This should force the phone to shut down. Once it's shut down, release the power button while holding the volume down button and then press it again to turn the device on and into the bootloader. It should be in fastboot mode by default.\n2) Since we still have the command window open and since we opened it in the folder that had the twrp.img file in it, we can right away type the command: fastboot -i 0x2c3f flash recovery twrp.img\n3) Reboot the bootloader in whichever way feels best for you\n4) Navigate to recovery using the volume keys and use the power button to boot into the recovery *note: if you aren't at a screen that says something about TeamWin, you're in the wrong place. I had to repeat steps 1-3 to achieve this. Not sure why, but it fixed it for me.Congrats! You now have a custom recovery installed on your Robin. Now we'll install the Cyanogen rom.This is where we're most likely to wreck everything. Be careful.\nIn the Team Win Recovery it will first ask you for a decryption password. I couldn't, for the life of me, figure out what they were asking for. I canceled out of the whole thing. It should then ask if you are going to want to modify the system partition. You have to swipe the slider along the bottom to allow this. Note: the way I'm going to install the rom is pretty risky since we don't have the option to backup before we wipe and install. Nextbit has made a tool that probably does a lot of the work that we've done automatically. It's a huge file, so I opted to not download it, but it should recover your phone should we get into trouble. \nNow that we have that out of the way, let's get installing.\n1) Tap Mount and make sure System, Data, and Cache are selected.\n2) Return to the TWRP home screen\n3) Tap Wipe\n4) Tap Advanced Wipe\n5) Select Dalvic, System, Data, and Cache\n6) Swipe to Wipe at the bottom\n7) Return homeAt this point, we've gotten rid of our Nextbit rom and the encryption so we can see the storage and install new things\n8) Tap mount again\n9) In the bottom right tap to Enable MTP\n10) On your computer now, you should be able to see your Robin under My Computer. Open up internal storage.\n11) Copy both cm.zip and your gapps package into internal storage\n12) On your phone, return home\n13) Tap Install\n14) Click the top option \"Up a Level\" until it disappears\n15) Find the folder that is named \"sdcard\" and go into it. This is where your rom and google apps are\n16) Select cm.zip and swipe to confirm flash\n17) Wipe cacheAt this point, you have CM13 installed! Now we need the google apps so you have the full Android experience\n18) Install gapps the same way you installed the cm.zip\n19) Wipe cache\n20) Go home, tap the reboot button, and reboot systemCongrats!!! You've done it!! You've installed Cyanogen mod on your Nextbit Robin! Set it up and let it rip! This process should be the same for any rom you can download.\nHope that was clear. Feel free to ask questions if something wasn't quite right!", "time": "05-10-2016 09:30 AM", "replies": []}, {"postID": "post5189269", "text": "Thanks !!!\nPosted via the Android Central App", "time": "05-21-2016 06:14 PM", "replies": []}, {"postID": "post5263641", "text": "Also, this should work for any rom.zip file you'd want to install.", "time": "07-13-2016 03:57 PM", "replies": []}]}, {"title": "Shipping time", "thread": [{"postID": "post5238276", "text": "Finally after looking for all sorts od devices I ordered the midnight Robin yesterday. Being a phone addictive gone through. A lot of devices in the last couple of years (blackberry z30,leap,priv,passport, sony xperia, Microsoft lumia 640 and 950)\nDont like android much, but the looks of robin made me order one.\nHow long does it take to get it shipped to canada? Hopefully its not a long wait", "time": "06-24-2016 12:46 PM", "replies": [{"postID": "post5239007", "text": "May be a good idea to contact the site you purchased it from. Or at least provide WHERE you bought it from if you are looking for this answer.\nI am assuming Amazon. And if it was Amazon, then it depends on how you choose to ship it. It's pretty clear on their site\nWant it Monday, June 27? Order within 20 hrs 18 mins and choose Two-Day Shipping at checkout.\nIf you didn't choose that option I am sure it would have given you a time frame for shipping...", "time": "06-25-2016 03:42 AM", "replies": []}, {"postID": "post5239744", "text": "On the Nextbit forums, I saw someone say 2 weeks. One week to ship, another week to get it. At least from them directly. Unless you ordered from Amazon, that is.", "time": "06-25-2016 06:37 PM", "replies": []}]}, {"postID": "post5240227", "text": "I ordered mine directly from Nextbit (midnight) Monday night (20th) and received it the 24th. I'm also located in Canada. Will most likely arrive with FedEx.\nOn a side note, your device history is interesting. I'm curious as to why you didn't like the Priv? I've had Z10 before upgrading to a Passport. I was eyeing the Priv but simply could not justify the price for the similar specs as the Robin. Still adapting to the Android world coming from BB10 but overall I'm enjoying it. Hope you get your device soon!", "time": "06-26-2016 08:53 AM", "replies": [{"postID": "post5240546", "text": "I bought the priv when it was released and I was still missing bb10. Plus I don't use physical keyboard at all. Hence I retuned it.\nNow its come to a full circle. After using windows mobile for a while I do miss the apps adn the windows OS have bugs and lags at times. Ready to give a Android another go\nSent from mTalk", "time": "06-26-2016 01:59 PM", "replies": []}]}, {"postID": "post5243325", "text": "Ordered on Friday and got my package today - tuesday morning. Super excited. Will open and set ut up tonight.\nSent from mTalk", "time": "06-28-2016 01:40 PM", "replies": [{"postID": "post5243332", "text": "It sounds like you and me are in a similar situation. Enjoy your Robin!! The Robin is the one of the few Android phones I really liked a lot. I'm willing to keep with Android, as long as I can do it with the Robin. What color did you order?", "time": "06-28-2016 01:45 PM", "replies": []}]}, {"postID": "post5243357", "text": "Midnight blue.\nHow long have u had yours?\nHow do u like android and robin so far? How's the overall performance? Battery life?\nSent from mTalk", "time": "06-28-2016 02:07 PM", "replies": [{"postID": "post5243457", "text": "Nice!\nThere's a story behind why I am waiting for another one but most recently a week. \nAndroid is okay, there's a slight learning curve and I did a lot of googling on how to do some stuff. Unlike Windows Phone/Mobile, I feel like it takes more steps to do some things. It's kind of cool, but slightly overwhelming that you can change default apps, like the web browser, phone, and sms/messaging.\nThe overall performance is pretty good (I'll give it a 7 out of 10). The cameras are decent, battery life on the other hand, I have gotten less than a day. That was really my biggest annoyance with it, otherwise I really liked a lot. Since I can't stop thinking about having it, I ordered one again to keep. \nI learned some tweaks that I can do for battery life, which I'm going to be trying immediately when I get it to see if that can extend the day a little bit more for me.\nThe Nextbit launcher doesn't allow custom icons.\nEdit: I forgot to say that I found the Nextbit OS to be similar to \"stock\" (i.e. Nexus) Android, but slightly different in a good way.", "time": "06-28-2016 03:15 PM", "replies": [{"postID": "post5244180", "text": "I've found adding music and files from the computer to the smarphone to be very complicated in comparison to BB10 but luckily google is there to help. Any particular tips for battery usage other than not using it?  I find myself being able to keep 12-14 hours on a single charge with 3-4.5 SOT but I am running for the charger when I get home.", "time": "06-29-2016 05:35 AM", "replies": [{"postID": "post5244319", "text": "6 tips to improve battery life on the Nexus 5X | Android Central \nI tried that on the 5x (well, not the last tip but most of it) and it worked out well. For location, battery saving is the best mode (some people have said that they change it to high accuracy when using the maps when traveling). \nAlso I turned off (Google) Now on tap in settings and that helped. You can still use it if you need it, but at least this way, it isn't always listening. \nFinally, I limited backup. In my case, I just turned it off altogether but I would think there should be a setting to reduce or change how often backup is making backups. \nIt seems like a day is what someone can roughly get with the Robin, but that is what I plan to try to see how far I can extend the day.\nAdditionally some apps aren't so good. I hear a lot about the Facebook app being a leech around these forums. Speaking of apps, it's up to you if you want them to auto-update and install or if you want them to just notify you when updates are available.\nFunny that you say running to the charger. I felt like I was doing that EVERY DAY. It made me mad. I really hope these tips help me since they helped with the 5x and the two devices are seriously similar, minus the ambient (fickle) display lol.\nEdit: I keep adding to this post, sorry. I somehow forgot to say that I adjusted the \"push\" notifications for my email accounts. My secondary email doesn't get much email, so I set that to daily. My primary email gets email randomly, so I feel like setting that to hourly helps me. YMMV with this, you don't have to do it, it's just a suggestion.\nEdit 2: The comments in the linked post are interesting, they might be worth a read. Sorry for the wall of text!", "time": "06-29-2016 07:55 AM", "replies": []}]}]}]}, {"postID": "post5248493", "text": "I just wanted to report back to say that I got my Robin and after following my own tips, I got about 20 hours on a charge including setup time off the charger. Looking forward to seeing how this plays out. Right now, I'm at 65% percent and it estimates that I have a day and 3 hours left.\nI forgot that you can set wifi to not be on when the phone is sleeping. I should have tried this at work yesterday but eh, I have next week for that.\nPosted via the Android Central App", "time": "07-02-2016 08:50 AM", "replies": []}]}, {"title": "Got it.... Unboxed it.... Filmed it.... NEXTBIT ROBIN TIME BOYS!", "thread": [{"postID": "post5102571", "text": "", "time": "04-03-2016 06:42 PM", "replies": []}, {"postID": "post5241507", "text": "Colin,\nThanks for sharing your unboxing experience!!! I have a Robin too and love it", "time": "06-27-2016 09:14 AM", "replies": []}]}, {"title": "User profile picture?", "thread": [{"postID": "post5236790", "text": "How do you set the profile picture to show up on the toggle menu (swipe down) on the Robin? The usual way isn't applicable.\nPosted via the Android Central App", "time": "06-23-2016 11:55 AM", "replies": []}, {"postID": "post5237439", "text": "Have you already tried in the Contacts app?", "time": "06-23-2016 08:48 PM", "replies": []}]}, {"title": "Does Nextbit Robin have multi user like OnePlus 2 or Nexus series?", "thread": [{"postID": "post5022317", "text": "I just need to know that can we use multiple users in nextbit Robbin like I use in my oneplus2 or nexus", "time": "02-29-2016 03:39 AM", "replies": []}, {"postID": "post5228587", "text": "It does not.\nPosted via the Android Central App", "time": "06-17-2016 12:59 PM", "replies": []}]}, {"title": "New June Update!", "thread": [{"postID": "post5215711", "text": "So how's the volume workin' for you? I find its on the low side. The lock and unlock sound is definitely way too low...almost inaudible now. Gonna have to test the alarm and be certain it's actually loud enough to wake me in the morning..\nAny thoughts?\nPosted via the Android Central App", "time": "06-08-2016 07:11 PM", "replies": []}, {"postID": "post5217296", "text": "Hi\nIf you have issues, after any major update, or security update, you should do one, or both of the options below. Hopefully the first one works for you.\n1. Enter Recovery Mode, and do a Wipe of the Cache Partition. no data loss.\n2. Full factory Reset - I recommend this after each update, I do, religiously. ALL DATA LOSS, PHONE AS NEW...BACKUP YOUR DEVICE.\nHope this helps!\nChris", "time": "06-09-2016 05:49 PM", "replies": [{"postID": "post5219910", "text": "I already did the first one right after the update but haven't gotten a chance to do the second. I did start backing up my stuff though in preparation.\nPosted via the Android Central App", "time": "06-11-2016 11:34 AM", "replies": []}]}, {"postID": "post5219917", "text": "I surely hope if works out for you...keep us posted.\nChris", "time": "06-11-2016 11:40 AM", "replies": [{"postID": "post5224440", "text": "I did a full factory reset a couple days ago. Still have the same issues so it must be an issue with the software. Guess i'll wait for the next update to be pushed.", "time": "06-14-2016 09:27 PM", "replies": []}]}]}, {"title": "Manufacturing worries", "thread": [{"postID": "post5223800", "text": "Overall, I like this phone. I works for me just fine and as Nextbit releases updates the phone seems to be getting better as the bugs are worked out. That being said, in the past week I have noticed that the frame seems to have warped slightly. It now rocks when laid flat on a table. I do not put my phone in my pants pockets (front or back) so the bend/warping did not come from that. The bend/warp is slight for now and I am worried that it might get worse as time goes on. Nextbit has said that the slight bend is within the margin of error for a phone with a plastic body with a metal frame. I can exchange it, but I am worried that the next phone will just do the same thing. Anyone else having issues??", "time": "06-14-2016 12:46 PM", "replies": []}]}, {"title": "Tips or Tricks for a new Robin user?", "thread": [{"postID": "post5208074", "text": "Just picked up a Nextbit Robin - and I've got to say - I really like this phone!\nHaven't used it too much yet, but I dig the design. Also appreciate the cloud storage aspect. Will have to see how it performs and optimizes as I use it. Only thing I'm sort of meh about is the lack of USB-C adapter in the package, but hey, I'll just pop out and buy one I guess Any tips or tricks for a new Robin user???", "time": "06-03-2016 09:36 AM", "replies": []}, {"postID": "post5211180", "text": "Just picked up a retractable type c cable for mine from Miger on Amazon here: https://www.amazon.com/dp/B01FUKZDZQ...cUvbUpU5211180\nIt's a godsend to have now when low on juice out and about.\nPosted via the Android Central App", "time": "06-05-2016 08:32 PM", "replies": []}]}, {"title": "Mint or Midnight", "thread": [{"postID": "post4667649", "text": "Which color did you order/are you ordering?\nI'm getting a Midnight for me and Mint for my wife.\nThe Midnight kinda reminds me of my old Zune from the pictures.\nSent from my LG-H811 using Tapatalk", "time": "09-07-2015 03:11 AM", "replies": [{"postID": "post4687764", "text": "I'm definitely going Mint. For the past few years I've had low key looking devices, and I want something different.", "time": "09-16-2015 09:45 AM", "replies": [{"postID": "post4687785", "text": "Nice. That's exactly what my wife said about Mint. \"Oh it looks different, but good different\". \nAre you planning on using a case?? I usually run my phone naked.\nSent from my LG-H811 using Tapatalk", "time": "09-16-2015 09:52 AM", "replies": [{"postID": "post4690752", "text": "No case for me. They just announced they're holding a contest to design a kickstarter only colorway. Hoping we get a chocolate/mint colorway. I'm awful in Photoshop though.", "time": "09-17-2015 02:11 PM", "replies": [{"postID": "post4690758", "text": "Oh that's awesome. I also suck at Photoshop. But I would love a Black/Midnight and Blue colorway. Or Purple. I love Purple.\nSent from my LG-H811 using Tapatalk", "time": "09-17-2015 02:14 PM", "replies": [{"postID": "post4690772", "text": "One user posted a purple one already. Midnight/mint has been posted as well. Some posted are a bit obnoxious. LOL. It's such an awesome idea. Nextbit said they were gonna check all the entries, narrow it down to 5, then let the backers vote.", "time": "09-17-2015 02:22 PM", "replies": [{"postID": "post4690786", "text": "That's awesome. I need to back them ASAP. I wanna vote on the Midnight/Mint combo.\nSent from my LG-H811 using Tapatalk", "time": "09-17-2015 02:29 PM", "replies": [{"postID": "post4693217", "text": "I even got lucky and got one of the $299 spots last week b/c I was checking the comments and somebody dropped out.", "time": "09-18-2015 04:38 PM", "replies": []}]}]}]}]}]}]}]}, {"postID": "post5163273", "text": "I ordered Mint! Took advantage of the Amazon sale.", "time": "05-06-2016 12:19 AM", "replies": [{"postID": "post5163276", "text": "You won't regret it! The Mint is a great looking phone.", "time": "05-06-2016 12:27 AM", "replies": []}]}, {"postID": "post5179110", "text": "Just recieved my mint coloured robin! been using my midnight robin and when amazon had there couple day sale i had to order the mint one, glad i did", "time": "05-15-2016 07:36 PM", "replies": [{"postID": "post5179141", "text": "It's cool that you have both! Which one do you use now, or do you just change it up?", "time": "05-15-2016 08:03 PM", "replies": [{"postID": "post5190865", "text": "Im using the mint one!", "time": "05-22-2016 08:21 PM", "replies": []}]}]}, {"postID": "post5189043", "text": "Got a midnight colored one myself.\nPosted via the Android Central App", "time": "05-21-2016 02:47 PM", "replies": []}]}, {"title": "Battery Life with CM13", "thread": [{"postID": "post5174300", "text": "Holy. Buckets.\nI usually had a hard time getting through a day on the battery of my Robin. I reboot a couple of times this morning and haven't plugged it in yet and it says it will last 1 more day at 66% battery\nThat's crazy. I'll post to see if I use the phone more after work, but CM has some great battery stuff going on.", "time": "05-12-2016 03:39 PM", "replies": []}, {"postID": "post5174820", "text": "I'm impressed!\nPosted via the Android Central App", "time": "05-12-2016 08:59 PM", "replies": []}, {"postID": "post5187796", "text": "That's pretty impressive. I would've likes to see this battery graph with a comparison of the original Robin OS. My wife has a Robin and struggles with getting through 1/2 to 3/4 of her day without charging. I feel the battery should be batter, especially after the latest update with \"battery improvements\". I guess the next step is a factory reset.\nPosted via the Android Central App", "time": "05-20-2016 05:55 PM", "replies": []}]}, {"title": "LG G5 or Nextbit Robin", "thread": [{"postID": "post5161357", "text": "Hi All,\nI am thinking of purchasing a Android phone and have not used on in years. I've been looking a the Robin and the LG G5. I was wondering what all your thoughts are regarding the Robin and the G5. As well what one do you think is best. Presently I am using my Windows 950XL as a daily drive, but would also like to have an android device as the rest of my family uses their LG G4. Any thoughts, suggestions and recommendations are welcome.", "time": "05-04-2016 09:52 PM", "replies": []}, {"postID": "post5161366", "text": "What smartphone features do you consider most important?", "time": "05-04-2016 09:58 PM", "replies": [{"postID": "post5161417", "text": "My daughter and wife seem to use snapchat a lot and I work away from home, so its a way to communicate. Also I am a huge music fan and a camera fan to some extent. I like the looks of the wide angle lg camera, but apparently the robin takes great pictures as well. I have 83 gigs of music on my 950xl and both LG and the robin are great for music. I love the look of both phones, especially the robin, but LG in my mind is no slouch either. I have a ford f150 that has sync and its important that whatever phone I get will work with that. Im truly am torn on which way to go. The Robin is cheaper though, but Im from canada and our dollar is the pits...sorry I just realized I was droning on. ☺", "time": "05-04-2016 10:50 PM", "replies": [{"postID": "post5161443", "text": "The G5 is probably the better option since it has a microSD slot. With the Robin you'll have to keep most of your music on the cloud.", "time": "05-04-2016 11:25 PM", "replies": []}]}]}, {"postID": "post5161813", "text": "The sound on the Robin is really nice though! If you was to go with the Robin, I'm pretty sure that you'll be pleased with the speakers. @SactoKings has a great point about the cloud thing. If you don't mind that, go with the Robin.", "time": "05-05-2016 07:42 AM", "replies": []}, {"postID": "post5162450", "text": "Thanks Libra89 and SactoKingsFan. I've decided to go with the LG G5 as the initial outlay is $200CDN and that includes the camera module. The Robin, which I love to purchase, is $610CDN with the exchange rate and though the sound is great, there is my music, which would have to be stored in the cloud. Thanks Folks, I appreciate your help in making my decision.", "time": "05-05-2016 01:39 PM", "replies": []}, {"postID": "post5163259", "text": "The LG camera is probably better.", "time": "05-06-2016 12:06 AM", "replies": []}, {"postID": "post5164170", "text": "I have both. If the camera is important to you go with the G5, but also know with the Robin's latest update the camera is pretty darn good. I am only on my second day with the Robin, but I am very impressed and at $299 IMHO it's the best phone available. I also have a 5X and I would take the Robin over it. \nBuild quality is excellent and I haven't experienced any lag whatsoever.\nPosted via the Android Central App", "time": "05-06-2016 12:40 PM", "replies": []}]}, {"title": "Update Day!!!", "thread": [{"postID": "post5148875", "text": "Who's stoked?! I can't wait for the faster cam. No update yet for me...", "time": "04-27-2016 08:55 AM", "replies": []}, {"postID": "post5149398", "text": "...Still waiting!!!", "time": "04-27-2016 02:34 PM", "replies": [{"postID": "post5149949", "text": "Did it come yet?", "time": "04-27-2016 09:07 PM", "replies": [{"postID": "post5150706", "text": "Yeah, and so far it's awesome! Not much changed visually, but the feel is a bit smoother throughout use and the camera is much improved. I can't report anything on battery life yet because it's been a whole 12 hours since I updated.", "time": "04-28-2016 10:42 AM", "replies": [{"postID": "post5150821", "text": "Sweet! I hope I'll be able to get the update on my Robin that is arriving tomorrow.", "time": "04-28-2016 11:41 AM", "replies": []}]}]}]}, {"postID": "post5153430", "text": "I was able to get the update, and it's great. The sound is like whoa. Probably some of the best sound I have heard on a phone.", "time": "04-30-2016 12:12 AM", "replies": [{"postID": "post5158877", "text": "Yeah, no joke. I'm blown away!", "time": "05-03-2016 04:15 PM", "replies": []}]}]}, {"title": "Nexbit Robin coming to Verizon anytime soon?", "thread": [{"postID": "post5108776", "text": "I am stuck with Big Red and I would love to try this phone and I know that a Verizon (CDMA) version is in the works. Anyone know when that may happen?", "time": "04-06-2016 03:06 PM", "replies": [{"postID": "post5145377", "text": "Yeah, they had a good post on their Reddit AMA. They basically said they would do it before they really looked into things. Apparently the hardware isn't as big of a hurdle as Big Red itself would be.", "time": "04-25-2016 11:43 AM", "replies": []}]}, {"postID": "post5113875", "text": "Unfortunately as of lately, no. Nextbit cancels Verizon and Sprint variants of the Robin smartphone | Android Central", "time": "04-08-2016 10:38 PM", "replies": []}]}, {"title": "Open Source Drivers", "thread": [{"postID": "post5075803", "text": "Nextbit says on their website that the drivers are all open source. Does anyone know where I can find them?", "time": "03-21-2016 01:49 PM", "replies": []}, {"postID": "post5075873", "text": "Kernel sources and binaries aren't yet available. Nextbit told me they will be released by the end of March.\nYes, I know that legally they must have been provided before the first retail model was shipped. But nobody ever does that but Google.", "time": "03-21-2016 02:34 PM", "replies": [{"postID": "post5090218", "text": "Thanks Jerry! \nDid you see they're up? https://github.com/deadman96385/andr...extbit_msm8992", "time": "03-28-2016 09:10 AM", "replies": []}]}]}, {"title": "Who owns the intellectual property stored in the cloud", "thread": [{"postID": "post5037988", "text": "Who owns the intellectual property stored in the cloud?\nPosted via Android Central App", "time": "03-06-2016 07:49 PM", "replies": []}, {"postID": "post5066511", "text": "It seems nobody has answered you, and to give you some kind of answer, I recommend you look through the privacy policy and terms of use for the cloud service\nPosted via my smexy Nexus 6", "time": "03-16-2016 11:26 PM", "replies": []}]}, {"title": "Got my Robin in the mail today!", "thread": [{"postID": "post5009824", "text": "I came into work this morning with a fedex box sitting on my desk. It seems to be that my phone was delivered to my over the weekend. \nHere are some quick pictures I snapped of it this morning!", "time": "02-22-2016 03:31 PM", "replies": []}, {"postID": "post5009846", "text": "Nice! Please let us know how you like it.", "time": "02-22-2016 03:44 PM", "replies": []}, {"postID": "post5009864", "text": "It feels like a great phone, sadly I don't think I'll be using it as a daily driver. I use to carry two phones when I was with my last company but I no longer use two phones. I am currently using the Nexus 6P and I don't think this will be replacing that as my daily driver. I might end up using it to tinker with or just post it up for sale for anyone who might want it. But if you'd like to see anything from the phone before I do that please let me know.", "time": "02-22-2016 03:52 PM", "replies": [{"postID": "post5017737", "text": "Is it okay to ask why it can't be your daily driver? Was something not enough?", "time": "02-26-2016 11:02 AM", "replies": []}]}, {"postID": "post5010918", "text": "When did you order it?", "time": "02-23-2016 07:28 AM", "replies": []}, {"postID": "post5011758", "text": "Thanks for posting those photos. I ordered one myself, I had been debating on picking up a cheap Nexus 6 or going for the Nexus 6P. Oddly enough I ended up ordering the Robin, I love the design and having a phone not everyone else has. My only concern has been the camera.\nIf things don't work out with it I'll end up with the 6P I'm sure.", "time": "02-23-2016 01:48 PM", "replies": []}, {"postID": "post5017227", "text": "How was battery life on the Robin?", "time": "02-26-2016 05:51 AM", "replies": []}, {"postID": "post5025525", "text": "I got mine in the midnight color. Figured I'd post some photos of it, you guys may want to see.\nI really love the design and feel of the phone, for just about everything I've used it for so far it ran well. Heavy games may give it a bit of a tough time. \nMy only real gripe is the camera, it's very slow to take photos. It will delay a second, almost 2 after I hit the button. Quality wise, I did some testing against a Oneplus 2 and the photos are very close, the OP2 were grainier when zoomed in, and the Robin's were less grainy but slightly more blur to them. Overall pretty good quality and pretty darn close to the OP2 photos, when not zoomed in, you can't tell much different in normal light conditions.", "time": "03-01-2016 12:54 PM", "replies": []}, {"postID": "post5029871", "text": "Just to update, I have been playing around more with the Robin, so far everything is working as expected...except the camera. I have noticed the delay between pressing the shutter and the phone actually taking the photo has varied between 1-3 seconds. This seems dependent on the amount of light when the photos are taken. (less light, longer delay)\nAlso, if you switch to manual camera mode and change the ISO to 100-200, the photos are much quicker. Although this doesn't work for all lighting scenarios so my feeling is this is just a software issue. I am pretty sure Nextbit is working on it from what I've read on their forums. Otherwise the camera typically takes a good photo. \nFor me it's somewhat of an issue, I tried to take photos of my always on the move 2yr old and by the time the shutter went off, he was completely out of frame. I hope the fix is coming soon and significantly improves this otherwise I probably won't be using the Robin much.", "time": "03-03-2016 10:16 AM", "replies": []}]}, {"title": "Orders beginning today 02/18", "thread": [{"postID": "post5002049", "text": "Nextbit's online store is set to open this morning 02/18 at 7AM Pacific. Limited supplies are available. 3,000-6,000 are all they're gonna have to start with. Get your credit cards ready Rebels!", "time": "02-18-2016 05:18 AM", "replies": []}, {"postID": "post5002217", "text": "Ready!!! I'm so excited and hope i'll get one, have no idea how much people is actually willing to buy it... Hopefully shipping to Switzerland will be possible...", "time": "02-18-2016 08:04 AM", "replies": [{"postID": "post5002228", "text": "Switzerland is on the list of available countries. Orders are supposed to go live in 50minutes or so", "time": "02-18-2016 08:10 AM", "replies": []}]}, {"postID": "post5002281", "text": "Awsome! I'm waiting 4pm, any advice on how to make sure the website will be accessible, i fear any crashes because of too many users want to log on to?", "time": "02-18-2016 08:43 AM", "replies": [{"postID": "post5002284", "text": "Orders appear to be live already. They've updated their website with the store. They also have their community section up and running!", "time": "02-18-2016 08:45 AM", "replies": []}]}, {"postID": "post5002286", "text": "i still see \"get read to roder Robin\", dou you have any link to the store?", "time": "02-18-2016 08:49 AM", "replies": []}, {"postID": "post5002312", "text": "AWWWWSOOOOOOME. i got one! by the time i was on the website though there were no more chargers, no more cables no more cover nore glass screen protectors... At least i Got the phone! Weird stuff is i had my Mac, my iPhone and my pc at work and only my mac on Chrome could access the store... Thanks msm0511 for your answers and Big Thanks to Nextbit!", "time": "02-18-2016 09:03 AM", "replies": [{"postID": "post5002313", "text": "Almost all the accessories seem to be out of stock at the moment. Not sure when more will be available. I think the bruises case has been delayed a few weeks. What color did you get?", "time": "02-18-2016 09:06 AM", "replies": []}, {"postID": "post5002317", "text": "Oh, and yeah, when I was trying to sign up for the community I had to get on my MBP. For some reason the signup didn't like my iPhone. Haha", "time": "02-18-2016 09:08 AM", "replies": []}]}, {"postID": "post5002337", "text": "Of course it didn't like our iPhones lol! i got the Midnight color with the bumps case in black as well as a screen protector ans a charger, i wanted also 2 extra cables but they all were out of stock...\nWhat about you, what did you get?", "time": "02-18-2016 09:19 AM", "replies": [{"postID": "post5002342", "text": "I went back and forth between Electric and Mint, but settled on Mint. I loved the look of Electric from the back, but the brighter blue caps seemed like they might be distracting when the screen was active.", "time": "02-18-2016 09:22 AM", "replies": []}]}, {"postID": "post5009813", "text": "You made a smart choice picking the Mint color, it is just beautiful! \nI got mine this morning and it looks amazing. Sadly I don't carry around two phones anymore like I did when I backed it and I plan to stay using my Nexus 6P as my daily driver.", "time": "02-22-2016 03:26 PM", "replies": [{"postID": "post5018006", "text": "I got mine on Thursday morning. Just started using it this morning though.", "time": "02-26-2016 01:32 PM", "replies": []}]}]}, {"title": "Clarification", "thread": [{"postID": "post4942560", "text": "Hey guys, \nI'm really interested the Nextbit Robin but I have some concerns that I haven't really seen clarified in any of the coverage videos I've watched. \n1.) Does the phone's custom software allow for creating folders on the homescreen for grouping apps? It seems that every time I see the phone displayed, the homescreen is just a wall of icons. \n2.) Is there no way to manually permanently delete an app? I get that the integrated cloud technology will automatically transfer apps that are rarely used or inactive after a period of time, but can you still delete an app from the Settings menu? I find that it would be pretty annoying if you dl an app that ends up being really bad or not to your liking, and then you have to keep on the phone forever. \nAnyways, those are my questions and I hope someone can help me out here. Thanks!", "time": "01-10-2016 02:47 PM", "replies": []}, {"postID": "post4943023", "text": "I'm sure you can create folders on the homescreen. That's a standard feature that many companies would receive terrible reviews for if they didn't include that. If not, you might be able to find a launcher that works with the cloud integration software.\nAs for the cloud integration permanent deleting, I'm sure that they will have a way to permanently delete software and its data from both the phone and the cloud.\nOf course, I don't have the Nextbit Robin, but this is just probability, since the company is spending so long trying to perfect the phone (if you check out the updates on kickstarter, you'll see that they delayed it a bit to make sure it works very well, and that many checkpoints were running behind because again they wanted to perfect it)", "time": "01-10-2016 08:35 PM", "replies": []}, {"postID": "post4943057", "text": "Sorry, I just double checked the pictures. On one of the pictures, there is, in fact, a folder on the launcher.", "time": "01-10-2016 09:14 PM", "replies": []}, {"postID": "post4944339", "text": "So I got a response from Nextbit and they confirmed that you can in fact create folders and delete apps. This is good to hear because it removes the concerns I had about their custom OS possibly removing some functionality. It looks like the nextbit os will run pretty much like stock Android 6.0, but with their cloud tech integrated into the software. Good stuff!", "time": "01-11-2016 02:08 PM", "replies": []}, {"postID": "post5009860", "text": "I can confirm that you will in fact be able to create folders just like on stock Android and also delete apps right from the home screen. It will also ask if you'd like to remove it from their cloud as well.", "time": "02-22-2016 03:50 PM", "replies": []}]}]
[{"title": "Shipping starts today!", "thread": [{"postID": "post5002046", "text": "So shipping for early GSM backers starts today! Any other backers checking the forums?", "time": "02-18-2016 05:15 AM", "replies": []}, {"postID": "post5003514", "text": "I am a backer have not received any shipping information as of yet as long as I get if by months end I am fine.", "time": "02-19-2016 01:31 AM", "replies": [{"postID": "post5003565", "text": "I haven't gotten anything official from Nextbit yet, but it is showing up in my fedex delivery manager account.", "time": "02-19-2016 03:05 AM", "replies": []}]}, {"postID": "post5009782", "text": "I got into work this morning with a fedex box with my Robin in it sitting on my desk, it must of been delivered over the weekend!", "time": "02-22-2016 03:13 PM", "replies": []}]}, {"title": "Did you back it? What excites you about it?", "thread": [{"postID": "post4655075", "text": "Title says it all. I backed it because I love the idea of the user not having to manually manage storage constantly. I'd love a phone where it just did it for me.", "time": "09-02-2015 12:05 AM", "replies": []}, {"postID": "post4655239", "text": "I didn't back it, but it's good to see a company coming up with fresh ideas. I like the design of the phone, but I'll wait for AC to review it first.", "time": "09-02-2015 02:19 AM", "replies": []}, {"postID": "post4660696", "text": "I'm 95% sure I'm gonna back it before October. As long as they keep the 349 price until the end of the campaign I'm in.", "time": "09-03-2015 10:06 PM", "replies": []}, {"postID": "post4660817", "text": "So I just backed it. I picked the $399 option. I'm down with what they're trying to do, and I really like the UI from what I've seen. Just hope the performance and camera are good.", "time": "09-03-2015 11:22 PM", "replies": []}, {"postID": "post4660960", "text": "Ive backed it. I couldnt at first because they werent shipping to Australia. I tweeted them about it and a couple of hours later, they added the option. So far, the service has been awesome.\nPosted via the Android Central App", "time": "09-04-2015 01:06 AM", "replies": [{"postID": "post4660963", "text": "I think I saw you in the comments on ks. Now we just need a good forum besides that awful ks comment section. Maybe it'll be here!", "time": "09-04-2015 01:09 AM", "replies": []}]}, {"postID": "post4667631", "text": "I'm going to back it before the end of the campaign. I like that we get so much freedom with the phone. Unlocked bootloader. SIM unlocked. 100 GB of cloud storage. This seems like the phone I've been waiting for. I'm pumped.\nSent from my LG-H811 using Tapatalk", "time": "09-07-2015 03:01 AM", "replies": []}, {"postID": "post4706820", "text": "I'm thinking about backing it. Love trying new stuff. But I see shipping says Feb 2016. I hate waiting lol.\nPosted via the Android Central App", "time": "09-24-2015 09:50 PM", "replies": []}, {"postID": "post4792820", "text": "Can't wait for it! But I have other things to keep me occupied fortunately", "time": "10-31-2015 07:33 PM", "replies": []}, {"postID": "post4802227", "text": "Wish I jumped on as a backer, but did not. Oh well, will wait until release to pick one up.", "time": "11-04-2015 08:49 AM", "replies": [{"postID": "post4803611", "text": "Same here but when I first checked they had no intentions of making a version that would work on Verizon. Now I find out they are and they already had a special offer that is over. Oh well, I guess I'll wait and see how happy people are with them before I pay full retail.", "time": "11-04-2015 04:27 PM", "replies": []}, {"postID": "post4951575", "text": "Pre-order is same price?\nPosted via the Android Central App", "time": "01-15-2016 07:04 PM", "replies": []}]}, {"postID": "post4832817", "text": "I refuse to back kickstarter type programs. People get burned ALOT. I will however buy one or two when they are officially released.", "time": "11-15-2015 08:24 AM", "replies": []}, {"postID": "post4971863", "text": "I'm very late to the party since I just learned about it, but I'm interested in it. It sounds like a great device. I'm not sure if I'll be okay with it being my first android experience though, considering the price point.", "time": "01-29-2016 08:46 AM", "replies": [{"postID": "post4971879", "text": "What are you currently using?", "time": "01-29-2016 08:56 AM", "replies": [{"postID": "post4971898", "text": "Right now, I'm using Windows Phone, and a Lumia 640 at that. I'm thinking of trying Android. I'm considering the Nexus 5x, since there's a temporary price drop and it sounds like a great device. This device and the 5x are very similar but I like that though.", "time": "01-29-2016 09:10 AM", "replies": []}]}]}, {"postID": "post5002985", "text": "Libra, I would go with this over the nexus actually. I don't really know why....I watched the video review, and its the first android device I have seen that's smooth as our windows devices. I am hating my notes, they are pure garbage. I cannot wait to get my new 1020...but I may....Just may be getting this soon as well.", "time": "02-18-2016 04:50 PM", "replies": [{"postID": "post5004509", "text": "Yeah, it doesn't hurt to give it a try. I can't afford that price tag right now, but I'll be on the lookout for when used ones start to appear (depends how I feel). Let us know what you think though, if you give it a whirl.\nIf I didn't buy the 5x first, I probably would have considered this, even if it would take a little while to save up for this.", "time": "02-19-2016 03:12 PM", "replies": []}]}, {"postID": "post5006388", "text": "Contemplating giving this a shot. I love the 6P, but it's little big. I think the Robin might be more the size I'm looking for. We'll see.", "time": "02-21-2016 12:03 AM", "replies": [{"postID": "post5006583", "text": "Unfortunately Nextbit said on Twitter they sold out of their first batch last night.", "time": "02-21-2016 06:49 AM", "replies": [{"postID": "post5007973", "text": "Oh, I know. I was planning on waiting before picking one up anyway. I'd like to see how other users feel about it first.", "time": "02-21-2016 08:40 PM", "replies": []}]}]}]}, {"title": "Nextbit Robin: $25.00 for shipping?", "thread": [{"postID": "post4950776", "text": "Thinking about ordering one but wow, they want $25.00 for shipping, seems extreme, no? So they keep the list price just under 400 bucks but then add on a hidden fee in shipping. They could ship for $5.25 USPS Priority Flat Rate and OK, so they need to cover the cost of the person packing it, maybe another 5 bucks. $25.00 just seems kind of outrageous to me, it's 6.25% of the cost of the phone.", "time": "01-15-2016 08:53 AM", "replies": []}, {"postID": "post4950976", "text": "Where is it coming from? A lot of phones are manufactured in China, so you're paying the cost of getting it from there, even if it's coming over in bulk quantities. It still costs them something and they evidently want you to pay for it.", "time": "01-15-2016 11:14 AM", "replies": []}, {"postID": "post4950989", "text": "That's the cost direct from Nextbit, Nextbit is charging $25.00 for shipping. Motorola ships their phones for free...", "time": "01-15-2016 11:22 AM", "replies": [{"postID": "post4951571", "text": "Just as with any other product that has \"free shipping,\" the shipping price is hidden in the retail price.\nPosted via the Android Central App", "time": "01-15-2016 07:01 PM", "replies": []}]}, {"postID": "post5002044", "text": "You guys have to remember how small this company is. They have one office in San Francisco. This isn't a worldwide brand yet.", "time": "02-18-2016 05:14 AM", "replies": []}]}, {"title": "Will it be open-source?", "thread": [{"postID": "post4940770", "text": "Will the custom software be open-sourced? For custom ROM development, etc, at least for just the Robin?", "time": "01-09-2016 01:20 PM", "replies": []}, {"postID": "post4940884", "text": "Android is open source, the custom modifications normally aren't. Whether Nextbit is going to change that is something we'll just have to wait to see.", "time": "01-09-2016 02:31 PM", "replies": []}, {"postID": "post4943062", "text": "Found this quote on the website....\n\"No barriers.\nRobin comes with an unlocked SIM, so you can choose the right carrier for you. And because we think what you run should be up to you too, we’ve made it as easy as possible for you to customize Robin. Its unlocked bootloader and open source drivers make it easy to load CyanogenMod or any other ROM you want and Robin will still be under warranty.\"\nI really hope that means that it will at least release the apk or whatever, if not open source...", "time": "01-10-2016 09:18 PM", "replies": []}]}, {"title": "Anymore news on the robin?", "thread": [{"postID": "post4865690", "text": "I am interested in these phones, anymore news on them?", "time": "11-30-2015 03:16 PM", "replies": []}, {"postID": "post4867116", "text": "The deadline for backer surveys is some time today, and the phones are available for preorder at nextbit.com for the public. They have a Robin working with Marshmallow running well enough for Scott Croyle to use as his daily driver. Things are still on schedule for a January deliver for early backers, so that's good. They've had another meet up in London recently where they showed off the final colors (including the backer exclusive Electric colorway), and showed off the working Robin. Up until recently they were showing the OS on a Nexus 5. In the next few weeks I believe the camera samples should be shown off. Those who have heard the audio on a non-final build say it's as loud and clear as the HTC One M8 which is impressive imo. \nNot sure how much you've been following Nextbit, so all that could be old news for you. I'll try and help with any more questions if you have them. Just ask \nOh, one important thing: They've changed the material for the middle back piece. It was originally a plastic infused aluminum, but there were some quality control issues (I can't remember what they were now), so they switched it to a metal framed plastic.", "time": "12-01-2015 09:21 AM", "replies": []}, {"postID": "post4905732", "text": "I am interested in this phone, too. In the last month I tried 3 different phones: Moto X Pure, OnePlus X, and just recently, the Nexus 5x. I found fault with each of them, eventually favoring my OnePlus One running SlimSaber every time.\nI am looking for a smaller screen size/form factor plus great ROM support. I was really hoping the 5x was going to do it for me, but I found it very laggy and would often become completely frozen. there have been a lot of reports about this, but I attribute it to the 2GB of RAM.\nThe Robin seems to have the same specs as the 5x, with the bonus of 3GB of RAM. Time will tell if the developer support is there. If it is, I'm going to try it. At $399 retail, I bet it will be available on swappa for a little less than that, which would make it a pretty good deal in my book. I'm a little concerned about the bottom notification LED, as there is no way to cover it up when it's on your bedside table. But there are ways to disable the LED with Do Not Disturb I believe, so maybe it will be a non-issue. I like the design/aesthetics, too. I don't care that it's plastic just hope it's not too slippery.", "time": "12-20-2015 06:10 PM", "replies": []}, {"postID": "post4921236", "text": "nope that's all new to me. I am still waiting for them to be in stock before I order. But I think my wife and I are getting two to have something different. they look great however!", "time": "12-29-2015 06:23 AM", "replies": []}]}, {"title": "Fingerprint Scanner", "thread": [{"postID": "post4653125", "text": "I, for one, found it really interesting that they put the scanner on the side. It doesn't look as big as other phones! I'd certainly like to try it and see how it works.", "time": "09-01-2015 09:30 AM", "replies": [{"postID": "post4655071", "text": "I'm hoping they share a video soon showcasing how it works compared to other phones with scanners.", "time": "09-02-2015 12:03 AM", "replies": []}]}, {"postID": "post4656022", "text": "We shall see. Pretty interesting things coming out of IFA this year!", "time": "09-02-2015 10:41 AM", "replies": []}, {"postID": "post4660695", "text": "I'm honestly super interested in this phone. I'm not sure if it's b/c it looks so different or what. I'm probably gonna back it in a couple weeks before the October deadline.", "time": "09-03-2015 10:04 PM", "replies": [{"postID": "post4667629", "text": "Same here. When I get paid at the end of the month I'm getting a Midnight for me and a Mint for the wife. She's coming from a Nexus 5 and I'm coming from a G4. We both like the design and the features. And being on T-Mobile with unlimited data we have no worries about always uploading to the cloud.\nSent from my LG-H811 using Tapatalk", "time": "09-07-2015 02:58 AM", "replies": [{"postID": "post4671107", "text": "I ended up backing the same night I commented. So much for me waiting. Haha", "time": "09-08-2015 04:55 PM", "replies": [{"postID": "post4671119", "text": "Hahaha. Well I get paid at midnight. If I'm still up I'll probably back it as well.\nSent from my LG-H811 using Tapatalk", "time": "09-08-2015 05:00 PM", "replies": [{"postID": "post4671128", "text": "Not sure if you've checked out the comments on KS or not, but Nextbit has been interacting with the commenters answering the questions they can. They seem to be really honest and not overshooting things. I'm getting really excited.", "time": "09-08-2015 05:02 PM", "replies": [{"postID": "post4671130", "text": "I have checked out the comments. I can't post because I haven't backed them yet. I've asked them a few questions on Twitter, but haven't gotten a response. Yet stupid questions like \"Why No Verizon?! 😖😖\" get a response from them.\nSent from my LG-H811 using Tapatalk", "time": "09-08-2015 05:04 PM", "replies": [{"postID": "post4671151", "text": "I've noticed on the KS page if you catch em at a time they've been answering commenters recently they're good about getting back with you. There seems to be so many questions they get lost if Nextbit isn't monitoring at the time. I'm assuming it's the same on Twitter. I haven't been keeping up on there though.", "time": "09-08-2015 05:13 PM", "replies": []}]}]}]}]}]}]}, {"postID": "post4671161", "text": "Well I sent another question today literally 5-7 minutes after they had just answered one. Maybe my questions are stupid, or you're right there's just too many people messaging them.\nSent from my LG-H811 using Tapatalk", "time": "09-08-2015 05:18 PM", "replies": [{"postID": "post4672164", "text": "If you want post your questions here and I'll ask them in the KS comments to see if I can get an answer.", "time": "09-09-2015 07:07 AM", "replies": [{"postID": "post4672562", "text": "It's really just stuff I can wait to find out about once the phone comes out. I asked if they were planning on doing an event in other cities, more specifically, Seattle. How the front facing speakers sounded and if there were going to be any other color options later on.\nSent from my LG-H811 using Tapatalk", "time": "09-09-2015 10:36 AM", "replies": [{"postID": "post4676713", "text": "In the comments they said they liked the idea of a mint and midnight mashup, but it wouldn't be for the first Robin. I know each of the ffs has it's own amp, so sound should be fairly good. I haven't seen anything on other cities yet.", "time": "09-11-2015 07:28 AM", "replies": [{"postID": "post4677016", "text": "Cool. Thanks man. \nSent from my LG-H811 using Tapatalk", "time": "09-11-2015 10:07 AM", "replies": []}]}]}]}]}]}, {"title": "A whole new breed of phone", "thread": [{"postID": "post4653114", "text": "The Nextbit is offering to be a middle ground between mid and high end devices. A 32 GB storage, working in tandem with cloud storage. Priced at $400 it doesn't seem like that bad of a phone.\nFrom the blog: Nextbit's Robin looks to merge phone and cloud like never before | Android CentralNextbit Robin specs | Android Central", "time": "09-01-2015 09:26 AM", "replies": []}, {"postID": "post4653121", "text": "I wonder who's gonna be supplying the cloud storage... If they need Kickstarter for the hardware, I'm sure running a storage service of their own would be even more costly...", "time": "09-01-2015 09:29 AM", "replies": [{"postID": "post4653129", "text": "One drive I would suspect. \nSent from my Verizon Samsung Galaxy Note 5", "time": "09-01-2015 09:32 AM", "replies": []}]}, {"postID": "post4660704", "text": "I'd assume the same people that supplied Baton will. I've never used it though, so I don't know much about it.", "time": "09-03-2015 10:09 PM", "replies": []}]}]
