[{"title": "Cant access emergency information on lockscreen using android 7.0 Nokia 3", "thread": [{"postID": "post5895501", "text": "I am using a Nokia 3 Android 7.0 phone and the emergency information feature doesn't come up on lockscreen but rather emergency calls only how do I fix this. I can just imagine my phone bring locked and no one can access my info. Please help", "time": "07-22-2017 12:55 PM", "replies": []}, {"postID": "post5895504", "text": "Mod Note: Thread moved for better visibility.", "time": "07-22-2017 12:57 PM", "replies": []}, {"postID": "post6014877", "text": "This issue is there even in Nokia 6 with Android 7.1.1. Do anyone know how to access it? Or is Nokia not providing access to it?", "time": "10-11-2017 07:07 AM", "replies": []}, {"postID": "post6180751", "text": "Have you tried searching in settings for emergency, that should show the option for emergency information?", "time": "03-06-2018 07:39 AM", "replies": []}]}, {"title": "why is \"favourite\" showing after pressing call register icon", "thread": [{"postID": "post6009164", "text": "Im using nokia 3,when i press the 📞 icon it displays the favorites and i don'twant that,i want it to take me straight to call register list.... How do i set that up?", "time": "10-07-2017 11:48 AM", "replies": []}, {"postID": "post6180728", "text": "Open the phone app then go to the recent calls tab and then exit the app by pressing the task manager button and close it from there, the next time the phone app is opened then it will open on the recent calls tab.", "time": "03-06-2018 07:12 AM", "replies": []}]}, {"title": "white background on nokia 3", "thread": [{"postID": "post6021672", "text": "Im unable to upload a screen shot ,but its the background that comes after sliding up from home screen , i want thebackground to be the wallpaper of my choice", "time": "10-16-2017 03:46 AM", "replies": []}, {"postID": "post6180724", "text": "That cannot be changed unless you use an app like LWP+ or the Pixel Launcher and a dark coloured wallpaper.", "time": "03-06-2018 07:09 AM", "replies": []}]}, {"title": "how to remove white background on nokia 3", "thread": [{"postID": "post6009173", "text": "The white background on the menu screen of nokia 3 is annoying especially at night ,how do i change it or make the wallpaper to apply both on background of the phone and menu screen?", "time": "10-07-2017 11:52 AM", "replies": [{"postID": "post6180723", "text": "I'm going to assume that you're talking about the notification shade, app drawer, Google Feed and settings. If so then no you can't change it without a third party app like LWP+ or the Pixel Launcher and a dark coloured background.", "time": "03-06-2018 07:07 AM", "replies": []}]}, {"postID": "post6009836", "text": "could you please upload a screenshot?", "time": "10-07-2017 06:53 PM", "replies": []}]}, {"title": "Nokia 3 GPS Question", "thread": [{"postID": "post6075258", "text": "Planning to buy a Nokia 3. My phone use is very light - I currently have a Lumia 525 which is more than 3 years old. The only reason I am looking for a new phone is that the battery is almost dead & it doesn't make sense replacing the battery.\nI use the phone to make calls, text messages, WhatsApp, Enterprise Outlook email, occasional browser use & Uber. \nNokia 3 seems right for me, but I am worried about reports that GPS doesn't work fine on Nokia 3 & a lot of mediatek phones. I don't GPS much except through Uber. So I want to know if I Nokia 3 is good enough for or should I go for a Nokia 5 instead?", "time": "11-18-2017 12:17 AM", "replies": [{"postID": "post6079950", "text": "If you can, get the nokia 5, 6 or 8... Those would be my choices... 6 & 8 because of the bigger memory option. 5 because its better than the 3. (my budget choice).... \nJust my opinion", "time": "11-21-2017 03:03 PM", "replies": []}]}]}, {"title": "My Nokia 3 won't turn on and i can't get into the hard reset meny", "thread": [{"postID": "post6067840", "text": "The phone turn's on, but it does not go any furter then 'powerd by android' and stays like that for about 30 sec, then it turns itself off, and the on agein. i have tried to hold in the power button and volum upp button, but I can't get into the meny. It has been doing this for about 3 houres now. \nWhat can I do?", "time": "11-13-2017 01:49 PM", "replies": []}, {"postID": "post6068114", "text": "🙋Try holding Power and Volume Down.\nA factory reset may not help however. There may be a hardware or software problem. If you do reset, tell us what happens.", "time": "11-13-2017 05:07 PM", "replies": []}]}, {"title": "My google drive not backing up phone data", "thread": [{"postID": "post5904194", "text": "I just bought a nokia 3 three weeks ago. Today i noticed it wasnt backing up stuff. Went to settings, personal, backup and reset. Backup my data on and automatic restore on. But when i went to google account, back up to googledrive is greyed out and says it is disabled by your admin. I dont understand whay that means. I lookrd this up and apparently if u have a gsuite enterprise or a corporate account. It wont let u back up data. But as far as i know, i havent bought any such thing. This is my personal phone used only by me not a corporate phone. Please help", "time": "07-29-2017 09:33 AM", "replies": []}, {"postID": "post5904578", "text": "Is this your personal, self created Google account or did you have it assigned to you from work or school? I think that may be the issue. However, you may also check this thread (although its more of a chrome issue) to see if it helps: https://productforums.google.com/for...me/jqmeXeFFXMo", "time": "07-29-2017 03:07 PM", "replies": []}, {"postID": "post6038678", "text": "This is a Nougat (maybe Oreo) OS issue, not a device issue. This thread should probably be moved to https://forums.androidcentral.com/android-7-0-nougat/. \nSee https://productforums.google.com/for...o/524MbQrIAwAJ. \nThe natives are getting restless, myself included. \nDevice: Nokia 6 (TA-1025) \nOS: 7.1.1 w/ security patch September 1, 2017", "time": "10-25-2017 06:31 PM", "replies": [{"postID": "post6039383", "text": "Definitely looks like an Android issue.\nNokia 6 (TA-1033) 7.1.1 patch September 1, 2017\nRegards\nInfinidim", "time": "10-26-2017 06:40 AM", "replies": []}]}]}, {"title": "Process and UI system not working", "thread": [{"postID": "post6039244", "text": "Hi, I have a Nokia 3 and recently it has been paying up and freezing etc but this morning I unplugged it from the charger and had various system messages that the processing system and system UI had stopped working. I have tried turning it off but nothing happens,even when I have held down the power button for a considerable amount of time. This is rather important as I am a student and need my phone for information and deadlines. Is there anything else I can do? I have even tried taking the SIM card out and replacing it but it just keeps the same messages popping up and I can't get rid of them or fix it. Any help would be appreciated. Thanks", "time": "10-26-2017 02:47 AM", "replies": []}]}, {"title": "Why there are no non-call lockscreen notifications in my Nokia 3.", "thread": [{"postID": "post5936851", "text": "Hello People! \nI have a NOKIA 3, with Android 7.0. \nWhenever an sms/whatsapp/email notification comes when the phone is locked, it only makes the notification ringtone e.g sms/whatsapp/email ringtone, but does not turn on the screen, like normally phones does..., meaning along with the ringtones the screen also gets turned on showing what has came... a message, an email, a whatsapp etc... but with mine's doesn't happen.\nSo please help people, this is frustrating.", "time": "08-24-2017 06:49 PM", "replies": []}]}, {"title": "Why My Phone Has \"Epileptic Seizures\" ?", "thread": [{"postID": "post5922340", "text": "From Time To Time My Phone (Nokia 3 Android) Have Some \"Epileptic Seizures\" ... Vibrating and Goes \"Back Back Back Back\" ... And I have to Push the Start Button, Enough Times for to make \"It\" Stop \"All That\"... What Can I Do To Avoid \"That\" ?", "time": "08-13-2017 11:49 AM", "replies": []}, {"postID": "post5922423", "text": "Either the motherboard is defective or water got into the phone somehow (going from a hot humid outdoors into a cool air-conditioned place can cause condensation inside the phone, which is the same as putting it into water).", "time": "08-13-2017 01:51 PM", "replies": []}]}, {"title": "Nokia 3 : After starting the phone the sound of all applications go on mute, any solution to sort ?", "thread": [{"postID": "post5900078", "text": "I think when the cache is full the sound of the phone goes on mute and doesn't play any song, is this an issue of the Android 7.0, any other users facing the same issue? \nis there any solution to sort this out. Please Help", "time": "07-26-2017 03:56 AM", "replies": []}, {"postID": "post5901268", "text": "Welcome to Android Central! What about ringtones or notification tones? Can you hear anything using wired or Bluetooth headphones?", "time": "07-27-2017 01:51 AM", "replies": []}]}, {"title": "Who is interested in the Nokia 3?", "thread": [{"postID": "post5694569", "text": "Anyone interested in picking this up? Sound off below.", "time": "02-28-2017 04:05 PM", "replies": []}, {"postID": "post5694689", "text": "There's the idea, prevalent among most manufacturers, that the smaller options of a range of phones have to have lesser specs, instead of simply being....smaller. I'd have liked this to be a 4.3\"-4.5\" device, with the FPS and other good stuff of the larger devices.", "time": "02-28-2017 06:01 PM", "replies": []}, {"postID": "post5694748", "text": "Really interested in Nokia 6", "time": "02-28-2017 06:49 PM", "replies": []}, {"postID": "post5696930", "text": "If I were looking for a phone in that price range, it'd definitely be the Nokia 3. Premium build quality, beautiful design, and a stock Android experience? No reason not to sign up.", "time": "03-02-2017 02:06 PM", "replies": []}, {"postID": "post5755143", "text": "Maybe for my kids. I'm eyeing this and possibly the Moto C", "time": "04-11-2017 11:49 PM", "replies": [{"postID": "post5802244", "text": "Moto C Plus will be the better option. Bigger battery and cheaper. \nBut if Nokia 3 has better build quality than you could make a case for it but otherwise i don't think it stands much of a chance against Moto C and G5($180).", "time": "05-05-2017 02:36 PM", "replies": []}]}, {"postID": "post5802971", "text": "I don't think I will be looking at this one. Not happy with the processor or plastic build.", "time": "05-06-2017 06:44 AM", "replies": [{"postID": "post5864620", "text": "The build quality is actually amazing. Even the polycarbonate back is not cheap at all. If you've ever held a Nokia Lumia 930, it will feel very similar. \nUnfortunately it's the only thing the phone has going for it. Everything else is pretty terrible, from stock Android to the lag.", "time": "06-26-2017 10:07 PM", "replies": [{"postID": "post5864794", "text": "I think the update strategy is a really good point for all the Nokia / HMD phones. I am still looking at the 5 and the 6 currently.\nInfinidim", "time": "06-27-2017 03:37 AM", "replies": [{"postID": "post5865668", "text": "I would rather them doing a Nokia skin and adding all the basic features (not duplicate apps) that stock Android lacks like a decent theme engine to access the theme engine Sony offered the AOSP project and that is actually present on all stock Android devices (if you root your phone, Substratum can access that theme engine) or a decent multi-tasking screen (unlike the original splitview provided by Samsung, stock Android doesn't give you a list of app to open when you enter split screen).\nOn stock Android yeah, updates are very important. But that's because stock Android is playing catch us to decent versions of the OS offered by Samsung and LG (even if not always well optimised).", "time": "06-27-2017 05:15 PM", "replies": [{"postID": "post5881468", "text": "I tried a MotoG4 for almost 12 months primarily to avail of the update strategy ( being close to stock Android) . However I really missed things like a separate \"phone\" account i.e. contacts stored on phone only , not in the cloud. Eventually sold the Moto and fell back to my old Xperia J whilst I ponder what to do next . I was attracted by the Nokia 3 ( I think anything with a display over 5\" is too big) but am definitely put off by the reports of lagginess\nThe choice seems to be \"stock android\" and a relatively good update strategy versus a manufacturers skinned android to enhance stock which then causes delays in getting updates", "time": "07-11-2017 01:25 PM", "replies": []}]}, {"postID": "post5866051", "text": "I still don't trust Nokia that they will provide Android O for Nokia 3. \nMany companies have lied about updates before. Nokia 5 and 6 will get it for sure but Nokia 3 is suspect.", "time": "06-28-2017 01:22 AM", "replies": [{"postID": "post5873253", "text": "Nokia always delivered on their promises.\nProblem here being that this is HMD, not actually Nokia. So they still have to prove that they actually kept the spirit they had when they were officially part of Nokia. So far, I don't think so.\nFor example, I did something I NEVER did before, even less to a Nokia device: I returned the Nokia 3.\nThe build quality is amazing and the LCD screen, considering it's LCD and in a phone that costs 170€, is great...but that's it. Everything else is just horrendous. The thing lagged and froze out of nowhere, the camera was utter crap...the experience just wasn't good.\nAnd without root, it was impossible to salvage the phone. So back to the store it went.\nThat alone doesn't make me too optimistic about the future Nokia phones done by HMD if they keep following this path. Even if they deliver updates on time.", "time": "07-04-2017 01:18 PM", "replies": []}]}]}]}]}, {"postID": "post5848951", "text": "Phone launched in India for 9500 (approx $145). \nMediatek 6737 chipset with 2gb ram and 16gb storage. \nQuite overpriced as Redmi 4 offers SD435 and fingerprint sensor as well for 7000( $110).\nWon't sell at this price. Dumb people do buy such phones but that's only due to marketing which Nokia hasn't done for these phones.", "time": "06-13-2017 08:19 AM", "replies": []}]}, {"title": "Nokia3 2 sim,s?", "thread": [{"postID": "post5868476", "text": "My Nokia don't have a slot for the 2 sim do I need to get n new plate or n different phone to use the 2 sim?", "time": "06-30-2017 12:06 AM", "replies": []}, {"postID": "post5872516", "text": "Welcome to Android Central! Do you mean that the tray only has space for one SIM?", "time": "07-03-2017 08:09 PM", "replies": []}]}, {"title": "The hardware keys....", "thread": [{"postID": "post5694607", "text": "Looking at the photo provided by the blog, I am curious if the hardware keys light up when pressed. \nI have used the Zenfone 2, and that device had no lighted keys. This made use at night somewhat difficult.", "time": "02-28-2017 04:44 PM", "replies": []}, {"postID": "post5864616", "text": "I have a Nokia 3. I can confirm that no, they do not light up.", "time": "06-26-2017 10:04 PM", "replies": [{"postID": "post5864795", "text": "Pity \nInfinidim", "time": "06-27-2017 03:38 AM", "replies": []}]}]}, {"title": "No fingerprint sensor", "thread": [{"postID": "post5696588", "text": "I get why this was omitted, and for a good reason. It helps keep the cost down. But is this a deal breaker for anyone?", "time": "03-02-2017 09:10 AM", "replies": [{"postID": "post5716888", "text": "Not really  Don't get me wrong, its a lovely feature to have but i don't think i would miss not having it. This could be because i have never owned a phone that uses one. (I've used one before though). At the moment I'm happy with \"Picture Password\" and a simple Pin code", "time": "03-19-2017 01:52 AM", "replies": []}]}, {"postID": "post5696766", "text": "It is for me I'm afraid.\nSent from mTalk", "time": "03-02-2017 11:46 AM", "replies": []}]}, {"title": "Nokia 3 availability", "thread": [{"postID": "post5696572", "text": "I missed this the other day. Nokia announced that all three of the new phones will be available globally.Nokia is back with three new Android phones, launching globally! | Android Central", "time": "03-02-2017 08:56 AM", "replies": []}]}, {"title": "Nokia 3 specs", "thread": [{"postID": "post5695301", "text": "From the blog: Hands on with Nokia's new Android phones: the 3, 5, and 6 | Android Central\nCPU: Mediatek 6737\nRAM: 2 GB\nStorage: 16 GB\nScreen: 5\" IPS LCD 1280x720\nCamera 8 MP front and back, f/2.0; 1.12um pixels\nBattery: 2650 mAh\nCharging port: Micro USB\nOS: Android 7.0\nAdditional specs from GSMArena: Nokia 3 - Full phone specifications\nFront mounted FPS\nExpandable storage to 256 GB.", "time": "03-01-2017 08:30 AM", "replies": []}]}, {"title": "The entry level Nokia", "thread": [{"postID": "post5694308", "text": "Nokia announced a few new phones at MWC. The entry level one being the Nokia 3, which is a 5\" device, running 7.0.\nThe rest of the specs, well, may be raising eyebrows. A MediaTek CPU (understandably) 2 GB RAM, and 16 GB internal. With Android now using seamless updates, this device I would guess will have about 6 GB used for the OS.\nPrice was announced at 139 Euros. Leaving out price differences between countries, the exchange to USD is about $150. So, not bad for that price, but given it's Nokia, it possibly could have been better.\nWhat do you all think? Something to possibly pick up?\nFrom the blog: http://www.androidcentral.com/nokia-6", "time": "02-28-2017 12:27 PM", "replies": []}, {"postID": "post5694397", "text": "I'd tend to avoid this one unless the smaller size were important to me, but it's not much smaller than the 5. The lack of FPS - perfectly fair enough in such a low-priced device - is the clincher for me.", "time": "02-28-2017 01:31 PM", "replies": []}, {"postID": "post5694484", "text": "I can't put my finger on what, but something doesn't sit right about this device. I don't know if it's the price point, or what, but I have the feeling we will be hearing about this after it's released.", "time": "02-28-2017 02:48 PM", "replies": []}]}]
