[{"title": "moving data from Internal Storage to SD card on Blackberry DTEK 50", "thread": [{"postID": "post6147644", "text": "1-How Can Data be copied from (Internal Storage) to an (SD card)\n2-After the transfer of Data, can the data be deleted on the (Internal Storage) while being maintained on the SD card and accessible?\n3-Can this transfer/delete be set up automatically?\nThanks,", "time": "01-28-2018 02:04 AM", "replies": [{"postID": "post6147934", "text": "With a file manager. (Copy it, then paste it to the card, don't move it. Then, if the copy was successful, delete the original. If a copy goes bad you still have the original and can copy it again. If a move blows in the middle [or the battery dies during a move] you can lose both the original and the copy.)Assuming that the app that accesses it can be told to access it from the card (some can, some can't), yes. If it's media, restart the phone after deleting the originals and the phone will \"know\" that the files are on the card.Yes, it's a trivial shell script - if you know shell scripting. (Can it be set up to do it automatically periodically, without your doing anything? Only if you can write a \"run on startup\" script, or if you know how to use cron (which is an external Linux function).", "time": "01-28-2018 12:27 PM", "replies": []}]}]}, {"title": "Why my DTEK50 doesn't have the option of wifi calling?", "thread": [{"postID": "post6131108", "text": "I want to use wi-fi calling, but my DTEK50's OS 6.0.1. doesn't give me this option. \nI noticed that it is having problems updating the software. I followed the steps to resolve the error by going to Settings/Google Play Services/Uninstall Updates. I get asked if I want to replace this app with the factory version. At this point, I click on Cancel because the instructions provided by Blackberry fall short of explaining all that I should expect from this point forward, and I am too scared to make any wrong moves. \nIs this Error Message in any way related to the fact that I don't have the Wi-fi Calling option under Settings/More? I have Airplane Mode, NFC, Tethering & Mobile Hotspot, VPN, Cellular networks, and Emergency alerts. That's it.\nThank you kindly for your help.", "time": "01-09-2018 06:49 AM", "replies": []}, {"postID": "post6131233", "text": "It sounds like Blackberry/TCL didn't build this capability into the DTEK50's software.", "time": "01-09-2018 09:35 AM", "replies": []}]}, {"title": "auto turn off the dnd mode on dtek50", "thread": [{"postID": "post5702417", "text": "The phone turns on the \"DND\" mode automatically OK as set, but doesn't go back automatically to the \"active\" mode after the period of DND is done. Has to be adjusted manually every day. Any fix for that???", "time": "03-07-2017 07:19 AM", "replies": []}, {"postID": "post5905557", "text": "Known bug. It does actually end dnd. It just stays in silent. Also some devices led still blinks during dnd", "time": "07-30-2017 12:22 PM", "replies": []}, {"postID": "post5980704", "text": "I have found a way to override this issue using an app called MacroDroid. Free version gives you 5 macros then you have to pay. If you install, go to templates, then latest and search for \"drizzt09\" . You will see my macros and you can install and test.", "time": "09-18-2017 03:13 AM", "replies": []}]}, {"title": "Pourquoi ma barre du haut ne descend plus", "thread": [{"postID": "post5907223", "text": "Pour blackberry dtek50 lorsqu'il y a des émail, notification ou autres la barre ne descend plus afin d'avoir un aperçu des message", "time": "07-31-2017 04:39 PM", "replies": []}]}, {"title": "About Nought update?", "thread": [{"postID": "post5718958", "text": "Hi ,currently I'm using black berry dtek50 with marshmallow, when did I get nought update, esle BlackBerry mobiles get update otr not??", "time": "03-20-2017 06:10 PM", "replies": [{"postID": "post5745335", "text": "Blackberry have not released Android Nougat to any devices yet. The only device out at the moment is the Blackberry Aurora in Indonesia. The Blackberry KEYone is launching with Nougat in late April or Early May depending on where you are. \nHopefully the rest of the Blackberry Android device will receive an update shortly after that. maybe late May?", "time": "04-05-2017 02:56 PM", "replies": []}]}, {"postID": "post5718972", "text": "None of the BlackBerry phones have been updated yet but their KEYone is coming out next month on Nougat and they're speculating it will be available shortly after that for their other devices.", "time": "03-20-2017 06:25 PM", "replies": []}]}, {"title": "DTEK50 has a FM radio ?", "thread": [{"postID": "post5564603", "text": "Can DTEK50 owners please confirm if it has a FM radio ?", "time": "11-15-2016 04:49 PM", "replies": [{"postID": "post5673308", "text": "Here is a screenshot from the specifications on Shop.Blackberry So yes, it does have a FM radio. Confirmed!\n.", "time": "02-10-2017 01:05 AM", "replies": []}]}, {"postID": "post5569112", "text": "Yes, the DTEK50 has an FM radio which the DTEK60 does not have.", "time": "11-18-2016 02:05 PM", "replies": []}, {"postID": "post5662719", "text": "HI, Does the head phone has to be plugged in to listen to FM or it can play FM on handsfree speaker. please confirm. thanks", "time": "01-31-2017 07:12 AM", "replies": [{"postID": "post5673307", "text": "As with most FM radios, it needs some sort of arial and the arial is far to short inside the phone so the headphone cord acts as one. So YES your need some sort of cable attached to the headphone jack port for the radio to work. Even if you plug in battery bowered speakers to the headphone port it will still work perfectly.", "time": "02-10-2017 01:03 AM", "replies": []}]}]}, {"title": "Is the BlackBerry DTEK50 REALLY the most secure?", "thread": [{"postID": "post5283290", "text": "What makes it the most secure, or if not, what is more secure?", "time": "07-26-2016 11:02 AM", "replies": []}, {"postID": "post5283532", "text": "BlackBerry has it's fully device encryption and root of trust built into the phone. I'm not sure how that makes it more secure than a phone running Samsung's Knox for example. It's not about updates as my GS7E is getting the monthly security updates as quickly as BlackBerry's are. \nSince BlackBerry's juju is a closed system, not sure we can know what makes it the \"most secure\" I guess BlackBerry will stand on the claim until someone is able to hack one of their phones.\nMaybe Jerry H will chime in I would love to hear his opinion.", "time": "07-26-2016 01:13 PM", "replies": [{"postID": "post5283811", "text": "Knox is based on BlackBerry infrastructure so S7 edge will be as secure as any BlackBerry nowadays BlackBerry helped with Knox I think Samsung helped design curved edges on Priv as part of that deal\nPosted via the Android Central App", "time": "07-26-2016 04:10 PM", "replies": [{"postID": "post5288392", "text": "Where are you getting any of that?\nAll Samsung did was work with BlackBerry so that BES12 could be used to manage KNOX enabled phones.... They didn't rebuild KNOX.", "time": "07-29-2016 07:22 AM", "replies": []}]}]}, {"postID": "post5283568", "text": "Yeah I'd love to compare it to some other devices and see what's actually what.", "time": "07-26-2016 01:30 PM", "replies": [{"postID": "post5291171", "text": "Exactly!!! You dont know jack about blackberry technology. You cant diss what you dont know.\nPosted via the Android Central App", "time": "07-31-2016 03:45 AM", "replies": [{"postID": "post5291337", "text": "Come again? What did I 'diss'? Are you trying to reply to someone else?", "time": "07-31-2016 08:03 AM", "replies": []}, {"postID": "post5291484", "text": "But, it's still the Android OS.", "time": "07-31-2016 09:59 AM", "replies": []}]}]}, {"postID": "post5291480", "text": "To clarify my question, reading through BlackBerry's blog: BlackBerry’s Android Devices Such as the New DTEK50 Are the Most Secure on the Market: Here’s Why [VIDEO, PICS] | Inside BlackBerry\nThe blog starts out with some false information, either due to confusion or deliberately to set up misinformation as a premise for the value argument for their product. It then goes on to praise their own performance on releasing security updates - which has been FANTASTIC, so we'll circle back to this point. \nBlackberry makes the point that they encrypt user data and have built in malware protection, back up, wipe and restore. \nIt also highlights some security features that the Priv and DTEK50 share, such as (1) Hardware Root of Trust, (2) a locked down bootloader that won't load custom ROM's and (3) full disk encryption. (4) Part two is securty updates and part 3 is (5) being able to micromanage security and privacy settings. \nSo here's what prompted my question: \nAndroid already does all or most of this in one fashion or another: Hardware Root of Trust is describing something that Snapdragon processors already have built in. It sounds like BB is just adding software security keys and are not doing anything differently from a hardware standpoint. Apple and Samsung both reference Hardware Root of Trust in their materials and it's actually built into the SoC's that most Android Flagships are using.The requirement to have a digitally signed OS is the only exception, however there are several phones that can't be unlocked which makes it somewhat of a moot point.Android has been available fully encrypted since Lollipop. Nougat actually improves upon this with file level encryption.Android already has monthly security updates and there is a device line that's just as fast as BlackBerry - Nexus. Nexus has the added advantage of being guaranteed 3 years of security updates, whereas BlackBerry is strongly hinting that they could fully abandon mobile at any point between today and whenever they feel like.While not as down in the details as DTEK, Marshmallow and Nougat already allow you to grant or revoke permissions for apps at will. It seems like all they did here was create an interface for it to be easier for the user to play with those settings.\nAndroid on Marshmallow and Nougat (and iOS too) also has the added benefit of using a fingerprint sensor backed up with a password, pin or pattern, which the DTEK50 does not take advantage of. \nSo as far as I can tell, my Nexus 6P and Nexus 5X running on Nougat are actually equally or more secure in all areas except for #2. Both do have bootloaders that are easily unlockable, so only devices with applications such as Knox would match that criteria. That said, if one doesn't enable developer options, allow oem unlocking, set up an ADB bridge and then connect the unlocked phone to a PC - then the bootloader remains locked. And personal information is obviously protected from the process of unlocking the bootloader, given that it wipes the device. But the larger point is that your bootloader never accidentally becomes unlocked. No one has ever had a, \"whoops, what happened to my bootloader?!\" moment. \niOS does these things too ... so when I ask, \"What makes it the most secure, or if not, what is more secure?\" - what I'm asking is... given that it doesn't look like they're doing anything unique, should we buy into the claims? Can we get an expert to break down what makes it more secure? \nAnd a logical second question once that question is answered, is - at the same price point, why wouldn't a user buy a Nexus 5X or the Sailfish being released this quarter? They're better hardware, will be up to date longer, supported better and longer and have the added benefit of working on whatever carrier you want.", "time": "07-31-2016 09:57 AM", "replies": [{"postID": "post5291490", "text": "The podcast that went up a few days ago addressed this. The 617 in the DTEK was discussed as being slow by Daniel Bader.", "time": "07-31-2016 10:04 AM", "replies": [{"postID": "post5291492", "text": "Ok, I'll give it a listen - would really like to know what's actually what here.", "time": "07-31-2016 10:07 AM", "replies": []}, {"postID": "post5291623", "text": "Did they do a comparison between the DTEK and the Idol 4?", "time": "07-31-2016 11:40 AM", "replies": [{"postID": "post5292127", "text": "Not really. They mentioned the CPU, then the Moto G4 came up.", "time": "07-31-2016 06:17 PM", "replies": []}]}]}]}, {"postID": "post5303561", "text": "BlackBerry's legendary security is due in large part to Elliptical Curve Encryption. BlackBerry is the second-largest patent holder for ECC. I'd like to see an assessment of the security of Silent Circle's Blackphone vs. the BlackBerry Priv or DETK50. That is something that would interest me.", "time": "08-05-2016 03:01 PM", "replies": []}, {"postID": "post5351601", "text": "We challenged Samsung and BlackBerry over their Android security claims | TechRadar\nBlackBerry on Android is apparently not doing anything \"behind the scenes\". They zip tie the bootloader, use a modified kernel and that seems to be it. Their one mega security card is the inability to unlock the bootloader and root. But, if you choose not to do those things on any other device that is up to date on security patches, such as the Nexus, Samsung flagships, etc - then those are equal secure from a practical standpoint.", "time": "08-21-2016 06:55 AM", "replies": []}, {"postID": "post5662520", "text": "Kinda seems to me that the DTEK50 supports most of my criteria, which is not the same for everyone.\nMinimal Bloatware, \nMostly vanilla Android\nSome limits on Google Privacy Rape\nMicroSD Card slot\nSwipe or tap to wake\nNot made by Apple\nNice to haves\nWorks on Verizon\nincludes BlackBerry Keyboard\nincludes BlackBerry Hub\nBackup to Box.com for free like BB10\nNot a jumbled mess like Android", "time": "01-30-2017 11:49 PM", "replies": []}]}, {"title": "How do you feel about the lack of a fingerprint sensor?", "thread": [{"postID": "post5292395", "text": "A bit surprising that the DTEK50 doesn't have a fingerprint sensor, considering that we're seeing them more often, even on budget phones like the Honor 5X. Do you think this is significant deficiency on a security-oriented phone, or are fingerprint sensors enough of a liability that you're glad it's not present?", "time": "07-31-2016 10:30 PM", "replies": [{"postID": "post5459318", "text": "Personally I'm not upset about the lack of a fingerprint sensor. It's a nice feature don't get me wrong but I like picture password much better for a security measure.", "time": "10-02-2016 08:32 AM", "replies": []}, {"postID": "post5643561", "text": "Nah, I am happy with the picture password. I don't have to worry about getting my phone unlocked when someone takes my finger when I am sleeping. \nAnd I don't have to hide the unlock screen either. I can unlock the phone right in front of other people and they would have no idea.", "time": "01-14-2017 12:45 PM", "replies": []}]}, {"postID": "post5292405", "text": "The latter. I am one of the weirdos that actually don't use the fingerprint sensor.", "time": "07-31-2016 10:35 PM", "replies": []}, {"postID": "post5292425", "text": "LOL. I used to feel that way as well, but the speed and reliability of the 6P's sensor changed my mind!", "time": "07-31-2016 10:48 PM", "replies": []}, {"postID": "post5292647", "text": "Its nice to have, not a deal breaker.\nPosted via the Android Central App", "time": "08-01-2016 03:50 AM", "replies": []}, {"postID": "post5293099", "text": "The guys in the podcast made the argument that a FPS is a convenience, not a security feature. Sure, it promotes locking the device down, which is better than nothing.", "time": "08-01-2016 09:20 AM", "replies": []}, {"postID": "post5298302", "text": "Picture password is probably safer and takes just a second to do. Maybe 3 seconds longer than a fp scanner and no one can take my unconscious finger and unlock my phone. Plus if they mess up 10 times trying to unlock it the phone gets wiped. They can keep the biometric crap\nPosted via the Android Central App", "time": "08-03-2016 01:03 PM", "replies": []}, {"postID": "post5418926", "text": "Not having a fingerprint scanner is not a drawback to me, to be honest.", "time": "09-14-2016 03:47 PM", "replies": []}, {"postID": "post5426563", "text": "I'm disappointed about the lack of a fingerprint sensor.", "time": "09-17-2016 08:56 PM", "replies": []}, {"postID": "post5433084", "text": "Feature that I like. Without I resort to pin which isn't that secure either. \nMy iPhone 6S Plus with round design means that the orientation and issue is gone, easier to use than S6 (terrible) or S7 (better). Moisture or oils and creams prevent FPID from working. \nLack of release arguing, lack of USB-C (or lightning) means have to orient plugging in charger cable over and over again, wear and tear, bigger issue, for me. \nStill a great $299 phone, don't get me wrong.", "time": "09-20-2016 01:04 PM", "replies": []}, {"postID": "post5444055", "text": "I'm not a fan of fps, I prefer picture or pin passwords, myself", "time": "09-24-2016 10:16 AM", "replies": [{"postID": "post5453168", "text": "Why don't you like the fingerprint sensor??", "time": "09-28-2016 09:04 PM", "replies": []}]}, {"postID": "post5456888", "text": "I wish it had one...but its not a deal breaker to me", "time": "09-30-2016 03:39 PM", "replies": []}, {"postID": "post5472884", "text": "fingerprint sensor could save a second or two when opening/unlocking the phone but i dont feel my life is worse without it.", "time": "10-07-2016 01:34 PM", "replies": []}, {"postID": "post5599973", "text": "It is very convenient and safe with fingerprint sensor.", "time": "12-09-2016 03:20 AM", "replies": []}]}, {"title": "Something to think about that perhaps we have overlooked...", "thread": [{"postID": "post5291950", "text": "Just IMHO, the DTEK50 is going to be something that IT managers take a hard look at deploying as a fleet phone. Why do I say that? Well, there are several things that might do it:\na) Price- $299, compared to $800 for an iPhone, or $500-900 for other Android offering. Bean-Counters will rejoice.\nb) Security- I think we are not appreciating this facet as much as it should be appreciated, especially in this day and age of the phone/database hacks. I think that feature will endear itself to IT/Purchasing managers who have to deploy secure infrastructure in a corporate environment. Same with Government.\nc) Fast updates for security patches, see b) above.\nd) It is Android, and there are a lot of apps out there.\ne) A good size and memory for a corporate phone.\nRemember in the long run the bean-counters have a great deal of sway over what phones are deployed, sometimes even more so than the IT guys. So to the Bean-Counters, while you might have an uber-secure iPhone, if you can offer a phone at a third of the cost, that is just as secure, what do you think they will make you purchase? Could this be the phone that saves Blackberry in the corporate world? It might not save it in the casual user world where most of us live, but in the corporate world.....?", "time": "07-31-2016 04:10 PM", "replies": [{"postID": "post5335355", "text": "Depends on what do those corporate IT Guys pay for iPhones? Does the Carrier or Carriers they buy from offer discounts or subsidies?\nI know that our company buys via the Carrier (Verizon) and that we do still get subsidies... for us an iPhone 7 would cost about the same as a DTEK50. As the DTEK50 isn't offered by Verizon or any US Carrier.\nMight not be an issue in other markets.... but in the US Market I don't know that you can count cost savings as a benefit.", "time": "08-17-2016 08:19 AM", "replies": []}]}, {"postID": "post5292109", "text": "All good points! Hopefully Blackberry learned a few things from some of the Priv issues, and the DTEK will be smoother sailing for them.", "time": "07-31-2016 06:03 PM", "replies": []}, {"postID": "post5294225", "text": "BlackBerry needs to promote this device to IT and the public. I plan on getting one for my son once he is willing to let go of his Leap. He loves OS10.\nPosted via Priv", "time": "08-01-2016 09:32 PM", "replies": [{"postID": "post5294440", "text": "Smart son. OS10 is smooth, secure and fluid. I really like my OS 10 devices, Classic in particular. The lack of future runtime updates is most unfortunately not favorable. My wife already ordered the DTEK 50 to potentially replace her Z30.\nPosted via the Android Central App", "time": "08-02-2016 01:31 AM", "replies": [{"postID": "post5590508", "text": "So my son's Leah's headset jack broke and we can't find parts for it. He is using my white Leap now and wants another Leap. He just prefers the OS10. He is not a huge gamer on his phone since he has an Xbox. He loves the media experience on the OS10. So we will just keep buying Leaps, lol", "time": "12-02-2016 08:18 PM", "replies": []}]}]}, {"postID": "post5302584", "text": "Also remember corporate bulk pricing will make the DTEK50 cost, what? Maybe $50/unit in bulk?", "time": "08-05-2016 08:13 AM", "replies": []}, {"postID": "post5307234", "text": "Also a successful launch, and adoption will hopefully make up for the disaster that is the Priv with its manufacturing defects, high cost, and insane return rate. I am really excited about this phone, I just wish it had 32 gb of storage, but for a corporate phone, 16 is good enough. My issue phone (iPhone 4s has 8 gb).", "time": "08-07-2016 12:49 PM", "replies": []}, {"postID": "post5317966", "text": "I like my priv lots. Don't have the issues some have talked about\nPosted via the Android Central App", "time": "08-11-2016 08:42 PM", "replies": [{"postID": "post5324153", "text": "Yes I love my Priv too and have had none of the reported problems. I did buy mine off carrier from ShopBlackberry and I think that makes a difference with no bloatware and timely updates.\nPosted via Priv", "time": "08-13-2016 11:41 PM", "replies": []}]}, {"postID": "post5346219", "text": "BlackBerry have done this in the past with their \"BlackBerry Leap\" this was also targeted as a 'Fleet device' for start up businesses. \nI really hope the DTEK50 does well because I want more BlackBerry devices in the future. I would feel so empty inside if I didn't own a BlackBerry device.\nA droid a day keeps the Apple away", "time": "08-19-2016 03:06 PM", "replies": []}, {"postID": "post5358115", "text": "I feel your pain. I'm on an LG right now but really miss my BlackBerry. May have to switch back soon!\nPosted via my LG G3 here in Canada eh", "time": "08-23-2016 09:24 AM", "replies": []}, {"postID": "post5417125", "text": "I agree with you! I am very interested in this phone and how it performs \"in the wild\" once it's released. I still root for BlackBerry and I hope that this phone does well for them!", "time": "09-13-2016 10:39 PM", "replies": []}, {"postID": "post5619738", "text": "@OP. Definitely agree with you and I think BlackBerry did expect the DTEK50 to become a fleet business device. Just like the BlackBerry Leap was at $275. So it seems like the sub $300 price range is perfect for business people. \nGoing forward, security will become more and more important as people start to realize how vulnerable they are. Just because of the security aspect I'll stay with BlackBerry.\nA droid a day, keep the apple away.", "time": "12-24-2016 12:33 PM", "replies": []}]}, {"title": "Speculation on battery life?", "thread": [{"postID": "post5289219", "text": "How do you think the DTEK will hold up with its battery?\nIt will be interesting to hear some Priv owners chime in on their thoughts.", "time": "07-29-2016 04:34 PM", "replies": [{"postID": "post5346193", "text": "I would say 4.5 hours SOT. With a full days use with Moderate usage. I would have been happier with a 2,800mah battery but it's a lovely looking phone so ill overlook the small things. \nA droid a day keeps the Apple away", "time": "08-19-2016 03:00 PM", "replies": []}]}, {"postID": "post5335469", "text": "Think that's the whole reason that they downclocked the Idol 4's 617 processor. \nI also think that the fact that they created a branded power storage accessory is also another indicator.", "time": "08-17-2016 08:52 AM", "replies": []}, {"postID": "post5472958", "text": "battery is fine. would have liked slightly more, but doesn't need it. can easily go all day with regular use. ie. a game here and there, lots of emails and texts, in wifi all day and using bluetooth driving home.", "time": "10-07-2016 01:48 PM", "replies": [{"postID": "post5592769", "text": "What is \"all day\" for you? \nWith approximately two hours of listening to podcasts, a few texts/emails, occasional article on the web, and mine dies by 5 o'clock (I unplug it between 7:30 and 8 am). Shoot, if I happen to make a long phone call, it dies even sooner.", "time": "12-04-2016 03:44 PM", "replies": []}]}, {"postID": "post5569117", "text": "I've only had mine run low on battery once after a long day of unusually heavy use.", "time": "11-18-2016 02:07 PM", "replies": []}]}, {"title": "Nexus 5x vs BlackBerry DTEK", "thread": [{"postID": "post5299214", "text": "I'm wondering how the Nexus 5x compares against the DTEK50? $439CDN vs 429CDN. And it looks like Nexus5 is has a better processor. Now that the BlackBerry Hub+ is available, I don't think DTEK is all that critical in securing android for your avg Joe. \nThoughts?\nPosted via the Android Central App on my BlackBerry Passport", "time": "08-03-2016 07:47 PM", "replies": []}, {"postID": "post5299231", "text": "My analysis is as follows:\nScreen: Nexus 5X, still one of the best LCD's in the industry\nPerformance: Nexus 5X, getting complaints about the 617, while the 5X on N flies with the 808\nAudio: Nexus 5X, neither of them did anything special, so front facing speakers wins\nSecurity: Nexus 5X (UNLESS you unlock the bootloader), software security appears to be the same, added FPS is nice, will be secure longer with 3 years of garanteed updates\nCamera: Nexus 5X, very capable, still one of the best on a midranger\nUpdates: Nexus 5X, it's a nexus...\nSoftware: Nexus 5X, not \"like\" stock, it actually is \"stock\", faster updates, longer updates, it's kinda like having a rockstar sing you to sleep\nAvailable Options: Nexus 5X, 3 colors, 2 storage sizes, 32 GB option is a must\nBuild & Design: Nexus 5X, build quality I assume is similar, but Nexus is more nicely designed so... \nI have the 5X winning 9/9 categories with the one I'm hedging being 'security', because they're identical unless you unlock the bootloader on the 5X, and then the DTEK is better. But the DTEK won't let you unlock the bootloader, so I could justify giving it the category on those grounds... but I'm falling back to, 99% of customers don't unlock the bootloader.", "time": "08-03-2016 07:55 PM", "replies": [{"postID": "post5299258", "text": "I'd rather have the 5x due to camera, FPS, USB type C and software but the DTEK50 does have dual front speakers, which should sound much better than 5x speaker since it\"s basically just a BlackBerry idol 4. DTEK 50 also has micro SD and the boom key on the side.", "time": "08-03-2016 08:13 PM", "replies": []}]}, {"postID": "post5299427", "text": "Blackberry still needs to prove to the Android world how they are going to update devices. Right now, they only have the Priv. Will they keep the DTEK50 up to date? That is one of the bigger reasons I would choose the 5X over the BB.", "time": "08-03-2016 09:55 PM", "replies": [{"postID": "post5313551", "text": "BlackBerry's whole business proposition is built around this being the \"worlds most secure android phone\". They have locked themselves into the monthly updates.\nWhat I want to see is how long it takes them to get to Nougat once it's generally released. It took BlackBerry a fairly long time to get Priv to Marshmallow.", "time": "08-10-2016 08:35 AM", "replies": []}]}, {"postID": "post5300782", "text": "And two other considerations:\n1) 5X has fingerprint scanner\n2) As BB continues on their path towards being a MDM software vendor - at any point they can just pull the plug on device sales - and then ongoing support is a big risk. \nYes - I run a 5X and am a bit biased\nNEXUS 5X ON AT&T ON 7.0 DP5 - Posted via the Android Central App", "time": "08-04-2016 12:14 PM", "replies": []}, {"postID": "post5301281", "text": "5x is better in just about every way except for the custom security.\nPosted via the Android Central App", "time": "08-04-2016 04:03 PM", "replies": [{"postID": "post5301331", "text": "Even that sounds like it might not be anything other than a hardened kernel and locked bootloader.", "time": "08-04-2016 04:36 PM", "replies": []}]}, {"postID": "post5304947", "text": "I will wait until some real significant reviews come out. The 5x has been out for awhile. The 5x from forums and usage reviews noted battery life on release was horrible, had heat issues and had a camera that was known for hanging and being slow. (Kind of like the Priv) The 5x is no panacea as it has no Micro SD, less RAM, all plastic construction, no hardened/built in security features (significant consideration for me with our business and personal information) Lastly, my dad owns an LG G4 running on Marshmallow. I used/tried out a new Moto G4 Plus for 10 days. We compared everyday usage speed between the 617 and 808 and differences were negligible. The battery life on the Moto was significantly better with the 617 vs the 808. I returned the Moto due to Lenovo's recent written stance on updates and the DTEK release. I am strongly considering the DTEK bundle offer. One of the BlackBerry Elites in France has been documenting his usage in a forum on Crackberry and it sounds very promising at its price point.\nPosted via the Android Central App", "time": "08-06-2016 09:41 AM", "replies": []}, {"postID": "post5313597", "text": "Best indication of future behavior is past performance. Blackberry had a single Android phone and it took forever to get it updated. But this one is a little bit different since there is a third party OEM at play. But keeping a phone secure doesn't necessarily mean keeping it at the most up to date OS. So it can remained at 6 and still maintain its security status.", "time": "08-10-2016 08:54 AM", "replies": []}, {"postID": "post5316627", "text": "I'm on a Priv right now, but my wife who is on a Galaxy S5 is looking for a change. She is a Galaxy user but got tired of AT&T late updates or no update at all. Her GS5 is still on L!!!! We buy our phones upright so no need for tolerating AT&T crab, but buying Galaxy phones that match our LTE bands is a pain. So I'm considering a new phone. My Priv get its security patches almost 2 weeks before my Nexus 7, and software updates years before the AT&T Galaxy phone, so I'm in the market for a phone that gets its updates directly from the manufacturer. I'm considering the Dtek50 or the Nexus 5X due to its price, got tired of paying premium price for a phone that needs to be changed every 2 years to keep up to Android fast changes. So any recommendations for these phones or any other is appreciated.\nPosted via the Android Central App", "time": "08-11-2016 11:11 AM", "replies": [{"postID": "post5316632", "text": "Nexus 5X over the DTEK50 seems pretty obvious, but a smarter choice if you can afford to wait for a couple months may be the upcoming Nexus sailfish.", "time": "08-11-2016 11:13 AM", "replies": []}]}, {"postID": "post5319953", "text": "Just bought a nexus 5x due to much lower price and fingerprint sensor which Dtek does not offer. It has become a standard for security.", "time": "08-12-2016 03:12 PM", "replies": []}, {"postID": "post5358126", "text": "Dtek50 for the security which for me offers peace of mind\nPosted via my LG G3 here in Canada eh", "time": "08-23-2016 09:27 AM", "replies": [{"postID": "post5359521", "text": "Nexus 5X is matching security blow for blow unless you choose to unlock your bootloader. The only thing giving BB the edge is that you can't unlock the bootloader.", "time": "08-23-2016 04:22 PM", "replies": []}]}, {"postID": "post5359557", "text": "Android security patches are updated month to month so no worries there. And now you can install BB Hub on any Android device. Best of both worlds. With Marshmallow you can turn off access for different apps as well.", "time": "08-23-2016 04:30 PM", "replies": []}, {"postID": "post5425324", "text": "That 808 processor is the same one on the priv?? There will be battery drain and heat issues for sure.", "time": "09-17-2016 07:56 AM", "replies": [{"postID": "post5426041", "text": "Never had any heat issues with 5x and battery life is great after a few tweaks.", "time": "09-17-2016 03:21 PM", "replies": []}]}, {"postID": "post5464724", "text": "I currently own the HTC One M8 and love it. In your opinion . do you guys feel than if I change to the DTEK50, will it be an upgrade of more of a sidegrade?\nCheers", "time": "10-04-2016 07:01 PM", "replies": []}, {"postID": "post5472878", "text": "I considered the 5x but realized it has a bad camera, processor has issues, only 2gb of ram, no sd card, same security patch speed as dtek, gets updates faster a la nougat but basically still in beta. I got a dtek50 and a 128gb card and quick charger and haven't regretted it or looked back.", "time": "10-07-2016 01:32 PM", "replies": [{"postID": "post5472985", "text": "Did you format your micro sd card had adoptable storage?", "time": "10-07-2016 01:57 PM", "replies": []}, {"postID": "post5533156", "text": "My wife has one now. It's a good device. Battery life is not as good as my Passport, but enough to get her through the day. I might get the DTEK60 if BlackBerry doesn't release the Mercury.", "time": "10-29-2016 06:23 PM", "replies": []}]}, {"postID": "post5505599", "text": "yeah I did! It's been stable and working flawlessly for about 2 weeks now.", "time": "10-19-2016 12:35 PM", "replies": []}, {"postID": "post5546692", "text": "My battery easily lasts longer than my classic or z10. turn on battery optimization and turn off location and other settings for apps that don't need the specific settings. Ie. Contacts don't need location settings.", "time": "11-04-2016 11:20 PM", "replies": []}]}, {"title": "Anyone went from the HTC One M8 to the DTEK50?", "thread": [{"postID": "post5532386", "text": "Hi people. \nI currently own the M8 and just won the DTEK50. Is there anyone who went from the M8 who can tell me if it's a worthy upgrade? \nCheers", "time": "10-29-2016 11:17 AM", "replies": []}]}, {"title": "Are you interested in ordering one?", "thread": [{"postID": "post5284096", "text": "Sound off below!\nAs for me....I'm not sure. I am tempted, but my phone budget isn't that large, and I am waiting to see what the Nexus is like.", "time": "07-26-2016 07:51 PM", "replies": []}, {"postID": "post5284117", "text": "I was kind of curious really, because it seems fascinating. The cases look nice too. I think I need more reviews.", "time": "07-26-2016 08:00 PM", "replies": [{"postID": "post5291496", "text": "I think seeing some real world reviews will make a difference. The 617 is kind of questionable.", "time": "07-31-2016 10:11 AM", "replies": []}]}, {"postID": "post5284235", "text": "Depending what the Note 7 launch looks like I might pull the trigger, not even close to same class of device or price I know but I'm a BB guy so either I hold on with this new Android phone at the mid range or say bye bye to BB and go with something amazing!", "time": "07-26-2016 09:23 PM", "replies": []}, {"postID": "post5284302", "text": "It looks interesting, but I am really holding out for a Classic/9900 type phone on android.", "time": "07-26-2016 10:26 PM", "replies": []}, {"postID": "post5284336", "text": "Non-starter for me since it doesn't work on Verizon.\nPosted via the Android Central App on the Moto X Pure Edition", "time": "07-26-2016 11:05 PM", "replies": []}, {"postID": "post5284368", "text": "No. But at the same time I want this to do well, so it keeps the hardware division up until Mercury hits the shelves.", "time": "07-26-2016 11:41 PM", "replies": [{"postID": "post5284927", "text": "I can't recall if Mercury is the smaller one that was rumored. If it is, I'm down and I agree.", "time": "07-27-2016 08:46 AM", "replies": [{"postID": "post5286293", "text": "If my memory serves this is the smallest one. Next up is Argon the all-touch flagship, and Mercury is formerly called Rome.", "time": "07-27-2016 11:15 PM", "replies": []}]}]}, {"postID": "post5284926", "text": "Nah, too much better stuff in that price range, doesn't work on Verizon and BlackBerry is more than dead; just waiting for the body to catch up with the departed soul.", "time": "07-27-2016 08:46 AM", "replies": []}, {"postID": "post5285800", "text": "Nope. I'd just get the idol 4 if I wanted a phone with same specs and design without all the Blackberry stuff.", "time": "07-27-2016 04:43 PM", "replies": []}, {"postID": "post5285820", "text": "Already have a PRIV so probably not. The Argon is of interest though.\nPosted via the Android Central App", "time": "07-27-2016 04:56 PM", "replies": []}, {"postID": "post5285831", "text": "No. I could get something with better hardware in this price range that doesn't have any BlackBerry bloatware.", "time": "07-27-2016 05:03 PM", "replies": []}, {"postID": "post5287921", "text": "I think only company's will buy this for secure business Enterprise\nposted via the lovely innovative Priv by BlackBerry - Powered by Android", "time": "07-28-2016 08:26 PM", "replies": [{"postID": "post5290137", "text": "Sounds right since that's what Blackberry has stated recently and it will be sold directly factory unlocked.\nPosted via the Android Central App", "time": "07-30-2016 10:33 AM", "replies": []}]}, {"postID": "post5291920", "text": "The more I look at it, the more I am tempted. I would prefer 32gb storage, but that's just preference to me. So far the reviews are coming in pretty positive.", "time": "07-31-2016 03:41 PM", "replies": []}, {"postID": "post5292859", "text": "Absolutely. And for my staff as well.\nPosted via the Android Central App", "time": "08-01-2016 06:50 AM", "replies": [{"postID": "post5293057", "text": "Just out of curiosity, is it the price or performance or the statements about security?", "time": "08-01-2016 08:43 AM", "replies": [{"postID": "post5294441", "text": "Probably all. It's secure, will perform excellent for 90 percent of users and is priced right with the bundled offer.\nPosted via the Android Central App", "time": "08-02-2016 01:35 AM", "replies": []}]}]}, {"postID": "post5296978", "text": "Price and Security. Some of the staff will wait a bit and see how the pkb version will be like.\nPosted via the Android Central App", "time": "08-03-2016 01:40 AM", "replies": []}, {"postID": "post5417128", "text": "I am curious about it, for sure. \nIf I had a choice, it would be between this phone, the V20, or the Marlin. Either would be awesome to own, IMO!", "time": "09-13-2016 10:40 PM", "replies": []}, {"postID": "post5456890", "text": "Ive won one...I hope it lives to my expectations. Currently have the HTC One M8. Will it be an upgrade or more of a sidegrade?", "time": "09-30-2016 03:40 PM", "replies": [{"postID": "post5459325", "text": "That's the best way to get a new phone. Winning always makes it so much more fun. I always cross my fingers when a new competitions comes up. Especially if it's for a BlackBerry device. If I don't win anything in the next year or so I'll have to purchase one then.", "time": "10-02-2016 08:35 AM", "replies": []}]}, {"postID": "post5459743", "text": "Too late I just bought the S7 Edge 2 months ago not time yet to change to another phone.", "time": "10-02-2016 01:16 PM", "replies": []}, {"postID": "post5464722", "text": "I own the HTC One M8 and love it. Do you guys feel than if I change to the DTEK50, will it be an upgrade of more of a sidegrade?\nCheers", "time": "10-04-2016 07:00 PM", "replies": []}, {"postID": "post5505607", "text": "Does your M8 have issues? my sister has gone through 3 of them with warranty issues and is still have problems. If you're in the same boat, I would think that the Dtek would be a good upgrade. If not, then it's a marginal one. Very similar specs except the processors and the dtek has more ram.", "time": "10-19-2016 12:39 PM", "replies": [{"postID": "post5505792", "text": "I have to replace the battery and the top speaker since it's distorting the sound at full volume. It will cost me like 50 euros tops to do it. \nOther than that it's working great, to be honest. \nThanks for your input.", "time": "10-19-2016 01:50 PM", "replies": []}]}]}, {"title": "The DTEK50 has 16GB storage. Is that ok in 2016?", "thread": [{"postID": "post5283283", "text": "Is it ok to only have 16 GB storage in 2016?", "time": "07-26-2016 10:58 AM", "replies": [{"postID": "post5346212", "text": "Depends what you use the device for, I have 8GB storage on my BlackBerry Q5 and don't have complaints about storage. I throw all my videos and photos on my SD Card (64GB) and it works well. \nBut since Android uses up so much space, a 32GB size would give you 25GB +- which is a good size.\nA droid a day keeps the Apple away", "time": "08-19-2016 03:03 PM", "replies": []}]}, {"postID": "post5283293", "text": "The LEAST amount of storage a phone should have is 32GB IMO.", "time": "07-26-2016 11:03 AM", "replies": []}, {"postID": "post5283295", "text": "I think it's okay since there's expandable storage. I am one of those odd people who are just fine with 16gb, so maybe take my statements with a grain of salt. I have an A9 now that is 32gb, I would have gotten the 16gb version instead but many places charged more for that one over this 32gb, so that's what I went for.", "time": "07-26-2016 11:03 AM", "replies": []}, {"postID": "post5283298", "text": "They didn't specify if it supports adoptable storage, for what that's worth. If it does 16 becomes more acceptable to me; if it does not, 16 is absolutely a deal breaker.", "time": "07-26-2016 11:05 AM", "replies": [{"postID": "post5348087", "text": "I agree. 16GB aren't enough these days. Take photos and videos and think that you aren't on a sweet deal such as unlimited mobile data like with Three in the UK. Which makes you not use mobile data to load into the cloud and your device might run full easily. \nWith external storage the it's perfectly fine.\nPosted via Android Central App", "time": "08-20-2016 01:56 AM", "replies": []}]}, {"postID": "post5283299", "text": "I don't think that 16GB is sufficient, especially since this device probably won't support adoptable storage.", "time": "07-26-2016 11:05 AM", "replies": []}, {"postID": "post5283626", "text": "I would say yes, only on the condition that you can get a fast MicroSD card, and use the adoptable storage feature from Marshmallow.", "time": "07-26-2016 02:07 PM", "replies": []}, {"postID": "post5283767", "text": "For a $299 phone, 16GB (with micro SD expansion) is perfectly acceptable.", "time": "07-26-2016 03:44 PM", "replies": []}, {"postID": "post5284373", "text": "For its target market, as a fleet device, it's actually just fine. Companies seem to like the fact that there's no space to load anything else after the enterprise software. My company uses the 16GB iPhone 6 as their fleet devices, and we all know that phone barely have enough space to update.", "time": "07-26-2016 11:47 PM", "replies": []}, {"postID": "post5285066", "text": "This phone accepts up to a 2 terabyte sd card\nPosted via the Android Central App", "time": "07-27-2016 10:05 AM", "replies": [{"postID": "post5285084", "text": "Know if it has adoptable storage enabled?", "time": "07-27-2016 10:13 AM", "replies": [{"postID": "post5286292", "text": "Priv has it, can't imagine why it wouldn't.", "time": "07-27-2016 11:14 PM", "replies": []}]}]}, {"postID": "post5288400", "text": "Personally I'm not a fan of adoptable storage.... I like using my SD Card as a removable drive to I can add large files (movies) to it more quickly.\nBut I think for many adding a good 64GB SD card should be ok... as long as they have enough cloud storage to back everything up. SD Cards just don't last as long as they should.", "time": "07-29-2016 07:33 AM", "replies": []}, {"postID": "post5288523", "text": "Without adoptable storage, no phone should be under 32GB and that's a bare minimum. I always buy the largest option available, but that's typically 64 GB or 128 GB which for me is enough to make the SD card irrelevant.", "time": "07-29-2016 08:42 AM", "replies": []}, {"postID": "post5288549", "text": "I really don't think cost is that big of an issue between 16 and 32. With apps and services taking more and more room, 32 should be the minimum.", "time": "07-29-2016 09:01 AM", "replies": [{"postID": "post5288554", "text": "IIRC it's $8 difference.", "time": "07-29-2016 09:03 AM", "replies": []}]}, {"postID": "post5288741", "text": "Nope.\n32 gigs should be minimum.\nThere are much better phones to buy at this price such as axon 7, one plus 3, idol 4s... All 400$..\nPosted via the Android Central App", "time": "07-29-2016 10:51 AM", "replies": [{"postID": "post5288951", "text": "Not the same price. This device is 300 at present. The ones mentioned are 25 percent more and do not have the same security built into the hardware. The G4 Plus with 2GB and 16 GB is 299 less some retailers coupons.\nPosted via the Android Central App", "time": "07-29-2016 01:16 PM", "replies": [{"postID": "post5289084", "text": "The G Plus with 2GB RAM/16GB storage is $249.99 retail. The $299.99 model has 4GB of RAM and 64GB of storage.", "time": "07-29-2016 02:45 PM", "replies": []}]}]}, {"postID": "post5299794", "text": "No. Not at all. Typical of BlackBerry to release a phone that's out of date already when it launches.\nPosted via the Android Central App", "time": "08-04-2016 02:00 AM", "replies": [{"postID": "post5300024", "text": "Then you're saying the same thing about Alcatel and Motorola, because the DTEK50 is a rebranded Idol 4 which is coming out at the same time, and Motorola just rolled out the G4 with the same specs.", "time": "08-04-2016 06:26 AM", "replies": [{"postID": "post5300616", "text": "I'm saying it's a trend with BlackBerry over a period of many years.\nThe one phone they released with decent specs had a silly slide out keyboard that nobody wanted. They finally come out with an Android all touch and the specs are horrible.\nPosted using my Samsung Galaxy S7 via the Android Central App", "time": "08-04-2016 11:11 AM", "replies": [{"postID": "post5305042", "text": "Horrible? That just ludicrous. This device is spec'd similarly to many devices in its price range. And offers security features none can match. With so many perfectly acceptable well running devices spec'd like this the high end will experience a ton of pressure. The Moto G4 Plus I used for almost two weeks ran exceptionally well spec'd similarly. For the average consumer with one email, a penchant for social media and a game here or there most \"high\" end devices and spec's are superfluous and inflated. These newer 200-300 dollar or less devices are more than most need and lessen the need for amortization over two years. Why do you think there is so many BOGO offers on these highest spec'd devices these days? (besides the 24 month commitment)\nPosted via Android Central App", "time": "08-06-2016 10:42 AM", "replies": []}]}]}]}, {"postID": "post5300214", "text": "That's typical of low budget devices... That's part of how they're priced so low. The Midrangers this year are blurring the lines though (Axon 7, OnePlus 3, etc). And the Moto G4 Plus 64/4 to a lesser extent.", "time": "08-04-2016 08:20 AM", "replies": [{"postID": "post5305060", "text": "Axon 7 and One Plus 3 are not spec'd midrange. They have the same or higher specs than most phones priced higher. Are you referring to price or specs when I determining range of device? I am not certain why any who likes to use Android would spend a dollar more than 399 for a device with an 820 any longer. The One Plus 3, Axon 7 and Asus Zen Phone 3 Deluxe have wrecked the 700-800 club. (I see HTC 10 and LG5 already in the 500 range on sales) In a few months they will be even less. (as will all these \"midrange\" spec'd devices). I think it's going to be really tough for the likes of Apple and even Samsung in the coming months ahead. (and change can and will happen quickly)\nPosted via Android Central App", "time": "08-06-2016 10:54 AM", "replies": []}]}, {"postID": "post5300412", "text": "Can you install an app onto the SD card? Or does it have to be on the actual device?\nPosted via the Android Central App on my BlackBerry Passport", "time": "08-04-2016 09:42 AM", "replies": [{"postID": "post5335422", "text": "With Marshmallow they can't be installed on the removable SD Card (at least not without rooting, which you can't). You would have to adopt the SD Card as internal storage and make it non-removable.\nBut adoptable storage has a number of negatives that make it not the best of ideas unless you have no other choice (SD will be slower and less reliable over time). With the DTEK50 and only 16GB... you pretty much will have no choice.", "time": "08-17-2016 08:41 AM", "replies": []}]}, {"postID": "post5305092", "text": "Ok.", "time": "08-06-2016 11:11 AM", "replies": []}, {"postID": "post5472947", "text": "it is more than adequate. I have a 128gb sd card being used as adoptable. I can run apps off it with no issues.", "time": "10-07-2016 01:46 PM", "replies": []}]}, {"title": "Recommendations for Screen Protector", "thread": [{"postID": "post5337500", "text": "Hey everyone, \nI was just wondering if anyone with a DTEK50 or IDOL 4 picked up any screen protectors and how they fit. \nI jumped the gun, bought some IDOL4 ones and they leave a 2+mm gap all around the DTEK50. Maybe I installed incorrectly?", "time": "08-17-2016 04:26 PM", "replies": [{"postID": "post5443670", "text": "Why don't you just buy the cheapest one in ibay? That's what I always do and it almost never fails. I don't agree paying more than 1 or 2 bucks for a piece of glass, but that's just me.", "time": "09-24-2016 06:33 AM", "replies": []}]}, {"postID": "post5337723", "text": "No, that just looks like how that brand of protector was cut. I'd say try a different brand.", "time": "08-17-2016 05:14 PM", "replies": []}, {"postID": "post5446466", "text": "Hey! I would check out CrackBerry's online store on their forum site. Lots of goodies there. Have purchased cases and screen protectors from them (both for my Q10) and was very satisfied.", "time": "09-25-2016 05:29 PM", "replies": [{"postID": "post5450235", "text": "Why pay 10 dollars or more when you can get them for 1 or 2 on ebay? I don't get it.", "time": "09-27-2016 01:57 PM", "replies": []}]}, {"postID": "post5472939", "text": "https://www.amazon.ca/gp/product/B01...droidcent08-20\nI got this one. it's pretty nice. It actually improves the look of the screen somehow? solid piece of glass as well. feels great and is as oleophobic as the dtek50 screen", "time": "10-07-2016 01:45 PM", "replies": []}]}, {"title": "BlackBerry Argon will be named Dtek60", "thread": [{"postID": "post5434181", "text": "This info was leaked on the BlackBerry website last night. The specs look really good. If the price is right, This device has a decent shot. CrackBerry posted the below article with specs. Any thoughts?BlackBerry 'Argon' likely to be released as the DTEK60 | CrackBerry.com", "time": "09-20-2016 06:38 PM", "replies": [{"postID": "post5459328", "text": "Price should be around $499 nothing higher. Specs are are best BlackBerry has put into a device to date. It's got all all bells and whistles but I'm not little concerned about the camera. Th megapixels seem to high a that sometime lowers the quality.", "time": "10-02-2016 08:38 AM", "replies": []}]}]}, {"title": "BlackBerry DTEK50 Hands On Review", "thread": [{"postID": "post5283994", "text": "BlackBerry DTEK50 hands-on: Stuck in neutral | Android Central\nCheck it out!", "time": "07-26-2016 06:34 PM", "replies": []}, {"postID": "post5284085", "text": "I'm kinda curious about some of the specs versus the price point. Moto has the G4 for $70 less and more internal. Granted it has less RAM, but that's still very competitive, on Moto's part.", "time": "07-26-2016 07:48 PM", "replies": [{"postID": "post5345712", "text": "If security is something you place a value on... And if the type of security features that BlackBerry has added to the Idol 4 is something that makes the DTEK50 of interest.... I think many here probably don't like a locked device so they can't root it.\nFor the average person that if fine with Android security (who knows anyone that has been hacked?), then not on specs along this phone isn't going to interest many. It is an enterprise/goverment play, and that is who their customers will be... just probably not in the US.", "time": "08-19-2016 12:58 PM", "replies": [{"postID": "post5346222", "text": "I've been trying to get some clarity on the security picture here, but so far it seems like the only difference between regular Android and BlackBerry Android is the different kernel and the fact that it can't be rooted. Some Android OEMs do similar things, but I was unable to locate anything other than those two things that is definitely being done differently than all the stuff that everyone does. For the way that the vast majority of users use devices, the effective security is exactly the same on a Note 7 vs a Nexus 5 vs a Priv. The theoretical security could be different, and clearly is in two areas, but the rest of it seems to be, \"we use Android, Google Play Services, a SnapDragon processor, etc\".", "time": "08-19-2016 03:06 PM", "replies": []}]}]}, {"postID": "post5285045", "text": "I guess it depends on if you want the BlackBerry software. I for one do so the other stuff is irrelevant as long as it's close.\nPosted via the Android Central App", "time": "07-27-2016 09:58 AM", "replies": []}, {"postID": "post5285120", "text": "Can't speak for others, but I definitely do not want the BlackBerry software.", "time": "07-27-2016 10:28 AM", "replies": []}, {"postID": "post5285828", "text": "I have a PRIV and I also have several non-blackberry Android phones. I actually like the Blackberry software on top of Android. My favorite Blackberry add-on is the Hub.\nPosted via the Android Central App", "time": "07-27-2016 05:01 PM", "replies": []}, {"postID": "post5286903", "text": "One thing I miss from having a bb10 phone years ago is the virtual keyboard. By far in a way the best and fastest virtual keyboard I've ever used. Wish they would release their app for Android for any phone.\nPosted via the Android Central App", "time": "07-28-2016 10:00 AM", "replies": []}, {"postID": "post5287397", "text": "Anyone who owned this device? How was this device goes?\nPosted via the Android Central App", "time": "07-28-2016 03:00 PM", "replies": [{"postID": "post5290139", "text": "How can anyone own the device? It's just announced being sold preorder.\nPosted via the Android Central App", "time": "07-30-2016 10:35 AM", "replies": []}]}, {"postID": "post5287917", "text": "Actually I have the BlackBerry keyboard on my LG G3...download from the Internet\nPosted via my LG G3 here in Canada eh", "time": "07-28-2016 08:22 PM", "replies": []}, {"postID": "post5291163", "text": "I currently own s7 international version. Will definately order this phone as my backup phone.\nPosted via the Android Central App", "time": "07-31-2016 03:33 AM", "replies": []}, {"postID": "post5348084", "text": "I like the added features that remind me a bit of cyanogenmod. Also BlackBerry knows security very well and as an ex BlackBerry owner I like to see them producing solid hardware and like the fact that they don't mess around with Android as much. \nThe BlackBerry Hub also is a very nice touch. I didn't realise how much I was missing this until I recently went back to bb10 because I managed to break my Nexus5. \nThat being said I miss Android a lot.\nPosted via Android Central App", "time": "08-20-2016 01:52 AM", "replies": []}, {"postID": "post5443667", "text": "I just won one of these phones, did not received it yet, though. I currently have the HTC One M8. I hope I can accept all the cons of this smartphone.", "time": "09-24-2016 06:31 AM", "replies": []}, {"postID": "post5455297", "text": "It'll be an upgrade from your One M8. Once you get it be sure to drop some notes on how you find it to be.", "time": "09-29-2016 08:12 PM", "replies": [{"postID": "post5457226", "text": "Why are you so sure that it will be an upgrade? In what departments? \nCheers", "time": "09-30-2016 07:59 PM", "replies": []}]}]}, {"title": "Do you think this device will be successful enough?", "thread": [{"postID": "post5290064", "text": "Will this be the springboard to give Blackberry enough of an influx of cash to launch other rumored devices like the Argon, Neon and Mercury?\nOr will this do a Legend of Zelda, and spin around and faceplant? \nSound off below.", "time": "07-30-2016 09:16 AM", "replies": []}, {"postID": "post5290133", "text": "With its Alcatel ancestry it should do okay....they've produced some good phones of late.", "time": "07-30-2016 10:31 AM", "replies": []}, {"postID": "post5290148", "text": "At this price should do okay. In the USA, it's only priced $100 more than Idol 4 and DTEK50 is factory unlocked with extra Blackberry software.\nPosted via the Android Central App", "time": "07-30-2016 10:43 AM", "replies": [{"postID": "post5335459", "text": "In the US... you mean on shopblackberry and Amazon?\nSorry but most still buy from Carrier's here. Those looking to buy from other sources, probably don't understand that BlackBerry is even using Android at this point.\nThe question is can they maintain sales of around 2 - 3 million phones (between all the lines) over a year's time. That might be a possibility, but making BlackBerry a \"player\" again... not going to happen.", "time": "08-17-2016 08:50 AM", "replies": [{"postID": "post5354651", "text": "Never said they were going to be a player again. That ended when they chose to develop BB10 instead of embracing Android back in 2008. The days of people lining up for the flagship devices are waning too. Mid tier and lower is where it's at. If any companies show ability to move phones outside the carriers, the carriers will sign deals to get their share. The deal with TCL is as much about survival without carrier support now as having a shot with carriers down the road who sell whatever recycled brand the masses recognize from the old days. Think Perry Ellis and Kenneth Cole being sold in Ross and TJ Maxx.\nPosted via the Android Central App", "time": "08-22-2016 07:36 AM", "replies": [{"postID": "post5367680", "text": "But outside of carriers... what phones sell?\nEither ones associated with a Brand that is popular, or ones that are super cheap. A BlackBerry DTEK is neither....\nMy real issue is this phone is meant for enterprise fleets, where end-to-end security is crucial. But how many enterprise customers in the US buy from sources other than Carriers (commercial customers still get subsidies)? How many enterprise customers in the US aren't using Verizon (DTEK has no CDMA Radio) as their primary provider? \nAs for BlackBerry and Carriers.... I think Verizon having to sell the PRIV for $400 and the glut of T-Mobile and AT&T PRIV's that can be found for $300 - $400 should be enough to tell you that Carrier are done losing money on BlackBerry hardware.", "time": "08-26-2016 08:58 AM", "replies": []}]}]}]}, {"postID": "post5291162", "text": "I hope this is a start to keep them producing more mid range phone.\nPosted via the Android Central App", "time": "07-31-2016 03:31 AM", "replies": []}, {"postID": "post5291952", "text": "Yes. While I would like an HTC/Blackberry joint phone venture, I think this phone will appeal to those who want security.", "time": "07-31-2016 04:12 PM", "replies": []}, {"postID": "post5299793", "text": "I think it will fail miserably. \nBlackBerry have finally come out with an all touch device, but the specs are terrible. If what people's wanted was a low spec device they wouldn't be clamoring for iPhones and the Galaxy. \nI don't think Chen has a clue. Every phone he comes out with fails.\nPosted via the Android Central App", "time": "08-04-2016 01:59 AM", "replies": [{"postID": "post5301242", "text": "Its true that security features doesn't sell to the normal consumer base, but that's probably less true when talking about the business consumers. \nThere isn't a whole lot wrong with this phone other than it having an underpowered processor, but I don't think businesses really care if their phones can run games or snapchat or any other non productivity/communication app.\nPosted via the Android Central App", "time": "08-04-2016 03:48 PM", "replies": []}]}, {"postID": "post5301624", "text": "To me the initial pricing of the Priv, was just awful. Even with the DTEK50, I feel it should be slightly less. But, I guess time will tell. I'll pass on this one; still hurt from paying $749.99 for my Priv. Maybe the next unit will be better on specs and pricing...", "time": "08-04-2016 07:17 PM", "replies": []}, {"postID": "post5368898", "text": "Hard to say, the biggest problem BlackBerry has right now is being called BlackBerry, which people have associated with being behind the times and being sub par. BlackBerry needs to shatter the illusion and continue to shatter it to be back in the mainstream and able to make all the phones they want.", "time": "08-26-2016 03:13 PM", "replies": []}, {"postID": "post5405039", "text": "I did some research on this phone today, and really like it (I'm a BlackBerry geek). However, I feel like it would do better if the screen size was a little bigger, as well as the battery capacity. But BlackBerry has always been an innovative and unique company and so hopefully it sticks around. I still keep up with what they're doing and would love to grab another BB device at some point. I really miss my Q10 and would LOVE a Priv!", "time": "09-08-2016 09:26 PM", "replies": [{"postID": "post5420114", "text": "Unfortunately, DTEK50 is re-badged Idol 4 so BlackBerry has no hand in physical design or dimensions. Good news is there are plenty of good deals out there on PRIV.\nPosted via Android Central App", "time": "09-15-2016 06:49 AM", "replies": []}]}]}, {"title": "Show us your phone!", "thread": [{"postID": "post5318926", "text": "Has your d-tek 50 arrived? Let's see your device and hear your feed back. My son's arrived on Tuesday. \nSo far with the time that I have used it (setting it up) its a nice little device , great camera , feels very comfortable in your hand, the blackberry hard shell was a nice addition, a little light for my liking but it does everything he needs it to do for a great price point. Carter worked hard to save the money himself to buy this one", "time": "08-12-2016 09:25 AM", "replies": []}, {"postID": "post5405045", "text": "Happy Phone Month to him! It's a super cool phone, for sure! I was admiring it today!", "time": "09-08-2016 09:29 PM", "replies": []}, {"postID": "post5405108", "text": "Good for him. Great device to save up for. I am thinking of picking one up...waiting to see what the battery life is like on them.", "time": "09-08-2016 10:12 PM", "replies": [{"postID": "post5405828", "text": "Please let us know what the battery life is like! I'm really curious about that, myself.", "time": "09-09-2016 09:05 AM", "replies": []}]}]}, {"title": "Which would you pick?", "thread": [{"postID": "post5290059", "text": "Since the DTEK50 is an Alcatel Idol 4, is there a reason you would pick one over the other?\nWe can assume that Blackberry will support the device, but this can be an incorrect assumption too.", "time": "07-30-2016 09:07 AM", "replies": [{"postID": "post5300416", "text": "DTEK50 just for the monthly updates.\nPosted via the Android Central App on my BlackBerry Passport", "time": "08-04-2016 09:43 AM", "replies": []}, {"postID": "post5346180", "text": "The reason anyone buys a BlackBerry, for the keyboard or security. The mystery third option is their OS but it's Android now so that doesn't count.\nA droid a day keeps the Apple away", "time": "08-19-2016 02:58 PM", "replies": []}]}, {"postID": "post5291626", "text": "Blackberry added its on security chipsets, secure boot and blackberry apps. They might same phone physically but thats were it ends.\nPosted via the Android Central App", "time": "07-31-2016 11:42 AM", "replies": []}, {"postID": "post5292408", "text": "Blackberry actually updates security patches at least, so to me, that is a good enough edge since I do care about that kind of thing. It isn't the end of a phone for me if it doesn't update at all but it's an additional plus.", "time": "07-31-2016 10:38 PM", "replies": []}, {"postID": "post5301920", "text": "I wouldn't mind trying the DTEK50. Anything BlackBerry-related, I am down for. \nPosted via the Android Central App", "time": "08-04-2016 09:41 PM", "replies": []}, {"postID": "post5335130", "text": "Definitely the blackberry. They added a lot of cool features to the phone.\nPosted via the Android Central App", "time": "08-17-2016 07:12 AM", "replies": []}, {"postID": "post5339008", "text": "Blackberry DTEK50\nMore security, updated, new features, \nbest of two worlds.", "time": "08-17-2016 11:02 PM", "replies": []}, {"postID": "post5339021", "text": "DTEK50 hands down, I miss my old Blackberry's, wish they hadn't fallen so far behind.", "time": "08-17-2016 11:05 PM", "replies": []}]}, {"title": "hands free calling blackberry dtek50", "thread": [{"postID": "post5329555", "text": "if I can't figure this out out the phone might going back. using hands free calling I set it up in my work truck it using the 0000 as the code. but my car gives me a code of four digits it will connect but when you try and place a call if reverts to on star calling. any one else have this problem and if so how did you work around it.", "time": "08-15-2016 03:58 PM", "replies": []}, {"postID": "post5330920", "text": "Moved to the DTEK50 forum.", "time": "08-16-2016 02:40 AM", "replies": []}, {"postID": "post5333709", "text": "Sometimes the code can be 1234 or something else different. You need to check the manual for the Bluetooth.", "time": "08-16-2016 07:56 PM", "replies": []}]}, {"title": "Why doesn't the BlackBerry DTEK50 support Verizon?", "thread": [{"postID": "post5283330", "text": "It seems to be GSM only, so no CDMA support. It seems like it'd be better to go the other route and make a version specifically for Verizon and then add the normal GSM bands. Verizon phones are factory unlocked and can work on almost any network. Think that'll be a problem for all the businesses with huge Verizon contracts?", "time": "07-26-2016 11:28 AM", "replies": []}, {"postID": "post5283344", "text": "I don't think the Idol 4 is available for Verizon either. \nIsn't the DTEK50 the same hardware as the Idol 4, just with the additional BlackBerry software?", "time": "07-26-2016 11:36 AM", "replies": [{"postID": "post5283353", "text": "Good question. They definitely have a lot in common.", "time": "07-26-2016 11:40 AM", "replies": [{"postID": "post5283405", "text": "Correct as for Verizon don't manufacturers have to pay them to be able to use their carrier bands on the devices if Verizon elect not to stock said devices guessing BlackBerry opt not to\nPosted via the Android Central App", "time": "07-26-2016 12:10 PM", "replies": []}]}, {"postID": "post5286026", "text": "To me, the best way to put it is to think of it as essentially an Idol 4 running BB software.\nBecause that's essentially what it is.", "time": "07-27-2016 07:25 PM", "replies": []}]}, {"postID": "post5284297", "text": "Shame.\nPosted via the Android Central App on the Moto X Pure Edition", "time": "07-26-2016 10:19 PM", "replies": []}, {"postID": "post5285063", "text": "Very well could see this come later to Verizon. BlackBerry usually releases their GSM shop BlackBerry versions first\nPosted via the Android Central App", "time": "07-27-2016 10:04 AM", "replies": [{"postID": "post5285352", "text": "Looks like they just put their spin on an existing Alcatel though. If that Alcatel doesn't get a Verizon-compatible version, I doubt this DTEK50 will get one.", "time": "07-27-2016 12:56 PM", "replies": []}]}, {"postID": "post5289581", "text": "Should be able to run on Verizon if the unlocked Moto G4 is capable of all US carriers it's about the competition...\nPosted via the Android Central App", "time": "07-29-2016 10:56 PM", "replies": [{"postID": "post5293840", "text": "I got a nexus 5x, works on Verizon but not sold in their stores. Blackberry should make one phone for every carrier", "time": "08-01-2016 04:43 PM", "replies": []}, {"postID": "post5303544", "text": "The Moto supports the Verizon CDMA frequencies so it's allowed on the Verizon network. Same with the Nexus 6P and 5X. Verizon will let ANY device on their network IF it supports ALL the frequencies they use. The DTEK50 doesn't even have CDMA radios, ergo not usable on Verizon.", "time": "08-05-2016 02:55 PM", "replies": [{"postID": "post5303590", "text": "Right; the question is why would they eschew CDMA & Band 13 LTE support when the other devices it's competing (other than the OnePlus 3) with support whatever carrier the customer wants?", "time": "08-05-2016 03:08 PM", "replies": []}]}]}, {"postID": "post5304792", "text": "Probably cost is not worth the benefit. Most of the world is on GSM.\nPosted via the Android Central App on my BlackBerry Passport", "time": "08-06-2016 07:47 AM", "replies": [{"postID": "post5329567", "text": "Right Alcatel probable knew that Verizon would never pick up a device in this category from an unknown brand in the US... so they didn't incorporate the CDMA frequency. And BlackBerry is pretty much just taking a stock Idol 4 and putting a new back on it, and installing their software package.", "time": "08-15-2016 04:00 PM", "replies": []}]}]}, {"title": "What's in a name?", "thread": [{"postID": "post5290074", "text": "Shakespeare penned, '...that which we call a rose, by any other name would smell as sweet.'\nI think this isn't the case here. Going by the codename would have been a better idea.", "time": "07-30-2016 09:35 AM", "replies": []}, {"postID": "post5290691", "text": "It sounds like the name of a router, not a phone.", "time": "07-30-2016 06:54 PM", "replies": [{"postID": "post5291495", "text": "I'll admit, it is reminiscent of older Android device names.", "time": "07-31-2016 10:09 AM", "replies": []}]}, {"postID": "post5292039", "text": "When I think of older Android device names, though, I think of phones like the Epig 4G Touch LTE Plus Super Awesome Kitteh Mega Special Edition.", "time": "07-31-2016 05:20 PM", "replies": []}, {"postID": "post5301929", "text": "The name does have a kinda mysterious/espionage-esque thrill to it. \nBlackBerry enjoys doing this type of thing, it seems. It's cool, though. Uniqueness like this sets specific devices apart, IMO.\nPosted via the Android Central App", "time": "08-04-2016 09:45 PM", "replies": [{"postID": "post5302688", "text": "It actually sounds more like the one time droid appearance on Star Wars.", "time": "08-05-2016 09:04 AM", "replies": [{"postID": "post5302863", "text": "LOOL that is a wonderful connection!", "time": "08-05-2016 10:23 AM", "replies": []}]}]}, {"postID": "post5302022", "text": "Better than \"Moto Z Force DROID Edition\".\nPosted via the Android Central App on the Moto X Pure Edition", "time": "08-04-2016 10:49 PM", "replies": [{"postID": "post5302690", "text": "That name ranks right up with the Sprint Samsung Galaxy S2 Epic 4G Touch.", "time": "08-05-2016 09:05 AM", "replies": []}]}]}, {"title": "Blackberry started it...", "thread": [{"postID": "post5284017", "text": "With monthly updates that rivaled the Nexus. Will they keep it up with their new devices?", "time": "07-26-2016 06:58 PM", "replies": []}, {"postID": "post5284039", "text": "I'll say this. If they keep up with updates on this budget device... damn, that's going to change the name of the game. Expectations for other OEM's at that point - nothing is forgiven. At least, by the super nerds. Right now we give budget devices a pass. BlackBerry could shut that pass down and raise the stakes.", "time": "07-26-2016 07:18 PM", "replies": [{"postID": "post5284091", "text": "Yes, they could. It will be very interesting to see what happens a few months after release.", "time": "07-26-2016 07:49 PM", "replies": []}]}, {"postID": "post5284132", "text": "Well, they'll still only have two models to update, so I imagine that updates will be as regular as they've been on the Priv.", "time": "07-26-2016 08:11 PM", "replies": []}, {"postID": "post5284296", "text": "If they're calling this the \"most secure\" device, they'd better bring what they're doing with the PRIV to the DTEK50.\nPosted via the Android Central App on the Moto X Pure Edition", "time": "07-26-2016 10:18 PM", "replies": [{"postID": "post5291540", "text": "Not disagreeing with you. The next few months will be interesting in terms of security updates.", "time": "07-31-2016 10:47 AM", "replies": []}]}, {"postID": "post5284371", "text": "Oh I'm sure they will, I mean that is what they will be doing if hardware does indeed shutdown: software.\nIf they can't get updates out properly, how on earth are people supposed to trust their EMM stuff.", "time": "07-26-2016 11:45 PM", "replies": []}, {"postID": "post5288397", "text": "If you listen to the CEO... there is no guarantee on if he can make hardware profitable. And he has promised investors that if he can't he will shutdown hardware. Now I would hope that he would support any hardware sold for at least one year of security patches and depending on where they are on updating to the new level of Android... maybe release that. But right now updates depend on if they start making money, and if they can sell enough phones.\nChen said he needed to sell about 3 Million with an ASP of $300... this phones doesn't have an APS of $300.", "time": "07-29-2016 07:30 AM", "replies": [{"postID": "post5288519", "text": "This message right here ^^ is a giant DO NOT BUY flag put on all BlackBerry devices, regardless of OS. And that's just for personal use. For enterprise, it's a blimp instead of a flag and that blimp might be on fire.", "time": "07-29-2016 08:41 AM", "replies": [{"postID": "post5291168", "text": "^^^^^\nThis message right here is from someone the doesnt like blackberry.\nPosted via the Android Central App", "time": "07-31-2016 03:42 AM", "replies": [{"postID": "post5291341", "text": "No... This message right here is from someone who doesn't like the risk of a company stating they could abandon projects at any time. That would most likely mean no more security updates. And any IT person reading that message, given that they're going to want to keep the devices for 2-4 years is going to be even more concerned.", "time": "07-31-2016 08:05 AM", "replies": [{"postID": "post5291494", "text": "I think BB is hoping that they will get a massive contract from major corporations and the government. The sad thing is, those markets have already moved on. Either shifting to Apple or Samsung, or even a BYOD program.", "time": "07-31-2016 10:08 AM", "replies": [{"postID": "post5299797", "text": "Couldn't agree more. Especially with BYOD! It's too bad cause I loved BlackBerry.\nPosted via the Android Central App", "time": "08-04-2016 02:03 AM", "replies": []}]}]}, {"postID": "post5291491", "text": "I think there are better ways to spend $300. Many other choices that are better for roughly the same price point with better hardware, SoC in particular.", "time": "07-31-2016 10:06 AM", "replies": []}]}]}]}, {"postID": "post5301923", "text": "I hope they do and think they will. I'm excited to see what happens!  Lots of good stuff coming out and BlackBerry is part of it. \nPosted via the Android Central App", "time": "08-04-2016 09:42 PM", "replies": []}]}, {"title": "How's the camera?", "thread": [{"postID": "post5292386", "text": "For those of you who get the DTEK50, share with us your thoughts on the camera quality, as well as the pics themselves! It's funny these days how a 13 MP camera is considered middle-of-the-road, when just a couple of years ago, eyes would have been bugging out over all them megapixels ...", "time": "07-31-2016 10:23 PM", "replies": []}, {"postID": "post5293104", "text": "On top of the fact that they are figuring out ways to make the light capturing sensor larger so that they don't have to cram in a larger MP camera. But, yes, seeing pictures from the device would be nice.", "time": "08-01-2016 09:24 AM", "replies": []}]}, {"title": "How will it compare?", "thread": [{"postID": "post5289216", "text": "Blackberry has a new device. How do you think it will stack up against the Priv? Sure the DTEK has the SD617, but will the difference be noticeable?\nSound off below.", "time": "07-29-2016 04:32 PM", "replies": []}, {"postID": "post5291617", "text": "Dtek50 is a midrange device targeted for corporate users and consumers that likes what blackberry security offers but is not willing to pay for high ticket item. I think this are the perfect target for blackberry.\nPosted via the Android Central App", "time": "07-31-2016 11:38 AM", "replies": []}]}, {"title": "DTEK50 Specs", "thread": [{"postID": "post5283269", "text": "5.2\" 1080p \nAndroid 6.0 Marshmallow\n3GB RAM\nSnapdragon 617\n16 GB Storage + MicroSD\n13 MP Rear Camera\n8 MP Front Camera\nNFC\nLTD bands 1, 2, 3, 4, 5, 7, 12, 17, 20, 29, 30 \n2610 mAh battery with QC 2.0 Micro USB; estimated to last 17 hours. \nIntegrated dual speakers and dual microphones\nNo fingerprint scanner\n3.5 mm audio jack\nDimensions 147 x 72.5 x 7.4 mm http://shop.blackberry.com/store/bbr...02hwhhctnxmsbx\nAnd a TON of Blackberry Bloat: • BlackBerry Applications: BlackBerry® Keyboard, BlackBerry® Hub, BlackBerry Calendar, Contacts by BlackBerry, Notes by BlackBerry, Tasks by BlackBerry, BlackBerry Camera, BBM®, DTEK™ by BlackBerry®, BlackBerry Device Search, BlackBerry Launcher, BlackBerry Services, BlackBerry Help, BlackBerry Password Keeper, Microsoft exFAT Technology for BlackBerry, BlackBerry Content Transfer, Yahoo!® Finance", "time": "07-26-2016 10:47 AM", "replies": []}, {"postID": "post5283287", "text": "I find this phone to be very interesting. I read all of the specs on the website and I noticed that both cameras appear to have OIS and the front one has flash. I wonder how good those cameras are. At least they are honest with the 17 hour battery life.", "time": "07-26-2016 11:01 AM", "replies": []}, {"postID": "post5283296", "text": "17 hours is an interesting claim. If that's 17 hours with decent SOT, that's going to be fine for a lot of users, especially with QC 2.0 on it. If that's 17 hours with the same type of \"mixed usage\" that some other companies use, we're looking at 2-3 hours SOT, over 10-12 hours and that's not going to necessarily be as OK. Looking forward to seeing how it does in the real world.", "time": "07-26-2016 11:04 AM", "replies": []}, {"postID": "post5283432", "text": "i agree...this phone has me very interested. the 615 and smaller battery worry me, but if the reviews are good and they hold up in real life use, i may replace my priv with the dtek.", "time": "07-26-2016 12:22 PM", "replies": []}, {"postID": "post5284172", "text": "BlackBerry's add ons including full disk encryption and their background processes are going to be tough on the 615. The 808 had troubles in the Priv with things like GMaps and a podcast app, Should be interesting to see what they can do to this seemingly underpowered phone to keep up with ways a corporate road warrior will most assuredly use the phone.", "time": "07-26-2016 08:36 PM", "replies": []}, {"postID": "post5285053", "text": "What you call BlackBerry bloat is what I call the reason I want the BlackBerry android over others. I loved bb10 until they stopped updating it\nPosted via the Android Central App", "time": "07-27-2016 10:00 AM", "replies": []}, {"postID": "post5285769", "text": "Looks like the BlackBerry version of Alcatel idol 4.", "time": "07-27-2016 04:28 PM", "replies": []}, {"postID": "post5288143", "text": "I am using a G4 Plus and there are no issues with the 617 and Google Maps. Used it on a road trip flawlessly.", "time": "07-29-2016 12:47 AM", "replies": [{"postID": "post5288767", "text": "Not just GMaps. Do GMaps, GMusic and get a call or GMaps, PocketCasts and get a call. Priv has a hard time with that and it has an 808. \nNow a corp salesman/road warrior, I think that's something very likely to be done.", "time": "07-29-2016 11:07 AM", "replies": []}]}, {"postID": "post5288153", "text": "I am curious to see if the BlackBerry software will slow down this device, considering that it doesn't have the greatest processor.\nHopefully one of the writers will compare it with the original Alcatel Idol 4 or maybe even the Moto G4.", "time": "07-29-2016 12:57 AM", "replies": []}, {"postID": "post5291166", "text": "Thats why i gettin this phone coz of blackberry add on software. I guess you dont know the difference between software add on and carrier bloatware that alot of users dont like.\nPosted via the Android Central App", "time": "07-31-2016 03:38 AM", "replies": []}]}, {"title": "New Blackberry DTEK50 Pre Order at $299", "thread": [{"postID": "post5283257", "text": "BlackBerry officially announces the DTEK50, pre-orders now open for $299 | Android Central\nInteresting little budget phone. What I can't figure out is ... who is this for? Hoping to see some good reviews to compare to other budget devices and to the midrangers that are close to this price. Really hoping to understand the value proposition of this versus the Nexus 5X or Sailfish, the OnePlus 3, Axon 7 and Moto G4 Plus 64/4. The one thing I can think of is that BB has NAILED monthly security updates so far.", "time": "07-26-2016 10:38 AM", "replies": [{"postID": "post5283275", "text": "Like the look. Guess this is the device that was made by alcatel, looks just like the idol 4(which isn't a bad thing). Price looks good as well. Will be interesting to see reviews of it.", "time": "07-26-2016 10:50 AM", "replies": [{"postID": "post5283278", "text": "Yeah, that's exactly what The Verge said.http://www.theverge.com/circuitbreak...uncement-price", "time": "07-26-2016 10:53 AM", "replies": []}]}, {"postID": "post5283418", "text": "Aimed at enterprises I would think guessing by name of device and amount of marketing about it been secure\nPosted via the Android Central App", "time": "07-26-2016 12:15 PM", "replies": []}]}]}]
