[{"title": "My fav style, but can it be 4k all the time?", "thread": [{"postID": "post6176964", "text": "What resolution does it default to when not in 4k?\nIs there a way to have it left in 4k or would that eat the battery?\nI just love this look, the le 2 had it, the nokia 8 has it, the xz goes one step further. minimalist metal thin framed.", "time": "03-02-2018 12:39 PM", "replies": []}]}, {"title": "Play Store App Icons not appearing on Home Screen", "thread": [{"postID": "post6148941", "text": "Hey folks...\nHope everyone had a Good Xmas and New Year...\nthe title says it all really.. After downloading an app in the Play Store, they appear in my App drawer and are installed and work just fine.. but for some reason.. the app icon itself doesnt appear on the Home Screen..\nThis isnt the case with my 5T or Pixel 2 XL... Just the XZP...\nI cant really pinpoint When it started happening either...\nAny ideas or fix anyone?", "time": "01-29-2018 03:02 PM", "replies": []}, {"postID": "post6148984", "text": "So you want that feature back? haha Most people want to disable that first thing they do when they get a new phone :P\nBut, if you want each app you install to also create a shortcut on your Home Screen, then just head over to the Play Store, tap the menu button, go to Settings, and make sure that the 'Add icon to Home Screen' option is active. That should do the trick.", "time": "01-29-2018 03:43 PM", "replies": []}, {"postID": "post6149491", "text": "That was the first thing I tried... but that option is not there in \"settings\" for some reason.. It must be some setting ive clicked somewhere...\nIts not that serious tbh, its just something I quite like to have.. but ill get uysed to it.. Im more interested to know what Ive done rather than get it back.. if you know what i mean", "time": "01-30-2018 05:50 AM", "replies": []}, {"postID": "post6149835", "text": "There's no \"outside the app\" setting in some other app that can remove that checkbox. Google may have removed it because so many people turn it off. (Besides, if the current screen is full, the app won't be installed as a shortcut to the homescreen anyway ... on some phones. On others, a new homescreen will be created to make room. [And on a few phones, a new homescreen will be created for each app you install, up to the limit of the launcher.)", "time": "01-30-2018 12:42 PM", "replies": []}, {"postID": "post6149952", "text": "It might be a Play Store 'bug' or feature that's being removed... but what's odd is that it's not showing/hiding consistently across devices. We've checked on a few different phones with the same Play Store version, and while I can still see the option on a Note 8, friends with a Pixel can't. \nApparently if you use Nova you can also set that as an option FOR NOVA, so that would be a good replacement if you have to have it and the Play Store is doing away with the option. But yeah, it seems to be a Google thing.", "time": "01-30-2018 02:27 PM", "replies": []}, {"postID": "post6150005", "text": "Much appreciated folks for taking the time... \nI honestly cant find the setting in play store.. and my XZP is the ONLY device that does it, including my 2XL.. which is wierd.. However, Im not worried or concerned about it, because the apps I download work as they should ... I just like to know WHY... is it a bug thatll affect my phone.. \nMaybe because XZP is integrated with Google Now and almost stock Android.. theyve disabled it as you say..\nIts a shame because its something I personally liked, but Ill get used to it..\nThanks Anyways", "time": "01-30-2018 03:44 PM", "replies": []}, {"postID": "post6167636", "text": "I too like some apps on my home screen. It doesn't appear that one can have a newly installed app automatically go to the home screen too. If there is a way, we have not found it yet.\nHowever, it can be done. Just requires an extra step. Here's how:\nGo to your app drawer after installing an app and hold your finger on that app a second or so and an option opens up at the top of the screen that says \"Add to home screen.\" Just drag the app up there and the app gets added to your home screen. Once there, you can rearrange it to your liking.\nYou will also see that when you hold on an app momentarily in the app drawer, besides opening up the option to add it to the home screen, a box also opens up beside the app for quick access to app info or to uninstal it.", "time": "02-20-2018 02:36 PM", "replies": []}]}, {"title": "Device Admin Apps", "thread": [{"postID": "post6164480", "text": "After having used the phone for a week, I noticed today that I have not enabled any of the apps listed on the Device Admin Apps. I came across them when I went into Settings, Lock Screen and Security and then saw the apps in DAA.\nThe reason I went to Settings was because when I tried to send a text message, the phone prompted me to change the group messaging settings to Group MMS. I was unable to find the appropriate settings to change that in the Messages app settings so I went to the main Settings menu. Now I am wondering if I need to enable at least the Xperia Configurator app to enable me to change the group messaging to Group MMS.\nAdditionally, should I be enabling all the apps in DAA? \nHelp, please.", "time": "02-16-2018 04:34 PM", "replies": []}, {"postID": "post6166518", "text": "The main one you should enable is Google's Find My Device, which allows you to remotely lock or wipe the phone in case you lose it. I doubt you need to enable Xperia Configurator to turn on Group MMS. Which messaging app are you using -- the stock one, Android Messages, or some other 3rd party app?", "time": "02-19-2018 11:53 AM", "replies": []}, {"postID": "post6167616", "text": "Thank you for your help. I will look into the Find My Device setting.\nAs for the group messaging issue, I was using the Android Messages app and I think it was the default messaging app as I did not see any other (stock) messaging app on the phone. The settings in the Messages app didn't contain the ability to switch to group messaging. I then went to Best Buy to look at their display model and saw that the display model had the setting in the Messages app to switch to group messaging. This confirmed my research that some phones had that setting in Messages while others did not, the difference apparently attributed to whether the phone was the U.S. version or the international version.\nIt was suggested to those who had the problem to switch to another messaging app and I did so, switching to Textra. Works fine now. I may check back with Android Messages occasionally to see if updates may bring the group messaging setting to it on my phone. However, I am happy with Textra now so I may just keep it permanently.\nThanks again for your help.", "time": "02-20-2018 02:15 PM", "replies": []}]}, {"title": "[HELP] XZ Premium CAMERA Manual Settings BUG", "thread": [{"postID": "post6152057", "text": "Hello guys - After the Oreo update the phone is acting normal except one bug that happened to the camera - the manual settings are bugged . Im using 4k resolution all the time and full immersive mode all the time too and 47.1.A.12.34 . I tried to clear the camera app, camera common and camera extention data and cache - i cleared the system cache by pressing the power and volume up button till it vibrates 3 times . The settings actually works but a bug which you can see at the screenshot happened - the words AUTO appear on top of the settings icons. I dont want to do a factory reset or software rapair because i wil lose my data . Please guys if you know how help me", "time": "02-01-2018 09:21 PM", "replies": []}, {"postID": "post6165353", "text": "Perhaps go back to 1080p.\nThere really aren't any apps written with 4K in mind.", "time": "02-17-2018 07:32 PM", "replies": []}]}, {"title": "LED Notifications", "thread": [{"postID": "post6065288", "text": "...are not working, apart from battery/charging.\nAs I understand it, the notification LED is supposed to light up for various other events. Not happening. All relevant settings are enabled.\nAnyone got any clues/tips?", "time": "11-11-2017 04:14 PM", "replies": []}, {"postID": "post6082509", "text": "It is hard to find...not intuitive...but here is what you need to do.\nLet's pick something...how about messages.\nGO to Settings > Apps & notifications > App info > Messages > Notifications > Tap on the actual words themselves \"Default Make sound\" and another window will open up...notice as you scroll down the toggle to \"Always pulse notification light\"???? Make sure that is also turned on.\nYes, it is hidden and I am not sure why it is like this but you will have to do the same thing for any and all apps that you want to activate the notification LED.\nOf course you need to have the default notification LED turned on for all apps...Settings > Apps & notifications > Configure notifications > toggle on Notification light.\nJust remember to tap on the actual words themselves once you are deeper into the individual app settings as listed above for messages. Be aware that some apps have more than one set of words to tap on with an LED toggle in both newly opened windows.", "time": "11-23-2017 02:47 PM", "replies": []}, {"postID": "post6123200", "text": "Thanks for that (& apologies for not responding sooner)", "time": "12-31-2017 10:39 AM", "replies": []}]}, {"title": "Red Xperia XZ Premium coming to US. Why doesn't Sony get more love?", "thread": [{"postID": "post6062513", "text": "I don't own this phone (in any color) but I've seen it as Best Buy and really liked it. Why doesn't Sony get more love as a company? This phone in any color looks amazing! https://www.phonearena.com/news/Red-...ice-US_id99706", "time": "11-09-2017 06:42 PM", "replies": [{"postID": "post6066802", "text": "I think its the bezel. People are sinking their bezels and they fail to adjust to the times. They have the screen, the sound, but not the look. That's what I always thought and this was confirmed by a reputable Stores associate.\nI questioned the same thing?\nIt's like they're stuck 3 years behind in the design department.\nI like Sony, I just feel they're fun needs a design overhaul. It's coming though, stay tuned.", "time": "11-12-2017 06:29 PM", "replies": [{"postID": "post6074822", "text": "They got the slab factor to perfection no need to change it really. Put it against any LG, Huawei, Pixel, Chinese and it's leagues ahead of them. Small bezels only make the ergonomics worse because Android is really not ready for vertical side to side screen.", "time": "11-17-2017 06:20 PM", "replies": []}]}]}, {"postID": "post6066643", "text": "I think because of the lack of fingerprint scanner in the US.\nHere in the UK Sony does and is known quite well.", "time": "11-12-2017 03:59 PM", "replies": [{"postID": "post6071128", "text": "Exactly, I can't decided if I should buy the US one and then change the firmware or just buy an international one without warranty. Would have bought one long ago if the fingerprint sensor worked.", "time": "11-15-2017 11:36 AM", "replies": [{"postID": "post6110845", "text": "Update:\nI ended up ordering the Xperia XZ Premium from eglobalcentral.com which is a site based out of Hong Kong. The phone is the dual sim version with finger printer reader and the price was unbeatable. I'm real happy with that website because they will handle the 1 year warranty for you should you need it. You'd have to send the device to them in Hong Kong but it's still better than no warranty at all like the international ones for sale on amazon. The item came a bit after it's estimated delivery time according to DHL but it came in good shape.\nI'm really glad I purchased from them as the finger print reader is absolutely amazing on this device, couldn't live without it. I'm real happy with the 4k LCD screen as well, it's the best I've seen and definitely the best for videos.\nI normally don't use phone cases but this is the first phone I've had with glass on the back so I went with a really thin case and I'm really happy with it's quality. https://www.amazon.com/gp/product/B0...cUvbUpU6110845", "time": "12-18-2017 11:58 AM", "replies": [{"postID": "post6111398", "text": "That looks so sweet. I love million cases. What color did u get? This was a phone I was eying but decided to get an Honor 8 at the time instead. I really liked this phone though.", "time": "12-18-2017 10:26 PM", "replies": []}]}, {"postID": "post6116539", "text": "I bought the international version at a great price so I added a Square Trade warranty. Love the phone and it's bezels even though I also have a bezel-less iPhone X.", "time": "12-24-2017 12:15 AM", "replies": [{"postID": "post6117326", "text": "Ya...its a shame I probably won't own one. But you can't own everything ever made. One would be broke", "time": "12-25-2017 12:52 AM", "replies": []}]}]}, {"postID": "post6071132", "text": "Good point", "time": "11-15-2017 11:41 AM", "replies": []}]}, {"postID": "post6068110", "text": "Yeah I hear you. The screens are really nice though", "time": "11-13-2017 05:07 PM", "replies": []}, {"postID": "post6074066", "text": "Loving my XZ Premium in the UK !", "time": "11-17-2017 07:20 AM", "replies": []}, {"postID": "post6081437", "text": "Shame they dont work on Verizon.", "time": "11-22-2017 03:03 PM", "replies": []}, {"postID": "post6109175", "text": "I love the xz premium.its such an underrated phone.and love the bezels", "time": "12-16-2017 05:56 PM", "replies": []}, {"postID": "post6109783", "text": "Agreed.. but i have to admit, i dont mind the bezels because they hold the stereo speakers.. if the XZP had been more like the original Pixel XL... where the huge bezels were just silly and pointless.. then I could understand the arguments. Also, the bezels and side rails give the phone abit of rigidity, strength and weight... making it tougher and IMO, make it feel more worth the money Im paying for it... an S8 /S8+ is far too flimsy and easy to break.\nI love my XZP and the camera is amazing, I think more realistic colours, white balance and true to life than the S8, although, the EIS occasionally makes a mess of the focus and images, which can be irritating, its not that big an issue where I wouldnt buy it.\nNo matter where you look these days.. everyone has either a SS or an Apple, which IMO, shows an inability of some people to think for themselves and just let these stores and reviewers tell them what to do and whats right for them, which is just sad ... so to me, its nice to own something a bit different that I choose, plus my XZP always turns a few heads..", "time": "12-17-2017 11:15 AM", "replies": [{"postID": "post6109834", "text": "I've never owned the phone but have been tempted. Right now I go between a BlackBerry KEYone and a Nexus 6P, though the latter might be broken beyond repair. So like you, I like to think for myself and have something a bit different generally. Thats what makes Android so fun IMO, customization and a variety of phones.", "time": "12-17-2017 12:04 PM", "replies": []}]}, {"postID": "post6110154", "text": "I don't think that Sony puts much effort into the US market.", "time": "12-17-2017 07:40 PM", "replies": [{"postID": "post6110413", "text": "Agreed.... in fact, its next to non-existent here in the UK, but I dont think SONY puts alot of effort into any of their phones anywhere here in the west TBH... SONY just seem to focus mainly on the PlayStation.. which is a shame", "time": "12-18-2017 05:10 AM", "replies": [{"postID": "post6111171", "text": "To be fair, smartphones are a tough market and if you're not Apple or Samsung, you probably aren't making a ton.", "time": "12-18-2017 05:14 PM", "replies": []}]}]}, {"postID": "post6112035", "text": "I went with the black case and black phone. I don't care to stand out lol. It does look nice though. I'm probably going to stick with Sony flagships going forward as I like this device so much. The default launcher, settings app, notifications area, alarms, etc. are much better than what I've seen on LG and Samsung in my opinion. Camera button is great as well. It's missing the glance screen, wireless charging, and double tap to wake but those are very minor features that I haven't missed at all.", "time": "12-19-2017 12:44 PM", "replies": [{"postID": "post6112039", "text": "It looks like I may need to replace my device (I may need a replacement device, which if true I'll just sell it and move on). I'll have to consider getting a Sony, as I think they are really nice. Even as I say that though...those pixels just look killer.", "time": "12-19-2017 12:47 PM", "replies": [{"postID": "post6112045", "text": "The Pixel 2 XL was my second choice because I refuse to get a phone without front facing stereo speakers but the cost is much higher for almost the same specs. Now that I have the Sony, I think I made the right choice, the finger print reader on the side is great because it still is usable while in a car mount. The screen on the Pixel 2 XL is so-so as well as many reviews noted. 4k screen on the Sony is amazing for video, no black bars. You can also change it to super vivid mode which I prefer.", "time": "12-19-2017 12:52 PM", "replies": [{"postID": "post6112050", "text": "Ya...i saw that 4K screen in the store (best buy use to carry it). I'd be interested to see when and where the red version comes out. But if I did I'd have to find a way to get the European version or whatever it's called as I'd have to have the finger ID.", "time": "12-19-2017 12:55 PM", "replies": []}]}]}]}, {"postID": "post6115158", "text": "How is the software experience on the XZ Premium?", "time": "12-22-2017 01:07 PM", "replies": [{"postID": "post6121829", "text": "Its really great actually.. We get about 1 or 2 updates every 2 months which includes the security patch and fixes / updates.. Most recent was \"8.49 / Dec 17\", SONY leads the way and is equal to Google for Android updates.. faster and more regular than even SS, LG and HTC.\nAlthough I have just \"Unbranded\" my XZP from O2UK to Open UK, but for me, the latest \"8.49\" build did a nice fix for some camera distortion / watercolour effect when cropping in.. so both Manual and Auto mode are back on point now, so whether it was something with the the O2 software, which de-branding fixed or the \"49\" update, im not sure.. but Im happy its sorted..\nAlso, which youve probably read anyway,,, SONY have massively increased the volume output of the speakers, so you can actually hear the Ring / Notify now. .. and the fact that since the abysmal Z5 issues, theyve really done some work, which tells me that SONY actually read and listen to forums so for me, Im more than happy to give SONY my money.\nIMO, Software is great and SONY are doing great with Updates.", "time": "12-29-2017 06:15 PM", "replies": []}]}]}, {"title": "volume control xperia z premium", "thread": [{"postID": "post6072419", "text": "i've this phone and i can change only volume ring control with notification control is very stupid in the night i cannot mute notification only because if i tried i cannot listen if have important call.\ni tried external app but don't work one i've do this error\nvolume linked \nyour device links notication volume and ringtone volume to change separately please disable behavior in the setting of your device.\nbut in sony xperia i cannot separately why? please help", "time": "11-16-2017 05:12 AM", "replies": []}, {"postID": "post6119816", "text": "Google did that in Android N as a means of Slimming things down.. You will have to live with it because apart from Samsung, All Android phones now have Ring and Notify Volumes as one slider.. and as the XZP is close to stock.. they wont change it..\nI could be wrong but i think Apple do it as well... I know Windows Phone has them linked", "time": "12-27-2017 07:14 PM", "replies": []}]}, {"title": "Thanks SONY.... Speakers are Great With OREO..", "thread": [{"postID": "post6107183", "text": "After years (yes, I do mean Years) of shouting at SONY to Increase the overall output volume of the Front Speakers... they have actually done it this time... Since the Z2, the stereo speakers have been good but too low a volume for Audio and ringtones..\nWhat I dont understand is.. this update proves theyve been able to increase the volume all along, which I think is one of the reasons for poor sales... after all theres nothing worse than buying a new phone and your cant hear the darn thing ringing or messaging, so how it took them so long to actually do it, i dont know....\nAnyway, they sound great... not quite as loud at high volumes as the HTC U11, but richer and fuller than my U Ultra.., yep, theyre brilliant..\nThanks SONY", "time": "12-14-2017 05:36 PM", "replies": []}, {"postID": "post6107278", "text": "I'm new to Sony and started out with the Xperia Xz Premium already on Oreo. The speakers and phone overall are amazing. I'm glad I went with the international version with the finger print reader as the side mount finger print reader is another great feature. I'll stay with Sony as long as they keep making devices like this.", "time": "12-14-2017 07:47 PM", "replies": []}, {"postID": "post6109173", "text": "The stereo effects on this speakers are second to none!", "time": "12-16-2017 05:55 PM", "replies": []}]}, {"title": "Bluetooth Data", "thread": [{"postID": "post6054055", "text": "I am really pleased with my XZ Premium, however I am disappointed that it does not supply track information when paired to my car stereo. I was hopeful the Oreo update might fix this but upgrade came through yesterday and still have the issue.\nAnyone experience similar problem s?", "time": "11-04-2017 04:59 PM", "replies": []}, {"postID": "post6054537", "text": "What make, model, and model year is your car? Is the stereo factory installed, or aftermarket? Older systems aren't necessarily compatible with modern Bluetooth metadata. For example, my wife's 2010 Mazda6 has never shown any of that data (even though there are headings for them).", "time": "11-05-2017 01:15 AM", "replies": []}, {"postID": "post6057215", "text": "The track, album title, genre data when paired via Bluetooth is displayed fine on my car's stereo from my daughters IPhone 6s, wife's Galaxy S7 and the LG G4 the Sony has replaced. Even my Sony Xperia Z4 tablet. It is an issue specific to the XZ premium which will only display \"No Data Supplied\"", "time": "11-06-2017 06:02 PM", "replies": []}, {"postID": "post6060638", "text": "Fixed the issue.😃\nAfter enabling Developer options under system settings you are able to change the version of AVRCP used by Bluetooth. My phone was set to use AVRCP 1.6 Changing this to version 1.5 immediately resulted in the track data etc displaying correctly on my car stereo display.", "time": "11-08-2017 05:38 PM", "replies": []}, {"postID": "post6060902", "text": "NICE. I would never have thought to look there.", "time": "11-08-2017 08:31 PM", "replies": []}]}, {"title": "Update started for OREO", "thread": [{"postID": "post6033599", "text": "As the title says it allSony Xperia XZ Premium getting Android 8.0 Oreo from today - Pocket-lint", "time": "10-23-2017 04:17 AM", "replies": []}, {"postID": "post6035715", "text": "I've seen the news all over the place. Has anyone seen the update on their device yet? Will it go out to carrier models or unlocked international models first?", "time": "10-24-2017 08:49 AM", "replies": []}, {"postID": "post6037359", "text": "I have it right now.My Sony is unlocked.", "time": "10-25-2017 04:55 AM", "replies": []}, {"postID": "post6037840", "text": "My phone is updating right now", "time": "10-25-2017 10:40 AM", "replies": []}, {"postID": "post6037919", "text": "One of the new features is better tuned audio. Anyone notice any difference? Does the volume go any louder than before?", "time": "10-25-2017 11:14 AM", "replies": []}, {"postID": "post6044377", "text": "How is the loudness now on the XZP? For ringer and music through the speakers.", "time": "10-29-2017 02:46 PM", "replies": [{"postID": "post6045051", "text": "I saw a review on youtube that stated the speakers were much louder after the oreo update. Can't find the video atm though.", "time": "10-30-2017 12:42 AM", "replies": []}]}, {"postID": "post6045069", "text": "Can you share some screenshots.", "time": "10-30-2017 12:54 AM", "replies": []}, {"postID": "post6053031", "text": "I just ordered one. I should get it tomorrow. can't wait to try Oreo on the phone.", "time": "11-03-2017 11:11 PM", "replies": []}]}, {"title": "Using Native 4K", "thread": [{"postID": "post5994660", "text": "So i have been using 3 different resolutions for my XZP. 1080x1920, 1890x3360 and 2160x3840.\n1080x1920 is what the phone came with so i dont have to explain.\n1890x3360 is what i tried to use for a few weeks and i found out that the keyboard(swiftkey, fleksy and google keyboard) usually misses a few words. And keyboards get laggy.\n2160x3840 is what i finally tried and it turns out less laggy(keyboard) as compared to 1890x3360. But i needed a 3rd party dialer(i used Google Pixel's dialer) and everything else is great.\nAnd 2160x3840 is so sharp i cant really go back to 1080x1920 lol. \nBattery life is not really noticeable but the device gets warm at times but i can live with it...\nSo anyone else having this laggy keyboard issue? And please dont tell me the XZP wasn't intended for 4K use. Adreno 540 is capable of it so it's actually safe i guess.", "time": "09-27-2017 04:30 AM", "replies": []}, {"postID": "post6035516", "text": "I think the keyboard issue is common.i ahev the same problem and they keyboard kinda of kisses a lot.for eg if I try to delete the words by hitting g backspace continuously then it would lag a lot.\nI am having dual sim indian version and gboard in use .also resolution is 1080P", "time": "10-24-2017 05:16 AM", "replies": []}]}, {"title": "Oreo out for xz premium", "thread": [{"postID": "post6033600", "text": "As the title says it all.Here is the linkSony Xperia XZ Premium getting Android 8.0 Oreo from today - Pocket-lint", "time": "10-23-2017 04:18 AM", "replies": []}, {"postID": "post6033932", "text": "What is Pero?", "time": "10-23-2017 09:53 AM", "replies": [{"postID": "post6033990", "text": "I think the OP meant Oreo.", "time": "10-23-2017 10:28 AM", "replies": []}]}, {"postID": "post6033999", "text": "Mod note. Title edited.", "time": "10-23-2017 10:30 AM", "replies": []}, {"postID": "post6034202", "text": "Sorry for the typos.its oreo.\nWas too excited with such fast updates.how is the review so far", "time": "10-23-2017 12:09 PM", "replies": []}]}, {"title": "Why isn't there an XZ Premium forum?", "thread": [{"postID": "post5735579", "text": "And is anybody eyeing it up?\nFor me, bezels are just too horrible. Sadly.", "time": "03-31-2017 12:24 PM", "replies": [{"postID": "post5742732", "text": "This would be one phone that could possibly pull me away from HTC this year. Pricing aside, I'm willing to pay the money, I will definitely be giving this a consideration around Xmas time. Comparing it to the HTC Ocean. One of these two phones will take my money later this year. Guaranteed!!!", "time": "04-04-2017 08:57 AM", "replies": [{"postID": "post5743241", "text": "Me too, most likely between the XZ Premium and HTC 'Ocean'.\nWhat do you make of the Premium's top and bottom bezels though??", "time": "04-04-2017 01:31 PM", "replies": [{"postID": "post5743445", "text": "To be completely honest with you , bezels have never bothered me. To me, it is a necessary evil for the ergonomics of a device. I believe that in order for me to properly use my device throughout the day , I have to have those bezels there.", "time": "04-04-2017 03:21 PM", "replies": [{"postID": "post5750684", "text": "On the black version the bezels are less noticeable than on the chrome version. Black always makes things look slimmer and discreet!", "time": "04-09-2017 04:00 AM", "replies": [{"postID": "post5753895", "text": "Yeah, not sure I would ever go with a chrome or silver phone. I had all dark HTCs(desire hd, m7, M8, 10) and a Sony Xperia TL. The only silver phone I had was the M9. And I quickly regretted it. I wish I had gone with the gun metal. So for me, it's always dark phones.", "time": "04-11-2017 07:36 AM", "replies": []}]}]}]}]}]}, {"postID": "post5736107", "text": "There are so many different Android devices out there that it's unfeasible to have a subforum for every single one. Subforums are generally created based on a phone's popularity and demand. You could send a request here, if you'd like: Contact | Android Central", "time": "03-31-2017 04:39 PM", "replies": [{"postID": "post5952480", "text": "Merely bumping this post. Nothing more", "time": "09-02-2017 10:06 AM", "replies": []}]}, {"postID": "post5736880", "text": "But this is obviously going to be a major flagship of the year...", "time": "04-01-2017 02:35 AM", "replies": []}, {"postID": "post5737829", "text": "By all means, send a request using that link above. For now, just keep posting in the main XZ forum. (I don't have any direct control over creating new subforums.)", "time": "04-01-2017 04:02 PM", "replies": []}, {"postID": "post5763395", "text": "There's now a OnePlus 5 forum and that will be launched after the XZ Premium", "time": "04-17-2017 08:24 AM", "replies": []}, {"postID": "post5777230", "text": "Can someone please request this subforum.", "time": "04-22-2017 11:12 AM", "replies": []}, {"postID": "post5777607", "text": "I like the looks of this phone. It doesn't look like all the Samsung clones out there. I already pre-ordered mine from the UK.", "time": "04-22-2017 01:58 PM", "replies": [{"postID": "post5777761", "text": "When is it going to be available in the UK?", "time": "04-22-2017 03:19 PM", "replies": []}, {"postID": "post5777792", "text": "From Clove?", "time": "04-22-2017 03:38 PM", "replies": [{"postID": "post5777811", "text": "Just checked. Expected 1st week in June", "time": "04-22-2017 03:49 PM", "replies": []}]}]}, {"postID": "post5788849", "text": "I went with unlocked mobiles.com. I think they said they would be available on May 22.https://www.unlocked-mobiles.com/sim...e-p-87511.html", "time": "04-27-2017 06:12 PM", "replies": [{"postID": "post5798327", "text": "Is this site shipping to the US? I will definitely be buying the European model. Because the fingerprint scanner.", "time": "05-03-2017 05:27 AM", "replies": []}]}, {"postID": "post5797554", "text": "Think I'll be going where the new HTC instead.\nThe more videos I see of it, I can't accept the bezels on the XZ.", "time": "05-02-2017 03:50 PM", "replies": [{"postID": "post5799307", "text": "So you've decided huh? I'm so undecided right now. I am having conflicting thoughts. I think it'll come down to the camera and the edge sense capabilities.", "time": "05-03-2017 05:35 PM", "replies": [{"postID": "post5804256", "text": "I still go back and forth LMAO!\nThe XZ seems like an incredible bit of technology. Bezels are painful when you look at your phone hundreds of times a day.\nThe U 11 looks really nice, you seen that render of the red one?\nLet's see. ANYTHING to keep me away from Samsung. Which I've managed to do since I had the Soul U900 nine years ago.", "time": "05-07-2017 05:17 AM", "replies": [{"postID": "post5804632", "text": "That red render I saw in XDA. It's beautiful. The XZ Premium is stealing me away for the front facing speakers and the camera. Samples of the camera, saw some on phone arena, are stunning! The U 11 has to impress me in the camera department to get me to go full-fledged Bluetooth. I still have some great wired headsets and Sony will accommodate them well. The bezels don't bother me. It's just top and bottom for the front speakers. Right now for me it's really only going to come down to camera, I think.", "time": "05-07-2017 10:48 AM", "replies": [{"postID": "post5804671", "text": "The every photo sample I've seen from the Premium has been stunning. It could be camera of the year. I can forgive the relatively slow shutter speed Sony is known for if the camera produces that kind of quality.\nYou know the HTC will come with a USB C headphone jack adaptor?\nThe Xperia has high res audio like the HTC right? Are they comparable? If so, the front facing speakers of the Sony may just sway me.", "time": "05-07-2017 11:15 AM", "replies": [{"postID": "post5804697", "text": "Well if they continue the current Sony trend, they have a custom DAC that produces comparable, if not superior, audio quality. I know it'll come with the dongle but I charge and listen at the same time for at least an hour and a half every day. But, if the camera is on the same level and the edge sense seems practical, I will go HTC.", "time": "05-07-2017 11:45 AM", "replies": [{"postID": "post5804702", "text": "Gotcha.", "time": "05-07-2017 11:54 AM", "replies": []}]}]}]}]}]}]}, {"postID": "post5799309", "text": "Edit. Double post", "time": "05-03-2017 05:35 PM", "replies": []}, {"postID": "post5802204", "text": "Yes they will ship to the US. They say two day shipping, but I'm not going to hold them to that. I don't care what the company, whenever they say 2 day shipping you can count on a week at least. LOL\nI want the fingerprint scanner also without having to flash a ROM. I figure since they speak English in the UK that the worst thing is that a few words may be spelled differently than what we are used to. You know colour instead of color.", "time": "05-05-2017 02:08 PM", "replies": []}, {"postID": "post5804759", "text": "Bezels mean I can hold the phone and not accidentally open up apps. Bezels on this phone mean front facing stereo speakers. The camera looks to be a real winner, and a dedicated camera button adds usability. Can't wait for this phone to come out!", "time": "05-07-2017 12:53 PM", "replies": []}, {"postID": "post5806928", "text": "With you on this phone. Can't wait. This is a beautiful phone with some great tech. I pre-ordered already!", "time": "05-09-2017 07:03 AM", "replies": []}, {"postID": "post5811869", "text": "Enjoying the tumbleweed here.\nIt's because there's virtually **** all US market for Sony that it's so dead here, right?", "time": "05-12-2017 01:39 PM", "replies": [{"postID": "post5813110", "text": "I'd believe that to be a strong reason for the lack of a XZ Premium forum. \nEither way I'll wait for the reviews before I decide between the U11 and the XZ Premium. Although if Nokia launched their flagship soon it'll be a tougher choice", "time": "05-13-2017 11:18 AM", "replies": []}]}, {"postID": "post5813633", "text": "Holding out for HTC, but this seriously has my mind in a daze. This is surely to be a very hard decision between the two this year...\n\"We love being surprised as much as we like being impressed. And Sony just delivered!\"-GSMArenahttp://m.gsmarena.com/sony_xperia_xz...ew-1610p10.php", "time": "05-13-2017 07:52 PM", "replies": [{"postID": "post5814308", "text": "Thanks for this. I'm a bit concerned about:\nExcellent audio quality on an external amp with average loudness. Unfortunately, loudness is less than stellar with headphones.\nStereo loudspeakers sound nice but they scored Below Average in our loudness test.", "time": "05-14-2017 10:45 AM", "replies": [{"postID": "post5814378", "text": "I'm not. Most everything I have is Bluetooth now. Just bought a pair of beats wireless. My car is Bluetooth. I'm stoked for the camera experience. I'm only worried that the camera might not have a 16 second exposure like my HTC 10 does. I take lots of pics of the Stars and I'd be remiss if I didn't have that feature on my next phone. Other than that, I'm almost drooling... Haha", "time": "05-14-2017 11:46 AM", "replies": []}]}]}, {"postID": "post5817260", "text": "It's going to be extra tough now that I saw the HTC u11 scored the highest score in dxomark... Damn", "time": "05-16-2017 01:00 PM", "replies": []}, {"postID": "post5819933", "text": "Damn I wasn't even considering the HTC U11 but I am now. However I am still interested in the Sony Xz Prem. Price could be better though. The U11 is only $649. I also don't mind the bezel on top and bottom. Pick your phone up and see where you thumb goes? Kind of in the lower third. Not at the very bottom. I like where the home, back, and multitasking button are on the Xz Prem. Reaching at the very bottom with your thumb is a bit uncomfortable for me. Camera is huge for me and it seems some people don't like the Sony's? Is it near the top? They seem more true in color etc. I don't know anymore, I can't decide. Just trying to stay away from Samsung, won't ever buy apple, and I am always looking for something new, I tend to get bored ha. Might check out the new Nokias too!", "time": "05-18-2017 01:05 PM", "replies": []}, {"postID": "post5819985", "text": "https://www.forbes.com/sites/davidph...llThingsMobile\nThis may have just won me over on the HTC u 11.", "time": "05-18-2017 01:40 PM", "replies": []}, {"postID": "post5820776", "text": "HTC looks like a great phone too. It's going to be a tough call either way. Seems like all the flagships are extremely competitive. Whichever you choose, please post your thoughts and enjoy. I'm still going for the Sony. Awaiting my preorder.", "time": "05-19-2017 06:22 AM", "replies": []}, {"postID": "post5823949", "text": "Now it looks like this September they will be announcing three new phones. I am now thinking of waiting and seeing how much the XZ1 will be and if it will be waterproof. Sony Xperia XZ1, XZ1 Compact, and X1 key specs leaked - Gizbot", "time": "05-22-2017 07:36 AM", "replies": [{"postID": "post5826507", "text": "Me too. I was expecting something in September, even though the Premium is out very shortly before that!\nMaybe these new phones will have more palatable bezels?", "time": "05-24-2017 10:22 AM", "replies": []}]}, {"postID": "post5826518", "text": "Yeah I feel like the XZ1 may be a better fit for myself. Hoping it's a little cheaper than the premium too. And its not quite and big as the premium etc. I personally don't want a 6 plus inch phone. And like you said maybe the bezels will be a bit better although I don't really mind them that much! I have that new phone bug though right now and waiting sucks! ha", "time": "05-24-2017 10:37 AM", "replies": [{"postID": "post5826613", "text": "The U11 has got my attention on lock for now, but I'm aiming to get a new phone by around October, so Sony stands a big chance.", "time": "05-24-2017 11:45 AM", "replies": []}]}, {"postID": "post5826663", "text": "We'll that decides it for me. I'm pre ordering a sapphire blue U11. It's a waste of time Sony releasing the XZ Premium when the XZ1 has the same if not similar specs.\nAt least the U11 won't be obsolete before it's launched unlike the premium", "time": "05-24-2017 12:36 PM", "replies": []}, {"postID": "post5829013", "text": "I pre ordered my Xz Premium Black today. It should arrive on June 9th.", "time": "05-26-2017 11:37 AM", "replies": [{"postID": "post5830600", "text": "UK Amazon have it for pre-order arriving 1st June!", "time": "05-28-2017 03:48 AM", "replies": []}]}, {"postID": "post5829281", "text": "Probably a dumb question but im going to ask. If I currently have a Samsung S5. Yes I'm always behind, usually buy last year's model, but hell I'm way behind. Would you consider the Xperia Xzs a big upgrade from S5", "time": "05-26-2017 04:08 PM", "replies": [{"postID": "post5830593", "text": "An enormous upgrade... How is this a question?!", "time": "05-28-2017 03:39 AM", "replies": [{"postID": "post5830660", "text": "Haha thanks! That is what I wanted to hear!", "time": "05-28-2017 06:23 AM", "replies": []}]}, {"postID": "post5830911", "text": "Absolutely! I've got an XZ right now and I used to have an S5 [Upgrading soon to an XZ Premium]. The XZ's easily a better phone, but if you can afford the extra hold out for the XZ Premium! It's got more ram [which is actually way more important than how much storage space it has]. Having said that the XZ is a great phone, also I've come to loath that cartoon interface they call \"Touch Wiz\" ☺️", "time": "05-28-2017 11:36 AM", "replies": []}]}, {"postID": "post5830597", "text": "I've ordered the black XZ Premium odd Amazon. The black is actually mostly cos I'm giving my silver XZ to my girlfriend, so I don't really want two really similar looking phones hanging arround ☺️", "time": "05-28-2017 03:43 AM", "replies": []}, {"postID": "post5830810", "text": "Guys I need your help. Still can't decide between this and the U11. Are the huge bezels bothersome in real life?", "time": "05-28-2017 10:04 AM", "replies": []}, {"postID": "post5835213", "text": "Got the XZS in the mail yesterday. Pretty pumped! Have not activated it on AT&T yet, but I have connected to wifi and tested it out. Pretty awesome phone! I'm glad that I was able to give this one a go at a good price and test it out before going to the premium or the next version of the xperias that are supposed to be announced this year. I think that I will be using the XZS for quite some time. By the time I need something new the Premium should cost less ha! Now does anyone know where I can get the american charger? ha I have the international with a adapter and it will suck in the long run! Thanks!", "time": "06-01-2017 07:55 AM", "replies": []}, {"postID": "post5863556", "text": "Android Central is doing their job bury this device, from the missing forum to the negative headlined articles, it shows. There is no forum here so difficult to find out about it, and secondly no local store has it on display so I can't go look at it first.\nBasically I was wondering if anyone is using the G8141 on T-Mobile and if there's any issues or manual setup needed. I'm also wondering if it has a live\\living images feature because that's the best feature ever on the lumia 950. I was looking at the LG G6 premium but somehow my lumia 950 has much better colors when looking at the screen and I'm not sure why.", "time": "06-25-2017 11:14 PM", "replies": []}, {"postID": "post5863734", "text": "Just got mines a few days ago I love it and I did get the htc 11 as well both are great however I'm leaning more on the Sony whatever you do buy from amazon not Best Buy get the international version fingerprint scanner works", "time": "06-26-2017 06:50 AM", "replies": [{"postID": "post5863786", "text": "Please tell us why you prefer the Sony to the HTC as many of us are torn between the two.\nDo the bezels bother you? Thanks.", "time": "06-26-2017 07:51 AM", "replies": []}]}, {"postID": "post5866107", "text": "The HTC button placement is too low for me for some reason I just like how the Sony looks the screen is bananas. The HTC I will give props for its speakers it's LOUD!!!!!! Its purely subjective as for as liking it you won't go wrong with either plus the HTC is a few dollars cheaper than the. Sony. Camera wise I haven't use them yet so I'll haveta to check them out", "time": "06-28-2017 04:13 AM", "replies": []}, {"postID": "post5866421", "text": "Thanks. I really wanna know how the audio quality and loudness is on the Sony, compared with the HTC... let me know when you get the chance. Thanks.", "time": "06-28-2017 09:55 AM", "replies": []}, {"postID": "post5866884", "text": "As I posted I the HTC thread, (I was toying between the U11 and the XZ Premium), I chose Sony and picked the device up today in Luminous Chrome. \nGorgeous, gorgeous phone. \nI get some role don't like the bezels and all, but the phone is just too sexy. \nSome pics. [\nSexy, right? \nWill post some more thoughts and pics as I progress with it. Testing that camera and slo-mo video should be fun too! \nShame there's no XZ Premium thread. Little annoying.", "time": "06-28-2017 05:00 PM", "replies": []}, {"postID": "post5869094", "text": "Great stuff. I suppose the fact that the US gives no hoots about Sony phones means there will be no subforum for this one.\nSad.", "time": "06-30-2017 02:12 PM", "replies": []}, {"postID": "post5869912", "text": "I like it it's a cool phone", "time": "07-01-2017 10:56 AM", "replies": []}, {"postID": "post5917935", "text": "So... Do we have an answer to the initial question ? Why isn't there an XZ Premium forum ?", "time": "08-09-2017 12:11 PM", "replies": [{"postID": "post5918034", "text": "Maybe there just aren't enough people that have this phone to warrant it's own forum?", "time": "08-09-2017 01:31 PM", "replies": [{"postID": "post5919962", "text": "Maybe. \nBut for example when the HTC 11 forum has been created, I'm not sure a lot of people had it. \nI wonder if it was not created before it even came out. \nSame for some other smartphones.", "time": "08-11-2017 12:43 AM", "replies": []}, {"postID": "post5927102", "text": "Yet there is a forum for some random never heard of phones like the LG Joy? What the hell is that anyway?\nATTENTION ANDROID CENTRAL FORUM ADMINISTRATORS: WHY IS THERE NO FORUM FOR THIS FLAGSHIP PHONE FROM A MAJOR ELECTRONICS MANUFACTURER?", "time": "08-17-2017 09:56 PM", "replies": []}]}, {"postID": "post5918344", "text": "Still no answer. They're going to have to add fine print at the bottom of Android Central that says \"Android Central excluding Sony flagships\".\nAnyway I noticed the price dropped $100 but I still haven't been able to see one at a local store so I'll probably wait.", "time": "08-09-2017 05:10 PM", "replies": []}]}, {"postID": "post5926422", "text": "They already have a Nokia 8 forum, but no XZ premium? Odd", "time": "08-17-2017 09:19 AM", "replies": []}, {"postID": "post5927342", "text": "Did anyone send feedback to the link @B. Diddy provided on page 1?", "time": "08-18-2017 05:49 AM", "replies": []}, {"postID": "post5952144", "text": "Similarly, why isn't there a forum for XZ1 and XZ1c?", "time": "09-02-2017 02:24 AM", "replies": []}, {"postID": "post5952475", "text": "lol still no XZP forum...been using it for 3 weeks now.i have questions but wtf do i ask.lol", "time": "09-02-2017 10:03 AM", "replies": [{"postID": "post5952543", "text": "How do you like the Premium?", "time": "09-02-2017 10:53 AM", "replies": []}]}, {"postID": "post5957351", "text": "@Eggmundo - you can find the XZ Premium forum here: https://forums.androidcentral.com/so...ia-xz-premium/\n@B. Diddy @Golfdriver97 Any other forums we should add - please let me know!!\nThanks all!", "time": "09-05-2017 11:12 AM", "replies": []}, {"postID": "post5957364", "text": "Moved this thread to the new XZ Premium forum -- thanks @James Falconer!", "time": "09-05-2017 11:15 AM", "replies": []}, {"postID": "post6026872", "text": "How do you like the XZ Premium. I watched a YouTube review on that phone yesterday as a matter of fact and it's simply amazing. You must be thrilled with it. 4k screen. Man on that video the screen was so sharp and crisp. I thought the overall look of the phone was awesome. The bezels didn't bother me plus they've got to have them for the front facing stereo speakers. Hopefully I'll be able to jump up there and grab one. Today I'm slated to receive my Sony Xperia X Performance in by UPS around 10ish this morning. I can't wait for it although it's not the XZ Premium. Man I want one of those bad. Awesome phone but Xpreria X Performance will have to do right now with the 820 processor in it. I bet that 835 runs so smoothly. I can only imagine.", "time": "10-19-2017 05:19 AM", "replies": [{"postID": "post6033564", "text": "I am using it .India.\nIts balzing fast comapred to SD820", "time": "10-23-2017 03:36 AM", "replies": [{"postID": "post6034042", "text": "Yeah that 835 is top notch. I've used it before in the S8 and it was very fast.", "time": "10-23-2017 10:53 AM", "replies": []}]}]}]}]
