[{"title": "notification lights", "thread": [{"postID": "post6195714", "text": "Why are the lights on the top left of my screen on?\nThey never used to stay on.", "time": "03-19-2018 12:55 PM", "replies": []}, {"postID": "post6195805", "text": "They even stay on when I power down and the phone is turned off.", "time": "03-19-2018 02:11 PM", "replies": []}, {"postID": "post6196275", "text": "Top left? To the left of the earpiece slot? That's the camera flash. \nIf the phone is shut all the way down, there should be no light on anywhere.\nSo far as I know, there is no notification LED on this phone.\nThere is a light to the right of the earpiece slot that will light up when charging and there is not enough power yet to turn on the phone.", "time": "03-19-2018 10:23 PM", "replies": []}, {"postID": "post6196983", "text": "I fixed it. Powered if off last night put on charge over night and it's back to normal this morning.", "time": "03-20-2018 02:08 PM", "replies": []}]}, {"title": "What protection do you use?", "thread": [{"postID": "post6174044", "text": "I've had my Z2 Play for more than a week and, other than the lack of updates, I love it (seriously, 6 months and no Oreo on an near stock Android version?).\nI had a hard but slim case from Anccer but I was afraid of drops so I got a silicone transparent case from Tek. It's kind of cheap though so I was thinking of going with the Spiegen Liquid Crystal. \nWhat do you use? Any suggestion?", "time": "02-27-2018 01:55 PM", "replies": []}, {"postID": "post6174106", "text": "I use that same Anccer case the most, the black with sandy texture, I use the \"bugdroid\" ones when I want color or a little more protection.\nFunny, just read your other post, I've been tempted to try out a Samsung 8+ or Note8 . . Guess maybe you're a \"restless\" phone nerd like me 😉", "time": "02-27-2018 02:56 PM", "replies": [{"postID": "post6174280", "text": "Ha ha I am. I had 4 different devices last year (selling one to buy on not at the same time, I don't have that kind of money ha ha).\nThe Galaxy is an amazing phone as well but I'm more of a stock Android kind of guy. I always end up missing it.\nDid you ever drop the phone with the Anccer case? In didn't really trust it which is why I changed.", "time": "02-27-2018 05:54 PM", "replies": [{"postID": "post6174430", "text": "No I haven't dropped it, I have a feeling it would be done for if I did because this is just a thin case, for me I mainly just use this for grip. So I have the 'bugdroid circuit' case if I feel I might need more protection, but that's about as far as I'll go, just don't like the feel of the more rugged protective cases.", "time": "02-27-2018 10:05 PM", "replies": []}]}]}, {"postID": "post6174375", "text": "I use the Incipio camo shell. It is thick enough to make the camera bump flush. I find it provides better grip than the \"wood\" shells.", "time": "02-27-2018 08:32 PM", "replies": []}, {"postID": "post6174396", "text": "Other than a back plate of some kind (usually a Moto battery Mod), my Z2 Play is naked. The back plate is to protect the camera lens when I place it on a table or desk.", "time": "02-27-2018 08:54 PM", "replies": []}, {"postID": "post6188594", "text": "Similar to your Anccer snap case I have the Sleo snap case for weekend carry and is a great low profile and grippy case. https://www.amazon.com/gp/aw/d/B0725...cUvbUpU6188594\nI have a Speck Presidio for work days and it's quite grippy. It seems to provide good protection, tho the camera is close to the outside of the case. \nI also have an Otterbox Commuter for days that require even more protection, but is has a smooth back and is a bit hard to hold on to. I have a GadgetShieldz for a different phone (Z Force I think) that I will add to the back of the Commuter, in hopes of adding grip.\nETA: got the Gadgetshieldz camera and body protectors. I'm not impressed. The sandstone finish seems just as slippery as the Commuter case and the camera protector does not have precise cuts. I reckon they are cheap for a reason. \nI have tried this camera protector, but they did not stay applied and are plastic, not glass. https://www.amazon.com/gp/aw/d/B074F...cUvbUpU6188594\nI have GadgetShieldz camera films for both phones on their way, also.\nI tried this case, before better cases were available and returned. It is cheap and not grippy.https://www.amazon.com/gp/aw/d/B071Z...cUvbUpU6188594", "time": "03-13-2018 12:00 AM", "replies": []}, {"postID": "post6196598", "text": "Sorry, but every time I see this title pop up my mind goes in a different direction . . just had to confess that 😉", "time": "03-20-2018 08:50 AM", "replies": []}]}, {"title": "Z2 Play vs. Droid Turbo 2?", "thread": [{"postID": "post5967676", "text": "Has anyone moved to the Verizon Moto Z2 Play (not Force) from the 2015 Verizon DT2? Curious to hear comparisons on battery and camera, in particular.\nI'm considering making this move, frustrated with my on 6 month old DT2 now extremely short battery, sudden shutdowns at 30-40%, lag and sluggishness (all this even after a factory reset a few weeks back).", "time": "09-10-2017 03:08 PM", "replies": []}, {"postID": "post5967813", "text": "Go for it!", "time": "09-10-2017 04:57 PM", "replies": []}, {"postID": "post5970605", "text": "Decided to wait a few weeks for Moto X4, for dual lens camera, IP68 water resistance, and low light selfie camera.", "time": "09-12-2017 01:04 PM", "replies": []}, {"postID": "post5971786", "text": "Moto X4 looks pretty sweet! If mods are not a big factor I would say that the X4 will be tough to beat.", "time": "09-12-2017 11:41 PM", "replies": []}, {"postID": "post6194778", "text": "I'm looking to do the same thing, move from Droid Turbo 2 to Z2 Play. Any other thoughts?", "time": "03-17-2018 05:44 PM", "replies": []}, {"postID": "post6194975", "text": "After making this original post last fall, I actually went with Z2 Force last October, after all, due to a great promotional price available at US retailer Best Buy that got its price down to under US$450, plus free projector mod that I immediately sold on eBay for over $100.\nAnd I'm so glad I did, Z2 Force is the fastest and easiest smartphone I've ever owned. I wrote a long post on the Z2 Force forum here a few weeks back, with details of what I love and why I feel it's an underrated and misunderstood product. \nThat said, I can't comment on how Z2 Force compares to Z2 Play, but I would guess it is a lot faster due to the Snapdragon 835. I also really appreciate the the shatterproofing, have had several drop incidents that surely would have cracked any glass screen.", "time": "03-17-2018 08:42 PM", "replies": []}, {"postID": "post6196103", "text": "Thank you for this post! I am using a Droid Turbo 1 and just purchased the Z2 Play. I will be getting it on Tuesday. I'm just glad to see other Droid Turbo users going for the same phone I was thinking of getting.", "time": "03-19-2018 07:40 PM", "replies": []}]}, {"title": "NDSS26.118-23-19-3 (Verizon), Feb 2018 Security Patch", "thread": [{"postID": "post6175234", "text": "Updated 2/28.http://forums.androidcentral.com/e?l...token=-IfPUzSO", "time": "02-28-2018 06:13 PM", "replies": []}, {"postID": "post6175646", "text": "They're on a roll now. After November, I was starting to think they forgot about us. Now we're 2 for 2 for 2018.", "time": "03-01-2018 07:15 AM", "replies": [{"postID": "post6177840", "text": "Which country and service provider?", "time": "03-03-2018 11:04 AM", "replies": [{"postID": "post6178940", "text": "Verizon . . Northeast USA", "time": "03-04-2018 03:51 PM", "replies": [{"postID": "post6179656", "text": "I reckon it would help if I read the WHOLE thread title!\nI'm such an *****! 😱\nThanks, for your reply to a fool!", "time": "03-05-2018 10:15 AM", "replies": []}]}]}]}, {"postID": "post6176748", "text": "Yay, was hoping it was Oreo when I was first notified but I'll take it 👍", "time": "03-02-2018 09:35 AM", "replies": [{"postID": "post6177840", "text": "Which country and service provider?", "time": "03-03-2018 11:04 AM", "replies": [{"postID": "post6178940", "text": "Verizon . . Northeast USA", "time": "03-04-2018 03:51 PM", "replies": [{"postID": "post6179656", "text": "I reckon it would help if I read the WHOLE thread title!\nI'm such an *****! 😱\nThanks, for your reply to a fool!", "time": "03-05-2018 10:15 AM", "replies": []}]}]}]}, {"postID": "post6191280", "text": "I can call myself a fool, but not an *****?\nAnyways, I fired up my VZW Z2 Play (backup phone), today and received an update, but it's only NDSS26.118.23.19-1, not -3.\ngo figure", "time": "03-14-2018 10:13 PM", "replies": []}]}, {"title": "Moto mods", "thread": [{"postID": "post6190566", "text": "Whether Moto mod 360 video camera support z2 play?", "time": "03-14-2018 11:47 AM", "replies": [{"postID": "post6190678", "text": "yes", "time": "03-14-2018 12:58 PM", "replies": []}]}, {"postID": "post6190598", "text": "To the best of my knowledge, all official Moto Mods will work on all Moto Z phones. Moto has announced a few times that all Moto Mods made for the first three years of phones will be compatible with the first 3 Moto Z line of phones.", "time": "03-14-2018 12:02 PM", "replies": []}, {"postID": "post6191205", "text": "thanks", "time": "03-14-2018 09:00 PM", "replies": []}]}, {"title": "Who's using 1 button navigation?", "thread": [{"postID": "post6188304", "text": "As I'm going on 3 months with my MZ2P, I decided to stop using 1 button navigation. When I try to go back, and I accidentally get out of the app all together, I decided it was time to stop using it. I like the extra real estate I get by using it, but am just frustrated. Who likes it?", "time": "03-12-2018 06:52 PM", "replies": [{"postID": "post6188951", "text": "I used to, for the same reason. A bit more screen real estate. I stopped using it because it was interfering with using the fingerprint reader for application unlocks, and the nav function was kinda glitchy on its own.", "time": "03-13-2018 09:03 AM", "replies": []}]}, {"postID": "post6188589", "text": "I've been using it for about 3 months.\nI experience the unintentional HOME issue, too.\nIt seems that if I swipe left, to go back, using a slightly arched or curved swipe, bottom right corner, up to middle, down to bottom left corner, it seems to happen less.\nI am still using and preferring One Button Nav.", "time": "03-12-2018 11:55 PM", "replies": []}, {"postID": "post6188659", "text": "I happen to be in the seemingly minority who actually finds the one button navigation intuitive, but only after \"forcing\" myself to get used to it in a few days.", "time": "03-13-2018 02:03 AM", "replies": []}, {"postID": "post6188768", "text": "I loved it even if I too was always ending up on my home screen, I thought muscle memory would do the job eventually but it never did. It's a shame because it's a great way to prevent burn ins as well. There was a learning curve when the phone was in landscape mode and I tried to go back.", "time": "03-13-2018 05:22 AM", "replies": []}, {"postID": "post6190557", "text": "I just got my Z2P a little over a month ago and set up the 1 button nav and overall I still like it even though I get annoyed once in a while with going home. At this point I think I will still keep it as I feel like I am getting better at using it.", "time": "03-14-2018 11:39 AM", "replies": []}]}, {"title": "Oreo update", "thread": [{"postID": "post6176829", "text": "When I will get Oreo update for my z2 play?", "time": "03-02-2018 10:44 AM", "replies": [{"postID": "post6177042", "text": "They usually don't announce the date.", "time": "03-02-2018 01:49 PM", "replies": []}]}, {"postID": "post6176855", "text": "We don't really know for sure. We're all waiting with bated breath. What carrier do you have?", "time": "03-02-2018 11:05 AM", "replies": []}, {"postID": "post6179811", "text": "I don't know of a date - hopefully you guys get it soon!", "time": "03-05-2018 12:39 PM", "replies": []}, {"postID": "post6182745", "text": "The Oreo update got an official release announcement in Brazil in the last days (there's no dates mentionnent but they do mention that it includes the March security update).https://motorola-global-portal-pt.cu...il/a_id/126823\nI think we're stating to see the light guys!", "time": "03-08-2018 05:51 AM", "replies": []}, {"postID": "post6183302", "text": "Oh no, does this mean no Oreo update? \nMotorola layoffs rumored.https://9to5google.com/2018/03/08/ru...ayoffs-moto-z/", "time": "03-08-2018 02:29 PM", "replies": []}, {"postID": "post6183504", "text": "Sweet merciful crap!", "time": "03-08-2018 05:57 PM", "replies": []}, {"postID": "post6184162", "text": "I did a bit of research and it should affect the line only after the Z3... so let's hope we're not getting abandoned", "time": "03-09-2018 09:45 AM", "replies": []}, {"postID": "post6184703", "text": "According to Engadget, a spokesperson for Lenovo said that the rumors are inaccurate, that it's not 50% of their work force and that the Moto Z line isn't going anywhere.https://www.engadget.com/amp/2018/03...live-and-well/", "time": "03-09-2018 07:13 PM", "replies": []}]}, {"title": "Random Reboots?", "thread": [{"postID": "post6174042", "text": "Has anybody been experiencing random reboots on their Z2Play recently? I don't see any posts about it so I just thought I'd ask. I've had several in the last couple weeks . . .", "time": "02-27-2018 01:54 PM", "replies": []}, {"postID": "post6174254", "text": "try to fully drain your battery then recharge it to 100%.", "time": "02-27-2018 05:26 PM", "replies": []}, {"postID": "post6174390", "text": "Not since I stopped carrying it with the right side down in a horizontal holster...", "time": "02-27-2018 08:50 PM", "replies": []}, {"postID": "post6174452", "text": "No and I've been rooted for a few months and running Xposed and Gravity Box, for a couple months.\nNary a reboot.", "time": "02-27-2018 10:55 PM", "replies": []}, {"postID": "post6179812", "text": "Does this happen in Safe Mode? Perhaps an app is causing these random reboots.", "time": "03-05-2018 12:40 PM", "replies": []}]}, {"title": "Oreo update", "thread": [{"postID": "post6176812", "text": "When I will get Oreo update for my Moto z2 play in india.?", "time": "03-02-2018 10:35 AM", "replies": [{"postID": "post6177290", "text": "We don't have it in Ametica yet either.", "time": "03-02-2018 05:51 PM", "replies": []}]}]}, {"title": "Can I use my Moto at home to send and accept text messages over wi-fi?", "thread": [{"postID": "post6171898", "text": "I have a Moto phone which I use as a mini tablet. I do not wish to subscribe to a cell network, but I would like to be able to send and recieve text messages with it using my internet service. Is this possible?", "time": "02-25-2018 01:48 PM", "replies": [{"postID": "post6174290", "text": "How do you intend to get a phone number for SMS/MMS?", "time": "02-27-2018 06:17 PM", "replies": []}]}, {"postID": "post6172086", "text": "You'd have to use something like Google Voice. There are apps/services on the Play Store that claim to give free SMS ability to devices that aren't connected to a cellular network, but I'm always a little leery about them.\nIf you have another cellphone that does have a SIM, you could also try Pushbullet.", "time": "02-25-2018 05:42 PM", "replies": []}, {"postID": "post6172690", "text": "There are many services that provide text-like functionality, including Facebook Messenger.\nIf you do have cell service on any device, does the provider have a messaging app that is not cellular-dependent? For example, Verizon has their own \"Message+\" app that synchronizes txt messages even with devices that are not cellular (IE, Win10) and may be available for your situation as well.", "time": "02-26-2018 09:52 AM", "replies": []}, {"postID": "post6173967", "text": "Also, if you use Verizon, you can sign into the message+ app and access your cell phones text messages over wifi.", "time": "02-27-2018 12:42 PM", "replies": []}]}, {"title": "Would you recommend a Moto Z2 Play? Are you satisfied?", "thread": [{"postID": "post6161814", "text": "I'm getting bored of my S8. I wanted to get a Moto Z2 Play when it came out but they hadn't received them yet and I needed a phone. But I've always preferred Moto devices over Samsung's flagships.\nI found one for a great price. Would you recommend it getting one?", "time": "02-13-2018 01:31 PM", "replies": [{"postID": "post6161831", "text": "Is camera important to you?", "time": "02-13-2018 01:55 PM", "replies": [{"postID": "post6161855", "text": "Not that much honestly. I had a Moto X Play before that wasn't the best camera but it always did the job for me. Let's just say I skip the parts about cameras in phone reviews", "time": "02-13-2018 02:37 PM", "replies": []}]}]}, {"postID": "post6161920", "text": "I like mine. No problems what so ever.", "time": "02-13-2018 04:20 PM", "replies": []}, {"postID": "post6162143", "text": "I went from a Moto Z to the Z2 Play last month and I will say it's a better phone, better battery, capable camera and snappy processor. I'm a fan.", "time": "02-13-2018 11:34 PM", "replies": [{"postID": "post6162261", "text": "Just curious, why did you say better battery, considering Z Play has the bigger battery capacity.", "time": "02-14-2018 04:13 AM", "replies": [{"postID": "post6162939", "text": "I should have said better battery life, because I get about twice the charge on the Z2 Play than I did before.", "time": "02-14-2018 11:58 PM", "replies": []}]}]}, {"postID": "post6162235", "text": "don't like camera quality of Moto z2 play", "time": "02-14-2018 02:21 AM", "replies": []}, {"postID": "post6162494", "text": "I'm having some strange bluetooth issues with my car's 3rd party head unit (JVC), and interference with the subwoofer on my TV's sound bar (LG).", "time": "02-14-2018 11:27 AM", "replies": []}, {"postID": "post6162733", "text": "Yes, I highly recommend the Z2 Play! My last DD was a Moto X Pure Edition 2015, tho there was a couple months I test drive a Nexus 6P (Didn't like. Missed moto actions).\nThe Z2 Play is awesome! I'm loving it! WAY better battery life than the X Pure, with same daily use /charge cycle. At the end of the day I consistently have 50% or better. The X Pure would be around 20% or even need a charge in the evening to make it to bed time. Some nights, with the Z2 Play, I don't even charge it, while I sleep and only lose 4% from 2200 to 0500.\nIt's super thin and much lighter than the X Pure, even with a case.\nIt takes good enough pics, for me.\nI was able to root it and get rid of all the white backgrounds with Substratum and Spectrum theme. Add Xposed and Gravity Box for battery bar and lock screen short cuts. Install Dolby Atmos for awesome Bluetooth streaming audio.\nFYI, there is no longer a custom launch phase available in moto voice, but Google assistant is SUPPOSED to be allowing a custom launch phase in the \"near future\".", "time": "02-14-2018 06:36 PM", "replies": []}, {"postID": "post6162778", "text": "I asked this in another thread but should have done so here.\nWhen I had a Moto X Play there was a very annoying glitch whenever a sound played or when I would swipe to the next or previous song in Google Play Music. It was mostly heard through the earphones although the problem would occur with any kind of earphones as well as using my aux port in my car.\nDoes the Z2 Play have this glitch?", "time": "02-14-2018 07:03 PM", "replies": [{"postID": "post6163271", "text": "I do not recall experiencing that with the X Pure and have not experienced that in the Z2 Play, but I'm not certain that I have used the phone in that condition (for lack of a better word).", "time": "02-15-2018 09:56 AM", "replies": []}]}, {"postID": "post6163326", "text": "This is the first I've ever heard someone claim better battery life on the Z2 vs the Z, with all other things being equal.", "time": "02-15-2018 11:26 AM", "replies": [{"postID": "post6163564", "text": "Maybe my old one had a flaw. I just know that I noticed a substantial difference for the better going to the Z2 Play.", "time": "02-15-2018 03:54 PM", "replies": []}]}, {"postID": "post6163343", "text": "Thanks everyone for your help! The S8 has been sold and my Moto Z2 Play will be arriving tomorrow! I'm really looking forward to get it.", "time": "02-15-2018 11:48 AM", "replies": []}, {"postID": "post6166187", "text": "Better battery? I have both and Z2 battery life falls short exactly by the percentage of the capacity loss - 15%. \nOther than battery life, it does feel a bit better in other areas.", "time": "02-19-2018 12:47 AM", "replies": []}, {"postID": "post6166267", "text": "the thing with Z2 Play's thinness and the resultant smaller battery capacity is that while it loses to its predecessor in terms of battery life, it gains in flexibility in being able to trade slimness for battery life by attaching any of the battery mods, whereas I cannot imagine using the battery mod on the Z Play due to it being rather thick and chunky feeling already without the mod.", "time": "02-19-2018 03:18 AM", "replies": []}, {"postID": "post6166817", "text": "So I've had the device for 2 days now. It's good to be back into the near stock Android world!\nI have to get used to the lesser PPI though. Coming from a Pixel, then an S8 I lost the habit of lower resolutions so the screen almost looks blurry at times. But I'll get used to it again.\nThanks everyone for your recommendations. I love this device. It's so thin and, given it's metal, I put a case on it to protect the camera and the screen but contrarely to my S8 I don't have the impression that I'm holding some fragile piece of glass anymore!", "time": "02-19-2018 04:57 PM", "replies": []}, {"postID": "post6167329", "text": "I have a Z2 Play- it's a great phone, and stock Android is very nice. However, the camera isn't even close to your old Pixel or S8. You must not take many pics.", "time": "02-20-2018 09:10 AM", "replies": [{"postID": "post6168178", "text": "No I never cared that much for the camera. That's the part I skip in every phone review, I can't be bothered. Does it capture an image? Is it good? Fine that's perfect for me. The pictures I took with my Z2 Play were not as good indeed. But they do the job.", "time": "02-21-2018 05:41 AM", "replies": []}]}, {"postID": "post6168827", "text": "while the Z2 Play's camera isn't going to beat the Pixels or the S8s of the smartphone world, it is actually very capable and I would rank it amongst the top, at least in the mid range smartphone world.", "time": "02-21-2018 07:25 PM", "replies": []}, {"postID": "post6168833", "text": "Not a fan of Moto but I I have a friend who delights in watching movies on his ceiling as it lies in bed. My Note 8 doesn't do that.", "time": "02-21-2018 07:36 PM", "replies": []}]}, {"title": "Deal: Best Buy Verizon Moto Z2 Play ($2.99/mo or $9.99/mo)", "thread": [{"postID": "post6167733", "text": "http://forums.androidcentral.com/e?l...token=4GV7Kew3\nI believe this pricing is through Saturday 2/24.\nBest Buy has the Motorola Moto Z2 Play for Verizon for either$2.99/month for new lines ($9.99/month and a $7/month bill credit for 24 months).$9.99/month for upgrades", "time": "02-20-2018 04:13 PM", "replies": []}]}, {"title": "WiFi Constantly Disconnecting and Reconnecting", "thread": [{"postID": "post6164117", "text": "Hello Android Central Community! I was wondering if you could help me with a problem I've been having on my Moto Z2 Play. As the subject states, my wifi has been disconnecting and reconnecting from my home network for no apparent reason. This happens when the device is turned off (screen off) and while I'm using it. I do not have it set to turn WiFi off when on sleep. Thanks in advance!", "time": "02-16-2018 08:25 AM", "replies": []}, {"postID": "post6164219", "text": "Does this happen on other wi-fi networks, or only your home network? If it's only at home, try rebooting your router by unplugging its power for 10 seconds. See this guide for other tips: http://forums.androidcentral.com/amb...-problems.html", "time": "02-16-2018 10:31 AM", "replies": []}, {"postID": "post6164247", "text": "It's other WiFi networks as well, I stated that it was my home network, because, well because I think it was better to include more information than less.", "time": "02-16-2018 11:01 AM", "replies": []}, {"postID": "post6164251", "text": "Does this also happen in Safe Mode? https://motorola-global-en-uk.custhe...e-moto-z2-play. If not, then something you installed is probably interfering -- but the tedious part would be to uninstall apps one by one until the problem goes away, since there's no good way to pinpoint it further.", "time": "02-16-2018 11:06 AM", "replies": []}, {"postID": "post6164277", "text": "I'll try it out and get back you as soon as I can. I'm not home or near any WiFi connection so I'll update you when I am.", "time": "02-16-2018 11:27 AM", "replies": []}, {"postID": "post6164494", "text": "Just tried it, sadly the problem still persists. Sometimes the WiFi will disconnect after I wake the device back up, and it sometimes even happens when I'm using the device.", "time": "02-16-2018 05:03 PM", "replies": []}, {"postID": "post6164501", "text": "Ok, that narrows it down to a firmware issue or a hardware issue. Bluetooth can sometimes interfere with 2.4 GHz wi-fi, so see what happens if you turn off Bluetooth for a while.", "time": "02-16-2018 05:10 PM", "replies": []}, {"postID": "post6164540", "text": "I usually have Bluetooth off, I'll turn it on occasionally for my Bluetooth speaker, but most of the time it's off. I will note however, that I have an Asus router that uses some kind of smart technology to determine what network to put each device on 2.4 or 5 GHz.", "time": "02-16-2018 06:36 PM", "replies": [{"postID": "post6165524", "text": "https://www.asus.com/us/Networking/RTAC3200/\nThis is the beast I have. I did have to disable the \"smart switching\". What it does, is when the signal gets below a certain threshold, it drops it off that network so it can be forced to another band. On paper this sounds awesome. In practice, it left many devices around my house sitting right on the edge, and constantly looking to switch. Making it seem like they're \"disconnecting\" from the wifi. Well... they actually are... \nExcept for the more powerful network cards on my desktop and laptop computers, just about every phone would randomly disconnect for what seemed like no reason at all.", "time": "02-18-2018 03:16 AM", "replies": []}]}, {"postID": "post6164761", "text": "Hmm, that's interesting about the router. Is there a way to turn off that feature, so that it works like a more conventional router? Also, is its firmware up to date?", "time": "02-17-2018 02:35 AM", "replies": []}, {"postID": "post6164877", "text": "The firmware is up to date but I'm not sure if you can turn that feature off. I have the model here... https://www.amazon.com/Tri-band-AiPr...cUvbUpU6164877", "time": "02-17-2018 08:17 AM", "replies": [{"postID": "post6164884", "text": "If you read the reviews you can see that a lot of people turned that feature off and got better performance as a result. It is a $400 router, you can turn the smart technology feature off and configure it the way you want to.", "time": "02-17-2018 08:34 AM", "replies": [{"postID": "post6165071", "text": "Steps to turn off Smart Connect are on pg 105 of the manual: http://dlcdnet.asus.com/pub/ASUS/wir...al_English.pdf", "time": "02-17-2018 01:10 PM", "replies": []}]}]}, {"postID": "post6164951", "text": "Not sure how I missed that. Thank you so much, I'll be sure to try that!", "time": "02-17-2018 10:27 AM", "replies": []}, {"postID": "post6165055", "text": "Have you tried turning off wifi scanning?\nIt seems that both wifi scanning and Bluetooth scanning only cause issues.\nI always turn both off. When I get a new phone and forget to turn these off and issue pops up and upon googling it, find a reminder to turn them off. It virtually always fixes the issue.\nThese settings are difficult to locate.\nThe easiest way to find them is to go to the phone's main settings menu and type \"scanning\" in the search bar.", "time": "02-17-2018 12:52 PM", "replies": []}]}, {"title": "How do I keep content hidden from all apps on my lock screen", "thread": [{"postID": "post6160702", "text": "When I had a notification on my lock screen the content would be hidden it would say hidden content I don't know where it came from but now it's gone and I would like to have it back", "time": "02-12-2018 03:52 AM", "replies": [{"postID": "post6165064", "text": "Did you find the setting, suggested by chan?\nDid it solve the issue?", "time": "02-17-2018 12:57 PM", "replies": []}]}, {"postID": "post6160705", "text": "Try checking under settings>lockscreen>notifications>do not show content", "time": "02-12-2018 04:00 AM", "replies": []}]}, {"title": "VOLTE suddenly stopped working on Moto Z2 Play", "thread": [{"postID": "post6148808", "text": "Everything was working fine untill a few days back when I suddenly lost VoLTE network on my SIM 1 and every time I make a call, I get a call failed error. LTE is working fine. I just cannot seem to make calls. \nThis happened after I updated my phone to the latest security patch. \nI tried clearing cache partition, rebooting the phone etc. Nothing worked so far.\nKindly help. I am not able to make to any calls", "time": "01-29-2018 12:49 PM", "replies": []}, {"postID": "post6149321", "text": "Is the phone carrier-branded, or did you get it unlocked? If it's carrier-branded, are you using it on the original carrier's network, or a different one?", "time": "01-29-2018 11:05 PM", "replies": []}, {"postID": "post6149773", "text": "It was already unlocked. And was working fine until the latest monthly update. . Could the update have caused the issue?", "time": "01-30-2018 12:10 PM", "replies": []}, {"postID": "post6149808", "text": "It could be due to the update. Can you make calls if you turn off VoLTE, or does you carrier depend on VoLTE for calls?", "time": "01-30-2018 12:29 PM", "replies": []}, {"postID": "post6150338", "text": "Depends on VoLTE for call. Cannot make any calls without it.", "time": "01-31-2018 12:32 AM", "replies": []}, {"postID": "post6150627", "text": "Hard to say if there was a glitch during the update, or if the glitch is part of the update itself. I can't find an easy way to reinstall the firmware (it looks like Motorola Device Manager only allows you to update, not to reinstall the firmware). It's worth contacting Lenovo about your issue: https://mobilesupport.lenovo.com/us/en/contactus", "time": "01-31-2018 10:02 AM", "replies": []}, {"postID": "post6151179", "text": "which model Z2 Play and what carrier are you on?", "time": "01-31-2018 09:54 PM", "replies": []}, {"postID": "post6151858", "text": "You could try a factory data reset.", "time": "02-01-2018 04:24 PM", "replies": []}, {"postID": "post6156960", "text": "I believe I've had this issue.\nVoLTE allows a phone conversation and using data, simultaneously, correct?\nMost days, in the way home from work, I call the wife and have Waze running. Some, but not all days, Waze loses data and the LTE label, for the service icon is gone.\nIf I cycle airplane mode, I can call back and have data, simultaneously. I do not know the cause. \nThis is a US Unlocked Z2 Play with Verizon service.", "time": "02-07-2018 02:42 PM", "replies": []}, {"postID": "post6164818", "text": "Hi I'm facing the same problem since last month...My Z2 play does not showing voLTE on roaming only , what should I do, please tell me..... I'm also reset my phone 2 times but nothing happened.......", "time": "02-17-2018 06:02 AM", "replies": [{"postID": "post6165061", "text": "I'm on Verizon. The only time I've seen VoLTE displayed on the call screen was when in a conversation with another Verizon user on their VoLTE compatible phone.\nI don't think it crosses to let service providers.\nPlease, someone correct me, if this is not accurate.", "time": "02-17-2018 12:56 PM", "replies": []}]}]}, {"title": "Ringtone Repeating Before it Actually Ends", "thread": [{"postID": "post6164122", "text": "Hello Again! I was wondering if anybody had any insight on what I could do about my ringtone and if anybody else had this problem. I downloaded it from Zedge and I've tried another app like it, I just don't remember the name. But basically, my problem is that my ringtone cuts out after about 6-7 seconds and then repeats those 6-7 seconds, even if the actual ringtone is more like 30 seconds, which mine is. Thanks in advance!", "time": "02-16-2018 08:31 AM", "replies": []}, {"postID": "post6164214", "text": "It's probably related to those ringtone apps. You don't need a fancy app to make a custom tone. If you wanted to, you could select a full mp3 as your ringtone -- just copy the file to your /Ringtones directory (using a file manager app). If you want to edit it down a little, though, you could use a basic ringtone editor like Ringdroid.", "time": "02-16-2018 10:30 AM", "replies": []}, {"postID": "post6164244", "text": "Thanks for the quick reply, I'll be sure to try that out! The only reason I was using Zedge was because I wanted a specific ringtone that I wasn't able to find elsewhere.", "time": "02-16-2018 10:59 AM", "replies": []}, {"postID": "post6164261", "text": "With Zedge, you probably don't need the app to access their ringtones. On your computer, go to zedge.net and search for the ringtone. You can download ringtones directly from their site, and then copy the file over to your phone.", "time": "02-16-2018 11:11 AM", "replies": []}, {"postID": "post6164272", "text": "Ok, so downloading from my computer and then copying over to my phone should allow the whole ringtone to play out? If that's the case, what do you think is the problem with downloading directly from the app? Again, thank you.", "time": "02-16-2018 11:25 AM", "replies": []}, {"postID": "post6164301", "text": "I've never tried it, but I think any mp3 file will play out completely for as long as the phone will ring (which, assuming you have voicemail set up, still shouldn't last for more than about 10 seconds or so). The problem you were facing is likely an issue with that particular ringtone app -- you could try emailing the app developer to see if they're aware of the issue.", "time": "02-16-2018 12:04 PM", "replies": []}]}, {"title": "NDSS26.118-23-19-1 (Verizon), Dec 2017, KRACK Security Patch", "thread": [{"postID": "post6158017", "text": "http://forums.androidcentral.com/e?l...token=JfAbawXv\nSoftware Version: NDSS26.118-23-19-1\nAndroid® Security Patch Level: 2017-12-01, including Krack security patch", "time": "02-08-2018 04:58 PM", "replies": []}, {"postID": "post6160762", "text": "Since the update my screen has been freezing up on me.", "time": "02-12-2018 07:18 AM", "replies": []}, {"postID": "post6160787", "text": "No problems at all here since the update.", "time": "02-12-2018 07:55 AM", "replies": []}, {"postID": "post6161434", "text": "No issues for me also.", "time": "02-13-2018 01:34 AM", "replies": []}, {"postID": "post6162144", "text": "I haven't noticed any issues in the last few days.", "time": "02-13-2018 11:35 PM", "replies": []}, {"postID": "post6162854", "text": "The problem appears to be with the moto app launcher now that the Google now launcher no longer works.", "time": "02-14-2018 08:54 PM", "replies": []}, {"postID": "post6163699", "text": "Any ideas anyone?", "time": "02-15-2018 06:35 PM", "replies": []}, {"postID": "post6164103", "text": "When I reset app preferences, problem seems to have resolved.", "time": "02-16-2018 08:06 AM", "replies": []}]}, {"title": "Audio glitch on the Z2 Play?", "thread": [{"postID": "post6162526", "text": "When I had a Moto X Play there was a very annoying glitch whenever a sound played or when I would swipe to the next or previous song in Google Play Music. It was mostly heard through the earphones although the problem would occur with any kind of earphones as well as using my aux port in my car.\nDoes the Z2 Play have this glitch?", "time": "02-14-2018 12:10 PM", "replies": []}, {"postID": "post6163086", "text": "Mine doesn't", "time": "02-15-2018 05:38 AM", "replies": []}]}, {"title": "Cortana as my personal assistant", "thread": [{"postID": "post6161347", "text": "How to setup Cortana as my personal assistant through Microsoft launcher?", "time": "02-12-2018 08:56 PM", "replies": []}]}, {"title": "Moto Mods", "thread": [{"postID": "post6156285", "text": "If I could buy any one Moto Mod, what would you recommend? I was considering the battery pack because it should more than double my phone's on-screen time. But, I was also interested in the Moto Gamepad, I liked the idea of it being a \"mini\" Switch in a sense.", "time": "02-06-2018 07:23 PM", "replies": []}, {"postID": "post6156322", "text": "any if the battery packs as a starter mod.", "time": "02-06-2018 08:13 PM", "replies": []}, {"postID": "post6156675", "text": "Ok, thanks, that's what I was originally thinking because I also liked the idea of keeping the phone battery hovering around 80%. That would help the overall life span of the phone and I saw it was on sale for $60 right now as well.", "time": "02-07-2018 08:46 AM", "replies": []}, {"postID": "post6156683", "text": "I have the Tumi 2200mah with wireless charging mounted in my car as a sort of \"car dock+ charger\", and keep the TurboPower 3490mah on my phone most of the rest of the time. With heavy usage it makes it a good two solid days, and being able to charge both the phone and the mod at the same time (on different chargers) means that I could be ready for another two days in less than 2 hours. I HIGHLY recommend a battery mod. \nI also picked up the gamepad mod when it was \"buy a mod, get the projector free\" sale at Verizon. It's nice for some games, but not everything plays perfectly well with it. It's well built and is MUCH more responsive than even the xbox controller paired via bluetooth. \nThe projector, well, it's pretty cool, even at only 480p. It'll get much more use when it gets warm out and I can do movie nights in the yard with the kids!", "time": "02-07-2018 09:02 AM", "replies": []}, {"postID": "post6156687", "text": "Thanks for your quick reply! I was leaning towards the battery mod initially, but now I think I'm just going to go for it, the battery mod that is. Being able to get 2 days off one charge would be amazing! I also love the idea of keeping that battery charged at 80% to help the lengthen the phone's life span. I've been watching the Moto Gamepad and I think I'll just wait until it goes on sale. Thanks again for your input, it is greatly appreciated!", "time": "02-07-2018 09:10 AM", "replies": [{"postID": "post6158662", "text": "At first I was like you thinking that keeping the internal battery at 80% would be optimum for the battery, but as it turned out it degraded my battery. My internal battery after 1+ years depletes rapidly (when not attached to the battery mod). And there is MUCH discussion here on the forums with others who have found the same thing.\nI'd recommend using the battery mod like you plan to, but set it to off (new mod update setting) until you get down to 50 or 40% and then turn it on and let the battery mod do it's thing taking it back to 80% with efficiency mode. I think that way you will extend the life of your internal.\nIt's a shame they haven't implemented a way to do that automatically with the battery mod software, but hopefully in the future they will let you set the actual percentage you want the battery mod to kick in in addition to the 2 modes they currently have.", "time": "02-09-2018 11:54 AM", "replies": [{"postID": "post6160560", "text": "Which phone are you describing?", "time": "02-11-2018 10:20 PM", "replies": [{"postID": "post6160641", "text": "Moto Z Droid", "time": "02-12-2018 01:11 AM", "replies": []}]}]}]}, {"postID": "post6157822", "text": "I have a Moto battery pack, it does basically double my Z2's time before charging is required, and I have one of the smaller battery mods. I also have the SoundBoost 2 and a plain back. The only reason I got the plain back is only so I put the phone down on a table and not risk damaging the camera lens or housing. I want the TrueZoom camera, but I can't afford the almost $300 it costs. IMO, the projector is useless.\nAs to the question as stated, which ONE mod to get? Only you can answer that. What are you looking for on your ONE mod? So far as I'm aware, only the battery mod will actually power the phone (forex, the Soundboost's battery only powers the mod).", "time": "02-08-2018 12:33 PM", "replies": []}, {"postID": "post6157927", "text": "Ok, do you use efficiency mode on your Moto TurboPower pack? If you do, how does it help the lifespan of the phone's battery? I wanted to make this phone last as long as possible and I was wondering if the power pack could help me with that.", "time": "02-08-2018 02:41 PM", "replies": [{"postID": "post6158205", "text": "Nope, I have it in Default Mode. Mine's the Power Pack, not the TurboPower pack. I got the smaller one. \nOn light usage, the PowerPack runs out of juice not long before I head to bed. On heavy usage, it'll run out around dinner time. Note that even on \"light usage\" on a work day, I have a power drain due to crappy signal strength in my office causing the phone to ramp up power to the radio to try to hold onto an LTE signal, failing and then even at times failing to hold onto a basic data capable connection. \nI get better battery life when at home and otherwise the same usage.", "time": "02-08-2018 09:08 PM", "replies": []}]}, {"postID": "post6158475", "text": "Much appreciated, and again, thank you very much. Battery mod it is!", "time": "02-09-2018 06:31 AM", "replies": []}, {"postID": "post6158791", "text": "Wow, that's a surprise! Thanks for letting me know! Hope they fix that soon.", "time": "02-09-2018 02:30 PM", "replies": []}, {"postID": "post6160559", "text": "Double double \\_0_/", "time": "02-11-2018 10:19 PM", "replies": []}]}, {"title": "Why did my Moto z2 play just randomly restart without me doing anything?", "thread": [{"postID": "post6144990", "text": "My Moto z2 play just randomly restarted while I was using the moto FM radio app. I didn't tap on anything and it was in the middle of scanning for stations. Suddenly, it disconnected from my JBL smart speaker, and the shutting down sequence initiated. It rebooted and asked for a pin to run android... I put in my lock screen pin and the phone rebooted. It seemed suspicious, so I used my Verizon security app to scan my phone, and it said everything was fine. I haven't owned this phone for even a year, and would like to know why this happened.", "time": "01-24-2018 05:28 PM", "replies": []}, {"postID": "post6145221", "text": "Welcome to Android Central! Random reboots happen every now and then, even when everything is working correctly. If it happens once, that's not too worrisome. If it starts happening more frequently, then it could be due to a number of things, including an app you installed that's causing instability, firmware corruption, or a hardware fault.", "time": "01-24-2018 11:41 PM", "replies": []}, {"postID": "post6156655", "text": "It's probably happened to me 10 times in the 6+ months I've had the phone. It was only inconvenient one of those ~10 times. \nI have a question for you now. Whenever you re-start your phone (or it re-starts itself), do you get a notification asking if you signed in __ days ago? Where __ is the number of days since you activated your MZ2P? Mine does, and that's really annoying, because it notifies me on every android device.", "time": "02-07-2018 08:21 AM", "replies": []}]}, {"title": "No location access? But it's on!", "thread": [{"postID": "post6117652", "text": "I am periodically getting a popup message No location access\nDevice location for all apps is turned off, and you may not be able to locate your device if it's lost\nHowever, location services IS enabled, and all the apps that have requested access have been granted such. Google Maps works, and other apps that rely on the location work as designed.\nZ2 Play, current OS, 7.1.1.", "time": "12-25-2017 01:08 PM", "replies": []}, {"postID": "post6117866", "text": "Update: I think it actually is turning off the GPS randomly. I just tried to use Android Pay, and NFC was disabled. I did not turn that off, either. And, I have periodically had to enter my password at the lock screen in order to \"reactivate\" the use of my fingerprint.\nAll of these items had worked the last time I used the GPS, Android Pay or unlocked my phone.\nIt's not (shouldn't be) a battery saver thing, as I have that turned off (just checked, it's still disabled) and the power level is fine. There are currently no Mods attached. Last restart was three days ago.\nHelp?", "time": "12-25-2017 07:33 PM", "replies": []}, {"postID": "post6118646", "text": "reboot every morning", "time": "12-26-2017 03:59 PM", "replies": [{"postID": "post6118705", "text": "Seriously? I quit iOS because of the need to reboot so often with iOS 11, I had the phone, the watch and the TV box.\nI shouldn't have to reboot that often.", "time": "12-26-2017 05:27 PM", "replies": []}]}, {"postID": "post6118714", "text": "I don't reboot my Moto Z Force daily, maybe monthly and don't have the issues described here. I'm not sure what advice to offer, other than have you run the phone in Safe Mode for a while to see if the same issue exists?http://forums.androidcentral.com/e?l...token=d83_7qfV", "time": "12-26-2017 05:34 PM", "replies": [{"postID": "post6118750", "text": "Thank you.\nUnfortunately, I use too many apps on a daily basis, including apps I use at work and a medical tracker. I simply cannot go without some of these for the extended period of time running in Safe Mode would require to ensure that no recurrence is proof and not coincidence. This would take several days, perhaps a week. But there are some mostly frivolous apps or widgets I can remove to start testing.", "time": "12-26-2017 06:29 PM", "replies": []}]}, {"postID": "post6127558", "text": "I would control what kind of location mode you have on, has to be high accuracy . When I start new z play also was not able to make gps fix , when I change from power saving mode , was working normal\nGreetings", "time": "01-05-2018 06:41 AM", "replies": [{"postID": "post6127566", "text": "It is on high accuracy. \nI've also been trying to figure out what might be causing this by disabling or uninstalling apps, so far, no joy. My current testing is removing Nova Launcher and its tools.", "time": "01-05-2018 07:00 AM", "replies": [{"postID": "post6156036", "text": "Any update to this?\nDid you try a factory reset?", "time": "02-06-2018 01:22 PM", "replies": []}]}]}, {"postID": "post6156067", "text": "Wound up with a warranty replacement from Verizon. So far, so good, and I'm slowly adding apps back.", "time": "02-06-2018 01:42 PM", "replies": []}]}, {"title": "Android files won't show up on my PC via USB connection", "thread": [{"postID": "post6141376", "text": "I got a new phone (Moto Z2 Play). When I plug it in to my PC, it shows no files. I can't drag and drop files inside either. I also can't import any files from my phone to my PC. It shows up on my PC but it says \"This folder is empty.\" It's as if my PC sees the phone there but none of its files. Can someone help me get my PC to recognize my files? I am connecting it to a Windows 10 HP Spectre x360 and my phone is a Moto Z2 Play with Android version 7.1.1. I have tried all 3 USB ports on my computer but the issue is the same. The phone is also up-to-date as is my PC.\nThanks so much!", "time": "01-20-2018 03:26 PM", "replies": [{"postID": "post6156032", "text": "Did you try selecting FOR FILE TRANSFER, from the notification bar?\nThere should be four or five options. I believe that CHARGING is the default option and that setting prevents the phone from showing properly in MY COMPUTER.\nShould look something like the attached pic.\nPlease reply here if this works.", "time": "02-06-2018 01:19 PM", "replies": []}]}]}, {"title": "How are updates?", "thread": [{"postID": "post6154904", "text": "I used to love Motorola before they were bought by Lenovo. My Moto X Play was the best phone I had ever used at the time. Moto was my go-to for near stock Android without the Nexus/Pixel price tag. Then Motorola got their shoes tied together and delivered Nougat a year after if was originally announced. \nNow I used to steer away from Samsung for lack of updates. But I've had the S8 since October and got all the security updates at the end of each month which is completely acceptable. \nI'm looking at the MZ2P because of its new price and I'm interested in it. But I'm wondering how things are now update wise? Are they delivered quickly (whether they're security updates or point upgrades)?", "time": "02-05-2018 09:59 AM", "replies": []}, {"postID": "post6155075", "text": "Updates don't come as quickly as they used to, before Lenovo time, but they are steady. Soak test for Oreo on the Z2 Play has been running for a while and now we got this.https://www.xda-developers.com/motor...2-g5-g5s-more/\nSecurity updates don't come monthly and if this is a high priority for you maybe you should try a different phone (more recent and more expensive).", "time": "02-05-2018 01:08 PM", "replies": []}, {"postID": "post6155121", "text": "You're likely looking at quarterly through this summer and it'll get slower when it's replacement comes out.", "time": "02-05-2018 02:05 PM", "replies": []}, {"postID": "post6155161", "text": "I have been getting monthly security updates on my Z Play. The most recent one I got was the one for December 2017. They are about a month or two behind Google. However, at least recently they have been coming out pretty much on a regular basis.", "time": "02-05-2018 03:08 PM", "replies": []}, {"postID": "post6155389", "text": "Alright it all seems pretty fair. I don't mind it that much if they don't come in monthly (I did get an S8 after all) but I was a bit worried about Motorola after my X Play experience. Now I see even last year's Z Play is getting Oreo at the same time as the Z2 Play making this the second major upgrade for the device in a quite acceptable time frame. \nPlus I'm buying it unlocked because my carrier doesn't have it so monthly updates may be harder to get anyway...", "time": "02-05-2018 09:02 PM", "replies": []}, {"postID": "post6155425", "text": "I've had several issues since the last update with the SD card being the biggest problem. I have loved this phone until the update that came along 1-6-18.\nAnything I had stored externally no longer works, so images, Amazon music, etc. \nI am running 7.1.1, update NDNS26.118-23. 178.23.12.7\nHope the info is helpful \nCheers", "time": "02-05-2018 09:45 PM", "replies": []}]}, {"title": "Anyway for notifications to wake phone.", "thread": [{"postID": "post6149328", "text": "Not really sure if I'm asking the right question. I've turned off Moto display and would like for notification sounds to play while phone idle (sleeping)", "time": "01-29-2018 11:14 PM", "replies": []}, {"postID": "post6150596", "text": "So, you would like notifications to play while your phone screen is \"black (not awake)\"? Have you turned your profile to \"sound/ring\" and have enabled your preferred apps to alert you via sound when they come in?", "time": "01-31-2018 09:28 AM", "replies": []}]}, {"title": "Just picked up MZ2P from MZP", "thread": [{"postID": "post6119398", "text": "Have had my MZP for just over a year,and still very happy with it. However I could not resist 349 for the unlocked 64gb 4g ram. I received it, but haven't had time to activate it. My initial impression is its nice to hold in the hand, and is zippy!", "time": "12-27-2017 12:21 PM", "replies": []}, {"postID": "post6119565", "text": "I really like mine.", "time": "12-27-2017 02:16 PM", "replies": []}, {"postID": "post6123056", "text": "Congratulations on your Moto Z2 Play, guys! Let us know what your favourite features are!", "time": "12-31-2017 07:30 AM", "replies": []}, {"postID": "post6134647", "text": "Why does it take time to activate?\nI took the SIM out of my MXPE, popped it into the Z2 Play and kept on truckin'.", "time": "01-12-2018 02:52 PM", "replies": []}, {"postID": "post6135435", "text": "Just meant wanted to have time to set it up the way I like first.", "time": "01-13-2018 03:24 PM", "replies": []}, {"postID": "post6137959", "text": "So what are your thoughts?", "time": "01-16-2018 12:49 PM", "replies": []}, {"postID": "post6138408", "text": "Yea, how's battery life vs you one year old unit?", "time": "01-17-2018 05:23 AM", "replies": []}]}, {"title": "Those going from z play to z2 play?", "thread": [{"postID": "post6127064", "text": "What has been better and what has been worse going from the z play to z2 play?", "time": "01-04-2018 04:59 PM", "replies": []}, {"postID": "post6127379", "text": "The Z Play obviously has better battery life and better recharge speed because although similar, you get more juice out of a charge due to Z Play's bigger battery.\nLooks are subjective but my friends all prefer the Z2 Play's looks vs the Z Play.\nCamera is better on the Z2 Play. Same goes to the in hand feel due to its thinness. I also prefer Z2 Play's metal back in comparison to Z Play's glass back. I find the one hand gestures to be very useful but it did take me a few days to get used to it. \nAudio performance is similar to my ears. Z2 Play has stronger audio jack though, at least from what I can hear.\nOther than that they are both very good Moto phones.", "time": "01-04-2018 11:52 PM", "replies": []}, {"postID": "post6127464", "text": "Thanks. How much better is the camera?", "time": "01-05-2018 03:20 AM", "replies": []}, {"postID": "post6127626", "text": "I have read somewhere the camera hardware is actually comparable to Samsung S8's (hardware. Image processing is another matter). Perhaps it ain't got the best camera in the market but it is right up there for sure.", "time": "01-05-2018 08:30 AM", "replies": []}, {"postID": "post6130021", "text": "The z2 play is pretty much an upgrade over the z play, even if pretty minimal at best. Battery is the biggest downgrade but honestly, it isn't too big, even with medium to heavy usage in my case. Slap a battery mod on it and you'll be golden for at least 2 days. Performance is mostly the same, but multitasking is better if you get the 4GB model, which is pretty much a given considering the 3GBs I've dealt with on the Z Play was only okay at best: it got really annoying to reload apps quite more often than I like.\nIn terms of the actual Z Play I still own, mine had a weird issue along the right side of the display where I could see the adhesive along the right side under the display assembly itself, exacerbated by the fact dust gathers there. Adding to that, you could actually press the display down quite a bit along the top portion of the device. The z2 Play in general feels much more solid, thanks to the back being made with metal as well and the whole phone looks and feels better in overall construction.\nThere's also one thing I'm going to have a love/hate relationship with this phone: those nice chamfered edges along the top and bottom portion. They give the z2 Play an imho, better aesthetic compared to the z2 Force but you know they'll be scratched in a matter of weeks", "time": "01-08-2018 02:48 AM", "replies": []}]}, {"title": "Time for a change.", "thread": [{"postID": "post6090374", "text": "I've had the Moto Z Play for awhile now and absolutely love it. Love the battery life. But the port seems to be can't keep a charge and have tried many cords. Same deal. Happened to my nexus 5 also lol. I've been looking at the Moto Z2 Play and I'm thinking it's not that worth it to upgrade too.\nAnyone have both phones that could agree? I notice less battery specs, less camera pixels, ect. Idk what route to go now.", "time": "11-30-2017 12:13 AM", "replies": []}, {"postID": "post6104561", "text": "I've done a lot of research on the Moto Z2 Play, as I wanted it for a while. Though it has a smaller battery, apparently it does get pretty decent mileage. The gist that I've taken from reviews is, \"It's a good phone, but not in a successor sense.\" According to a carrier site that sells it, you can still get \"up to thirty hours\" of battery life; which is pretty solid for a phone that did take a hit as far as getting a smaller battery.\nIf you're a little concerned about getting it, you could always wait for 2018 - Moto's upcoming devices will work with Moto Mods as well, so if you have some, it may be worth the wait. But if your charging port is giving you trouble and you want to upgrade sooner rather than later, what about grabbing something like the G5 Plus to last you until then and then save it as a backup device when you get the next Moto Z Play device that comes out?", "time": "12-12-2017 08:22 AM", "replies": []}, {"postID": "post6116474", "text": "I replaced my z force with a z2 play. Battery life seems similar despite smaller battery. I think the CUP is more efficient. Ironically the battery completely died in my Z force after 1 year.", "time": "12-23-2017 10:11 PM", "replies": [{"postID": "post6123057", "text": "Glad you are liking the Z2 Play! I've heard good things about its battery; despite the smaller size.", "time": "12-31-2017 07:31 AM", "replies": []}, {"postID": "post6123086", "text": "Good to hear for sure. \nSent from my XT1635-02 using AC Forums mobile app", "time": "12-31-2017 07:55 AM", "replies": []}]}]}, {"title": "Oreo Coming Soon?!", "thread": [{"postID": "post6114885", "text": "Reports say the Verizon Z2 Force started getting Oreo updates last night, hopefully Z2 Play won't be far behind . . .", "time": "12-22-2017 08:50 AM", "replies": []}, {"postID": "post6116374", "text": "We can hope. But we're talking two different phones (internally at least) with two different priorities given to them by Verizon and Motorola. Lets see how the Oreo shakes down on the Force before we \"hope\" that we get it quickly on our Play2's.", "time": "12-23-2017 07:44 PM", "replies": [{"postID": "post6118387", "text": "I could be wrong, but it always seemed to me that Moto treated the Play just as well as the Force in the Z series so I'm hoping for the same treatment with the Z2 . . .", "time": "12-26-2017 11:48 AM", "replies": [{"postID": "post6118834", "text": "They have, with the Force model usually ahead.", "time": "12-26-2017 08:37 PM", "replies": []}]}]}, {"postID": "post6116472", "text": "Just installed OTA update today. So far so good.", "time": "12-23-2017 10:07 PM", "replies": [{"postID": "post6116634", "text": "For the Force or Play?", "time": "12-24-2017 01:48 AM", "replies": []}]}, {"postID": "post6116765", "text": "z2 force", "time": "12-24-2017 07:25 AM", "replies": [{"postID": "post6117294", "text": "Good to hear it's treating the Z2Force well. Now we hunker down and wait to hit the Z2Play.", "time": "12-24-2017 10:25 PM", "replies": []}]}]}, {"title": "sim1 can't receiving voice and dialing call", "thread": [{"postID": "post6109037", "text": "Dear all \nI just bought around a week the Z2play but this problem comes up just aware.\nFor the first I thought my card was broken but actually coming from slot sim1 \nHere the detail \nWhat ever sim put on sim1 slot won't receiving voice call \nCan't make a call \nWhile we call the sim1 number from other phone it's call saound but actually the Z2play won't ringing.\nAnd the sim1 only worked on 4g and not other band \nAny one of you happen just like this \nJust give me the guidance \nThanks for assistant", "time": "12-16-2017 03:12 PM", "replies": []}, {"postID": "post6110936", "text": "What's the exact model number of the phone, and which carrier is the SIM from?", "time": "12-18-2017 01:07 PM", "replies": []}, {"postID": "post6110994", "text": "It's moto Z2play\nIts solved by SC (service Center) motorolla / lenovo\nThanks for advice", "time": "12-18-2017 02:01 PM", "replies": []}]}]
[{"title": "Error code 96 while texting message", "thread": [{"postID": "post6101029", "text": "Dear all\nI got problem while replying text thru sms text the error code is 96\nAny solution for this\nThanks for assistance guys\nRegards\nTengku Syahputra", "time": "12-09-2017 12:04 AM", "replies": []}, {"postID": "post6101063", "text": "Welcome to Android Central! Have you already asked your carrier about this? Does this happen with all texts you try to send, or only to certain contacts?", "time": "12-09-2017 12:48 AM", "replies": []}, {"postID": "post6102476", "text": "it's happened to all text but working where I switched device to another device any help regarding this issue", "time": "12-10-2017 01:19 PM", "replies": []}, {"postID": "post6102625", "text": "I'm not sure if this is available, but try using the #*#4636 #*#* dialer code, and see if the subsequent menu has an SMS Messaging Center code. If so, make sure it's correct for Indosat: https://indosatooredoo.com/en/person.../faq-messaging", "time": "12-10-2017 04:30 PM", "replies": [{"postID": "post6103008", "text": "I do it as your guide but here the result", "time": "12-10-2017 10:38 PM", "replies": []}]}, {"postID": "post6102999", "text": "ok thanks for advice but still error while I'm update those number and update error still shown", "time": "12-10-2017 10:33 PM", "replies": []}, {"postID": "post6103001", "text": "how can I post the attachment here", "time": "12-10-2017 10:34 PM", "replies": []}, {"postID": "post6103413", "text": "I was hoping it might help, but it looks like not all phones give you the option to change the SMS Message Center number.\nHave you already asked Indosat about this?", "time": "12-11-2017 10:05 AM", "replies": []}, {"postID": "post6103423", "text": "yes I do they said just restart the cellphone and made sure the text center message +62816124 for matrix and mentari", "time": "12-11-2017 10:13 AM", "replies": []}, {"postID": "post6103424", "text": "But the result still same always error 96 shown on cellphone.\nSo I can't install Mobil banking here etc coz they need sms for verification and otp", "time": "12-11-2017 10:14 AM", "replies": []}, {"postID": "post6104994", "text": "Can you clarify -- if you swap that SIM into another phone, it works ok?", "time": "12-12-2017 03:54 PM", "replies": []}, {"postID": "post6105072", "text": "Both sim provider look same can't send sms either", "time": "12-12-2017 05:17 PM", "replies": []}, {"postID": "post6105289", "text": "You're saying that no matter which SIM you insert into the Z2 Play, you still get the error 96?\nHave you already tried wiping the cache partition? MOTOROLA Moto Z2 Play - Recovery Mode - HardReset.info", "time": "12-12-2017 10:01 PM", "replies": []}, {"postID": "post6105298", "text": "Yup what ever sim inside this phone while texting or replying text will shown error 96\nBtw if i resetting the device by your advice it will be deleting all data on phone", "time": "12-12-2017 10:19 PM", "replies": []}, {"postID": "post6106343", "text": "The link was for wiping the cache partition -- this won't affect your personal data. Just make sure you select Wipe Cache Partition in the Recovery Menu, not Wipe Data.", "time": "12-13-2017 10:02 PM", "replies": []}, {"postID": "post6109032", "text": "I do this but still won't worked", "time": "12-16-2017 03:07 PM", "replies": []}, {"postID": "post6110635", "text": "I'm afraid I'm out of ideas. Have you ever been successful sending a text with the Z2 Play, or has it always been like this?", "time": "12-18-2017 09:48 AM", "replies": []}]}, {"title": "Naked?", "thread": [{"postID": "post6106597", "text": "I bought the verizon bumper yesterday. I use the wireless mod. Last night though my charger said it was charging, but it didn't. This morning I noticed when I pressed the mod I could hear the pins making contact. I tried removing the bumper and replacing it. Still clicking. So it's not compatible with my wireless mod. My question for those of you who have had the z2 play for a while without a bumper or case, how tough is the phone? I have a glass screen protector and a mod on the back so the unprotected area is the aluminum sides.\nI am coming from a Samsung s8+ with a case and still managed to crack the screen. I'll never buy an edge again because it's nearly impossible to protect the glass and right now front screen replacement is around $400...", "time": "12-14-2017 06:44 AM", "replies": []}, {"postID": "post6106660", "text": "I have had my fine gold one a couple of months, it's a bit slippy completely naked (and ugly!) \nI have the dark wood style cap that came with it and also bought the washed oak and the black leather one.\nThe leather one is the only one that stops it slipping off things.\nI never use cases and so far have never marked a phone.\nNexus 4,5 moto X2014, G4 Plus and Z2Play.", "time": "12-14-2017 07:55 AM", "replies": [{"postID": "post6106772", "text": "Does the leather one work with Mods and if so do you know where I can buy one? (Link?)\nThanks!", "time": "12-14-2017 10:04 AM", "replies": []}]}, {"postID": "post6106824", "text": "it is a mod.http://forums.androidcentral.com/e?l...token=zDKwO-sa", "time": "12-14-2017 10:46 AM", "replies": []}, {"postID": "post6106967", "text": "Ah ok. I was hoping for a bumper.", "time": "12-14-2017 01:42 PM", "replies": []}, {"postID": "post6107321", "text": "My phones tend to be (mostly) naked. My last one, an iPhone, only had the thinnest case I could find in order to merely lift the back up enough so that the camera was no longer protruding. It also had a matte screen protector merely to kill reflections in the car (I use my phones for navigation, too).\nMy Z2Play is nude. \nDifferent screen tech is allowing me to use it in the car with minimal reflection glare, so I'm not using a screen protector at all. I have one of the Moto battery packs as a backup power if I'm going to be out more than a day, or in an area with crappy signal, or I plan on using it a lot. When that is not on, I do have a plain Incipio back cover, but again only to raise the back enough so that the camera lens isn't the thing that hits the desk/table when I put it down.\nI've had it for about two months. No dings or scratches anywhere.", "time": "12-14-2017 08:38 PM", "replies": []}, {"postID": "post6107582", "text": "I have the Verizon bumper works fine with the battery mod and the jbl speaker mod.", "time": "12-15-2017 06:45 AM", "replies": []}, {"postID": "post6107679", "text": "The bumper doesn't allow for the use of style shells or wireless charging shells. It will work with the mods though. The notch on the bottom of the mods accommodate the small bump on the bottom of the bumper case. The style shells don't have that notch on the bottom like the mods do. I took a dremel tool and smoothed out the notch on the bumper case and everything fits now.", "time": "12-15-2017 08:36 AM", "replies": [{"postID": "post6108102", "text": "Or you could cut a groove, for the bumper tab into the style shell. TOMATO, TOMAHTO.\nI haven't needed any extra juice. The battery of the Z2 Play lasts much longer than any smartphone I've had.\nI use the Speck presidio case for work https://smile.amazon.com/Speck-Produ...+z2+play+speck \nand the Sleo snap case for weekends https://smile.amazon.com/dp/B072562Y...ing=UTF8&psc=1\nWarning, the Sleo does have a silly hole, in the back, that exposes the mods connectors.\nThe Sleo case is very thin and very grippy.", "time": "12-15-2017 04:23 PM", "replies": []}]}, {"postID": "post6110529", "text": "For me, I just have the glass screen protector and a mod covering the phone. I don't care if the sides get dinged, because the phone was $400.", "time": "12-18-2017 08:26 AM", "replies": [{"postID": "post6110547", "text": "Thanks. That's what I decided to go with.", "time": "12-18-2017 08:40 AM", "replies": []}]}]}, {"title": "Excel Crashing", "thread": [{"postID": "post6100532", "text": "New z2p. I have tried installing multiple office products. every one crashes as soon as I try to run them. I've read everything i could find and have installed, uninstalled, cleared the cache, rebooted, etc., several times. I tried just running one program at a time. The only thing that will run is outlook. but I've uninstalled that and even deleted the Microsoft account a couple times. Help please. I need excel but can live without everything else.", "time": "12-08-2017 02:13 PM", "replies": []}, {"postID": "post6100929", "text": "Had the same issue. Had to uninstall every single Microsoft app tonget it to work again.", "time": "12-08-2017 09:06 PM", "replies": []}, {"postID": "post6101183", "text": "I just tried mine and mine crashes too.\nMost Microsoft apps to if I'm honest!\nPerhaps that's why they dont do phones any more\nUpdate:\nNewish phone, if I install Office 365 app + One Drive + Excel + Word + Powerpoint + Microsoft account verifier.\nThey all seem to work..\nLooks like I have a Microsoft phone after all lol", "time": "12-09-2017 04:52 AM", "replies": [{"postID": "post6101208", "text": "Where did you find this? It doesn't come up in my store.", "time": "12-09-2017 05:50 AM", "replies": []}]}, {"postID": "post6101212", "text": "I can't find it unless I click my apps?https://play.google.com/store/apps/d...fice.officehub\nIt says for Android 4.4 and previous! I have had it a while.\nIt still lets me install it but also works without it.", "time": "12-09-2017 06:04 AM", "replies": []}, {"postID": "post6101220", "text": "OK that was a great idea but didn't fix it...", "time": "12-09-2017 06:22 AM", "replies": []}, {"postID": "post6102135", "text": "I did a hard reset and installed excel first. Now all is well. Thanks for your responses.", "time": "12-10-2017 06:00 AM", "replies": []}, {"postID": "post6103264", "text": "Quick update... Everything crashed again after the reboot. So it's what I've been told all along by Microsoft, but with a caveat that they did not know about. Depending on how a sd card is formatted, the z2 Play will install apps on the sd card. So I did a reset, reinstalled everything without the sd card installed, and now it works after rebooting... I've since reinstalled the sd card as a sd disk, NOT an internal drive. The problem with that I can't upload apps to the card so I need to mind the internal memory. Right now with everything I want installed, I'm just under 18 gb, so I'm good.", "time": "12-11-2017 08:06 AM", "replies": []}, {"postID": "post6103328", "text": "Glad you're sorted. you don't want adaptable storage always grief since Kitkat was launched. Use external. You can still put all your media on there. Google Play films, music, books. And all you photos and films. I have 23 GB on my external.", "time": "12-11-2017 09:10 AM", "replies": []}, {"postID": "post6107685", "text": "This has been a known issue with Moto phones. I had it with my Moto Z Play and now my new Moto Z2 Play. The solution was to uninstall every single Microsoft app and reinstall it again. However, I got tired of that and have just been using the Google equivalent apps. They seem to work fine for my needs. There are many posts about it on the Microsoft Office Google+ page.", "time": "12-15-2017 08:39 AM", "replies": []}]}, {"title": "Unlocked Z2 Play for $349", "thread": [{"postID": "post6102388", "text": "Motorola.com is having a holiday sale with the Z2 Play for $349. It is the 64GB with 4GB RAM version.", "time": "12-10-2017 11:24 AM", "replies": []}, {"postID": "post6102477", "text": "cool", "time": "12-10-2017 01:20 PM", "replies": []}, {"postID": "post6104562", "text": "Ahhhhh so cool... 😃. Thanks for telling us!", "time": "12-12-2017 08:23 AM", "replies": []}, {"postID": "post6105683", "text": "I know! More than a hundred dollars less than I paid. My impatience gets the better of my wallet, yet again.\nI was tempted to buy a backup....", "time": "12-13-2017 10:15 AM", "replies": [{"postID": "post6105741", "text": "This happens to me as well... When it comes to phones, I really can't be patient.", "time": "12-13-2017 11:04 AM", "replies": []}]}]}, {"title": "Moto Z2 Play and Other Devices On Sale!", "thread": [{"postID": "post6103510", "text": "Check this out, guys! This slash in savings doesn't just apply to the Z2 Play, but also to the E4 Plus, G5 Plus and others!https://www.androidauthority.com/motorola-sale-822027/", "time": "12-11-2017 11:12 AM", "replies": []}]}, {"title": "how to check phone status sim 2", "thread": [{"postID": "post6103011", "text": "Dear all \nWhile I put in *#*#4636#*#*\nThe phone status only define 1 sims or provider \nThe question is how to check another sim \nYour guidance is really help and appreciated\nWarm and regards \nTengku Attachment 275514", "time": "12-10-2017 10:42 PM", "replies": []}]}, {"title": "The gold Z2 Play looks really stylish with the bamboo style shell", "thread": [{"postID": "post6067019", "text": "Glad I got this instead of the nylon style shell. Hides smudges quite well too. Too bad the camera hump is still level with the shell.", "time": "11-12-2017 11:39 PM", "replies": []}, {"postID": "post6067020", "text": "Second photo....", "time": "11-12-2017 11:40 PM", "replies": []}, {"postID": "post6068974", "text": "Wow, it looks beautiful! Awesome!", "time": "11-14-2017 08:26 AM", "replies": []}, {"postID": "post6101031", "text": "Awosome", "time": "12-09-2017 12:05 AM", "replies": []}]}, {"title": "Accidently deleted the Camera file in the cache. Is there anyway to recover the pic without rooting?", "thread": [{"postID": "post6084746", "text": "I have tried several different free programs I found online but after going through the motions they either tell me the phone isn't supported or must be rooted. I tried several more programs in an attempt to root the phone. \nIs there a clear cut way to recover the pictures that were deleted without jumping through a bunch of hoops?", "time": "11-25-2017 09:33 PM", "replies": []}, {"postID": "post6084765", "text": "Welcome to Android Central! What do you mean by \"the Camera file in the cache\"? Do you mean that you deleted the /DCIM/Camera directory from Internal Storage?\nRecovering deleted files from Internal Storage always requires rooting, so unfortunately you will have to jump through those hoops. See this guide: http://forums.androidcentral.com/amb...ted-files.html", "time": "11-25-2017 09:58 PM", "replies": []}, {"postID": "post6085344", "text": "I have been trying to find a reputable program for rooting. I found King Root. \nDoes any one have any experience with this? If not, are there any others that work well?", "time": "11-26-2017 11:11 AM", "replies": []}, {"postID": "post6087044", "text": "I used the files and directions, in the thread below, with no issues.\nIf you are new to rooting, I recommend much reading and YouTube watching, prior to attempting. Research fastboot commands, TWRP and Magisk.", "time": "11-27-2017 05:24 PM", "replies": []}]}, {"title": "Disable phone notifications or icon badging, not both", "thread": [{"postID": "post6084051", "text": "I've switched back to the native Moto Launcher on my Moto Z2 Play (os7.1.1) (was using Nova), and is there a way to disable EITHER the badge on the Phone app icon OR the notification for missed calls? I don't need or want both, as it means I have to clear the notification twice.\nNova had a control per app for the icon badging. But natively, it looks like it's all or nothing.\nI switched back because the primary reason I was using a third party launcher has been resolved, and Nova doesn't pass on several apps' notifications despite being enabled in its settings.", "time": "11-25-2017 08:10 AM", "replies": []}, {"postID": "post6084882", "text": "Moved from the Nougat forum to the Z2 Play forum, since this is more of a device/manufacturer-specific question, rather than a general Nougat question.", "time": "11-26-2017 12:15 AM", "replies": []}]}, {"title": "Guess I'm coming back to Motorola", "thread": [{"postID": "post6083439", "text": "Well, after many years of enjoying the Droid series I used a few other phones, most recently an LG G6. After flip flopping a few times trying to decide if I wanted a Pixel2 or Note8 my Verizon business acct was offering black Friday upgrades to Z2play for $0.00 . . Could have had a pixel 2xl for 229 or note8 for 294, but free is free . . Hope I don't regret it, but I did enjoy the Moto version of Android and they do seem to be getting software updates reasonably quickly. Anybody wanting to weigh in on their Z2play experiences feel free to chime in . . . Thanks :-)", "time": "11-24-2017 03:36 PM", "replies": []}, {"postID": "post6083677", "text": "So far, I'm liking the Z2 Play. My last Android before this was the original Moto X (os 2.2). The last five years were with iOS.\nA few apps I use are not fully compatible, Accu-Chek and MySugar are supposed to support BT data reception from my meter, but don't. Accu-Chek worked on the iPhone so I know it's not the meter. \nOther than that niggle, I'm mostly satisfied with the Z2 Play. I do not have any recent Android competition to compare against.", "time": "11-24-2017 08:11 PM", "replies": []}, {"postID": "post6084658", "text": "I've been extremely pleased with the performance and features of the Z2-Play. Even being a \"mid range\" phone, it performs quite well, in some cases quicker than my fiancees Galaxy S8. It's a bit chunky with the bumper case and the Moto Turbo Power mod attached, but having a nearly 48hr turn around between charges is more than worth it. I get a solid day of high use without the external battery. \nI've even tried to talk myself into upgrading to the Z2-Force, but can't really justify the price when everything works just fine otherwise.", "time": "11-25-2017 07:18 PM", "replies": []}]}, {"title": "From z play to z2 play.", "thread": [{"postID": "post6082141", "text": "I have a z play and battery life is getting worse. I want a pixel 2 XL, just want to wait for the price to come down. \nBest buy is offering the z2 play for just under $200. Is it worth to change from z play to z2 play? Better camera? Battery? Reception? Etc?", "time": "11-23-2017 07:57 AM", "replies": []}, {"postID": "post6083179", "text": "Would like a better camera and more space. The Black Friday special for Z2 Play for $399 seems like a good deal. Not sure if it is a good upgrade to my Z Play or not. It's tempting.", "time": "11-24-2017 11:14 AM", "replies": []}]}, {"title": "Fingerprint Scanner Issues", "thread": [{"postID": "post6077909", "text": "This morning my fingerprint sensor stopped responding so I rebooted the phone. After reboot the options for using the fingerprint sensor have disappeared entirely. Anyone else have this issue or any advice?", "time": "11-20-2017 08:37 AM", "replies": []}, {"postID": "post6078034", "text": "Welcome to Android Central! Does this also happen in Safe Mode? Or after a cache partition wipe? https://motorola-global-portal.custh...p/30,6720,9835", "time": "11-20-2017 10:15 AM", "replies": [{"postID": "post6078039", "text": "Unfortunately, neither safe mode nor a cache wipe has made any difference. I'm hoping to avoid a factory reset but that may be the next move.\nPosted via Android Central App", "time": "11-20-2017 10:19 AM", "replies": []}]}, {"postID": "post6078169", "text": "Yes, I agree. If it still doesn't work, then it's likely a hardware failure -- is the phone still under warranty?", "time": "11-20-2017 11:28 AM", "replies": [{"postID": "post6078280", "text": "I believe so but I'll have to double check. Thanks for your help.\nPosted via Android Central App", "time": "11-20-2017 01:01 PM", "replies": []}]}, {"postID": "post6080349", "text": "In good news the factory reset seems to have done the trick and everything is working again.", "time": "11-21-2017 07:10 PM", "replies": []}]}, {"title": "User Opinions?", "thread": [{"postID": "post6039640", "text": "Hi, everyone!\nI saw the Z2 Play in a carrier store on Monday, and fell in love with it! I may consider a Motorola phone for my next upgrade. How is everyone enjoying the Z2 Play? Any long-term reviews or opinions on things like battery life and screen quality, etc?\nThank you!", "time": "10-26-2017 09:36 AM", "replies": []}, {"postID": "post6040829", "text": "I've been using it for several months. I have the Tumi 2200mah battery mod on it almost exclusively. I between that and the abnormally long battery life, I get well over 48hrs with what I would consider heavy usage (streaming music in the car, hotspot to my laptop and tablet, and well over 3hrs of screen on time per day). The lowest I've seen it was the external battery flat and the internal at 40%, and that was after working a 12hr shift, not realizing my charger was unplugged, and going another day after that. \nScreen: It's 1080p, and rather responsive. It's not as \"colorful\" as my fiance's S8, but its not meant to be. It does ramp up to be readable in bright light. I lose some fidelity with my \"anti-glare\" screen protector.\nThe fingerprint sensor is super responsive. I have it set to act as the home button, with the \"swipe\" to act as as the back/switch app buttons. They never appear on my screen. \nWhen I picked it up, I got the JBL speaker mod free. It doesn't hold up to the \"bigger\" bluetooth speakers, but it's absolutely perfect when I'm kicking around the yard to hear my music. \nDon't let the \"mid range phone\" specs put you off. Side by side with her S8, it's in most cases more responsive.", "time": "10-27-2017 02:16 AM", "replies": [{"postID": "post6041135", "text": "Thank you so much for your review, I really appreciate it! Is the battery module you use super big? I feel like I'd buy it if I did indeed purchase the Z2 Play.", "time": "10-27-2017 08:13 AM", "replies": [{"postID": "post6041150", "text": "Well, it doesn't feel too thick to me...\nBut my prior phones were a Kyocera duraforce pro, and a note 5 with a huge protective case. So I may not be the best person to answer that. That said, naked it felt way too thin and hard to hold. The battery made it feel much better. I also put the bumper case that works with mods on it too.", "time": "10-27-2017 08:20 AM", "replies": [{"postID": "post6041245", "text": "Thank you, that's great to know! I always put cases on my phones - I feel like they are too thin without one!", "time": "10-27-2017 09:39 AM", "replies": []}]}]}]}, {"postID": "post6041751", "text": "I've had one for a couple weeks now. I had to get the battery mod (2200 mAh, Moto branded), as this phone does not handle poor connections as well as my prior phone (iPhone 7+) and will drain out twice as fast. Note: The root cause of that is not the phone, it's my location. Where I have a decent connection, it's fine. (NOTE: not asking for help on that, I know of the setting to avoid bad wifi connections.)\nThe display is the same size in inches as my last phone, but the resolution is less. And I do not notice the difference at this screen size. The higher resolution requires more power and a faster processor, so compared to the Z2 Force, I do have better battery life, and roughly the same overall system responsiveness.\nSound quality on the device could be better. The is no separate speaker from the earpiece for speakerphone / media / alerts, so those may be muted depending on how you hold or carry the phone. Via BT, it's as good or slightly better than other phones I've used.\nI wish I had finer grain control over alert/alarm tones. For example, while I can set mp3 files for phone ringers, I cannot for voicemail, txt/sms, email, etc, alerts. This is my first Android in 5 years, so I do not know if this is a limitation of Motorola specifically or Android in general.", "time": "10-27-2017 02:47 PM", "replies": [{"postID": "post6042199", "text": "Thank you so much for your review! With regards to the notification sounds, I feel like there should be a setting (within Sound Settings, most likely?) that should enable you to set a different notification for, say, emails versus SMS. Also, you could download a third-party app like Textra; which could give you different tones for different contacts.", "time": "10-27-2017 09:28 PM", "replies": [{"postID": "post6042513", "text": "You don't need extra software to set individual tones for contacts. Just edit, and in the edit screen tap the 3 dots icon at the top right.", "time": "10-28-2017 06:30 AM", "replies": []}]}, {"postID": "post6042250", "text": "You need to put sound files into an \"alerts\" or \"notification\" folder. That should get you new alert tones.", "time": "10-27-2017 10:26 PM", "replies": [{"postID": "post6042517", "text": "Thanks!\nSame works for \"Alarms\"", "time": "10-28-2017 06:35 AM", "replies": []}]}]}, {"postID": "post6053942", "text": "How are users enjoying the camera experience on the Z2 Play?", "time": "11-04-2017 03:27 PM", "replies": []}, {"postID": "post6058598", "text": "I've had the play2 for about a month... \nCamera is pretty bad.. Worst Motorola camera I've had to date... But it takes pictures I guess. I need to use a filter on every picture...\nThe screen kinda sucks.. You can definitely tell of your downgrading screen resolution from you're last phone.. But it helps give the phone amazing battery life.\nMost apps run well enough.. except snapchat... If you are a heavy snapchat user do not get this phone.. Go for the Z force...\nOverall this phone is good enough but I am already looking to replace it within the year.", "time": "11-07-2017 01:28 PM", "replies": [{"postID": "post6063238", "text": "Thank you for your honesty about the camera! I'm kind of looking for specs equal to or greater than my current phone (Honor 8, which did spoil me in terms of dual cameras); so that seems to be one of the things I've run into with researching the Z2 Play as far as a minus goes.", "time": "11-10-2017 09:32 AM", "replies": []}, {"postID": "post6078549", "text": "You must have a \"bad copy\" of the phone. The camera on my Z2 Play is pretty good. It's not stellar, but then again I don't expect stellar photography from a dinky little cellphone camera. Over all, at least from my usage so far, I'd put it on par with the standard camera on an iPhone 7 (7+ has a slight edge with the dual-lens setup).\nIf you can tell the resolution difference of the screen, you must have great eyesight. I looked at the Z2 Play and Z2 Force side by side, and other than a little difference in color clarity mostly due to the display technology differences, I saw no resolution difference between the two. 5.5in is just too small a display for 4K or quad-HD to make that much of a difference.\nWhich in turn, means that the Z2 Play can get away with a slightly slower CPU, because it's not needing to drive an absurdly high density display. Which also means that the same size battery can last longer, or a smaller battery can be used for the same amount of time, because it's not powering that absurdly high density screen nor does it need to power a higher power CPU.\nI have no comment on Snapchat...", "time": "11-20-2017 03:47 PM", "replies": []}]}, {"postID": "post6078171", "text": "I am not much concerned about camera specifics as long as it functions.\nMy recent phones have been a Moto X Pure Edition and a Nexus 6P.\nThe Z2 Plus has provided much better battery life, when used in the same manner as the other two.\nI am really enjoying the Z2 Play! I have been using the ONE BUTTON NAVIGATION feature and am liking it, very much.\nMotorola phones have always seemed to have better reception, that other brands and tho I was skeptical that Lenovo would maintain that practice, I believe the Z2 Play provides great service connection. After-all, the main purpose of the device is communication and that's more important to me than camera quality.", "time": "11-20-2017 11:29 AM", "replies": []}]}, {"title": "Format SD as internal or removable?", "thread": [{"postID": "post6076650", "text": "What are people's thoughts on this? Do you format your SD card to extend the internal storage, or do you format it as removable?", "time": "11-19-2017 07:35 AM", "replies": []}, {"postID": "post6076830", "text": "I got the fast card I could find ~ 100 ms and got a warning saying it was slow for internal, Googled it and many have the same issue, and the fastest you can get is a long way off the internal so I used mine as removable, you can still put all your Google stuff on there, music films + photos and films from the camera.\nSo my Sandisk Ultra is removeable.", "time": "11-19-2017 10:50 AM", "replies": []}, {"postID": "post6076840", "text": "I personally think using the card as internal is a bad idea. It's more prone to failure than onboard NAND, and is slower, plus functionality becomes limited. Recent Samsung phones now do have an option to force apps to move to SD card even if the developer set in the app manifest for it not to, so it helps. I don't know if newer Moto has it, but you can try checking in developer options.", "time": "11-19-2017 10:58 AM", "replies": []}, {"postID": "post6076916", "text": "So If I had formatted as internal and want to switch it, is there a way I can do that without losing data? Or do I just have to suck it and re-load my media?", "time": "11-19-2017 12:11 PM", "replies": []}, {"postID": "post6077133", "text": "I just re formatted mine as removeable and it put everything back (I think) I had to wait for it to finish. You can still eject it when it's internal so it just transfers the folders back I am pretty sure.", "time": "11-19-2017 04:48 PM", "replies": [{"postID": "post6078525", "text": "I was able to back up the card by plugging the phone into the PC and enabling File Transfer, I was unable to mount the card directly with a card reader.\nAnd, that backup was almost a complete waste of time. I had to then re-delete data for and reinstall several applications that store data on the card, including MediaMonkey, Podcast Addict, PWall, and TomTomGo. And I won't know if that was enough for MediaMonkey until tomorrow morning, as it will take many hours to sync ~7000 tracks of music back over.", "time": "11-20-2017 03:37 PM", "replies": []}]}, {"postID": "post6078157", "text": "I would back up the data on the SD card and then format it, in the phone and start over.\nI always choose external. I believe that it provides more flexibility ( I swap phones and move the card, periodically).\nI have not read much good experiences using an SD card as internal storage, since the option became available with Marshmallow.", "time": "11-20-2017 11:23 AM", "replies": []}, {"postID": "post6078318", "text": "If it's portable (removeable) storage, and you back everything up (to a PC and a cloud account is best, at least for important files), if the card goes, you can always restore the files to a new card. (Most good manufacturers warranty the cards for longer than you'll want to keep them. [SanDisk's warranties are 5 years minimum, Ultra Plus and Extreme cards carry lifetime warranties.]) If it's adaptable (internal) storage and the card goes, there's nothing you can do - you can't back up an adoptable storage card.\nBut if the phone has limited storage (I'd call 16GB limited these days), you might have to put in an adoptable storage card to make the phone usable for a little longer.", "time": "11-20-2017 01:31 PM", "replies": [{"postID": "post6078536", "text": "Considering the size of the firmware, I'd call 32GB \"limited storage\" these days. The Moto Z2 Play has 32GB of internal storage, with more than 10GB of that take up by firmware. Something they neglect to tell you at the store.", "time": "11-20-2017 03:40 PM", "replies": []}]}]}, {"title": "iPhone Temptation?", "thread": [{"postID": "post5979490", "text": "Anyone tempted by the iPhone 6s Plus now that Apple has reduced the price to $549? That puts it within $50 of the Z2 Play.\nSimilar size, battery life, screen resolution, and camera. Both are sort-of-but-not-really-water-resistant. Both still have headphone jack. Both are solidly mid-range spec-wise.\nUpside for iPhone:\nThe screen will be slightly crisper due to Z2 using Pentile, the iPhone camera is better due to iOS, and the A9 chip is probably a little faster than the Snapdragon 626. Also more frequent software updates.\nOn the upside for Moto: I still prefer the look of AMOLED even if it isn't quite as sharp up close. iPhone has less storage ($499 Z2 has 64gb), and the iPhone storage is not expandable. Moto gestures. Moto mods. USB-C turbo charging. Front-facing camera flash. \nKind of interesting to me that for the first time in a while the price gap between mid-range options in either ecosystem are fairly close.", "time": "09-17-2017 10:09 AM", "replies": [{"postID": "post6022475", "text": "I just traded in my iPhone 7+ for a Z2 Play yesterday, having to pay an early-upgrade fee (I had one month left before no extra charge). Why?\niOS 11 and the associated updates to WatchOS, iTunes and tvOS have broken many many things. Yes, I was all-in on Apple other than desktops. And it was the iTunes hub that had kept me with Apple for as long as I was.\nI was tempted by the Z2 Force, but the cost difference means that in a couple of months I should be able to afford to get a ZenTab 10 as well and have my bill come out to about the same as it was with the iPhone.", "time": "10-16-2017 02:31 PM", "replies": []}]}, {"postID": "post5979545", "text": "No, not at all. That's a 2 year old phone vs a new one.", "time": "09-17-2017 10:45 AM", "replies": []}, {"postID": "post5979654", "text": "True, but spec-wise they are equivalent and I suspect both will have at least a few years of OS updates. At this point it really does seem to be a question of which OS a person prefers and whether the Moto Mods are a big draw or not.", "time": "09-17-2017 12:10 PM", "replies": []}, {"postID": "post5984607", "text": "I may be a little biased here, but I'd recommend the Z2 Play; especially if you're wanting expandable storage and are a power user that would make use of different Moto mods. I totally get your iPhone temptation - I'm not the biggest Apple fan and I'm still sometimes tempted to try it out - but as Aquila stated above, the iPhone you're looking at is older and the Z2 Play is crisp and new and you have more chance of having \"longer\" updates than with an iPhone of that age. I know Apple updates their devices for a while after initial release, but at two years of being on the shelves, the 6 line might be at the end of that receiving line.", "time": "09-20-2017 10:08 AM", "replies": []}, {"postID": "post5997360", "text": "I wouldn’t get the iPhone 6s for the same reasons you mentioned. But it did catch my eye that spec-wise the iPhone 6s and the Z2 Play are pretty evenly matched (minus the mods obviously) and close in price as well. If price alone has kept people away from iPhone then Apple is bring smart to leave older models in its lineup. From a marketing perspective I think they should rebrand and not just leave the old numbers. So 6s in 2017 gets called the 6se or something.", "time": "09-29-2017 12:32 AM", "replies": []}, {"postID": "post6078186", "text": "I'm not.\nThe first time that I heard about someone connecting their iPod to someone else's computer and it getting wiped, due to a difference in iTunes accounts, I swore off Apple anything.\nThat never happened with an MP3 player.\nI hate proprietary BS.", "time": "11-20-2017 11:36 AM", "replies": []}]}, {"title": "Moto Display reply without unlocking", "thread": [{"postID": "post6045483", "text": "I have read that the Moto Displat enables you to reply to, say a text message or a WhatsApp message, without actually unlocking the phone. So far all I could do is to hold that notofication and drag it upwards to unlock and view that message or drag down to dismiss it. How do I enable my Moto Display to reply without unlocking? (Yes I have checked the setting to reply without unlocking on Moto Action app).", "time": "10-30-2017 08:47 AM", "replies": []}, {"postID": "post6045576", "text": "oh nevermind, I managed to figure it out somehow...", "time": "10-30-2017 09:57 AM", "replies": [{"postID": "post6045590", "text": "What did the trick? Your feedback will be very helpful for other users with a similar issue.", "time": "10-30-2017 10:05 AM", "replies": [{"postID": "post6046697", "text": "Well I looked around the forums and there is a thread on MZP forum regarding the new Moto display and Moto action APKs. I install those. Works great on my MZP and MZ2P. Allows you to select a specific message and reply to that message without unlocking the screen. Very handy.", "time": "10-31-2017 12:09 AM", "replies": [{"postID": "post6047561", "text": "Full names and versions of these apps would be greatly appreciated.", "time": "10-31-2017 03:14 PM", "replies": [{"postID": "post6048173", "text": "Here you go...https://forum.xda-developers.com/mot...to-x4-t3682701", "time": "11-01-2017 01:32 AM", "replies": [{"postID": "post6062830", "text": "Thanks, but how do you know that's what the OP was referring to and why wouldn't they have come on his phone?\nThat link is for a Z1.", "time": "11-09-2017 11:22 PM", "replies": [{"postID": "post6064330", "text": "Because he was referring to a thread that I started in the Moto Z Play forum. They are for the latest Moto Display and Actions. Those 2 files will work on all Z phones across the board.", "time": "11-11-2017 12:54 AM", "replies": []}]}]}]}]}]}]}]}, {"title": "Buying Unlocked from Motorola Canada?", "thread": [{"postID": "post6051301", "text": "Hey guys! \nI'm now leaning towards getting the Z2 Play as my next phone (but that may change because I'm tempted by at least three other phones right now!); but it looks like Motorola Canada's website only lets you purchase the Z2 Play if you're a Bell, Freedom Mobile, or Telus customer. My carrier is unfortunately not listed there... But it looks like there is no option to buy the phone outright.\nDoes anyone know if there is actually a way to buy it unlocked from Motorola; or will that option become available in the future? Or are there ant other Canadian retailers that sell it? Best Buy doesn't have it on their website.", "time": "11-02-2017 10:25 PM", "replies": []}]}, {"title": "Moto Z2 Clock gone but not forgotten.", "thread": [{"postID": "post6050368", "text": "When I bought my Moto Z2 it came with a nice circular clock on the home screen and the circle also shows battery depleation throughout the day. Yesterday it magically disappeared (in classic Android form) without me changing anything.\nIt's not in my widgets although there are a few basic clocks there. \nIt also still displays as my phone \"breaths\" while in sleep or standby mode. \nAnyone?", "time": "11-02-2017 12:07 PM", "replies": [{"postID": "post6051250", "text": "On mine, it's in the Widget drawer as \"Time and Weather 3x2\". Hope that helps.", "time": "11-02-2017 09:40 PM", "replies": []}]}, {"postID": "post6050375", "text": "Welcome to the forums. Is this the Verizon/Droid model? If so, I think that widget is called 'Command Center'.", "time": "11-02-2017 12:09 PM", "replies": []}]}, {"title": "Question, which should I get the Z Play or the Z2 Play", "thread": [{"postID": "post6046703", "text": "I'm all about the unbelievable battery on the Z Play and I've been trying to decide which I should buy. How do you guys like your Z2 Play compared to the Z Play? Which do you think I should get? I'm waiting until Black Friday to buy what ever phone I buy but right now I have it narrowed down to the Z2 Play, Z Play, Axon 7 and the Honor 8. I absolutely love the JBL speaker mod the best. I've owned the Z Play before and that battery was unbelievable. Any advice would be greatly appreciated. I figure I can probably get a really good deal on the Z Play on Black Friday due to it no longer being the current model. Any help I would appreciate. Thanks a bunch guys.", "time": "10-31-2017 12:17 AM", "replies": []}, {"postID": "post6046724", "text": "The Z2 Play will have better support and for longer. That's typically how OEM's treat their phones. Newer phones get priority while older phones are app but forgotten.\nI like the design of Z2 better. I'd get that. You'd have slightly worse battery, though, but still better battery than every other phone except for the OG Z Play.", "time": "10-31-2017 12:40 AM", "replies": []}, {"postID": "post6048613", "text": "Mod note. Better if we keep the discussion in just one thread. Thanks.https://forums.androidcentral.com/sh...d.php?t=844799\nI'll close this one to avoid confusion.", "time": "11-01-2017 10:29 AM", "replies": []}]}, {"title": "Z2 Play & Z Play: my personal experience", "thread": [{"postID": "post6046825", "text": "I own both phones (I own the MZP a little longer) and I would like to share my own personal experiences using both devices.\nThings that are better on MZP:\n1) No question the battery life. I use my devices heavily for WhatsApp and emails and streaming movies on YouTube, and movie streaming services. The MZP, on my estimate, can easily outlast the MZ2P by a couple of hours.\n2) Display calibration: I prefer the display on my MZP which has more natural colors when set to standard mode compared to MZ2P's standard color profile. The MZ2P's display has more \"pop\" even on standard mode. This is really dependant on one's preference though. \n3) Charging speed. I find the MZP can charge just about as fast as the MZ2P, and considering the MZP has the bigger battery, you can quickly top up and have more juice on the MZP.\n4) Less camera hump. With the same style shell, the camera hump on the MZP is flush with the body while the bigger hump on MZ2P means even with style shell on, the camera lens may not be as well protected because it is level with the shell.\n5) Well, it is quite a bit cheaper than the MZ2P...\nThings that are better on MZ2P:\n1) In hand feel. Due to its thinner profile and less sharp edges, the MZ2P is quite a lot nicer to hold compared to MZP, which has chunkier body and sharper edges. MZ2P looks more premium too because of this.\n2) One Button Nav. I have to get used to this, but after an initial period of adjustment, I find the one button navigation of the MZ2P to be quite intuitive and it also allows more screen real estate.\n3) Audio output through the headphone jack seems more powerful on the MZ2P. \n4) Bigger RAM and internal storage compared to MZP.\nOverall, both are fantastic devices but if you have to choose one device between the 2, I would advise picking up the MZP: it is cheaper, performance is smooth, battery life is quite a bit better in my experience(can opt out of buying the battery mod), although it is a chunkier device and the in hand feel is less premium than the MZ2P. \nNow I use the MZ2P as my daily driver, while the MZP is my \"media consumption\" device due to its longer battery life.", "time": "10-31-2017 05:22 AM", "replies": []}, {"postID": "post6047112", "text": "What about the camera differences?", "time": "10-31-2017 09:34 AM", "replies": [{"postID": "post6047880", "text": "They're both pretty decent but the MZ2P takes slightly better pictures to my eyes but both struggle in low light. I do own a camera though so I use the MZP and MZ2P just for taking casual snapshots mostly.", "time": "10-31-2017 07:23 PM", "replies": []}]}]}, {"title": "Voicemail Notifications ...", "thread": [{"postID": "post6043137", "text": "Hi all,\nI’m guessing that this has been beaten to death, but I’m at a loss to find an answer. Here’s the problem: I need notifications when receiving new voicemail messages. I’m using the “basic” version of the Visual Voicemail app ...paid version is $2.99 mo with Verizon. The big issue for me is that neither version of this app work without using the data plan. Wow, “dumbphones” were able to leave an indicator showing the number of new voicemail messages, but an expensive “smartphone” can’t? I don’t have an unlimited data plan, so I leave the mobile data turned off unless I need to use it.\nHope someone can steer me toward a solution.\nThanks,\nJeff", "time": "10-28-2017 04:22 PM", "replies": []}, {"postID": "post6043207", "text": "I get vm notifications using the standard app that came on the phone.", "time": "10-28-2017 05:05 PM", "replies": [{"postID": "post6043305", "text": "Just checked, and the standard app is missing. Check to see if it was just disabled, but it is completely gone. I may need to post something in regard to recovering deleted apps", "time": "10-28-2017 06:58 PM", "replies": []}]}, {"postID": "post6043212", "text": "Do the notifications show as a number next to the app icon? Also, does this work without using mobile data or Wi-Fi?", "time": "10-28-2017 05:10 PM", "replies": []}, {"postID": "post6043629", "text": "I don't remember any numbers next to the icon when I was using it with the stock launcher. But using one like Nova Launcher with an add on called TeslaUnread will give you notification numbers next to the app.", "time": "10-29-2017 02:35 AM", "replies": []}, {"postID": "post6043891", "text": "Visual Voicemail is a data service, placing the messages into a queue you can see and manage. Plain voicemail is a voice service and depends on your use of the keypad and voice prompt menus but doesn't require a data connection.\nThose are your options.", "time": "10-29-2017 09:42 AM", "replies": []}, {"postID": "post6047579", "text": "I started using Google Voice for voice mail, a while back when Verizon VVM wouldn't work on a ROM I was using, and haven't looked back.\nSaved messages and settings transfer to new phones / ROMs, upon signing in and it's free.\nI don't know if it will work without data. I suspect not.\nI also use Nova Launcher and Tesla Unread for number of unread items.", "time": "10-31-2017 03:30 PM", "replies": []}]}, {"title": "Re-entering Android space, sync photos?", "thread": [{"postID": "post6024739", "text": "As recently as 6 weeks ago, I didn't think I'd be returning to Android. My last (and only) prior Android was the original Moto Droid X running OS 2.2, Gingerbread. I spent the last 5 years and 3 devices in Apple Land. The one killer feature for me that brought me back to Apple was the iTunes integration for media management. And I was happy.\nThen iOS 11 happened. Along with watchOS 4, tvOS whatever, and iTunes 12.crap. And things broke across the board. \nThis time around, I found MediaMonkey, which I understand has the live updating nested playlists I require for music management (I'll find out, I'm syncing them for the first time now). This past Sunday, I finally had enough, and I had paid off enough of the iPhone to make an early upgrade only cost me one month's device payment early. \nMy current question is, how can I sync photos? Not the camera roll, album folders I have on my desktop. I want to sync those to the SD card in the Moto, the same way iTunes syncs photo folders to iThings. Select the folders to sync, and content changes get replicated. I don't see this in MM.", "time": "10-17-2017 09:59 PM", "replies": []}, {"postID": "post6024748", "text": "Hmm. I use Foldersync to do that, but I understand this seems to be built into Google Photos and Google Drive now. I haven't tried that option though. I haven't gotten around to cleaning up my Google Drive in a while.", "time": "10-17-2017 10:14 PM", "replies": [{"postID": "post6025326", "text": "I'll look into that when I get home tonight.", "time": "10-18-2017 09:53 AM", "replies": []}]}, {"postID": "post6032790", "text": "Google Photos doesn't work for me. \nOn my PC, I have my photos organized into albums by folders. Google Photos ignores this and groups by date. I have over 13,000 photos going back about 20 years.", "time": "10-22-2017 02:55 PM", "replies": [{"postID": "post6039055", "text": "Anyway back to topic.\nHave you tried Foldersync? It allows me to sync the photos by folder, so each folder (album) in my phone shows up as it's own folder in my PC. It doesn't have its own cloud though. I linked it to my OneDrive.", "time": "10-25-2017 11:19 PM", "replies": [{"postID": "post6039461", "text": "I'll take a look. I was hoping to just go PC -> Device without an online service, but I guess that's not possible.", "time": "10-26-2017 07:40 AM", "replies": [{"postID": "post6039497", "text": "I think Sony is the only one left with that option since Samsung scrapped Kies and HTC their software turned barebones. Moto was the first to ditch USB sync of data if I remember correctly.\nIf it's PC to phone directly, you'll have to do it manually. I haven't seen any new software doing what you want recently.", "time": "10-26-2017 08:05 AM", "replies": [{"postID": "post6039518", "text": "I don't care if it's USB vs wifi. I just prefer doing it without going through an online service.\nSomething that burns me now that I've found it, is that the phone's built-in file manager does not manage files. It also has a wifi based FTP server that claims I can manage the files from my PC with it, but it won't let me create directories in existing locations nor upload files.\nBut I CAN implicitly create the folders and transfer files via other installed apps...", "time": "10-26-2017 08:25 AM", "replies": [{"postID": "post6039527", "text": "No experience with the Moto file manager. LG and Samsung versions works as expected in actually managing files. You can probably try Astro File Manager or X-Plore from the Play Store. Stay away from ES File Manager.", "time": "10-26-2017 08:31 AM", "replies": []}]}]}]}]}]}, {"postID": "post6036283", "text": "Please note if you are switching to a motoz2 play you are going to a midrange phone.. Not a flagship phome", "time": "10-24-2017 01:38 PM", "replies": [{"postID": "post6036951", "text": "Was there a point to that comment?", "time": "10-24-2017 09:09 PM", "replies": [{"postID": "post6037117", "text": "Well for one thing it won't exactly be as well supported as flagship models, and may be using slower components than say iPhones and flagship Androids. The internet downlink may be slower, it may stutter in some more intensive games, etc. But overall it will work most of the time pretty well. It's a known issue wherein some people buy a cheaper low to mid range Android and expect it to be as fast as the latest iPhone, or at least the one from last year, or have as good a camera. Typically, good mid range models are about as good performance wise as a flagship from 2 years prior to release, with possibly some new features added or certain 'premium' features removed. An example would be during the era of the Galaxy S4 and prior, only flagships of Samsung had USBOTG, but now it's pretty common that the middle Galaxy A series also has it, while the J series may or may not depending on model.", "time": "10-24-2017 11:00 PM", "replies": [{"postID": "post6037142", "text": "How so? The Moto Z2 Play and Moto Z Play have been supported just as well as the other Moto Zs.", "time": "10-24-2017 11:49 PM", "replies": [{"postID": "post6037226", "text": "I was talking in a more general mid range setup. Sony and Moto have very good update histories for their mid range, but step outside those two and support becomes murky.", "time": "10-25-2017 01:26 AM", "replies": [{"postID": "post6037614", "text": "And the OP is asking about a Motorola phone....", "time": "10-25-2017 08:45 AM", "replies": [{"postID": "post6037965", "text": "And the OP (me) wasn't asking anything that had anything to do with device performance, either as an absolute or in comparison to anything else.", "time": "10-25-2017 11:34 AM", "replies": []}]}]}]}, {"postID": "post6037443", "text": "I'm still not seeing what that has to do with this or any other question I have asked.", "time": "10-25-2017 06:52 AM", "replies": [{"postID": "post6037878", "text": "Neither do I.", "time": "10-25-2017 10:57 AM", "replies": []}]}]}]}, {"postID": "post6037059", "text": "Other than the camera, most people wouldn't notice the difference. Strange comment though.", "time": "10-24-2017 10:08 PM", "replies": []}]}, {"postID": "post6039571", "text": "google photos should be able to do this.. you just need to select the folders to auto sync. but on sdcard you gotta enable it via photos settings first", "time": "10-26-2017 08:59 AM", "replies": [{"postID": "post6039685", "text": "Nope.https://forums.androidcentral.com/sh...=1#post6032790", "time": "10-26-2017 10:02 AM", "replies": []}]}]}, {"title": "Moto z2 Play not charging with Car USB", "thread": [{"postID": "post6017772", "text": "Hey yall, just got the Moto Z2 play the other day. I was with a friend and my phone battery got low. I plugged into the car usb and later realized it wasn't charging. Is there a reason the charger didn't work? I used the same cord at home and it was fine with a wall outlet.", "time": "10-13-2017 09:46 AM", "replies": []}, {"postID": "post6018789", "text": "without knowing what car charger you were using, there are a few possibilities.\nFirst may be that the charger wasn't powerful enough to charge the phone.\nCar charger may have been off (was the power port [lighter] in the car powered on?, some are off when the car is off).\nPort may not supply power. Some \"ipod\" ports don't supply ample power, but rather are mainly used for data connection to the radio.\nIf it is a vehicle factory (or a port on an aftermarket radio), let us know the vehicle or radio make/model.\nIf it's a \"plug into the lighter\" type plug, see what the amp/volt output rating is. Test with other phone, adapter may be faulty, since your cable is known to be good.", "time": "10-14-2017 12:10 AM", "replies": []}, {"postID": "post6038565", "text": "Under powered charger, insufficient for USB-C charging, perhaps?\nWhat are the output amps of the charger used?", "time": "10-25-2017 05:11 PM", "replies": []}]}, {"title": "Moto Voice and the Z2 Play", "thread": [{"postID": "post5996970", "text": "Does the Moto Z2 Play have the Moto Voice capability, in the Moto app?\nI have read reviews that state Moto Voice is present, but have not been able to conirm. \nI went thru the tutorial for the Moto app, on the Motorola site, but it only covered Camera twist, Flashlight chop and Display.\nI am hoping for the same Moto Voice as was included in the Moto app, on the Moto X Pure Edition 2105.", "time": "09-28-2017 05:07 PM", "replies": []}, {"postID": "post5998361", "text": "If you're referring to the \"show me...\" capability, yes is has that. It also detects when you're driving and will announce calls and messages and prompt you to have it read or ignore the message.", "time": "09-29-2017 09:13 PM", "replies": [{"postID": "post6030319", "text": "That's the part of Moto Voice I use the most, tho I will miss being able to say, \"shama-lama-ding-dong\" to wake my phone. With that wake phrase, my Moto X Pure Edition was never inadvertently awakened. And soon, you'll be able to use \"Hey , Google\".", "time": "10-20-2017 11:28 PM", "replies": []}]}, {"postID": "post6020577", "text": "As the other \"reply\" indicated, Moto Voice is not a fully functional standalone (couldn't even activate Go Google since the launch controller was Moto) it was on my Droid Turbo. I have the Z2 Play now and have found Go Google/ GA (Google Assistant) has required more hands-on interaction and is NOT as hands free as my earlier Moto version (4.0.35)\nIt's the one thing that has soured my feelings about my new purchase of the Z2 Play. I'm waiting for a response from Motorola and their forum if they plan to revitalize Moto Voice.\n*Here is one example of the regression. In GA, I say \"Go Google\" to be in listening mode, I ask to call my local Drug store, GA gives me every store in the chain in the surrounding area and verbally prompts me to \"tap\" the screen to make my voice. Duh!\nIn my Previous Moto version, I used their \"Wake up!\" command to go into listening mode, request a call to the local Drug store (identical verbal command as with GA), Moto assumed I mean the one in my Contacts (not everyone in the area), if there is more than one number in my Contacts, Moto verbally asks me to say \"Call\" after the correct number as it calls out each verbally. Look Ma, no hands!", "time": "10-15-2017 10:45 AM", "replies": []}, {"postID": "post6020578", "text": "As the other \"reply\" indicated, Moto Voice is not a fully functional standalone (couldn't even activate Go Google since the launch controller was Moto) it was on my Droid Turbo. I have the Z2 Play now and have found Go Google/ GA (Google Assistant) has required more hands-on interaction and is NOT as hands free as my earlier Moto version (4.0.35)\nIt's the one thing that has soured my feelings about my new purchase of the Z2 Play. I'm waiting for a response from Motorola and their forum if they plan to revitalize Moto Voice.\n*Here is one example of the regression. In GA, I say \"Go Google\" to be in listening mode, I ask to call my local Drug store, GA gives me every store in the chain in the surrounding area and verbally prompts me to \"tap\" the screen to make my voice. Duh!\nIn my Previous Moto version, I used their \"Wake up!\" command to go into listening mode, request a call to the local Drug store (identical verbal command as with GA), Moto assumed I mean the one in my Contacts (not every one in the area), if there is more than one number in my Contacts, Moto verbally asks me to say \"Call\" after the correct number as it calls out each verbally. Look Ma, no hands!", "time": "10-15-2017 10:45 AM", "replies": []}, {"postID": "post6020696", "text": "There are places in my reply that I used the phrase GO Google which should read OK Google. Sorry for the confusion.", "time": "10-15-2017 12:13 PM", "replies": [{"postID": "post6030319", "text": "That's the part of Moto Voice I use the most, tho I will miss being able to say, \"shama-lama-ding-dong\" to wake my phone. With that wake phrase, my Moto X Pure Edition was never inadvertently awakened. And soon, you'll be able to use \"Hey , Google\".", "time": "10-20-2017 11:28 PM", "replies": []}]}]}, {"title": "Basic Gallery app without auto backup", "thread": [{"postID": "post6017938", "text": "My new Motorola Z2 Play only came with Photos, not with the basic \"Gallery\" I had on my previous phone. Who is the developer and why can't I find it at the play store?\nOnce an app is installed, it's impossible to know the developer. I find this is a great weakness in documentation. I go to Apps under settings on my old phone and there is no info on the developer.", "time": "10-13-2017 11:56 AM", "replies": []}, {"postID": "post6017958", "text": "Welcome to the forums. That was the old Motorola Gallery app, only available for phones running Marshmallow and below.", "time": "10-13-2017 12:09 PM", "replies": []}, {"postID": "post6025863", "text": "I chose the QuickPic app. I've used it before, when I didn't have a gallery app and this one has good permission accessibility.", "time": "10-18-2017 02:41 PM", "replies": []}, {"postID": "post6028318", "text": "Why wouldn't you want to use the Google photos app that came with it?", "time": "10-19-2017 08:34 PM", "replies": [{"postID": "post6029589", "text": "I use both, but QuickPic is more like the standard gallery apps, I'm used to.", "time": "10-20-2017 03:05 PM", "replies": []}]}]}, {"title": "How do I use an SD card for video on my Moto Z2 Play?", "thread": [{"postID": "post6022884", "text": "I want to use my Moto Z2 Play to record the highest quality video as possible and not loose frames while doing so. Right off the bat I'm thinking I should insert a decent SD card with a high mb/s speed. Provided that this approach is correct, how can I ensure that the camera will write high quality video to a high quality inserted SD card?", "time": "10-16-2017 08:19 PM", "replies": []}, {"postID": "post6023091", "text": "Welcome to Android Central! Open the Camera app, tap Menu, then look in the settings for an option to select the default storage location. Make sure SD is selected.", "time": "10-16-2017 10:38 PM", "replies": []}]}, {"title": "Verizon Z2 Play Question", "thread": [{"postID": "post5931204", "text": "I cannot seem to find the \"set launch phrase\" option on a new Verizon branded Z2 Play. When I go to the Moto app, it has voice as one of the three options. It takes you through some steps to recognize the user voice. But at the end of that process there's no \"set launch phrase\" for Moto's always listening features. I've looked in every section of the Moto app, and gone through the initial voice setup several times. Without a specific launch phrase the phone is hobbled....any ideas? Cause I really feel like I'm missing something obvious here. Thanks.", "time": "08-21-2017 06:48 PM", "replies": []}, {"postID": "post5932598", "text": "Show me. The phrase is show me. Show me the weather. Show me my calendar.", "time": "08-22-2017 06:21 PM", "replies": [{"postID": "post5932636", "text": "Ok, so unlike the unlocked z line you can't customize a launch phrase?\nAnd for Moto voice luxuries like \"find my phone\", you have to say \"show me, find my phone\"? Seems clunky to say the least. What about wake from sleep? Has to start with \"show me\"?", "time": "08-22-2017 06:57 PM", "replies": []}]}, {"postID": "post5933037", "text": "For find my phone I think you just say find my phone. The point is there isn't really supposed to be a phrase. You just tell it what you want it to do", "time": "08-23-2017 02:10 AM", "replies": [{"postID": "post5933280", "text": "Hard to believe Verizon messed with something so fundamental. Or maybe this is a new z2 play thing? Really odd.", "time": "08-23-2017 08:26 AM", "replies": []}]}, {"postID": "post5933605", "text": "New Moto voice feature", "time": "08-23-2017 11:51 AM", "replies": [{"postID": "post5934215", "text": "Boy that cripples the phone in spectacular fashion. Not conversationally intuitive and makes zero sense. \nDumb, Moto.", "time": "08-23-2017 04:33 PM", "replies": []}]}, {"postID": "post5934347", "text": "It's meant to perform tasks not be a digital assistant. The phone still has Google assistant for that", "time": "08-23-2017 05:48 PM", "replies": [{"postID": "post5934780", "text": "First of all, I appreciate your help and responses. Thank you.\nAs to the assistant vs. task performer observation, while that may be true it's a distinction without a difference for me. I use my \"wake up Moto\" launch phrase as the gateway to *all* things voice activted on my phone. Tasks, adding to my calendar, searches... everything: it all starts with \"wake up Moto.\" Whether my phone, once awakened, uses Google to handle many/most of my commands I can't say. But as far as my experience goes, Moto voice is the backbone.", "time": "08-23-2017 09:50 PM", "replies": []}]}, {"postID": "post5935179", "text": "Could you change to saying ok Google and have the same level of functionality?", "time": "08-24-2017 02:18 AM", "replies": [{"postID": "post5936746", "text": "I'll see if that works. As recently as last year (if I'm remembering correctly) it was NOT the same level of functionality. Because Moto had the \"always listening\" feature, triggered by a Moto launch phrase, which distinguished it from other phones. So in my case...\"wake up Moto\" literally is used to wake the phone up. \"Ok Google\" could wake up a Nexus device, but not other Android phones, from their sleep state.\nBut it's possible I'm behind the times 😬", "time": "08-24-2017 05:44 PM", "replies": []}]}, {"postID": "post5936874", "text": "Ok Google will wake the phone up", "time": "08-24-2017 06:59 PM", "replies": []}, {"postID": "post6020605", "text": "You aren't missing anything. Tbe latest version of Moto Voice must surrender to OK Google and the newer GA (Google Assistant). I don't know who to blame but If like to whack then up side the head.\nOn my older phone, Droid Turbo, Moto Voice was all things and was truly hands free. Tbe Moto version was 4.o.35. My Z2 Play, \"Show Me\" has limited functionality and the activation of many functions require \"Go Google\".\nGo Google is inferior in terms of hands free operation when compared to the older Wake Up Moto version and often requires you to \"tap\" tbe screen. Your indifferences to whether the older version handed of some functions to OK Google is somewhat valid. On my Droid Turbo, if I did go to activate the voice features of \"GO Google\", it would not allow it to happen. It's because the app launcher was all controlled by Moto. So, I assumed OK Google was shut off (still could use the Microphone icon to search, etc., which is independent in many ways from GO Google).\nSo, my friend, we are not crazy. A superb, hands free environment has been mucked up. If enough of us complain to Motorola, maybe they will restore Moto (Voice) to its previous glory. GO Google requires too much hands on, \"hands free\" operation.\nIf you can find my post, I have a couple of real world examples of how Moto used voice to resolve situations that Go Google requires screen touches.", "time": "10-15-2017 11:08 AM", "replies": []}, {"postID": "post6020606", "text": "You aren't missing anything. Tbe latest version of Moto Voice must surrender to OK Google and the newer GA (Google Assistant). I don't know who to blame but If like to whack then up side the head.\nOn my older phone, Droid Turbo, Moto Voice was all things and was truly hands free. Tbe Moto version was 4.o.35. My Z2 Play, \"Show Me\" has limited functionality and the activation of many functions require \"Go Google\".\nGo Google is inferior in terms of hands free operation when compared to the older Wake Up Moto version and often requires you to \"tap\" tbe screen. Your indifferences to whether the older version handed of some functions to OK Google is somewhat valid. On my Droid Turbo, if I did go to activate the voice features of \"GO Google\", it would not allow it to happen. It's because the app launcher was all controlled by Moto. So, I assumed OK Google was shut off (still could use the Microphone icon to search, etc., which is independent in many ways from GO Google).\nSo, my friend, we are not crazy. A superb, hands free environment has been mucked up. If enough of us complain to Motorola, maybe they will restore Moto (Voice) to its previous glory. GO Google requires too much hands on, \"hands free\" operation.\nIf you can find my post, I have a couple of real world examples of how Moto used voice to resolve situations that Go Google requires screen touches.", "time": "10-15-2017 11:08 AM", "replies": []}, {"postID": "post6020608", "text": "See my other reply. Please contact Motorola and complain. Tbe Z2 Play version of Moto and it's reliance on Go Google sucks in comparison to the older version of Moto (4.0.35)", "time": "10-15-2017 11:10 AM", "replies": []}]}, {"title": "Can't update dp on what's app", "thread": [{"postID": "post6014743", "text": "Can't update dp on what's app from photo gallery. It directly take you to camera without giving option of photo gallery.", "time": "10-11-2017 02:36 AM", "replies": []}, {"postID": "post6016280", "text": "Problem got solved.", "time": "10-12-2017 07:06 AM", "replies": []}]}, {"title": "How many hours are you getting for screen on time on your z2 play?", "thread": [{"postID": "post6012799", "text": "Title is self-explanatory, I want to make sure I'm not losing too much compared to z play. Thank you", "time": "10-09-2017 06:06 PM", "replies": []}, {"postID": "post6013766", "text": "this may be a near pointless question, unless people include what brightness level they keep their screen at, whether they have Bluetooth turned on all day for headsets or smart watches, how long they are on the phone for calls, if they have location enabled, etc.\nEven many of those things drain battery with the screen off, it still affects the amount of screen time possible in any full charge cycle.", "time": "10-10-2017 12:35 PM", "replies": []}, {"postID": "post6014016", "text": "gee, speaking of pointless, thanks for the helpful reply, I do pretty much know what I'm talking about, but if you think you're helping me then fine . . . I would generally expect people to sketch their typical usage along with their answer but didn't think I needed to spell that out", "time": "10-10-2017 03:20 PM", "replies": []}, {"postID": "post6014070", "text": "Revtech, my apologies, my hastily typed reply wasn't meant as a criticism of your question, but I can see how it came across that way due to the \"pointless\" remark, so I accept your wrist slap.  I should have phrased differently.\nFwiw, the sentiment just stems from the many long battery threads I've seen that weren't as helpful as they could have been for those of us trying to diagnose poor battery life (which I realize isn't your situation).\nAgain..sorry for my poor choice of words.", "time": "10-10-2017 03:50 PM", "replies": []}, {"postID": "post6014091", "text": "I've been surprised because of the smaller battery in the z2 I was expecting to see alot of those battery threads you mentioned but I haven't seen any helpful ones in this forum yet . . no sweat on the apology, I was probably just as snarky but yes the word \"pointless\" kinda set me off but I can tell now you're a decent guy, so my turn to apologize now 🙄 . . . Either way I'd still like to know if the z2 play gets through a heavy usage day or not, I don't care about \"two-day\" battery life, but I'd like to think it still gets through the day with lots to spare . . I've read the reviews but was looking for some real world over time usage numbers", "time": "10-10-2017 04:08 PM", "replies": []}, {"postID": "post6014130", "text": "Well, I'm further embarrassed to tell you I'm not even a Z2 Play user, though I seriously considered one a few weeks back due to dismal battery life collapse on my Moto Droid Turbo 2, which has a huge battery. After reading the same reviews you probably did of Z2 Play and Force Edition, I concluded Z2 Play would be the optimal choice on both cost and battery life, despite its battery size reduction. I'm not afraid of smaller batteries *if* overall power draw is better managed, esp. screen draw. (The 720p 2013 Droid Maxx was a brilliantly balanced design in this respect.)\nHopefully lack of battery discussions is a sign of high satisfaction with battery life on this new model. Since the very launch of the 2015 Droid Turbo 2 I have, there've been seemingly constant threads due to many owners not seeing anywhere near the Verizon and Moto touted numbers, e.g. <2 hrs screen time, while others loving life at 5+ hrs screen time. Nougat update seemed to drive many of us down even further. I've come to suspect the DT2 suffered a batch of bad original batteries, and/or a power draining bug in the radio software stack. \nFWIW, I wound up having a $70 OEM battery replacement installed on my DT2, and now getting 14+ hour standby and 3 hour screen times far beyond any I had even when it was new, as measured by GSam Battery Monitor Pro. I'm a pretty heavy user, frequent Bluetooth, high power location services, Moto Voice enabled, etc.\nI'm hopeful to hear that your two year newer Z2 Play sees even better numbers than those. Good luck!", "time": "10-10-2017 04:34 PM", "replies": []}, {"postID": "post6014583", "text": "With WiFi, Bluetooth, precise location, medium brightness, 3 push email accounts with 100 messages a day, 150 texts, and what I would call average use I get 6 hours of screen on time as reported by GSAM and generally cannot kill the battery in a single day. Best battery life on a phone I have ever seen. I bought the battery mod and never use it.", "time": "10-10-2017 11:14 PM", "replies": []}, {"postID": "post6015154", "text": "With Wi-Fi on, three email accounts with probably around 50-75 total messages a day, checking news, a few videos, no gaming, but screen on for at least half the time, at end of ~12 hour day, my Z2 Play, unlocked on VZW, has about 60-70% battery remaining. It's much better than my unlocked Moto X Pure ever was, and certainly reasonable for a relatively small battery.", "time": "10-11-2017 10:49 AM", "replies": []}]}, {"title": "I must say I'm enjoying this phone", "thread": [{"postID": "post5982528", "text": "Just picked this phone up from Best buy. Bought it outright. And I must say I'm really liking this thing. It's fast ,has great battery life and the Moto gestures are a great idea. Great daily driver/backup device for sure!", "time": "09-19-2017 05:58 AM", "replies": []}, {"postID": "post5983358", "text": "I love mine too.", "time": "09-19-2017 03:52 PM", "replies": []}, {"postID": "post5984599", "text": "Thank you for the positive review! What do you like most about it?", "time": "09-20-2017 10:04 AM", "replies": []}, {"postID": "post5986697", "text": "I like the speaker mod and the Motorola turbo battery mod, it's awesome.", "time": "09-21-2017 01:08 PM", "replies": [{"postID": "post5986821", "text": "Awesome! What kind of battery power do you get with the battery mod?", "time": "09-21-2017 02:26 PM", "replies": []}]}, {"postID": "post5986836", "text": "look at my post on the thread Battery Mod.", "time": "09-21-2017 02:36 PM", "replies": [{"postID": "post5986851", "text": "Will do!", "time": "09-21-2017 02:46 PM", "replies": []}]}, {"postID": "post5989964", "text": "For the money it is hard to imagine a more satisfying phone or a better value.", "time": "09-23-2017 10:07 PM", "replies": [{"postID": "post5991430", "text": "Agreed. The Play series has had my attention for a while now. Moto is a solid brand. Makes one hopeful and excited for the Z3 Play!", "time": "09-24-2017 09:35 PM", "replies": []}]}, {"postID": "post6014328", "text": "I've had my unlocked, for US carriers version for a couple days and am liking it. It seems to have better battery life than my Moto X Pure Edition, when it was new, with the same usage throughout the day.\nIt's nice and slim, too.", "time": "10-10-2017 07:12 PM", "replies": []}]}]
[{"title": "Camera question", "thread": [{"postID": "post5996451", "text": "Hello everyone long time moto fan boy since Droid OG.. I'm coming from the OG turbo.. This phone is snappy and smooth to use.. Apps are running great battery life Is great! But the camera sucks! The screen is not so great.. But I'll take it over a battery hog 4k screen.. The camera though.. I've never had a great phone camera since I've only owned Motorola androids.. The the OG turbo 21mp shooter was much better.. So was the camera app too..\nAnyone have any tips on getting better shots with this thing? I turned off auto HDR because that automatically made pictures more grainy..\nThanks!", "time": "09-28-2017 10:03 AM", "replies": []}, {"postID": "post5997356", "text": "The camera certainly isn’t flagship quality but I have found it to be pretty solid in decent light. It does have a very strange over sharpening effect which is especially noticeable when taking pictures that have a dark foreground item in front of a bright background. Not sure that is possible to disable....", "time": "09-29-2017 12:28 AM", "replies": []}, {"postID": "post5997763", "text": "Yes it fails completely with a dark foreground", "time": "09-29-2017 10:51 AM", "replies": []}]}, {"title": "Cases", "thread": [{"postID": "post5886102", "text": "Hey all. Just got my z2 Play. First time using a Moto mod phone. How do cases work with this? What case is everyone using?", "time": "07-15-2017 08:29 AM", "replies": []}, {"postID": "post5886508", "text": "Cases only work with no mods attached. They work like any other phone. I'm not using a case. I'm using an Incipio off-grid power pack with wireless charging", "time": "07-15-2017 04:16 PM", "replies": [{"postID": "post5887892", "text": "I have the exact same power pack and I'm using a bumper case", "time": "07-16-2017 10:54 PM", "replies": []}]}, {"postID": "post5888155", "text": "Could you link the bumper you are using?", "time": "07-17-2017 08:03 AM", "replies": [{"postID": "post5889134", "text": "I +1 this post, for sure! I'd love to see the case!", "time": "07-17-2017 09:09 PM", "replies": [{"postID": "post5890283", "text": "I don't have the link handy, but I found the bumper case on Verizon's website. Still waiting for it to be delivered.", "time": "07-18-2017 06:51 PM", "replies": [{"postID": "post5890296", "text": "No problem at all! Hope it comes soon for you!", "time": "07-18-2017 07:01 PM", "replies": []}, {"postID": "post5890419", "text": "Is it just the BUMPER at Verizon?", "time": "07-18-2017 08:55 PM", "replies": []}]}]}]}, {"postID": "post5888223", "text": "There are \"classic\" cases that block the ports. There are also the \"bumper\" cases that are compatible with the mods.", "time": "07-17-2017 08:58 AM", "replies": []}, {"postID": "post5940916", "text": "Well, that was a harrowing experience. I'll blame this on the USPS, but Verizon's system kept changing my address (more specifically my zip code) as soon as I hit \"submit\" on my order. Didn't notice the first time until it said couldn't be delivered. 2nd time I placed the order over the phone with a Verizon rep. Did it to him too. 3rd time I just used my parents address. . In retrospect, I should have just gone to the store that was halfway between my house and my parents in the first place. \nIt did arrive. I like the feel of it, and the mods do indeed just pop on the back like always, but it's got a lip around it, which has the benefit of protecting the screen in DND \"glass down\" mode, and the lip on the back keeps it just off the camera bump. \nIt protects it in the right places. It just feels a little weird when there isn't a mod on it, since it's this super thin phone with a fairly prominent set of ridges top and bottom.", "time": "08-27-2017 04:53 AM", "replies": []}, {"postID": "post5956064", "text": "I'm using the Verizon bumper with the cloth back. works good gives me good grip.", "time": "09-04-2017 05:12 PM", "replies": []}, {"postID": "post5969349", "text": "Recently picked up a Z2 Play and loving it. Cases though, I pretty much need a flip case to protect the screen as it's my work phone. I'm amazed there are no Moto Mod cases, it a flip case that clips on. I've got a traditional flip case for now, but I can see it's going to get annoying when I get a phone mount and other mods.\nI think I might try and make my own case. Get a wireless charging style shell and attach it to a flip case.", "time": "09-11-2017 04:41 PM", "replies": [{"postID": "post5969861", "text": "The Marstak flip cases do attach magnetically. They are discussed in the Moto Mods Forum and you can read about it here.\nI have several and it really helps \"iiving the mod life\" so I can easily take it off to use the vehicle dock or any other mod and put it back on without any struggle.", "time": "09-11-2017 11:36 PM", "replies": [{"postID": "post5970058", "text": "Thanks for the link, that's exactly what I am after! Unfortunately for me, apparently Amazon don't ship that to Australia, go figure. Struggling to find them elsewhere.", "time": "09-12-2017 04:37 AM", "replies": []}]}]}, {"postID": "post5992009", "text": "What is the purpose of the cutouts for the rear connector pins on aftermarket cases, like this one?https://www.amazon.com/dp/B0724ZT8HX...cUvbUpU5992009\nI would think the thickness of the case would impede connection of any mod.", "time": "09-25-2017 11:13 AM", "replies": []}, {"postID": "post5992082", "text": "It does prevent mods the cutout is stupid.", "time": "09-25-2017 12:18 PM", "replies": [{"postID": "post5992137", "text": "Ok, that's what I thought, but I was trying to keep an open mind. 😉\nAre you still pleased with the Verizon bumper?\nHow about a pros / cons list for it?\nWhere did you purchase the bumper and style shell?", "time": "09-25-2017 12:49 PM", "replies": []}]}, {"postID": "post5994061", "text": "I like the bumper I bought it at the local Verizon store. You can change mods with the bumper on the phone.", "time": "09-26-2017 04:36 PM", "replies": []}]}, {"title": "Call forwarding on Verizon?", "thread": [{"postID": "post5897221", "text": "Is there anyway to set up call forwarding on this phone? I can't find the options in the phone app.", "time": "07-23-2017 11:16 PM", "replies": []}, {"postID": "post5897228", "text": "http://forums.androidcentral.com/e?l...token=UOatrIRU\nAlso found in my Verizon App. Saw it the other day.", "time": "07-23-2017 11:33 PM", "replies": [{"postID": "post5901031", "text": "Perfect, thank you for that", "time": "07-26-2017 08:18 PM", "replies": []}]}, {"postID": "post5992918", "text": "Isn't it the same, on just about everything land and cellular?\nDial *72, enter number to be forwarded to, hear tone, done.\nCancel by dialling *73\nIs the another way?", "time": "09-25-2017 10:56 PM", "replies": [{"postID": "post5993022", "text": "I'm pretty sure it's *71 followed by the number to forward a call. I've never used *72 so maybe that works I don't know.", "time": "09-26-2017 01:53 AM", "replies": []}]}]}, {"title": "Why is my Moto Z2 Play not turning on?", "thread": [{"postID": "post5930004", "text": "I was out and about and i had my phone with me, the battery was about half way charged. I went to check it and i guessed it overheated and turned off but i've been out of the heat for an hour or two and its been charging. When plugged in, a white led flashes but the phone won't turn on still. I tried holding it for 20 seconds, even 30, still won't turn on and i don't know what to do.", "time": "08-20-2017 05:14 PM", "replies": [{"postID": "post5992927", "text": "Well, what happened?", "time": "09-25-2017 11:06 PM", "replies": []}]}, {"postID": "post5931233", "text": "Welcome to Android Central! Plug it into a wall outlet and let it charge for at least 6 hours, undisturbed. Then try powering on again.", "time": "08-21-2017 07:12 PM", "replies": []}]}, {"title": "Moto Z2 Play Availability", "thread": [{"postID": "post5835582", "text": "Say Hello to New Possibilities with Moto Z² Play and Moto Mods - The Official Motorola Blog", "time": "06-01-2017 12:51 PM", "replies": []}, {"postID": "post5841437", "text": "Anyone hear any news about its Canadian release?", "time": "06-06-2017 09:09 PM", "replies": [{"postID": "post5841454", "text": "\"This summer\"", "time": "06-06-2017 09:28 PM", "replies": [{"postID": "post5841471", "text": "Better than nothing! Haha.🤣", "time": "06-06-2017 09:53 PM", "replies": []}]}]}, {"postID": "post5841872", "text": "Already available in Brazil. All reports from real users are very positive. Battery life is pretty good, smooth and fast performance and the camera is better than in the Z Play. It seems that Lenovo did it again, excellent mid-range.", "time": "06-07-2017 07:00 AM", "replies": []}, {"postID": "post5852281", "text": "I'm really looking forward to this one. As soon as it comes out in Canada, my S7 is going up for sale to clear my contract and I'm getting the Z2 Play!", "time": "06-16-2017 06:31 AM", "replies": [{"postID": "post5889140", "text": "Did you end up getting it yet, or has it not come out yet for us patient Canadians?", "time": "07-17-2017 09:11 PM", "replies": [{"postID": "post5889471", "text": "Ha ha! \nI got a Pixel instead. I went to the only carrier in my province that was supposed to have it and not only was it $200 more than a 128GB Pixel at another carrier, they didn't even have them in stock yet. Since then, they cut the price to $0... really bad marketing! It's a shame but I don't regret getting my Pixel", "time": "07-18-2017 07:34 AM", "replies": [{"postID": "post5889510", "text": "Wow! That's a bummer! But I'm glad you like your Pixel! Which carrier did you go to, if you don't mind me asking? I'm not sure if my carrier, Rogers, will sell them.", "time": "07-18-2017 08:16 AM", "replies": [{"postID": "post5889514", "text": "In Quebec, the only carrier that has the Z2 Play is Bell. There are 3 more in Canada but Rogers isn't one of them.\nBut the Pixel I got was with Rogers.", "time": "07-18-2017 08:18 AM", "replies": [{"postID": "post5890293", "text": "Ahhh you're in Québec?! I was born there! I'm glad you got the Pixel! It's a really good phone.", "time": "07-18-2017 07:00 PM", "replies": [{"postID": "post5890897", "text": "I am (the province, not the city, just to be clear ). I'm always happy to see other Canadians here! \nFor the Pixel it is an awesome phone. The Z2 Play would have been good too but stock Android and timely updates, you have to appreciate that!", "time": "07-19-2017 08:05 AM", "replies": [{"postID": "post5890921", "text": "I gotcha! Cool beans! It's a beautiful province! Same here! \nI agree - you gotta appreciate stock Android. I do miss that from my Nexus 5.", "time": "07-19-2017 08:17 AM", "replies": []}]}]}]}]}]}]}]}, {"postID": "post5992922", "text": "Are these shipping regularly, from Motorola, now?", "time": "09-25-2017 11:00 PM", "replies": []}]}, {"title": "Battery mod", "thread": [{"postID": "post5920532", "text": "Does the battery mod cover the speaker making it hard to hear?", "time": "08-11-2017 01:05 PM", "replies": []}, {"postID": "post5920547", "text": "No. I'm pretty sure the speaker is on the front of this phone, so the battery mod does not cover it.", "time": "08-11-2017 01:18 PM", "replies": [{"postID": "post5921079", "text": "To be more specific, the speaker is also the \"earpiece\" at the top of the phone. The battery mod does not affect this at all.", "time": "08-12-2017 01:06 AM", "replies": [{"postID": "post5921766", "text": "This is great to know! Thanks!", "time": "08-12-2017 06:35 PM", "replies": []}]}]}, {"postID": "post5921276", "text": "Thanks. I ordered a z2 play from Motorola with free jbl speaker mod", "time": "08-12-2017 09:09 AM", "replies": [{"postID": "post5921775", "text": "Congrats on the new phone. Seems like another home run in the Z Series. I really like my JBL Mod, cones in very handy.", "time": "08-12-2017 06:45 PM", "replies": []}, {"postID": "post5921778", "text": "Let us know how you like it!", "time": "08-12-2017 06:47 PM", "replies": []}]}, {"postID": "post5986728", "text": "I like the phone speaker mod is great.\nI really like my Motorola turbo battery mod. Nice rubber textured back. Tale it off and on with Verizon's bumper case. Also can charge just the battery mod or both phone battery and mod.\nIt will charge phone first then the battery mod. In efficiency mod when the phone gets down to 80 percent it switches to battery mod when it's dead back to phone battery.\nI'm getting 1 1/2 days off battery mod then charge so my internal battery should last for years 😀😀", "time": "09-21-2017 01:23 PM", "replies": []}, {"postID": "post5991903", "text": "How much size / bulk does the battery mod add to the phone?\nWill it still go in and out of a regular jeans pocket, easily?", "time": "09-25-2017 09:39 AM", "replies": []}, {"postID": "post5992090", "text": "It ads some thickness and weight.\nBut still fits in your pocket.", "time": "09-25-2017 12:19 PM", "replies": []}]}, {"title": "Chrome home page", "thread": [{"postID": "post5977099", "text": "Looking for a little help. I have the Z2 Force and my wife has the Z2 Play. We have the same version of Chrome, but she does not have the setting to add a home page. Pics below, mine first. Any help would be appreciated.", "time": "09-15-2017 06:37 PM", "replies": []}, {"postID": "post5977210", "text": "it's a server side update, I think clearing the cache&data would solve the problem.", "time": "09-15-2017 07:47 PM", "replies": []}, {"postID": "post5977237", "text": "I'll have to search how to do that, new to Android. I saw my daughter's G5 Plus is the same as my wife's. Theirs are unlocked while mine is with At&T, I didn't know if that has anything to do with it either.", "time": "09-15-2017 07:57 PM", "replies": []}, {"postID": "post5980298", "text": "My unlocked z2 play doesn't have it either.", "time": "09-17-2017 08:00 PM", "replies": []}, {"postID": "post5983409", "text": "open chrome go to the page you want for a home screen.\nNow press on the 3dots in the upper right corner and press add to home screen.\nworked for me!!", "time": "09-19-2017 04:17 PM", "replies": [{"postID": "post5983500", "text": "The OP is asking about an option in Chrome to set a home page (i.e., you tap a Home button for the browser and it brings up your selected home page, or that home page appears when you open a new tab). The option you're pointing out is how to create a website shortcut on the phone's homescreen.\nAs far as I know, that hasn't been an option in the stable Chrome. It's an option for the Chrome that comes preinstalled in Samsung phones (or at least it was at one point). Which version of Chrome are you using, @CaymanDreamin, and did it come preinstalled on the phone, or did you install it yourself?", "time": "09-19-2017 05:09 PM", "replies": [{"postID": "post5983929", "text": "It came installed, screenshot of version is below. Mine is through AT&T, while my wife's and daughter's phone are unlocked.", "time": "09-19-2017 10:01 PM", "replies": []}]}]}, {"postID": "post5983537", "text": "I tested it and it makes that the home page in chrome.\nchrome came installed on my z2 play version 61.03163.81", "time": "09-19-2017 05:30 PM", "replies": []}, {"postID": "post5983788", "text": "it did add it to my home screen and chrome. I removed it from home screen and it stayed as home in Chrome. Strange", "time": "09-19-2017 07:57 PM", "replies": []}, {"postID": "post5984048", "text": "That's interesting -- I know that the preinstalled Chrome on Samsung devices did this, but I didn't realize Moto was doing the same. Does your preinstalled Chrome also update through the Play Store like all of your other apps?\nEDIT: I just checked my old Honor 5X (which also has Chrome preinstalled), and that also has a Homepage option. But none of my Google devices (Nexus 5 & 7, Pixel XL) have it. I guess it's a modification made by the phone manufacturer, maybe?\nOn your wife's Z2 Play, was Chrome preinstalled there as well, or is there a separate stock browser?", "time": "09-19-2017 11:41 PM", "replies": []}, {"postID": "post5984292", "text": "Yes it updates like all my other apps thru the play store.", "time": "09-20-2017 06:22 AM", "replies": []}]}, {"title": "Battery life question", "thread": [{"postID": "post5921342", "text": "So battery life on my Z2 has been nothing short of awesome. I can easily get through a normal day (normal for me). In fact my average per-hour drain is around 2% (2.5% if I really push it). I'm not playing games on it but using it for browsing, phone calls, email, calendar. So no complained about a running averaging 35-40 hours.\nBut, the biggest battery drain by far is \n-Cell Standby 19% according to Android OS \n-Phone Radio 44% according to GSAM\nThe phone radio awake time is 100% which I suppose makes sense. I would not want the phone actually disconnecting from cellular. But that still seems high. My last monitoring session had over 5 hours of screen on time and still screen power use was half of the phone radio power use.\nCellular signal is poor where I live and work but am connecting to strong wifi almost all of the time in both places.\nOn one hand I am super happy with overall battery life. One the other hand I wonder if it could be even better without the phone radio drain? \nWhat is everyone else seeing?", "time": "08-12-2017 10:44 AM", "replies": [{"postID": "post5921377", "text": "I'm on the OG Z Play, so I can't speak to user experience on the Z2. However, since it sounds like you've identified your main issue (i.e., poor signal), you may want to force the phone onto its non-LTE radios and use those. A great app to do this is called \"Radio Switcher\" in the Play Store. \n*Generally speaking*, the 4G/HSPA signal is stronger in most locations than LTE is. Using the non-LTE radios also has the added benefit of saving you some juice, as the LTE radios drain your battery a bit faster. Doing this MIGHT alleviate your drain issues. Downside: data speeds are a bit slower, though I use 4G regularly to stream audio and video with no issues.\nGlad to hear the phone is treating you well overall. I just recommended the Z2 Play to a friend and will likely upgrade to it myself sometime in the next several months. Good luck!", "time": "08-12-2017 11:24 AM", "replies": []}]}, {"postID": "post5921409", "text": "thanks! I will try changing the radio settings and see what happens. and yes, loving the phone!", "time": "08-12-2017 11:56 AM", "replies": [{"postID": "post5921454", "text": "Sure thing. If you have any questions about using the app feel free to ask. It works well, but it's not the most user friendly interface.", "time": "08-12-2017 12:25 PM", "replies": []}]}, {"postID": "post5929620", "text": "I have tried changing the network settings to avoid LTE but it didn't seem to make much difference. Overall battery life is still excellent but the standby drain is higher that I expected. Phone radio is powered on as soon as the phone starts up and stays on until the entire phone is powered off. Doze mode is working but the radio never sleeps. Which may be totally normal?\nDoes anyone use GSAM? can you verify your radio on time is the same as phone on time is? I.e. radio always on?", "time": "08-20-2017 10:15 AM", "replies": [{"postID": "post5929707", "text": "Out of curiosity, when you say it \"didn't seem to make much difference\"...did the signal itself become a bit stronger and you still saw the battery drain? Or was the signal strength the same along with the battery drain?", "time": "08-20-2017 11:58 AM", "replies": []}]}, {"postID": "post5930230", "text": "The latter. Signal strength seemed to be roughly the same as was battery drain. The real issue seems to be that the phone radio never sleeps....it runs nonstop.", "time": "08-20-2017 10:36 PM", "replies": []}, {"postID": "post5933785", "text": "Have you tried activating Wi-Fi calling?", "time": "08-23-2017 01:01 PM", "replies": []}, {"postID": "post5969333", "text": "I got a Z2 play a few days ago. I've noticed that for some reason in the battery use display my reception is mostly always poor or worse. Even though this isn't the case, I can have full strength all day long and it still shows as poor signal.", "time": "09-11-2017 04:35 PM", "replies": []}]}, {"title": "Value for money", "thread": [{"postID": "post5847563", "text": "Its one of the best phone by Motorola. Worth the money you pay because the camera quality is amazing and 4 GB ram with many Motorola mods features can be incorporated. Even the look is amazing!!!!", "time": "06-12-2017 04:36 AM", "replies": []}, {"postID": "post5854504", "text": "$500 is a bit overpriced i feel so value for money factor is average. $400 would be the correct price for this.", "time": "06-18-2017 05:09 AM", "replies": [{"postID": "post5858416", "text": "Based on your post history, everything is overpriced.", "time": "06-21-2017 01:13 PM", "replies": []}]}, {"postID": "post5859493", "text": "I think the phone looks good. I love the idea of the Moto mods", "time": "06-22-2017 11:01 AM", "replies": [{"postID": "post5860422", "text": "Love the idea, hate the price of the mods.", "time": "06-23-2017 02:53 AM", "replies": []}]}, {"postID": "post5867739", "text": "@ $408.00 at Verizon, this is tempting me...", "time": "06-29-2017 10:38 AM", "replies": []}, {"postID": "post5921769", "text": "It's at a very good price indeed! Great phone!", "time": "08-12-2017 06:40 PM", "replies": []}, {"postID": "post5921900", "text": "$408 at Verizon and that include free JBL mod via rebate. Seems like a very good value to me.", "time": "08-12-2017 10:30 PM", "replies": []}, {"postID": "post5924079", "text": "IMO the z2 play provides much better value for money when compared to the z2 force. Double the price for a 2nd black and white camera, shatterproof screen (that scratches super easily), and a faster processor. Not to mention a smaller battery. \nI don't do anything incredibly resource intesnive and would take a glass screen, larger battery, and mid range process for $408 any day", "time": "08-15-2017 07:57 AM", "replies": []}, {"postID": "post5925536", "text": "It doesn't feel any less snappy than my fiance's new S8. In fact in some things, it seems to respond quicker, and all other things equal, I get nearly 35% more life out of the battery between our phones.\nWhen I picked it up, Verizon was running a deal on it where it was $10/mo after monthly bill credit. That's $240 for the phone and I still got the jbl speaker mod through motorola. Even in the 400-500$ range, it's a good phone. Looking at the specs between the Z2Play and the Z2Force, the tech in me wants to upgrade to the more powerful one. The practical father in me says \"this runs great as it is!, what benefit would you get doubling the price of it?\"", "time": "08-16-2017 12:10 PM", "replies": []}, {"postID": "post5925814", "text": "The lack of headphones Jack and smaller battery are what kept me from the force. And many reviews and forums saying the screen scratches super easy. Like with your fingernails easy.", "time": "08-16-2017 04:37 PM", "replies": []}, {"postID": "post5926001", "text": "I agree - the Z2 play feels as fast in normal operations as any of the flagships and frankly less laggy than the high-end Samsungs. Moto did a nice job with the software.", "time": "08-16-2017 09:05 PM", "replies": [{"postID": "post5967882", "text": "Couldn't agree more! Motorola is very underrated which is very unfortunate. Glad you are enjoying your Z2 Play!", "time": "09-10-2017 05:39 PM", "replies": []}]}]}, {"title": "Security update", "thread": [{"postID": "post5952465", "text": "My Z2 decided to download a security update this morning: NDSS26 118-23-4.\nIt said installation would take about 10 minutes and that seems to be accurate. I am always a little nervous about Android updates but I went ahead anyway.\nSo far, no changes that I can see. Security patch level still says August 1, 2017, so whatever was fixed was apparently to fix issues with the first update (NDSS26-118).\nBattery life for me actually improved after the NDSS26-118 update so fingers crossed for either more improvement or at least the same battery life as before.\nI had read that Motorola/Lenovo was very slow with updates but so far that does not seem to be true with the Z2 Play.", "time": "09-02-2017 09:59 AM", "replies": []}, {"postID": "post5953098", "text": "Installing the update right now. I'm OK with slow OS level updates, as long as the security updates keep rolling in at a respectable rate.\nI read a while back (can't source it right now  ) that was Blackberries play with their Android OS security updates. Keep the current OS as updated and secure as possible. Even early on they were getting the security patches out at the same pace that Google themselves were getting them to their Nexus devices, and then hold off on the new OS until they can make sure that it's just as secure if not more.", "time": "09-02-2017 06:29 PM", "replies": []}, {"postID": "post5953119", "text": "keep in mind that security updates system has a different approach that eases updates to be delivered, I have an old device (P8 lite) which stopped receiving system updates long ago yet it still receives security updates.", "time": "09-02-2017 06:52 PM", "replies": []}]}, {"title": "Unlocked Moto Z2 Play 64/4 now available for ordering at $499", "thread": [{"postID": "post5902406", "text": "I am glad that it is available unlocked unlike last year's but $500 is a bit high, IMO.https://m.androidcentral.com/you-can...d-moto-z2-play", "time": "07-27-2017 11:06 PM", "replies": []}, {"postID": "post5902415", "text": "Compatible with all US carriers!", "time": "07-27-2017 11:14 PM", "replies": [{"postID": "post5902912", "text": "Yeah that's what I meant, not a Verizon exclusive like last year. Guess their exclusivity contract ended.", "time": "07-28-2017 10:35 AM", "replies": []}, {"postID": "post5922264", "text": "Ry, when they make this claim can you really rest assured the radios are properly tuned for maximum signal strength on a given carrier...say, Verizon? Or to be certain do you really need to buy the carrier-branded version just to be safe?", "time": "08-13-2017 10:21 AM", "replies": [{"postID": "post5922276", "text": "I wonder that as well. I have seen posts from people buying unlocked phones and then finding that certain features like wifi calling or visual vice mail didn't work on Verizon properly. Maybe those people just don't know how to setup/install the phone for Verizon?", "time": "08-13-2017 10:36 AM", "replies": [{"postID": "post5922304", "text": "Yeah, the features I know about...and I usually assume those won't work. But I've also seen instances where the specs claim the proper bands are supposedly present but users claim their signal isn't as strong as they feel it should be (in comparison with a carrier-branded device). So, not sure if the carriers do some additional fine tuning for reception...as opposed to unlocked which may not get the fine tuning.", "time": "08-13-2017 11:05 AM", "replies": []}]}]}]}, {"postID": "post5922195", "text": "Ordered mine from Motorola on July 29. Still sitting in \"order approved\" category on order status page. Says expected delivery Aug 18. Anyone share their ordering timeframe experiences? Does this seem about right?", "time": "08-13-2017 09:00 AM", "replies": [{"postID": "post5924815", "text": "I ordered mine on 8/10, and was given an estimated delivery date of 8/22, but as of right now it's still sitting in the \"order approved.\" This is my first time ordering through Motorola direct, so I unfortunately have no idea what to expect.", "time": "08-15-2017 09:05 PM", "replies": [{"postID": "post5924895", "text": "With mine still in \"order approved\" status, I'm guessing it won't be here on estimated delivery date of 8/18. I called the customer support - they were no help, just repeated the info on the order status page. Arrgh.", "time": "08-15-2017 11:04 PM", "replies": []}]}]}, {"postID": "post5923004", "text": "I ordered mine from Motorola on 8/11 ship date shows 8/23.", "time": "08-14-2017 06:44 AM", "replies": []}, {"postID": "post5925906", "text": "I am in the same boat. Stuck in \"order approved\" since Aug. 5th. ETA of 8/21. If anyone get's their device marked as shipped please let us know.", "time": "08-16-2017 06:53 PM", "replies": []}, {"postID": "post5925969", "text": "Same boat here ... ordered on 8/6 with ETA of 8/21 and currently in \"order approved\" status as well. I'll respond here if I get any more information.", "time": "08-16-2017 08:23 PM", "replies": []}, {"postID": "post5926073", "text": "Just talked again to customer service - they continue to assure me I will get it on 18th. We'll see..... I'll advise if anything updates....", "time": "08-16-2017 10:34 PM", "replies": [{"postID": "post5928056", "text": "I hope you are enjoying your phone today, but I have a feeling you did not get it.", "time": "08-18-2017 06:24 PM", "replies": []}]}, {"postID": "post5928236", "text": "Nope. Talked again to \"the orders team\". They said they have no idea when it will ship, but will let me know as soon as possible. They have had a very large response to the free JBL, and they're behind in production. That's what they said...", "time": "08-18-2017 11:20 PM", "replies": []}, {"postID": "post5931729", "text": "My order moved to device being built.", "time": "08-22-2017 04:40 AM", "replies": []}, {"postID": "post5932469", "text": "Found a thread on the Lenovo forums about others having shipping issues. Nice to know we're all in the same boat. :\\ https://forums.lenovo.com/t5/Moto-Z-...y/td-p/3765669", "time": "08-22-2017 04:38 PM", "replies": []}, {"postID": "post5932670", "text": "Got notice that mine is shipping. Fedex manager says label created but not yet in Fedex's possession.", "time": "08-22-2017 07:46 PM", "replies": []}, {"postID": "post5932688", "text": "Well, mine ordered on July 29. After numerous calls, chats, escalations to higher levels of \"order team\", my order is still listed as \"Order Approved\", just as it's been since July 29. My estimated delivery date is still listed as August 18. No phone, no information - worst customer service I've seen in a long time.\nI wonder if color choice affects production? Mine is gold/white - if I ever get it....", "time": "08-22-2017 08:09 PM", "replies": []}, {"postID": "post5932718", "text": "I order one White and one Black. My order status has not changed, still shows \"order approved\". I just got an email saying it shipped and fedex manager saying label printed.", "time": "08-22-2017 08:38 PM", "replies": [{"postID": "post5932789", "text": "Interesting. Thanks for update. Maybe mine will ship soon....", "time": "08-22-2017 09:48 PM", "replies": [{"postID": "post5933232", "text": "Today, \"Being built\"! Yay!", "time": "08-23-2017 07:32 AM", "replies": []}]}]}, {"postID": "post5935326", "text": "Got an email this morning saying my order shipped, but my order status on the website still hilariously says \"order approved.\"", "time": "08-24-2017 05:11 AM", "replies": []}, {"postID": "post5935345", "text": "I got email saying it shipped on 8/23.\nThat is when it was scheduled for.\nSurprised me.\nLooks like they shipped the phone and the other items will ship separate.", "time": "08-24-2017 05:32 AM", "replies": []}, {"postID": "post5939165", "text": "Mine arrived today. Working great on T-mobile so far. It took 3 days from China to Illinois. The FedEx ETA was next Tuesday but Fedex got it here sooner.", "time": "08-25-2017 11:01 PM", "replies": []}, {"postID": "post5939167", "text": "Is WiFi calling working?", "time": "08-25-2017 11:03 PM", "replies": [{"postID": "post5939495", "text": "Yes WIFI calling works on T-mobile.", "time": "08-26-2017 07:30 AM", "replies": []}]}, {"postID": "post5939972", "text": "Had to get in touch with customer service for my tracking number, which I was never provided with. According to the tracking, I should have it Wednesday. Here's hoping!", "time": "08-26-2017 01:46 PM", "replies": []}, {"postID": "post5940215", "text": "I'm supposed to get mine Wednesday too. it's at FedEx in Memphis right now.", "time": "08-26-2017 04:20 PM", "replies": []}, {"postID": "post5944092", "text": "The latest on FedEx tracking.\nNo delivery date. Clearance Delay.\nso I would say customs is backed up.", "time": "08-29-2017 05:31 AM", "replies": []}, {"postID": "post5944136", "text": "Haha, me too. What a mess.", "time": "08-29-2017 06:12 AM", "replies": []}, {"postID": "post5944224", "text": "Yeah leave it to the Government to screw things Up.", "time": "08-29-2017 07:46 AM", "replies": []}, {"postID": "post5944237", "text": "Same situation for me. Unbelievable!", "time": "08-29-2017 07:58 AM", "replies": []}, {"postID": "post5946051", "text": "Great. Now even though it's in Philly at FedEx, I can't get it until 9/5 because of some instructions Motorola gave FedEx. Unbelievable.", "time": "08-30-2017 06:29 AM", "replies": [{"postID": "post5946202", "text": "I hate when that stuff happens. That stinks.", "time": "08-30-2017 08:25 AM", "replies": []}]}, {"postID": "post5946242", "text": "mine showed 9/5 two hours ago I just checked and now it's out for delivery.\nCheck it again in a couple of hours", "time": "08-30-2017 08:55 AM", "replies": []}, {"postID": "post5946309", "text": "mine was just delivered. Have it on charge\nSIM card is supposed to be here today too.", "time": "08-30-2017 09:40 AM", "replies": []}, {"postID": "post5946349", "text": "Mine's out for delivery, which surprised me when I looked! Oh, I feel so much better now!", "time": "08-30-2017 10:03 AM", "replies": []}]}, {"title": "Z2 Play review a week in", "thread": [{"postID": "post5913301", "text": "I have had the Z2 for a week and thought I would post some thoughts. I am coming from iPhone 7 realized I needed a larger screen more than I needed the pocketable size of the iPhone 7. iPhone 7 Plus seemed like a natural choice but iPhone 7 Plus is crazy expensive and with new iPhones just around the corner it seemed silly to drop $1000 in a 7 Plus right now. Great time to check out Android!\nI actually tried a Samsung S7 first. With some of the crazy discounts being offered, the S7 is half the price of the iPhone 7 Plus and a great deal. The S7 unlocked phone shipped with marshmallow but immediately updated itself to nougat after I set it up. \nI was disappointed in the S7. Battery life was less than I expected and I noticed lag straight out of the box. It had so many killer features on paper but the overall experience (for me) just didn't feel great. I thought \"if it is this laggy and the battery is already not awesome, it will only get worse in the future.\" \nI ended up returning the Galaxy after 3 days. \nThe Moto Z2 play seemed intriguing. Midrange specs in just about every way kind of put me off, but the price was right and the mods seemed kind of interesting. The idea of a cleaner Android was pretty appealing.\nAfter a week, here is what I think of the Z2 Play:\nSpeed - fantastic! Not laggy at all and very smooth. Even when running multiple apps the Moto just feels fluid and graceful. I cannot understand how the Moto Z2 processor is half the speed (single core) of the S7 and yet feels as fast or faster. But it does. I have watched plenty of speed test comparisons on YouTube and the S7 seems to only beat the Moto in loading time tests of big games. I don't play games like that much and don't care if they load 3 seconds slower. Overall, for day-to-day operations the Z2 flies!\nScreen - great! To me the Moto Z2 screen looks really good. Maybe a tiny bit less sharp than the Samsung but still very good. Colors look natural and contrasty. The only negative I've noticed is that the Moto in direct sunlight isn't the brightest and at night the minimum brightness is still too bright. Being Android, I was able to easily download a little utility that reduces minimum brightness. Problem solved!\nBattery life - outstanding! Easily gets me through a heavy day with room to spare and charges incredibly fast. No weird battery drains or runaway processes. I read that battery life was reduced compared to the Z Play, which may be true. But who cares with life this good?\nMoto software - Genuinely helpful. I love the \"open doorknob for camera\" and \"tomahawk chop for flashlight\" gesture controls. I love the \"show me\" voice commands. I like the swipe controls on the fingerprint scanner. I like the lock screen functionality. I love that the Moto just knows when I'm driving and switches to a completely voice-based system for texts. Why doesn't every phone have that driving mode?? Brilliant! \nBuild - very nice. The metal back and chamfered edges look high quality. Even the large camera bump out is nicely made. The Z2 Play feels solid and looks like a high quality phone.\nCamera - better than I expected, but not amazing. The camera takes very good photos in bright light. Well saturated, well exposed, and sharp. There may be a bit too much software sharpening, but most pictures look good. Low light photos are another story. The lack of OIS means the photos are grainy (due to high ISO being necessary) and still blurry (unavoidable camera shake). I wouldn't say the low light shots are terrible. In fact, they are useable. But low light pictures are definitely below the S7 and even the iPhone 6s. \nMods - more interesting than I expected. I have the wireless charging+battery extender, the JBL speakers, and a Style Shell. I've used the JBL as much as a high-quality speakerphone as anything else, and it works great!. Sure, I could buy a standalone bluetooth speaker but the sheer convenience and ease of use of the JBL is hard to beat. Likewise, the battery mod stays in my travel bag and I can either leave it attached during long travel days or slap it on for a quick charge and then take it off again. Either way, I appreciate that it doesn't make my already tall phone taller as most other phone battery packs do. The Style Shell looks really nice and actually makes the phone easier to hold. In general, I like the idea of the mods more than I expected. They are expensive though, and I wish there were more of them. Maybe beyond batteries and case backs there just aren't that many legitimate uses for mods. (the projector mod is cool, but I'm not sure how often it would get used) Still, Moto executed mods well and they do add value to the phone. \nWhat don't I like? Not much. \nWaterproof - nano coating is nice, but not the same as the flagships IP67 or IP68 ratings. With S7s and soon to be iPhone 7s dipping much closer to the Moto Z2's price, a nano coating just isn't enough.\nCamera - adding OIS would have made a huge difference to camera quality and I would happily pay a bit more for it. \nSize -the Leno Chin and Frankenstein Forehead are necessary to retain compatibility with Moto mods, but definitely they make the Z2 Play a physically large phone which is somewhat dated looking. \nOverall for me the Z2 feels like more than the sum of its parts and is a very enjoyable phone. On paper, it should fall to even last years flagships which are now similarly priced, but I think the Moto holds its own in terms of overall experience vs. those devices.", "time": "08-05-2017 01:27 PM", "replies": []}, {"postID": "post5913451", "text": "Thanks for your review! I'm happy to hear battery life remains solid, the Z Force last year was a great device.", "time": "08-05-2017 04:44 PM", "replies": []}, {"postID": "post5921767", "text": "Thank you so much for your review! So glad you are liking it, and that the battery life is working well for you. It's a great phone, for sure! Also, how \"big\" is this camera bump?", "time": "08-12-2017 06:38 PM", "replies": []}, {"postID": "post5921901", "text": "The camera bump is big when the phone is naked. it's that size to help anchor mods when they are attached. honestly it looks better to me than the iPhone camera pimple. put a style shell or a mod on the phone and the camera bulge vanishes.", "time": "08-12-2017 10:32 PM", "replies": [{"postID": "post5922133", "text": "Thank you for explaining that!", "time": "08-13-2017 07:06 AM", "replies": []}]}, {"postID": "post5944408", "text": "Has anyone tested the nano coating", "time": "08-29-2017 09:47 AM", "replies": []}]}, {"title": "Z2 durability", "thread": [{"postID": "post5880602", "text": "Got a snap on plastic case from Verizon and ended up hating it. Had to pry it off. Shouldn't hurt the phone right?", "time": "07-10-2017 05:50 PM", "replies": []}, {"postID": "post5883802", "text": "You'll be fine.", "time": "07-13-2017 12:54 PM", "replies": []}, {"postID": "post5889136", "text": "Don't worry! Phones can take this kind of pressure. It will be okay!", "time": "07-17-2017 09:10 PM", "replies": []}, {"postID": "post5927353", "text": "How's everyone holding up?", "time": "08-18-2017 06:07 AM", "replies": []}, {"postID": "post5931833", "text": "I was trying to install the Verizon bumper case and had to put more pressure on the glass than I would have liked trying to pop the corners in. Ended up throwing in the towel for fear of breaking my phone. I saw a CES video where GG3 could easily withstand 100lbs of pressure using a ring on ring test. Can this glass take the kind of pressure I could exert with my hands and not bat an eye?", "time": "08-22-2017 06:46 AM", "replies": []}]}, {"title": "Z play vs z2 play", "thread": [{"postID": "post5926892", "text": "Would anyone go for the z play over the z2 play? Not an upgrade from the first z play but a new phone", "time": "08-17-2017 05:35 PM", "replies": []}, {"postID": "post5927369", "text": "If you are more concerned about battery life than anything else, then yes. If not, the Z2 Play is a little better in all other areas.", "time": "08-18-2017 06:29 AM", "replies": []}, {"postID": "post5929169", "text": "I agree with the poster above me. The Z2 Play is awesome and seems like a really good phone and upgrade, but if you're looking for excellent battery life, the Play's got you covered.", "time": "08-19-2017 09:19 PM", "replies": []}, {"postID": "post5929234", "text": "I would make a case for the Z2. The Z has 16% more battery, but the Z2 life is still excellent. it like the difference between excellent (Z2 Play) and best ever (Z Play). Excellent is still, well, excellent. Probably the difference between 40 hours of average use (Z2) vs. 48 hours of average use (Z).\nThe Z2 Play has:\n-better camera\n-metal back (vs glass)\n-slightly faster CPU clock\n-upgraded Bluetooth\n-more likely to get Android O\n-FM radio\n-better finger print scanner with nav features\nOn the other hand, the original Z does go a bit longer on battery and it can be found for a $50 discount relative to the Z2 Play. I would go for the new Z2, if only for the camera and software updates.", "time": "08-19-2017 11:23 PM", "replies": [{"postID": "post5929469", "text": "All of your points are valid. And I totally get what you're saying. Thanks for posting!", "time": "08-20-2017 07:39 AM", "replies": []}]}, {"postID": "post5929562", "text": "The Z2 Play unlocked has more RAM (4GB) and more storage (64GB) and is carrier agnostic (Verizon, Sprint, AT&T and T-Mobile). The Z-Play is not available for Sprint.", "time": "08-20-2017 08:57 AM", "replies": []}]}, {"title": "Z2 play aluminum series", "thread": [{"postID": "post5926236", "text": "Anyone know what series aluminum is used for the z2 play? One thing being touted with the z2 force is it's use of 7000 series aluminum. I thought that was pretty standard these days. Anyone know if the z2 play is using a lesser alloy?", "time": "08-17-2017 04:34 AM", "replies": []}]}, {"title": "August OS update", "thread": [{"postID": "post5915935", "text": "Verizon posted an update to the Z2 play. I just finished installing it. It weighed in over 618mb. Installation took a while and I worried it got stuck when it stayed on the Moto bootup screen for several minutes after the installation graphic was complete.\nUltimately it completed and everything looks normal. I would swear OD animations just a tiny bit smoother and at the same time a tiny bit slower but that might all be in my head.\nSecurity patch level is updated from May to July.", "time": "08-07-2017 09:03 PM", "replies": []}, {"postID": "post5916753", "text": "I've did my update last night. Call me crazy, but my battery life seems to be much improved. Today it took me 7 hours to go from full to 80%. I have an Incipio battery pack installed so now my phone will sit at 80% until that runs out. Under my normal use I typically run that dry at about 10:00pm. Lets see how it goes...", "time": "08-08-2017 02:06 PM", "replies": []}, {"postID": "post5917094", "text": "I won't call you crazy - I noticed the same thing! my battery went from 96% at 8:00am to 80% at 5:00pm and that's with normal use!! An hour of using it as connected GPS for fitbit only pulled it down another 8%.\nthat's freaky good!", "time": "08-08-2017 08:50 PM", "replies": [{"postID": "post5921961", "text": "That's amazing. I don't get battery life like that but I also don't have a battery Moto mod to use. Just started using this device for the past week and I do like it and the battery life.", "time": "08-12-2017 11:37 PM", "replies": []}]}, {"postID": "post5918278", "text": "Agreed. Also noticed the you tube sync issue had disappeared", "time": "08-09-2017 04:12 PM", "replies": []}]}, {"title": "It works on att", "thread": [{"postID": "post5871214", "text": "I bought it yesterday, and it works fine on att.", "time": "07-02-2017 04:28 PM", "replies": [{"postID": "post5915252", "text": "Was it the unlocked one or the Verizon branded version?", "time": "08-07-2017 11:24 AM", "replies": []}, {"postID": "post5915291", "text": "Me too. I have been using it for about a week and it works fine.", "time": "08-07-2017 12:00 PM", "replies": []}]}, {"postID": "post5871233", "text": "Welcome to the forums. Glad the phone works okay for you. Do you have a question also?", "time": "07-02-2017 04:51 PM", "replies": []}]}, {"title": "Z2 Play simultaneous voice and data....", "thread": [{"postID": "post5912513", "text": "Is it possible? I believe it is with other devices on Verizon wireless. As I am using my iPhone 7 Plus to write this while on the phone with my wife. I just purchased one this morning and it doesn't seem to have that capability.", "time": "08-04-2017 04:48 PM", "replies": [{"postID": "post5912834", "text": "Advanced Calling enabled on the phone and line?", "time": "08-04-2017 11:32 PM", "replies": [{"postID": "post5913023", "text": "Yes they have been enabled.", "time": "08-05-2017 07:04 AM", "replies": []}]}]}, {"postID": "post5913229", "text": "It seems to work for me. Question: are you in a 4G LTE area?", "time": "08-05-2017 11:53 AM", "replies": [{"postID": "post5913286", "text": "Yes that I am. Would I have to update Verizon with the fact that I am switching devices? I'm not see if it's a IMEI mismatching issue, because previously when I had Verizon a while ago I had to do it online and switch it because the devices were cdma and I couldn't just switch out a SIM card. I'm wondering if that's the same issue I'm having now.", "time": "08-05-2017 01:10 PM", "replies": []}]}, {"postID": "post5913303", "text": "That definitely could be the issue. If you go to the Verizon portal, go to MyDevices, and then Activate or Switch Device. You'll enter your SIM # and IMEI number which will provision your account correctly such that the advanced features of the Moto are enabled correctly.", "time": "08-05-2017 01:31 PM", "replies": []}, {"postID": "post5915157", "text": "That's the ticket! Thanks for the assistance!!", "time": "08-07-2017 09:52 AM", "replies": []}]}, {"title": "Post Pictures taken from your Z2.", "thread": [{"postID": "post5888911", "text": "Let's see how well the camera does. Post your pics.", "time": "07-17-2017 05:02 PM", "replies": []}, {"postID": "post5905604", "text": "Just got a Z2 Play last night. I took a few shots this morning and compared them with an iPhone 7 (not the Plus). \nMy impressions are that the Moto camera software applies a lot more sharpening than the iPhone (and more than other camera phones I have seen). I really noticed it as sharpening halos around the leaves of the palm trees. . That could also be purple-fringing reduction algorithms as dark tree leaves against a bright background are notoriously tough for creating purple fringing on digital cameras. I see no evidence of fringing so some software corrections are happening. \nOverall, the Moto Z2 photos are sharp (right on the verge of being crunchy) and look pretty good. Exposure is slightly under, probably somewhere on the -1/3 side which I prefer to the iPhone actually. I didn't like the darkening of the Moto sky, making it look almost grey at the top. In fairness to Moto, I've noticed the iPhone 7 doing that a lot too but in this case the iPhone 7 sky looks much better. \nFor the indoor shot, I prefer the Moto picture hands down. Colors seem more saturated, the sharpening really helps with the overall scene here, and I think the contrast is higher (more pleasing to my eye). The iPhone photo looks slightly washed out in comparison. And yes, I realize the two compositions are not identical but hey, this is a quick snappy comparison :-)\nConsidering the list price of the 2 phones is $250 apart I think the Moto is holding its own pretty well. \nThe flower photo is also interesting. I tried much harder to frame exactly the same perspective on both phones. The Moto must have a slightly wider lens because I had to get a bit closer to the flower on the Moto than I did on the iPhone to make the picture nearly identical. The Moto depth of field is shallower in general and when combined with being slightly closer it renders the flowers less in overall focus than the iPhone. The background is more blurred to on the Moto, so overall the Moto has a shallower depth of field. \nHard to say which of these I prefer. I like the colors on the Moto a little better than the iPhone, but I think the iPhone is pulling in a bit more detail (even allowing for the deeper depth of field). the center of the sunflower in the iPhone shot seems just a bit more detailed.", "time": "07-30-2017 01:11 PM", "replies": []}, {"postID": "post5906034", "text": "I took a few more outdoor shots. Clearly excellent conditions - lots of light! Still, the pictures to me look very good. I didn't see any of that janky grey sky. Also, the exposure metering to me looks spot on. Colors don't have the oversaturated look of the Samsung (but lets be honest, also awesome look of the Samsung) but aren't washed out either.\nI was particularly impressed by this interior courtyard shot. Very hard to meter and the Moto did well! A few blown out highlights (the white shirts of people) but overall metering is about what I would have done manually. Sky isn't blown out even though it is a bit lighter than actual, nor are the darker areas just a muddy dark mess. Sharpening is maybe a tiny bit too high but I'm very happy with the shot.", "time": "07-30-2017 07:07 PM", "replies": [{"postID": "post5911432", "text": "Newport Beach?", "time": "08-03-2017 08:28 PM", "replies": []}]}, {"postID": "post5911439", "text": "Close - Irvine.", "time": "08-03-2017 08:40 PM", "replies": []}]}, {"title": "Does anyone know how to fix audio video sync problems?", "thread": [{"postID": "post5908099", "text": "Hi all! I recently bought a Moto Z2 Play. Everything was going great until a few days ago when the YouTube app started acting up. A few moments into the video, the video would pause but the audio would keep going. Then, the issue started on other apps as well. Now whenever I play any video on any app, except Netflix thank god, the audio and video are out of sync. It makes videos completely unwatchable. I looked up the problem but none of the solutions seemed to work. Any advice would be greatly appreciated. Thank you!", "time": "08-01-2017 12:00 PM", "replies": []}, {"postID": "post5908184", "text": "Found this if you haven't already tried some of these fixes: http://innov8tiv.com/fix-youtube-app...android-guide/", "time": "08-01-2017 01:15 PM", "replies": []}]}, {"title": "A few days using the Z2 Play", "thread": [{"postID": "post5873849", "text": "Been using the Z2 Play for a few days and it's the first mid-tier phone I've used since the smartphone craze began. Usually go for the flagship models, whether it's an iPhone, the Z Force Droid, the S8+, etc. So my experience is probably colored by those phones. \nHave been using the Verizon model, 32 GB, 3 GB RAM with a 128 GB Samsung EVO Select U3 micro SD card inserted. I'll be returning the Z2 Play for a couple reasons, the main ones being the lag, the camera and the much slower download speeds.\n-- I hadn't realized that chip architecture can limit download/upload speeds until reading about it in-depth, after noticing how much slower my downloads were, as compared to my other phones. My FiOS gigabit connection gets me at, or near, 500 MBs download on my other phones, while capping out around 110 with the Z2 Play. \n-- The lag is there, especially on apps such as Facebook and Google Photos. Editing a picture on Google Photos leads to a \"wait\" splash screen that forces me to close the app and re-open. (I've recreated that annoyance about five times.) \n-- The camera just isn't that good. Oh, bright light and outdoors it'll snap a nice picture, but inside, or in lower light, the lack of OIS reveals itself. \n-- On the plus side, it's a great looking and feeling phone. I use a Moto Modo black leather back and the Z2 Play feels great in the hand with it. I will say the battery was a pleasure, but with only using it for a few days, I can't say it's a battery beast. Not enough time for that. Also, even at Full HD, the screen seemed plenty bright enough in the sunlight. And there is still nothing to compare with Moto Actions. Flipping the wrist to activate the camera makes me smile every time, especially when watching somebody stumble to get the camera up on their iPhone. (Why the hell hasn't the great, almighty Apple implemented quicker camera access?)\nSo guess it'll be the new Z Force, whenever that drops, as I am a big fan of the Moto Z line and Moto Mods. I'm guessing the Z Force camera and processor will boost it back to what I consider \"normal.\" I'm not here to rip the Z2 Play, I'm simply pointing out that to me it was a noticeably different experience from the flagships.", "time": "07-05-2017 06:18 AM", "replies": [{"postID": "post5874066", "text": "Thanks for the review.As I suspected....and feared.Saw a leaked image of the new Force Z2, looks exactly like all the other Z's except had the dual camera on the back. I will be checking out the Force Z2, the Pixel 2 and the Note 8. \nAny comments on the fingerprint sensor on the Play Z2?", "time": "07-05-2017 10:07 AM", "replies": [{"postID": "post5874155", "text": "Oh hell yeah, can't believe I forgot that part. The fingerprint sensor is fast and accurate. And it has the added benefit of being able to be used as the BACK, HOME and RECENT APPS buttons, if you activate Moto One-Touch (or whatever it's called). And that worked fantastically well. Just a swipe to the left, or right, or a tap activates all those. When it's active, the on-screen buttons disappear and you get more screen real estate as well. A very enjoyable function, which I assume will make it up the line with all the new models.\nJust a quick question btw. Does anybody know why Moto's E-Mail client does not allow for push mail and only allows for scheduled pulling? That also frustrated me.", "time": "07-05-2017 11:19 AM", "replies": []}]}]}, {"postID": "post5873880", "text": "Speaking of Apple... A while back there was an article talking about the different processors in iPhones, depending upon the built-in storage. The lower the storage the lower the processor, resulting in lower processing speeds. Maybe that's the case with the Z, Z Play, and Z Force?", "time": "07-05-2017 07:16 AM", "replies": [{"postID": "post5873896", "text": "I'm not so sure about that. It's not like Moto is hiding the fact that the Z2 Play has a Snapdragon 626 and the Z Force has an 820 (and I assume the new Z Force will be an 835). And I believe the unlocked Z2 Play, coming later this month, will still have the 626, despite having it's storage bumped up to 64 GB.", "time": "07-05-2017 07:40 AM", "replies": []}]}, {"postID": "post5873949", "text": "That's good to know. Thanks!\nI have the Z Force Droid, with a few mods. It will be interesting to see how the new Z Force 2 shakes out.", "time": "07-05-2017 08:32 AM", "replies": []}, {"postID": "post5874163", "text": "Should also add that if you despise bloatware, you're going to be very annoyed, as most of it on the Z2 Play IS NOT removable. You can of course Force Stop and Disable all of them, but cannot completely remove them. I don't normally have an issue with bloatware, but when the phone storage is just 32 GB, that bloatware needs to be removable. \nShould also add that there is a Moto/Verizon version of DT Ignite installed, but it has a different name, which escapes me right now. It still has the DT Ignite icon though, so just make sure you show System Apps and disable that nasty mofo right away.", "time": "07-05-2017 11:25 AM", "replies": []}, {"postID": "post5875217", "text": "Moto Z2 Play review: Excellent battery life and handy Moto Mods make for a compelling smartphone Review | ZDNet", "time": "07-06-2017 08:50 AM", "replies": []}, {"postID": "post5875223", "text": "You know what? I'm going to give the Z2 Play a few more days, since I have until early August to return it. It's a fun little phone. I've been fooling around with the camera more and the PRO shooting mode is much better than the AUTO for low-light photos, even without the OIS. And I cannot stress how quickly I've adapted to the One Button Nav feature. Going back to my iPhone seemed so unnatural when it was time to go back, or open recent apps. Very addictive. Well played Moto.", "time": "07-06-2017 08:54 AM", "replies": []}, {"postID": "post5875277", "text": "Also, in case anybody was wondering, there's an active FM Radio in the Z2 Play.", "time": "07-06-2017 09:44 AM", "replies": [{"postID": "post5875427", "text": "That's good to know. My local MLB team radio broadcasts are on an FM station. Because of licensing agreements with MLB.com the games are not streamed online. I can see where the FM radio in the Z2 Play coupled with the JBL speaker mod would make listening to the games a breeze.", "time": "07-06-2017 11:35 AM", "replies": []}]}, {"postID": "post5875335", "text": "What is included in the box? Do you at least get a generic back for the phone?", "time": "07-06-2017 10:32 AM", "replies": [{"postID": "post5875377", "text": "Nope. Just the phone, power brick and charging cable. No back. (I had a few backs from the Z Force Droid and they fit perfectly.) The back is aluminum now and not glass, btw.", "time": "07-06-2017 11:12 AM", "replies": [{"postID": "post5875430", "text": "OK, you've had the Force Z Droid and now the Z2 Play. Pros and cons of each?", "time": "07-06-2017 11:37 AM", "replies": [{"postID": "post5875455", "text": "Give me a few days for that.", "time": "07-06-2017 11:59 AM", "replies": []}]}, {"postID": "post5876979", "text": "Thanks! I picked mine up yesterday at Best Buy. Thus far with really less than 24 hours use I'm happy with it.", "time": "07-07-2017 03:10 PM", "replies": []}]}]}, {"postID": "post5875564", "text": "Pretty sure I'll be joining you here shortly on the Z2 Play train. Trying to decide if I want the black or the white at the moment.", "time": "07-06-2017 01:20 PM", "replies": []}, {"postID": "post5875598", "text": "I ordered the Z2 play two days ago to replace a lost phone. I was tired of waiting with no phone so I picked up the LG G6 yesterday. I got to say this is an awesome phone! Very well-built, great specs and nearly the same price. It seems like a better value than the Z2 play, especially considering the cons against the Z2 ( namely reduced battery life, and the less RAM and memory for no other reason than to ensure you upgrade again later).\nBUT, I really like the idea of the mods and have a feeling that it's more my style. I love Bluetooth speakers and have two UE Booms ( that are starting to show their age), but I love the extra portability. Also, I know that the Z2 will drive my wife nuts, which is always a sign it's right for me\nWhen I get the phone delivered tomorrow, I'm going to open it up and play with it to see which one I like more.", "time": "07-06-2017 01:48 PM", "replies": [{"postID": "post5875652", "text": "Please report back with your findings.", "time": "07-06-2017 02:32 PM", "replies": []}]}, {"postID": "post5876030", "text": "Day 1 with the Z2 play. Coming from a nexus 5x. Had the original Moto x and Moto x 2014. So far loving this phone. Didn't realize how much I love the Moto platform.", "time": "07-06-2017 07:09 PM", "replies": []}, {"postID": "post5876276", "text": "Waiting for that free soundboost to arrive is going to be torture.", "time": "07-07-2017 12:07 AM", "replies": []}, {"postID": "post5876471", "text": "Yesterday was the first day I used the Z2 Play in a low signal area (Verizon) and the standby battery depletion was a bit alarming. Went from 100 to 90 in about 2 hours. I'd sent a couple of texts during that period, otherwise it just sat in my pocket. That concerns me a great deal.", "time": "07-07-2017 07:22 AM", "replies": [{"postID": "post5876610", "text": "That does not sound happy...especially since I wander into extra low service a week at a time.", "time": "07-07-2017 09:30 AM", "replies": []}, {"postID": "post5876648", "text": "So, 5% decrease in battery per hour. I don't know why that would be concerning. It's probably typical for any cell phone in a low signal area that is constantly searching for a signal.", "time": "07-07-2017 10:09 AM", "replies": [{"postID": "post5876767", "text": "Not in my experience it's not. It's a place I frequent regularly. My iPhone has never once dropped from 100 to 90 while idle there. Neither has my Z Force or S8+ (the most recent phones I've used). In fact, I'll be back there later tomorrow and will be sure to check exactly how much it does.", "time": "07-07-2017 11:32 AM", "replies": []}]}, {"postID": "post5898657", "text": "I owned a Droid Turbo 2 and a Z Play in the past, and low signal areas absolutely ate the battery in those two phones, as good as both their batteries were. Must be a Motorola thing. They get good reception, but obviously by prioritizing signal over battery in those conditions.", "time": "07-25-2017 01:01 AM", "replies": []}]}, {"postID": "post5881455", "text": "I've had mine for almost 5 full days now. So far I have no major issues. The battery seems to get me (for my typical usage) through the day without topping off.\nI did buy the Incipio battery-mod and it seems to work as designed. I have the camera mod on order and should get my JBL speaker mod in a month or so.\nSo far I'm happy with the performance.", "time": "07-11-2017 01:13 PM", "replies": []}, {"postID": "post5881605", "text": "Anyone concerned about the charging port. The phone is so thin that the charger I got from Verizon causes the bottom of the phone to remain off the table when put down. And when i press on the phone while it's laying down the phone will teeter back and forth. Wondering if it'll cause damage to the charge port", "time": "07-11-2017 03:47 PM", "replies": []}, {"postID": "post5890333", "text": "After more than ten days with this phone I'm loving it. Great battery life and smooth operation. I am so happy to have The Moto notifications back. I don't miss the nexus 5x one bit.", "time": "07-18-2017 07:34 PM", "replies": [{"postID": "post5890413", "text": "How do you feel about the camera? I feel it's not very sharp in detail. Still playing with it.", "time": "07-18-2017 08:53 PM", "replies": [{"postID": "post5890426", "text": "The camera isn't great that's for sure. I've been playing with the settings and haven't found anything yet that makes a noticeable difference. At this point the camera is the only disappointing thing about the z2p, but by no means is it a deal breaker.", "time": "07-18-2017 08:58 PM", "replies": [{"postID": "post5890469", "text": "The camera is a big deal for me. Even in good light it's so slow.", "time": "07-18-2017 09:47 PM", "replies": [{"postID": "post5892210", "text": "Couldn't live with how poor the camera was, unfortunately. I tried.", "time": "07-20-2017 06:47 AM", "replies": [{"postID": "post5892220", "text": "Same here. I'm sticking with my S8. I feel it's just a cool idea getting a mid range phone that can check most of the boxes but apparently I'm more of a power user than I realized because I made that Z2 work hard and studder a long a few times.", "time": "07-20-2017 06:55 AM", "replies": []}]}]}]}]}]}, {"postID": "post5903739", "text": "If you're in a low signal area you can always use an app to force it into 3g and that will save battery. I agree that Moto phones work very hard to hold marginal signals, but at the cost of battery life at times.", "time": "07-28-2017 10:48 PM", "replies": []}]}, {"title": "Anyone upgrading from the original z play ?", "thread": [{"postID": "post5881099", "text": "Debating if it is worth it to upgrade while Verizon has the phone on sale.", "time": "07-11-2017 07:19 AM", "replies": []}, {"postID": "post5883052", "text": "I would if it had 64gb of memory. The camera improvement alone doesn't see worth losing the battery life. If the Verizon Z2 Play had double the memory of the original Z play I would have done it.", "time": "07-12-2017 09:16 PM", "replies": [{"postID": "post5884703", "text": "Using the SD card doesn't work for you?", "time": "07-14-2017 08:26 AM", "replies": []}]}, {"postID": "post5884702", "text": "I caved and upgraded. Phone is so so thin and runs really smoothly. Officially started using this morning so can't comment on battery life yet.", "time": "07-14-2017 08:26 AM", "replies": []}, {"postID": "post5884711", "text": "I have a 200gb sdcard with my whole music collection which is around 12,000+ songs, about 120gb. Imagine using adaptable storage and trying to drag 12,000 files to the phone instead of just taking the sdcard out and using a usb 3.0 adapter. It would take forever and I'm not sure it would be reliable. I do have about 4gb free phone memory on my current Z Play so right now the extra system memory is no big deal, but it probably will be in the future. I am real tempted though. Many times I am yelling at how crappy the camera is but that battery life is just incredible. Is the camera a noticable upgrade?", "time": "07-14-2017 08:34 AM", "replies": [{"postID": "post5884868", "text": "Oy yeah, that's a lot of music! I used to have the same but have migrated to Spotify. That said, I do download some playlists for offline use on vacation etc. \nI haven't really tested the camera yet.", "time": "07-14-2017 10:13 AM", "replies": []}]}, {"postID": "post5885782", "text": "Why would you want to downgrade?", "time": "07-14-2017 10:44 PM", "replies": [{"postID": "post5886655", "text": "Guess it depends on your point of view. Battery life on this phone is pretty good so far.", "time": "07-15-2017 07:49 PM", "replies": [{"postID": "post5889131", "text": "Please keep us updated on your battery life and other impressions! Glad you are loving the experience so far!", "time": "07-17-2017 09:08 PM", "replies": []}, {"postID": "post5890260", "text": "How do you like it so far? I have mixed views on it right now.", "time": "07-18-2017 06:19 PM", "replies": []}]}]}, {"postID": "post5890878", "text": "I like the phone. It's snappy and takes care of all my needs. Battery life is fine, still better than most phones out there. Camera is fine. No complaints", "time": "07-19-2017 07:47 AM", "replies": [{"postID": "post5890951", "text": "I wonder if they will update the camera at all to allow for quicker caption abilities. The slow shutter is my only complaint and it's a rather important part of a camera phone for me.", "time": "07-19-2017 08:33 AM", "replies": []}]}]}, {"title": "Camera Lag.", "thread": [{"postID": "post5884779", "text": "This seems to be brought up a lot in most reviews. What has your experience been with the Z2? Do any of you use the Camera Mod and if so does that seem to alleviate the concerns?", "time": "07-14-2017 09:19 AM", "replies": []}]}, {"title": "Same lock screen?", "thread": [{"postID": "post5883643", "text": "For those who now have this phone, is the lock screen the exact same as it was on the previous Z's? That is, does it show the time and date in the center and battery percentage in the top right corner of the black screen when it's awakened?", "time": "07-13-2017 10:54 AM", "replies": []}, {"postID": "post5883888", "text": "Are you talking about the lockscreen (like on any other Android) or the monochromatic, activate-with-a-wave Moto Display?\nThe Z2 Play has an updated version of Moto Display which has more detail but I don't recall the exact differences.", "time": "07-13-2017 02:03 PM", "replies": [{"postID": "post5883992", "text": "Thanks for your reply. I'm talking about the wave of the hand screen. I'm specifically wondering if the battery percentage is shown?", "time": "07-13-2017 03:43 PM", "replies": []}]}, {"postID": "post5884416", "text": "It's a circle (not monochromatic either!) that has the battery % at the top, a blue ring (also battery % based), with the large time with date below it.\nIf you have the notifications turned on, they show below the circle, and you can perform actions on them such as reply/dismiss.\nHonestly, that was one of the few features that I really longed for after I switched from Windows Phone.", "time": "07-13-2017 10:47 PM", "replies": []}, {"postID": "post5884704", "text": "Yes", "time": "07-14-2017 08:26 AM", "replies": []}]}, {"title": "Moto z force charger", "thread": [{"postID": "post5880102", "text": "Can I use the z force charger with the Z2 play?", "time": "07-10-2017 10:46 AM", "replies": []}, {"postID": "post5880208", "text": "Yes. That charger has the ability to output at the higher rate that the Z Force can handle, but your Z2 Play will only charge at the same rate as the charger that comes with it.\nI use the Z Force charger on my Z Play and find that it doesn't heat my phone up like the one that came with it.", "time": "07-10-2017 12:37 PM", "replies": []}]}, {"title": "Video options", "thread": [{"postID": "post5879430", "text": "So the only way to enable HDR and/or stabilization is to turn down to 1080p 30fps. Think those options are worth the drop in frame rate?", "time": "07-09-2017 06:41 PM", "replies": []}]}, {"title": "Moto Z2 Play on T-Mobile", "thread": [{"postID": "post5878524", "text": "Hi there. So the Moto Z2 Play (Verizon-exclusive version) has all the bands necessary for T-Mobile 4G LTE (bands 2, 4, 12). \nHas anyone used the Moto Z2 Play on T-Mobile, and if so, how's calling quality? Is there VoLTE, and how does LTE compare in terms of speed and signal with another \"certified\" T-Mobile phone?\nThanks in advance!", "time": "07-08-2017 11:14 PM", "replies": []}]}, {"title": "Moto Z2 Play Camera (12MP 1.4um Dual Autofocus Pixel, ƒ/1.7)", "thread": [{"postID": "post5835544", "text": "https://www.motorola.com/us/products/moto-z-play-gen-2#advanced-camerarear camera\n12MP 1.4um Dual Autofocus Pixel\nƒ/1.7\nLaser Autofocus (Up to 5 meters)\nPhase Detection Auto Focus (PDAF)\nColor Correlated Temperature (CCT) dual LED flash\nProfessional mode\nAuto Night mode\nVideo Encode: 480p (30fps) 720p (120fps) 1080p (60fps), 4K (30fps)front camera\n5MP 1.4um\nƒ/2.2\nWide-Angle lens\nColor Correlated Temperature (CCT) dual LED flash\nAuto Night mode\nBeautification software\nProfessional mode\nVideo Encode: 480p (30fps) 720p (120fps) 1080p (30fps)", "time": "06-01-2017 12:30 PM", "replies": []}, {"postID": "post5868468", "text": "Why no optical image stabilization?", "time": "06-29-2017 11:46 PM", "replies": [{"postID": "post5868956", "text": "It's a cheaper mid-range model. Can't load it up with flagship specs and sell it at $408.", "time": "06-30-2017 12:01 PM", "replies": []}]}, {"postID": "post5869056", "text": "Load it up with flagship specs?\nThese phones are in the same price range, have image stabilization, and are not flagships:\nOnePlus 3 has OIS\nOnePlus 5 has EIS\nLG G5 has OIS\nSamsung Galaxy A5 has OIS\nI'm sure there are more.", "time": "06-30-2017 01:35 PM", "replies": []}, {"postID": "post5869124", "text": "Huh?\n-- OnePlus 3 and 5 aren't the OnePlus flagships? What else do they have? \n-- LG G5 was most CERTAINLY a flagship when it landed. \n-- Don't know anything about the A5.", "time": "06-30-2017 02:33 PM", "replies": [{"postID": "post5869167", "text": "I don't know whether or not the manufacturer considers their phones a flagship, I was merely looking at the cost of the device. All of these devices are under $500, probably now are under $400, and have image stabilization.\nAnother thing to consider--Motorola 'flagships' of years past, like the Droid Turbo, Turbo 2, Moto X Play, Droid Maxx 2, etc. did not have OIS, but other manufacturers flagships that were released at about the same time, or even before the Moto phones did, like Samsung Galaxy S6 , Note 4 (Oct 2014, same time as Droid Turbo 1), Apple phones, LG G3 (June 2014), LG G4, etc.\nIt wasn't until the Moto Z and Force Z were released September 2016 that they had OIS on their cameras, two full years after other manufacturers.", "time": "06-30-2017 03:18 PM", "replies": [{"postID": "post5869684", "text": "Gotcha. I was going by what the manufacturer considers the flagship, as there can only be one, or a variation of one (such as the Galaxy S8 and S8+).", "time": "07-01-2017 06:35 AM", "replies": []}]}]}, {"postID": "post5869407", "text": "OnePlus models are different, less battery and iOS. They do what they can to make a dent in the market and establish a foothold. They picked battles, no NFC in the 3t but the Z2 does.", "time": "06-30-2017 08:21 PM", "replies": []}, {"postID": "post5871980", "text": "But is the camera good. Reviews seem to have a lot of difference or opinion on this.", "time": "07-03-2017 12:10 PM", "replies": [{"postID": "post5872229", "text": "I've owned and have followed Moto's phones for about 7 years now. I pay close attention to their cameras because after battery it is second on my list of priorities for a phone. \nFrom what I've read it's like the typical Moto camera. Takes great photos in good to decent light. While the low light photos are an improvement over past Moto phones, they are not up to Samsung, Pixel, and LG quality. And of course, they suffer from blurry photos of action shots, largely because they don't have OIS. The Z2 Play seems to open the app and is ready to take shots faster than any previous Moto phone, according to the reviews I've seen so far.\nI guess my advice is the same as it's always been for Moto phones. Hold the phone with two hands, brace an elbow on something stationery, hold your breath and tap the screen to take the shot. This is especially true for low light shots or action shots. I've noticed their newer phones--Play Z, Force Z, Z Play--actually have a built in message reminding the shooter to hold the phone steady.\nSo, Moto is incrementally improving their cameras. While they are getting better and better, so are the other manufacturers so they never catch up.", "time": "07-03-2017 03:02 PM", "replies": []}]}, {"postID": "post5878189", "text": "Why no video stabilization at 1080p 60fps?", "time": "07-08-2017 05:14 PM", "replies": []}]}, {"title": "Google Now on Swipe left?", "thread": [{"postID": "post5870216", "text": "I've been seeing some reviews of the Moto Z2 Play and it seems Motorola removed Google Now on swipe left. Is that the case?", "time": "07-01-2017 05:21 PM", "replies": []}, {"postID": "post5871341", "text": "Yes.", "time": "07-02-2017 07:37 PM", "replies": [{"postID": "post5871430", "text": "So now it's a page with a bunch of widgets?", "time": "07-02-2017 10:05 PM", "replies": []}]}, {"postID": "post5872854", "text": "You can change it. Long press on the screen, select \"Swipe to show Assistant\" and you can choose to have \"App Flash\" or \"Google\" as your option when swiping left. I have no idea what \"App Flash\" is.", "time": "07-04-2017 05:59 AM", "replies": [{"postID": "post5873288", "text": "Oh nice thanks! I've read on XDA that it's a Verizon thing.", "time": "07-04-2017 01:56 PM", "replies": []}]}]}, {"title": "Who's picking it up today?", "thread": [{"postID": "post5867527", "text": "It's available at both Best Buy and Verizon today. Who's picking one up? I'm very tempted to make the switch from my G6 to the Z2 play. Will do a bit more reading before making the jump.", "time": "06-29-2017 07:22 AM", "replies": []}, {"postID": "post5867622", "text": "Not me, thought it had 64gb, Verizon only has the 32gb version. This stinks.", "time": "06-29-2017 08:54 AM", "replies": []}, {"postID": "post5867699", "text": "Apparently Best Buy shows in stock for in store pickup but Verizon says preorder only.", "time": "06-29-2017 10:05 AM", "replies": []}, {"postID": "post5867735", "text": "Since the Verizon model only has 32GB, if I add a 64 micro SD card, can I still PIN my google music, and download Movies from the Play store to the SD card?\nThanks!", "time": "06-29-2017 10:36 AM", "replies": []}, {"postID": "post5867803", "text": "Best Buy's listing says it's 64gb. And it's on sale there. But regardless of where you buy it from you can make use of the SD card to store music and movies from Google.", "time": "06-29-2017 11:15 AM", "replies": [{"postID": "post5868046", "text": "Thanks! I will check out Best Buy too", "time": "06-29-2017 01:59 PM", "replies": []}]}, {"postID": "post5868926", "text": "The Best Buy description is incorrect. The version BB offers is the same as offered on Verizon's website, the 32GB ROM.", "time": "06-30-2017 11:29 AM", "replies": []}, {"postID": "post5869368", "text": "I noticed that this evening when I went in to see it.", "time": "06-30-2017 07:21 PM", "replies": []}, {"postID": "post5869403", "text": "Why the advertisement of the larger storage version with upgraded ram and then nobody has it?", "time": "06-30-2017 08:15 PM", "replies": [{"postID": "post5869420", "text": "It may be an upcoming unlocked GSM version of the Z2 Play. I can't see Verizon carrying 2 versions of a mid-range phone.", "time": "06-30-2017 08:54 PM", "replies": []}]}]}]
[{"title": "Don't be fooled buy Best Buy website description, as I was :(", "thread": [{"postID": "post5868955", "text": "Ordered the Z2 Play from Best Buy website yesterday, for in-store pickup. The website description clearly states 64 GB storage and 4 GB RAM. Went to pick it up today, box label lists 32 GB storage and 3 GB RAM. They said the website must be incorrect. No kidding.", "time": "06-30-2017 11:59 AM", "replies": [{"postID": "post5868994", "text": "With phones, their website is messed up a lot. i would never trust their website.", "time": "06-30-2017 12:39 PM", "replies": [{"postID": "post5869028", "text": "First time there's ever been a glaring inaccuracy for me.", "time": "06-30-2017 01:11 PM", "replies": []}]}]}, {"postID": "post5868981", "text": "Thanks for the heads up", "time": "06-30-2017 12:30 PM", "replies": []}, {"postID": "post5868993", "text": "Doesn't surprise me. best buy is known for incorrect product description problems. They should take it back with no restocking fee though... You might have to fight depending on the store.", "time": "06-30-2017 12:38 PM", "replies": [{"postID": "post5869027", "text": "No restocking fees for me. Elite status and all, since I spend so much there. (Much to the chagrin of my better half.  )", "time": "06-30-2017 01:10 PM", "replies": []}]}, {"postID": "post5869059", "text": "This happens often locally for me, often I see devices with the incorrect specs next to them (online store or in promotional magazines) For example a Samsung Galaxy A3 (2017) will have 32gb storage with a 16mp camera on their website but if you do a search only the A5 & A7 have it 😃 \nAlways good to just double check things before purchase. I've been burnt before so this is what I do now.", "time": "06-30-2017 01:39 PM", "replies": []}, {"postID": "post5869264", "text": "Best Buy still hasn't fully corrected their listing for the Verizon Z2 Play. The main ad still shows the wrong specs. But if you click on the product questions link it shows the correct ( 32GB ROM/ 3 gig RAM ) specs.", "time": "06-30-2017 04:53 PM", "replies": []}]}, {"title": "Exciting!", "thread": [{"postID": "post5835288", "text": "Guys! The Z2 Play is rumoured to come out in July! The article here is a very interesting read!\nSo, what do you think thus far? Will you consider it? Does anyone know anything more about the device?", "time": "06-01-2017 08:59 AM", "replies": []}, {"postID": "post5835305", "text": "The front page on AC has a couple blogs about it. I also saw that some new moto mods are coming too! I have a Z Force, so I'm excited to get a look at those mods! https://www.androidcentral.com/moto-...g-availability", "time": "06-01-2017 09:13 AM", "replies": [{"postID": "post5835307", "text": "I've been reading those! It still looks super cool beans, despite the smaller battery. And wow! New Moto mods!\nFudge. It'll probably be between this and the HTC U11 for me.\nI've been trying to see if the launch date in Canada is around the same time as the July launch - do we know that for sure yet?", "time": "06-01-2017 09:15 AM", "replies": []}, {"postID": "post5835318", "text": "I will definitely have to + 1 on this 😃 I was always a fan of the mods! I know LG didn't do so well but I have faith the Moto Mods will succeed. Looks like we are getting\n1) JBL SoundBoost 2, \n2) Moto TurboPower Pack\n3) Moto Style Shells + Wireless Charging\n4) Moto GamePad", "time": "06-01-2017 09:24 AM", "replies": [{"postID": "post5835319", "text": "MOTO STYLE SHELLS AND WIRELESS CHARGING wahoo!!!", "time": "06-01-2017 09:25 AM", "replies": []}]}]}, {"postID": "post5835311", "text": "Always love seeing new devices from the Moto company 😃 I did see a screen-shot in another thread which had a nice break down of their whole product line for the year. I don't mind it having a 1080p display. That's perfectly sharp enough for me. \nWhats interesting though is they have the Snapdragon 626 paired with a nice 3,000mah battery. So I'm expecting some good results from that!", "time": "06-01-2017 09:18 AM", "replies": [{"postID": "post5835315", "text": "That's so cool! I really like seeing Moto releases too! Makes me reminiscent of the early days when I had my Moto RAZR. 😊 I think the battery will still be sick beans, even if it's 17% smaller than its previous iteration.", "time": "06-01-2017 09:20 AM", "replies": []}]}, {"postID": "post5835594", "text": "As I'm still tied into a contract till 2018 with my fruit based smart phone 😑. I won't be getting this but I'll be in time for the next installment!", "time": "06-01-2017 01:03 PM", "replies": [{"postID": "post5835884", "text": "What's a contract?", "time": "06-01-2017 06:16 PM", "replies": []}]}, {"postID": "post5835891", "text": "I hope it has a better camera. I don't think they should leave that to mods.", "time": "06-01-2017 06:22 PM", "replies": [{"postID": "post5835970", "text": "On paper, it should have a good one.", "time": "06-01-2017 07:43 PM", "replies": [{"postID": "post5836002", "text": "According to the Verge review it has an older camera sensor, so the camera may be fine shutter speed is a little slow. Also, the battery bit is disappointing, I almost got the first gen Z Play back in December, but held off. This year is my real upgrade year, and I refuse to get a phone without a headphone jack, which all the new iPhones do, so I am stuck between getting a SE or jumping back to Android (Windows Mobile is a no-no). \nThe Z2 Play might be it, but I need to see some comparisons directly to the last gen when it comes to performance, and battery life. The S8 interested me, but I don't like the curved screens nor the fact getting a good case for it is going to be hard.", "time": "06-01-2017 08:28 PM", "replies": [{"postID": "post5836014", "text": "Older as in the S7's?", "time": "06-01-2017 08:40 PM", "replies": []}, {"postID": "post5836901", "text": "You just have to weigh up your options. I do miss the headphone jack in my iPhone 7 plus, I didn't think I would but I do. I think this phone looks good to be honest. You won't go far wrong with it that's for sure.", "time": "06-02-2017 04:19 PM", "replies": []}]}]}]}, {"postID": "post5842823", "text": "I'm curious to see a comparison between this and the new moto X. I don't need the mods and really just want the battery life and a better camera", "time": "06-08-2017 12:18 AM", "replies": []}, {"postID": "post5843053", "text": "Just looked up the moto x(4) sounds like a great phone depending on cost. Hope they do improve the camera especially for moving shots.", "time": "06-08-2017 08:15 AM", "replies": []}, {"postID": "post5848761", "text": "yes i do think the camera quality will improve...", "time": "06-13-2017 02:00 AM", "replies": []}]}, {"title": "Motorola Moto Z2 Play Reviews", "thread": [{"postID": "post5835504", "text": "Android Central (Daniel Bader)https://www.androidcentral.com/moto-z2-play", "time": "06-01-2017 12:11 PM", "replies": []}, {"postID": "post5835537", "text": "Engadget (Chris Velazco)https://www.engadget.com/2017/06/01/...for-sleekness/", "time": "06-01-2017 12:26 PM", "replies": []}, {"postID": "post5835539", "text": "CNET", "time": "06-01-2017 12:27 PM", "replies": []}, {"postID": "post5836162", "text": "The Verge (Dan Seifert)https://www.theverge.com/2017/6/1/15...z2-play-review", "time": "06-02-2017 12:37 AM", "replies": []}, {"postID": "post5836898", "text": "Personally I think this phone looks great! I like the idea of the mods. The wireless charging style mod is a stroke of genius in my book.", "time": "06-02-2017 04:15 PM", "replies": []}]}, {"title": "Motorola Moto Z2 Play Specs", "thread": [{"postID": "post5835501", "text": "https://www.androidcentral.com/moto-z2-play-specs\nOperating system\nAndroid 7.1.1\nMoto Display, Voice, Actions\nProcessor\nQualcomm Snapdragon 626 processor \nOcta-core Cortex-A53 @ 2.2 GHz \n14nm process\nGPU\t\nAdreno 506 GPU @ ~650 MHz\nScreen\t\n5.5-inch Full HD (1920x1080, 403 ppi) AMOLED\nRAM\t\n3GB\n4GB (Moto Maker)\nStorage\t\n32GB\n64GB (Moto Maker and international)\nExpandability\t\nmicroSD up to 2TB\nRear camera\t\n12MP, Dual Autofocus Pixel \nphase-detect, laser autofocus \n1.4-micron pixels \nf/1.7 lens \ndual-LED flash\nVideo capture\t\n720p (120fps), 1080p, 4K (30fps)\nFront camera\t\n5MP \n1.4-micron pixels\nf/2.2 wide-angle lens\nfront-facing flash\nConnectivity\t\nUSB-C \n3.5 mm headphone jack\nMoto Mods support\t\nYes\nWater resistance\t\nWater-repellent coating\nSecurity\t\nOne-touch fingerprint sensor\nBattery\t\n3000mAh\nTurboPower charger (8 hrs battery in 15 min)\nColors\t\nLunar Gray, Fine Gold, Nimbus Blue, Super Black\nDimensions\t\n156.2 x 76.2 x 5.99 mm\nWeight\t\n145g\nBands\t\nCDMA 850, 1900 MHz \nGSM/EDGE 850, 900, 1800, 1900 MHz \nHSPA+ 850, 900, 1700, 1900, 2100 MHz \nLTE Band 1, 2, 3, 4, 5, 7, 8, 12, 13, 17, 20, 25, 26, 28, 29, 30, 38, 41, 66", "time": "06-01-2017 12:09 PM", "replies": []}]}, {"title": "Second Generation Motorola Moto Z2 Play (Moto Z2 Play 2017)", "thread": [{"postID": "post5776280", "text": "https://www.technobuffalo.com/2017/0...ook-exclusive/", "time": "04-21-2017 10:39 PM", "replies": []}, {"postID": "post5799626", "text": "CRAP that looks nice. So far I think it's between this and the Axon 8 for my next phone!", "time": "05-03-2017 08:45 PM", "replies": []}, {"postID": "post5814578", "text": "https://twitter.com/evleaks/status/863580163153461249\nfunction loadx(data) {\n  document.write(data.html);\n}", "time": "05-14-2017 04:01 PM", "replies": []}, {"postID": "post5818811", "text": "https://twitter.com/rquandt/status/864223111834730497\nfunction loadx(data) {\n  document.write(data.html);\n}\nMoto E4, E4 Plus, and Z2 Play show up in leaked renders | Android Central", "time": "05-17-2017 03:57 PM", "replies": []}, {"postID": "post5818900", "text": "https://twitter.com/rquandt/status/864575070789931008\nfunction loadx(data) {\n  document.write(data.html);\n}", "time": "05-17-2017 05:00 PM", "replies": []}, {"postID": "post5823486", "text": "anyone one else disappointed about the moto z2 play battery and build?\ni hate that they are making it slimmer and making it a metal body with no glass and smaller battery..\ni really liked the features that it had.https://www.xda-developers.com/moto-...irms-the-same/", "time": "05-21-2017 06:36 PM", "replies": []}, {"postID": "post5823493", "text": "Disappointing indeed and downsized battery smh...Moto Z2 Play passes through TENAA - barely 6mm thick, just 2,820mAh battery - GSMArena.com news", "time": "05-21-2017 06:43 PM", "replies": [{"postID": "post5823513", "text": "Downsizing the battery?! Nooooo...\nMy upgrading choices are between the Z2 Play, the HTC U11, and the Axon 8 (once we know more about that). So far, looks like HTC has me.", "time": "05-21-2017 07:04 PM", "replies": []}]}, {"postID": "post5823533", "text": "Nope, not at all. It has not even been officially announced yet, so everything \"leaking\" at this point is just rumors and speculation.", "time": "05-21-2017 07:17 PM", "replies": [{"postID": "post5823552", "text": "You're right about it being speculation at this point. Hopefully the rumours are proven wrong!", "time": "05-21-2017 07:35 PM", "replies": [{"postID": "post5823639", "text": "The leaks are mounting though and coming​ from increasingly credible seeming sources. Additionally, Moto has a clear incentive to reduce the battery size. For one, people seem to lap up thin phones. And secondly, it makes their battery Moto mods more attractive. If the new Moto branded power pack mod is as thin as the reports suggest (and the phones price stays the same) I suppose I won't mind. If the stock battery is 3000ish and the mod ads another 1000, that's PLENTY of juice.", "time": "05-21-2017 08:55 PM", "replies": [{"postID": "post5823647", "text": "I definitely understand what you're saying. If Motorola wants to push their modular market, then making the battery a bit smaller would be a wise move - and, of course, the slimmer phone design would work in conjunction with that. I wouldn't mind having a thicker phone if the battery was bigger! But I get that a lot of users are trending towards slimmer phones.", "time": "05-21-2017 09:06 PM", "replies": [{"postID": "post5823651", "text": "I use the Z Play as my daily driver and love it. I also have the JBL mod that I got for <$50 , which I love. By itself I have zero issues with the phones dimensions. But add a mod and it does get chunky. The new Moto branded battery mod due to drop this summer is supposed to be very thin tho, so it should be a good one to use for us 1st gen Z Play users.", "time": "05-21-2017 09:13 PM", "replies": [{"postID": "post5823922", "text": "That's great to hear about the mod! I'm excited for Moto.", "time": "05-22-2017 06:48 AM", "replies": []}]}]}]}]}, {"postID": "post5823660", "text": "But they have confirmed it on Twitter.\nCheck out @lenovo's Tweet: https://twitter.com/lenovo/status/86...834732545?s=09", "time": "05-21-2017 09:29 PM", "replies": []}]}, {"postID": "post5823675", "text": "One tweet doesn't prove much", "time": "05-21-2017 09:41 PM", "replies": [{"postID": "post5823683", "text": "If it's from Lenovo's official Twitter page, and doesn't subsequently get removed for error, that ups the confidence interval substantially.", "time": "05-21-2017 10:00 PM", "replies": []}]}, {"postID": "post5823933", "text": "I think it's pretty disappointing. I really loved the z play last year. What a surprise phone for me. Didn't think I was interested in the mods, but since I liked the phone so much I bought a few of the style ones and the jbl. Literal two day battery life, so didn't ever really have to worry. It was great for vacations. Intended to buy this years too but even if optimized a battery that size won't last two days and I don't want a battery mod. Once you buy that the phone ends up costing more than what it is worth imo. If the other rumored specs are true, it doesn't sound like there's much incentive not to just got find an old zplay and get that instead.", "time": "05-22-2017 07:13 AM", "replies": []}, {"postID": "post5824400", "text": "Mod not: Moved to Rumored Devices Forum.", "time": "05-22-2017 01:39 PM", "replies": []}, {"postID": "post5828405", "text": "Looks like they killed the Z Play with mods, stole the name and gave it to the standard Z successor. Then said \"hey! Why don't we make a Z play without the mods, that will be greaaaaaat!\" Hence we get the rebirth of the Moto X. \nI'm beyond pissed I bought two battery mods (yes I use them on the play all the time, size is not an issue) and a speaker mod.\nWhy can't the Moto X4 have mods too!?!\nThat 660 processor in the X4 better be wayyy more efficiant than the 625 in the Z play... I still needed mods even with the big battery to get 2 day battery life, now it's more like two mods after half a year of battery ware and tear.", "time": "05-25-2017 08:50 PM", "replies": [{"postID": "post5833333", "text": "Per Jerry on recent AC podcasts, the 660 is sort of a more efficient 820. Don't expect the 660 to be a battery god.", "time": "05-30-2017 02:29 PM", "replies": []}]}, {"postID": "post5830363", "text": "if the moto x4 has a 5.2 inch screen its not replacing my z play. i dont need a screen downgrade.", "time": "05-27-2017 08:07 PM", "replies": []}, {"postID": "post5834393", "text": "https://twitter.com/rquandt/status/867831132330614784\nfunction loadx(data) {\n  document.write(data.html);\n}", "time": "05-31-2017 01:22 PM", "replies": []}, {"postID": "post5834405", "text": "https://twitter.com/rquandt/status/868509678413553664\nfunction loadx(data) {\n  document.write(data.html);\n}\nhttps://twitter.com/rquandt/status/868679816798654464\nfunction loadx(data) {\n  document.write(data.html);\n}\nhttps://twitter.com/rquandt/status/868684661915959297\nfunction loadx(data) {\n  document.write(data.html);\n}\nhttps://twitter.com/rquandt/status/868993415878393856\nfunction loadx(data) {\n  document.write(data.html);\n}\nhttps://twitter.com/rquandt/status/868995384885911552\nfunction loadx(data) {\n  document.write(data.html);\n}\nhttps://twitter.com/rquandt/status/869328485243789312\nfunction loadx(data) {\n  document.write(data.html);\n}\nhttps://twitter.com/rquandt/status/869964668269232130\nfunction loadx(data) {\n  document.write(data.html);\n}\nhttps://twitter.com/rquandt/status/869335856758140928\nfunction loadx(data) {\n  document.write(data.html);\n}", "time": "05-31-2017 01:33 PM", "replies": []}, {"postID": "post5834407", "text": "https://twitter.com/rquandt/status/869969946574323713\nfunction loadx(data) {\n  document.write(data.html);\n}\nSmartphone Moto Z2 Play Projector Edit. DO Motorola - Telefonia - Kalunga.com", "time": "05-31-2017 01:35 PM", "replies": []}, {"postID": "post5834412", "text": "Moto Z2 lineup: all the rumors in one place (Update: more Moto Z2 and Z2 Play pics leak)", "time": "05-31-2017 01:39 PM", "replies": []}, {"postID": "post5834417", "text": "https://twitter.com/Slashleaks/statu...41127671480320\nfunction loadx(data) {\n  document.write(data.html);\n}\nhttps://twitter.com/Slashleaks/statu...49225074765824\nfunction loadx(data) {\n  document.write(data.html);\n}\nhttps://twitter.com/Slashleaks/statu...61729754542085\nfunction loadx(data) {\n  document.write(data.html);\n}", "time": "05-31-2017 01:42 PM", "replies": []}, {"postID": "post5835370", "text": "The one thing I want better is the camera. It's not bad in good lighting but it has no action or sport mode which is a huge disappointment.", "time": "06-01-2017 10:11 AM", "replies": []}]}]
