[{"title": "home mini snooze problem", "thread": [{"postID": "post6174507", "text": "When I set a media alarm and ask the mini to snooze for 10 minutes it snoozes until 10pm. Anyone else have this issue and have you found a fix? It works fine for a regular alarm but not when using media.", "time": "02-28-2018 01:17 AM", "replies": []}]}, {"title": "Broadcast to another room.", "thread": [{"postID": "post6147539", "text": "We have multiple mini's through out our house and the basement. Does anyone know if you can broadcast to a specific room instead of all of them?", "time": "01-27-2018 10:53 PM", "replies": [{"postID": "post6147992", "text": "You can not. Broadcast feature sends to all.", "time": "01-28-2018 01:48 PM", "replies": []}, {"postID": "post6160097", "text": "This 'feature' drives me crazy. Does my spouse really need to know that i can't spell?", "time": "02-11-2018 09:22 AM", "replies": [{"postID": "post6162524", "text": "I'm lost..... How would your spouse know you can't spell, when the broadcast is verbally spoken across all speakers?", "time": "02-14-2018 12:06 PM", "replies": []}]}]}, {"postID": "post6149914", "text": "A simple \"Ok Google, broadcast...\" ahead of your intended message will get it sent out through every Home in the house, much like a PA system.", "time": "01-30-2018 01:41 PM", "replies": []}, {"postID": "post6162537", "text": "\"Okay Google. How do you spell 'ridiculous'?\" Ridiculous is spelled (and announced to all in the househould), R-i-d-i-c-u-l-o-u-s.\nObviously, you are a talented speller. I'm envous...envious.", "time": "02-14-2018 12:30 PM", "replies": [{"postID": "post6162927", "text": "When I ask my mini a question like that, it only answers on the one I'm talking to. The only time it broadcasts to all is if I give a Broadcast command. I'm not sure what's wrong with your setup there.", "time": "02-14-2018 11:36 PM", "replies": [{"postID": "post6163185", "text": "However, I'm asking my phone. The mini, in another room, takes over. \nThe point is, there needs to be two different activation words that work consistently.", "time": "02-15-2018 08:11 AM", "replies": [{"postID": "post6163389", "text": "Oh, I see. Yes, the Google Home will take over even when you ask your phone. All you can do for now when in proximity of a Google Home is hold the home button on your phone for Google Assistant instead of \"OK Google\". Particularly if you want more private results.", "time": "02-15-2018 12:34 PM", "replies": [{"postID": "post6163457", "text": "Or unplug the mini.\nCute hound! Love those ears.", "time": "02-15-2018 01:44 PM", "replies": []}, {"postID": "post6163616", "text": "I just have \"OK Google\" shut off on my phone. It only works in Maps / Android Auto. Otherwise I just squeeze my Pixel to get my assistant on phone. If at home I just talk to one of my many Google Homes aloud without an issue.", "time": "02-15-2018 04:57 PM", "replies": []}]}]}]}]}]}, {"title": "Voice matching different minis", "thread": [{"postID": "post6119032", "text": "Hi there \nSo I bought my GF a home mini. I got two minis at home myself but I can't seem to figure out the following:\nHow do I setup voice match for my voice on her home mini WITHOUT it broadcasting to her.\nI want my broadcasts to go to my own home minis since we don't live together yet. \nAnybody familiar with this and have a solution for it?\nThanks in advance", "time": "12-27-2017 05:16 AM", "replies": [{"postID": "post6158444", "text": "I think the minis have to be on the same Wi-Fi network to broadcast.", "time": "02-09-2018 05:48 AM", "replies": []}]}]}, {"title": "Ambient sounds", "thread": [{"postID": "post6155640", "text": "This is a feature I found out about on day 1, by mistake just asking Google what certain sounds, sound like. But like the author and commentors on this Verge article from a couple of days ago I didn't know how to make it play longer than an hour. But then one day while playing the oscillating fan sound I opened the Google home app and one of the tip cards said, if you want the audio to stop at a certain time, while the audio is playing, you ask it to turn off the sound at whatever time you want it to turn off. Example, \"ok Google turn of audio at 2am. \nThe article gives some good specific sounds you can get Google home to play, you can check it out below.\nHow to sleep easier with Google Home’s white noise feature. http://google.com/newsstand/s/CBIw4Om40Dc", "time": "02-06-2018 03:46 AM", "replies": []}, {"postID": "post6156013", "text": "I read that same comment section at The Verge, and was a bit surprised that some people didn't seem be aware that this was possible. \nI listen to white noise as well during sleep and would set a time for it to cease.\nThanks for the post!", "time": "02-06-2018 12:53 PM", "replies": []}]}, {"title": "Pairing Mini's to play in stereo", "thread": [{"postID": "post6119541", "text": "Does anyone know if that feature is headed for the Mini? I know it's in the max but it would be awesome if it was in the mini as well.", "time": "12-27-2017 01:57 PM", "replies": []}, {"postID": "post6152224", "text": "Just go to the Home app and create a pairing just like the Max.", "time": "02-02-2018 03:22 AM", "replies": [{"postID": "post6153287", "text": "Did the recently added that feature? I haven't seen it yet, so if you pay two minis, both will play in mono.", "time": "02-03-2018 08:18 AM", "replies": []}]}, {"postID": "post6153636", "text": "No, Linebarrel86 is not correct.\nYou can only add Mini's to an Audio Group. You can not pair them for stereo output.", "time": "02-03-2018 04:09 PM", "replies": []}]}, {"title": "The most worthless device?", "thread": [{"postID": "post6116406", "text": "Maybe I am just doing something wrong? But most of the time my mini never understands what I am asking, or it is unable to use that function (answer a question, search function). Is there a way to fix this?", "time": "12-23-2017 08:32 PM", "replies": []}, {"postID": "post6116438", "text": "I guess it depends on how extravagant the things you're asking it to do are. I've never had any issues, but I mainly use my home devices (and phone assistant) for playing music, checking weather/traffic, and setting reminders/calendar events.", "time": "12-23-2017 09:21 PM", "replies": []}, {"postID": "post6116441", "text": "What're you asking it?\nI ask the below without issue...\n- traffic\n- weather\n- reminders\n- news\n- control home thermostat\n- control Phillips Hue lights\n- add stuff to calendar\n- ask when football games are on\nEtc.", "time": "12-23-2017 09:25 PM", "replies": []}, {"postID": "post6116831", "text": "Mine works fine for me also. Did you try to retrain it for your voice?", "time": "12-24-2017 08:44 AM", "replies": []}, {"postID": "post6117281", "text": "I ask general questions, who was the ( 7th president? what is the capital of _______? how many liquid ounces in a pound? More than 75% of the time it does not know what I'm asking it? I ask my phone the same question and the answer pops up. I'll retrain my voice and see what it happens.", "time": "12-24-2017 10:01 PM", "replies": [{"postID": "post6134602", "text": "And back to the original topic ... Did you manage to get better results after retraining your voice?", "time": "01-12-2018 01:40 PM", "replies": []}]}, {"postID": "post6118098", "text": "I'm in love with my mini ok well not literally but I got my Christmas morning and it's brilliant if there is one fault and I mean one fault no battery in it but what a thing.\noh you can get it to set timers etc too", "time": "12-26-2017 03:58 AM", "replies": [{"postID": "post6118438", "text": "There's no battery because it's meant to stay home. Hence the name Home mini.", "time": "12-26-2017 12:25 PM", "replies": [{"postID": "post6128854", "text": "Well let's keepitreel shall we it also has a Bluetooth function to it so it acts as a speaker.\nAlso why does it need to stay at home, I happen to think I can pretty much take it anywhere with me as it is an assistant.\nIt's a very handy device for holidays too I spend times in b and b's so information about weather etc locally is handy.\nAnd besides it's handy for streaming music etc too.\nSo my comment about no battery is in my books pretty vaild one", "time": "01-06-2018 02:55 PM", "replies": [{"postID": "post6133548", "text": "I use the Google Assistant in my phone for that stiff when I'm traveling. It's a lot easier than setting up a Home on a new network energy place I go. Especially since I don't trust public wifi.", "time": "01-11-2018 12:50 PM", "replies": []}, {"postID": "post6133551", "text": "I understand that and they make Bluetooth portable speakers with built-in Google assistant for that purpose. The purpose of the home mini is to stay home, that's why it's called home.", "time": "01-11-2018 12:54 PM", "replies": [{"postID": "post6134106", "text": "I'm going to ask you a question does a stay at home mum/dad stay just at home or do they travel.\nHome is just a word.\nPaul Young wrote \" Wherever I lay my hat that's my home \".", "time": "01-12-2018 02:33 AM", "replies": [{"postID": "post6134267", "text": "Dude are you serious? Okay I'll entertain your response....\nThe term stay at home mum/dad is defined as a parent that does not work outside of the home. So a stay at home mum/dad will travel but guess what, they're not working outside the home. Much like the Home mini....\nBoom", "time": "01-12-2018 08:08 AM", "replies": []}, {"postID": "post6134410", "text": "If you truly want a portable one then get a real Google Home (a.k.a non-mini) and buy one of these 3rd party battery packs.https://www.theverge.com/circuitbrea...rtable-ninety7\nOtherwise.. there is no way to do it. They didn't intend for this to be a portable product.", "time": "01-12-2018 10:29 AM", "replies": [{"postID": "post6135043", "text": "I could do that with the mini but to seems a bit pointless", "time": "01-13-2018 04:00 AM", "replies": []}]}]}]}, {"postID": "post6144339", "text": "Well, you do already have a battery powered version in your phone, so why the redundancy?", "time": "01-23-2018 11:22 PM", "replies": []}]}]}]}, {"postID": "post6118138", "text": "Mine works perfectly", "time": "12-26-2017 05:11 AM", "replies": []}, {"postID": "post6131239", "text": "Google Home Mini has no bluetooth. It connects through WiFi. If you were to take it other places, you would need to set it up each time on your phone and connect it to whatever network you're on. Again - hence the name \"Google Home\". It's meant to be left at home.\nIf you're travelling, use your phone for all the above mentioned features (weather, streaming music, etc).", "time": "01-09-2018 09:44 AM", "replies": [{"postID": "post6131611", "text": "Yes, it does have Bluetooth. As he said, it can be used as a Bluetooth speaker. Also, most speculate that the hardware could also support Bluetooth in the other direction - letting the mini broadcast to a Bluetooth speaker - if only Google decided to enable it. However, it currently can receive a Bluetooth signal and act as a Bluetooth speaker. Fact.", "time": "01-09-2018 03:56 PM", "replies": [{"postID": "post6132116", "text": "Well thanks for that info! I stand corrected. You do learn something new every day.", "time": "01-10-2018 06:30 AM", "replies": []}]}]}, {"postID": "post6134404", "text": "Mod note: please keep the conversation civil and on topic.", "time": "01-12-2018 10:26 AM", "replies": [{"postID": "post6135042", "text": "It's not me trying to be rude about this as some one who travels I just see the mini as being more than it is at the moment.\nI think some take the word \"home\" far to seriously.", "time": "01-13-2018 03:59 AM", "replies": [{"postID": "post6135183", "text": "Regardless, my post still stands. \nA reminder for those in the thread: https://forums.androidcentral.com/vo...ml#post5715201", "time": "01-13-2018 09:14 AM", "replies": [{"postID": "post6135222", "text": "I'd be grateful if you can point out where I was rude or I swore etc.", "time": "01-13-2018 10:50 AM", "replies": []}]}]}]}, {"postID": "post6134536", "text": "The portable Google Home would be your phone's Google Assistant. The \"Home\" part of the Google Home name refers to its ability to control your smarthome devices. For all of the other things you can ask your Google Home to answer, it's the same as saying \"Hey Google\" to your phone.", "time": "01-12-2018 12:27 PM", "replies": []}, {"postID": "post6135062", "text": "I'd like to clear one thing up I love the mini it's brilliant as I type it's streaming some music for me.\nmy comment about no battery was as I see it something Google could think of for the future it's brilliant at what it does as an assistant.\nyes I know my phone can do all this with an added Bluetooth speaker which is where my point about no battery it has a Bluetooth function and it's a speaker so adding a battery to it gives it a chance to be more than it is right now.\nif you read my original post it was my only negative point about it the rest of it all positive.\nI can say good morning too it, it gives me the weather traffic and the news.\nI use it to set reminders for me\ntimers \nalarms etc.", "time": "01-13-2018 05:21 AM", "replies": [{"postID": "post6151498", "text": "Thought about you when I bought a battery powered Bluetooth speaker with the Google assistant inside. Functions exactly like a regular GH except it's a bigger speaker. It's amazing for moving it to different rooms in the house without having to wait for it to boot up. However when it's outside the house (local park) it's just a Bluetooth speaker. There's no functionality of the assistant due to lack of WiFi. So basically it's just a plain Bluetooth speaker when there's no WiFi.", "time": "02-01-2018 08:48 AM", "replies": [{"postID": "post6152068", "text": "Which one did you get?", "time": "02-01-2018 09:33 PM", "replies": [{"postID": "post6152232", "text": "Insignia (Best Buy brand) Bluetooth portable speakers with built-in Google assistant.", "time": "02-02-2018 03:40 AM", "replies": []}, {"postID": "post6152349", "text": "Battery is good for 5 hrs of continuous play. Great for moving in other parts of the house or the patio and backyard.", "time": "02-02-2018 07:49 AM", "replies": []}]}]}]}, {"postID": "post6135261", "text": "If you want a Google Assistant speaker with a battery, Mobvoi has the Tichome Mini.https://www.mobvoi.com/pages/tichomemini-landing\nBut when you're not connected to WiFi, it's just a Bluetooth speaker.", "time": "01-13-2018 11:57 AM", "replies": []}, {"postID": "post6135262", "text": "Hello,\nIf you have a question about mod actions shoot me a PM. Otherwise let's get back on topic.\nThanks .", "time": "01-13-2018 11:59 AM", "replies": []}, {"postID": "post6135602", "text": "Not sure why, but Google Home Mini units seem much smarter than my OG Google Home and my Google Home Max. I think there is something that differentiates the units, but I don't know if it's where they are positioned relative to the speaker, voice training, etc.", "time": "01-13-2018 07:56 PM", "replies": []}]}, {"title": "Interested in a mini, but questions.", "thread": [{"postID": "post6148131", "text": "I think the 911 option is not available yet, but can you hack this by creating contact called 911, or help, whatever and have it dial 911? Or in the instance that a police number is a regular number can you program police as that number and say, call the police and it dial the direct number?\nUsing the mini for dialing? Can you use the mini as a home speakerphone? Can you call into it from outside the house? If not can it help for incoming calls to your phone?\nI am thinking to use this as an option for my mom's house. She is an older lady and recently had some health problems. If I bought 2 (1 upstairs and 1 down) if she was unable to reach her phone or if the ringer wasn't on could this work to get in touch. Also the 911.", "time": "01-28-2018 03:58 PM", "replies": []}, {"postID": "post6151492", "text": "You can probably add the emergency numbers to your Google contacts but you can't receive incoming calls nor take calls from your cellphone with GH", "time": "02-01-2018 08:40 AM", "replies": []}]}, {"title": "YouTube videos stop playing", "thread": [{"postID": "post6123408", "text": "I tell Google Home something like \"Hey Google - Play Sia Videos\". It starts playing to the default Chromecast device, plays 1 or 2 videos, then stops and disconnects from the Chromecast device. Why?", "time": "12-31-2017 03:45 PM", "replies": []}, {"postID": "post6124325", "text": "Looks like I have this solved. The Chromecast was disconnecting and going back to home screen after some period of playing. It felt hot to the touch. I added ventilation to the cabinet and stuck a heat sink on it and it has not disconnected since. It seems to have been overheating in the enclosed cabinet. Maybe this will help someone else...", "time": "01-01-2018 07:36 PM", "replies": []}]}, {"title": "What am I missing on my Mini? It will not let my phone answer.", "thread": [{"postID": "post6066101", "text": "Ok, so I received my free Mini to go with my Pixel 2 XL.\nIt set up quickly and recognized my many smart devices without having do anything. It sounds fine , and it activates smart devices faster than my Dot's.\nIts unusable in my house tho!! Its 30' away in the kitchen and activates when I make a query to my phone! How does it not know which device is closer? My location is turned on in the phone.\nI never was inclined to buy one because it does what my phone does. Although my searches and questions are not all that private , having the answer to a question announced loudly in another room why my the P2 xl in my hand remains silent, is pretty useless.\nThe Google home app has a lot of things in it, but I don't see a setting that addresses this issue. I am also not having any luck googling the question. I have tried as many different ways to ask the question but it just gives me the faq for setting a mini up.\nAnyone else facing this issue?\nThe worst case was last night when I voice dialed someone on my phone and the freaking mini made the call!", "time": "11-12-2017 07:28 AM", "replies": []}, {"postID": "post6072003", "text": "I've had a Pixel and a couple Google Homes for a year now and I have not found a good solution to this. A perfect example of the issue is trying to set an alarm on your phone to wake you up in the morning. I use the Assistant all the time on my phone to set alarms but I can't do it completely hands free with my Home in listening range, which is almost anywhere in my house, because it will set the alarm on the Home instead. This doesn't do me any good since the Home is not in my bedroom.\nGoogle really needs to allow you to choose different wake words for your phone and the Home. I've submitted feed to Google on this through the Home app.", "time": "11-15-2017 08:05 PM", "replies": []}, {"postID": "post6081821", "text": "Just got my mini this afternoon. Got it set up and first thing I noticed is when I speak to my pixel it answers thru the mini which is supper annoying. Since I have no plan to buy all the other stuff that can be controlled by the mini I'll probably not get much use out of it. I'll check it out some more over the next couple of days. But so far it's like having a louder phone speaker sitting across the room. I'm not to impressed yet.\nEdit: for whatever reason it stopped answering thru the phone even in the same room. Much better now.", "time": "11-22-2017 09:58 PM", "replies": []}, {"postID": "post6082519", "text": "I agree, there should be separate activation phrases to segregate which device you want to respond to you, speaker or phone. I use active edge a lot normally, so for the bits when I'm at home and want the response from the phone that's my work around. But I like hands free too! Without a doubt that separation of tasks needs to be an update more sooner than later.", "time": "11-23-2017 02:58 PM", "replies": []}, {"postID": "post6121150", "text": "I have several homes and minis around the house and they respond to hey Google while my phone responds to ok Google.", "time": "12-29-2017 06:30 AM", "replies": [{"postID": "post6121314", "text": "Until your phone's assistant gets the \"Hey Google\" hotword update. Mine worked like this for the longest while, then my phone got the update and now both wake up, and it's hit or miss on who answers. Mostly my Home mini answers when I'm in earshot.", "time": "12-29-2017 09:35 AM", "replies": []}]}]}, {"title": "Proplem with Google Mini oops..", "thread": [{"postID": "post6014972", "text": "Well looks like we need a update.https://www.google.com/amp/s/www.the...-recording-bug", "time": "10-11-2017 08:32 AM", "replies": []}, {"postID": "post6014981", "text": "I believe they've already sent the update out. Or are you talking about a hardware update?", "time": "10-11-2017 08:43 AM", "replies": [{"postID": "post6015186", "text": "They sent out an update to fix it.", "time": "10-11-2017 11:14 AM", "replies": [{"postID": "post6015188", "text": "Yeah, but all it did is disable the touch to activate feature. I believe it's a hardware problem with it being too sensitive. Overall, I don't really care. I wouldn't use that touch to activate feature anyway so they can keep it disabled.", "time": "10-11-2017 11:15 AM", "replies": [{"postID": "post6015197", "text": "Yeah I don't touch my Google Home now to ever activate it. I just call out to it.", "time": "10-11-2017 11:26 AM", "replies": []}]}]}]}, {"postID": "post6015208", "text": "Right. If I have to touch it, then it defeats the purpose of having it.", "time": "10-11-2017 11:40 AM", "replies": []}, {"postID": "post6016068", "text": "Well, now that they've disabled touch altogether.... I won't be purchasing one. I'll use my free one, but I'm not paying for one where I can't touch it to turn off the alarm or anything like that", "time": "10-11-2017 11:12 PM", "replies": [{"postID": "post6018208", "text": "I use my phone for my alarm. I am not going to trust the power to stay on -- Not to see if I can make it to work or not lol.", "time": "10-13-2017 03:35 PM", "replies": [{"postID": "post6018239", "text": "Lol, see I'm even more paranoid than you about missing work. I set both my phone and my Google home every night. If something weird happens with the phone, I'm hopeful that the power doesn't go out that same night. I feel like at least one of them should be able to wake me up.", "time": "10-13-2017 03:55 PM", "replies": []}]}]}, {"postID": "post6032429", "text": "I've used Google Home and now Google Mini for my alarm for almost a year now and I've never once touched the top to turn off the alarm.\n'Hey Google, Stop\" is just as effective and kind of the point of a voice activated device.", "time": "10-22-2017 11:17 AM", "replies": []}, {"postID": "post6121156", "text": "The mini does have touch controls now. You touch the sides of the top to silence alarms, pause/play media, end calls, adjust volume etc.", "time": "12-29-2017 06:35 AM", "replies": []}]}, {"title": "Voice Match Setup Does Not Work", "thread": [{"postID": "post6092438", "text": "For some reason why I try to set up voice match I get an endless \"please wait.\" Any suggestions?", "time": "12-01-2017 08:51 AM", "replies": []}, {"postID": "post6092439", "text": "Try clearing your \"Google Home\" app's cache? Maybe something's stuck or corrupted...", "time": "12-01-2017 08:54 AM", "replies": [{"postID": "post6092488", "text": "Still nothing.", "time": "12-01-2017 09:58 AM", "replies": []}]}, {"postID": "post6092524", "text": "Might be an error on Google's side. Give it a couple hours and try again?", "time": "12-01-2017 10:42 AM", "replies": []}, {"postID": "post6099875", "text": "Having the same issue, I've uninstalled, FDR, cleared data cache but still freezes up every time. Any solution yet.", "time": "12-07-2017 11:44 PM", "replies": [{"postID": "post6100437", "text": "Same issue here..can't find a solution.", "time": "12-08-2017 01:15 PM", "replies": []}]}, {"postID": "post6104822", "text": "Exactly the same issue, I am from South Africa. I wonder if certain regions are not activated yet for voice match?", "time": "12-12-2017 12:25 PM", "replies": []}, {"postID": "post6107976", "text": "Had the exact same issue here - SGS8 with Google Beta app - uninstalled the updates in the Google app, went to the Google Home app and setup the voice match on my Google Home Mini and all is good. Re-installed the updates to Google app and we're off!", "time": "12-15-2017 01:59 PM", "replies": []}, {"postID": "post6109014", "text": "Mine is also experiencing a problem .\nWhen trying to setup voice match, the screen is stuck on the first task\nSay :OK Google\"", "time": "12-16-2017 02:43 PM", "replies": []}, {"postID": "post6109800", "text": "I have a Moto X 2nd Generation phone and recently purchased the Goggle Mini. I installed the Google Home app on my phone and was able to train the mini to recognize my voice. So far so good. Then I installed the Google Mini app on my wife's phone and trained it to recognize her voice. Perfect! Except after that when I asked the mini to setup an appointment on my calendar it told me \"I cannot recognize you're voice so I cannot do that\". I have tried for two days to get it to recognize my voice but it just keeps asking me to say \"hey Google\" and nothing happens. So far I restarted my phone, restarted the mini, uninstalled the app on my phone, reinstalled the app and nothing works.", "time": "12-17-2017 11:32 AM", "replies": []}, {"postID": "post6119683", "text": "I have the same issue. Over here I can't even get the option to setup several accounts on my mini in the Google home app. \nPlease help. How do I get this to work ?", "time": "12-27-2017 04:28 PM", "replies": [{"postID": "post6120786", "text": "I'm having the same issue must be in Google side", "time": "12-28-2017 06:40 PM", "replies": [{"postID": "post6120789", "text": "Scratch that just retrained my home system and it worked", "time": "12-28-2017 06:45 PM", "replies": []}]}]}]}, {"title": "Playing Music from my Library on Google Play Music", "thread": [{"postID": "post6083777", "text": "I just purchased two Google Home Mini devices. For some reason, I cannot get them to play any music from my library on Google Play Music. Everytime I ask it to, it says it can't play it, but it plays a radio station based on what I asked. It seems from other forums that other people are having the same issue. Has anyone been able to fix this?", "time": "11-24-2017 10:36 PM", "replies": []}, {"postID": "post6085035", "text": "I have asked mine to play my playlist in play music and it works fine. It needs the exact name though otherwise it doesn't find it nor look for something similar. Haven't tried particular artists, genres, etc.", "time": "11-26-2017 05:22 AM", "replies": []}, {"postID": "post6106671", "text": "I think my Home has asked me to choose in the app what media source I want to play from. Try looking through the app to see if you can select Google Play Music in there.", "time": "12-14-2017 08:06 AM", "replies": [{"postID": "post6107025", "text": "I have, and Google Play Music is selected. Still not working.", "time": "12-14-2017 02:42 PM", "replies": []}]}, {"postID": "post6120732", "text": "There is a large discussion about this on the Google Home forum. It does not work for content you have uploaded unless you use a playlist. If you say \"Hey Google play xyz from my library\" you will be directed to a radio mix. Some have stated the metadata in your uploaded music is bad, I for one can say that's not the issue, my metadata is fine. \nThe only time it seems to work for your music is if Google does not have that album in their premium service. I have confirmed this with some unusual jazz albums that I have. They work fine, but anything that Google has they won't let you play it unless you use a playlist. \nAnd this issue has been going on for months and Google has done nothing to fix it.", "time": "12-28-2017 05:30 PM", "replies": []}]}, {"title": "Family link and Google home", "thread": [{"postID": "post6117978", "text": "I now have three Google home devices, and would like to register my kid's family link accounts to them. According to the Google website, you register them using their special device that you've set up. https://support.google.com/families/.../7521263?hl=en\nMy issue is that I don't have an extra device to use to set up the Google homes. Anyone know how I can do this without their device? Thanks!", "time": "12-25-2017 10:37 PM", "replies": []}]}, {"title": "broken out of the box.", "thread": [{"postID": "post6117702", "text": "So for Christmas my mother decided to pick me up a Google mini to get me going. I hooked it up and it worked fine then all of the sudden it didn't. I unplugged it in my my tech support wisdom. And found that the power cord was busted.\nNow she got it from.best buy so I'm.not sure if I should go after google or bestbuy to fix the problem.", "time": "12-25-2017 02:32 PM", "replies": []}, {"postID": "post6117703", "text": "If it was bought at Best Buy, you'll need to call them to replace it. Google will only support devices they sell directly.", "time": "12-25-2017 02:34 PM", "replies": []}]}, {"title": "\"hey google\" with Pixel and Home, Wrong Device Answers", "thread": [{"postID": "post6111738", "text": "So, after weeks of waiting for \"Hey, Google\" to make it to my Pixel, now I'm wishing it hadn't. Until now, I could control my phone with an \"OK, Google\" and my Mini with \"Hey, Google!\"\nMy Pixel got the \"Hey, Google\" update on the weekend. This morning, I wanted to listen to my local radio station on my Mini (it's on TuneIn Radio) so I said what I always say \"Hey, Google, play <insert my radio station here>\". Before, my Mini would say \"Playing on TuneIn\" and turn it on. Today, both devices answered to \"Hey, Google\", my phone responded with \"TuneIn is not installed on this device\". I don't know what my Mini said because my Pixel drowned it out. In order to get it to work, I had to go closer to my Mini and almost whisper to it. I don't like keeping secrets from my Pixel. \nI even tried telling it to play on my \"Mini\" - that's what it's named in my Home App - and it didn't understand.\nI've read that you can supposedly set up one device to do it all regardless of what device answers... is this true?\nHow does everyone else deal with this if you carry your phone on you and you want your Home (or Mini) to do things and not your phone?", "time": "12-19-2017 08:26 AM", "replies": []}, {"postID": "post6111782", "text": "It would be nice if Google could allow to add an ID at the end of either 'Hey Google' or 'OK Google'. Like 'OK Google Pixel; will I need an umbrella?' or 'Hey Google Mini, play Metallica on Spotify'.", "time": "12-19-2017 09:02 AM", "replies": []}, {"postID": "post6111796", "text": "Something seems off here, both should be listening but your Pixel should give you a message (text toast message) that says answering on another device and the Mini should be the only one answering. Going to test this more when I get home. One thing you can do is retrain your phone's voice recognition and just say \"ok google\" at all 4 prompts instead of using hey google. Then \"ok google\" would be activating the phone, and \"hey google\" would be activating the homes.", "time": "12-19-2017 09:13 AM", "replies": [{"postID": "post6112298", "text": "I did that, but the phone still picks up Hey Google.\nMine two devices did that for a bit, but after a only saying hey Google to my home devices and ok Google to the phone, it has gotten less prevalent.\nHowever, as Aquila said, even when both devices answer, my pixel tells me another device is handling. So maybe something is a bit goofy with your settings?", "time": "12-19-2017 05:36 PM", "replies": []}]}, {"postID": "post6116402", "text": "my mini picks up when I saw \"Okay, Google.\" it's so annoying when I'm just trying to use my phone. the worst thing is mini tells me it doesn't understand.", "time": "12-23-2017 08:30 PM", "replies": []}, {"postID": "post6116442", "text": "On my Pixel I use squeeze for assistant. I don't have the voice activated except during maps / Android Auto.", "time": "12-23-2017 09:26 PM", "replies": []}]}, {"title": "Home Mini vs the regular Home", "thread": [{"postID": "post6097828", "text": "I see the Mini is $29 and the regular Home is $79. Is the regular Home worth the extra $50, or is the mini just about as good for less money?\nOne of the main things I am trying to find out is speaker quality for listening to music.", "time": "12-06-2017 12:53 PM", "replies": [{"postID": "post6098940", "text": "I have both. I keep the mini in my kitchen, mainly for home automation tasks. The mini audio is ok, good enough to have noise while cooking. NOT something for more frequent music if you care about sound quality at all. \nThe full size home audio is much better for music. I find the mini to be a bit tinny and lacks bass. The full sized unit surprised me with the quality. I won't beat my Sound bar, but it's ease of use makes the home my primary device.", "time": "12-07-2017 10:08 AM", "replies": []}]}, {"postID": "post6097911", "text": "I got a mini on black Friday. I don't have a Google home. I find for listening to music my Mini works perfectly for me.\nI'm not an audiophile by any means, but I do know that the sound from that little puck is really really good (IMO).\nThere are reports of the mini crashing on certain songs played at high volume... Buy yourself a stereo if you need that.\nMy wife listens to Broadway music all day and she loves it.", "time": "12-06-2017 01:36 PM", "replies": []}, {"postID": "post6098245", "text": "The sound quality of the mini is not even close to the home. Much more bass and significantly louder with the home. Whether it's $50 better is an individual call. If you're not picky about sound and don't need it to be loud, then go with the mini. At $29 it is a steal.", "time": "12-06-2017 05:53 PM", "replies": [{"postID": "post6098764", "text": "That is my point completely. I don't have a need for a huge sound system in my home. It's a personal preference, and not everyone thinks the same thing. The Google Home (original?) is a bigger unit with better speakers and is MEANT to be more of a portable sound system. The Mini? It's perfect for me. It takes up ZERO room, sits nicely on the side table of my couch, and will play music when I want to hear it. I'm not hosting parties or DJ'ing with it. The sound is great. It is also my first \"smart home\" device so I wanted to give that a run through before I invested in the higher priced units.\nIt's your preference. If you just want to get your feet wet with the Google Assistant in your home, the Mini fits the bill (IMO). I like mine just great. I may get another later on. And yes - if you're looking at jumping in, prices are at the perfect point. Grab one and have fun.", "time": "12-07-2017 07:07 AM", "replies": []}]}, {"postID": "post6099187", "text": "I appreciate all of the responses. Still undecided which to get but definitely getting one of them before they go off sale.", "time": "12-07-2017 01:03 PM", "replies": []}, {"postID": "post6101345", "text": "Thank you for the information, everyone! My mom wants a Google Home Mini so I'm doing a bit of research before we go to the store. Thanks again!", "time": "12-09-2017 08:57 AM", "replies": [{"postID": "post6103342", "text": "Get one for your mom. You're a good \"kid\". \nIt's easy to use, easy to set up and just works great. I love my mini (as does my wife and kids).", "time": "12-11-2017 09:19 AM", "replies": []}]}, {"postID": "post6101970", "text": "I have a mini in my bedroom and just got a regular in the living room today. I'd have to say I was pretty impressed by the normal's sound. I use the mini for music during bed or tasks in the morning, and it does that job wonderfully.\nI still plan on buying a Maxx, for the sound, but the regular size will definitely be sufficient to hold me over til the price on it drops.", "time": "12-09-2017 09:18 PM", "replies": []}, {"postID": "post6107028", "text": "Get the mini and a Chromecast. I cast my music to the surround sound system hooked up to my TV and it sounds great.", "time": "12-14-2017 02:44 PM", "replies": [{"postID": "post6107939", "text": "A Chromecast Audio hooked up to even a cheap powered speaker works wonders in rooms without a stereo.", "time": "12-15-2017 01:14 PM", "replies": []}]}, {"postID": "post6109394", "text": "I ended up buying the regular Google Home. Thankfully Walmart had both on display to try out and I felt the speaker on the Home vs the mini was much better and felt it was worth the extra $50.", "time": "12-16-2017 10:47 PM", "replies": []}]}, {"title": "Got my Mini yesterday", "thread": [{"postID": "post6027097", "text": "I received my Mini yesterday. I set it up in my bedroom. I already have a hue light bulb in one lamp in the bedroom. Never really used it because my Google home is downstairs. It will be used a lot more now with the Mini upstairs. I also set up a Wemo plug in the bedroom to turn the fan on and off. Works like a charm. The sound is actually pretty good for such a small speaker.\nNice to have in the bedroom now as I never asked the what the weather was in the morning to the Home downstairs. Woke up and first thing I did was ask the weather. Glad they finally decided to do smaller version of home.", "time": "10-19-2017 08:50 AM", "replies": []}, {"postID": "post6029645", "text": "I want to get Hue lights so I can control them with my Google Homes.", "time": "10-20-2017 03:42 PM", "replies": [{"postID": "post6047993", "text": "I have hue lights set up and they are awesome. Highly recommend", "time": "10-31-2017 09:00 PM", "replies": []}, {"postID": "post6074273", "text": "A word of warning. It's very addictive. You start thinking about more and more stuff you can add, all of which costs money.", "time": "11-17-2017 10:24 AM", "replies": [{"postID": "post6074297", "text": "I bought them yesterday .. They will be here Saturday. I may be doomed :P.", "time": "11-17-2017 10:38 AM", "replies": []}]}]}, {"postID": "post6075932", "text": "I know I am. I making plans for the next group of purchases after I pay off my Best Buy card's current load. 12 or 18 months same as cash makes things very tempting.", "time": "11-18-2017 03:22 PM", "replies": []}, {"postID": "post6077408", "text": "Got my Phillips Hue lights hooked up... Sigh. Why did I do this to myself? I now need more bulbs. I am addicted lol :P.", "time": "11-19-2017 09:06 PM", "replies": []}, {"postID": "post6078561", "text": "The good news is, there are lots of sales right now.", "time": "11-20-2017 04:02 PM", "replies": [{"postID": "post6079098", "text": "Sadly not on the bulbs ($50 or so a pop) .", "time": "11-21-2017 12:11 AM", "replies": []}]}, {"postID": "post6083315", "text": "I still had the money my mom gave me last Christmas. Used it today to get 2 Google Home Minis, a hue white light starter kit, and a pair of TP-Link smart plugs. Saved a ton of money. Now I'm just waiting for my wife to get off work so I can go home a set it all up.", "time": "11-24-2017 01:13 PM", "replies": []}, {"postID": "post6094465", "text": "Loving the home mini right now.", "time": "12-03-2017 01:13 PM", "replies": []}, {"postID": "post6094561", "text": "just bought one at Best Buy. looking forward to getting home and setting it up", "time": "12-03-2017 02:50 PM", "replies": [{"postID": "post6094760", "text": "Until you get all the bugs worked out and learn what commands do what, here's your new best friend\n\"Hey Google, STOP!\"", "time": "12-03-2017 05:48 PM", "replies": [{"postID": "post6095529", "text": "LOL, yeah, figured that one out quick!", "time": "12-04-2017 11:53 AM", "replies": []}]}]}, {"postID": "post6096162", "text": "I got a Google home in my PC room, a mini in the kitchen/living room, and another mini in the bedroom. Very convenient .", "time": "12-04-2017 11:23 PM", "replies": []}]}, {"title": "Call Santa", "thread": [{"postID": "post6091210", "text": "Is anyone else able to use the new \"Call Santa\" on their Home Mini? Seen the ads, seen the articles, but when I try it Google Assistant tells me there is no application for that.\nIs this another great Google thing that only works in the US? I'm in Canada and I can use my mini to make phone calls just fine..\nOne thing I haven't tried (just thought of it) - do I need to make one phone call first, maybe so she knows what I want?\nOr am I right in assuming that it's not going to work in Canada?", "time": "11-30-2017 02:44 PM", "replies": [{"postID": "post6091213", "text": "Mines says: let's connect to call santa. And thats it haha", "time": "11-30-2017 02:48 PM", "replies": []}]}]}, {"title": "Does you Home Mini answer to other people?", "thread": [{"postID": "post6075321", "text": "I set up my Google Home Mini and it's fine. But when my husband is asking his Pixel 2 something, my Mini will answer. Sometimes both his phone and my Mini will answer but not simultaneously so it's like hearing two people talking at you at once which is annoying. Is it just going to always answer anyone who happens to say \"Ok Google?\"", "time": "11-18-2017 02:26 AM", "replies": []}, {"postID": "post6075551", "text": "Yes and workout trained voices... Kinda nice!", "time": "11-18-2017 08:46 AM", "replies": []}, {"postID": "post6077526", "text": "Ugh! Last night it was activated by a Google commercial on TV. The female voice said, \"Ok Google\" and the next thing I know, my Mini is launching into the day's news.", "time": "11-20-2017 12:10 AM", "replies": []}, {"postID": "post6085036", "text": "I expected to have to set my wife's Google account up with my mini for it to work for her voice, but it recognized it without set up. Only problem is without her account linked it only looks through my music, etc. Curious if I linked her account if it would distinguish the two voices between the two accounts...", "time": "11-26-2017 05:25 AM", "replies": []}, {"postID": "post6088284", "text": "When I did the voice recognition on mine I only said \"Hey Google\" even when it asked for \"OK Google\". As a result, so far my phone doesn't activate when I say \"Hey Google\" - the Mini does. But when I say \"OK Google\" just the phone comes to life and not the Mini. My wife is seeing the same results as well.", "time": "11-28-2017 03:16 PM", "replies": []}, {"postID": "post6089542", "text": "My daughter (who sounds nothing like my wife) had the assistant telling her (bad) jokes for a good half hour. last night. She isn't a \"recognized voice\".", "time": "11-29-2017 11:13 AM", "replies": []}]}, {"title": "How does \"Multiple Users\" work?", "thread": [{"postID": "post6087723", "text": "My Mini is arriving today so obviously I want to get it set up ASAP. No problem for me, I've been using \"OK Google\" on my Pixel (and Samsung S5) for a while now. I read on the Google info page that the mini will recognize 4 voices. That's great. There are 4 of us in the house.\nMy questions is this - once I get it set up and trained, will it work without me (and my phone) being in the house? I get that if you want to use it for calling it would be linked to an account somehow (we don't have GV here in Canada) so it would use Google Hangouts dialer.\nIf I'm here at work and my wife asks it a question or wants it to send music to our Chromecast, will it work? If we are out, and my daughter asks it for the weather, will Google Assistant tell her?", "time": "11-28-2017 08:14 AM", "replies": []}, {"postID": "post6087961", "text": "Mini arrived, set up was a snap. I see that it is linked to your Google account through the Google Home app. The app needs to be installed on each device that you want the owner to have control of your Mini. I was able to control it easily from across the room. I installed Google Home on my wife's phone, set up her voice and now she can control it too.\nWell done, Google!", "time": "11-28-2017 11:20 AM", "replies": []}]}, {"title": "No ads?", "thread": [{"postID": "post6070595", "text": "So did anyone else notice that when you stream Google play music on the home mini there are no ads?! (I don't pay for premium)", "time": "11-15-2017 05:54 AM", "replies": []}, {"postID": "post6074265", "text": "I've never gotten ads streaming on Google Play Music on my Google Home.", "time": "11-17-2017 10:20 AM", "replies": []}, {"postID": "post6075552", "text": "Yeah that's pretty cool", "time": "11-18-2017 08:46 AM", "replies": []}]}, {"title": "Free Google Home Mini", "thread": [{"postID": "post6048791", "text": "Has anyone who got a Pixel 2 from Verizon gotten any type of tracking info or spoken to someone at customer care who knows anything about this? I just called them and the person I spoke with was almost oblivious to the fact the promo was even offered and had to look that the promo even existed. Granted, it's a free offer, but I'm anxious to try it out!", "time": "11-01-2017 12:53 PM", "replies": []}, {"postID": "post6048838", "text": "I ordered from Google directly, and still haven't gotten the promo code emailed to me yet. The initial email I had received from Google said the promo code would be sent to me within 4 weeks of the phone shipping, so it's probably the same with Verizon.", "time": "11-01-2017 01:15 PM", "replies": []}, {"postID": "post6048870", "text": "Verizon said that they'd just send it out, no code or anything. All we had to do was activate the phone. Which I thought was a touch weird. They said they should arrive within 2-4 weeks.", "time": "11-01-2017 01:29 PM", "replies": []}, {"postID": "post6055413", "text": "This all seems very fishy by Verizon... at a minimum I expect to get a confirmation from Verizon as soon as I activate my phone saying that I qualify for the Google Home Mini and expect to see a tracking number within the next 2 to 4 weeks. Not providing their customers with any confirmation or anything period it's pretty unprofessional in my opinion.\nMy Pixel 2 XL has been activated for over 2 weeks now and I have not seen anything from Verizon yet about the Home Mini.", "time": "11-05-2017 03:28 PM", "replies": []}, {"postID": "post6066152", "text": "I got an email from Verizon saying my 2 minis are in process and will ship within two weeks.", "time": "11-12-2017 08:27 AM", "replies": []}, {"postID": "post6074659", "text": "Got mine today.", "time": "11-17-2017 03:53 PM", "replies": []}]}, {"title": "Google's version of the Echo Dot", "thread": [{"postID": "post5986362", "text": "The Home Mini is a shrunken version of the Google Home, and while smaller can be beneficial, it can bring it's own set of possible issues, like Phil points out in his article: https://www.androidcentral.com/googl...st-has-sell-it\nThe smaller size could impact the sound quality, and possible it's ability to catch wifi signals. But, in theory, it should reduce the price.\nHopefully, Google won't completely replace the standard Home with this. \nAny thought about this? Anyone who might consider getting one?", "time": "09-21-2017 10:01 AM", "replies": []}, {"postID": "post5986801", "text": "If you compare the rumoured $49 to the \"big brother\" at $129 or around there. it's actually very good value for money and I wouldn't mind having a little lower quality speakers if I'm getting a price reduction. 😃 The WiFi signal I'm not too worried about because my house is fairly small so it should be able to connect easily.", "time": "09-21-2017 02:09 PM", "replies": [{"postID": "post5986936", "text": "Good points. This could be looked at as an intro to your home being connected. Especially if you are not sure about going all in.", "time": "09-21-2017 03:41 PM", "replies": [{"postID": "post5987031", "text": "Definitely, let people test the waters at a low price to see if they like it and if they do, a year or 2 down the line, they can pick up a more expensive version and enjoy all the extra features that it comes with it.  I know its not a fair comparison (just emphasising entry to market price) but the difference in price between the Google Home and the Apple HomePod is pretty huge. Some people might not be willing to drop $350 on something they not sure of, but $49 is easy.", "time": "09-21-2017 04:59 PM", "replies": []}]}]}, {"postID": "post6004376", "text": "It's free with the Pixel so by default I'm getting one.", "time": "10-04-2017 03:33 PM", "replies": [{"postID": "post6007059", "text": "Yup! I'm definitely going to try it out.", "time": "10-06-2017 04:32 AM", "replies": []}]}]}]
