[{"title": "New message notifications/indicator on messages icon", "thread": [{"postID": "post6172465", "text": "Is there a way to get an indicator for new messages to show up on the messages icon. I know that there is a notification in the notification bar/tray but that's just not always as obvious to me that I have a new message especially if there are a lot of notifications.\nI'm talking about a dot on the messages icon that shows up only when there are new unread messages. Would be even better if it showed a new message count.\nI should also say I'm using the stock moto launcher. I do like it. I think nova launcher offers the feature I'm looking for but don't really want to change launchers.\nAre my options to get the feature I'm looking for to either change my default messaging app or launcher? I was hoping to avoid that.", "time": "02-26-2018 03:53 AM", "replies": [{"postID": "post6183813", "text": "Open", "time": "03-09-2018 01:04 AM", "replies": []}]}, {"postID": "post6172811", "text": "Depends on the launcher you're using. Not sure if the stock Moto one supports badges or not, but if it doesn't, you can install a launcher that supports that, like Nova (might have to download the additional unread badge plugin). I know you're trying to avoid it, but that's about the only thing that can help. \nYou can also try to get a widget that displays the app icon and an unread counter, and that would help keep your app and launcher, but I'm not sure which widget would work like that. But that's the other route IF such a thing exists (and, this being a widget, would only be on your homescreen, not in the app list or app shortcut bar).", "time": "02-26-2018 12:16 PM", "replies": []}]}, {"title": "February security update", "thread": [{"postID": "post6181591", "text": "Moto has been stepping up it's game with patches for the Moto X4. After dragging it's feet on Oreo (while still managing to beat Samsung S8), it has dropped two security updates including the Feb security patches for my unlocked USA Moto X4.\nGiven that it is March 6 this is pretty good for Android!", "time": "03-06-2018 10:37 PM", "replies": []}]}, {"title": "Moto X4 Android One Vs Pixel 2", "thread": [{"postID": "post6175005", "text": "I grew board after a couple months with my Pixel 2 due to it's lack of personality. While it is a very high performer in essentially all categories, I began to wonder if it's price we're truly justifiable. \nI have always had a soft spot for Moto phones since my first flip phone and smart phone we're both Motorola products, the later being the Droid Razr M on Verizon. I decided to give the Moto X4 a try when Project Fi offered it for $250 with a $80 service credit after activation and here are my thoughts after four days of use.\nBuild quality: Definitely a high build quality with the use of quality materials. Moto seems to have copied HTC's glass effect, though possibly with a different method than the pigment impregnation of the glass back. The phone feels weighty, though very slick. It is actually quite difficult to hold on handed without a case because it literally slides down my fingers. Overall, build quality easily matches Pixel 2.\nSpeaker: While the X4 only has one speaker, the quality of the sound is superior to the Pixel 2. The Pixel 2 had a harsh quality at anything above 50% in my experience. The X4 actually has a deeper and better tuned sound that enables me to hear more detail at a louder volume than the Pixel 2. In fact, I can hear a podcast through my X4 better while in the shower than I could with the Pixel 2.\nDisplay: I have seen a few reviews about poor or mediocre display visibility in sunlight, but I haven't had that experience at all. The display is both bright and clear with excellent saturation on normal display settings. While technically lower resolution than the Pixel 2, the difference is imperceptible.\nPerformance: here is possibly one of the two most obvious differences from the Pixel 2. The Snapdragon 630 in the X4 is noticably slower than the 835 in the Pixel 2. It is not frustratingly slower, just noticable. I have not had ANY issues with performance with either phone so I hesitate to say the more expensive Pixel 2 is worth the extra money for this reason alone. I can literally do everything I did with the Pixel 2 with the X4.\nCamera: The X4 camera is, hands down, inferior to the Pixel 2. The lack of OIS is blatantly obvious. With that said, the camera tuning from Moto is respectable because I can actually get pretty good pictures with the X4. Better, in fact, than I was able to achieve with the Moto Z2 (putrid product, btw). While the Pixel 2 camera had excellent performance and legitimately good added features, the extra features in the X4 camera app are more surprisingly impressive than the Pixel 2. In everyday life, the X4 camera features are more satisfying to use.\nCharging and battery life: battery life for both is comparable. Charging speeds are a whole different ball game. The Pixel 2 crawled to 100% as far as flagship phones are concerned, but the X4 flies! This comparison is with both phones using their OEM included chargers. The one shortfall of the X4 is that it tends to get quite hot while turbo charging.\nCall quality: Using both phones on Project Fi in Raleigh, NC, neither phone had reception issues of any sort. The main difference is that the X4 speaker is superior and allows me to hear the other person much more clearly than the Pixel 2. Other than that, there are no perceptible differences. Both switch seamlessly between carriers and WiFi and both utilize VoLTE very well.\nBonus: The X4 can connect to four different Bluetooth devices at the same time which is pretty awesome and unexpected for a mid range phone.\nFinally, my person preferences led me to choose the X4 over the Pixel 2. It can do 9/10 of what the Pixel 2 can and at a far lower price. That's all I can think of for now, but if anyone has questions about the X4 please don't hesitate to ask.", "time": "02-28-2018 02:19 PM", "replies": [{"postID": "post6175872", "text": "Interesting review, since I recently bought a Pixel 2. My only comment is about having any phone in a steamed-up bathroom. Only a totally waterproof phone can withstand even a moderate amount of steam. IP67 or IP68 isn't steam-resistant, so don't complain if the phone starts failing due to interior corrosion due to water.\nI agree with the harshness of the Pixel 2 at higher volumes. I thought it was just me.", "time": "03-01-2018 11:54 AM", "replies": []}]}, {"postID": "post6175040", "text": "Also, if anyone would like to give Project Fi a try, here is a referral code for a $20 service credit:\nAPM88U", "time": "02-28-2018 02:49 PM", "replies": []}, {"postID": "post6175928", "text": "Great review and comparison!\nIn the age of $700-$1000 smartphones, it's nice to know that the low-end is good enough for a lot of situations.", "time": "03-01-2018 01:02 PM", "replies": []}, {"postID": "post6176315", "text": "Thanks Ryan, \nThat was my whole motivation for writing this comparison. I'm tired of absurd pricing for small handheld cellular devices. It seems the return on investment materially declines with each step up in pricing/Snapdragon class.", "time": "03-01-2018 09:06 PM", "replies": []}]}, {"title": "Gaming?", "thread": [{"postID": "post6116823", "text": "Ok, the X4 seems to check all the boxes for me except plastic back (love the plastic feeling, not a fan of metal backs). But...\nI use my phone for gaming, ie Angry Birds 2. Motorola phones seem to run toasty if used heavily. My old Moto X Pure would routinely hit 115F, my G4 108F. My wife's S7 Edge can play all day at 95F. No case in all cases.\nAlso, is the X4 too slippery for no case use? \nAny feedback?", "time": "12-24-2017 08:29 AM", "replies": []}, {"postID": "post6175326", "text": "Got one. After 30 min gaming it's 95F at most, in line with wife's s7 edge.", "time": "02-28-2018 07:47 PM", "replies": []}, {"postID": "post6175426", "text": "More than likely you will find it too slippery to use without a case. As far as heat, mine only heats up when turbo charging. Slower chargers don't heat it up at all, so it must be an issue with the sheer volume of electrons being excited all at once on Turbo power. gaming has not been a noticable source of heat for me.", "time": "02-28-2018 10:01 PM", "replies": []}]}, {"title": "Anyone get 8.0 yet? Thoughts?", "thread": [{"postID": "post6122931", "text": "I'm still checking for the update on my wife's Project Fi X4, nothing come through yet...", "time": "12-31-2017 01:52 AM", "replies": []}, {"postID": "post6125245", "text": "I got it this afternoon - installing it now.", "time": "01-02-2018 06:49 PM", "replies": []}, {"postID": "post6128349", "text": "For the record, at some point over the last few days my wife apparently downloaded the 8.0 update. she hasn't said anything about it, which I take to mean there's been no obvious problems :-)", "time": "01-05-2018 11:35 PM", "replies": []}, {"postID": "post6132836", "text": "Android one version and I'm still sitting on 7.1.1 November security patch. I thought the android one was supposed to get timely updates!", "time": "01-10-2018 06:27 PM", "replies": [{"postID": "post6140581", "text": "Still no upate", "time": "01-19-2018 02:14 PM", "replies": []}]}, {"postID": "post6154655", "text": "Feb 4 2018 and still nothing on my unlocked X4...", "time": "02-05-2018 12:52 AM", "replies": []}, {"postID": "post6158283", "text": "Feb 8th and still nothing ...", "time": "02-08-2018 11:39 PM", "replies": []}, {"postID": "post6159522", "text": "Feb 10 finally got the 8.0 with Jan security patch update. So it looks like its finally rolling out here in the US.", "time": "02-10-2018 02:24 PM", "replies": []}, {"postID": "post6160239", "text": "Just checked. Nada. Rocking a Moto X4 unlocked running on Sprint.", "time": "02-11-2018 01:26 PM", "replies": []}, {"postID": "post6160331", "text": "X4 on Verizon & still no 8.0", "time": "02-11-2018 04:28 PM", "replies": []}, {"postID": "post6161057", "text": "I'm wondering if the Prime Exclusive edition will ever get 8.0. Can't find any info about it on the web.\nI did apparently get the \"update\" that removes the lock screen adds though I say apparently because I didn't see any update getting installed, the ads are just gone.", "time": "02-12-2018 02:14 PM", "replies": []}, {"postID": "post6161194", "text": "8.0 update notification arrived earlier today -- -- regular unlocked X4 on Verizon.", "time": "02-12-2018 04:32 PM", "replies": []}, {"postID": "post6161360", "text": "Just got the notice on Unlocked version. Feb 12. \\Installation took a while but seems to have gone well. The phone seems faster. Eager to see battery life. December security patch level, so still 2-3 months behind", "time": "02-12-2018 09:25 PM", "replies": []}, {"postID": "post6163405", "text": "Update on the update: Just received the 8.0.0 update on my Prime Exclusive edition, so that's apparently rolling out now.", "time": "02-15-2018 12:46 PM", "replies": []}, {"postID": "post6169406", "text": "Bought the Amazon edition on a small sale. Android 8.0 seems to be pretty snappy, though admittedly I don't have a lot to compare it to. Fingerprint reader has been fine so far and the camera seems to respond pretty well. I'm assuming that's the Motorola camera app, but can't really say for sure. Had one small system update after powering on and of course, the app updates, but system space used was something like 11GB so that's a small improvement over the initial reports.\nOnly gripe so far is that setting up a second user won't let that second user access the SD card. I'd like to have that set up so pictures and such go on the larger card instead of on the device. I don't necessarily plan to keep it that way, but it would be nice to have.", "time": "02-22-2018 01:18 PM", "replies": []}, {"postID": "post6175323", "text": "Animated gifs don't seem to work. They used to work in 7.0. the one below (long story) worked fine in 7 but not in 8. Not in gallery and Textra or Tapatalk or Piktures.", "time": "02-28-2018 07:45 PM", "replies": []}]}, {"title": "Moto X4 $299 President's Day sale", "thread": [{"postID": "post6167299", "text": "Moto X4 on sale at Moto's site as well as Best Buy, B&H, and others. The Moto web site says the same will last until March 3. That's a great price on the X4!\nI wonder if an X5 is coming soon?", "time": "02-20-2018 08:34 AM", "replies": []}, {"postID": "post6175161", "text": "The X5 is a good looking phone, returned my X4 because 32 gb internal memory is just not enough, hoping the X5 is released in NA with 64gbs and soon!", "time": "02-28-2018 04:56 PM", "replies": []}]}, {"title": "using a republic wireless x4 on T-Mobile", "thread": [{"postID": "post6169111", "text": "I was wondering if there's any reason why a Republic Wireless Moto X4 would be inferior to using say and unlocked Moto X4 from Best Buy on T-Mobile?\nUpdate channel the same?\nAll bands still supported?\nEtc.?", "time": "02-22-2018 08:28 AM", "replies": []}, {"postID": "post6169121", "text": "First I would suggest you make sure the Republic Wireless model is unlocked, BUT otherwise it appears you get 99% of the bands you need for T-Mobile. Missing is band 71 600 spectrum, BUT that is also missing from the regular unlocked model. And band 71 is not widely implemented yet.", "time": "02-22-2018 08:41 AM", "replies": []}, {"postID": "post6169149", "text": "thanks for replying \nyeah it is unlocked. \nand no other compromises?", "time": "02-22-2018 09:23 AM", "replies": [{"postID": "post6169203", "text": "None that I can see.", "time": "02-22-2018 10:28 AM", "replies": []}]}]}, {"title": "Hands on review", "thread": [{"postID": "post6041464", "text": "Thought I would share my post from another forum: \nMoto X4. Great phone. I got the Fi version. I've had Nexus 4, 5, 5X and 6P. This phone is right in there. Specifics:\nScreen: great quality, I can't tell any difference in vibrancy, density, clarity, etc. It looks great. Larger than the 5X, smaller than the 6P. It's a great size. It is not as easy to read in full sun as the AMOLED on the 6P.\nSpeed: some early reviews were worried about it being slow, or slow to respond to touch, etc. I'm not seeing any of that. It's like butter.\nCamera: again, I almost didn't buy the phone because some early reviews really trashed the camera app as slow and poor. It is not slow at all! I think the whole criticism was fake news - really. I like the phone features. As to quality, to me, it is like all my other Android phones. Good pictures, but not as good as iPhone photography (don't know what it is that Apple does to make their photos so damn good!) My only criticism is no Photosphere. I do use that from time to time. There must be a separate app somewhere that I can get to be able to continue.\nFeel in the hand: Much easier to handle that my 6P, but still a handful. I'm a \"no case\" guy and the phone is slippery, but so was my 6P when I first got it.\nLook: ehh. It's not bad, but nothing special to look at. Personally, I'm not a fan of the rounded corners and sides. The camera hump doesn't bother me at all. A little thing, but on the screen, the \"Home\" capacitive button, instead of a single circle, it uses two concentric circles, and I don't like it. I'm sure it will grow on me.\nCalls: great phone! Phone earpiece is louder than my 6P. Handles calls beautifully.\nFingerprint reader: it's on the front bottom and I was worried I wouldn't like it, but it's a non-issue. I use my two thumbs instead of index fingers. Same - same as 5X or 6P.\nStorage: It only comes in 32G. I have 133 apps installed. 22G used, 10G free. BUT - it has a SD card. \nSoftware: Motorola did a good job in living up to the Nexus (AndroidOne) spirit. There are only 3 Motorola apps on the phone. One, their Home launcher (got rid of it in a hurry - love Nova). The other I love, which is a notifications app. As your hand goes over the phone when its locked and the screen is dark, it will light up with time, battery strength, etc. Very nicely done and optional. It also has options to stop the phone from ringing after you pick it up but before you answer it, or lay it facedown to put the phone in \"do not disturb\".\nOverall: to me, it's definitely a major step up from the 5X. It's maybe a little step down from the 6P. But, the price was great, and since BOTH by 5X and 6P were casualties of the bootloop, I wanted to get what I thought was a better built, \"tougher\" phone - a Motorola. Don't know if that's true, but that's my perception.\nSo, no regrets! Love the phone. To me, it's the new Nexus.", "time": "10-27-2017 11:53 AM", "replies": [{"postID": "post6042501", "text": "Great review! How is battery life on the X4?", "time": "10-28-2017 06:09 AM", "replies": []}]}, {"postID": "post6041478", "text": "Thanks for the review! A question, is one-button nav included in your model? How many options do you get in the Moto Actions?", "time": "10-27-2017 12:00 PM", "replies": []}, {"postID": "post6041714", "text": "Not sure what you mean by on-button nav. Here are the moto actions available on it: quick screenshot, chop twice for flashlight, twist for quick capture, swipe to shrink screen (to make the screen smaller for one-handed use), pick up to stop ringing, flip for do not disturb, approach for moto display. Hope that helps, and thanks for the question. I didn't know there were so many options!", "time": "10-27-2017 02:15 PM", "replies": []}, {"postID": "post6041736", "text": "The one button nav is a Moto action that hides the navigation bar (home, back and recent apps) and let you use the fingerprint sensor to navigate. I wasn't sure if this option was available on your specific model.", "time": "10-27-2017 02:38 PM", "replies": [{"postID": "post6105131", "text": "Just read this thread (since I just got the phone last week) and didn't see that this was answered. Yes, it does have the one button nav, which I am really starting to like. Great phone in this price range.", "time": "12-12-2017 06:21 PM", "replies": []}]}, {"postID": "post6041811", "text": "How's the headphone jack sound quality?", "time": "10-27-2017 03:33 PM", "replies": []}, {"postID": "post6042076", "text": "Looks like the new Android One is more than the original Android One.", "time": "10-27-2017 07:45 PM", "replies": []}, {"postID": "post6042119", "text": "Honestly it's hard to swallow reviews for non flagship phones. It's like they're comparing it to flagships and not the same price range. Of course the camera would be poorer compared to the Note 8, Pixel, iPhone 8, v30, etc. But what about for the rest of the price range? People are looking at that phone because for one reason or another they're not willing to spend upwards of 600USD for a phone. They already know from the start it will be inferior to the flagships.\nI've seen and handled a number of phones bashed by reviewers but end up pretty decent in everyday use.", "time": "10-27-2017 08:18 PM", "replies": [{"postID": "post6042128", "text": "To add to this....as long as it performs the functions people need, it should be fine.", "time": "10-27-2017 08:22 PM", "replies": []}]}, {"postID": "post6042413", "text": "Good review. To add something that some people may not know, it has adoptable storage which means that the SD card can be used as if it's internal storage", "time": "10-28-2017 01:39 AM", "replies": []}, {"postID": "post6042619", "text": "Can you format a SD as internal storage? So far mine defaults to portable storage and never presents the prompt for internal.", "time": "10-28-2017 08:45 AM", "replies": [{"postID": "post6043197", "text": "What SD card are you using?", "time": "10-28-2017 05:00 PM", "replies": []}]}, {"postID": "post6042689", "text": "dby2011\nHow's the headphone jack sound quality?\nI'm not fussy about music on earbuds - it's not how I listen to music - so I can't really comment. But in general, it works fine. No different than my other phones. It's loud enough and people hear me fine on calls.", "time": "10-28-2017 09:58 AM", "replies": []}, {"postID": "post6042693", "text": "To the question on battery life. Superb so far. You can imagine the use a NEW phone gets in the early days of ownership. So far, I've finished every day without a recharge no problem. And, it may be obvious, but it fast chargers using the fast charger from my 6P as well as the one that came with the phone. Motorola called it \"turbo\" charge, not fast charge, so I wasn't sure they would be compatible, but they are.", "time": "10-28-2017 10:02 AM", "replies": [{"postID": "post6042951", "text": "Very nice. I was worried about battery life after the Android Central review, but that's good to hear.", "time": "10-28-2017 01:30 PM", "replies": []}]}, {"postID": "post6043073", "text": "Thanks for the hands on review. I'm curious about outdoor visibility as you say it's worse than the 6P. Is it a brightness issue or glass reflections/coatings? Because, the 6P is reviewed as having max brightness of ~340 nits and the x4 is ~510.", "time": "10-28-2017 03:27 PM", "replies": [{"postID": "post6047978", "text": "My 6P died the \"bootloop death\" so I can't compare now, but here's what I know. The 6P was so good, I had completely forgotten that outdoor visibility was even an issue with phones, and I live in a bright place and use a boat a lot. It hadn't even crossed my mind for a long time. The first time I used my Moto 4X, the issue popped out front and center. Don't get me wrong, it's not terrible, but you have to shade the phone or turn away from the sun, etc. on bright days. You can read it fine with a little positioning. Hope this helps.", "time": "10-31-2017 08:47 PM", "replies": []}]}, {"postID": "post6043202", "text": "It's a Class 10 Sandisk.", "time": "10-28-2017 05:01 PM", "replies": []}, {"postID": "post6046071", "text": "Thanks for the review. I have ordered the Amazon Exclusive version to give it a try since it is only $329. If the ads really bother me but I like it enough then I will just return it and order the regular unlocked version.", "time": "10-30-2017 03:28 PM", "replies": [{"postID": "post6046735", "text": "I think Amazon allows you to pay the difference and get the ads removed.", "time": "10-31-2017 12:54 AM", "replies": [{"postID": "post6047114", "text": "Yeah, I watched a video with this phone showing the ads and it was not as bad as I though. As long as you can delete most of the bloatware then it should be fine. If you pay the difference then you might as well just buy the unlocked version. I did just get a discount offer from Motorola so I have that option if I don't like the Amazon version.", "time": "10-31-2017 09:35 AM", "replies": []}]}]}, {"postID": "post6048432", "text": "Thanks!", "time": "11-01-2017 08:48 AM", "replies": []}, {"postID": "post6055943", "text": "Instead of doing another full review, as I pretty much feel the same way about the Moto X4 as john30308 does, I will add that I had one issue with my Amazon Exclusive version so I requested a refund and sent it back. Fortunately, my wife had ordered an unlocked one for me from Motorola and it arrived Saturday so I set that one up and I have been using it.\nThe issue I had with the Amazon version, and I am sure it was just a problem with that partucular phone as it has not happened with the one from Motorola, was that it would not always charge. I plugged it in Friday morning when I first got it and charged it to about 92% before I started going through the setup since I knew that would tax the battery. The setup went fine and it was only down to about 82% when that was done. I used the phone throughout the day like I would with my current daily, the Moto Z Play, and I didn't need to charge it until Saturday morning around 10:00 am when it got to about 18%. \nI plugged it in and saw the Turbo Power connected message and saw the charging battery icon in the notification section, but when I cam back about an hour later, it was in battery saving mode and was down to 12%. I made sure the plug was in securely, flipped to the battery screen, but it showed that it was not charging. I switched chargers and cables but still got the same results. I then rebooted and charging started working so let it charge up to about 45%, used it for awhile and then wanted to fully charge it to take it out with me for the day. Again, I had the same no charging issue and had to reboot to get it to charge. At that point, I boxed it back up, got the refund started with Amazon, dropped it off at UPS, and set up the one from Motorola.\nNo charging issues with it or any other issues so far. It is plenty fast, the build quality is really nice, well except for the thin SIM/Memory card tray, bit other than that I like it as much as I did my 2014 64GB Moto X Pure, which was my daily phone until I wanted super battery life and got the Z Play.\nI got a few compliments on how nice the phone looked, especially in the Sterling Blue color, as one of my friends thought it was stainless steel. The brightness of the screen when using it in bright sunlight is what I would expect since I have had all of the Moto X 's and the Z Play, not great but again, not unexpected. I will wait to comment on battery like once I put it through a few days of typical daily use. I know it will not be like my Z Play, but if it can make it from topping it off in the morning before work and last until I get home, then that will be fine.\nI love the feel of it and will use it naked until my clear Cimo Premium Slim Protective Cover arrives in a few days and then I will see how much extra thickness that ads, but for now the Moto X4 is batrely noticeable in my pockets and while it is kind of slick, I have not had any issues with coming close to having it slide out of my hands.\nI haev enjoyed all of my Moto phones and still have two of the 2013's, one is still brand new, I skipped the 2014 initially and bought the 2015 without even seeing it, which in hind sight was a mistake as it was just a bit too big and top heavy for me to use comfortably. I kept it around as a backup but will be listing it for sale soon as I only used it for a month or so before I luckily caught the 2014 64GB Pure on sale directlt from Motorola. I enjoy the battery life of my Z Play but wanted something smaller to replace my 2014 Moto X and this X4 seems to do that nicely.\nI will follow up with battery life, teh clar case, and anything else that I feel I should mention, sometime later this week. \nI did buy a Samsung Galaxy S8 when it came out and while the screen looked great and it was fast, I cannot get used to the 18:9 aspect ratio and it was so slick that I knew I would end up letting it slip if it I used it for too long without the case, so I sent it back. The phone that I compare everything too for feel and screen size, and this may seem odd to a lot of people, is my LG G Flex 2. That has been my favorite phone as far as in the hand feel, size in my pocket, and overall screen size without much extra bezel. I have a Galaxy Note 4 with a second number that I use as my work phone, and I will sometimes take the micro sim out of it and swap it in the G Flex 2 so I can use it. A 5.5' screen is really the sweet spot for me as long as the overall phone is not too big and I was really hoping that LG would have continued the Flex line. \nAnyway, I am a gadget nut and keep way too many of my old cell phones and tablets, but it is fun to go back and use some of them everyone once in awhile and I am definitely not going to run out of backups.", "time": "11-05-2017 09:55 PM", "replies": []}, {"postID": "post6056764", "text": "Well, I spoke too soon on the battery charging issue as it happened again this morning. It seems to only do this after quite awhile of inactivity but none the less, I should not have to restart the phone to get it to charge so I will contact Motorola and see what they say. I want to keep the phone but want this little issue fixed.", "time": "11-06-2017 01:17 PM", "replies": []}, {"postID": "post6104746", "text": "Someone had asked about battery life a while back. I've had the phone for almost 2 months now. Battery life is excellent - best of any \"Nexus\" caliber phone I've had. I easily go all day, using it for work and reading news, YouTube, Xfinity TV, etc. The thing that drains it the most is navigation, but I usually plug it in the car if the trip is more than an hour or so.", "time": "12-12-2017 11:11 AM", "replies": []}, {"postID": "post6105821", "text": "There is only one thing that is really annoying me about the Moto X4 and that is the camera app. It is slow, freezes, and sometimes difficult to exit. I like the features of the stock camera app and want it to work correctly so is anyone else having issues? If not, then I may need to send mine back and have them fix it or replace it.", "time": "12-13-2017 12:09 PM", "replies": []}, {"postID": "post6167297", "text": "I have had this phone for 3 weeks and generally love it. it looks fantastic on and off, especially the metallic blue. battery life is solid and performance is mostly great. the one exception, and it is a big deal, is the camera app. slow slow slow. it takes 3-4 seconds from launch to be ready and another 1-2 after pressing the shutter to capture the image. I have missed a lot of shots because of this and have a camera roll full of photos of my feet because I launched the camera, tapped the shutter, and then lowered there phone thinking the picture was taken only to have the image actually recorded a few seconds later when the phone was now pointed down or sideways or something.\nThe camera experience really drops an otherwise satisfyingly good experience with the phone.", "time": "02-20-2018 08:29 AM", "replies": []}]}, {"title": "No wifi calling on Unlocked APAC Moto X4? - options for new software?", "thread": [{"postID": "post6159377", "text": "First off, I had a Nexus 5x (which I loved) and it has been on Fi for over 2 years. I travel a lot internationally and got it for the wifi calling. Unfortunately it when into a boot loop a few days ago and is being shipped to the LG repair center (after support calls to Fi and LG)\nI was going to buy a new phone via Fi, but I am in Asia for the next 2 months and Fi won't ship outside the US...\nI am currently in Bangkok and bought an unlocked Moto X4 (as this is supported by Fi) and popped in my sim and was happy (I though everything worked) until I tried to make a wifi call today. After checking some Moto's forums I am trying to figure out if my current Moto sw is preventing the wifi calling. It is Android 8.0.0 with a Moto version of OPW27.57-40.\nYou would think it would be easy to go back to the retailer, but the English / Thai translation is not as precise as I would hope.\nIs there a way to get another version of the sw? Maybe Android One or something that will support wifi calling?\nThanks,\nMike", "time": "02-10-2018 09:33 AM", "replies": []}]}, {"title": "Any opinions after using for a while?", "thread": [{"postID": "post6063161", "text": "I am looking at the Moto X4 as a Christmas present for my son, but would love to see some real-world opinions from someone who has been using it as their phone for a couple weeks.\nI realize that this isn't a flagship level phone, but my son is currently using a Galaxy S4 so I'm thinking it has to be an improvement. He is a college freshman and the only requests he has made is that he does NOT want another Samsung (he doesn't like all the Samsung modification to plain android) and he does NOT want anything much bigger than his current phone. The size thing is nearly impossible - it seams like everything is bigger than the 5.0\", 1080 x 1920 pixels of the S4.\nI have been using Motorola phones for years (Droid X, Razr M, Droid Turbo) so I know the Android implementation is pretty clean and the Motorola specific features are mostly good additions.\nAlthough it has never been an issue, I would love for him to have the IP68 water resistance. He isn't all that in to photos (not big on social media stuff) so a top of the line camera isn't necessary - just something that he can get the occasional snapshot (most often he's taking pictures of a whiteboard in class, a sign or something he needs to remember and not \"real\" photographs!)\nThe Moto X4 is looking like a good option on paper - I would just like to have some real world feedback before making a final decision!", "time": "11-10-2017 08:37 AM", "replies": []}, {"postID": "post6063203", "text": "I don't have an X4 myself, but if you get it from the Moto website, you have 14 days to return it. That should be more than enough time to decide. \nNot sure if any carriers are getting the X4. Would be nice....I'm due for an upgrade.", "time": "11-10-2017 09:11 AM", "replies": []}, {"postID": "post6063282", "text": "I've used it for a week, coming from a Moto X Pure. So far I love it, battery life is great and the fingerprint sensor is very handy since you can use it for navigation and can get rid of the home, back and apps buttons on the screen.\nOnly drawback is lack of adaptive storage with a SD card, which means only about 16 GBs for apps.\nGreat build quality. Take a shot, he'll like it.", "time": "11-10-2017 10:16 AM", "replies": [{"postID": "post6063578", "text": "Ouch at 16 GB. I think there is an adb command that can force adopted storage. Not sure if I would do that myself though. At least not on my daily driver.", "time": "11-10-2017 01:59 PM", "replies": [{"postID": "post6067029", "text": "It's supposed to have adopted storage.", "time": "11-12-2017 11:57 PM", "replies": []}]}]}, {"postID": "post6067246", "text": "As far as I know the SD card on the X4 can't be used as adoptable storage, even with adb tricks. This feature is not compatible with File-based Encryption, used in this phone.", "time": "11-13-2017 06:28 AM", "replies": []}, {"postID": "post6067248", "text": "This is my biggest disappointment with the X4. Only 16gb of storage available out of the box is very tight, even if you use the SD card for media files.", "time": "11-13-2017 06:31 AM", "replies": [{"postID": "post6067686", "text": "There is one bright side, I'm looking at what apps I really use on a regular basis, I've reduced a few that I had from my X Pure. Kind of like a fall app cleaning.", "time": "11-13-2017 12:25 PM", "replies": []}]}, {"postID": "post6077047", "text": "I don't understand what's wrong. What's taking up so much space? 64gb model has only about 45gb available? Its making no sense.", "time": "11-19-2017 02:56 PM", "replies": [{"postID": "post6080126", "text": "I've read that google doubled the OS (parts A & B), in order to make \"seamless\" updates or some such drivel.", "time": "11-21-2017 04:41 PM", "replies": [{"postID": "post6080172", "text": "I read the same today on a Brazilian article. Definitely this seems to be the main reason for the system taking so much storage.", "time": "11-21-2017 05:06 PM", "replies": []}]}]}, {"postID": "post6116827", "text": "We do some Android development at work and the Windows based tools are laughably huge, as are the development images (6-8 gb). This is for embedded real time control systems. QNX and Linux images are a lot smaller.\nIf a 32gb phone is only left with 16gb out the door that is an issue...", "time": "12-24-2017 08:33 AM", "replies": []}, {"postID": "post6148461", "text": "Hey! In my opinion, this is the best phone in this budget I have used. The main thing I like in this is their hardware compatibility with the software and its touch as well. Recently, I have suggested the same to my friend when he asked me for some suggestion on latest phones.", "time": "01-29-2018 02:27 AM", "replies": []}, {"postID": "post6155016", "text": "Since it is well after the Holidays you undoubtedly made your choice \nTL;DR Best mid-range phone early 2018.\nI thought I would post since I just went through the same decisions. There are definitely lots of mid-range phones, but I think Moto does them better than any other manufacturer, with their combination of solid hardware and clean Android builds. They also offer genuinely useful additions like chop-chop for flashlight and doorknob-twist for camera.\nAs of today, the X4 is on sale at Moto and most of the online retailers making it a very good value. The Moto Z2 Play is also on sale at this moment for the same price and that makes for an even tougher decision.\nMoto X4\n-newer Snapdragon SoC (630 vs. 626 on Z2 Play)\n-faster LTE (more future proof)\n-IP68 water resistant\n-dual cameras with some nifty (maybe also gimmicky) features\n-LCD screen (actually higher pixel density, especially for red and blue vs. pentile AMOLED plus no risk of screen burn on LCD)\n-bluetooth 5 plus ability to stream audio to 4 speakers simultaneously\n-likely to get Oreo faster\n-smaller size (5.2 vs. 5.5) but same screen resolution\n-looks nicer\n-higher resolution selfie camera\nMoto Z2\n-AMOLED screen with those inky blacks\n-reportedly longer battery life (although this may not prove true since both have same size battery)\n-laser and dual pixel autofocus\n-Metal back (vs glass on X4)\n-slightly larger size (if you like that)\n-support for Moto mods\n-4 GB of RAM vs 3gb on X4\n-64 GB of storage vs 32 on X4\nFor me the benefits of the X4 outweighed the mods. I have been using the X4 for a few days and have been very impressed. It is a good phone, full stop. Considering the cost, it is a great phone! The LCD screen is very good in almost all light conditions, only falling a little at night when the LCD black (dark dark grey) can't match AMOLED. Speed is decent launching a collection of apps about as fast as flagships. Games seem to run fine.", "time": "02-05-2018 11:56 AM", "replies": []}]}, {"title": "Bluetooth Issue", "thread": [{"postID": "post6152200", "text": "Hello guys! I have moto G 4th generation mobile phone. Last night I was checking Bluetooth device in my phone. When I enable the Bluetooth button, it shows your Bluetooth device is on. But it seems disabled. I don’t know what happened. Anyone who know about this issue, please share your views.", "time": "02-02-2018 02:07 AM", "replies": []}, {"postID": "post6153077", "text": "I moved this from the Moto X4 forum to the Moto G4 forum.\nWhy do you think Bluetooth is disabled? Which Bluetooth button are you using to enable it? If you go to Settings>Bluetooth​, is the toggle switch on there?", "time": "02-03-2018 01:18 AM", "replies": []}]}, {"title": "New Look?", "thread": [{"postID": "post5912182", "text": "https://twitter.com/evleaks/status/893126882190929921\nLooks different than before. Says the previous render was bad information. What do you all think?", "time": "08-04-2017 11:09 AM", "replies": []}, {"postID": "post5912433", "text": "I care more about the specs. Is it the originally rumored SD660 + 3800 mAh or the more recent rumor of SD630 + 3000 mAh?", "time": "08-04-2017 02:48 PM", "replies": []}, {"postID": "post5912436", "text": "I'm really interested about this phone and most likely it will replace my aging X Play, but I'm starting to get tired with so many leaks, changes and delays.\nIn some places they are talking that the original specs are back, materials, 660, 3800mAh ... Who knows anymore.", "time": "08-04-2017 02:53 PM", "replies": []}, {"postID": "post6151239", "text": "I am also interested to buy this phone. The feature of this mobile is good as compare to others.", "time": "02-01-2018 12:39 AM", "replies": []}]}, {"title": "Case reviews for Moto X 4", "thread": [{"postID": "post6129129", "text": "Just picked one up. Not many cases available though. What's everyone been using? Thanks", "time": "01-06-2018 11:07 PM", "replies": [{"postID": "post6138656", "text": "At first got a Dretal case, but camera bump is not as protected as I would like (very close to flush, especially at top of \"bump\"):\nMoto X4 Case, Dretal [Shock Resistant] Flexible Soft TPU Brushed Anti-fingerprint Full-body Protective Case Cover For Motorola Moto X4 (2017) (Black) https://www.amazon.com/dp/B072JD3YNT...cUvbUpU6138656\nGot slimmer Spigen case which had better camera bump protection in that it at least had a ridge all around where the bump is, but isn't super grippy:\nSpigen Rugged Armor Moto X4 Case with Resilient Shock Absorption and Carbon Fiber Design for Moto X4 - Black https://www.amazon.com/dp/B072N3WT4J...cUvbUpU6138656\nI'm keeping the Spigen but not convinced it will protect from a fall to concrete. Both fit fine with Supersheildz screen protector.\nEdit:\nOk. I \"tested\" the Spigen case the other day with a three foot fall to the concrete (facedown). No damage luckily. Not a bad case!", "time": "01-17-2018 11:48 AM", "replies": []}]}, {"postID": "post6150360", "text": "I have the same case for Moto X4. It looks very beautiful and safe for x4 mobile.", "time": "01-31-2018 01:48 AM", "replies": []}]}, {"title": "MMS Transfer?", "thread": [{"postID": "post6113190", "text": "Is there a way to transfer MMS from my old phone to the new one? Already tried Backup and Restore, it doesn't do MMS, you just get the text, and not organized. Can you just grab a data file and transfer it? Any other software on computer?", "time": "12-20-2017 12:33 PM", "replies": []}, {"postID": "post6113224", "text": "This is possible and you can use this backup too:Backuptrans Android SMS + MMS Transfer, Transfer Android SMS/MMS", "time": "12-20-2017 01:01 PM", "replies": []}, {"postID": "post6149392", "text": "First time, I heard about that. The given link might be helpful for you to sort out your query.", "time": "01-30-2018 01:38 AM", "replies": []}]}, {"title": "Camera lens protector", "thread": [{"postID": "post6135859", "text": "Just got my X4, since I can't found a oterbox case, I bought a spigen, an a tempered glass protector, but am looking at a camera lens protector with no luck. Do you know if such things exist?", "time": "01-14-2018 05:44 AM", "replies": []}, {"postID": "post6144406", "text": "I don’t have much knowledge about this. If you are in Egypt, then ask from iFix Egypt. They will guide you better.", "time": "01-24-2018 01:47 AM", "replies": []}]}, {"title": "Android One Moto X4 - Project Fi - is this the correct forum?", "thread": [{"postID": "post6143110", "text": "Just ordered a Android One Moto X4 through Project Fi, is this the correct forum for this phone?\nMoto X4 is new to me, have been using Pixels since they were introduced.", "time": "01-22-2018 03:39 PM", "replies": []}, {"postID": "post6143224", "text": "I think you are in the right spot. There are a few variants of the X4 - Project Fi Android One version, unlocked Moto version and the same phone from Amazon with lockscreen ads.", "time": "01-22-2018 05:32 PM", "replies": []}]}, {"title": "Moto X4 in US- 3 different software upgrade/support paths?", "thread": [{"postID": "post6035789", "text": "I am confused with the new Moto X4. Do we assume all three US versions will not be getting the same software updates? From what I can see there will be 3 variations of the X4 in the US- Amazon Prime X4, Project Fi/Android One X4 and Unlocked X4. Will the Project Fi version be the only version that will get routine updates from Google? or can we assume the Amazon and/or the Unlocked version will too? Has Moto been clear about the software upgrade paths for the various models?", "time": "10-24-2017 09:26 AM", "replies": [{"postID": "post6035957", "text": "Yes 3.", "time": "10-24-2017 10:52 AM", "replies": []}]}, {"postID": "post6035948", "text": "Besides the Google Android One X4 all the others may or may not get any/some software updates.\nGood luck.", "time": "10-24-2017 10:47 AM", "replies": []}, {"postID": "post6042570", "text": "Got some answers from Moto support forum:\nMoto X4 Android One on Project Fi will get updates directly from Google.\nTwo other versions will get updates from Moto.\nNot answered yet: If Moto X4 Android One bought on Fi is used with other MVNO will they still get updates from Google.", "time": "10-28-2017 07:35 AM", "replies": [{"postID": "post6132838", "text": "Hmm? I'm using android one version, but not with Fi, and I'm still on 7.1.1 November security patch. Maybe you must be activated on Fi to qualify.", "time": "01-10-2018 06:30 PM", "replies": []}]}, {"postID": "post6134859", "text": "I'm still don't believe the Android One versions will get updates from Google, not Motorola.", "time": "01-12-2018 08:55 PM", "replies": []}]}, {"title": "Is the X4 an Android One phone in all markets?", "thread": [{"postID": "post6080698", "text": "In the UK, I can't tell if it's an Android One phone. I would only consider this phone if it was!", "time": "11-22-2017 03:13 AM", "replies": []}, {"postID": "post6081281", "text": "Yes - see https://en.wikipedia.org/wiki/Android_One#Moto_X4", "time": "11-22-2017 12:55 PM", "replies": []}, {"postID": "post6083572", "text": "No, it's not. Just bought one (for 279 at Carphone Warehouse). It's Moto software rather than the totally pure Android one software. Excellent phone for the money now!", "time": "11-24-2017 05:38 PM", "replies": [{"postID": "post6124308", "text": "But the Android One version has Moto software on it.", "time": "01-01-2018 07:02 PM", "replies": [{"postID": "post6129127", "text": "Yes but with a few differences. I guess the most important one is the One button nav feature which isn't available on project fi version.", "time": "01-06-2018 11:04 PM", "replies": [{"postID": "post6129177", "text": "There's tons of assumptions with this new Android One. It's not the same as the previous Android One.", "time": "01-07-2018 12:28 AM", "replies": []}]}]}]}, {"postID": "post6124305", "text": "You can only get the android one version through google fi", "time": "01-01-2018 07:01 PM", "replies": []}]}, {"title": "2017 Holliday promotion?", "thread": [{"postID": "post6125324", "text": "\"There is no minimum activation time needed to be eligible for the discount.\" - Does this mean the $75 discount applies even if you port out after a month? Thanks\n$75 off with activation of Android One Moto X4 Promotion Terms\nDiscount applies to Android One Moto X4 devices purchased from fi.google.com, with activation required within 30 days of device shipment. The discounted price will automatically apply during checkout, but if Fi is not activated within 30 days of device shipment, the discounted amount will be charged to your Google Payments account to match the full price of the device. There is no minimum activation time needed to be eligible for the discount. This offer is valid from December 5, 2017 at 10:00 AM PDT–January 15, 2018 at 10:00 AM PDT, or while supplies last.", "time": "01-02-2018 09:00 PM", "replies": []}]}, {"title": "Moto X4 for $339 Thanksgiving Week", "thread": [{"postID": "post6078909", "text": "At Motorola.com there is an extra $60 off the Moto x4 until November 29 so it's almost as cheap as the version with Amazon ads.", "time": "11-20-2017 08:59 PM", "replies": []}, {"postID": "post6081776", "text": "Same price at Best Buy and B&H Photo", "time": "11-22-2017 08:48 PM", "replies": []}, {"postID": "post6083828", "text": "Also Newegg", "time": "11-25-2017 12:17 AM", "replies": []}, {"postID": "post6124310", "text": "Back to $399 but $324 if purchased through project fi", "time": "01-01-2018 07:03 PM", "replies": []}]}, {"title": "My Thoughts on the Moto X4", "thread": [{"postID": "post6094115", "text": "As a fan of Motorola products, especially the original Moto X, guess I had to at least give the Moto X4 a chance.\nWhile I think overall it's a decent phone, i think calling it the Moto X is probably a way to try and get people to give this phone chance, more than it is a continuation of the Moto X spirit.\nIt's actually a pretty good mid-range device. Nice premium design, IP68 rating, decent camera for the price, decent performance too. I do have a few things I wished were different, but on the whole it's not bad. :/", "time": "12-03-2017 01:49 AM", "replies": [{"postID": "post6100081", "text": "What are the things that you wished are different?", "time": "12-08-2017 08:08 AM", "replies": []}]}, {"postID": "post6101477", "text": "4 GB of RAM.\n64 GB of internal storage, especially since the OS consumes 13 GB.\nThe camera lag is atrocious, even after the \"fix app\".\nI don't have anything else, since it's the wife's DD.", "time": "12-09-2017 11:06 AM", "replies": []}, {"postID": "post6105823", "text": "I agree about the camera lag and while I really want to keep the phone, that one thing is about to push me over the edge. I still have my Moto X Play, and other older Moto X's but I want to use this one but that one issue is a huge negative. Not sure why as I have never had camera issues with any other Moto phones.", "time": "12-13-2017 12:11 PM", "replies": []}, {"postID": "post6105843", "text": "If I didn't dive head first into Moto Mods, I'd be using the fourth gen Moto X as my daily driver. \nThe second gen Moto X was I think the only one that used the \"flagship\" Snapdragon of the time. First gen was using an S4 Pro when everyone else moved on. Third gen was using the 808 instead of the 810.", "time": "12-13-2017 12:29 PM", "replies": []}, {"postID": "post6106310", "text": "Better cameras for sure, since it has never been Motorola's strong suit. The display would be better if it was AMOLED too. The design isnt bad, but it's really slippery compared to past Moto x. Processor wise I think snapdragon 660 would have been nice. But most of those are not exactly deal breakers, especially if they price the device right. It's going for around 415 USD over here which isn't a bad price. But just 2 days ago, there was a limited sale here for the OnePlus 5 at 300USD for the 64GB model. Probably clearing inventory. At these prices, it's kinda hard to recommend the Moto X4.", "time": "12-13-2017 09:14 PM", "replies": []}]}, {"title": "X4 Hybrid Cases?", "thread": [{"postID": "post6087038", "text": "I can only find two 'name brand' cases, but they are both TPU.\nSpigen Tough Armor\nIncipio NGP\nLooking for something along the lines of the Caseology Wavelength. \nThe wife got this one from Amazon.https://www.amazon.com/gp/aw/d/B076H...cUvbUpU6087038\nIt's ok, but kind of cheap.\nThe are others available, but they have no reviews. \nWhat hybrid cases are y'all satisfied with?", "time": "11-27-2017 05:19 PM", "replies": []}]}, {"title": "Can outgoing text message notifications be disabled from appearing in car's Bluetooth system?", "thread": [{"postID": "post6071808", "text": "I just recently got a new Moto X4 (previously had an HTC One M7) and use T-Mobile as my carrier. I have paired up my new phone with my car ('16 Honda H-RV) via Bluetooth with no problems. The only annoying issue with the new phone is my car keeps notifying me that I have a new text message when I'm sending out a text. Example: I'm sitting in my car waiting for my daughter to get out of practice and I send her a text to let her know I'm outside waiting for her and when I do my car will notify me that I'm receiving a new text. Very annoying!! My HTC never use to do that. Is there any way to disable the notification for outgoing texts so they don't appear as a new text message in my car??? Any suggestions are much appreciated!", "time": "11-15-2017 06:10 PM", "replies": []}]}, {"title": "why when I try to connect to devices on Bluetooth serval E ; &+> showslat bottomeof thetdevice list", "thread": [{"postID": "post6070207", "text": "When i go to Bluetooth to connect to devices i get something showing serval E ; &t> ive never seen it before what does that mean", "time": "11-14-2017 10:44 PM", "replies": []}, {"postID": "post6071291", "text": "Probably some nearby Bluetooth device. (Something you can't connect to with a phone.)", "time": "11-15-2017 01:09 PM", "replies": []}]}, {"title": "System update includes Nov security patch and camera improvements", "thread": [{"postID": "post6063084", "text": "Just got a notification and am downloading it now.", "time": "11-10-2017 07:27 AM", "replies": []}, {"postID": "post6065529", "text": "is that update from google or from moto ? where did you get your moto X4 from ?", "time": "11-11-2017 06:08 PM", "replies": []}, {"postID": "post6065533", "text": "Since my X4 is unlocked from Moto, I would take it's from Moto.", "time": "11-11-2017 06:13 PM", "replies": []}]}, {"title": "Moto Actions missing from AndroidOne Moto X4? No multiple bluetooth pairing???", "thread": [{"postID": "post6053497", "text": "I noticed several Moto Actions, including 'one button nav' are missing from the Project Fi/AndroidOne version of the Moto X4.\nAlso, the ability to connect to four bluetooth devices at once is not available, as far as I can tell.\nWhy did Google and/or Lenovo remove these features for the AndroidOne version?\nIs the AndroidOne version the only one that will work on Project Fi out of the box?\nI'd rather return this AndroidOne version and get one that has all of the appropriate features that this phone was hyped to have.\nThanks for your help!\n(I've been on Nexus devices since the Galaxy Nexus and now have a Pixel XL. The Moto X4 is for my wife, she is coming from iOS).", "time": "11-04-2017 09:51 AM", "replies": []}, {"postID": "post6053499", "text": "Android One are basically Nexus, so no non stock Android features as much as possible. Since Moto Actions are not Stock Android features, Android One devices won't have them.", "time": "11-04-2017 09:54 AM", "replies": [{"postID": "post6053599", "text": "Sorry but that is incorrect and is spreading misinformation. The AndroidOne Moto X4 has *plenty* of Moto Actions, it is just missing a few key ones (like the ones I mentioned plus a couple more). It has at least 10 of them though.\nAnyone else know why only *certain* Moto Actions were omitted?", "time": "11-04-2017 11:20 AM", "replies": [{"postID": "post6053621", "text": "Really? Well that's kinda odd when Android One was advertised as stock Android only. Oh well. Thanks.", "time": "11-04-2017 11:35 AM", "replies": []}, {"postID": "post6053699", "text": "Android One means a Google's phone with Google software and they removed everything they considered conflicting with the Google experience. So there's no Moto Voice or Alexa and you need to use Google Assistant and so on.\nThere could some technical reasons for them not including the one-button nav or the new Bluetooth features (deep code that could interfere with the promised timely updates), but I think the main reason is what they consider to be the Google experience that you can find on Nexus or Pixel.", "time": "11-04-2017 12:31 PM", "replies": []}]}, {"postID": "post6053857", "text": "Not this time. \nGoogle needs to brand these things better.", "time": "11-04-2017 02:25 PM", "replies": []}]}, {"postID": "post6053596", "text": "on the Bluetooth feature, maybe Tempow Audio Profile isn't licensed for the Android One version.", "time": "11-04-2017 11:19 AM", "replies": []}, {"postID": "post6053852", "text": "There's a misunderstanding on the Project Fi Android One phones. They are not like the developing market Android One phones.", "time": "11-04-2017 02:24 PM", "replies": []}, {"postID": "post6054932", "text": "Thanks for the info, all. One other issue I mentioned in my OP but wasn't very clear about: Since all the hardware is the same across all versions of the X4, will the other work properly on Project Fi with full network switching and wifi calling? Will Project Fi even activate the others on their network?", "time": "11-05-2017 09:57 AM", "replies": []}, {"postID": "post6064004", "text": "Google said on its project fi website that the regular Moto X4 should work as well. The Android One version is what they cell. I would not expect a non-US retail version to work.", "time": "11-10-2017 07:17 PM", "replies": []}]}, {"title": "Move apps to SD card", "thread": [{"postID": "post6031299", "text": "Just got the Android one Moto x4. I even opened developer options and selected the move all apps regardless of manifest value and it still won't let me move anything. Do I need to uninstall and reinstall apps?", "time": "10-21-2017 03:37 PM", "replies": [{"postID": "post6042611", "text": "I can't find the option to format the SD as internal storage either.", "time": "10-28-2017 08:34 AM", "replies": []}, {"postID": "post6063186", "text": "my understanding is that you need to turn encryption off first.", "time": "11-10-2017 08:58 AM", "replies": []}]}]}, {"title": "Sent my Android One Moto X4 back.", "thread": [{"postID": "post6057924", "text": "A shame really. \nWas dropping calls, missing text's, delayed text..\nPhone had a small issue with FP reader insisting my finger/reader was dirty. After I scrubbed reader down with a paper towel it improved somewhat.\nPhone felt fantastic in hand. Looks, feels like a flagship. battery was great. Performance was snappy, camera was fine...as stated a shame.\nBack to a Moto Nexus 6 for Project Fi utilization. \nOld warhorse still runs great.\nGetting towards EOL with security updates.\nOrdered Pixel 2 XL...FWIW.\nI'm sure it will be good...at more than twice the price.\nDarn.", "time": "11-07-2017 06:07 AM", "replies": []}]}, {"title": "Why So Dead?", "thread": [{"postID": "post5960320", "text": "I thought the would be some people talking about the X4, but crickets here. Currently have a Moto X Pure looking for a new phone this fall. I must not have been the only one not impressed with the X4's announcement and specs.", "time": "09-06-2017 02:38 PM", "replies": []}, {"postID": "post5960358", "text": "Agreed I definitely wasn't impressed.", "time": "09-06-2017 02:51 PM", "replies": []}, {"postID": "post5960397", "text": "I wasn't impressed at all, but I don't know what better phones are out there.", "time": "09-06-2017 03:14 PM", "replies": []}, {"postID": "post5960464", "text": "I have been eyeing the LG V30, hoping for a Black Friday deal of some type. \nI was hoping for more from Moto. I don't like the Alexa integration at all. I may end up with the G5S depending on price and availability in the US.", "time": "09-06-2017 03:47 PM", "replies": []}, {"postID": "post5960468", "text": "It seems like all Moto phones this year are too similar to each other, they sold at least have differing screen sizes or something.", "time": "09-06-2017 03:47 PM", "replies": []}, {"postID": "post5962149", "text": "So good that it's boring.", "time": "09-07-2017 12:38 PM", "replies": []}, {"postID": "post5962159", "text": "My interest in Moto is in the G & Z lines now. G has always been quality in my experience and Z has become what the X was starting to become before the Z came out.", "time": "09-07-2017 12:41 PM", "replies": []}, {"postID": "post5965873", "text": "X Pure owner disappointed with X4 specs, especially a 5.2\" screen and no stereo speakers. Not sure if I get the X4 or the G5S+.\nPrice will be a factor, but I'd rather have a 5.5\" screen.", "time": "09-09-2017 11:14 AM", "replies": []}, {"postID": "post5969668", "text": "I for one am very excited, I have grown to not only love the stock like software of the moto phones, but the value added extras like moto vice and moto display are outstanding. I think most mote phones give you great value for the money and I am infatuated withthe design of the x4.", "time": "09-11-2017 08:44 PM", "replies": [{"postID": "post5969819", "text": "Sincerely hope you love it", "time": "09-11-2017 10:39 PM", "replies": []}]}, {"postID": "post5998837", "text": "Do we have any clue at all when this phone will be released in the US?", "time": "09-30-2017 11:42 AM", "replies": [{"postID": "post5999520", "text": "I would guess reasonably soon because B&H has it listed as coming soon.", "time": "10-01-2017 01:39 AM", "replies": [{"postID": "post6002486", "text": "Project Fi states shipment in about two weeks. [by ~ 10-15]", "time": "10-03-2017 11:45 AM", "replies": []}]}]}, {"postID": "post6008719", "text": "I have the unlocked version and i like this phone", "time": "10-07-2017 02:03 AM", "replies": []}, {"postID": "post6008807", "text": "How do you already have the phone? Where are you located?", "time": "10-07-2017 06:09 AM", "replies": []}, {"postID": "post6009299", "text": "I'm in Germany. We can buy the phone since a week", "time": "10-07-2017 12:56 PM", "replies": [{"postID": "post6011132", "text": "Oh wow, I'm jealous! How's the battery life?", "time": "10-08-2017 03:03 PM", "replies": []}]}, {"postID": "post6011140", "text": "I have about 8 hours in WiFi and 6h on 4G. I'm a heavy user. The features are great ( 3 finger screenshot, Moto Key, Bluetooth 5.0 etc. ) More worth the money then the Z2 play or the Z2 Force", "time": "10-08-2017 03:11 PM", "replies": [{"postID": "post6011160", "text": "I didn't notice that it was already being sold in Germany. That's great! How's the camera? Please, create a thread and show us some pictures. I'm very interested about this phone.", "time": "10-08-2017 03:35 PM", "replies": [{"postID": "post6011166", "text": "I will do this tomorrow", "time": "10-08-2017 03:40 PM", "replies": [{"postID": "post6011168", "text": "Excellent! I'll make that thread a sticky as soon as you create it.", "time": "10-08-2017 03:41 PM", "replies": []}]}]}]}, {"postID": "post6011155", "text": "Is that 8 / 6 hours SOT? Or total?", "time": "10-08-2017 03:30 PM", "replies": []}, {"postID": "post6011161", "text": "SoT", "time": "10-08-2017 03:36 PM", "replies": []}, {"postID": "post6011175", "text": "One can i say now. It' the best Moto package in 2017", "time": "10-08-2017 03:45 PM", "replies": [{"postID": "post6011185", "text": "I waited months for the X4 to be released. I badly needed to replace my aging X Play, the battery started to feel the age after more than two years of turbo power and heavy use. Finally decided to buy the G5S plus. Not bad at all, but my first choice could have been the X4 if released here.", "time": "10-08-2017 03:52 PM", "replies": []}, {"postID": "post6027105", "text": "Could you confirm something, please? How much space does the system take? I've heard only half of the 32gb are available for the user", "time": "10-19-2017 08:56 AM", "replies": [{"postID": "post6029609", "text": "That's seems about right. On my Android One version, system files take up 13.10 gb. I have anther 4.12 gb of apps on mine already. I'm not sure, though, how much of that was already on the phone and how many copied over from my last phone.", "time": "10-20-2017 03:22 PM", "replies": []}]}]}, {"postID": "post6012203", "text": "Sorry for the delay. I will share some pictures later the day", "time": "10-09-2017 11:56 AM", "replies": []}, {"postID": "post6013453", "text": "The one for project fi is 3 gigs ram/32 gigs rom.... My G5 Plus is better w/ 64 gigs rom, 4 gigs ram....... PASS!!", "time": "10-10-2017 08:29 AM", "replies": []}, {"postID": "post6013758", "text": "Javier, fwiw you may be able to breathe like new battery life into your X Play by finding a local repair shop to install an OEM replacement battery for under $80 US. I did that a few weeks ago on my Verizon Droid Turbo 2 from 2015, and I'm getting battery life that far exceeds even what I saw when it was brand new, which is a huge surprise.", "time": "10-10-2017 12:30 PM", "replies": []}, {"postID": "post6014059", "text": "If I purchase the Android One version do I have to keep it on Fi to keep getting the monthly updates? Based on the bands available it should work on AT&T, correct?\nThanks", "time": "10-10-2017 03:41 PM", "replies": []}, {"postID": "post6025414", "text": "Already available in Brazil. Price is not bad, closer to the G5S+ than to the Z2 Play. https://www.motorola.com.br/moto-x4", "time": "10-18-2017 10:42 AM", "replies": []}, {"postID": "post6041465", "text": "I just posted a review in a separate thread.", "time": "10-27-2017 11:55 AM", "replies": []}, {"postID": "post6042721", "text": "The Moto X4 form factor would have been perfect for the Moto X Pure! \nNow they give me the form factor I want but specs and performance that are closer to the G line than the flagships.\nThe 32 gb is the biggest issue for me, followed by the camera that from reviews sounds like a step down from their own Z2 Force, which is already bit of a step down from the Pixels, galaxies, etc. Plus processor on the Pure was closer to the high end at the time.", "time": "10-28-2017 10:30 AM", "replies": []}, {"postID": "post6046066", "text": "Since the Amazon Prime Exclusive version is so cheap, $329, I may give it a try as I have all of the Moto X gens and the Z Play as my daily. I will sometimes switch to the 2014 Moto X if I want a smaller phone, or even my 2013 for fun sometimes, but the battery life in those two just doesn't do it for me. It's too bad since my 2014 is the 64GB Pure. Anyway, I am so used to the gestures, Moto Voice, etc... that even though I have tried other phones, I have not found anything I really want to stick with and lose those features.", "time": "10-30-2017 03:24 PM", "replies": [{"postID": "post6049469", "text": "That Amazon Prime deal is calling my name too. My Pure Edition is still working well, but the battery life just isn't what it used to be. I just don't want to spend big bucks on a flagship phone right now and I still love the Moto only features. I also like the smaller size. The 2014 Moto X was a perfect size so I have no problem going back to that.", "time": "11-01-2017 07:54 PM", "replies": [{"postID": "post6050207", "text": "Mine should arrive tomorrow so I will post my impressions after I get it set up.", "time": "11-02-2017 10:24 AM", "replies": [{"postID": "post6050583", "text": "Definitely let us know what you think. I know it's not a flagship but am curious to know if it's worth the price versus other phones in that price range.", "time": "11-02-2017 02:23 PM", "replies": []}]}]}]}, {"postID": "post6050354", "text": "Sharkita, if battery life is your only major motivator, consider having an OEM replacement battery installed by a local mobile repair shop. Last month I paid $70 for a new battery in my 2015 Motorola Droid Turbo 2, and battery life exceeded (by far) anything I'd seen before, incl. when the phone was brand new (which is a mystery to me).", "time": "11-02-2017 12:02 PM", "replies": []}, {"postID": "post6057226", "text": "I posted in the Hands on review thread.", "time": "11-06-2017 06:09 PM", "replies": []}]}, {"title": "T-Mobile Wi-FI calling enabled with retail Moto X4 I hope!", "thread": [{"postID": "post6002496", "text": "It will have to be enabled with the Project Fi variant ...retail...hmmm sure hope so.\nwill have to wait for conformation. Wi-Fi calling is so darn helpful I consider it a must have.", "time": "10-03-2017 11:52 AM", "replies": []}, {"postID": "post6004561", "text": "BTW, with that spec sheet: I suspect the X4 will be the cats meow. Battery forever + near -0- slowdowns et better than adequate camera, mostly pure android.....-minus VR. \nyup, waiting for reviews.", "time": "10-04-2017 04:55 PM", "replies": []}, {"postID": "post6042573", "text": "FWIW:\nWas informed by Moto Rep on Forum that Wi-Fi calling [T-Mobile] will work on retail version.\nAmazon Version is reported not to work.", "time": "10-28-2017 07:37 AM", "replies": []}]}]
[{"title": "When are the reviews coming out?", "thread": [{"postID": "post5995981", "text": "I haven't seen any reviews since the first round of hands-on videos. Any reviewers out there get their hands on this phone yet?", "time": "09-27-2017 11:33 PM", "replies": []}, {"postID": "post5998836", "text": "Good question. I'm dying to see some reviews.", "time": "09-30-2017 11:41 AM", "replies": []}, {"postID": "post6010393", "text": "IMO:\nWaiting for Pixel 2 furor to subside.\nX4 looks like it might be a flagship killer.\nWith specific areas under-powered but overall fluid experience.\nProof will be in the pudding..as they say.\nI am waiting for reviews also.", "time": "10-08-2017 05:53 AM", "replies": []}, {"postID": "post6013405", "text": "Seeing reports of orders being canceled.\nThat is not good.\nBeing canceled rather than delayed would indicate something major.\nAt a guess anyway.", "time": "10-10-2017 07:53 AM", "replies": [{"postID": "post6026738", "text": "Well, there are several issues with that. How reliable are the reports? And, if they are, there could be several reasons that are not necessarily bad. One could be because are a number of phones in this price range and people could just be having a hard time making up their minds.", "time": "10-19-2017 01:22 AM", "replies": []}]}, {"postID": "post6013456", "text": "America version project fi 3 gigs ram/32 gigs rom.... PASS!! There are a lot of reviews on YouTube!!", "time": "10-10-2017 08:32 AM", "replies": []}]}, {"title": "Fourth Generation Motorola Moto X (Moto X4, Moto X 2017)", "thread": [{"postID": "post5728121", "text": "https://9to5google.com/2017/03/27/20...-x-leak-specs/https://plus.google.com/106174281418...ts/jTmtBju3oem", "time": "03-27-2017 05:22 PM", "replies": []}, {"postID": "post5813759", "text": "Snapdragon 660?http://www.androidpolice.com/2017/05...-dual-cameras/", "time": "05-13-2017 10:29 PM", "replies": [{"postID": "post5814410", "text": "Here is my guess on Lenovorola's strategy with their 2017 line up of devices (just gathered from the leaks/rumors)\nIf they all hold true I believe the Moto X4 will be the spiritual successor to the Moto Z Play of this gen. \nThe reason I say this is due to the leaks that claim the 2nd Moto Z Play will lose its big battery in favor of a slimmer design. On the other hand, this Moto X4 device that's been leaking out shows specs more in line with what a newer Moto Z Play would have, including a large battery, just with the lack of Moto Mod compatibility. \nThis puts Moto's device line-up in a better position for consumers because it allows 3 price tiers of \"Modular Phones\" for the people interested in that feature and now adds back in a competitor for the Chinese manufactured \"flagship killers\" for people who want a decent phone for a reasonable price. That is, if Moto ends up marketing it accordingly. \nOnly time will tell! Just my two cents...lol", "time": "05-14-2017 12:13 PM", "replies": [{"postID": "post5814583", "text": "Maybe there is no regular Moto Z this year, just a Play and a Force.", "time": "05-14-2017 04:06 PM", "replies": []}]}]}, {"postID": "post5814571", "text": "https://twitter.com/evleaks/status/863265268558172160\nfunction loadx(data) {\n  document.write(data.html);\n}", "time": "05-14-2017 03:58 PM", "replies": []}, {"postID": "post5814574", "text": "https://twitter.com/evleaks/status/863580163153461249\nfunction loadx(data) {\n  document.write(data.html);\n}", "time": "05-14-2017 04:00 PM", "replies": []}, {"postID": "post5814740", "text": "I don't really care what letter Moto uses as long as the battery life stays.", "time": "05-14-2017 06:37 PM", "replies": []}, {"postID": "post5814837", "text": "5.2\" screen with an energy efficient processor and 3800 mAh battery? This thing might just last longer than the current Moto Z Play.", "time": "05-14-2017 07:54 PM", "replies": []}, {"postID": "post5816453", "text": "On paper, the Snapdragon 660 should perform like an 820.", "time": "05-15-2017 10:42 PM", "replies": []}, {"postID": "post5818110", "text": "looks like a better spec'd G5 Plus, not that that is a bad thing, but its just not very revolutionary. I currently have the Moto X Pure Edition and love it. Not sure why they just didn't build on this model - better battery, camera and so on. I'm used to the 5.7\" screen so will probably look elsewhere. Any idea if Moto will do a Moto X4 Plus with a bigger screen?", "time": "05-17-2017 06:54 AM", "replies": []}, {"postID": "post5849153", "text": "I like what I am hearing about the new Moto X4. If it's what the rumors say, I think I found my replacement for the Droid Turbo 2Motorola Moto X4 tipped to be unveiled on June 30 - GSMArena.com news", "time": "06-13-2017 12:00 PM", "replies": [{"postID": "post5849160", "text": "Yep, same here! \nI read a couple of articles where they say the battery could be 2800 instead of 3800mAh. I hope they are wrong.", "time": "06-13-2017 12:11 PM", "replies": []}]}, {"postID": "post5849187", "text": "http://phandroid.com/2017/06/12/moto-x4-rumor/With USB-C, I doubt this would have Qualcomm Quick Charge 2.0/3.0. It's more likely it will take advantage of Motorola's TurboPower 30 for 28.5W charging over USB Type C.", "time": "06-13-2017 12:45 PM", "replies": []}, {"postID": "post5849188", "text": "Brazil may get Moto X4 launch on June 21 | Pocketnow", "time": "06-13-2017 12:46 PM", "replies": []}, {"postID": "post5849190", "text": "Moto X4 Leak, Images, Specifications and Price", "time": "06-13-2017 12:49 PM", "replies": []}, {"postID": "post5849192", "text": "Moto X4 Specifications Leaked, Tipped to Launch on June 30 | NDTV Gadgets360.com", "time": "06-13-2017 12:50 PM", "replies": []}, {"postID": "post5849199", "text": "Yep, all rumours here in Brazil say that Motorola will present on the 21st in São Paulo the G5S, the X4 or even the Z2 Force. My bet, the G5S, my wish, the X4.", "time": "06-13-2017 12:54 PM", "replies": []}, {"postID": "post5854578", "text": "Agreed. Can't wait for the X4!", "time": "06-18-2017 07:49 AM", "replies": []}, {"postID": "post5854679", "text": "I'll be willing to check out an X4. I might get it through my carrier, but that would depend mainly on the cost.", "time": "06-18-2017 09:55 AM", "replies": [{"postID": "post5854853", "text": "Do you think carriers will even offer it?", "time": "06-18-2017 02:13 PM", "replies": [{"postID": "post5854864", "text": "I honestly hope so. But, I'm not going to hold my breath. I'd probably die of asphyxiation long before it happens.", "time": "06-18-2017 02:24 PM", "replies": []}, {"postID": "post5856959", "text": "I don't think any of the US carriers will have it if the rumors of the Moto Z2 Force being on Sprint and T-Mobile in addition to Verizon are true.", "time": "06-20-2017 11:41 AM", "replies": []}]}]}, {"postID": "post5864001", "text": "Possibly delayed due to Snapdragon 660 shortages, might not be announced on 6/30.http://www.phonearena.com/news/Moto-...une-30_id95327", "time": "06-26-2017 11:24 AM", "replies": []}, {"postID": "post5900873", "text": "https://twitter.com/HeyAndri/status/889873013356679168\nfunction loadx(data) {\n  document.write(data.html);\n}", "time": "07-26-2017 05:34 PM", "replies": []}, {"postID": "post5900874", "text": "https://twitter.com/HeyAndri/status/889873013356679168\nfunction loadx(data) {\n  document.write(data.html);\n}", "time": "07-26-2017 05:34 PM", "replies": []}, {"postID": "post5900876", "text": "https://twitter.com/HeyAndri/status/889880430819790848\nfunction loadx(data) {\n  document.write(data.html);\n}", "time": "07-26-2017 05:35 PM", "replies": []}, {"postID": "post5900877", "text": "https://twitter.com/HeyAndri/status/889991001233735680\nfunction loadx(data) {\n  document.write(data.html);\n}", "time": "07-26-2017 05:35 PM", "replies": []}, {"postID": "post5901636", "text": "", "time": "07-27-2017 10:34 AM", "replies": [{"postID": "post5902120", "text": "What does he mean \"updating\"?", "time": "07-27-2017 05:42 PM", "replies": [{"postID": "post5902125", "text": "Not sure. Maybe more to come soon, maybe updating previous leaks that talked about different specs ...", "time": "07-27-2017 05:48 PM", "replies": []}]}]}, {"postID": "post5903260", "text": "Heres another to add to the pile...claims $400 price....and 660https://twitter.com/rquandt/status/890721053357613058\nIt seems like the pricing makes sense since the X would cost less than the Z and more than the G...\nit would just nice to have a moto product that might see the light of android O,,,", "time": "07-28-2017 03:01 PM", "replies": [{"postID": "post5903483", "text": "Under Bluetooth, the Moto Z2 Force spec page at Motorola.com currently says:While not a full blown commitment, it's probably safe to say Android O is on the on-going support roadmap for at least the Moto Z2 Force.", "time": "07-28-2017 05:49 PM", "replies": []}]}, {"postID": "post6013446", "text": "I have the Moto G5 Plus w/ 4 gigs ram and 64 gigs rom, went on Google's website to order the Moto X4, thinking I might get a upgrade since it has dual cameras, it's all metal, have the Snapdragon 630, and a bigger screen at 5.5 in. the only ones available to America is the 3 gig ram and the 32 gig rom. they got to be freaking kidding me!! this is almost like a downgrade for me!! I am now looking at the Pixel 2. Moto you messed up!!", "time": "10-10-2017 08:25 AM", "replies": []}, {"postID": "post6013749", "text": "Or, perhaps they just calculate anyonein U.S. who cares about memory and storage sizes is buying in the flagship category, anyway, and X4 is aimed at mid-tier buyers who care more about aesthetics and camera.\nIt's actually not as puzzling to me that the U.S. X4 lacks memory and storage, as it is that the Z-Force lacks waterproofing. \nright now, I'm finding it hard to see why I would upgrade to an X4 or a Z-Force from my 2015 Verizon Droid Turbo 2, esp. now that it has amazing battery with a $70 OEM replacement battery installed, giving me the longest battery life by far than I've ever seen, even since it was new (bad original battery batch, maybe?).\nPlus my DT2 is shatterproof, 21MP camera (great for cropping), leather back, water resistant. But it lacks Oreo, forever...", "time": "10-10-2017 12:24 PM", "replies": []}]}, {"title": "Moto X4 rumored to be coming to Project Fi", "thread": [{"postID": "post5897976", "text": "This should be good news for those on Project Fi looking for an affordable current device.https://m.androidcentral.com/project...red-be-moto-x4", "time": "07-24-2017 03:12 PM", "replies": []}, {"postID": "post5906163", "text": "First non-Google smartphone for Project Fi!", "time": "07-30-2017 09:33 PM", "replies": []}, {"postID": "post5986329", "text": "It's official that the X4 is coming to Project Fi. And both varieties, according to the Project Fi FAQ, the X4 Android One and the X4 Motorola unlocked version will work with Project Fi (for those that love the Moto actions).", "time": "09-21-2017 09:38 AM", "replies": []}]}, {"title": "Moto X4 Hands-On, First Looks, Reviews", "thread": [{"postID": "post5949228", "text": "Android Central (Alex Dobie):", "time": "08-31-2017 03:49 PM", "replies": []}, {"postID": "post5949229", "text": "The Verge (Vlad Savov):", "time": "08-31-2017 03:50 PM", "replies": []}, {"postID": "post5949231", "text": "Android Authority (Josh Vergara):", "time": "08-31-2017 03:51 PM", "replies": []}, {"postID": "post5949233", "text": "CNET (Kent German):", "time": "08-31-2017 03:51 PM", "replies": []}, {"postID": "post5949236", "text": "Tech Radar:", "time": "08-31-2017 03:52 PM", "replies": []}, {"postID": "post5949554", "text": "I think I am going to pass. I was hoping for this to replace my current Moto X. I don't know why I would want Alexa integrated into my phone when we already have Google for that. Just meh on this phone and I am kind of sad that I feel that way.", "time": "08-31-2017 07:06 PM", "replies": []}]}, {"title": "Huge Moto X4 Leak", "thread": [{"postID": "post5919362", "text": "Pictures of Moto X4 leak via Brazilian homologation agency, reveal thick body and headphone jack\nThis looks good to me.", "time": "08-10-2017 01:32 PM", "replies": []}, {"postID": "post5919616", "text": "Looks fairly good, although I wonder if they will bring back the Moto Maker with it as well? Was a nice feature of Motorola phones.. having screen/metal/back color choices.", "time": "08-10-2017 05:27 PM", "replies": []}, {"postID": "post5919628", "text": "If that rumor of a 3800mah battery is legit, this phone is going to be a beast.", "time": "08-10-2017 05:40 PM", "replies": []}, {"postID": "post5931089", "text": "More info.\nMoto X4 comes into focus in clearest set of leaks yet https://www.androidcentral.com/moto-...er-round-leaks", "time": "08-21-2017 05:01 PM", "replies": []}, {"postID": "post5940176", "text": "FCC Certification. \nMoto X4 passes through the FCC https://www.androidcentral.com/moto-...es-through-fcc", "time": "08-26-2017 03:55 PM", "replies": []}]}, {"title": "Android authority exclusive on X4", "thread": [{"postID": "post5928768", "text": "I hope this does not turn out to be overpriced, liking the looks of this phone.Exclusive: This is the Moto X4 - specifications confirmed! Android Authority", "time": "08-19-2017 01:56 PM", "replies": []}]}, {"title": "Moto X4 Rumors", "thread": [{"postID": "post5897912", "text": "This, if it comes at all, seems to be a long way off, releasing towards the end of the year. Rumours suggest a 5.2\" 1080p device, FPS, dual rear 12mp and 8mp cameras, a 16mp rear camera, and 3D glass. Speaking personally, I'd prefer a low-res front camera - very low - and flat glass, since 3D glass immediately makes screen protectors a problem; but that's just me.\nSound good so far?", "time": "07-24-2017 02:16 PM", "replies": [{"postID": "post5906164", "text": "Rumored delay caused by a Snapdragon 660 shortage.", "time": "07-30-2017 09:33 PM", "replies": []}]}]}, {"title": "Leaked picture of the Moto X4", "thread": [{"postID": "post5897978", "text": "Leaked picture from a renown leaker. If true, it looks pretty sharp!", "time": "07-24-2017 03:14 PM", "replies": []}, {"postID": "post5898178", "text": "Yes it does look sharp. I know it has a curved screen. \nAlso, looks like it has a slightly curved back like the MXPE had", "time": "07-24-2017 06:10 PM", "replies": []}, {"postID": "post5898884", "text": "This looks SEXY! I just hope the original rumors were true (SD660, 3800mah) rather than the more recent SD630, 3000mah.", "time": "07-25-2017 08:07 AM", "replies": [{"postID": "post5900572", "text": "Same here. Not sure about the battery (it could be great), but we are back with SD660.http://m.gsmarena.com/motorola_moto_...news-26393.php", "time": "07-26-2017 01:03 PM", "replies": []}]}, {"postID": "post5900577", "text": "hot and a proper FPS.", "time": "07-26-2017 01:07 PM", "replies": [{"postID": "post5900926", "text": "... and taking too long to be released", "time": "07-26-2017 06:43 PM", "replies": []}]}]}]
