[{"title": "Update: 26.26.14.lux_verizon.verizon.en.US (Nougat, Dec 2017 & KRACK security patch)", "thread": [{"postID": "post6157965", "text": "http://forums.androidcentral.com/e?l...token=ZS0-Ch1u\nSoftware Version: 26.26.14.lux_verizon.verizon.en.US\nAndroid® Security Patch Level: 2017-12-01, including Krack security patch\nWow.", "time": "02-08-2018 03:23 PM", "replies": []}]}, {"title": "How to fix my Droid MAXX's Power Button?", "thread": [{"postID": "post6151088", "text": "So, today I was watching YouTube, when I put my phone down. Next thing I knew, it restarted and the power button was mashed into it. By that, I mean that it won't \"click\" like the volume buttons do. I've searched everywhere, but with no luck! Also, it still kind of works. It just takes a light touch to turn the phone on instead of being able to press the power button like a normal button. (Also, this is the original Droid MAXX. I've had this phone since 2015.)", "time": "01-31-2018 07:14 PM", "replies": []}]}, {"title": "MAXX 2 SD Memory Card Issues", "thread": [{"postID": "post4978018", "text": "Is anyone having issues where the SD memory card \"unexpectedly\" unmounts at random times? I worked with Verizon and they have replaced the card and subsequently the phone but I am still having issues. Currently it re-finds the card sometimes and sometimes I need to do a power off/on to get it to find the card.", "time": "02-02-2016 09:43 AM", "replies": [{"postID": "post5516122", "text": "Hi I was having the same issue and I had my droid Maxx 2 replaced 3 times same issue so I finally changed my sd card from a sandisk sd card to a pony sd card and I have had no problems since I changed to a different sd card hope this helps!!!", "time": "10-23-2016 06:18 AM", "replies": []}]}, {"postID": "post4980962", "text": "I should clarify. It says SD card unexpectedly removed even though it wasn't. Also getting error message that says No storage area found. Anyone else having these issues?\nPosted via the Android Central App", "time": "02-03-2016 06:27 PM", "replies": []}, {"postID": "post5130267", "text": "Did your memory card issue ever get resolved? I am having the same problem. Motorola customer service wants me to do a factory data reset, but I am hesitant because it took a bit of effort to get this new phone set up the way I wanted and I don't want to go through that for nothing. It appears with others having the same problem a reset is not the answer. What kind of card were you using? Mine is a Sandisk Ultra 32gb class 10. I have a friend who got the same phone at the same time and his is doing it too.", "time": "04-17-2016 08:28 AM", "replies": []}, {"postID": "post5130844", "text": "Just to report in on this my Maxx 2 is not having this issue. I had a SanDisk 32 GB card in it initially and it now has a 64 GB PNY card in it.", "time": "04-17-2016 03:39 PM", "replies": []}, {"postID": "post5135204", "text": "Thanks for the reply. Just to clarify, are you saying you did have a problem with the SanDisk 32 GB card and now you are not with the new card?", "time": "04-19-2016 03:17 PM", "replies": []}, {"postID": "post5142036", "text": "Sorry for the late reply. No I never had an issue with the SanDisk card. I just upgraded to the 64GB card for more capacity. Both cards worked without problems.", "time": "04-23-2016 06:36 AM", "replies": []}, {"postID": "post5149065", "text": "Thanks", "time": "04-27-2016 10:51 AM", "replies": []}, {"postID": "post5221188", "text": "I am having the same problem with the SD card on my Droid Maxx 2", "time": "06-12-2016 01:03 PM", "replies": []}, {"postID": "post5254284", "text": "I am also having the same problem with the SD card on my Droid Maxx 2. Using San Disk Ultra Plus 32 GB MicroSD HC. The error message is random. It will work fine for a week, then the message, then other times, I can restart the phone and 10 seconds after the restart I get the error message. First I had it set up as external storage, then I tried formatting it as internal storage. Still have the problem. Has anyone heard a solution?", "time": "07-06-2016 06:14 PM", "replies": []}, {"postID": "post5256054", "text": "The only thing I can think of is to try re-seating the card in the tray. My card kind of \"snapped\" into the tray and felt like it was inserted solidly. Worth a try. Power off the phone first obviously.\nPosted via the Android Central App", "time": "07-08-2016 06:35 AM", "replies": []}, {"postID": "post5262164", "text": "Hi, \nI've spent WAY too much time on this and have confirmed (can I believe them?) with Verizon that this is a known Android 6.0.1 issue. You can see it pop up everywhere. My summary:\n1. New Droid Maxx 2 from Verizon around a month ago.\n2. New 64 GB SD card, UHS1 Type 10. The fast kind for HD cameras.\n3. I used the phone to format it as internal memory.\n4. It worked! For 3 weeks I had all of this memory. Was using for podcasts and photos and apps galore!\n5. Around week 4, the phone told me that the card was uninstalled and I needed to reinstall it.\n6. I tried a reboot and it would work for 10 mins. But then die again\n7. I powered down, opened and reinserted the card, powered up.\n8. Worked intermittently but would fail soon thereafter.\nFinally, it stopped working. Many apps failed - some worked halfway. All of my photos gone! (That's why we backup!) All of my podcasts gone! And my TouchDown HD email attachments - even new ones - still don't work. I can't get to old ones or new ones.\nI am going to have to factory reset and install everything and use without card until Google has a fix. Verizon told me that they are hearing more and more of these reports and that they have to wait for a Google fix.\nARGH!!!! A $384 upgrade mostly to this phone so I could get 6.0.1 and lots of memory\nCan anyone confirm that they see the same thing I do -- and that they heard the same from Verizon?\nThanks,\nGary", "time": "07-12-2016 05:45 PM", "replies": [{"postID": "post5298135", "text": "Me too. Exactly the same situation. Sandisk 64 GB type 10 not being read. It worked for a couple of weeks after mounting it as internal memory. now after I re-insert the SD card it will read for a few minutes then gone again.", "time": "08-03-2016 12:03 PM", "replies": []}]}, {"postID": "post5262777", "text": "My card is formatted as external, not internal (or adoptive) and I've had no issues. As far as Verizon goes I can't say for sure. Personally I never believe what a Verizon rep tells me. I wonder if you should try the card as external? Just to see what happens?\nPosted via the Android Central App", "time": "07-13-2016 04:37 AM", "replies": []}, {"postID": "post5284894", "text": "I am having the same issues with card. The local Verizon store said there should be a fix within a couple of weeks. My phone has been replaced and new card and still have the same issues.", "time": "07-27-2016 08:26 AM", "replies": []}, {"postID": "post5289645", "text": "I am experiencing everything you've said, in that order and on the same time-frame, except my card has always been mounted as external storage. So that won't help.\nAnyone have more information about the \"fix in a couple weeks\" that's been mentioned here?", "time": "07-30-2016 12:03 AM", "replies": [{"postID": "post5289906", "text": "It's rare when anybody in a Verizon store has any correct information when it comes to updates. Approaching 0.01%.", "time": "07-30-2016 05:55 AM", "replies": [{"postID": "post5292954", "text": "Ya think it's that high a percentage?", "time": "08-01-2016 07:37 AM", "replies": []}]}]}, {"postID": "post5292963", "text": "Have any of you tried re-seating the card in the sim tray? As I mentioned in an earlier post my card sort of snapped into the tray and felt solid. I remember something about some Samsung phones having a similar issue and some people suspected the tray was shaky.", "time": "08-01-2016 07:39 AM", "replies": []}, {"postID": "post5302456", "text": "So still no one has tried re-seating thier card?\nPosted via the Android Central App", "time": "08-05-2016 06:35 AM", "replies": []}, {"postID": "post5344991", "text": "I've reseated my SD card several times, and still have this problem now and then. For me it's not as frequent as it is for others--maybe once every two or three weeks.", "time": "08-19-2016 09:50 AM", "replies": []}, {"postID": "post5350812", "text": "I got my Droid Maxx 2 yesterday. I've experienced the SD problem from the very second I got home with my phone. I have a 128 g Sandisk Ultra. \nI've reseated the SD multiple times and restarted my phone numerous times. It reads for a few minutes after reset but unmounts soon after. \nThere is about a 32 of an inch play in the tray. It slides just slightly back and forth in the tray. The SD card does not \"snap\" in or feel secure no matter how I seat it. I will be returning this phone asap. I'm not going to wait for Motorola to admit they messed up.", "time": "08-20-2016 09:48 PM", "replies": []}, {"postID": "post5354893", "text": "For the benefit of all who are experiencing this problem, here is what I did that so far seems to have worked, based on 24 hours of moderate use. I'm using a Droid Maxx 2 with a 128GB Sandisk SD card that has been disconnecting anywhere from 1 minute to an hour after rebooting:\nI went to Settings, Storage & USB, Sandisk SD card, Apps. This brings up a list of apps that Android has moved to the SD card, If they are not sorted by size, you can sort them using the menu. I started moving some of the bigger apps back to internal memory by selecting them and clicking \"Change.\"\nFor me, the culprit seemed to be Evernote. Or possibly Roboform. So long as it is working, I am done tinkering!\nGood luck,\nDan", "time": "08-22-2016 09:07 AM", "replies": [{"postID": "post5364135", "text": "This might explain why I haven't experienced the problem. I never moved any apps over to my sd card. I just use the storage for music and pictures. Good work!", "time": "08-25-2016 06:38 AM", "replies": []}, {"postID": "post5427860", "text": "Thank you! Thank you! So far, so good, this seems to have fixed my problems , and yes, I had already tried all the other solutions mentioned.\nSB", "time": "09-18-2016 02:21 PM", "replies": []}]}, {"postID": "post5364544", "text": "There are two sets of user options that affect this issue. One is whether to use the SD card as \"internal\" vs. \"external\" memory. The problem we are discussing in this thread only occurs if you choose \"internal.\" When \"internal\" is chosen, Android moves some apps to the SD card without user intervention, unless the user chooses (app by app) to prevent it from doing so.\nDan", "time": "08-25-2016 09:21 AM", "replies": []}, {"postID": "post5365683", "text": "One of my earlier posts (#12) recognizes that fact. And the post by noballoffire (#14) says they are experiencing the problem with the card formatted as external.\nI never formatted my card as adoptable storage and this is one of the reasons why. Between the problems some people have had and the fact that you can't recover anything off the card pushed me towards not doing that and just using it for music and pictures. I'm not an app hound and I won't fill up the internal memory of my phone.", "time": "08-25-2016 03:13 PM", "replies": []}, {"postID": "post5365912", "text": "Hi,\nI am having the exact same issue. I have tried everything but a factory reset but will try that next. I back up my photos to a cloud so I am not concerned about maintaining them. This has been quite annoying. \nJulie", "time": "08-25-2016 04:37 PM", "replies": []}, {"postID": "post5375648", "text": "I am having a similar problem that started right after I upgraded to Marshmallow: \nI had a Samsung 64GB card that worked fine until I upgraded. After the upgrade I could only intermittently see the card with all of the data on it. \nI was able to retrieve all of my data by plugging the card into an adapter. I tried reformatting, no dice. \nI've tried clearing the phone cache, clearing the data / caches for the external storage and media in the apps, and turning the phone off / taking the card out / turning the phone on / turning the phone off / reinserting the card. \nNothing works. I never see the card anymore. \nThe card works fine in any other phone. \nI bought a brand new 32GB Samsung card, and the phone doesn't see it at all. \nThis is really irritating. The phone isn't that old, and I still have many payments left on it. \nI just installed the most recent update that came out.", "time": "08-29-2016 09:44 AM", "replies": []}, {"postID": "post5407287", "text": "Having the same issues as Roy. Have pulled the card out for the moment. Hope they figure this out soon. Was happy with the maxx, thought the maxx 2 would be even better. Never should have upgraded I'm coming to believe.", "time": "09-09-2016 07:16 PM", "replies": []}, {"postID": "post5435931", "text": "I'm on my 4th Droid Maxx 2 and my 2nd SanDisk 128 gB card.\nall the phones had this problem, thank goodness for insurance.\nI think the problem might be heat-related.\nhow many of you use an otter box or life-pruf cover with their phone?", "time": "09-21-2016 09:45 AM", "replies": []}, {"postID": "post5452896", "text": "I am having same trouble. My Droid Maxx 2 worked fine with the 64 Samsung SD card. Then it just disappeared about 8 months into ownership. I tested the card in another device and it works just fine. Now the phone is almost unusable with the tiny amount of space they leave me after all the factory junk they put in there that I can't remove. Not sure what to do at this point.", "time": "09-28-2016 05:41 PM", "replies": []}, {"postID": "post5530866", "text": "This might help : https://motorola-global-portal.custh...p/30,6720,9391", "time": "10-28-2016 02:49 PM", "replies": []}, {"postID": "post5543930", "text": "November. Same problem persists.\nI am in a twitter convo with @VZWsupport about this. We better get Android 7 soon and I hope this is fixed.\nIn an IM convo with VZW support they told me since I have no contract I can exchange for another device is I want. Has anyone done this?", "time": "11-03-2016 03:10 PM", "replies": []}, {"postID": "post5574195", "text": "Yes, I was having this problem with my Motorola Droid Maxx 2. \nI installed a 64 GB card and it worked ok for a while, then I started getting the \"missing SD card\" error.\nI would pop out the card and push the tray back in and everything would be OK for a while...\nThen it started happening more often, and I noticed that it often happened after using the camera.\nLike everyone else I searched the forums with no joy.\nBecause of the association with the operation of the camera, I concluded that this was likely not a software issue at all, but a hardware problem. The SD card was physically losing connection with its mating contacts.\nMy SD card mounts on the back side of the same little tray that holds the SIM card and the tray \"fingers\" do not grip it firmly, so it can move if the phone is jarred or from the vibration when the camera focuses.\nHere is my solution: i glued the SD card to the SIM card with nail glue, so it cannot move.\nI also had to reformat the SD card, as it had become corrupted from being removed when it lost contact.\nThat was two months ago, and I have not had a single SD card error.\nBefore securing the card where it couldn't move I was having spontaneous SD card errors several times a day, and almost every time I used the camera. It was making me CRAZY!\nI have seen that Samsung phones are having similar errors and suspect that they may be using the same SIM card/ SD card drive tray.\nRock on ...", "time": "11-21-2016 08:00 PM", "replies": []}, {"postID": "post5719189", "text": "I found a great way to resolve the micro SD card issue. Get a card other than a SanDisk. After months of inconsistent operation of my SanDisk Ultra 32GB microSDHC UHS-I Card, I decided to try another card. This was a Samsung EVO 32GB Class 10 Micro SDHC Card. The Samsung card fit into the Maxx 2 holder tray in a much tighter manner - the SanDisk card moved around in the tray which, in all likelihood, is the reason for the errors. And that is why Maximum Volume was able to resolve his SD card problem by gluing it into place. Will update on the longevity of this fix in a subsequent post but I am sure that the problem has been laid to rest.", "time": "03-20-2017 10:37 PM", "replies": []}, {"postID": "post5790841", "text": "I'm using an OtterBox, and I have noticed the phone gets hot too often. But the last sd card worked for almost a year before issues started..\nThe phone won't even recognize my previous SanDisk card anymore. Switched to a lexar about a month ago", "time": "04-28-2017 07:30 PM", "replies": []}, {"postID": "post5827974", "text": "All\nI have been beating my head against the wall over this as well. Having ALL of the same issues. Tried other cards, factory reset, formatting on a computer with Windows 7 AND Windows 10. Nothing helped - then I finally found this on the internet:https://forums.lenovo.com/t5/DROID-M...d/td-p/3441287\nGot it by searching Lenovo instead of Motorola. I added the tape behind the contacts of my Samsung EVO 64GB card, inserted it into my phone (it goes in quite a bit tighter), powered it up and BAM - all is well. Recognized it right away.\nGood luck all!!", "time": "05-25-2017 02:01 PM", "replies": []}, {"postID": "post6123630", "text": "Maxx 2 memory card issues as well... Not the \"loose as a goose\" problem, but I'm not able to move apps over to my Lexar 64gb card, and I keep running out of internal storage, even though all music, photos & vids are stored there. I've followed instructions but when I navigate to the APPS, Settings, there is only STORAGE, not STORAGE & USB. The card has been reformatted, the phone reset to factory, but none of the apps show that they can be moved, as they did in my Ultra. What am I doing wrong?", "time": "12-31-2017 11:03 PM", "replies": []}]}, {"title": "How do i stop Google?", "thread": [{"postID": "post6031504", "text": "So my Motorola (I think) won't stop going to Google when I'm doing something. And it only happens when I have my headphones on. My phone told me about this happening so I went to settings and turned it off but it still keeps on doing this. Plz help meh...", "time": "10-21-2017 06:23 PM", "replies": []}, {"postID": "post6031551", "text": ">>Please  explain better, your phone goes to Google when have the \nheadphones on--What do you hear-read it take you to Gmail-Chrome\nor a website..? Now to stop Google close its account, but still the\nunwanted Google will operate the phone. Better stay\nwith Google and let's read other users replies", "time": "10-21-2017 07:03 PM", "replies": []}, {"postID": "post6032732", "text": "Going to Google what? Google Assistant? Google on the web? Explain - we don't charge by the word.", "time": "10-22-2017 02:25 PM", "replies": []}]}, {"title": "How to unlock my phone", "thread": [{"postID": "post6020336", "text": "How do I unlock my Droid Maxx 2, Verizon was the original carrier but I have installed straight talk SIM card,please help,it works with new sim but need to unlock", "time": "10-15-2017 06:41 AM", "replies": []}]}, {"title": "Moving unsyncable calendar to new device.", "thread": [{"postID": "post5997607", "text": "My old phone is a Droid Maxx v4.4.4 the device calendar build version is 4.4.4-5 and want to know if there is a way to get it synced or the events moved to my new Moto Z2 force Edition. Thanks. Jamie", "time": "09-29-2017 08:51 AM", "replies": []}, {"postID": "post5997747", "text": "Welcome to Android Central! In the old phone's calendar app, is there an Export option in the menu?\nOr you could try Moto Migrate.", "time": "09-29-2017 10:39 AM", "replies": []}, {"postID": "post5997796", "text": "I just fired up my old Maxx. I'm sorry to say - I don't see any way to export events in the local calendar. I've always told people to use a synced calendar (Google, Outlook, etc.), but I hadn't realized that KitKat messed this up so badly. In the past you could export the events and then import them into Google Calendar (or something else.)\nSorry. (I hope that somebody has a better answer to this...)", "time": "09-29-2017 11:17 AM", "replies": []}, {"postID": "post5997883", "text": "See if you can use Motorola Device Manager to sync the calendar events to your computer. You might then be able to export the calendar on your computer, and then import that file to Google Calendar. https://mobilesupport.lenovo.com/us/en/solution/MS88481", "time": "09-29-2017 12:18 PM", "replies": []}, {"postID": "post6000487", "text": "Ok thanks guys, I will try these out. My own fault for not putting the events with an account. I will see what I can find out. Jamie", "time": "10-01-2017 07:24 PM", "replies": []}]}, {"title": "Driod Maxx 2, Adoptive storage crash. Issues with \"Party Mixer\" app not locating music", "thread": [{"postID": "post5997652", "text": "NEVER EVER USE ADOPTIVE STORAGE. My 128g SanDisk \"10\" external card became useless and I have no recovery for it because you can't back it up unless it reads on your phone. I have had multiple issues with the external memory card failing as an external application so I thought adoptive would be the answer. Until it stopped installing.\nNow my internal card is missing files and directories that were stored on the non functioning adoptive card. Meanwhile my most favorite music playing software will not search the external card now for the music stored there. I tried all kinds of combinations including allowing the phone to format the external card and reloading hours of data through the phone onto the external card (slow). I've stopped the Mixer app, deleted it's data and cache hoping it would reread and locate the external card. I reloaded the app. I used a music scan app hoping it would leave a command on the internal storage for the Mixer app to find the external card with the music.\nWhen the adoptive setup crashed and I looked at my internal card there is a whole lot of files missing that were usually showing on the internal. Fortunately, the inability of the Mixer App to find the mounted external card seems to be my only issue. I lost over 9 months of data that was either moved to the adoptive or deliberately stored there. The photos lost were irreplaceable.\nI realize a full factory restart might be in order just by noting what is no longer showing on the internal drive. It's confusing why the internal no longer shows multiple files and details but still functions fully.\nAgain my focus and issue is that the Party Mixer app is not locating the external card where the music is. BTW I tried several other programs, none (so far) as simplistic and functional as a mixing non stop player with adjustable segue timing. All the other player software found the external card and music with no trouble. And Party mixer used to know where the external music was. Help, please.", "time": "09-29-2017 09:30 AM", "replies": []}, {"postID": "post5997737", "text": "Welcome to Android Central! Ouch. This is the main problem with Adoptable Storage -- it relies on an inherently unreliable storage medium, SD cards. According to someone in the industry I've talked to, all cards -- even ones from reputable companies like Sandisk -- are significantly lower quality memory compared to what gets soldered onto a motherboard. Therefore, they're at much higher risk for corruption. Formatting a card as Internal Storage encrypts it such that only the phone that formatted it can read it. So if the card fails, there's really no way to recover that data using PC tools.\nYou could try some of the methods suggested here, but I'm not sure if they work with Adoptable Storage: https://forums.androidcentral.com/am...ted-files.html", "time": "09-29-2017 10:31 AM", "replies": []}]}, {"title": "Why is my Moto Maxx 2's battery indicate charging but is not", "thread": [{"postID": "post5979297", "text": "Hi I'm using the android Moto Maxx 2 and recently I found out it wasn't charging. I have tried over 10 cords, outlets, portables, End pieces, and outlets, but nothing will work. Almost all signs indicate charging but it isn't. When shut down it indicates charging symbol, when online indicates battery charging on the top right, it disables battery saver too. Even looking in basically the bios (Hold Down Vol + Power when offline) it will tell me charging. BUT when I go to, Settings-->battery, it will say (2% Not Charging). So now I'm left with a basically dead phone that will not charge, its never done this before, and its only 1 year old.", "time": "09-17-2017 06:45 AM", "replies": []}, {"postID": "post5980502", "text": "Welcome to Android Central! The battery might have failed. Is the phone still under warranty? If not, then bring it to a repair shop and see if they can determine if it needs a new battery.", "time": "09-17-2017 10:02 PM", "replies": []}, {"postID": "post5982125", "text": "Ok I'll try that out but warranty is up", "time": "09-18-2017 08:05 PM", "replies": []}, {"postID": "post5987322", "text": "Update I've gotten to the shop and they said it probably will need a new battery or a fix on the battery port but it will cost me so I'd like to know before paying, if there is any other methods", "time": "09-21-2017 10:11 PM", "replies": []}, {"postID": "post5987451", "text": "If it's a battery or microUSB port issue, then there's nothing else you can do besides get it replaced. The only thing I'd suggest is to ask for greater clarity before they do the work -- can they specifically say if it's the battery vs. the port, or is it impossible to narrow down before the repair?", "time": "09-22-2017 12:21 AM", "replies": []}, {"postID": "post5987623", "text": "I'm unsure but last time they said unless I agree to pay for the inspection (which isn't much) then they wont be able to give me any info but if its the only resort then I guess I have to", "time": "09-22-2017 05:42 AM", "replies": []}, {"postID": "post5987889", "text": "Sorry -- the only other thing I can think of would be to open the phone up and test the battery yourself, but I'm not sure how involved that would be. There might be DIY videos on YouTube.", "time": "09-22-2017 10:31 AM", "replies": []}]}, {"title": "How to update Android version if you have a Verizon phone and you're using it outside of U.S?", "thread": [{"postID": "post5959748", "text": "Okay so I got myself a Motorola Droid Maxx 2 (Droid Maxx play). I don't know much about carriers in the U.S. I can use my own Sim card and the phone has Verizon bloatware. Now I want to update my Android from Marshmallow to Nougat. I don't know if Motorola released Nougat for this phone yet or not but Motorola will. Suppose they have, how will I update my Android version? Verizon is not supported here so will I still receive OTA update? If not then can I manually download and flash the update?\n(Current country: Pakistan)\nThank you in advance.", "time": "09-06-2017 10:51 AM", "replies": []}, {"postID": "post5960033", "text": "Usually, for carrier-specific phones, you have to be on that carrier's network to get the official update. You could try Verizon's Software Update Assistant, but it also might not work if you're not currently on Verizon.", "time": "09-06-2017 12:44 PM", "replies": []}]}, {"title": "Nougat anyone ?", "thread": [{"postID": "post5803799", "text": "Just curious if anyone in the USA has been prompted to download Nougat ota? Seems as if Maxx2 will always run Marshmallow. Guess it is so that we will have to buy a new phone if we want to ever upgrade from Marshmallow.", "time": "05-06-2017 08:42 PM", "replies": [{"postID": "post5803926", "text": "The full list of devices being prepped for an update is as follows:\nMoto G (4th Gen)\nMoto G Plus (4th Gen)\nMoto G Play (4th Gen)\nMoto X Pure Edition (3rd Gen)\nMoto X Style\nMoto X Play\nMoto X Force\nDroid Turbo 2\nDroid Maxx 2\nMoto Z\nMoto Z Droid\nMoto Z Force Droid\nMoto Z Play\nMoto Z Play Droid\nNexus 6", "time": "05-06-2017 09:59 PM", "replies": []}]}, {"postID": "post5897169", "text": "Still no Nougat today July 23, 2017.", "time": "07-23-2017 09:43 PM", "replies": [{"postID": "post5955753", "text": "It is again. So Oreo is officially out and I still don't have Nougat on my Verizon Droid Maxx 2. \nDid anyone get it.\nDo I call Verizon to find out what happened some this phone was promised the update would be available? \nI have been very patient.", "time": "09-04-2017 01:46 PM", "replies": []}]}, {"postID": "post5956793", "text": "Motorola has not released Nougat for the Maxx 2. You can call Verizon, but they are dependent on Motorola to provide the update.", "time": "09-05-2017 06:27 AM", "replies": []}]}, {"title": "Droid Maxx 2 doesn't read micro SD card?", "thread": [{"postID": "post5943876", "text": "As the title states, my Droid Maxx 2 is unable to read my micro SD card. I've had this phone and SD card for about 2-3 years now and haven't run into any problems until today. I accidentally dropped my phone about 3/4th of a foot or so above the ground and found out that my SD card had accidentally been ejected. I didn't think much of it because this has happened before in the past, and I've dropped my phone lots of times without the SD card being an issue most of the time as well. However now my phone fails to read the SD card at all. The SD card itself is in okay condition, and it still works with other devices like my older Android phone and to my relief still retains all of my photos/music/etc. I'm just having problems with my Droid Maxx 2. It fails to show up in my phone and computer when connected to the phone and I've done all that I can think of to try and fix the situation. I'm starting to think it might be a hardware issue. Any advice would be greatly appreciated.", "time": "08-29-2017 12:32 AM", "replies": []}, {"postID": "post5943907", "text": "Welcome to Android Central! Do other SD cards work in your phone? If not, then the trauma might have caused some damage to the reader. Or perhaps it loosened the SD tray or the springlock that holds the card in place.", "time": "08-29-2017 01:34 AM", "replies": []}, {"postID": "post5943912", "text": "Sadly I do not have any other SD cards to test with \nI read elsewhere however that applying a small sliver of tape to the back of the SD card to make it slightly thicker to push it against the SD card reader pins more firmly is a possible solution. I haven't tried it yet but do you think it could work?", "time": "08-29-2017 01:38 AM", "replies": []}, {"postID": "post5943961", "text": "You could try it. But if the card really is loose, then even with that tape, there would still be risk of the card losing contact with the reader. If that happens while the phone is in the middle of a read/write operation, it might corrupt a file or the whole card.\nSD cards are pretty cheap these days -- you can find small (i.e., 4 or 8 GB) microSD cards for maybe $5 at your local electronics store. It may be worth getting one so you can test it out.", "time": "08-29-2017 02:30 AM", "replies": []}]}, {"title": "What would cause apps to be deleted from my Motorola Droid Maxx 2?", "thread": [{"postID": "post5907350", "text": "I have been experiencing problems where my phone will be fine for a time, then randomly all apps that were not pre-installed are deleted from my phone. It started in March when I was playing a game early Saturday morning, I put the phone in standby and took a nap. When I woke, the phone was completely turned off and all of my games apps were gone. It happens randomly and now I can see apps disappear while on the phone with Verizon tech support. Is this a problem with the Maxx2?", "time": "07-31-2017 07:07 PM", "replies": []}]}, {"title": "Phone keeps disconnecting from WiFi network?", "thread": [{"postID": "post5201584", "text": "For the past few months, my phone has been having problems staying connected to my home WiFi (no other hotspot has had any problems). No other device on the same network has the same problem. In attempts to fix this, I have: done a factory reset, wiped cache partition, and just the plain 'ol off-then-on attempt. Nothing I do seems to work! Someone please help. I can't keep using so much data!", "time": "05-29-2016 11:18 PM", "replies": [{"postID": "post5201602", "text": "Is your phone running an early version of lollpop? If it is then that might be the reason. If not, then it might just be a software issue. I'd contact the manufacturer and see if and try to get a replacement device.", "time": "05-29-2016 11:52 PM", "replies": []}]}, {"postID": "post5202201", "text": "I am running Android 4.4.4. I would try and get a replacement, but my warranty ended months ago.", "time": "05-30-2016 11:52 AM", "replies": [{"postID": "post5202384", "text": "The Maxx 2 comes with a 12 month warranty, and Verizon did not start selling it until last November, and it never had 4.4.4. Do you have the older Droid Maxx rather than the Maxx 2? (This is a forum for the Maxx 2, not the original Droid Maxx.)\nOne possibility: on your home network, you may be having channel interference or something similar. Try changing your router to a different channel (most people use channel 1, 6, and 11 on a 2.4 GHz network, because a WiFi channel actually spans about 5 channels. If it is 5.4 GHz, you can use just about anything.)\nIf you are using WPA/TKIP for security, try changing to WPA2/AES. (If you are using WEP, DEFINITELY try changing to WPA2). \nNeither of these things will affect your other devices - they will see the change and automatically reconnect. (Also, sometimes restarting the WiFi access point/router will help.)\nIf you have Bluetooth turned on, try toggling it off to see if that is interfering.", "time": "05-30-2016 02:09 PM", "replies": [{"postID": "post5202565", "text": "I've changed the WPA from \"Both\" to \"WPA-1\" and \"WPA-2\" and neither have worked. I also tried changing the name of my network. Bluetooth is off. Also, I changed the Bandwidth from 40MHz to 20MHz, no change.\nThe connection status next to the name shows full bars until I try to connect, then it goes to one and says \"Poor Connection.\"", "time": "05-30-2016 04:15 PM", "replies": [{"postID": "post5203416", "text": "What kind of router is it?\nAlso, on the phone, what happens if you go into settings / wifi, tap the menu control bottom right and choose \"advanced\", and turn off \"avoid poor connections\"? Does that help?", "time": "05-31-2016 09:32 AM", "replies": []}]}]}]}, {"postID": "post5202455", "text": "I'm not sure what I have, the phone just says Droid Maxx. I will try to change channels when I can. Thank you.", "time": "05-30-2016 03:00 PM", "replies": []}, {"postID": "post5203020", "text": "I had similar issues and searched everywhere on internet and then... I figured if it's Verizon then I have to start from there. Here is what I did and it worked. Log in: VZ Protect, Status, WiFi protection should be OFF. Problem is solved.", "time": "05-31-2016 01:10 AM", "replies": [{"postID": "post5222904", "text": "When you say log in .. To what please?", "time": "06-13-2016 09:04 PM", "replies": []}]}, {"postID": "post5203593", "text": "I am not sure what you mean by what kind of router. Its just whatever AT&T U-Verse gave us. And the \"avoid poor connections\" option is already unchecked.", "time": "05-31-2016 12:06 PM", "replies": []}, {"postID": "post5203706", "text": "I'm not sure if this will help or not, but have you tried restarting in safe mode? After you long-press power to bring up the power off dialog, rather than tap the power off control, long-press it until it brings up the restart in safe mode prompt. If the problem goes away in safe mode, there is likely some sort of third party app conflict. Do the normal restart to bring the phone back up in normal, non-safe mode.\nJust note that sometimes home screen widgets get messed up in safe mode and you may need to set them up again. Otherwise, you won't lose any data.\nAs for the gateway router, is there some sort of model number on the sticker (and a software version?) I don't have AT&T/UVerse, but I'm guessing that they have some sort of model number on it.", "time": "05-31-2016 01:37 PM", "replies": []}, {"postID": "post5204285", "text": "Wow! That really worked! I was able to determine from the Safe Mode that my phone was not broken. Turns out, I had a VPN app I totally forgot about hidden away in my apps! Deleted it and BOOM! WiFi is working like a charm!", "time": "05-31-2016 09:43 PM", "replies": []}, {"postID": "post5207880", "text": "Wow. I feel really stupid. I thought it worked, but the problem is still there... I can connect and stay connected for like 30min every time I clear the cache partition.", "time": "06-03-2016 06:29 AM", "replies": []}, {"postID": "post5872140", "text": "I'd just like to find out whether anyone with this problem has McAfee Mobile Security installed on their phone, as uninstalling this app seemed to have resolved the issue on my Medion LIFE X5020...", "time": "07-03-2017 02:07 PM", "replies": []}]}, {"title": "Motorola Droid MAXX 2 - Android Nougat Update", "thread": [{"postID": "post5807707", "text": "When is the Motorola Droid MAXX 2 getting the Android Nougat update? Currently, it's on Android Marshmallow. I have been reading that Nougat will be released to it in November or December. My mother has this phone. If someone could give me some clarification on when this update is coming, that would also be appreciated.\nThanks, Jesse Williams", "time": "05-09-2017 04:33 PM", "replies": []}, {"postID": "post5807882", "text": "Motorola has not and will not announce timing. The last thing that they want to do is to announce a date and then miss it because of an unexpected issue. Sorry to say, but it will come when (or if) it comes.\nSee also https://forums.lenovo.com/t5/DROID-M...2/td-p/3646678", "time": "05-09-2017 07:15 PM", "replies": []}, {"postID": "post5812794", "text": "Lenovo/Motorola have a terrible record when it comes to security patches and updates. In this case you also have Verizon involved with their own terrible record of updating. Initial reports had the update being released by now I beielve but nothing we can do now but wait and probably wait some more.", "time": "05-13-2017 05:04 AM", "replies": []}]}, {"title": "Moto Droid Maxx 2phone not found...", "thread": [{"postID": "post5678402", "text": "... in 2014 Altima. Has anyone here gotten this phone to connect, by Bluetooth, in their Altima?\nMy Moto G4 connects just fine.", "time": "02-14-2017 07:53 PM", "replies": []}, {"postID": "post5678502", "text": "Is it already paired, but not connecting? Or are you unable to even pair it to begin with?", "time": "02-14-2017 09:59 PM", "replies": []}, {"postID": "post5803790", "text": "The Altima would not find it at all.I gave up and continue to use myMoto G4 and it connects beautifully every time.", "time": "05-06-2017 08:35 PM", "replies": []}]}, {"title": "move apps to sd card in motorolla droid maxx 2", "thread": [{"postID": "post5739874", "text": "How to move apps to sd card in motorolla droid maxx 2", "time": "04-02-2017 05:39 PM", "replies": []}, {"postID": "post5740206", "text": "this app does it all (Link2SD) :https://play.google.com/store/apps/d....Link2SD&hl=en", "time": "04-02-2017 10:06 PM", "replies": [{"postID": "post5740515", "text": "You need a rooted phone for that app.\nThough I strongly recommend against this, a non-root and supported method is formatting an SD card as adopted storage, which will store all of your apps and data on the SD card. It basically turns yours SD card into internal storage. There are issues with this, though; for example, the SD card is encrypted, so it works only with this one phone. Of course, you also risk losing all of your apps and data if the SD card fails.", "time": "04-03-2017 05:21 AM", "replies": []}]}]}, {"title": "How to fix the rear camera", "thread": [{"postID": "post5707623", "text": "Just a note before I get into things. I don't know how many people use the twisting motion to open the camera, but after looking at the inside of this phone, I would recommend against that. There's another way to quickly open the camera. Go to Settings --> Display. The 6th option is \"Press power button twice for camera\", enable it.\n------------------------------------------------------------------\nAbout a week ago, my rear camera went out. Actually, I first noticed because the Flashlight option disappeared from the pull-down menu. I tried all the usual software fixes: rebooting, rebooting into safe mode, doing a factory reset. None of these worked.\nSo, I went on eBay, got a Droid Maxx 2 camera (about 21 bucks US), and I just replaced it. It's pretty quick. Here's what you need.T4 torx screwdriver.Small flat head screwdriver.Spudger/guitar pick. I also used a gift card.Replacement camera from eBay or wherever.I used a spoon to hold all the little screws.\nWatch this video on how to tear down the Maxx 2. You only need to go as far as battery removal. \nOnce you have the battery out, locate the rear camera, and remove the tape holding its ribbon cable in. Pull on the camera toward the top of the phone. The cable should slide out.\nPosition the new cable right where the old one came out. Use the spudger or a small flat head screwdriver to push the cable in. Put the tape back, then put the rest of the phone back together. I strongly recommend screwing the 4 corners and power & volume buttons in, re-inserting the sd/sim carrier, then testing the camera. If it works, you can put the rest of the screws in.", "time": "03-10-2017 12:54 PM", "replies": []}, {"postID": "post5709416", "text": "Welcome to Android Central, and thanks for the tutorial!", "time": "03-11-2017 11:41 PM", "replies": []}]}, {"title": "Which virtual reality apps will work with a Droid Maxx 2?", "thread": [{"postID": "post5706812", "text": "Recently purchased a Dream Vision Pro. It works fine with my Galaxy S6. My husband has not been able to find apps that work with his Droid Maxx 2. I'm really hoping he's just not looking in the right places. He has been using my phone, sometimes for an hour at a time. I really want my phone back.", "time": "03-09-2017 08:21 PM", "replies": []}]}, {"title": "When I play play my music with an equalizer, why does it turn off when I go into a new song?", "thread": [{"postID": "post5693318", "text": "*My phone is a Droid Maxx 2\nHi all.\nFor the past week, whenever I would play an album or a playlist, the equalizer I would be using would stop working when it went into the next song. I found this out because the sound quality would abruptly drop and would only reactivate when I select another song. At first, I thought it was a problem with the Equalizer I was using (https://play.google.com/store/apps/d...qualizer&hl=en), so I uninstalled it and decided to use the Audio Effects app in the meantime until the \"bug\" got fixed. However, I would have the same problem with the Audio Effects app as well, where it would, again, turn off as it played the next song. I downloaded yet another equalizer app (https://play.google.com/store/apps/d...zer.free&hl=en) hoping my situation would change, but still, no luck. The same thing still happens.\nI have tried disabling and clearing out the equalizer and Google Play apps to no avail, and not even turning it off and back on would work. I'm considering nuking my Google Play library (over 8,000 songs), but I feel like that would not remedy my situation. Is there any way I can fix this? \nThank you!", "time": "02-27-2017 04:28 PM", "replies": []}]}, {"title": "When I play play my music with an equalizer, why does it turn off when I go into a new song?", "thread": [{"postID": "post5693271", "text": "*My phone is a Droid Maxx 2, \nHi all. I've been having this problem for the past few days, in which whenever I would play an album and a song would go into the next one, the Equalizer will abruptly shut off. At first, I have assumed this was a simple bug with the Equalizer app I was using (https://play.google.com/store/apps/details?id=com.smartandroidapps.equalizer&hl=en), hoping it would be fixed soon. However, I soon realized that I was having similar problems when I used other equalizers; I would select song, let it play, and when it went into the next one, the equalizer would shut off, only reactivating when I select the song again. This even affects the built in Audio Effects app.\nI have tried everything I could think of to remedy this situation. I've tried disabling the apps, disabling Google Play, clearing the data/cache on my phone for Google Play/Equalizer Apps. I've deleted songs and albums but still no change. I've considered nuking my entire Google Play Library (of 8,000 songs), but I feel that would do nothing to remedy my situation. Does anyone know how to fix this problem? Thank you!\n-M.M.", "time": "02-27-2017 03:41 PM", "replies": []}, {"postID": "post5693280", "text": "Mod note. Thread moved to the Droid Maxx 2 fórum for more visibility.", "time": "02-27-2017 03:47 PM", "replies": []}]}, {"title": "Which VR app is compatible with Droid Maxx 2 ?", "thread": [{"postID": "post5673840", "text": "I bought a Viewmaster VR and when I tried to download Google Cardboard or Viewmaster experience app, I get a message saying my device isn't compatible.", "time": "02-10-2017 01:17 PM", "replies": []}, {"postID": "post5673854", "text": "Perhaps it has no gyroscope, or if it does, perhaps it is not enabled.\nI'll move this to the Maxx 2 forum for more suggestions.", "time": "02-10-2017 01:40 PM", "replies": []}]}, {"title": "Suddenly people can't hear me.", "thread": [{"postID": "post5668175", "text": "I've had my Droid Maxx 2 about 15 months. Recently, many people can't hear me. I never had this problem before. Any suggestions.", "time": "02-05-2017 03:36 AM", "replies": []}, {"postID": "post5668847", "text": "Welcome to Android Central! Can they hear you on speakerphone, or using a wired or Bluetooth headset? If so, then your primary phone mic is either blocked (e.g., by a case or by debris) or faulty. Inspect the mic opening carefully -- if it looks clogged with debris, use a needle and carefully try to remove some of it. If the mic opening looks clear, then the mic itself may be faulty -- in this case, bring it to a repair shop.\nWhen you get a chance, head over to the Introductions forum and tell us something about yourself! http://forums.androidcentral.com/introductions/", "time": "02-05-2017 10:13 PM", "replies": []}]}, {"title": "Is it possible to go back to external storage? Adoptable is not useful.", "thread": [{"postID": "post5663664", "text": "Subject line says it all. Almost none of the apps I use can be moved to the SD card being used as adoptable storage so there is no point. \nIs it possible to make card external and therefore useful for saving documents and photos? Or have I just wasted money on a quality SD card?\nThanks for reading.", "time": "01-31-2017 09:44 PM", "replies": []}, {"postID": "post5663675", "text": "I'd like to know about this too. I have a LG X Power that doesn't let me move my Apps to my SD Card. That's supposedly one of the cons w/ this phone. Do you use Google Photos for your pics? That would help in that regard.", "time": "01-31-2017 10:09 PM", "replies": []}]}, {"title": "Anyone having trouble with their Maxx2 not connecting to devices through Gizmohub?", "thread": [{"postID": "post5640143", "text": "I bought my sons Verizon watches for Christmas. One is a gizmopal2 and the other is a gizmogadget. I can't get either to connect to the parent app (GizmoHub). I've spoken to Verizon customer service and been to the store several times. It works on other phones but not mine. I have deleted and reinstalled the app but with no results. The reps at the store checked my settings to make sure it wasn't set up incorrectly and that is not the case. I'm hoping someone else has a solution because it's now January 10th and my kids still can't use their Christmas presents.", "time": "01-11-2017 01:58 PM", "replies": []}, {"postID": "post5640249", "text": "Welcome to Android Central! I'm not too familiar with those watches -- do they need to be paired via Bluetooth with the phone first in order to connect to GizmoHub? Where in the connection process does it seem to be failing?", "time": "01-11-2017 03:20 PM", "replies": []}, {"postID": "post5641041", "text": "Yes, they connect through bluetooth. You put in all of the information into the app and then you wait for them to connect. Unfortunately it never connects and then it tells you different troubleshooting options like is the watch on etc...", "time": "01-12-2017 08:19 AM", "replies": []}, {"postID": "post5641178", "text": "Is there something you have to do on the watch to initiate the pairing process? On many Bluetooth devices, there's a Connect button you have to press for a few seconds to make it discoverable.", "time": "01-12-2017 10:18 AM", "replies": []}, {"postID": "post5641478", "text": "I don't think so. You just have to make sure that they're on. There are only two buttons on the watches. One to call, one to hang up.", "time": "01-12-2017 02:20 PM", "replies": []}, {"postID": "post5642100", "text": "You're certain you're entering the correct MDN that corresponds to the Gizmopal 2? verizonwireless.com/support/knowledge-base-201049/\nAnd these are the steps you're following to connect? verizonwireless.com/support/knowledge-base-200953/", "time": "01-13-2017 01:42 AM", "replies": []}, {"postID": "post5656282", "text": "I gave up and went back to a Samsung Galaxy. All set now!", "time": "01-25-2017 09:43 AM", "replies": []}]}, {"title": "Changed my phone number, now all my amazon apps won't open - white screen", "thread": [{"postID": "post5634928", "text": "Hi! i changed my phone number and now all my amazon apps get stuck on a white screen. I have cleared cache/data and forced stop. I have uninstalled rebooted and reinstalled. Nothing works. My number is updated at Amazon. NONE of the Amazon apps will work. Everything else works. What is going on and how can I fix this???", "time": "01-07-2017 02:45 PM", "replies": []}, {"postID": "post5635042", "text": "Maybe contact Amazon Devs about this....", "time": "01-07-2017 05:33 PM", "replies": []}, {"postID": "post5635248", "text": "This happened because I had over 20 devices stored in Amazon, and when i cleared them out i cleared out the wrong ones. Now I have another problem, I cant re-register my phone! New thread for this one.", "time": "01-07-2017 09:32 PM", "replies": []}, {"postID": "post5644464", "text": "Oops!", "time": "01-15-2017 10:55 AM", "replies": []}]}, {"title": "HELP! I can't register my phone with Amazon so none of my apps work!", "thread": [{"postID": "post5635258", "text": "Hi! I had over 20 old devices registered with Amazon and when I cleared them out I accidentally cleared out my current phone. Unfortunately, since the latest software upgrade a month ago 'Underground\" does not work on Android devices. This is a known issue at Amazon apparently - though clearly not an important one for some reason (many Android users get an error when they try to connect to that app).. Because Underground is the only way to register your phone, I can't use any of my Prime apps! No Amazon apps at all.\nI'm shocked that Android users are so unimportant to Amazon and that this is the ONLY way to register your device! \nI think I might be able to use my apps if I roll back my OS to the previous install, not sure what that will do to it OR the other apps I use OR how to do it. Can anyone provide insight on this? If anyone can provide another work around that would be even better!", "time": "01-07-2017 09:43 PM", "replies": []}, {"postID": "post5635406", "text": "Amazon Underground still works for my devices. Do you mean that trying to register a device using the Underground app doesn't work?", "time": "01-08-2017 12:02 AM", "replies": []}, {"postID": "post5642577", "text": "RESOLVED: The Amazon tech support people I spoke to repeatedly on Sat (and were supposed to call me back within 48 hours but didn't) were totally wrong. In order to resolve this issue you have to:\n1. disable Amazon Underground, clear cache/data\n2. update Amazon Webview from google play\n3. update audible from google play\ndone", "time": "01-13-2017 11:57 AM", "replies": []}]}, {"title": "MAXX 2 Gyroscope issues/understanding", "thread": [{"postID": "post5255112", "text": "I bought the maxx 2 a few weeks ago after looking through reviews and device specs. One thing I read is that is has a gryoscope sensor. However, I cannot find settings in the phone to enable that sensor or turn it on. When I download apps that require the sensor, I receive error messages telling me that my device is not compatible. \nI'm kind of baffled, as the original maxx had the gyroscope sensor, and I'm reading on other threads that this device does not have one. Can someone confirm for me if this device has one, and if so how to enable it?Motorola DROID MAXX 2 specs (does not show gyroscope)Motorola Droid Maxx 2 Specs, Features, Release Date & Price (shows gyroscope as a sensor)\nThanks, apologize for the poor formatting. Posting on mobile.", "time": "07-07-2016 10:36 AM", "replies": []}, {"postID": "post5256048", "text": "Try installing CPU-Z and look at the sensors tab. Mine shows an \"orientation\" sensor which I believe would be the same as a gyro. The app will show you if it's functional as it reports data in real time.\nPosted via the Android Central App", "time": "07-08-2016 06:31 AM", "replies": []}, {"postID": "post5257693", "text": "Well having run CPU-Z on my tablet I see that the tablet shows gyroscopic sensors. So I guess my last posts assumption was incorrect.\nPosted via the Android Central App", "time": "07-09-2016 10:32 AM", "replies": []}, {"postID": "post5621617", "text": "Is the \"gyro\" a software application, and can it be added to an existing (6.0) phine", "time": "12-26-2016 02:49 PM", "replies": []}]}, {"title": "DROID MAXX 2: 24.74.4.lux_verizon.verizon.en.US", "thread": [{"postID": "post5587058", "text": "https://www.verizonwireless.com/support/motorola-droid-maxx-2-update/", "time": "11-30-2016 03:03 PM", "replies": []}]}, {"title": "I need help finding a case & a screen protector for my father's MAXX 2?", "thread": [{"postID": "post5000641", "text": "It's been years since I've had an Android phone but my father, who is older, is looking for a screen protector and a case for his Droid Maxx 2, I know nothing about this phone. I need some help finding the right one for each.\nHe needs a case that is really thin & preferably clear to show off his white MAXX but still has enough protection, I want his phone \"nude\" as possible.\nI was told that the MAXX 2 is pretty tough already, I went to Best Buy last night and they had absolutely no cases for it or screen protectors, the mobile reps said that the phone is already made tough. Anyways, I was looking on Amazon & there are so many cases & screen protectors that I'm going a little crazy trying to find the best one. Any recommendations or help would be greatly appreciated on narrowing my search down & getting him something in the next two days or so.", "time": "02-17-2016 08:51 AM", "replies": []}, {"postID": "post5003768", "text": "This is the case I use Motorola Droid MAXX 2 Hard Case | Motorola Droid MAXX 2 Cases | Incipio . It fits nice and snug and seems tough enough. I've always had good luck with Incipio cases. As for a screen protector I found these at Amazon and they do the trick for me.Amazon.com: [6-Pack] SUPERSHIELDZ- Anti-Glare & Anti-Fingerprint (Matte) Screen Protector Shield For Motorola Droid Maxx 2 (Verizon) -Lifetime Replacements Warranty- Retail Packaging: Cell Phones & Accessories", "time": "02-19-2016 07:48 AM", "replies": []}, {"postID": "post5532607", "text": "I'm looking for one a kickstand and USB port protection.", "time": "10-29-2016 01:13 PM", "replies": []}]}, {"title": "Internal storage using SD card in useless", "thread": [{"postID": "post5530925", "text": "I have added cards set up as internal storage on my droid Maxx 2 and Moto G4. It is useless on both phones.\nI am just venting right now because I just took a screen shot of some important information only to get a notification that it did not save due to lack of space.\nI can not retrieve the data now and I have a SD card that is practically empty that the screen print could have been saved to. \nAndroid Marshmallow should have not bothered with this so called feature since nothing seems to ever save to the SD cards adopted as internal storage.\nIs this fixed in Nougat? Guess I will never know unless I delete a bunch of apps from my phone to make room for it to download. ARGH\nThanks for listening.", "time": "10-28-2016 03:17 PM", "replies": []}, {"postID": "post5530929", "text": "My subject should read is useless. Maybe moderator can correct this please?", "time": "10-28-2016 03:19 PM", "replies": []}, {"postID": "post5531111", "text": "I agree that adopted storage for SD cards (particularly for phones with adequate internal storage) is RIDICULOUS. IMHO this should never have been done.", "time": "10-28-2016 04:51 PM", "replies": []}]}]
[{"title": "I had to reset my droid maxx 2 now i cant get past google verification", "thread": [{"postID": "post5520070", "text": "I had to reset my droid maxx 2 now i cant get past google verification", "time": "10-24-2016 03:48 PM", "replies": []}, {"postID": "post5527131", "text": "Welcome to Android Central! This is Google's Factory Reset Protection feature, and requires you to enter the Google account and password that was on the phone before you reset it (assuming you didn't properly remove the account before the reset). This is meant to discourage thieves from stealing a phone and simply resetting it to make it their own. Did you get this phone new or used?", "time": "10-27-2016 03:46 AM", "replies": []}]}, {"title": "App for resizing photo", "thread": [{"postID": "post5503609", "text": "Any suggestion for an app for resizing photos as you take them?\nSettings on camera are either widescreen or standard.\nPictures taken are HUGE!!", "time": "10-18-2016 07:16 PM", "replies": []}, {"postID": "post5504031", "text": "You won't find anything that changes them 'on the go', but you can try 3rd party camera apps that have different size options, or post-processing apps like Photogrid or Snapseed or Photoshop Express, but those will be after you take the picture.", "time": "10-18-2016 10:18 PM", "replies": []}]}, {"title": "Account Synch displays wrong number", "thread": [{"postID": "post5475863", "text": "Can anyone tell me if this means a phone has been hacked? On a Droid Maxx phone, likely any Droid phone too, if you navigate through 'Settings--> Accounts & Sync--> Facebook --> Your Number. If 'Your Number' being displayed is incorrect does this mean a phone has been hacked. Like if it is 1310757871 when it should be...oh like 7145551212. Here is a sceenshot, I promise it is not spam. Since I am new I cannot yet post a screen shot, but I put 5 spaces in the link to make it non working and if you have the patience copy it and take the spaces out to go to the screen shot.\nhttp: // imgur. com/ a/ TmfT0\nCan anybody explain to me why this might be? Can anyone tell me a better place to post a question regarding this?", "time": "10-08-2016 08:07 PM", "replies": []}]}, {"title": "Why does my camera keep turning on by itself and taking pictures on my droid maxx?", "thread": [{"postID": "post5310712", "text": "I do have a cracked screen but is there something i can do to fix it without repairing the screen or replacing the entire phone?", "time": "08-09-2016 05:40 AM", "replies": []}, {"postID": "post5314975", "text": "Welcome to Android Central! Does this only happen when the phone is in a pocket or purse, or even when it's just lying on a table, untouched?", "time": "08-10-2016 06:00 PM", "replies": []}, {"postID": "post5451851", "text": "Nao consigo iniciar a manha camera no droiz razr maxx xt926", "time": "09-28-2016 09:19 AM", "replies": [{"postID": "post5452168", "text": "Welcome to Android Central! Please see the response in your other thread: http://forums.androidcentral.com/dro...na-camera.html", "time": "09-28-2016 11:29 AM", "replies": []}]}]}, {"title": "erro na camera", "thread": [{"postID": "post5451841", "text": "Nao consigo iniciar a camera", "time": "09-28-2016 09:13 AM", "replies": []}, {"postID": "post5451870", "text": "Bem vindo! Tenta o seguinte, vai en configurações - aplicativos - câmera -apaga dados e reinicia o fone. Se o problema continuar inicia em modo seguro (safe mode) para conferir que não é um problema com algum outro aplicativo.", "time": "09-28-2016 09:25 AM", "replies": []}, {"postID": "post5452167", "text": "Based on the model number mentioned in your other post (XT926), I moved this to the Razr HD forum.", "time": "09-28-2016 11:28 AM", "replies": []}, {"postID": "post5452334", "text": "Fiz isso e nada tentei hard reset tambem nada apagando a participação de dados e nada mesmo forçando a parada não resultou", "time": "09-28-2016 12:41 PM", "replies": []}, {"postID": "post5452375", "text": "Então de repente é problema de hardware e o módulo da câmera quebrou. Acontece o mesmo erro se tenta abrir a câmera desde o WhatsApp ou qualquer outro aplicativo?", "time": "09-28-2016 12:57 PM", "replies": []}, {"postID": "post5452471", "text": "Tambem não corresponde fiz troca de câmera tambem nada e o incrivel o led flash traseiro não funciona", "time": "09-28-2016 01:47 PM", "replies": []}, {"postID": "post5452477", "text": "Mesmo usando camera dos aplicativos terceiros nada não sei o motivo o kit kat não resultou estou muito triste por que adoro este dispositivo", "time": "09-28-2016 01:50 PM", "replies": []}, {"postID": "post5452533", "text": "Não tenho certeza que mais pode funcionar. Já tentou abaixar um outro aplicativo de câmera da Play Store? Quando você falou hard reset, quer dizer factory reset (configurações de fábrica)?", "time": "09-28-2016 02:18 PM", "replies": []}, {"postID": "post5454750", "text": "Obrigado amigo pelas dicas nao consegui por estas dicas mas ganhei esperiência fiz as minhas opções desmontando o despositivo pela quinta vez e analisei o meu droiz razr hd e mudei a base uma vez que o flash led não funcionava e montei dai a camera resultou funcionou incrivel consegui o problema era o flash led espero que esta minha esperiençia ajude outros utilizadores", "time": "09-29-2016 03:12 PM", "replies": []}, {"postID": "post5454803", "text": "Fantástico! Você conseguiu consertar! Obrigado por contar a sua experiência, com certeza vai ser útil para outros usuários com o mesmo problema. Valeu amigo, a gente se vê no fórum.", "time": "09-29-2016 03:36 PM", "replies": []}]}, {"title": "Battery usage question", "thread": [{"postID": "post5369159", "text": "When I left for work this morning @ 8am, I put my Moto Droid Maxx 2 in airplane mode . The battery was at 99 percent.\nWhen I left work (now) to check messages,etc the battery is at 24 percent!\nDo I have a lemon? Why would the battery be used up while the phone sat in my purse unused?", "time": "08-26-2016 05:00 PM", "replies": []}, {"postID": "post5378492", "text": "That is really strange. My Maxx 2 can go three or four days on a charge with light usage. If the phone is new I would maybe try to exchange it. \nWas anything suspect when looking at the battery stats? A misbehaving app could have caused it. I also have had some weird battery drain issues when my contacts wouldn't sync for some reason and the phone just kept trying. So look at all your accounts to see if something is stuck.", "time": "08-30-2016 09:22 AM", "replies": []}]}, {"title": "Droid Maxx 2 Storage Problems", "thread": [{"postID": "post5365308", "text": "Whenever I try to update my apps I get an error message saying I have insufficient storage. I have a 32gb micro SD card that I formatted as internal storage, so I should have plenty of space for apps and stuff. Also I just updated the phone software, and after rebooting the phone a lot of my apps were gone from the phone completely. Help would be greatly appreciated as this issue is really ticking me off.\nEDIT: My apps did not get deleted, they are still there, they just disappeared from my home screen.", "time": "08-25-2016 01:15 PM", "replies": []}, {"postID": "post5368494", "text": "Welcome to Android Central! Show us a screenshot of the Settings>Storage menu: http://forums.androidcentral.com/amb...d-central.html\nAlso, are you saying the app shortcuts disappeared from the homescreen, or that the apps disappeared from your App Drawer? If the shortcuts disappeared from the homescreen, just create new shortcuts.", "time": "08-26-2016 01:15 PM", "replies": []}]}, {"title": "New update for Maxx 2", "thread": [{"postID": "post5364147", "text": "I just got this last night and it installed without any issue. Here's a link to the Verizon page about it.DROID MAXX 2 by Motorola Software Update | Verizon Wireless\nI have to say I'm stunned that Verizon issued any sort of update especially a security patch. My phone now has the July patch applied.", "time": "08-25-2016 06:45 AM", "replies": []}]}, {"title": "text notification counter", "thread": [{"postID": "post5279308", "text": "How do you add the counter to your text message icon?\nPosted via the Android Central App", "time": "07-23-2016 08:36 PM", "replies": []}, {"postID": "post5279443", "text": "Do you know for sure it's possible on the stock Motorola launcher? If not, you could always install Nova Launcher Prime, along with TeslaUnread.", "time": "07-23-2016 11:04 PM", "replies": []}, {"postID": "post5329286", "text": "Yeah that's what I use on my Maxx 2 and it works great. I use Textra for SMS but it worked with the stock app too.\nPosted via the Android Central App", "time": "08-15-2016 02:26 PM", "replies": []}]}, {"title": "Droid Maxx 2", "thread": [{"postID": "post5290631", "text": "Hey can anyone please let me know what kind of Sim card the Droid Maxx 2 takes want to use it on Straight Talk any help would greatly be appreciated\nPosted via the Android Central App", "time": "07-30-2016 05:52 PM", "replies": [{"postID": "post5290665", "text": "Nano sim Motorola Droid Maxx 2 - Full phone specifications", "time": "07-30-2016 06:32 PM", "replies": []}]}]}, {"title": "Bluetooth in Car", "thread": [{"postID": "post5283596", "text": "I am using a Droid Maxx 2 in a '16 Honda Pilot. (I have never had BT in a car before, so maybe the issues are not specific to the Pilot.)\nI am finding that the only way to get any audio from the phone to the car (other than incoming calls) via BT is to leave the car audio system on BT, as the phone will not interrupt, e.g., FM. As a result, notifications from Maps and all other applications simply go into the ether. Is this a “bug” or a “feature”? (I know that I can tell Maps to not use BT, but that is not a viable answer.)\nThis occurs w/ Google app (i.e., tapping on the mic icon), as well. \nThis is all in addition to the problems I am having with Moto Voice, where my Moto launch phrase is recognized by the phone and (sometimes) I get a dialog box on the car to transfer, but then it drops any connection.\nI have been told by Motorola that the only way to hear ANY BT output from the phone is to have the audio input be set to BT, and if the input is set to other than BT, the audio is simply lost. And, (despite the fact that it will for calls) there is no functionality for the audio from the phone to interrupt other media, unless the system is set to BT input. I have a hard time believing this is correct.", "time": "07-26-2016 01:50 PM", "replies": []}, {"postID": "post5283682", "text": "Yep, that sounds right. Calls should automatically interrupt, but if you want bt audio, it has to be set to bt as the input. \nThankfully you can listen to music (or even to fm stations using an app) on bt so it's not like the car has to be silent. In that case, apps like maps will interrupt or talk over the audio that is playing.", "time": "07-26-2016 02:47 PM", "replies": []}]}, {"title": "Can not send pictures", "thread": [{"postID": "post5279840", "text": "I try to send pictures on my droid on text messaging and just get failed messages back.", "time": "07-24-2016 09:26 AM", "replies": []}, {"postID": "post5280069", "text": "Welcome to Android Central! First things first--your mobile data is turned on and working, correct?", "time": "07-24-2016 12:49 PM", "replies": []}, {"postID": "post5280157", "text": "And if that didn't work, contact the network and ask them to enable mms on your sim. Good luck", "time": "07-24-2016 01:52 PM", "replies": []}]}, {"title": "Why does my music skip?", "thread": [{"postID": "post5274753", "text": "I have a brand new droid maxx 2. I downloaded all if my iTunes music on this phone and bought 2 songs from Google. Please help, as I'm tired of the sings skipping. Please send a direct link to anything you think will help me. Thank you in advance.", "time": "07-20-2016 09:01 PM", "replies": []}]}, {"title": "I was torn between the Maxx 2 and the Droid Turbo 2", "thread": [{"postID": "post5225756", "text": "The Droid Turbo 2. I ended up going for the Maxx 2. Anyone mind letting me know if I made the right decision? I'm a firm believer in that you get what you pay for but is the Turbo 2 really $300 more better do you guys think? I got the Maxx 2 as my work phone as I'm a Certified Real Estate Appraiser so this phone will be carrying a heavy load of pictures and use daily. Something about the Turbo 2 made my gut say no. I'm just not sure why. So far the Maxx 2 seems good but if the Turbo 2 is that much far superior, please let me know if you guys don't mind. I've somewhat figured out how to do the adoptable storage but it won't take many apps. What do you guys think about the resolution of the Maxx 2 vs the Turbo 2? \nThanks for the help to all,\nDon\nPosted via the Android Central App", "time": "06-15-2016 05:16 PM", "replies": []}, {"postID": "post5226031", "text": "Couple of pics with the red case back.\nPosted via the Android Central App", "time": "06-15-2016 09:32 PM", "replies": []}, {"postID": "post5226043", "text": "I think you made the right call. You seemed to have purchased the phone that would best suit your career and lifestyle; which is what a smartphone should do. Good for you for following your gut and for choosing a phone to benefit your everyday life tasks! \nPosted via the Android Central App", "time": "06-15-2016 09:39 PM", "replies": [{"postID": "post5227649", "text": "Thank you! \nPosted via the Android Central App", "time": "06-16-2016 09:17 PM", "replies": []}]}, {"postID": "post5230439", "text": "I'm happy with mine so far. Really good battery life and a decent camera. I've updated to marshmallow and the phone is working great.", "time": "06-19-2016 04:01 AM", "replies": []}, {"postID": "post5234669", "text": "The Turbo 2 is significantly better than the Maxx2 in pretty much every single way, and I'd even say it's $300 better. But given that this is your work phone and money plays a big part in any buying decision, you didn't make the wrong choice. I was lucky to get my Turbo 2 for $324 on a promo right when it was released.\nWhat do you have as your personal phone?\nAnything but an iPhone", "time": "06-22-2016 02:06 AM", "replies": [{"postID": "post5234808", "text": "Yeah I think the Turbo 2 is a great phone as well. But I wasn't ready to spend more than $400.00 on a phone. Especially when I don't game or load up tons of apps. I just use phone primarily for calls, texting and email. I think the Maxx 2 is a pretty decent option on Verizon for the money.\nI would have grabbed the deal you got as well. You're never going to see a better price than that!", "time": "06-22-2016 06:10 AM", "replies": []}]}, {"postID": "post5269250", "text": "Nothing wrong with maxx2 the main reason I got the T2 over Maxx is the shatter proof screen", "time": "07-17-2016 11:18 AM", "replies": []}]}, {"title": "How do I go back to the phone dialer and not Google?", "thread": [{"postID": "post5265023", "text": "droid maxx 2 marshmallow", "time": "07-14-2016 11:19 AM", "replies": []}, {"postID": "post5265083", "text": "Welcome. Please, could you elaborate a bit more? Not sure if I understand what your problem is.", "time": "07-14-2016 12:00 PM", "replies": []}]}, {"title": "help with droid ultra xt1080 on some things", "thread": [{"postID": "post5255204", "text": "i have two big problems with my phone. first of all i'm in Ghana and own a Motorola Droid Ultra(XT1080) which i bought an already used from the web(6/28/2016).\nProblem #1: no special codes work. i mean codes such as *#06# *#*#4636#*#* etc do not give feedback and i do not know why.\nProblem #2: The network was working well until i want to test the 4G LTE part so i installed 4G Switcher from Play Store and did something that i regret. As being a curious person, i wanted to see what that app could do. so i entered the option part->Select radio band, there i saw <Set GSM/UTMS band>(USA Band and Cellular) and i selected \"USA Band\". After that the network cut off and till today(7/7/2016) i still get no network even any other network. i found some solutions online but it's bit complicated to me and not for my phone type(Droid Ultra). \nSo can youn please help me with simple step by step guide. i'm pretty sure that some people still having yet solved that problem.", "time": "07-07-2016 11:49 AM", "replies": []}, {"postID": "post5255379", "text": "See this post/thread: http://forums.androidcentral.com/mot...ml#post4983826\n(The Ultra and the Maxx were the same phone, except for the size of the battery and the wireless charging in the Maxx. Otherwise, exactly the same. )\nThe House Of Moto worked for somebody with your exact problem. It's not the easiest thing you will do, but search for \"House of Moto\", read the instructions carefully, and hopefully it will fix your phone. \nI know of no special dial codes that work with the Ultra. \nI suggest if you get it fixed that you don't mess around with the radio settings again...\nFirmware for the Ultra is here: https://firmware.center:8081/firmwar...1080%29/Stock/\nI think you want the one with SU6-7.3 in the name. \nActually, one thing you may want to try first is the Verizon Software Repair utility. It will be a lot easier than House of Moto, but I'm not sure if it actually will fix this issue, and I'm not sure if it works outside the US, but surely worth a try. Make sure you use a USB 2 port rather than a USB 3 port when you attach the phone to the computer if you have a Windows computer. (Yes, you'll need a PC, Windows or Mac, to fix this problem.)\nSee http://forums.androidcentral.com/e?l...token=qb0U7Hp3", "time": "07-07-2016 01:50 PM", "replies": [{"postID": "post5264919", "text": "Thanks Doogald. Sorry for the late, I was out of the city. I tried the Verizon software but it was not detecting my device. I also checked on House of Moto latest version and it looks good. The fact is that with the slow networking we have in this country I am unable to download the firmware which is about 700mb, so I think I would just give it to a repairer to flash it for me. \nThanks for the help though.", "time": "07-14-2016 10:03 AM", "replies": []}]}]}, {"title": "Plantronics Bluetooth not playing media", "thread": [{"postID": "post5255213", "text": "It is a Plantronics M70 and it plays media fine with Samsung Galaxy Core, and it handles phone calls fine but I can't find a way to turn on the media to play through the Bluetooth. Is this an option?", "time": "07-07-2016 11:55 AM", "replies": []}, {"postID": "post5256560", "text": "Welcome to Android Central! Just to clarify--the headset will play media from your Galaxy Core, but not from your Maxx 2, correct?\nOn the Maxx, go to Settings>Bluetooth​, tap the Plantronics entry, and make sure Media Audio is checked on.", "time": "07-08-2016 01:49 PM", "replies": []}]}, {"title": "How do you view a video with a .mov extension on your verizon maxx 2?", "thread": [{"postID": "post5243393", "text": "Someone sent me a video with a .mov extension and it would not play.", "time": "06-28-2016 02:35 PM", "replies": []}, {"postID": "post5243415", "text": "Try vlc player from the play store", "time": "06-28-2016 02:49 PM", "replies": []}]}, {"title": "Astro file manager not working on MDM2", "thread": [{"postID": "post5241079", "text": "Is it just me or hasn't Astro file manager been updated to work with Marshmallow? \nI formatted my sd card in the phone setting it up as internal storage. \nAstro sees the sd card but won't let me connect to it. \nAstro doesn't see the phone drive .\nI could only get Astro to see my Google Drive.\nHmm", "time": "06-26-2016 10:43 PM", "replies": []}]}, {"title": "How do I move apps or change default storage on a Droid Maxx 2?", "thread": [{"postID": "post4979265", "text": "I just recently bought a Droid Maxx 2. I have quickly filled up 8GB worth of apps, which is leaving me with about 500MB of memory. I got and installed a 32GB SD card to help with storage issues. I have been able to transfer some apps over to the SD card by going into the Settings-->Apps section, then looking for a \"Move to SD card\" option. Many apps have that option greyed out so I can't use it. I am wanting to know if there is a way to move more apps over to the SD card, even if it takes 3rd party software. I'm also wanting to know if there is a way to change the default storage option for both apps and media (photos, etc.) so they will go directly to the SD card and I don't have to manually move them. Thanks in advance!", "time": "02-02-2016 11:11 PM", "replies": []}, {"postID": "post4979280", "text": "Once Motorola pushes the Marshmallow update then you can use the sd card as adoptable storage.", "time": "02-02-2016 11:17 PM", "replies": [{"postID": "post5240275", "text": "I have the marshmallow update and I am not allowed to move apps to the SD card. 😠 The old Maxx would have allowed it. If I can't get these files to move I am going to have to take the phone back.", "time": "06-26-2016 09:49 AM", "replies": []}]}, {"postID": "post4981033", "text": "Thanks for the info. Has Motorola said when this will be?", "time": "02-03-2016 07:04 PM", "replies": [{"postID": "post4981038", "text": "No date announced.\nPosted via the Android Central App on the Moto X Pure Edition", "time": "02-03-2016 07:09 PM", "replies": []}]}]}, {"title": "Droid Maxx 2: when on a call the screen will lock", "thread": [{"postID": "post5238760", "text": "I've tried to locate the auto screen lock when on a call - in the phone app - menu - settings but there is not one on droid mass 2 - unless I should be looking else where?", "time": "06-24-2016 08:50 PM", "replies": []}, {"postID": "post5238767", "text": "Mod Note, I will move this to the m2 forum for more visibility", "time": "06-24-2016 08:59 PM", "replies": []}, {"postID": "post5238798", "text": "ty!", "time": "06-24-2016 09:27 PM", "replies": []}]}, {"title": "(Please Help)My Home Button and My Buton That Shows All Open Tabs Doesn't Work", "thread": [{"postID": "post5236812", "text": "My home button lights up when I tap it (like normal), but nothing happens. This situation is the same for the square button on the right that shows all open tabs. The only way for me to get back home is to keep hitting the \"back\" triangle button on the left until I'm back to the homescreen.\n*ALSO*\nI no longer receive notifications from any app, not even the \"Storage Space Needed\" notification (I checked and I currently have a safe amount of storage).\nAnd you know how when you scroll down from the top twice, you get some settings like WiFi, Airplane Mode, Flashlight, etc.? I can only scroll down once and all I says is \"No notifications\"(as I said before, I receive texts, but it doesn't show up).\nI really want to know whats going on please help\nTHANK YOU SO MUCH! in advance \n(I've tried restarting)", "time": "06-23-2016 12:06 PM", "replies": []}, {"postID": "post5236975", "text": "Try doing a wipe of the cache partition? It won't destroy any stored data; sometimes it solves weird issues like this.\nInstructions: https://motorola-global-portal.custh...p/30,6720,9391", "time": "06-23-2016 02:14 PM", "replies": []}, {"postID": "post5236996", "text": "Hello Andrew, welcome to the forums. You could try something to help diagnosis. Go to settings - users - switch to 'guest' - open the notifications shade and see if anything changed. Repeat the process and switch back to 'owner'. Any changes?", "time": "06-23-2016 02:28 PM", "replies": []}]}, {"title": "Changing alarm tone", "thread": [{"postID": "post5190904", "text": "My previous phone was a Droid Maxx, and it was easy to add new alarm tones or music. I plugged the phone into my laptop, opened the alarm folder, and dragged a file from the computer into that folder. I now have a Maxx 2, and I can't find the appropriate folder. So I'm left with only the default alarm tones, and I REALLY want something different. Anyone have any tips or hints?", "time": "05-22-2016 09:11 PM", "replies": []}, {"postID": "post5195541", "text": "On my Maxx 2 there is a folder in the internal storage called Alarms. That's where the new files should be placed. I also have separate folders for ringtones and notifications. I just tried copying a file into the alarm folder (just like you mentioned) and it showed up in the pick list.", "time": "05-25-2016 03:34 PM", "replies": []}, {"postID": "post5200387", "text": "I've looked through pretty much every folder and done a search function, but I can't find the Alarms folder. Which seems really, really odd since the default alarms all are present and work just fine. What am I missing?", "time": "05-28-2016 08:41 PM", "replies": []}, {"postID": "post5200436", "text": "Yeah, it does seem odd. I have an alarms folder in the root of my Internal Storage. Are you running Marshmallow and if you are have you done a hard reset after the upgrade? I'm grasping at straws here. I'm running Marshmallow but have not performed a hard reset because my phone is running ok. I usually do a reset after an upgrade but decided to try it out for a while first.", "time": "05-28-2016 09:32 PM", "replies": [{"postID": "post5225762", "text": "I just picked up the Maxx 2 and this is pretty much my first experience with Android this year. I'm deeply Apple and quite knowledgeable with that OS. Do you mind letting me know how to do the hard restart on this device. I've just updated to Marshmallow and haven't tried the hard reboot yet. \nThanks\nDon\nPosted via the Android Central App", "time": "06-15-2016 05:19 PM", "replies": []}]}, {"postID": "post5200678", "text": "Just create a folder called \"alarms\" and put any alarm tones you want - they will show up in the alarm tone picker.", "time": "05-29-2016 05:59 AM", "replies": []}, {"postID": "post5226518", "text": "Sure, just go to settings>Backup and Reset>Factory data reset. Make sure you have everything backed first as all your data will be erased during the reset. I did finally do a hard reset after the Marshmallow update and it runs smoother now. Good luck.\nEdit: I forgot to mention that your sd card should remain untouched during the reset. Emphasis on should.", "time": "06-16-2016 06:54 AM", "replies": []}]}, {"title": "Move storage from phone to sd card", "thread": [{"postID": "post5203885", "text": "Motorola Droid Maxx 2 purchased May 2016. How do I move apps from phone storage to installed sd card?", "time": "05-31-2016 03:26 PM", "replies": []}, {"postID": "post5205769", "text": "Welcome to Android Central! If you can't find a Move to SD button for any app in the Settings>Apps menu, then the phone doesn't support that feature. You'd have to root the phone and use an app like Link2SD or App Mgr III.", "time": "06-01-2016 09:47 PM", "replies": []}, {"postID": "post5225764", "text": "I was able to go in to storage in settings and move some apps to my SD card but very few were allowed. Let me know if you are still having issues and I'll try and explain the best I can how I did mine if I can remember lol.\nPosted via the Android Central App", "time": "06-15-2016 05:22 PM", "replies": []}, {"postID": "post5226200", "text": "Is this for the g5?\nPosted via the Android Central App", "time": "06-15-2016 11:28 PM", "replies": []}, {"postID": "post5226505", "text": "If you're running Marshmallow you can use the sd card as adoptable storage.", "time": "06-16-2016 06:40 AM", "replies": []}]}, {"title": "Fiddling with storage after Marshmallow, need help", "thread": [{"postID": "post5184595", "text": "As with everyone else I recently got the Marshmallow update. Supposedly this was supposed to help be able to transfer more apps and images over to the SD card. I've been looking at the various options, but can't figure out how to set up the SD card (I have a 32GB card) as the primary storage for the phone, including for pictures I take. I'd like to move most of my apps over the the SD card, but many of them won't do it (I assume this is a problem of the app developers and not Verizon or Motorola). Anyone have tips on how to do this?", "time": "05-18-2016 09:26 PM", "replies": [{"postID": "post5184648", "text": "More apps/fewer images.If the card is adoptive storage (that was your choice when you set it up), the phone decides where, physically, to put apps. Logically it's just \"storage\". (You shouldn't be using adoptive storage unless your phone is 8GB internal storage or less.)\nIf it's portable storage, (almost all phones today should be set this way) you can \"move\" the same apps you could before - and a developer who knows that his phone won't run from the SD card will turn off that option. If's no good moving an app to the card if it won't run.", "time": "05-18-2016 10:09 PM", "replies": []}]}, {"postID": "post5184968", "text": "I just updated my Maxx 2 as well. Go to Settings>Storage & USB>Portable Storage>Touch the Cards Name. Now you should be at an Explorer type screen showing directories. Touch the three dots in the upper right hand corner and select settings. Mine has three options Eject, Format or Format as Internal. I think you're looking for Format as Internal. Obviously you need to back up your card prior to performing the format.", "time": "05-19-2016 05:26 AM", "replies": []}]}, {"title": "Marshmallow for the DROID MAXX 2", "thread": [{"postID": "post5166157", "text": "Here we go!Verizon starts rolling out its Marshmallow update for the Droid Maxx 2 | Android Central", "time": "05-07-2016 09:15 PM", "replies": []}, {"postID": "post5166187", "text": "I haven't got the update and no other site is reporting on this so I would like to know where they are getting this from.", "time": "05-07-2016 09:55 PM", "replies": []}, {"postID": "post5166478", "text": "here we go - official!link was garbled, had to change it to code.", "time": "05-08-2016 03:59 AM", "replies": [{"postID": "post5167190", "text": "Yeah, I had the same issue. The link I pasted in was unusable.", "time": "05-08-2016 02:40 PM", "replies": []}]}, {"postID": "post5166491", "text": "No update for me either. I've seen a report on one other site. http://www.androidauthority.com/veri...update-691322/\nEdit: Verizon has announced it as well. Tried to post a link but the link ends up unusable when I save the post. It's listed at the Verizon site under ://www.verizonwireless.com/support/motorola-droid-maxx-2-update/\nAdd http to the above link.", "time": "05-08-2016 04:13 AM", "replies": []}, {"postID": "post5167085", "text": "Might as well call this update Bigfoot. Lots of stories but no one has actually seen it in the wild...", "time": "05-08-2016 01:20 PM", "replies": []}, {"postID": "post5167110", "text": "Forcing the update by clearing the cache of Google Services Framework or doing the *#*#checkin#*#* code did not do anything.\nWaiting for Verizon.....", "time": "05-08-2016 01:35 PM", "replies": []}, {"postID": "post5167187", "text": "Yup. Nothing here yet either. Nothing to do but wait until it hits.", "time": "05-08-2016 02:39 PM", "replies": []}, {"postID": "post5170341", "text": "Guess what! First Update File is being installed!", "time": "05-10-2016 11:44 AM", "replies": []}, {"postID": "post5170603", "text": "It finally showed up. I'm almost done with the first part of the upgrade.\nEdit: Both updates are installed and my phone is up and running. Running smooth so far. I may do a hard reset even though I'm not really seeing any problems. Going to run it as is before I do anything though.", "time": "05-10-2016 02:37 PM", "replies": []}, {"postID": "post5176250", "text": "My second update is 50% done! Been waiting for this since I got my phone.", "time": "05-13-2016 05:12 PM", "replies": []}, {"postID": "post5176807", "text": "Let us know how it goes for you. Mine has been running well.", "time": "05-14-2016 04:44 AM", "replies": []}, {"postID": "post5178679", "text": "For the most part 6.0 is treating me well. However, for some reason the Kindle and Amazon music apps are refusing to take an update from the play store. Anyone else having this problem?\nPosted via the Android Central App", "time": "05-15-2016 12:45 PM", "replies": [{"postID": "post5178717", "text": "Did you disable any of the other Amazon apps? If yes, try re-enabling them and see if the update now works.", "time": "05-15-2016 01:20 PM", "replies": []}]}, {"postID": "post5178992", "text": "I did have audible disabled. But enabling that didn't make any difference.\nPosted via the Android Central App", "time": "05-15-2016 05:31 PM", "replies": [{"postID": "post5179075", "text": "Sorry, I meant to say enable and restart the phone, and then first update the Audible app manually if you had it disabled. Then see if you can update the apps you want. You also may have temporarily enable installation from unknown sources in settings / security settings.\nSee http://forums.androidcentral.com/mot...zon-prime.html for a similar problem when the T2 received Marshmallow.\n(That thread includes my comment, \"The person (at Verizon and/or Motorola) who decided that it was a good idea to pre-install the Amazon apps rather than just let people install them on their own should be penalized by having to use a Droid 2 Maxx2 as their only phone for the next two years. You shouldn't have to disable them - you should be able to uninstall them if you don't want them. [Or, as I said, just sell the phone without them.]\" It remains RIDICULOUS that these apps are pre-installed as system apps. Amazon apps are popular enough that people will find them in the Play Store if they want or need them.)", "time": "05-15-2016 07:05 PM", "replies": [{"postID": "post5179638", "text": "I couldn't agree more. As well as the insidious DT IGnite crap. DT Ignite is the first thing I disable with the Amazon apps being next. I don't hate on Amazon at all but like you say, I'd install the app if I wanted it. I like my Maxx 2 but Verizon's bloatware is completely out of control. I'll be buying an unlocked phone next time around. I'm stuck with them as there just isn't a better option coverage-wise where I live.", "time": "05-16-2016 05:21 AM", "replies": [{"postID": "post5179898", "text": "What does DT Ignite even do? \nI agree in principle against bloatware, but honestly this phone isn't that bad compared to some verizon phones. In fact the Amazon helping is greatly pared down to 4 apps from about 9 on my old Turbo. In all, i've got about 5 verizon apps disabled. I regularly use kindle, underground, and music, so i did have audible disabled, but the update thing made me undo that.\nOne annoyance: for some reason this phone lets me put far fewer apps on my SD card than my Pure Edition does. That might not be a phone thing, it may be a 6.01 vs. 6.0 thing. Anyone know?", "time": "05-16-2016 09:05 AM", "replies": []}]}]}]}, {"postID": "post5179958", "text": "It allows the carriers to remotely install even more bloatware. When I first about this I though \"they have to be kidding\" but it's real.DT Ignite allows carriers to install post-sale bloatware \nI currently have 21 apps disabled (just checked) and there are probably a few more that could be disabled with some experimentation. Depends on the user though. One mans ceiling is another mans floor...", "time": "05-16-2016 09:40 AM", "replies": []}, {"postID": "post5180169", "text": "I'm pretty sure that the way this phone uses dt ignite is to make sure that the current roster of bloatware is installed after setting up the phone from scratch, or after a factory reset. I don't think the Verizon is pushing even more bloatware after the fact.", "time": "05-16-2016 11:45 AM", "replies": []}, {"postID": "post5180399", "text": "I've read something to that effect regarding the flap over it getting installed on the S7. It doesn't matter to me either way, I'm disabling it. I'm not going to take the chance. All this junk takes up space and can potentially waste battery. I think that if Verizon would let us uninstall it almost everybody would. But like I said, it's really up to each individual user as to how much this stuff bothers them.\nTake a look here http://forums.androidcentral.com/mot...turbo-2-a.html (see post #4) to see how much stuff can actually be disabled. This list is exhaustive and includes a bunch of stuff that most users would not disable but it is interesting to see how much junk you could \"theoretically\" get rid of.", "time": "05-16-2016 02:30 PM", "replies": []}]}, {"title": "Transfer text messages from old phone", "thread": [{"postID": "post5170395", "text": "My parents just upgraded to the Maxx 2. What is the best way to transfer text messages from an old phone? There was a notification on they phone when the first got it, but we can't seem to find that utility now - where both phones are connected to the network and you transfer from one to the other. Or is there a better way?\nThanks!", "time": "05-10-2016 12:16 PM", "replies": []}, {"postID": "post5170460", "text": "There are any number of SMS backup apps available at the Play store.\nRun it one phone to backup the SMS messagestore and then on the new phone to restore same.", "time": "05-10-2016 12:57 PM", "replies": [{"postID": "post5170507", "text": "Thanks, I will give that a try. My Dad's phone still has the Verizon notification to transfer, but I guess my mom clicked through hers. We'll find a way \nPosted via the Android Central App", "time": "05-10-2016 01:30 PM", "replies": [{"postID": "post5170600", "text": "I've used this app with great success. https://play.google.com/store/apps/d...pRestore&hl=en", "time": "05-10-2016 02:36 PM", "replies": [{"postID": "post5171130", "text": "Thanks, this is what we used today to restore call history and sms. Worked very nicely.\nPosted via the Android Central App", "time": "05-10-2016 08:59 PM", "replies": []}]}]}]}, {"postID": "post5171558", "text": "I'm happy it worked for you. I've always had good luck with it.", "time": "05-11-2016 06:00 AM", "replies": []}]}, {"title": "My Droid Maxx 2 light comes on but my screen isn't working. What do I do?", "thread": [{"postID": "post5162015", "text": "Droid Maxx 2 screen has the black screen of death. It vibrates when you turn it on but screen stays black. What do I do? I've tried holding the buttons and not working someone help me", "time": "05-05-2016 09:49 AM", "replies": []}, {"postID": "post5162336", "text": "Welcome to Android Central! Does it make any sounds, or does it ring when someone calls you? If so, then the screen has failed and needs to be replaced.", "time": "05-05-2016 12:33 PM", "replies": []}]}, {"title": "When is Droid MAXX 2 getting Marshmallow?", "thread": [{"postID": "post5019440", "text": "Anybody know when this will be released for this phone?\nPosted via the Android Central App", "time": "02-27-2016 10:36 AM", "replies": []}, {"postID": "post5019446", "text": "Hello Michael, welcome to the forums! There's a soak test already running. The official release will depend on how it goes. \nMarshmallow soak test begins for Droid Turbo 2 http://www.androidcentral.com/marshm...-droid-turbo-2", "time": "02-27-2016 10:40 AM", "replies": [{"postID": "post5019488", "text": "That's for the T2; this forum is for the Maxx 2. \nNobody knows when it is coming, and Verizon and Moto do not pre-announce. It will come when it comes.", "time": "02-27-2016 11:08 AM", "replies": [{"postID": "post5019861", "text": "You're right, wrong forum! My bad", "time": "02-27-2016 03:58 PM", "replies": []}]}]}, {"postID": "post5119325", "text": "Did any one receive Marshmallow upgrade. My phone keeps unmounting SD card. I am loosing all my songs. I am forced to reinstall and download everything again. Hoping that Marshmallow upgrade will fix it.", "time": "04-11-2016 11:09 PM", "replies": []}]}, {"title": "can I transfer my Instagram photos to my photos on Droid Maxx2", "thread": [{"postID": "post5116017", "text": "moving Instagram photos to the Droid Maxx 2 photo album", "time": "04-10-2016 09:14 AM", "replies": []}, {"postID": "post5116471", "text": "Welcome to Android Central! Moved to the Droid Maxx 2 forum.\nIf you save an Instagram photo to your phone, I think it goes to the directory called /Pictures/Instagram. Photos there should automatically get added to your Gallery app's database unless there's a file called \".nomedia\" in that directory. Use a file manager app to look in the Instagram directory, and if you see a \".nomedia\" file, delete it (you might have to change a file manager option to Show Hidden Fiels). This should add the photos to the Gallery, but the problem is that Instagram might add the .nomedia file back in automatically. In that case, use the file manager to copy those photos to a different directory (like the main /Pictures directory).", "time": "04-10-2016 01:46 PM", "replies": []}]}]
[{"title": "motorola screen replacement program", "thread": [{"postID": "post5085943", "text": "I just upgraded to a Maxx 2 and the 2nd day out, fell down some marble stairs, sprained my ankle and my screen was shattered. I have a great gal at Verizon who always calls me back, and she told me that Motorola offers a one time replacement program for Turbo and Maxx 2 phones. So I paid nothing, and will have a refurbished phone soon.", "time": "03-25-2016 07:43 PM", "replies": []}, {"postID": "post5085949", "text": "That's great to hear about your phone! \nI hope you are not seriously hurt!  That doesn't sound good at all.", "time": "03-25-2016 07:48 PM", "replies": []}]}, {"title": "Droid Maxx 2 on Prepaid.", "thread": [{"postID": "post5040345", "text": "I have a Verizon Moto X running on Verizon Prepaid, I would like to \nreplace it with a Maxx 2 but when I try to buy one at the local\nstore they tell me they can't sell me one for prepaid, can anyone\ntell me if it will work if I order one direct from Verizon or Motorola.\nThanks.", "time": "03-07-2016 03:27 PM", "replies": []}, {"postID": "post5043192", "text": "Why won't they sell you one? What's their reason? I have a Maxx 2 that I was going to try and move over to the prepaid plan because you get twice as much data for $5.00 less a month.", "time": "03-08-2016 02:49 PM", "replies": []}, {"postID": "post5044435", "text": "They keep telling me that it is not for sale on prepaid, they won't really give me a reason.\nI have a Moto X on prepaid now, I've had it for over a year and am happy with the service.\nThey are up to 3 gigs of data for $45/mo. now and you can buy another 3 gig's for 20 bucks that will \nlast for 90 days. As far as I'm concerned you can't beat the deal, it works everywhere I need it too.\nI use mine for a hotspot in the summer when we use our RV, the rest of the time I use very little\ndata so really don't need a plan with a lot of data. I just want to upgrade to a little bit bigger phone.", "time": "03-08-2016 10:58 PM", "replies": []}, {"postID": "post5044448", "text": "They keep telling me that it is not for sale on prepaid, they won't really give me a reason. I've asked 2 different stores and they both gave me the same \"run around\"", "time": "03-08-2016 11:04 PM", "replies": []}, {"postID": "post5044793", "text": "It's not runaround- Verizon at the moment only wants to sell the phone with a postpaid plan. They insist the same for any of their resellers (including Costco, Best Buy, or Amazon, if they sell it.) The Turbo 2 is the same way. As I understand it, you can get it full price and then cancel the plan after a month without a penalty of any sort. It's not sold with a contract, so once that first month is done, cancel it. I'd ask just to make sure. \nI believe they sell last year's Turbo as a prepaid device right now.", "time": "03-09-2016 05:19 AM", "replies": []}, {"postID": "post5045712", "text": "Thanks for the reply,\nThat is what they are trying to talk me into, buy it on a plan, then cancel the plan\nafter a month and pay off the phone, then go back to prepaid, seems like a\nlot of trouble just to get a new phone. \nWhat happens if I buy one from Motorola? They have it listed on their site.\nSame price as Verizon.\nThe other phone I've been thinking about is the Motorola Moto X Pure Edition,\nI can get it from BH Photo for about the same price as the Maxx 2, actually works\nout cheaper for me because of no sales tax, but not sure it will work either.", "time": "03-09-2016 11:07 AM", "replies": [{"postID": "post5046284", "text": "As I said, Verizon's authorized resellers will only sell you one on an existing plan or if you create a new plan. Motorola is acting as Verizon reseller in this case.Verizon prepaid does have a bring your own phone option, but I would check with Verizon to make sure that the MXP will work. I know that you can buy one and put a Verizon SIM in for postpaid, so I'll bet it will work, but I would still double-check to be sure.\nIt should work though: http://www.droid-life.com/2015/09/15...ns-at-verizon/", "time": "03-09-2016 02:08 PM", "replies": []}]}, {"postID": "post5046482", "text": "Thanks for the reply, I talked to Verizon again this morning, they said the Maxx 2 should be \noffered \"soon\" maybe after they see how many people jump on the S7.\nGuess I can wait awhile and see. \nThey did increase my prepaid data to the new plan for my trouble so guess\nit was worth the phone calls.", "time": "03-09-2016 03:19 PM", "replies": []}, {"postID": "post5065745", "text": "I went to the local Verizon \"company\" store this morning, they said as long\nas I had my other phone for at least a year I could upgrade on prepaid, \nif I paid retail price for the Maxx 2. I said OK, he went to the back and\ngot one, took all of about 5 min. to transfer all my settings and account info.\nand I walked out the door with a new Maxx 2.", "time": "03-16-2016 04:50 PM", "replies": []}, {"postID": "post5065754", "text": "That's great. I'm glad it worked out.", "time": "03-16-2016 04:56 PM", "replies": []}]}, {"title": "reception", "thread": [{"postID": "post5063693", "text": "I recently upgraded to this Maxx 2. Both my wife and I have the same phone. Within the first week, the reception on hearing with the phone is horrible. Put a call on speaker and it works great. Also noticed using Bluetooth it also does well. Only time does it give problems is using the phone to communicate. We both replaced the phones and the problem still continues. Does anyone else have this problem? \nAlso I am trying to mirror to a LED Samsung Smart TV 60 model UN60JS7000FXZASKU. Do not want to connect to wifi. \nThanks\nPosted via the Android Central App", "time": "03-15-2016 09:50 PM", "replies": []}]}, {"title": "How do I upload songs to my Droid Maxx 2 form computer?", "thread": [{"postID": "post5021486", "text": "how can i upload music from my computer, to my Motorola maxx 2 wireless phone", "time": "02-28-2016 04:44 PM", "replies": []}, {"postID": "post5021504", "text": "Welcome to Android Central! What kinds of music files are they, and where did you get them from (i.e., ripped from CD, downloaded from iTunes, etc.)?\nThe easiest way is usually to connect the phone to your computer via USB, and use Windows Explorer to drag and drop the music files to the phone's Music directory. Keep the conventional folder hierarchy of Artist>Album>Song. You can also upload your entire music library to your Google Play Music library in the cloud, and stream it easily using the Play Music app: https://support.google.com/googlepla.../1075570?hl=en", "time": "02-28-2016 04:53 PM", "replies": []}, {"postID": "post5043204", "text": "You might need the Motorola drivers so the pc can see the phone. https://motorola-global-portal.custh...ail/a_id/88481", "time": "03-08-2016 02:51 PM", "replies": []}]}, {"title": "Change reminder notification sound?", "thread": [{"postID": "post5026253", "text": "I would like the appointment sound to be different than the text message sound. How do I do that? I have a Droid Maxx 2", "time": "03-01-2016 06:55 PM", "replies": [{"postID": "post5026308", "text": "Welcome to Android Central!\nYou should be able to go in to your calendar settings, go to general, and change the notification settings for reminders from you calendar appointments.", "time": "03-01-2016 07:24 PM", "replies": []}]}]}, {"title": "Thinking about Droid Maxx but worried about heat", "thread": [{"postID": "post5006662", "text": "Hey everyone,\nMy wife and I are looking at switching carriers to save some money, and my Verizon phone choice is looking like a Moto Droid Maxx 2. I am not a power user, so the great battery life, water resistance, and a affordable price really appeals to me. \nMy concern is reading about heat. The AC review mentions it, and I have seen posts on other forums talking about the Moto X Play (the Droid Maxx 2s twin) having significant heat problems. I had a HTC Desire Eye as my last Android phone, and the constant warming of my pocket had a lot to do with why I moved away. \nWhat is your experience? Am i needlessly worrying? Or if you had problems, is there a \"fix\"?\nPosted via the Android Central App", "time": "02-21-2016 08:25 AM", "replies": []}, {"postID": "post5006773", "text": "I had the turbo 2 for a short period of time. It really only got hot during the initial few days when I was downloading everything and setting everything up. Once I got the phone set up the way I wanted and settled into a usage pattern, the phone was fine.", "time": "02-21-2016 09:36 AM", "replies": []}, {"postID": "post5007653", "text": "I've never noticed my Maxx 2 getting warm. Like yourself, I am not a power user. I do keep any hardware I'm not actively using ( WiFi, Bluetooth or GPS) turned off. I'm not sure if that makes any difference or not.", "time": "02-21-2016 05:59 PM", "replies": []}]}, {"title": "DROID MAXX 2 - multiple home screens/pages. How can I modify this?", "thread": [{"postID": "post4999527", "text": "I just purchased the Verizon DROID MAXX 2. I noticed that while my DROID MAX (original) had 5 home screen to store app shortcuts (I could swipe right or left to access the different screens), my MAXX 2 has only 2 home screens to store app shortcuts to. \nHow can I modify this? Or do I need to install a 'launcher app' to my phone in order to do that?\nHope my question makes sense!!", "time": "02-16-2016 02:09 PM", "replies": []}, {"postID": "post4999699", "text": "Hi, welcome to the forums! The stock launcher will remove any empty screen. If you want to add a new one long press on a shortcut and drag it to the right edge to open a new screen.", "time": "02-16-2016 03:48 PM", "replies": []}]}, {"title": "screen shots maxx 2", "thread": [{"postID": "post4997166", "text": "Whenever I take a screenshot by holding the power and volume button I always get the volume\najustment slider in the pic. Is there any way to stop that or is it just me?\nPosted via the Android Central App", "time": "02-14-2016 11:31 PM", "replies": []}, {"postID": "post4997402", "text": "Hello, welcome to the forums! It's all about timing \nI use the two index fingers to hold the keys and the thumbs to make pressure from the left edge. It works most of the times, but I still get the volume slider sometimes.", "time": "02-15-2016 06:24 AM", "replies": []}]}, {"title": "Storage", "thread": [{"postID": "post4980488", "text": "Hi all. For those of you who have the Maxx 2, how much free space came with the phone out of the box? I know the official spec is 16gb, but this will obviously not all be useable space after system apps, bloatware, etc. \nAlso, I have a lot of apps. Is it possible to move downloaded apps from the Play Store to a SD card and still have the app function properly?\nThanks!", "time": "02-03-2016 01:44 PM", "replies": [{"postID": "post4980974", "text": "No.It's possible to move some parts of some apps to the card, but 1) that doesn't free much space (each piece leaves a link in internal storage pointing to where it is on the card, since Android looks in internal storage) and 2) SD cards aren't designed to run apps, and you'll shorten the life of the SD card, so make sure you always have the data on the card (including the apps) backed up.", "time": "02-03-2016 06:37 PM", "replies": []}]}, {"postID": "post4981825", "text": "If you can't move apps to a SD card, manufacturers really need to stop making phones with 16gb of storage. Even for a mid range device, that's unacceptable.", "time": "02-04-2016 08:16 AM", "replies": [{"postID": "post4981849", "text": "Then DROID MAXX 2 isn't for you right now.\nPosted via the Android Central App on the Moto X Pure Edition", "time": "02-04-2016 08:30 AM", "replies": []}, {"postID": "post4982054", "text": "Yes! Honestly, SD card storage is too much of a kludge and it's too bad it didn't die off when Google stopped supporting it with ICS or JB (I can't remember which it was..) However, SD cards are good for devices that are intended for developing markets (India, Africa, Latin America, much of the rest of Asia) where 8 GB or so of storage allows really cheap devices to be made affordable, or to allow media storage only, or transfer of data files between devices. SD cards should never be allowed for app storage on devices in wealthy countries like ours (IMHO).\nAdopted storage is a *horrible* idea. You won't be able to transfer files with the SD card; if the SD card fails, your entire storage is suspect, even internal storage. I can't believe that Google is allowing that on any but cheap phones for developing markets.", "time": "02-04-2016 10:27 AM", "replies": []}]}]}, {"title": "I lost all sounds for incoming text and emails on my Android Max 2, how can I get it back?", "thread": [{"postID": "post4981898", "text": "it was working find and midday it just lost the incoming call ring.", "time": "02-04-2016 09:05 AM", "replies": []}, {"postID": "post4981902", "text": "Hi and welcome to AndroidCentral. \nDo you mean that your personal ringtones don't work, or that no ringtones work at all, not even the pre-installed ones? \nAre you sure that you don't have your device on vibrate only or do not disturb?", "time": "02-04-2016 09:07 AM", "replies": []}]}, {"title": "How do I move apps or change default storage on a Droid Maxx 2?", "thread": [{"postID": "post4979252", "text": "I just recently bought a Droid Maxx 2. I have quickly filled up 8GB worth of apps, which is leaving me with about 500MB of memory. I got and installed a 32GB SD card to help with storage issues. I have been able to transfer some apps over to the SD card by going into the Settings-->Apps section, then looking for a \"Move to SD card\" option. Many apps have that option greyed out so I can't use it. I am wanting to know if there is a way to move more apps over to the SD card, even if it takes 3rd party software. I'm also wanting to know if there is a way to change the default storage option for both apps and media (photos, etc.) so they will go directly to the SD card and I don't have to manually move them. Thanks in advance!", "time": "02-02-2016 10:59 PM", "replies": []}]}, {"title": "How to Turn off Assisted Dialing on Droid Maxx 2?", "thread": [{"postID": "post4976397", "text": "I live in Israel and when someone calls me and I try to call them back, the phone automatically adds a US prefix to the phone (01). This is SUPER annoying and impedes my ability to make phone calls.\nCan anyone help with this?\nThanks!", "time": "02-01-2016 09:39 AM", "replies": []}, {"postID": "post4976415", "text": "Hi, welcome to the forums! Do you have easy prefix enabled in your SIM card settings? If so, switch it off and see if it makes a difference.", "time": "02-01-2016 09:49 AM", "replies": []}]}, {"title": "Does the Droid Maxx 2 have a light that flashes when new notifications arrive?", "thread": [{"postID": "post4937394", "text": "does the droid maxx 2 flash to indicate new notifications", "time": "01-07-2016 03:49 PM", "replies": [{"postID": "post4957614", "text": "There is no functional Notification LED. Active Display is it's replacement.", "time": "01-19-2016 09:30 PM", "replies": []}]}, {"postID": "post4937421", "text": "It does not. \nNote: It doesn't mention a service light in the notification area.", "time": "01-07-2016 04:02 PM", "replies": []}, {"postID": "post4972998", "text": "Can anyone tell me if it's the full version of active display or the dumbed down version like on the Moto E and Nexus 6 called Ambient Display? I ask because I need the ability to have it continue to flash an icon on the screen indefinitely for a notification until I acknowledge it like the Droid Turbo does. I don't want just one quick flash on the screen of a notification and then back to sleep unless I pick it up. I can't seem to find the specifics on this. I want to be able to look across the room and see if I have a notification without walking over to the phone.\nThanks for the help. \nRob", "time": "01-30-2016 01:34 AM", "replies": []}, {"postID": "post4973835", "text": "Disregard...found the answer. Active display is now part of the Moto app and no longer allows indefinite pulsing of a notification. It times out after 3 minutes or so and then you have to nudge the phone or wave your hand over it if it has sensors. Bummer. I need something that keeps pulsing.", "time": "01-30-2016 04:10 PM", "replies": []}]}, {"title": "Why doesnt Moto Actions show chop twice for flashlight?", "thread": [{"postID": "post4963467", "text": "I bought a brand new maxx 2 today. The salesman in the store showed me the cool chop twice feature on his maxx, but my Moto Actions app does not have chop twice as an option in Actions. All I see when I click on settings, Actions is the camera twist. I have updated Moto, Moto Actions, Moto voice, and checked for my system updates though none were available. The about phone section shows I'm running 5.1.1. So why can't I see chop twice for flashlight in my possible Moto Actions?", "time": "01-23-2016 04:10 PM", "replies": []}, {"postID": "post4963500", "text": "Hi, welcome to the forums! I don't have the Maxx 2 but the X Play that is pretty much the same. The double chop isn't included in the Moto actions and it doesn't matter if you are running Lollipop or Marshmallow. The double twist for the camera is the only action available for this phone There's not much you can about that unless you go the root way. Sorry \nFor the flashlight you can use the stock quick settings or a third party app. I use Power Toggles so I can switch it on from the notifications shade of even from the lock screen. Worth a try.", "time": "01-23-2016 04:27 PM", "replies": []}, {"postID": "post4971803", "text": "The flashlight can be turned on from the quick settings pull down menu. No need to unlock the phone to do so.", "time": "01-29-2016 07:58 AM", "replies": []}]}, {"title": "Sound notifications work for text messages but not for Facebook messenger, why is that?", "thread": [{"postID": "post4963284", "text": "I have a droid maxx 2 notification sound for text messages work but not sounds for facebook messenger", "time": "01-23-2016 01:10 PM", "replies": []}, {"postID": "post4964025", "text": "Welcome to Android Central! Are you saying that FB Messenger never gives you an audible notification, or that you can't assign a custom tone for FB Messenger notifications? I recall seeing another thread saying that the latter is not possible (i.e, you're stuck with FB Messenger's own tones).", "time": "01-24-2016 02:33 AM", "replies": []}]}, {"title": "Incorrect Homescreen Email #", "thread": [{"postID": "post4858284", "text": "I have searched and tried all the solutions but none work.\nMy home screen shows 1 unread email but there are no unread emails.\nI use Comcast email.\nThere are no drafts etc etc.\nIs there really a solution for this annoyance?\nThanks", "time": "11-26-2015 07:45 AM", "replies": []}, {"postID": "post4953332", "text": "Try restarting your phone. Press and hold the power button until phone shuts down than begins restarting\nPosted via the Android Central App", "time": "01-17-2016 07:04 AM", "replies": []}]}, {"title": "How do you jailbrake a Verizon Droid Maxx 2?", "thread": [{"postID": "post4934358", "text": "trying to jail brake this phone so we can use it for a different provider anyone no how to do this ?", "time": "01-05-2016 08:59 PM", "replies": [{"postID": "post4934362", "text": "Root?\nJail break is an iOS term.\nThe DROID MAXX 2 should not be SIM locked.\nPosted via the Android Central App on the Moto X Pure Edition", "time": "01-05-2016 09:01 PM", "replies": []}]}, {"postID": "post4934364", "text": "It's not jailbreak it's unlock unless u want to root but to answer ur question...there few online places where u can buy an unlock code for Android from 6.99$ up average price is 20$ this will let u use any provider or just call ur provider pay and have it unlocked.", "time": "01-05-2016 09:02 PM", "replies": []}]}, {"title": "Anyone switch from Turbo 2?", "thread": [{"postID": "post4881310", "text": "Battery isn't quite what I had hoped on dt2, was curious if anyone switched to maxx 2?\nPosted via the Android Central App", "time": "12-08-2015 08:08 PM", "replies": []}, {"postID": "post4882239", "text": "Is Maxx 2 battery life supposed to be better than the battery life on the Droid Turbo 2?", "time": "12-09-2015 09:27 AM", "replies": [{"postID": "post4882556", "text": "I'm not sure if that was the intention, but the screen and chip drink more juice than the maxx 2 does. From what I've seen on XDA, maxx users are commonly being 5 hours SOT and sometimes 6-7, whereas DT2 users are more commonly getting 3.5-4.5 and sometimes 5.5.\nPosted via the Android Central App", "time": "12-09-2015 12:02 PM", "replies": []}, {"postID": "post4922792", "text": "Actually yes, because the maxx 2 is a 1080 screen. \nI wish the turbo and turbo 2 would have stayed 1080, the screens are fine and it would have really upped the already good battery life on the turbos. \nMy daughter went from the maxx to the maxx 2 because it was cheaper than the turbo 2. She has only had 3 smart phones, the razr maxx, the droid maxx and now the maxx 2.. she is def spoiled to great battery life!\nSent with my white Note5 with nonremovable back and no SDcard!", "time": "12-29-2015 10:52 PM", "replies": []}]}, {"postID": "post4883098", "text": "I like it ! It is very good for the price . If you want more ,pay more !", "time": "12-09-2015 03:30 PM", "replies": []}, {"postID": "post4883122", "text": "I had note 4 . Paid as much in tax as for all the maxx 2 . Decide What you want in a smart phone before you buy ! I have a pc for games . Check the wants with different items before you buy . Want more pay more . Larry", "time": "12-09-2015 03:37 PM", "replies": []}, {"postID": "post4928800", "text": "I just switched back to Android from Windows Phone and I have to say I think the Maxx 2 is a lot of device for the money. I'm very happy with mine so far. I wasn't sure I wanted something with a 5.5 in screen but I'm sold now.", "time": "01-02-2016 01:48 PM", "replies": []}]}, {"title": "Battery Life", "thread": [{"postID": "post4928334", "text": "Just curious what kind of battery life all of you Maxx 2 users are getting and how it compares to the Turbo 2?", "time": "01-02-2016 07:55 AM", "replies": []}, {"postID": "post4928694", "text": "So far mine has been pretty good. I can't compare it to the Turbo 2. The battery is massive and using it the way I use a phone (not a power user) I could get two or three days out of it if I had to. I just went two days without charging it and still had 55% left when I put it on the charger.\nAlso of note is there is a Turbo charger and a usb cable in the box. It charges fast.", "time": "01-02-2016 12:25 PM", "replies": []}, {"postID": "post4928736", "text": "Good to hear! I am actually disappointed in the battery life on the Turbo 2. I thought the original Turbo had better battery. I figured the Maxx 2 might perform better because its screen isn't as power hungry.", "time": "01-02-2016 12:49 PM", "replies": []}, {"postID": "post4928797", "text": "I'm not a power user, so other people may not do as well as I am. So far, so good though!", "time": "01-02-2016 01:44 PM", "replies": []}]}, {"title": "Moto X Play Back on the Maxx 2", "thread": [{"postID": "post4816670", "text": "Has anyone tried to replace that \"beautiful\" Verizon Logo branded back of the Maxx 2 with an unbranded back of the Moto X Play?\nIf it is just a rebranded phone for a Verizon exclusive it should work. Just wondering if it DOES. \nThat big V on the back is just killing the look of the phone.\nPosted via the Android Central App", "time": "11-09-2015 06:56 PM", "replies": []}, {"postID": "post4884845", "text": "I've heard acetone works\nPosted via the Android Central App", "time": "12-10-2015 11:42 AM", "replies": []}]}, {"title": "green line and voice", "thread": [{"postID": "post4866202", "text": "I cannot get rid of green line around everything and cant get rid of voice talking to me .", "time": "11-30-2015 08:14 PM", "replies": []}, {"postID": "post4866323", "text": "That sounds familiar. In settings / accessibility, do you have Talkback turned on?", "time": "11-30-2015 09:29 PM", "replies": []}, {"postID": "post4866687", "text": "Hi Larry, welcome to the forums! I think Doogald is right, it sounds like you have some options enabled in your accessibility settings. If TalkBack is activated and you can't navigate through the settings try scrolling with two fingers and using double tap until you switch it off. Tell us how it goes.", "time": "12-01-2015 03:16 AM", "replies": []}]}, {"title": "How do I assign a ringtone to a contact on Motorola Maxx2?", "thread": [{"postID": "post4863995", "text": "Set a different ringtone on a contact other than default ring on phone", "time": "11-29-2015 06:57 PM", "replies": []}, {"postID": "post4864001", "text": "Hi, welcome to the forums! Try this. Open your contacts app, select a contact, tap on the edit/pencil icon top right, tap on the three dots top right and select \"set ringtone\".", "time": "11-29-2015 07:02 PM", "replies": []}]}, {"title": "emails disappear", "thread": [{"postID": "post4859451", "text": "Have Motorola Maxx2. My Wave Broadband emails disappear before I get a chance to even see most of them. They are not in trash but thank goodness are on my laptop. No one can give me answers....Wave or Verizon including some very helpful techs who tried. Found this site so thought I'd put on forum. Never had any problems with my Motorola HD. Got new phone 16 days ago & very frustrating. Besides email problem very little info synced from other phone... ie: birthdays, calendar appts as example. I'm told by Verizon this is common. ????\nPosted via the Android Central App", "time": "11-26-2015 11:22 PM", "replies": []}, {"postID": "post4859496", "text": "Yes very common", "time": "11-27-2015 12:07 AM", "replies": []}]}, {"title": "Does it work with AT&T?", "thread": [{"postID": "post4843568", "text": "Any idea if this is GSM unlocked like most other Verizon phones and if it works well with AT&T?", "time": "11-19-2015 02:46 PM", "replies": []}, {"postID": "post4848868", "text": "Pretty sure it will work.", "time": "11-21-2015 11:05 PM", "replies": []}]}, {"title": "Verizon Droid Maxx 2", "thread": [{"postID": "post4812435", "text": "I'm looking for this blue wallpaper that is on the Maxx 2 on Verizon's site but I can't find it. \nIf anyone has it or could help I'd be grateful", "time": "11-07-2015 11:54 PM", "replies": []}, {"postID": "post4812583", "text": "I would do a google search for droid maxx2 wallpapers. That's how i get stuff that isn't on zedge.\nMoto Droid Turbo 2", "time": "11-08-2015 02:44 AM", "replies": []}, {"postID": "post4812600", "text": "I've pulled all my hair out. I'm into wallpapers big time so I've tried zedge, google searches of stock wallpaper. Thanks again", "time": "11-08-2015 03:00 AM", "replies": []}, {"postID": "post4814529", "text": "Well you made me curious i cant find it either. Maybe it will show up soon.\nMoto Droid Turbo 2", "time": "11-08-2015 11:15 PM", "replies": []}, {"postID": "post4814541", "text": "What kind of wallpapers do you have? A lot?", "time": "11-08-2015 11:27 PM", "replies": []}, {"postID": "post4814751", "text": "I usually find a cool design i like on Zedge or google search and then photo edit it with my name or badge number or something and use it. That way my wallpapers are unique.\nMoto Droid Turbo 2", "time": "11-09-2015 03:08 AM", "replies": [{"postID": "post4833422", "text": "I found it here... \"Heard about Walloid ?\"\nIt's an awesome app based on Google's Material UI comprising of Stock ROM wallpapers, Custom ROM wallpapers and Material Design wallpapers(All wallpapers in HD).\nIt's available for free on Google Play Store or download directly from https://play.google.com/store/apps/d...shcode.walloid\nPosted via the Android Central App", "time": "11-15-2015 02:15 PM", "replies": []}]}, {"postID": "post4842393", "text": "I downloaded walloid and still couldn't find it.\nPosted via the Android Central App", "time": "11-19-2015 05:56 AM", "replies": []}]}, {"title": "Anyone choosing the maxx 2 over the turbo 2", "thread": [{"postID": "post4793816", "text": "as the title asks, anyoen picking the maxx two over the turbo 2? what made you opt for the maxx instead? I am currently deciding between these two phones..", "time": "11-01-2015 08:50 AM", "replies": []}, {"postID": "post4794826", "text": "I might- I am still rockin' my Droid RAZR M and I really ready to upgrade. I like the Turbo and the Turbo 2 but I don't see me investing that much money in the T2.\nThis leads me between the Maxx 2 and the original Turbo...", "time": "11-01-2015 05:04 PM", "replies": [{"postID": "post4802013", "text": "I added a line and used the edge program.. Took an old Samsung galaxy s as trade on the promo deal, so i am actually only paying 324 for the turbo 2.. Which is a steal and makes buying it easier lol.\nYou will be happy with either im sure, but i wanted the shattershield.\nMoto Droid Turbo 2", "time": "11-04-2015 07:20 AM", "replies": [{"postID": "post4802876", "text": "How are you only paying $324? I thought it was $16 a month times 24 months is $384. Do you have to put something down?\nEDIT: Nevermind. I missed where you said you traded in an old Samsung. How do you delete these things? lol.", "time": "11-04-2015 12:23 PM", "replies": []}]}]}, {"postID": "post4795863", "text": "When i went to the verizon store on release day to get the turbo2 my oldest daughter (22) went w me. \nShe had started having issues withe the screen on here droid maxx. They let her do the edge program and she picked the Maxx 2. The main reason was the price difference between it and the turbo2. So far she loves it. Her only smartphones have been the razr maxx, the droid maxx and now the maxx2.\nMoto Droid Turbo 2", "time": "11-02-2015 05:04 AM", "replies": []}, {"postID": "post4799223", "text": "How do you like your turbo? How is battery on it? I might go get one tonight", "time": "11-03-2015 08:19 AM", "replies": []}, {"postID": "post4802010", "text": "Battery is great so far. On par w the T1. Dont expect 48hrs if you spend a lot of time on it, but it makes it through a long day easy. \nThe maxx2 should actually get better battery life than the turbo 2 since the screen is 1080, also the maxx2 has a setting if you want standard screen or vibrant like the samsungs do.\nMy daughter loves her maxx2 so far, she came from the droid maxx and she said it is much better even tho the size is taking getting used too.\nMoto Droid Turbo 2", "time": "11-04-2015 07:17 AM", "replies": []}, {"postID": "post4805468", "text": "On the edge program you pay the tax of the full amount up front. \nBack to the maxx2, so far my daughter is still happy w it. Today makes the week mark and no issues and battery is lasting all day easy. I don't have any stats for you, but she is pleased it.\nMoto Droid Turbo 2", "time": "11-05-2015 10:08 AM", "replies": []}, {"postID": "post4806581", "text": "Cool. I think I could do ok without shatterscreen, for all the savings i would get. I am usually pretty good with my devices and always get a case. Thanks for the input from someone who has them in the wild.", "time": "11-05-2015 04:28 PM", "replies": []}, {"postID": "post4807607", "text": "No problem. I have always always been careful w my phones so i probably could have done w out it, but since i was going to be using the promo and it dropped the price as low as it did, i wanted the premium of the two.\nI know me lol, and i would have been wishing i got the turbo2 if i hadn't lol.\nPosted via the Android Central App", "time": "11-06-2015 12:56 AM", "replies": []}]}, {"title": "Various DROID MAXX 2 Reviews", "thread": [{"postID": "post4804660", "text": "Various DROID MAXX 2 Reviews\nPhoneArena: http://www.phonearena.com/reviews/Mo...-Review_id4126 \nSome notes:\n- Blue-ish screen, but one of the brightest screens PhoneArena has ever tested\n- Lots of carrier bloatware including Verizon apps and select games\n- Ample performance for basic tasks\n- Camera is a noticeable improvement over previous generations but may be more saturated than pictures from the DROID TURBO 2\n- Audio from recorded video a bit hissy\n- Audio output as loud as the DROID TURBO 2\n- Noticeable crackly tone with audio calls\n- Real-word day-to-day use should get you two full days", "time": "11-04-2015 11:59 PM", "replies": []}, {"postID": "post4805998", "text": "PocketNow:24 hours with the Droid Maxx 2 | Pocketnow", "time": "11-05-2015 12:57 PM", "replies": []}]}, {"title": "How do I do talk to text on my Droid Maxx 2?", "thread": [{"postID": "post4793994", "text": "how do i do that?", "time": "11-01-2015 10:07 AM", "replies": []}, {"postID": "post4795772", "text": "Hi, do you have the Moto Assist app?", "time": "11-02-2015 03:04 AM", "replies": []}]}, {"title": "How do I connect to my Motorola Bluetooth (new Maxx 2 to older model bluetooth)?", "thread": [{"postID": "post4794044", "text": "cant get maxx 2 to recognise blue tooth", "time": "11-01-2015 10:30 AM", "replies": []}]}, {"title": "Moto X Play Case/Screen Protector Compatability", "thread": [{"postID": "post4788594", "text": "Can anyone confirm if the cases/screen protectors/replacement rear inserts will work for the Moto Maxx 2 on Verizon?", "time": "10-30-2015 08:02 AM", "replies": []}]}]
[{"title": "DROID MAXX 2 Specs", "thread": [{"postID": "post4778156", "text": "What do you guys think? Will it outlast the Moto X Play?\nSpecs from the blog: Motorola Droid Maxx 2 specs | Android Central", "time": "10-27-2015 11:06 AM", "replies": []}, {"postID": "post4778255", "text": "What is the difference between those two? Leaving the built quality both are totally same. Is there any other difference?\nPosted via moto x play", "time": "10-27-2015 11:22 AM", "replies": []}, {"postID": "post4778296", "text": "It looks like a Verizon branded Moto X Play. I'll dig deeper in the specs but so far I couldn't find many differences.", "time": "10-27-2015 11:29 AM", "replies": [{"postID": "post4779270", "text": "+ Verizon bloatware. Which is understandable since it's a Verizon DROID phone.", "time": "10-27-2015 02:18 PM", "replies": [{"postID": "post4779601", "text": "Yep. Different radios and bloatware.", "time": "10-27-2015 03:18 PM", "replies": [{"postID": "post4779627", "text": "I kinda wish there were all-US carrier \"Pure Edition\" versions of the third gen Moto G and Moto X Play.", "time": "10-27-2015 03:21 PM", "replies": []}]}]}]}, {"postID": "post4778318", "text": "New Moto page...DROID Maxx 2 | Motorola\nOperating System\nAndroid 5.1.1, Lollipop\nSystem Architecture/Processor\nMotorola Mobile Computing System including 1.7GHz Qualcomm® Snapdragon™ 615 Octa-core CPU, Adreno 405 @ 550 MHz GPU, Natural Language Processor, Contextual Computing Processor\nMemory (RAM)\n2GB\nStorage\n16GB6, MicroSD Card support (up to 128GB)4\nDimensions\nHeight: 148.0mm (5.8 inches)\nWidth: 75.0mm (2.9 inches)\nCurve: 8.9-10.9mm (0.35- 0.43 inches)\nWeight\n169 grams (5.96oz)\nDisplay\n5.5” 1080p Full HD, 403 ppi, Corning® Gorilla® Glass 3\nBattery\n3630 mAh\nMixed usage up to 48 hours1\nWater Repellent\nYes5\nNetworks\nGSM/GPRS/EDGE, UMTS/HSPA+, 4G LTE\nBands (by model)\nXT1565: VZW\nGSM/GPRS/EDGE (850, 900, 1800, 1900 MHz)\nUMTS/HSPA+ (850, 900, 1900, 2100 MHz)\nCDMA (850, 1900 MHz)\n4G LTE (2, 3, 4, 5, 7, 13, 20)\nSIM Card\nNano-SIM\nRear Camera\n21 MP\nf/2.0 aperture\nClosed loop processing\nPhase Detect Auto-Focus (PDAF)\nColor Correlated Temperature (CCT) flash with dual LEDs\nQuick Capture\nTap (anywhere) to capture\n4X digital zoom\nBurst mode\nNight mode\nAuto HDR\nPanorama\nDrag to focus & exposure\nVideo Stabilization\n1080p HD video (30fps)\nSlow motion video\nFront Camera\n5 MP\nConnectivity\nMicro USB, 3.5mm headset jack\nBluetooth® Technology\nBluetooth version 4.0 LE\nWi-Fi\n802.11a/g/b/n (dual band capable)\nSpeaker\nFront-ported\nVideo Capture\n1080p HD, 30fps (MPEG4, H.264)\nNFC\nYes\nLocation Services\nGPS\nBase Models\nBlack with Deep Sea Blue Back\nWhite with Winter White Back\nAvailability varies by market", "time": "10-27-2015 11:32 AM", "replies": []}, {"postID": "post4779256", "text": "Looks to me like the maxx 2 will not have the shatterproof tech, only the turbo2. Also the processors are diff.\nYou are going to pay more for the sd810 and shatterproof technology\nSent with my white Note5 with nonremovable back and no SDcard!", "time": "10-27-2015 02:16 PM", "replies": [{"postID": "post4779267", "text": "Which is $200 to $300 more.", "time": "10-27-2015 02:18 PM", "replies": []}]}, {"postID": "post4780091", "text": "I have the Brazilian Moto X Play and today my wife ordered the Moto G with 2gb from Moto Maker. I know exactly what you mean", "time": "10-27-2015 05:06 PM", "replies": []}, {"postID": "post4784178", "text": "Just to be clear- No qi charging and some sensors are missing, correct?", "time": "10-28-2015 07:03 PM", "replies": []}, {"postID": "post4784257", "text": "No qi charging, just turbo charging. What sensors do you mean?", "time": "10-28-2015 07:31 PM", "replies": [{"postID": "post4784312", "text": "I believe I read somewhere that you won't be able to take advantage of some of the moto actions (i.e chop motion, wave to wake)", "time": "10-28-2015 07:53 PM", "replies": []}]}, {"postID": "post4784333", "text": "In the X Play the only Moto action available is the double twist to open the camera, so I imagine it will be the same. Moto Display works fine. It includes interactive notifications and the wake up feature.", "time": "10-28-2015 07:59 PM", "replies": []}, {"postID": "post4784948", "text": "will it be able to use the same accessories as the Moto X Play? \n(such as cases, screen protectors, back covers)\nthanks!", "time": "10-29-2015 01:14 AM", "replies": [{"postID": "post4785397", "text": "Most likely, but those phones are sold in different markets and I don't think both will be available in the same country. The Maxx 2 is a Verizon branded device just for the States.", "time": "10-29-2015 07:31 AM", "replies": []}]}]}, {"title": "DROID MAXX 2 ships with TurboPower 25?", "thread": [{"postID": "post4781023", "text": "Looks like the charger is one piece (no separate USB cable). I'm assuming it's the 25W TurboPower Charger.", "time": "10-27-2015 09:38 PM", "replies": []}, {"postID": "post4781027", "text": "Sounds like they're doing what they did for the Moto X Pure Edition .", "time": "10-27-2015 09:40 PM", "replies": []}]}, {"title": "Android Central's Hands-On with the DROID MAXX 2", "thread": [{"postID": "post4779424", "text": "Hands-on with the Motorola Droid Maxx 2 | Android Central", "time": "10-27-2015 02:48 PM", "replies": []}]}, {"title": "Style/Droid Turbo 2 on Verizon?", "thread": [{"postID": "post4630913", "text": "Couple of tech websites have reported that although Verizon won't carry the Pure/Style, they will have the Droid Turbo 2, probably Verizon branded with some bloat. Might have wireless charging and a plastic OLED screen that is supposed to be unbreakable. Price around $600. Same hardware inside as the Pure, maybe!!", "time": "08-24-2015 03:55 AM", "replies": []}, {"postID": "post4630924", "text": "Pure all the way as it will be free from Verizon bloat and have a far better chance at having an unlockable bootloader! \nG4'ed it!", "time": "08-24-2015 04:05 AM", "replies": []}, {"postID": "post4630966", "text": "Since I have to pay full price to keep my UDP, this has little relevance to me. Why would I pay more money for a bloated up, possibly carrier-restricted phone? \nI am very likely to get an XPE at launch or very soon there after. As of now, only decision is whether I can walk-in to Best Buy and get a 32 GB model on release day or if I have to order larger than 16 GB from Motorola.", "time": "08-24-2015 05:14 AM", "replies": []}, {"postID": "post4630968", "text": "Best Buy doesn't have a stellar record for having quantity phones of any kind on a launch day. If you can do a pre-order from Moto you would probably have a better chance of having it on launch day.", "time": "08-24-2015 05:18 AM", "replies": []}, {"postID": "post4631290", "text": "If this is true, then I don't understand Verizon's reasoning behind the $600 price tag. Do they really think an OLED screen, wireless charging, and \"value-added software\" is worth such a massive price increase?", "time": "08-24-2015 08:44 AM", "replies": []}, {"postID": "post4631328", "text": "With the new pricing plans from Verizon I'm never purchasing a phone through them ever again if I can avoid it. I'll just get the Pure phone that's bloat free.", "time": "08-24-2015 09:05 AM", "replies": []}, {"postID": "post4631367", "text": "My guesses (since the specs haven't been announced) on how it'll be souped up over the Style/Pure Edition....\n- Snapdragon 820 (versus the 808 in Style/PE)\n- Wireless Charging (not present in Style/PE)\n- new screen (as mentioned by the OP and the tech articles)\n- USB-C charging port (yes... this would be awesome)\n- BIG BATTERY (possibly 3800mah+ like the 1st Turbo versus the 3000mah in the Style/PE)\nOther than the possibility of USB-C, most everything above is similar to how the Turbo differentiated itself from the Moto X 2014. I think if they get most of these enhancements into the phone, it will more than justify the higher price tag. Bloat doesn't bother me, it can be disabled. It should have the same Moto software on top of v5.1 or v6 that the Style/PE will have.", "time": "08-24-2015 09:21 AM", "replies": [{"postID": "post4631496", "text": "A new turbo is likely due out before Christmas. No 820 before 2016.\nVerizon doesn't need to differentiate the Turbo 2 from the Pure Edition because they wont have the pure edition on their shelves and 99% of the people walking through the door never will hear of it.\nI would guess is the Turbo 2 will be a moto X pure edition with wireless charging, a slightly larger battery, and verizon branding. No usb c, still an 808 (maybe an 810).", "time": "08-24-2015 10:21 AM", "replies": []}]}, {"postID": "post4631369", "text": "I don't think any carrier in the US will be carrying the Motorola Moto X Style aka Moto X Pure Edition.\nPosted via Android Central App (Moto X)", "time": "08-24-2015 09:23 AM", "replies": []}, {"postID": "post4632402", "text": "what does everyone think about the POLED vs OLED vs LED screens ? I have never heard of a plastic screen before", "time": "08-24-2015 04:18 PM", "replies": [{"postID": "post4634748", "text": "Heard the Turbo 2 can survive a 2m fall.", "time": "08-25-2015 07:37 AM", "replies": [{"postID": "post4635083", "text": "I'm confused about the concept of a POLED. I assumed that this screen tech has nothing to do with the glass that sits on top of it, which is the most common thing to break in a fall. So you're saying the POLED comes with a plastic layer above the screen that serves to replace the glass?", "time": "08-25-2015 09:36 AM", "replies": [{"postID": "post4635556", "text": "No idea, sorry. Your thoughts were mine as well, but I'm just relaying what I heard.", "time": "08-25-2015 12:10 PM", "replies": []}]}]}]}, {"postID": "post4632873", "text": "Can careless about AMOLED or wireless charging. I'd rather have a stock Android (according to motorola) then a VZW bloated OS. Plus I'm sure VZW will have to approve OS and put their spin on it and ruin it. Also the Pure will most likely get more developer support for rooting and such.", "time": "08-24-2015 05:38 PM", "replies": []}, {"postID": "post4634176", "text": "As long Verizon allows the as the X style on their network there's no compelling reason IMO to wait for a much more expensive turbo 2", "time": "08-25-2015 12:18 AM", "replies": [{"postID": "post4634610", "text": "These early articles claim VZW will sell the Maxx2 for $300. Of course how they know this is anyone's guess. If it's accurate though, I think that's a decent price for additional wireless charging. Of course you're giving up the whole motomaker thing and you'll have to spend all of 2 minutes disabling the 'bloat'.", "time": "08-25-2015 06:25 AM", "replies": [{"postID": "post4634979", "text": "They're claiming that because the Moto X Play is supposed to be $300.\nPosted via Android Central App (Moto X)", "time": "08-25-2015 09:04 AM", "replies": []}, {"postID": "post4643325", "text": "no doubt $300 is a great price if true, and the bigger battery is a huge plus. still have no clue why the pure didn't come with the same 3600 ... it's nice to be able to disable some of the bloat, but not everything can be disabled so it's far from stock. if it could be uninstalled that's be a different story. plus there's the whole carrier branding thing, not having MotoMaker and timely updates.", "time": "08-28-2015 01:05 AM", "replies": []}]}]}, {"postID": "post4634661", "text": "I think the biggest issue that gives me pause with going the droid route is the issue of timely updates. The bloat thing is way overblown now that it can be easily disabled. I'd love a hybrid of the pure and play. Play battery, play size screen, but pure resolution and processor. I don't care about wireless charging but some do. Getting quick updates and being able to customize are strong points of going through Motorola.", "time": "08-25-2015 06:48 AM", "replies": []}, {"postID": "post4641704", "text": "Turbo has 3900 MAh battery and every flagship Droid in the last 3 years has come with a bigger battery. \nThat means at the very minimum the battery needs to be 4000 mAh but since the screen is being bumped by. 5 inches 4500 would be a better size.", "time": "08-27-2015 12:19 PM", "replies": []}, {"postID": "post4641780", "text": "Agreed. Why am I reading that the Droid Turbo 2 may have a 3000 mah battery? That would be a horrible step back for what has been best in class in battery.", "time": "08-27-2015 12:45 PM", "replies": [{"postID": "post4643317", "text": "where'd you read that? everything I've seen has been at least 3600", "time": "08-28-2015 12:59 AM", "replies": [{"postID": "post4643878", "text": "I forgot, but I heard the 3600 is for the Droid Maxx 2, which will be the US version of the Moto Play. Since the Turbo 2 will be based off the Style, the speculation is that it will have a 3000 mah battery just like the Style.", "time": "08-28-2015 08:51 AM", "replies": [{"postID": "post4645275", "text": "that would be a huge dropoff ... I never understood the whole US version thing. I mean, I get it but the phones are so drastically different I really don't think there's a comparison. anyone interested in the Pure, similar to Nexus, is typically a lot more interested in having a bloat free, non carrier branded, unlocked phone running (near) stock with timely updates. take that away and it's just not even close to the same phone.", "time": "08-28-2015 08:10 PM", "replies": []}]}]}]}]}, {"title": "Verizon: Moto X Play possibly the \"DROID MAXX 2\"", "thread": [{"postID": "post4636495", "text": "Verizon's DROID MAXX 2 may be a US version of the Moto X Play | Android Central", "time": "08-25-2015 05:27 PM", "replies": []}]}]
