[{"title": "Just purchased Motoe4plus. bluetooth will not stay off. I turn it off but a few seconds later it's b", "thread": [{"postID": "post6195585", "text": "I have turned it off in settings and on dropdown notification but still comes back on.", "time": "03-19-2018 11:09 AM", "replies": []}, {"postID": "post6195870", "text": "Welcome to the forums. That's strange, have you already checked if the same problem persists after booting in safe mode?", "time": "03-19-2018 03:21 PM", "replies": []}]}, {"title": "Can't figure out how to answer the phone! Nothing to press. Moto E4", "thread": [{"postID": "post6194413", "text": "Okay, so just this week my husband and I bought our first-ever smartphones, the budget Moto E4. Seems like the highest of technology compared to our old LG Tracfones.\nBut here's the thing: I've set up my phone and it seems to work fine (although I don't find that the fingerprint idea is very secure--rarely asked for it), but I don't know if I did something wrong with my husband's phone or if there's a problem with it.\nTesting by calling from our home phone, my phone will show a black screen with a phone symbol in the center and white dots radiating outward. Swipe right to answer, left to reject. (THAT took a while to figure out!) But with my husband's phone, when I call it, it rings but the home page stays as is and there's nothing I can press to answer it. No phone symbol anywhere. Even when I click the green phone which is what you hit to make a call. It brings me to my contacts but still doesn't show any way to answer the phone.\nWe did get Geek Squad protection. Should I just call them or does anywhere here have an idea?\nThanks!", "time": "03-17-2018 11:43 AM", "replies": []}, {"postID": "post6194537", "text": "When your husband's phone rings, does anything appear in the status bar at the top? While it's ringing, swipe down from the top of the screen and look at the notification panel -- anything there?", "time": "03-17-2018 01:46 PM", "replies": []}, {"postID": "post6194584", "text": "Been trying to answer you, B. Diddy for the longest time. Finally had to log out and log back in to get this reply box.\nAt any rate, I finally chatted with Motorola support and this was the simple solution:\nSettings. > App > 3 dots > reset app prefereces > reset apps\nThat did it!\nWhile I've got you (and we love Crow, btw, we're in the middle of watching a Japanese one), do you know if it's a bad thing to turn off notifications for all apps? A friend of mine said that those notifications eat up your battery and that I should turn them all off. I was able to do it for my phone in one fell swoop, but can't remember how I did it and can't do it for my husband's phone.", "time": "03-17-2018 02:45 PM", "replies": []}, {"postID": "post6194706", "text": "Glad you figured it out! It's a little odd that you had to reset app preferences -- that suggests that some other app became the default to answer calls, but this would mean that your husband installed some 3rd party phone dialer app at some point.\nI'd keep your notifications on. The amount of power the notifications use is pretty minimal. However, what can contribute to battery use would be certain apps that give you the option to constantly refresh data in the background -- for those apps, look in their options and change the refresh interval to something longer, so that it's not frequently waking the phone in order to refresh.\nAlways nice to hear from another MST3K fan! It was an earth-shattering event when the show recently came back on Netflix -- it's riffing heaven!", "time": "03-17-2018 04:45 PM", "replies": []}]}, {"title": "Can't convert .Avi to play on Moto e4", "thread": [{"postID": "post6192179", "text": "Hi. I desperately need help. I have .avi video I've uploaded to my PC, that I'd like to view on my phone and share with friends. I have tried converter after converter but, when I'm told the file has been converted to mp4, I can't find it on my phone. It seems to be there on the PC. (For what it's worth, we don't have Internet on our PC because all we can get is dialup out here in the sticks. I mention this because some of the converters seemed to need an Internet link.) What am I doing wrong? Can anyone help?", "time": "03-15-2018 03:03 PM", "replies": []}, {"postID": "post6193514", "text": "MP4 is an envelope, not the video format, just so you're aware. (It has nothing to do with your problem.)\nGo somewhere that you can get wifi (a restaurant, any public wifi) and install VLC for Android. It should be able to play anything.", "time": "03-16-2018 04:07 PM", "replies": []}]}, {"title": "Motorola E4 Plus call problem", "thread": [{"postID": "post6137234", "text": "During a call, the screen turns off when near my face however if the screen touches my face inputs still happen so it ends calls despite the screen being off. Is there a fix for this or is it a return the phone job? Thanks in advance.", "time": "01-15-2018 06:10 PM", "replies": []}, {"postID": "post6137281", "text": "Welcome to Android Central! When you make a call, hold your finger or hand over the proximity sensor (right near the front-facing camera) -- does the screen turn completely black, or can you see the screen faintly?\nDoes this also happen in Safe Mode? Using Safe Mode on the Moto E (4th Gen Plus)", "time": "01-15-2018 06:53 PM", "replies": [{"postID": "post6176136", "text": "I'm really sorry - I didn't know this reply came through and I forgot my login details...\nThe screen goes completely black. I've booted into Safe Mode, done factory resets etc but it remains a problem. Its a pain because it mutes my mic or ends the call and I have no idea it's happening as the phone screen is black.\nThanks for your help and sorry its been so long!", "time": "03-01-2018 05:25 PM", "replies": []}]}, {"postID": "post6176410", "text": "Ok, try this then -- cover the proximity sensor with your hand or finger while on a call, then try tapping the screen at random -- does it register button presses even with the screen completely black?", "time": "03-01-2018 11:49 PM", "replies": []}]}, {"title": "How do I get control of my phone that's been hacked? I've already tried Factory Reset", "thread": [{"postID": "post6154597", "text": "A sophisticated hacker appears to be stalking me.\nIt started a few months ago and when I asked him why he would never reply.\nHe didn't ask for money as the first thing he did was upload all the data on my computer.\nThen he just seemed to use it as a practice tool, making bespoke drivers and firmware.\nEven with the hdd removed and using Ubuntu live cd he was still there.\nThe same thing happened with two phones that were never rooted. All my email and personal accounts were comprimised. Even after a factory reset it made no difference, he had complete control.\nPhones are too personal so I threw them out.\nI bought bew equipment and everything seemed alright. I removed the WiFi and Bluetooth adapter, disabled them on the phone but suddenly he's returned and I don't know how to prevent it.\nI have anti virus and Malwarebytes. Screen lock and sim lock.\nBut he deleted all my apps that took ages to set up.\nIs there anything I can do or is he just an elite hacker who unfortunately has chosen me as his plaything.\nI can't afford Apple but I need a phone, I can't communicate without it.\nPlease tell me there is something I can do.\nThanks for taking the time to read this far.", "time": "02-04-2018 09:52 PM", "replies": []}, {"postID": "post6154613", "text": "Something isn't adding up here. If a hacker got ahold of your passwords, then I can see him keeping control of some things that are cloud based like email.\nBut to control a computer running only from a CD and no form of writeable storage? That seems way too far fetched to be plausible. Even if one got into your memory, that's erased with every reboot, and there's nothing to be stored.\nDo you actually have contact with him? How did you attempt to ask why he targeted you?\nI kind of doubt you've been hacked, at least to the extent you've described. But just in case, you need to change all of your passwords and setup two factor authentication where possible. If you went so far as to replace your devices and he came back, then a possible hacker must be getting in by using your login info.\nAnother possibility is if you're installing sketchy apps from underground sources. They could be hacked versions of legit apps designed to hack into your devices while you think you're getting free access to paid software (piracy).", "time": "02-04-2018 10:45 PM", "replies": []}, {"postID": "post6154851", "text": "Close your curtains. Call the FBI.", "time": "02-05-2018 08:27 AM", "replies": []}, {"postID": "post6162930", "text": "Not funny something similar is happening to me 64", "time": "02-14-2018 11:48 PM", "replies": []}, {"postID": "post6162936", "text": "I am hoping to get some help from someone more techy than I, I have been hacked recently they got in through my sonata3 set up as a security cam with warden cam/pickett, he also used a keyboard logger I have set up a new email and hope to import messages however i wanted to back up my phone before I factory reset. this clown has made my life miserable. I had to factory reset my tablet and now I do not want to resttart it till I get everything transferred to my new account. I set up this account on different PC, he is able to bypass 2 step verification and keeps changing my passwords, he changed my screen locks on my tablet and phone I was able to figure out the [phone. can he trace me to my new email when i import my messages?", "time": "02-14-2018 11:55 PM", "replies": []}]}, {"title": "How to unlock Verizon Prepaid E4 for normal Verizon service", "thread": [{"postID": "post6145594", "text": "I've got a brand new Moto E4 for Verizon Prepaid. I've bought and received an unlock code for it. I want to use it on my normal Verizon account. The instructions I see online for putting in the unlock code involve putting in a SIM for another carrier (ATT/T-Mobile,etc), and on boot-up it'll give the menu for the code. I put in my regular Verizon SIM, and it doesn't give that menu.\nHow do I put in my unlock code? Am I going to have to borrow someone's non-Verizon SIM?", "time": "01-25-2018 11:51 AM", "replies": []}, {"postID": "post6145599", "text": "Nevermind, found it under Settings>Wireless & networks", "time": "01-25-2018 11:57 AM", "replies": []}, {"postID": "post6145603", "text": "Well crap, it said code accepted, but it's not working properly. Anytime I try to call someone, Verizon's automated system answers.", "time": "01-25-2018 12:03 PM", "replies": [{"postID": "post6148832", "text": "Did you get this working? I finally got one.", "time": "01-29-2018 01:12 PM", "replies": []}]}, {"postID": "post6148840", "text": "Nope, I'm using it as a WiFi only phone with Google Hangout dialer + Google voice, and ordered my wife an unlocked one directly from Motorola", "time": "01-29-2018 01:16 PM", "replies": []}, {"postID": "post6162153", "text": "I think you need to use it on Verizon Prepaid before using it on Verizon Postpaid.\nI'm surprised your line didn't get hotlined.", "time": "02-13-2018 11:58 PM", "replies": []}]}, {"title": "Unlock code", "thread": [{"postID": "post6154850", "text": "I have unlocked my Moto e4 plus.... I'm not getting the unlock code using cmd...can u plz help?", "time": "02-05-2018 08:24 AM", "replies": []}, {"postID": "post6154859", "text": "That's a question for your service carrier.", "time": "02-05-2018 08:41 AM", "replies": []}]}, {"title": "Moto E4 Microphone Not Working", "thread": [{"postID": "post6144298", "text": "So, for the past two months the people I called complained of my voice getting faint when I place a call on my Moto E4 (Just the regular Qualcom version, not the plus edition). They would ask me to speak up even though I was. Than last night, my phone locked up wouldn't boot. I fixed that. But when I made a call, the person on the other end picked up and said hi. I replied back, nothing. I asked can you hear me. I disconnected the call and checked my LTE signal, full bars. Than, in a meeting, I wanted to use my phone to record the meeting. I open up my recording app, and hit the record button. Nothing, when I played back the recording, it was a half hour a garble.\nThe first thing I did was clean out the mic ports with compressed air. Nothing! No one could hear me. I than decided to factory reset, and once again, no microphone audio. I'm becoming annoyed. Any way, you guys have fixed this, or should I just RMA it.", "time": "01-23-2018 10:27 PM", "replies": []}, {"postID": "post6144316", "text": "Welcome to Android Central! Can people hear you if you're on speakerphone, or use a wired or Bluetooth headset?", "time": "01-23-2018 10:53 PM", "replies": []}, {"postID": "post6149212", "text": "if i use a headset people can hear me, just not with the built in mic", "time": "01-29-2018 08:35 PM", "replies": []}, {"postID": "post6149397", "text": "One more thing I'd do is boot into Safe Mode and see if the problem persists: https://motorola-global-portal.custh.../30,6720,10216. If it does, then it's a hardware problem -- contact Lenovo if it's still under warranty, or take it to a repair shop.", "time": "01-30-2018 01:46 AM", "replies": []}]}, {"title": "Unlocked vs Locked+unlock code, unlocking Boost Mobile version", "thread": [{"postID": "post6143864", "text": "Couple questions:\n- what's going to be the difference in the user experience of having a factory unlocked E4 vs a prepaid E4 unlocked with a code? I assume the prepaid ones tend to come with carrier apps. Issues with updates? Any other issues?\n- Are there unlock codes available for the Boost Mobile version of the E4?", "time": "01-23-2018 11:59 AM", "replies": []}, {"postID": "post6143878", "text": "Correct on the first point. Locked versions are carrier-branded, which means they'll have their carrier modifications added to them. Also, updates will have to go through them first, so you might not get an update that's released for the factory-unlocked E4 until later, or depending on how lazy the carrier is, ever at all. In some cases, though, carriers do release the updates before (it's been the case with a couple Samsung phones and T-Mobile).", "time": "01-23-2018 12:10 PM", "replies": []}, {"postID": "post6143883", "text": "Safe to assume that unlocking with a code doesn't mess with it getting updates?", "time": "01-23-2018 12:12 PM", "replies": []}, {"postID": "post6143884", "text": "Nope, you'd still get any carrier-released updates... IF they don't lock them to using their SIMs. Not sure about Boost Mobile phones, but some AT&T phones will not update unless you have an AT&T SIM in it, even if they've been unlocked.", "time": "01-23-2018 12:13 PM", "replies": []}, {"postID": "post6145994", "text": "Any way to get a Verizon prepaid phone that's unlocked to work with Verizon non-prepaid service, without having to pay for prepaid service? Seems like since it's on Verizon, they know it was a prepaid device, and aren't letting it work even though it's unlocked.", "time": "01-25-2018 08:27 PM", "replies": []}, {"postID": "post6146735", "text": "VZW's prepaid phones don't work on postpaid until whatever time/prepaid service money is fulfilled. That figure is generally on the back of the phone box.", "time": "01-26-2018 04:55 PM", "replies": [{"postID": "post6148833", "text": "That's simply not true. I bought one....loaded 30 day service on it.......immediately called and had it switched to a postpaid line. Took about an hour. \nVerizon will tell you that. But it's not correct.", "time": "01-29-2018 01:14 PM", "replies": []}]}]}, {"title": "Pixel 2 owner perspective", "thread": [{"postID": "post6098906", "text": "I recently picked up a Black Friday'ed unlocked E4 Plus to serve as a backup for my Pixel 2. I wanted a cheap but competent device that I could use to Strava mountain bike rides or take into the backcountry as an emergency device and navigation aid. The E4 Plus with its low price, decent specs and gigantic 5,000 mAh battery was the perfect device for this. I don't have to worry about trashing my expensive P2 in a crash or extended water exposure (I don't want to test the IP67 rating of the P2).\nOk, it's a little sluggish next to my Pixel 2 but it's still very usable and stable. In fact, I'm putting in more screen time on my E4+ than my Pixel 2 when I'm at home on WiFi.\nThe only bummer about the E4+ is that I have to remove the back cover to swap SIMs between phones. It's a clumsy operation at best for me.", "time": "12-07-2017 09:37 AM", "replies": [{"postID": "post6118756", "text": "I have both of these phones as well. While the Pixel 2 is obviously a lot snappier, the Moto E4 Plus is pretty fast for a 425. And that battery life is unreal.", "time": "12-26-2017 06:35 PM", "replies": [{"postID": "post6120626", "text": "I'd like to see some brave manufacturer take a \"form follows function\" approach to their next flagship and stuff a slightly larger, user-replaceable battery in there.\nI'll take a \"cheap\" feeling flagship with this feature over a slick, svelte unibody design that's doomed to be replaced in 1.5-2 years because its battery will no longer hold an all-day charge.", "time": "12-28-2017 03:05 PM", "replies": [{"postID": "post6120733", "text": "I'd love to see a phone with modern specs in the body of a LG G2 (with a fingerprint scanner).", "time": "12-28-2017 05:30 PM", "replies": []}, {"postID": "post6133965", "text": "This.", "time": "01-11-2018 08:42 PM", "replies": []}]}]}]}, {"postID": "post6133964", "text": "This. ^", "time": "01-11-2018 08:41 PM", "replies": []}]}, {"title": "Os the moto e4 rootable?", "thread": [{"postID": "post6123182", "text": "Is it rootable", "time": "12-31-2017 10:13 AM", "replies": []}, {"postID": "post6123418", "text": "Apparently not:https://mobilesupport.lenovo.com/us/en/solution/MS87215", "time": "12-31-2017 04:03 PM", "replies": []}, {"postID": "post6129527", "text": "It depends. If your version of the E4 has an unlockable bootloader, yes. (See the XDA site for much more.)\nIf your E4 does not have an unlockable bootloader (i.e. the Verizon prepaid variant), no.", "time": "01-07-2018 12:40 PM", "replies": []}, {"postID": "post6132099", "text": "or if Motorola allows the bootloader to be unlocked, been trying to no avail. they tell me the device isn't on the bootloader list", "time": "01-10-2018 05:50 AM", "replies": []}]}, {"title": "Formatting Memory Card As Internal Storage", "thread": [{"postID": "post6129224", "text": "I learned I can format my memory card as internal storage on my Moto e4 for Verizon. However, when I did that, I could no longer see the memory card on my computer when I connected it to the phone using a USB cable. If I want to swap files between the memory card and my computer using the USB cable, should the memory card show up in Windows Explorer? If no, how can I swap files between the two? Would I need to drag and drop files from my computer on to my phone's internal memory, then on my phone transfer those files from the internal memory to the memory card? Is this something I could also do via Bluetooth?\nThank you.", "time": "01-07-2018 03:28 AM", "replies": []}, {"postID": "post6129525", "text": "That's adoptable storage, which basically means that the card storage becomes part of the phone's memory - not a separate card.\nThat would mean that you would move files just like you move other files that are part of the phone's internal storage, if I understand the concept right. (I have never used adoptable storage...the card in my E4 is not formatted that way.)", "time": "01-07-2018 12:37 PM", "replies": []}]}, {"title": "434", "thread": [{"postID": "post6129227", "text": "Nomefc", "time": "01-07-2018 03:50 AM", "replies": []}]}, {"title": "E4 Plus issue/need help", "thread": [{"postID": "post6122535", "text": "Anyone know why this would happen? On a restart from completely off it goes to the screen to select recovery/tools/clear cache. It's the first screen with the Android mascot on its side and door open to inside. \nMaybe I'm not describing it correctly. But I'm sure you know what screen I'm describing. \nHave no other problems with the phone, it works great! It's a family members phone. Don't know how long it's been doing it or why.", "time": "12-30-2017 02:33 PM", "replies": []}, {"postID": "post6123874", "text": "Is it able to then select a normal startup & start correctly?", "time": "01-01-2018 10:31 AM", "replies": [{"postID": "post6124116", "text": "Yes it will start normally. But if it's shut down it goes to that everytime. My worry is my father in-law is not technologically proficient and I can almost guarantee he will choose the wrong selection one day and then I'm driving 50 miles to restart his phone. Not an over exaggeration, I've had to do it.", "time": "01-01-2018 02:43 PM", "replies": [{"postID": "post6126318", "text": "Bump...... Hoping to get a few ideas on this.", "time": "01-03-2018 11:30 PM", "replies": []}]}]}]}, {"title": "Change Round Icons back to NORMAL??", "thread": [{"postID": "post6076970", "text": "So ever since I bought my Moto E4, looking at those ROUND icons are absolutely driving me nuts! Is there a way to get rid of those icon frames and use the regular default icons? Please say that there is! Thank you!", "time": "11-19-2017 01:18 PM", "replies": []}, {"postID": "post6078119", "text": "Can you show us a screenshot of what you mean? http://forums.androidcentral.com/gen...d-central.html. Moto's skin is typically pretty light, and the UI ought to look pretty close to \"stock\" Android -- so the icons should be Material Design.", "time": "11-20-2017 11:03 AM", "replies": [{"postID": "post6080683", "text": "So look at all the ugly round icons (play store & Google apps) on the Moto E4.. But then look at all the regular icons on my BlackBerry KEYone. My preference is to keep the icons the developers intended. My BlackBerry looks MUCH better and those round icons are annoying the heck out of me.", "time": "11-22-2017 02:29 AM", "replies": []}]}, {"postID": "post6080684", "text": "I think you'd have to use a launcher.", "time": "11-22-2017 02:35 AM", "replies": [{"postID": "post6080706", "text": "I have Nova Launcher and if I wanted to, I could change each icon manually with Nova. But I'd rather find a system-wide solution considering these round icons are NOT normal. The white borders are an eye-sore.. With my Galaxy S8, they at least have an option in display settings to remove the white \"icon frames\" or background they have them.", "time": "11-22-2017 03:45 AM", "replies": [{"postID": "post6080707", "text": "Nova has that option. Just go to nova settings>look and feel>marshmallow.", "time": "11-22-2017 03:47 AM", "replies": [{"postID": "post6080978", "text": "Tried it.. All it changes is the phone icon, settings icon, and text icon to their old school marshmallow stock icons. But the icons I'm most concerned about are the ones listed in the screenshots I took. Google's icons and especially Textra", "time": "11-22-2017 09:39 AM", "replies": []}]}]}]}, {"postID": "post6080979", "text": "Weird. Works for me in removing the Samsung themed icons. I guess you just have to download an icon pack then.", "time": "11-22-2017 09:41 AM", "replies": []}, {"postID": "post6081028", "text": "Just to be clear -- you're opening the Nova Settings, going to Look & Feel>Icon Theme, and choosing either System or Marshmallow, and it still looks like that?\nEDIT: Never mind, I just tried it on my Pixel 2 XL, and see what you mean -- even with Marshmallow selected, it's just round. That might be a bug on Nova's part -- contact the developer and ask what happened to the Marshmallow icon pack.", "time": "11-22-2017 10:21 AM", "replies": []}, {"postID": "post6085613", "text": "So Motorola said the icons are \"working as they should\" and suggested a custom icon pack too. This is ANNOYING as there isn't a custom icon pack for DEFAULT icons!!", "time": "11-26-2017 02:25 PM", "replies": [{"postID": "post6123398", "text": "The round icons are \"normal\" per recent Android updates. Your Blackberry is either running a launcher/skin, or is on an older OS version. There should be a way to change this with a launcher, but round is, in fact, normal.", "time": "12-31-2017 03:23 PM", "replies": []}]}, {"postID": "post6085725", "text": "How about this one? https://play.google.com/store/apps/d....EvoHD.M&hl=en", "time": "11-26-2017 04:11 PM", "replies": []}]}, {"title": "Different Processors?", "thread": [{"postID": "post6110985", "text": "So, correct me if I'm wrong, but the Verizon Wireless, US Cellular, and Unlocked versions of the Moto E4 all come with a fingerprint scanner and a Snapdragon 425 chip. While the Sprint, Boost, Metro PCS and Virgin Mobile versions all come without the fingerprint scanner, but come with the updated Snapdragon 427 chip which includes TruSignal technology. So, essentially, you're giving up the fingerprint scanner for better reception? Is that accurate?", "time": "12-18-2017 01:53 PM", "replies": [{"postID": "post6111593", "text": "Not sure what \"better reception\" means in regards to the 427 vs. the 425...or for that matter, if there is even any noticeable speed difference between the two processors.", "time": "12-19-2017 04:23 AM", "replies": []}]}]}, {"title": "My moto e4 camera is shooting poor quality pictures on third party apps(fb,insta,snapchat).", "thread": [{"postID": "post6103603", "text": "It's been a week that I bought a new moto e4 and today I noticed that rear camera isn't working properly with third party apps such as fb, insta and Snapchat. However front camera seems to work fine.\nWhat should I do to fix it?", "time": "12-11-2017 12:22 PM", "replies": []}]}, {"title": "Can I update a Verizon unlocked E4 without bricking it?", "thread": [{"postID": "post6094695", "text": "Have an unlocked Verizon prepaid Moto E4 running with a T-Mobile SIM card on the T-Mobile network..\nGetting messages to update the phone software,\n1. Can I do that via Google Play for APPS like Chrome, GMAIL, etc,,\nand also the Android phone system software without bricking the phone?\nI do not have the original unlock code.\n2. If I do a factory reset will it destroy the network unlocking and brick the phone?", "time": "12-03-2017 04:53 PM", "replies": []}]}, {"title": "Verizon post paid", "thread": [{"postID": "post6082145", "text": "Will this phone work fully on Verizon post paid? Meaning no issues with text, email, etc?", "time": "11-23-2017 08:01 AM", "replies": [{"postID": "post6090850", "text": "Bought mine unlocked. Got TracFone BYOP sim kit. TracFone had me use the Verizon wireless compatible sim -- I guess that is the carrier TracFone rides in my area.\nWorks fine.\nMine is E4, not E4 plus.", "time": "11-30-2017 10:59 AM", "replies": []}]}, {"postID": "post6083201", "text": "Yep. I've used it on my Version postpaid account.", "time": "11-24-2017 11:42 AM", "replies": []}]}, {"title": "Is 16GB enough Internal ROM if 32 GB memory card added?", "thread": [{"postID": "post6079454", "text": "Should the 16 GB internal memory be enough for apps and such if I add a 32 GB card for media?\nI know it depends on use, but can I expect functional results with normal use?", "time": "11-21-2017 09:42 AM", "replies": []}, {"postID": "post6079466", "text": "It really depends on how many apps you want to install, and how big they are. 16 GB means you only have around 11-12 GB of free storage (since the rest is taken up by the OS and bloatware). That's getting to be too little these days. Moto does allow you to format the SD card as Internal Storage, but I always caution against this, since Lenovo's implementation of Adoptable Storage seems a little buggy, based on the problems people describe in these forums. In addition, SD cards are inherently much less reliable than onboard memory, and if the card crashes, you can lose a lot of data (and also crash the system).", "time": "11-21-2017 09:57 AM", "replies": []}, {"postID": "post6079534", "text": "It really depends on how you use your device but 16 should guarantee you a healthy set of applications and a 32 gig memory card should be decent enough for photos and light music", "time": "11-21-2017 10:34 AM", "replies": []}, {"postID": "post6080249", "text": "Darn, I was hoping to listen to heavy metal.", "time": "11-21-2017 05:41 PM", "replies": []}, {"postID": "post6080360", "text": "You can keep hundreds (thousands?) of songs on a 32GB card. Just install it as portable storage. The only reason to use adoptable storage is on a small phone, so you can install apps on the card (it becomes part of internal storage).", "time": "11-21-2017 07:25 PM", "replies": [{"postID": "post6080391", "text": "Thanks for the reply.\nActually I thought 16 GB would be enough for moderate use but I had not heard a definitive statement.I wondered what was considered a small phone. I also wondered if Nougat would use considerably more storage than its predecessors.\nI am beginning to think the phone's memory will be fine because there has not been many complaints about it in the message boards.", "time": "11-21-2017 07:53 PM", "replies": []}]}, {"postID": "post6081048", "text": "FYI, I found in this review that the 16 GB E4 Plus actually only has 10 GB of available storage: https://www.pcmag.com/review/355356/...a-moto-e4-plus. So there's either 3 GB of extra bloatware (assuming about 3 GB for the OS), or the system partition is doubled in order to allow seamless updates: https://www.androidcentral.com/what-...will-they-work", "time": "11-22-2017 10:37 AM", "replies": []}, {"postID": "post6081214", "text": "So we bought the E4 plus version for in-laws. Both are 16gb. I put 32gb cards in both, formatted as external for music and photos. I For one of them they only have 70 apps installed and have plenty of storage left over. The other one has 83 apps installed and downloads music and lots of photos, I think over 2000 photos and over 300 songs. This one has plenty of internal storage left over also. \nI'm looking to buy an e4 plus but will look for 32gb version. I usually have a few more apps, 125-150. I compare to whatever current device I have and look at how storage is used.", "time": "11-22-2017 12:00 PM", "replies": []}, {"postID": "post6081283", "text": "Depends on how many apps you have.", "time": "11-22-2017 12:55 PM", "replies": []}]}, {"title": "How well would a Sandisk Ultraplus microSDHC UHS-1 perform?", "thread": [{"postID": "post6076878", "text": "How well can I expect a Sandisk Ultraplus 32 GB microSDHC UHS-1 with a class 10 rating to perform as portable memory on the Moto E4?\nIn the future, if I decided to use it as adoptive memory, how well could I expect it to perform with normal use?", "time": "11-19-2017 11:41 AM", "replies": []}, {"postID": "post6076928", "text": "1. Portable memory would work fine.\n2. The fastest existing SD card is still slower than the standard NAND used in phones. So making any SD card adopted will have speed effects.", "time": "11-19-2017 12:22 PM", "replies": [{"postID": "post6077108", "text": "Thanks for the reply.\nHow much slower? Would the card be functional? Would there be a noticeable difference in a slightly slower or faster card?", "time": "11-19-2017 04:10 PM", "replies": []}]}]}, {"title": "Gaming on the E4", "thread": [{"postID": "post6058022", "text": "How does the E4 handle high graphics games? Pretty smooth or slow?\nThinking of picking one up as a primary gaming device. So cheap nowadays.", "time": "11-07-2017 07:44 AM", "replies": [{"postID": "post6062204", "text": "Which games are you talking about. If it's something free in play store I can install it this weekend on a family members phone and try it.", "time": "11-09-2017 03:41 PM", "replies": []}]}, {"postID": "post6058362", "text": "I am not a gamer, but from everything I have read, I wouldn't expect much out of the E4 when it comes to games with heavy graphics.", "time": "11-07-2017 11:29 AM", "replies": []}, {"postID": "post6062227", "text": "Mobius final fantasy. Modern combat 5", "time": "11-09-2017 03:49 PM", "replies": [{"postID": "post6064167", "text": "I will try both and see.", "time": "11-10-2017 09:57 PM", "replies": []}, {"postID": "post6074862", "text": "I tried both games and they seemed to work. I only played about 5 minutes each but didn't notice any issues. Graphics I'm sure are better on many other phones but the E4 Plus is a battery champ. \nIn laws have them. Mother in law gets 5 days between charges.", "time": "11-17-2017 07:07 PM", "replies": [{"postID": "post6074863", "text": "Thank you!", "time": "11-17-2017 07:07 PM", "replies": []}]}]}, {"postID": "post6067673", "text": "Didn't forget about this just didn't see family this weekend to try it. I'll post when I do.", "time": "11-13-2017 12:16 PM", "replies": []}]}, {"title": "UHS U3 SD cards supported?", "thread": [{"postID": "post6062799", "text": "Hey all, \nThinking of getting an UHS U3 class SD card for the E4 - the ones that support 30mbps sustained write, instead of the slower UHS U1 cards. I'm wondering, does the phone support these U3 speeds, or would there be no benefit on the E4 vs a U1 card?", "time": "11-09-2017 10:56 PM", "replies": []}, {"postID": "post6068124", "text": "It's not supported. There's no benefit to doing it.", "time": "11-13-2017 05:12 PM", "replies": []}]}, {"title": "Adding Arabic language to my moto e4", "thread": [{"postID": "post6066069", "text": "I need to know how to add Arabic keyboard to my moto e4 which it is not on the phone languages list ..thanks", "time": "11-12-2017 06:19 AM", "replies": []}]}, {"title": "Moto E4 Verizon wireless prepaid", "thread": [{"postID": "post5907185", "text": "Walmart had them on sale for $40 today. So I picked one up. Hoping that my tracfone wireless Sim will work in it", "time": "07-31-2017 04:08 PM", "replies": []}, {"postID": "post5908189", "text": "My sim for tracfone didn't work but still $40 for an awesome phone", "time": "08-01-2017 01:22 PM", "replies": []}, {"postID": "post5969699", "text": "Im not sure if you returned it or not but if you buy an unlock code from ebay and insert ur apn it should work fine. Mine works great on tmobile", "time": "09-11-2017 09:11 PM", "replies": []}, {"postID": "post5986478", "text": "the unlock thing is 2 bucks and it will work. do it. ! its a great phone for 40 bucks", "time": "09-21-2017 11:12 AM", "replies": []}, {"postID": "post5990733", "text": "Anybody have any recommendations on sellers for unlock codes on ebay?", "time": "09-24-2017 12:54 PM", "replies": []}, {"postID": "post5990862", "text": "mobunlockingmaster", "time": "09-24-2017 02:57 PM", "replies": [{"postID": "post6000056", "text": "Thanks for the referral!!! It took about 12 hours to get the codes but to be fair I requested them about 9 pm saturday night. \nWe bought 2 E4 Plus Motorolas from target for $99/each. Both codes worked great and unlocked both phones very easily.\nUnfortunately both phones are for family members so I still don't have one myself. Hoping to get one soon.", "time": "10-01-2017 12:47 PM", "replies": []}]}, {"postID": "post5991133", "text": "Tried searching for local Walmarts with the phone and no luck. I'll keep trying.", "time": "09-24-2017 06:05 PM", "replies": []}, {"postID": "post6000332", "text": "Of course we switch sim cards into the phones and they won't activate at all. I am so sick of Verizon. \nBoth are unlocked so I thought we would be able to use a postpay active sim card in both.", "time": "10-01-2017 04:31 PM", "replies": [{"postID": "post6000390", "text": "I did exactly this and it worked perfectly.", "time": "10-01-2017 05:30 PM", "replies": []}]}, {"postID": "post6000624", "text": "Well after a few calls to vzw it worked. But they fought it with every B.S. reason for it not working.", "time": "10-01-2017 09:24 PM", "replies": []}]}, {"title": "What System apps/ running services can I disable?", "thread": [{"postID": "post5997908", "text": "Without rooting my phone, I would like to disable everything that makes it a phone.\nTrying to keep it simple For example when you buy an android tablet it does not come with dialer, contacts, messages, etc. I wish to free up as much ram and storage as possible. My idea is to disable as many (system apps/ Running Services) as possible. \nI want everything Android playstore, Google services, etc but without any thing that makes it a phone if that makes any since.\nI am running-\nManufacturer: Motorola\nModel: Moto E (4) Plus \"XT1774\"\nAndroid: Nougat 7.1.1\nCarrier: Verizon\nI would like to post more information including my current system apps and running services. But would like to hear others opinions before I continue.", "time": "09-29-2017 12:40 PM", "replies": []}, {"postID": "post6000436", "text": "moto action& moto app", "time": "10-01-2017 06:10 PM", "replies": []}]}, {"title": "not able to see list of numbers grouped in contact in moto e4 plus", "thread": [{"postID": "post5992863", "text": "i would like to receive a suggestion for listing and viewing the numbers which are grouped , bought a new moto e4 plus ,have android 7 version, and synced with google gmail account \nafter sync , option to view groups in upper right 3 dots is not there and only all ,favorites is visible", "time": "09-25-2017 09:43 PM", "replies": []}, {"postID": "post5992872", "text": "Welcome to Android Central. This has happened before if I read your post correctly. When synced Google moves all your contacts to one group, Favorites? If that is correct you will have to go to your online account and fix the groups there.", "time": "09-25-2017 09:56 PM", "replies": []}]}, {"title": "e4: \"move media\" not available to SD card", "thread": [{"postID": "post5990860", "text": "HCI card is what my gf has in her e4\nunder storage the 'move media' option is not available on her phone but it is on mine. \nyou can see all the stuff on her SD card just fine. \nso why would it be possible not to move stuff from phone to SD card?\nedit just checked mine and i have HC I as well. and i can 'move media'\nadditional info:\ngf moved everything from the SD card to her laptop for backup. took out the SD card and put it in the phone. immediately the move media option became available. she decided to format the SD card just to be sure things were good. after formatting it, the move media was available and she moved photos from internet to SD card\nhowever nothing else is available to move over. no apps. would it be that NO apps can be moved to the card?", "time": "09-24-2017 02:56 PM", "replies": []}, {"postID": "post5991309", "text": "Was the card formatted as Internal Storage or Portable Storage?", "time": "09-24-2017 08:09 PM", "replies": []}, {"postID": "post5991955", "text": "formatted for portable storage\nso are you saying you cannot move apps if its not formatted for internal (this is different than the good ole days)\nso if you do format for internal storage. can you still have pictures taken with the cam and put on the SD card and then remove that SD card to put in a computer?", "time": "09-25-2017 10:17 AM", "replies": []}, {"postID": "post5992145", "text": "The ability to \"Move to SD\" for an app depends on the phone -- not all phones allow this. I know there are phones that support Adoptable Storage that don't allow you to Move to SD if the card is Portable Storage, so the E4 may be one of them.\nIf the card is formatted as Internal Storage, it's encrypted so that only the phone that formatted it can read it. You'd have to copy photos over via USB connection, via wi-fi (using an app like AirDroid), or via uploading to the cloud through Google Photos or Google Drive (or something similar).", "time": "09-25-2017 12:53 PM", "replies": []}]}, {"title": "Slow Loading Google Apps", "thread": [{"postID": "post5986162", "text": "I just bought a Moto E4 Plus. It's actually pretty snappy with most tasks, but for some reason, loading Google apps takes awhile. The biggest offender is Gmail, which can take 1.5-2 seconds to load. Anyone know how I can make it faster? I've tried other mail apps and they are much faster, so I'm thinking it's a Gmail thing more than the phone. I don't want to use a different mail app because no others have the functionality to label an email (as opposed to moving it to a folder).", "time": "09-21-2017 07:10 AM", "replies": []}, {"postID": "post5986417", "text": "Any sync errors in Settings>Accounts>Google?", "time": "09-21-2017 10:37 AM", "replies": []}, {"postID": "post5986621", "text": "No sync errors. It seems to be an issue with the Gmail app. I can't figure out why it would lag so much. None of the other apps lag nearly as much when opening them.", "time": "09-21-2017 12:18 PM", "replies": []}, {"postID": "post5987264", "text": "Hmmmm... I did a hard restart and now Gmail and all other apps are loading just fine. First restart since I bought the phone on Tuesday, so who knows?", "time": "09-21-2017 09:05 PM", "replies": []}, {"postID": "post5987448", "text": "By hard restart, do you mean a reboot, or a factory reset?", "time": "09-22-2017 12:18 AM", "replies": [{"postID": "post5988603", "text": "A hard reboot, not a factory reset.", "time": "09-22-2017 07:20 PM", "replies": []}]}, {"postID": "post5987764", "text": "Got mine yesterday and have had zero issues", "time": "09-22-2017 08:41 AM", "replies": []}, {"postID": "post5988733", "text": "Be sure to post up how you like the phone.", "time": "09-22-2017 09:24 PM", "replies": [{"postID": "post5989131", "text": "I'm coming from an original Moto Z Play. In comparison, it's definitely a little bit slower, but not enough to truly matter. The screen also isn't as crisp. That and the camera are the two areas where you truly feel the \"budget\" nature of the phone. The battery life is epic! Probably even a little bit better than the Z Play. I'm at 66% right now and I've been off the charger for 34 hours with 5 hours SOT. \nSince I don't game and don't take a ton of pictures, this is a great phone for me for the price. Even taking out price as a consideration, it's still a really good phone. If I didn't know better, I'd guess it's a $275-300 phone.\nAmazingly, Best Buy honored the $159.99 price of the Amazon version for the 32gb version! So I got this device for $160 - a steal!", "time": "09-23-2017 09:36 AM", "replies": []}]}, {"postID": "post5989384", "text": "I need to run to best buy...... Thanks for the info.", "time": "09-23-2017 12:42 PM", "replies": []}, {"postID": "post5991368", "text": "I bought one for my mother in law. Having Sunday dinner I asked how the phone was working out for her. She averages 3-4 days between charges.", "time": "09-24-2017 08:45 PM", "replies": []}, {"postID": "post5991809", "text": "That sounds about right. Currently, I've been off the charger for 24 hours with 3 hours of SOT. I'm at 80%.", "time": "09-25-2017 07:58 AM", "replies": []}]}, {"title": "longer/louder vibration needed", "thread": [{"postID": "post5986645", "text": "i cannot find any setting to make the vibration stronger/longer in duration. if its sitting on my desk its barely perceptible. much less a loose pocket.", "time": "09-21-2017 12:33 PM", "replies": []}, {"postID": "post5986864", "text": "Unfortunately there is no user setting for that...could be they used a weaker vibration motor to cut costs, or could be improved in a software patch down the road.", "time": "09-21-2017 02:55 PM", "replies": []}, {"postID": "post5990404", "text": "48 hours in with my E4...I've felt every vibration...feel it's definitely strong enough", "time": "09-24-2017 08:41 AM", "replies": []}]}]
[{"title": "One day in with my E4", "thread": [{"postID": "post5870451", "text": "I picked my E4 up at Fry's and have used it the full day. I wasn't sure what to expect due to the previous Moto E phones being so low end but I am really impressed!\nI have always loved the Moto G (1-3 gen) for being modest, capable yet impressive and this feels more like an evolution of those than the E series. \nThis device is able to handle all apps like a pro and has yet to stutter or show any sign of lag.\nThe camera seems passable and the battery life, so far, has been great.\nI'm excited to see how it holds up over the next few weeks but so far so good. This device is outstanding!\nEdit:\nThe fingerprint sensor works flawlessly! It is very accurate.", "time": "07-01-2017 10:21 PM", "replies": []}, {"postID": "post5870522", "text": "Did you buy the unlocked one? Does it feel more like a Moto G?", "time": "07-02-2017 12:26 AM", "replies": []}, {"postID": "post5870848", "text": "I bought it unlocked. It feels like the correct successor to the 3rd gen Moto G. It feels like it in hand, runs better and has no drop in quality. \nI am very impressed.", "time": "07-02-2017 09:10 AM", "replies": []}, {"postID": "post5871400", "text": "I'm seriously considering picking one up. Can I ask what it cost?", "time": "07-02-2017 09:11 PM", "replies": []}, {"postID": "post5871951", "text": "$129.99 at Fry's", "time": "07-03-2017 11:49 AM", "replies": []}, {"postID": "post5876302", "text": "Using the Amazon prime version and so far it is really good.", "time": "07-07-2017 12:57 AM", "replies": []}, {"postID": "post5906109", "text": "Update:\nOne month later and this phone runs just as fast as day one. Everything about this phone is just so good considering the cost. The only complaint I have is the hit-or-miss camera, but then I have to remind myself it's only $129!\nOverall... this is seriously one of my most favourite phones. It simply delivers.", "time": "07-30-2017 08:38 PM", "replies": []}, {"postID": "post5907183", "text": "So I just got home from Walmart. Picked up the Moto E4 Verizon wireless prepaid for $40", "time": "07-31-2017 04:04 PM", "replies": []}, {"postID": "post5908844", "text": "That's a hell of a deal!", "time": "08-01-2017 10:40 PM", "replies": [{"postID": "post5911579", "text": "Yeah. Can't use another sim in it but still. Great phone. I can use it for a while then unlock it", "time": "08-03-2017 10:45 PM", "replies": [{"postID": "post5912010", "text": "Why can't you use another SIM in the phone?", "time": "08-04-2017 07:49 AM", "replies": [{"postID": "post5912128", "text": "It's Verizon locked. That is why I guess.", "time": "08-04-2017 10:01 AM", "replies": [{"postID": "post5912430", "text": "But Verizon phones are all unlocked now.", "time": "08-04-2017 02:46 PM", "replies": [{"postID": "post5912559", "text": "It's a prepaid phone. You can only use it on that service. After x number of months you then can use it as you wish.", "time": "08-04-2017 05:43 PM", "replies": [{"postID": "post5989471", "text": "Bought the Verizon prepaid one on Wednesday at Walmart for $40. Took home and bought unlock code on eBay for $2.\nHalf hour after returning home from Walmart, I now have a phone that works with both my AT&T and T-Mobile SIM cards with no issues and 100% functionality with exception of WiFi calling on AT&T which I don't use that feature anyway.", "time": "09-23-2017 02:30 PM", "replies": []}]}]}]}]}]}]}]}, {"title": "7.1.1 moto e4: phone wont vibrate for notifications while on silent", "thread": [{"postID": "post5986251", "text": "just got this phone and with the setting \"alarms only\" i cannot get the phone to vibrate while the sound is off. so far gmail and texting is all ive tried but no vibration. \nall gmail settings are set to vibrate/notify etc.\nedit: apparently it was on do not disturb. i didnt realize this. i have a ton to learn about this phone. for the record the moto e4 vibrator is not very strong", "time": "09-21-2017 08:40 AM", "replies": []}, {"postID": "post5986404", "text": "Welcome to Android Central! Glad you figured it out. Moved to the Moto E4 forum.", "time": "09-21-2017 10:31 AM", "replies": []}]}, {"title": "e4 moto: volume buttons to turn on the camera?", "thread": [{"postID": "post5981342", "text": "i've searched the manual but as we know, manuals aren't perfect. So i was wondering if you can use the volume buttons to power on the camera, while it the screen is off, and take a pic or if the only way to take a pic is the main button on the screen? \nideally ive heard of double click or firmly click volume then the camera opens and you can use the volume button to take the pic", "time": "09-18-2017 12:13 PM", "replies": []}, {"postID": "post5981605", "text": "Double click the power button to open the camera, then use the volume button to take a picture.", "time": "09-18-2017 02:48 PM", "replies": []}]}, {"title": "Can't go on internet with out wifi? But nowhere near data cap.", "thread": [{"postID": "post5977570", "text": "I just got a new phone a few days ago. But until today I was able to use cellular data to browse the web with the wifi off- I have a 50 gb data cap and I've only used 109mb so I'm not sure why I can't use the internet? When I connect to a wifi network, it works perfectly. But I should be able to access the internet without connecting to a network.\nI did restart it, and cleared some storage. I don't think that helps though, of course...\nPhone is an android 7.1.1 Moto E4\nI'll provide more info as needed, bc I'm not used to this or what else is needed.", "time": "09-15-2017 11:04 PM", "replies": []}, {"postID": "post5977662", "text": "What provider?\nDo you by chance live in NYC? You don't need to actually answer that. The reason I ask is I just read something about an outage in NYC.\nHave you by chance accidently turned off the 4G radio/signal? If your not sure how to check..... In settings the 3rd or 4th thing down is data usage. Open that and there's an option to turn it on/off. \nSwipe down from the top and there should be several options there. Touch the one that looks like signal bars. That will take you to a screen to turn the wireless signal on/off. I'll attach 2 screen shots showing where to find it by swiping down. \nDon't laugh..... I've done it. I hope this helps.", "time": "09-16-2017 12:25 AM", "replies": []}, {"postID": "post5977689", "text": "Unfortunately that doesn't help. I have sprint and I live in Florida. When I scroll down it has my wifi, and \"Sprint\" with the triangle/bars. When I tap on that, it brings up a section that says \"Cellular Data\" (which is flipped on) and tells me I've used 0.11/50 GB. If I go to more settings, it just says the normal setting stuff. Kinda wondering if Data saver has anything to do with it. But it says nothing about 3G or 4G or anything, and I'm told our plan has \"unlimited\" data.\nThing is I can turn wifi off and still make calls and text, but I can't get on the internet and I should be able to without connecting to a wifi network. It worked when I got the phone, and my fiance has an identical phone and his works. Idk what the deal is...", "time": "09-16-2017 12:59 AM", "replies": []}, {"postID": "post5978158", "text": "I would check with sprint. \nI don't think data saver would be the issue. It's only supposed to restrict things running in the background, unless you open and use the app. I usually have mine on 24/7.", "time": "09-16-2017 10:35 AM", "replies": []}]}, {"title": "[DISREGARD] Write protected SD card", "thread": [{"postID": "post5975481", "text": "Yesterday I put an micro SD card from an old Lumia phone into my new E4. However, now I am unable to write or delete files from the card or format it. I've tried formatting the card while it's in the device. I've tried removing the card and formatting it in two different Windows PCs. There are definitely some Android files on the card now, so the phone was able to write to it at some point. I've tried formatting it using HP USB Disk Storage Format Tool and EaseUS partition tool.\nAny tips on how to get the card working again? Thanks!", "time": "09-14-2017 11:50 PM", "replies": []}, {"postID": "post5975501", "text": "Welcome to Android Central. There is a small slider on the side of the card, have you checked to see if that is set on? It is a write protect switch. If you put the card in a PC can you read what files are on it? With all the formatting whatever you may have destroyed it, don't know. If the switch is set off and you can't read the card with a PC then it's no good.", "time": "09-15-2017 12:06 AM", "replies": []}, {"postID": "post5975929", "text": "Micro SD cards don't have the slider.\nI can read all the files, I just can't add new ones or delete old ones.", "time": "09-15-2017 08:54 AM", "replies": [{"postID": "post5975952", "text": "Oops, yeah, my bad, thinking SD not micro. If you have the card in a PC and check its security properties, what does it say?", "time": "09-15-2017 09:10 AM", "replies": []}]}, {"postID": "post5977110", "text": "Flash media don't have security properties in Windows 7.\nOr rather Fat32 media do not.\n[edit]\nI destroyed the card and bought myself a new one.", "time": "09-15-2017 06:42 PM", "replies": []}]}, {"title": "Moto E4 Camera lens", "thread": [{"postID": "post5976634", "text": "I'm switching from an iPhone to the Moto E4, I know it's an inexpensive phone but it'll let me learn my way around Android before making a larger purchase. \nMy question is, does anyone know if there is a case with a cover for the camera lens on the back or a protective film that could cover the lens?", "time": "09-15-2017 03:08 PM", "replies": []}, {"postID": "post5976752", "text": "Moved from the General News forum to the Moto E4 forum.", "time": "09-15-2017 03:55 PM", "replies": []}]}, {"title": "AMAZING battery life! (E4 Plus)", "thread": [{"postID": "post5956520", "text": "I got this for $99 as a backup to mess with but the battery life really has me considering this as my daily driver!", "time": "09-04-2017 10:52 PM", "replies": []}, {"postID": "post5956779", "text": "Wow. That's amazing. What type of use was that? Also, how did you score a Moto E4 Plus for $99?", "time": "09-05-2017 06:11 AM", "replies": [{"postID": "post5957303", "text": "I'm pretty sure that's the pricing on Verizon prepay. After a month of use, or a month of prepaid, you can switch it to any line you want.", "time": "09-05-2017 10:55 AM", "replies": []}]}, {"postID": "post5957296", "text": "Please for the love of all that is unholy stop posting the battery life of this device designed in the underworld!!!\nIt will force me to to buy one. And I don't know how I will explain it to my better half. I have too many already. I was already forced to buy one for a family member. She is a very light user. I asked her the other day (it was in the evening) what her battery was at today. She says it's 83%. I had to mute the phone so I wasn't swearing at her. Probably not good to do to the mother in law. \nBut seriously that phone is a beast. I will never give up my Z Play but I have to buy one of these soon just for the battery life.", "time": "09-05-2017 10:52 AM", "replies": []}, {"postID": "post5969677", "text": "It was originally 99 through target for the verizon prepaid model but has since been at 119.99 The unlocked version is 60 more, but if you unlock the verizon prepaid model i think the only feature you miss out on is volte, depending on which carrier you use. I have only used the unlocked one which has wifi calling as well, not sure if that can be used on other carriers with the verizon prepaid model either.", "time": "09-11-2017 08:57 PM", "replies": []}]}, {"title": "Moto e4 SD Card formatted for internal storage doesn't show the memory available", "thread": [{"postID": "post5914251", "text": "I have a Moto e4 with a 64gig SD Card. I formatted it as internal storage. My file browser still shows 2.79GB / 10GB, which is only the internal memory minus OS/Apps.\nI tried to copy about 7.5gig of files to the phone using the PC usb and it said it ran out of room, so it's definitely not seeing the extra space.\nUnder settings / storage it shows 14.20 GB used out of 80 GB so it sees it there.\nWhat is going on???", "time": "08-06-2017 12:11 PM", "replies": []}, {"postID": "post5937583", "text": "The same thing happens on my z2 play. I think it's a limitation of the app. The system obviously sees the additional storage but the app doesn't recognize it", "time": "08-25-2017 05:21 AM", "replies": []}, {"postID": "post5940026", "text": "Have you tried a reboot? I've always had mine show up so not sure.", "time": "08-26-2017 02:25 PM", "replies": []}]}, {"title": "SSL unpinning bypass", "thread": [{"postID": "post5930718", "text": "Hello, I am currently using a moto E4 running 7.1.1 OS rooted with magisk 13.1. I am trying to use the devices with Charles proxy but the application will not load. I have seen a program called exposed but my understanding is it is fully not compatible and can permanently brick the phone? I have installed all certs on phone and computer and it will not work. My iPhone works no problem but android is being a pain.", "time": "08-21-2017 11:29 AM", "replies": []}, {"postID": "post5930979", "text": "Try XDA. This forum is for Moto mods like the projector, speaker, etc.", "time": "08-21-2017 03:24 PM", "replies": []}, {"postID": "post5931111", "text": "Now my reply doesn't make sense now that the post was moved but XDA is still your best bet.", "time": "08-21-2017 05:31 PM", "replies": [{"postID": "post5931116", "text": "Guilty \nMod Note: Thread moved to correct forum.", "time": "08-21-2017 05:35 PM", "replies": []}]}]}, {"title": "Motorola Moto E4 Plus Specs", "thread": [{"postID": "post5847999", "text": "http://forums.androidcentral.com/e?l...token=2RyRkfdooperating systemAndroid™ 7.1, Nougatsystem architecture/processorQuad-core 1.4 GHz , Qualcomm® Snapdragon™ 427memory (RAM)2 GBstorage (ROM)16 GB / 32 GBdimensions\n155 x 77.5 x 9.55mmweight\n181gdisplay\n5.5” HD (1280x720)\n267ppi, GFF\n2.5D cover Glassbattery\n5000 mAh†\nRemovable\n10W rapid chargerwater protection\nYes. Water-repellent coating.*networks\nGSM\nCDMA\nWCDMA\nTDD\nFDDbands\nGSM 850/900/1800/1900 MHz\nCDMA 850\nWCDMA 850/900/1700/1900/2100 MHz\nCDMA 1900/850+\nLTE TDD Band 38/41\nFDD Band 1/2/4/5/7/8/12/13/17/25/26/66rear camera\n13 MP\nƒ / 2.0 aperture\n1.12 um microns\n78° lens\nAutofocus\nSingle LED flash\nBurst mode\nPanorama\nHDR\nVideo: 720p (30fps)\nBeautification modefront camera\n5 MP\nƒ / 2.2 aperture\n1.4 um microns\n74° lens\nFixed focus\nSingle LED flash\nBurst mode\nHDR\nBeautification modevideo capture\n1080p (30fps)SIM card\nSingle Nano-SIMconnectivity\nMicroUSB\n3.5mm headset portBluetooth® technology\nBluetooth® version 4.1 LEWi-Fi\n802.11a/b/g/n\nWi-Fi hotspotspeakers/microphones\nTwo-in-one speaker at 84dB\nDual microphonesNFC\nNolocation services\nGPSsensors\nAccelerometer\nProximity\nAmbient light\nMagnetometer (e-compass)\nFingerprint readerbase color\nIron Gray\nFine Gold", "time": "06-12-2017 12:54 PM", "replies": []}, {"postID": "post5848001", "text": "https://www.androidcentral.com/moto-e4-e4-plus-specs\nProcessor\nSnapdragon 427 1.4GHz quad-core, Adreno 308 GPU (North America) \nMediaTek MT6737 1.3GHz quad-core, Mali T720 MP1 GPU (ROW)\nSome differences between the North American models and Rest of the World.", "time": "06-12-2017 12:57 PM", "replies": []}, {"postID": "post5848401", "text": "First point is this phone would have been so cool if it had a smaller display of 5 inches. \n5 inch 720p+5000mah battery would have been amazing. \nSecond thing the price is $180 which is highly overpriced. This is the same price as Moto G5 which has superior specs. \nThirdly the SD427+Adreno 308 north American version is much superior to the absolutely crappy mediatek 6737 +mali t720 version for the rest of the world. \nSo if they use a worse chipset in the international version then it must also have been cheaper. \nLenovo has gone nuts. This phone has no redeeming features other than the big battery. That alone is the Prime feature. Rest of the phone is piece of crap.", "time": "06-12-2017 06:55 PM", "replies": []}, {"postID": "post5873126", "text": "Just picked up a UK version. It's got the Mediatek chip and 3GB of RAM. Initial impressions are it's not bad. My daily driver is an S7 and it is noticeably much slower at everything (obviously) but the screen is bright and carries it's low resolution well. It's very solidly built and very heavy but the battery life is outstanding. This phone would suit someone who doesn't want to do anything too demanding but wants some 7.1.1 goodness with stock android and passable performance. Prefer it to the G5 I bought last month.", "time": "07-04-2017 11:28 AM", "replies": [{"postID": "post5873149", "text": "This is the E4 Plus, right? What kind of battery stats are you getting?", "time": "07-04-2017 11:45 AM", "replies": []}, {"postID": "post5914212", "text": "Hey, i'm looking to buy this phone from John Lewis and their website states that it has a magnetometer (e-compass) which i'd like to have for navigation, but other sources say it does not. Could you confirm whether it does/doesn't?\nCheers", "time": "08-06-2017 11:39 AM", "replies": [{"postID": "post5914248", "text": "It definitely doesn't have compass.", "time": "08-06-2017 12:07 PM", "replies": []}]}]}, {"postID": "post5873161", "text": "It's the plus. I only got it a few hours ago so will report back on battery life. The back feels tighter and more solid than the G5 but that could be a function of the weight. The G5 I got creaked at the back, this doesn't. The fingerprint sensor is also very solid. Since I fully charged it 4 hours ago I have 95% with over an hour of screen on usage ( messaging, browsing mainly). I will run it down to 20% and report back.", "time": "07-04-2017 11:51 AM", "replies": [{"postID": "post5873926", "text": "Awesome. I'm looking forward to hearing about the battery life. 5000 mAh battery is huge.", "time": "07-05-2017 08:02 AM", "replies": []}]}, {"postID": "post5874174", "text": "Topped up the charge this lunchtime. Phone 19hrs since full, 3.5 hrs screen time with 20 minutes phone, 10 mins video and the rest just browsing - 71% charge left. Signal work and home usually 3-5 bars. Not too shabby.", "time": "07-05-2017 11:34 AM", "replies": [{"postID": "post5874291", "text": "Wow! So you are on page for around 12 hours SOT over 3ish days. That's amazing.", "time": "07-05-2017 01:16 PM", "replies": []}]}, {"postID": "post5924081", "text": "Has anyone in the US bought the Moto E4+ yet?", "time": "08-15-2017 08:00 AM", "replies": [{"postID": "post5925548", "text": "Just ordered it for a family member. Will be here tomorrow afternoon. I will be able to play with it for about 24 hours before they come to get it. I'll post some opinions. It's the grey 32 gb version and will be activated on verizon.", "time": "08-16-2017 12:18 PM", "replies": [{"postID": "post5925846", "text": "My situation exactly. I'd love to hear your thoughts on it.", "time": "08-16-2017 05:17 PM", "replies": [{"postID": "post5925885", "text": "I think since they are not picking it up until the next day I will activate it on my number for the day I will have it. I will let you know what I think.", "time": "08-16-2017 06:25 PM", "replies": [{"postID": "post5925943", "text": "Awesome, thanks!", "time": "08-16-2017 07:41 PM", "replies": [{"postID": "post5925998", "text": "Any specific things you are looking for? I plan to watch videos and see how battery holds up. Play some games....... Surf news and the such.", "time": "08-16-2017 09:04 PM", "replies": []}]}]}]}]}]}, {"postID": "post5926070", "text": "All of that. I am mostly curious about battery life, screen, and how fast the phone is. I am interested in the phone, but am scared it will be too laggy.", "time": "08-16-2017 10:23 PM", "replies": [{"postID": "post5926334", "text": "It will be laggy, no two ways about it. Mediatek 6737 is trash.", "time": "08-17-2017 07:26 AM", "replies": [{"postID": "post5926341", "text": "US model has a Snapdragon, not MediaTek.", "time": "08-17-2017 07:35 AM", "replies": []}]}, {"postID": "post5927798", "text": "OK here's some thoughts. It's a battery champ. I will attach screen shots from it. Had to connect wifi, Verizon wasn't wanting to play nice. So no calls or 4g use. \nCamera wasn't bad. But I don't take enough photos to really care. I didn't mess with camera settings and just snapped those. \nIt didn't seem to lag at all. I really was able to do anything I wanted to. Watched 2 hours on Netflix and surfed news/web. Not once did I feel it was slow at all. \nThe only negative, and not even a huge negative, I wish it was at least 1080 screen instead of 720. But wasn't a deal breaker by any means. Only time I noticed was watching a YouTube video through Chrome. It was not bad. \nI didn't have data saver on and didn't restrict and apps at all. Easily 2 day battery and with my normal setups I believe it could go 3 days. I left it connected to WiFi overnight. \nI will buy the phone for myself soon.", "time": "08-18-2017 02:00 PM", "replies": [{"postID": "post5927927", "text": "Thanks for the first impressions on the phone. Is the screen that noticeable @ 720p as far as sharpness? What is your current phone that you're comparing to?", "time": "08-18-2017 04:10 PM", "replies": [{"postID": "post5927981", "text": "I switch between Moto G4 plus, Z Play, and Z Force. \nI would not say the screen being 720p is that noticeable to me compared to the G4 and the Z Play. Compared to the Z Force I can see it. \nBut again, it will not stop me from getting one in a couple months to replace my G4 Plus. The battery life for me is worth it. At $200 it's priced just right.", "time": "08-18-2017 05:07 PM", "replies": []}]}]}]}, {"postID": "post5927803", "text": "Forgot to say it felt good in hand. It felt solid and had some decent weight. I really liked it. It would be a solid daily use device. \nIt's not top of the line obviously but for $200 unlocked you can't go wrong. With reduced charge cycles this will easily last 2 years or more.", "time": "08-18-2017 02:05 PM", "replies": [{"postID": "post5928317", "text": "For $200,not even a single OS update will be provided.", "time": "08-19-2017 02:13 AM", "replies": [{"postID": "post5928626", "text": "Maybe it's not for you then?", "time": "08-19-2017 11:15 AM", "replies": []}]}]}, {"postID": "post5928107", "text": "This was all extremely helpful - thanks! That battery life looks to be even better than the Moto Z Play, which is quite the feat.", "time": "08-18-2017 07:17 PM", "replies": [{"postID": "post5928199", "text": "I would agree with that. Glad to help.\nI'm very critical of battery life. Started with the original turbo and nonremovable batteries. If it sucked I would certainly say so.\nTurned it over to family tonight. Activated it at store then home to set it up for them. About 5 hours in and the battery was at 95%. Installed and set up about 15 apps and syncing with Google. \nKinda sucked giving it up.", "time": "08-18-2017 10:08 PM", "replies": [{"postID": "post5928406", "text": "Wow, that's incredible. I played with one at a Best Buy today. Seemed like a really good phone for the price. Even the screen wasn't too bad.", "time": "08-19-2017 05:56 AM", "replies": []}]}]}]}, {"title": "Moto E4+ 7.1.1 - Call Swipe Just Disappeared...?", "thread": [{"postID": "post5916419", "text": "Happy as Larry with my new Moto E4 Plus (£150 - what a bargain) until it went wrong. I cannot now easily accept inbound calls with a normal swipe across (there is nothing to swipe). Now I have to go into the pull-down menu, touch the call notification panel - then answer the call (if they haven't hung up). Any ideas what that might be...? Notes; I have Truecaller installed (was fine together). I have tried a restart and uninstalling/ reinstalling. Still no go. HELP!", "time": "08-08-2017 10:20 AM", "replies": []}]}, {"title": "Permanently screen sleep moto e4 2017", "thread": [{"postID": "post5908910", "text": "My moto E4 is brand new but still when the phone is on sleep some times it automatically remain in sleep frever though phone is not completely switched off and then I have to restart my phone again to use it like normal ways....How to fix it plz?", "time": "08-02-2017 12:13 AM", "replies": []}, {"postID": "post5910324", "text": "Welcome to Android Central! Does this happen in Safe Mode as well?", "time": "08-03-2017 01:50 AM", "replies": []}]}, {"title": "Motorola Moto E4 coming to Verizon?", "thread": [{"postID": "post5851027", "text": "Motorola Moto E4 will be launched by Verizon\nProbably Verizon Prepaid...", "time": "06-15-2017 12:17 AM", "replies": []}, {"postID": "post5851041", "text": "I believe it will be available unlocked as well, I might be wrong though.", "time": "06-15-2017 12:58 AM", "replies": []}, {"postID": "post5860002", "text": "Will the E4 Plus come to the US?", "time": "06-22-2017 05:29 PM", "replies": []}, {"postID": "post5907188", "text": "I just picked up the E4 from Walmart for $40.", "time": "07-31-2017 04:10 PM", "replies": []}]}, {"title": "what streaming apps are compatible with my moto e4 to samsung smart tv", "thread": [{"postID": "post5894252", "text": "what apps and how do I get them", "time": "07-21-2017 01:36 PM", "replies": []}, {"postID": "post5894516", "text": "Since Motorola doesn't make TV sets, it's unlikely that there's any way to mirror the phone to a TV. (That's usually manufacturer-specific - like Samsung phones can mirror to Samsung TVs.)\nThe Chromecast device and the Google Home app work to mirror any Android phone to any TV that has at least one HDMI input.", "time": "07-21-2017 04:53 PM", "replies": []}]}, {"title": "Motorola Moto E4 Specs", "thread": [{"postID": "post5847995", "text": "http://forums.androidcentral.com/e?l...token=3R4vof1Foperating system\nAndroid™ 7.1, Nougatsystem architecture/processorQuad-core 1.4 GHz , Qualcomm® Snapdragon™ 425, or, Quad-core 1.4 GHz , Qualcomm® Snapdragon™ 427memory (RAM)2 GBstorage (ROM)16 GBdimensions\n144.5 x 72 x 9.3mmweight\n150gdisplay\n5” HD 720p (1280x720)\nUp to 16 million colors\nLenovo Screen 70% NTSC\n2.5D cover glass\nFull laminationbattery\n2800 mAh†\nRemovable\n5W/10W rapid chargerwater protection\nYes. Water-repellent coating.*networks\nGSM\nCDMA\nWCDMA\nTDD\nFDDbands\nGSM 850/900/1800/1900 MHz\nWCDMA B1 (2100)/ B2 (1900)/ B4 (1700/2100)/ B5 (850)/ B8 (900)MHz\nCDMA BC0 (850) BC1 (1900) BC10 (850+)\nLTE TDD 38/41\nFDD Band 1/2/4/5/7/8/12(lower 700 1bc)/13 (upper 700)/17 (lower 700 bc)/25/26/66rear camera\n8 MP\nƒ / 2.2 aperture\n1.12 um microns\n71° lens\nAutofocus\nSingle LED flash\nBurst mode\nPanorama\nHDR\nBeautification modefront camera\n5 MP\nƒ / 2.2 aperture\n1.4 um microns\n74° lens\nFixed focus\nSingle LED flash\nBurst mode\nHDR\nBeautification modevideo capture\n1080p (30fps)SIM card\nSingle Nano-SIMconnectivity\nMicroUSB\n3.5mm headset portBluetooth® technology\nBluetooth® version 4.1 LEWi-Fi\n802.11a/b/g/n\nWi-Fi hotspotspeakers/microphones\nTwo-in-one speaker at 84dB\nDual microphonesNFC\nNolocation services\nGPSsensors\nVibration\nProximity\nLight\nAccelerometer\nMagnetometer (e-compass)\nFingerprint reader (in some models)**\nbase color‡\nLicorice Black\nFine Gold\n‡ Available colors may vary by carrier.\n** Fingerprint sensor included on unlocked moto e⁴ and moto e⁴ for Verizon and for U.S. Cellular.", "time": "06-12-2017 12:52 PM", "replies": []}, {"postID": "post5848002", "text": "https://www.androidcentral.com/moto-e4-e4-plus-specs\nProcessor\nSnapdragon 425 1.4GHz quad-core, Adreno 308 GPU (Verizon, MetroPCS) \nSnapdragon 427 1.4GHz quad-core, Adreno 308 GPU (Sprint) \nMediaTek MT6737 1.3GHz quad-core, Mali T720 MP1 GPU (ROW)\nSome differences between the North American models and Rest of the World.", "time": "06-12-2017 12:58 PM", "replies": []}, {"postID": "post5848405", "text": "I just don't understand Lenovo. How is this phone supposed to be different from the Moto C Plus? \nWhat sense does it make to have two different phones with identical specs and prices.", "time": "06-12-2017 06:59 PM", "replies": [{"postID": "post5848649", "text": "Which specs are the same?\nThe C Plus starts at €119 whole the new E starts at €149.", "time": "06-12-2017 11:41 PM", "replies": [{"postID": "post5848652", "text": "Oh ok i thought E4 started at €129.", "time": "06-12-2017 11:44 PM", "replies": []}]}]}, {"postID": "post5850042", "text": "5\", nice. Too many big phones around nowadays.", "time": "06-14-2017 08:39 AM", "replies": [{"postID": "post5850378", "text": "5\" but with big bezels. 144mm*72mm, screen to body ratio 66%.\nNeed a smaller 4.5\" budget phone, same size as original Moto G.", "time": "06-14-2017 12:48 PM", "replies": [{"postID": "post5850478", "text": "Sub 5\" isn't really market reality in 2017.", "time": "06-14-2017 01:40 PM", "replies": [{"postID": "post5851338", "text": "It is. IPhone SE and 4.7 in iPhone sell pretty well. Its just that they decided people don't want normal size phone anymore. So now the only option is a big phone (5\") or huge phone (5.5\"). \nIts not market reality, it was forced on us. I don't think customers wanted removal of 3.5mm jack, smaller batteries, super thin phones, etc. They decided we needed all that.", "time": "06-15-2017 09:07 AM", "replies": [{"postID": "post5851445", "text": "That's one phone. What else is there?", "time": "06-15-2017 10:54 AM", "replies": [{"postID": "post5851485", "text": "There aren't any because they don't sell and they don't sell because there aren't any.", "time": "06-15-2017 11:55 AM", "replies": []}]}]}, {"postID": "post5852970", "text": "One of the reasons that I recently bought an iPhone SE; but it would have been nice to have a greater choice of small, high-quality Android phones - currently, about one - and ditto Windows Phones - currently, about zero. I might still have chosen the iPhone, but as things are, there's hardly any choice in it.", "time": "06-16-2017 03:30 PM", "replies": [{"postID": "post5853365", "text": "Yeah the day of having choices with Android are over since last 2-3 years. \nAll phones are almost the same, no uniqueness anymore.", "time": "06-16-2017 11:21 PM", "replies": []}]}]}]}]}, {"postID": "post5851111", "text": "Does anyone know if the E4 or E4 Plus will come with Moto Display on the European model? Or will it have a notification LED?\nThanks!", "time": "06-15-2017 04:04 AM", "replies": []}, {"postID": "post5853553", "text": "^ Since Moto are already making larger phones, I don't see much point in this latest version of the E. I sometimes use the delightful 4.3\" Moto E, the original, the Condor.  Increase the storage and make a few other changes and you'd have a better successor in my opinion. There was no need to go to 4.5\", 5\" and now also 5.5\". The G series already does those sizes.", "time": "06-17-2017 07:09 AM", "replies": [{"postID": "post5853745", "text": "Yeah I've been using the 4.3\" Moto E since 2.5 yrs as my primary phone, its great if slightly too big for my small hands. \nThey should have kept the same size and added the internals of the E4.", "time": "06-17-2017 11:32 AM", "replies": []}]}, {"postID": "post5873356", "text": "Would like to see smaller device choices. So tired of toting around big phones. My MXPE has been stored for months. Even my HTC 10 seems to big and weighty. Currently using an iphone7 and best feature is size, light weight and battery life, but heck, its Apple. My old HTC M7 was perfect size. This new entry moto offering is certainly priced right. And a removable battery! What everyone is clamoring for. I wonder how the 2 gig of RAM will hold up tho, seems kind of low.", "time": "07-04-2017 03:08 PM", "replies": []}, {"postID": "post5892715", "text": "(In reply to Sean_ius above) The E4 my partner just bought in the UK has Moto Display. No LED.", "time": "07-20-2017 01:13 PM", "replies": []}]}, {"title": "Camera quality?", "thread": [{"postID": "post5865228", "text": "So I am considering picking one of these up for my parents and was wondering how the camera is? They would be coming from a galaxy sol on cricket so obviously they aren't huge into camera specs but want something a little bit better in low light, and this phone looks good for the price. Anyone have one and can comment?", "time": "06-27-2017 11:24 AM", "replies": [{"postID": "post5867654", "text": "", "time": "06-29-2017 09:36 AM", "replies": [{"postID": "post5867786", "text": "Awesome! Looks like it would be a nice upgrade from their current phones.", "time": "06-29-2017 11:08 AM", "replies": [{"postID": "post5867807", "text": "Here if you want to see the uncompressed version. https://drive.google.com/file/d/0B_A...w?usp=drivesdk", "time": "06-29-2017 11:18 AM", "replies": []}]}]}]}, {"postID": "post5877347", "text": "Here is my collection: https://photos.google.com/share/AF1Q...hYbVdsejVsenFB", "time": "07-07-2017 10:24 PM", "replies": []}, {"postID": "post5890530", "text": "Actually those shots are really impressive for a phone this inexpensive. I'll be picking one up as a spare phone to play with. Since it has no NFC I can root it and custom rom it without worrying about using Android pay.", "time": "07-18-2017 10:31 PM", "replies": []}]}, {"title": "Dolby Audio", "thread": [{"postID": "post5886940", "text": "Hi, \nI bought moto e4 plus day before and I'm the dolby equalizer is not viewable.. I tried reset and cleared data and cache.. will attach a photo.. I also tried to switch it on by tapping at the top-right corner but it's not getting switched on.\nAny suggestions?", "time": "07-16-2017 04:30 AM", "replies": []}]}, {"title": "Audio playback issue whilst in standby", "thread": [{"postID": "post5866487", "text": "Does anyone know how to solve this issue?", "time": "06-28-2017 10:39 AM", "replies": []}, {"postID": "post5866545", "text": "Welcome to Android Central! It'd be helpful to hear more details about the issue.", "time": "06-28-2017 11:29 AM", "replies": [{"postID": "post5866552", "text": "The sound it glitches.", "time": "06-28-2017 11:33 AM", "replies": []}]}, {"postID": "post5866850", "text": "What app are you using? Is this locally saved music or streaming? If it's locally saved, is it on Internal Storage or the SD card? Does the sound glitch over wired or Bluetooth headphones as well?", "time": "06-28-2017 04:20 PM", "replies": [{"postID": "post5866854", "text": "Google play music and mx player. It's locally stored music on the internal memory. I'm using wired headphones.", "time": "06-28-2017 04:23 PM", "replies": []}]}, {"postID": "post5866978", "text": "Does it glitch for all music, or only certain files? Does it glitch over the main speaker as well?", "time": "06-28-2017 07:27 PM", "replies": [{"postID": "post5867349", "text": "Yes all music but more heavy files are more affected. And also the glitches is not always it's irregular but usually starts after 5 minutes in standby. I haven't tested if it affects the speaker since I'm always using the headset inside and outside.", "time": "06-29-2017 03:03 AM", "replies": []}]}, {"postID": "post5867752", "text": "Does this happen in Safe Mode? Or after a cache partition wipe? MOTOROLA Moto E4 - Recovery Mode - HardReset.info", "time": "06-29-2017 10:46 AM", "replies": [{"postID": "post5867850", "text": "No I didn't perform any of the things you mentioned.", "time": "06-29-2017 11:38 AM", "replies": []}]}, {"postID": "post5868262", "text": "Give them a try. Safe Mode will temporarily disable any 3rd party app you installed, which can tell you if something you installed is causing glitches. Wiping the cache partition is a useful general troubleshooting step that won't erase any personal data.", "time": "06-29-2017 06:21 PM", "replies": []}]}, {"title": "Moto E4 Reviews", "thread": [{"postID": "post5859653", "text": "Android Central (Daniel Bader):\nVerizon Prepaid modelhttps://www.androidcentral.com/moto-e4", "time": "06-22-2017 01:02 PM", "replies": []}, {"postID": "post5859690", "text": "https://www.facebook.com/theMrMobile...2196144222020/", "time": "06-22-2017 01:27 PM", "replies": []}]}, {"title": "Motorola Moto E4 Plus Pricing and Availability", "thread": [{"postID": "post5848006", "text": "Meet the New Moto E⁴ & Moto E⁴ Plus: Get More of a Good Thing - The Official Motorola Bloghttps://www.androidcentral.com/moto-e4-and-e4-plus", "time": "06-12-2017 01:01 PM", "replies": []}, {"postID": "post5848409", "text": "$180 for mediatek 6737 and Mali T720?\nI want to laugh so hard but I don't really find this funny. \nThis is absolutely pathetic. \nThis is probably the worst Motorola phone in a long time as far as specs and price goes. For $180 one can get phones with SD625 or atleast SD430 but Lenovo is so happy to give you Mediatek 6737. \nHoly crap how can someone defend this? Hardcore Motorola fans will find a way to defend this am sure.", "time": "06-12-2017 07:03 PM", "replies": []}]}, {"title": "Motorola Moto E4 Pricing and Availability", "thread": [{"postID": "post5848004", "text": "Meet the New Moto E⁴ & Moto E⁴ Plus: Get More of a Good Thing - The Official Motorola Bloghttps://www.androidcentral.com/moto-e4-and-e4-plus", "time": "06-12-2017 12:59 PM", "replies": []}]}, {"title": "Fourth Generation Motorola Moto E and Moto E Plus (Moto E4, Moto E 2017)", "thread": [{"postID": "post5755812", "text": "https://twitter.com/Slashleaks/statu...14230165819392\nfunction loadx(data) {\n  document.write(data.html);\n}\nMotorola Moto E4 press render « SLASHLEAKS", "time": "04-12-2017 12:10 PM", "replies": []}, {"postID": "post5760900", "text": "E4 Plus https://mobile.twitter.com/OnLeaks/s...22693575397376\nfunction loadx(data) {\n  document.write(data.html);\n}\nhttp://www.androidauthority.com/excl...-video-764313/", "time": "04-15-2017 02:36 PM", "replies": [{"postID": "post5761763", "text": "E4 Plus coming to the US? That 5000 mAh battery looks awesome.", "time": "04-16-2017 04:12 AM", "replies": [{"postID": "post5762459", "text": "If it's great the MediaTek, likely not.", "time": "04-16-2017 02:25 PM", "replies": [{"postID": "post5791592", "text": "That's too bad. I'd love to have a phone with the battery life of the Z Play, but in a smaller body. The Z Play feels really big to me.", "time": "04-29-2017 08:28 AM", "replies": []}]}]}]}, {"postID": "post5804038", "text": "OOOOHHHH, that looks like a nice little gadget!", "time": "05-06-2017 11:25 PM", "replies": []}, {"postID": "post5814576", "text": "https://twitter.com/evleaks/status/863580163153461249\nfunction loadx(data) {\n  document.write(data.html);\n}", "time": "05-14-2017 04:01 PM", "replies": []}, {"postID": "post5818816", "text": "https://twitter.com/rquandt/status/864498266611875842\nfunction loadx(data) {\n  document.write(data.html);\n}", "time": "05-17-2017 04:00 PM", "replies": []}, {"postID": "post5834382", "text": "Moto E4 specs, price, and release date leak ahead of official reveal - Android Authority", "time": "05-31-2017 01:15 PM", "replies": []}, {"postID": "post5834383", "text": "https://twitter.com/rquandt/status/868900483833909248\nfunction loadx(data) {\n  document.write(data.html);\n}", "time": "05-31-2017 01:17 PM", "replies": []}, {"postID": "post5834422", "text": "https://twitter.com/Slashleaks/statu...48845142016001\nfunction loadx(data) {\n  document.write(data.html);\n}\nhttps://twitter.com/Slashleaks/statu...61939381723136\nfunction loadx(data) {\n  document.write(data.html);\n}\nhttps://twitter.com/Slashleaks/statu...89735160475648\nfunction loadx(data) {\n  document.write(data.html);\n}", "time": "05-31-2017 01:47 PM", "replies": []}, {"postID": "post5835018", "text": "Thanks for the tweet links @Ry , looks like a pretty nice device. The camera looks huge haha, but obviously it's housing the flash as well. Which is actually a pretty smart idea because then it can't get scratched - as easily. \nDon't you love it when things leak and we get some nice high quality photos 😃", "time": "06-01-2017 01:07 AM", "replies": []}, {"postID": "post5847987", "text": "Official: Meet the New Moto E⁴ & Moto E⁴ Plus: Get More of a Good Thing - The Official Motorola Blog", "time": "06-12-2017 12:48 PM", "replies": []}]}]
