[{"title": "unfortunately goggle play store has been stop error & application can not update so please resolve", "thread": [{"postID": "post5890608", "text": "unfortunately goggle play store has been stop error & application can not update so please resolve", "time": "07-19-2017 12:18 AM", "replies": []}, {"postID": "post5890626", "text": "Welcome to Android Central. First, so you understand who we are, we're just users like you are, we're not Samsung nor Google. We can't resolve your problem directly, but hopefully we can help you correct it. So, when you try to update the Play store you're getting an error. Can you tell us exactly what the error is? Are you sure you're correctly logged into your Google account? Are you seeing any other problems with the phone?", "time": "07-19-2017 12:44 AM", "replies": []}]}, {"title": "Update Google Play Services : Keep wont run unless you update Google play services.", "thread": [{"postID": "post5471357", "text": "This msg is popping up every now and then and I'm unable to update the Play services. I tried various ways of fixing this but all in vain. Could you please suggest a way to fix this. This is happening after I updated my phone 2 days back. I'm using One Plus X phone.", "time": "10-06-2016 11:16 PM", "replies": [{"postID": "post5486226", "text": "Welcome to Android Central!\nDid you try downloading the apk for the current play services?", "time": "10-12-2016 09:10 AM", "replies": []}]}, {"postID": "post5493797", "text": "Try uninstalling Google+, reboot, if you use Google+, then install once mote.", "time": "10-14-2016 08:26 PM", "replies": [{"postID": "post5546897", "text": "It's working for me! Thanks!", "time": "11-05-2016 03:18 AM", "replies": []}, {"postID": "post5749555", "text": "Finally, some solution that worked for me. I was facing problem for about 2-3 months. Thank you!", "time": "04-08-2017 09:16 AM", "replies": []}]}]}, {"title": "Login page detection issue in Oxygen OS", "thread": [{"postID": "post5073171", "text": "I have Oneplus X and my network provider needs us to go to login page and then input wifi id and password, in Xiaomi MI3 which I had it used to pop up. It doesn't work in Oneplus X. It shows connected and remains like that until I login from PC. Any solution?", "time": "03-20-2016 04:52 AM", "replies": []}, {"postID": "post5689910", "text": "I'd like to ask too. Its happening on my teeth. Really hate when bodily issues come up lol.", "time": "02-24-2017 01:54 PM", "replies": []}]}, {"title": "Marshmallow 6.0.1 now available on OPX", "thread": [{"postID": "post5456282", "text": "6.0.1 OTA is now available (Canada) w/ October security patch, seems faster but could simply be UI tweak. Stable so far. Upgraded from 2.2.3.\nNot expecting Nougat, but there may be other ROMs. Cheers.", "time": "09-30-2016 10:06 AM", "replies": []}, {"postID": "post5456352", "text": "Had the community build of Marshmallow since that was release. This new release definitely seems a bit more stable. Love having Dose now. The one thing I'm a bit down on though is auto brightness. Feels way to lax after the upgrade to Marshmallow. I could have it under the sun and it won't get brighter for about 30 seconds+ and sometimes not at all. It was slow before the update also, but now its just borderline unusable.", "time": "09-30-2016 10:49 AM", "replies": []}, {"postID": "post5493814", "text": "Works well for me... It may be a the sourced component is not as sensitive.\nI've had problems playing music on Google Play Music through my Bluetooth headphones for three months, sent in my phone many times and tried different official OS versions and couldn't get it to work until 3.1.3.. touch wood.\nWasn't a happy camper.", "time": "10-14-2016 08:31 PM", "replies": []}, {"postID": "post5519391", "text": "Better late than never \nMarshmellow update is welcomed with open arms.\nA droid a day keeps the Apple away", "time": "10-24-2016 11:31 AM", "replies": []}]}, {"title": "OnePlus X Lacks Major US LTE Bands", "thread": [{"postID": "post4787985", "text": "I was getting super excited for this phone and then I read the PC Magazine article and found this:\n\"The OnePlus X may also have a critical problem for U.S. buyers. It has LTE bands 1/2/4/5/7/8. It's missing 12 and 17. That means while it's compatible with AT&T and T-Mobile, it's missing the low-frequency, 700MHz bands (Bands 12 and 17) that have the best suburban, rural, and in-building coverage. This means the OnePlus X will have significantly worse LTE coverage on AT&T and T-Mobile than competing phones.\"", "time": "10-29-2015 11:50 PM", "replies": [{"postID": "post4791431", "text": "I was excited too until I checked the bands. Band 17 is the most widely used LTE band in my state so it's off my list. With any of the Chinese phone makers you have to check what bands it supports.", "time": "10-31-2015 07:57 AM", "replies": []}]}, {"postID": "post4788015", "text": "If it doesn't go through T-Mobile's VoLTE certification, I doubt it will get Band 12 LTE support.", "time": "10-30-2015 12:09 AM", "replies": []}, {"postID": "post4815012", "text": "No band 17 = Fail\nIF this had band 17, it would be a no-brainer to buy this for $250. Looks like Asus Zenfone 2 Laser or Alcatel Idol 3 for me", "time": "11-09-2015 07:13 AM", "replies": []}, {"postID": "post4823538", "text": "It's the same story for me, I'm on AT&T and Band 17 is HUGE in my area. OPX fails right out of the starting gate for me which is sad as I love my OPO.", "time": "11-11-2015 12:10 PM", "replies": []}, {"postID": "post4859389", "text": "Just for some clarity, it is not a horrible experience for all users on AT&T. I am actually seeing better LTE signal where I live with my OnePlus X than with my LG Nexus 5X. It all depends where you live. I was worried it would be a horrible experience, but it is not. Personally, I also love to use the device way more than the Nexus.", "time": "11-26-2015 10:19 PM", "replies": []}, {"postID": "post4902727", "text": "Anyone know if this phone will work on the bell mobility network in Canada? I hope so i just ordered one lol", "time": "12-18-2015 05:12 PM", "replies": []}, {"postID": "post5493846", "text": "Let us know if it works with Bell.\nThe phone works with Rogers and Fido.\nPhone has the looks, OS is a little half baked and may have some bugs, OS 3.1.3 seems stable (me), some have said they are having problems.\nOnePlus support are not too helpful but try their best.\nOthers have had no problems with all versions of the OS... It could be the parts they get for the devices are not consistent to specs (my guess).", "time": "10-14-2016 08:44 PM", "replies": []}]}, {"title": "Oneplus X is not as powerful as Oneplus One", "thread": [{"postID": "post5387715", "text": "I have used oneplusx for sometime and gave it to my sister as I felt it not as powerful as my oneplus one. Is it the oxygen OS or the hardware quality? Eve with same config oneplus one is a beast and Oneplus x is not even 10% of what oneplus one is", "time": "09-02-2016 12:45 PM", "replies": []}, {"postID": "post5389468", "text": "Was it primarily due to speed of web access on mobile data, or with standalone app performance? I ask because of the OnePlus X's suboptimal LTE support for AT&T in the US: On the OnePlus X and AT&T radio support | Android Central", "time": "09-02-2016 11:00 PM", "replies": []}]}, {"title": "One plus x customization", "thread": [{"postID": "post4963490", "text": "Hey guys.. This is my first android phone i would love to customize my phone with various launchers and icons.. Pls help me in suggesting good launchers and icons packs which doesnt affect the performance of the device..\nPosted via the Android Central App", "time": "01-23-2016 04:19 PM", "replies": [{"postID": "post4976448", "text": "You canzoni tra Zen UI by Asus, free launcher", "time": "02-01-2016 10:09 AM", "replies": [{"postID": "post4976449", "text": "Sorry bad t9 canzoni=can use", "time": "02-01-2016 10:10 AM", "replies": []}]}, {"postID": "post4977714", "text": "Get nova launcher with glim icon pack...", "time": "02-02-2016 05:16 AM", "replies": []}]}, {"postID": "post4966280", "text": "I have been using \"apex launcher\" on my last few androids and am currently using it on my OPX. \nI find the extra customisation over stock very useful.", "time": "01-25-2016 03:11 PM", "replies": []}, {"postID": "post4975362", "text": "", "time": "01-31-2016 04:49 PM", "replies": []}, {"postID": "post4998972", "text": "I love smartLauncher and SF Launcher 2\nPosted via the Android Central App", "time": "02-16-2016 09:07 AM", "replies": []}, {"postID": "post4999868", "text": "Seems to be a bug. Images from the phone that are posted on forums seem to end up off axis (tilted a little bit to the right)", "time": "02-16-2016 05:45 PM", "replies": []}, {"postID": "post5018216", "text": "", "time": "02-26-2016 03:39 PM", "replies": []}, {"postID": "post5372925", "text": "Try CyanogenMod 13", "time": "08-28-2016 04:26 AM", "replies": []}]}, {"title": "Oneplus X OxygenOS 3.0 Comunity Build is out!", "thread": [{"postID": "post5355915", "text": "https://forums.oneplus.net/threads/o...plus-x.460857/", "time": "08-22-2016 02:29 PM", "replies": []}]}, {"title": "Anyone do OS upgrade to 2.2.2?", "thread": [{"postID": "post5304692", "text": "Noticing mystery key presses when typing.\nPosted via the Android Central App on OPX", "time": "08-06-2016 06:16 AM", "replies": []}, {"postID": "post5307277", "text": "Weird, mine is working flawless\nPosted via the Android Central App", "time": "08-07-2016 01:01 PM", "replies": []}, {"postID": "post5307280", "text": "Thanks, had to reboot several times.\nPosted via the Android Central App", "time": "08-07-2016 01:02 PM", "replies": []}]}, {"title": "OPX no longer for sale on the OnePlus website", "thread": [{"postID": "post5254725", "text": "RIP, I guess I'm left to figure out my Bluetooth issue on my own. Their help was no help at all.\nPosted via the Android Central App", "time": "07-07-2016 05:22 AM", "replies": []}]}, {"title": "Oneplus X won't detect any SD cards", "thread": [{"postID": "post5247398", "text": "Hello everyone,*\nI have a Oneplus X, I'm on Oxygen 2.2.1-X, Android 5.1.1, system is updated... the SD card is a SanDisk ultra 16GB microSD that I've been using for 2years or so without any problems. \nSince yesterday my phone won't detect any SD card. I was listening to music, all of sudden got the message saying I can take out the card and since then it's impossible to use any SD card. My phone doesn't detect my usual card, it won't allow me to install it manually in the settings, when I connect my phone on my PC via USB I can only see the internal storage... (I can't find my SD adaptator to try it) but anyway I thought my card was fried and that I lost all my data.\nI tried with another SD card, same problem. No detection, can't install it, nothing. But with the 2nd card, I left the phone with it and idk how but the option to install it manually in the settings just reappeared (well I was able to click on it) but when I try to do so, nothing happen, phone vibrate but seems to not be able to even start the operation.*\nVery very frustrating. So now I don't know if it's the phone, the card, or the slot. \nHope someone can help me.\nHave a nice day and thank you.", "time": "07-01-2016 10:59 AM", "replies": []}, {"postID": "post5247991", "text": "Welcome to Android Central! The SD card could be corrupt, defective, or counterfeit--or there might be a problem with the phone's SD reader. If you have access to another phone that will recognize the card, then insert it and install SD Insight to see if the card is genuine or counterfeit. Counterfeit cards are programmed to report more storage than they actually have, and if you try saving more than the card can actually hold, then files can start getting corrupt.\nIf it's a valid card, then go to Settings>Storage, Unmount the card, remove it, and insert it into your computer, if possible. If you don't have a microSD adapter, buy one at your local electronics store--they should only cost about $2. Can the computer read these files? Backup as much as you can right now, then run chkdsk to look for bad sectors: http://forums.androidcentral.com/amb...d-sd-card.html.", "time": "07-01-2016 06:27 PM", "replies": []}, {"postID": "post5248399", "text": "Thank you! \nI didn't know about the storage ting, I know my SD was almost full before what happened, I will try all the solutions then and hope it's not my phone's SD reader!", "time": "07-02-2016 06:33 AM", "replies": []}, {"postID": "post5249370", "text": "Hello again, \nI didn't have time to buy a microsd adapter but tried the SD card in another phone and it didn't recognize it either. \nAnyway I had some things to do during the day/evenings so I put back the SD card in my phone and left it like this the entire day, around 9pm my phone vibrate and write the message saying it's ready to mount the card??? So I do it and now it's working perfectly fine, got all my datas back... I really don't know what happen, SD insight seems to tell me the card is OK but I will backup all my datas just in case and also buy a new one.", "time": "07-03-2016 04:41 AM", "replies": []}]}, {"title": "Bluetooth is disconnected or sound goes silent", "thread": [{"postID": "post5220154", "text": "Picked up the OnePlus X, a few weeks ago, the phone looks great. Noticing when using the Bluetooth the music would go silent but my music app is playing. It sounds if the music has been muted. The connection to my device and car audio or my wireless headset is fine. Anyone else have this problem?\nI have all the latest software updates on my device.\nPosted via the Android Central App", "time": "06-11-2016 03:22 PM", "replies": []}]}, {"title": "Oneplus X cant run 1080p videos smoothly", "thread": [{"postID": "post5073166", "text": "I have Oneplus X and it is not able to run 1080p videos smoothly,any solution? It contains SD801 2.3GHz and 3GB ram still it works real slow", "time": "03-20-2016 04:49 AM", "replies": []}, {"postID": "post5074314", "text": "Yeah it's strange that video and animation is choppy at times. My old moto x from 2013 seems to run better. Not sure why the oneplus x hangs at times, specs are so good. I actually could not stand it so returned mine", "time": "03-20-2016 05:56 PM", "replies": []}, {"postID": "post5079154", "text": "Maybe the video is in mkv format. Try downloading it in mp4 format and play it again. See if it works", "time": "03-22-2016 11:35 PM", "replies": []}, {"postID": "post5166255", "text": "It doesn't on mp4. I've even watched a movie in 1080p xD", "time": "05-07-2016 11:10 PM", "replies": []}]}, {"title": "Oneplus X got locked for no apparent reason", "thread": [{"postID": "post5154624", "text": "Experts,\nMy Oneplus X got locked and it won't allow me to log in to my phone using the same Google account that was previously synced with this phone. It says: Verify your account - this device was reset. To continue sign in with a Google account that was previously synced on this device.\nThis happened yesterday when I removed the phone from my pocket and found that the device got locked for no apparent reason. Its been prompting to verify my Google account that was last synced with this device. I tried entering my Gmail address and password however it keeps telling me - please sign in using one of the owner's acounts for this device. Now I'm surely using the correct Gmail account (as I have only one google account) however it keeps telling that. One thing that happened was, I reset my password at the very beginning when this happened as I couldn't remember my password at that time. \nI have been using Oneplus X for about 5 months now and never had this problem. \nHow do I fix this. Please suggest.\nThanks.", "time": "05-01-2016 12:33 AM", "replies": [{"postID": "post5154839", "text": "", "time": "05-01-2016 05:19 AM", "replies": []}]}]}, {"title": "How is the device(overall)? Thinking of buying one...", "thread": [{"postID": "post5120097", "text": "Need to know mainly the battery life and how much does it take to charge full. Which version of android is it? And is the camera better than one plus one, moto x play or one plus 2?\nPosted via the Android Central App", "time": "04-12-2016 09:31 AM", "replies": []}, {"postID": "post5121160", "text": "I recently bought one and I'm actually loving it, specially the dark mode in the settings.\nThe battery is better than my moto G 2014(running CM13), it lasts me all day and even a little more, and I'm not sure how much it takes to charge to full since I let it charge overnight.\nIt runs 2.2.1 (5.1.1 lollipop) and it's going to be updated to M.\nI haven't used a oneplus 2 or a moto x play but I don't think it is better than those but it isn't bad at all, it takes the pictures really fast, faster than any I have used and the quality is decent.\nPosted via the Android Central App", "time": "04-12-2016 05:56 PM", "replies": [{"postID": "post5152704", "text": "How long does it take for you to charge it and what service are you using it with?\nPosted via the Android Central App", "time": "04-29-2016 12:51 PM", "replies": [{"postID": "post5152713", "text": "He/she let's it charge over night and doesn't know how long.", "time": "04-29-2016 12:58 PM", "replies": []}]}]}, {"postID": "post5153115", "text": "I'm on Claro Dominicana, it has the same bands as T-Mobile.\nPosted via the Android Central App", "time": "04-29-2016 05:40 PM", "replies": []}]}, {"title": "when i will get the volte support in my cell phone(one plus x)", "thread": [{"postID": "post5117431", "text": "NETWORK\tTechnology\t\nGSM / HSPA / LTE\n2G bands\tGSM 850 / 900 / 1800 / 1900 - SIM 1 & SIM 2\n3G bands\tHSDPA 850 / 900 / 1900 / 2100 - Europe\nHSDPA 850 / 900 / 1700(AWS) / 1900 / 2100 - USA\n4G bands\tLTE band 1(2100), 3(1800), 5(850), 7(2600), 8(900), 20(800), 38(2600), 40(2300) - Europe\nLTE band 1(2100), 2(1900), 4(1700/2100), 5(850), 7(2600), 8(900) - USA\nSpeed\tHSPA, LTE\nPLATFORM\tOS\tAndroid OS, v5.1.1 (Lollipop)\nChipset\tQualcomm Snapdragon 801\nCPU\tQuad-core 2.3 GHz Krait 400\nGPU\tAdreno 330", "time": "04-11-2016 01:12 AM", "replies": []}, {"postID": "post5117434", "text": "Welcome to Android Central.\nWhat carrier do you have?", "time": "04-11-2016 01:14 AM", "replies": []}]}, {"title": "Here is my OnePlus X!", "thread": [{"postID": "post4856636", "text": "Received this today for my brother. It went straight to my cousin's place so I cannot answer any questions. Just the pictures.", "time": "11-25-2015 11:21 AM", "replies": []}, {"postID": "post4856641", "text": "", "time": "11-25-2015 11:23 AM", "replies": []}, {"postID": "post4859391", "text": "Congrats! I am enjoying mine as well. I bought the Sandstone case and am very please. I removed the stock screen protector and don't feel the need to add one at this time. The only disappointment for me is the camera, mainly because I have been using the Nexus 5X since launch. LTE is fine in my area on AT&T.", "time": "11-26-2015 10:21 PM", "replies": []}, {"postID": "post4860969", "text": "I am selling my OPT to get this or nexus 5x.", "time": "11-27-2015 11:21 PM", "replies": [{"postID": "post4871741", "text": "Sell the OPT and get the OPX! If the Marketplace is too slow then Swappa is your friend!", "time": "12-03-2015 12:06 PM", "replies": []}]}, {"postID": "post4879332", "text": "Somehow your email doesn't work.\nI have few months old OPT if you're interested. WTS/WTT: One plus 2 64gb Sandstone. - Android Forums at AndroidCentral.com\nReason I am selling is I have too many phones. I also recently ordered two extra OPT charging cables from this forum. I can do $330 shipped including cables.\nThanks.", "time": "12-07-2015 09:24 PM", "replies": []}, {"postID": "post4974976", "text": "Is this on par with OnePlus One or worse? Is there any point on changing to this one? I find this one more beautiful!", "time": "01-31-2016 10:51 AM", "replies": []}, {"postID": "post4988988", "text": "I'm really really interested in getting this phone. The price and the build quality are so ummatchable. I don't care about the lack of LTE. So what is the other downside here?", "time": "02-09-2016 12:13 AM", "replies": [{"postID": "post4989781", "text": "I've been using my One Plus X for about one month. It's a great phone. Downsides are; no NFC. Camera is good enough not stella or amazing but I don't care. WiFi works on the 2.4 not the 5 Ghz. Plenty fast enough.\nThe software oxygen OS is pretty snappy. No lagging which is very nice.\nCall quality is very good. Actually better than my LG G3 on the same network. I'm on T Mobile band 4 which is their LTE band. 12 not available. \nAnyway. Go get this phone. You won't regret it.\nPosted via the Android Central App", "time": "02-09-2016 01:32 PM", "replies": []}]}, {"postID": "post4990220", "text": "Yeah I also forgot to mention that the lack of NFC wasn't a problem for me. Alright then, sounds good. Thanks", "time": "02-09-2016 06:51 PM", "replies": []}, {"postID": "post5091240", "text": "I just bought my wife the OnePlus X with the white silicon case. She coming from iPhone 5c 32GB. Hopefully she'll like it. I also have a super fast 64GB sd card for the photos she likes to make.\nPosted via my Google Nexus 6P", "time": "03-28-2016 04:58 PM", "replies": []}]}, {"title": "The OnePlus X seems to lose to the Samsung Galaxy Alpha on Benchmarks", "thread": [{"postID": "post5053703", "text": "Ran benchmark, am I reading results right? The alpha seems to get better results?", "time": "03-12-2016 01:36 AM", "replies": []}]}, {"title": "Why i cant delete photos of whats app stored in my gallery in one plus x?", "thread": [{"postID": "post5045739", "text": "M using one plus x and can delete camera photos by swiping up but could not delete other photos like whats app and taken from xender", "time": "03-09-2016 11:15 AM", "replies": []}, {"postID": "post5046832", "text": "Welcome to Android Central! What if you long-press the photo? You could always use a file manager app to go to the directory where those photos are stored and delete them there.\nAlso, are you sure those photos are stored locally on the phone, or could they be in cloud storage somewhere?", "time": "03-09-2016 05:38 PM", "replies": []}]}, {"title": "Perfect secondary phone?", "thread": [{"postID": "post4998188", "text": "Would this be a good secondary phone? I live in NY using ATT, and my current daily driver is LG V10. I just switched over from an iPhone 5S and it seems to me like the OPX will give me that same comfortable, smaller phone experience for a good price. Thoughts?\nPosted via the Android Central App", "time": "02-15-2016 05:32 PM", "replies": []}, {"postID": "post4998401", "text": "The One Plus X my recent purchase about one month has actually replaced my LG G3. Though this phone only has one band band 4 for T Mobile its very quick and snappy with no lag. I've sent on here that some people are using the one X on AT&T with no issues. LTE speeds are good. WiFi is limited to the 2.5 G band not 5 but no big deal. I'm very happy overall I don't think you will be disappointed.\nPosted via the Android Central App", "time": "02-15-2016 08:28 PM", "replies": []}]}, {"title": "just ordered this phone", "thread": [{"postID": "post4976405", "text": "Just ordered this phone as a backup phone. How is the opx in your opinions as a backup device\nPosted via the Android Central App", "time": "02-01-2016 09:45 AM", "replies": []}, {"postID": "post4976446", "text": "i have heard some people say it's a good device. When is it expected to arrive?", "time": "02-01-2016 10:09 AM", "replies": []}, {"postID": "post4978878", "text": "I've had my X for about two weeks. So far so good. I'm using TMobile band 4 only. Band 12 isn't active on the X. I've been reading that this phone works best on T Mobiles network as band 17 is also missing which is AT&T LTE band. Though certain cities on AT&T you might be OK.\nBattery life is quite good. About 14 to 18 hours life what I've worked out so far.\nYou will like this phone.\nPosted via the Android Central App", "time": "02-02-2016 06:24 PM", "replies": []}, {"postID": "post4978945", "text": "Sweet. It should be here tomorrow. I'm showing my 6p runs on band 4 att .in my area so we will see. It's basically just gonna be a backup phone and when I don't feel like carrying my massive 6p I will roll with this.\nPosted via the Android Central App", "time": "02-02-2016 07:13 PM", "replies": []}, {"postID": "post4983646", "text": "Got it. Exceeded my expectations..build quality is top.notch and surprisingly pretty snappy phone. Camera is OK. Takes good pictures when you have time. But for quick pics it does OK. Been throwing alot at it to see what it can handle and so far it's handled everything pretty darn good. I would recommend. I have lte here on band 4. Can't speak for the band 17 folks but in my area northern Wisconsin its great\nPosted via the Android Central App", "time": "02-05-2016 08:52 AM", "replies": []}, {"postID": "post4983834", "text": "I'm glad you're enjoying your new one plus X. You are so right, for the price the phone is built very well. Snappy, fast with no lagging from screen to screen. \nI'll be curious how well this phone will run on Marshmellow. What do you think?", "time": "02-05-2016 10:27 AM", "replies": []}, {"postID": "post4984690", "text": "I agree. I will say out of the box I got 3.5 hrs sot and that's great for this size of a phone. It can only improve things I would think. We will see. Looking forward to it.\nPosted via the Android Central App", "time": "02-05-2016 10:17 PM", "replies": []}]}, {"title": "OnePlus X LTE in Chicago", "thread": [{"postID": "post4862407", "text": "After 2 days LTE coverage in Chicago has been overall good but not perfect. Won't know the situation downtown until Monday, but so far it's decent on the north side.\nOverall really enjoying the feel & speed of this phone, using it as a backup to the 6P. They compliment each other very well, as the OPX feels like a great change of pace.\nI'll update LTE coverage info if folks are interested.\nAlso I recommend NOT buying the rosewood case...looks cheap with horizontal lines running across it. Didn't even open the package (has to be unopened to return).\nPosted via the Android Central App", "time": "11-28-2015 07:25 PM", "replies": []}, {"postID": "post4864355", "text": "Are you on ATT or Tmobile?", "time": "11-29-2015 11:39 PM", "replies": []}, {"postID": "post4872167", "text": "At&t. My office is at Wacker & Madison downtown. I maintain LTE connection throughout the day both inside and outside, as well as on the blue line underground (quite surprising!). Download speeds aren't great, varying wildly between 5-30 mbps, but the LTE logo almost always remains active. And full disclosure, the 6Ps download speeds were about the same in the city.\nPosted via the Android Central App", "time": "12-03-2015 04:25 PM", "replies": []}, {"postID": "post4894514", "text": "I knew it wouldn't be so bad in the wild.", "time": "12-15-2015 06:17 AM", "replies": []}, {"postID": "post4894642", "text": "I'm surprised as well. I've maintained LTE all the time in upstate NY using AT&T.", "time": "12-15-2015 07:29 AM", "replies": []}, {"postID": "post4965155", "text": "One Plus X user in northern Atlanta. Using a company called Ting that is a MVNO of TMobile. Using band 4 with LTE coverage 97% of the time. Pretty happy overall. \nDownload speeds around 16 to 18 mbps. Upload 4 or so.\nI am about 33 miles north of Atlanta. I actually like this phone. Have a LG G3 which is a great phone too.\nLook and feel of this phone is great.\nI would suspect that One Plus will have to to do a firmware software update for bands 12 and 17 for AT&T. Question is; do they care about the U.S. market?\nAnyway. Just a little input for you.\nPosted via the Android Central App", "time": "01-24-2016 08:46 PM", "replies": []}, {"postID": "post4978326", "text": "In Chicago's Ravenswood neighborhood I am getting 37.19 down and 7.02 up on MetroPCS (T-Mobile) with my OnePlus X.\nThis is way more than adequate for me. I typically shut off LTE and use H+ anyways. Just more stable.", "time": "02-02-2016 01:30 PM", "replies": []}]}, {"title": "Few pictures", "thread": [{"postID": "post4823225", "text": "Yesterday the DHL guy stopped by, and left a rather small package. As the OnePlus X is going to be a present for my son, I had to wait with the unboxing until he went to bed.\nAt last I could take the lid off the box. The phone looks great. And it feels even better when held in hand. The specs may not be top-notch, but the phone has nothing cheap about its looks. For sure it is not light, thanks to the metal frame around, combined with glass in front and back. It has rather premium feel about it.\nIt went back to the box for the time being. I will do some basic configuration in the coming days, and I am sure my son will appreciate the upgrade from my old Blackberry 9810 he is currently using \nAs the title says, I am attaching few pics (taken with my Blackberry Z30).", "time": "11-11-2015 10:40 AM", "replies": []}, {"postID": "post4904153", "text": "Looks nice the way its packaged! nice phone.", "time": "12-19-2015 04:46 PM", "replies": []}, {"postID": "post4974974", "text": "It's hot as hell. I'm a bit afraid of the screen cracking though...", "time": "01-31-2016 10:51 AM", "replies": []}]}, {"title": "Complete Failure - DOA", "thread": [{"postID": "post4846702", "text": "This phone looks like complete failure, just DOA !! Oneplus has its own forums filled with ppl looking to giveaway their invites and still no one taking it !! Seems the phone specs are equally responsible with invite system for the failure...", "time": "11-20-2015 09:35 PM", "replies": []}, {"postID": "post4847024", "text": "I'm puzzled as to why they decided not to make the phone compatible with the majority of US carriers' LTE bands. That couldn't have helped sales at all.", "time": "11-21-2015 02:03 AM", "replies": []}, {"postID": "post4966289", "text": "250 - 300 million people in USA\n1 billion in Europe (let's not even mention Asia) \nmaybe there was a spec/cost trade off and they weren't too concerned about North America.", "time": "01-25-2016 03:17 PM", "replies": []}, {"postID": "post4972573", "text": "Yeah, their main markets are India and China, with a combined population of over 2.5 billion people.\nI wonder how many of those people care about at&t bands and NFC... It's not zero, but I bet it's close.\nPosted via the Android Central App", "time": "01-29-2016 05:46 PM", "replies": []}]}, {"title": "Oneplus X call waiting option shows incoming call instead of missed call when there is a call in the", "thread": [{"postID": "post4965400", "text": "1. Oneplus X call waiting option shows call as incoming call if there is any call in background during any conversation. It should highlight background call as missed call with a icon on top bar.\n2. During making any call, there is no visible sign if phone is ringing or subscriber busy. No visible display /color change that call is matured only you have to see small call duration to identify it.", "time": "01-25-2016 02:10 AM", "replies": []}]}, {"title": "One Plus X invitation available", "thread": [{"postID": "post4787282", "text": "I am quite shocked and don't know what to do.\nPosted via the Android Central App", "time": "10-29-2015 06:07 PM", "replies": []}, {"postID": "post4787312", "text": "Delete the email?", "time": "10-29-2015 06:20 PM", "replies": []}, {"postID": "post4802475", "text": "Hi guys\nI have an extra invite\nWas emailed to me today at 1pm GMT if anyone wants it I might give it up I need to see if I have a friend who wants it instead but if not it's up for grabs\nNB: UK invite\nPosted via the Android Central App", "time": "11-04-2015 10:24 AM", "replies": [{"postID": "post4807776", "text": "If you still have it due to UK invite is it possible to have it? I don't know if you gave it to Jeevankumarn007", "time": "11-06-2015 04:33 AM", "replies": []}]}, {"postID": "post4804641", "text": "Hi Rdroid27,\nI would like to have the invite. Can you please share it with me ?? I'd registered long back but didnt get the invite yet.... so please share it with me. Thank you !!", "time": "11-04-2015 11:40 PM", "replies": []}, {"postID": "post4812693", "text": "Really sorry I found out the invites are currently unshareable\nPosted via the Android Central App", "time": "11-08-2015 05:46 AM", "replies": [{"postID": "post4813188", "text": "Knew that already. But you can share your acount to let someone order and then take it back", "time": "11-08-2015 11:14 AM", "replies": []}]}, {"postID": "post4814630", "text": "I don't really want to do that u see plus I had a problem getting my own x so i am now at the bottom of the invite list\nPosted via the Android Central App", "time": "11-09-2015 12:45 AM", "replies": []}, {"postID": "post4834799", "text": "I have received a shareable invite. If anyone wants to give a try to OnePlusX, let me know.\nPlease note: it is not valid in US. \nThe invite is for European version, and according the email:", "time": "11-16-2015 06:29 AM", "replies": []}, {"postID": "post4843798", "text": "It apparently has to be claimed in the next two days. I am happy with my Alcatel Idol 3 4.7, so am going to pass on the One Plus X. \nAnyone want the invitation? (I would just forward you the email with the invitation code.) \nI am in the U. S., if it matters.\nPosted via the Android Central App", "time": "11-19-2015 04:45 PM", "replies": []}, {"postID": "post4843806", "text": "Oh, shoot, never mind. It says that the invitation can only be claimed under my email address. Sorry. \nPosted via the Android Central App", "time": "11-19-2015 04:47 PM", "replies": []}, {"postID": "post4845249", "text": "Just received an invite, not planning on using it for purchase - happy to send along to whoever wants it. Let me know!", "time": "11-20-2015 09:55 AM", "replies": []}, {"postID": "post4846576", "text": "is it still available?", "time": "11-20-2015 08:21 PM", "replies": []}, {"postID": "post4853372", "text": "Do you still habe it? I'd be very glad!", "time": "11-24-2015 01:37 AM", "replies": []}, {"postID": "post4872145", "text": "Wow this thread has no traction this time around....", "time": "12-03-2015 04:16 PM", "replies": []}, {"postID": "post4881987", "text": "Here's an invite code:http://onepl.us /NAEE- DF7A- 10E6- F1FF", "time": "12-09-2015 07:26 AM", "replies": []}, {"postID": "post4884035", "text": "I have one invite, PM me to get it", "time": "12-10-2015 02:20 AM", "replies": []}, {"postID": "post4888797", "text": "First person to PM me can have it.\nPosted via the Android Central App", "time": "12-12-2015 12:34 PM", "replies": []}, {"postID": "post4890063", "text": "I got an invite this morning. PM me to get it. It's good for 3 days.", "time": "12-13-2015 08:36 AM", "replies": []}, {"postID": "post4955170", "text": "First 3 get invites.\nPosted via the Android Central App", "time": "01-18-2016 12:20 PM", "replies": []}]}, {"title": "RECEIVED MY 1+X three days ago.", "thread": [{"postID": "post4831796", "text": "I received my Oneplus X 3 days ago. Great little phone. I needed a back up phone and the X is perfect in that regard. \nFor £200 ,this phone is a no-brainer!\nBattery life is great, so far the S801 CPU is chugging along pretty well.Display is good if you like AMOLED. \nCamera is average but don't care since I have iPhone 6 for my mobile photography.\nIt's quite a looker. A svelte high end design.\nPosted via the Android Central App", "time": "11-14-2015 03:43 PM", "replies": []}, {"postID": "post4859397", "text": "Congrats! I am enjoying mine as well. I bought the Sandstone case and am very please. I removed the stock screen protector and don't feel the need to add one at this time. The only disappointment for me is the camera, mainly because I have been using the Nexus 5X since launch. LTE is fine in my area on AT&T. Build quality, in hand feel screen and speaker make my Nexus 5X look like the cheaper phone. It is also noticeably faster at app loading and multitasking than the Nexus 5X.", "time": "11-26-2015 10:23 PM", "replies": []}, {"postID": "post4917107", "text": "That's great, congrats! With the specs and looks of the OPX, no doubt it's an awesome phone at that pricetag.", "time": "12-26-2015 10:00 PM", "replies": []}]}, {"title": "Question / Opinion", "thread": [{"postID": "post4882267", "text": "I just received my One plus x invite. I had (2) ways to go about this, I was going to get either a nexus 6p, or get a iphone 6s and a oneplus x (to keep android as well). I don't do anything crazy with my phones.. But I do play (2) hands pretty consistently.. Which are subway surfer and marvel contest of champions.. Still the One plus x be able to handle those easily? Opinions are welcomed!!!! I have 3 days for the invite.\nPosted via the Android Central App", "time": "12-09-2015 09:37 AM", "replies": []}]}, {"title": "Oneplus X or Oppo Find 7 Reloaded? Which would you take?", "thread": [{"postID": "post4814288", "text": "Hello,\nI'm struggling to make a choice between these phones, and I was wondering if anyone had some perspective to offer. Particularly someone with experience with the Oppo.\nMy current benchmark is a Nexus 4. My primary concerns:\n- Good battery life, the longer, the better. I browse the web a lot and would probably play games.\n- Minimum 1080p screen. No negotiations.\n- mSD is a plus\n- Roms or current OS version mandatory. Oppo seems to have it up to Android 5 (with CM M on the way) so that's something, but I really like how the oneplus X looks.\nThe struggle is real! Please assist!", "time": "11-08-2015 09:11 PM", "replies": []}, {"postID": "post4872255", "text": "I am in the same situation but I really prefer the size of the X and the look.\nBattery life ist not much different\nAnd install roms is way easier on the X\nPosted via the Android Central App", "time": "12-03-2015 05:08 PM", "replies": []}, {"postID": "post4874565", "text": "Comes down to size preference. Although I'll say Id have a slight bias towards the OPX because the AMOLED screen is just so beautiful. AMOLED screen tech has made leaps and bounds in improving color accuracy. Insofar as ROMs the OPX will probably eventually have many more ROMs than the Find 7, but Oppo have released an ASOP alternative to their Color OS, which might help it a bit if you don't like the default OS.", "time": "12-05-2015 01:04 AM", "replies": []}]}, {"title": "OnePlus X", "thread": [{"postID": "post4785147", "text": "This phone looks incredible! The only thing thats gonna hold me back from buying 1 is\nA. The rather small battery\nB. The customer service of oneplus (which is apparently really crap)", "time": "10-29-2015 04:47 AM", "replies": []}, {"postID": "post4785214", "text": "This will only be great if the SD can be used for app storage, if they update it to 6.0. 16 gb is scary to me now a days\nPosted via the Android Central App", "time": "10-29-2015 06:07 AM", "replies": [{"postID": "post4823547", "text": "I think the OPX supports the adoptable storage system of Android Marshmallow. If this is your only fear then you'll be good to go once OP upgrades OxygenOS to Marshmallow.", "time": "11-11-2015 12:13 PM", "replies": []}]}, {"postID": "post4786832", "text": "Not a complete homerun for me, but at the price I'm willing to make certain tradeoffs. Main negatives for me are no NFC and no B12 LTE. Considering that I had pre-ordered the One A9, the battery size isn't too bad on the OPX. At $150 less than the One A9 I may just reconsider things.", "time": "10-29-2015 03:26 PM", "replies": [{"postID": "post4787611", "text": "It's almost my ideal smartphone, but I need B12 and B17 LTE.", "time": "10-29-2015 08:45 PM", "replies": []}]}, {"postID": "post4799501", "text": "I'm considering this one too. Trying to decide between this and the Moto G 3.", "time": "11-03-2015 10:00 AM", "replies": [{"postID": "post4807778", "text": "Oneplus X is my new phone. I come from Moto G 1.\nLooks more promessing and yeah just like it more", "time": "11-06-2015 04:35 AM", "replies": []}]}, {"postID": "post4808466", "text": "I wonder why they didn't go for usb-c for this device", "time": "11-06-2015 10:24 AM", "replies": []}, {"postID": "post4859399", "text": "I have owned the Moto G 2GB (2015) and have the Nexus 5X. IMO, the OnePlus X is superior to both. The only disappointment is the camera, mainly because the 5X is one of the best out there. Everything else feels higher end both when holding it and using it. IMO, the Nexus 5X doesn't feel much faster than the Moto G... but the OnePlus X speeds past both.", "time": "11-26-2015 10:26 PM", "replies": []}]}]
[{"title": "Thinking Of Getting A OnePlus X", "thread": [{"postID": "post4843991", "text": "I just have the 4G LTE question\nThe way I understand it is:\nATT - You may get LTE here and there, but you may lose it quickly. You will be on HSPA\nT-Mobile - You can get it fine now. But they are switching their LTE band so you will be in the same position as ATT. When not on LTE you will be on their 3G which is HSPA+ which in my area, Baltimore is almost as fast as LTE and sometimes faster. So not a big problem.\nI may be all wrong or spot on. Could someone help clarify and correct where needed. \nThanks", "time": "11-19-2015 06:15 PM", "replies": []}, {"postID": "post4859394", "text": "I am enjoying mine. I bought the Sandstone case and am very please. I removed the stock screen protector and don't feel the need to add one at this time. The only disappointment for me is the camera, mainly because I have been using the Nexus 5X since launch. LTE is fine in my area on AT&T. The overall build quality, in hand feel, screen and speaker beat my Nexus 5X IMO.", "time": "11-26-2015 10:22 PM", "replies": []}]}, {"title": "Got my invitation, but it's worthless without LTE", "thread": [{"postID": "post4844814", "text": "I would jump on my invitation if the X had Band 17 for ATT LTE. The phone is worthless without that LTE coverage. What a bummer!!!!!!!!!!", "time": "11-20-2015 06:42 AM", "replies": []}, {"postID": "post4845221", "text": "I agree, that stinks. I'm on T-Mobile and they're starting to roll out B12 in my area, but even my B12-equipped phones connect via B4. I'm still reluctant because I want my phone to be reasonably future-proof.", "time": "11-20-2015 09:46 AM", "replies": []}, {"postID": "post4845653", "text": "Makes no sense. The TWO has B17", "time": "11-20-2015 12:25 PM", "replies": []}, {"postID": "post4856470", "text": "Contact one plus about the Band 12, Band 17 frequency for T- Mobile and AT&T. The chat went as follows:\nServer Message:\nPlease wait. A OnePlus Support Representative will be with you shortly.\n*10:23:12 AM\nJohnedel said:\nHello Angel. My name is Johnedel how can I help you?\n*10:23:24 AM\nYou said:\nInterested in the one plus x, wondering if their will be an update for the band 12, band 17 for LTE ATT?\n*10:25:54 AM\nJohnedel said:\nThank you for reaching out. As of the moment, we are still working on this matter. We'll keep you posted on the forums about any updates on this.\n*10:29:39 AM\nYou said:\nThe hardware of the one plus x has the capability for an update to band 12, 17?\n*10:31:11 AM\nJohnedel said:\nDevice is compatible with some of the network carriers frequencies. It may work.\n*10:34:29 AM\nYou said:\nIt works but not on 4G LTE AT&T, simple question does the hardware on the one plus x have the capability to upgrade the firmware to carry the band 12, band 17 frequency?\n*10:36:31 AM\nJohnedel said:\nYes. It can carry the band but as of the moment we have some compatibility issues with the networks. We will update you on the forums about any progres on this matter,\n*10:38:21 AM\nYou said:\nThank you.\n*10:38:43 AM\nPosted via the Android Central App", "time": "11-25-2015 09:45 AM", "replies": []}, {"postID": "post4859387", "text": "Just for some clarity, it is not a horrible experience for all users on AT&T. I am actually seeing better LTE signal where I live with my OnePlus X than with my LG Nexus 5X. It all depends where you live. I was worried it would be a horrible experience, but it is not. Personally, I also love to use the device way more than the Nexus.", "time": "11-26-2015 10:18 PM", "replies": []}]}, {"title": "OnePlus X live coverage", "thread": [{"postID": "post4784762", "text": "This thread you can find latest oneplus x news,specification , price and other something you want to know.\noneplus X uses the front and rear are 2.5D curved glass design, metal frame, bottom dual speakers and USB-Type C and use a symmetric design.", "time": "10-28-2015 11:29 PM", "replies": []}, {"postID": "post4784790", "text": "Welcome to Android Central! It's supposed to be officially unveiled tomorrow. OnePlus X phone to be unveiled on October 29th", "time": "10-28-2015 11:57 PM", "replies": []}]}]
