[{"title": "launcher3 keeps stopping", "thread": [{"postID": "post6194040", "text": "I am using nokia 6.I tried clearing cache and cleared data and rebooted but the error is constantly popping no matter how many times I booted.Even the settings app is crashing.I rebooted in safe mode even then the error is popping.I tried 3rd party launchers.Even those launchers are constantly crashing.This is really annoying.Any suggestions would be appreciated.", "time": "03-17-2018 03:48 AM", "replies": [{"postID": "post6196457", "text": "Have you tried a factory reset using Vol Up + Power? That will wipe all data and allow you to set the phone up again, if you do reset it then don't restore from a backup and install your apps one at a time to see if one of them is causing the crashes.", "time": "03-20-2018 05:12 AM", "replies": []}]}]}, {"title": "Nokia Android Updates", "thread": [{"postID": "post5915096", "text": "I got my Nokia 6 on Saturday (5/8/17) and I am very happy with it. Since that time I have had the June, July and August security updates which is really good. It shows that Nokia / HMD are really keeping on top of the security patches that Google is issuing for Version 7 of Android. I have also had the obvious app updates as well. \nInfinidim", "time": "08-07-2017 08:38 AM", "replies": []}, {"postID": "post5915181", "text": "I got the July update a few days ago, i haven't got the August one yet. I got the model that sold in the US if that makes any difference. Overall, July is not too shabby at all, still up to date enough for me so far.", "time": "08-07-2017 10:09 AM", "replies": []}, {"postID": "post5917794", "text": "Also no August update yet for me. Amazon version of the 6. I did get the July update last week", "time": "08-09-2017 10:31 AM", "replies": [{"postID": "post5918832", "text": "Where are you in the world?\nInfinidim", "time": "08-10-2017 05:00 AM", "replies": [{"postID": "post5919107", "text": "I think he is in the US like me. I have the Nokia 6 the non-Amazon ad version, I have July's update, I just checked again and I am showing up to date.", "time": "08-10-2017 10:45 AM", "replies": []}]}]}, {"postID": "post5919626", "text": "Do you know if Nokia offers the same policy as Google, with guaranteed 2 years of OS updates and 3 years of monthly Security updates?", "time": "08-10-2017 05:38 PM", "replies": [{"postID": "post5919637", "text": "Sorry, I haven't read anything about this from Nokia.", "time": "08-10-2017 05:56 PM", "replies": []}]}, {"postID": "post5920101", "text": "Will check\nInfinidim", "time": "08-11-2017 04:21 AM", "replies": []}, {"postID": "post5921169", "text": "Here is the warrantee statement with regards to the physical hardware - \n(i) Twenty-Four (24) months for the main device including non-user-replaceable batteries, and\n(ii) Six (6) months for all user-replaceable batteries, covers, cables, chargers, headsets and any other accessory included in the sales package of the main device.\nManufacturer does not provide any Warranty for the following: 1. User guides; 2. Any (i) third party software, settings, content, data, or links installed or downloaded onto your Product at any time, or (ii) Manufacturer and third party services or enabling clients even if preinstalled by Manufacturer (please read the terms and conditions that may accompany the services as those will define your rights and obligations); 3. Any (i) normal wear and tear, (ii) reduced charging capacity of the battery resulting from its natural end of Product life, or (iii) pixel defects in your Product’s display that are within the scope of industry standards; 4. SIM card and/or any cellular or other networks or system on which your Product operates; or 5. Errors or damage caused by: (i) misuse or not using your Product in accordance with the user guide, such as (but not limited to) if the Product has been exposed to damage resulting from liquid outside of the approved levels, to extreme electromagnetic field (such as damages caused by microwave oven), to dampness, to extreme thermal or environmental conditions or to rapid changes in such conditions, corrosion, oxidation, spillage of food or liquid, or to influence from chemical products, (ii) using your Product with, or connecting it to, any product, accessory, software, or service not manufactured or supplied by Manufacturer, (iii) any products combined with your Product by a third party, (iv) damage or errors caused by hacking, cracking, viruses, or other malware, or by unauthorised access to services, accounts, computer systems, or networks; or (v) other acts beyond Manufacturer’s reasonable control.\nI can't see anything specific about the software firmware but I am assuming currently that it is also two years as well.\nIf I find anything else out I will post it here as well.\nInfinidim", "time": "08-12-2017 05:32 AM", "replies": []}, {"postID": "post5970145", "text": "Just got the latest update for my Nokia 6. It's great that they are keeping to their promise of keeping Android up to date with security patches on a monthly basis.\nWell done HMD / Nokia.\nRegards\nInfinidim", "time": "09-12-2017 06:58 AM", "replies": [{"postID": "post5970593", "text": "Anyone.... Does it contain something about Bluetooth ??\nyou can read about my problem under my post about it...\nRix", "time": "09-12-2017 12:59 PM", "replies": []}]}, {"postID": "post5980817", "text": "Well, i just had a security update on my phone here in Denmark today. \nRix", "time": "09-18-2017 06:10 AM", "replies": []}, {"postID": "post5980819", "text": "Well, i just had a security update on my phone here in Denmark today. \nRix", "time": "09-18-2017 06:11 AM", "replies": []}, {"postID": "post6018173", "text": "I like the quick update policy of Nokia/HDM and since June I've received all updates and am now at 7.1.2. nice!\nBTW: Where are the full Change Logs of system/security updates made available?", "time": "10-13-2017 03:07 PM", "replies": [{"postID": "post6018853", "text": "Still waiting for 7.1.2 in the UK currently but I am certain it won't be long.\nInfinidim", "time": "10-14-2017 03:07 AM", "replies": [{"postID": "post6019801", "text": "7.1.2 should be the last OS update for Nougat, the next stop should be Oreo. We should still get monthly security patches though.", "time": "10-14-2017 06:45 PM", "replies": []}]}]}, {"postID": "post6030535", "text": "Still waiting for the October patch / 7.1.2 in the UK. \nThey have slipped a bit with this one.\nRegards\nInfinidim", "time": "10-21-2017 04:44 AM", "replies": [{"postID": "post6037006", "text": "I got 7.1.2 today, I am pretty impressed.", "time": "10-24-2017 09:49 PM", "replies": [{"postID": "post6037410", "text": "Still nothing in the UK yet.\nInfinidim", "time": "10-25-2017 06:14 AM", "replies": []}]}]}, {"postID": "post6046892", "text": "Nokia / HMD have let us down with update / patch for the TA-1033 in the UK this month. It's the 31st October and we still haven't got our patch / update. Not good.\nInfinidim", "time": "10-31-2017 06:56 AM", "replies": []}, {"postID": "post6048265", "text": "I just got the model 1025 7.1.2 update last night. (On T-Mobile here in the U.S.)\ninstalling now, as I post from my tablet.", "time": "11-01-2017 06:09 AM", "replies": []}, {"postID": "post6048377", "text": "Still nothing in the UK and it's now November 1st.\nNot good \nRegards\nInfinidim", "time": "11-01-2017 07:59 AM", "replies": []}, {"postID": "post6051531", "text": "Still no update either security patch or 7.1.2 update in the UK for the TA-1033.\nHMD / Nokia you have let us down this month.\nRegards\nInfinidim", "time": "11-03-2017 04:56 AM", "replies": []}, {"postID": "post6072526", "text": "Just got the 7.1.2 update for the TA-1033 Nokia 6 in the UK. It's still at security patch level October though.\nAt least they are trying now.\nI don't know whether it was that I made a formal complaint to HMD / Nokia but the update came the day after I complained.\nLets see how long it takes them to get the November patch out for 7.1.2.\nRegards\nInfinidim", "time": "11-16-2017 07:32 AM", "replies": []}, {"postID": "post6075364", "text": "Looks like there might be a bug in either the official Twitter app or the latest update that has been shipped by Nokia / HMD. The version of Android that I am talking about is 7.1.2 November security patched on the TA-1033.\nWhat happens is the official Twitter app loads and you can login but you can't see anything - tweets, messages etc. The app thinks that there is not connection either on WiFi or mobile data. I in-installed, restarted my phone, re-installed the official Twitter app but this did not fix the issue as all.\nI have also loaded \"Slimsocial for Twitter\" twitter client on my phone and this works perfectly. \nAll other apps of the phone work perfectly.\nI have raised the issue with Nokia and also tweeted it on Twitter so that Twitter are aware of it as well.\nHopefully it will be addressed quickly. \nRegards\nInfinidim", "time": "11-18-2017 04:31 AM", "replies": []}, {"postID": "post6081650", "text": "I got Nov 6th sec update", "time": "11-22-2017 06:39 PM", "replies": []}, {"postID": "post6083161", "text": "This is Twitter not Nokia issue although i have not had this issue.", "time": "11-24-2017 11:02 AM", "replies": [{"postID": "post6083940", "text": "I understand what you are saying but I have raised it with both HMD Nokia as well as Twitter. I even got an update from Twitter but it didn't fix it.\nRegards\nInfinidim", "time": "11-25-2017 05:42 AM", "replies": [{"postID": "post6111642", "text": "Twitter / HMD Nokia still haven't fixed this issue yet and I have had a couple of Twitter updates since I posted this. \nRegards\nInfinidim", "time": "12-19-2017 05:57 AM", "replies": []}]}]}, {"postID": "post6111640", "text": "No \"December Security Patch\" for 7.1.2 on the TA-1033 yet in the UK.\nHas anybody received it yet?\nRegards\nInfinidim", "time": "12-19-2017 05:56 AM", "replies": []}, {"postID": "post6112749", "text": "Just got the 2017-12 security update here in the US.\nModel 1025 if it matters..", "time": "12-20-2017 04:33 AM", "replies": [{"postID": "post6113778", "text": "Still no December security update in the UK for the TA-1033. \nRegards\nInfinidim", "time": "12-21-2017 05:33 AM", "replies": []}]}, {"postID": "post6117877", "text": "no december security patch in germany, too.\nlast one was November 6th and we have 2018 soon. \nDisappointed.", "time": "12-25-2017 07:58 PM", "replies": []}, {"postID": "post6126557", "text": "Just got the December 2017 patch to the TA-1033 in the UK.\nNext hopefully will be the January 2018 one with a patch for the \"Meltdown\" and \"Spectre\" exploits.\nRegards\nInfinidim", "time": "01-04-2018 08:42 AM", "replies": []}, {"postID": "post6128763", "text": "when will I get Oreo for Nokia 6", "time": "01-06-2018 01:08 PM", "replies": [{"postID": "post6128874", "text": "They haven't announced a release date yet, it's still in public beta.", "time": "01-06-2018 03:19 PM", "replies": []}]}, {"postID": "post6142911", "text": "Just received the January update here in the US on T-Mobile", "time": "01-22-2018 12:38 PM", "replies": []}, {"postID": "post6163042", "text": "Oreo got pushed to my phone yesterday!\nI'll report back if if it has any negative impact (battery life?, camera? ) but I'm liking it so far.\nAlso interested to see what Nokia has in store for MWC. \nThe Nokia7 renders look good.... maybe too big for me. \nI would like a snappier camera and a fingerprint sensor that works.", "time": "02-15-2018 03:25 AM", "replies": []}, {"postID": "post6188763", "text": "March security patch installed on TA-1025 here in the US", "time": "03-13-2018 05:12 AM", "replies": []}, {"postID": "post6189438", "text": "Anyone Got for the marth update for TA-1004 yet ?\nFrank", "time": "03-13-2018 04:19 PM", "replies": [{"postID": "post6189856", "text": "Wrong forum, the TA-1004 is the Nokia 8 not the Nokia 6 but to answer your question I have a TA-1012 which is also a Nokia 8 and I don't have the March update yet.", "time": "03-13-2018 09:59 PM", "replies": [{"postID": "post6189969", "text": "Ups sorry, my mistake. \nFrank", "time": "03-13-2018 11:47 PM", "replies": []}]}]}]}, {"title": "Bootloader unlock is exciting news", "thread": [{"postID": "post6002103", "text": "Just saw this in my feed.\nAll I can say is YAY! It's about time", "time": "10-03-2017 05:46 AM", "replies": []}, {"postID": "post6188414", "text": "How does the unlocked bootloader benefit us users?\nHow does it help developers, what can be enabled and configured in Nokia 6 phones when the bootloader has been opened?", "time": "03-12-2018 08:11 PM", "replies": []}, {"postID": "post6188914", "text": "With these Nokia phones running close to pure Android, and no manufacturer/carrier bloatware, there is not a huge need for root.\nI would still like to be able to run Titanium Backup and a few other applications that require access.\nDevelopers probably don't see much reason to work on a low-mid range device that has small market share and is not heavily skinned.\nSome people used to their legacy rom might choose this phone if they could install it.", "time": "03-13-2018 08:34 AM", "replies": []}]}, {"title": "Compatible SD cards for Nokia 6 and their usage?", "thread": [{"postID": "post6188405", "text": "Which SD cards are the best and compatible with Nokia 6? \nHow big can the card be?\nCan the Android 8 be configured to store all pictures and videos and all the user data to SD card only? How about the Android apps data, cache and configuration, can they too be kept in SD card, if yes how?", "time": "03-12-2018 08:05 PM", "replies": []}, {"postID": "post6188432", "text": "it is Micro SDXC compatible. \nThis means it should be fully compatible with any micro SD card currently available. That means the current max size is 400GB. It should also be compatible with new microSD cards as they become available. In theory they will eventually be available in 2TB.", "time": "03-12-2018 08:26 PM", "replies": []}]}, {"title": "FRep App & Nokia 6", "thread": [{"postID": "post5895397", "text": "Anyone have any luck using this app & Nokia 6?", "time": "07-22-2017 11:49 AM", "replies": []}, {"postID": "post5895667", "text": "isn't it working with you?", "time": "07-22-2017 03:48 PM", "replies": []}, {"postID": "post5895677", "text": "Yes, as jason noted, are you trying to see if it will work on the 6, or do you have it and need assistance in using it?", "time": "07-22-2017 03:58 PM", "replies": []}, {"postID": "post5895751", "text": "Have it but won't connect with set up program on PC.\nWorks great with Samsung.", "time": "07-22-2017 05:07 PM", "replies": [{"postID": "post5895770", "text": "Okay, will let users opin to help as I don't use that app or have your phone. A little help with the forum as you're new. When you quote text from someone's else post, as you see I've done with yours, the purpose is to let that user, and others, know your post is in response to that part of their post (you can quote partial text). You can also address more than one poster in your response, you don't have to have one for each response you get. I cleaned up a couple of your posts for that reason. Enjoy the forums and I hope you get an answer.", "time": "07-22-2017 05:20 PM", "replies": []}]}, {"postID": "post5897036", "text": "^ The answer may be long in coming. Many of us can't even buy a 6 yet.", "time": "07-23-2017 07:12 PM", "replies": []}, {"postID": "post5897508", "text": "Yes... It was just released on a special deal from Amazon.", "time": "07-24-2017 08:55 AM", "replies": []}, {"postID": "post5911126", "text": "Discovered the answer.\nHave to download the Frep set up apk for android to set up another android device. I was trying with Windows that worked for my Samsung.\nThanks for any input from you all.", "time": "08-03-2017 03:27 PM", "replies": [{"postID": "post6183442", "text": "Well, it worked from the APK at first and now nothing. Anyone else out there give it a try?\nThanks again.", "time": "03-08-2018 04:28 PM", "replies": []}]}]}, {"title": "Nokia 6 - latest Google Security patch causing frequent crashes and heating up of phone", "thread": [{"postID": "post6151305", "text": "Hi I have updated Google security patch for Nokia 6 day before yesterday and since then my phone keeps on heating up badly while charging and also my phone app crashes when i get a call waiting while on another call. Not only that, but my phone app keeps on crashing. Please suggest a solution?", "time": "02-01-2018 02:50 AM", "replies": []}, {"postID": "post6151627", "text": "Welcome to Android Central! Try wiping the cache partition, which won't erase any personal data: How to Hard Reset the Nokia 6. Make sure you select Wipe Cache Partition, and not Wipe Data.", "time": "02-01-2018 11:09 AM", "replies": []}, {"postID": "post6182420", "text": "I tried updating my google security patch for my Nokia 6 and after that my phone keeps rebooting at interval...", "time": "03-07-2018 06:17 PM", "replies": []}, {"postID": "post6183010", "text": "Which security patch are you on? Have you also tried the steps posted above or a factory reset after backing up any important data?", "time": "03-08-2018 10:45 AM", "replies": []}]}, {"title": "Why is my Nokia 6 is not unlocking", "thread": [{"postID": "post6141756", "text": "I was browsing on chrome, on tapping upon a photo and tapping back the phone screen turned black. On pressing the power key the lock screen appeared but none of icon were working on tapping (icons like swipe to unlock, camera and call) and then the screen blacked out. After that lockscreen is appearing and blacking out again and again...", "time": "01-21-2018 07:27 AM", "replies": [{"postID": "post6169240", "text": "", "time": "02-22-2018 11:06 AM", "replies": []}]}, {"postID": "post6141790", "text": "It sounds like a hardware or software failure, but try booting into Recovery for a Cache Partition wipe. \nAlso, if you're using an SD card, it may just be causing trouble.", "time": "01-21-2018 08:30 AM", "replies": []}, {"postID": "post6169243", "text": "Nokia 6 is giving me trouble in unlocking phone.not even single icon is working. Only option am left with is switch off on that's it.how can I get help? Last month only I purchased it?", "time": "02-22-2018 11:08 AM", "replies": []}, {"postID": "post6169795", "text": "I would say get that exchanged, or try downgrading Android version.", "time": "02-22-2018 08:42 PM", "replies": []}]}, {"title": "on the nokia 6 does it have the loop home screen option ?", "thread": [{"postID": "post6085996", "text": "I'm thinking off buying the nokia 6 ( was a diehard fan until Microsoft got hold of them ) since then have been using a LG G3 , which has a loop screen option for the home screens. was wondering if the nokia 6 does ?\nOubadah ~ the screen I see doesn't show the option . and the version # is 7.0030.11", "time": "11-26-2017 08:55 PM", "replies": []}, {"postID": "post6087839", "text": "Don't know the LG G3 - can you describe the loop screen option you mean?", "time": "11-28-2017 09:46 AM", "replies": []}, {"postID": "post6092220", "text": "If you mean “can you cycle through home screen panels endlessly in either direction”, then yes, there is a loop home screen option. I’ve attached a screenshot of the setting.\nYou access it by long pressing the home screen and tapping Settings.", "time": "12-01-2017 03:28 AM", "replies": []}, {"postID": "post6095902", "text": "Oubadah ~~ thanks , I see the screen but like the 1st 2 are grayed out in your picture that's the same on mine, but I still cant chose the screen cycle scroll. I only have a few days left to get this figured out. ( buyers remorse is 10 days with no questions asked after that theres a hefty re stock fee. trying to avoid that )oh and it has been factory reset, with no apps other then stock.", "time": "12-04-2017 05:59 PM", "replies": []}, {"postID": "post6095913", "text": "", "time": "12-04-2017 06:14 PM", "replies": []}, {"postID": "post6104205", "text": "You have to drag an app to the right screen, then when you do settings, the top blue toggles will be blue. Then you turn off the \"show google app\", and the screen cycle scroll toggle will be available to turn on. Hope you get this before return.", "time": "12-11-2017 09:06 PM", "replies": []}, {"postID": "post6116996", "text": "ok so I have tried all the sugjestions here and none worked. they sent me out a replacement same thing. it seems to only be affected in the amazon prime version. i purchased a non prime version & the option is there. and works fine. will try to compare the internal state of the 2 to see whats so different before returning the replacement one. if I see something i'll update. thanks for the help :-)", "time": "12-24-2017 01:40 PM", "replies": []}, {"postID": "post6169229", "text": "That's cool", "time": "02-22-2018 10:53 AM", "replies": []}]}, {"title": "WhatsApp notifications", "thread": [{"postID": "post6168522", "text": "I've newly released Android 8 in my Nokia 6. In WhatsApp you can use different ring tones for personal message and group conversations. I've been setting up separate ringtones for both, but after the device restart or after a little while it reverts back to Default Notification Tone. Any tips/Suggestions?", "time": "02-21-2018 02:21 PM", "replies": []}, {"postID": "post6168592", "text": "Have you tried reinstalling WhatsApp?", "time": "02-21-2018 03:46 PM", "replies": []}, {"postID": "post6168616", "text": "yes. i did. but its the same situation", "time": "02-21-2018 04:08 PM", "replies": []}]}, {"title": "Nokia 6 Charger - Manufacturing Specifications", "thread": [{"postID": "post6166002", "text": "What are the Nokia 6 (Android) charger specifications?", "time": "02-18-2018 05:37 PM", "replies": []}]}, {"title": "Nokia 6 February security update Android 8.0", "thread": [{"postID": "post6163195", "text": "Today released February Security update.", "time": "02-15-2018 08:20 AM", "replies": []}, {"postID": "post6164340", "text": "And I am happy for that!\nA few little hiccups, but I will wait to see before I criticize", "time": "02-16-2018 01:10 PM", "replies": []}]}, {"title": "i broke my nokia 6", "thread": [{"postID": "post6162282", "text": "tried to install ta 1025 rom in ta 1000 model well (using adb and la ost)\nnow the phone shut down everytime it reach no command for split second \nif there is no way to fix this would you recommand a midrange phone that i can install twrp witout problem so i can root and play with roms when im borred .\n(there is no support near us)", "time": "02-14-2018 05:41 AM", "replies": []}, {"postID": "post6162412", "text": "Are you able to enter Recovery Mode?How To: Enter Recovery Mode on Nokia 6 - Tutorial / Guide", "time": "02-14-2018 09:56 AM", "replies": []}, {"postID": "post6162500", "text": "no i used to get no command i ccan pass it by volume up + power but now \nno ccommand last only a split second before the phone turn off i cant even do tricks to pass no command because the phone is shutting down \ncant accces download no more nothing is working", "time": "02-14-2018 11:36 AM", "replies": []}, {"postID": "post6162532", "text": "i have uploaded a video of the problem :", "time": "02-14-2018 12:21 PM", "replies": [{"postID": "post6163259", "text": "You need to connect the device to your PC first with a USB cable. When you see the battery indicator in the middle of the screen that's when you can perform the steps to enter recovery mode.", "time": "02-15-2018 09:41 AM", "replies": []}]}]}, {"title": "Using micro SD card in Nokia 6", "thread": [{"postID": "post6139614", "text": "Hey there, I just got the Nokia 6 and put a micro SD card in there to expand the storage. I chose the option to format the card as internal storage rather than external. Did I do the wrong thing? I want to put lots of music on this phone and some apps. The storage indicator shows the main storage is almost full and just a little bit of external SD storage has been used.\nI've now read that this phone needs alot of stuff to be on the root storage to run properly. What do I do now? I want to keep adding more music files on here.\nThanks", "time": "01-18-2018 12:19 PM", "replies": []}, {"postID": "post6139796", "text": "When you \"move\" an app to the SD card, small pieces of it get moved. For each piece, there's a link left in internal storage, so if the pieces aren't a lot smaller than the links, you aren't saving anything.\nBut if the card is formatted as internal storage, you have no choice where apps go - all of storage, the eMMC in the phone and the SD on the card, are one big block of storage, and Android decides which goes where.\nDid you do wrong? I think so. If the phone doesn't have enough internal storage for all your apps, you need a phone with more internal storage, or fewer apps. SD cards have a limited number of write cycles, and an app moved to the SD card may write to where it's stored. Also, if the card fails, your data could be gone.", "time": "01-18-2018 04:57 PM", "replies": []}]}, {"title": "Copy music files from Google Drive to library?", "thread": [{"postID": "post6130098", "text": "I have bought Nokia 6 and am wondering whether I made the good choice. First of all I don't see an app called \"Music\". When I try to upload a file to become a new ringing tone it tries to do it from a place which looks like music library but is empty. Is it possible to copy such a file from Google Drive to that place? I live in Bulgaria.", "time": "01-08-2018 06:05 AM", "replies": []}, {"postID": "post6130243", "text": "Google Play Music is the default music player on variants of the Nokia 6 that have Google Play services.\nWhere are you uploading the file from?", "time": "01-08-2018 09:47 AM", "replies": [{"postID": "post6130964", "text": "Thank you for answering! In fact I managed to perform the operation. Found a video in youtube. I just wanted to upload from my computer an mp3 to make a new ringtone. For some reason the USB driver for Nokia did not work properly and I copied the mp3 from my comp to Google Drive. Expected that there is an easy way to copy files from Drive to Nokia memory. No, there is no easy way. I had to go to Settings, Storage, download etc, to perform this quite simple task. If you are interested, this is the video. They speak there some strange language but the video is enough to guess what to do. \nAnyway sorry for Noikia, I was a fan, had from the old phones. There was a Nokia PC suit for it that was marvelous and gave access to everything in phone.", "time": "01-09-2018 01:40 AM", "replies": []}]}]}, {"title": "2018 Nokia 6 leaked - Is this the new budget smartphone champ?", "thread": [{"postID": "post6127074", "text": "https://www.androidcentral.com/nokia-6-2018\nSeems to be reasonably priced. Plus with Amazon Lock Screen Offers this should be an even better deal.", "time": "01-04-2018 05:20 PM", "replies": []}, {"postID": "post6128302", "text": "Looks pretty good, lots of improvements and still the same great price. See also here: https://arstechnica.com/gadgets/2018...eps-230-price/", "time": "01-05-2018 09:43 PM", "replies": []}]}, {"title": "app activation when phone off and in pocket", "thread": [{"postID": "post6109298", "text": "might be a newbie android user issue, but anyway...\nseveral times now my Nokia 6 has launched apps, made settings, and made calls when the phone is OFF and in my pocket. I am 99% sure it only when the headset is connected.\nI am using a new Plantronics explorer 80 headset.\nphone has:gone into aeroplane modeset do not disturblaunched various apps, including facebook and posted shared links.made outgoing callsmade 30 outgoing calls while I was on a long outgoing call.\nhave a few apps installed to help with notifications - Calendar Notify and Glimpse.\nwhere should I be looking to sort this issue?", "time": "12-16-2017 08:32 PM", "replies": []}, {"postID": "post6110869", "text": "Welcome to Android Central! It might just be that the Power button is inadvertently being pressed while in your pocket, and then when the screen is on, there are random touches happening that lead to these events. When you press Power, do you get a password entry screen, a swipe-to-unlock screen, or does it just go straight to the homescreen?", "time": "12-18-2017 12:13 PM", "replies": [{"postID": "post6112302", "text": "thanks. when I press the power button it asks me for fingerprint, so it shouldn't be turning on by itself.", "time": "12-19-2017 05:44 PM", "replies": []}]}, {"postID": "post6112372", "text": "Ok -- and does the screen lock automatically once it goes to sleep?", "time": "12-19-2017 07:04 PM", "replies": [{"postID": "post6113700", "text": "yes.", "time": "12-21-2017 01:08 AM", "replies": []}]}, {"postID": "post6112375", "text": "Also, do you have the headset defined as a trusted device in the smart lock settings? If so, it could mean that your phone doesn't need to be unlocked when the headset is detected.", "time": "12-19-2017 07:08 PM", "replies": [{"postID": "post6113702", "text": "yes, it is.\nbut I guess that is so it can answer calls etc?\nwhat do I lose if I turn that off?", "time": "12-21-2017 01:10 AM", "replies": [{"postID": "post6113909", "text": "Trusted devices are used to avoid the phone being locked while paired. It won't affect the normal use of the phone, the only change is that you don't need to enter your unlock method every time.", "time": "12-21-2017 08:41 AM", "replies": [{"postID": "post6114401", "text": "which means it might be more likely to pocket dial?", "time": "12-21-2017 06:30 PM", "replies": [{"postID": "post6114430", "text": "Exactly. That's what what I think. I'm not using trusted devices anymore, being 'pocket dial' one of the reasons. With the fingerprint sensor I don't see them very useful anymore.", "time": "12-21-2017 07:05 PM", "replies": []}]}]}]}]}, {"postID": "post6118772", "text": "I have untrusted and haven't had the issue again.\nwill see how it goes\nthanks.", "time": "12-26-2017 07:12 PM", "replies": []}]}, {"title": "Change notification sounds", "thread": [{"postID": "post6099219", "text": "How can I get a different email notification to a text one on a Nokia 6 please.", "time": "12-07-2017 01:19 PM", "replies": []}, {"postID": "post6100710", "text": "Welcome to Android Central! In general, you can open an app's menu and look for notification settings. If the app allows it, you should be able to choose a different notification tone there, which will be different from the system default. That should be possible with any Email app, but there are other apps that don't allow it (like Facebook, I think).", "time": "12-08-2017 04:18 PM", "replies": []}]}, {"title": "Low battery temperature", "thread": [{"postID": "post6096932", "text": "Brand new Nokia 6, and it wakes me in the night to tell me it had paused charging because the battery temperature is too low. \nI don't mind that it is saving the battery by not charging below 15c, but why bypass my \"do not disturb\" rules and wake me at 3am to tell me this! The only way I can silence this is to manually mute the volume each night.\nAnyone else have this problem? Or know of a workaround?", "time": "12-05-2017 05:05 PM", "replies": []}, {"postID": "post6097217", "text": "Welcome to Android Central! I recall seeing this issue mentioned (mostly on Samsung phone) after water exposure. Has there been any water damage to the phone?", "time": "12-06-2017 12:20 AM", "replies": []}, {"postID": "post6097377", "text": "Never seen it on mine and I have had my TA-1033 since they first came out in the UK.\nRegards\nInfinidim", "time": "12-06-2017 05:26 AM", "replies": []}]}, {"title": "Nokia 8 gets Oreo, the 6 is next", "thread": [{"postID": "post6083164", "text": "Oreo is rolling out to the Nokia 8, the 6 nd 5 are next.https://www.androidcentral.com/nokia...ampaign=social", "time": "11-24-2017 11:03 AM", "replies": []}, {"postID": "post6083941", "text": "That will be good.\nI like my Nokia 6 and it is working well but does have one issue with Twitter currently which Nokia and Twitter are investigating. My Nokia 6 is a TA-1033 model so this issue might not impact everybody with a Nokia 6.\nRegards\nInfinidim", "time": "11-25-2017 05:45 AM", "replies": []}, {"postID": "post6084607", "text": "Hopefully Twitter resolves it soon for you, who knows maybe 8.0 fixes it.", "time": "11-25-2017 06:10 PM", "replies": [{"postID": "post6085053", "text": "I really hope so. I do have a Twitter client working though so it must be either a Twitter or Android issue introduced in 7.1.2 November security patch as it worked on the original upgrade to 7.1.2 that HMD Nokia sent out.\nRegards\nInfinidim", "time": "11-26-2017 06:07 AM", "replies": []}]}]}, {"title": "Does anyone else see strange Inertial Scrolling behavior in Chrome?", "thread": [{"postID": "post6046844", "text": "Inertial scrolling doesn't work if I swipe above a certain speed. This appears to only happen in Chrome, inertial scrolling works normally in the Settings app etc. \nScrolling works as expected on my HTC One M7 with the same version of Chrome.\nAnyone else seeing this?", "time": "10-31-2017 06:03 AM", "replies": []}, {"postID": "post6048385", "text": "Yes, seem to have it here with a TA-1033 Nokia 6 7.1.1 September security patch currently.\nRegards\nInfinidim", "time": "11-01-2017 08:03 AM", "replies": [{"postID": "post6050804", "text": "Thanks. Also found some other users with the issue here: https://forum.xda-developers.com/nok...vior-t3697487/\nAs one of them suggested, I have now emailed Nokia Support about the issue. Hopefully if enough of us report the issue it will get resolved.", "time": "11-02-2017 04:43 PM", "replies": [{"postID": "post6051527", "text": "Thanks for the update.\nHave you had the October security update or an update to 7.1.2 yet as I haven't in the UK on the TA-1033.\nRegards\nInfinidim", "time": "11-03-2017 04:51 AM", "replies": []}]}]}, {"postID": "post6057918", "text": "I had to return my phone (bad USB port, and now the replacement has at least 10 bad pixels - NOT impressed, Nokia), so I had the opportunity to make the following observations:\nAndroid 7.1.1 June 2017 + Chrome 56.0.2924.78 = inertial scrolling working\nAndroid 7.1.2 October 2017 + Chrome 56.0.2924.78 = inertial scrolling working\nAndroid 7.1.2 October 2017 + Chrome 62.0.3202.84 = as per my video\nI chose not to call the first two \"normal scrolling\", because the scrolling still felt a little weird. Definitely sluggish compared to the HTC One M7. But it wasn't being stopped short like the video.", "time": "11-07-2017 06:04 AM", "replies": [{"postID": "post6059604", "text": "That's not good news about the pixels.\nStill waiting for the 7.1.2 update for the TA-1033. When I contacted Nokia they gave the \"stock\" reply - depends on model, country and carrier which is basically rubbish when it's an unlocked phone like mine and I am sure a lot of Nokia 6's in the UK. \nOnce I get 7.1.2 then I will give another check to this. I am also using Microsoft Edge on my phone which seems long to load - it's in preview so it will be the diagnostics code and the code not optimised - but it scrolls ok on my phone.\nRegards\nInfinidim", "time": "11-08-2017 05:50 AM", "replies": [{"postID": "post6064170", "text": "The pixels suck, and I don't think I'll be able to return the phone because my only option is to take it back to the showroom. The showroom with it's bright fluorescent lighting and it's clueless staff, and then me trying to point out bright sub-pixels on a 400PPI screen.\nAgainst my better judgement, I purchased another Nokia 6. No pixel defects but lo and behold; the same misaligned port issue as my first unit. Regardless of software issues, I can no longer recommend this phone to anyone. HMD global clearly has no concept of QC.\nI tried Edge and it was better than I expected. What I would really like to use is Firefox, because it supports proper content blocker extensions. But it still has unacceptable site formatting issues.", "time": "11-10-2017 10:02 PM", "replies": [{"postID": "post6064429", "text": "I had the mis-aligned port issue but it wasn't too bad. \nI think it is an issue that HMD / Nokia need to resolve. \nI am expecting to have to buy another Nokia 6 because my wife's phone (Lumia 950) is starting to show it's age (it's no longer in warrantee) and needs a new battery (they are so expensive). Also as Windows 10 Mobile is dead she wants to change to something that will at least last a few years.\nStill haven't go 7.1.2 or the October / November security update in the UK. HMD / Nokia have really let the UK Nokia 6 customers down. Raised it with HMD / Nokia support and got the same old rubbish - it depends on model, network supplier and region..... I did point out to them that we have been getting regular updates till October, after that they basically went vary quiet.\nRegards\nInfinidim", "time": "11-11-2017 04:09 AM", "replies": []}]}]}]}]}, {"title": "home screen grid size", "thread": [{"postID": "post6057854", "text": "Is there a way to adjust grid size on the nokia 6?\nUsually on my other devices i have an option to adjust the grid size when i tap on settings but not on the 6 (running android 7.1.2)\nwhat i mean is i want 4 icons max per row but at the moment it allows up to 5\nalso for the life of me i could not figure out how to get the app drawer icon.\nany help is greatly appreciated.", "time": "11-07-2017 03:44 AM", "replies": []}, {"postID": "post6057886", "text": "ah i gave up and just used a 3rd party launcher", "time": "11-07-2017 05:03 AM", "replies": [{"postID": "post6059600", "text": "Same here.\nRegards\nInfinidim", "time": "11-08-2017 05:46 AM", "replies": []}]}]}, {"title": "Nokia 6 7.1.2 \"Can't download\"", "thread": [{"postID": "post6056549", "text": "I just bought a new Nokia 6 Android Device from Best Buy in the USA. \nModel: TA-1025\nAndroid Version: 7.1.1\nAndroid Security Patch Level: July 1, 2017\nI click on System Update - it appears to try, then comes back with \"Couldn't download\". It appears to be trying to download \"Update Google Security Patch 2017-08\" - update size 119.0 MB\nAny tips on how to handle this?", "time": "11-06-2017 10:12 AM", "replies": []}, {"postID": "post6056712", "text": "Well I as able to determine the error. The phone did not like my router. Hooking it up to my other cellphone and using it as a hotspot allowed it to update. \nMy router was using OpenDNS and had \"b/g protection\" enabled. Getting the first update, changing from OpenDNS to Google DNS and disabling b/g protection... so I am not sure which of those 3 actually made it work... but regardless it is updating and working well now.\nIt is odd because aside from not getting the OS/Firmware update -- the phone was updating via Wifi (apps), surfing, etc... great. I did not put a SIM inside the phone.", "time": "11-06-2017 12:38 PM", "replies": []}, {"postID": "post6057873", "text": "We're still waiting for 7.1.2 in the UK ( TA-1033). I noticed that Google has now released the November patch for their devices as well. \nCome on HMD / Nokia get us up to date please. \nRegards\nInfinidim", "time": "11-07-2017 04:16 AM", "replies": []}]}, {"title": "Nokia 6 Dolby Atmos", "thread": [{"postID": "post6004552", "text": "Does it significantly improve the sound and amplification of the music coming from the headphone jack? I'm thinking of getting one of these just to use to play Pandora and personal music files through my car stereo, but I don't want to spend the money if it's not worthwhile.", "time": "10-04-2017 04:53 PM", "replies": []}, {"postID": "post6004748", "text": "I don't know if this link answers your questions or not but this is the best I could find.\nGood luck.Video: Dolby Atmos on #Nokia 6 is amazing | Nokiamob", "time": "10-04-2017 06:54 PM", "replies": []}, {"postID": "post6051757", "text": "I know it pushes a lot more bass through my android auto in my car, but that's not through a headphone jack. In fact, I'm not sure if AA uses the usb cord for music data or bluetooth when it's playing over the cars speakers.", "time": "11-03-2017 08:42 AM", "replies": [{"postID": "post6053258", "text": "When I use mine in the car it is using Bluetooth.\nRegards\nInfinidim", "time": "11-04-2017 05:42 AM", "replies": []}]}]}, {"title": "How to 'unflip' selfie images?", "thread": [{"postID": "post6051583", "text": "I have a Nokia 6.. I like everything of it except the selfie camera.. whenever I take a selfie it flips which I don't want...can I disable this in any ways?", "time": "11-03-2017 06:04 AM", "replies": []}, {"postID": "post6051966", "text": "Welcome to Android Central! Look in the camera settings for a Mirror Mode option. Or when you're in Selfie mode, look on the screen for an icon that looks like a flip icon.", "time": "11-03-2017 10:39 AM", "replies": []}]}, {"title": "Getting one today. Anyone running Android Auto?", "thread": [{"postID": "post6048415", "text": "Any issues connecting?\nThis is a huge deal to me. If I can't get it to run AA, I'll have to switch to something else.\nI've read of some issues people were having, but I'm taking a leap of faith.", "time": "11-01-2017 08:34 AM", "replies": []}, {"postID": "post6049023", "text": "Got phone. Got it activated.\nOh my, it's pretty in Copper.\nGot through all the updates including 7.1.2, and this is the purest android I've seen since my old LG Nexus 5. Everything came over from old phone perfect. Held my breath and went out to my chevy truck to try AA on it's 8-inch Chevy Mylink headunit.\nNot only does it work, but it works faster and smoother than my old moto g4+, my daughter's S8, and my son's LG G6. I mean it couldn't be any better. Voice commands are instantly recognized and responded to.\nAlso noticed streaming my songs from Google Music service sounded better. I'm not sure, but I suspect it's being pumped up a little by Dolby Atmos.\nGot everything I wanted with front fingerprint reader, AA compatibility, nice size, plus NFC! Can't wait to try out android pay.", "time": "11-01-2017 02:54 PM", "replies": []}, {"postID": "post6049959", "text": "I run \"HERE WeGo\" with off-line maps.\nRegards\nInfinidim", "time": "11-02-2017 07:39 AM", "replies": []}]}, {"title": "Is the Nokia 6 worthy?", "thread": [{"postID": "post6014694", "text": "I'm considering buying a Nokia 6. I'm trying to find a good phone in Android camp since I'm coming from W10M but the amount of options are really overwhelming.\nI'm a fan from Nokia and this is the closest I can get to the original Nokias before Microsoft acquisition.\nSo, is this phone worthy or a Moto G5 or Galaxy J7 Pro are the real options?\nIf you need more information I can answer questions.", "time": "10-11-2017 01:09 AM", "replies": [{"postID": "post6016085", "text": "The Nokia 6 compares pretty favorably to those devices, it's really just down to the \"small\" things you might need (NFC, screen size, notification LED, removable battery, etc) as that's different across the devices.https://www.phonearena.com/phones/co...21,10392,10394", "time": "10-11-2017 11:40 PM", "replies": []}]}, {"postID": "post6016183", "text": "I've had mine in the UK since they came out and I am really happy with it. \nI also moved from a Windows 10 Mobile Lumia 950 - Ok the camera is not as good but for what I use it for it's great. Also getting monthly patches from HMD / Nokia is a real bonus.\nRegards\nInfinidim", "time": "10-12-2017 04:16 AM", "replies": []}, {"postID": "post6016225", "text": "Loving mine. Using it over a Note 4 and S7 Edge that I have. it's fast enough despite what the tech reviewers would tell you. screen is nice. build quality is as good as any flagship device. camera is better than people give it credit for. lack of OIS can be problematic in some situations but it's perfectly serviceable and will take great shots if you know what you're doing.\nbtw mine has NFC. updates are speedy. we got 7.1.2 today.", "time": "10-12-2017 05:32 AM", "replies": []}, {"postID": "post6016253", "text": "I recently moved from WM10 Lumia 950 to a Nokia 8 and my wife got a Nokia 6. They are both great phones IMHO. The 6 is built like a tank and the 8 looks almost as robust. The difference between the two is a better camera and screen on the 8. You may prefer the look and feel of the 8 as well. \nIt's more expensive so up to you.", "time": "10-12-2017 06:21 AM", "replies": []}, {"postID": "post6016254", "text": "I recently moved from WM10 Lumia 950 to a Nokia 8 and my wife got a Nokia 6. They are both great phones IMHO. The 6 is built like a tank and the 8 looks almost as robust. The difference between the two is a better camera and screen on the 8. You may prefer the look and feel of the 8 as well. \nIt's more expensive so up to you.", "time": "10-12-2017 06:21 AM", "replies": []}, {"postID": "post6017439", "text": "We are also about to get an update to Android 7.1.2 - October patch I think. So Nokia / HMD are really keeping on top of he operating side as well.\nRegards\nInfinidim", "time": "10-13-2017 01:28 AM", "replies": []}, {"postID": "post6018163", "text": "Yes it is worthy, hw is better for it's price, metal feels and looks good, display is clear and bright, vanilla Nougat with quick security/system updates (just received the 7.1.2 update) and will get Oreo among the first etc.\nNokia and HDM have really made a great phone and this (and the 8 and 9 etc) are the closest you can get that reminds one from the times of Symbian, Maemo, Meego (N9xx series) greatness times, hardware-wise that is. With Nokia 6, for the first time, I started using Android and I really like it being non-customized plain Nougat (Oreo) system w/o all those other manufacturers horrible UI customisations and system tweaks and hacks.\nRecommended warmly 🙂", "time": "10-13-2017 03:02 PM", "replies": []}, {"postID": "post6048581", "text": "I'm getting mine today, but I can tell you that coming from the Moto line, that motorola has made a design decision that ended my fandom. They make great phones, but for some stupid reason they decided that the earpiece speaker could also double as a speakerphone speaker and a ringer speaker. At least once a month the phone would trick me into holding it next to my ear canal while it screamed \"CALLING JOHN DOE - MOBILE!!!\" into my ear, or worse, ringing when I didn't swipe to answer quite right. Seriously, it hurts like hell and I cuss and throw it every time.\nIt never broke, but I'm sick of it.", "time": "11-01-2017 10:11 AM", "replies": []}]}, {"title": "Availability", "thread": [{"postID": "post5694474", "text": "Will this device be available worldwide, or will it be in a specific region?", "time": "02-28-2017 02:41 PM", "replies": []}, {"postID": "post5694779", "text": "World wide as of now... Waiting to buy when available in India", "time": "02-28-2017 07:10 PM", "replies": []}, {"postID": "post5810925", "text": "Patiently waiting..", "time": "05-11-2017 08:33 PM", "replies": []}, {"postID": "post5811193", "text": "I'm also waiting in the UK", "time": "05-12-2017 03:15 AM", "replies": []}, {"postID": "post5827710", "text": "< Waiting in the US.", "time": "05-25-2017 10:18 AM", "replies": [{"postID": "post6045037", "text": "Any word for this u.s. that Nokia available?", "time": "10-30-2017 12:09 AM", "replies": [{"postID": "post6045050", "text": "The Nokia 6 has been available from Amazon here in the US since the middle of August.\nIt only works on GSM bands, so AT&T & T-Mobile but not Verizon or Sprint.", "time": "10-30-2017 12:40 AM", "replies": []}]}]}, {"postID": "post5836524", "text": "So excited to see this manufacturer coming out with more phones!! Hopefully they will come to Canada.", "time": "06-02-2017 09:50 AM", "replies": [{"postID": "post5837301", "text": "It will be good to see the top end phones that they come out with given that the team in Finland that does the designs is basically the original Nokia team.", "time": "06-03-2017 04:54 AM", "replies": [{"postID": "post5837945", "text": "Can't wait to see what they come up with!", "time": "06-03-2017 06:26 PM", "replies": []}]}, {"postID": "post5865912", "text": "Morty2264. Will you consider the Nokia 6 or stay put with the Honor 8?", "time": "06-27-2017 09:17 PM", "replies": []}]}, {"postID": "post5848958", "text": "Its now officially launched in India for 15000 which is approx $230.\nFor that you get SD430,3gb ram, 32gb storage. \nBetter value than Nokia 3 and 5 but still poor in comparison to the competition. \nMoto G5 Plus offers SD625,4gb ram, 64gb storage for the same price. \nThere's Zuk Z2 which offers SD820 for the similar price. \nSo Nokia has again shot itself in the foot by offering an overpriced device.", "time": "06-13-2017 08:29 AM", "replies": [{"postID": "post5871673", "text": "TBH, I would still go for the Nokia.\nSpecs are nice, but usability matters as well. $200 phones aren't known for great build quality and/or timely updates. The Nokia 6 does receive timely updates and will get Android O and maybe P (at least according to the 2 years of OS upgrades claim), which is really unheard of in the world of budget phones, as most only offer one OS upgrade.\nThe ZUK is definitely beefier, but I am not a fan of Lenovo's skin. And the Moto G5+ is arguably the closest competitor to the 6, with similar software and other stuff that it can do better than the Nokia at the same price. But ultimately, I would have to go with Nokia because its build along with the promise of timely updates for at least 2 years when it comes to OS upgrades are a huge factor.\nIt's not the beefiest, nor is it the most feature-packed. But for my needs, it's what I've wanted out of a budget phone for a while.", "time": "07-03-2017 06:47 AM", "replies": [{"postID": "post5871806", "text": "I agree with the build quality but promise of timely updates? Let's break it into two separate words timely and updates. \nTimely is impossible so its not gonna happen. \nUpdates? I don't think it will get Android P. Not that's a bad thing as its not a flagship but just because nokia said timely updates doesn't mean they will stick to that promise. Its easy to lie to sell your product, once its sold you no longer matter.", "time": "07-03-2017 09:04 AM", "replies": [{"postID": "post5871808", "text": "Well, I am getting one so we'll see how it holds up.\nSo far, the 6 seems to be getting its updates. It's gotten April, May and June plus 7.1.1.\nI don't think anyone is really expecting Android P to come to a budget phone even if HMD claims 2 years of OS upgrades at least, but if that is certainly the case, color me impressed.\nInterestingly, the update promise is actually plastered on Nokia billboards over here. They're making a big deal out of this. Failure to live up to that would probably make them even more of a laughing stock than OnePlus' failure to deliver Nougat to the OP2.", "time": "07-03-2017 09:06 AM", "replies": [{"postID": "post5871826", "text": "I appreciate you choosing nokia, the build quality is indeed great and phone ia decent for the price. \nI've had two nokia smartphones before and build quality is always tough. \nLet's see if nokia is able to deliver Android O before the end of the year. \nI've always been a big nokia fan but the prices of nokia 3, 5 and 6 disappointed me and i lost interest. \nBut if build quality and timely updates holds true then nokia 6 is a good choice.", "time": "07-03-2017 09:31 AM", "replies": [{"postID": "post5871831", "text": "We don't get the ZUK over here. Just the G5+ and a couple of Xiaomis.\nI decided on the Nokia because it was different and wanted to relive my nostalgia. \nIf HMD really keeps its promise on updates for the 2 years stated, even bringing Android P (it would really be a nice surprise), then I think they would have become a fan favorite. Hope they continue on the updates. Only a few have actually publicly made a firm stand on updates.", "time": "07-03-2017 09:36 AM", "replies": []}]}]}]}]}]}, {"postID": "post5865593", "text": "Amazon is carrying them soon. Just checked, they offered ads and non-ads. Might consider it since it's pure Android with mirco SD.", "time": "06-27-2017 03:59 PM", "replies": []}, {"postID": "post5872830", "text": "From what I understand from China the Nokia 6 is getting regular updates. That is looking very promising for the rest of the World when they start shipping them.\nRegards\nInfinidim", "time": "07-04-2017 05:00 AM", "replies": [{"postID": "post5872855", "text": "Yeah, that's a good sign.\nI hope that's still the case when they are released for sale worldwide.", "time": "07-04-2017 06:01 AM", "replies": []}]}, {"postID": "post5907743", "text": "Nokia 6 Release 2nd. August?\nI talked to Carphone Warehouse (UK) yesterday (30/7/17) - both in a shop as well as their call centre; I also contacted a number of other shops as well - about them offering the Nokia 6 on the 2nd. August (which is the official date from HMD that the Nokia 6 is due to be released in the UK) and Carphone Warehouse (UK) said that they didn't know when it was coming out - interesting. Carphone Warehouse (UK) have the codes on their system but nothing about when the Nokia 6 will be available. The shops didn't even have a display model for the 2nd - normally these arrive at least a couple of weeks before the phone is released. Carphone Warehouse (UK) just pointed me at the Carphone Warehouse (UK) website and said sign up for when it will be available which I had already done a few months ago. Given that it is only a day away I think this is very poor of Carphone Warehouse (UK) and doesn't show that Carphone Warehouse (UK) really have a commitment to this phone. \nThe cynical amongst us (me included), maybe HMD / Nokia are not paying Carphone Warehouse (UK) enough to push this phone like Samsung and Apple do or maybe they don't get the margin from Nokia /HMD that Samsung and Apple give .\nRant finished", "time": "08-01-2017 05:26 AM", "replies": []}, {"postID": "post5908613", "text": "Do let us know.\nIt will be interesting to see if the retailers in the UK have the same (apparent) supply issues that Amazon -exclusive seller- here in the States does.\nWell, they certainly dont have the advertising budget of the big two.\nI suspect that HMD are the ones holding back (tweaking the system? ) because FCI are capable of huge production numbers and have quite a bit of skin in the game. \nBut maybe there are bottlenecks in the physical production, or a shortage of components from one of the foundries...\nThe \"Just be patient\" response from HMD without any hard information, like, 'there will be a batch of 75,000 available 22 August' is frustrating.", "time": "08-01-2017 06:52 PM", "replies": [{"postID": "post5909104", "text": "Just talked to Carphone Warehouse ( they have sole distributorship for a month for the Nokia 6 in the UK) again today and yet again they had no news about when they would be able to sell the Nokia 6 - they didn't even know why is wasn't on sale today.......some people there didn't even know that it should be available today!!!!\nThis is not good for the Nokia / HMD brand in the UK.", "time": "08-02-2017 06:05 AM", "replies": []}]}, {"postID": "post5910440", "text": "Later on yesterday (2/8/17) Carphone Warehouse put up on their site in the UK both the Nokia 6 and the Nokia 5 for ordering. The Nokia 6 was for almost immediate delivery and the Nokia 5 was for delivery on the 16th August.\nI have my Nokia 6 on order now and hopefully it should arrive by Friday.\nRegards\nInfinidim", "time": "08-03-2017 04:41 AM", "replies": []}, {"postID": "post5911374", "text": "I just checked Carphone Warehouse's website.\nThey seem to have the Tempered Blue version that Amazon pulled any mention of (it's not even available for pre-order anymore here in the US)\nWhen you get your phone could you post the model and build number?", "time": "08-03-2017 07:33 PM", "replies": [{"postID": "post5913020", "text": "Will do.\nInfinidim", "time": "08-05-2017 07:03 AM", "replies": []}, {"postID": "post5914034", "text": "The version of the phone that I picked up yesterday was \"Nokia 6 TA-1033 SS Tempered Blue\".\nI have been migrating all my data across from my Lumia 950 which has taken me a while - I think that's because of having been on Windows phone devices for quite a while.\nInfinidim", "time": "08-06-2017 07:39 AM", "replies": []}]}, {"postID": "post5914256", "text": "I hear that Nokia is running an unskinned version of Android with only some mods to the camera app.\nIf that's the case it is a great way to introduce yourself to the OS, as some others *cough*Samsung*cough* have buried it under so many useless and/or redundant \"features\" as to render it garbage (imo)\nBelieve the US version is 1025, so I'm not sure about ordering one if the bands are not functional here\nI will look closer at the spec's.\n---Edit---- without bands 2 and 12 the 1033 model is not going to work on T-Mobile.\nThanks!", "time": "08-06-2017 12:19 PM", "replies": [{"postID": "post5915087", "text": "I think that in the USA there are some issues with the \"Bands\". I know the Nokia 6 works on the networks that followed the International GSM standard but I think that two of the networks don't support the International GSM Standard so it possibly won't work on them. \nInfinidim", "time": "08-07-2017 08:32 AM", "replies": []}]}, {"postID": "post5915407", "text": "US carriers Verizon and Sprint are still using the CDMA standard, while most of the rest of the world is GSM.\nAll carriers here purchase licenses for various segments of spectrum at auction from the Federal Communications Comission. \nMy carrier (T-Mobile) uses bands 2 (1850-1910 Mhz) & 12 (698-716) for LTE. \nBand 12 is crucial for reception indoors, because that 700 Mhz frequency will penetrate walls.\nSince the Nokia6 has a locked bootloader I cannot flash the proper rom for me to make use of the frequencies I need.\nI asked because I have friends in London who are coming to the States Thursday, so I'd considered asking them to bring one over.", "time": "08-07-2017 01:15 PM", "replies": []}, {"postID": "post5927332", "text": "Amazon here in the US seems to have (had?) stock now.\nI got notice yesterday that my blue Nokia 6 had shipped. :-)\nI'll post my observations once I settle in with it.", "time": "08-18-2017 05:28 AM", "replies": []}, {"postID": "post5928395", "text": "I'm really enjoying my Nokia 6. Had updates to Android as well since I received mine.\nInfinidim", "time": "08-19-2017 05:05 AM", "replies": []}, {"postID": "post5928570", "text": "Nice build quality.\nPretty fluid but seems a little slow.\nThe camera is definitely second rate, but I cannot complain for the price.\nI'm still 'making it mine' and am looking forward to O in the near future.", "time": "08-19-2017 10:04 AM", "replies": [{"postID": "post5929383", "text": "Build quality is really good. You feel like it will last for years.\nI agree about the slowness. It sometimes takes a while to open apps on it but most of the time, if I have apps in background, then it switches fast enough for me.\nI think \"O\" will be good for this phone as well. It's not a \"quantum\" jump but incremental which I prefer.\nInfinidim", "time": "08-20-2017 04:48 AM", "replies": []}]}, {"postID": "post6045071", "text": "It's okay now.", "time": "10-30-2017 12:55 AM", "replies": []}]}, {"title": "Nokia 6 : Fantastic design with a problem", "thread": [{"postID": "post6023053", "text": "I have been using nokia 6 for a while now. The phone is good except for a minor problem. The camera.... protrusion. Yes, it wasnt apparent for me until my sibling pointed it out to me and said \"Hey, your phone camera casing protrudes out and hence it will take scratches. Why it already has one. See!\". She was right indeed. I am a pure user and hate to snap on a cover on my phone. While youtuber jerryrigeverything tried his best and managed not even a single scratch on the camera, I already got one. I am considering the option of snapping on a clear tape. Suggestions please!", "time": "10-16-2017 10:15 PM", "replies": []}, {"postID": "post6030534", "text": "I have to admit I found this a while back but decided to buy the genuine Nokia cover for mine. It's really good quality and does protect the camera a bit as well.\nRegards\nInfinidim", "time": "10-21-2017 04:42 AM", "replies": []}]}, {"title": "My new nokia 6 beeping why?", "thread": [{"postID": "post6020384", "text": "my nokia 6 is beeping simultanously display does not show any notification why this happen?", "time": "10-15-2017 07:50 AM", "replies": []}, {"postID": "post6021552", "text": "Welcome to Android Central! Is it the default notification tone, or something different? Does it go away if you turn off NFC?", "time": "10-16-2017 12:33 AM", "replies": []}]}, {"title": "Unable to UNLOCK my Nokia 6", "thread": [{"postID": "post6017376", "text": "after switching on within 10Sec automatically locking and blinking for every 20sec, unable to unlock Fingerprint Sensor is also not working. Getting calls, SMS, Notifications.", "time": "10-12-2017 11:25 PM", "replies": []}, {"postID": "post6020130", "text": "Welcome to Android Central! Does this happen in Safe Mode?", "time": "10-14-2017 11:25 PM", "replies": []}]}]
[{"title": "All Widgets disappear from HomeScreen and menu list after restart.", "thread": [{"postID": "post6009520", "text": "I have an (vanilla) Android Nougat 7.1.1 Nokia6 phone.\nI had to restart the phone because of Blutooth connection problems and after restart all Home Screen widgets were gone (including Clock, Calendar, Chrome, Firefox and several others) from the HomeScreen. They also vanished from the Widgets menu list so I can't add them back.\nHow can I get them back and how is it possible that those Widgets disappeared from the Widgets menu too because of Bluetooth connectivity problems..!?\nHow can the HomeScreen and Widgets menu list be fixed without factory reset? \nIs there a way to reinstall those affected apps (Clock, Calendar,Chrome) so that all data and settings are restored from backup (that I have in my G-drive) cause I think that might make applications widgets to appear in the menu at least?", "time": "10-07-2017 03:14 PM", "replies": []}, {"postID": "post6009525", "text": "Welcome to Android Central. I've moved your thread to the Nokia 6 forum so that more people familiar with this device will be able to assist you. \nWhat launcher are you using on your device?", "time": "10-07-2017 03:16 PM", "replies": []}, {"postID": "post6009532", "text": "No launcher. Those Nokia 3,5,6 phones are basically running vanilla Android Nougat 7.1.1 with all the latest updates.\nAlso, I'm quite sure this is not phone model specific cause I've seen similar Widgets disappearance problems reported in many manufacturers phones, usually in Android Nougat, but in Marshmallow, too", "time": "10-07-2017 03:19 PM", "replies": []}, {"postID": "post6010325", "text": "I found this article from the web where the problem of \"Widgets not showing up in the list\" is exactly the same I'm suffering from, but fix stopping the Launcher doesn't work in my case.\nThe launcher in Nokia6 is probably the Launcher3 app and I forced it to stop and when it automatically restarted those widgets were still missing from my HomeScreen and from the menu list.https://yalantis.com/blog/the-dark-side", "time": "10-08-2017 03:11 AM", "replies": []}, {"postID": "post6010364", "text": "I just restarted my Nokia 6, because Tethering wasn't working and got the exact same problem. I even cleared the Launcher3 data, because that was given as one solution to this problem. This is hugely irritating, because I actively use 2way authentication widgets, Spotify widget and few others.", "time": "10-08-2017 04:54 AM", "replies": []}, {"postID": "post6010757", "text": "I managed to fix the problem. I restarted my Nokia in safe mode by holding down the volume down button during startup, then went to the app settings, chose Launcher3->storage and deleted cache. After restarting again, the widgets worked again.", "time": "10-08-2017 10:50 AM", "replies": []}, {"postID": "post6011425", "text": "Had this problem too. It also stopped me from long pressing on the home screen and couldn't long press on the app drawer. Talked to Nokia support on the phone app and the person there was clueless and couldn't even seem to understand what the problem was. They told me to individually clear the cache of every app on the phone... funny.\nI ended up factory resetting but it will try your solution if it happens again.", "time": "10-08-2017 08:24 PM", "replies": []}, {"postID": "post6011899", "text": "Thanks @LordBhorak for your replys. Gotta try that Launcher3 cache cleaning, but why does it have to be done in Safe mode? Or did you try in Normal mode first and it didn't work?\nYes @batkingnz, I've had the same experience w/ Nokia Support (especially the chat ppl there). They never seem to understand even the most trivial technical issues or actually know anything about the phone hw or sw. Not once have I got useful info from them.\nMaybe this is a generic problem in Android Nougat, or it is an implementation problem on that Launcher3 code that handles the Home Screen and Widgets (IDK whether it is vanilla Android code or custom Launcher by Nokia/HDM).\nCheers,\n-experimancer", "time": "10-09-2017 08:38 AM", "replies": []}, {"postID": "post6011916", "text": "Thanks, did that cache cleaning also erase everything from the Home Screen (s) so that you had to setup them from the default one or did it stay intact and w the Widgets restored there too (and in the Widget Menu list)..?", "time": "10-09-2017 08:54 AM", "replies": []}, {"postID": "post6013032", "text": "Same thing yet again after turning it off while charging. Tried the safe mode trick and it didn't work. Ended up force closing the launcher (not in safe mode) and it came back ok. You will need to put all your widgets/apps back on the home screen.\nHope they fix this if and when they bring 7.1.2 update.", "time": "10-09-2017 09:33 PM", "replies": []}, {"postID": "post6013369", "text": "I did the data clear the first time, because the cache clear was greyed out. Data clear resets your home screen, but it didn't help with the problem. I was trying some other stuff with the safe mode, but noticed that the cache clear was available. Cache clear shouldn't \"reset\" your home screen... At least the apps that I had placed there after the data clear were still there. Widgets weren't naturally, but probably would have been, if I hadn't done the data clear.", "time": "10-10-2017 07:20 AM", "replies": []}, {"postID": "post6014727", "text": "Ok, tried that Launcher3 cache cleaning, booted to Safe Mode and clicked to Settings > Apps > Launcher3 > Storage > Clean cache, restarted and hey it worked! All the app Widgets came back to Menu List, from which I could add them back to Home Screens to those same locations they got erase because of a restart/Bluetooth issues.. \nThis had to be done in Safe Mode, tried to stop Launcher3 and erase cache in Normal mode, but that did nothing.\nIn the end, this probably is not Nokia6 specific but all Android Nougat's suffer from it but if the Launcher3 code is Nokia/HDM custom code then how can we make them know about this issue, so that they could fix it in the next Nougat or System update. The next Android Oreo is also close to be made available to phones like Nokia and others, maybe it'll be fixed there.. \nThanks a lot @LordBhorak and @batkingnz", "time": "10-11-2017 02:03 AM", "replies": []}, {"postID": "post6016117", "text": "Might try tweeting them about it so it's at least out there. Glad it all worked out for you. I've been playing with arrow launcher/Microsoft launcher and actually find it better for now.", "time": "10-12-2017 12:51 AM", "replies": []}, {"postID": "post6016229", "text": "Fast work HMD!! 7.1.2 is now available. Will monitor to see if the issue is fixed and update this thread if necessary.", "time": "10-12-2017 05:37 AM", "replies": []}, {"postID": "post6016303", "text": "Hello\nI had the same problem on Nokia 6 / Android 7.1.1. I've just applied the migration to 7.1.2: this actually solves the issue perfectly: All the widgets are now back as available. Problem solved on my side.", "time": "10-12-2017 07:30 AM", "replies": []}, {"postID": "post6016304", "text": "Hello\nI had the same problem on Nokia 6 / Android 7.1.1. I've just applied the migration to 7.1.2: this actually solves the issue perfectly: All the widgets are now back as available. Problem solved on my side.", "time": "10-12-2017 07:30 AM", "replies": []}]}, {"title": "Is the Nokia 6 that’s sold on B&H and Newegg the same as the Amazon variant (US version)?", "thread": [{"postID": "post6002753", "text": "Is the Nokia 6 that’s sold on B&H and Newegg the same as the Amazon variant (US version)?", "time": "10-03-2017 02:57 PM", "replies": []}, {"postID": "post6004110", "text": "Based on Nokia Mobile's responses in the question section on Amazon, it's a good possibility because they responded with the same bands as are listed on B&H. There's no mention of a model number, though. You might want to ask on Amazon what the model number is.", "time": "10-04-2017 01:40 PM", "replies": []}]}, {"title": "Nokia 6 - apps close on their own and phone locks up.", "thread": [{"postID": "post5999319", "text": "Recently bought a Nokia 6 with Android nougat. I noticed that when I run any games or other apps, the apps get stuck up and close on their own ( though they remain on n the list of minimised apps) and the phone locks on its own immediately. This time the phone doesn't unlock with fingerprint but requires the 9 point pattern for unlocking. Sometimes I lose my wallpaper too. Thanks in anticipation", "time": "09-30-2017 08:45 PM", "replies": []}, {"postID": "post5999511", "text": "Welcome to Android Central! Moved from the Nougat forum to the Nokia 6 forum.\nAre all of these apps installed through the Google Play Store, or some other source?\nDo you have any 3rd party battery-saver or \"RAM booster\" apps installed?", "time": "10-01-2017 01:32 AM", "replies": []}, {"postID": "post6000179", "text": "Most of the apps are the default apps that came preinstalled in the phone like Amazon and Google. The only apps I installed myself are WhatsApp, Facebook lite and cricbuzz. They are also from Google play store. I have not installed any battery saver or ram booster apps.", "time": "10-01-2017 02:09 PM", "replies": []}, {"postID": "post6000671", "text": "Could it be an issue with the hardware? All suggestions/advice are most welcome.", "time": "10-01-2017 10:05 PM", "replies": []}, {"postID": "post6000689", "text": "It might be a problem with the hardware or firmware. Does it happen in Safe Mode as well?", "time": "10-01-2017 10:18 PM", "replies": []}, {"postID": "post6000804", "text": "Thanks. Yes, it happens in safe mode too.", "time": "10-02-2017 01:31 AM", "replies": []}, {"postID": "post6001101", "text": "Is everything up to date (i.e., the system, as well as preinstalled system apps in the Play Store)? If so, then it's probably not worth further troubleshooting if you can return or exchange the phone.", "time": "10-02-2017 10:14 AM", "replies": []}]}, {"title": "[Resolved---kind of] Cannot use self service short codes", "thread": [{"postID": "post5993444", "text": "I am getting a \"connection error or invalid MMI code\" error when I use any self service short code I am on T-Mobile. I rebooted multiple times, had my phone reconnect to the network booted in safe mode. \nIt was working normally for awhile, then last week it stopped. I called Tmo support and it has been escalated to a higher tier, but they can't figure it out.\nI saw one site stating this is common for dual SIM phones, I have a Nokia 6 it is a dual SIM but US version of this phone, and I am only using one SIM. \nAny thoughts on what can be causing this, I get SMS and calls on Tmo normally otherwise. Thanks.", "time": "09-26-2017 10:20 AM", "replies": []}, {"postID": "post5999261", "text": "Well, someone helped me resolve this (no not Tmo, but it wasn't a Tmo issue). Seems the Nokia 6 no longer switches to HSPA+ mode in order to process the short code (USSD) which it needs to do, the workaround is to temporarily toggle the Nokia 6 to 3G, once this is done, the short codes work. I can then place it back onto 4G (LTE).\nIt used to work, so I am wondering if a recent Nokia update changed this. Not a big deal, I just have to toggle to 3G use the short code, then go back to 4G, a few seconds.\nThis person stated he had an issue with his LG, and found a setting to allow USSD over IMS in the hidden menu to resolve this so he doesn't have to toggle back and forth. I did not see this option in the hidden menu, so the 6 may not support it.", "time": "09-30-2017 07:31 PM", "replies": []}]}, {"title": "Bluetooth and pictures", "thread": [{"postID": "post5962385", "text": "Hi there.\nI seem to have problems with my Bluetooth, it good to connect to my car, but it sounds like robots taking to me when people talk to me sometimes....anyone tried this and have a solution??\nHow do I get pictures on my phone or sd card form my pic ??\nMy phone is Nokia 6\nRix", "time": "09-07-2017 02:20 PM", "replies": []}, {"postID": "post5962427", "text": "Welcome to Android Central! Moved from the Oreo forum to the Nokia 6 forum.\nHow's your cell reception when driving? If the reception is poor on some stretches of road, it might cause problems with the sound quality.\nTo copy photos from your PC to your phone, connect via USB, then swipe down the notification panel, tap the USB icon, and select MTP (it might also be called File Transfer). Then open Windows Explorer on the PC and drag/drop the photo files from the computer to the phone (preferably to the Pictures directory).", "time": "09-07-2017 02:38 PM", "replies": []}, {"postID": "post5962445", "text": "I drove about 50 kilometres and it was the same... I called 3 different people and they all told hp me how bad it was and it was for me too.\nOkay, so I just need to \"activate\" the USB on my phone in the top panel ?", "time": "09-07-2017 02:45 PM", "replies": []}, {"postID": "post5962988", "text": "But call quality is otherwise ok if you're not on Bluetooth? Is it bad if you use a Bluetooth headset as well? If not, then it's probably an issue with the car's Bluetooth system.\nDifferent phones can have slightly different ways of turning on MTP. But the default USB connection mode on most phones is Charge Only, so you typically have to change it manually to MTP -- and the easiest way is to tap the USB notification in the notification panel (assuming you see it there).", "time": "09-07-2017 08:14 PM", "replies": []}, {"postID": "post5963752", "text": "Yes , when I switch off the Bluetooth the phone is normal and good...also with a wire... so do you assume it's the car ? \nAnd thanks for your welcome by the way", "time": "09-08-2017 07:52 AM", "replies": []}, {"postID": "post5964074", "text": "The key thing to do is test it out with another Bluetooth device for calls. If the sound quality is fine there, then it's the car.", "time": "09-08-2017 10:43 AM", "replies": [{"postID": "post5965533", "text": "Thanks, i will try with another device. \nRegarding transferring pictures onto the phone I can't seem to figure it out....\nCan you try to walk me through it...again..maybe with more details...I'm blond you see. 😂\nRegards \nRix", "time": "09-09-2017 06:56 AM", "replies": []}]}, {"postID": "post5966839", "text": "Ok, first things first -- do you know if you've set the phone's USB mode to MTP?", "time": "09-09-2017 11:50 PM", "replies": [{"postID": "post5966926", "text": "Where do I find USB mode ? I have looked \" everywhere \" but obviously not where it is ...\nMTP is ?", "time": "09-10-2017 01:48 AM", "replies": [{"postID": "post5967480", "text": "Look at my post #2 in this thread -- do those steps give you the option to change the USB connection mode?", "time": "09-10-2017 12:40 PM", "replies": [{"postID": "post5969027", "text": "Oookaaayyy... i did as you told me, and...it worked !!! 😁🙌🏻\nAnd i went to the workshop today, and we agreed that I should try another 📱 And it works with other phones, so.....\nIs there any way to fix my Bluetooth?", "time": "09-11-2017 01:22 PM", "replies": []}]}]}]}, {"postID": "post5969903", "text": "Glad you figured out the MTP issue! But I'm not sure what else to do about the Bluetooth connection. If it seems isolated to that one phone, then it's a problem with either the hardware or firmware. If it's firmware, you'd have to try reinstalling the firmware, but I'm not sure how difficult that is on Nokia phones. If it's hardware, your best bet would be if it's still under warranty -- then send it in to Nokia.", "time": "09-12-2017 12:31 AM", "replies": [{"postID": "post5970584", "text": "Thanks !\nIt's still under warranty, not even 1 month old, so I'll try to talk to Nokia about it.\nThanks again !!! \nRix 🙌🏻👍🏻🇩🇰", "time": "09-12-2017 12:56 PM", "replies": []}]}]}, {"title": "How to install Google Play Services on Nokia 6 China version", "thread": [{"postID": "post5703744", "text": "I'm a Nokia user for 20 years. Now migrating from Lumia 925 to long waited Nokia 6 - the China version which has no Google Play Services installed. \nI love the phone and Android 7.0 and I need Google Play Services.\nI have try many ways (without root, of course) to install the Google Play Services but it \"keep stopping \". I know Nokia 6 is Google Play supported device.\nNowadays many Chinese peoples travelling oversea and many no-Chinese people working in China. So hands phone has to be working internationally. Google Map is preferred internationally as a free navigator**Apps. Many country localize Apps, for example in Singapore, subway and bus timing and route Apps, is build on top of Google Play Services.*\nAn Android phone without the Google Play Services is a crippled phone. \nThere are more and more China local brand Android phone can install the Google Play Services easily (without root) and some manufacturers even distributing the Google Play APPs installation package.", "time": "03-08-2017 03:35 AM", "replies": []}, {"postID": "post5705683", "text": "i think u need to root but root not coming out\nwait soon.", "time": "03-09-2017 02:17 AM", "replies": []}, {"postID": "post5707118", "text": "I agreed. \nBut I do hope we can install it without root.", "time": "03-10-2017 03:42 AM", "replies": []}, {"postID": "post5707127", "text": "Really easy to do no need to root you can also side load all apk's easy will update with links asap\nPosted via the Android Central App", "time": "03-10-2017 04:04 AM", "replies": []}, {"postID": "post5707190", "text": "See link on how to do it easy http://www.androidauthority.com/how-...-store-312812/\nPosted via the Android Central App", "time": "03-10-2017 05:52 AM", "replies": []}, {"postID": "post5707479", "text": "Hi Mike,\nYour link is to install Google Play Store and other Google Play APPs which can be installed as non-system APPs. It works provided the phone already has Google Play Service installed.\nI can install the latest Google Play Service on Nokia 6, however it \"keep stopping\". I believe it need to be installed as the system / root APPS or need Nokia to preinstalled it.\nI spot the Google Play on Nokia 6 International version demo video. I hope when Nokia start to ship the International version will provide an update to the China version to include the Google Play Services.", "time": "03-10-2017 10:49 AM", "replies": []}, {"postID": "post5707519", "text": "Nokia 6 preorder starting in Taiwan on Mar 8. Taiwan version is preinstalled with Google Play Store.", "time": "03-10-2017 11:13 AM", "replies": [{"postID": "post5727030", "text": "", "time": "03-26-2017 10:54 PM", "replies": []}]}, {"postID": "post5720964", "text": "Could you install WhatsApp on that phone???", "time": "03-22-2017 07:33 AM", "replies": []}, {"postID": "post5727033", "text": "Nokia6 original google play service apps", "time": "03-26-2017 10:55 PM", "replies": []}, {"postID": "post5730992", "text": "How to install Google play service in Nokia 6", "time": "03-29-2017 02:22 PM", "replies": []}, {"postID": "post5773882", "text": "Anyone installed play store ?", "time": "04-21-2017 03:34 AM", "replies": []}, {"postID": "post5811283", "text": "Italia", "time": "05-12-2017 05:54 AM", "replies": []}, {"postID": "post5879775", "text": "Good news! New July security patch included Google Play Services ! ! !", "time": "07-10-2017 04:47 AM", "replies": []}, {"postID": "post5880846", "text": "Bad news for me is after July security patch, my phone can't turn on ringer ! ! !\nUpdate: \nFYI.\nI have to do factory reset to get back Ringer and reinstalled all APPs so to sync properly to my Google account.", "time": "07-10-2017 10:14 PM", "replies": []}, {"postID": "post5966817", "text": "To install Google Play Store on Nokia 6 follow the below guide.\nGuide: How to Install Google Play Store on Nokia 6? - DeviceBio", "time": "09-09-2017 11:12 PM", "replies": []}]}, {"title": "Camera", "thread": [{"postID": "post5694431", "text": "I have almost no doubt that the 6's camera will be up there with the best of the Android devices. I have experience of four WP Nokias, and not one of them has had a bad camera....even the cheaper Nokias had good ones, and the high-end ones had the best. If Nokia have performed their legendary photographic wizardry on the 6, expect good things. http://m.androidcentral.com/nokia-6", "time": "02-28-2017 02:03 PM", "replies": []}, {"postID": "post5694473", "text": "I'm inclined to agree. Nokia always had wonderful camera hardware.", "time": "02-28-2017 02:40 PM", "replies": []}, {"postID": "post5961421", "text": "I've been using my Nokia 6 since it was available in the UK and I like the camera. It's not top pf the range but it does what I should do well. Hopefully in the future Nokia / HMD will update the camera software and firmware to make further improvements.\nInfinidim", "time": "09-07-2017 05:35 AM", "replies": []}]}, {"title": "Nokia 6 notifications", "thread": [{"postID": "post5939380", "text": "Hi !\nI'm new owner of Nokia 6 and also new to Android platform (windows before).\nI like to keep things simple and i don't want to run tons of applications in background, so i enabled System UI Tuner-Other-Power notification controls.\nI have set all my applications to 0 (block all notifications from the app), cause i like to check applications manually, but still, time to time i can hear , beep sound+vibrate notification sound and i don't know which application or anything else is causing this.\nI also can't see on my display (no message) which application or what notification is, just short sound+vibrate (like at notifications).\nWhat else can i check?\nAny suggestion ?\nBest", "time": "08-26-2017 03:53 AM", "replies": []}, {"postID": "post5947968", "text": "Recent app button in lower right corner will show the application on top.... because it is the most recent.\nReally, you need to understand that Android is fine with apps idling in the background. In fact, it probably takes more power to close and reopen them than to have them idling all day.", "time": "08-31-2017 06:36 AM", "replies": []}]}, {"title": "Unread badges on calendar and email wrong", "thread": [{"postID": "post5882909", "text": "After setting up my Nokia 6 the unread count for calendar and especially the gmail app are showing an unread count that is incorrect. I have no unread emails but gmail is showing 99+, rebooted made sure all was unread, but it will not clear.\nDoes anyone know of a way to reset the badge counter? Thanks.", "time": "07-12-2017 06:41 PM", "replies": [{"postID": "post5906669", "text": "I had the same problem. I solved it by opening Gmail on my computer, selecting All emails and marking them as read. It solved the problem within a few minutes. But I now have the issue on my calendar app. I can't remove it...", "time": "07-31-2017 10:17 AM", "replies": []}]}, {"postID": "post5883230", "text": "Go to Settings>Apps, tap Menu>Show System, and look for an app called BadgeProvider. Select it, then clear cache/data. Now see if the problem persists.", "time": "07-13-2017 02:22 AM", "replies": [{"postID": "post5883607", "text": "Thank you I tried it but it didn't work. I will maybe try again later.", "time": "07-13-2017 10:14 AM", "replies": []}]}, {"postID": "post5883649", "text": "Another thing to try (which will wipe the homescreen clean as well) is to clear the cache/data from the launcher app. I'm not sure what Nokia calls it, though. You'll have to set up your homescreens again afterwards.", "time": "07-13-2017 10:58 AM", "replies": []}, {"postID": "post5887743", "text": "Correction, there is no Badgeprovider system app on the Nokia 6 only badeinfoquery, and clearing that does nothing. It is now doing to all apps, I could factory reset but I have a feeling that will do nothing, as it is a new setup. I may have to contact support or wait for a fix.", "time": "07-16-2017 07:43 PM", "replies": []}, {"postID": "post5888796", "text": "One more update, chatted with Nokia support, he said it is pure Android and there is no way to clear badges, so for now I have an app I used on 6.0 that shows badges using the system icon ( the app is called Unread Badge) so that works (for email only) so hopefully there is a fix. This is my only complaint so far it is a nice phone overall.", "time": "07-17-2017 03:20 PM", "replies": []}, {"postID": "post5907087", "text": "Thanks, I was finally able to clear the gmail app last week after having time to play around with it, but I also have one notification on the calendar that I cannot find or clear.", "time": "07-31-2017 03:06 PM", "replies": []}, {"postID": "post5919444", "text": "Looks like this is now resolved, I got a Google Calendar update today, now all my badges have cleared and also are showing and clearing accurately.", "time": "08-10-2017 02:28 PM", "replies": [{"postID": "post5932291", "text": "Cool. I haven't got any updates. I even tried removing the app and reinstall it. No difference.", "time": "08-22-2017 01:56 PM", "replies": []}]}]}, {"title": "Android O and Nokia", "thread": [{"postID": "post5930860", "text": "Although this probably already known, looks like Nokia (I have the 6) is going to upgrade it's phones to O.\nHopefully all models.\nWe’ve also been working closely with our partners, and by the end of this year, hardware makers including Essential, General Mobile, HMD Global Home of Nokia Phones, Huawei, HTC, Kyocera, LG, Motorola, Samsung, Sharp and Sony are scheduled to launch or upgrade devices to Android 8.0 Oreo.", "time": "08-21-2017 02:04 PM", "replies": []}, {"postID": "post5931177", "text": "looking forward to it.\nhopefully it doesn't bork my phone. but HMD seems to have stayed much closer to 'pure' Android than other manufacturers. \nthere's no frigging way I'm paying for a pixel.", "time": "08-21-2017 06:32 PM", "replies": []}, {"postID": "post5932099", "text": "I'm also looking forward to it as well provided Google and HMD / Nokia do a rigours QA on it before it is released.\nInfinidim", "time": "08-22-2017 11:09 AM", "replies": []}]}, {"title": "Nokia 6 interest?", "thread": [{"postID": "post5695282", "text": "Anyone thinking of picking up a Nokia 6?", "time": "03-01-2017 08:16 AM", "replies": []}, {"postID": "post5695672", "text": "Hmm, ill have to first see if my carrier.. um.. carries it. This could potentially be a nice present for my father. He used to own the good old 3310 and if I gave him a new Nokia. He may just love it. It's got some good specs where it's needed.\nJust have to see what local pricing is. But so far, fairly interested. Let's see what happens.\nA droid a day keeps the Apple away", "time": "03-01-2017 01:56 PM", "replies": []}, {"postID": "post5695676", "text": "Thought about it for a second.\nBeefier specs would be nice though.", "time": "03-01-2017 01:59 PM", "replies": []}, {"postID": "post5695918", "text": "Buying 1 for sure when launched in India..", "time": "03-01-2017 05:37 PM", "replies": []}, {"postID": "post5696878", "text": "The build quality on these three new Nokia Android devices seems absolutely stellar by all accounts. Thick, sturdy, Series 6 aluminum. Definitely seems as if they use more of it than other OEMs that favor aluminum. \nHappy with my black pearl S7 Edge for now, and skipping the S8. I can see my next flagship being purchased around the holiday season, and it being either the Note 8 or whatever the name of Nokia's flagship offering will be. \nThese are pretty much the Nokia Nexus devices we all dreamed of, considering they're basically running stock Android.", "time": "03-02-2017 01:13 PM", "replies": []}, {"postID": "post5700053", "text": "I'm 99.9% that I'm in for one... Most likely the 4gb ram version.", "time": "03-05-2017 09:55 AM", "replies": [{"postID": "post5803052", "text": "This is taking forever and I've since picked up an s8. No longer interested in the 6. Definitely Interested in their supposed flagship device later this year though.", "time": "05-06-2017 08:24 AM", "replies": []}]}, {"postID": "post5703742", "text": "Already bought a Nokia 6 China version.\nNo preinstalled Google Play Service. \nManual installation not working.\nOther than no Google Play Service, I love the phone.", "time": "03-08-2017 03:27 AM", "replies": []}, {"postID": "post5715973", "text": "I am definitely thinking about it. Nokia's statement about providing timely security updates has caught my eye. I like Motorola phones but their update policy stinks. Part of that may be on Verizon without a doubt. No more carrier locked phones for me.\nWhat I'm looking for is a continuation of the Nexus line which means we have to look elsewhere now the Google has abondend the mid-range. \nI've had a couple of Nokia's Windows phones and they were good solid devices.\nEdit: Well it seems like these won't work on Verizon so I may be back to the G5 Plus.", "time": "03-18-2017 05:46 AM", "replies": []}, {"postID": "post5737618", "text": "Yeah , when i get hands on one here in Germany", "time": "04-01-2017 01:34 PM", "replies": []}, {"postID": "post5773873", "text": "They look pretty good will definitely consider as a work phone along side my daily driver.", "time": "04-21-2017 03:22 AM", "replies": []}, {"postID": "post5802238", "text": "SD430 for $250 is quite unacceptable when Moto G5 Plus is offering a SD625 for the same price. \nPoor first attempt by Nokia. \nBetter luck next time.", "time": "05-05-2017 02:30 PM", "replies": [{"postID": "post5805617", "text": "Think of reliability as well. A lot of Moto G5 Plus devices have ghost touch problems and you could not connect them to a Windows 10 PC since some months ago - it worked ok on Windows 7 PC's though.\nThings are not that simple...", "time": "05-08-2017 07:58 AM", "replies": [{"postID": "post5806022", "text": "Agreed. I was actually about to pull the trigger on a G5 Plus before I heard about the Nokia 6.\nIt was a tough choice, but I still give the edge to Nokia. It all boils down to usability, and Nokia won it with the inclusion of NFC and seemingly faster updates.\nNow I wait for it to release in the US.", "time": "05-08-2017 01:35 PM", "replies": [{"postID": "post5864792", "text": "I would go for the NFC and updates every time. It looks a really good device.\nInfinidim", "time": "06-27-2017 03:34 AM", "replies": []}]}]}, {"postID": "post5806022", "text": "Agreed. I was actually about to pull the trigger on a G5 Plus before I heard about the Nokia 6.\nIt was a tough choice, but I still give the edge to Nokia. It all boils down to usability, and Nokia won it with the inclusion of NFC and seemingly faster updates.\nNow I wait for it to release in the US.", "time": "05-08-2017 01:35 PM", "replies": [{"postID": "post5864792", "text": "I would go for the NFC and updates every time. It looks a really good device.\nInfinidim", "time": "06-27-2017 03:34 AM", "replies": []}]}]}, {"postID": "post5802970", "text": "I am looking at the Nokia 6 as well as the Nokia 5. They look quite good for the price.", "time": "05-06-2017 06:43 AM", "replies": []}, {"postID": "post5810933", "text": "I would definitely buy the Nokia 6.\nJust waiting for it to be released.", "time": "05-11-2017 08:40 PM", "replies": []}, {"postID": "post5811456", "text": "Dude. For a low budget phone I'd take the Nokia 6 in a heart beat if it was a tad bit smaller. Man watching side by side reviews of it and the S8. The 6 is a beast. Too big for me. I'm happy with the 5.1 S7 size.", "time": "05-12-2017 08:59 AM", "replies": []}, {"postID": "post5836526", "text": "They look pretty sweet, to be sure. May have to add it to my ever-growing list of smartphones I'm thinking about buying.", "time": "06-02-2017 09:51 AM", "replies": []}, {"postID": "post5864273", "text": "Changed my mind about the 6 now that it's coming to the US through Amazon at $229.00 USD.\nThinking I will buy one when available.", "time": "06-26-2017 02:30 PM", "replies": []}, {"postID": "post5865047", "text": "I'm slightly less excited about the Nokia 6 after learning it doesn't support AT&T bands 29 & 30.\nUnfortunately, the Moto G5 Plus also doesn't support AT&T bands 29 & 30, so I'll still choose the Nokia over the Moto.\nNow if only I could find a comparable stock/pure/vanilla Android phone that DOES support all AT&T bands under $400. Anyone have any suggestions?", "time": "06-27-2017 09:17 AM", "replies": []}, {"postID": "post5867879", "text": "I just watched a detailed review and not only does this phone look sweet but for the price point, it's INSANE!!!\nAdmittedly, iPhone is my daily driver but I would love to have this for when I need a change of pace. My only thing is I hate switching out Sim Cards. \nDoes anyone know of a way how I could go back and forth between this phone and my iPhone without switching Sim Cards while utilizing the same number!?\nThanks in advance!!! It's good to see Nokia back!!!", "time": "06-29-2017 11:55 AM", "replies": []}, {"postID": "post5874350", "text": "Have to say I'm underwhelmed by what they are offering.", "time": "07-05-2017 02:10 PM", "replies": []}, {"postID": "post5876890", "text": "Am interest to know if it supports Qi wireless charging.. sure hope so..", "time": "07-07-2017 01:50 PM", "replies": [{"postID": "post5876893", "text": "Nope.\nThe phone casing is aluminum so no Qi charging.", "time": "07-07-2017 01:53 PM", "replies": []}, {"postID": "post5877485", "text": "Maybe someone will come out with a cover that supports QI..\nInfinidim", "time": "07-08-2017 03:45 AM", "replies": []}, {"postID": "post5878773", "text": "Just add a product like http://a.co/aTQ2D92 inside whatever case you use.", "time": "07-09-2017 07:48 AM", "replies": [{"postID": "post5878798", "text": "That's what I was thinking of or maybe a case that has it in-built, that would be nice.\nHopefully it shouldn't' interfere with the NFC.\nRegards\nInfinidim", "time": "07-09-2017 08:28 AM", "replies": []}, {"postID": "post5900260", "text": "As there is no removable cover I don't think this will work.\nInfinidim", "time": "07-26-2017 08:33 AM", "replies": [{"postID": "post5932027", "text": "I've been using a usb Qi sticker for a week now.\nIt works in my car holder, desk stand and nightstand tray.\nWhy, oh why did Nokia hobble Qualcomm Quick Charge when the SD630 fully supports it?!?!?", "time": "08-22-2017 10:09 AM", "replies": []}]}]}]}, {"postID": "post5878784", "text": "Looking at the Amazon best sellers list, pre orders of the 6 appear to be going very well. It's #3 (ads) and #20 (no ads) overall currently.", "time": "07-09-2017 08:00 AM", "replies": []}, {"postID": "post5880631", "text": "Just got my (non Amazon ad Nokia 6 version) delivered today. I probably won't have time to play around with it until later in the week/weekend, but it is going to replace my old/failing Idol 3.\nLooking forward to it.", "time": "07-10-2017 06:18 PM", "replies": []}, {"postID": "post5897502", "text": "I'm interested in the tempered blue version when and if Amazon finally gets it.\nPositives = Solid build, near stock Android, timely updates, fingerprint scanner, Quickcharge & NFC. \nNegatives = locked bootloader, no removable battery, no wireless charging, no indicator led, no OIS, or IR blaster (remote for stereo, TV & A/C)\nI'm on T-Mobile and have read the reviews mentioning poor 4G and having to change router channels.\nWondering if this is just settings that a knowledgeable user could change, like APN's, or if this phone is hobbled.\nI don't really use my phone for games or VR/AR. \nDo you think the processor is a liability?", "time": "07-24-2017 08:48 AM", "replies": []}, {"postID": "post5898336", "text": "Processor is fine although when it receives android O it might slow down. \nAlso a SD 430 powering a full hd screen might cause bit of stutter. Else it should be fine.", "time": "07-24-2017 08:13 PM", "replies": []}, {"postID": "post5898753", "text": "Yeah, I'm not too concerned about the 430 being able to handle basic phone functions...\nGiving up IR and Qi will be a challenge.\nI do care about connectivity, and know that this phone has band 12 (for T- mobile), but wonder why reviewer's complain about signal strength.", "time": "07-25-2017 05:17 AM", "replies": []}, {"postID": "post5900422", "text": "Sure it will work\nThis Qi receiver has a USB plug and fits inside whatever *protective case* you put on your phone.", "time": "07-26-2017 10:58 AM", "replies": [{"postID": "post5901346", "text": "Ok, understand. Will try it when I get my phone.\nInfinidim", "time": "07-27-2017 05:32 AM", "replies": []}]}, {"postID": "post5903538", "text": "Well..... Amazon just dropped the blue version from their site and show the copper as 2-3 months out. \nI guess I'm going to find another phone, or buy one from Asia.", "time": "07-28-2017 06:41 PM", "replies": []}, {"postID": "post5908470", "text": "As an android developer, I need an android device which rolls out OS updates quickly. If Nokia is true to its words, this is the device for me.", "time": "08-01-2017 04:55 PM", "replies": []}]}, {"title": "Does Nokia 6 not have a default Gallery app?", "thread": [{"postID": "post5925028", "text": "When I take photos and try to view them through the default 'Photos' app, it takes a while for the photos to appear. Is this because all photos are saved to GoogleDrive and connects to the internet? \nI just like all photos to save automatically onto the SD card, not GoogleDrive, but the Nokia 6 doesn't have a default Gallery app! I want to be able to view my photos even without an internet connection.\nAny advice? TIA.", "time": "08-16-2017 01:38 AM", "replies": []}, {"postID": "post5925372", "text": "Welcome to the forums. There should really be very little delay using the Photos app. However, if you would prefer a gallery app, I found this article: 10 best gallery apps for Android - Android Authority", "time": "08-16-2017 09:12 AM", "replies": []}]}, {"title": "New Nokia 6 international version Notification Problem", "thread": [{"postID": "post5913905", "text": "New Nokia 6 international version Notification has the problem like the incoming call on Viber, IMO whats up and email but when you open the application then get the Notification even all sitting is ok please any one solved the issue.", "time": "08-06-2017 01:53 AM", "replies": []}, {"postID": "post5915085", "text": "I have the TA-1033 UK version and it seems to work ok but I don't use Google Mail I use the Microsoft Mail app.\nInfinidim", "time": "08-07-2017 08:28 AM", "replies": []}]}, {"title": "I cannot call through internet", "thread": [{"postID": "post5911837", "text": "I am using nokia 6", "time": "08-04-2017 03:07 AM", "replies": []}, {"postID": "post5912264", "text": "Welcome to Android Central! Are you talking about wi-fi calling, or some other VoIP service like Skype?", "time": "08-04-2017 11:58 AM", "replies": []}]}, {"title": "I don't receive Viber notifications on Nokia 6", "thread": [{"postID": "post5911913", "text": "Hello, I installed Viber on Nokia 6 and I don't see any notifications about new incoming messages. Only after I manually open the application, I can see if any new messages were sent. I tried Settings -> Notifications -> Viber and I see that everything looks fine, \"Block all\" is disabled, \"Show silently\" is disabled... then \"On the lock screen\" is set to Show all notification content... also, settings in Viber application look good. So, what is the problem??? Anyone can help?", "time": "08-04-2017 06:27 AM", "replies": []}]}, {"title": "Is there a way to disable the home button in Nokia 6 when screen locked?", "thread": [{"postID": "post5864746", "text": "It fools around when in the pocket changing tracks and dialling numbers. I have no problem unlocking it with the power button.", "time": "06-27-2017 01:13 AM", "replies": []}]}, {"title": "nokia 6 rom", "thread": [{"postID": "post5852311", "text": "Did anybody tried to flash the nokia 6 rom .", "time": "06-16-2017 07:11 AM", "replies": []}, {"postID": "post5853515", "text": "Still waiting for them to ship in the UK", "time": "06-17-2017 05:57 AM", "replies": []}]}, {"title": "6 or 8?", "thread": [{"postID": "post5696468", "text": "None of the new Nokias pretends to be a flagship in either specs or pricing (certainly not the latter: all three are very favourably priced), but if even the 6 is not quite right for you, don't forget the upcoming Nokia P1 aka 8. Still shrouded in uncertainty and rumour, it is forecast to arrive in Q2, may use the Snapdragon 835, a 5.3\" low bezel display, and a 24mp camera. Expect the highest specs and quality, but not quite the highest price.\nWould you prefer to wait for the 8, or grab a 6?", "time": "03-02-2017 07:12 AM", "replies": []}, {"postID": "post5696550", "text": "I think I would wait until I see what the 8 is.", "time": "03-02-2017 08:35 AM", "replies": []}, {"postID": "post5700056", "text": "Leaning towards the 6 right now. If the 8 is that good, I'll trade up.", "time": "03-05-2017 09:58 AM", "replies": []}, {"postID": "post5700495", "text": "I think Nokia 8 will arrive later possible at the IFA event in Germany. The priority for HMD Global/Nokia are probably to make new deals with distribution and carriers etc..\nMuch of that have been destroyed during the Elop Microsoft era. Remember they launched a Nokia android device then to, the Nokia X. Then pull out the support for that serie. \nSo they must build up the trust for the Nokia brand again. And it will take some time.", "time": "03-05-2017 06:57 PM", "replies": [{"postID": "post5817887", "text": "Doubt it will take much to get the carrier deals back, there will be a large amount of goodwill for Nokia across Europe at least.\nKeeping an eye on the 8 as a possible move from my Lumia 950 - it's a great phone for my needs but I'm seeing more bugs than before (browser isn't as smooth, occasionally freezes and reboots far more often than it did before I got the Creators update). Depends on storage/dual sim/camera/size options - anything bigger than 5.2\" doesn't do much for me so size is crucial, 5.5\" of the 6 is too big for my liking.", "time": "05-16-2017 10:09 PM", "replies": []}]}, {"postID": "post5702564", "text": "They're well-known for their photographic prowess in the Lumias, so if they've got that right in these Androids, and always ensure that in all future devices, that will help.", "time": "03-07-2017 08:58 AM", "replies": []}, {"postID": "post5712466", "text": "Waiting for the 8 here. Think this might be a great comeback flagship for Nokia. Hopefully it will work on all carriers. I'm liking everything I read about it so far", "time": "03-14-2017 08:18 PM", "replies": []}, {"postID": "post5818020", "text": "Think I am going to stay with either the 5 or the 6 currently.", "time": "05-17-2017 03:33 AM", "replies": []}]}, {"title": "Nokia 6 specs", "thread": [{"postID": "post5696607", "text": "From the blog: Hands on with Nokia's new Android phones: the 3, 5, and 6 | Android Central\nCPU: Qualcomm SD 430\nRAM: 3 GB\nStorage: 32 GB\nScreen: 5.5\" IPS LCD 1920x1080\nCamera: 16MP f/2.0 1.0um pixels\nFrom GSMArena: Nokia 6 - Full phone specifications\nBattery: 3000 mAh\nExpandable storage: 256 GB", "time": "03-02-2017 09:26 AM", "replies": []}]}, {"title": "A 1080 screen on this...", "thread": [{"postID": "post5694584", "text": "The Nokia 6 packs a 1080 screen. Based on the screenshot in the blog, it looks like a nice screen. Derek has commented by the fact that it seemed to have a yellowish tint to the coloring. It may not be that bad, however. Sometimes you don't realize a tint until you compare it to something else.", "time": "02-28-2017 04:15 PM", "replies": [{"postID": "post5695677", "text": "This is so true!  my example is not a nokia device, but this happened with my BlackBerry Q5. I thought the 'White' colour was pretty accurate but when I compared it to the Galaxy S7 it almost looked 'Peach' in comparison. Was quite amazed \nIn some devices you are able to alter the white balance of the screen to suit your needs and that comes in handy sometimes. \nNot sure if the Nokia has it but it's useful.\nA droid a day keeps the Apple away", "time": "03-01-2017 01:59 PM", "replies": [{"postID": "post5696524", "text": "Don't think I have heard of a peach hue to a screen before. One of my devices was a really bad yellow, the S2, I think.", "time": "03-02-2017 08:12 AM", "replies": []}]}]}, {"postID": "post5694711", "text": "True. My Nexus 5 has always had a touch of yellow, only noticed when compared to other devices. I guess the brain adjusts to some extent.", "time": "02-28-2017 06:13 PM", "replies": []}]}, {"title": "Nokia's third announced phone", "thread": [{"postID": "post5694328", "text": "The Nokia 6. I am honestly not sure what to think about this phone, for a few reasons. The cost of the device jumps from 189 Euros to 229 (200 to 249 USD). For the extra you do get 32 GB of internal storage, 3 GB RAM, and a 5.5\" display. However, the CPU remains at the 430, with no mention of the battery capacity. All this coupled with an extra version, the Arte Black, which adds 70 Euros to the price, and adding storage to 64 GB, and 4 GB RAM.\nWhat I don't get is the extra SKU. Why not come up with some kind of cost/hardware compromise and only have a 3rd SKU? Also, looking at the screen image on the blog, the status bar setup is reversed on this device but set up normally on the others. Hands on with Nokia's new Android phones: the 3, 5, and 6 | Android Central\nAny thoughts? I almost get the idea that this device was blueprinted at the last minute. Kind of a 'Let's get one more out there' kind of thing.", "time": "02-28-2017 12:42 PM", "replies": []}, {"postID": "post5694420", "text": "The bump to 1080p and the larger display will attract some buyers. I think the battery is a fixed 3000mAh. That ought to do the job.", "time": "02-28-2017 01:52 PM", "replies": []}, {"postID": "post5694488", "text": "I'm sure the battery will have an easy time with most users.", "time": "02-28-2017 02:51 PM", "replies": []}]}]
