[{"title": "Android 8.0 upgrade --> storage problems", "thread": [{"postID": "post6166399", "text": "I think this is a known problem, but I would like a workaround until 8.1 (hopefully) fixes it. Since the 'upgrade' to 8.0, I have been unable to copy files to my SDcard from usb or network using either ES File Explorer or Total Commander (my preferred file managers). The inbuilt file manager can copy to SDcard from usb (although no network ability). However, this program always creates new directories (with a (1) extension to the name) instead of writing into existing directories.\nAnyone know workarounds or solutions for this?", "time": "02-19-2018 09:15 AM", "replies": []}, {"postID": "post6168476", "text": "I found the answer. Developer Mode - - > System - - > Developer Options - - > Force allow apps on external.\n(Developer Options become available after tapping the Build Number several times)", "time": "02-21-2018 01:17 PM", "replies": []}, {"postID": "post6170128", "text": "Apparently not! It worked once - I don't know why - but not any longer. I have tried rebooting, unmounting and remounting sdcard etc without any success. I can only assume that this is a bug from Sony's version of Android 8.0. Feedback would be appreciated.", "time": "02-23-2018 09:39 AM", "replies": []}]}, {"title": "Questions Before Buying XZ1 Compact", "thread": [{"postID": "post6149059", "text": "I’m about to purchase a XZ1 Compact and have some questions before jumping onboard the Xperia bandwagon;\n1a) The phone supports UMTS 1700/2100, Bands 4, 7, 13 and 66, all of which are what I need for Freedom Mobile (Wind) compatibility. As far as I know, LTE switching on the Freedom network is buggy unless the phone is flashed with the larger XZ1 firmware. Does this void warranty?\n1b) If I receive an OTA update to Android 8.1 for the phone and it’s already had it’s firmware flashed, will I need to reflash the firmware from the XZ1?\n1c) Does a factory reset also reset the flashed firmware?\n1d) Any video tutorials on how to do this? Visual There’s this reddit thread: https://www.reddit.com/r/freedommobi...g_xz1_compact/ But an on-screen step-by-step would be best.\n2) Does EIS still work in 3rd party camera apps like Camera FV-5? If so, is the quality in third party apps on par with Sony’s stock application?\n3) Does the use of Nova Launcher allow me to swap app icons to stock Android icons?\n4) With the nearing Mobile World Congress next month and some rumored devices, what is the chance of a XZ2 Compact being announced next month? I’m feeling like if I bite the bullet now and get the XZ1 Compact, I might regret if a successor was announced soon.\n5) When connecting the phone to a Mac, does mounting the MicroSD card on Macs display it as an external drive or do I still have to use Android File Transfer?", "time": "01-29-2018 05:10 PM", "replies": []}]}, {"title": "How to move apps to SD card with Android 8.0", "thread": [{"postID": "post6032220", "text": "Really chuffed with my new Android 8.0 phone (Sony Xperia XZ1 Compact), however can't move apps to the SD card to save on internal storage although this was possible in earlier versions by clicking \nSettings > Storage > Internal Storage > Free up space for automatic transfer \nor clicking Move to SD card in the apps separately\nNeither of those are possible anymore. Furthermore, I see a message that files larger than 4 MB cannot be transferred because of storage capacity limitations of the external card.\n1) So, isn't it possible anymore? Or is there a workaround?\n2) Can the transfer capacity limit be solved by using a high capacity SD card?\n3) When I connect the phone to the PC, I cannot move/copy files from the internal memory. Did I miss some access rights check box?\nThanks for any pointer!\nann", "time": "10-22-2017 08:34 AM", "replies": []}, {"postID": "post6032298", "text": "Welcome to the forums. You should be able to use the card as adoptable storage, effectively making the card part of your internal storage. This will encrypt the card, making it unreadable by any other device.", "time": "10-22-2017 09:36 AM", "replies": []}, {"postID": "post6034185", "text": "Can you try this:\nEnable Developer options: https://www.theandroidsoul.com/enabl...android-o-8-0/\nThen go to Settings => Developer Options and check if there is an option near the bottom of this list for \"Force allow apps on external\". This may enable the ability to move certain apps to SD Card. Try a reboot and see if you can move some apps or games to SD card. \nLet us know if it works!", "time": "10-23-2017 12:05 PM", "replies": []}, {"postID": "post6046102", "text": "This did not work. Help please - phone is worthless without SD storage capability for apps.", "time": "10-30-2017 03:47 PM", "replies": []}, {"postID": "post6059263", "text": "Hi, just joined your forum. I have exactly the same Problem with my brandnew XZ1 Compact! Close to freak out, actually, l tried already everything like recommended here. Doesn't change anything at all! I don't want to root it this time, like I did with almost all my xperias before, because more and more apps check this during installing, for example my bank app and my health insurance app, really important apps to me. \nSo how do we get this solved? So far not much to find on the net, because Oreo is so new. \nThe last I do expect help from is from Sony support, grump.", "time": "11-07-2017 09:46 PM", "replies": []}, {"postID": "post6060358", "text": "Are they serious? (Sony or Google, whoever is responsible for the SD card issues)\nI am doing research since yesterday like crazy, just took again a look on the Sony page,the following quote is about the XZ1, concerning \"Storage and memory\":\n\"Your device has several different storage and memory options:\nThe internal storage stores downloaded or transferred content along with personal settings and data.You can use a removable memory card to get more storage space. Media files can be moved to this type of memory to free up internal storage....\nYou can purchase a memory card separately.\nImproving memory performance\nIf the device starts to slow down, or applications suddenly shut down, you should consider the following:\nAlways try to keep at least 500 MB of free internal storage available. ....\n... Uninstall downloaded applications that you don't use.Transfer photos, videos and music from the internal memory to the memory card.\nIf your device can't read content on the memory card, you may need to format the card. Note that when you format the card, all content is erased.\nSo it says clearly NOTHING about moving APPs to the SD card! Hilarious, isn't it?\nThis is conflicting to the fact, after I enabled the developer options, then go down to \"Apps\", the \"option\": \"Force allow apps on external\". So what, on one hand Sony says, only media files can be transferred to SD, on the other we have the \"Force allow apps on external\", what is ANYWAY NOT working. Congrats, Sony or Google or both, to this great step further in Android / phone development! *Ironic mode: OFF* To be continued.... I think.", "time": "11-08-2017 03:14 PM", "replies": []}, {"postID": "post6060361", "text": "Sorry, got to add the link to the Sony page I mentioned and quoted text from above with my last comments:https://support.sonymobile.com/globa...ge-and-memory/", "time": "11-08-2017 03:18 PM", "replies": []}, {"postID": "post6141920", "text": "I didn’t think android supported installing apps to an SD card, only media?", "time": "01-21-2018 11:18 AM", "replies": [{"postID": "post6141951", "text": "I did it with all my former Xperias, with the great app Link2sd, BUT this works only with a rooted phone. This time I didn't want to root it, because now a lot of important apps, for ex. my bank and my health insurance app check it up if the phone is rooted and then it's impossible to install them! This is really annoying.", "time": "01-21-2018 12:09 PM", "replies": []}]}]}, {"title": "Wireless charging", "thread": [{"postID": "post6135891", "text": "Can i use wireless chargers using a qi one on my xz1\nThankyou", "time": "01-14-2018 07:10 AM", "replies": []}, {"postID": "post6136037", "text": "Unless it's built in, no, unless you get an aftermarket solution. Search Google.", "time": "01-14-2018 11:22 AM", "replies": []}]}, {"title": "I'm still on October software patch, does Sony even care?", "thread": [{"postID": "post6133417", "text": "Does anyone at Sony care about the US market? I mean come one Sony, still on the October 2017 software patch.\nI have the Xperia XZ1 Compact.", "time": "01-11-2018 10:19 AM", "replies": []}, {"postID": "post6134965", "text": "Got this one the last days, still not installed. Have a XZ1 as well. But I'm in Germany, just for information 😀", "time": "01-12-2018 11:23 PM", "replies": []}, {"postID": "post6135224", "text": "I tried today with Flashtool again. It seems the new version [0.9.24.1] works with the XZ1C. I flashed my phone to another version and got the update. The best part is that I was able to keep my userdata", "time": "01-13-2018 10:55 AM", "replies": []}]}, {"title": "Has anyone received the December update Xperia Compact XZ1", "thread": [{"postID": "post6113417", "text": "Just seeing if anyone has received their December update yet? 😀", "time": "12-20-2017 05:36 PM", "replies": []}, {"postID": "post6114066", "text": "No\nUS phones are still stuck on 47.1.A.2.324. Sony doesn't care about the US market, shame.", "time": "12-21-2017 11:48 AM", "replies": [{"postID": "post6114070", "text": "I had a Sony Compact X that was updated each month no complaints. Now I have the XZ1 and I'm still on the October update.\nGenerally, Sony has been quite good about security patches. They must be totally understaffed. Real shame.\nThis is my fourth Sony phone and the for software updates, the Compact XZ1 is far the worst.", "time": "12-21-2017 11:53 AM", "replies": []}]}, {"postID": "post6114100", "text": "I had the Z5C and updates were OK. It's the US version that it's the problem. According to a recent email they sent me, they're aware of this issue and working to solve the problem for US customers.", "time": "12-21-2017 12:39 PM", "replies": []}]}, {"title": "Visual Voice-mail? I have at&t", "thread": [{"postID": "post6110152", "text": "I cannot seem to find the visual Voice-mail on the XZ1 compact. How do I set this up?", "time": "12-17-2017 07:39 PM", "replies": []}, {"postID": "post6110975", "text": "What do you mean? By holding down the number 1 on your keypad should allow you to setup or access voice mail.\nPlus if you hit the phone icon you should see a little icon along the top bar which you can also press for voice mail access.", "time": "12-18-2017 01:40 PM", "replies": [{"postID": "post6112664", "text": "With visual voice mail, you can see the messages and play any messages without going through the usual voice mail menu prompts. It's super convenient. \nI think most current phones have this option but I'm not seeing it on the XZ1 compact.", "time": "12-20-2017 12:18 AM", "replies": []}]}, {"postID": "post6113411", "text": "I now see what you mean. I use Google voice and forward all my calls from my regular carrier to Google.\nI receive a text, email in Gmail along with voice mail read back or play as needed.", "time": "12-20-2017 05:32 PM", "replies": []}, {"postID": "post6113416", "text": "https://forums.att.com/t5/Device-Fea...0/td-p/5080190", "time": "12-20-2017 05:34 PM", "replies": []}, {"postID": "post6113480", "text": "I just switched from Windows 10 Mobile to Android using a Xperia XA1 Ultra. I just figured out the phone does not have this feature - hard to believe. Anyway, is there a third party app that will load and perofrm this function?", "time": "12-20-2017 07:18 PM", "replies": []}, {"postID": "post6113549", "text": "Try this", "time": "12-20-2017 09:16 PM", "replies": []}, {"postID": "post6113550", "text": "https://www.google.com/search?q=virt...-8#fpstate=aig", "time": "12-20-2017 09:16 PM", "replies": []}, {"postID": "post6113551", "text": "http://newzoogle.com/best-visual-voi...th-the-people/", "time": "12-20-2017 09:18 PM", "replies": []}]}, {"title": "Could these be the new designs?", "thread": [{"postID": "post6100385", "text": "Gorgeous.This may be our first look at the reworked Sony Xperia phone design | TechRadar", "time": "12-08-2017 12:36 PM", "replies": []}, {"postID": "post6101740", "text": "Take my money! I currently use the XZ Premium and those look great! Of course a case will cover the beauty.", "time": "12-09-2017 03:36 PM", "replies": []}, {"postID": "post6101748", "text": "I like this! I just hope the fingerprint scanner isn't disabled in USA models. I wouldn't get a phone without a FPS, and I like it located on the back.", "time": "12-09-2017 03:48 PM", "replies": [{"postID": "post6101849", "text": "I agree... these designs are stunning, but if they’re still unable to include FPS in the US, I won’t be getting one. It’s a shame, really, as my T-Mobile Z3 was a thing of beauty.", "time": "12-09-2017 06:27 PM", "replies": []}]}, {"postID": "post6101753", "text": "Ahhhh... Yes!\nI'm hoping Sony will finally start ticking the boxes.\nI am a fan of the Xperia line.", "time": "12-09-2017 03:53 PM", "replies": []}, {"postID": "post6101844", "text": "The shape of the mirror finish one is how Xperias should be. with square corners that are rounded, not awfully sharp like they currently are.\nReally hope Sony rocks the smartphone boat in a big way early next year.", "time": "12-09-2017 06:23 PM", "replies": []}, {"postID": "post6101945", "text": "Using the Xperia XAU currently.\nI would love this phone done with the new design.", "time": "12-09-2017 08:31 PM", "replies": []}]}, {"title": "My Sony Xperia XZ1 Compact review", "thread": [{"postID": "post6021971", "text": "(Before I start, I am going to warn you that this will be long. I will space it out appropriately.) I have had this phone for a week and have used it consistently as my phone for that time frame. \nThe tl;dr version (too long; didn't read):\n-Size is great and the display is fine for me\n-Battery life is excellent\n-Performance is great\n-Fingerprint sensor is fast\n-Sony's UI is light, even though there's a lot of addons\n-Cameras have improved this year on the software side but in low light situations, the picture can be yellowish\n-The stereo speakers sound so good\nOverall rating is 9 out of 10.\nAlright, on to my more detailed review:\nDesign & display\n-I love the size of this phone. It reminds me of the size of the iPhone SE which I do own, but a little bigger. To me, it's great for those of us who desire a small phone that is actually powerful and has a good amount of screen, which I will get to that point shortly.\n-This time around, Sony decided to put the volume rocker above the power button which is a great place. On the X Compact, it was below the power button, which was just a pain for me. The only quirky thing about this is that I find myself pressing it and then realizing that isn't the power button because of my other phones.\n-Almost forgot the concern about the corners that some people have. It's been fine for me, the corners don't feel sharp to me, and I have had no issues holding it and using it with the same hand. (I'm naturally thin so one would think if anyone would feel sharpness, it would be me.) Speaking of one hand usage, this is a perfect one hand use phone. Like the SE, you can reach all corners with one hand.\n-I haven't had any issues with the 720p display. It fits the phone. Also the LCD is pretty good.\n-The brightness has been fine to me. There's actually a setting that stops the screen from dimming once it senses that it is in your hand. For the most part, this has worked well. When it doesn't sense that it is fully there, you see the screen debating if it wants to go dim or stay lit. It doesn't bother me but it is noticeable.\n-Speaking of modes, there are three display modes. The default mode is not very saturated but there is a mode for that. I just hate that look so how it looks is fine for me. It doesn't look cold. Additionally there is a glove mode which is awesome to have when it gets cold.\nPerformance & battery life\n-Performance has been great, as expected on a phone with a Snapdragon 835 processor. I have only had one app closure (Instagram), and just one time, so it might be the app itself and/or Oreo. It feels as fast as the Pixel.\n-App reloading is minimal.\n-For the first few days, I had a hard time putting this phone down and I expected the battery life to be shot but somehow it never was. I can use it heavy and get an entire day (like 24 hours). It was great to get the phone the first night, update all of the apps and then not feel the need to top it off the next morning in order to get through the next work day. \n-This is not a phone where you would worry about battery life, just know that.\n-The fingerprint sensor is fast, sometimes too fast for me when I just want to see what time it is.\n-LTE speeds are solid, as expected for a phone with LTE Category 15 connectivity.\nSony's skin/UI\n-A section for this is necessary, because there are some pros and quirks relating to this.\n-Sony still uses an apps button in the dock to get to your app drawer, which is alright. Not really a con but something to note.\n-They also have this weird thing that if you want to add an app from your app drawer to your home screen, you have to hold the app and drag it to the \"add to home screen\" at the top. This is kind of annoying. At the same time, I enjoy that you can make folders in the app drawer.\n-Sony now has this great feature in the launcher that enables you to use icon packs from the Play Store with the default launcher, which I am enjoying. There are some other small additions, like adjusting the icon size.\n-There's no ambient display/double tap to wake/always on display, which I miss.\n-In regards to the pre-installed apps, AVG Protection, Spotify, Facebook are there. You can't uninstall them, only disable them. I use Spotify so I disabled the other two.\nCameras\n-Sony has finally improved the software processing on the camera side. Pictures are pretty good.\n-Sony is finally done with the never ending list of additional modes.\n-The low light performance has improved. Pictures can get noisy in really low light conditions and a bit yellow but you can adjust the temperature before taking the shot.\n-As for the front camera, you have the option of wide angle and also regular shots. I noticed improvement on this side too (over the X Compact). It just looks better, but has a similar situation in low light as the main camera. Also, the soft skin effect is on by default, which isn't as crazy as it can be in some other phones but I prefer to turn it off.\n-The camera button is so nice to have as well but I only use it to take a shot and not to open the camera since I enabled that on the power button (just personal preference).\nAudio\n-Stereo speakers are so nice to have. It's been a while since I have had a phone with speakers like this.\n-Call quality (no one talks about this, but I'm going to talk about it) is fine. Calling people on 3 different carriers has sounded good. I also don't know if it's just me, but it feels like calls connect much quicker than they have before on my Pixel.\nFinal Thoughts\n-I can see myself keeping this phone. I enjoyed my iPhone SE but the front camera has been hard to me to be pleased with. I have been trying to find an Android replacement for a while now, and I feel that I can finally replace my SE with this phone. I give it a 9 out of 10 because it hits the spot for my most important things in a phone. It's worth the money, but if you want to wait for a price drop, do it.\nThat's all I got. If you have made it this far, you're a champ and thanks for reading", "time": "10-16-2017 09:41 AM", "replies": [{"postID": "post6036905", "text": "I'm assuming you have an international version of XZ1? What version of software are you currently on?", "time": "10-24-2017 08:39 PM", "replies": [{"postID": "post6036920", "text": "On the August patch, still waiting for the October patch which apparently came out a couple of days ago.\nYep I have the international version.", "time": "10-24-2017 08:50 PM", "replies": []}]}]}, {"postID": "post6022032", "text": "Nice review. Thanks.\nCurious that DTtW isn't in the Display settings. That would solve the fast fingerprint problem if you wanted to just check the time or notifications. I agree that the Sony fingerprint speed and placement in the power key destroys the lock screen utility. Another alternate is train yourself to tap power with a finger not saved.", "time": "10-16-2017 10:13 AM", "replies": [{"postID": "post6022132", "text": "Thank you for reading! I tried to make it shorter but I felt like it would be a disservice to not note some things that no one is talking about.\nYeah, it's not there. I tried to look and look but I don't see it anywhere. I thought that was a weird omission because I remember it on the X Compact. The only settings there is to open the camera by pressing the power button twice and glove mode. \nThat's a good idea, I'll try that.", "time": "10-16-2017 11:01 AM", "replies": []}]}, {"postID": "post6022142", "text": "Is battery life better than IPhone SE?", "time": "10-16-2017 11:04 AM", "replies": [{"postID": "post6022157", "text": "For my usage, yes, especially with iOS 10. Using the same apps and using the same carrier, it's better. Not so much better but noticeably better for sure.", "time": "10-16-2017 11:11 AM", "replies": [{"postID": "post6022175", "text": "Awesome. If it’s better than iPhone SE. That sounds very promising. Mine is expected to be here on Thursday.", "time": "10-16-2017 11:21 AM", "replies": [{"postID": "post6022178", "text": "Yay! Congrats! I'll be looking forward to your thoughts and impressions.\nIt's been better than the SE for me, even the day I tried to run it down, I was on my way to a day and 8 hours, which is nuts. I gave up though because I had things to do that I needed more of a charge for.", "time": "10-16-2017 11:21 AM", "replies": []}]}]}]}, {"postID": "post6022160", "text": "Nice review!☺️\nHow is the audio quality when using headphones?", "time": "10-16-2017 11:13 AM", "replies": [{"postID": "post6022167", "text": "Thank you!\nAh, I haven't tried this yet but I plan to try it soon. I have heard that it is good though but I will find out.", "time": "10-16-2017 11:17 AM", "replies": []}]}, {"postID": "post6022594", "text": "Thanks, great review. What colour did you get?\nCan any icon pack be used with Xperia UI?", "time": "10-16-2017 04:05 PM", "replies": [{"postID": "post6022635", "text": "Thank you!\nThe blue one. It kinda looks green in some lights so that was my choice. \nAs for the icon packs, any recently updated one should work. I have only had 2 old ones not appear.", "time": "10-16-2017 04:41 PM", "replies": []}]}, {"postID": "post6022621", "text": "I was torn between blue and black but decided go with my all time favorite black.", "time": "10-16-2017 04:36 PM", "replies": []}, {"postID": "post6022642", "text": "What case did you order? I haven’t found anything that I like. I always go for minimal slim case.", "time": "10-16-2017 04:48 PM", "replies": [{"postID": "post6022690", "text": "I am hating all of the cases right now so I settled for a wallet/flip case which I hate. Cases I considered have had bad reviews. The terrpain case was nice but mine came warped so I sent it back. I'm waiting for the Ringke case to become available on October 27.Thank you!\nIt hasn't really run hot for me at all so it's been good. The most heat I have experienced was with trying multiple camera apps for a while (like 20 minutes) and the first time it had to install all of these updates. Still not hot enough to burn but a little warm. Weirdly enough, I haven't had the chance to try a YouTube video on it yet. That's another thing I have to try.", "time": "10-16-2017 05:32 PM", "replies": []}]}, {"postID": "post6022647", "text": "You did a swell job with the review. Being that it's a Snapdragon and not a Helio, how is it as far as heat? Do graphic intensive apps (YouTube) cause it to get uncomfortably warm or does it mind its Ps and Qs?", "time": "10-16-2017 04:55 PM", "replies": [{"postID": "post6022690", "text": "I am hating all of the cases right now so I settled for a wallet/flip case which I hate. Cases I considered have had bad reviews. The terrpain case was nice but mine came warped so I sent it back. I'm waiting for the Ringke case to become available on October 27.Thank you!\nIt hasn't really run hot for me at all so it's been good. The most heat I have experienced was with trying multiple camera apps for a while (like 20 minutes) and the first time it had to install all of these updates. Still not hot enough to burn but a little warm. Weirdly enough, I haven't had the chance to try a YouTube video on it yet. That's another thing I have to try.", "time": "10-16-2017 05:32 PM", "replies": []}]}, {"postID": "post6022812", "text": "Wow, such a detailed review. Thank you. 😋. I'm currently using the Compact X and will be receiving my Xz1 in blue color within the next few days. I know I've made a smart decision buying this phone. Again, awesome job", "time": "10-16-2017 07:27 PM", "replies": [{"postID": "post6022882", "text": "Thank you and you are welcome! Nice color choice, I hope that you will enjoy it and I'm looking forward to your impressions.", "time": "10-16-2017 08:19 PM", "replies": []}]}, {"postID": "post6023285", "text": "Great review!That's strange. I have the Sony XZ. It has double tap to awake in the Display settings. Strange that they would remove this.\nAs Sony uses LCD it's likely that's why ambient and always on are not available, they're made for amoled screens. Though you can find ways to make that happen.\nTo get always on, turn on developer options. You'll find an option there to have the screen on all the time (at least I have this option)\nTo get ambient I think there are apps available. Though you'll have to watch your battery.", "time": "10-17-2017 02:20 AM", "replies": [{"postID": "post6023509", "text": "Thank you!\nHmm that's interesting that you have it in your XZ but it's not here. I guess they decided to trade it for glove mode. I can look into the always on but I value my battery life too much. This phone has had great battery life for me and I wouldn't want to change that. That sounds like a very useful app, I'll look into it. Thank you for sharing the app with me.", "time": "10-17-2017 08:08 AM", "replies": [{"postID": "post6023548", "text": "I have glove mode as well. It's possible the compact version doesn't have double tap to wake?", "time": "10-17-2017 08:30 AM", "replies": [{"postID": "post6023608", "text": "Wow, I didn't know that you had glove mode too. Maybe that is possible but @DominionRoofs has the XZ1 and they say that it isn't there too. I guess Sony decided to change their mind.", "time": "10-17-2017 09:05 AM", "replies": [{"postID": "post6024908", "text": "Just to add to this.\nI checked my wife's Z5 compact. It has double tap to wake and glove mode as well.\nSeems like Sony is reducing features for some reason.", "time": "10-18-2017 01:42 AM", "replies": [{"postID": "post6025137", "text": "Yes they are. Now, if it's an attempt to make the phone more stockish and stable, I'm all for it. Not sure what else it would be.", "time": "10-18-2017 07:47 AM", "replies": []}]}]}]}]}]}, {"postID": "post6023413", "text": "There is no double tap to wake unfortunately. I found an app that works very well though. It's called \"gravity screen\". Turns the screen on with motion or waving your hand over the proximity sensor. Works great when putting in and out of your pocket. It has never failed on me.", "time": "10-17-2017 06:38 AM", "replies": [{"postID": "post6023509", "text": "Thank you!\nHmm that's interesting that you have it in your XZ but it's not here. I guess they decided to trade it for glove mode. I can look into the always on but I value my battery life too much. This phone has had great battery life for me and I wouldn't want to change that. That sounds like a very useful app, I'll look into it. Thank you for sharing the app with me.", "time": "10-17-2017 08:08 AM", "replies": [{"postID": "post6023548", "text": "I have glove mode as well. It's possible the compact version doesn't have double tap to wake?", "time": "10-17-2017 08:30 AM", "replies": [{"postID": "post6023608", "text": "Wow, I didn't know that you had glove mode too. Maybe that is possible but @DominionRoofs has the XZ1 and they say that it isn't there too. I guess Sony decided to change their mind.", "time": "10-17-2017 09:05 AM", "replies": [{"postID": "post6024908", "text": "Just to add to this.\nI checked my wife's Z5 compact. It has double tap to wake and glove mode as well.\nSeems like Sony is reducing features for some reason.", "time": "10-18-2017 01:42 AM", "replies": [{"postID": "post6025137", "text": "Yes they are. Now, if it's an attempt to make the phone more stockish and stable, I'm all for it. Not sure what else it would be.", "time": "10-18-2017 07:47 AM", "replies": []}]}]}]}]}]}, {"postID": "post6024212", "text": "My wife's iPhone SE goes days between charges, and she sometimes uses Spotify for hours. Not sure if any phone could do much better on the battery. She literally often goes all weekend without a charge.", "time": "10-17-2017 03:52 PM", "replies": [{"postID": "post6024236", "text": "I know how good iPhone SE battery life is. It’s not better than IPhone 6s/7 plus but very good. I had oneplus 5 (1080p) and i got crazy good battery life as well so I can’t imagine how good it will be with 720p screen with snapdragon 835.", "time": "10-17-2017 04:04 PM", "replies": []}, {"postID": "post6024269", "text": "I have a new se and mine is def not like this. Great battery on stand by but while in use and on LTE it drains. Looking froward to the compact. My last one had great battery while the screen was on as well as off.", "time": "10-17-2017 04:20 PM", "replies": [{"postID": "post6024292", "text": "Hmm I didn't know individual iPhone SE behave differently. I always have wifi off at work because LTE is faster lol.", "time": "10-17-2017 04:32 PM", "replies": [{"postID": "post6024293", "text": "I’m talking when the screen is on. So not steaming music or anything like that. But videos or GPS while out and mine drains. Seemed pretty normal on reddit too. But without the screen on it’s a champ for me. But everyone’s usage is different. My heavy day might be someone else’s light day and so on. For me it is good but not great in the battery department.", "time": "10-17-2017 04:34 PM", "replies": []}]}, {"postID": "post6024479", "text": "Congrats on the Compact! I hope that you'll like it.This is true but in my experience, the XZ1 Compact has topped the SE in use and standby battery life overall.\nEdit: As a point of context, for me work has a very strong signal. At home, it is not as strong for me at all. It goes between weak to decent based on where I am, so my battery life experience is based on how the phone handles both environments.", "time": "10-17-2017 06:29 PM", "replies": []}]}]}, {"postID": "post6024324", "text": "^^True^^ Hard to compare apples to oranges. The one thing I know is that my wife charges her SE much less often than previous phones, and she charges the least in the family. So, it is better than some, but who knows with your own particular usage pattern. One thing I have found is that when you are in a weak LTE area most phones will burn right through the battery.", "time": "10-17-2017 04:45 PM", "replies": [{"postID": "post6024479", "text": "Congrats on the Compact! I hope that you'll like it.This is true but in my experience, the XZ1 Compact has topped the SE in use and standby battery life overall.\nEdit: As a point of context, for me work has a very strong signal. At home, it is not as strong for me at all. It goes between weak to decent based on where I am, so my battery life experience is based on how the phone handles both environments.", "time": "10-17-2017 06:29 PM", "replies": []}]}, {"postID": "post6024507", "text": "I ended up ordering both pixel 2 and zx1 compact Hopefully, google doesn’t charge restocking fees lol.", "time": "10-17-2017 06:48 PM", "replies": [{"postID": "post6024512", "text": "They shouldn't. You're brave...lol", "time": "10-17-2017 06:50 PM", "replies": []}]}, {"postID": "post6025371", "text": "I've just received my Sony Compact XZ1. Great phone all round. I had the Compact X before.\nI have a technical question. In my older compact X I was able to setup a notification sound and setup a separate one for text messages. This is setup in messages under settings.\nNow for some reason when you setup a sound under messages that sound is used for All notifications including emails, watts app and so on.\nDoes anyone have any ideas please?", "time": "10-18-2017 10:17 AM", "replies": [{"postID": "post6025379", "text": "Try going to Messages->Settings->Notifications and set a sound there. Then use a different sound for general notifications and that should do the trick.", "time": "10-18-2017 10:24 AM", "replies": []}, {"postID": "post6025403", "text": "It appears the 'new' way (old?) to do thing is to set your sounds in the app of your choice rather than the OS.\nSo go to your email app (Facebook, Twitter, etc) in settings to set the notification sound there.\nFor message notifications it's typically your the notifications sound but if you use a different app then you can change it in there.\nHope that helps.", "time": "10-18-2017 10:38 AM", "replies": []}]}, {"postID": "post6025406", "text": "I've done this too. I even went ahead and deleted the standard message app and replaced the standard with textra third party app same problem. Very weird.", "time": "10-18-2017 10:39 AM", "replies": []}, {"postID": "post6027023", "text": "Did a recent battery rundown that I could screenshot for this thread. \nNote that not all of the apps I used show in Oreo. I used it normally, read several chapters of my ebook, watched some videos of various lengths (5-20 minutes) and this is what we got. \nIt shut down 5 minutes later (10:25 pm) and I turned off stamina mode once it kicked in at 15%. With Stamina mode, it probably could have went a few more hours.", "time": "10-19-2017 07:50 AM", "replies": []}, {"postID": "post6027524", "text": "Superb battery life!", "time": "10-19-2017 12:46 PM", "replies": [{"postID": "post6027627", "text": "Yep, this was a hard one to kill haha. Also in that time frame, I was in strong and weak signal areas.", "time": "10-19-2017 01:36 PM", "replies": []}]}, {"postID": "post6027879", "text": "I wish Sony would stop installing apps like Spotify as system apps. You can't uninstall them, only disable. It's irritating.", "time": "10-19-2017 03:41 PM", "replies": [{"postID": "post6027906", "text": "I don't disagree but the AVG one bothers me the most. Spotify and Facebook are understandable because people use them. AVG is overkill on a phone.", "time": "10-19-2017 03:52 PM", "replies": []}]}, {"postID": "post6029274", "text": "I got my Sony compact zx1 but I can't use the phone yet because I don't have case yet  I did set up the phone and it looks good so far. I am using pixel 2 at this moment and pixel 2 camera just blows away xz1 compact but that was expected. Man I was going to return pixel 2 but pixel 2 is also surprisingly good lol.", "time": "10-20-2017 12:27 PM", "replies": [{"postID": "post6029299", "text": "Are you keeping both? How will you use them? Lol.\nIs the Compact's camera not great?", "time": "10-20-2017 12:38 PM", "replies": [{"postID": "post6029315", "text": "I really can't keep both for finance reason  Sony compact zx1 camera is not bad at all but pixel 2 is much better. I am a photographer so xz1 camera is more than enough for me but pixel 2 is just another class.", "time": "10-20-2017 12:46 PM", "replies": []}, {"postID": "post6029325", "text": "The Pixel seems to require less adjustment, especially in low light conditions. \nFor me, the ZX1 Compact is nice with details but not always with colors. The Pixel just nails it. Even my Galaxy A3 2017 seems to be better with colors (similar to Pixel) but a bit noisy in low light conditions.\nIf time permits, I plan to do a shootout with the iPhone SE, Pixel and ZX1 Compact without any adjustments. I'm not krazyatom so my pictures will be just average ones lol.", "time": "10-20-2017 12:50 PM", "replies": []}]}, {"postID": "post6029314", "text": "Ooh you got both together?! You are a lucky one.\nI can relate to that, it's a hard decision. I'm going through this with my original Pixel and this phone.", "time": "10-20-2017 12:46 PM", "replies": [{"postID": "post6029355", "text": "It's hardddd. I want to keep both but I can't justify to keep both lol. I will try both for now!", "time": "10-20-2017 01:01 PM", "replies": [{"postID": "post6029362", "text": "I totally understand that but I wouldn't be surprised if you keep the Pixel 2 lol. From what I have seen, regardless of light conditions, pictures from that seem to be amazing.", "time": "10-20-2017 01:04 PM", "replies": []}]}]}]}, {"postID": "post6035376", "text": "Just sharing my review here as well, thought a bit much to start a new thread for this, so hope TS don't mind i just continue the discussion here. This is my favourite phone from Sony this year for sure, probably because i'm biased and like smaller phones. Also because it's in a really unique position where it's one of its kind.\n(also this is from a slightly different perspective since in Singapore the price is S$668, which is around 490 USD. Which i think makes it a pretty decent deal.)\nHighlights:\n- great performance in a small package (much better thermal performance too compared to Z3/Z5/X Compact)\n- Speakers are finally loud enough\n- IP68 is back\n- the pricing is good\n- 960fps is still awesome.\n- Battery life has been solid\nDownsides:\n- the front camera is bad in low light to me.\n- the rear camera is decent but not the best, it still loses out to a lot of other flagship phones\n- Android Oreo hasn't really been as solid in my time with it? maybe need more time to fix bugs.\n- the fingerprint sensor felt a little mushier than older compact devices, but just nitpicking here.\nNeutral points:\n- The design is still a little old with the large bezels and all, which some may not like. I find it okay though. Like for a smaller size phone i think a bit of bezel looks okay.\n- not sure why sony still using the older style of app drawer, and why they even still have a launcher when they already took out so many features. Like even double tap to wake.\nHave a video review too for anyone is interested.", "time": "10-24-2017 01:18 AM", "replies": [{"postID": "post6035568", "text": "Yes thank you for sharing! I loved your review! I was actually hoping that you would post it here sometime, so it's much appreciated. I totally agree with you on mostly everything you said. \nComing from an iPhone SE, the front camera has more detail in low light over the SE but in my opinion, it has color issues. Totally agree about the back camera. Great review! I am finding that using another camera app as \"default\" fixes this (for both cameras) but at the price, it's up to the person if they don't mind doing that.", "time": "10-24-2017 06:41 AM", "replies": []}]}, {"postID": "post6035617", "text": "Mine should be here tomorrow. I went with a international Silver version. I usually always get black phones but wanted to mix it up this time around.\nHad the Z3C, the Z5C and the XC. Excited to get this one as the Compacts are my favorite devices of all time.\nI was a bit bummed with the XC since it went mid range specs but it performed well so no real complaints with it but I am thrilled to see it return to flagship specs.", "time": "10-24-2017 07:38 AM", "replies": [{"postID": "post6035644", "text": "Sweet congrats! The camera might not seem better over the XC but it is. I'll be looking forward to your thoughts/impressions on it.", "time": "10-24-2017 07:55 AM", "replies": []}]}, {"postID": "post6035936", "text": "I'm curious. What version of Compact XZ1 do you have international or other version?", "time": "10-24-2017 10:41 AM", "replies": []}, {"postID": "post6035942", "text": "I got international model.", "time": "10-24-2017 10:45 AM", "replies": []}, {"postID": "post6035953", "text": "Same here.\nSony phones usually have the same core bands regardless of the model.", "time": "10-24-2017 10:50 AM", "replies": []}, {"postID": "post6037733", "text": "I'm really thinking of picking one up when my S8 Active sells. I'm wanting a smaller, lighter phone. I'll most likely grab an intentional model for cheaper price and flash a US/UK combo firmware to get VoLTE and fingerprint working.", "time": "10-25-2017 09:48 AM", "replies": [{"postID": "post6037768", "text": "I went ahead and purchased from a company called Eglobal central. The phone already came with the finger print sensor activated. Software is custom Hong Kong. I may flash with the custom US and see what happens.", "time": "10-25-2017 10:02 AM", "replies": [{"postID": "post6037924", "text": "Is that US version flashed with HK firmware?", "time": "10-25-2017 11:14 AM", "replies": []}]}]}, {"postID": "post6037860", "text": "I got a compact xz1 and xz premium. Xz1 definitely wins in battery life! Xz premium just received Oreo 8.0 so I may compare them.", "time": "10-25-2017 10:51 AM", "replies": [{"postID": "post6038001", "text": "Hmm I'm curious, that could be really interesting.", "time": "10-25-2017 11:54 AM", "replies": []}]}, {"postID": "post6039408", "text": "Thanks!!! haha. The iPhone Se was my previous goto compact phone too before I switched to an X Compact. Which is why the XZ1 Compact is so appealing to me. To me i just find the front camera quality a little underwhelming though. Other than that, easily one of my favourite phones of the year. It's solid all round, not too crazily priced (where i live), and Sony is the only Android OEM still making flagship devices this small.", "time": "10-26-2017 07:09 AM", "replies": [{"postID": "post6039447", "text": "You're welcome. I just really enjoy your reviews, you do a great job on them so seeing your post in this thread had me excited.\nI agree with you on all that you said here. It's awesome that you have it for such a great deal there. It's 600 USD stateside for the US version, which can be a hard sell without the sensor. I feel that I can make do with the front camera, everything else is just too great for me to give up lol.", "time": "10-26-2017 07:33 AM", "replies": []}]}, {"postID": "post6039589", "text": "I'm so glad I don't take selfies so I don't need to worry about front camera quality.", "time": "10-26-2017 09:10 AM", "replies": [{"postID": "post6039611", "text": "In that case, you'll be good.\nThe front camera is fine to me. Low light is where the struggle is real. I think Sony still struggles with colors a bit though.", "time": "10-26-2017 09:18 AM", "replies": []}]}, {"postID": "post6039819", "text": "My compact still on August security patch and my xy premium is October security. I wonder if xy premium is more priority over compact model.", "time": "10-26-2017 11:18 AM", "replies": [{"postID": "post6039936", "text": "That's a fair question. I read on GsmArena that the XZ1 Compact and regular ZX1 both got the October patch and I am still checking daily for it.https://www.gsmarena.com/sony_xperia...news-27737.php", "time": "10-26-2017 12:20 PM", "replies": [{"postID": "post6040023", "text": "Thanks. Sony is usually pretty good with their updates so I wouldn't worry. Btw, my pixel 2 is still on September security patch!", "time": "10-26-2017 01:43 PM", "replies": [{"postID": "post6040047", "text": "You're right about that, I'll just try to be patient.\nThat's interesting about the Pixel 2, I would think that an update for that would have rolled out by now. Speaking of, any luck with deciding what to keep? \nA part of me wants to be all into the XZ1C but the other part feels like I'll miss having my original Pixel.", "time": "10-26-2017 01:56 PM", "replies": [{"postID": "post6040063", "text": "I have not decided yet  pixel 2 wins in camera but compact has better battery life with best small form factor. Everyone is using Sony camera sensor but Sony can't make better camera software?", "time": "10-26-2017 02:08 PM", "replies": [{"postID": "post6040092", "text": "Right?! I don't understand. I can relate to your struggle.", "time": "10-26-2017 02:29 PM", "replies": []}]}]}]}]}]}, {"postID": "post6041782", "text": "Got the October security patch today! Yess go Sony!", "time": "10-27-2017 03:12 PM", "replies": [{"postID": "post6041809", "text": "Great. I may end up returning my compact due to pixel 2 and iPhone X  I can only keep one phone for financial reason", "time": "10-27-2017 03:29 PM", "replies": [{"postID": "post6041813", "text": "I totally understand. You have to do what works for you. I figured that based on what you do and your interests, you'll probably choose the Pixel 2 over it. The Pixel 2 has really good cameras and the iPhone X will be an interesting phone for sure... \nCome to think of it, it's even shorter than the Pixel 2 so it might feel closer to a smaller phone over the Pixel 2 you have.", "time": "10-27-2017 03:36 PM", "replies": [{"postID": "post6041896", "text": "I wish I can keep all 3  haha", "time": "10-27-2017 04:49 PM", "replies": []}, {"postID": "post6045764", "text": "I sold my Sony xz premium instead to keep the compact. I have iPhone 7 plus, pixel 2, Sony xz1 compact so I am all set! Sony compact will be my daily driver once I get a good working case.", "time": "10-30-2017 12:02 PM", "replies": [{"postID": "post6045776", "text": "Congrats! Sounds like you'll be just fine on the camera front then.\nIf you don't mind clear cases, check out a thread about the Ringke case by Andrew_404 in this forum. I decided to go back to the Pixel (first generation one).", "time": "10-30-2017 12:08 PM", "replies": [{"postID": "post6045821", "text": "Did you returned your compact? Pixel 1st Gen is still excellent device. I traded in my Pixel XL for my pixel 2. I still ended up paying like $310  but I think it was worth it. Pixel 2 battery last longer than my pixel XL lol.", "time": "10-30-2017 12:33 PM", "replies": [{"postID": "post6045887", "text": "I can't return it, because it dropped once  There are 2 scuffs that are noticeable on the body. If I return it, they will take 50% just for those. I'll be selling it once I get the chance to take pictures and such.\nNice! Aw but $310 is better than what it was before. Wow, that's awesome about the battery life on the Pixel 2. I miss the battery life already.", "time": "10-30-2017 01:23 PM", "replies": [{"postID": "post6045992", "text": "50%? I'll take it LOL.", "time": "10-30-2017 02:32 PM", "replies": [{"postID": "post6046013", "text": "Haha.\nHopefully someone else feels the same way. The screen is perfectly fine though. I'll have better luck dealing with selling for whatever rather than deal with returning it and getting a little over $200 back because of condition lol. That hurts my soul.", "time": "10-30-2017 02:46 PM", "replies": []}]}]}]}]}]}]}]}]}, {"postID": "post6047446", "text": "Been using mine for about a week now and I dig it. \nCompared to my Z5C and XC it's noticeably faster and smoother. The screen also looks better to my eyes. Happy with it other than the fact I am still stuck on the August security patch. Heck even my Z5C has September's update.", "time": "10-31-2017 01:23 PM", "replies": [{"postID": "post6047502", "text": "Glad to hear it! Just go to the update and check daily. I got my October patch a few days ago...", "time": "10-31-2017 02:20 PM", "replies": []}, {"postID": "post6047548", "text": "I too have August security patch and mine is international version. How do you like your battery life compared to z5c?", "time": "10-31-2017 03:01 PM", "replies": [{"postID": "post6047677", "text": "Same here, international version.. \nBattery life is NOT as good as the Z5C so far. I am getting a lot of idle drain but nothing shows as abnormal in the battery usage stats.\nWith my Z5C I'd get about 5-51/2 hours of SOT but the XZ1C is only managing about 4-41/2.\nIf I leave it off the charger overnight, I am seeing massive drain.. 30% or so..", "time": "10-31-2017 04:33 PM", "replies": [{"postID": "post6047710", "text": "Wow something is definitely wrong. Check the battery activity and see what the drainage is. Do you play a lot of games and watch video?", "time": "10-31-2017 05:00 PM", "replies": [{"postID": "post6047716", "text": "Battery stats don't show anything abnormal. No games no videos. Most the drain is when idle / in deep sleep mode.", "time": "10-31-2017 05:06 PM", "replies": []}]}]}]}]}, {"postID": "post6047758", "text": "That's weird, I thought it it has awesome battery life.", "time": "10-31-2017 05:49 PM", "replies": [{"postID": "post6047770", "text": "Yup, battery life is very good. I think I can get mine 10 SOT but I charge my phone before I go to sleep so not sure it will drain battery life.", "time": "10-31-2017 05:59 PM", "replies": [{"postID": "post6047823", "text": "It sucks that raqball is having issues, I have to say that it was my second best phone for battery life ever. I look at my Pixel and I miss that battery life I had on the XZ1C.", "time": "10-31-2017 06:32 PM", "replies": []}]}]}, {"postID": "post6047855", "text": "So far today I am at 51% with 1 hour 22 minutes of screen on time.....", "time": "10-31-2017 06:55 PM", "replies": [{"postID": "post6047866", "text": "Wow that's odd. How's your signal? I went between weak signal and strong signal areas. Also do you have high accuracy on? I'm sorry that this is going on with your phone. Also have the international version too.", "time": "10-31-2017 07:08 PM", "replies": []}]}, {"postID": "post6047875", "text": "Signal where I live is not the greatest but it's better than it was on the Z5C. Location is in battery saving mode.\nNot sure what's going on with it. I have a ton of the crud disabled and I've done 2 factory resets. I just cleared the cache on the phone (hold power and volume up until the phone vibrates 3 times, then reboot) so I'll see if that helps any. \nI do have brightness cranked up but I always have it set there and didn't see these issues on the Z3C, the Z5C or the XC..\nMaybe the battery is just out of calibration and needs a few charging cycles to correct. I've always gotten stellar battery life from the Compact line.", "time": "10-31-2017 07:17 PM", "replies": [{"postID": "post6047890", "text": "Ah okay. I hope that it will correct for you too and not take as long to do that.", "time": "10-31-2017 07:31 PM", "replies": [{"postID": "post6047894", "text": "I'll give it a week and if it's still having issues, I return it.", "time": "10-31-2017 07:35 PM", "replies": [{"postID": "post6047938", "text": "That's the best possible plan! Good luck!", "time": "10-31-2017 08:18 PM", "replies": []}]}]}]}, {"postID": "post6048022", "text": "Here is my phone idle", "time": "10-31-2017 09:30 PM", "replies": []}, {"postID": "post6048611", "text": "After 12 hours phone idle, I lost about 8% battery life.", "time": "11-01-2017 10:28 AM", "replies": []}, {"postID": "post6048714", "text": "I found a thread on XDA where others are seeing the same battery issues as I..\nToday I am at 82% with a whopping 9 minutes of screen on time and 2 hours 16 minutes off the charger.", "time": "11-01-2017 11:42 AM", "replies": [{"postID": "post6048722", "text": "Oh no. Is there a fix for that? Can you get a replacement?", "time": "11-01-2017 11:49 AM", "replies": [{"postID": "post6048729", "text": "No fix that I saw.. I pretty much have everything disabled and I also have nothing running in the background. The battery drain is insane considering how I currently have it setup.\nNot sure on an exchange. I purchased it off eBay (new in box) so I'll have to contact the seller and see how they want to handle it.", "time": "11-01-2017 11:53 AM", "replies": []}]}]}, {"postID": "post6049971", "text": "Did another factory reset yesterday.. I left it off the charger overnight and it only drained about 7% so this is promising.\nHopefully reset # 3 does the trick.", "time": "11-02-2017 07:46 AM", "replies": []}, {"postID": "post6050137", "text": "Also, I just got the October 1 security patch update on my international model..", "time": "11-02-2017 09:28 AM", "replies": []}, {"postID": "post6050142", "text": "So glad you are liking it! I've always liked Sony phones. It's good to know that the fingerprint scanner is responsive; and the size of the phone is intriguing, indeed, as I'm now leaning towards potentially going smaller for my next phone. Thanks for your detailed review! Always nice to see your posts in the forums.", "time": "11-02-2017 09:33 AM", "replies": []}, {"postID": "post6053369", "text": "Mine is going to go back.. Last night I went to bed with the battery at 63% and this morning when I woke up it was dead and powered off. \nSomething is draining the battery when the unit goes into deep sleep or the battery is defective and leaking maybe?..", "time": "11-04-2017 08:02 AM", "replies": [{"postID": "post6053427", "text": "Wow I'm sorry that is happening to you", "time": "11-04-2017 08:44 AM", "replies": []}]}, {"postID": "post6055201", "text": "Now I remember why I didn't like the XZ Premium I had for a few days, and why I'll probably end up selling this XZ1c I have, I get no Bluetooth metadata on my cars stereo when playing music. I hate seeing \"No Artist, no song info\" or whatever.", "time": "11-05-2017 01:20 PM", "replies": [{"postID": "post6056212", "text": "Since this is not a thread about the XZ Premium I don't know why you're posting this here.\nAs for your statement. I own a XZ. I use Bluetooth every single day in my car. I get metadata all the time. Maybe it's something else and not the phone?", "time": "11-06-2017 03:31 AM", "replies": [{"postID": "post6056457", "text": "Because I have the XZ1 Compact and I get no metadata, which is like the XZ Premium I had which got no metadata. I forgot about that when buying the XZ1c. Guess I could have made my original comment more clear. Also it's a known issue with Sony phones. Every single other Android I've had, and I've had a lot, has always shown metadata.", "time": "11-06-2017 08:57 AM", "replies": [{"postID": "post6057839", "text": "I have absolutely no issues at all. None. I get all the metadata whether I'm using streaming apps or using my MP3s. MP3s I ensured have the data to being with I should add. I've had a few MP3s in the past which were pretty crap for metadata and didn't display properly but I fixed them.\nIn Sony's music player you can download the album data for MP3s. Which is pretty good and does a decent job.\nSo I'm a bit confused why your having issues but I'm not. I didn't even know it was a Sony issue.\nDo other music players on phones automatically update metadata or something?", "time": "11-07-2017 03:17 AM", "replies": [{"postID": "post6058172", "text": "Just because you don't have an issue on your XZ, doesn't mean it's not an issue. There's quite a few posts on different forums. Out of the last 20 phones I've had, the XZ1C and XZP are the only ones that haven't worked properly with my car Bluetooth.", "time": "11-07-2017 09:21 AM", "replies": [{"postID": "post6058271", "text": "I had no issue with the Z3, Z5, XZ and the XZ1C.\nI'm not saying you don't have an issue just a bit odd. I've never run into any issues with Bluetooth and Sony with my car stereo.\nI don't see why Bluetooth would be any different on a Sony phone than any other new phone.\nHas anyone come up with a reason why they're having issues with their car stereos on those forums?", "time": "11-07-2017 10:32 AM", "replies": []}]}]}]}]}]}, {"postID": "post6084357", "text": "How is the cell signal reception on this phone?", "time": "11-25-2017 01:29 PM", "replies": [{"postID": "post6086528", "text": "In my experience, it was very good.", "time": "11-27-2017 10:24 AM", "replies": []}]}, {"postID": "post6084566", "text": "I have no issues with cell coverage.", "time": "11-25-2017 05:03 PM", "replies": []}, {"postID": "post6101433", "text": "iPhones are known for great battery life in stand by mode. When it comes to heavy use and hours of screen on time they are the worst. The reason why it that they pack super small batteries to keep \"sleek\" design. 2000 mAh battery just doesn't cut it anymore. Only Plus models are decent for moderate to heavy use. Regular 4.7 variant is a pain. SE has a smaller screen , but a smaller battery as well, so it may perform slightly better All of my friends are constantly recharging throughout the day. Many opted for a Plus just for that reason. Some went with ridiculous battery pack, making the phone over 2 times bigger. .", "time": "12-09-2017 10:26 AM", "replies": []}]}, {"title": "Xperia XZ1 or XZ1 Compact?", "thread": [{"postID": "post6002432", "text": "I'm drawn to the XZ1 Compact but I'll like to know which one you are drawn to, and why?\nFor me, I have been seeking a phone to replace my iPhone SE but it's still small. This seems to hit the spot.", "time": "10-03-2017 11:13 AM", "replies": []}, {"postID": "post6002918", "text": "I'm drawn to the Compact but here in Canada, so far, Sony hasn't indicated if they'll even offer the smaller version. I would buy the Twilight Pink for my wife in a heartbeat; she's a dog groomer and takes copious photos and the size and specs of the Compact would be perfect for her. \nThat said, I actually like the Venus Pink colouring on the XZ1 itself so, who knows, maybe I'll get her this one. It's nice to have options.", "time": "10-03-2017 04:43 PM", "replies": []}, {"postID": "post6005626", "text": "Now that pixel 2 (5 inch) came out. It's going to be tough decision for me lol. Sony compact line always been 720p resolution so battery will be very very good especially with snapdragon 835 chipset. DXOmark scored 98 for google pixel 2. I wonder new sony xz1 compact won't have finger print sensor again for US markets.", "time": "10-05-2017 10:26 AM", "replies": [{"postID": "post6006096", "text": "I can relate to this. I bought a XZ1 Compact which I should have soon before hearing about the Pixel 2. Since I have a Pixel and the Google trade-in value is nice, I also got a Pixel 2 too BUT I'm not going to get it until the middle of November so I have a window of time with the XZ1 Compact.\nBasically, if the XZ1 Compact cameras are solid (that's my only concern because everything else you mentioned will be great) enough for me, I'll probably cancel the Pixel 2 order. I don't plan to keep both...\nIf the Sony cameras are a disappointment to me though, the Pixel 2 will be my pick possibly. I love that the Sony has a headphone jack...", "time": "10-05-2017 02:43 PM", "replies": [{"postID": "post6006144", "text": "I already pre-order pixel 2 but it won’t arrive until October 19. I am still not 100% sure if I want pixel lol. No headphone jack is also deal breaker for me. Let me know how your compact zx1 goes.", "time": "10-05-2017 03:03 PM", "replies": [{"postID": "post6006164", "text": "Whoa, yours is coming in like 2 weeks but I can get how you feel about the Pixel. That's so hard.\nMy XZ1 Compact is scheduled to arrive on Monday so I will for sure.", "time": "10-05-2017 03:15 PM", "replies": [{"postID": "post6009406", "text": "I'd take the XZ1 over the Compact. 5.2\" isn't too large a screen for me. I've used larger and the 5.0\" X I'm running seems a tad smallish. I also like the 1080p vs 720p, the extra internal storage and the fact that the XZ1 is Type C 3.1 and the Compact is only 2.0 protocol.Congrats on the purchase. About that camera, seems to be the same sensor and f/stop as the X, but with a slightly longer focal length and reduced MP count. I wouldn't put the Sony camera up there with Lumia, but mine is a decent shooter. Biggest thing will be if it is all-in with Camera2 API. The X only partially supports it (missing RAW support).\nTry this app to check: https://play.google.com/store/apps/d...s.camera2probe", "time": "10-07-2017 02:12 PM", "replies": [{"postID": "post6010014", "text": "Sounds like 5.2\" could work out for you.\nThank you! I had the X Compact and as a point and shoot kind of gal, it wasn't good enough for me. Apparently Sony has updated their software processing for their camera. From what I see from reviews, it does seem improved but the question for me would be if it is improved enough to be a solid camera or will it still miss the bar?\nI also have a Pixel which has an excellent camera. I don't need it to totally meet the Pixel but I do need it to hold its own, beat the iPhone SE and my Galaxy A3. Enough to make one of my phones no longer needed, lol.\nThanks for the app link, I will give the app a try for you.", "time": "10-07-2017 09:22 PM", "replies": []}, {"postID": "post6012918", "text": "I tried this app for you and this is what I got:", "time": "10-09-2017 07:53 PM", "replies": []}, {"postID": "post6048659", "text": "I can confirm that the XZ1 Compact STILL does NOT support RAW. It supports all other camera2api feautres EXCEPT for RAW.\nIt's like Sony doesn't want you to actually see how ****ty their camera software is.\nBecause the XZ1 Compact is still a pretty terrible camera performer in ANY lighting condition that isn't great. And without RAW support, you can't use the Google Camera HDR+ port from XDA with it which would put a vastly better camera on Xperias.", "time": "11-01-2017 11:00 AM", "replies": [{"postID": "post6048700", "text": "I was really disappointed to find out that the ZX1 Compact didn't support the Google camera port.", "time": "11-01-2017 11:34 AM", "replies": [{"postID": "post6048766", "text": "Is there anyway to improve xz1 compact camera quality?", "time": "11-01-2017 12:29 PM", "replies": [{"postID": "post6048851", "text": "You can \"change\" the default camera app to another app like Open Camera. Open Camera is generally better with colors from what I noticed. Change is in quotes because it's not a total change. It's a change for what launches when you tap the power button twice to open the camera. From apps that use the camera (like Duo, Skype, etc), you can't get around the default camera processing.\nAside from that, not much one can do aside from tweaking manually and hoping for the best.", "time": "11-01-2017 01:22 PM", "replies": [{"postID": "post6048896", "text": "I wish my zx1 compact had great camera like pixel 2. I see myself using pixel 2 more often", "time": "11-01-2017 01:41 PM", "replies": [{"postID": "post6048951", "text": "Yeah same, I can relate so much. I would probably do the same thing if I had the Pixel 2 too.", "time": "11-01-2017 02:13 PM", "replies": []}]}]}, {"postID": "post6050400", "text": "Not really. You can use an alternate app like \"Manual Camera\" but none of the third party camera apps I've tried so far has proven to be that mindblowing. Besides, you then have the camera button which will always open the Sony camera.\nMind you, I didn't buy the XZ1 Compact to actually use a a phone and that's - apart from the lack of OIS, wireless charging and an AMOLED screen - because I knew the camera would be complete rubbish. I've had a Z3 Compact before and I've given up on Sony actually listening to their consumers. We have been complaining about the sub-par camera since the Z3 and they still prefer to waste time on gimmicks instead of actually doing something about the quality.Well, I have kept the S7 as my daily driver anyway.\nAnd I normally have the Nokia 1020 at hand as well for photos. But still, if Sony didn't bloody slack, I wouldn't need to carry 3 phones around.", "time": "11-02-2017 12:29 PM", "replies": [{"postID": "post6050464", "text": "Yes I didn't buy zx1c for camera. I bought em for small form factor and good battery life. It's perfect for outdoor activity!", "time": "11-02-2017 01:04 PM", "replies": []}]}]}]}, {"postID": "post6049257", "text": "That's why I have a Lumia 950 for a dedicated camera. The Xperia X is going to be a test bed for Sailfish X. The camera is just alright, but you can make it jump through a couple of hoops.", "time": "11-01-2017 05:15 PM", "replies": [{"postID": "post6050400", "text": "Not really. You can use an alternate app like \"Manual Camera\" but none of the third party camera apps I've tried so far has proven to be that mindblowing. Besides, you then have the camera button which will always open the Sony camera.\nMind you, I didn't buy the XZ1 Compact to actually use a a phone and that's - apart from the lack of OIS, wireless charging and an AMOLED screen - because I knew the camera would be complete rubbish. I've had a Z3 Compact before and I've given up on Sony actually listening to their consumers. We have been complaining about the sub-par camera since the Z3 and they still prefer to waste time on gimmicks instead of actually doing something about the quality.Well, I have kept the S7 as my daily driver anyway.\nAnd I normally have the Nokia 1020 at hand as well for photos. But still, if Sony didn't bloody slack, I wouldn't need to carry 3 phones around.", "time": "11-02-2017 12:29 PM", "replies": [{"postID": "post6050464", "text": "Yes I didn't buy zx1c for camera. I bought em for small form factor and good battery life. It's perfect for outdoor activity!", "time": "11-02-2017 01:04 PM", "replies": []}]}]}]}]}]}]}]}]}, {"postID": "post6009514", "text": "I just ordered the xz1 after deleting from my cart like eight times. Lol. The reason is because I too ordered the Google Pixel and wasn't sure if I should wait. I do however prefer the largest screen I can manage so if I like the xz1, I'll cancel the pixel. I'm pretty sure the pixel does not support hdr nor does it have a headphone jack. I know is the trend but definitely not convenient if you're looking to charge while listening to music or video.\nI've actually had three compact phones and love the size. The xz1 is extremely thin though. Never had the 5.2 so I'll try it. In addition to the 1080p and screen size, the compact also doesn't have hdr and the radios are slightly weaker. I love Sony phones. They are well optimized and smooth as silk. Having 8.0 already, makes the pixel a harder sell for me. The Camara and the oled screen are the only things it has over Sony right now imo. If Sony put darn OIS in their phones, it would be a no brainer", "time": "10-07-2017 03:07 PM", "replies": [{"postID": "post6009702", "text": "Sounds like a great plan. Congrats on your XZ1! I'll be looking forward to your impressions of it. \nI can relate to that, I did a similar thing with the Pixel too. A headphone jack is a noticable thing to be gone. It's a bit challenging not to have one for me.", "time": "10-07-2017 05:12 PM", "replies": []}]}, {"postID": "post6010741", "text": "I'm glad I'm not the only one with Phone-itus\n😂", "time": "10-08-2017 10:41 AM", "replies": []}, {"postID": "post6010778", "text": "My ultimate goal is to purchase one phone per year and XZ1 compact released!", "time": "10-08-2017 11:05 AM", "replies": []}, {"postID": "post6050181", "text": "Does anyone have an XZ1? Not the Compact.\nIf so how is it?", "time": "11-02-2017 10:10 AM", "replies": []}, {"postID": "post6060689", "text": "I got the XZ1 end of October. Having always Sony and later Xperias, it was no question for me to think about another brand. Before the XZ1 compact, I had the Z3 compact. I stick with this size, the compact, I want to use it with one hand only, often, the bigger one isn't handy enough for me. Also it's more comfy to put it in the back of the jeans, lol, without caring that much for it falling off. I'm a woman and probably that's why I prefer the compact one, haha. Smaller hands than men we have, right?", "time": "11-08-2017 06:10 PM", "replies": [{"postID": "post6060722", "text": "As a fellow woman, pocketability and one hand usage usually make me go smaller. I have long fingers so I can't relate to the smaller hands.", "time": "11-08-2017 06:24 PM", "replies": [{"postID": "post6060730", "text": "You can pick up another zx1 compact!", "time": "11-08-2017 06:27 PM", "replies": [{"postID": "post6060805", "text": "Haha, I'm good for now.", "time": "11-08-2017 07:31 PM", "replies": []}]}]}, {"postID": "post6088807", "text": "Well...I'm a 1,85m man and I hate phones over 5\". On the other hand I have a long time friend that is 1,50m and she loves phablets lol", "time": "11-28-2017 08:41 PM", "replies": []}]}, {"postID": "post6082902", "text": "I am looking at getting the xz1 compact in green for my wife. I think it's an awesome phone, she LOVES the color...hates that it's not an iPhone. ha ha. I am going to get it and tell her she can use both! I am getting the regular zx1 in blue. Another awesome thing is that our fingerprint scanners work in Canada! woo hoo!", "time": "11-24-2017 04:03 AM", "replies": []}, {"postID": "post6083038", "text": "All of these Sony phones are hideous. Was looking at my old Z1 Compact the other day... man that was beautiful. And way slimmer than the toyish POS the XZ1 Compact is.\nSony are just awful at design these days it's infuriating. I don't know what happened.", "time": "11-24-2017 08:51 AM", "replies": []}]}, {"title": "New to Android - help with vibrate notifications for emails/text", "thread": [{"postID": "post6083128", "text": "Hi,\nI posed this question in the help forums buy did nothing get a response so hopefully I will have better luck here.\nI am setting up Xperia XZ1 Compact running Oreo and I have some questions about the vibrate notifications. \nI would like to have a quick way to toggle all vibrate notifications on/off but leave the LED notification turned on. I don't see a separate option for vibrate by itself. \nThere is a way to turn off vibrate for all but I would need to go to each account to turn them off which is inefficient. Or, I can use the \"do not disturb\" but this also turns off LED notifications as well. And, I won't be able to listen to media in this setting. \nIf the built in OS does not have this option, is there an app that meets my criteria?", "time": "11-24-2017 10:38 AM", "replies": []}, {"postID": "post6083231", "text": "Unfortunately, not any way I can think of with a single app. Some combination of apps may do what you need - Xposed Framework and the Xposed LED app - but the phone has to be rooted to run Xposed. (Then you may be able to use do not disturb and still force the LED notifications.)", "time": "11-24-2017 12:03 PM", "replies": [{"postID": "post6083761", "text": "Rukbat, after spending a little more time with the phone, I have came to the conclusion that that what I want is not available in the OS through regular means.Chanchan05, there isn't that option on my phone that I can see. \nWhile I like that each app has customizable notifications, it doesn't have exactly what I'm looking for. After using BlackBerry for close to 10 years, it seems like an obvious setting to have. I wonder if this \"missing\" setting is unique to Xperia phones or if other Android phone manufacturers have what I'm looking for.", "time": "11-24-2017 10:22 PM", "replies": [{"postID": "post6083787", "text": "I've only used Samsung mostly and well, it has that. Swiping down to bring the notification shade down reveals toggles. One of those toggles between sound, vibrate, and mute all notifications without affecting LED. Strange, AFAIK this is on all Android phones.", "time": "11-24-2017 10:48 PM", "replies": []}]}]}, {"postID": "post6083248", "text": "Does it not have a vibrate toggle in the notification tray? Swipe down on the tray and you will see an icon that usually says sound. Tap it once to set to vibrate, another to complete mute.", "time": "11-24-2017 12:12 PM", "replies": [{"postID": "post6083761", "text": "Rukbat, after spending a little more time with the phone, I have came to the conclusion that that what I want is not available in the OS through regular means.Chanchan05, there isn't that option on my phone that I can see. \nWhile I like that each app has customizable notifications, it doesn't have exactly what I'm looking for. After using BlackBerry for close to 10 years, it seems like an obvious setting to have. I wonder if this \"missing\" setting is unique to Xperia phones or if other Android phone manufacturers have what I'm looking for.", "time": "11-24-2017 10:22 PM", "replies": [{"postID": "post6083787", "text": "I've only used Samsung mostly and well, it has that. Swiping down to bring the notification shade down reveals toggles. One of those toggles between sound, vibrate, and mute all notifications without affecting LED. Strange, AFAIK this is on all Android phones.", "time": "11-24-2017 10:48 PM", "replies": []}]}]}]}, {"title": "XZ1 Compact : What is your preferred color?", "thread": [{"postID": "post6001494", "text": "I'm curious to know what color you prefer for the XZ1 Compact. Please vote in the poll above and/or reply.\nBlack? White Silver? Horizon Blue? Twilight Pink?", "time": "10-02-2017 03:37 PM", "replies": []}, {"postID": "post6001505", "text": "I like the Blue followed by the Black.\nThe Horizon Blue reminds me of the Nexus 5X and the Nextbit Robin.", "time": "10-02-2017 03:46 PM", "replies": [{"postID": "post6001672", "text": "Yeah that blue is nice. I like the pink but my other two phones are pink lol. That's probably why I like the blue.", "time": "10-02-2017 06:33 PM", "replies": []}]}, {"postID": "post6001521", "text": "If Sony even brings the Compact to Canada, I will buy the Twilight Pink for my wife.", "time": "10-02-2017 03:58 PM", "replies": []}, {"postID": "post6001608", "text": "black always been my favorite.", "time": "10-02-2017 05:26 PM", "replies": []}, {"postID": "post6001916", "text": "Actually always liked the white compacts. This year is silver/white and looks pretty nice. Having said that, I may try the regular xz1 to change it up from my annual compact purchase.", "time": "10-02-2017 10:51 PM", "replies": []}, {"postID": "post6009376", "text": "Love that Horizon Blue. As you may know I have a Lime Gold X. Sony does some great colors.", "time": "10-07-2017 01:47 PM", "replies": [{"postID": "post6009404", "text": "I agree, they do!\nYep, I remember. I'm surprised that Amazon is already sold out of the white and blue. Just 1 black one left. It (the phone itself) only been available for like 4 days.", "time": "10-07-2017 02:10 PM", "replies": []}]}, {"postID": "post6082907", "text": "There is a mint green colored one too! My wife really likes that!", "time": "11-24-2017 04:14 AM", "replies": []}]}, {"title": "Xperia XZ1 Compact vs iPhone SE: Early evening shootout", "thread": [{"postID": "post6035016", "text": "With the release of the Sony Xperia XZ1 Compact, a lot of people wanted to know how the camera compares to the iPhone SE since performance is similar. I wanted to do a quick shootout so that we (you and me, of course) can see how well or not so well the XZ1C holds up in different situations.\n(Disclaimer: I'm just an average gal who is into phones. I tried my best to do as similar shots as possible between the two phones. Images have been resized a bit for the forums. All pictures were shot on auto mode and with flash turned off for most pictures. The one exception is noted. I was unable to make the images the same sizes though.)\nAnyway, let's get into it. \n(The XZ1C will be the first image and the iPhone SE will be the second image. The images will also be labeled with XZ1C and SE too.)\nScene 1: Green trees \nScene 2: Mixed trees \nScene 3: Dead bug (just found it like this) \nScene 4: Low light decor \n(The XZ1C activated flash automatically, so I have included a shot with flash off as well; SE didn't activate flash at all)  \nThoughts and comments are welcome. In my opinion, Sony lost the last picture but they did try with the flash auto activating.", "time": "10-23-2017 07:53 PM", "replies": [{"postID": "post6049852", "text": "LOL we all know you wouldn't hurt a fly...\nI wasn't there to see it with my own eyes, but I'd give the trees and grass scenes to XZ1c and the others to SE.\nThanks for the tests.", "time": "11-02-2017 04:54 AM", "replies": [{"postID": "post6049896", "text": "Haha thanks. You know me but I don't know who else would know so I wanted to make sure lol.\nYou're welcome! I agree with you on your observation. The SE is more true to life with the last two.", "time": "11-02-2017 06:22 AM", "replies": []}]}]}, {"postID": "post6035343", "text": "Great comparison!", "time": "10-24-2017 12:46 AM", "replies": [{"postID": "post6035613", "text": "Thank you! I'm surprised with the results.", "time": "10-24-2017 07:36 AM", "replies": []}]}, {"postID": "post6038251", "text": "Thank you so so much for this! Exactly what I was looking for! Could I ask you which phone you found took the pictures faster? Thanks again", "time": "10-25-2017 02:26 PM", "replies": [{"postID": "post6038409", "text": "You're welcome, thank you for viewing it! From what I recall, the XZ1 Compact was faster. Both faster in opening the camera app and in taking pictures in general.", "time": "10-25-2017 03:48 PM", "replies": []}]}, {"postID": "post6038830", "text": "Awesome job. Thanks for taking the time to do this", "time": "10-25-2017 08:05 PM", "replies": [{"postID": "post6039431", "text": "Thank you! You're very welcome, I'm glad that I can help.", "time": "10-26-2017 07:24 AM", "replies": []}]}, {"postID": "post6082903", "text": "Going by these photos alone....xz1 compact for the win! plus the device itself looks sooooo damn good!", "time": "11-24-2017 04:05 AM", "replies": []}]}, {"title": "What's the issue with the Quick Charge on XZ1 Compact?", "thread": [{"postID": "post6016200", "text": "I've read it doesn't have the fastest QC, but in reality how fast does it charge compared with the latest and greatest phones?", "time": "10-12-2017 04:43 AM", "replies": [{"postID": "post6016300", "text": "I haven't went from 0-100% yet but in my experience, charging from 39 to 100 can take an hour and a bit (like 10 minutes) by itself. It still quick charges but it is a little slower than say the the OnePlus and Pixels.", "time": "10-12-2017 07:28 AM", "replies": []}]}, {"postID": "post6016327", "text": "Thanks. That's a little disappointing.", "time": "10-12-2017 07:52 AM", "replies": [{"postID": "post6016331", "text": "You're welcome. It hasn't bothered me at all really. I don't get why Sony has it that way. I'll see if I can take a screenshot to properly show the time it would take to charge the next time I charge it.", "time": "10-12-2017 07:56 AM", "replies": [{"postID": "post6016407", "text": "That would be awesome, cheers!\nHow do you rate the phone overall? I'm definitely considering it.\nHow's the display in particular in terms of brightness, sharpness and \"punchiness\" of colours?", "time": "10-12-2017 09:14 AM", "replies": [{"postID": "post6016472", "text": "I have had it for close to 4 days (got it Monday night) and so far, I have had a hard time putting it down. I plan to share a review in a couple of days but I'll give it a 9 out of 10.\nIt has been bright enough for me but it's been mostly cloudy here so it's hard to say how it will be in sunny weather. On that note, there's a setting where the screen doesn't turn off if it senses that it is in your hand and it does work well.\nFor the colors, there's finally a standard mode that isn't as cold. It seems like they improved that. It seems similar to the colors of the Pixel but less saturated than Samsung colors. Blacks are light though. Still black but kind of off black.\nSharpness seems to be fine to me. I'm not the type that notices every pixel on a screen so I'm fine with it being a 720p display.", "time": "10-12-2017 10:27 AM", "replies": []}]}]}]}, {"postID": "post6016496", "text": "Are you still going to try the pixel to compare?", "time": "10-12-2017 10:48 AM", "replies": [{"postID": "post6016507", "text": "Nope, I cancelled my order for the Pixel 2. I have the first Pixel (or Pixel 1, I guess lol). I liked it but I really just always wanted a smaller phone with similar performance to the Pixel, which this provides. I figured that if this doesn't work out, I could go for the Pixel 2 but I'm pleased with XZ1 Compact.", "time": "10-12-2017 10:54 AM", "replies": [{"postID": "post6016610", "text": "Hmm. I'm thinking my xz1 is a tad big for me. Doesn't look like the pixel is much smaller. I should have stayed with my gut and went compact 🙄. I might just return this and get it.", "time": "10-12-2017 11:59 AM", "replies": [{"postID": "post6016709", "text": "According to Phone Arena's size compare, it might be noticeable but of course it's up to you.https://www.phonearena.com/phones/si...77,10264,10584", "time": "10-12-2017 01:09 PM", "replies": []}]}]}]}, {"postID": "post6017224", "text": "@Eggmundo\nI have some screenshots for you (and anyone else interested) about the Quick Charging. I think it has gotten used to my charging patterns so I think what I told you wasn't totally right.\nThe first two is battery life and screen on time. \nThe last one is the shot I mentioned before. \nEdit: It finished charging 2 minutes before this screenshot. It has to get used to your charging patterns.", "time": "10-12-2017 08:52 PM", "replies": []}, {"postID": "post6017476", "text": "That's quite impressive dude thanks.", "time": "10-13-2017 03:49 AM", "replies": [{"postID": "post6017653", "text": "You're welcome! Glad that I could help. I have been impressed with it.Congrats! I'm curious what made you upgrade. You will appreciate 2 noticeable differences off the bat, which I will let you find out.", "time": "10-13-2017 08:15 AM", "replies": []}]}, {"postID": "post6017624", "text": "I hope you don't mind me chiming in? 😀. I currently have the Compact X and have been really pleased with the phone. I've just ordered the Compact Xz1 and can't wait. The reviews seem extremely positive.", "time": "10-13-2017 07:48 AM", "replies": [{"postID": "post6017653", "text": "You're welcome! Glad that I could help. I have been impressed with it.Congrats! I'm curious what made you upgrade. You will appreciate 2 noticeable differences off the bat, which I will let you find out.", "time": "10-13-2017 08:15 AM", "replies": []}]}, {"postID": "post6017688", "text": "The reason for the upgrade are a few factors. Having the snapdragon 835 chip will make a huge difference compared to the 635 in the Compact X. Having the 19mp motion eye camera along with 960fps video ability has me sold. On the audio I understand Sony has made significant improvements.\n3D creator I'm excited about. 4gig of ram could have been more but I'm OK with it.\nCertainly with the new 835 chip battery life should also be improved.", "time": "10-13-2017 08:38 AM", "replies": []}, {"postID": "post6073784", "text": "Thanks for this link. Never knew it existed. Appreciate that.", "time": "11-16-2017 11:06 PM", "replies": []}, {"postID": "post6073790", "text": "The previous message was in response to the phonearena link sent by libra89... Phone comparison.", "time": "11-16-2017 11:14 PM", "replies": []}]}, {"title": "I am thinking of buying the Sony xz1 in black. Can anyone tell me what the grip is like?", "thread": [{"postID": "post6013436", "text": "I would rather not use a case or shell on a phone.", "time": "10-10-2017 08:18 AM", "replies": []}, {"postID": "post6013472", "text": "Yes, I’ve thought of buying the Compact version. I’ve handled it and it’s not slippery, but I personally would need a case because of the sharp corners, which I find uncomfortable.", "time": "10-10-2017 08:53 AM", "replies": []}, {"postID": "post6013652", "text": "Mine is pretty grippy for a solid slab of metal. It is definitely less slippery than an iPhone. As long as your hands are not super dry, you should be good. It IS however super thin and as said, the corners can be a little pokey. But yeah this thing feels sooo premium without a case. I may get a skin though", "time": "10-10-2017 11:21 AM", "replies": [{"postID": "post6066664", "text": "Do the bezels bother you day to day?\nI'm strongly considering it in either Black or Moonlit Blue.", "time": "11-12-2017 04:09 PM", "replies": [{"postID": "post6070193", "text": "just saw the device today at bestbuy and it was pretty slick!", "time": "11-14-2017 10:34 PM", "replies": []}]}]}, {"postID": "post6016317", "text": "I have the Black, it's a matte type finish and i find the grip good. As per the previous comments the corners are quite angular in the hand but i quite like that.", "time": "10-12-2017 07:41 AM", "replies": []}, {"postID": "post6060703", "text": "Have the black compact one, which comes with a matte and plastic backside. Still doesn't look cheap. Can't tell how happy I am Sony came back to the plastic, compared to my Z3 compact, which had a glass back, what was now, after 3 years in use, totally broken. Only the silicone case for the backside put the fon together since one year, lol. I read the bigger XZ1 back is made from Aluminum.", "time": "11-08-2017 06:17 PM", "replies": []}]}, {"title": "XZ1 Compact Phone Case", "thread": [{"postID": "post6043811", "text": "I just wanted to share details on my new Phone Case by Ringke. The case is well made. A really good snug fit and if the case has to be removed, you don't break a finger in doing so. Lol.\nThe cut outs are perfect. The USB has a little cover that assists keeping the dirt and dust out. Impressive. Same goes for the phone jack and be opened and closed as needed.\nThe feel of the cover is nice. Really soft and rubbery yet non slip. The sides are well rounded protecting the phone where the glass meets the side covers.\nLaying the phone glass down is good too. The rounded edges lift the glass off a flat surface by about 2-3mm which is nice for sanitary reasons.\nI have the clear version and it's shows off nicely the phone color.\nIf you have any questions please ask.", "time": "10-29-2017 08:22 AM", "replies": [{"postID": "post6043814", "text": "Great review, thank you for sharing!", "time": "10-29-2017 08:24 AM", "replies": []}]}, {"postID": "post6043822", "text": "You're welcome as always.", "time": "10-29-2017 08:28 AM", "replies": []}, {"postID": "post6068908", "text": "Received mine this morning in Smoke Black.. Best case around in my humble opinion.. Echo all the good points above..", "time": "11-14-2017 07:46 AM", "replies": []}]}, {"title": "Sony Store", "thread": [{"postID": "post6065278", "text": "Has anyone bought a mobile from the Sony Store in the UK 🇬🇧 and what was your experience like?\nI ask because in small print it says that the phone is supplied by Expansys UK Limited and I heard a while ago that they were not very reliable.", "time": "11-11-2017 04:09 PM", "replies": []}]}, {"title": "XZ1 cases", "thread": [{"postID": "post6056205", "text": "Could anyone advise me a case for the XZ1? Thanks.\nMore info:\nI'm happy with the XZ1 but it's not easy to grab and hold, it kind of slides in my hand. So I need a case.\nI don't like cases that unfold. I just want to pick my phone in my pocket and watch the screen without unfolding something. So I need a case for the back and the sides + a protective cover for the screen.\nDS", "time": "11-06-2017 03:14 AM", "replies": []}]}, {"title": "Phone Idle - Battery Drain", "thread": [{"postID": "post6054359", "text": "I consider the battery life of this phone to be good (6 hours screen time) but \"phone idle\" ghost is still there. I've been trying to research about the causes of this but I haven't gotten a very good response. I remember this didn't happen to my Z5C while on Marshmallow but it started happening in Nougat. Why is phone idle consuming so much battery?", "time": "11-04-2017 09:54 PM", "replies": []}, {"postID": "post6054503", "text": "Welcome to Android Central! Phone Idle could be high due to poor cell signal -- how has yours been? If you tap that battery graph, do you get a fullscreen graph that includes the cell signal strength bar as well? If not, install GSam Battery Monitor and look at its cell signal strength graph over the span of an entire battery charge. If it fluctuates widely, or is mostly low, that's probably a big reason.", "time": "11-05-2017 12:47 AM", "replies": [{"postID": "post6054838", "text": "Thanks for your answer. I tried deactivating LTE and using 3G that has a stronger signal but phone idle stays. Some people in other forums say this is because of adaptive brightness and location.", "time": "11-05-2017 08:28 AM", "replies": []}]}, {"postID": "post6055452", "text": "It's hard to tell how consistently strong the cell signal is just by looking at the indicator at one point in time -- that's why I usually recommend looking at the cell signal strength graph after a whole charge.\nLocation could cause some drain if it's set to High Accuracy, with wi-fi and Bluetooth scanning on. I would imagine that the GPS battery use would show up as GPS, though. Wi-fi and Bluetooth scanning might show up as Phone Idle, so it's worth checking to see if those scanning features are off. Different phones can have that option in different locations -- go to your Settings>Location menu and look for the Scanning option -- if it's not on that screen, then tap the Menu button again and see if shows up in that dropdown menu.", "time": "11-05-2017 04:00 PM", "replies": []}]}, {"title": "Finally, my Compact XZ1 updated", "thread": [{"postID": "post6050177", "text": "😀 Yay. October update came through today. Wait.. It's already November lol.", "time": "11-02-2017 10:06 AM", "replies": []}, {"postID": "post6050200", "text": "Interesting. I got the update a couple of days ago. Better late than never though!", "time": "11-02-2017 10:22 AM", "replies": []}, {"postID": "post6050316", "text": "Yeah mine updated this morning as well... International version.", "time": "11-02-2017 11:35 AM", "replies": []}, {"postID": "post6052172", "text": "I got October security patch yesterday.", "time": "11-03-2017 12:21 PM", "replies": []}, {"postID": "post6054319", "text": "I'm on October as well, but I flashed customized CE firmware with US OEM file to get the fingerprint and T-Mobile VoLTE/Wifi calling working together.", "time": "11-04-2017 08:55 PM", "replies": []}, {"postID": "post6054358", "text": "US version too? We're getting the updates so late! Everyone else is on 374 and we're lucky to be updated to 324", "time": "11-04-2017 09:50 PM", "replies": []}]}, {"title": "Mute button on the Compact?", "thread": [{"postID": "post6049672", "text": "In some phones that I have used, the mute button usually sits between the volume up and down buttons, but there isn't on the Compact. Does the camera button double as the mute button?", "time": "11-01-2017 11:12 PM", "replies": [{"postID": "post6050159", "text": "Nope, it doesn't exist unfortunately. For mute, I use Do Not Disturb, as that is the only way aside from the total silence setting.", "time": "11-02-2017 09:45 AM", "replies": []}]}]}, {"title": "Flash Xperia Compact XZ1 G8441 model", "thread": [{"postID": "post6038801", "text": "Hi everyone. I was considering flashing my Compact XZ1 with the customized UK software. Unfortunately, flash tool doesn't give you a choice on the G8441 model even though I have the latest flash tool version.\nIs this because the phone is still relatively new?", "time": "10-25-2017 07:49 PM", "replies": []}, {"postID": "post6038855", "text": "You can't use flashtool, you have to use newflasher.", "time": "10-25-2017 08:25 PM", "replies": [{"postID": "post6038862", "text": "Right I'll look into it thx", "time": "10-25-2017 08:29 PM", "replies": []}, {"postID": "post6038892", "text": "OK I looked into it. Couldn't find anything different than what I have already loaded on my P. C. Thx anyway", "time": "10-25-2017 08:52 PM", "replies": [{"postID": "post6038926", "text": "Check the xz1 compact forum on XDA. There's a thread over there about flashing with newflasher. Flashtool doesn't work with newer Xperias, only Newflasher.", "time": "10-25-2017 09:23 PM", "replies": []}]}]}]}, {"title": "Pero out for xz premium", "thread": [{"postID": "post6033600", "text": "As the title says it all.Here is the linkSony Xperia XZ Premium getting Android 8.0 Oreo from today - Pocket-lint", "time": "10-23-2017 04:18 AM", "replies": []}, {"postID": "post6033932", "text": "What is Pero?", "time": "10-23-2017 09:53 AM", "replies": [{"postID": "post6033990", "text": "I think the OP meant Oreo.", "time": "10-23-2017 10:28 AM", "replies": []}]}, {"postID": "post6033999", "text": "Mod note. Title edited.", "time": "10-23-2017 10:30 AM", "replies": []}, {"postID": "post6034202", "text": "Sorry for the typos.its oreo.\nWas too excited with such fast updates.how is the review so far", "time": "10-23-2017 12:09 PM", "replies": []}]}, {"title": "Google Camera HDR+ apk doesn't work on XZ1 Compact", "thread": [{"postID": "post6012961", "text": "I wanted to test this so I downloaded the newest version first and then the previous one.\nIt installs just fine but it keeps crashing, which makes it useless. Or it could start to load but the app freezes. I'm sharing this so that you can save 3 minutes from trying it for yourself.", "time": "10-09-2017 08:24 PM", "replies": []}, {"postID": "post6012971", "text": "Wipe the cache and check your permissions.", "time": "10-09-2017 08:34 PM", "replies": [{"postID": "post6012976", "text": "Do you mean the cache of the app itself? I did allow all permissions but I'll try it again, thank you.\nEdit: I keep getting that Camera has stopped so I can only close the app. No luck. Ahh.", "time": "10-09-2017 08:36 PM", "replies": []}]}, {"postID": "post6014333", "text": "You want brackets merged on the phone HDR?\nProShot will take your brackets with a range of +/-ev values from 0.3 to 2.0 (at least on Xepria X). Then Vibrance HDR will let you pick the 2 or 3 bracketed shots from your gallery and merge them...", "time": "10-10-2017 07:17 PM", "replies": [{"postID": "post6014938", "text": "Hmm, that's good to know. In my case, I wanted to try it to see if there will be a difference for just point and shoot mode in the pictures because the difference with the Essential is really nice.https://www.xda-developers.com/essen...a-quality-fix/\nI have seen results of this camera with the LG V20 too and that also had some cool results.", "time": "10-11-2017 08:11 AM", "replies": []}]}, {"postID": "post6033589", "text": "Since it has no raw support it can't use the app.\nI hope XDA does something coz I got a feeling that if the Google camera app works it's gonna get some very very very good photos", "time": "10-23-2017 04:01 AM", "replies": []}]}, {"title": "Xperia Compact XZ1 protective phone cover.", "thread": [{"postID": "post6033081", "text": "Hi everyone. I hope you're enjoying your new Compact XZ1 these days? Had mine for one week and I'm so glad that I upgraded from the Compact X. Thought the X is still a good little phone.\nAnyway, I have a new phone cover from Auto Focus and I'm not a fan. Cannot use the fingerprint sensor (mines activated in the 🇺🇸) due to the cover is so thick around the power on button its impossible to take advantage on the sensor.\nSo, any input on covers would be most helpful. I see a few on Amazon that will be available end of this month. Any ideas input would be great.", "time": "10-22-2017 06:32 PM", "replies": []}, {"postID": "post6033091", "text": "I tried some and had to return it. I'm waiting on the Ringke case. They make great ones and from what I see, it doesn't cover the sensor. Currently using a flip case until the Ringke one is available on Friday.", "time": "10-22-2017 06:38 PM", "replies": []}, {"postID": "post6033125", "text": "Good to know thank you! Clear case I assume?", "time": "10-22-2017 06:55 PM", "replies": [{"postID": "post6033173", "text": "Yep (kind of). They have an all clear case and two cases that are still clear but have a colored border. Not sure which one I want to get lol.", "time": "10-22-2017 07:19 PM", "replies": []}]}]}, {"title": "Video comparison of XZ1 Compact vs. X Compact", "thread": [{"postID": "post6033100", "text": "For any of you that were wondering how the two hold up and if the XZ1 Compact is really worth more, check out this video:", "time": "10-22-2017 06:42 PM", "replies": []}]}, {"title": "Fingerprint reader a no go on Tmobile", "thread": [{"postID": "post6009639", "text": "So in years past we were able to either flash firmware to enable the fingerprint reader or buy the international model. With a little research it looks like there is no way to have either without losing VoLTE which is mostly what Tmobile is moving on band 12. Reception without would be terrible. I ordered the US xz1 but without the fingerprint reader, I think it's not worth the price.", "time": "10-07-2017 04:21 PM", "replies": []}, {"postID": "post6009810", "text": "there'll be better options that way I guess.", "time": "10-07-2017 06:33 PM", "replies": []}, {"postID": "post6010019", "text": "Wow that sucks :/", "time": "10-07-2017 09:29 PM", "replies": []}, {"postID": "post6010259", "text": "Glad I seen this post, was going to order the international model for fingerprint scanner for T-Mobile. Without VOLTE it’s not worth getting it. Going to get the USA model. Thanks for info. Vinny ������������rn", "time": "10-08-2017 01:14 AM", "replies": [{"postID": "post6010750", "text": "No problem. It's a bit discouraging. I'm going to try it out and see if I fall in love with it enough to not let it bother me.. Lol", "time": "10-08-2017 10:46 AM", "replies": []}]}, {"postID": "post6024250", "text": "There's like 2 files you'd need to flash from the UK firmware to the US firmware to enable fingerprint and keep VoLTE/wifi calling. Check the XZ1 compact XDA forum or the SonyXperia sub on Reddit for details on how to do it.", "time": "10-17-2017 04:13 PM", "replies": []}]}, {"title": "Link for the pixel launcher", "thread": [{"postID": "post6020381", "text": "Here is a link to download the new pixel launcher. The original did not have Google Now integration but now it does. I have it running on my xz1 and it's smooth as butter. Having Android Oreo and this, not sure why I would need a pixel phone now😁https://android.gadgethacks.com/how-...eeded-0180554/", "time": "10-15-2017 07:47 AM", "replies": []}, {"postID": "post6020427", "text": "How do you find the XZ1? Are the bezels as much of an issue in real life?\nHow's the screen given that it's an LCD? Is the HDR aspect noticeable throughout the UI or only through media?", "time": "10-15-2017 08:39 AM", "replies": [{"postID": "post6020517", "text": "I haven't tried Amazon prime video or Netflix in hdr but if you watch videos, it will be vivid without the need of a 4k display.\nWhat are your concerns with the bezels? To me, the overall size and feel of the phone is what matters, with or without bezels. I was using a compact phone before this so I'm just getting use to a slightly bigger phone. Now though I can say that I'm enjoying the screen size. I think this might be the sweet spot for me. I will say that the build quality and thinness gives you a real feel of quality compared to all the glass phones being pumped out imo. Love the square design as well. Just feels premium or \"executive\" so to speak.\nThe screen has 3 saturation modes. I have it in the middle and the screen is bright and sharp.\nI'll add that the plus with Sony phones is that they are very stockish. No cartoonish look like LG and no lag like Samsung. Negatives would be the Camara in low light. All depends on what you like but I would certainly try the phone out if you're interested. You can always return if it doesn't float your boat. 😁", "time": "10-15-2017 09:56 AM", "replies": [{"postID": "post6020878", "text": "Thanks for the detailed reply!\nI've always loved the look of Xperias, especially the minimalist backs with the camera lens in the top left. Bezels seem a bit too much for 2017 on the XZ1 but the overall package of the hardware, design and silky smooth Sony software, and the price compared with some of the others, definitely appeals to me.\nDo you know how reliable Sony are with releasing security updates, specifically through a carrier?\nI'm debating between this and the new Pixel XL.", "time": "10-15-2017 02:42 PM", "replies": []}]}]}, {"postID": "post6021270", "text": "My last security update is from August so that is a little concerning but I'm expecting another any day which would be ok. I can definitely let you know. I hear ya about the bezels.. It just doesn't bother my any. I feel like I'm holding a professional type phone with this solid aluminum build and like you said, the smaller Camara set up. I'd say if Camara quality is important, go pixel. If you think about it, the pixel XL still has slightly bigger bezels than lg and Samsung and everything is not 18by9 ready anyway so you'll still have black bars on many apps and videos.", "time": "10-15-2017 08:27 PM", "replies": [{"postID": "post6021400", "text": "Remember that the XZ1 just came out so I think this isn't too bad. I mean the security patch, that is.\nInteresting that you mention the Pixel. I'm torn on that.", "time": "10-15-2017 10:15 PM", "replies": [{"postID": "post6021753", "text": "I thought you were all content with he xz1C? 😂. I hear ya though.. I still have my order out on a pixel 2 but the more I use this phone, the more I like it, especially set up exactly like the pixel. Again, Camaras are supposed to be steller. I think Im going to hang with the Sony and enjoy some reviews on THE Pixel. I can always pick one up later. Sounds funny but I'm actually liking the square design and feel most of all. I believe performance will be negligible between the 2.", "time": "10-16-2017 06:31 AM", "replies": [{"postID": "post6021792", "text": "I agree about performance.\nI am mostly content but I had the original Pixel before I got it and aside from the obvious size difference, the camera in low light has a noticeable difference between the two. I am debating if the difference is something I can live with. Sony has gotten much better with software processing though so it's not as bad as it was on last year's model.", "time": "10-16-2017 07:32 AM", "replies": []}]}]}]}]}, {"title": "Pocketnow Sony XZ1 Compact video review", "thread": [{"postID": "post6015799", "text": "So far, I have to say that I agree with him. There have been a few reviews about this phone but here's one from a US viewpoint.", "time": "10-11-2017 07:23 PM", "replies": []}]}]
