[{"title": "Notification sound being cut short.", "thread": [{"postID": "post6169943", "text": "Strange problem with my Nokia 8 (8.1) and the missus's Nokia 5 (8.0).\nIf I get a message through Whatsapp containing an image the notification sound gets cut short ie. it only plays the first 3/4 of a second of the sound.\nNow If I get another message without an image the sounds plays complete.\nIt makes no difference if its a custom or a system notification sound.\nNot sure if this is a problem with the phones or the OS or Whatsapp.\nAny one heard of this", "time": "02-23-2018 03:26 AM", "replies": []}, {"postID": "post6179350", "text": "I had this issue on my Nexus 5X but I noticed it would occur more often if I received two notifications in quick succession.", "time": "03-05-2018 04:09 AM", "replies": []}, {"postID": "post6189011", "text": "Normal messages just containing text, work fine.\nJust when I receive a picture, the notification tone gets cut to a fraction of the length of what it should be.\nI've been in contact with whatsApp, with messages going back and forth, I ended up videoing the problem for them.\nThey finally admitted there was a problem and will likely fix it in an upcoming release.", "time": "03-13-2018 09:55 AM", "replies": []}]}, {"title": "Sirocco to the US?", "thread": [{"postID": "post6172941", "text": "Hi everyone,\nDid anyone see if they were planning on launching into the US?", "time": "02-26-2018 02:37 PM", "replies": []}, {"postID": "post6173979", "text": "No word yet, but with 128GB internal and an SDXC slot it would be a contender. The fact that it comes from \"If we touch it, it's probably designed wrong\" (otherwise known as Microsoft) may not keep people from buying it.", "time": "02-27-2018 12:51 PM", "replies": [{"postID": "post6188584", "text": "You do know that HMD Global are NOT Microsoft, don't you?", "time": "03-12-2018 11:51 PM", "replies": []}, {"postID": "post6188586", "text": "Uh, HMD Global is made up of the former Nokia employees who left after Microsoft took over the old Nokia.", "time": "03-12-2018 11:53 PM", "replies": [{"postID": "post6188713", "text": "Exactly, not sure why people have an issue with that", "time": "03-13-2018 04:12 AM", "replies": [{"postID": "post6188714", "text": "Nothing. I wasn't even replying to you. As you can see I quoted Rukbat.", "time": "03-13-2018 04:13 AM", "replies": [{"postID": "post6188717", "text": "I realised that after replying 😞😉", "time": "03-13-2018 04:14 AM", "replies": []}]}]}]}]}, {"postID": "post6175332", "text": "So far only the Nokia 6 (2018) is confirmed to come to the US next.", "time": "02-28-2018 07:53 PM", "replies": []}, {"postID": "post6188390", "text": "Original Nokia DS (that ruled the mobile world with their Symbian and Maemo/Meego devices) and the current (that kicked Balmer/Flop out of the company) has nothing to do with Micro****, and never will. 😎", "time": "03-12-2018 07:53 PM", "replies": [{"postID": "post6188585", "text": "Not sure what you are trying to say with this post!!!", "time": "03-12-2018 11:52 PM", "replies": []}]}]}, {"title": "How to make Nokia 8 vibrate on calls getting connected?", "thread": [{"postID": "post6187175", "text": "Previously i had a HTC phone where there was a very useful feature in vibrating when a call gets connected.\nWhich helps to dial & keep in your hand till it gets connected, no need to keep the phone in your ear & listen to the other phone ringing?\nIs that option available in Nokia 8?", "time": "03-12-2018 04:18 AM", "replies": []}, {"postID": "post6188139", "text": "I haven't come across it on my Nokia 8, are you sure it was an Android feature and not an HTC addition?", "time": "03-12-2018 04:30 PM", "replies": []}, {"postID": "post6188142", "text": "Definitely an HTC addition.\nInstall this app from the PlayStore it works perfectly.https://play.google.com/store/apps/d...ft.com.vibcall", "time": "03-12-2018 04:32 PM", "replies": []}, {"postID": "post6188579", "text": "Thank you this worked perfectly!", "time": "03-12-2018 11:43 PM", "replies": [{"postID": "post6188648", "text": "Glad it helped", "time": "03-13-2018 01:30 AM", "replies": []}]}]}, {"title": "Nokia 8 Sirocco availability in Europe?", "thread": [{"postID": "post6188397", "text": "When will the Nokia 8 Sirocco be ready for launch and sales in Europe?", "time": "03-12-2018 07:58 PM", "replies": []}]}, {"title": "Nokia 8 Sirocco, 7 Plus, and 6 join Android Enterprise Recommended", "thread": [{"postID": "post6181630", "text": "Does this mean the Nokia 8 Sirocco will be available in the US?\nhttps://www.androidcentral.com/nokia-8-sirocco-7-plus-and-6-join-android-enterprise-recommended", "time": "03-06-2018 11:16 PM", "replies": []}, {"postID": "post6188374", "text": "Is Nokia 8 Sirocco available in Europe, when will it be?", "time": "03-12-2018 07:41 PM", "replies": []}]}, {"title": "Has anyone bought the Nokia 8?", "thread": [{"postID": "post5988162", "text": "Just wondering if anyone is using the Nokia 8? And if so what they think...\nReviews are starting to come in and I'm intrigued!", "time": "09-22-2017 12:42 PM", "replies": []}, {"postID": "post5988176", "text": "£499 in the UK and comes with a free Nokia steel watch...", "time": "09-22-2017 12:49 PM", "replies": []}, {"postID": "post5988302", "text": "I'd be curious to know that as well! It looks like a really nice and solid device.", "time": "09-22-2017 02:19 PM", "replies": []}, {"postID": "post5988439", "text": "Certainly looks nippy, but that's what you get from almost stock android.\nCameras have the potential to be good. Seems like there might be a slight autofocus issue but I'm sure that could be sorted in an update.", "time": "09-22-2017 04:48 PM", "replies": []}, {"postID": "post5988706", "text": "I'd like to hear some user impressions as well. I just cam across a video/audio sample from GSM Arena. Pretty darned good audio quality, given that they were recording what was likely a crazy loud concert. Put on some good headphones and listen to this:\n \nNot too bad!", "time": "09-22-2017 08:58 PM", "replies": [{"postID": "post5988720", "text": "I expect nothing less. So far no one else has ever beaten Nokia in terms of camera quality anyway. The 808 is still the best camera phone that ever existed.", "time": "09-22-2017 09:10 PM", "replies": []}]}, {"postID": "post5991951", "text": "I bought one a week or so back. Previously have owned the Lumia 950 (and before that the 1020) which has a very good camera. I don't think the Nokia 8 is as good - although I haven't done any head-to-head comparisons - but it is not bad at all. Of course, phone cameras generally are better than ever before. When I had a Samsung S3 it was very noticeably poorer that the Lumia 1020 I got after it. Today, I think you really have to pixel-peep to decide between the manufacturers cameras - especially at \"flagship\" level. \nGlad to hear the audio recording is good. I don't do it very often but a year or so back I recorded a bit of a gig on my 950 and a friend did on his iPhone (a 6 I think) and on playback you could hardly make anything out on his whereas the Lumia's footage was pretty clear.", "time": "09-25-2017 10:16 AM", "replies": [{"postID": "post5993052", "text": "This sounds interesting, do you mind giving a short impression of the device/camera compared to a L950? (I am planning on buying one and there are so many different results, some say they are great and on par with the G6/Huawei P10, some don't even put it in the OnePlus5 category. \nSince the L950 trumps them all, do you see a huge difference? I currently own a L950 and a G4, and both of them are spectacular for images, so I am curious if I'll be losing something if I switch to the Nokia 8.", "time": "09-26-2017 03:09 AM", "replies": [{"postID": "post6072660", "text": "I own L1020 , L950 and the N8 , to be honest the original stock camera is awful compared to other 2 lumias but when you use it with google pixel camera apk (there are many versions the one I use is MGCB_7,0H C2API MIN v1.4.apk and it is way better than the other google cam apk's .) And now I am verry happy with the camera , it takes head to head pictures with the Lumia 950 and sometimes better . \nThe phone is solid very fast and fluid you wont be disappointed.", "time": "11-16-2017 09:17 AM", "replies": []}]}]}, {"postID": "post5993215", "text": "I was going to go for this but I'm holding out for 9 which should hopefully be coming around the corner very soon!", "time": "09-26-2017 07:00 AM", "replies": []}, {"postID": "post5994167", "text": "Wait for the 9. This one is pointless.", "time": "09-26-2017 05:50 PM", "replies": [{"postID": "post5996149", "text": "Nonsense. If you need a new phone now then buy what's available now.", "time": "09-28-2017 05:39 AM", "replies": []}, {"postID": "post6059321", "text": "Two weeks in with mine and what a gem. Battery life is really good and the screen is nice. Coming from a Lumia 950 I think they could have done better with the camera but the quality of pictures is not bad for the average user. I like the finish, looks good though I worry about how slippery this back cover is but I am one happy customer", "time": "11-07-2017 10:27 PM", "replies": [{"postID": "post6061139", "text": "I'm exactly two weeks in with mine too. So far so good. Excellent battery with mine and my brothers. Camera is pretty good, I also had a Lumia 950 and I'd say the Lumia's still pictures were a bit better, but the video is better on the Nokia 8 thanks to OZO audio. \nIndeed it is a slippery phone. I just got a clear silicone case in the mail today and it makes a huge difference with grip.", "time": "11-09-2017 12:46 AM", "replies": []}]}]}, {"postID": "post5997047", "text": "For those that may have this phone and I know it's going to vary depending on the carrier but how is the call quality and signal strength on this phone?", "time": "09-28-2017 06:17 PM", "replies": [{"postID": "post5997409", "text": "It's very good, an improvement on the LG G6 on the same network. Calls come through loud and clear.", "time": "09-29-2017 02:23 AM", "replies": []}, {"postID": "post5999449", "text": "You are right, that depends big time on carrier, location to tower, etc. For us though the call quality and signal strenght is great, but then it is great on our Huawei P9 plus and Sony Xperia Z5 :-)", "time": "09-30-2017 11:28 PM", "replies": []}, {"postID": "post6010403", "text": "Great on EE in UK", "time": "10-08-2017 06:11 AM", "replies": []}]}, {"postID": "post5997420", "text": "For those that may have this phone and I know it's going to vary depending on the carrier but how is the call quality and signal strength on this phone?\nAbsolutely no problems. Not that I expected there to be.", "time": "09-29-2017 03:20 AM", "replies": []}, {"postID": "post5997524", "text": "Thank you! This will pretty much seal the deal for me on the upcoming Nokia 9 then", "time": "09-29-2017 07:04 AM", "replies": []}, {"postID": "post5999445", "text": "Recently bought one for my partner and she loves it. I'm getting the Nokia 9 if the camera is a big improvement. Having said that, I have a Huawei P9 plus which is not a complete slouch in the camera quality department. \nGrabbed a really cool sunset with both phones. Choose the photo you like. Straight out of phone, no processing.\nPersonally, I can't see the benefit of the bothie capability, but I'm sure avid social media users will tease out the benefits if there are any. Maybe it will take Apple to have the feature before it becomes \"magical\" lol. \nStock Android is great if you value prompt updates and getting Android O (and probably P) before most other manufacturers. Stock Android is great to me. I've always installed Nova Launcher on my other phones (to include my Huawei) and we did that on the Nokia 8. It does everything else I want/need without any additional overhead so for me Stock Android is a preference.\nThe Nokia 8 feels good in the hand. Actually a little small after being used to the big/heavy P9 plus. \nBattery capacity was a talking point, but my partner easily gets a day of use with extensive browsing, Youtube, playing games. LINE (sometimes Video call), so any concerns over battery capacity, for us anyway, is a non-issue.\nThere is also some talk about the very limited manual mode for the camera. You can load open camera (which I also loaded to experiment with) but I don't see any big differences in what I can get with the auto settings. Having said that, open camera points to one shortfall in the sensor over what is in the Huawei which can be set to stay open for 30 seconds. It can't be slowed down any more than 0.7\" so if you absolutely need to shutter to stay open longer than that, this phone is not for you. I haven't really noticed a big issue with auto-focus but then it is not all that great on the Huawei either. Can't say we have been frustrated by any auto-focus issues.\nScreen on the Nokia is really nice and IMO is better than the Huawei screen. Richer colors and whiter whites. In fact when you compare the two side by side, you can see how much yellow is in the Huawei screen. Some of that can be adjusted out, but it never looks as good as the Nokia screen. Speaking of the screen, the Nokia is much brighter and easier to read in full daylight than the Huawei P9 plus. \nPrice was fair. We picked it up in Thailand for 19,500 baht which in my native USD conversion is around 585 USD plus we got a bunch of goodies with the deal to include a battery bank. Fairly priced and cheaper than my Huawei P9 plus when I bought it. \nSo anyway, so far, we are very happy with the purchase. Completely met our expectations.", "time": "09-30-2017 11:24 PM", "replies": []}, {"postID": "post5999446", "text": "Oh, one other nugget for the real geeks out there: HMD to unlock bootloader on #Nokia Android phones | Nokiamob", "time": "09-30-2017 11:25 PM", "replies": []}, {"postID": "post5999845", "text": "Thanks for this quick turnaround, I am still deciding what to buy the Nokia 8 or the Huawei P10 plus. Since the P9 and P10 are quite similar, would you mind uploading the full res shots of those 2 phones? I'd be curious to check them out, thanks.", "time": "10-01-2017 10:15 AM", "replies": [{"postID": "post6000658", "text": "Not a big pixel peeper myself. If it looks good enough to be a screen background on a computer, I'm happy. The picture that looks properly exposed with more color was loaded full size (don't know if AC does any compression when loading). That is from the Nokia 8. It looks closest to the conditions at the time. Like any camera and especially with a small sensor, it is just not equipped to pic up all the colors. That sky was truly stunning with a lot more subtle colors with aqua greens out in the bluer sections. The darker photo (I reloaded here full size) was from the Huawei. For some reason, it finds that particular lighting situation very challenging. I tried a couple different shots all with similar results. \nI played around in full daylight one afternoon and I'd say the two phones are fairly close, but I'd still give the edge to the Nokia 8 on color reproduction. It was just closer to what my eye was seeing. Maybe I'll post some more comparison photos in another thread.", "time": "10-01-2017 09:54 PM", "replies": []}]}, {"postID": "post6000105", "text": "Thank you for a great review of the Nokia 8. It's a toss up between pixel and Nokia 9. Will more then likely wait it out for the Nokia. So far everything I have read about it states that the camera will be improved along with some other things", "time": "10-01-2017 01:09 PM", "replies": [{"postID": "post6000694", "text": "Looking forward to seeing what the Nokia 9 camera is like. To be honest, my expectations are pretty low for anything ground-breaking. If photos are up to Apple/Samsung flagship levels, that will be a good thing. I expect the Zeiss partnership to pay off in 2018.", "time": "10-01-2017 10:27 PM", "replies": []}]}, {"postID": "post6000109", "text": "Own last year's pixel now and being that it took 4 replacement phones to make it acceptable not sure I want to go that route again", "time": "10-01-2017 01:10 PM", "replies": []}, {"postID": "post6000871", "text": "Really great review of the Nokia 8. Already have a Nokia 6 which I really like but I think I might go for the Nokia 9 when it comes out.\nRegards\nInfinidim", "time": "10-02-2017 05:17 AM", "replies": [{"postID": "post6000917", "text": "Thank you  Ya, if you have the 6 and are happy with it, no reason to change. Looking forward to the 9 as well, but like I said, setting my expectations kind of low. I won't be disappointed but I also may not find a compelling reason to upgrade from my Huawei.", "time": "10-02-2017 06:44 AM", "replies": []}]}, {"postID": "post6000925", "text": "I have faith in Nokia as far as getting everything right with the Nokia 9. I'm sure they more then realize what they are up against and getting it right or near perfection is very crucial to them. Will see how it all plays out. My only hope is that's it's released by the end of the year. This far everything if read is making this out to be an amazing device so I'll play the waiting game and see how the Pixel reviews are since it may be my second choice. I am pulling for Nokia though", "time": "10-02-2017 07:01 AM", "replies": []}, {"postID": "post6010410", "text": "I was due an upgrade. I previously had a Nexus 5X and loved it. But had massive problems with boot looping.\nWent for this one because I needed a new phone now and am not disappointed. It's quick and snappy with multitasking. Has the same Snap Dragon chipset as the Pixel 2 and other flagships with 4mb ram.\nIt's super thin. Super light and I have no complaints about the camera... But someone will have to tell me why I would want to take a 'bothie' lol!\nLoving the as close to stock Android as you can get (already have the September security update) which is what I was worried about when swapping from my 5X. \nThe sounds great, it supports USB C charging and you can put a SD card in if you want to. Although it also has 64GB of internal memory.\nIn summary I'm very happy and would not put anyone off of getting this phone. 👍👌", "time": "10-08-2017 06:18 AM", "replies": []}, {"postID": "post6010524", "text": "That's awesome! Great review on what sounds to be an awesome phone. Going to wait it out for the 9 since I am on Verizon in the US and from what I've heard Nokia has been working with Verizon to enable the phone to work on their Network. This is the only phone that is coming out that has my interest so far. Owned many Nokia's back in the day and was always a fan of their hardware and call quality", "time": "10-08-2017 08:13 AM", "replies": []}, {"postID": "post6038193", "text": "I just received the Nokia 8 in polished copper and WOW!! This is easily the sexiest phone I've bought in recent memory. Bezels or not. \nI've only had the phone for a couple of hours so can't give a full review, but the screen is nice and very sharp and gets VERY bright if you need. Call quality is excellent and no issues with signal here in Canada on Rogers network. \nBonus for anybody that was a die hard Nokia fan back in their glory days: The Nokia ringtones and message tones are present on the Nokia 8! Also glance screen and double tap to wake. All things Nokia pioneered. \nI got the global unlocked dual-sim model TA-1004.", "time": "10-25-2017 01:59 PM", "replies": []}, {"postID": "post6038432", "text": "Would love a review KrisYYC \nI’ve been tempted but the relatively high price of it over here’s in the UK £499 is putting me off (FYI OnePlus 5 is £449)", "time": "10-25-2017 04:00 PM", "replies": []}, {"postID": "post6038433", "text": "Would love a review KrisYYC \nI’ve been tempted but the relatively high price of it over here’s in the UK £499 is putting me off (FYI OnePlus 5 is £449)", "time": "10-25-2017 04:00 PM", "replies": [{"postID": "post6038475", "text": "I'll try to do a write up after I've spent more time with the phone. But so far so good! \nAre you looking to buy outright? Maybe it's cheaper if you get the global unlocked variant from a reseller online. I got mine from neverMSRP on ebay for $670 CAD which is £395 at current exchange.", "time": "10-25-2017 04:21 PM", "replies": []}]}, {"postID": "post6061196", "text": "Another ex-950 user here, had the Nokia 8 about a month. Agree with the comments here. Battery good, OS super smooth (am trying the Oreo Beta at the moment), camera good but not as good as the 950. Did a few side-by-side shots to \"prove\" it. Not done much video yet. \nSomeone said this might be a \"sleeper\" hit. I think so. At the weekend, a friend looking to replace her Samsung Galaxy from the 'A' range but not inspired by the latest A phones and not wanting to pay top-whack for the S range was taken with my Nokia 8 and my wife's Nokia 6 and will probably pick one of these two.", "time": "11-09-2017 03:26 AM", "replies": []}, {"postID": "post6086253", "text": "MGCB_7,0H C2API MIN v1.4.apk \nDo you have a link for this ?", "time": "11-27-2017 05:27 AM", "replies": []}, {"postID": "post6087851", "text": "It is a beautiful device and I'd be really interested in getting it; but unfortunately the price point is too high for me. It retails for about $750 on Amazon in Canada.", "time": "11-28-2017 09:53 AM", "replies": []}, {"postID": "post6088245", "text": "Wow \nCan't imagine how much the 9 is going to sell for in the states. Very thankful I've been extra good this year! Maybe if it's out by Christmas jolly old saint Nick will remember me", "time": "11-28-2017 02:41 PM", "replies": [{"postID": "post6088588", "text": "Nice Christmas present if it works out that way 😎", "time": "11-28-2017 06:12 PM", "replies": []}, {"postID": "post6088664", "text": "Morty's price is in Canadian dollars which is about $585 USD. \nI got mine for around $520-$530 USD on eBay.", "time": "11-28-2017 06:52 PM", "replies": [{"postID": "post6088747", "text": "That's a good bargain!!! What colour did you get?", "time": "11-28-2017 07:52 PM", "replies": [{"postID": "post6088814", "text": "Indeed! I got the polished copper one", "time": "11-28-2017 08:45 PM", "replies": [{"postID": "post6088837", "text": "That's a beautiful colour!", "time": "11-28-2017 09:03 PM", "replies": []}]}]}]}]}, {"postID": "post6113837", "text": "From where is everyone buying their Nokia 8's? I see that Amazon is selling them.", "time": "12-21-2017 07:37 AM", "replies": []}, {"postID": "post6116672", "text": "I've just bought mine from carphone warehouse. £399", "time": "12-24-2017 03:43 AM", "replies": []}, {"postID": "post6116932", "text": "So far I'm finding the internet to be slow on it. Webpages and apps load quite slowly a lot of the time.\nAnyone have any tips?", "time": "12-24-2017 11:57 AM", "replies": []}, {"postID": "post6118097", "text": "I have been using the nokia 8 for over a month now and i am really happy with the phone. it does all what i need it to do and quiet frankly, i am surprised of a phone of this kind with the price tag. I have a pixel 2 and nokia 8 and i always laugh at myself for having two phones doing the exactly same things with exactly same speed with price tags of one being half the other. \npicture quality is a bit lower than pixel 2 but i cant complain at all when put in competition with the big boys with price ranges double of what i have\ncharging time is very fast and charge stays longer than pixel 2 with similar kind of use. \ni love the screen color and size \nphone feel in hand is of a super class phone while it is almost like a head turner and everyone asks which phone i am using. \nall in all, i am happy with my nokia 8", "time": "12-26-2017 03:58 AM", "replies": []}, {"postID": "post6121214", "text": "I returned it for a Pixel 2. WiFi issues and the camera underwhelmed me.\nStill a beautiful phone though.", "time": "12-29-2017 08:06 AM", "replies": []}, {"postID": "post6124433", "text": "Love the Nokia 8. Camera could be better, but it's buttery smooth and responsive. I have the polished copper version and in my opinion it's the nicest looking phone on the market at present.", "time": "01-01-2018 10:56 PM", "replies": [{"postID": "post6130218", "text": "The Copper version is stunning.", "time": "01-08-2018 09:09 AM", "replies": []}]}, {"postID": "post6135535", "text": "Yes, but it's not that good I'm afraid. There's lag and unresponsive parts of the screen. \nIf it's been left on idle for a while, it's a bit of a nightmare, really slow and laggy with notifications.", "time": "01-13-2018 05:49 PM", "replies": [{"postID": "post6135694", "text": "Hmm, I have not experienced this. Has your phone been themed at all? Using Substratum for example.", "time": "01-13-2018 10:45 PM", "replies": [{"postID": "post6140434", "text": "No, apart from a launcher, that's it. Experiencing another problem now, for example I received the notification for your question,I clicked and it wouldn't lauch the forums, just a blank screen. Except for the battery,I think it's terrible.", "time": "01-19-2018 11:14 AM", "replies": [{"postID": "post6140703", "text": "Sounds like there may be something wrong with your unit. It's been a very stable, reliable experience for me. I know it's a hassle, but have you tried a hard reset? I'd strongly suggest trying that, at least you'll know whether or not the problems are hardware related.", "time": "01-19-2018 04:51 PM", "replies": []}]}]}]}, {"postID": "post6153046", "text": "I've just bought my Nokia 8 after a few years on an Oppo R7sf and a failed attempt at a mate 10. I love the size and feel of it. Just waiting on my case and screen protector. \nI'm really impressed after a week of use. Battery is great, Android Auto has been seemless with fantastic call quality both ways. \nI would like to root it so that I can I can change the default CPU Govenor as once I have Maps and say Spotify running, AA becomes a little sluggish, but that's the same on every phone Ive seen running AA.", "time": "02-03-2018 12:35 AM", "replies": []}, {"postID": "post6161508", "text": "You guys that is long time user of the Nokia 8. \nIs it still a keeper or not. \nHave an old nexus 5x and wounding to switch to Nokia 8. \nHere were I live it finally getting cheap. \nFrank", "time": "02-13-2018 06:19 AM", "replies": [{"postID": "post6161756", "text": "I have been using Nokia 8 since its launch date. Super happy with this phone. It is an all-rounder. Ticks all the boxes. Hardware. Software. Performance. Updates. Go for it, it is worth its value.", "time": "02-13-2018 12:13 PM", "replies": []}, {"postID": "post6162906", "text": "It's extremely snappy, very well made, and the most beautiful phone on the market IMO (in polished copper). The camera could definitely be better when compared to say a Pixel or Note8, but the bokeh effect is very nice on this phone and the \"bothie\" feature is unique. That's probably my only \"complaint.\" \nThis is a phone that will continue to age very well. It has all the basics (fast SoC, expandable storage, crisp display, passable camera, reliable software with fast updates, top-notch build quality), feels awesome in the hand (thin, light, and elegant), and aesthetics that will turn heads.", "time": "02-14-2018 10:54 PM", "replies": []}]}, {"postID": "post6175318", "text": "Does the Nokia 8 have any color tuner or display adjustments like moving to FHD/1080p or Night mode? I am big on displays, and would like to know more about how much control Nokia allows in the UI over the display. Thanks.", "time": "02-28-2018 07:42 PM", "replies": []}, {"postID": "post6175766", "text": "I've just bought one today, the 64GB version, and I'm waiting for it to be delivered as my Nexus 5X passed away on Wednesday", "time": "03-01-2018 10:16 AM", "replies": []}, {"postID": "post6177344", "text": "Received it today. Some initial impressions.\nGreat little phone. Seems T-Mobile US still gets wifi-calling for it despite it being an international model (TA-1052). It's also lacking some of the LTE bands of course. I've yet to fully test the telephony capabilities though. Out and about 4g calls do OK... The speaker is plenty loud, like really loud. Loud as in I hear my notifications across the whole house loud.\nThe screen is really bright. Which is good for me out in the AZ sun. The 700 nits is easily obtained. The colors on it seem a bit saturated but not too much. Having no display calibration or even a sound equalizer is a slight set back for me. It has night mode though . Scrolling is buttery smooth with probably zero stutter or lag.\nBuild quality is superb. Excellent design and as far as asthetics go one handed use works well and easily for me. I am normally a Lumia 950 XL user and that phone for me is fairly easy to use with one hand. The Nokia 8 is slimmer and about the same height/length which makes it even easier to use and handle. Two total different UIs though, so I really should be comparing it to another Android device in that regard...\nThe typical Nokia DTtW and Glance screen work as they should and are perfect features for it. Basic Android (or pure Android with no added software overlay or skin) works fast and fluidly on it. It updated to 8.1 as I set it up...I've yet to go even a full day on the device and so far the battery seems as good as expected.\nThe finger print reader is a bit disappointing though. It seems to inaccurately read my finger sometimes causing me to have to slowly place my print on it or tap the reader a second time in a different position.\nOverall no real complaints though.\nI will add more here to this post if something comes up that I feel others might need to know, good or bad.", "time": "03-02-2018 07:15 PM", "replies": [{"postID": "post6177569", "text": "Excellent. I'm glad you like it. \nI'm curious about the quality of the camera. I'd be interested in hearing how the camera performs in various conditions, especially in low light.", "time": "03-03-2018 02:51 AM", "replies": [{"postID": "post6177705", "text": "Hi Laura!\nSo far it's not shabby, but it is no 950 XL. I have not done any low light shots yet. I was looking for a thread specifically on the camera/review of its photos but had not seen one here yet. I can add more detail on the camera(s) from my perspective as soon as I have time to use it more. I am not camera power user of course, but will give my 2 cents .\nFor starters. I did have autofocus issues while shooting video, but only after zooming. Or if a bit too much light came into focus. Not a huge deal but it forced me to adjust my physical position a bit. Or to try to manually focus the scene. I shared that in another thread since it seems to be a known quirk. The Nokia 8 does a fairly good job taking pics, although being a regular 950 XL user I would prefer the Lumia over this currently. Comparisons on other sites have shown that it is not what most would expect. However we might give it time. Nokia/HMD will hopefully refine what is already there, and as they fine tune the camera app to work on this device, or push their FW at some point (I hope) then I bet we see camera improvements at the least. It is their first dual camera model, right? Even though Nokia is building new devices on the Android platform it takes RnD like anything else. So I say as far as the cameras go, they are OK or good depending on your perspective, but we may need to give them time to see if they make it better. I'll give myself time too and see what I really think. Maybe their next step is releasing the Nokia ProCam App? I am sure they have a plan of attack or road map for the camera dept. all together. Will have to wait and see...", "time": "03-03-2018 08:14 AM", "replies": [{"postID": "post6177939", "text": "I have to agree with you as I also use a 950XL.", "time": "03-03-2018 12:13 PM", "replies": []}, {"postID": "post6178204", "text": "Thanks, Nate W. I'm curious if further updates will improve the camera.", "time": "03-03-2018 06:00 PM", "replies": [{"postID": "post6183732", "text": "I would hope so. It is in Nokia/HMDs court now to do so as needed. The camera is not that bad but again I am not a very good critic on this subject. The two main things are focus and low light. I think they will try to improve them.", "time": "03-08-2018 11:16 PM", "replies": []}]}]}]}]}, {"postID": "post6184031", "text": "I managed to get the official Nokia 8 flip case which is very hard to get hold of here in the UK 😊", "time": "03-09-2018 07:41 AM", "replies": [{"postID": "post6184404", "text": "Link. Got The Nokia 8 and now am looking for a flip cover", "time": "03-09-2018 02:06 PM", "replies": [{"postID": "post6184697", "text": "I got it from Amazon as no retailers seem to have it, not even the Nokia website lists it for sale.\nThis is the black one but I have one in blue:https://www.amazon.co.uk/Nokia-Leath...cUvbUpU6184697", "time": "03-09-2018 07:06 PM", "replies": [{"postID": "post6184820", "text": "Maybe I will order that cover. Did actually ordered an other cover yesterday, a slim one, but yours is just what I’m looking for.\nFrank", "time": "03-09-2018 10:16 PM", "replies": [{"postID": "post6186226", "text": "I ordered the Nokia cover. The one a ordered was no good. \nSo I hope Nokia’s own cover is better.\nFrank", "time": "03-11-2018 09:34 AM", "replies": []}]}]}]}]}]}, {"title": "Share your Nokia 8 home screen set up!", "thread": [{"postID": "post6135018", "text": "Windows Phone convert, I use Microsoft Launcher, still haven't decided on how to setup pages and folders", "time": "01-13-2018 02:22 AM", "replies": []}, {"postID": "post6135692", "text": "The home screen for my polished copper Nokia 8", "time": "01-13-2018 10:42 PM", "replies": []}, {"postID": "post6138642", "text": "I'm going for the Pixel look currently.", "time": "01-17-2018 11:34 AM", "replies": [{"postID": "post6148538", "text": "Bad panda from Walli", "time": "01-29-2018 06:36 AM", "replies": []}]}, {"postID": "post6148599", "text": "Great homescreens, guys! Keep 'em coming!", "time": "01-29-2018 08:24 AM", "replies": []}, {"postID": "post6179326", "text": "Another Pixel Launcher user here 😁", "time": "03-05-2018 02:41 AM", "replies": [{"postID": "post6185904", "text": "Cool beans!", "time": "03-10-2018 10:46 PM", "replies": []}]}]}, {"title": "Anything to avoid in the Nokia 8?", "thread": [{"postID": "post6176363", "text": "Ok where I live we dont get cheap phones.\nie a Samsung 8plus is $1200.\nThe Nokia 8 is $625\nI REALLY like its style. It and the Sony XZ and Le Eco Le 2 in Silver, they all have that professional look i like. And I really hate 18:8, probably more so if I had OLED as you will get bright bars eventually.\nMy other option is an LG V20 for $540, it probably has the best hard ware of the lot, but this boot loop law suit is putting me off. \nIs the screen on the Nokia 8 ok? for an LCD? I like its very stock android.", "time": "03-01-2018 11:11 PM", "replies": [{"postID": "post6176927", "text": "I received mine today and I have to say that apart from an issue where the phone updated to Oreo and then after the reboot it kept looking for the update and telling me it was up to date in a loop I haven't had any other issues. I've installed most of the apps I had on my old device and I think the hardware is impressive and very quick. The display is pretty good as well, if you didn't know it was an IPS LCD then you would swear it's AMOLED.\nThat's just my opinion and I haven't had a lot of time with it yet so I'll have to wait and see if I still feel the same way after a month or so.", "time": "03-02-2018 12:16 PM", "replies": [{"postID": "post6176954", "text": "It sounds like the best LCD on a phone, everyone says this. i saw it in a line up in pitch black and at first i didnt know which phone was which, 5 oleds 2 lcds, one meizu lcd i could guess, the s8+ was next to the nokia and the nokia 8 looked better. still there are many questioning 700 nits as fantasy from sony. id like to see it proven. im sure if it is for real it must be under direct sunlight in auto. \nthe only thing having me second guessing is the camera which is sub par and the sirocco coming out soon looks soooooo Svelte. But it will cost more.", "time": "03-02-2018 12:36 PM", "replies": [{"postID": "post6176969", "text": "The display is probably using a variant of the clearblack technology used on Windows Phones which basically gives the screen a much better contrast ratio.\nThe camera being sub par is more due to the camera software, the pro camera of the sirocco is coming to all Nokia devices with Zeiss optics anyway. The Sirocco is more of a spec bump, slightly higher resolution camera, 2GB more RAM and different outer shell but the CPU and display, even though it's bigger at 5.5\", are exactly the same as the Nokia 8.\nThe best thing I like about my Nokia 8 is all the little Windows Phone/10 Mobile touches that have been brought across, not surprising given that HMD Global has ex-Microsoft staff working for them.", "time": "03-02-2018 12:42 PM", "replies": []}]}, {"postID": "post6177545", "text": "I had that same thing happen...", "time": "03-03-2018 01:21 AM", "replies": []}]}, {"postID": "post6177489", "text": "The camera might be debatable but the Nokia 8 actually has better specs as it's a 2017 flagship,https://www.phonearena.com/phones/co...es/10486,10202", "time": "03-02-2018 11:15 PM", "replies": []}]}, {"postID": "post6177493", "text": "I still use a Windows Phone and am looking forward to Continuum phones. I think a dual display could well replace a notebook for a lot of people. So instead of aiming at the OS to meet 3 devices its more looking to reduce the amount of devices required. You see it works with dex etc. But you really need better hardware for it to replace a desktop. I think the a11x from apple would work nicely with a cut down version of OSX, but I doubt they will see that far ahead.\nI notice even the Nokia 3 is getting oreo. thats another positive. I might just get a budget phone for now and get the Sirocco when its released in a few months. :-)", "time": "03-02-2018 11:20 PM", "replies": [{"postID": "post6177668", "text": "My mum has the Nokia 3, so impressed with the build quality and performance that I got the Nokia 8.", "time": "03-03-2018 07:18 AM", "replies": []}]}, {"postID": "post6177515", "text": "How did the cameras go so wrong? Sony sensors with Carl Zeiss lenses.....", "time": "03-03-2018 12:10 AM", "replies": []}, {"postID": "post6177528", "text": "It appears it could be the Sony Software, check out the difference with HDR+https://forum.xda-developers.com/nok...a-app-t3671274", "time": "03-03-2018 12:43 AM", "replies": []}, {"postID": "post6177539", "text": "Agggh I didnt realise they are only Sony IMX258, cant expect too much from that sensor. So essentially you are buying the phone for the looks and its processing power/gpu.", "time": "03-03-2018 01:15 AM", "replies": [{"postID": "post6177551", "text": "I bought this N8 used off Amazon. I am in the US so no matter what, I am not going to get any warranty out of it here anyway. Edit: Seems there is US site for warranty repair. So I figured look for the cheapest one in the best condition and go for it. It is in mint condition and cost me half of what they go for or went for brand new.\nI am not a huge camera user, but I know what helps me take great photos and what does not. The Nokia 8 does a fairly good job, though being a regular 950 XL user I would prefer the Lumia over this. Comparisons have shown that. However give it time. Nokia/HMD will refine what is already there, and as they fine tune the camera app to work on this device, or push their FW at some point (I hope) then I bet we see camera improvements at the least. It is their first dual camera model, right? Even though Nokia is Nokia, building new stuff on the Android platform takes RnD like anything else. So I say as far as the cameras go, they are ok or good depending on your perspective, but give them time to see if they make it better. As far as I am concerned the device hits all the right areas of need for most users.", "time": "03-03-2018 01:30 AM", "replies": []}, {"postID": "post6177672", "text": "TBH the camera is the last thing I look at as I have a DSLR and a 950XL", "time": "03-03-2018 07:21 AM", "replies": []}]}, {"postID": "post6182597", "text": "Im thinking of getting a v20 or note 5 to tie me over until Sirocco is released and prices have stabilised, prob 8 months or so.\nI really love the look of Sirocco so buying a nokia 8 now might not be the best move. I do think Nokia is heading back toward being the top of the tree in the cellphone quality market. First try and they almost got it right. Yes the camera is a little dissapointing, but I have a sony a6500 for real photos. photos on a phone are seldom epic and once you get passed a3 even in good light noise is gonna kill the pic.", "time": "03-07-2018 11:22 PM", "replies": []}]}, {"title": "Any Nokia Android question for old windows phone users", "thread": [{"postID": "post6100148", "text": "Do the Nokia phones retain the text to speech function over bluetooth like the windows phones do? If you had a windows phone you will understand. I love how i was told the Note 8 would do this. Nope!\nI bought a Note 8 and while it is neat, and a huge step up from my Nokia Icon (930) and my Nokia 928 it just does not perform as wellin some areas that i need for business. \nThe phone, contacts, voicemail app were better “baked in” on the windows phones. \nBluetooth, no one can hear me or it is seriously choppy. \nTexting - how i miss my windows phone. \nI thought about getting a HP Elite X3 but it doesnt have all the bands for Verizon. \nIf the New Nokias retained the old ability or not i would love to know. \nTIA", "time": "12-08-2017 09:14 AM", "replies": []}, {"postID": "post6130624", "text": "I was a long-time Nokia Lumia fan. Hell I still have a Lumia 920 and a Lumia 830 lying around. I know the functionality you're referring too and unfortunately, it's an OS thing so the Nokia 8 does not do the same things via bluetooth.\nI have a Note8, but it occasionally freezes on me which tempted me to look at and eventually buy a Nokia 8. I can tell you that bluetooth works flawlessly, including bluetooth 5.0 features which let you connect to multiple speakers at once. \nAnd on speakerphone, people tell me they can't even tell that I'm on speakerphone and not using the earpiece. \nBut back to your question... forgive me if you've already tried this but can't you use Ok Google to do something similar? Check this video for an idea:\n \nThere are some apps that do something similar as well https://drfone.wondershare.com/messa...t-message.html\nPlus this one: https://play.google.com/store/apps/d...dtext2me&hl=en\nPretty sure Bixby has some kind of functionality for this as well. \nHope that helps.", "time": "01-08-2018 04:01 PM", "replies": []}, {"postID": "post6175342", "text": "I will ask this here too...Does the Nokia 8 have any color tuner or display adjustments like moving to FHD/1080p or Night mode? I am big on displays and get picky about what I am looking at, and would like to know more about how much control Nokia allows in the UI over the display. Thanks folks.", "time": "02-28-2018 08:02 PM", "replies": [{"postID": "post6179357", "text": "As Jellyman says it has a Night Mode and settings for adjusting display and text elements but that's all, being Android though there are likely to be third party apps to make adjustments anyway.", "time": "03-05-2018 04:34 AM", "replies": [{"postID": "post6181277", "text": "Interesting. Let me know if you know of an app that can adjust the color, saturation and or temperature of the display. I'd be interested to see how it performs and if it's stable.", "time": "03-06-2018 04:02 PM", "replies": [{"postID": "post6181414", "text": "Have you tried Twilight? https://play.google.com/store/apps/d...urbandroid.lux\nI used this on my Motorola phones but my current LG V20 has a night mode built-in.", "time": "03-06-2018 06:32 PM", "replies": [{"postID": "post6181417", "text": "The night mode on the Nokia 8 works fine and is built in already. I am interested in display calibration or color saturation adjustments if possible.\n... I did mention color temperature I suppose but was meaning in the other spectrum (cold) which can tend to be a color adjustment too of either blue/purple or green", "time": "03-06-2018 06:34 PM", "replies": []}]}]}]}]}, {"postID": "post6176770", "text": "It has Night mode, don't know about the other adjustments.", "time": "03-02-2018 10:01 AM", "replies": []}]}, {"title": "Nokia 8 Auto Focus problem", "thread": [{"postID": "post6155857", "text": "Hi,\nMy Nokia 8 autofocus doesn't work until I give it a rap to it. So from this moment till I close camera app is working properly.\nAnyone with the same problem?", "time": "02-06-2018 09:37 AM", "replies": []}, {"postID": "post6155879", "text": "Welcome to Android Central! I moved this from the Oreo forum to the Nokia 8 forum, since this is not a general Oreo issue.\nWhat you describe would suggest the autofocus mechanism is getting jammed (it's one of the only two moving parts in a phone, the other being the vibratory motor). If the phone is still under warranty, I'd contact Nokia for repair.", "time": "02-06-2018 10:13 AM", "replies": []}, {"postID": "post6170633", "text": "I have the same issue with the standard camera app. Am using Open Camera and switched on the Camera2 API option and it works well.", "time": "02-23-2018 10:20 PM", "replies": []}, {"postID": "post6172275", "text": "That's a problem with the stock camera app. It can't keep the focus locked.\nI honestly recommend you to use a different camera app at least until you get the update that will replace the stock camera on the Nokia 8 with the Nokia Pro Camera app (aka the Lumia Camera)", "time": "02-25-2018 08:32 PM", "replies": [{"postID": "post6174113", "text": "Is there definitely an update coming to the stock camera app ?", "time": "02-27-2018 02:58 PM", "replies": [{"postID": "post6174420", "text": "Yes. The Nokia Pro Camera will be made available to ALL phones WITH ZEISS lenses. That means the Nokia 6 (2018), 7, 7+, 8 and 8S.\nWhen will the update be deployed...that we don't know yet. It may only be released in April...or it may be released with the March security update. HMD hasn't said.\nNOW...will the update fix this focusing issue? Your guess is as good as mine.", "time": "02-27-2018 09:47 PM", "replies": [{"postID": "post6177553", "text": "How does the app interact with the HW? Meaning would the app actually solve some problems? \nLike said above moving to a new app helped a bit. But how far will the Pro Cam app help or not before Nokia sends a fw update with that? I know more about how the Lumias/Windows Phones work under the hood and on those it is easy to spot an app problem opposed to a firmware problem.\nI had autofocus issues while shooting video, but only after zooming. Or if a bit too much light came into focus. Not a huge deal but it forced me to adjust my physical position a bit.", "time": "03-03-2018 01:43 AM", "replies": []}]}]}]}, {"postID": "post6174285", "text": "The pro camera app will come, maybe not before Nokia 8 Sirocco is on sale, but some in Nokia support has confirmed that it will come.", "time": "02-27-2018 06:08 PM", "replies": []}, {"postID": "post6174607", "text": "Agreed. It's not so much that the auto-focus doesn't work just that it can be very slow. A wait of a few seconds will annoy impatient family members! Following this, I've switched to Open Camera and initially it seems better at auto focus.", "time": "02-28-2018 06:18 AM", "replies": []}, {"postID": "post6174684", "text": "Anyone recommend a decent camera app to be going on with then?", "time": "02-28-2018 08:26 AM", "replies": [{"postID": "post6176285", "text": "Have you tried Open Camera?https://play.google.com/store/apps/d...rge.opencamera", "time": "03-01-2018 08:10 PM", "replies": []}]}, {"postID": "post6180187", "text": "Hi just thought I'd share my thoughts. 3 week old nokia 8... camera was working brilliantly a few days ago. today auto focus stopped working on rear camera in color or dual mode, but mono auto focuses perfectly. Front camera no problems. \nFound the only resolution was to shake the phone with some volience (as much as I can without dropping it!), and voila! auto focus works. Sounds like similar issue to Jaunan Lopez original post.\nAlso downloaded another camera app, and same problem. So seems to be a hardware design issue, not software... but then why does auto focus always work on black and white mode? Presumably to do with the action of the twin lenses that comes into play in that mode??", "time": "03-05-2018 06:38 PM", "replies": []}]}, {"title": "Nokia - Carrier Controlled Rollout of Oreo (SIM free or not)", "thread": [{"postID": "post6126798", "text": "I've been investigating this for about 3 weeks since I purchased my SIM free Nokia 8 in the UK.\nI'd suspected that Nokia wasn't being completely honest about how the Oreo rollout was working given the lack of confirmed installs and the number of complaints about those who had not received it, this tweet from Sarvikas definitely had me thinking:https://twitter.com/sarvikas/status/934040042875613184\nOver the weekend fiddle_n (reddit) confirmed on swapping from an EE sim to a Vodafone UK sim that Oreo became available, I tested this today on my own Nokia 8 and within a minute of changing to Vodafone the update became available. On XDA it had been confirmed that a BT Mobile user was able to receive both Oreo and the latest patch almost immediately however they'd been part of the beta test.https://forum.xda-developers.com/sho...&postcount=271\nUnfortunately regardless of having a sim free handset it appears that the GSF (Google Services Framework) is identifying phones by carrier and holding back the updates as the carrier has not approved them.\nThis is extremely disappointing and goes in the against the advertisement of \"Pure - Up to date - Secure - Always with Nokia\" as its not down to Nokia its down to the carriers to approve the updates regardless of being a SIM free handset.", "time": "01-04-2018 12:46 PM", "replies": [{"postID": "post6130051", "text": "Hmm. Something odd is going on. I'm with EE (and EE supplied handset) and got Oreo within hours of it being announced. I had also been on the beta programme.", "time": "01-08-2018 04:21 AM", "replies": [{"postID": "post6130238", "text": "If you're part of beta labs I believe Nokia pushes the update directly,https://www.nokia.com/en_int/phones/betalabs", "time": "01-08-2018 09:44 AM", "replies": []}, {"postID": "post6179280", "text": "I'm on EE. Still waiting..........", "time": "03-05-2018 01:10 AM", "replies": []}]}, {"postID": "post6177225", "text": "I got the update on my Nokia 8 with an O2 SIM even before I finished setting the phone up and yes, it is SIM free.", "time": "03-02-2018 04:41 PM", "replies": []}]}, {"postID": "post6128429", "text": "But I'm in a country and on a carrier where the Nokia 8 isn't sold and I got Oreo about a week after the official launch of Oreo for the Nokia 8... Mine is a TA-1004 unlocked dual SIM", "time": "01-06-2018 02:24 AM", "replies": []}, {"postID": "post6179388", "text": "This is nothing new and there is no \"conspiracy\" surrounding carriers approving updates for SIM free devices, updates roll out in waves, even to SIM free devices based on IMEI number to ensure there are no major, Galaxy S8 style issues. \nThe only reason that users in the beta program get updates first regardless of the network is that those updates will be bug fixes as they already have the base version, you just have to be patient and wait or join the beta program.", "time": "03-05-2018 05:12 AM", "replies": []}]}, {"title": "What does lock screen cleaner option do?", "thread": [{"postID": "post6133139", "text": "In battery management settings, there's a toggle for it, what does it do exactly?", "time": "01-11-2018 01:29 AM", "replies": [{"postID": "post6136392", "text": "I have a axon 7 it has a lock screen cleaner on there in the power manager this is what they say...I imagine it's the same thing as on your phone", "time": "01-14-2018 06:47 PM", "replies": []}]}, {"postID": "post6133292", "text": "What device? I don't see this option on my Pixel 2 XL.", "time": "01-11-2018 07:22 AM", "replies": [{"postID": "post6133303", "text": "It's not on my Pixel, either. Are you running Clean Master or a similar program?", "time": "01-11-2018 07:53 AM", "replies": []}, {"postID": "post6133319", "text": "Nokia 8", "time": "01-11-2018 08:25 AM", "replies": []}]}, {"postID": "post6133795", "text": "I've asked for the post to be relocated to the Nokia 8 section, this seems to be a device-specific option.", "time": "01-11-2018 05:02 PM", "replies": []}, {"postID": "post6134007", "text": "Hmm, I don't see any \"battery management\" setting on my Nokia 8. Can you clarify?", "time": "01-11-2018 10:12 PM", "replies": []}, {"postID": "post6134056", "text": "Can you post a screenshot?", "time": "01-11-2018 11:51 PM", "replies": [{"postID": "post6134088", "text": "", "time": "01-12-2018 01:30 AM", "replies": []}]}, {"postID": "post6135231", "text": "Interesting, there are questions about this on other sites as well (Nokia forums, Reddit, etc) but no one seems to have an answer.\nHave you tried reaching out to Nokia support?", "time": "01-13-2018 11:07 AM", "replies": [{"postID": "post6135242", "text": "Just did, will reply as soon as I get a reply!", "time": "01-13-2018 11:36 AM", "replies": []}]}, {"postID": "post6179364", "text": "I have a Background activity cleaner, I would assume this is the same thing just renamed in Oreo.", "time": "03-05-2018 04:45 AM", "replies": []}]}, {"title": "Camera help", "thread": [{"postID": "post6149445", "text": "Hey guys,\nLooking for some help with the Bokeh feature on the camera.\nAnyone know what it does and how to work it?\nThanks!", "time": "01-30-2018 03:59 AM", "replies": []}, {"postID": "post6150084", "text": "The Bokeh mode is excellent on the Nokia 8. So, launch the Camera app, then click on the little camera icon that's next to the shutter button (which also has a camera icon). \nNext, click on Live Bokeh. You can adjust the blur levels before or even after you take the photo. Just tap on the area you want to focus on and take the photo. \nAfter you take the photo, tap on it in the lower right hand corner, click the edit controls, and choose Edit using \"Bokeh editor.\" From there you can readjust the focus area and blur level of your bokeh shot.", "time": "01-30-2018 05:42 PM", "replies": [{"postID": "post6179352", "text": "Sounds like the Refocus app that Nokia had on the Lumia devices just built into the phone. This is the reason why I love my Nokia 8 is all the little things from Windows Phone/10 Mobile that have been brought across.", "time": "03-05-2018 04:18 AM", "replies": []}]}]}, {"title": "Has Anyone Received the Oreo Update Yet?", "thread": [{"postID": "post6087474", "text": "Good day, \nThe official Oreo rollout for the Nokia 8 started last week. Supposedly model numbers TA-1004 and TA-1012 are the first to get it. \nMine is a TA-1004 yet I'm still showing no update available. \nAnybody get it yet for their Nokia 8?", "time": "11-28-2017 12:43 AM", "replies": []}, {"postID": "post6087627", "text": "I'm on TA-1012 and not got it , I'm with 3 so it could be the carrier ?", "time": "11-28-2017 06:04 AM", "replies": [{"postID": "post6087986", "text": "Mine is the international unlocked version so there's no carrier tie to mine. \nI did get the November security patch. But still no Oreo. I guess HMD is doing a staggered rollout as to not overwhelm their servers.", "time": "11-28-2017 11:32 AM", "replies": [{"postID": "post6091631", "text": "I'm still waiting on Oreo, have you received it yet?", "time": "11-30-2017 06:57 PM", "replies": [{"postID": "post6091706", "text": "Not yet. Mine is TA-1004 Sim Free unlocked.", "time": "11-30-2017 08:00 PM", "replies": []}]}]}]}, {"postID": "post6087830", "text": "I got it on Friday, 24-Nov-2017, model TA-1012. \nI was on the Oreo Beta Programme - don't know it that makes any difference. So far looks pretty solid. Fixed the quiet ringer/notification volume issue I experienced in the beta.\nThe November security update came through a couple of days later.", "time": "11-28-2017 09:41 AM", "replies": []}, {"postID": "post6091757", "text": "I'm in the UK hopefully its rolling out here.", "time": "11-30-2017 08:18 PM", "replies": [{"postID": "post6091816", "text": "Just checked again and it's there! Downloading now", "time": "11-30-2017 08:37 PM", "replies": []}]}, {"postID": "post6091842", "text": "Gratz :-) hopefully I get mine soon :-)", "time": "11-30-2017 08:47 PM", "replies": []}, {"postID": "post6091845", "text": "Lol, just checked and mine is there now 😂", "time": "11-30-2017 08:49 PM", "replies": []}, {"postID": "post6105570", "text": "I still haven't received it yet, on a Nokia 8 no brand...", "time": "12-13-2017 08:21 AM", "replies": []}, {"postID": "post6106472", "text": "I have it in UK on TA1012", "time": "12-14-2017 12:41 AM", "replies": []}, {"postID": "post6116180", "text": "Bought it unlocked in UK yesterday. TA-1012 and I haven't got Oreo yet.", "time": "12-23-2017 02:43 PM", "replies": []}, {"postID": "post6118099", "text": "i received oreo update the day i bought the phone and opened it from its box. it was almost like i bought it with oreo", "time": "12-26-2017 03:58 AM", "replies": []}, {"postID": "post6122038", "text": "Finally got it yesterday!", "time": "12-29-2017 11:37 PM", "replies": []}, {"postID": "post6126801", "text": "UK users.\nSomething is up with the SIM free updates, for some reason we're not getting them due to the carrier we are on.\nOnly Vodafone has approved the initial update to date, best thing to do is order a free Voda SIM and pop it in to download the Oreo update.\nA number of us have confirmed this on XDA, Reddit and the Nokia Community Forums. I'd written a blog post about it this week but Nokia Mobile are not responding the query.", "time": "01-04-2018 12:49 PM", "replies": [{"postID": "post6179346", "text": "I'm sceptical about this being the explanation as updates generally roll out in waves based on IMEI number in the event that there are major issues, just look at the Galaxy S8, I got the update on my Nokia 8 the minute I switched it on OOTB and I'm on O2 with a SIM free TA-1012.", "time": "03-05-2018 03:49 AM", "replies": []}]}, {"postID": "post6127082", "text": "that's weird I have Oreo and two other updates and I am on EE", "time": "01-04-2018 05:27 PM", "replies": []}, {"postID": "post6127260", "text": "I have the international unlocked dual-SIM version (TA-1052). I bought it in late December and the Oreo update was available as soon as I turned the phone on.", "time": "01-04-2018 08:32 PM", "replies": []}, {"postID": "post6127937", "text": "I have it. Came today, I bought the phone sim free in the uk, but use EE as a carrier.", "time": "01-05-2018 01:47 PM", "replies": []}]}, {"title": "Nokia 8 Oreo 8.1", "thread": [{"postID": "post6167456", "text": "I have a Nokia 8 TA-1052 in U.S., still not receiving the update, any one knows when?", "time": "02-20-2018 11:28 AM", "replies": []}, {"postID": "post6168982", "text": "Update.......Just received the Oreo 8.1 this evening.......", "time": "02-22-2018 01:26 AM", "replies": []}, {"postID": "post6174686", "text": "Not got it in the UK yet..... Any ideas on a timeframe anyone?", "time": "02-28-2018 08:27 AM", "replies": [{"postID": "post6179303", "text": "What's this about then?", "time": "03-05-2018 01:29 AM", "replies": []}]}, {"postID": "post6179137", "text": "Have you signed up for the beta?", "time": "03-04-2018 08:14 PM", "replies": [{"postID": "post6179278", "text": "Yeah got the Beta and the Jan security patch.", "time": "03-05-2018 01:07 AM", "replies": [{"postID": "post6179296", "text": "Confused. You're signed up for the beta? You're still on Oreo 8.0?", "time": "03-05-2018 01:22 AM", "replies": [{"postID": "post6179298", "text": "No I've got a Beta 8.1 with the January security patch.", "time": "03-05-2018 01:23 AM", "replies": []}]}]}]}, {"postID": "post6179305", "text": "Waiting for the official 8.1 build and the Feb security patch.", "time": "03-05-2018 01:33 AM", "replies": [{"postID": "post6179315", "text": "Ooooo IC. Who knows.", "time": "03-05-2018 02:15 AM", "replies": []}]}, {"postID": "post6179318", "text": "I got the update and the security patch while I was setting up the phone for the first time.", "time": "03-05-2018 02:24 AM", "replies": []}]}, {"title": "Nokia 8 now £399 at Carphone Warehouse", "thread": [{"postID": "post6051650", "text": "Price has dropped by £100 to £399 unlocked making it more of a bargain now OnePlus 5 is no longer available to buy.\nIs this the cheapest Snapdragon 835 phone in the UK now?http://forums.androidcentral.com/e?l...token=kABoiLfn", "time": "11-03-2017 07:32 AM", "replies": []}, {"postID": "post6052270", "text": "Nice! That's about what I paid for the unlocked Dual SIM variant on eBay. I see they have the copper one in stock too!", "time": "11-03-2017 01:45 PM", "replies": [{"postID": "post6176960", "text": "All Nokia 8 devices are dual SIM but that second SIM tray can also be used for a microSD Card.", "time": "03-02-2018 12:38 PM", "replies": []}]}, {"postID": "post6052435", "text": "Nice. Same pricing on Amazon at the moment: $520 USD, which is basically the straight GBP to USD conversion. Good deal!", "time": "11-03-2017 03:43 PM", "replies": []}, {"postID": "post6052600", "text": "I got my polished copper one for about $530 USD on eBay. The global dual-SIM unlocked variant. Great bang for buck. And the polished copper is stunning. I get a lot of questions about it at work.", "time": "11-03-2017 05:39 PM", "replies": []}, {"postID": "post6055089", "text": "Better to wait for Nokia 9?", "time": "11-05-2017 11:54 AM", "replies": []}, {"postID": "post6055276", "text": "I'm in the US but am definitely waiting for the 9. Rumor has it that it will be globally released. I have a feeling and just my hunch that it will come near the end of this month", "time": "11-05-2017 02:07 PM", "replies": []}, {"postID": "post6110460", "text": "It's now £369 at Carphone Warehouse... what do you think guys?\nThis or Pixel 2 for £529?", "time": "12-18-2017 06:41 AM", "replies": []}, {"postID": "post6110999", "text": "I still say wait it out for the 9. Rumor has it in Jan sometime from what I read", "time": "12-18-2017 02:06 PM", "replies": []}, {"postID": "post6111058", "text": "What will it be priced though? Surely around double £369.", "time": "12-18-2017 03:14 PM", "replies": []}, {"postID": "post6111327", "text": "You got a point there", "time": "12-18-2017 08:30 PM", "replies": []}, {"postID": "post6114141", "text": "I did it, I ordered the Nokia 8 from CPW!\nCan't wait to receive it. I was so close to going with the Pixel 2, and I played with both extensively. \nI just couldn't handle the bezels on the P2, plus it's currently £160 more.\nI actually find the N8 camera impressive TBH. But what really swayed me is the promise of regular security updates!", "time": "12-21-2017 01:17 PM", "replies": []}, {"postID": "post6114423", "text": "Congrats to you on your Nokia 8 hope you enjoy it", "time": "12-21-2017 06:58 PM", "replies": []}]}, {"title": "Nokia Advertising", "thread": [{"postID": "post6171046", "text": "Saw this in Thailand in a mobile center. Had to buy it, first they didn't want to sell it to me but 500 THB did the trick.\nAnybody seen this?", "time": "02-24-2018 11:55 AM", "replies": []}]}, {"title": "How does Oreo 8.1 perform on Nokia 8?", "thread": [{"postID": "post6144121", "text": "On daily driver, is it fine?", "time": "01-23-2018 05:14 PM", "replies": []}, {"postID": "post6144468", "text": "I installed it yesterday evening. Have noticed no issues so far - but obviously this is quite a short space of time.", "time": "01-24-2018 05:42 AM", "replies": []}, {"postID": "post6144849", "text": "Me neither. Running like a dream. Good work Nokia/HMD", "time": "01-24-2018 02:41 PM", "replies": [{"postID": "post6155693", "text": "Any changes to the camera software?", "time": "02-06-2018 05:47 AM", "replies": []}]}, {"postID": "post6145496", "text": "Where do you load the 8.1 beta from? It wasn't in the update options. I'm guessing you have to sign up for the beta? Also, how is the UI experience? 8.0 is laggy for me and feels kind of sluggish. It's not bad, but I have been hoping that they would refine it a bit. Also, 8.0 camera crashes, is super laggy, and has issues. I'm hoping that is fixed as well.", "time": "01-25-2018 10:05 AM", "replies": [{"postID": "post6150507", "text": "Yes you've to sign up in order to receive the update.\nCamera Software on Nokia 8 is far behind the equipped hardware, Nokia is listening...", "time": "01-31-2018 07:42 AM", "replies": []}]}, {"postID": "post6161610", "text": "Waiting for 8.1 stable..........", "time": "02-13-2018 09:09 AM", "replies": []}, {"postID": "post6170632", "text": "Been running the beta for a month or so now. No issues. Runs well, performs well. Only issue is the camera won't focus. Switched to Open Camera with Camera2 API and that works.", "time": "02-23-2018 10:18 PM", "replies": []}]}, {"title": "Nokia 8 Oreo 8.1 update", "thread": [{"postID": "post6162236", "text": "Now that the stable update is out, What are your thoughts about the update?", "time": "02-14-2018 02:25 AM", "replies": []}, {"postID": "post6162239", "text": "I upgraded last night, the UI changes are nice, the phone feels faster.\nOn the down side the battery -at least for me- is noticably worse", "time": "02-14-2018 02:27 AM", "replies": [{"postID": "post6162913", "text": "I wonder if a hard reset would correct that. Lots of people do that after major updates. Might be a hassle though, so you may want to wait for the next update to see if battery life improves.", "time": "02-14-2018 11:00 PM", "replies": [{"postID": "post6165339", "text": "Turns out it's my phone not the update (poor Network drains battery).\nBattery life is better than ever!", "time": "02-17-2018 07:00 PM", "replies": []}]}]}, {"postID": "post6163076", "text": "Not yet appeared on my 8 (TA-1012, UK) even though I am on beta programme.", "time": "02-15-2018 05:15 AM", "replies": []}, {"postID": "post6167304", "text": "Still not receive the update on my TA-1052, any one knows why?", "time": "02-20-2018 08:42 AM", "replies": []}]}, {"title": "Nokia 8 screen saver", "thread": [{"postID": "post6153109", "text": "I am trying to figure out what the clock screen saver is that keeps popping up on my screen. I thought it was screen saver in display but I set that to colours, Ive turned off glance. I'm at a loss. Any ideas?", "time": "02-03-2018 01:47 AM", "replies": [{"postID": "post6153112", "text": "Can you believe just after I posted I had a brain wave. It's the Google Clock app. But I can't figure out how to turn it off.", "time": "02-03-2018 01:50 AM", "replies": []}]}, {"postID": "post6154151", "text": "I've never figured a way to turn it off. I did try but it wouldn't", "time": "02-04-2018 08:48 AM", "replies": []}]}, {"title": "Nokia 8 and noise measurement...", "thread": [{"postID": "post6150951", "text": "Hi Guys,\nCould anyone do a favour and test what noise level Nokia 8 can measure using sound meter or a similar app?\nI have to measure environment noise levels in fairly loud places on a regular basis and unfortunately cannot find any android devices that can do that beyond 90db (most are capped at even lower levels). All iPhones can (but I don't want one) so could the old Lumias... so I am hoping Nokia 8 can do that too.\nThanks!", "time": "01-31-2018 04:55 PM", "replies": []}]}, {"title": "External storage", "thread": [{"postID": "post6083116", "text": "Can install apps and games on a external storage(micro sd card)?", "time": "11-24-2017 10:16 AM", "replies": []}, {"postID": "post6084971", "text": "They're supposedly adding that ability in an update (if it hasn't already been done): LoveNokia: Nokia 8 will receive software update which should allow users to move apps to Memory Card", "time": "11-26-2017 01:44 AM", "replies": []}, {"postID": "post6138696", "text": "You could try this in the meantime:https://play.google.com/store/apps/d....gphone.app2sd", "time": "01-17-2018 12:47 PM", "replies": []}]}, {"title": "Lock screen management", "thread": [{"postID": "post6132284", "text": "Hello! Windows Phone convert...\nIs it possible to specify what apps to show on lock screen? Currently I've three options: Show everything, hide sensitive, or hide everything.\nWould like to only show Music player.", "time": "01-10-2018 09:41 AM", "replies": [{"postID": "post6133142", "text": "I managed to get over this by enabling\"show all notification\" then disabling notification for each app individually...", "time": "01-11-2018 01:35 AM", "replies": []}]}, {"postID": "post6138645", "text": "That's the best way to do it", "time": "01-17-2018 11:38 AM", "replies": []}]}, {"title": "Notification management", "thread": [{"postID": "post6132275", "text": "Hello!\nWP convert here...\n1. How can I change the tones for every single app? \nSome apps from system settings but not all.\n2. How can i customize the quick actions?\nFor mail app for examples, I want to Mark as read or delete instead of archive or flag.\n3. Is it possible to set the device to wakeup with every notification? How?\nThank you", "time": "01-10-2018 09:26 AM", "replies": []}, {"postID": "post6132323", "text": "Welcome! Former Lumia user myself. \n1. This is app dependent. Most will let you change the notification tone for that app, but this is done through that individual app's settings (not system settings).\n2. Open Gmail > hamburger menu (top left) > Settings > General settings > Gmail default action\n3. Aside from stock apps like Phone and Messaging, I think you need a third-party app to wake the screen for every notification. Something like this: https://play.google.com/store/apps/d....glimpse&hl=en", "time": "01-10-2018 10:15 AM", "replies": [{"postID": "post6132436", "text": "Thank you for the Glimpse app!! LOVE IT!\nI use Outlook app, unfortunately doesn't support changing quick actions yet ️ thought it was system related...", "time": "01-10-2018 12:12 PM", "replies": []}]}, {"postID": "post6134121", "text": "Another Lumia user moved to Android (and back to Nokia). One thing that surprised me was, given how sophisticated and configurable the latest Android is that certain things I'd taken for granted as \"baked in\" on Windows Phone are not there on Android without a 3rd party App. A good example is the \"Glimpse\" functionality. Another is no automatic syncing of contact photos between Contacts and (e.g.) Facebook.", "time": "01-12-2018 03:25 AM", "replies": []}, {"postID": "post6134123", "text": "Facebook used to have automatic profile pic syncing with Android back in 4.xx and before. For some reason Facebook removed it.\nYou can use Lightflow to override the app notification sounds. Set the default notification sound to silent, then let Lightflow handle everything. You can also set it to handle the LED colors. It can also be used to make the device wake up with notifications. You can set it to wake up only with selected ones too.", "time": "01-12-2018 03:37 AM", "replies": []}, {"postID": "post6138644", "text": "You can set up Notifications both ways as long as your running Oreo. Either through the app or through the apps and notifications settings menu.\nIt also has notification channels built in. Which means you can choose what you things in an app you receive notifications for.", "time": "01-17-2018 11:38 AM", "replies": []}]}, {"title": "Why isn't Hotspot Shield in BEST ANDROID VPNs list?", "thread": [{"postID": "post6132517", "text": "Read several articles, none of which mentioned it", "time": "01-10-2018 01:19 PM", "replies": []}, {"postID": "post6132644", "text": "I've never heard of it. If it's main purpose is to get around hotspot restrictions, that'd be something we're prohibited from discussing in the forums - but if it's a legit VPN service, it could potentially be simply because it's not one of the more well known ones?", "time": "01-10-2018 02:51 PM", "replies": [{"postID": "post6132795", "text": "It's at the top of search results, really popular -at least in my region-", "time": "01-10-2018 05:20 PM", "replies": []}]}, {"postID": "post6132839", "text": "I used to use Hotspot Shield on my laptop years ago. Never tried it on mobile but it was certainly a very popular application at the time.", "time": "01-10-2018 06:32 PM", "replies": []}]}, {"title": "How to enable one handed mode?", "thread": [{"postID": "post6132498", "text": "Read that it's OEM choice, are there any apps that can give me this?\nThank you...", "time": "01-10-2018 01:05 PM", "replies": []}, {"postID": "post6132617", "text": "Android does not have such thing. OEMs can add this to their version on their own, but Nokia didn’t.", "time": "01-10-2018 02:36 PM", "replies": []}, {"postID": "post6132679", "text": "What revanmj01 said. The Nokia 8's display is only 5.3 inches, so I doubt they considered adding this. Perhaps they'll implement it when they release their first Android phablet.", "time": "01-10-2018 03:21 PM", "replies": []}]}, {"title": "Forbes names the Nokia 8 its Smartphone of the Year!", "thread": [{"postID": "post6124480", "text": "Forbes tech writer Ewan Spence just named the Nokia 8 his 'Smartphone of the Year!'\nThat's some high praise. I definitely love my copper Nokia 8, but I'm not so sure it was the best smartphone of 2017. I currently also have a Note8, and I think that's probably more deserving of the award given how complete it is in every aspect. \nI'd say what the Nokia 8 has going for it is fantastic build quality and killer aesthetics at an affordable price for a phone with the year's top chipset. \nAnyhow, here's the article: https://www.forbes.com/sites/ewanspe.../#29f7a53024b5", "time": "01-02-2018 12:52 AM", "replies": []}, {"postID": "post6130217", "text": "This is awesome! And congratulations on your Copper Nokia 8! That is one beautiful phone; and most likely the colour I would've wanted!", "time": "01-08-2018 09:09 AM", "replies": [{"postID": "post6130611", "text": "Thanks Morty2264! It's a fantastic phone for the specs and price. I'm hoping we'll see a more feature-packed flagship from Nokia in 2018 to compete with the likes of S and Note series from Samsung. \nFantastic start to their Android endeavors for Nokia though.", "time": "01-08-2018 03:48 PM", "replies": [{"postID": "post6130619", "text": "Absolutely! It's a great phone for the price, and gorgeous to boot. Can't wait to see what Nokia does next!", "time": "01-08-2018 03:54 PM", "replies": []}]}]}]}, {"title": "Nokia 8 Customization/Themes", "thread": [{"postID": "post6082069", "text": "I just got my Nokia 8 yesterday and looking for some Customization and theme tips \nGet your screenshots posted to give me and others some good ideas 😉", "time": "11-23-2017 06:23 AM", "replies": []}, {"postID": "post6082155", "text": "Basic theme", "time": "11-23-2017 08:10 AM", "replies": []}, {"postID": "post6082490", "text": "Nice screenshots! Looks as if it has a pretty nice screen. Liking what I'm seeing of the screen so far", "time": "11-23-2017 02:19 PM", "replies": []}, {"postID": "post6087848", "text": "Great screenshots! Keep 'em coming!", "time": "11-28-2017 09:51 AM", "replies": []}, {"postID": "post6088535", "text": "Changed it a bit , using go weather now and stock Nokia wallpaper.", "time": "11-28-2017 05:48 PM", "replies": []}, {"postID": "post6088580", "text": "I'm not sure how or if its even possible to post attachments using the android central app? 🤣", "time": "11-28-2017 06:08 PM", "replies": []}, {"postID": "post6088590", "text": "[attach]", "time": "11-28-2017 06:13 PM", "replies": []}, {"postID": "post6088594", "text": "Not sure about the icons , think I'll change back to stock! [ATTACH]", "time": "11-28-2017 06:15 PM", "replies": [{"postID": "post6088651", "text": "I like them! They match your wallpaper nicely! Good job!", "time": "11-28-2017 06:46 PM", "replies": []}]}, {"postID": "post6088675", "text": "I love those icons too. I'm going to have an all blue theme on my 9 when it comes out and I get it", "time": "11-28-2017 06:57 PM", "replies": []}, {"postID": "post6089604", "text": "Thanks , getting used to the blue now and liking it more! I'm liking go weather app but it has to much adds so I need to try and find a good free weather app .", "time": "11-29-2017 11:57 AM", "replies": [{"postID": "post6090674", "text": "Glad you're liking it! Have you tried AccuWeather, or The Weather Network?", "time": "11-30-2017 08:05 AM", "replies": [{"postID": "post6091592", "text": "Never tried them but I'll give them a go for sure! \nLoving the new keyboard I got, really matches my theme 😁", "time": "11-30-2017 06:24 PM", "replies": [{"postID": "post6091629", "text": "Looks great!", "time": "11-30-2017 06:57 PM", "replies": []}]}]}]}, {"postID": "post6091593", "text": "😎 new keyboard [ATTACH]", "time": "11-30-2017 06:26 PM", "replies": []}, {"postID": "post6124439", "text": "", "time": "01-01-2018 11:06 PM", "replies": []}, {"postID": "post6124576", "text": "This looks nice, love the color . could you link me what your using please :-)", "time": "01-02-2018 06:21 AM", "replies": [{"postID": "post6124807", "text": "I'm using Substratum with the Sai's Oreo Theme to make everything black, but the home screen is simply Nova Launcher with the Light X Icon Pack. \nI got the wallpaper from the Zedge app by searching \"black neon.\"", "time": "01-02-2018 11:24 AM", "replies": []}]}, {"postID": "post6125878", "text": "Nice I'm going to try it thanks :-)", "time": "01-03-2018 12:44 PM", "replies": []}, {"postID": "post6130216", "text": "I love seeing homescreen screenshots! Keep 'em coming, guys!", "time": "01-08-2018 09:08 AM", "replies": []}]}, {"title": "Hard reset nokia 8 problems", "thread": [{"postID": "post6043636", "text": "I've try to use hard reset my nokia 8.\n1. Turn off Nokia.\n2. Switch on Power cord.\n3. Push in the same Time switches VOL UP+Power. \nBut Nokia didn't start in the RECOVERY MODE.\nIs this possible that I'm doing something wrong??\nmy email [removed]", "time": "10-29-2017 02:47 AM", "replies": []}, {"postID": "post6044155", "text": "Yes, you are. See NOKIA 8 - Recovery Mode - HardReset.info for the correct procedure.", "time": "10-29-2017 12:25 PM", "replies": []}, {"postID": "post6044332", "text": "I do as you said. Still flashing ANDROID nothing nothing more.\n1. Turn off\n2. Push in the same Time switches VOL UP+Power. \n3. Switch on Power cord\nAny ideas???", "time": "10-29-2017 02:16 PM", "replies": []}, {"postID": "post6126217", "text": "hi from android 7.1.1 upgrade 8.0.0 the side of my phone not working on and off", "time": "01-03-2018 08:43 PM", "replies": []}]}, {"title": "Calculator app and Google Duo keep crashing at launch", "thread": [{"postID": "post6124435", "text": "I can't for the life of me figure out why this is happening. The Calculator app does not work. Whenever I try to launch it, it says \"Calculator has stopped.\"\nI tried clearing the app's cache, data, uninstalling and reinstalling, and nothing seems to fix it.\nSame with Google Duo. It starts to launch but crashes every time. Tried clearing the cache, data, uninstalling and reinstalling it as well.\nAny ideas?", "time": "01-01-2018 11:00 PM", "replies": []}]}]
[{"title": "Nokia 8 duplicate contacts", "thread": [{"postID": "post6122197", "text": "Can anyone explain how I can set my Nokia 8 to just save 1 set of contacts. I can't find a \"merge contacts\" or anything that asks me where I want to save the contact to. Thanks", "time": "12-30-2017 07:33 AM", "replies": []}, {"postID": "post6122207", "text": "Your post was a duplicate. \nI’ve deleted the other.", "time": "12-30-2017 07:50 AM", "replies": []}, {"postID": "post6122639", "text": "If the contacts are all Google contacts, go to Google Contacts, awitch to the old version (left column, at the bottom) hit More and you'll find a \"Find and merge duplicates\" item.\nIf they're not Google contacts, go to Settings (in the Contacts app), export your contacts, go into Airplane mode, delete all your contacts, then import the file you exported, but import it to your Google account. Give it an hour, then go back to the beginning of this post.", "time": "12-30-2017 04:59 PM", "replies": []}]}, {"title": "Pictures taken with your Nokia 8.", "thread": [{"postID": "post6041547", "text": "I realize this phone isn't out in the wild on the same scale as a Samsung or other large Android OEM, but I figured I'd make a photo thread for this phone too. Hopefully some of you will contribute to it as well. \nLet's see those photos! \nHere's a few from my first day at work with the Nokia 8:\nHere's a video I took at work. The OZO audio is really something else! The audio in the video sounds EXACTLY like it did in real life. I shot in 1080p as I do not have a 4K display to really judge 4K quality anyway.", "time": "10-27-2017 12:42 PM", "replies": []}, {"postID": "post6041636", "text": "Pics look more then acceptable for my personal taste. I think it's only going to improve with some software tweeks etc.\nThank you for posting! How is the call quality? Do you get good signal strength ? I know that is going to vary depending on location and carrier etc but was just curious. Good volume? Any issues hearing the other person?", "time": "10-27-2017 01:22 PM", "replies": [{"postID": "post6042281", "text": "Thanks. The call quality is excellent. Just like Nokia's of the past. Haven't had any issues. Loud and clear. \nAlso the Nokia 8 comes with a decent set of earphones", "time": "10-27-2017 11:03 PM", "replies": []}]}, {"postID": "post6041732", "text": "These pics really look nice! Nothing wrong with the quality of pics the Nokia 8 takes at all!", "time": "10-27-2017 02:36 PM", "replies": []}, {"postID": "post6043190", "text": "Really happy with the camera on my 8. I just want it to be quick loading and take a decent picture of what I'm pointing it at.\nStands up to both of those tests so far.", "time": "10-28-2017 04:57 PM", "replies": []}, {"postID": "post6045348", "text": "This is interesting and mirrors my experience. Coming from a number of Lumia phones I was a bit apprehensive about the quality of the Nokia 8's photos. Whilst I think it would be bettered by (e.g) the Lumia 950 the results are not bad at all. Here are a few of my recent ones, straight out of the phone, no editing.\nThe proof was that, after a recent day out a friend with an iPhone (a 6 IIRC), who had also taken some pictures, asked for copies of my photos.", "time": "10-30-2017 06:06 AM", "replies": [{"postID": "post6045779", "text": "I felt the same way. I've had the Lumia 950 and before that the Lumia 1020. I didn't expect the Nokia 8 to match the 1020 in still photos (I don't think any phone can, unless somebody puts a massive sensor in a phone again). I'm pleased with the photos of my Nokia 8, I also have an iPhone 8 and the Nokia's are just as good. With some software updates and perhaps a full manual mode from HMD in the future it will be even better. \nVideo I'm more than pleased. The OZO audio is excellent and finally I have a phone that records audio in high quality similar to the Lumia 950. So many manufacturers (and reviewers) overlook audio quality with video recording. \nOverall I'm very happy with the device, being a Nokia fan during their glory days it's really nice to see HMD bring back some of the Nokia flavour of the past (ringtones, beta labs etc).", "time": "10-30-2017 12:11 PM", "replies": []}]}, {"postID": "post6045697", "text": "Nice pics!", "time": "10-30-2017 11:16 AM", "replies": []}, {"postID": "post6046649", "text": "https://nokiapoweruser.com/nokia-and...nts-hmd-nokia/\nInteresting read. Been popping up in a few places lately.", "time": "10-30-2017 10:49 PM", "replies": [{"postID": "post6046663", "text": "Interesting indeed! Thanks for sharing! The Nokia Camera UI is awesome! Hopefully this pans out.", "time": "10-30-2017 11:15 PM", "replies": []}]}, {"postID": "post6051331", "text": "Here's one at night after a snowfall. No edits.", "time": "11-02-2017 10:52 PM", "replies": []}, {"postID": "post6051556", "text": "Nice! You have that 4 letter word that I don't want to hear lol", "time": "11-03-2017 05:36 AM", "replies": []}, {"postID": "post6052433", "text": "These are all really great! Why did I get the impression that the camera on the N8 sucked?! I appreciate the sunset (sunrise?) shots in the first post. Very little graininess in the blue sky. On my aging iPhone 6S+ there is a lot of noise in pics of the evening sky, way more than in my old 950XL. \nBTW the N8 is now available for $520 on Amazon, pretty good pricing!", "time": "11-03-2017 03:41 PM", "replies": [{"postID": "post6052583", "text": "Yeah the camera has been great so far! It's not as heavy on the post processing as say a Google Pixel, but it takes very clean and accurate photos. The live bokeh mode works well for portraits as well. The video is great and the OZO spatial audio is excellent. \nI had the Lumia 1020 and the Lumia 950. For raw daylight still photos I'd say the 1020 and 950 are slightly better, but overall the Nokia 8 is an excellent \"come back\" for Nokia. I can't wait to see what they come up with in the future. \nHere's a couple of more samples:\nCoworker gave me permission to upload his portrait.\nHere's a quick low-light video I took last night. Please wear headphones to hear the OZO spatial audio.", "time": "11-03-2017 05:28 PM", "replies": [{"postID": "post6052663", "text": "That looks outstanding for nighttime video. Couldn't really appreciate the audio with all the wind noise, but I was already impressed with the brief concert recording that I posted about earlier. Everything looks pretty good on this device, I'll give it good look if I lose/destroy my iPhone 6S+ (my rebound after the 950XL) any time soon.", "time": "11-03-2017 06:30 PM", "replies": [{"postID": "post6052716", "text": "Yeah the only issue I have with it is the sensitivity to wind noise, but as far as quality and accuracy it totally clowns any other phone I've had. The crunchy snow while I'm walking and the traffic sounds were EXACTLY like that in real life. When I put my headphones to play the video for the first time after taking it I was blown away. \nOverall phone performance has been excellent too. I think this phone is a real \"sleeper\" so to speak among the expensive heavy hitters like Samsung etc. The old school Nokia attention to little details is very evident and despite being Android there's definitely some Nokia DNA. It's hard to explain. But I'm digging it", "time": "11-03-2017 07:06 PM", "replies": []}]}]}]}, {"postID": "post6061333", "text": "Here's an article from Nokia Power User comparing the Lumia 1020 with the Nokia 8. Interesting reading and the 8 acquits itself well.", "time": "11-09-2017 07:03 AM", "replies": []}, {"postID": "post6061681", "text": "Great Read! Thanks for sharing. I think the camera is going to improve even more so with future updates", "time": "11-09-2017 10:14 AM", "replies": []}, {"postID": "post6068142", "text": "Wow! Awesome photos! And love the airplanes!", "time": "11-13-2017 05:26 PM", "replies": [{"postID": "post6068671", "text": "Thanks!", "time": "11-14-2017 01:02 AM", "replies": []}]}, {"postID": "post6074410", "text": "Panorama mode works well.", "time": "11-17-2017 12:28 PM", "replies": []}, {"postID": "post6079427", "text": "Great photos and the low light video is impressive. Before coming to this forum I took it from the reveiws I read that the camera was poor.\nSome macro examples would nice to see close up detail and some bokeh 😎", "time": "11-21-2017 09:11 AM", "replies": []}, {"postID": "post6079749", "text": "Here's a few more samples. One thing I did notice is the autofocus is very annoying. Even if you tap to focus the autofocus will focus the lens back on the center unless you take a photo within half a second of selecting your focus point. The autofocus also seems to struggle in low light. \nI've noticed a fair amount of noise in low light photos, hopefully a future update will give us manual controls to mitigate that. Daylight photos are very good and very true to life.", "time": "11-21-2017 01:09 PM", "replies": []}, {"postID": "post6079822", "text": "Can you take the photo by just tapping once where you want to focus or do you have to focus then tap the shutter button?", "time": "11-21-2017 01:49 PM", "replies": [{"postID": "post6080022", "text": "You have to focus then tap the shutter button.", "time": "11-21-2017 03:39 PM", "replies": []}]}, {"postID": "post6079835", "text": "Looks good to me for low light shots", "time": "11-21-2017 01:57 PM", "replies": []}, {"postID": "post6091937", "text": "Just received the Oreo update. Some of the auto focus issues I was having seemed to have been fixed. Haven't given it a thorough test yet but so far so good.", "time": "11-30-2017 09:40 PM", "replies": []}, {"postID": "post6092267", "text": "Great news :-) I haven't used the camera much to be honest, I need to give a good try out.", "time": "12-01-2017 05:25 AM", "replies": []}, {"postID": "post6092325", "text": "Any tips for snapping kids that can't sit still. All I get is a blurred photo :-/", "time": "12-01-2017 07:04 AM", "replies": [{"postID": "post6093215", "text": "Try turning HDR off. \nAlso if the room is dimly lit then any camera will struggle to keep a moving object in sharp detail in dim light.", "time": "12-02-2017 12:03 AM", "replies": []}]}, {"postID": "post6093372", "text": "Got a couple of not bad ones today, a little out of focus, not finding the sharpness yet with the camera.", "time": "12-02-2017 08:07 AM", "replies": []}, {"postID": "post6114871", "text": "Love these photos!", "time": "12-22-2017 08:41 AM", "replies": []}, {"postID": "post6116665", "text": "", "time": "12-24-2017 03:12 AM", "replies": [{"postID": "post6116845", "text": "Cute doggie! What is his/her name?", "time": "12-24-2017 09:26 AM", "replies": []}]}, {"postID": "post6116666", "text": "", "time": "12-24-2017 03:13 AM", "replies": []}, {"postID": "post6116929", "text": "Merle n you he whippet,cheers", "time": "12-24-2017 11:51 AM", "replies": []}, {"postID": "post6116930", "text": "Merlin the whippet even, cheers", "time": "12-24-2017 11:51 AM", "replies": []}]}, {"title": "Oreo update", "thread": [{"postID": "post6092417", "text": "Finally, received Oreo update on my Nokia 8, AT-1052 last night.", "time": "12-01-2017 08:35 AM", "replies": []}, {"postID": "post6092501", "text": "If this is as good for you on a Nokia like it does on my original pixel you are going to like it!", "time": "12-01-2017 10:15 AM", "replies": []}, {"postID": "post6092534", "text": ":-) I'm finding it more responsive although I'm not really an android expert and not sure what to look for 😂. Not that impressed with my camera but it could be user error.", "time": "12-01-2017 10:51 AM", "replies": []}]}, {"title": "Notification help", "thread": [{"postID": "post6087615", "text": "So I charged my phone this morning and had an email notification but when I pull down it says no notifications .\nAnyone else had this issue?", "time": "11-28-2017 05:43 AM", "replies": []}, {"postID": "post6087626", "text": "I tried rebooting the phone and notifications still showing but when I pull down it says no notifications , also tried different launcher .", "time": "11-28-2017 06:03 AM", "replies": []}, {"postID": "post6087632", "text": "fixed it 😁 I uninstalled some apps and it started working again although I'm not sure which app caused it :-/ glad it's working again .", "time": "11-28-2017 06:11 AM", "replies": [{"postID": "post6087845", "text": "Glad it's working for you again! I was going to say that maybe it was a glitch - an email you'd already opened that went through again.", "time": "11-28-2017 09:50 AM", "replies": []}]}]}, {"title": "Volume decrease automatically while traveling", "thread": [{"postID": "post6082910", "text": "I have recently bought Nokia 8 and facing this issue where my volume will automatically drop to zero in a interval of 5 to 10 minutes while travelling and with headphones on, this problem occurred only when I am using my headphone. I am not using any third party headphone, this were bundleded with my phone. \nIt's really irritating and Nokia support guys can't even understand this problem.\nDose anyone of you know a fix for this problem. \nThanks, in advance", "time": "11-24-2017 04:25 AM", "replies": []}, {"postID": "post6082948", "text": "probably worth trying a different set of headphones", "time": "11-24-2017 05:47 AM", "replies": []}, {"postID": "post6083394", "text": "Tried that.. still facing the same issue", "time": "11-24-2017 02:17 PM", "replies": []}]}, {"title": "November securty updat", "thread": [{"postID": "post6081367", "text": "Just received the November Securty Update this morning on my Nokia 8 AT-1052.", "time": "11-22-2017 01:54 PM", "replies": []}]}, {"title": "Does Nokia 8 UK version work with the U.S. carriers such as AT-T, T-Mobile?", "thread": [{"postID": "post6004081", "text": "I visited clove.co.uk website and saw that I can order Nokia 8 64G from the website. Clove can ship the phone to the U.S.\nI am currently using AT-T prepaid plan. Does anyone know can I use the phone with AT-T prepaid plan?\nThanks!", "time": "10-04-2017 01:28 PM", "replies": []}, {"postID": "post6004733", "text": "Here are the bands that are compatiblehttps://www.androidcentral.com/nokia-8-specs\nCheck network compatibility herehttps://willmyphonework.net/", "time": "10-04-2017 06:45 PM", "replies": []}, {"postID": "post6074015", "text": "Since AT&T caps pre-paid data to HSPA speeds anyway, yes.", "time": "11-17-2017 06:21 AM", "replies": []}]}, {"title": "Would you buy a phone from Nokia at flagship pricing?", "thread": [{"postID": "post5897981", "text": "Although the phone looks interesting, I really have a hard time considering paying flagship pricing on a Nokia phone... Now if it sold in the price of say OnePlus or ZTE Axon 7 then I would be more likely to consider it. \nWhat about you?", "time": "07-24-2017 03:19 PM", "replies": []}, {"postID": "post5898002", "text": "Not until it's proven. The first generation, no way. If they truly support the first generation and then fix the design, I'll consider the second generation.", "time": "07-24-2017 03:32 PM", "replies": []}, {"postID": "post5898129", "text": "If it has all the specs I want, if Google keeps pricing their 128GB models upward of $700, if Apple sticks with their decision to leave out the headphone jack (they will), I would probably pay up to $600. So almost flagship pricing. \nIMO it needs to be quite a bit cheaper than the next Pixel, as in $150 cheaper, because the Pixel already has a good cam, a pure Android experience, and regular security updates, the three main things I want in an Android phone.", "time": "07-24-2017 05:34 PM", "replies": []}, {"postID": "post5899795", "text": "It really depends on the features 6Gb RAM 64Gb storage NFC and quality camera plus 5.5\" screen then yes.", "time": "07-25-2017 09:08 PM", "replies": [{"postID": "post6017440", "text": "It also needs wireless charging.\nRegards\nInfinidim", "time": "10-13-2017 01:31 AM", "replies": []}]}, {"postID": "post5951605", "text": "I obviously would. And I obviously will...once they actually release a true flagship.\nI will NOT pay flagship prices for the Nokia 8 which is NOT a flagship at all. Not by Nokia standards itself. It lacks a ton of features that are typical of a real Nokia flagship like a dedicated camera button, an AMOLED display and wireless charging. Add to that the lack of an actually good camera app and software and that's enough for me to NOT recommend anyone to pay more than 400€ for the Nokia 8.", "time": "09-01-2017 05:54 PM", "replies": [{"postID": "post5958259", "text": "Agreed.", "time": "09-05-2017 05:40 PM", "replies": []}]}, {"postID": "post5958175", "text": "I find it hard to justify paying flagship rates at all; considering midrange phones do the job just as well - for me, anyway. I find that I don't need all the extra bells and whistles that flagships often showcase. However, I guess if I liked the Nokia (or any other flagship) enough and waited for the flagship price to go down a little (maybe during the holidays or a few months into its shelf life), I'd consider buying it.", "time": "09-05-2017 04:52 PM", "replies": []}, {"postID": "post5958262", "text": "Nokia needs to do a few things. \n1) Get rid of all front branding and capacitive keys and front FPS - put that on the back. \n2) Get into the top end specs game, which includes amazing camera PERFORMANCE (not words, performance), amazing audio and amazing display quality \n3) Prove that you can push out a major firmware update within 72 hours of public release. We can nolonger pretend that you don't have access to it for a month or two in advance. \n4) Prove that you're going to support these devices for 3 years.", "time": "09-05-2017 05:41 PM", "replies": [{"postID": "post5962529", "text": "I agree with this, however:\n1) Front branding won't go away. The Nokia branding is what sells the phones in the first place. And when they're on display, the brand needs to be there for consumers to know.\n3) I've got the September security update on the Nokia 5 on the 5th of September, before Google even publish the release notes, let alone push it to Nexus and iPixel devices. So...I don't think updates are a problem. Major software updates can't be released within 72 hours. You have to ALWAYS optimise it for the hardware it's going to be working on because not all hardware is created equal.\nIf they release it within the 1st month after Google release it to OEMs, I think that's fair and pretty good.\n4) They aren't. They never said they would. They will support them for 2 years. Which is the time the European legal warranty lasts. They've always said that and so far they're doing it. Though I really doubt the Nokia 3 will get Android 9.0. But that's because of the MediaTek processor and nothing else.The build quality on the Nokia 3, 5, 6 and 8 IS on par with Nokia's standards. So the quality is there. But the Nokia 8 lacks pretty much all the hallmarks of a true Nokia flagship, yeah.", "time": "09-07-2017 03:37 PM", "replies": []}]}, {"postID": "post5962242", "text": "What Nokia had in their Lumia range should be the minimum. My L925 had wireless charging, amoled screen, nfc, excellent camera and app. These made the phone quality all those years ago and still quality now. Nokia know what they need to do to get back their fans and they need to do it.", "time": "09-07-2017 01:13 PM", "replies": [{"postID": "post5962259", "text": "That Nokia died though, we haven't seen yet if the new company can kick out a quality device. Hopefully they can", "time": "09-07-2017 01:19 PM", "replies": [{"postID": "post5962529", "text": "I agree with this, however:\n1) Front branding won't go away. The Nokia branding is what sells the phones in the first place. And when they're on display, the brand needs to be there for consumers to know.\n3) I've got the September security update on the Nokia 5 on the 5th of September, before Google even publish the release notes, let alone push it to Nexus and iPixel devices. So...I don't think updates are a problem. Major software updates can't be released within 72 hours. You have to ALWAYS optimise it for the hardware it's going to be working on because not all hardware is created equal.\nIf they release it within the 1st month after Google release it to OEMs, I think that's fair and pretty good.\n4) They aren't. They never said they would. They will support them for 2 years. Which is the time the European legal warranty lasts. They've always said that and so far they're doing it. Though I really doubt the Nokia 3 will get Android 9.0. But that's because of the MediaTek processor and nothing else.The build quality on the Nokia 3, 5, 6 and 8 IS on par with Nokia's standards. So the quality is there. But the Nokia 8 lacks pretty much all the hallmarks of a true Nokia flagship, yeah.", "time": "09-07-2017 03:37 PM", "replies": []}]}]}, {"postID": "post5962534", "text": "I'd challenge then to make a phone that turns heads for reasons other than a logo.", "time": "09-07-2017 03:39 PM", "replies": []}, {"postID": "post5962907", "text": "That won't happen as long as there are bezels on the front of the phone.\nI have zero problems with branding on the front. I've a bigger issue with the lack of innovation on a phone.", "time": "09-07-2017 07:22 PM", "replies": []}, {"postID": "post5963678", "text": "Bezels I can live with as long as they are not too big. If anything I wish some of these new phones coming out would be slightly wider and a little less tall. I'd rather have extra screen real estate on the sides vs top to bottom. Not a fan of the narrow look", "time": "09-08-2017 07:01 AM", "replies": []}, {"postID": "post5965390", "text": "I'm more than willing to buy it.\nSwitching from W10M here, and in fact, I'm in the US so which market should I look at to buy it cheapest should it not come to my country? Which, so far, it doesn't look like it will...\nCurrently, I held out on switching to android because all of the phones always lacked something I consider important, this phone checks all of the boxes for me...\nLCD screen, good looks (I like some bezel on the top and bottom), battery of at least 3000mAh, internals that will last comparatively so, stock Android, etc.\nJust my luck that it probably won't be available in the US, and next year's update will likely follow the bezel-less trend (which isn't so bad) with an AMOLED screen (which is bad to me).", "time": "09-09-2017 02:10 AM", "replies": [{"postID": "post5967815", "text": "The Nokia 8 will be made available in the US. You should expect it by Christmas time though, since the US market isn't a priority for HMD (understandably so).\nIf you want to import it...I think it will be really irrelevant. The phone is overpriced in Europe and overpriced in the UK. And both the Euro and the British Pound are worth more than the Dollar which means you really have to look at which currency is offering the better exchange rate and from where will you pay less import taxes when getting it from the US.", "time": "09-10-2017 04:58 PM", "replies": []}, {"postID": "post5986255", "text": "I switch from a Lumia 950 to the Nokia 6 and have been very happy, the performance is good and seems to get better each security update we get and the camera's are good but not exceptional. Battery seems to last very well even under heavy usage. \nRegards\nInfinidim", "time": "09-21-2017 08:44 AM", "replies": []}]}, {"postID": "post5978907", "text": "I don't understand why so many people don't think it's a flagship.\nIt just have the best LCD of the market, the best signal reception on the market and a very nice technology of audio recording. \nFrom this generation, I think the best overall phones are U11 and Nokia 8.", "time": "09-16-2017 09:33 PM", "replies": [{"postID": "post5979035", "text": "The best LCD on the market? Far from it. Where did you get that idea?", "time": "09-16-2017 11:29 PM", "replies": [{"postID": "post5986416", "text": "I think it's a bit early to put that this or that phone is the best of 2017. Nokia 9, Mate 10 and Pixel 2 are still coming.\nLCD on Nokia 8 has the highest brightness on nits ever seen on a screen. Only Note 8 has a higher better brightness. HDR and other technologies are welcome. But, when you are under sunlight and can't see the manual controls from your camera because the screen is dim... Well... I prefer a screen with higher brightness always.\nOn software side, I like android pure over heavy TouchWiz or ****ty Bixby anyday.\nOn cell signal reception, it's just better than the others (or as good as some other few smartphones, as Motorola and Huawei - LG and Samsung are always not too good in that department). Of course you can evaluate it, if you got another phone with the same service sim card on the side. Look at the technology they applied to get a better reception. If you're always on the center of big cities, good for you (in that case). But if you travel a lot or work in big buildings with a lot of concrete walls, that make all the difference.", "time": "09-21-2017 10:37 AM", "replies": [{"postID": "post5986534", "text": "The Nokia 8 has the same peak brightness as the iPhone 7. The iPhone 7, pending reviews on the iPhone 8, is the undisputed king of LCD displays. The iPhone 7 is more accurate and supports better and more color gamuts than the Nokia 8.", "time": "09-21-2017 11:39 AM", "replies": [{"postID": "post5986868", "text": "Nice. iPhone screens are really good.\nBut it's iOS.", "time": "09-21-2017 02:56 PM", "replies": []}]}, {"postID": "post5989375", "text": "I'm not expecting the Nokia 9 to come in 2017. It *may* be presented still this year, but I wouldn't expect it in 2017 IF it ever comes (HMD is in the process of getting a new CEO and the new one might not be so permissive with lackluster phones like the Nokias 3, 5, 6 and 8 with the Nokia brand in them. And depending on how much the Nokia 9 changed from the plans, it might or might not actually be canceled).This is absolutely false.\nThe Nokia 8 clocks at 700 nits.\nThe S8 alone (NOT the Note 8) clocks at over 1000 nits.\nThe Note 8 at 1200 nits.\nSo yeah, LCD is terrible for sunlight readability. And if you indeed want to see the contents of your screen under sunlight...you'll be buying an S8 or Note 8 instead. Or, you know, any OLED phone. (If you want to learn more about OLED vs LCD, DisplayMate has an array of pretty good articles on the matter).That is personal preference.\nI prefer phones without an incomplete version of Android. \nFor example, when I use split screen, I prefer to have an option on the bottom part of the screen to open another app from there instead of having to leave to the home screen, then look for the app I want, then click to open it and then the screen splits in two again as it happens with stock Android.\nOr be able to open a theme engine and change the horrible colours Google picks for user interfaces.\nOr having a blue-light filter built into the phone system that turns on automatically at the time I set it to turn, without needing third party, battery-consuming apps.\nEtc etc.\n(Oh and you can disable Bixby now anyway. And with effort, remap it to turn it into a useful button).Your claims on this are completely unsubstantiated.\nIf we're going to make random claims, then I can also use science to tell you that the Nokia 8 has a higher chance of terrible reception because the entire phone is made of aluminium instead of glass or plastic or anything else. With aluminium phones, the phone's reception is limited to the antenna bands, which limits its reception power. So I'm willing to wage that reception is better on phones without aluminium unibodies.\nBut again, none of that will depend exclusively on the phone. It depends more on your carrier and the places you go to. If you go to massive concrete buildings, your reception will be terrible or actually non-existent unless your carrier has service built into that building. Which is what happens a lot here in Europe. Because we have a ton of castles, palaces and colossal stone buildings, when companies have their offices in them, they have to hire a carrier to support the building with cell signal otherwise physics will prevent most phones from functioning because the walls stop the signal from the satellites and the antennas outside.\nListen, mate.\nYou CAN like the Nokia 8. It's totally fine. I really like the S7 even though I still don't like Samsung and I hate that the bloody thing lacks a camera button or double tap to wake. And despite the quality of the fingerprint scanner glass being crap. But I accept those as faults.\nYou can like the Nokia 8 because it offers you stock Android and you like that barebones version of the OS. You can like it because you prefer the cold feel of a metal phone. But to try to dismiss the many many faults the Nokia 8 has (specially considering Nokia's previous flagships), and use false arguments to defend it is just silly.\nI can assure you no one, absolutely NO ONE inside Android Central (or, actually, probably inside all the Mobile Nations websites) would be willing to go around singing the praises of these new Nokia phones than myself. But I will not go as low as to deny facts just to praise HMD for a poorly done job.\nThe build quality on the Nokia 8 (like the 6, 5 and 3) is great, yes. The LCD's are good FOR AN LCD. But that's it. That's as much as I can praise these phones. Because everything else is just \"meh\". And the Nokia 8 being called a \"flagship\" is an insult to the Nokia brand it brings in it.", "time": "09-23-2017 12:38 PM", "replies": [{"postID": "post5990308", "text": "I know it's not a perfect phone. For my taste, it's good!\nAbout the display stuff, not every LCD is worse than any OLED screen. For example, 1+5 LED screen sucks. Ok, it has true blacks, but its brightness capabilities sucks. Surely, you can read under sunlight better with Nokia 8 than 1+5. About the last generation of amoled screen from Note 8 and S8, I don't disagree. They are truly better than anything else on the market.\nAbout the reception stuff, their work to make a phone capable of better reception is commendable. I know everything involved on cell signal reception, and I also know that many mainstream companies just don't give much attention to that, considering that almost everyone is near a big antenna nowadays. You can spend a lot on the lastest Samsung/LG flagships, and you will discover that Motorola and Huawei phones, on the same location, under the same circumstances, using the same SIM cards, just have a better reception. I work on hospitals and I like to travel to long distanced beaches. These are locations where not every smartphone have good reception, and I have to praise when someone do efforts in this direction.", "time": "09-24-2017 06:52 AM", "replies": []}]}, {"postID": "post5989375", "text": "I'm not expecting the Nokia 9 to come in 2017. It *may* be presented still this year, but I wouldn't expect it in 2017 IF it ever comes (HMD is in the process of getting a new CEO and the new one might not be so permissive with lackluster phones like the Nokias 3, 5, 6 and 8 with the Nokia brand in them. And depending on how much the Nokia 9 changed from the plans, it might or might not actually be canceled).This is absolutely false.\nThe Nokia 8 clocks at 700 nits.\nThe S8 alone (NOT the Note 8) clocks at over 1000 nits.\nThe Note 8 at 1200 nits.\nSo yeah, LCD is terrible for sunlight readability. And if you indeed want to see the contents of your screen under sunlight...you'll be buying an S8 or Note 8 instead. Or, you know, any OLED phone. (If you want to learn more about OLED vs LCD, DisplayMate has an array of pretty good articles on the matter).That is personal preference.\nI prefer phones without an incomplete version of Android. \nFor example, when I use split screen, I prefer to have an option on the bottom part of the screen to open another app from there instead of having to leave to the home screen, then look for the app I want, then click to open it and then the screen splits in two again as it happens with stock Android.\nOr be able to open a theme engine and change the horrible colours Google picks for user interfaces.\nOr having a blue-light filter built into the phone system that turns on automatically at the time I set it to turn, without needing third party, battery-consuming apps.\nEtc etc.\n(Oh and you can disable Bixby now anyway. And with effort, remap it to turn it into a useful button).Your claims on this are completely unsubstantiated.\nIf we're going to make random claims, then I can also use science to tell you that the Nokia 8 has a higher chance of terrible reception because the entire phone is made of aluminium instead of glass or plastic or anything else. With aluminium phones, the phone's reception is limited to the antenna bands, which limits its reception power. So I'm willing to wage that reception is better on phones without aluminium unibodies.\nBut again, none of that will depend exclusively on the phone. It depends more on your carrier and the places you go to. If you go to massive concrete buildings, your reception will be terrible or actually non-existent unless your carrier has service built into that building. Which is what happens a lot here in Europe. Because we have a ton of castles, palaces and colossal stone buildings, when companies have their offices in them, they have to hire a carrier to support the building with cell signal otherwise physics will prevent most phones from functioning because the walls stop the signal from the satellites and the antennas outside.\nListen, mate.\nYou CAN like the Nokia 8. It's totally fine. I really like the S7 even though I still don't like Samsung and I hate that the bloody thing lacks a camera button or double tap to wake. And despite the quality of the fingerprint scanner glass being crap. But I accept those as faults.\nYou can like the Nokia 8 because it offers you stock Android and you like that barebones version of the OS. You can like it because you prefer the cold feel of a metal phone. But to try to dismiss the many many faults the Nokia 8 has (specially considering Nokia's previous flagships), and use false arguments to defend it is just silly.\nI can assure you no one, absolutely NO ONE inside Android Central (or, actually, probably inside all the Mobile Nations websites) would be willing to go around singing the praises of these new Nokia phones than myself. But I will not go as low as to deny facts just to praise HMD for a poorly done job.\nThe build quality on the Nokia 8 (like the 6, 5 and 3) is great, yes. The LCD's are good FOR AN LCD. But that's it. That's as much as I can praise these phones. Because everything else is just \"meh\". And the Nokia 8 being called a \"flagship\" is an insult to the Nokia brand it brings in it.", "time": "09-23-2017 12:38 PM", "replies": [{"postID": "post5990308", "text": "I know it's not a perfect phone. For my taste, it's good!\nAbout the display stuff, not every LCD is worse than any OLED screen. For example, 1+5 LED screen sucks. Ok, it has true blacks, but its brightness capabilities sucks. Surely, you can read under sunlight better with Nokia 8 than 1+5. About the last generation of amoled screen from Note 8 and S8, I don't disagree. They are truly better than anything else on the market.\nAbout the reception stuff, their work to make a phone capable of better reception is commendable. I know everything involved on cell signal reception, and I also know that many mainstream companies just don't give much attention to that, considering that almost everyone is near a big antenna nowadays. You can spend a lot on the lastest Samsung/LG flagships, and you will discover that Motorola and Huawei phones, on the same location, under the same circumstances, using the same SIM cards, just have a better reception. I work on hospitals and I like to travel to long distanced beaches. These are locations where not every smartphone have good reception, and I have to praise when someone do efforts in this direction.", "time": "09-24-2017 06:52 AM", "replies": []}]}, {"postID": "post5989375", "text": "I'm not expecting the Nokia 9 to come in 2017. It *may* be presented still this year, but I wouldn't expect it in 2017 IF it ever comes (HMD is in the process of getting a new CEO and the new one might not be so permissive with lackluster phones like the Nokias 3, 5, 6 and 8 with the Nokia brand in them. And depending on how much the Nokia 9 changed from the plans, it might or might not actually be canceled).This is absolutely false.\nThe Nokia 8 clocks at 700 nits.\nThe S8 alone (NOT the Note 8) clocks at over 1000 nits.\nThe Note 8 at 1200 nits.\nSo yeah, LCD is terrible for sunlight readability. And if you indeed want to see the contents of your screen under sunlight...you'll be buying an S8 or Note 8 instead. Or, you know, any OLED phone. (If you want to learn more about OLED vs LCD, DisplayMate has an array of pretty good articles on the matter).That is personal preference.\nI prefer phones without an incomplete version of Android. \nFor example, when I use split screen, I prefer to have an option on the bottom part of the screen to open another app from there instead of having to leave to the home screen, then look for the app I want, then click to open it and then the screen splits in two again as it happens with stock Android.\nOr be able to open a theme engine and change the horrible colours Google picks for user interfaces.\nOr having a blue-light filter built into the phone system that turns on automatically at the time I set it to turn, without needing third party, battery-consuming apps.\nEtc etc.\n(Oh and you can disable Bixby now anyway. And with effort, remap it to turn it into a useful button).Your claims on this are completely unsubstantiated.\nIf we're going to make random claims, then I can also use science to tell you that the Nokia 8 has a higher chance of terrible reception because the entire phone is made of aluminium instead of glass or plastic or anything else. With aluminium phones, the phone's reception is limited to the antenna bands, which limits its reception power. So I'm willing to wage that reception is better on phones without aluminium unibodies.\nBut again, none of that will depend exclusively on the phone. It depends more on your carrier and the places you go to. If you go to massive concrete buildings, your reception will be terrible or actually non-existent unless your carrier has service built into that building. Which is what happens a lot here in Europe. Because we have a ton of castles, palaces and colossal stone buildings, when companies have their offices in them, they have to hire a carrier to support the building with cell signal otherwise physics will prevent most phones from functioning because the walls stop the signal from the satellites and the antennas outside.\nListen, mate.\nYou CAN like the Nokia 8. It's totally fine. I really like the S7 even though I still don't like Samsung and I hate that the bloody thing lacks a camera button or double tap to wake. And despite the quality of the fingerprint scanner glass being crap. But I accept those as faults.\nYou can like the Nokia 8 because it offers you stock Android and you like that barebones version of the OS. You can like it because you prefer the cold feel of a metal phone. But to try to dismiss the many many faults the Nokia 8 has (specially considering Nokia's previous flagships), and use false arguments to defend it is just silly.\nI can assure you no one, absolutely NO ONE inside Android Central (or, actually, probably inside all the Mobile Nations websites) would be willing to go around singing the praises of these new Nokia phones than myself. But I will not go as low as to deny facts just to praise HMD for a poorly done job.\nThe build quality on the Nokia 8 (like the 6, 5 and 3) is great, yes. The LCD's are good FOR AN LCD. But that's it. That's as much as I can praise these phones. Because everything else is just \"meh\". And the Nokia 8 being called a \"flagship\" is an insult to the Nokia brand it brings in it.", "time": "09-23-2017 12:38 PM", "replies": [{"postID": "post5990308", "text": "I know it's not a perfect phone. For my taste, it's good!\nAbout the display stuff, not every LCD is worse than any OLED screen. For example, 1+5 LED screen sucks. Ok, it has true blacks, but its brightness capabilities sucks. Surely, you can read under sunlight better with Nokia 8 than 1+5. About the last generation of amoled screen from Note 8 and S8, I don't disagree. They are truly better than anything else on the market.\nAbout the reception stuff, their work to make a phone capable of better reception is commendable. I know everything involved on cell signal reception, and I also know that many mainstream companies just don't give much attention to that, considering that almost everyone is near a big antenna nowadays. You can spend a lot on the lastest Samsung/LG flagships, and you will discover that Motorola and Huawei phones, on the same location, under the same circumstances, using the same SIM cards, just have a better reception. I work on hospitals and I like to travel to long distanced beaches. These are locations where not every smartphone have good reception, and I have to praise when someone do efforts in this direction.", "time": "09-24-2017 06:52 AM", "replies": []}]}, {"postID": "post5989375", "text": "I'm not expecting the Nokia 9 to come in 2017. It *may* be presented still this year, but I wouldn't expect it in 2017 IF it ever comes (HMD is in the process of getting a new CEO and the new one might not be so permissive with lackluster phones like the Nokias 3, 5, 6 and 8 with the Nokia brand in them. And depending on how much the Nokia 9 changed from the plans, it might or might not actually be canceled).This is absolutely false.\nThe Nokia 8 clocks at 700 nits.\nThe S8 alone (NOT the Note 8) clocks at over 1000 nits.\nThe Note 8 at 1200 nits.\nSo yeah, LCD is terrible for sunlight readability. And if you indeed want to see the contents of your screen under sunlight...you'll be buying an S8 or Note 8 instead. Or, you know, any OLED phone. (If you want to learn more about OLED vs LCD, DisplayMate has an array of pretty good articles on the matter).That is personal preference.\nI prefer phones without an incomplete version of Android. \nFor example, when I use split screen, I prefer to have an option on the bottom part of the screen to open another app from there instead of having to leave to the home screen, then look for the app I want, then click to open it and then the screen splits in two again as it happens with stock Android.\nOr be able to open a theme engine and change the horrible colours Google picks for user interfaces.\nOr having a blue-light filter built into the phone system that turns on automatically at the time I set it to turn, without needing third party, battery-consuming apps.\nEtc etc.\n(Oh and you can disable Bixby now anyway. And with effort, remap it to turn it into a useful button).Your claims on this are completely unsubstantiated.\nIf we're going to make random claims, then I can also use science to tell you that the Nokia 8 has a higher chance of terrible reception because the entire phone is made of aluminium instead of glass or plastic or anything else. With aluminium phones, the phone's reception is limited to the antenna bands, which limits its reception power. So I'm willing to wage that reception is better on phones without aluminium unibodies.\nBut again, none of that will depend exclusively on the phone. It depends more on your carrier and the places you go to. If you go to massive concrete buildings, your reception will be terrible or actually non-existent unless your carrier has service built into that building. Which is what happens a lot here in Europe. Because we have a ton of castles, palaces and colossal stone buildings, when companies have their offices in them, they have to hire a carrier to support the building with cell signal otherwise physics will prevent most phones from functioning because the walls stop the signal from the satellites and the antennas outside.\nListen, mate.\nYou CAN like the Nokia 8. It's totally fine. I really like the S7 even though I still don't like Samsung and I hate that the bloody thing lacks a camera button or double tap to wake. And despite the quality of the fingerprint scanner glass being crap. But I accept those as faults.\nYou can like the Nokia 8 because it offers you stock Android and you like that barebones version of the OS. You can like it because you prefer the cold feel of a metal phone. But to try to dismiss the many many faults the Nokia 8 has (specially considering Nokia's previous flagships), and use false arguments to defend it is just silly.\nI can assure you no one, absolutely NO ONE inside Android Central (or, actually, probably inside all the Mobile Nations websites) would be willing to go around singing the praises of these new Nokia phones than myself. But I will not go as low as to deny facts just to praise HMD for a poorly done job.\nThe build quality on the Nokia 8 (like the 6, 5 and 3) is great, yes. The LCD's are good FOR AN LCD. But that's it. That's as much as I can praise these phones. Because everything else is just \"meh\". And the Nokia 8 being called a \"flagship\" is an insult to the Nokia brand it brings in it.", "time": "09-23-2017 12:38 PM", "replies": [{"postID": "post5990308", "text": "I know it's not a perfect phone. For my taste, it's good!\nAbout the display stuff, not every LCD is worse than any OLED screen. For example, 1+5 LED screen sucks. Ok, it has true blacks, but its brightness capabilities sucks. Surely, you can read under sunlight better with Nokia 8 than 1+5. About the last generation of amoled screen from Note 8 and S8, I don't disagree. They are truly better than anything else on the market.\nAbout the reception stuff, their work to make a phone capable of better reception is commendable. I know everything involved on cell signal reception, and I also know that many mainstream companies just don't give much attention to that, considering that almost everyone is near a big antenna nowadays. You can spend a lot on the lastest Samsung/LG flagships, and you will discover that Motorola and Huawei phones, on the same location, under the same circumstances, using the same SIM cards, just have a better reception. I work on hospitals and I like to travel to long distanced beaches. These are locations where not every smartphone have good reception, and I have to praise when someone do efforts in this direction.", "time": "09-24-2017 06:52 AM", "replies": []}]}]}]}, {"postID": "post5985788", "text": "Compare it to the features offered on Nokia's last real flagship - the Nokia 930 - and with other 2017 flagships - S8, G6, etc - and I think you'll realise why.\n\"Best LCD of the market\"...that is very subjective. Sony's LCD's have HDR. This doesn't. And the best LCD is still not as good as AMOLED (which Nokia used in all their flagships since 2013).\n\"Best signal reception\"...based on which data? That's the sort of thing you can't objectively evaluate because it changes from country to country, city to city.\nAudio recording technology is nice, yes. Still, the Nokia 6 supports Dolby Atmos and the Nokia 8 doesn't? Don't you find that weird?\n\"I think the best overall phones are U11 and Nokia 8.\"\nTo each their own.\nI personally find those exact two phones the worst overall phones of 2017 ¯\\_(ツ)_/¯", "time": "09-20-2017 10:04 PM", "replies": [{"postID": "post5986416", "text": "I think it's a bit early to put that this or that phone is the best of 2017. Nokia 9, Mate 10 and Pixel 2 are still coming.\nLCD on Nokia 8 has the highest brightness on nits ever seen on a screen. Only Note 8 has a higher better brightness. HDR and other technologies are welcome. But, when you are under sunlight and can't see the manual controls from your camera because the screen is dim... Well... I prefer a screen with higher brightness always.\nOn software side, I like android pure over heavy TouchWiz or ****ty Bixby anyday.\nOn cell signal reception, it's just better than the others (or as good as some other few smartphones, as Motorola and Huawei - LG and Samsung are always not too good in that department). Of course you can evaluate it, if you got another phone with the same service sim card on the side. Look at the technology they applied to get a better reception. If you're always on the center of big cities, good for you (in that case). But if you travel a lot or work in big buildings with a lot of concrete walls, that make all the difference.", "time": "09-21-2017 10:37 AM", "replies": [{"postID": "post5986534", "text": "The Nokia 8 has the same peak brightness as the iPhone 7. The iPhone 7, pending reviews on the iPhone 8, is the undisputed king of LCD displays. The iPhone 7 is more accurate and supports better and more color gamuts than the Nokia 8.", "time": "09-21-2017 11:39 AM", "replies": [{"postID": "post5986868", "text": "Nice. iPhone screens are really good.\nBut it's iOS.", "time": "09-21-2017 02:56 PM", "replies": []}]}, {"postID": "post5989375", "text": "I'm not expecting the Nokia 9 to come in 2017. It *may* be presented still this year, but I wouldn't expect it in 2017 IF it ever comes (HMD is in the process of getting a new CEO and the new one might not be so permissive with lackluster phones like the Nokias 3, 5, 6 and 8 with the Nokia brand in them. And depending on how much the Nokia 9 changed from the plans, it might or might not actually be canceled).This is absolutely false.\nThe Nokia 8 clocks at 700 nits.\nThe S8 alone (NOT the Note 8) clocks at over 1000 nits.\nThe Note 8 at 1200 nits.\nSo yeah, LCD is terrible for sunlight readability. And if you indeed want to see the contents of your screen under sunlight...you'll be buying an S8 or Note 8 instead. Or, you know, any OLED phone. (If you want to learn more about OLED vs LCD, DisplayMate has an array of pretty good articles on the matter).That is personal preference.\nI prefer phones without an incomplete version of Android. \nFor example, when I use split screen, I prefer to have an option on the bottom part of the screen to open another app from there instead of having to leave to the home screen, then look for the app I want, then click to open it and then the screen splits in two again as it happens with stock Android.\nOr be able to open a theme engine and change the horrible colours Google picks for user interfaces.\nOr having a blue-light filter built into the phone system that turns on automatically at the time I set it to turn, without needing third party, battery-consuming apps.\nEtc etc.\n(Oh and you can disable Bixby now anyway. And with effort, remap it to turn it into a useful button).Your claims on this are completely unsubstantiated.\nIf we're going to make random claims, then I can also use science to tell you that the Nokia 8 has a higher chance of terrible reception because the entire phone is made of aluminium instead of glass or plastic or anything else. With aluminium phones, the phone's reception is limited to the antenna bands, which limits its reception power. So I'm willing to wage that reception is better on phones without aluminium unibodies.\nBut again, none of that will depend exclusively on the phone. It depends more on your carrier and the places you go to. If you go to massive concrete buildings, your reception will be terrible or actually non-existent unless your carrier has service built into that building. Which is what happens a lot here in Europe. Because we have a ton of castles, palaces and colossal stone buildings, when companies have their offices in them, they have to hire a carrier to support the building with cell signal otherwise physics will prevent most phones from functioning because the walls stop the signal from the satellites and the antennas outside.\nListen, mate.\nYou CAN like the Nokia 8. It's totally fine. I really like the S7 even though I still don't like Samsung and I hate that the bloody thing lacks a camera button or double tap to wake. And despite the quality of the fingerprint scanner glass being crap. But I accept those as faults.\nYou can like the Nokia 8 because it offers you stock Android and you like that barebones version of the OS. You can like it because you prefer the cold feel of a metal phone. But to try to dismiss the many many faults the Nokia 8 has (specially considering Nokia's previous flagships), and use false arguments to defend it is just silly.\nI can assure you no one, absolutely NO ONE inside Android Central (or, actually, probably inside all the Mobile Nations websites) would be willing to go around singing the praises of these new Nokia phones than myself. But I will not go as low as to deny facts just to praise HMD for a poorly done job.\nThe build quality on the Nokia 8 (like the 6, 5 and 3) is great, yes. The LCD's are good FOR AN LCD. But that's it. That's as much as I can praise these phones. Because everything else is just \"meh\". And the Nokia 8 being called a \"flagship\" is an insult to the Nokia brand it brings in it.", "time": "09-23-2017 12:38 PM", "replies": [{"postID": "post5990308", "text": "I know it's not a perfect phone. For my taste, it's good!\nAbout the display stuff, not every LCD is worse than any OLED screen. For example, 1+5 LED screen sucks. Ok, it has true blacks, but its brightness capabilities sucks. Surely, you can read under sunlight better with Nokia 8 than 1+5. About the last generation of amoled screen from Note 8 and S8, I don't disagree. They are truly better than anything else on the market.\nAbout the reception stuff, their work to make a phone capable of better reception is commendable. I know everything involved on cell signal reception, and I also know that many mainstream companies just don't give much attention to that, considering that almost everyone is near a big antenna nowadays. You can spend a lot on the lastest Samsung/LG flagships, and you will discover that Motorola and Huawei phones, on the same location, under the same circumstances, using the same SIM cards, just have a better reception. I work on hospitals and I like to travel to long distanced beaches. These are locations where not every smartphone have good reception, and I have to praise when someone do efforts in this direction.", "time": "09-24-2017 06:52 AM", "replies": []}]}, {"postID": "post5989375", "text": "I'm not expecting the Nokia 9 to come in 2017. It *may* be presented still this year, but I wouldn't expect it in 2017 IF it ever comes (HMD is in the process of getting a new CEO and the new one might not be so permissive with lackluster phones like the Nokias 3, 5, 6 and 8 with the Nokia brand in them. And depending on how much the Nokia 9 changed from the plans, it might or might not actually be canceled).This is absolutely false.\nThe Nokia 8 clocks at 700 nits.\nThe S8 alone (NOT the Note 8) clocks at over 1000 nits.\nThe Note 8 at 1200 nits.\nSo yeah, LCD is terrible for sunlight readability. And if you indeed want to see the contents of your screen under sunlight...you'll be buying an S8 or Note 8 instead. Or, you know, any OLED phone. (If you want to learn more about OLED vs LCD, DisplayMate has an array of pretty good articles on the matter).That is personal preference.\nI prefer phones without an incomplete version of Android. \nFor example, when I use split screen, I prefer to have an option on the bottom part of the screen to open another app from there instead of having to leave to the home screen, then look for the app I want, then click to open it and then the screen splits in two again as it happens with stock Android.\nOr be able to open a theme engine and change the horrible colours Google picks for user interfaces.\nOr having a blue-light filter built into the phone system that turns on automatically at the time I set it to turn, without needing third party, battery-consuming apps.\nEtc etc.\n(Oh and you can disable Bixby now anyway. And with effort, remap it to turn it into a useful button).Your claims on this are completely unsubstantiated.\nIf we're going to make random claims, then I can also use science to tell you that the Nokia 8 has a higher chance of terrible reception because the entire phone is made of aluminium instead of glass or plastic or anything else. With aluminium phones, the phone's reception is limited to the antenna bands, which limits its reception power. So I'm willing to wage that reception is better on phones without aluminium unibodies.\nBut again, none of that will depend exclusively on the phone. It depends more on your carrier and the places you go to. If you go to massive concrete buildings, your reception will be terrible or actually non-existent unless your carrier has service built into that building. Which is what happens a lot here in Europe. Because we have a ton of castles, palaces and colossal stone buildings, when companies have their offices in them, they have to hire a carrier to support the building with cell signal otherwise physics will prevent most phones from functioning because the walls stop the signal from the satellites and the antennas outside.\nListen, mate.\nYou CAN like the Nokia 8. It's totally fine. I really like the S7 even though I still don't like Samsung and I hate that the bloody thing lacks a camera button or double tap to wake. And despite the quality of the fingerprint scanner glass being crap. But I accept those as faults.\nYou can like the Nokia 8 because it offers you stock Android and you like that barebones version of the OS. You can like it because you prefer the cold feel of a metal phone. But to try to dismiss the many many faults the Nokia 8 has (specially considering Nokia's previous flagships), and use false arguments to defend it is just silly.\nI can assure you no one, absolutely NO ONE inside Android Central (or, actually, probably inside all the Mobile Nations websites) would be willing to go around singing the praises of these new Nokia phones than myself. But I will not go as low as to deny facts just to praise HMD for a poorly done job.\nThe build quality on the Nokia 8 (like the 6, 5 and 3) is great, yes. The LCD's are good FOR AN LCD. But that's it. That's as much as I can praise these phones. Because everything else is just \"meh\". And the Nokia 8 being called a \"flagship\" is an insult to the Nokia brand it brings in it.", "time": "09-23-2017 12:38 PM", "replies": [{"postID": "post5990308", "text": "I know it's not a perfect phone. For my taste, it's good!\nAbout the display stuff, not every LCD is worse than any OLED screen. For example, 1+5 LED screen sucks. Ok, it has true blacks, but its brightness capabilities sucks. Surely, you can read under sunlight better with Nokia 8 than 1+5. About the last generation of amoled screen from Note 8 and S8, I don't disagree. They are truly better than anything else on the market.\nAbout the reception stuff, their work to make a phone capable of better reception is commendable. I know everything involved on cell signal reception, and I also know that many mainstream companies just don't give much attention to that, considering that almost everyone is near a big antenna nowadays. You can spend a lot on the lastest Samsung/LG flagships, and you will discover that Motorola and Huawei phones, on the same location, under the same circumstances, using the same SIM cards, just have a better reception. I work on hospitals and I like to travel to long distanced beaches. These are locations where not every smartphone have good reception, and I have to praise when someone do efforts in this direction.", "time": "09-24-2017 06:52 AM", "replies": []}]}, {"postID": "post5989375", "text": "I'm not expecting the Nokia 9 to come in 2017. It *may* be presented still this year, but I wouldn't expect it in 2017 IF it ever comes (HMD is in the process of getting a new CEO and the new one might not be so permissive with lackluster phones like the Nokias 3, 5, 6 and 8 with the Nokia brand in them. And depending on how much the Nokia 9 changed from the plans, it might or might not actually be canceled).This is absolutely false.\nThe Nokia 8 clocks at 700 nits.\nThe S8 alone (NOT the Note 8) clocks at over 1000 nits.\nThe Note 8 at 1200 nits.\nSo yeah, LCD is terrible for sunlight readability. And if you indeed want to see the contents of your screen under sunlight...you'll be buying an S8 or Note 8 instead. Or, you know, any OLED phone. (If you want to learn more about OLED vs LCD, DisplayMate has an array of pretty good articles on the matter).That is personal preference.\nI prefer phones without an incomplete version of Android. \nFor example, when I use split screen, I prefer to have an option on the bottom part of the screen to open another app from there instead of having to leave to the home screen, then look for the app I want, then click to open it and then the screen splits in two again as it happens with stock Android.\nOr be able to open a theme engine and change the horrible colours Google picks for user interfaces.\nOr having a blue-light filter built into the phone system that turns on automatically at the time I set it to turn, without needing third party, battery-consuming apps.\nEtc etc.\n(Oh and you can disable Bixby now anyway. And with effort, remap it to turn it into a useful button).Your claims on this are completely unsubstantiated.\nIf we're going to make random claims, then I can also use science to tell you that the Nokia 8 has a higher chance of terrible reception because the entire phone is made of aluminium instead of glass or plastic or anything else. With aluminium phones, the phone's reception is limited to the antenna bands, which limits its reception power. So I'm willing to wage that reception is better on phones without aluminium unibodies.\nBut again, none of that will depend exclusively on the phone. It depends more on your carrier and the places you go to. If you go to massive concrete buildings, your reception will be terrible or actually non-existent unless your carrier has service built into that building. Which is what happens a lot here in Europe. Because we have a ton of castles, palaces and colossal stone buildings, when companies have their offices in them, they have to hire a carrier to support the building with cell signal otherwise physics will prevent most phones from functioning because the walls stop the signal from the satellites and the antennas outside.\nListen, mate.\nYou CAN like the Nokia 8. It's totally fine. I really like the S7 even though I still don't like Samsung and I hate that the bloody thing lacks a camera button or double tap to wake. And despite the quality of the fingerprint scanner glass being crap. But I accept those as faults.\nYou can like the Nokia 8 because it offers you stock Android and you like that barebones version of the OS. You can like it because you prefer the cold feel of a metal phone. But to try to dismiss the many many faults the Nokia 8 has (specially considering Nokia's previous flagships), and use false arguments to defend it is just silly.\nI can assure you no one, absolutely NO ONE inside Android Central (or, actually, probably inside all the Mobile Nations websites) would be willing to go around singing the praises of these new Nokia phones than myself. But I will not go as low as to deny facts just to praise HMD for a poorly done job.\nThe build quality on the Nokia 8 (like the 6, 5 and 3) is great, yes. The LCD's are good FOR AN LCD. But that's it. That's as much as I can praise these phones. Because everything else is just \"meh\". And the Nokia 8 being called a \"flagship\" is an insult to the Nokia brand it brings in it.", "time": "09-23-2017 12:38 PM", "replies": [{"postID": "post5990308", "text": "I know it's not a perfect phone. For my taste, it's good!\nAbout the display stuff, not every LCD is worse than any OLED screen. For example, 1+5 LED screen sucks. Ok, it has true blacks, but its brightness capabilities sucks. Surely, you can read under sunlight better with Nokia 8 than 1+5. About the last generation of amoled screen from Note 8 and S8, I don't disagree. They are truly better than anything else on the market.\nAbout the reception stuff, their work to make a phone capable of better reception is commendable. I know everything involved on cell signal reception, and I also know that many mainstream companies just don't give much attention to that, considering that almost everyone is near a big antenna nowadays. You can spend a lot on the lastest Samsung/LG flagships, and you will discover that Motorola and Huawei phones, on the same location, under the same circumstances, using the same SIM cards, just have a better reception. I work on hospitals and I like to travel to long distanced beaches. These are locations where not every smartphone have good reception, and I have to praise when someone do efforts in this direction.", "time": "09-24-2017 06:52 AM", "replies": []}]}, {"postID": "post5989375", "text": "I'm not expecting the Nokia 9 to come in 2017. It *may* be presented still this year, but I wouldn't expect it in 2017 IF it ever comes (HMD is in the process of getting a new CEO and the new one might not be so permissive with lackluster phones like the Nokias 3, 5, 6 and 8 with the Nokia brand in them. And depending on how much the Nokia 9 changed from the plans, it might or might not actually be canceled).This is absolutely false.\nThe Nokia 8 clocks at 700 nits.\nThe S8 alone (NOT the Note 8) clocks at over 1000 nits.\nThe Note 8 at 1200 nits.\nSo yeah, LCD is terrible for sunlight readability. And if you indeed want to see the contents of your screen under sunlight...you'll be buying an S8 or Note 8 instead. Or, you know, any OLED phone. (If you want to learn more about OLED vs LCD, DisplayMate has an array of pretty good articles on the matter).That is personal preference.\nI prefer phones without an incomplete version of Android. \nFor example, when I use split screen, I prefer to have an option on the bottom part of the screen to open another app from there instead of having to leave to the home screen, then look for the app I want, then click to open it and then the screen splits in two again as it happens with stock Android.\nOr be able to open a theme engine and change the horrible colours Google picks for user interfaces.\nOr having a blue-light filter built into the phone system that turns on automatically at the time I set it to turn, without needing third party, battery-consuming apps.\nEtc etc.\n(Oh and you can disable Bixby now anyway. And with effort, remap it to turn it into a useful button).Your claims on this are completely unsubstantiated.\nIf we're going to make random claims, then I can also use science to tell you that the Nokia 8 has a higher chance of terrible reception because the entire phone is made of aluminium instead of glass or plastic or anything else. With aluminium phones, the phone's reception is limited to the antenna bands, which limits its reception power. So I'm willing to wage that reception is better on phones without aluminium unibodies.\nBut again, none of that will depend exclusively on the phone. It depends more on your carrier and the places you go to. If you go to massive concrete buildings, your reception will be terrible or actually non-existent unless your carrier has service built into that building. Which is what happens a lot here in Europe. Because we have a ton of castles, palaces and colossal stone buildings, when companies have their offices in them, they have to hire a carrier to support the building with cell signal otherwise physics will prevent most phones from functioning because the walls stop the signal from the satellites and the antennas outside.\nListen, mate.\nYou CAN like the Nokia 8. It's totally fine. I really like the S7 even though I still don't like Samsung and I hate that the bloody thing lacks a camera button or double tap to wake. And despite the quality of the fingerprint scanner glass being crap. But I accept those as faults.\nYou can like the Nokia 8 because it offers you stock Android and you like that barebones version of the OS. You can like it because you prefer the cold feel of a metal phone. But to try to dismiss the many many faults the Nokia 8 has (specially considering Nokia's previous flagships), and use false arguments to defend it is just silly.\nI can assure you no one, absolutely NO ONE inside Android Central (or, actually, probably inside all the Mobile Nations websites) would be willing to go around singing the praises of these new Nokia phones than myself. But I will not go as low as to deny facts just to praise HMD for a poorly done job.\nThe build quality on the Nokia 8 (like the 6, 5 and 3) is great, yes. The LCD's are good FOR AN LCD. But that's it. That's as much as I can praise these phones. Because everything else is just \"meh\". And the Nokia 8 being called a \"flagship\" is an insult to the Nokia brand it brings in it.", "time": "09-23-2017 12:38 PM", "replies": [{"postID": "post5990308", "text": "I know it's not a perfect phone. For my taste, it's good!\nAbout the display stuff, not every LCD is worse than any OLED screen. For example, 1+5 LED screen sucks. Ok, it has true blacks, but its brightness capabilities sucks. Surely, you can read under sunlight better with Nokia 8 than 1+5. About the last generation of amoled screen from Note 8 and S8, I don't disagree. They are truly better than anything else on the market.\nAbout the reception stuff, their work to make a phone capable of better reception is commendable. I know everything involved on cell signal reception, and I also know that many mainstream companies just don't give much attention to that, considering that almost everyone is near a big antenna nowadays. You can spend a lot on the lastest Samsung/LG flagships, and you will discover that Motorola and Huawei phones, on the same location, under the same circumstances, using the same SIM cards, just have a better reception. I work on hospitals and I like to travel to long distanced beaches. These are locations where not every smartphone have good reception, and I have to praise when someone do efforts in this direction.", "time": "09-24-2017 06:52 AM", "replies": []}]}]}]}]}, {"postID": "post5980782", "text": "I just did! Not really bothered in getting into the is it / isn't it a flagship argument. It has some good specs - although not the highest on the market but neither is it the most expensive.\nI've switched from Windows Phone (going nowhere) to Android. What attracted me? A decent camera, close-to stock Android, good screen, a good price and good build quality.", "time": "09-18-2017 05:10 AM", "replies": [{"postID": "post5985480", "text": "Awesome, do you already have it? Any early impressions?", "time": "09-20-2017 06:34 PM", "replies": []}]}, {"postID": "post5985525", "text": "Word on the street is that the 9 is coming out soon.", "time": "09-20-2017 07:01 PM", "replies": []}, {"postID": "post5985867", "text": "HMD doesn't even think the 8 is a flagship. That's why there's a 9.", "time": "09-20-2017 11:10 PM", "replies": []}, {"postID": "post5986341", "text": "My wife needs to replace her 1520 and she thinks she wants this phone. Are we going to really see this in the USA? I bought her 6\" Alcatel on prepaid ATT to swap out SIM cards. Very sluggish and only 16g storage. This Nokia 8 appears to be the solution but company doesn't seem to be moving quickly into the Android space. Like watching BlackBerry Mobile rolling out their initial devices. USA rollout seems glacier slow..", "time": "09-21-2017 09:42 AM", "replies": []}, {"postID": "post5986430", "text": "I just read on Forbes today that the phone will also include band 4 which means it will be Verizon and Sprint compatible as well and will have 6 gigs of RAM", "time": "09-21-2017 10:43 AM", "replies": []}, {"postID": "post5990445", "text": "I totally agree with you on that. I'm sure I'm in the minority here but I still use my phone to primarily make calls as I don't have a landline anymore and my current phone the Pixel just doesn't cut it in that department for me. I need beyond good reception", "time": "09-24-2017 09:22 AM", "replies": []}, {"postID": "post5995594", "text": "I bought a Nokia 8 yesterday and so far I'm very impressed with it. I was going to hold off for the Nokia 9 but if I like it I'll probably get it anyway and sell the 8. The Nokia branding is a draw for me, in most of Europe it's a recognised and trusted brand.\nThe phone is beautiful, build quality is on par with anything Nokia have previously done and it feels like a premium device in hand. The screen is beautiful, I got 7 hours screen on time today, audio recording is excellent and it's really quick. With 64GB storage, Zeiss lens dual camera, which so far has proven to be at least equal to my LG G6, and the fact that having a Nokia in my pocket again makes me smile, I'm very very happy with it.", "time": "09-27-2017 05:34 PM", "replies": [{"postID": "post5995608", "text": "Awesome. The biggest question for me is the camera quality. If you happen to snap any particularly great pictures please share if you can. In the meantime, enjoy your new phone!", "time": "09-27-2017 05:43 PM", "replies": [{"postID": "post5995635", "text": "Thanks. I'll post some photos tomorrow.", "time": "09-27-2017 06:03 PM", "replies": [{"postID": "post5996143", "text": "Here's a couple of snaps from an overcast and damp Belfast. Just point and shoot photos, not time taken to compose, etc. I think that's the way most people will use their Nokia 8 camera.", "time": "09-28-2017 05:22 AM", "replies": []}]}, {"postID": "post5997422", "text": "I have a Nokia 8 (for a week or so). I was concerned about the camera quality as I'm coming from a Microsoft Lumia 950 (which has the best camera phone I've ever used). Currently doing a head-to-head between the two (when I get time and the crappy British weather allows). Initial impressions are: exposure, focussing and colours accurate and good. Comparable with the 950. The let down is the sharpness in less than ideal light. I think the OIS on the Lumia must be better. \nHopefully post some photos over the weekend.", "time": "09-29-2017 03:28 AM", "replies": [{"postID": "post5998546", "text": "I've had my Nokia 6 ever since they came out, I came from a Lumia 950 as well because the camera on it was going to cost more to fix than a Nokia 6 when it failed, and I have been really happy with the build quality as well as the camera. I know it's not the quality of the Nokia 8 or 9 but for a point and shoot camera it is really good.\nRegards\nInfinidim", "time": "09-30-2017 05:40 AM", "replies": []}]}]}]}, {"postID": "post5995851", "text": "I see Nokia as more flagship than most other brands, Nokia has been around for ever. They may be new to Android but they are not new to high quality phones.", "time": "09-27-2017 09:17 PM", "replies": []}, {"postID": "post5995878", "text": "I agree with you, having owned many Nokia phones back in the past. Never had any issues with the quality of their products, and always thought they were right up there with the best of the best. Long before Apple, Nokia was king. Wish they would announce the Nokia 9 already. Don't want to be in suspense much longer", "time": "09-27-2017 09:40 PM", "replies": []}, {"postID": "post5997320", "text": "Thanks for those. They look pretty decent. They're less than a MB each, so probably compressed quite a bit.", "time": "09-28-2017 11:29 PM", "replies": [{"postID": "post5997459", "text": "Yeah, they're compressed when uploaded. Overall I'm happy to use this camera though, the quality is more than acceptable.", "time": "09-29-2017 05:14 AM", "replies": []}]}, {"postID": "post6009572", "text": "Yes, in condition that it is running:\n- Symbian or related Nokia OS'es\n- MeeGo/Maemo/..\n- any other Qt/Linux-based OS\nand also\n- vanilla Android (like those HDM phones)", "time": "10-07-2017 03:42 PM", "replies": [{"postID": "post6016537", "text": "All of these are dead. No point even entertaining the idea of seeing them return.", "time": "10-12-2017 11:09 AM", "replies": []}]}, {"postID": "post6017520", "text": "Sounds like what the Nokia 9 is shaping up to be thus far. That is if anything mentioned on line is real and not a rumor or anything.", "time": "10-13-2017 05:39 AM", "replies": []}, {"postID": "post6017578", "text": "If they keep the old sensor like in the Nokia 8 and don't give us a better camera software, I really don't see a reason to prefer the Nokia over the OP5 or Xiaomi Mi6, the only change would be the name/design. \nSo far I am disappointed with the Nokia's.", "time": "10-13-2017 06:51 AM", "replies": []}, {"postID": "post6017634", "text": "Disappointed primarily for the camera reasons or the phone overall?", "time": "10-13-2017 08:02 AM", "replies": []}, {"postID": "post6017640", "text": "Nope I like every other aspect of it, I am a fan of that design, L800,N9 meego were my favorite designs, and this one is a nice way to go modern + the old design, but the camera is the part which doesn't let me buy it yet.\n1. We need full manual controls\n2. We need a Lumia alike software\n3. True Zeiss optics + leading sensor\nIf you want to have a Nokia name on your device then give the freedom to the user (that was nokia all about when they were on Symbian/WM). \nAlso the edge + 18:9 design in my eyes is just being a sheep behind samsung/lg, 16:9 with nice bezzels (something like Pixel 2 XL) is more then enough to keep me on the Nokia side.", "time": "10-13-2017 08:10 AM", "replies": []}, {"postID": "post6039142", "text": "Today I received a Polished copper Nokia 8. Other than the thick bezels, it is very much a flagship phone. Snapdragon 835, 4GB RAM, MicroSD/Dual Sim, QHD Display. It doesn't have wireless charging, but neither does the Pixel 2. Only thing it's truly missing from other flagships is IP67/68 water resistance. But it has a headphone jack. \nThe LCD is the nicest LCD I've seen on a phone. I have an iPhone 8, and LG G6 and the Nokia is better in sharpness and colours in my opinion. The iPhone 8 with true tone is very nice though. \nI agree though that I wish we could have the Nokia OLED with clearblack, and dedicated camera button. \nTo be honest I don't really care about what other flagships have, I want what NOKIA used to have with powerful internal specs. \nAlso the Nokia 8 is a fair bit cheaper online than other flagships with the exception of the Oneplus 5.", "time": "10-26-2017 12:55 AM", "replies": [{"postID": "post6039224", "text": "Awesome, when you get the time could you compare the cameras aswell? I know I am a bit boring with this question, but the respond from the reviewers is a load of BS, some give it a good, some very bad grade. And since you have/had the Iphone 8 and the G6, its quite a good comparison. Thanks", "time": "10-26-2017 02:21 AM", "replies": [{"postID": "post6039903", "text": "Yep. Once I've had more time with the phone I'll give my thoughts on the camera compared to those phones and also previous phones with Nokia tech. \nAs my Avatar suggests I'm no stranger to the awesome imaging of Nokia's past phones", "time": "10-26-2017 11:52 AM", "replies": []}, {"postID": "post6041592", "text": "Well after using it for a couple of days I can say that camera is very good. I'd say in auto mode it's equal to the LG G6, but with slightly more accurate colours. The only advantage the G6 has is full manual controls. \nIt beats the iPhone 8 camera so far. Though I haven't done any low-light stuff with the Nokia 8 yet.\nThe Live Bokeh portrait mode also works very well. I'd upload an example but I don't want to post coworkers pics on the internet. I don't take selfies so I can't really comment on the selfie cam. \nVideo is very good, and the iPhone 8 might be slightly sharper, but the OZO audio makes up for it. The OZO audio is something else!\nOverall, the camera is nothing to worry about. Hopefully they'll update the camera app to provide full manual controls, but so far I'm satisfied. It's not going to blow you away, but it's a very good start. \nI posted a thread for photos, check them out. Also check out the video I embedded to get an example of the OZO audio. \nKris", "time": "10-27-2017 01:02 PM", "replies": []}]}]}, {"postID": "post6043652", "text": "I used a nokia lumia 1020 for almost 4 years until I took out the sim card earlier today and am using the pixel 2 now. I liked the outer design of the phone and the camera quality was good for its time.. But it ran slow(apps, and especially taking pictures). Good camera, but unfortunately windows OS support, which was absolute garbage. Also I didn't know until recently that you could take low light pictures, but it wasn't on the main camera app. I thought it was awful at lowlight pictures(though it still has noise)", "time": "10-29-2017 03:56 AM", "replies": []}]}, {"title": "Nokia 8 Oreo Beta Test", "thread": [{"postID": "post6037377", "text": "This just caught my attention. Anyone going to try it?\nDetails here", "time": "10-25-2017 05:11 AM", "replies": []}, {"postID": "post6037791", "text": "Of course people are going to try it. Why not?\nBesides Pixel and Sony there aren't many devices sporting Oreo right now.", "time": "10-25-2017 10:19 AM", "replies": []}, {"postID": "post6039341", "text": "I've just downloaded it now. Seems to be working just fine for me. \nInterestingly they have added a function called 'Night Light' in the display settings. I had been running Oreo on my 5X and that option wasn't there. Thumbs up Nokia for that!\nGive it a go. Not everyone gets the chance 👍", "time": "10-26-2017 05:21 AM", "replies": []}, {"postID": "post6039613", "text": "I downloaded it this morning and have nothing to report yet. Running great on mine. Love the new lighter settings interface. Love it!", "time": "10-26-2017 09:20 AM", "replies": []}, {"postID": "post6039840", "text": "Any improvement with the camera app?", "time": "10-26-2017 11:27 AM", "replies": []}, {"postID": "post6040411", "text": "Wait for the 9! I am sure it is going to be on the pricey side, but if what has been stated in many different articles the camera is going to be improved. Some people have thought it to be software issues with the cam. Personally I would be willing and will pay more for this phone if it is a true Nokia Flagship. Coming from the original Pixel that I had from day one last year, I can't wait to get my hands on this phone. \nNokia just needs to get this out.... Especially with some of the disappointments with the screen issues with the new pixels and a few other things, it has been reported by few that they are going to be moving to Samsung or other phones and have been cancelling their orders for the Pixel 2. A lot don't have issues but I know for certain if I was paying just shy of a grand for a phone I would expect as close to perfection as one could get. Nokia should capitalize on this and get this out! It might just sway people to Nokia. Glad to hear good things about the 8. I almost wanted to go for this as well but am in the US and I decided I would stick it out for the 9\nTo those of you that own the 8, good luck! I am sure its a great phone", "time": "10-26-2017 06:59 PM", "replies": []}]}, {"title": "Nokia 8 on AT&T", "thread": [{"postID": "post6022492", "text": "If I were to get a Nokia 8 from overseas what type of service could I expect on AT&T?", "time": "10-16-2017 02:50 PM", "replies": []}]}, {"title": "Could the Nokia 8 ship with Android O", "thread": [{"postID": "post5911081", "text": "This rumor says the Nokia 8 could ship with Android ONokia 8 may run Android 8.0.0 from day one - GSMArena.com news", "time": "08-03-2017 02:40 PM", "replies": []}, {"postID": "post5911106", "text": "Definitely possible. O is supposed to become official next week and if Nokia is working extremely closely with Google it is definitely a possibility.", "time": "08-03-2017 03:01 PM", "replies": []}, {"postID": "post5921414", "text": "As nokia phones are pure andriod its possible or maybe 1st phone to get andriod O...", "time": "08-12-2017 12:03 PM", "replies": []}, {"postID": "post5921864", "text": "How are they \"pure Android\"?", "time": "08-12-2017 08:59 PM", "replies": []}, {"postID": "post5990236", "text": "No With 7.11", "time": "09-24-2017 04:44 AM", "replies": []}, {"postID": "post5991706", "text": "It would be good if it did.", "time": "09-25-2017 06:00 AM", "replies": []}, {"postID": "post6010411", "text": "Mine came with Nougat 7.1.1 and the September security patch waiting to download out of the box.", "time": "10-08-2017 06:19 AM", "replies": []}, {"postID": "post6012421", "text": "They're as close to stock Android as it's possible to be without being a Pixel or a Nexus. \nOnly time will tell how they perform with OS updates. But mine came with Nougat 7.1.1 and the September security patch out of the box. So it's a solid start.", "time": "10-09-2017 02:35 PM", "replies": []}, {"postID": "post6012424", "text": "This is awesome news! I've even heard they they received their security patch update before the Google pixel did (which is my current phone) Nokia is more like a flagship name then some of these other companies and they have been around for a long time", "time": "10-09-2017 02:38 PM", "replies": []}, {"postID": "post6012440", "text": "Hopefully when Nokia 9 is released it surprises a lot of people including me in a good way. Competion and more choices are always a good thing . Looking forward to see what they bring to the table next", "time": "10-09-2017 02:46 PM", "replies": []}]}, {"title": "Nokia 8 - Flagship", "thread": [{"postID": "post5886628", "text": "This looks nice. Will be interesting to see the price point for this but could be a big seller for HMD (nokia) especially if it has a zeiss lens. https://www.xda-developers.com/fresh...-developers%29", "time": "07-15-2017 07:04 PM", "replies": []}, {"postID": "post5886633", "text": "Bit of a bummer where they mention it will have a slight uprade as the Nokia 9 may be delayed. The 9 is the phone I'm holding out for", "time": "07-15-2017 07:18 PM", "replies": [{"postID": "post5888160", "text": ".\nSo what's missing in 8 that the 9 was supposed to have?\nIt's all rumors at this point. The 9 got renamed to 8, according to GSMArena.", "time": "07-17-2017 08:05 AM", "replies": [{"postID": "post5951626", "text": "Pretty much all features of a real Nokia flagship:\n- Dedicated camera button (present on Nokia flagships since before the iPhone)\n- AMOLED display (present on Nokia flagships since the 2013 Nokia 1020)\n- Wireless charging (present on all Nokia flagships since the 2012 Nokia 920)\nAnd then it lacks:\n- An actually good camera. The camera on the Nokia 8 is crap, much of it because of the software. In fact I did an interesting experiement with the Nokia 5. I downloaded from XDA the port of the Pixel camera and installed it on the Nokia 5 (and yes, the app works on the snapdragon 430. I was surprised too). And then I took a picture with the Nokia 5 stock camera and with the Nokia 5 using the Pixel camera.\nHere's the result (stock on top, Pixel on bottom)\nThe Nokia 8 camera acts pretty much the same. It needs to be completely overhauled. I do think that will happen though. They've got the Lumia Camera design copyrights back from Microsoft so I would expect it to be deployed eventually with a big camera update. Whether they'll bundle that with the 8.0 update or not, remains to be seen.\nThey might opt to delay that and only launch it after the release of the Nokia 9 (and yes, there will be a Nokia 9, HMD has been clearly stating \"our most powerful smartphone *so far*\" and they've said they'll have a smartphone for every sort of consumer, including those who want an everything and the kitchen sink device)\n- True innovative software.\nNokia had a list of cool stuff that they wanted to do during the Windows Phone Era that they never got to do because of the limitations of the software and Microsoft's lack of interest in improving it. With Android they don't have that problem. But that will mean, eventually, ditching stock Android.\nAnd I think they'll eventually ditch it when they realise stock Android doesn't sell phones and that they need things to differentiate their phones other than just the Nokia brand.", "time": "09-01-2017 06:05 PM", "replies": []}]}]}, {"postID": "post5888257", "text": "From what I can tell from the rumours it sounds like the Nokia 8 has had a spec bump but falls a little short of what the Nokia 9 was supposed to have. So it basically falls somewhere in between the 2. Either way it's all speculation like you say and if this article is true then this will be their top flagship for now no matter what rumours are flying around", "time": "07-17-2017 09:35 AM", "replies": []}, {"postID": "post5888501", "text": "More leaks https://www.androidcentral.com/nokia-8", "time": "07-17-2017 12:05 PM", "replies": []}, {"postID": "post5888751", "text": "hmm..big bezels in the year of small bezels", "time": "07-17-2017 02:47 PM", "replies": [{"postID": "post6010414", "text": "I've got a Nokia 8 and I can safely say that the bezels are the only disappointing thing about it.", "time": "10-08-2017 06:21 AM", "replies": []}]}, {"postID": "post5888781", "text": "Everything I read so far points to no bezels. Anyone know if Verizon will carry this?", "time": "07-17-2017 03:11 PM", "replies": [{"postID": "post5888950", "text": "Well looks like it will have plenty of bezels.", "time": "07-17-2017 05:50 PM", "replies": []}]}, {"postID": "post5889148", "text": "Looks terrible, camera sounds really interesting", "time": "07-17-2017 09:21 PM", "replies": [{"postID": "post5890250", "text": "Definitely a typical nokia with those bezels and square design.", "time": "07-18-2017 06:03 PM", "replies": []}]}, {"postID": "post5890269", "text": "I'm sure there is going to be a 9 especially since I've been hearing the processor might be a downgrade on the 8. It's all speculation at this point but will have to wait and see", "time": "07-18-2017 06:27 PM", "replies": []}, {"postID": "post5890708", "text": "Does anyone know what the software updates will be like? Have they committed to releasing (at least security updates) pretty quickly in line with Google.\nI've also heard that it will be pretty much stock android which is cool.", "time": "07-19-2017 03:44 AM", "replies": [{"postID": "post5890720", "text": "Software Updates will be amongst the fastest to be released thanks to near stock Android. They have also committed to monthly security updates and firmware upgrades for 2 years.", "time": "07-19-2017 04:00 AM", "replies": [{"postID": "post5890800", "text": "It may well be the phone to replace my 5X then. Can't decide between the Nokia or Original Pixel.", "time": "07-19-2017 06:37 AM", "replies": [{"postID": "post5890903", "text": "Original Pixel all day long IMO. But it's also be easy to wait for the new one in 3 months.", "time": "07-19-2017 08:08 AM", "replies": []}]}]}, {"postID": "post5891417", "text": "They seem to be good so far on security updates Nokia 3, Nokia 5, Nokia 6 Android Phones to Receive Monthly Security Updates | Technology NewsNokia 6 Android 7.1.1 Nougat Update Gets Wider Rollout | Technology News", "time": "07-19-2017 02:15 PM", "replies": []}]}, {"postID": "post5895556", "text": "If you are choosing only between Nokia 8 or original Pixel, I would go for the Nokia, near stock software, newer hardware, probably a bit more attractive. But you probably can get the Pixel cheaper", "time": "07-22-2017 01:34 PM", "replies": [{"postID": "post5897010", "text": "I'd go the other way, but only because the new Nokia has never released a flagship and the pixel is proven to be a great device. Plus the Nokia design has a lot of ancient elements to it that need updating. Hopefully the 8 is good though so next year we'll know if they're pushing quality or not.", "time": "07-23-2017 06:28 PM", "replies": []}]}, {"postID": "post5897021", "text": "Even more leaks for this phone.https://www.forbes.com/sites/ewanspe.../#22e9caef628f", "time": "07-23-2017 06:48 PM", "replies": [{"postID": "post5897206", "text": "Just saw that as well. Here's a link to the gallery. \nIt seems like this particular finish is easily scuffed, but the design looks good otherwise. Hope there will be matte editions as well.", "time": "07-23-2017 10:42 PM", "replies": []}]}, {"postID": "post5897506", "text": "I think in terms of just the camera alone will blow Google out of the water", "time": "07-24-2017 08:52 AM", "replies": [{"postID": "post5897592", "text": "I'm certainly hoping so. If the camera is a let down I may actually shed a tear", "time": "07-24-2017 10:20 AM", "replies": [{"postID": "post5897604", "text": "Agree that I hope it's good, but \"blowing Google out of the water\" is damn near impossible, as a year later they're still the second best camera on the market. Old Nokia's best flagship camera is 3 years old at this point as isn't in the top 30 cameras on smartphones now, due to the rapid clustering of many OEM's near the top of the pack. I certainly don't think Nokia is going to bomb out on camera, but my best guess is that they'll slide into the middle of the leading pack.", "time": "07-24-2017 10:27 AM", "replies": []}]}, {"postID": "post5898100", "text": "I recall hearing that they won't be using the same pureview tech that the Lumias had, since that tech was exclusive to MS. Not sure how much of a difference that would make. Or whether it's true for that matter. \nI do hope the cameras are going to be awesome, because that's one thing that I miss a LOT coming from a 950XL and going to an iPhone 6S plus. Looking forward to my third mobile OS in one year..", "time": "07-24-2017 05:10 PM", "replies": []}]}, {"postID": "post5897509", "text": "The pixel that is. I think Nokia is pushing quality already with the release of their 3 Android phones released already. Nokia has always made reliable phones I somehow don't think quality is going to be any kind of issue. Especially on their comeback devices. I personally would worry more about the pixel then nokia.", "time": "07-24-2017 08:55 AM", "replies": [{"postID": "post5897598", "text": "Can't agree with you here. Neither the old or the new Nokia has never released a flagship and the history of Nokia on Microsoft devices can't be counted to their advantage on Android. Neither company has much built up in the way of history yet, with Google having only released 1 flagship lineup and HMD having released 0 so far. Really is a big question mark, impossible to draw any conclusions in Nokia's favor until there's actually something to see.", "time": "07-24-2017 10:23 AM", "replies": [{"postID": "post5897641", "text": "Never released a flagship? Lol. Why just because they never released one on Android...they didn't count?", "time": "07-24-2017 10:59 AM", "replies": [{"postID": "post5897643", "text": "Sorry, I misspoke. The new company has never released a flagship and the old company never did on Android. But also sure, I'd be willing to state that Windows devices don't count.  As an OS though, not on cameras.", "time": "07-24-2017 11:00 AM", "replies": []}]}]}]}, {"postID": "post5897660", "text": "Yeah that's still like saying Apple have never made a flagship phone because iOS isn't android", "time": "07-24-2017 11:15 AM", "replies": [{"postID": "post5897690", "text": "Nah, night and day difference. iOS is by far the second most popular OS globally and every device they've ever released except for the SE and the 5C has been a flagship. And I'm not saying \"because it's not Android\", I'm joking that Windows, as a phone OS, is one of the most irrelevant things in the smart things world right now.", "time": "07-24-2017 11:38 AM", "replies": [{"postID": "post5897802", "text": "Of course Windows on mobile is irrelevant now but when old Nokia was at it's prime they were producing plenty flagships, and iOS was only the 3rd most popular OS here in Europe behind Android and WP respectively. \nWhatever happens I want them to do well and I'll hang off buying the 8 until I see if it has everything or at least most features I need, it performs well and the camera in particular and finally I'll wait to see if the 9 arrives shortly after in case it's better then at least the 8 will have come down in price by then too", "time": "07-24-2017 12:45 PM", "replies": [{"postID": "post5897810", "text": "Yep I agree that Nokia used to be awesome; but since this is a new company with some familiar faces, that leaves a lot of question marks out there. Hopefully the 8 is as good as everyone is hoping.", "time": "07-24-2017 12:53 PM", "replies": []}]}]}]}, {"postID": "post5897682", "text": "We will have to wait it out and see! I still tend to think the camera on the Nokia Flagships are going to wipe the pixel by miles. Google is relying on software primarily to take good pics . Nokias hardware and software both which is also going to be by Carl Zeiss is going to be a win win situation for sure", "time": "07-24-2017 11:33 AM", "replies": []}, {"postID": "post5897898", "text": "All I'm hoping is that Nokia can fill the void that Nexus has left. \nAll I want is a phone that has regular software and security updates and is cheaper than a flagship.", "time": "07-24-2017 02:05 PM", "replies": []}, {"postID": "post5902169", "text": "Just read an awesome article on mspoweruser.com about Nokia snatching back their iconic Lumia camera user interface for their Android devices! Check it out", "time": "07-27-2017 06:46 PM", "replies": [{"postID": "post5902509", "text": "You beat me to that lol. Read it last night and was gonna add it in here too. That's definitely great news for the camera experience. Especially after hearing how bad the camera interface is on the current new crop of Nokia's. If they can add a dedicated camera button too to the Nokia 9 I'll be in my element", "time": "07-28-2017 01:31 AM", "replies": []}]}, {"postID": "post5902645", "text": "Same here will check out the 8 but really more interested in the 9. As of for the dedicated camera button I will take it either way I just want it to get here soon", "time": "07-28-2017 05:38 AM", "replies": []}, {"postID": "post5904146", "text": "really looking forward to this phone and stock Android and the Zeis camera partnership.Nokia 8: Release date, rumours and specs for Nokia&#039;s flagship - Pocket-lint", "time": "07-29-2017 09:00 AM", "replies": []}, {"postID": "post5924652", "text": "One day to go apparently! Very curious whether this one lives up to the hype!", "time": "08-15-2017 04:26 PM", "replies": []}, {"postID": "post5925411", "text": "There is still going to be a 9! I'm probably going to wait it out for that one", "time": "08-16-2017 09:42 AM", "replies": []}, {"postID": "post5925658", "text": "Well, there it is!https://www.theverge.com/2017/8/16/1...s-dual-camerashttps://www.engadget.com/2017/08/16/nokia-8-hands-on/Nokia 8 hands on: the first Android Nokia flagship\nEdit: looks good, but.. \"HMD has no immediate plans to take the phone to the US.\"", "time": "08-16-2017 01:55 PM", "replies": []}, {"postID": "post5926040", "text": "599€!?\nThat's a bit high, i think.", "time": "08-16-2017 09:35 PM", "replies": []}, {"postID": "post5926381", "text": "Only splash proof. Sorry but not enough! I'll hold out!", "time": "08-17-2017 08:35 AM", "replies": []}, {"postID": "post5926406", "text": "I'm wondering with an f2.0 lens, how good it will be in low light. Not a bad phone at all, but I think I'll hold off, at least until full reviews come in.", "time": "08-17-2017 08:57 AM", "replies": [{"postID": "post5926798", "text": "It does have OIS, so that should help compared to the Pixel for example, and I read somewhere that the image information from the second camera module (monochrome) is used to improve the low light response. Still, probably wise to see how it pans out in actual use.", "time": "08-17-2017 03:20 PM", "replies": []}]}, {"postID": "post5958171", "text": "It looks like a gorgeous phone! I'm intrigued by it.", "time": "09-05-2017 04:50 PM", "replies": []}]}, {"title": "OZO VS Pureview technology", "thread": [{"postID": "post5960724", "text": "Which one is better OZO or Pureview technology?", "time": "09-06-2017 06:03 PM", "replies": []}, {"postID": "post5970066", "text": "I don't think you can compare the two as they're so different as camera technologies and serve very different purposes. I'd take PureView in my phone camera over Ozo any day though", "time": "09-12-2017 04:49 AM", "replies": []}, {"postID": "post5992440", "text": "OZO on the Nokia 8 is NOT related to the camera tech.\nThere's no work done by the OZO team on any of the HMD devices. The OZO tech on the Nokia 8 is regarding SOUND capturing.\nSo you can't compare them because they're not the same thing.\nHMD hasn't used, however, ANY of the PureView tech on the Nokia 8 either (which is why the camera results are so bad). They could have asked the OZO team to help on the imaging as well and eventually they'll be forced to do so. Because, you know...OZO's current head of imaging is Juha...the former head of imaging at Nokia during the PureView years", "time": "09-25-2017 04:42 PM", "replies": []}]}, {"title": "Can the Nokia 8 listen to my text and reply hands free in car?", "thread": [{"postID": "post5974152", "text": "Can the Nokia 8 listen to my text and reply hands free in car", "time": "09-14-2017 10:37 AM", "replies": []}, {"postID": "post5977376", "text": "Have you tried \"Ok Google, show me my last messages\"? PSA: Google Now Can Read Your Last Five Text Messages Like An Answering Machine And Let You Reply To Them", "time": "09-15-2017 09:12 PM", "replies": []}]}, {"title": "Who is actually making Nokia phones?", "thread": [{"postID": "post5921845", "text": "From what I read after Microsoft bought / paid, whatever for the Nokia phone division I was under the impression that Nokia no longer manufactured phones, I thought it was part of the agreement with Microsoft that they wouldn't manufacture phones. I thought I read someplace the new Nokia phones were being manufactured by Foxconn, I'm probably mistaken though. Anyone know who is making the current line of Nokia Android phones?", "time": "08-12-2017 08:36 PM", "replies": []}, {"postID": "post5921929", "text": "HMD makes Nokia android phones. Sort of like blackberry and TCL now. Here ya go https://www.hmdglobal.com/", "time": "08-12-2017 11:10 PM", "replies": []}, {"postID": "post5947976", "text": "HMD develops Nokia phones.\nFoxconn (FCI) is actually producing them.\nThis is well documented.", "time": "08-31-2017 06:38 AM", "replies": []}, {"postID": "post5951599", "text": "It's a \"cooperation\".\n- Nokia provides the base technologies. All the patents that belong to Nokia Technologies (NONE was sold to Microsoft by the way) like what was known as ClearBlack or PureView, are provided to HMD by Nokia.\n- HMD Global, the Finnish company started unofficially by Nokia and made of ex-Nokia employees, designs and develops the phones. They do the hardware and the tiny bit of software that they add to the stock Android ROM, ie. the camera app.\n- Foxconn manufactures and distributes the phones, pretty much like they do for Apple.", "time": "09-01-2017 05:51 PM", "replies": []}]}]
