[{"title": "Why is my brightness so low?", "thread": [{"postID": "post6174637", "text": "I have Honor 8 Pro, Android Oreo, and my maximum brightness is too low. When I move the brightness scroll bar, the brightness is increasing up to 80%. Then when I move the scrollbar from 80% to 100%, the brightness doesn't change. What am I doing wrong? Thanks", "time": "02-28-2018 07:05 AM", "replies": []}, {"postID": "post6185324", "text": "Welcome to Android Central! Have you tried restarting the phone to see if this was just a glitch? Are you using any dark or neutral-coloured wallpapers, launchers, etc? Does this brightness issue affect all apps or just a couple?", "time": "03-10-2018 11:25 AM", "replies": []}]}, {"title": "Oreo 8.0 Emui 8.0", "thread": [{"postID": "post6164399", "text": "Any UK 8 Pro owners got the update? How is it?\nStill waiting strangely despite being told to expect it last week.", "time": "02-16-2018 01:57 PM", "replies": []}]}, {"title": "What are the specs on the Honor 8 Pro?", "thread": [{"postID": "post6040922", "text": "So I seem to think the next honor phone we will be seeing in the US will be the Honor 8 Pro mainly because the regular honor 8 is so widely known here and sales were very good with the regular honor 8. Huawei honor is going to do what's best for sales in terms of their light presence here in the US and since the honor 8 did so well it just makes sense to me that the next US release will carry on the name of the honor 8 but will be the pro version. In a few months I think they will release their next upper end Honor phone. It won't be the Honor 9 I don't seem to think now like I used to but now I'm thinking it will be the honor 8 pro instead. Can anyone tell me the specs of this device like what Kirin processor it has and like the screen size please? If indeed they do release the honor 8 pro I think I'll be in line to get one as the regular honor 8 is hardly even short of today's flagship phones that you can buy for an incredible price. Depending on the honor 8 pro screen size will be whether I would get it or not. I personally like the 5.2 screen size of the regular honor 8. It's plenty big enough to watch movies on but still small enough to almost manage with one hand most of the time. I've just never researched the specs of the pro version so would anyone mind filling me in on them?", "time": "10-27-2017 05:09 AM", "replies": []}, {"postID": "post6040957", "text": "Nevermind guys I just looked it up. It has a 5.7 inch display running a Kirin 960 chip. I'm pretty sure if they release this phone here in the US as their next honor US release that I would definitely be getting one. It would be a great media phone with that 5.7 inch screen and would be the perfect phone to rotate out with my regular honor 8. I really do think this pro version will be the next honor US release. It just makes sense to carry on the already widely known name of the honor 8 here in the US. Time will tell which I think we will get some type of new release in early to mid December before Christmas sales.", "time": "10-27-2017 05:32 AM", "replies": [{"postID": "post6042685", "text": "Glad that you plan to get the honor 8 pro should it come state side and keep the honor 8!\nIt would be interesting what they do. The honor 8 pro uses last years processor, but is selling for roughly $460 equivalent. It's a great phone but in the usa, I don't really think that it would sell well, at least at that price. If they drop the price significantly then it might work", "time": "10-28-2017 09:55 AM", "replies": [{"postID": "post6042773", "text": "Yeah, would have to drop a bit. I have feeling honor is really going to go after the budget segment this year. I'm guessing we won't see a phone over $300. What that means in terms of current phone they bring over I have no idea.", "time": "10-28-2017 11:24 AM", "replies": []}]}]}, {"postID": "post6041084", "text": "Yeah, seems like a pretty legit upgrade!", "time": "10-27-2017 07:41 AM", "replies": []}, {"postID": "post6042906", "text": "I would be shocked if they brought in the Honor 8 pro at $300", "time": "10-28-2017 01:04 PM", "replies": []}, {"postID": "post6043993", "text": "Yeah, agreed. That's why I think the next phone they bring over will be a7x or a rebadged Nova 3.", "time": "10-29-2017 10:43 AM", "replies": []}, {"postID": "post6047907", "text": "I hope we see it stateside too. Looks like a great phone. But it's similar in many respects to the Mate 9, except for the 6 GB or ram and the increased screen resolution. Not sure I'd notice either the ram or extra resolution, though.", "time": "10-31-2017 07:47 PM", "replies": [{"postID": "post6047976", "text": "It's future proofing I guess. Unless your a hardcore gamer you'd be hard press to notice the difference.", "time": "10-31-2017 08:42 PM", "replies": [{"postID": "post6051711", "text": "Oh definitely. The usa Galaxy s3 had 2 gb ram. Made it more usable longer than the competition which had 1gb ram at the time.", "time": "11-03-2017 08:17 AM", "replies": []}, {"postID": "post6092134", "text": "Future proofing is good. Keep the software stable and updated and the phone will last a good while", "time": "12-01-2017 12:51 AM", "replies": []}]}, {"postID": "post6092136", "text": "They should just bring the Honor V10 to the states instead.", "time": "12-01-2017 12:52 AM", "replies": [{"postID": "post6108871", "text": "Good news, the V10 is coming to the United States!", "time": "12-16-2017 12:05 PM", "replies": []}]}]}, {"postID": "post6056509", "text": "Phone is too old now. Give us a newer Honor model", "time": "11-06-2017 09:38 AM", "replies": [{"postID": "post6056566", "text": "I do think that it is unlikely to come stateside at this point.", "time": "11-06-2017 10:24 AM", "replies": []}]}, {"postID": "post6056997", "text": "yah. we won't see it at all.", "time": "11-06-2017 04:20 PM", "replies": []}, {"postID": "post6146315", "text": "I do like the look of the V10... The 8 Pro is nice too, however. Both look like good upgrade options.", "time": "01-26-2018 08:08 AM", "replies": []}]}, {"title": "honor 8 pro mother board price.", "thread": [{"postID": "post6121432", "text": "any idea, what will be the price of the motherboard of honor 8 pro, the guy here in Shillong says 20k. is it true? i kinda don't believe so.help please.", "time": "12-29-2017 11:06 AM", "replies": []}, {"postID": "post6122291", "text": "I would suggest that you contact Huawei to see if they could fix it under warranty. Even if it isn't covered under warranty, they could give you a price to fix it so you can compare with the estimate that you already got", "time": "12-30-2017 10:19 AM", "replies": []}]}, {"title": "Can I purchase in the USA?", "thread": [{"postID": "post5889572", "text": "How and how much?", "time": "07-18-2017 09:12 AM", "replies": [{"postID": "post5890368", "text": "Hey bro how's u... I just brought the honor 8 pro here in India... Iam planning to sell axon 7 \nHow's your axon 7 doing?\nNow I will have honor 8 pro and LG G6...", "time": "07-18-2017 08:08 PM", "replies": []}]}, {"postID": "post5890245", "text": "It's not being released in the USA afaik. You can buy it from some places in internationally that will ship to the USA but it will cost a lot.", "time": "07-18-2017 05:58 PM", "replies": []}, {"postID": "post5917828", "text": "It will be a damn shame if they don't sell the H8Pro here in the USA", "time": "08-09-2017 10:58 AM", "replies": []}, {"postID": "post5917831", "text": "And if I spend that much money I have to have a warranty. that's a lot of cash man", "time": "08-09-2017 11:00 AM", "replies": []}, {"postID": "post5918202", "text": "You can definitely try eBay or Amazon toll the prices goes down", "time": "08-09-2017 03:21 PM", "replies": [{"postID": "post5918953", "text": "But probably no USA warranty...", "time": "08-10-2017 08:16 AM", "replies": [{"postID": "post5920764", "text": "Doubt that as well", "time": "08-11-2017 05:25 PM", "replies": []}]}]}, {"postID": "post5921583", "text": "Oh i just remembered that b&h does sell international unlocked phones and while the manufacturer won't warranty it, b&h will. But they aren't selling the honor 8 pro yet. \nThose interested can contact b&h , and with enough interest then they might be willing to import some.", "time": "08-12-2017 02:56 PM", "replies": []}, {"postID": "post6017711", "text": "Oh I never knew b&h did this! Makes buying international phones way simpler. They seem to be a really good company. Plus no sales tax outside of my", "time": "10-13-2017 08:55 AM", "replies": [{"postID": "post6018813", "text": "I have bought from them a few times and no problems so far", "time": "10-14-2017 01:32 AM", "replies": [{"postID": "post6018992", "text": "I'll have to give them a try on my next phone purchase. I usually go with Newegg cause they always seem to throw in free stuff with purchase. But I think b&h does that as well.", "time": "10-14-2017 08:10 AM", "replies": []}]}]}, {"postID": "post6093310", "text": "They have the Mate 10/Pro in amazon but no warranty with them.", "time": "12-02-2017 05:38 AM", "replies": []}]}, {"title": "shockingly True Honor 8 pro beats samsung s8 in speed test", "thread": [{"postID": "post5887340", "text": "I was shocked to see the video of Honor 8 pro beating the samsung s8 badly...how good is the kirin 960..\nMy honor 8 pro 128gb with 6gb ram has just arrived will do a unboxing video tom and will upload on youtube", "time": "07-16-2017 12:24 PM", "replies": [{"postID": "post5887438", "text": "Not surprising with the added ram. The Kirin chip has been known to beat the 835 in various tests.", "time": "07-16-2017 02:17 PM", "replies": []}]}, {"postID": "post5887443", "text": "See the same results when compared to the One+5", "time": "07-16-2017 02:25 PM", "replies": []}, {"postID": "post5887519", "text": "so honor 8 pro is half the price of s8 and is better in most ways India we get 128gb 6gb variant at only 30k that's around 460$ only wish would be stereo speakers as Iam planning to shift from Axon 128gb with 6gb ram version to honor 8 pro... wonder how's the speaker of honor 8 pro", "time": "07-16-2017 03:55 PM", "replies": []}, {"postID": "post5888175", "text": "I am not really shocked. Samsung usually loads the same or a hair slower when both are not in memory. There isn't really a huge difference loading normal apps.\nSamsung has more aggressive memory management plus less ram so it isn't surprising that apps get kicked out of memory.\nFor those power users who like to open and switch between large apps extremely frequently then the Honor 8 pro and op5 are better options for sure.", "time": "07-17-2017 08:16 AM", "replies": []}, {"postID": "post5890314", "text": "I have OP5 and I am afraid that honor 8 pro will destroy my op5! Nooooo", "time": "07-18-2017 07:14 PM", "replies": [{"postID": "post5890912", "text": "That would be an interesting test! If you get an Honor 8 pro then you should do a speed test and let us know", "time": "07-19-2017 08:13 AM", "replies": []}]}, {"postID": "post5893132", "text": "Guys my honor 8 pro is here...just done the my unboxing..i.got that nice blue color...will post unboxing video soon", "time": "07-20-2017 06:09 PM", "replies": [{"postID": "post5893217", "text": "Is that US compatible?", "time": "07-20-2017 07:14 PM", "replies": [{"postID": "post5894744", "text": "Bro I am in India and has many bands.. U guys can buy from ebay.. Just check of those bands work in u.s \nI am letting Axon 7 go for honor 8 pro...soo will have honor 8 pro and LG G6.. Soo far very happy with hp8 \nScreen with 2k is beautiful... Thou phone is bigger than axon 7 and much bigger than G6 thou both having same screen size.... Thou liking the old ratio of 16:9..and little wider screen than taller...", "time": "07-21-2017 08:25 PM", "replies": [{"postID": "post5894903", "text": "Do you have a link? I checked a bunch of eBay links and they either don't list lte bands or they aren't compatible with USA lte bands...2,4,5,12,17 are the significant ones for the GSM carriers here . The only band i saw is LTE band 5 supported but that's a tertiary LTE band for att.", "time": "07-22-2017 01:03 AM", "replies": [{"postID": "post5896259", "text": "U can try seeing on honor India Web site there I am sure they would mention all the bands", "time": "07-23-2017 05:48 AM", "replies": []}]}]}]}]}, {"postID": "post5893454", "text": "I hope it is!", "time": "07-20-2017 11:48 PM", "replies": []}, {"postID": "post5894863", "text": "That same guy did an HTC U11 vs S8 and the HTC was faster, too. Guess because of all the bloat ware that Samsung loves.", "time": "07-21-2017 11:16 PM", "replies": []}, {"postID": "post5896263", "text": "Here are the bands that I found.. This phone sells in India... \nMaybe I can buy from China also which will have u.s bands also", "time": "07-23-2017 05:55 AM", "replies": [{"postID": "post5896354", "text": "Yeah i found that too... That won't work in the USA.", "time": "07-23-2017 07:57 AM", "replies": []}]}, {"postID": "post5905351", "text": "soo its been 7 days with honor 8 pro and the phone is my daily driver\n1) screen is brilliant ...vibrant and bright very clear and crisp\n2) call quality is excellent\n3)battery life is killer last me 2 days with 6hrs + sot\n4) love the ir blaster\n5)loud speaker is loud and clear\n6)love the 16:9 ratio\n7)build quality is stellar love the metal frame as glass backs are fragile\n8)finger print scanner is the fastest i have ever seen..love the fp gesture for notification panel\n9)love the new blue color\ncons\n1) phone is big\n2) could have better fast charging\n3)hope it had stereo speakers\n4)no water resistant\n5)no wireless charging\n6)no double tap to wake\nwill post 1 month review soon", "time": "07-30-2017 08:58 AM", "replies": []}, {"postID": "post5917399", "text": "New update showing...will check and get back", "time": "08-09-2017 03:31 AM", "replies": []}, {"postID": "post5917820", "text": "The kirin 960 processor was built to run against the Snapdragon processors and doing a damn good job of it!", "time": "08-09-2017 10:51 AM", "replies": []}, {"postID": "post5917825", "text": "What did it cost ya, are you in the USA?\nI like the look of the Honor 8 pro, I bought the Mate 9 (BestBuy refurb)..wicked phone.\nGave it to my son (birthday gift)..he's loving the BIG screen.", "time": "08-09-2017 10:55 AM", "replies": [{"postID": "post5918423", "text": "Bro I am in India brought it for 28000 rs that's around 400$ and phone is totally worth each penny... Sold my Axon 7 for honor 8 Pro mine is 128gb with 6gb ram", "time": "08-09-2017 06:43 PM", "replies": []}]}, {"postID": "post5918312", "text": "SD835 and Kirin 960 are very competitive against each other. You won't be disappointed on either one", "time": "08-09-2017 04:37 PM", "replies": []}, {"postID": "post5930128", "text": "how was the Axon 7 software ?", "time": "08-20-2017 08:01 PM", "replies": []}, {"postID": "post5937217", "text": "This honestly doesn't surprise me. Love Honor/Huawei.", "time": "08-24-2017 09:56 PM", "replies": []}, {"postID": "post5941087", "text": "45 days with honor 8 pro...indian unit with 128gb with 6gb ram and phone is working superb..Must sau from display battery life camera and love the irblaster...one of the best flagship killers...of 2017", "time": "08-27-2017 08:45 AM", "replies": [{"postID": "post5941216", "text": "Sadly it won't be killing any flagships in the USA... Not because it can't, but because Honor probably won't release it in the USA", "time": "08-27-2017 10:36 AM", "replies": []}]}, {"postID": "post5941215", "text": "India is so lucky. They get everything including honor 8 pro. USA only get limited phones.", "time": "08-27-2017 10:36 AM", "replies": []}, {"postID": "post5944261", "text": "yeah it's time honor launches more models in the states...now i have G6 and honor 8 pro..both are awesome phones...looking to see V30..", "time": "08-29-2017 08:22 AM", "replies": [{"postID": "post5945446", "text": "Which carrier are you using the Honor 8 Pro ? Got Lte signals ?", "time": "08-29-2017 07:44 PM", "replies": []}]}, {"postID": "post6013609", "text": "It's a shame this never made it to the US.", "time": "10-10-2017 11:00 AM", "replies": []}, {"postID": "post6014218", "text": "Any comparison to the note 8 yet?", "time": "10-10-2017 05:53 PM", "replies": []}]}, {"title": "Honor 8 Pro US Release Confirmed", "thread": [{"postID": "post5860165", "text": "After a brief conversation with Honor Support, I've received confirmation that the Honor 8 Pro will have a US release. Currently, there's no release date planned, but they do plan to bring it to the US soon.\n-lumivalo", "time": "06-22-2017 08:16 PM", "replies": [{"postID": "post5860840", "text": "Wow that's definitely news to me. I certainly wasn't expecting this to come to the states. \nAre you planning on getting one?", "time": "06-23-2017 10:51 AM", "replies": [{"postID": "post5861015", "text": "Maybe, but it's slightly out of my budget at the moment.", "time": "06-23-2017 01:37 PM", "replies": [{"postID": "post5862404", "text": "How much does the pro run? I didn't think this one was coming to the US. Are you guys totally sure that it's coming?", "time": "06-24-2017 09:21 PM", "replies": [{"postID": "post5862591", "text": "It's entirely possible the support rep that I talked to was misinformed, but if he was correctly informed, he did verify that there would be a US release of the Honor 8 Pro.", "time": "06-25-2017 06:02 AM", "replies": []}, {"postID": "post5862758", "text": "Well responses from reps tend to be varied. In my experience some tend to say whatever to please the customer to get the customer off the line. It could truly be that honor plans the pro release here but later changes their mind. With that said this is good news in that there's a chance it is coming.", "time": "06-25-2017 09:55 AM", "replies": []}]}]}]}]}, {"postID": "post5860976", "text": "I'll wait for a press release.", "time": "06-23-2017 12:58 PM", "replies": [{"postID": "post5862592", "text": "Wise choice.", "time": "06-25-2017 06:02 AM", "replies": []}]}, {"postID": "post5867869", "text": "Amazon will carry it. Hopefully it's not ad version. http://www.amazon.in/b?ie=UTF8&node=...drocentr0aa-21", "time": "06-29-2017 11:49 AM", "replies": [{"postID": "post5868039", "text": "Wow. I am really shocked. Wow. Just wow. Never expected it to land stateside.\nWith regards to the ad version or not, usually Amazon offers both ad and ad free versions. The ad versions are just a little cheaper. Hopefully it will be the case here", "time": "06-29-2017 01:47 PM", "replies": [{"postID": "post5868065", "text": "Yeah. Was about to pre order Nokia 6 but this hold me off.", "time": "06-29-2017 02:13 PM", "replies": [{"postID": "post5868143", "text": "The next question is whether or not it will work on Verizon. I am guessing no but then again i wasn't expecting this to even land stateside so it is possible.", "time": "06-29-2017 03:51 PM", "replies": [{"postID": "post5868380", "text": "I double checked. It's Amazon India that'll be released. Need to wait again lol. \nHard to find GSM phone beside iPhone that works with Sprint and Verizon ... 💰 talk ...", "time": "06-29-2017 08:59 PM", "replies": [{"postID": "post5868487", "text": "Damn that sucks. But it is expected.\nSamsung s7/s8( unlocked model), moto x play, moto g4/g5, Nexus and Pixel are GSM points that woek on Verizon\nAlso, the att and T-Mobile iPhone 7 does not support CDMA.", "time": "06-30-2017 12:42 AM", "replies": [{"postID": "post5870577", "text": "Since there's no timeline. Better going to hold for Samsung Note 8 vs Huawei Mate 10 Vs iPhone 8. \n#blezel-less.", "time": "07-02-2017 03:07 AM", "replies": [{"postID": "post5871520", "text": "Any reason you are looking at the smaller iPhone, instead of the plus? I only ask because of the size of the Android phones you mentioned.", "time": "07-03-2017 12:42 AM", "replies": [{"postID": "post5872328", "text": "Oops. I forgot the \"plus\".", "time": "07-03-2017 04:52 PM", "replies": []}]}]}]}]}]}]}]}]}, {"postID": "post5876301", "text": "I saw an H8Pro about one month back. It was being black one being sold in Florida off eBay. I should have bought it.", "time": "07-07-2017 12:57 AM", "replies": [{"postID": "post5876521", "text": "I wonder if it was a review unit? I mean it seems unlikely that someone imported it just to sell it a short time later", "time": "07-07-2017 08:12 AM", "replies": []}]}, {"postID": "post5883623", "text": "I really hope that honor 8 pro releases on US. Hopefully it's not a long wait.", "time": "07-13-2017 10:31 AM", "replies": [{"postID": "post5884153", "text": "You can always contact Honor and tell them that you are interested. If enough people do so then they might release it here", "time": "07-13-2017 05:59 PM", "replies": []}]}, {"postID": "post5920766", "text": "So is it out for US yet ?", "time": "08-11-2017 05:28 PM", "replies": [{"postID": "post5921573", "text": "No, and my guess is that it would not land stateside.", "time": "08-12-2017 02:44 PM", "replies": [{"postID": "post5921650", "text": "Im crying", "time": "08-12-2017 04:14 PM", "replies": [{"postID": "post5921710", "text": "You can contact places that sell international unlocked phones with warranty like b&h and see if they will get the honor 8 pro... If enough people commit then they might be willing to get it.", "time": "08-12-2017 05:23 PM", "replies": []}]}]}]}, {"postID": "post5922496", "text": "u can try ebay...there u will find it", "time": "08-13-2017 03:01 PM", "replies": [{"postID": "post5923651", "text": "With warranty though?", "time": "08-14-2017 06:23 PM", "replies": []}]}, {"postID": "post5927529", "text": "Doubt it", "time": "08-18-2017 09:28 AM", "replies": []}, {"postID": "post6013613", "text": "Yeah, looks like US isn't getting this anytime soon if ever. That's a shame.", "time": "10-10-2017 11:02 AM", "replies": [{"postID": "post6014217", "text": "Ugh. Usa never gets the special models", "time": "10-10-2017 05:52 PM", "replies": []}]}]}, {"title": "Any brought Honor 8 pro in india", "thread": [{"postID": "post5883034", "text": "Hey guys i was looking for a new phone with dual cameras and ir blaster...and saw honor 8 pro with awesome specs with really good price...i have ordered mine in blue color...Right now my current phones are Axon 7 128gb with 6gb ram and LG G6..love both phones...just confused which to replace the honor 8 pro with\nDid anyone buy in india from amazon india", "time": "07-12-2017 08:58 PM", "replies": []}, {"postID": "post5883427", "text": "Personally, I would get rid of the lg g6, but I would suggest that you make a decision matrix to determine which phone best suits your needs.", "time": "07-13-2017 08:14 AM", "replies": [{"postID": "post5884526", "text": "Bro planning to sell of Axon 7....lets see....waiting for the honor 8 pro to arrive..seen such good reviews of the phone...", "time": "07-14-2017 02:16 AM", "replies": [{"postID": "post5884693", "text": "Sounds good... Let us know how you like it as unfortunately it is unlikely to appear stateside, so I probably wouldn't be able to get one.", "time": "07-14-2017 08:17 AM", "replies": []}]}]}, {"postID": "post5886708", "text": "Bro phone has just arrived...will unbox it soon even post a video on youtube...\nmy version is 128gb with 6gb ram...and phone is nice blue color", "time": "07-15-2017 08:50 PM", "replies": []}, {"postID": "post5960850", "text": "i have 1 bug...mirror share is not working..while searching its not even finding my chrome cast.\nanyone else having same issue", "time": "09-06-2017 07:30 PM", "replies": [{"postID": "post5963149", "text": "You might want to start a thread with your problem for more visibility.", "time": "09-07-2017 09:42 PM", "replies": []}]}, {"postID": "post5963767", "text": "Thanx will do that...", "time": "09-08-2017 08:09 AM", "replies": []}, {"postID": "post5966849", "text": "Did it work ?", "time": "09-10-2017 12:00 AM", "replies": [{"postID": "post5969438", "text": "IF u asking me about mirror share no..\nI guess will wait for update or will have to format my phone... But 3rd party apps are working fine...", "time": "09-11-2017 05:35 PM", "replies": []}]}, {"postID": "post5997207", "text": "New update out now.. Has lot of bug fixes and random app crashes...", "time": "09-28-2017 08:57 PM", "replies": []}]}, {"title": "Honor Skin", "thread": [{"postID": "post5945838", "text": "I just wanted to ask if someone still has this card with them and is willing to give it to me for free. It contains a code which can be converted into an exclusive skin(item in the game) in Mobile Legends(MOBA) and only the people who bought the Honor 8 Pro which has the card with the code bundled in can have the skin. So if anyone here has the code and is willing to give it out to some random guy - I'm here! Please send me a private message.\nThanks! \nadmins-I'm not sure if this is the right section for this or if this is even allowed. Please feel free to delete the thread or move it somewhere else. I apologize in advance.", "time": "08-29-2017 11:59 PM", "replies": []}]}, {"title": "No Google Calendar notification sound when screen locked and not connected to internet", "thread": [{"postID": "post5935984", "text": "When the screen is locked and I am not connected to internet there is no notification sound when an event/reminder is due. As soon as I unlock the screen the notification sound is played. This is very annoying as an appointment can be easily missed. This is happening with my Google Calendar app. Please help me to fix it. \nWhile I am connected to internet, Calendar Notification works during lock screen. \nI am using Honor 8 Pro with Android 7", "time": "08-24-2017 10:53 AM", "replies": []}]}, {"title": "Honor 8 Pro Specs", "thread": [{"postID": "post5850468", "text": "Huawei Honor 8 Pro - Full phone specificationsHonor 8 Pro\nSpecifications - Honor 8 Pro\nOS\nEmotion UI 5.1 (compatible with Android 7.0)\nColor\nBlue,Black,Gold\nDisplay\n5.7’’ 2K (2560x1140), Gorilla Glass 3\nChipset\nKirin 960\nOcta-Core 4x2.4 GHz (Cortex A73) +\n4x1.8GHz (Cortex A53)\nBattery\n4000 mAh (typical),3900 mAh (rated)\nCamera\nMain camera: 12 MP + 12 MP Autofocus with LED Flash\nFront camera : 8 MP with 77° wide-angle lens\nStorage\n6 GB RAM, 64 GB ROM\nConnectivity\nWiFi 802.11 a/b/g/n/ac, 2.4G/5G\nBluetooth 4.2\nType-C USB 2.0\nSize\nDimensions: 157 x 77.50 x 6.97 mm\nWeight: 184 g (including battery)\nSIM slot\nTD-LTE/LTE-FDD/WCDMA/GSM\nSIM card 1 (SIM only)\nSIM card 2 (SIM or microSD card up to 128 GB)\nFingerprint\nYes\nNFC\nYes\nSensor\nHall sensor\nInfrared sensor\nFingerprint sensor\nProximity sensor\nAmbient light sensor\nDigital compass\nGravity sensor\nGyroscope\nStatus indicator\nExternal Interface\nType-C USB 2.0, microSD, 3.5mm headset jack\nOther\n2.5D curved glass & slim metal body", "time": "06-14-2017 01:31 PM", "replies": [{"postID": "post5851799", "text": "Great specs! But I think the latest flagships (S8-S8+; U11,XZ pro and now the Essential) are way ahead in terms of hardware and features. There's no doubt it's a great phone and the 6gb of ram will guarantee the performance will keep up with the competition, but lacks some features to attract the most demanding audience", "time": "06-15-2017 04:48 PM", "replies": [{"postID": "post5921289", "text": "Well, that's what happens when new phone comes out. New features and better hardware.", "time": "08-12-2017 09:24 AM", "replies": [{"postID": "post5921586", "text": "The honor 8 pro is fairly new. It was released this year", "time": "08-12-2017 03:00 PM", "replies": [{"postID": "post5921593", "text": "But not the newest. Doesn't even offer wireless charging or water resistant( I don't think it does ).", "time": "08-12-2017 03:06 PM", "replies": [{"postID": "post5921707", "text": "But those aren't new features though... They have been around for years. Some manufacturers decide to incorporate them, some don't.", "time": "08-12-2017 05:21 PM", "replies": [{"postID": "post5921751", "text": "Exactly why they offer less than the other competition. Those features are key to a lot of customers when buying phones.", "time": "08-12-2017 06:18 PM", "replies": [{"postID": "post5921786", "text": "But price is also a factor... The s8 costs nearly double of the honor 8 pro,yet the honor 8 pro has double the internal memory and 50% more RAM. If you think water resistance and wireless charging are worth paying nearly double the cost of the honor 8 pro then by all means... Do it. The Honor lineup is not marketed for those who want all the bells and whistles.", "time": "08-12-2017 06:59 PM", "replies": [{"postID": "post5921885", "text": "You're also talking about Samsung. An overpriced brand. And just cause theyre selling their phone for that amount doesn't mean that's how much those features should cost. We shouldn't exclude those features regardless. They are handy.", "time": "08-12-2017 09:41 PM", "replies": [{"postID": "post5921902", "text": "That's fine but the competition in the same price range like the OnePlus 5 and zte Axon 7s doesn't have them either... Adding these features cost money and the manufacturers choose what people in their specific price range are mainly looking for. Sure there are some like you who want more features, and if you feel that they should be included, then contact the manufacturers and let them know. With enough feedback then they may add it.", "time": "08-12-2017 10:33 PM", "replies": []}]}]}]}]}]}]}]}]}, {"postID": "post5853731", "text": "What's a hall sensor?", "time": "06-17-2017 11:17 AM", "replies": [{"postID": "post5859277", "text": "It's a magnet sensor sometimes used to determine if a flip cover is used", "time": "06-22-2017 08:17 AM", "replies": []}]}, {"postID": "post5859272", "text": "It is just compatible with Android 7? Meaning not actually running android 7?", "time": "06-22-2017 08:12 AM", "replies": [{"postID": "post5859555", "text": "It's an Honor phone, not an Android phone.", "time": "06-22-2017 12:01 PM", "replies": [{"postID": "post5859621", "text": "I was just wondering because the more accurate way would be to say it has Android 7 with emui 5.1. saying something is compatible implies that it isn't authentic.", "time": "06-22-2017 12:39 PM", "replies": []}]}]}]}, {"postID": "post5852136", "text": "Hoping for US release!", "time": "06-16-2017 12:06 AM", "replies": []}, {"postID": "post5859576", "text": "Can we expect a US release?", "time": "06-22-2017 12:09 PM", "replies": [{"postID": "post5859580", "text": "Is a US release expected?", "time": "06-22-2017 12:11 PM", "replies": []}]}, {"postID": "post5922494", "text": "honor 8 pro is budget killer flagship same as oneplus..soo plz dont compare it to flagships of other brands that have price around 700$..i own honor 8 pro 128gb 6gb ram and lg g6...both are excellent phones but if u ask value for money its honor 8 pro", "time": "08-13-2017 03:00 PM", "replies": [{"postID": "post5927537", "text": "Funny how their Honor line are supposed to be more affordable but they use the same beast SoC as their main flagship phones.", "time": "08-18-2017 09:38 AM", "replies": [{"postID": "post5928038", "text": "A flagship isn't defined by the processor. I mean you can find high end soc in a sub $200 phone.", "time": "08-18-2017 06:02 PM", "replies": [{"postID": "post5928044", "text": "It's a flagship chip for a reason. What $200 phone has a flagship soc in them ?", "time": "08-18-2017 06:05 PM", "replies": [{"postID": "post5928262", "text": "Z2 and max 2. They both have the s820 in them and where both released last year when the s820 was the top dog.", "time": "08-18-2017 11:57 PM", "replies": [{"postID": "post5928275", "text": "I'm assuming you mean the Leeco Max 2. If so, a Google search said that's their flagship phone. And it was $200 during a limited time promo. Not the same thing. Unless you mean a different phone ? Idk what a Z2 is", "time": "08-19-2017 12:06 AM", "replies": [{"postID": "post5929120", "text": "Its always on sale though. Right now it's $208. Price will fluctuate from high 100s to low 200s.http://m.geekbuying.com/item/LeTV-Le...ay-376308.html\nThe Lenovo zuk z2 has been on sale a few times under $200. You can buy the pro model with 128gb /6gb for $269 right now.", "time": "08-19-2017 07:50 PM", "replies": []}]}]}]}]}]}]}]}, {"title": "Pre-ordered", "thread": [{"postID": "post5750720", "text": "Howdy everyone new poster to the forums, but long term reader and listener of the podcast.\nJust pre ordered the Honor 8 Pro, so excited just wish i had the choice of red, but the blue is super nice.\nMostly used HTC devices always liked the near to stock android so how will i like EMUI?\nComing from S7 edge which I'm fairly bored of already and noticed noticeable processing slow down so the specs for the pro made me bite the bullet.\nWas going to hold off until the new one plus was announced but I'm far too impatient.\nHere's hoping Honor can fulfill all pre orders and on time.", "time": "04-09-2017 05:21 AM", "replies": [{"postID": "post5755579", "text": "Are you in the US?", "time": "04-12-2017 09:20 AM", "replies": []}, {"postID": "post5763792", "text": "I went from a regular s7 to the smaller Honor 8. EMUI has come a long way. When i got the Honor 8 it was EMUI 4.1 (I think) and it was perfectly functional but not the best. but within a week I was the EMUI 5.0 beta test and it was brilliant. I now much prefer it to Samsung's UI. On my s7 i always used nova launcher but on the Honor 8 I don't feel the need.\nExciting times, id love to get the Pro, but my 8 is only 6 months old so i can justify a new phone just yet.", "time": "04-17-2017 12:01 PM", "replies": []}, {"postID": "post5765457", "text": "Anyone know if it's coming to the USA?", "time": "04-18-2017 07:17 AM", "replies": []}, {"postID": "post5769904", "text": "Hi.\nHave you received your honor 8 Pro yet?\nIf so, how's it been? I'm definitely tempted....\nCheers.", "time": "04-19-2017 05:58 PM", "replies": [{"postID": "post5778649", "text": "No not yet, shipping from the 27th now.\nWill post my findings if/when i receive it. 👍", "time": "04-23-2017 01:38 AM", "replies": [{"postID": "post5859369", "text": "It has been some time now...Just checking to see if you have received it? And your thoughts on it?", "time": "06-22-2017 09:31 AM", "replies": [{"postID": "post5859827", "text": "Yeah finally received my phone almost a month late. Bad darts from Honor but they did send out some extra goodies to those affected.\nI think for a company trying to make an impression in other markets, ie the west the situation and bad press was not ideal.\nHaving said all that, over a month in I'm loving the phone. \nHaving had many phones over the years and coming from the Samsung galaxy edge this certainly isn't the most pleasing to the eye, but does have its charm.\nI think now I'm at a stage where I just want a solid phone, reliable, quick, battery power and decent photos.\nThe Honor 8 Pro does all of this very well, with no sign of slow down yet unlike my s7.\nFew things I would have liked, waterproofing and the smart fingerprint switch I hear is on the Honor 8.\nNo regrets and any other questions just fire my way.", "time": "06-22-2017 02:57 PM", "replies": [{"postID": "post5859913", "text": "Thanks for your thoughts. I think honor really nailed it with these latest phones. They are pretty good not far from phones priced much higher, but at a much lower price tag. Really at this point most people would be happy with these phones.", "time": "06-22-2017 03:56 PM", "replies": []}]}]}]}]}]}, {"postID": "post5754029", "text": "Welcome to the forums! And that's so exciting about your pre-order! The blue colour is gorgeous!\nWith regards to EMUI 5, there are users who really like it and those who really don't. It's a bit of an adjustment if you're coming from another OS or launcher. I personally like it, and liked 4.1. Of course, there are some things I'd change, but no software is perfect, in my opinion. 5.0 brings a lot of customization to the table for Honor, and you can also download EMUI Theme Editor from the Google Play Store to tweak your device even more.\nPlease let us know how you like your device when you get it! Enjoy!", "time": "04-11-2017 09:56 AM", "replies": []}, {"postID": "post5756921", "text": "No UK.", "time": "04-13-2017 03:45 AM", "replies": []}]}, {"title": "Would you jump?", "thread": [{"postID": "post5745159", "text": "This 8 Pro looks like a specs monster!\nHope it shows up for US users.\nWould you move up from the honor 8 if you could?", "time": "04-05-2017 01:34 PM", "replies": [{"postID": "post5783364", "text": "Looks like a Honor 8. Got the 8 and love it. Would not spend more money\nOn a pro.", "time": "04-25-2017 07:15 AM", "replies": []}]}, {"postID": "post5745286", "text": "I'd give it a go. Not sure if it will be released into the states but we will see.", "time": "04-05-2017 02:27 PM", "replies": []}, {"postID": "post5745338", "text": "Would have moved to this phone over the Mate 9 if it were available in the US 3 weeks ago.", "time": "04-05-2017 02:59 PM", "replies": []}, {"postID": "post5745453", "text": "I had to send my Mate 9 back for various issues including rebooting 6 times a day. I'll jump on this day one if it comes to the US", "time": "04-05-2017 04:09 PM", "replies": []}, {"postID": "post5745591", "text": "If we're unsure of whether or not it will be released into the States, then it probably won't come to Canada... Sad face!!\nIf I had to, I'm not sure if I'd jump; but I'd definitely try it out! It looks like a beautiful device. A machine in a beautiful body. Awesome! And the colours are amazing!", "time": "04-05-2017 05:55 PM", "replies": []}, {"postID": "post5745954", "text": "Unclear really. Not sure if it even will be released in the US yet. I would like to see Honor push updates to Honor 8 in a regular cadence to invest in them in future - so fingers crossed!", "time": "04-05-2017 10:37 PM", "replies": []}, {"postID": "post5746585", "text": "Completely. I live in the UK so availability isn't an issue. The only reason I'm not is that I only bought the Honor 8 5 months ago and it works perfectly still. I'm happy with the Honor 8, but would prefer the pro!", "time": "04-06-2017 10:53 AM", "replies": []}, {"postID": "post5746840", "text": "Very tempted by this device. I'm from the UK so can get one without any issues from the Honor website. The phone is currently being offered as part of a bundle with a tripod and 128gb memory card (and two other bundles) all for £474.\nI currently have a OnePlus 3 though so I'm not sure if the phones are going to be different enough to actually warrant purchasing the pro?!?\nIt's either go for the Honor 8 Pro or wait to see what the next OnePlus looks like.....Choices choices!", "time": "04-06-2017 01:19 PM", "replies": []}, {"postID": "post5747838", "text": "I don't think so, it's just too big for me. If I had no other choice, sure, but as long as Honor 8 exist, I would chose it over the Pro", "time": "04-07-2017 03:21 AM", "replies": [{"postID": "post5748068", "text": "I agree with you: it's quite a bit bigger than our Honor 8 devices. I'm using mine single handed right now - I think I would have difficulty doing that with an Honor 8 Pro.", "time": "04-07-2017 08:27 AM", "replies": []}]}, {"postID": "post5755223", "text": "I am in the market for a phone, my Nexus 5x died last week, and will purchase from the UK. My choices are\nAvailable now:\n- Honor 8 Pro\n- Huawei P10 Plus\nWait for:\n- Nokia 9\n- OnePlus 5\nObviously, the price of the H8P is really enticing, I like that the fingerprint scanner is on the back, the 4,000MAH battery and the QHD screen. The P10P is interesting, because of the better camera and, I am assuming, better support, despite the higher price. I don't like that the fingerprint scanner is on the front. But I think overall, I think it is a better looking phone.\nI am a huge Nokia fan, and so I very much would like to wait for the Nokia 9, but I can't be bothered with my crappy spare phone for that long. I do think it will be a killer phone though. Probably same with the OP5, although the rumours of the 3,000MAH battery and the large screen kind of put me off.\nSo, should I jump on an H8P??! Will I be happy with the camera? Does it feel like a premium phone? Do the Honor logos look better in real life (in the pics, they make the phone look a bit cheap in my opinion... I know it is a relatively inexpensive phone... but I don't want it to look cheap!).", "time": "04-12-2017 02:35 AM", "replies": []}, {"postID": "post5764607", "text": "Yep. Time to bid WM so long. Got a Mint 950xl with dock for a good price. \nHope the Honor 8P comes to the US also.", "time": "04-17-2017 06:06 PM", "replies": [{"postID": "post5782750", "text": "How was the 950 XL?! I've always loved WP but haven't had the chance to use one yet. Probably will in the future, but Android has me hooked for the time being.", "time": "04-24-2017 08:15 PM", "replies": [{"postID": "post5783641", "text": "It's a really good system. The live tiles are unique enough to catch the eye and the camera is one of the best I have seen.\nI have the 950 XL plus Docking Station and case for sale if you or anyone here is interested.", "time": "04-25-2017 10:05 AM", "replies": [{"postID": "post5783869", "text": "I love the live tiles! I really can't get enough of Windows' OS. I've always wanted to experience a WP.\nThank you! I'd love to, except I just bought my current phone four months ago... I need to cool it for a bit lool.  :P", "time": "04-25-2017 12:03 PM", "replies": []}]}]}]}, {"postID": "post5788133", "text": "I hope they bring this to the US", "time": "04-27-2017 11:38 AM", "replies": [{"postID": "post5796403", "text": "And to Canada!", "time": "05-01-2017 11:16 PM", "replies": []}]}, {"postID": "post5814383", "text": "I moved not from an Honor 8 but Nexus 5 and its a great phone, screen is huge compared to the Nexus 5. Still not sure if Ive made the right decision, could have got the OnePlus 3T for a little less plus the number of covers that are available on ebay and in the UK aren't in huge numbers (using the Chinese model name only 230, using honor 8 pro just over 1000) but maybe its because its not been out long.\nIts something I should have looked at before making the purchase.", "time": "05-14-2017 11:52 AM", "replies": [{"postID": "post5852116", "text": "I also hearing that the 8 Pro will not come with a warranty outside of markets where they are officially selling it (Asia and Europe).", "time": "06-15-2017 11:23 PM", "replies": [{"postID": "post5859357", "text": "Oh i don't want to deal with that again. I had an international h815 LG g4 which bootlooped and LG USA wouldn't honor the warranty because it wasn't a USA spec phone.", "time": "06-22-2017 09:18 AM", "replies": []}]}]}, {"postID": "post5831032", "text": "What about the honor 9 instead of the 8 pro. How many of you would get the honor 9 as opposed to the Pro 8? I've read where that is definitely being released.", "time": "05-28-2017 01:53 PM", "replies": [{"postID": "post5841652", "text": "Depends. If the rumours of the Honor 9 not having a headphone jack are true then not a chance! For me, it is a necessity.", "time": "06-07-2017 02:56 AM", "replies": []}, {"postID": "post5850270", "text": "Honor 8 pro not likely to be released on US so honor 9 for me. Honor 9 has OIS so good video shooting. Improved ram and cpu.", "time": "06-14-2017 11:31 AM", "replies": []}]}, {"postID": "post5850467", "text": "Love that the Honor 8 Pro moved to a front FPS.", "time": "06-14-2017 01:29 PM", "replies": [{"postID": "post5850624", "text": "It's shame that there is no US release for honor 8 pro though.", "time": "06-14-2017 03:20 PM", "replies": []}, {"postID": "post5859353", "text": "Yes!!! I am glad that Honor is bucking the trend of moving fps from front to back and doing the exact opposite! Front fps is much easier to use when on a desk.", "time": "06-22-2017 09:16 AM", "replies": [{"postID": "post5859557", "text": "Agreed. I hardly pick up my phone to use it when I'm at my desk.", "time": "06-22-2017 12:02 PM", "replies": [{"postID": "post5859568", "text": "Me too. I prefer fps.", "time": "06-22-2017 12:06 PM", "replies": []}, {"postID": "post5859617", "text": "There's always the smart lock option but it isn't as secure as fps, at least for me.", "time": "06-22-2017 12:37 PM", "replies": []}]}]}]}]}, {"title": "Honor 8 Pro", "thread": [{"postID": "post5798932", "text": "When will the Honor 8 Pro be offered by uk operators ?", "time": "05-03-2017 01:09 PM", "replies": [{"postID": "post5850465", "text": "Any updates?", "time": "06-14-2017 01:28 PM", "replies": []}]}, {"postID": "post5803299", "text": "Doesn't seem like it's yet, Three tend to deal the most in Honor/Huawei.", "time": "05-06-2017 12:10 PM", "replies": []}, {"postID": "post5859367", "text": "I don't really see these niche ultra high end phones selling outside of Asia...or at least that has been the trend for Androids", "time": "06-22-2017 09:29 AM", "replies": []}]}, {"title": "Honor 8 Pro vs. Mate 9", "thread": [{"postID": "post5747016", "text": "Which one is the better deal?\nI have the Mate 9 and paid full retail for it.\nDo you think the Mate 9 is worth the money over the 8 Pro?\nThe 8 Pro has a better screen and gobs of RAM among other similarities of the Mate 9.\nWill the 8 Pro's camera outperform the Mate 9 eventually?\nIs the reason the 8 Pro won't be available in the US because the Mate 9 still seems somewhat popular in the US?", "time": "04-06-2017 03:16 PM", "replies": [{"postID": "post5748119", "text": "Personally I prefer the Honor 8 Pro. Camera quality isn't my top priority, as long as the camera is pretty good, which most people say the Honor 8 Pro is, I'm happy.\nFor me the higher resolution screen, memory and storage combined with price makes it more attractive for me.\nThat said, I think the mate 9 is a cracking phone and if i already had one I'd probably stay with that.", "time": "04-07-2017 08:55 AM", "replies": []}, {"postID": "post5750638", "text": "Thats a tough choice. There are A LOT of similarities between the two devices as you can see in the list below. So for me it would probably come down to price. The Huawei Honor 8 Pro does have a higher screen resolution but that will make the battery life worse. So yeah. Its tough. Probably would go with 8 Pro because of price but if i had the cash, i would definitely take the Mate 9. Battery SizeProcessorRAMCamera Recording ResolutionPhysical Dimensions", "time": "04-09-2017 02:40 AM", "replies": []}]}, {"postID": "post5748593", "text": "I would have definitely gone for the 8 Pro if it were available in the US mainly because of price.\nMust say the Mate 9 I have has been a joy so far.", "time": "04-07-2017 01:59 PM", "replies": []}, {"postID": "post5754034", "text": "That is a very good question but also a difficult one to answer.\nThe Mate 9 is awesome but I feel like it's more of a phone for people who want the phablet experience. Though the 8 Pro is still quite large, I feel like it would still offer a different experience. I personally prefer the Pro and the Pro's specs over the Mate 9's; however, once we know more about the price for the Pro, I feel like it will be quite popular (I saw a Euro price tag but wasn't sure if that was correct as of yet).", "time": "04-11-2017 09:59 AM", "replies": []}, {"postID": "post5758450", "text": "Honor 8 Pro camera is the same one available in Honor 8. Without a doubt, Mate 9 camera is the best one compared to both. \nHonor 8 Pro camera specs: Dual 12 MP, f/2.2, phase detection and laser autofocus, dual-LED (dual tone) flash\nMate 9 camera specs: Dual 20 MP +12 MP, f/2.2, 27mm, OIS, 2x zoom, Leica optics, phase detection & laser autofocus, dual-LED (dual tone) flash", "time": "04-14-2017 01:10 AM", "replies": []}]}]
