[{"title": "How's your Dtek 60 doing?", "thread": [{"postID": "post6116999", "text": "My BlackBerry Dtek 60 is running smoothly so I've got to say I'll wait for a new BlackBerry slab next time. I know the Motion is out but I've had slabs like it before and even with Nougat on it I wasn't moved enough to get it the Dtek 60 just flies and that's why I'm going to stick with it for now. Anyone have any Dteks and are happy with it.", "time": "12-24-2017 01:48 PM", "replies": []}, {"postID": "post6125014", "text": "had one last year, keyboard fault and poor customer service pushed me to put it back into the box and have a Moto g5+ a far better phone and cheaper.", "time": "01-02-2018 01:47 PM", "replies": []}, {"postID": "post6125346", "text": "Thanks for your input.", "time": "01-02-2018 09:37 PM", "replies": []}, {"postID": "post6141246", "text": "I've had my dtek 60 for a while now it's a good phone . Only thing that bothers me is no Nougat update as of yet. The tablet I'm using now has received Nougat. That is just sad.", "time": "01-20-2018 12:42 PM", "replies": []}, {"postID": "post6142335", "text": "I agree with you the specs should be able to support the update to Nougat they just need to do it.", "time": "01-21-2018 10:13 PM", "replies": []}, {"postID": "post6156664", "text": "I just got the Jan. 5 security patch so the updates are still coming even if delayed. I'm still hoping for Nougat but as long as it's working I'll keep at it. C'mon BlackBerry Mobile release the Nougat update please we know the Dtek's can run it. If your no longer committed to the Dtek's then ask Google to do it.", "time": "02-07-2018 08:33 AM", "replies": []}, {"postID": "post6167235", "text": "I've had my Dtek60 for 8 months. The battery is it's biggest flaw right now. I got the January update, but still waiting for February, which some people say improves the battery. not holding my breath!!\nBut I hate to switch to another phone just yet, because the Dtek60 is otherwise excellent. The camera is quite good, the phone is super fast, and I especially love the BlackBerry VKB. I get so frustrated with my iPad keyboard. I keep trying to swipe to erase, or long press for caps!!\nBB9000>Q10>Z10>Z30>Z30>Classic>Dtek50>Dtek60", "time": "02-20-2018 06:02 AM", "replies": []}, {"postID": "post6167882", "text": "I bought my Dtek 60 outright so after spending that much money I'm not going to toss it I'm going to use it until it dies. Besides it's a good device.", "time": "02-20-2018 07:21 PM", "replies": []}, {"postID": "post6174480", "text": "just got the February update on my Dtek60. update went smoothly, keeping mine unless I get an amazing deal on a motion.", "time": "02-27-2018 11:53 PM", "replies": []}, {"postID": "post6175142", "text": "Me too I recently got the February security update too. It's great because I didn't have to jump through hoops this time. I'm going to keep the Dtek 60 since it cost so much until it dies. I'll pass on the Motion for now. But it does look good.", "time": "02-28-2018 04:36 PM", "replies": []}, {"postID": "post6186149", "text": "I'm a new convert to Blackberry flavored Android. A DTEK50 got me started (I traded for it) and I liked that so much I went after a refurb DTEK60. Bonus for me, I have the VR Headset from an Idol 4S Windows that I sold (buyer wanted a price break for no headset) and the DTEK60 fits it, naturally enough.\nHave had the DTEK60 about 3 weeks now. It's great hardware which I knew from the Idol 4S Windows. Camera is improved over the Idol because that one has no camera firmware and the default is to use the Qualcom drivers for camera. Screen res is better too.\nBattery endurance ain't as good as I4Swin though...\nBB Hub is the only thing that keeps me on Android as it allows me to run Outlook and keep Gmail off the phone for everything except Play services. Otherwise I just can't stand to have Google's hairy eyeballs all over my personal information. They really take advantage and are over the top, IMHO.\nAll-in-all it's great hardware, nice styling and the BB software touches are light enough and also very functional with the ability to pick and choose which bits you run.\nShe's a winner.", "time": "03-11-2018 07:57 AM", "replies": []}]}, {"title": "I just got the January security update for the Dtek 60.", "thread": [{"postID": "post6159603", "text": "Okay I'm aware it's February but it's finally nice to see that BlackBerry released the January security update. Actually they released it several weeks earlier but most folks couldn't update it unless they knew the Google play services work around. Now I'm hearing they are getting back on the update schedule and they're releasing the February security update in batches. I'm hoping for more to come.", "time": "02-10-2018 04:15 PM", "replies": []}, {"postID": "post6167239", "text": "I just got January on my Dtek60 last week. however, I got FEBRUARY on my Dtek50!!! The phone m using is the Dtek60. Go figure. My Dtek60 is always way behind the 50!! \nBB9000>Q10>Z10>Z30>Z30>Classic>Dtek50>Dtek60", "time": "02-20-2018 06:10 AM", "replies": []}]}, {"title": "is the 60 going to get Android N ?", "thread": [{"postID": "post5566337", "text": "???????? Yes or no", "time": "11-16-2016 07:34 PM", "replies": [{"postID": "post5589515", "text": "Obviously we can't say for 100% sure that it will get 'Nougat' but I would be very surprised if it didn't. Especially since its their latest Android Device. \nA droid a day keeps the Apple away", "time": "12-02-2016 06:06 AM", "replies": []}]}, {"postID": "post5566712", "text": "Definitely, \nIn fact itl get nougat , the version after nougat and the version after that,\nIl put my money on that as well because blackberry and software are brilliant ,\nBb10 devices of ancient times were supported. Nougat for blackberry was already sort of confirmed with the new mercury full pkb launching soon.\nHope that answers you,\nRather ask blackberry questions on crackberry, more help there and much more buzz and feedback.", "time": "11-17-2016 04:12 AM", "replies": []}, {"postID": "post5590595", "text": "99% will get nougat", "time": "12-02-2016 09:32 PM", "replies": [{"postID": "post5597049", "text": "100% will get Nougat", "time": "12-07-2016 11:13 AM", "replies": []}]}, {"postID": "post5650205", "text": "Here's hoping!!", "time": "01-20-2017 06:29 AM", "replies": []}, {"postID": "post5650274", "text": "The question is when ??", "time": "01-20-2017 08:29 AM", "replies": [{"postID": "post5655758", "text": "Seriously.", "time": "01-24-2017 09:36 PM", "replies": []}]}, {"postID": "post5669694", "text": "Shortly after the Mercury release I bet. Hopefully we'll see it in beta shortly.", "time": "02-06-2017 04:59 PM", "replies": []}, {"postID": "post5731752", "text": "Anybody got some info on when/if the DTEK60 is getting Android N? I got one coming in the mail tomorrow and am hoping for a quick upgrade to N. Do you think it would be 7.1.1 if it does get the upgrade?", "time": "03-29-2017 08:10 PM", "replies": [{"postID": "post5747940", "text": "Again, there is no official word yet from Blackberry as to which devices will be getting the Nougat update. \nHowever, if the DTEK60 were to get the update it will most likely be Android 7.1.1 since that's releasing with the KEYone at the moment. 😃", "time": "04-07-2017 06:18 AM", "replies": []}]}, {"postID": "post5931912", "text": "well my dtek bit the dust and my new Moto come with nougat installed. might even be getting android O.", "time": "08-22-2017 08:03 AM", "replies": []}, {"postID": "post6112443", "text": "I just got another Dtek 60 after my first Dtek 60 screen was shattered by an accident & Yes it's been over a year since they launched and yes there is still no OS update. So I'm still rockin the Marshmallow but as I see it I am not unhappy the phone simply works great. My personal hope is that someone working for BlackBerry would consider & figure out how to update or upgrade the Android OS for the Dtek line after all they put in the effort to help develop the phone with TCL when they turned over the specs and designs to them. I'll keep looking forward to the future with My Dtek 60 I'm glad it's more affordable now.", "time": "12-19-2017 07:57 PM", "replies": []}]}, {"title": "Forwarding text messages to another phone", "thread": [{"postID": "post6054293", "text": "I am used to having my messages from one iPhone forwarded to another via FaceTime. I’m planning on switching to blackberry dtek60 and motion or keyone. That is one of my biggest concerns though. While I know it’s possible to forward calls to another device, how do I do’s it with messages? Would I need an app?", "time": "11-04-2017 08:21 PM", "replies": [{"postID": "post6065928", "text": "Hey @MB64 😃 This thread doesn't get as much attention as the Samsung as LG threads do. Forwarding a SMS to another device is really simple on the DTEK60 or Blackberry Motion. \nSimply open the default 'Messages' app that comes with the phone. Then Long press on the message you want and hit the little arrow at the top which is pointing to the RIGHT. \nThen select the contact you want to forward the message to 😃 If you have any other questions just tag me with @Matty and I should reply soon. Just busy with exams at the moment so things are a little slower right now. \nHope this helps.", "time": "11-12-2017 01:02 AM", "replies": []}]}, {"postID": "post6056635", "text": "Anyone?", "time": "11-06-2017 11:28 AM", "replies": []}]}, {"title": "Google Voice", "thread": [{"postID": "post5885291", "text": "Hi, \nI have a DTEK60 and by default the home button opened Google Voice search, but I install Cortana to try it, now when I go into voice settings to set Google back it's the browser search that is displayed not just the voice option... does anyone know of any way to get this option back.\nCheers", "time": "07-14-2017 03:46 PM", "replies": []}, {"postID": "post5885391", "text": "Moved from the Android Apps forum to the DTEK60 forum, since the former is intended for developers to promote their apps.", "time": "07-14-2017 05:17 PM", "replies": []}, {"postID": "post6065908", "text": "In settings search \"assist app\". It's buried in default apps.", "time": "11-12-2017 12:44 AM", "replies": []}]}, {"title": "I saw more retailers are selling the BlackBerry DTek 60 and it's accessories.", "thread": [{"postID": "post5673288", "text": "If your interested in buying the BlackBerry DTek 60 and it's accessories checkout the new deals at Bestbuy and Walmart's online stores it's looking competitive. So good for the customer all around I think.", "time": "02-10-2017 12:05 AM", "replies": [{"postID": "post5876818", "text": "In the US? Thanks.", "time": "07-07-2017 12:22 PM", "replies": []}]}, {"postID": "post5675313", "text": "Thanks for the heads up @Ha P McBroom , it's always a good day when you see some Blackberry devices in stores.  The DTEK60 recently came to a local store for me in Africa and it's great to see. It was marked 'Special Import' but its there and ready to be sold! Hopefully with the launch of the upcoming 'Mercury' stores will be giving Blackberry another chance.", "time": "02-12-2017 01:10 AM", "replies": []}, {"postID": "post5818041", "text": "No such luck here in the UK. If it ain't on line it don't happen.", "time": "05-17-2017 04:55 AM", "replies": []}]}, {"title": "DTEK60 versus the competition", "thread": [{"postID": "post5478534", "text": "Just a little perspective on what's the competition like in Canada based on the MSRP.\n- DTEK60 (SD820 Lite/4GB/32GB/1440p) is going for $699\n- HTC 10 (SD820+/4GB/32GB/1440p) is going for $999\n- HTC A9 (SD617/3GB/32GB/1080p) is going for $649*\n- Moto Z (SD820+/4GB/64GB/Modular/1440p) is going for $899*\n- Sony Xperia X Perf (SD820+/3GB/32GB/No Fingerprint/1080p) is $699\n- Samsung Galaxy S7 (SD820+/4GB/32GB/1440p) is $750\n- Nexus 6P (SD810v2/3GB/32GB/1440p) is $699\n- HTC Google Pixel (SD821/4GB/32GB/1080p) is $899\nAll prices in*CAD, either fully unlocked direct or month-to-month with a carrier. I left out the Chinese \"flagship killers\" because while hardware they are comparable, retail availability is a bit tricky and warranty becomes an issue to ship it overseas.", "time": "10-09-2016 09:27 PM", "replies": [{"postID": "post5601532", "text": "SD820 lite? Where is this from?", "time": "12-10-2016 01:55 AM", "replies": [{"postID": "post5604560", "text": "Great question. There are actually 2 variants of the Snapdragon 820 processor: \nMSM8996 \"lite\" \nMSM8996 'standard' \nThe are a couple key differences.\nThe first being the GPU Freq. (MHz) which is at\n510MHz for the 'lite\" \n624MHz for the 'standard. \nThe CPU clock speed is also a bit slower. \n1.8 + 1.36for the 'lite\"\n2.15 + 1.6 for the 'standard' \nWhen we looking at memory bandwidth (GB/s)\n1333*MHz (21.3*GB/s) for the 'Lite\"\n1866*MHz (29.8*GB/s) for the 'Standard' \nThere are a couple more small things but it's basically a watered down 820 with a little less power \na droid a day keeps the Apple away", "time": "12-12-2016 01:30 PM", "replies": []}, {"postID": "post5611192", "text": "Just a moniker I came up with, but just indicating it's not the same 820 as others, as it's underclocked and lower binned.", "time": "12-17-2016 10:58 AM", "replies": []}]}]}, {"postID": "post5483431", "text": "Do any of these other phones have a fixed focus front camera?\nThis one needs to be a goodie. No room for compromise here.\nPosted via Android Central App", "time": "10-11-2016 12:59 PM", "replies": []}, {"postID": "post5484174", "text": "I have to admit i think BB is pricing a phone in the ballpark from the get go for a change!", "time": "10-11-2016 04:23 PM", "replies": [{"postID": "post5484747", "text": "I just hope the Mercury will follow this trend as well. If it's priced decently (i.e. right in between of the DTEK50 and 60), I'll buy that one as a backup to my Priv, supporting the PKB.", "time": "10-11-2016 07:45 PM", "replies": []}, {"postID": "post5495371", "text": "Agreed. BlackBerry haven't been know in the past for their 'appropriate' pricing but I think with the DTEK50 and DTEK60 and t outsourcing deal, it's helped them a lot. Hopefully down the road we can get some device with branding on the front.", "time": "10-15-2016 01:23 PM", "replies": []}]}, {"postID": "post5495726", "text": "Got rid of the Note 7, and I'm definitely going back to BlackBerry, i want some added security, and simplicity period \nPosted via Android Central App", "time": "10-15-2016 04:13 PM", "replies": []}, {"postID": "post5496336", "text": "IMO, I think the DTEK60 is priced really well. Compared to the competition the specs are almost the same. I was a long time Blackberry user. This might bring me back..", "time": "10-15-2016 10:29 PM", "replies": []}, {"postID": "post5497785", "text": "So when is the BlackBerry dtek 60 going to be released in Canada?? Also will all the carriers have them? Or will it be available online only thank you\nPosted via Android Central App", "time": "10-16-2016 04:07 PM", "replies": []}, {"postID": "post5508131", "text": "This phone branded 'Kodak Ektra' (don't laugh) is getting a lot of attention in the UK online press today. The new Kodak Ektra is a smartphone that looks a bit like a classic rangefinder camera", "time": "10-20-2016 09:23 AM", "replies": []}, {"postID": "post5520209", "text": "Gotta say ; i woulda preferred $650 CDN, but, $699 is fine. \nBlackBerry's Nexus - like version of Android is a treat.", "time": "10-24-2016 04:31 PM", "replies": [{"postID": "post5525081", "text": "And it is indeed $650...", "time": "10-26-2016 10:25 AM", "replies": []}]}, {"postID": "post5552871", "text": "Awesome device and prices", "time": "11-08-2016 10:11 AM", "replies": [{"postID": "post5555634", "text": "Have to agree feels weird having such a thin device especially compared to PRIV and S7edge my other device but I do really enjoy using it", "time": "11-10-2016 03:43 AM", "replies": []}]}, {"postID": "post5557545", "text": "Absolutely, at $650 this phone blows away others with similar specs. Aside from not being waterproof, specs are on par other flagship and the security features truly set it apart from the competition. \nOP should update his intial post with correct price, $650 also includes case and rapid charger!", "time": "11-11-2016 06:27 AM", "replies": []}, {"postID": "post5559960", "text": "nice phone. I would get it if I did not own priv and loved it so much... but if you still own bb10 phone or you are for update I do think that this phone is awesome alternative", "time": "11-12-2016 05:13 PM", "replies": []}, {"postID": "post5628877", "text": "Is it still worth buying with the variants being different?", "time": "01-02-2017 11:17 AM", "replies": []}, {"postID": "post5854097", "text": "Any good?", "time": "06-17-2017 05:57 PM", "replies": []}]}, {"title": "March security patch", "thread": [{"postID": "post5706048", "text": "Over 70 patches. BlackBerry Android smartphones getting March security patch", "time": "03-09-2017 10:04 AM", "replies": []}, {"postID": "post5706059", "text": "Still love that they're keeping up on these patches. Good job", "time": "03-09-2017 10:08 AM", "replies": [{"postID": "post5708268", "text": "Agreed, it's like clock work. Very proud of Blackberry and also great to see that 70+ patches were made. Lots of work being done. Also, its nice to receive the patch on the 4th and it says I'm patched for the 5th. Its like I'm patched for future vulnerabilities that haven't been made yet  haha", "time": "03-11-2017 12:54 AM", "replies": []}]}, {"postID": "post5709703", "text": "Mine turned up last week on 10th, no problems at all.", "time": "03-12-2017 10:13 AM", "replies": []}, {"postID": "post5756788", "text": "Still no update in UK for us!", "time": "04-12-2017 11:43 PM", "replies": [{"postID": "post5762885", "text": "March or April? If April, everyone's in the same boat, but if you really want the March update you can load a factory image from the website.", "time": "04-16-2017 08:34 PM", "replies": []}]}, {"postID": "post5802921", "text": "Nothing on O2 UK for April. Mind there's talk of the an update already hitting the dtek50 over on crackberry. \nThink they're boasting 😉", "time": "05-06-2017 05:10 AM", "replies": []}]}, {"title": "Is There a Setting or a Way to Keep Calendar Notifications on Screen Until Dismissed?", "thread": [{"postID": "post5701007", "text": "Is there a way to keep calendar pop up notifications on screen until dismissed, like it was on BB10?\nThanks in advance for your assistance!", "time": "03-06-2017 07:42 AM", "replies": []}, {"postID": "post5701266", "text": "Welcome to Android Central! Are you talking about notifications in the status bar at the top of the screen? Those should remain until you swipe them away (after swiping down the notification panel).", "time": "03-06-2017 11:07 AM", "replies": []}]}, {"title": "how to transfer s planner to blackberry", "thread": [{"postID": "post5697503", "text": "Transfer samsung s5 s planner to Blackberry dtek60 calendar", "time": "03-03-2017 12:06 AM", "replies": []}, {"postID": "post5700798", "text": "Can you share it via Bluetooth?", "time": "03-06-2017 12:35 AM", "replies": []}]}, {"title": "already laggy issues with DTEK60", "thread": [{"postID": "post5576621", "text": "So i ve had my DTEK60 for about two weeks now and at first the phone seemed pretty good. Now I'm noticing considerable lagging when switching between apps like accessing the hub or trying to play a video from my SD card. Totally stops responding and so far get a system ui not responding. And get this just a week into my new phone I try playing a youtube video thru Google Chrome and the browser stopped responding. Finally when it started responding again I tried again and same bs. So I tried the youtube video app and just as bad. Couldnt play the same video as it wasn't responding! I was like wow ok let's try Firefox. Installed it and it worked. Man does Android suck. Just earlier today I'm trying to play a video and go back it's not responding. Try the back button and nothing so I try the home button and nothing. System blackouts or something and now I'm back at the home screen showing all my apps but the wall paper is black, no time, signal, battery and etc showing. So I do restart.\nSince this phone has newer hardware way better processor (quad core vs dual core) and more ram (4 vs 2) than my z30 I would expect this phone running butterly smoother especially with no lagging system not responding this earlyof having the phone. Never had this problem on day 1 or day 20 with my z10 when it was first released or when I upgraded to my z30 back in February of 2014!\nI guess its true what they say Android requires high specs just to run decent and that's why it's all about hardware specs for Android phones. BB10 and iOS don't need such high cpu, gpu and ram specs to run their OS's smooth.", "time": "11-23-2016 08:00 AM", "replies": [{"postID": "post5683767", "text": "Every week or so perform a hard reboot by holding down the power button until the phone switches off.\nThis will clean up the mess Android makes of itself and restore performance", "time": "02-19-2017 01:50 PM", "replies": []}]}, {"postID": "post5576681", "text": "I agree with the last paragraph completely, these issues you speak of sometimes happen with my note5 as well. It can be hard and frustrating to deal with the issues but it's just the package that comes with the Android OS. You are completely right though BB10, IOS and WP10 they don't have these issue so much. They don't need the higher specs to function. Whereas android is a memory hogger...it will hog your memory like no other OS lol. It always happens.", "time": "11-23-2016 08:52 AM", "replies": []}, {"postID": "post5583097", "text": "What o/s are you running ?", "time": "11-28-2016 08:55 AM", "replies": [{"postID": "post5597835", "text": "I'm running Android 6.0.1.\nHonestly Android sucks. So not impressed how the phone lags so much and the phone is new. Way better specs than my old z30 but the z30 run much smoother especially in the beginning even though BB10 was still buggy. If it's not the OS not responding it's the apps that are seriously lagging. My friend had the same problem with his note 7 after two weeks that it was lagging. I figured probably bec of Samsung's software like most manufacturers installing so much bloatware. He returned for an iPhone 6 plus and is so much happier. I didn't think I would be experiencing such lagging issues and system not responding like I am. As I said in the beginning of this thread that Android is all about specs. Like the specs this phone has I shouldnt have any lagging not responding issues this early. I shouldnt have to reload /reset to factory defaults or reinstall my apps to fix this. Android may have the customizations over iOS but iOS seriously has the optimization over Android running much smoother on a less spec out phone.", "time": "12-07-2016 07:40 PM", "replies": []}]}, {"postID": "post5684798", "text": "My 60 sits idly by after I got Huawei Mate 9 and iPhone 6S Plus. Both best the pants off. Really wanted to go with Blackberry too.\nI don't think it's memory, though it might, or hung threads. \nIn case you want another browser option I cannot fault Ghostery at all. Also my router has built-in firewall option to filter out adservers which helps. \nFinding perfect phone software and hardware is expensive pursuit.", "time": "02-20-2017 12:49 PM", "replies": []}]}, {"title": "Is it real or vaporware?", "thread": [{"postID": "post5511047", "text": "Is it real, or is it just vaporware? Is it actually being sold anywhere?", "time": "10-21-2016 08:24 AM", "replies": [{"postID": "post5514387", "text": "It's 100% real and you wil be able to pick up the device in stores Early November. With the launch late October (25th I think)\nA droid a day keeps the Apple away", "time": "10-22-2016 11:30 AM", "replies": []}]}, {"postID": "post5513301", "text": "It's real but just hasn't been officially announced by BlackBerry yet. Latest rumored date is October 25th.", "time": "10-21-2016 10:05 PM", "replies": []}, {"postID": "post5677304", "text": "It's available now at some online retailers.", "time": "02-13-2017 08:25 PM", "replies": []}, {"postID": "post5678398", "text": "I got mine from B&H. They have a good deal right now.", "time": "02-14-2017 07:49 PM", "replies": [{"postID": "post5679576", "text": "With the free accessories.", "time": "02-15-2017 06:28 PM", "replies": []}]}]}, {"title": "data transfer", "thread": [{"postID": "post5656198", "text": "I'm due to change my Priv for the Dtek60 tomorrow as I dropped the Priv and this is what they are replacing it with. Will it transfer the data over like normal android phones do ?", "time": "01-25-2017 08:34 AM", "replies": []}, {"postID": "post5656802", "text": "Have you looked at the BlackBerry Content Transfer app?\nFor your Google data (e.g., Google Contacts, Google Calendar, etc.), as long as you log into the new phone with the same Google account, that data should sync if you ask it to. The Setup Wizard should ask you if you want to sync the data during the first-time setup of the phone.", "time": "01-25-2017 05:46 PM", "replies": []}, {"postID": "post5666109", "text": "You can try SmartIO App to transfer contacts it does handles contacts duplication too.", "time": "02-03-2017 12:55 AM", "replies": []}, {"postID": "post5668020", "text": "Just make sure you export your password keeper to your sd card and import to your new device", "time": "02-04-2017 09:56 PM", "replies": []}]}, {"title": "DTEK60 Sync with Outlook - software", "thread": [{"postID": "post5558504", "text": "OK, I'm starting to investigate going Android and prefer the DTEK60 since I'm used to BB 10 Hub et al.\nI have two main issues to deal with (other than learning Android & losing Remember/Evernote account.)\n1. Looking for the best sync software that allows my Outlook (local/desktop not Outlook.com and NO interest in going through Google) to sync one way to the Device?\n2. I'm with VZW and while I'd like to stay with them, I am willing to switch to AT&T since the phone is GSM... unless there's a way to stay with VZW with BYOD.\nCurrently using BB Z30. I have zero interest in iPhone.", "time": "11-11-2016 04:12 PM", "replies": []}, {"postID": "post5559693", "text": "I used to do this on my BB10 device, but synced my desktop outlook account with outlook.com Nd it works perfectly, contacts, calender, emails etc, though I set phone NOT to delete mail on server as I manage my mails on my desktop, phone is more for access when away from office", "time": "11-12-2016 01:32 PM", "replies": [{"postID": "post5563999", "text": "Not interested in Outlook.com, but thanks.", "time": "11-15-2016 10:08 AM", "replies": [{"postID": "post5588431", "text": "I'm sync'ing my DTEK50 with Outlook 2016 on Windows 10 through Outlook.com. Once you get it setup, you can forget about Outlook.com. It works far better than manual updates with Link every did. Everything updates automatically both ways within seconds.", "time": "12-01-2016 12:47 PM", "replies": []}]}]}, {"postID": "post5563555", "text": "1. You can use Akruto to sync Outlook with your DTEK60 (actually it provides two-way syncing but you can switch to one-way if you want). The software works via Wi-Fi or over the Internet (without cloud).\n2. I guess, there’s actually a way for you to stay with Verizon since they have BYOD. See this link.", "time": "11-15-2016 02:51 AM", "replies": []}, {"postID": "post5563995", "text": "I did Chat with VZW and they said it has to be CDMA to be compatible with their network, which is what I suspected. \nGSM will not work on Their network.\nOf course, when you're out of the country their phones must work on GSM since the rest of world and many in US are GSM - just not the other way around.\nGuess I'll head over to AT&T", "time": "11-15-2016 10:06 AM", "replies": []}]}, {"title": "Review of TCL950 (DTEK60's base) from China", "thread": [{"postID": "post5497271", "text": "Sorry for the link in Chinese only: TCL 950内涵商务旗舰手机评测：平衡兼顾，难得不土豪\nSome highlights:Probably mentioned in a lot of places, this has a 1920x1080 screen, not the same as the DTEK60. It'll come with a 2560x1440 screen instead.And of course, BlackBerry's software will replace TCL's, so you can ignore the middle part.Phone can be used upside down, there are earpieces and microphone top and bottom. Probably applies to the DTEK50 as well since they are pretty much the same design.Performance was described as \"balanced\". There are some benchmarks in pictures.Some warmth has been felt (around 43.3 C) near the camera after running 15 minutes of NBA 2K17. So I'm expecting people and \"expert reviewers\" running around yelling \"ZOMG IT OVERHEATS\" like the Priv.Storage is eMMC, NOT UFS 2.0 like most flagships of 2016, so it's a bit slower. Reviewer says it's acceptable in subjective overall performance.Camera samples near the bottom in the article. But should note that this is with TCL's software, BlackBerry's version may have a different tuning. So far night performance actually looks decent.Chinese version comes with both JBL headphones (reviewer didn't like them too much though) and a Quick Charge 2.0 charger. Don't think DTEK60 will come with the headphones, but based on B&H's listing earlier, early orders will come with BlackBerry's QC 2.0 charger as a gift.7", "time": "10-16-2016 11:46 AM", "replies": []}, {"postID": "post5514397", "text": "To be honest, most earphones that come with phones are not great. They certainly get the job done but I would invest in $100+ headphones to head a better experience. \nI don't mind if it has the \"old\" memory. I'm sure it will perform fast enough for most of the customers \nA droid a day keeps the Apple away", "time": "10-22-2016 11:35 AM", "replies": [{"postID": "post5552891", "text": "Ya I got a nice 150 dollar bose headphones. never use the cheap in box ones. Sound difference is astonishing", "time": "11-08-2016 10:20 AM", "replies": []}]}, {"postID": "post5520188", "text": "Definitely want the BlackBerry version! \nAs for the memory performance, enough is listed as different that wait and see is the way to go... \nBB 4 EVER.", "time": "10-24-2016 04:25 PM", "replies": []}]}, {"title": "Dtek60 now official", "thread": [{"postID": "post5521826", "text": "Glad to finally hear that the Dtek60 is officially announced and available for order. ShopBlackBerry Online Store - Products\nPosted via Android Central App", "time": "10-25-2016 07:39 AM", "replies": []}, {"postID": "post5521851", "text": "Are you going to get one?", "time": "10-25-2016 07:51 AM", "replies": []}, {"postID": "post5521862", "text": "Yup, perhaps 2. At first I was iffy about this phone but when the rumored specs came out it compared really well with what is already out in the market. BlackBerry is also great with security updates.\nPosted via Android Central App", "time": "10-25-2016 07:57 AM", "replies": []}, {"postID": "post5524833", "text": "I haven't seen any information on this yet. Do we know if T-Mobile with sell this? Looks like it's available to purchase online with BlackBerry so far only.", "time": "10-26-2016 08:58 AM", "replies": []}, {"postID": "post5529592", "text": "Ordered it from Shop BlackBerry - shipped yesterday.", "time": "10-28-2016 12:40 AM", "replies": [{"postID": "post5532323", "text": "Let us know your thoughts. It looks interesting.", "time": "10-29-2016 10:45 AM", "replies": [{"postID": "post5540899", "text": "Very sleek much quicker and responsive then the Priv was so far does have far better specs though took an hour and 10 to charge from 1% battery so far enjoying it miss the uniqueness of the Priv but the DTEK60 is a nice device", "time": "11-02-2016 07:32 AM", "replies": []}]}]}, {"postID": "post5533452", "text": "So far reviews are decent. Specs are the same as the S7 for less money. \nI'm very interested but where can I try one out?", "time": "10-29-2016 09:18 PM", "replies": []}, {"postID": "post5540975", "text": "Sound positive, being better than the priv. Hmm... A bit long to charge though? As far as I'm aware, I believe it has quick charge 3.0 can you confirm this?", "time": "11-02-2016 08:21 AM", "replies": []}, {"postID": "post5541218", "text": "It is compatible but the battery that comes in the box is 2.0 not 3.0 haven't tried the rapid charger yet but think that's 2.0 as well", "time": "11-02-2016 10:35 AM", "replies": []}]}, {"title": "DTEK60 Preorder now up on B&H", "thread": [{"postID": "post5482983", "text": "https://www.bhphotovideo.com/c/produ...cUvbUpU5482983\n$499, includes free Quick Charger and Case.", "time": "10-11-2016 10:51 AM", "replies": []}, {"postID": "post5485878", "text": "Pre order has been taken down.\nPosted via Android Central App", "time": "10-12-2016 07:32 AM", "replies": [{"postID": "post5495393", "text": "I think certain website have been told to do this just to create some hype about the device. Too many websites are 'accidentally' leaking photos and Pre-order prices. I like that it comes with a free case. That's a always a plus in my book", "time": "10-15-2016 01:31 PM", "replies": []}]}]}]
