[{"title": "Battery life", "thread": [{"postID": "post5921728", "text": "How is everyone's battery life so far? I know its only been 24 hours, but just seeing how the Active is holding up so far.", "time": "08-12-2017 05:38 PM", "replies": []}, {"postID": "post5921819", "text": "People won't see an average battery life curve for about a week of use.", "time": "08-12-2017 07:44 PM", "replies": [{"postID": "post5921916", "text": "I agree with Golfdriver97... don't even try to test your battery life until you've given the phone a chance to settle into a pattern and let you get used to the phone.", "time": "08-12-2017 10:58 PM", "replies": []}]}, {"postID": "post5921871", "text": "Here is my battery stats so far. Nothing major as I haven't had it long but here it is after 1 day.", "time": "08-12-2017 09:13 PM", "replies": []}, {"postID": "post5922741", "text": "that's exactly why you want to wait at least a week right now you'll be playing with it every day all . give it some time to settle in", "time": "08-13-2017 08:54 PM", "replies": []}, {"postID": "post5922844", "text": "I'm already getting two days and just got it Friday. With the 835 and 4000mah this thing will go forever.", "time": "08-13-2017 11:35 PM", "replies": [{"postID": "post5923169", "text": "Awesome - great to hear! Keep the reports coming people... talk me into saving myself some $$$ and buying one BEFORE the Note 8 hits the Market!", "time": "08-14-2017 10:18 AM", "replies": []}]}, {"postID": "post5927833", "text": "Happy to report that after almost a full week of \"standard\" use for me, I lose about 4-5% per hour. that's with a mix of screen on/text, a little bit of games and a lot of listening to music. No WiFi and I work in a minimal signal building (lead box style). \nEach day I go to bed with 30-40% left. Beats my VZW Note 5 which needed a bump charge by 2PM.", "time": "08-18-2017 02:33 PM", "replies": [{"postID": "post5927858", "text": "GREAT to hear... thanks for the Report. Sounds like it's going to be a winner like it's predecessor (in the Battery life department)!", "time": "08-18-2017 03:01 PM", "replies": []}, {"postID": "post5929063", "text": "Are you using it with Always On Display? 4% to 5% per hour is kind of a lot. I'd be curious to hear if there would be additional battery savings if AoD were to be turned off.", "time": "08-19-2017 06:28 PM", "replies": [{"postID": "post5930676", "text": "I have AoD on, and display at just under 50% brightness. Again, remember, I'm listening to local files the whole time and my signal inside the building is in is terrible. I actually really like the AoD being on as I don't turn on the screen to see what type of messages I might have and I use the calendar all the time.", "time": "08-21-2017 10:56 AM", "replies": []}]}]}, {"postID": "post5929263", "text": "I'm running about 2-3% an hour here, I do have some apps disabled with package disabler too. I use AOD and Bixby as well. Overnight without use it burns .8% an hour and my SOT is probably about 7 hours, I could easily get two days out of this device with decent usage.", "time": "08-20-2017 12:13 AM", "replies": [{"postID": "post5929772", "text": "Agreed... when I first got my 7, I ran AOD and I shut it off after about 2 months and saw a significant increase in battery life! I'm sure it would be the same with the 8!", "time": "08-20-2017 01:09 PM", "replies": []}]}, {"postID": "post5930056", "text": "My battery life so far. Not bad at all.", "time": "08-20-2017 06:42 PM", "replies": []}, {"postID": "post5930195", "text": "This is good information. Could anyone that posts battery info also tell us what your screen brightness setting is at along with the screen shots showing screen on time?", "time": "08-20-2017 09:20 PM", "replies": []}, {"postID": "post5934523", "text": "How is it that you have a dark mode type screen shot.", "time": "08-23-2017 07:33 PM", "replies": [{"postID": "post5935017", "text": "Samsung themes", "time": "08-23-2017 11:47 PM", "replies": [{"postID": "post5949682", "text": "Which theme?", "time": "08-31-2017 08:06 PM", "replies": []}]}]}, {"postID": "post5940549", "text": "My wife's first full day with her active. 30% battery used and 5:37 hours of SOT. Amazing. She's been using it for candy crush and she syncs 3 imap accounts and one office365 account with mail, contacts, and calendar. \nI thought my s8+ was awesome with battery but her active is even better.", "time": "08-26-2017 08:14 PM", "replies": [{"postID": "post5942155", "text": "Glad to hear!", "time": "08-27-2017 11:28 PM", "replies": []}]}, {"postID": "post5949680", "text": "Which theme", "time": "08-31-2017 08:04 PM", "replies": []}, {"postID": "post5963467", "text": "S8 active battery life is more good than S7 edge (My Old phone)", "time": "09-08-2017 03:29 AM", "replies": []}, {"postID": "post6100974", "text": "I got my S8 Active on Monday for T-Mobile and my battery life has lasted me 2 days easy. I charge up my phone every other day and I love it!", "time": "12-08-2017 10:10 PM", "replies": []}, {"postID": "post6175856", "text": "Seems like the battery life is awesome on this device. I cant wait for mine to be delivered tomorrow. I bought the new dbrand black camo and a glass screen protector for it. Hopefully it can last as long as my BlackBerry Motion", "time": "03-01-2018 11:40 AM", "replies": []}, {"postID": "post6183974", "text": "Anyome else having android system drain a lot of your battery?", "time": "03-09-2018 06:32 AM", "replies": []}]}, {"title": "VR headset for Galaxy S8 Active", "thread": [{"postID": "post6174414", "text": "Hey everyone,\nI've been doing some digging but can't find an answer anywhere. I'm basically looking for a phone VR headset that can HOLD the Samsung Galaxy S8 Active. I know full well at this point that VR gear is not compatible. The app I plan to use is for drone flight, and doesn't require the headset to be directly connected or compatible, just that I be able to have the phone held up to my eyes, allowing me a first-person view of what's on camera, my drone controller taking care of the rest. Seems like all the tech forms are saturated with people looking for full-on VR compatibility. Not the case for me. Any help finding a very basic headset would be greatly appreciated!", "time": "02-27-2018 09:34 PM", "replies": []}]}, {"title": "S8 Active Cases", "thread": [{"postID": "post5920644", "text": "Yes, even \"rugged\" phones benefit from a case( and screen protector ) . \nAnybody come across nice cases yet? Post your favorite case/s you found. Pic's of the S8 Active with a case would be great too!", "time": "08-11-2017 02:56 PM", "replies": [{"postID": "post6027916", "text": "Cases aren't actually needed, the S8 Active is able to withstand drops. The only thing is it'll leave a mark or blemish. Best to go with a thin case.", "time": "10-19-2017 03:56 PM", "replies": []}]}, {"postID": "post5920653", "text": "Spigen Rugged Armor", "time": "08-11-2017 03:11 PM", "replies": []}, {"postID": "post5920670", "text": "I emailed I-Blason about an hour ago - I have their Unicorn Beetle Clear (Black) case on my S7 Active and love it. It looks almost identical to the phone... like a second skin. However, they show no signs today of any activity towards the S8 Active so I asked. No reply as yet... I'll post when they do. It's a really nice case!", "time": "08-11-2017 03:43 PM", "replies": [{"postID": "post5920736", "text": "Yeah, let us know if you hear anything. I have the same case and phone now. Really like it.", "time": "08-11-2017 04:57 PM", "replies": [{"postID": "post5921015", "text": "Those corners are padded great - I've dropped the phone and it's landed on one corner and then cartwheeled for about three revolutions and come up with no damage!!!", "time": "08-11-2017 11:00 PM", "replies": []}]}]}, {"postID": "post5920774", "text": "Speck put out a clear case for the S8 Active. They had it at AT&T but I didn't buy it. I might go back and buy it this weekend.", "time": "08-11-2017 05:33 PM", "replies": [{"postID": "post5929957", "text": "I ran speck cases on my S3. Not a clear one, the hard/soft composite cases. They lasted a few months then started to disintegrate, the hard plastic would crack at the thin spots. I got a homogeneous body glove case from the ATT store when I picked up the S6 active. 2 years later it looks new. I'll be looking for another like that.", "time": "08-20-2017 04:22 PM", "replies": []}]}, {"postID": "post5921016", "text": "Got the Speck case. Doesn't fit properly. Can squeeze the sides and feel it creaking.", "time": "08-11-2017 11:03 PM", "replies": []}, {"postID": "post5921032", "text": "Guess I need a screen protector for it. Already noticed some little scratches on the screen. Weird, because my S8+ doesn't have a screen protector and it has zero scratches.", "time": "08-11-2017 11:38 PM", "replies": []}, {"postID": "post5921135", "text": "I got the Bodyguardz Ace Pro because that is what they had at AT&T when I picked up the phone. Fits fine, looks great, however the buttons on the side of the phone are too subtle. It is difficult, without looking, to know which button is which. I'll likely change the case as soon as I can.\nBody Glove tempered glass screen protector is really nice and barely noticeable.", "time": "08-12-2017 04:13 AM", "replies": []}, {"postID": "post5921138", "text": "double post", "time": "08-12-2017 04:17 AM", "replies": []}, {"postID": "post5923516", "text": "iBlasson is finally showing their cases - here's the link for the Unicorn Beetle. You can back out once you're there - they have two others I think for the S8 Active!http://forums.androidcentral.com/e?l...token=8qy93tMO", "time": "08-14-2017 04:36 PM", "replies": [{"postID": "post5923576", "text": "Nice! Wish they had a solid black back but not a big deal.\nAlso, just scroll down on that page. Show 2 other cases for the S8 Active.", "time": "08-14-2017 05:10 PM", "replies": []}, {"postID": "post5982649", "text": "I picked up one of these from Amazon a couple weeks ago. Buttons are much better than the other case I had.", "time": "09-19-2017 08:22 AM", "replies": [{"postID": "post5983149", "text": "Ordered the UB Pro for my Note 8 but iBlasson is inundated with orders - it was supposed to be here between 9/13 and 9/15 so I'd have it when I picked up my Note 8 on the 15th. WRONG - delayed until the 21st now! Had to buy a cheap plastic no-name case at AT&T for $34 just to bring it home in!", "time": "09-19-2017 01:45 PM", "replies": [{"postID": "post5984849", "text": "F-I-N-A-L-L-Y! A DHL Update... looks like my case should be here Saturday!\n...I had to get creative with the \"TO\" address so as not to publish my address for the whole world to see!!!", "time": "09-20-2017 12:31 PM", "replies": []}]}]}]}, {"postID": "post5940584", "text": "I have watched a few review on the S8 Active. The biggest concern was that the Gorilla Glass glass has a plastic coating and scratches very easy. Number 1 suggestion was to put on a tempered glass screen protector. Bought two phones and two screen protectors. Pretty pricey at $40 each.", "time": "08-26-2017 08:44 PM", "replies": []}, {"postID": "post5962653", "text": "Att sells tempered glass protectors at the store. 40 bucks but come with a lifetime warranty. you have to register it. if it gets damaged they will replace the glass for the life of the phone. hence the 40 dollar price tag", "time": "09-07-2017 04:55 PM", "replies": []}, {"postID": "post5963465", "text": "Spigen and VRD design have a good option as per the quality level.", "time": "09-08-2017 03:27 AM", "replies": []}, {"postID": "post5980138", "text": "I'm looking for a holster/clip that I preferably just snap the naked phone in.", "time": "09-17-2017 06:11 PM", "replies": []}, {"postID": "post5985656", "text": "Pretty close. But I'm actually looking for a caseless belt clip for the phone. Maybe the phone is not that popular yet or I might be a skunk for too much. Trying to keep the bulk down.", "time": "09-20-2017 08:27 PM", "replies": []}, {"postID": "post5985663", "text": "http://forums.androidcentral.com/e?l...token=LNsSge2X", "time": "09-20-2017 08:30 PM", "replies": []}, {"postID": "post6041258", "text": "The Active is such a brick in any of the big, rugged cases. Putting an Otterbox on my S7 Active was hilariously bad. I used the Unicorn Beetle for a while then went with a simple clear TPU soft case. That was perfect, really. But I decided to push it and go caseless after a year. It was no big deal and I got a lot of positive comments from friends/co-workers about how awesome the phone was. I had a few minor cosmetic blemishes after 4-5 months, but ATT didn't ding me for it on trade in when I got my Note.", "time": "10-27-2017 09:47 AM", "replies": []}, {"postID": "post6088033", "text": "anyone know of very thin plastic backing case?", "time": "11-28-2017 12:11 PM", "replies": []}, {"postID": "post6155035", "text": "I feel like gwtring a case for the S8 Active defeats the purpose of buying an active variant of the S8. CNET did a comparison article on the very thing. I hate needing a case but dont want a fragile phone. Samsung active series are the best.", "time": "02-05-2018 12:30 PM", "replies": []}]}, {"title": "Why is it so hard to find things for the Samsung Galaxy S8 Active?", "thread": [{"postID": "post6137548", "text": "I have a Samsung Galaxy S8 Active. I have had the phone looked over seen about have this part repaired. The gorilla glass looks it was cracked. There is nothing wrong with the rest the phone. Everything else works as it should. The problem I keep running into is not finding the kits or glass to replace it on the s8 active. They have it for every other ph but it. So is there any ideas where I can find the things I need for it. Or if I'd be better off just selling it? Coz I'd bought it as in helping a person out who need a little holiday seasonal help. So now I'm trying to figure out my best option without really taking a loss. Any help or advice would be awesome. Thanks so much.", "time": "01-16-2018 04:07 AM", "replies": []}, {"postID": "post6137739", "text": "It's a very rare phone. Have you asked Samsung about repairing it?", "time": "01-16-2018 09:20 AM", "replies": []}]}, {"title": "Bixby", "thread": [{"postID": "post5981189", "text": "I read Samsung is letting the S8 series disable Bixby. Any word if this courtesy will be extended to the Active?", "time": "09-18-2017 10:53 AM", "replies": []}, {"postID": "post5981225", "text": "Should work. Try it out.https://www.androidcentral.com/how-c...-disable-bixby\nMav.", "time": "09-18-2017 11:09 AM", "replies": []}, {"postID": "post5982274", "text": "I've had my S8 Active since the launch date and have never used Bixby. However, I'm not sure why I would want to disable it.", "time": "09-18-2017 10:21 PM", "replies": []}, {"postID": "post5985670", "text": "I want to learn the phone better, Bixby just gets in the way for me now. it comes up by accident when trying to hit my volume keys.", "time": "09-20-2017 08:35 PM", "replies": []}, {"postID": "post6131959", "text": "Same here; the folks at the store didn't even realize they were able to sell it on the day I bought. I don't use Bixby, but would really be happy if the button could be re-purposed without running a specialized app to do that. I think that extra button would have been much more helpful to Samsung's customers if they allowed it to be set and re-set by the phone owner. I'd really like to be able to set the button to an app that I might need in a hurry, but want to start discretely, e.g. an audio recorder to record instructions, directions, or discussions.", "time": "01-10-2018 12:36 AM", "replies": []}]}, {"title": "T-Mobile version soon!", "thread": [{"postID": "post6051587", "text": "So I was at a T-Mobile Corp store yesterday. I happened to notice the worker had a Active S8. I said is that available now? The worker was surprised I noticed it. He said its a test unit. He said its working flawless.\nHas the 600 freq band. \nHe said he is hearing by end of the month of November it might be avaiable!\nJust wanted to pass this on to fellow T-Mobile users.", "time": "11-03-2017 06:10 AM", "replies": []}, {"postID": "post6052412", "text": "For whatever it is worth, I seem to recall an article that showed the screen with \"November 22\" on it.", "time": "11-03-2017 03:27 PM", "replies": []}, {"postID": "post6054405", "text": "I want this so bad. Take my money please.", "time": "11-04-2017 10:48 PM", "replies": []}, {"postID": "post6058137", "text": "Looks official. https://newsroom.t-mobile.com/news-a...oca_experience", "time": "11-07-2017 08:49 AM", "replies": []}, {"postID": "post6063687", "text": "I'll be ordering mine in a week!", "time": "11-10-2017 03:51 PM", "replies": []}, {"postID": "post6080568", "text": "Saw one in a T-Mobile store Sunday.", "time": "11-21-2017 10:26 PM", "replies": []}, {"postID": "post6083532", "text": "Picked up the Active today at T-Mobile. Jumped from a V20 that unfortunately was giving me issues with texts. Other than that I though the V20 was a solid phone. Was torn between the Active and the V30+ that's now available as well.", "time": "11-24-2017 05:02 PM", "replies": []}, {"postID": "post6096460", "text": "This is the best Samsung phone out there and this forum isn't moving. 😕", "time": "12-05-2017 08:38 AM", "replies": []}, {"postID": "post6098382", "text": "got my T-Mobile samsung S8 Active and i have OCT 1st patch level", "time": "12-06-2017 08:38 PM", "replies": []}, {"postID": "post6105618", "text": "Anyone using this on T-Mobile see any faster speeds. or better signal penetration due to the new band 71? I am on T-Mobile but not using the Active. I was going to get one but I hate the Bixby button and the fingerprint placement. So I am waiting to see what phones will carry the new band for 2018. But I am curious if band 71 helps anyone at all.", "time": "12-13-2017 09:10 AM", "replies": []}, {"postID": "post6115277", "text": "I'm not sure about the signal because I've never had signal issues in my area. This phone is great though and the battery life is very good. I love this phone overall, it's a shame it was released so much later than the AT&T version.\nReally a phone worth looking at out of T-Mobiles Android offerings.", "time": "12-22-2017 03:25 PM", "replies": []}, {"postID": "post6115338", "text": "I used to have an s8 now I have the s8 active. I have noticed an increase in signal and speed", "time": "12-22-2017 04:45 PM", "replies": []}]}, {"title": "Uninstalling Asphalt does not free up storage space", "thread": [{"postID": "post6104602", "text": "Hi, \nThe other day, I installed a game from Google Play store - Asphalt Xtreme. I must say I thoroughly enjoyed it, but my phone was running out of space, and today I decided to uninstall it. It was taking around 1.5 GB of space on my phone's internal storage. But when I uninstalled it, it freed up only around ~ 200 MB. I see 1.3 GB is still taken up even though I've uninstalled the game from my device. I think the obb files are still there. I tried deleting them manually by navigating to \"Internal storage - Android - Data\", but couldn't find anything to delete. I couldn't even find a folder named 'Asphalf Xtreme' or something similar. So how am I supposed to remove those game files? I know for a fact that they are still there taking up 1.3 GB of space on the internal storage. I need to free up space on my phone. Please guide me through the steps. Thank you!", "time": "12-12-2017 08:51 AM", "replies": []}, {"postID": "post6104651", "text": "Maybe ask here? https://forum.gameloft.com/viewforum.php?f=2182", "time": "12-12-2017 09:26 AM", "replies": []}, {"postID": "post6104711", "text": "I'd definitely try wiping the Cache Partition. It'll clear out a lot of old unused taking up space on your phone most likely the remnants of Asphalt too.", "time": "12-12-2017 10:24 AM", "replies": []}]}, {"title": "Galaxy S8 Active - It's here!!", "thread": [{"postID": "post5915202", "text": "https://www.phonearena.com/news/Sams...te-ATT_id96797\nOn sale this week.\nTime exclusive to ATT!", "time": "08-07-2017 10:33 AM", "replies": [{"postID": "post5915214", "text": "I'm looking forward to the possibility of it arriving on Verizon sometime within the next couple of months!", "time": "08-07-2017 10:43 AM", "replies": [{"postID": "post5945742", "text": "I was without service on Verizon after switching from AT&T.", "time": "08-29-2017 10:38 PM", "replies": [{"postID": "post5945799", "text": "It's an AT&T Phone... you have to have it unlocked by AT&T to use in on Verizon's Network. They make that pretty clear when the sell it...", "time": "08-29-2017 11:24 PM", "replies": [{"postID": "post5947293", "text": "My point is that AT&T I have much better service than ever. I just left Verizon, tired of being places that AT&T was the only service. I went back to AT&T and got my two S8 Actives on the buy one get one free.😉", "time": "08-30-2017 07:06 PM", "replies": [{"postID": "post5947673", "text": "Got ya' - I thought you were saying you bought the phones and were trying to run them on Verizon - sorry! I was with Verizon for 23 years and got fed up... left them a year and a half ago for AT&T and have been very happy with AT&T so far!", "time": "08-30-2017 11:05 PM", "replies": []}, {"postID": "post5947674", "text": "Got ya' - I thought you were saying you bought the phones and were trying to run them on Verizon - sorry! I was with Verizon for 23 years and got fed up... left them a year and a half ago for AT&T and have been very happy with AT&T so far!", "time": "08-30-2017 11:06 PM", "replies": []}]}]}]}]}]}, {"postID": "post5915222", "text": "Any guess as to how long it will be exclusive to AT&T?", "time": "08-07-2017 10:49 AM", "replies": [{"postID": "post5915264", "text": "If I had to guess, I'd say a couple months.", "time": "08-07-2017 11:31 AM", "replies": []}, {"postID": "post5918238", "text": "VZW never gets them Unlocked won't have access to the best VZW features.", "time": "08-09-2017 03:46 PM", "replies": [{"postID": "post5918921", "text": "What are the best VZW features and why would those features not work on an unlocked phone? Thanks.", "time": "08-10-2017 07:45 AM", "replies": [{"postID": "post5919015", "text": "Often some of the lte bands are not available. Sometimes you don't get 3G only LTE or 1G. Special calling features like wifi calling or advanced calling may not be available. Often updates must be manually installed with Odin. It varies but if you read any of the threads about unlocked phones being connected to VZW network you'll see the complaints. It is hard to predict the problems but it seems like there are always problems. Some will deny any issues. Someone else says wait this doesn't work or that doesn't work then first person says I don't care about that feature. That doesn't mean there is no problem. Now if vzw SELLS the phone then we're all set and it does sound nice.", "time": "08-10-2017 09:14 AM", "replies": [{"postID": "post5919282", "text": "That's why two years ago, I switched to AT&T after twenty-three years with Verizon for what I could only describe as their total arrogance! They do what THEY want and really don't care what YOU or I want... I had finally had it! Buh-bye! Hello AT&T! No looking back - totally happy since.", "time": "08-10-2017 12:43 PM", "replies": [{"postID": "post5919302", "text": "I'm happy with AT&T as well but like Verizon if you don't buy a carrier device you won't get the Advanced features they offer. I have a Google Pixel and Blackberry KEYone and AT&T does not support those devices for WiFi Calling, Direct Video Calling, Advanced Messaging, VoLTE (HD Voice), etc. It's a bummer...", "time": "08-10-2017 12:53 PM", "replies": [{"postID": "post5919405", "text": "Absolutely! But neither do T-Mobile, or Sprint, etc. - the Special Functions for the Google Pixel/XL were ONLY available with Verizon. I found that out too. I ordered one before they were shipping (Thank God) - I had a Pixel XL on backorder and had done some reading, and some more reading and then finally realized that I was screwed trying to use it on AT&T. I was able to cancel the order for a full refund because they weren't shipping yet!!! Whatever... I guess you have to go with the flow wherever you hang your hat!", "time": "08-10-2017 01:58 PM", "replies": [{"postID": "post5921007", "text": "Ehhh hold your horses there. T-Mobile does support WiFi calling / VoLTE on unlocked devices .", "time": "08-11-2017 10:39 PM", "replies": [{"postID": "post5921012", "text": "When I was about to buy the Pixel, Pre-Release, there were several features that were only available if you were on Verizon's Network Almeuit. I can't remember now what they were but they were major issues for me - enough to make me cancel the order because I was with AT&T. Do you remember that?", "time": "08-11-2017 10:55 PM", "replies": [{"postID": "post5921021", "text": "AT&T -- yes you don't get that stuff.\nYou said Sprint and T-Mobile don't allow those things but that is incorrect. T-Mobile allows WiFi calling / VoLTE to work on unlocked devices. I had a Google Pixel XL on T-Mobile. I had VoLTE and WiFi calling without doing any extra legwork except toggling the setting.", "time": "08-11-2017 11:13 PM", "replies": [{"postID": "post5924225", "text": "What about with Cricket wireless, AT&T's MVNO?", "time": "08-15-2017 10:03 AM", "replies": [{"postID": "post5924230", "text": "I don't believe you get it there either. AT&T is really strict about their stuff like that when it comes to WiFi calling / VoLTE. They want you to have their phone / software.", "time": "08-15-2017 10:07 AM", "replies": []}]}]}]}]}]}]}]}]}]}]}]}, {"postID": "post5915240", "text": "It has arrived! \nDurable, flat screen goodness; oh, how I've missed you!!\nMy guess on exclusivity to AT&T would be 60 days; available on other carriers by the holiday season.", "time": "08-07-2017 11:09 AM", "replies": [{"postID": "post5915406", "text": "DAMNED! After watching that video... I'm going to have a really hard time waiting for the Galaxy Note 8. Crap... I've been waiting patiently since I turned in my \"Replacement\" Note 7 and picked up the S7 Active as a \"Stand-in\", but I've actually grown to like the BEAST! I can't even tell you how many times I've dropped it without a single scratch, chip, dent... and that 4000mAh battery life?\nDo I really need Dual Cameras, an S-Pen and a phone that's WAY too tall, skinny and with only 3300mAh for >$1000.00 when I can have the S8 Active for around $850 (if what they're saying is correct)?", "time": "08-07-2017 01:15 PM", "replies": []}]}, {"postID": "post5915832", "text": "My thoughts exactly jimd! After watching the S8 Active intro video, I think it confirms that the phone will have a decent screen wow factor (flat edges!) and tremendous battery. The tough mil-spec rated exterior only adds to it's desirability. :-)", "time": "08-07-2017 07:25 PM", "replies": []}, {"postID": "post5916150", "text": "What I find interesting is that the S8 Active specs on the Samsung website differ from those on the AT&T website. The AT&T website has the screen resolution at 2560 x 1440 and does not call the screen an Infinity Display. \nThe Samsung product website (linked below) does call the display an \"Infinity Screen\" and lists the resolution of the AT&T S8 Active as 2960 x 1440 (577 PPI.)\nHas anyone contacted AT&T via chat yet to ask about the discrepancy? Galaxy S8 Active 64GB (AT&T) Phones - SM-G892AZAAATT | Samsung US", "time": "08-08-2017 03:59 AM", "replies": []}, {"postID": "post5916718", "text": "Pre-ordered the S8 Active through AT&T this morning and expected ship date is 08/09 - 08/11.", "time": "08-08-2017 01:33 PM", "replies": [{"postID": "post5917125", "text": "Pictures and Full hands on impressions expected date is 08/11-08/13", "time": "08-08-2017 09:35 PM", "replies": []}]}, {"postID": "post5917248", "text": "Wow my order already shipped earlier this afternoon and will arrive tomorrow at my office. Too bad I'm remote tomorrow. 😟", "time": "08-09-2017 12:30 AM", "replies": [{"postID": "post5917854", "text": "Awesome! So we get those photos and impressions even sooner .  ;P", "time": "08-09-2017 11:19 AM", "replies": []}, {"postID": "post5917973", "text": "That's just the kind of crap that ALWAYS happens to me - that's why I started just walking into my local AT&T Store (of course it's nice to have one 15 minutes from home too) and holding it in my hand there before laying out the cash! Makes me feel a whole lot more secure... :-)", "time": "08-09-2017 12:45 PM", "replies": []}]}, {"postID": "post5917958", "text": "I'm tempted to order, but am trying to resist temptation to get one second hand instead.", "time": "08-09-2017 12:34 PM", "replies": []}, {"postID": "post5918260", "text": "\"Early leaks of the Galaxy S8 Active revealed that it won't have AT&T branding, and there's a good reason for that. The carrier has exclusive access to the device \"for a limited time,\" but the phone will be available to non-AT&T customers at a later date. There's also the possibility that Samsung will sell it unlocked directly.\"There you go!", "time": "08-09-2017 03:59 PM", "replies": []}, {"postID": "post5918273", "text": "I mentioned unlocked. There will not be a vzw ed.", "time": "08-09-2017 04:08 PM", "replies": [{"postID": "post5918630", "text": "How do you know? It says \"the phone will be available to non-AT&T customers at a later date.\" too! I would think that to mean other Carriers!", "time": "08-09-2017 11:06 PM", "replies": [{"postID": "post5918637", "text": "None of the others ever got to VZW. I making an assumption based on the past. I'm also a pessimist.", "time": "08-09-2017 11:23 PM", "replies": [{"postID": "post5918980", "text": "If it doesn't make it to Verizon this might be the phone that gets me to leave Big Red.", "time": "08-10-2017 08:45 AM", "replies": []}]}]}]}, {"postID": "post5918326", "text": "So no promo/discounts from Verizon...bummer.", "time": "08-09-2017 04:53 PM", "replies": []}, {"postID": "post5924227", "text": "Saw and handled the S8 Active at Best Buy this weekend. It's a spec sheet dream, but it's not a pretty phone. It was kind of a let down, especially seeing it next to the S8 and S8+. Still, it crushes my top two priorities in a cell phone--battery and camera.", "time": "08-15-2017 10:05 AM", "replies": []}, {"postID": "post5924756", "text": "I got my S8 Active as soon as the doors opened at AT&T on Friday. I have NEVER broke the screen on any of my phones, yet somehow, magically, I found two small cracks in the screen on my shiny new S8 Active before my case arrived Monday afternoon. It was never dropped. It had to have happened in my pocket, with the screen against my leg, and nothing else in the pocket. I'm very disappointed.", "time": "08-15-2017 07:12 PM", "replies": [{"postID": "post5924838", "text": "I've got an order on Samsung.com for $549.99 after discount and trade-in, but they are currently backordered. I'm tempted to cancel and wait for Note 8 or Pixel XL 2. I don't know...I wish I didn't have this phone addiction. Pixel XL is pretty much everything I want except no wireless charging and no Samsung Pay.", "time": "08-15-2017 09:31 PM", "replies": [{"postID": "post5924898", "text": "Are you with AT&T?", "time": "08-15-2017 11:07 PM", "replies": [{"postID": "post5925252", "text": "Yep.", "time": "08-16-2017 07:41 AM", "replies": [{"postID": "post5925513", "text": "I backed out of my regular Pixel XL order because of a couple of features that Verizon offered that worked on the Pixel that AT&T didn't offer. Can't remember now which features they were but be careful with the Pixel and AT&T... ask your AT&T Rep and hopefully they'll give you a credible answer.\nThey didn't offer the original Pixel so if they offer the Pixel 2 once it's introduced, then maybe that's been taken care of?", "time": "08-16-2017 11:52 AM", "replies": [{"postID": "post5925728", "text": "The Pixel on AT&T will work network wise -- Just no WiFi calling or VoLTE. Those features aren't allowed by AT&T when it comes to that. Sprint never really had VoLTE so pretty much T-Mobile / Verizon allowed it to work for that phone. Other then that I can't think of anything that was exclusive to Verizon at all except the phone itself being purchasable from their stores.\nPixel 2 -- Not sure if that will still be a Verizon only thing. If AT&T themselves sell it then I could see them allowing said features to work.", "time": "08-16-2017 03:10 PM", "replies": [{"postID": "post5925792", "text": "Thank you Almeuit!", "time": "08-16-2017 04:06 PM", "replies": []}]}]}]}]}]}, {"postID": "post5924902", "text": "Wow... seriously sorry to hear that! I cannot believe it... with the number of times I have dropped my S7 Active and how badly I have treated it, I would hope the S8 Active would be at least equal if not an improvement in durability!!! I mean, I seriously (not on purpose) kicked the crap out of my S7 Active and it doesn't have a scratch - it's in an iBlasson case and has had a tempered glass screen protector since day one but... damned!", "time": "08-15-2017 11:12 PM", "replies": []}]}, {"postID": "post5924996", "text": "@dmfp\nI notice that this is your first post here.\nPlease post pictures of the cracks in your screen.\nThanks,\nAoN", "time": "08-16-2017 01:09 AM", "replies": []}, {"postID": "post5963809", "text": "According to a recent article, Samsung may have an unlocked S8 Active. Samsung SM-G892U gets WiFi certified, could be global Galaxy S8 Active - GSMArena.com news", "time": "09-08-2017 08:39 AM", "replies": [{"postID": "post5964699", "text": "Positive News for the non-AT&T Folks - thanks for the update!", "time": "09-08-2017 04:24 PM", "replies": []}]}, {"postID": "post6101516", "text": "If i get this phone, it will definitely be with T-Mobile.", "time": "12-09-2017 11:54 AM", "replies": []}]}, {"title": "security updates", "thread": [{"postID": "post5964869", "text": "I have an S8 Active. Still on July security patch. What's everyone else on? I chatted with an att rep who indicated there was an update available and attempted to push it to me but it didn't come. Then suggested I go to Best Buy to a Samsung experience tech who will help push the update. 2 bb later. No Samsung experience at bb anymore. Att stores have no clue. Anyone have any suggestions?", "time": "09-08-2017 06:29 PM", "replies": []}, {"postID": "post5964935", "text": "I am on the July 1 security patch as well with AT&T", "time": "09-08-2017 07:13 PM", "replies": []}, {"postID": "post5965244", "text": "I went to my local att. they were not very helpful, no fault of their own. contacted Samsung via their chat app online. the update is not ready as of yet but soon. they said wait a few more days and see what happens. if no update them contact them back. they said Samsung pushes updates to carriers then carriers push to consumers. let's see if this happens soon. love the phone but there are many bugs and the latest update for the s8 and s8+ added a lot of improvements.", "time": "09-08-2017 10:25 PM", "replies": [{"postID": "post5965386", "text": "What bugs?", "time": "09-09-2017 02:07 AM", "replies": []}]}, {"postID": "post5966631", "text": "wifi and location turns on and off, and a few others.", "time": "09-09-2017 08:25 PM", "replies": []}, {"postID": "post5973464", "text": "anyone noticing if Amber alerts are not coming across? I don't seem to be getting the alerts. using default Samsung messaging app.", "time": "09-13-2017 10:46 PM", "replies": []}, {"postID": "post6009775", "text": "holy smokes are we ever going to get any updates. still on July...", "time": "10-07-2017 06:14 PM", "replies": []}, {"postID": "post6050074", "text": "November and still July security, reminds me why my last Samsung was the Note 2.", "time": "11-02-2017 08:51 AM", "replies": []}, {"postID": "post6054381", "text": "man this is getting pathetic. still no updates. although I love the phone for many reasons I am not loving having no security updates. my next phone may not be a Samsung. I may go back to Blackberry. likely the next iteration of the motion if it has more advanced hardware.", "time": "11-04-2017 10:21 PM", "replies": []}, {"postID": "post6058251", "text": "Just received October security update", "time": "11-07-2017 10:16 AM", "replies": [{"postID": "post6058317", "text": "Same.", "time": "11-07-2017 11:03 AM", "replies": []}]}, {"postID": "post6058516", "text": "just received the 10.1.17 security update. hallelujah!!!", "time": "11-07-2017 12:42 PM", "replies": [{"postID": "post6075882", "text": "Great to see you finally received the update 😃 You are definitely not the only one. Many customers wait quite a few weeks after the security patch has been released because it has to go through carrier testing. \nNot all Samsung devices are as slow and sometimes it's just the carrier you are with that's a little slower with updates for a specific device. Crossing fingers the Nov 6 updates comes quickly! 😃", "time": "11-18-2017 02:12 PM", "replies": []}]}, {"postID": "post6098384", "text": "got my T-Mobile samsung S8 Active and i have OCT 1st patch level", "time": "12-06-2017 08:39 PM", "replies": [{"postID": "post6098419", "text": "Same here. I picked my TMo S8 Active up yesterday and it's also stuck on October security patch.", "time": "12-06-2017 09:51 PM", "replies": []}]}, {"postID": "post6098687", "text": "i would not say stuck lol that what it came with i hop we get nov or DEC patch level soon cant wait too see how T-Mobile dos with the samsung S8 Active updates wish is new too them", "time": "12-07-2017 05:17 AM", "replies": []}, {"postID": "post6098801", "text": "got the November 1 patch last night.", "time": "12-07-2017 07:56 AM", "replies": []}]}, {"title": "Best Buy Black Friday Specials--Galaxy S8 Active", "thread": [{"postID": "post6079761", "text": "Galaxy S8 Active 64GB (Sprint only)\n$499.92 (was $899.99)http://forums.androidcentral.com/e?l...token=j_FcQ0mY", "time": "11-21-2017 01:19 PM", "replies": []}]}, {"title": "Don't UseTempered Glass Screen Protector on the Active!", "thread": [{"postID": "post6016773", "text": "I had a small bump which broke the tempered glass screen protector... Problem is the tempered glassed punctured the poly screen on the active. It really dug in and tore it up.\nNow I have a question... Can you replace the poly screen on the s8 active? Can you replace the whole screen. I just got the phone and even have a case on it... Yeah, I know.\nAny help is welcomed", "time": "10-12-2017 01:51 PM", "replies": [{"postID": "post6017669", "text": "I'm not sure about the Active. FWIW, with the Moto shattershields you could replace the top layer (I had it done on a Turbo 2 and I think they still do it on the Force).\nIf it was me, I might call Samsung or AT&T and see if they will replace it for free since the phone is supposed to be shatter resistant. I realize your phone didn't shatter, but the screen still got messed up, which is not supposed to happen. It's worth a phone call or two.\nGood luck.", "time": "10-13-2017 08:30 AM", "replies": [{"postID": "post6017709", "text": "ALWAYS worth asking! My brother had a laptop screen crack on him for no good reason. He thought he was screwed, BUT he called the company anyways. It turns out there is/was an issue with the latch on his model and they ended up fixing his screen under warranty! HP footed the bill because there was a known issue with the latch. He's an HP buyer for life now!", "time": "10-13-2017 08:54 AM", "replies": []}]}]}, {"postID": "post6016848", "text": "I read in another thread that Samsung was fixing shattered Note 8 screens for about 200 dollars. Probably the S8 Active would be a similar price, it's an OUCH for sure but still better than the cost of a whole new phone. Try contacting Samsung....http://forums.androidcentral.com/e?l...token=bAMt0A3x", "time": "10-12-2017 02:49 PM", "replies": []}, {"postID": "post6017655", "text": "I've always used tempered glass screen protectors on my Active 7 and the screen looks as new as the day I took it out of the box. Guess it's either bad luck or YMMV.", "time": "10-13-2017 08:16 AM", "replies": []}, {"postID": "post6027889", "text": "I've always had the glass screen protector on top of my S7 Active, which had a poly carbonate layer. I've seen posts of people complaining how easy the poly layer scratched. There is a video of someone removing the plastic layer with a Phillips screwdriver and underneath, the glass looks brand new.\nCan you show pics of it?\nHere is the video:", "time": "10-19-2017 03:47 PM", "replies": [{"postID": "post6074729", "text": "It doesn't show him removing it?", "time": "11-17-2017 05:00 PM", "replies": []}]}, {"postID": "post6033135", "text": "The S7 and S8 Actives use a different glass setup. The S8 has a polymer coating on the exterior to make it more shatter resistant.", "time": "10-22-2017 06:58 PM", "replies": []}]}, {"title": "Screen responsiveness issuess", "thread": [{"postID": "post6067454", "text": "Intermittantly, the lower quarter of my screen becomes completely unresponsive to touch. Inability to use lower half of keyboard, bottom buttons on apps, etc.\nRestarting the phone fixes the issue. Anyone else having similar issues?", "time": "11-13-2017 09:32 AM", "replies": []}, {"postID": "post6074103", "text": "I've had this happen once, I had the touch screen completely stop working. I had to do a hard reset to fix it. I've also had the phone just start acting really buggy and doing things on its own, I had to do a soft reset to fix that.", "time": "11-17-2017 08:02 AM", "replies": []}]}, {"title": "I have a S8 Active; ask me anything", "thread": [{"postID": "post5895918", "text": "Delete...", "time": "07-22-2017 07:39 PM", "replies": [{"postID": "post5896049", "text": "How did you get the S8 Active? I'm guessing it's for AT&T only?\nDoes it scratch easily? Does screen have plastic layer on top?\nIs the active button still there or is it replaced with Bixby?\nIs the Active/Bixby button customizable for shortcuts?\nWhat are the materials made of? (Metal bezels, rubberized plastic back?)\nHow thick is it compared to regular S8?\nHow slim are the bezels?\nIs the display 100% flat, meaning easier to install screen protector? (None of that 2.5d glass curve?)\nPrice?\nAny underwater camera features? (Previous Galaxy Actives had underwater mode for camera)", "time": "07-22-2017 10:42 PM", "replies": []}]}, {"postID": "post5895927", "text": "Ohhhhh I like that. Is it the poly screen they used last year or glass? Battery size?", "time": "07-22-2017 07:49 PM", "replies": []}, {"postID": "post5895941", "text": ".......", "time": "07-22-2017 08:11 PM", "replies": [{"postID": "post5895946", "text": "So you are saying the battery doesn't last as long as the S8 Plus?", "time": "07-22-2017 08:19 PM", "replies": []}, {"postID": "post5895985", "text": "Settings, about phone, scroll all the way down. \nAny idea on pricing?", "time": "07-22-2017 09:10 PM", "replies": []}]}, {"postID": "post5895948", "text": "Yes... But then again my s8+ is my main phone and debloated and set the best way I know how to preserve battery... I don't even have a Sim card in the active so it's always popping up searching for one and I still have the infinity screen and all bloat on it... So optimized it may very well out last my s8+", "time": "07-22-2017 08:24 PM", "replies": []}, {"postID": "post5895965", "text": "Any AT&T branding on the phone, anywhere?", "time": "07-22-2017 08:48 PM", "replies": []}, {"postID": "post5895981", "text": "No sir only the word Samsung and galaxy s8 active in the back", "time": "07-22-2017 09:08 PM", "replies": []}, {"postID": "post5895998", "text": "Wow. It's actually surprising.... From what I've been told same price as s8+ . But that's not confirmed", "time": "07-22-2017 09:35 PM", "replies": [{"postID": "post5896005", "text": "Ohhhh 4000mah! Ok I'm intrigued. Now I wonder how it will work on T-Mobile.", "time": "07-22-2017 09:43 PM", "replies": [{"postID": "post5896045", "text": "S7 Active been having 4000mAh.", "time": "07-22-2017 10:37 PM", "replies": [{"postID": "post5896046", "text": "I'm aware, had 4 of them. Yes 4, they were that defective.", "time": "07-22-2017 10:37 PM", "replies": [{"postID": "post5896071", "text": "You mean the water-resistant defect? That was an issue for some", "time": "07-22-2017 11:09 PM", "replies": [{"postID": "post5896074", "text": "That was an issue for alot more than some. There's a reason they gave us a full year warranty even for water after the defects aired on national news outlets. Basically every phone manufactured before July was defective. \nThat was a great phone ruined by a single seal.", "time": "07-22-2017 11:16 PM", "replies": []}]}]}]}]}]}, {"postID": "post5896003", "text": "Durability?", "time": "07-22-2017 09:40 PM", "replies": []}, {"postID": "post5896008", "text": "So far it's a tank.. it's notably thicker (which explains the huge battery.) It's heavier and the screen isn't the same glass on the other variants it's tougher and being flat makes it a lot more durable. It has all the same cutouts as the S8+ speaker in the same spot as well as mic holes and headphone jack. But I've purpose dropped it no scratches or anything and I've dunked it and no issues. But you can do the same with the original s8 so I guess that's not a surprise.", "time": "07-22-2017 09:46 PM", "replies": []}, {"postID": "post5896010", "text": "Crazy thing is I Have TMobile. I'll put my sim card in. It shouldn't be locked. I'll report back.... Ok it is sim locked to AT&T but it should work the same as a AT&T s8 that's been unlocked. Now a days it seems all the phones come with all the necessary bands.", "time": "07-22-2017 09:47 PM", "replies": [{"postID": "post5896047", "text": "I wonder if it'll be like last year's. No wifi calling and various sms and calling issues. Randomly losing connection etc. That seemed to be a nougat issue that should be solved.", "time": "07-22-2017 10:39 PM", "replies": []}]}, {"postID": "post5896062", "text": "1. Connection with Samsung. 2. No it doesn't scratch easily. 3 yes Samsung only. 4. No plastic layer. 5 only bixby button. 6 no customization. 7. Metal frame, bumpers feel like metal polymer mkx that's screwed into the sides. Middle of back feels like last year's. 8 it's about 1.5x thick at the normal s8. 9. The bezzels aren't thin at all. I'll post a pic. 10. Yes screen is completely flat. 11. No underwater mode that I can see, it's the exact same camera software as on my s8+.", "time": "07-22-2017 10:59 PM", "replies": [{"postID": "post5896073", "text": "So the display is all glass? Last year they had that plastic on top. Samsung screwed us with Bixby again. The Active key was very useful. Thanks for the info! Looking forward to the S8 Active.\nOh and I forgot, same exact aspect ratio as the regular S8? Borders on YouTube videos? And any word on expected release date?", "time": "07-22-2017 11:12 PM", "replies": [{"postID": "post5985761", "text": "Display is not all glass and does scratch easily", "time": "09-20-2017 09:40 PM", "replies": []}]}]}, {"postID": "post5896064", "text": "You could probably flash the regular S8 TMobile software on it... Last year they had a lot of specific S7 active features like the active button and different features in the camera. They don't this year. So with the right software and it being unlocked maybe you wouldn't have those issues.", "time": "07-22-2017 11:02 PM", "replies": [{"postID": "post5896075", "text": "That's interesting. If it's the same software as the standard s8 series and no added active stuff then it's very possible to flash with all variants including the unlocked software.", "time": "07-22-2017 11:19 PM", "replies": []}]}, {"postID": "post5896078", "text": "Yea all glass... And yea they did the same aspect ratio only flat like what the G6 did. And no idea actually I was actually surprised when my contact just had one laying around!!", "time": "07-22-2017 11:21 PM", "replies": [{"postID": "post5897363", "text": "I wish I had that kind of contact", "time": "07-24-2017 05:32 AM", "replies": []}]}, {"postID": "post5896079", "text": "Yea I've literally seen nothing \"active\" about it software wise... But this could be a pre release software and only be running s8 software to test the build. So that's also a possibility", "time": "07-22-2017 11:23 PM", "replies": [{"postID": "post5896104", "text": "Can you post the software version listed in the \"about\" section? I'm curious if it's identical to the att s8 version.", "time": "07-23-2017 12:06 AM", "replies": []}]}, {"postID": "post5896080", "text": "Uploading a quick little video to YouTube.. will put in OP. Subscribe like and share. And ask more questions!!", "time": "07-22-2017 11:27 PM", "replies": []}, {"postID": "post5896110", "text": "Build number or baseband?", "time": "07-23-2017 12:21 AM", "replies": [{"postID": "post5896418", "text": "Build number", "time": "07-23-2017 09:18 AM", "replies": []}]}, {"postID": "post5896119", "text": "Long shot, but any idea of a release date?", "time": "07-23-2017 12:46 AM", "replies": []}, {"postID": "post5896153", "text": "Not identical I checked", "time": "07-23-2017 01:38 AM", "replies": []}, {"postID": "post5896156", "text": "No idea yet... But historically they're behind schedule and this seems pretty complete.. I'd assume within a month. They wouldn't want it to close to the aig 24th announcement of the note 8.", "time": "07-23-2017 01:40 AM", "replies": []}, {"postID": "post5896192", "text": "I gotta figure it's gonna be a quiet release.", "time": "07-23-2017 02:34 AM", "replies": [{"postID": "post5898626", "text": "Won't be advertised but AT&T already has a fanbase for the Active series. It also helps them convert people over to AT&T since it's an exclusive. I usually just pay full price and get it unlocked.", "time": "07-25-2017 12:09 AM", "replies": []}]}, {"postID": "post5896423", "text": "does this fit in the gear VR, and if so, is it recognized and functioning normally", "time": "07-23-2017 09:23 AM", "replies": [{"postID": "post5898625", "text": "Gear VR was never compatible with any of the Actives. It's too fat and large in size.", "time": "07-25-2017 12:07 AM", "replies": []}]}, {"postID": "post5896494", "text": "No it's too thick to fit in mine... IDK if they'll make a special version. Doubt it though.", "time": "07-23-2017 10:11 AM", "replies": []}, {"postID": "post5896497", "text": "It's a unique build number and baseband", "time": "07-23-2017 10:12 AM", "replies": [{"postID": "post5896504", "text": "Ok, that may complicate things then. Ill have to wait and see when it comes out if we're able to load different software versions on it.", "time": "07-23-2017 10:17 AM", "replies": []}]}, {"postID": "post5897371", "text": "Hey @anon(45902)\nAsk your contact at Samsung when the heck Canada is going to get Bixby on the S8! \nOff topic I know, but I have to try", "time": "07-24-2017 05:46 AM", "replies": []}, {"postID": "post5897618", "text": "Why do dogs have wet noses?", "time": "07-24-2017 10:41 AM", "replies": [{"postID": "post5897626", "text": "Why Does My Dog Have a Wet Nose?", "time": "07-24-2017 10:46 AM", "replies": [{"postID": "post5898000", "text": "Thanks! Are we allowed more than one question in this thread?", "time": "07-24-2017 03:30 PM", "replies": [{"postID": "post5898022", "text": "Yes but only 2 and well, that was your 2nd one.", "time": "07-24-2017 03:43 PM", "replies": []}]}]}]}, {"postID": "post5898362", "text": "I'm curious if the s8 active has a removable backing? that would help with wanting one down the road... user replaceable battery.", "time": "07-24-2017 08:33 PM", "replies": [{"postID": "post5898385", "text": "It doesnt. Completely sealed.", "time": "07-24-2017 08:50 PM", "replies": []}]}, {"postID": "post5898621", "text": "He got in trouble for leaking info", "time": "07-25-2017 12:05 AM", "replies": []}, {"postID": "post5902641", "text": "Will the glass break when dropping from 1.5 meter? lol", "time": "07-28-2017 05:30 AM", "replies": []}, {"postID": "post5940603", "text": "Glass screen with a poly coating, scratches easily.", "time": "08-26-2017 09:02 PM", "replies": []}, {"postID": "post5974597", "text": "when are we getting security patch for August, September?", "time": "09-14-2017 02:27 PM", "replies": []}, {"postID": "post6056497", "text": "Does this model have the samsung theme store?", "time": "11-06-2017 09:29 AM", "replies": [{"postID": "post6056809", "text": "Yes", "time": "11-06-2017 01:44 PM", "replies": []}]}, {"postID": "post6056832", "text": "Thanks", "time": "11-06-2017 02:01 PM", "replies": []}, {"postID": "post6063856", "text": "I have an S7 active and was able to peel up the plastic shatterproof layer off and replace with glass protector after it was scratched to hell. Do you know if it's possible to do the same to the s8 active?", "time": "11-10-2017 05:22 PM", "replies": []}, {"postID": "post6068470", "text": "Does anyone know if Samsung sells this phone with unlocked bootloader?", "time": "11-13-2017 08:58 PM", "replies": []}]}, {"title": "Sprint", "thread": [{"postID": "post6054269", "text": "According to evleaks, Sprint is getting the Active too. If true, does that mean a CDMA version and, therefore, probably a VZW model as well?", "time": "11-04-2017 07:41 PM", "replies": []}, {"postID": "post6058069", "text": "Does not look good for the VZW crowd!https://venturebeat.com/2017/11/07/s...mobile-sprint/", "time": "11-07-2017 08:10 AM", "replies": []}]}, {"title": "Samsung theme store?", "thread": [{"postID": "post6056456", "text": "Anyone know if they added the theme store to this model? Thanks.", "time": "11-06-2017 08:57 AM", "replies": [{"postID": "post6056810", "text": "Yes", "time": "11-06-2017 01:44 PM", "replies": []}]}, {"postID": "post6056830", "text": "Thanks.", "time": "11-06-2017 02:01 PM", "replies": []}]}, {"title": "S8 Active reviews?", "thread": [{"postID": "post5931986", "text": "Where are they? Why aren't/haven't we been seeing reviews for this phone like we would be seeing with every other phone released?", "time": "08-22-2017 09:22 AM", "replies": []}, {"postID": "post5932259", "text": "I was wondering about this very same thing. I think the Active provides a great alternative to the regular Galaxy S8 releases.", "time": "08-22-2017 01:12 PM", "replies": []}, {"postID": "post5932381", "text": "Because it's a Carrier Exclusive phone so the numbers aren't there yet... it was the same way with the S7 Active. I offered to be the S7 Active Champion and make sure all the questions got answered quickly in that section of the Forum and it turned out to be a pretty quiet section as well. They just didn't sell that many because it was only AT&T that was selling them?", "time": "08-22-2017 03:14 PM", "replies": []}, {"postID": "post5932395", "text": "Just found these - not much but it's something and the first one compares it to the S7 Active.Samsung Galaxy S8 Active vs Galaxy S7 Active: Which Rugged Device Is Better? : Tech : iTech PostSamsung Galaxy S8 Active Review – Smart and Tough Mobiles Please Blog", "time": "08-22-2017 03:25 PM", "replies": []}, {"postID": "post5932422", "text": "There was actually some nice little buzz when the S7 Active was released. Not so much this year.", "time": "08-22-2017 03:54 PM", "replies": []}, {"postID": "post5932448", "text": "Here's a good one from YouTube... unfortunately, he's telling me as an S7 Active owner, it's not worth upgrading (for me anyway) S5 or S6 = Yes!", "time": "08-22-2017 04:15 PM", "replies": []}, {"postID": "post5947261", "text": "http://www.androidpolice.com/2017/08...pensive-phone/", "time": "08-30-2017 06:37 PM", "replies": []}, {"postID": "post5947263", "text": "Fresh review http://www.androidpolice.com/2017/08...pensive-phone/", "time": "08-30-2017 06:37 PM", "replies": []}, {"postID": "post5989424", "text": "http://www.androidauthority.com/sams...crisis-802259/", "time": "09-23-2017 01:32 PM", "replies": [{"postID": "post5989716", "text": "Thanks for posting. Even though a phone (such as the V30) has a MIL-STD rating, that doesn't mean the screen is shatterproof does it?", "time": "09-23-2017 06:47 PM", "replies": [{"postID": "post5991988", "text": "That and it does not address that not everyone wants curved displays. I much prefer the flat screen format. It's nice to have options, and right now, the S8 Active is one of the only high end flat screens available.", "time": "09-25-2017 10:56 AM", "replies": []}]}]}, {"postID": "post6034513", "text": "The Good The Galaxy S8 Active has an all-day battery -- about 24 hours in our tests -- and has a sturdier body that’s basically a built-in case. It keeps the S8’s waterproofing and wireless charging.The Bad Its flat screen isn’t as sharp as the regular S8's, and the S8 Active does away with the hardware buttons that helped give the original its identity.The Bottom Line The Galaxy S8 Active is a great phone, but if battery life isn’t your top concern, you’ll save money buying a regular Galaxy S8 and a case.https://www.cnet.com/products/samsun...active/review/", "time": "10-23-2017 02:30 PM", "replies": []}, {"postID": "post6038238", "text": "", "time": "10-25-2017 02:17 PM", "replies": []}]}, {"title": "S8 Active wifi calling issue", "thread": [{"postID": "post6025248", "text": "Anyone having issues with wifi calling turning off after being activated?\nHad my S8 active for 2 months (Bought directly from Samsung). Both my office and house are in marginal AT&T in-building coverage areas and have successfully relied on wifi calling in both areas in the past. I set up wifi calling when I received the phone.\nThere have been approximately 4 instances where I will either have an issue with a call or I get the home screen notification to turn on wifi calling. In either case, when I go into settings/connections/wifi calling. The wifi calling toggle is off. I know I didn't go in and turn it off. Not sure if this is a bug or is there some shortcut to turning on/off wifi calling that I am mistakenly activating.\nI've tried going through Samsung support but there only suggestion is to send the phone in.\nThanks", "time": "10-18-2017 09:08 AM", "replies": []}, {"postID": "post6025293", "text": "I'm a former AT&T store rep (left in May), so I hope I can provide the help you need.\nWhenever we saw this issue with any Samsung phone (including my own son's S6 Active), it ended up having to either have the firmware completely flashed (which Samsung did for me) or replaced under warranty.\nIf you have a Samsung store, or a store-within-a-store at a Best Buy, for example, take it to them. Most of those places can help with firmware issues.\nSince you bought it from Sammy directly, AT&T stores can't do much, but they have a troubleshooting tablet that might help. Also, usage of that tablet is monitored and scored as part of their performance, so a \"free\" SmartCheck for the rep would be good for them, too.", "time": "10-18-2017 09:34 AM", "replies": []}, {"postID": "post6027921", "text": "Thanks. I have a Best Buy near me. I'll try that. Appreciate the help.", "time": "10-19-2017 03:57 PM", "replies": []}, {"postID": "post6030386", "text": "best buy does not have the Samsung experience anymore...", "time": "10-21-2017 12:41 AM", "replies": []}]}, {"title": "Does S8 Active have a data on/off shortcut toggle?", "thread": [{"postID": "post6002512", "text": "Reason why I hate AT&T, don't know if and when the unlocked S8 active is coming out. Does it have the data on/off shortcut from the drag down notification bar?", "time": "10-03-2017 11:58 AM", "replies": []}, {"postID": "post6019939", "text": "Yes, can't post a pic to show you. You can turn it off in the settings menu, other than that just airplane mode in the fast menu.", "time": "10-14-2017 08:36 PM", "replies": [{"postID": "post6027903", "text": "So basically it's a no. Probably AT&T modified it. Guess I'll go for the unlocked version.", "time": "10-19-2017 03:52 PM", "replies": []}]}]}, {"title": "Battery LIfe of S8 Active vs. Other Phones", "thread": [{"postID": "post6026072", "text": "Phone Arena has a battery comparison tool they insert in their reviews. You can enter particular phones from a list. Here's a list I made:", "time": "10-18-2017 04:24 PM", "replies": []}, {"postID": "post6026609", "text": "Thanks for posting. I had a Droid Turbo. Great battery. I thought the phone was underrated.", "time": "10-18-2017 10:33 PM", "replies": [{"postID": "post6027437", "text": "I'm still using my Droid Turbo. Waiting for S8 Active to get on Verizon. Agree that the Turbo was underrated.", "time": "10-19-2017 11:59 AM", "replies": []}]}]}, {"title": "Unlocked???", "thread": [{"postID": "post5931238", "text": "I found an unlocked on Amazon - they said it would work on t mobile.\nAnyone care to comment??", "time": "08-21-2017 07:20 PM", "replies": []}, {"postID": "post5931302", "text": "Good luck?", "time": "08-21-2017 08:11 PM", "replies": []}, {"postID": "post5931307", "text": "Can't comment. What phone and what carrier was it originally locked too? Always risky buying from someone you don't know. Thanks.", "time": "08-21-2017 08:22 PM", "replies": []}, {"postID": "post5931363", "text": "https://www.amazon.com/Galaxy-S8-Act...cUvbUpU5931363", "time": "08-21-2017 09:17 PM", "replies": []}, {"postID": "post5931443", "text": "$1100?!?! Between $675 and $525 on Samsung.com", "time": "08-21-2017 10:38 PM", "replies": [{"postID": "post5931535", "text": "Agreed... that price is NUTS! AT&T sells it for $849.99... who the hell are these people?", "time": "08-21-2017 11:41 PM", "replies": []}]}, {"postID": "post5931679", "text": "To my knowledge that is still an AT&T exclusive, makes me wonder if they are buying them from AT&T and selling them to make a profit. Phone is $849.99 at AT&T.", "time": "08-22-2017 03:11 AM", "replies": [{"postID": "post5932478", "text": "", "time": "08-22-2017 04:46 PM", "replies": []}]}, {"postID": "post5968371", "text": "Does anyone who used this promo see it still? \nI can't find it, feeling like I probably missed the boat here (I was OOF when the release happened).\nIf I'm paying full-price, I might as well just wait for the unlocked revision.\nThanks, for any pointers.", "time": "09-11-2017 02:45 AM", "replies": [{"postID": "post5969199", "text": "What promo... Amazon for $1100?", "time": "09-11-2017 03:10 PM", "replies": []}]}, {"postID": "post5978416", "text": "Up to 1300 now, and I still would bet this doesn't work on a non-ATT network, certainly not Verizon, and it doesn't have band 17 for T-Mobile...\nI mostly call BS, and posted a really directed question on the product page (on Amazon), we'll see...", "time": "09-16-2017 01:49 PM", "replies": []}, {"postID": "post5996909", "text": "Well, this is good news, especially for the TMo crowd. Now the question is whether we will see a CDMA compatible model. Thoughts?https://venturebeat.com/2017/09/28/s...d-to-t-mobile/", "time": "09-28-2017 03:58 PM", "replies": [{"postID": "post5997755", "text": "Honestly, I doubt it. Verizon is scrapping their CDMA soon. At that point, only Sprint and MNVOs will use it. That's quite an investment for a market that is typically looking for the lower cost options. \nThey'll likely stick with LTE and if Verizon or Sprint want to use it, they'll have to make use of LTE only.", "time": "09-29-2017 10:43 AM", "replies": [{"postID": "post5997759", "text": "Verizon definitely plans to scrap it but not till 2020 or later.", "time": "09-29-2017 10:47 AM", "replies": []}]}]}, {"postID": "post5998125", "text": "I sort of tend to agree, I don't see Samsung doing a one-off implementation, unless the CDMA carriers are clamoring for it, and I suspect 99% of them don't even know the difference between an S8 and S8-Active.\nYou never know though, obviously a broader-based phone would be desirable (or even necessary for those on Verizon or Spring), for the unlocked model.\nI don't see any real update to the \"Unlocked\" RTM status here though, just that another carrier-locked version is coming out? I think the opposing versions (AT&T and T-Mobile) are excluding a small set of bands (mostly 12/17/30), depending on the model. If so, this makes it pretty much impossible to buy a \"fully functional\" S8 Active that even portable across GSM carriers, much less having decent international support?\nIt also seems like (similar to the LGV30 that I'm also considering to replace my dying 6P) they'd want to have 600 support, in the same model, making it FAR more desirable?", "time": "09-29-2017 03:31 PM", "replies": []}, {"postID": "post5998147", "text": "Thanks for the replies. I was also thinking that the hardware in an unlocked S8 Active would probably be similar to the hardware in the unlocked S8. I looked at a thread on XDA and there seemed to be some confusion as to whether the unlocked S8 had the CDMA bands (some said it did), but it definitely worked.", "time": "09-29-2017 03:47 PM", "replies": []}, {"postID": "post5998203", "text": "Yeah, the unlocked S8/S8+ is a different phone, obviously similar chipset and (mostly)other are the same, but some parts are definitely different.\nI'm not 100% on how they add the secondary CDMA chipset, but it would also have to be in sync with the antenna set, the firmware, the whole works.\nSometimes people post the FCC filing for the phones, since they're public, I may go try to dig around a bit and see if I can find what's in the \"pipeline\" too. I think some of it requires a good bit of interpretation, since the OEM doesn't file it as an \"S8 Active\", it's more like an \"xyz-123\", and you have to extrapolate from previous models, my understanding anyway.", "time": "09-29-2017 04:45 PM", "replies": []}, {"postID": "post6000364", "text": "However the gsm at&t version is working properly worldwide. I use phone in European T-mobile and everything works fine besides of course some at&t crap on board and slowly pushing upgrades", "time": "10-01-2017 05:10 PM", "replies": []}, {"postID": "post6004881", "text": "This is partially true both IMHO/IME.\nFor example, you take a ATT phone (obviously with non-emergent situations), use Verizon, *IF* you happen to be near what Verizon sems moving toards. A \"bigger LTE netowor (and hopefully on cell standard,mostly and definitely finally!)\nIf you're near a CDMA (conly) tower you won't get any voice/text/data with a small set of \nexceptions.\nThat pretty much sums it up for using the AT&T(mostly) phone on a Verizon line, you'll almost always get spotty connection, at best.\nThe overall point to make regarding using a phone cross-carrier, is not as simple as on would think.\nYou have to use something like FrequncyCheck, or look up the phone band(s)\nIf it only matches a couple of implemented frequency/bands [B](LTE AND CDMA)in your case) for that phone, then you'll either get \"occasional\" connection, but mostly none, in particular outside of metro areas.\nThe other thing that're likely to comes is the \"updates issue\", most carriers will ONLY provide them on a device with their active phone. If you do this, keep in mind that \"patching things yourself) is pretty involved\nThere's also typically some domestic roaming that occurs, and no-one talks about, partly because (the majority) bigger cell companies have some sort of reciprocity (at least partial, perhaps full)\nRoaming is sometimes locked to your cell companies, and will only work if you are using their service. This aspect does seem to be changing though, for the good.\nThe one other thing that're likely to comes isup are updates, most carriers will ONLY provide them on a device with their active phone. If you do this, keep in mind that \"patching things yourself) is pretty involved", "time": "10-04-2017 08:27 PM", "replies": []}, {"postID": "post6008077", "text": "I clearly get what you mean but pls understand i'm polish woman living in Poland. I wanted to have s8 active (military grade of protection, big battery, flat screen, shatterprof screen, non glass body, industrial look of the device etc).\nSo i bought my unit on ebay, had to pay my country taxes to import and finally put my hands on my dream smartphone. I paid overall more than 1000 bucks and in spite I'm still satisfied. If i could i'd use it as at&t device but this gsm provider is US one.\nSo do you think Donald Trump offer me American citizenship to use carrier locked phone?\nMy seller provided me unlock code and i use my precious here in Poland. \nMy biggest complain is active wasn't released from box after Samsung general update concerning behavior of gestures. I mean, pulling up or down is always app dock but newest feature is pulling up the is app drawer but pulling down is quick settings/ notification panel. That's the only software killer feature missing for me considering how tall the screen is.\nThe point is these gestures works on display no matter where (p.g. on the bottom)\nBTW Lte is quite impressive", "time": "10-06-2017 04:39 PM", "replies": []}]}, {"title": "7.1.1", "thread": [{"postID": "post5930057", "text": "Does anyone know when 7.1.1 is coming. Just got my phone yesterday. I am very very satisfied. Excellent battery and responsiveness. However, do not disturb does not allow automatic rules. What to do??", "time": "08-20-2017 06:45 PM", "replies": []}, {"postID": "post5930079", "text": "Knowing Samsung & its history of updates, you probably won't get 7.1.1 at all. They'll probably go directly to 8.0 I'd say around December at the latest. But, then again it's Samsung we're talking about.", "time": "08-20-2017 07:16 PM", "replies": []}, {"postID": "post5930082", "text": "Probably will skip since O is around the corner and it had been released or at lesst about to be released to manufacturers for processing.", "time": "08-20-2017 07:16 PM", "replies": [{"postID": "post5930095", "text": "I agree the skip of 7 1.1 but I can see a significant wait for Oreo for the Active.", "time": "08-20-2017 07:27 PM", "replies": []}]}, {"postID": "post5930246", "text": "The Note 8 is supposed to be shipping with 7.1.1 though... ??? Why wouldn't they update the Active, and the other two S8s down the road a bit?", "time": "08-20-2017 11:18 PM", "replies": [{"postID": "post5930285", "text": "Because why update to 7.1 when O is available? But hey, we'll know when we get there.", "time": "08-21-2017 12:31 AM", "replies": []}]}, {"postID": "post5934520", "text": "disappointed. i dont have automatic rules for do not disturb. That doesn't make sense. Maybe I am missing something.", "time": "08-23-2017 07:31 PM", "replies": []}, {"postID": "post6002157", "text": "Will this phone receive updates? The 4 Active never did.", "time": "10-03-2017 07:34 AM", "replies": []}, {"postID": "post6004746", "text": "i sure as heck hope so. I spent a load of money for this phone. it better.", "time": "10-04-2017 06:53 PM", "replies": []}]}, {"title": "Why Can't I zoom in when I am on live feed on facebook on my Samsung S8 Active?", "thread": [{"postID": "post6001114", "text": "I tried to zoom in on a live church feed on facebook on a Samsung S8 Active and it would not zoom at all. What do I need to do to be able to zoom? I can zoom on the camera and everywhere else but not on live feed.\nHelp.", "time": "10-02-2017 10:29 AM", "replies": []}]}, {"title": "S8 Active $150 off at Samsung.Com, with an additional $150 in trade-in rebates possible.", "thread": [{"postID": "post5921911", "text": "CORRECTION: Max rebate is 300, not 450. Edited title too; apologies for any confusion.\nOrdered one Friday evening, but they're back-ordered.\nTrading in an S5, valued at $150 trade in.\n$549 total price.\nHope this helps,\nAoN.", "time": "08-12-2017 10:46 PM", "replies": []}, {"postID": "post5921913", "text": "Wow... backordered already!!!", "time": "08-12-2017 10:50 PM", "replies": []}, {"postID": "post5921915", "text": "My guess is that Samsung had shipped all their stock out to AT&T for release-day.", "time": "08-12-2017 10:56 PM", "replies": []}, {"postID": "post5926762", "text": "Has anyone's shipped yet? Mine is still on Backorder, ordered Sunday.", "time": "08-17-2017 02:50 PM", "replies": []}, {"postID": "post5927870", "text": "Anybody see any movement from back ordered status?", "time": "08-18-2017 03:06 PM", "replies": []}, {"postID": "post5928097", "text": "I hear a lot of crickets. 😂", "time": "08-18-2017 07:08 PM", "replies": [{"postID": "post5928217", "text": "Mine is off backorder, says confirmed now, was hoping it would have shipped already. With the Essential phone due, I am having second thoughts on this guy now.", "time": "08-18-2017 10:58 PM", "replies": [{"postID": "post5928238", "text": "That's why I just walk into my AT&T Store... I hate ordering from anywhere when it comes to phones. Put it in my hand and I'll give you my money please!!!", "time": "08-18-2017 11:26 PM", "replies": [{"postID": "post5928443", "text": "I would have if not for the $300 discount.", "time": "08-19-2017 07:09 AM", "replies": [{"postID": "post5928632", "text": "Yeah, it looks like Samsung is going to offer some trinkets with Pre-orders of the Note 8 also that may not be available from the Carriers either. 256GB SD Card and either a wireless charger or a 360 degree camera is what Evan Blass is saying!EDIT: Now 256GB Card and Wireless Charger OR 360 Degree Camera - Sorry!", "time": "08-19-2017 11:19 AM", "replies": []}]}]}, {"postID": "post5928646", "text": "I just returned my active and ordered the essential. Nothing wrong with the active. Worked great and the flat screen was amazing. Just like to try new things. That and I grew tired of the size. No regrets though buying the active. You'll enjoy it I'm sure.", "time": "08-19-2017 11:35 AM", "replies": []}, {"postID": "post5928655", "text": "How long did it take to go from backorder to confirmed?", "time": "08-19-2017 11:44 AM", "replies": []}]}]}, {"postID": "post5929172", "text": "Mine took a day and a half to move from ordered to confirmed. Not even sure what confirmed means.", "time": "08-19-2017 09:23 PM", "replies": []}, {"postID": "post5929187", "text": "Apparently it means nothing. Just got an email saying the active is back ordered.", "time": "08-19-2017 09:57 PM", "replies": []}, {"postID": "post5929253", "text": "so is it unlock if you purchase directly from Samsung?", "time": "08-19-2017 11:49 PM", "replies": [{"postID": "post5929544", "text": "No. AT&T version.", "time": "08-20-2017 08:37 AM", "replies": []}, {"postID": "post5929774", "text": "I don't think you'll see any \"Unlocked\" units until after they release to other Carriers - probably November/December?", "time": "08-20-2017 01:13 PM", "replies": []}]}, {"postID": "post5929847", "text": "Hoping November for black Friday specials.", "time": "08-20-2017 02:24 PM", "replies": []}, {"postID": "post5929997", "text": "Honestly. How can samsung be out of stock of the S8 active!? Has anyone gotten an active thru samsung that actually delivered?", "time": "08-20-2017 04:59 PM", "replies": []}, {"postID": "post5930965", "text": "Samsung customer service (for what it is) just told me back orders are going to ship in 5-7 days. Let's see if they are good on their word.", "time": "08-21-2017 03:15 PM", "replies": []}, {"postID": "post5931922", "text": "I'm pretty sure I am going to cancel my order, even though I got it for $300 off with the trade-in. I am more interested in the Essential Phone, and am back on my Pixel XL with the new Oreo update. Will probably be sending back my 128GB U11 as well, or will be posting it on Swappa.", "time": "08-22-2017 08:19 AM", "replies": [{"postID": "post5932449", "text": "", "time": "08-22-2017 04:17 PM", "replies": []}]}, {"postID": "post5936358", "text": "My active just shipped by samsung.\nOrdered: 08.19\nShipped: 08.24", "time": "08-24-2017 01:54 PM", "replies": []}, {"postID": "post5936555", "text": "Same as centerman66, mine just shipped. Ordered 08-11, shipped. 08-24. AoN.", "time": "08-24-2017 03:52 PM", "replies": []}, {"postID": "post5938174", "text": "Delivered.", "time": "08-25-2017 11:25 AM", "replies": [{"postID": "post5938449", "text": "Congrats! Just in time for the weekend... Enjoy! Fill us in next week... (please?)", "time": "08-25-2017 01:54 PM", "replies": [{"postID": "post5938465", "text": "Well it's for my wife. She may not even want to start using it yet. Sort of attached to her DTEK60. Ha ha. \nI use the s8+.", "time": "08-25-2017 02:04 PM", "replies": []}]}]}, {"postID": "post5940565", "text": "No I mean can you also insert a Time mobile card?", "time": "08-26-2017 08:30 PM", "replies": []}, {"postID": "post5940566", "text": "or is it Sim free?", "time": "08-26-2017 08:31 PM", "replies": []}, {"postID": "post5940577", "text": "Samsung is selling AT&T locked S8 actives. For now.", "time": "08-26-2017 08:39 PM", "replies": []}, {"postID": "post5940680", "text": "Oh so it's still the locked version", "time": "08-26-2017 10:10 PM", "replies": []}, {"postID": "post5945735", "text": "Why not the AT&T buy one get one free?", "time": "08-29-2017 10:32 PM", "replies": [{"postID": "post5964469", "text": "Pretty sure you have to sign up for DirecTV to get that deal, at least that's what the guy at the AT&T store told me on Wednesday night.", "time": "09-08-2017 02:01 PM", "replies": [{"postID": "post5985751", "text": "Yes, Direct TV $25 month.", "time": "09-20-2017 09:33 PM", "replies": []}]}]}, {"postID": "post5978418", "text": "You have to sign up for a new line, at least that's how I read the promo. Probably work, if you're moving to AT&T, but if you're an existing customer, not so much.", "time": "09-16-2017 01:51 PM", "replies": []}]}, {"title": "Samsung Galaxy S8 Active Shatter Resistant Screen Extreme Durability Test", "thread": [{"postID": "post5969840", "text": "Hey guys, put a video together doing an extreme durability test with the Samsung Galaxy S8 Active. I originally wasn't aware of the shatter resistant screen, so now that I am, decided to see how strong it was.", "time": "09-11-2017 11:09 PM", "replies": [{"postID": "post5970911", "text": "When I saw the car tire, I sat back in my chair and said \"Goodbye\" - I can't believe it stood up to that! I have an S7 Active and I KNOW it's a beast but would never expect it to live through being run over by a car! I didn't really think the S8 Actives would be as rugged as the previous years... oh well!\nThanks for the video!!!", "time": "09-12-2017 03:38 PM", "replies": []}]}, {"postID": "post5971165", "text": "Yea same here, I was expecting to pick up a warped phone or see pressure spots on the screen or even a broken screen underneath but nothing. It looks just as it did before getting run over. Was surprised. No problem", "time": "09-12-2017 05:22 PM", "replies": []}]}, {"title": "is it Sim free if fully paid from Samsung?", "thread": [{"postID": "post5940572", "text": "I know if I pay the full price in att store they will give me a unlock code to use it in other GSM carries, is it the same from Samsung?", "time": "08-26-2017 08:36 PM", "replies": [{"postID": "post5940991", "text": "no it's an Att phone that you unlocked. The one from Samsung is the unlocked version. Won't have any Att apps etc.", "time": "08-27-2017 06:29 AM", "replies": [{"postID": "post5941064", "text": "Yes it does have the att apps from Samsung I already confirmed", "time": "08-27-2017 08:13 AM", "replies": []}, {"postID": "post5941908", "text": "This is not correct. The only S8 Active that Samsung makes is an AT&T variant.", "time": "08-27-2017 07:33 PM", "replies": [{"postID": "post5942090", "text": "I'm sure Samsung makes all manner of S8 Actives but currently they are only selling the AT&T variant. \nI bought one for my wife from Samsung.com. It is the AT&T variant with all manner of AT&T bloat.", "time": "08-27-2017 10:44 PM", "replies": [{"postID": "post5942408", "text": "I am hoping they do this year and would consider purchasing one. I am still a little worried about updates as they ha e routinely ignored the Active line in years past(at least when I had the S6 Active).", "time": "08-28-2017 06:07 AM", "replies": [{"postID": "post5942674", "text": "We want Wayne Simmons back.", "time": "08-28-2017 09:37 AM", "replies": [{"postID": "post5942763", "text": "...that should be Simmonds, no? And this is S8 Active, not Hockey... from a Bruins guy!", "time": "08-28-2017 10:47 AM", "replies": [{"postID": "post5942864", "text": "Simmonds. Yes. Spell check.", "time": "08-28-2017 11:42 AM", "replies": []}, {"postID": "post5942936", "text": "All sales final Ewwww", "time": "08-28-2017 12:04 PM", "replies": []}]}, {"postID": "post5942936", "text": "All sales final Ewwww", "time": "08-28-2017 12:04 PM", "replies": []}]}]}]}]}]}]}, {"postID": "post5940990", "text": "Samsung make phones (amongst other things). \nThey do not provide network service or sim cards... \nYou can buy unlocked phones, or you can unlock carrier locked ones if the carrier is willing to do so.", "time": "08-27-2017 06:27 AM", "replies": []}, {"postID": "post5941903", "text": "The S8 Active is currently an AT&T exclusive. So no matter where you buy it, it will have AT&T apps and be SIM locked to AT&T. \nIf you buy it from Samsung.com you will still have to SIM unlock it, same as if you buy a normal AT&T S8 directly from Samsung.com.", "time": "08-27-2017 07:31 PM", "replies": []}, {"postID": "post5969000", "text": "Something not being considered (by some anyway, based on responses), is that this variant is also released with the AT&T firmware, so any updates must come from AT&T.\nThis usually involves some waiting (typically longer than Samsung's already slow releases, and the Active line does seem to get \"forgotten\" in this regard, being low-volume), and if you're on another carrier because you've unlocked, a pretty big headache...\nI really want one of these, for all the hardware (and mostly current s/w) reasons, but right now my 6P is running Oreo, and I've seen projections into the spring of next year, for the S8 Active, something to think about anyway...", "time": "09-11-2017 01:07 PM", "replies": [{"postID": "post5969357", "text": "...but I think if Samsung creates an Unlocked version for other carriers, it'll be up to those carriers when to update, NOT AT&T! It's going to have a totally different Model Number... or Suffix anyway!", "time": "09-11-2017 04:45 PM", "replies": [{"postID": "post5970745", "text": "Most likely it'll be up to Samsung, for the \"unlocked\" version.\nThis seems good, in principle, but on the S7 Active Samsung really drug their heels on Nougat, not sure about their timeframe for Oreo. The \"other\" S7 variants had Nougat many months earlier.\nSamsung has supposedly adopted a new model for updates, abstracting their changes and the core components, so I guess we'll see...", "time": "09-12-2017 02:24 PM", "replies": [{"postID": "post5970875", "text": "Yeah, I was actually running Nougat sideloaded from XDA Developers Forum on my S7 Active, well before Samsung finally got around to updating us. So much so, that it was a royal PITA for me to go back to an early Marsmallow version, then work my way back to where I needed to be (like 6 updates) for the actual Nougat OTA from AT&T when it finally came out!", "time": "09-12-2017 03:26 PM", "replies": []}]}]}]}]}, {"title": "Samsung Galaxy S8 Active Disassembly Teardown Repair Video", "thread": [{"postID": "post5963570", "text": "just disassembled the S8 active and gotta say I found it to be much easier than working with the regular S8 or prior phones. Glad to see it comes apart from the rear not the front!", "time": "09-08-2017 05:49 AM", "replies": [{"postID": "post5964018", "text": "Thanks for the video. I always like to take a peek inside phones and see how they are put together. With this video you can see the problem with the location of the fingerprint sensor. There really isn't a good place to put it with the layout of components inside. If they were to abandon wireless charging it looks like they would have plenty of options for fingerprint sensor placement.", "time": "09-08-2017 10:17 AM", "replies": []}]}, {"postID": "post5964246", "text": "samsung changed the structure to get stronger and more durable body.", "time": "09-08-2017 12:12 PM", "replies": []}, {"postID": "post5964743", "text": "No problem. Yup, I have never used wireless charging, just for the fact that regular chargers are already fast at charging now a days so never found the need. Too bad they cant just make the wireless charging pad boarder the outer frame instead of the center of the devices.", "time": "09-08-2017 04:54 PM", "replies": []}]}, {"title": "My 'Galaxy S8 Active' Review and opinion that AT&T wouldn't accept.", "thread": [{"postID": "post5960891", "text": "Recently bought a Samsung Galaxy S8 Active from an AT&T store after the screen on my previous phone started \"blacking out\", which I've since learned has become a somewhat common problem for that model. While the old model was, upon its' release in May of 2014, the flagship model made by a different brand/manufacturer, it was only about 3 yrs old and did all I needed, so I was extremely disappointed at its' failure. \nThe cost of the Galaxy S8 Active was higher than I expected, and higher than that of my previous phone. Time will tell if the \"hardened\" feature was worth the extra cost, though I'm not a heavy user, nor do I treat my phones harshly. So, it remains to be seen if I \"over-bought\". \nI got the S8 Active within about a week of its' release. In fact, though the AT&T store I visited had it in stock, the folks working there weren't even sure it was able to be sold yet and had to check some online function to make sure they were allowed to provide me with one. The phone itself is called the \"Active\" model because it comes somewhat hardened, with claims it can, I think, withstand a 5-foot drop without being enclosed in a protective case. It's also claimed to provide protection from a brief stint in relatively shallow water, though I find that hard to believe, because there is no built-in protective cover for any of the openings such as the charging plug and headphone jack. \nEach of the corners of the phone has some sort of \"bumper\", and the phone itself feels as if it offers protection almost on par with even an Otterbox Defender case. \nBeing a cautious sort, and in light of the high price of the S8 Active, I opted for an additional protective case despite the \"hardened\" feel of the phone. The case I ended up buying was a Pelican, primarily for 2 reasons: 1) there was no Otterbox Defender case yet available or even on the market, and 2) it was the only case the store had that fit the Active model. \nAs for protection from water, even the Pelican case doesn't include any type of rubber plug for any of the openings on the phone. (FWIW, when I bought my previous phone, I also bought an Otterbox Defender case for it at the same time, and that phone might have been taken out of the Defender case maybe twice a year, so it was almost always protected). \nMy previous phone never showed more than 2 bars of 4GLTE phone service available, even while at home in one of the most densely populated counties in the country in northern NJ. Despite AT&T's poor service in my specific location, I was not about to spend additional $$ on one of their mini-cell units that somehow amplifies a signal. (I'll switch carriers before I go to that length). Calls while using it would often suffer dropouts or loss of signal. While the S8 Active also regularly shows only 2 bars of service, it seems to \"hold\" the signal much better. While I'm not a heavy user of my phone, I haven't yet suffered a dropout or failed call with the S8 Active, though I've had the phone less than a month and use it for both incoming and outgoing calls less than once a day. Most of my activity is texting or e-mail, and my overall use pales in comparison to that of my spouse or our kids.\nOne point for potential buyers to note: the S8 Active is noticeably larger - and heavier - than any phone I've had in the past, particularly when protected by an additional protective case. That difference in size and weight is very noticeable when slipping it into a pocket. One other point I see as a \"drawback\" is that the phone uses a USB-C connector to charge it. While it's my understanding that most phones are moving in that direction, as well as towards non-removable batteries, it did require a small investment in new cables. (I prefer to have multiple charging cables in multiple locations, e.g. my desktop, my car, next to my bed, in my carry-on/overnite luggage so I don't have to worry about the phone running out of power or me losing track of where I left my single cable). To make that easier to deal with, the phone came with 2 small adapters: 1 micro-USB-to-USB-C adapter, and 1 USB-A-to-USB-C adapter. While those allow use of your old USB-A-to-USB-micro cables, that would mean carrying at least one of the adapters with you, but they are so small they'd likely be lost/misplaced more easily than an old cable. It was nice to see those adapters included in the box, but both are very small and could easily be lost or misplaced. \nThe phone comes with a non-replaceable 4000mAh battery, which thus far has lasted a long time; I'd guess it's gone as long as 3 days before needing a charge, but again, I'm not a heavy user; I make very few outgoing calls, and don't play games or stream tv, movies, or other video on my phone. The battery is one with a quick charge feature, and that seems to live up to its' claim. To further expand use of that, not only do I use the single charging plug that comes with the phone, I purchased a multi-port, external charger that contains 1 quick-charging port, 1 USB-C charging port, and 4 USB-A charging ports. When using that. and with the phone at about 50% charge, I plugged it in and saw that it would reach full-charge in about an hour. When I plugged the phone into the \"old\" 12V charger in my car, with the phone at about 60% charge, I saw a msg that the phone would take more than 6 hrs to reach full charge. That was an impressive difference. \nIn addition to the typical PIN to unlock the phone, it also features biometric unlocking features, e.g. facial recognition and fingerprint ID. While the fingerprint feature seems to be working OK, the facial recognition has been slow, unresponsive, and unimpressive. Facial recognition hasn't worked even once for me, and I suspect I may need to re-run the facial recognition feature and snap a new photo for that. \nProbably the feature I find most annoying, which may not be unique to this phone, is having to swipe up from the bottom of the screen in order to gain access to the 3 primary Android buttons: Multi-window, Home, and Back. That toolbar always disappears after using it, which is something I'm not used to and that I find particularly annoying. I suspect the phone may allow that to be changed, but if so, I haven't yet found out how, (though I haven't yet looked for how to do it). \nThe phone is also a bit bigger than I'm used to. In fact, it borders on being inconvenient to use with one-handed operation. While it offers some feature in Settings that presumably makes it easier to use one-handed, I've not explored that yet. Those considering a purchase should check that out to see if the phone can be made more convenient for one-handed use. (FWIW, I'm a bit ambidextrous, though I favor my left). \nAs for expansion, the phone is claimed to be capable of taking a 256 GB micro-SD card. I was ready to purchase one, but already had a 128 GB card from my old phone and decided a new one was unnecessary. \nI pay little attention to the aesthetics of cell phones, (and frankly can't understand how some people fawn over the color, look, or appearance of some, writing long descriptions of how sleek some may be). Personally, I'm interested mostly in functionality and find those lengthy descriptions of details of little help and even less importance. Having said that, I chose to accept the phone in a Champagne gold color, though I would have expected black to be available. Since the phone would almost always be in its' protective case, color was of little importance to me. The color of the case was more important to me than the color of the phone. The case I chose was a dark gray, almost black. \nThus far, I'm not upset that I made this purchase, though I'm still getting used to it and have some lingering disappointment over the early demise of my previous one. If you're an Android user and in the market for a new phone, I'd recommend checking-out the Samsung S8 Active. It may not be the perfect phone for you, but offers some features that you might find worthwhile. If you're particularly hard on your phone, you might like - or even need- the hardened features of the S8 Active.", "time": "09-06-2017 08:00 PM", "replies": [{"postID": "post5962052", "text": "A few comments:\nWhen at home or on a wifi connection, I use the Wifi calling and the call is routed via the wifi service. Where I only get two bars in certain places in my house via the cell network, the Wifi calling allows me to use it anywhere in my home with much better quality. See this tutorial:https://www.att.com/devicehowto/tuto...l=SamsungG892A\nRegarding the nav bar disappearing (Home, Back, Recent), when you swipe up on the nav bar and the buttons appear, is there a small white dot in the left-hand corner of the nav bar? If there is, click that button and that makes the nav bar remain in place (unless playing a game or watching a video). That button toggles the nav bar either staying or hiding. If there is no dot, then you don't have that software update yet and I'm not sure why it would auto-hide.", "time": "09-07-2017 11:57 AM", "replies": []}, {"postID": "post5962415", "text": "To save page space, I cut back the text on your quote - just wanted to say \"Very well written review - lots of detail, just what a perspective buyer needs to make an educated decision. Thank you very much!\"", "time": "09-07-2017 02:34 PM", "replies": []}]}, {"postID": "post5960940", "text": "I have the same phone and so does my wife. This is by far the best phone j have ever owned. Battery life is fantastic. build is fantastic. other than some redundant apps from Samsung and substituting the Samsung keyboard for Gboard I have very few issues. I just hope Samsung does a great job with updates. This report coming from a VERY loyal Blackberry user among other phones over the years.", "time": "09-06-2017 08:28 PM", "replies": []}, {"postID": "post5960955", "text": "Thanks for the review. Just looked at an S8 Active tonight. Checks all my boxes, except for price. LOL.\nI also noticed the Android navigation buttons would disappear and you had to swipe up to restore them. As you say, surely there is a setting to make them constantly available for use.\nHave you noticed any scratching on the display screen? I ask because the Gorilla Glass is covered with a shatterproof plastic film that I've read is easy to scratch.\nWhen you say that AT&T wouldn't accept your opinion, do you mean that you tried to post your review on their website and it was disallowed?", "time": "09-06-2017 08:36 PM", "replies": []}, {"postID": "post5961021", "text": "Yes, it was more expensive than I expected, and I believe more than my previous phone (an LG G3).\nYes, AT&T said something to the effect that my review didn't meet their requirements or standards; I forget the exact wording. I'm not surprised; some of my comments easily qualify as negatives, while I suspect they want only glowing terms for everything.\nAs for the screen scratching, the Pelican case I bought came with it's own screen cover. I think that extra layer causes the screen to be a bit less responsive.", "time": "09-06-2017 09:14 PM", "replies": []}, {"postID": "post5961032", "text": "Yes, the phone is pretty impressive, but for the cost, I'd expect that.\nAs for updates, that issue was the only thing that caused me to hesitate. I bought a Samsung Galaxy Note Pro 12.2\" Wi-Fi-only tablet a few yrs back, (supposedly their flagship tablet at the time and, if memory serves, at a cost of about $ 700), and last I checked (a few months ago), they hadn't issued an update for it to run even Android 6, yet alone anything newer. I wasn't happy with that, (still aren't), especially because I believe they even called it their best tablet at the time. So while I'm impressed with the phone, the tablet experience still left a bad taste.", "time": "09-06-2017 09:23 PM", "replies": []}, {"postID": "post5961667", "text": "There is an S8 Active forum here on Android Central. You should post this review there as well.", "time": "09-07-2017 08:45 AM", "replies": []}, {"postID": "post5962061", "text": "Mod Note: Thread moved to correct forum.", "time": "09-07-2017 12:02 PM", "replies": []}, {"postID": "post5962648", "text": "When you swipe up there is a small dot to the left inside the bar. Tap it to keep the button bar visible", "time": "09-07-2017 04:50 PM", "replies": []}]}, {"title": "Manufacturing date by IMEI", "thread": [{"postID": "post5960631", "text": "When your phone has been manufactured? Is to suffer for being early batch issues? Does it suffer for inconsistent charging usb-c? Or any other defects?\nCheck it out here [URL][http://www.imeipro.info/samsung_imei_check.html/URL] and post it here", "time": "09-06-2017 05:10 PM", "replies": [{"postID": "post5961171", "text": "Thanks - that's handy to have, and it's for any Samsung phone, not just Galaxy S8 Active!", "time": "09-06-2017 10:43 PM", "replies": []}]}]}, {"title": "Galaxy S8 Active coming in the near future!", "thread": [{"postID": "post5762045", "text": "Thanks to 'lafountain' and 'Matty' for the links! It's finally been announced that the Active Series WILL apparently live on another round!https://www.androidcentral.com/galax...837.1372255777https://9to5google.com/2017/04/14/sa...axy-s8-active/\nStay tuned for more... again, thanks to our contributors lafountain and Matty! Great find folks!", "time": "04-16-2017 09:27 AM", "replies": []}, {"postID": "post5762751", "text": "fortunately it'll get rid of the glass back.", "time": "04-16-2017 06:47 PM", "replies": [{"postID": "post5762827", "text": "I would think that would be their first order of duty in making it crash resistant, right? ;-)", "time": "04-16-2017 07:45 PM", "replies": []}]}, {"postID": "post5777544", "text": "I'm not excited, considering my experiences with the Galaxy S7 Active.\n- AT&T and Samsung released this with certain promises of water resistance. When it was found out the claims didn't \"hold water\", they refused to take the phones back for good ones.\n- The abominably late Nougat OS update... even later than the inexcusablly late Nougat OS update for the other S7 models.", "time": "04-22-2017 01:21 PM", "replies": [{"postID": "post5778336", "text": "Incorrect and/or outdated information. Samsung built the phones, not At&t. Samsung promised water resistance and this was later shown to be not as resistant as promised in early production runs. This was later addressed.\nAt&t would not process warranty claims for any device showing a red indicator because that was not what Samsung specified in the warranty terms. As of last fall this was changed to be covered under the warranty. Any s7 Active within 1 year of purchase that needed to be replaced qualifies as long as the phone does not show physical damage.\nThe bad part is if you drop it in water after the 1 year you are nor covered. I think the 8 series will address this concern. Look at all the videos of people swimming with s7, Note 7, and now s8 devices, I have no qualms about preordering this ASAP.", "time": "04-22-2017 09:37 PM", "replies": [{"postID": "post5778470", "text": "Thanks Justin - I totally agree. I bought mine last summer and it's been in the water and is still working fine... and I wasn't concerned about the Nougat update being late.", "time": "04-22-2017 10:56 PM", "replies": []}, {"postID": "post5780213", "text": "Not incorrect or outdated. I said \"AT&T and Samsung released this\". That is completely correct. I purchased one of the first in the stores on the day it was released. I found out later a large proportion of them were defective in the waterproofing. They told me they would not take it back and give me a good phone: I had to drown it FIRST before they would replace it with a good one they were supposed to have sold me in the fisrt place.", "time": "04-23-2017 06:46 PM", "replies": []}]}]}, {"postID": "post5781614", "text": "They took back my very early production run model no questions and sent me one built just after the flaw was supposed to have been corrected. Sadly, the replacement phone got an external speaker rattle after I got some motor oil or something on it (can't remember exact details). When they replaced THAT phone, I was given a phone made just before the release date. I asked for that phone to be swapped for one made after the \"fix\" but no dice. Oh well, it's held up just fine. \nI was one of the folks that bought this phone because of lifestyle/need. I've ruined two iPhones because of water/sweat thanks to logging serious running miles with the phone. Both times I've replaced with an Active (4 and 7) Both phones have been great and had the same weakness with my use-battery life, as many of you know from my constant complaints.\nWhether I'll replace this phone with another Active is up in the air. I really hate the added bulk. I may go back to the iPhone again now that they've got somewhat similar water resistance. Or may at least go to a regular Galaxy. \nI did get a survey from AT&T a month or so after my initial purchase asking me what I would want in the next Active. Gave me all sorts of questions about plastic, glass, kevlar, and what types of textures I thought would make the phone better. I'm anxious to see just how much the new Active changes.", "time": "04-24-2017 11:56 AM", "replies": [{"postID": "post5784598", "text": "Lucky you. I called a few different AT&T stores for a second opinion, and they were all \"no\". You found a good AT&T person.", "time": "04-25-2017 05:47 PM", "replies": []}]}, {"postID": "post5781654", "text": "I know some don't like the bulky 'Active' versions but for me, they are fantastic for 2 reasons and because of these reasons I'm happy to have the 'downsides' 🙃\nThe first being battery life. The S7 comes with a 3,000mAh battery, but the active, adds an additional 1,000mAh to that! That's some juice for the weekend as well. \nThe next is the 'shatter resistance' for the screen. We see so many friends and family with cracked screens and to have that security of, if I drop my phone, everything will be fine, is worth it to me \nWhile I'm very excited for the normal S8 and all its amazing features. The active version just ups the ante a little and I love it.", "time": "04-24-2017 12:15 PM", "replies": [{"postID": "post5781846", "text": "Ah but see, that's the thing for me. I wouldn't mind the bulk if I got the benefit!!! I get no battery life benefit over my iPhone 6 Plus. Don't know why. I have oodles of apps but try to delete the ones I don't use regularly. I've run various app closers/cleaners like greenify, cleanmaster, 360 security, etc. But what's crazy is, every now and then, battery life is great! Take today, for example. Normally by now (1 pm), I'd be at about 40%. That's with waking up between 4-5 am, going for a run while listening to Sirius XM streaming, reading FB on and off while I eat and get ready for work, then periodically texting and FB messaging during the day. \nToday, I added watching Amazon Prime Video for an hour while running on the treadmill at lunch. My battery life is just at 72! The last time this happened was for about a week after the Nougat upgrade. I don't know what app it is that causes all my issues. But I kept the same suite of apps on my iPhone and never saw drain issues like this. \nAs for the screen, I've shattered 1 screen in 10 years of smart phone use and that was during a very brief period that I had an iPhone out of a case. That's with drops too numerous to count. My kids can shatter a screen just by looking at it on their phones, I admit. But with all the complaints on here from day one about scratches and blemishes on the screen, I've not gone a day without a tempered glass screen protector on my S7 Active.", "time": "04-24-2017 01:24 PM", "replies": []}]}, {"postID": "post5783374", "text": "I do not see the added bulk as a problem.\nI was playing with an s6 Active the other day and it is less bulky than the required Pelican case on my work s7. Less bulky that my s7 Edge with an Otterbox symmetry case. My s7 Active with tempered glass was just right. Plus an Active slides in and out of my back pocket snag free.\nI'm not counting on the next one having 4000 mah though, just speculation but I would not be surprised if it is 3600.", "time": "04-25-2017 07:25 AM", "replies": []}, {"postID": "post5783830", "text": "When you run with it and it's slapping you in your bolts and sprockets every step, it's a problem. Especially over 20 miles or so. I use a running belt and the pocket always ends up front and center.\nI kept my iPhone in a lifeproof and it didn't feel this bulky, only bigger. Of course, whole reason for my latest Active was water ingress through the \"lifeproof.\" But the Active is a very dense phone b/c the extra bulk comes in large part b/c of the heavy battery. Just annoying to me personally.", "time": "04-25-2017 11:40 AM", "replies": []}, {"postID": "post5784082", "text": "No running here.", "time": "04-25-2017 01:43 PM", "replies": []}, {"postID": "post5816498", "text": "AT&T Samsung Galaxy S8 Active Gets WiFi Certification - Geeky Gadgets", "time": "05-15-2017 11:27 PM", "replies": [{"postID": "post5817187", "text": "I'm still waiting for the Note 8 but I can't wait to see what this one is going to look like as I've really enjoyed my time with my S7 Active. It has served me really well since Samsung took away my Note 7 last year!!! Who knows, if the Note 8 doesn't fit my needs... they're saying 6.3\" screen and the same format as the S8+ - that means Tall and Skinny! 6.3\" Tall and Skinny... I don't know if I can handle that? I guess I'll have to actually hold one and use it with the SPen and see how it performs then decide - if not, S8 Active!!!", "time": "05-16-2017 12:22 PM", "replies": []}]}, {"postID": "post5817483", "text": "Im still going back and forth.\nMy neice needs her iPhone replaced and does not want another. The s8 is great other than it being a crack waiting to happen. If the s8 Active rolls out with the ability to BOGO I may jump on it. Then again I may wait for the Note to decide, because upgrade fees right now would be about $300. \nShe's not getting a Note, thats for sho.", "time": "05-16-2017 03:03 PM", "replies": []}, {"postID": "post5824526", "text": "https://www.theverge.com/circuitbrea...e-leak-samsung\nNo buttons on the front :/", "time": "05-22-2017 03:55 PM", "replies": []}, {"postID": "post5824879", "text": "Thanks Justin... the other thing it doesn't tell us is where the Finger Print scanner is going to be??? Hmmm?", "time": "05-22-2017 11:18 PM", "replies": [{"postID": "post5947305", "text": "On the back.", "time": "08-30-2017 07:14 PM", "replies": [{"postID": "post5947670", "text": "We know that now... that post was from May 23rd - but thank you!", "time": "08-30-2017 11:00 PM", "replies": []}]}]}, {"postID": "post5848152", "text": "I saw this no buttons on the front thing and it bothers me. Not so much from the \"active\" point of view. But rather from the normal everyday use. I like the tactile feel of buttons. So, without the buttons, is the shock resistance and glass going to be the only thing that separates it from a normal galaxy?", "time": "06-12-2017 03:09 PM", "replies": [{"postID": "post5848599", "text": "Yeah, I kind of thought the same thing too bk' - at least in the past, they've created a totally separate housing and keypad for the Active Models. Now it looks like they're trying to simply and visually \"Active\" the standard S8 and call it an Active!", "time": "06-12-2017 10:07 PM", "replies": []}]}, {"postID": "post5848873", "text": "$50 for the built in case, huge battery, not having stupid curved glass and maybe a top layer added like on the s7 Active?\nI'm ok with this.", "time": "06-13-2017 06:42 AM", "replies": [{"postID": "post5850657", "text": "Yeah, the way the Note 8 development is going, I may be O.K. with it too Justin! I've really gotten to like my S7 Active while waiting for the Note 8... if the Note 8 doesn't fulfill expectations???", "time": "06-14-2017 04:04 PM", "replies": [{"postID": "post5850691", "text": "Right. \nIm not totally ruling out an upgrade when the Note hits though \nBut that idea took a huge hit today, I dusted off my VR and was reminded how crappy it is because of either\nA) a scratched up screen\nB) the vinyl protector having tiny dots and particles underneath.\nI dont see the Active getting vr support this time, but I will have a store installed glass protector Fingers crosses.", "time": "06-14-2017 04:49 PM", "replies": []}]}]}, {"postID": "post5857419", "text": "Stilllllllllll waitimg \nThese BOGO s8 deals are killing me. I know better than to get that hot mess, especially for my neice. But so tempting.", "time": "06-20-2017 04:54 PM", "replies": []}, {"postID": "post5857554", "text": "Sounds like a great device. Flat glass. Shock proof. Big battery. Water resistant. I could live without the buttons although I would prefer them. Make one with 16/9 screen", "time": "06-20-2017 07:11 PM", "replies": [{"postID": "post5908519", "text": "I actually liked the physical keys, it helps you use the phone while the phone is still wet. But it's nicer now the screen is bigger and has less bezels.", "time": "08-01-2017 05:27 PM", "replies": []}]}, {"postID": "post5858392", "text": "O.K. Guys, it's getting really close to the end of June - where the Hell is this thing? We still haven't even seen a significant Galaxy S8 Active leak other than that cheesy frontal view that everyone seems to have. Let's go \"Electronic New Sources\" - just because it's AT&T Exclusive doesn't mean there's not a large crowd waiting to read about it!!!", "time": "06-21-2017 12:52 PM", "replies": []}, {"postID": "post5861044", "text": "Here's some mention that Samsung accidentally posted a pdf regarding the Active 8 on it's website: https://www.cnet.com/news/samsung-ga...-in-documents/\nI tried to follow the link provided to Samsung's website and it looks like they took it down.", "time": "06-23-2017 02:17 PM", "replies": []}, {"postID": "post5862402", "text": "Yeh Ive seen that in the news, sites keep reporting it like it just happened and is groung breaking info.\nStill nothing being said on the At&t side.", "time": "06-24-2017 09:20 PM", "replies": [{"postID": "post5862501", "text": "The PDF leak was new as far as I'd heard. Everyone only reported it this week, as well as the GFXBench info. But still confirms the phone is on its way. AT&T has been the only one carrying this phone so I take that as a given. Not that I'm upgrading...", "time": "06-25-2017 12:32 AM", "replies": []}]}, {"postID": "post5874196", "text": "O.K. Samsung/AT&T - it's July! What the hell? Are you going to show us this thing or just leave us with drawings and rumors?\n(It's passed FCC, I saw that at least!)", "time": "07-05-2017 11:52 AM", "replies": []}, {"postID": "post5874740", "text": "I gave up. Grabbed an s8 today for myself & a family member and it is awesome", "time": "07-05-2017 08:47 PM", "replies": []}, {"postID": "post5878878", "text": "I'm going to keep an eye on the active , I think the regular s8 is too fragile for me even though I do like the phone . If the active is just as nice as the s8 but without all glass I think I'm gonna jump on it", "time": "07-09-2017 09:53 AM", "replies": []}, {"postID": "post5891663", "text": "Potential release date hints from S8 Active cases on Amazon. The majority of them state that they will be in stock on August 31st. \nBut one is available now!https://www.amazon.com/Absorbing-Protective-Holster-Kickstand-Samsung/dp/B00UKDE7V0/ref=sr_1_1?ie=UTF8&qid=1500364565&sr=8-1&keywords=samsung+galaxy+%22s8+active%22+case\nAnd there is already an S8 Active case review on YouTube: \nThe YouTube video review does a nice job of speculating about the size of the S8 Active. It seems like it will a 5.8\" screen, I hope so!\nSo we must be getting very close!", "time": "07-19-2017 05:21 PM", "replies": [{"postID": "post5891989", "text": "Thank you!", "time": "07-19-2017 11:36 PM", "replies": []}]}, {"postID": "post5895709", "text": "Damned, we have an Official Release Date for the Galaxy Note 8 of August 23 in New York but still nothing on the Active - what's up Samsung? I'd love to be able to compare the two at my AT&T Store in September when the Note 8 arrives and make an educated decision... let's get this \"Active\" Show on the Road!!!", "time": "07-22-2017 04:31 PM", "replies": []}, {"postID": "post5896594", "text": "We have actual photos of the Galaxy S8 Active! Flat screen, no green cammo, and it looks thick enough for a 4,000 mAh battery. https://www.sammobile.com/2017/07/23...ctures-leaked/", "time": "07-23-2017 11:43 AM", "replies": []}, {"postID": "post5897218", "text": "Excellent - thank you! I just grabbed the pictures and will crop them in Photoshop then re-post here if you don't mind, giving credit to Sammobile!", "time": "07-23-2017 11:09 PM", "replies": []}, {"postID": "post5897224", "text": "Thanks to DesertN0mad and Sammobile - first REAL pictures (not renders) of the Samsung Galaxy S8 Active! Click on his link above for more info...", "time": "07-23-2017 11:21 PM", "replies": []}, {"postID": "post5900298", "text": "The NO RAGRETS tattoo is in my mind lol", "time": "07-26-2017 09:10 AM", "replies": [{"postID": "post5901145", "text": "", "time": "07-26-2017 11:23 PM", "replies": []}]}, {"postID": "post5901477", "text": "Still not thrilled about the lack of physical buttons.", "time": "07-27-2017 08:24 AM", "replies": [{"postID": "post5901933", "text": "Seems we don't have a lot say about anything anymore Buddy! The ONLY way we could get Samsung to make a change that WE want is to stop buying as a group - and you know that'll never happen!", "time": "07-27-2017 02:59 PM", "replies": []}]}, {"postID": "post5902984", "text": "Another new article: http://www.droid-life.com/2017/07/28...-active-specs/\nThanks to donm527 for the link!", "time": "07-28-2017 11:28 AM", "replies": []}, {"postID": "post5903077", "text": "The new slides reveal the size of the S8 Active when compared to the other S8's:\nS8 dimensions: 5.86” x 2.68” x .31”\nS8 Active dimensions: 5.99” x 2.95” x .39”\nS8 Plus dimensions: 6.28\" x 2.89\" x 0.32\"\nThe dimensions in mm:\nS8 dimensions: 148.9 x 68.1 x 8.0\nS8 Active dimensions: 152.15 x 74.93 x 9.91\nS8 Plus dimensions: 159.5 x 73.4 x 8.1\nIt sort of fits in the middle.... http://www.gsmarena.com/samsung_gala...451.php#image1", "time": "07-28-2017 12:45 PM", "replies": [{"postID": "post5903438", "text": "Yeah, I think going to the flat screen, the metal body and bolstering the edges for shock resistance, it had to get a bit larger than the standard S8. I like it... I want to hold it in one hand and a Note 8 in the other hand and then make a decision. I might just end up with the Active. I've been enjoying the S7 Active since they took my Note 7s away from me - what the Hell, right?", "time": "07-28-2017 04:54 PM", "replies": [{"postID": "post5908719", "text": "If you plan to put a case on the Note 8 you should put a case on and then compare. The regular S series' biggest advantage over the Active series is their looks, but after owning a S6 Active and then a regular S7 I realized that with a case the regular S series is uglier, thicker, and heavier than the Active series.", "time": "08-01-2017 08:51 PM", "replies": [{"postID": "post5908861", "text": "Not a problem for me... I always run Big, Ugly cases on all my phones! Protection first - looks last, in my mind! Here's my old Note 7 in it's iBlason case... kinda' looked like my Super Duty!", "time": "08-01-2017 11:10 PM", "replies": []}]}]}]}, {"postID": "post5908556", "text": "The Galaxy S8 Active has now been appeared on the AT&T website! Sadly, not on the phone order page; not yet anyway. \nit is located at the link below in reference to an AT&T promo for a Samsung TV. The 3 Galaxy S8 models are listed as being eligible for the promo. \nHey, the fact that the S8 Active is actually mentioned by AT&T has got to mean that this phone is going live on the order page soon! \nClick on the link, scroll down the page, and expand the \"What Samsung smartphones are eligible\" section and lo and behold, there is the Active!!!https://www.att.com/deals/samsung-tv-deal.html", "time": "08-01-2017 05:53 PM", "replies": []}, {"postID": "post5908569", "text": "I wish VZW got it.", "time": "08-01-2017 06:06 PM", "replies": []}, {"postID": "post5908939", "text": "Cheers to big, ugly, tank-like cases that keep our phones safe and running trouble free after all of the rough and tumble! \nI use over-sized cases, massive extended battery cases (11800mAh!), and sometimes even put a cased phone into another case! \nThe backpack can take considerable abuse scrambling down a steep slope. The phone always survives!", "time": "08-02-2017 01:26 AM", "replies": []}, {"postID": "post5911309", "text": "Whoa, the reference to the S8 Active on the AT&T website has now been removed! All of the Android news websites reported on the fact that this was an official acknowledgement from AT&T that the S8 Active release was imminent. \nNow that AT&T has removed the reference from the website, who knows when the S8 Active will be released. A non-existent phone that I was able to order a case for.... \nHere is the AT&T link where the reference to the S8 Active has been removed. Scroll down the page and expand the \"What Samsung smartphones are eligible\" section:https://www.att.com/deals/samsung-tv-deal.html", "time": "08-03-2017 06:33 PM", "replies": []}, {"postID": "post5911635", "text": "I was on \"My AT&T\" this afternoon and selected \"Upgrade My Eligible Phone\" then went to \"Available Phones\" then selected \"Chat\"! I told the \"Chat Rep\" that I had seen pictures and specs for the Galaxy S8 Active - had they heard any news on when it would be available. He asked me to hang on for a minute then came back and said they were expecting the S8 Actives to arrive from Samsung in mid-September, just after the Note 8 ships! Can I trust him? Sounded like a good answer...", "time": "08-03-2017 11:26 PM", "replies": []}, {"postID": "post5912159", "text": "Just release the phone already! I'm ready to upgrade from my S5 Active and the S8 Active has to be ready to launch. /rant", "time": "08-04-2017 10:48 AM", "replies": [{"postID": "post5912534", "text": "Samsung probably doesn't want it to disrupt the introduction of their \"Flagship\" Note 8 so they're stalling it 'til after the Note ships! :-(", "time": "08-04-2017 05:13 PM", "replies": []}]}, {"postID": "post5914111", "text": "Samsung has bungled this completely.\nI cannot understand why this phone was not out in June, or why they ever release it later than the S series anyway. I could not wait and jumped in a great deal for my s8, but now I am juggling various cases for various events.\nIf I had the s8 Active instead, I would have tempered glass, a dBrand and just rock that 24/7 \nReally going to give another brand a consideration for my next device.", "time": "08-06-2017 09:19 AM", "replies": []}, {"postID": "post5915141", "text": "AT&T starts taking pre-orders for the Galaxy S8 Active on Tuesday, August 8th!!\nit will be in AT&T stores on August 11th.\nAnd in other breaking news, the S8 Active will be coming to other carriers!!!! https://www.sammobile.com/2017/08/07...open-tomorrow/", "time": "08-07-2017 09:28 AM", "replies": [{"postID": "post5915309", "text": "Wow - well, that last fact should make some people happy!", "time": "08-07-2017 12:16 PM", "replies": []}]}]}, {"title": "S8 active user interface questions", "thread": [{"postID": "post5945399", "text": "some questions here on the s8 active after using for a few weeks.....\nNew to this phone and upgraded from the s6 active....hoping someone can help answer some of these questions...a few of these are driving me nuts...hoping they are quick fixes....any help greatly appreciated. \n1. on the lock screen how do I change the clock screen display? I dont want to do the ALWAYS ON display. but hate how the clock is two digits at the top and bottom by default. any way to make it a standard clock time that reads horizontally without changing the theme??\n2. minor one...when connected to wifi connection and phone is unlocked after the notifications bar has been cleared is there a way to keep the wifi connection status connected to on display? sometimes it is there like s6. then when I clear it goes away. kind of odd\n3. the volume rocker on left side...can that be used to just control ringtone volume-up/down all the way to vibrate and silent mode like all other prior samsung phones??? now it seems defaulted to just controlling media sound which I have never seen before.\n4. what is the advance messaging read receipts for? samsung to samsung phones? I have never seen read receipts before when texting a samsung user. curious how that works? I have read receipts on but never see it used? I know many people may just be on Iphone but what about samsung to samsung?\n5.Also, is there a way for the phone screen to light up upon a notification when it is locked other than when a phone call is being received? \nUsed to be when a text or email, etc. hit the phone it would light up upon vibrate or sound notification so can see on the lock screen. Now it just vibrates but screen stays black.", "time": "08-29-2017 07:17 PM", "replies": []}, {"postID": "post5945726", "text": "#1 \nSettings/Lock Screen and Security\nI would post a pick, but the app will not give me the option.", "time": "08-29-2017 10:23 PM", "replies": []}]}]
[{"title": "Galaxy S8 Active Durability Test", "thread": [{"postID": "post5941558", "text": "This guy puts phones through tough, abusive tests. I'm talking about box cutters to the display screen, camera lens, etc. Kind of difficult to watch.\nI have read several reviews saying the S8 Active had an easily scratchable screen. People complained because if they put a screen protector on it the touch sensitivity of the screen is reduced. Apparently Samsung used to have a software setting to adjust screen sensitivity, but no more.\nI was surprised to hear the S8 Active has a plastic film on top of the gorilla glass. This is easily scratched. I wonder if it is replaceable?", "time": "08-27-2017 02:26 PM", "replies": []}, {"postID": "post5941565", "text": "The guy also did a drop test and a water submerge test.", "time": "08-27-2017 02:31 PM", "replies": []}, {"postID": "post5941620", "text": "AT&T is $40 a pop for glass protectors. I put $80, did not want to chance it.", "time": "08-27-2017 03:06 PM", "replies": []}, {"postID": "post5941815", "text": "You put on two glass screen protectors? How is your screen sensitivity to touch?", "time": "08-27-2017 06:17 PM", "replies": []}, {"postID": "post5943035", "text": "two phones, two protectors. Got mine through Best Buy for AT&T. Buy one phone get one phone free.", "time": "08-28-2017 01:06 PM", "replies": []}, {"postID": "post5943523", "text": "OK, that makes sense. Did you notice any loss of touch sensitivity, or did you buy the phones and immediately install the protectors? Were you able to compare before and after installing the protectors?", "time": "08-28-2017 06:56 PM", "replies": [{"postID": "post5943842", "text": "Bought the phones and immediately installed the protectors because the reviews all complained about screen screen scratches easily. I got the ZAGG INVISIBLE SHIELD glass+, have no complaints at all.", "time": "08-28-2017 11:34 PM", "replies": []}]}, {"postID": "post5943841", "text": "I'd say it passes with flying colors, hey? Wow! But that guy? If he asked to look at my phone, I'd be headed down the road in the opposite direction... FAST!", "time": "08-28-2017 11:34 PM", "replies": []}]}, {"title": "Active to Verizon this Year?", "thread": [{"postID": "post5936378", "text": "The rumors are out there, but nothing concrete yet. Any insight if the S8 Active will be available before the end of the year?", "time": "08-24-2017 02:04 PM", "replies": []}, {"postID": "post5936538", "text": "I have no insight. I've also done a fair amount of reading and I see nothing of substance. One can only hope it will make it to Big Red soon enough to be relevant.", "time": "08-24-2017 03:45 PM", "replies": []}, {"postID": "post5936548", "text": "I think you answered your own question. There are rumors.\nI've read the S8 Active will be an exclusive to AT&T \"only for a limited time.\" Now, does that mean that it will be an exclusive to AT&T for a couple of months and then be on other carriers? Or does it mean that it will be for sale on AT&T for only a couple of months and then *poof* it's not for sale anywhere?\nI am extremely interested in the answers to these questions. I see that 4,000 mAh battery, beautiful display screen, and awesome camera and want to be able to use it on Verizon.", "time": "08-24-2017 03:49 PM", "replies": []}, {"postID": "post5936711", "text": "Really hoping it will be this year.", "time": "08-24-2017 05:25 PM", "replies": []}]}, {"title": "No Edge Screen, No Edge Panel", "thread": [{"postID": "post5919421", "text": "Keep this in mind if you plan on moving from an S8/S8+. In the last month I decided to setup my Edge Panel on my S8+ and got all used it and realized it wasn't on the Active. Not a big deal to me though just thought people should know.", "time": "08-10-2017 02:07 PM", "replies": []}, {"postID": "post5919441", "text": "Samsung why you no want my money? It took weeks of training to stop swiping on my work issued s7.\nHonestly I do not use the edge much on my s8 because of that, but to exclude it completely is another fail from Korea.", "time": "08-10-2017 02:27 PM", "replies": []}, {"postID": "post5919473", "text": "The reason I got an S7 Active instead of an S7 Edge when they took away my Note 7, was I could not stand that Edge Panel. My fingers kept triggering things when I didn't want them to trigger! So, I purchased the S7 Active instead and love it... now I am looking at it's replacement, the S8 Active.\nWhy would you expect an Edge Panel on a Flat Screen folks? Just because this says S8? It's a different phone with a flat screen and I, for one, am happy that it does not have an Edge Panel! Thank you Samsung!", "time": "08-10-2017 02:49 PM", "replies": [{"postID": "post5919732", "text": "For sure, just thought I'd put it out there for folks who are trying to compare the two and over look the edge panel feature of they happen to use it a lot. But yeah I'm not dependent on it and don't mind not having it.", "time": "08-10-2017 07:24 PM", "replies": []}]}, {"postID": "post5919933", "text": "I never used the edge panel on my previous devices. I tried but didn't like it. I much prefer the flat screen. It's nice though to have options for everyone.", "time": "08-10-2017 11:29 PM", "replies": []}, {"postID": "post5929973", "text": "The chick at the ATT store had an S8, in a case, with a cracked screen. She said it was the 3rd or 4th S8 she had cracked. Edge this.", "time": "08-20-2017 04:35 PM", "replies": [{"postID": "post5930248", "text": "S8 or S8 Active?", "time": "08-20-2017 11:23 PM", "replies": []}]}]}, {"title": "Quick Unboxing Photos", "thread": [{"postID": "post5919072", "text": "Here are a few pics. Like the S8/S8+, AT&T packaging is getting better. 😂", "time": "08-10-2017 10:13 AM", "replies": [{"postID": "post5923395", "text": "I don't know why all phones can't be this thick so we can have bigger batteries and flush cameras. I'd rather have a phone that lasts longer and looks better due to a flush camera than have a thinner phone.", "time": "08-14-2017 02:07 PM", "replies": [{"postID": "post5923473", "text": "Ditto!", "time": "08-14-2017 03:56 PM", "replies": []}]}, {"postID": "post5927740", "text": "this looks perfect", "time": "08-18-2017 01:05 PM", "replies": [{"postID": "post5927863", "text": "Sweet, isn't it? I'm havin' trouble waiting for the Note 8 after seeing this Baby for less money and being used to the S7 Active for the last 8 months!", "time": "08-18-2017 03:02 PM", "replies": []}]}]}, {"postID": "post5919104", "text": "It's definitely got a little more heft to it, which is a good thing. Feels a lot more solid and not as fragile as the S8/S8+. It doesn't seem to have that crappy plastic layer over the screen that scratched easily like on the S7 Active. They added a thicker ring over the camera which makes finding the FPS easier as well. Overall I'm pretty impressed with the design of it so far. Time will tell on how it holds up.", "time": "08-10-2017 10:44 AM", "replies": []}, {"postID": "post5919120", "text": "Awesome thanks. Holding to pick one up tomorrow. Switching to att just to get this. Looks sharp.", "time": "08-10-2017 10:59 AM", "replies": []}, {"postID": "post5919219", "text": "Awesome! Thanks.", "time": "08-10-2017 12:15 PM", "replies": []}, {"postID": "post5919258", "text": "One new feature I noticed that's not on my S8+ is the ability to hide the navigation buttons at the bottom while in a app. So almost full immersive mode.", "time": "08-10-2017 12:34 PM", "replies": []}, {"postID": "post5919268", "text": "Thank you very much for the early preview... that was great!!!", "time": "08-10-2017 12:37 PM", "replies": []}, {"postID": "post5919406", "text": "Are the earbuds included like the regular S8/+?", "time": "08-10-2017 01:59 PM", "replies": [{"postID": "post5919417", "text": "Unfortunately, no.", "time": "08-10-2017 02:05 PM", "replies": []}]}, {"postID": "post5920389", "text": "Are you planning on putting a screen protector on or is it even necessary?", "time": "08-11-2017 10:53 AM", "replies": [{"postID": "post5920642", "text": "I never use a screen protector on any of my devices. But that's just me. 😉Yeah I got that too. Not sure what it was because it was already at the July security update out the box and didn't change after the update.", "time": "08-11-2017 02:52 PM", "replies": []}]}, {"postID": "post5920451", "text": "I always do (tempered glass) regardless! Cheap insurance!!!", "time": "08-11-2017 11:36 AM", "replies": []}, {"postID": "post5920499", "text": "Picked one up this morning. Sorry no pics. Don't have a other device right now to take them. \nIt's slippery. Much more so than I thought. Love the feel though. Feel real sturdy and built rock solid. Very fluid especially for a new device getting set up and settled. Time will tell. And bonus my bill will be cheaper on AT&T than it was on verizon.", "time": "08-11-2017 12:25 PM", "replies": []}, {"postID": "post5920501", "text": "Getting a small software update.", "time": "08-11-2017 12:26 PM", "replies": [{"postID": "post5920618", "text": "Wow...already? Probably just a Security Patch! Have some fun for a few days and then write some reviews for us folks please? I'm sure I'm not the only one here \"on the fence\" that could use some reading material to coax us over the edge! :-) Thank you for anything you can add!", "time": "08-11-2017 02:25 PM", "replies": []}, {"postID": "post5920642", "text": "I never use a screen protector on any of my devices. But that's just me. 😉Yeah I got that too. Not sure what it was because it was already at the July security update out the box and didn't change after the update.", "time": "08-11-2017 02:52 PM", "replies": []}]}, {"postID": "post5927678", "text": "Oh man, I would love this phone if I ever break my Note4. I don't want a phone with a glass back, I drop mine too often (I don't baby my phone). An edge screen is a nono for me as well. This would be my ideal replacement if I ever need a new phone.", "time": "08-18-2017 12:29 PM", "replies": [{"postID": "post5927711", "text": "I went from a Note 4, to a Note 5, to the Note 7, to the Replacement Note 7. When Samsung took that away, I tried to go back to my Note 5 but I had gotten used to the improved battery life of the Note 7s and couldn't deal with the Note 5. I bought an S7 Active and have been using it while waiting for the Note 8 to arrive. Truthfully, if the Note 8 doesn't show me something drastic next Wednesday when they debut it, I may just get the S8 Active. I really like this Active line... I've dropped it more times than I want to admit and it still doesn't have a scratch. I do have it in a case however... I decided not to leave it uncovered even though it was rugged. iBlasson Unicorn Beetle Hybrid case. Not too thick but sturdy... they make it for the S8 Active too.", "time": "08-18-2017 12:44 PM", "replies": [{"postID": "post5927874", "text": "The only thing I'm not too sure about is the screen size. Is this a smaller phone? I like big screens, S7 was way too small for me. Even s7edge seemed too small haha. Not sure how big S8s are. I take durability over beauty (aka glass) any day", "time": "08-18-2017 03:08 PM", "replies": [{"postID": "post5927926", "text": "It's a bigger than your Note 4 but probably not as big as the Note 5 or S7 Edge. They are tall but narrow this year for some reason.", "time": "08-18-2017 04:08 PM", "replies": []}]}]}]}]}, {"title": "In-Store demos?", "thread": [{"postID": "post5924315", "text": "Anyone seen any in-store demo units of the S8 Active? If so which stores?\nThanks", "time": "08-15-2017 11:34 AM", "replies": []}, {"postID": "post5924578", "text": "They got some at the two AT&T stores near me in michigan and best buy.", "time": "08-15-2017 03:21 PM", "replies": []}, {"postID": "post5924589", "text": "There was one at the AT&T store when I bought mine on release day. I wanted to feel it in my hands prior to buying. I bought the first one sold at the store.", "time": "08-15-2017 03:32 PM", "replies": []}, {"postID": "post5924697", "text": "My AT&T had both colors on demo but only the grey one was working. Came away with mixed feelings. Love the look of the front and edges but really didn't care for the back at all. Expected more of a rubber-ish and rugged feel. It's very slippery and not nearly as bulky as I thought it would be. Other than that, seemed like a great phone from the few minutes I got to spend with it.", "time": "08-15-2017 05:16 PM", "replies": [{"postID": "post5924896", "text": "Really... ? I'll have to stop by and take a look when I get a chance... I was going to wait for the Note 8 and just compare the two but maybe I should check out the S8 alone first!", "time": "08-15-2017 11:04 PM", "replies": [{"postID": "post5925560", "text": "Yea, it's by no means a bad phone. It's a great phone, and the one I will probably get( about a 75% chance right now). I was just disappointed with how the back feels. Felt kinda cheap to be honest. If I can hold out long enough, I want to see the V30 and Pixel XL 2.", "time": "08-16-2017 12:26 PM", "replies": []}]}]}, {"postID": "post5924723", "text": "Saw it at Best Buy on Saturday, the 12th.", "time": "08-15-2017 06:02 PM", "replies": []}]}, {"title": "S8 Active vs regular S8/S8 Plus", "thread": [{"postID": "post5912093", "text": "Would you take the Active version of the S8 over the initial S8 and S8 Plus? If so - why?", "time": "08-04-2017 09:25 AM", "replies": []}, {"postID": "post5912350", "text": "I would! I would like the flat screen, better drop protection, and the larger battery. The S8s should be what the active is, in my opinion.\nToo bad I'm not on AT&T. :-", "time": "08-04-2017 01:00 PM", "replies": []}, {"postID": "post5912414", "text": "Would definitely pick up the Galaxy S8 Active 😃 \nLooks are important to me but having stellar battery life and being a little more \"life proof\" is #1 . \nEspecially when traveling and you don't always have charging sources. (Camping and such)", "time": "08-04-2017 02:14 PM", "replies": []}, {"postID": "post5912530", "text": "Absolutely! Been running an S7 Active since Samsung took away my initial Note 7 and my Replacement Note 7 and I actually like it! I am still going to take a long look at the Note 8 when it arrives in September and compare it to the S8 Active before making a decision because I do miss the Note features, however... the BIG battery does the trick for me. I went back to my Note 5 at first and could not deal with the battery life after having the Note 7, even for the short time that we had them! The S7 Active has been awesome!!!", "time": "08-04-2017 05:07 PM", "replies": []}, {"postID": "post5912739", "text": "Yup! Shame they wait months (after the main devices) before the release it! I have poor impulse control and delay gratification.... :-)", "time": "08-04-2017 09:08 PM", "replies": []}, {"postID": "post5912784", "text": "100%i would! I just wish i knew about the active before I got the regular s8", "time": "08-04-2017 10:21 PM", "replies": []}, {"postID": "post5914216", "text": "Waiting patiently for the S8 Active. I'm with Matty, I need the tough case and larger battery for camping and hiking; heck, just life in general. \nThe flat screen and other S8 flagship spec goodness will be more than enough to justify getting it as my next phone. I will follow the reviews of the Note 8 closely, but it's not in the running for me at this point.", "time": "08-06-2017 11:42 AM", "replies": []}, {"postID": "post5914701", "text": "I'm not positive but the Active line seems like it gets updates slower if that matters to you.", "time": "08-06-2017 08:25 PM", "replies": [{"postID": "post5916514", "text": "That's correct. That's the major down fall of all past Active devices. However, this may be a different story if they plan to release an unlocked version.", "time": "08-08-2017 11:49 AM", "replies": []}]}, {"postID": "post5917721", "text": "Battery.", "time": "08-09-2017 09:31 AM", "replies": []}, {"postID": "post5918013", "text": "Anyway to buy outright unlocked on Verizon?", "time": "08-09-2017 01:21 PM", "replies": [{"postID": "post5918029", "text": "I was wondering the same thing. It doesn't appear that the models offered on the ATT and Samsung sites have the necessary VZW bands, or am I mistaken?", "time": "08-09-2017 01:28 PM", "replies": []}]}, {"postID": "post5918044", "text": "I have actually never tried the Active before since it was always an AT&T exclusive -- but I have wanted to just to see how it is.", "time": "08-09-2017 01:35 PM", "replies": []}, {"postID": "post5918068", "text": "They're saying that they will be offering them elsewhere later, but no details. I think it reads \"Exclusively at AT&T for a Limited Time Only\" which they have never done in the past so... there's some hope?", "time": "08-09-2017 01:48 PM", "replies": [{"postID": "post5918085", "text": "Yeah that is the very vague part .. Sure it may go elsewhere but to who? GSM only carriers like AT&T or will there be one for people on VZW and such? Definitely curious to know what they meant.", "time": "08-09-2017 02:02 PM", "replies": []}]}, {"postID": "post5918165", "text": "...and after I typed my post, I went and tried to find what I read - do you think I could find it again???", "time": "08-09-2017 02:55 PM", "replies": []}, {"postID": "post5918184", "text": "\"Early leaks of the Galaxy S8 Active revealed that it won't have AT&T branding, and there's a good reason for that. The carrier has exclusive access to the device \"for a limited time,\" but the phone will be available to non-AT&T customers at a later date. There's also the possibility that Samsung will sell it unlocked directly.\"\nThat's the best I could do!", "time": "08-09-2017 03:08 PM", "replies": []}, {"postID": "post5919449", "text": "I will try to get a better answer to the who and when sometime tomorrow.", "time": "08-10-2017 02:31 PM", "replies": []}, {"postID": "post5919464", "text": "Thanks Justin!", "time": "08-10-2017 02:40 PM", "replies": [{"postID": "post5920999", "text": "\"Unknown\". I thought I saw a timeframe, either was removed or never there.", "time": "08-11-2017 10:25 PM", "replies": []}]}]}, {"title": "Galaxy S8 Active not coming?", "thread": [{"postID": "post5891139", "text": "Typically the Active series are released mid-June. It's already md-July, Summer's half way over. Is it not coming out this year?", "time": "07-19-2017 11:01 AM", "replies": [{"postID": "post5891151", "text": "I believe it was on phone arena, but I've seen a couple of stories which alleged photos of it and i think there was a shot from a casemaker as well.", "time": "07-19-2017 11:11 AM", "replies": []}]}, {"postID": "post5891154", "text": "Cruiser has been to the FCC and has wifi cert, I'm seeing August 1 as projected date for AT&T.", "time": "07-19-2017 11:13 AM", "replies": [{"postID": "post5908506", "text": "Today is August 1! The Active series was supposed to be an annual summer release so people can go outdoors and swimming with it. Summer is nearly over. Been patiently waiting for the S8 Active. The S7 Active was good but screen was too small and was still using the old USB micro. Hopefully it gets released soon!!!", "time": "08-01-2017 05:19 PM", "replies": []}]}, {"postID": "post5891190", "text": "https://www.sammobile.com/2017/07/18...expected-soon/", "time": "07-19-2017 11:31 AM", "replies": []}, {"postID": "post5891237", "text": "Was curious if the delay was due to getting Bixby voice completed?", "time": "07-19-2017 11:50 AM", "replies": [{"postID": "post5908509", "text": "It might be actually. Their focus was mainly on Bixby during the past months. Or it could be they wanted to maximize sales of the regular S8 first before releasing a \"premium\" version (some may argue with that).", "time": "08-01-2017 05:20 PM", "replies": []}]}, {"postID": "post5891416", "text": "Im going to give it a close look myself when it hits at&t", "time": "07-19-2017 02:13 PM", "replies": []}, {"postID": "post5899916", "text": "https://www.sammobile.com/2017/07/23...ctures-leaked/", "time": "07-25-2017 11:24 PM", "replies": []}, {"postID": "post5908868", "text": "Well Bixby is out... so what's the hold up now? Let's get this show on the road! At least give me something to toy with while I wait for the Note 8?", "time": "08-01-2017 11:15 PM", "replies": []}, {"postID": "post5908886", "text": "You might have to toy with that truck while you wait Jimd! ;-)", "time": "08-01-2017 11:47 PM", "replies": [{"postID": "post5909377", "text": "", "time": "08-02-2017 10:10 AM", "replies": []}]}]}, {"title": "S8 Active image", "thread": [{"postID": "post5903668", "text": "I like it.https://pbs.twimg.com/media/DF3dolxXUAA9Wuk.jpg", "time": "07-28-2017 09:21 PM", "replies": [{"postID": "post5903756", "text": "Damned... me too!", "time": "07-28-2017 11:10 PM", "replies": [{"postID": "post5908517", "text": "This is the \"real\" S8, for the real true Galaxy fans (from back in the S4 and S5 days). Much better than the regular S8, curvy and nothing but a glass slab.", "time": "08-01-2017 05:26 PM", "replies": []}]}]}, {"postID": "post5903741", "text": "the cool thing is that they managed to maintain the bezeless display design of the regular S8.", "time": "07-28-2017 10:49 PM", "replies": [{"postID": "post5908513", "text": "Looks like the G6 on the front. Bezels are still kinda thick though to maintain the military grade standard. Fun fact, the S8 was supposed to be flat like this but last minute they made both regular S8 and S8+ curved.", "time": "08-01-2017 05:23 PM", "replies": []}]}, {"postID": "post5903790", "text": "Sweet!\nThe date on the phone is July 21st and the time is 12:45. Do you think that is when it was *supposed* to be released on the AT&T website? \nIt is appears tonight, it's only a week behind! LOL.", "time": "07-29-2017 12:24 AM", "replies": []}, {"postID": "post5904584", "text": "Yeah, ya know, where it's limited to AT&T, it's not like it's going to really affect the launch of the Note 8, so why not just quietly slip it into the AT&T Stores. No hoopla, no big intro - it's just AT&T after all! Right? I'll be there tomorrow checkin' it out!!!", "time": "07-29-2017 03:13 PM", "replies": [{"postID": "post5908514", "text": "If you buy from AT&T full price, they will unlock it for you. You are given access to unlock if your phone is fully paid off. Might be hard to convince them to sell it to you however without getting a plan.", "time": "08-01-2017 05:25 PM", "replies": []}]}, {"postID": "post5904959", "text": "More new pics.https://www.phonearena.com/news/Sams...4#image-296095", "time": "07-29-2017 09:38 PM", "replies": []}]}, {"title": "S8 Active leaked images", "thread": [{"postID": "post5828122", "text": "Looks pretty good so far (thanks to the FLAT screen). Not happy that they are ditching physical keys but I guess it's better because the software is already finished for the regular S8 to have on screen buttons. Not going to be pretty but at least not fragile like glass back S8s. Everyone puts a case on their phone anyway so it doesn't matter. What do you think? Definitely more practical than the regular S8. I'm assuming battery capacity will be 4000 or 4500 mAh (typically 30 bigger).\nNEW PHOTOS:\nVIDEO:", "time": "05-25-2017 04:12 PM", "replies": []}, {"postID": "post5828347", "text": "Looks like my 4 year old G2.", "time": "05-25-2017 08:14 PM", "replies": []}, {"postID": "post5829084", "text": "If it looks like that, I would be a happy customer. 😃 I think people who are purchasing the active version are not looking for something super flashy and rather something that has a lot of protection and long battery life. Still looks like the bezels are quite small.", "time": "05-26-2017 12:45 PM", "replies": []}, {"postID": "post5829144", "text": "Looks like the G6. Which is a good thing. Depending on final reveal, this is my next phone. If not, G6.", "time": "05-26-2017 01:24 PM", "replies": []}, {"postID": "post5829148", "text": "\"Camera\" button seems to be in a strange place to me though.", "time": "05-26-2017 01:25 PM", "replies": [{"postID": "post5865108", "text": "Probably will be a hybrid Bixby button and Active button, customizable. Probably could disable it all together.", "time": "06-27-2017 10:03 AM", "replies": []}]}, {"postID": "post5829553", "text": "Finally A FLAT SCREEN OPTION for those who WANT A FLAT SCREEN! Screen protector install will be a breeze, and phone will be more durable.", "time": "05-26-2017 11:17 PM", "replies": [{"postID": "post5829614", "text": "That is one of the downsides to having a curved display. While nice, it does pose problems for screen protectors and obviously the edges are more fragile when dropped. Flat screens are nice but ever since I moved to a curved display, can't imagine going back 😃 \nThat being said, I do think having a flat screen option is important. Having choice is always good.", "time": "05-27-2017 02:18 AM", "replies": []}]}, {"postID": "post5829784", "text": "what protection could it have, IP 68 like the xperia Z5 ?_________________________________________________________________galaxy s10 samsung galaxy s8", "time": "05-27-2017 09:18 AM", "replies": [{"postID": "post5830616", "text": "It will definitely have the standard IP68 water and dust resistance, but I'm also expecting some sort of screen 'shatter' resistance. 😃 Nothing military grade but just an improvement. It's designed to be rugged so excited to see what Samsung brings to the table.", "time": "05-28-2017 04:53 AM", "replies": []}]}, {"postID": "post5830719", "text": "It's supposed to be MIL-STD-810G and IP68 certified.", "time": "05-28-2017 07:40 AM", "replies": [{"postID": "post5860707", "text": "Last year, the S7 Active was rated MOST DURABLE smartphone of 2016. There was a YouTube drop test and the guy dropped it over 50 times until he got tired. YouTube it. I'm certain the S8 Active will look pretty similar to last year's design with the rubberized plastic back and an extra layer of polycarbonate on the glass.", "time": "06-23-2017 09:31 AM", "replies": [{"postID": "post5861527", "text": "The plastic layer on the screen really sucks.", "time": "06-23-2017 09:59 PM", "replies": [{"postID": "post5865105", "text": "It does, though it's the reason why it can survive many drops. You can actually remove the plastic layer off, though it's tricky.", "time": "06-27-2017 10:01 AM", "replies": []}]}]}]}, {"postID": "post5886240", "text": "wish this phone wasn't always an att exclusive. its about 1000x nicer than a regular s8", "time": "07-15-2017 11:17 AM", "replies": []}, {"postID": "post5899423", "text": "UPDATE: New leaked photos above. Video re-upload is included, gives a clear view of the S8 Active.", "time": "07-25-2017 03:17 PM", "replies": []}]}]
