[{"title": "Bluetooth not working", "thread": [{"postID": "post6074286", "text": "I read somewhere that many Motorola x phones were sold having a manufacturing fault, the bluetooth never worked and could not be fixed with a patch. I have just discovered that my Bluetooth does not work. Can anyone confirm this?", "time": "11-17-2017 10:34 AM", "replies": []}]}, {"title": "unable to select digital keyboard - moto x style", "thread": [{"postID": "post6024937", "text": "When using the Facebook Messenger app, What's App or my phone's messenger app, I am no long able to select the keyboard. I can select pictures or emoji's but when I click on the text bar, the digital keyboard doesn't pop up. I have a Motorola X Style running Android 7.0. I have tried deleting the app, using a third party keyboard app (Swift) clearing app data and even doing a factory reset. Nothing has worked\nThere is nothing wrong with my screen, as I can use the keyboard perfectly when in Google Chrome. When I tilt the screen, it is possible to use the keyboard in messenger. Could anyone please help me with this, as it is very annoying.\nThank you.", "time": "10-18-2017 02:40 AM", "replies": []}]}, {"title": "What to do when phone doesn't get repaired even in 2 months", "thread": [{"postID": "post5919510", "text": "It's been 2 months and service centre has not yet returned my phone. I'm about to file a consumer forum case.. Do I have another choice ?", "time": "08-10-2017 03:34 PM", "replies": []}]}, {"title": "How do I avoid having to reboot my phone daily in order to get 'Phone audio' enabled on Bluetooth?", "thread": [{"postID": "post5763606", "text": "Hi all\nI'm having this strange (but really frustrating) Bluetooth bug on my Motorola Moto X Style (XT1572) with Android 6.0. I already tried restoring the Phone to factory settings and without any extra apps but the issue persists. It just suddenly started happening (about a month ago).\nNothing has changed in the bluetooth devices that I use with my Phone. I connect my car using Bluetooth and if I'm not in my car, I use a Bluetooth hands free kit to make and receive my Phone calls.\nAbout a month ago my bluetooth started acting weird. When I'm in my car and want to make a Phone call, it starts the call on my Phone but then my car says that something went wrong and the call couldn't be initiated, although the call is continued on my phone. I do receive my text messages on my car and can also sent them but I'm unable to make/receive Phone calls.\nWhen I receive Phone calls, they don't come up on my cars media. However, my Phone says its using Bluetooth for the call and the bluetooth connection is up. When I'm having this issue, I can not disconnect the Bluetooth connection with my car on my phone. It refuses to disconnect and I can not switch to any other Bluetooth device. The same goes when I'm having the issue while connected to my other Bluetooth hands free kit. In the advanced bluetooth settings of the bluetooth connection on my Phone, I also noticed that when the issue occurs all Bluetooth functionality is checked (eg. 'Media audio'), except 'Phone audio'. 'Phone audio' is not checked and it refuses to check it (however it's not greyed out). When I tap on 'Phone audio' in order to enable it, you see it getting checked for like a few microseconds and then it instantly gets unchecked again.\nThe only remedy I found is to power off and start my Phone again. Very frustrating if you want to make a quick Phone call and that you have to wait 5 minutes each time or if someone is trying to reach you but they can't hear you and they keep calling back while you try to press the power off button :-).\nI've noticed that when I keep my Phone powered on at night and let it charge, the issue is present. If I recharge my Phone while it's powered of, pull out the power plug and then power on the Phone, there is no issue.\nIt seems to me that it has something to do with the update process...\nAny idea how I can solve this issue?\nPreviously I did had other bluetooth issues like sudden switches between the phone's speaker and the bluetooth hands free (without any clear reason), it would just switch the bluetooth audio off and on again. So imagine, I'm calling someone with my hands free kit and suddenly the sound is gone. I grab my Phone and hear the other person talking, I continue the conversation using my phone's sound, then the sound is gone again and I need to continue with my handsfree. Other times when the phone said it was using bluetooth audio, it actually wasn't and I had to select 'Phone speaker' and then bluetooth audio again to get audio via bluetooth.\nI don't think it has got anything to do with my car's bluetooth or my handsfree because the handsfree works flawlessly with my laptop and the car's bluetooth also works perfect with my partners Phone.", "time": "04-17-2017 10:28 AM", "replies": []}, {"postID": "post5763646", "text": "Welcome to the forums. Did you get an update before this happened?", "time": "04-17-2017 10:46 AM", "replies": []}, {"postID": "post5844127", "text": "Go to settings > location > press the 3 dots on the upper right > scanning,\nAnd turn off the \"Bluetooth Scanning\"", "time": "06-08-2017 11:21 PM", "replies": []}]}, {"title": "Random reboots even after factory reset....", "thread": [{"postID": "post5800314", "text": "Hello,\nI have my Moto X Style for a little less than one year. Had no problems with it at all, enjoyed it a lot, until about 3 weeks ago. It then started to randomly reboot, 3 or 4 times a day. I searched on Google and saw many people had that issue. Tried several of the \"solutions\" I found, uninstalled some apps I thought could be the cause, with no success. \n2 days ago, I decided to do a factory reset. Looked like it worked, for one day. Yesterday, it did reboot once again, only one time though. And now, it just rebooted again a few seconds ago...\nWhat can I do now? The dull thing is that every time it reboots, I lose the Bluetooth association with my devices and have to reassociate them, like the sound system in my car, and it sucks to enter the 0000 code and then having to add the player to the \"trusted devices\" and all....\nPhone is not rooted and running system (Android 6.0 with Dec. 1st security) . Build #MPHS24.49-18-16.\nThanks for any input.", "time": "05-04-2017 08:45 AM", "replies": []}]}, {"title": "Moto X Style: Android 7.0 Nougat", "thread": [{"postID": "post5746790", "text": "Looks like Nougat is rolling out for India SKUs?https://www.androidheadlines.com/201...gat-india.htmlAndroid 7.0 Nougat is now rolling out for some Moto X Style users", "time": "04-06-2017 12:49 PM", "replies": []}]}, {"title": "Dialer app is missing in my moto x style", "thread": [{"postID": "post5711567", "text": "While trying to locate and change the notification settings of the Dialer App unable to find the same in all apps menu under settings.", "time": "03-14-2017 03:24 AM", "replies": []}, {"postID": "post5711621", "text": "Welcome to the forums. Can you find an app called 'Phone'? This should be the stock dialer.", "time": "03-14-2017 06:02 AM", "replies": []}]}, {"title": "unable to mount or see my sd card in moto x style", "thread": [{"postID": "post5697928", "text": "Hey guyz please help me \nM using moto x style whn i purchase the phne i mount my sd card as my internal memory as normal feature in moto ... aftr a long time my battery gave problm so i gve my cell to services to chnage the battery ... they did it n also upgrade my phone bt now whn m inserting the same sd card it showing a error mag that the device is nt supported with this sd card n i need to mount again bt doing so will earse all my data i try to take a bck up nw bt my sd card also not shoeing in my laptop as it was mounted with moto early\nPlease help me to get my data it was all my personal n other photos please update me wat can i do to get the data", "time": "03-03-2017 08:59 AM", "replies": []}]}, {"title": "Contacts names dont show when being called", "thread": [{"postID": "post4936643", "text": "Hi,\nThe title says it all, when Im being called, there is no name shown, just the phone number of this person, this is really annoying.\nIve been having this issue since android 6.0.\nI have a Motorola Moto X style.", "time": "01-07-2016 07:54 AM", "replies": [{"postID": "post4937028", "text": "What region are you in and what format are the phone numbers in?", "time": "01-07-2016 11:58 AM", "replies": []}]}, {"postID": "post4937002", "text": "Welcome to Android Central! Does this happen even for callers who are saved in your Contacts app?", "time": "01-07-2016 11:48 AM", "replies": []}, {"postID": "post4937017", "text": "Take a look at this thread and see if any of those fixes work for you. http://forums.androidcentral.com/sho...d.php?t=619296\n6.0 Marshmallow: Contacts are not being recognized in calls log and incoming calls", "time": "01-07-2016 11:54 AM", "replies": []}, {"postID": "post4937280", "text": "as far as I know, I havent saved any contacts in my contacts app, I always save them to my google account.", "time": "01-07-2016 02:47 PM", "replies": []}, {"postID": "post4937438", "text": "And are your Google Contacts syncing with the phone? Do they show up in the Contacts app?", "time": "01-07-2016 04:10 PM", "replies": []}, {"postID": "post4938265", "text": "They show up in my contacts app yes, tried deleting partition cache but that didnt work either.", "time": "01-08-2016 05:29 AM", "replies": []}, {"postID": "post4939387", "text": "Are all callers showing up as only phone numbers, or only one? Are all of these callers's phone numbers already entered into your Google Contacts? Or could they be alternate numbers they're calling from, which aren't yet in your Google Contacts?", "time": "01-08-2016 05:13 PM", "replies": []}, {"postID": "post4939430", "text": "This happened to multiple people, around 10 I think, so I'm pretty sure this applies for everyone.\nAll of my numbers are in my google contacts, so I dont know whats up with that.", "time": "01-08-2016 05:31 PM", "replies": []}, {"postID": "post4939593", "text": "Ok, try wiping the cache partition as a general troubleshooting step: https://motorola-global-en-aus.custh...p/30,6720,9541", "time": "01-08-2016 07:12 PM", "replies": []}, {"postID": "post4940174", "text": "Tried this earlier, it didnt resolve the problem, so I dont think it will when I do it now.", "time": "01-09-2016 05:43 AM", "replies": []}, {"postID": "post4940819", "text": "Whoops, sorry--I missed that in your earlier post.\nHow about going to Settings>Accounts, removing your Google account, then adding it back again?", "time": "01-09-2016 01:44 PM", "replies": []}, {"postID": "post4941021", "text": "that worked! thank you very much", "time": "01-09-2016 04:18 PM", "replies": []}, {"postID": "post5524713", "text": "Worked for me too cheers", "time": "10-26-2016 08:12 AM", "replies": []}]}, {"title": "Top speaker", "thread": [{"postID": "post5492468", "text": "hi guys ..plzz help me with this isssue i have with my moto x style \nthe top speaker is crackling when i play any video on youtube when the volume is at the max .\ncertain notifications makes a poping noise in the speaker \noffline music (320kbps ) plays perfectly \npls pls do reply . fast so if there is an hardware issue i could possibly get it replaced ....\nthanks a ton b4 hand !!!", "time": "10-14-2016 10:22 AM", "replies": []}, {"postID": "post5492965", "text": "plz help me", "time": "10-14-2016 01:38 PM", "replies": []}]}, {"title": "Moto X Style - Sim card stopped working after 15 minutes", "thread": [{"postID": "post5422418", "text": "Hi. Yesterday I have purchased Moto X Style. My sim card was a micro and it must be converted to nano. I have gave my number and friend cut it with a special tool which has been created for this purpose. I have put it inside the sim card slot and it worked normally. But, after 15 minutes it has stopped working unexpectedly. It shows that \"No Sim Card\". I have tried to put card out and in again and again... But nothing helps", "time": "09-15-2016 10:06 PM", "replies": []}, {"postID": "post5422653", "text": "Welcome to Android Central! It probably was cut incorrectly, or the card may have been damaged in the process. Get a new nano-SIM from your carrier.", "time": "09-16-2016 01:24 AM", "replies": [{"postID": "post5423443", "text": "I will check different sim tomorrow. Is there any chance that phone was damaged ?", "time": "09-16-2016 10:10 AM", "replies": []}]}, {"postID": "post5424590", "text": "I doubt it, unless perhaps some fragments of the card broke off and lodged in the SIM slot.", "time": "09-16-2016 07:18 PM", "replies": []}, {"postID": "post5460837", "text": "I have bought new nano sim. And it didin't work.  What does that mean?", "time": "10-03-2016 05:42 AM", "replies": []}, {"postID": "post5461553", "text": "Does it still say No Sim Card? What carrier are you using?", "time": "10-03-2016 01:05 PM", "replies": []}, {"postID": "post5462431", "text": "Yes, exactly. It is local carrier. The main point is that sim card and it slot are stretched when I pin out it from the phone. I don't know why. When I have watched inside the phone with flashlight, I saw that some elements are curved. And it looks like it is defect. What I must do?", "time": "10-03-2016 11:29 PM", "replies": []}, {"postID": "post5462513", "text": "Where did you purchase the phone from? The easiest thing to do would be to return it to the seller and ask for a refund or exchange. If you bought it used and the seller refuses to take it back, then you could try contacting Motorola for warranty repair.", "time": "10-04-2016 01:34 AM", "replies": []}]}, {"title": "U3 vs U1 card for Moto X Style 16 GB, Using it as Adoptable Storage.", "thread": [{"postID": "post5445519", "text": "Hi,\nSo I'm planning on getting a Moto X Style White which is now only available in 16GB (32 GB has been out of stock for way too long) and So I;m thinking that I'll get an sd card to use as an Adoptable Storage Device.\nI've heard a lot about both the Samsung pro+ (U3) and the Samsung Evo+ (U1), the only problem is in my country only the 64GB variant of the Pro+ is available, whereas the 128GB version of the Evo is availble as well. \nSo my question is whether the performance increase from using the Pro+ U3 above is significant enough to warrant the reduced storage availability? Or will the performance be just a minor increase and I should get the 128 Gig Evo instead?\nThanks for the help", "time": "09-25-2016 04:48 AM", "replies": [{"postID": "post5445908", "text": "In my opinion the performance increase is not going to be that noticeable. Get the 128 model if that's what you want, which seems to be the case. \nLet us know how things go.", "time": "09-25-2016 10:57 AM", "replies": []}]}]}, {"title": "volte update in india", "thread": [{"postID": "post5424924", "text": "moto x play has already got volte update for reliance jio but moto x style did not.i could not use voice call over volte through jio sim.can you suggest anything in order to overcome my difficulties.", "time": "09-16-2016 11:38 PM", "replies": [{"postID": "post5435672", "text": "Welcome to Android Central!\nDid you ever figure out the issue?", "time": "09-21-2016 08:21 AM", "replies": []}]}]}, {"title": "Moto x style -Touch screen issues after turbo charging", "thread": [{"postID": "post5423654", "text": "I have ordered X Style and yesterday I got it. There was a turbo charger inside the box. But, it has 3 pins. And in my country 2 pins is a standart. So, I had to use a converter.\nAnyway, after charging the phone the problems begin to rise. Left and the right side of the screen are completely not reacting to touch events. But after 30 minutes it seems ok. Could turbo charger be a reason? My brother has Nexus 6 turbo charger with 2 pins. But, it is 0.5A. But, my charger is 0.7A. Can I use it?\nWhat I must do?\nThanks.", "time": "09-16-2016 11:42 AM", "replies": []}]}, {"title": "Anyone gone from nexys 6p to x style", "thread": [{"postID": "post5401149", "text": "Title meant to say Nexus \nI have a 6P. 32gB.. and yes its good... but its like a flat black slab in my hand and growing a little ugle now, whereas the MXStyle seems more shapely and it has an SDCard..\nMy question is.. what about the camera... is the camera as good as the EIS on the 6p, also Ive read reviews that say the speakers do get a little distorted at high volums on the pure / style... however, these reviews are from release day... and theres been some updates since then.. so\nWhats your opinion pls on audio and camera?", "time": "09-07-2016 09:41 AM", "replies": []}, {"postID": "post5403790", "text": "Had a chance to try an X Style out... Im sticking with the 6P.. yes its a bit big in the hand and the audio on the X has a more rounded fuller sound... I just find the OS on the 6P faster, and much more responsive and not so sluggish asit is on the X.. also the camera is better on the 6P..plus Android N is coming to the 6P in the UK very soon, but no evidence of it on the style.. However, I did like the Moto voice feature, very cool, reminds me of Cortana on my 950XL.. \nSo Im sticking 6P.. for now", "time": "09-08-2016 10:56 AM", "replies": []}]}, {"title": "Android apps like Lumia Refocus, Panorama and others?", "thread": [{"postID": "post5311948", "text": "Hello!\nI've recently migrated from Lumia 1020 to Moto X Style and am quite happy with it. The 1020, though, still has the best camera ever, in my opinion, and I do miss some cam apps, like Lumia Refocus, Lumia Panorama and others. Can you help me find similar Android apps?\nThx!", "time": "08-09-2016 03:39 PM", "replies": []}, {"postID": "post5401714", "text": "I recommend Proshot... which i used on my 1020 and 1520, which started on Windows Phone but now on Android.. also PhotoShop Express.. theres absolutely loads of camera and editing apps on Play STore", "time": "09-07-2016 02:03 PM", "replies": []}]}, {"title": "Bluetooth disconnection", "thread": [{"postID": "post5270424", "text": "Hello everyone.\nIn recent days, randomly, Bluetooth and GPS are disabled (together) for no particular reason and re-activate immediately.\nFor example in car when I listen to music, disconnecting the bluetooth stops the player.\nI use \"Tasker\" to launch Waze when my phone connects to my car stereo: everyBluetooth disconnection start it again.\nI am not very talkative, so I did not notice if it happened during a phone call with hands-free kit.\nThis is not very serious but it's embarrassing\nHow to know what is causing this off? (A special program for example).\nI have not installed new app recently. but I made regular updates to my apps (one of these update may be...)\nMy smartphone is Motorola Moto X Style Android 5.1.1 (Lollipop).\nThank you for your help.", "time": "07-18-2016 07:11 AM", "replies": []}, {"postID": "post5271367", "text": "Moved to the X Style forum.", "time": "07-18-2016 05:13 PM", "replies": []}]}, {"title": "Android mobile stuck in bootloader - Need help in recovering data", "thread": [{"postID": "post5250923", "text": "Moto X Style phone is not loading Android.\nAfter starting the phone, it just shows Moto Logo & then goes blank. (I think its not booting OS)\nAm able to access 'fastboot' options & 'recovery mode' options.\nUsing adb, 'adb devices' command doesn't display any devices and 'adb shell' command displays 'error:device not found'.\nI dint back up my phone data, I need to recover my data before doing factory reset. Please help.", "time": "07-04-2016 11:59 AM", "replies": []}, {"postID": "post5252271", "text": "Moved to the X Style forum.", "time": "07-05-2016 01:59 PM", "replies": []}]}, {"title": "Help with my battery please!", "thread": [{"postID": "post5250958", "text": "Hi guys, can anyone see this pictures and tell me if there is something wrong with my battery please...\ni saw some pictures of some people who their battery last for 3 or 4 days on a moto x style... I cant make it last 1 day...", "time": "07-04-2016 12:31 PM", "replies": []}, {"postID": "post5252269", "text": "Welcome to Android Central! Facebook apps tend to be battery hogs, so it might be worth uninstalling Facebook Messenger temporarily.\nHow old is your phone? If you've had it for a while, do you typically let the battery drain to <10%? If so, that habit can reduce the overall battery lifespan.", "time": "07-05-2016 01:57 PM", "replies": []}]}, {"title": "\"Open with\" doesn't show installed media apps", "thread": [{"postID": "post5229376", "text": "Hello to all,\ndoes anyone have an idea why I'm not offered any of the installed media players when opening a video file, other than pre-installed ones? I've installed VLC, MX Player and BSPlayer, and none of those are offered in the Open with dialog...", "time": "06-18-2016 04:36 AM", "replies": []}, {"postID": "post5230387", "text": "Welcome to Android Central! What kind of video file--mp4 or something else? If you open one of those players first and search for the file, does it play then?", "time": "06-19-2016 02:52 AM", "replies": []}, {"postID": "post5250601", "text": "Sorry for my slow replies... \nthis WAS isolated to Chrome/Firefox browsers and ES File Explorer, while when opening a file from the gallery I saw the choice of all installed media apps. But, this issue somehow fixed itself...", "time": "07-04-2016 05:51 AM", "replies": []}]}, {"title": "Moto X Style Heating issues", "thread": [{"postID": "post4957842", "text": "Hello everyone,\nI own Moto X Stytle (Indian Version). Truly love this phone.\n1. Old Unit\nThere are some serious heating issues need your comments.\nSo last month I've ordered & then upgraded to Android Marshmallow.\nOn 5 min usage the phone heated up like hot cake. Even if I play low end games like candy crush saga or temple run or subway surfers & when I played asphalt airborne that went even higher.\nCooler Master temperate was 46.5 C and CPUz was close to 47 C\nSo I called up to get the unit replaced.New Unit\nNow I've the new unit (upgraded to Android Marshmallow)\nSame issue but the temperate is bit lesser even then touches around 45 C (Cooler Master and CPUz score) on 5 - 10 mins use\nMy new units AnTuTu Benchmark score is over 69k. There are some lags When I play games like candy crush saga but these are not much seen when I play asphalt airborne or modern combat\nEven while browsing or using wifi the temperature moves upto 42 C\nWhen the unit heats I cant take up calls as the screen is very hot. The heat are on both sides of the phone. Front side feel are more.\nAre these normal or even my new unit is bad one.\n2. There are some lags on the new unit while using applications.\n3. Here comes the battery life (I've the screen brightness to almost minimum around 15%)\nNormal use > about 1 day\nMixed use > 12 hrs\nHeavy games > 5 hrs max\nSo is this hardware fault or do you think Motorola / Lenovo would come up with an update to solve the issue.\nCan you help as I'm bit scared as this one my first high end phone.\nThanks in advance.", "time": "01-20-2016 01:49 AM", "replies": []}, {"postID": "post4958405", "text": "Depending on what games you play it could get hot. Angry Birds 2 will heat it to 110F easily, lots of YouTube or browsing maybe 100F. \nI assume these temps are without connection to the turbo charger?\nBattery life decent, light use 1 day, medium use needs topping off in the afternoon, heavy use around 6-7 hours?", "time": "01-20-2016 10:42 AM", "replies": []}, {"postID": "post4959486", "text": "Do you mean heating up in only 5 mins use is normal in Moto X Style", "time": "01-21-2016 12:39 AM", "replies": []}, {"postID": "post4960212", "text": "What the max temperature your phone has recorded\n1. Heavy use\n2. Moderate use\nMine are as on Cooler Master and CPUz\nHeavy use - 45 C\nModerate use - upto 42 C\nPost your comments", "time": "01-21-2016 12:23 PM", "replies": []}, {"postID": "post5151710", "text": "Mine temp reading once reached 49 deg cel n then on i have stopped using navigation, was driving for 3-4 hrs.. \nScared if it blows off some day due such heat issue.\nHas anyone found a way to tackle this issue", "time": "04-28-2016 10:38 PM", "replies": []}, {"postID": "post5173395", "text": "I have the moto x force & my phone was hearing up quickly the other day & my battery life was shorter too. Found out it was the Facebook app causing problems so deleted it & installed metal instead. Now my phone is back to normal & never goes above 40 degrees C unless it's turbo charging.\nPosted via the Android Central App", "time": "05-12-2016 04:45 AM", "replies": []}]}, {"title": "Light user battery expectancy", "thread": [{"postID": "post5148667", "text": "Hey all,\nI'm considering the Moto Style but have some concerns over the 3000mah battery, shall we say, less than favourable reports!\nAs I'm what you would class as a light user - would it be unreasonable to expect a full day out of it? \nAnother question: Antenna strength. Would someone give me a quick run-down as to how good the antenna is in the Moto Play? My iPhone 6s seems weaker than other phones in my household. Heck - even my back-up Moto G 3rd gen has a better antenna than my iPhone 6s. \nMany thanks.", "time": "04-27-2016 06:22 AM", "replies": []}, {"postID": "post5161476", "text": "My X Style easily gets me through a day. When Doze kicks in, the battery is amazing. Just dont go running around and expect 4hrs of sot on full brightness...\nComing from an LG G2, I was kinda spoiled batterylife wise. The Moto X charges so fast however, that I dont mind the 'smaller' battery..\nFrom my Moto X Style", "time": "05-05-2016 12:22 AM", "replies": []}]}, {"title": "Why can't my phone play music?", "thread": [{"postID": "post5151007", "text": "I have been having issues with my Moto X Style. I upgraded it to Marshmallow and started experiencing audio problems. Once in a while, Google play music gives me an \"audio playback error\" while black player doesn't play anything. The ringtones and notification sounds do not work either. After further investigation I found that this problem only arose when I had Facebook's messenger app installed. I need messenger for keeping in touch with my friends but at the same time the error is quite annoying and makes me miss important calls. Any suggestions and help will be great.", "time": "04-28-2016 01:47 PM", "replies": []}, {"postID": "post5151986", "text": "Firstly restore your phone ,I always recommend to restore after every Android upgrade i.e 4.4 to 5.0 or 5.0 to 6.0,", "time": "04-29-2016 05:04 AM", "replies": []}]}, {"title": "Moto X Style/Pure Edition SD card & SIM tray problem?", "thread": [{"postID": "post4823085", "text": "I recently bought a Moto X Style and found the SIM tray didn't 'pop' out, only open slightly, so I had to prize it out with a thin piece of plastic. I also found my Samsung 32GB Evo Micro SDHC didn't work in it, however that card did work in my 2013 Moto G. As a result I returned the phone to Amazon UK on case I had a faulty unit and ordered another.\nHaving received a replacement I've found the same problems, so wanted to share this with others. Does anyone else find their SIM tray near impossible to remove, and has anyone else tried this SD card in their Moto X?\nAs an aside, I've just swapped from a Nexus 6P to a Moto X Style (as I missed the Moto features) and it's surprising how big the size difference is. Moto is so much smaller than the 6P and so much nicer to hold.\nPosted via the Android Central App", "time": "11-11-2015 10:08 AM", "replies": []}, {"postID": "post4908291", "text": "Hi, I can only really comment on the sim card tray as I don't use an SD card but it shouldn't really pop out, cause if it did you might drop it on the floor and loose it. I agree it's quite difficult to get it in and out, but once you manage to pull the tray out and put your sim in it, you probably won't be accessing that part of the phone too often. \nAs for the SD card, when you put it in the phone does it just not recognize it? have you tried formatting the card?", "time": "12-22-2015 04:44 AM", "replies": []}, {"postID": "post4959558", "text": "anyone know whether x pure and style share the same sim card tray? i got a pure its sim card tray has 2 sim card slots but the top one has been covered by plastic,wondered if that one can read sim card?", "time": "01-21-2016 01:49 AM", "replies": []}, {"postID": "post4964103", "text": "The SIM tray doesn't pop out all the way when using the SIM ejector tool. It only comes out enough for you to use your nail to slide it off.\nAs for the Samsung MicroSD card... I had the same issue when formatting it to be part of the internal storage. Regardless how many times I tried, I kept getting the error that the card was too slow even though it was a Class 10.\nI replaced it with a Class 10 SanDisk, and it went through the process without any issues. So try changing your card like I did.", "time": "01-24-2016 05:47 AM", "replies": []}, {"postID": "post5009978", "text": "Actually, you can press the tool a little harder, and the tray will just pop right out", "time": "02-22-2016 05:00 PM", "replies": []}, {"postID": "post5104229", "text": "I have a samsung evo 64 gb card and it works just fine. I have it configured as external storage.", "time": "04-04-2016 02:05 PM", "replies": []}]}, {"title": "Motorola has the worst customer and after sale service, can I please get some help?", "thread": [{"postID": "post5069729", "text": "I have not seen such a pathetic service. I submitted my moto x style on 4 jan due to a faulty display. It has been more than 70 days and still my phone is not repaired. They are saying that the part isn't available. I don't know what to do. I just want my phone back.", "time": "03-18-2016 11:38 AM", "replies": []}, {"postID": "post5069848", "text": "Are there any cosumer-protection laws that you could leverage? You could call them (provided you have another phone) and escalate to a manager.", "time": "03-18-2016 12:20 PM", "replies": []}, {"postID": "post5091696", "text": "2 of my Moto X Style are with Motorola/Lenovo for last 2 months, for change of cracked display. They have just been promising a date, postponing it, promising a new date. No commitments, no promises kept till date. Completely useless and pathetic after sales service and support (At least in India). \nThis was my last phone of Moto, with this experience, I am neither buying nor recommending Moto to anyone ever.", "time": "03-28-2016 10:45 PM", "replies": []}]}, {"title": "How much space is Marshmallow supposed to take?", "thread": [{"postID": "post5019685", "text": "I have a Moto X Style, and it shows that my OS is taking up 8Gb of space on it. I am running Marshmallow with the latest security patch.", "time": "02-27-2016 01:38 PM", "replies": []}]}, {"title": "Is the Moto X Style thicker than the second gen Moto X?", "thread": [{"postID": "post4991214", "text": "I have Moto x 2014 But 1 want to upgrade my phone to moto x style i have heard that style is 1 mm thick than moto x 2014 does it make any diffrence", "time": "02-10-2016 11:05 AM", "replies": []}, {"postID": "post4991471", "text": "moto x style is the most convenient , most ergonomic phone I had in spite of its size. Regards.", "time": "02-10-2016 01:47 PM", "replies": []}]}, {"title": "Defective battery?", "thread": [{"postID": "post4985579", "text": "Had my Moto X Style for about a month now it's an absolutely brilliant phone but the battery life SUCKS\nBeen getting no more than 2 hours screen on time and little more than 5 hours with moderate usage and can barely hit 12 hours before it dies under light usage. As for standby time, even with the marshmallow update I've gone to bed with 100% battery and woken up with 50% in the morning. I've disabled Moto Voice and Active display and I usually set the screen around 50% brightness.\nJust wondering what everyone else's experience is as I'm not sure whether I have a defective battery or if this is just a general issue.\nPosted via the Android Central App", "time": "02-06-2016 03:37 PM", "replies": []}, {"postID": "post4985603", "text": "Go to Setting/General/Battery. Take a screenshot. Tap the graph to go to the second page and take a screenshot. Post them. (See How To Post Screenshots on Android Central.) We need to see what's happening.", "time": "02-06-2016 04:05 PM", "replies": []}, {"postID": "post4986641", "text": "Well it seems to be behaving today despite some fairly moderate usage but here we go anyway\nPosted via the Android Central App", "time": "02-07-2016 11:41 AM", "replies": []}, {"postID": "post4986983", "text": "Two things: it looks like your signal is poor and you have apps keeping your phone awake even when your phone screen is off. Both really hurt battery life.", "time": "02-07-2016 05:02 PM", "replies": []}]}, {"title": "Total RAM, why is it 2.5GB and not 3GB?", "thread": [{"postID": "post4957839", "text": "The phone comes with 3 Gb total ram as advertised\nBut why do I see only 2.5 Gb total ram (Settings > Memory)\nCan someone comment on the same", "time": "01-20-2016 01:39 AM", "replies": []}, {"postID": "post4957857", "text": "I don't have the phone, so I can't see what setting you're looking at, but is that total RAM or used RAM. If has 3GB, having 2.5GB in use would be normal.", "time": "01-20-2016 02:06 AM", "replies": []}, {"postID": "post4957879", "text": "http://forums.androidcentral.com/mot...bytes-ram.html\nPosted via the Android Central App on the Moto X Pure Edition", "time": "01-20-2016 02:32 AM", "replies": []}]}, {"title": "Why is my marshmallow download getting stucked at 99% ?", "thread": [{"postID": "post4918112", "text": "I own a moto x style. Recently I got a pop up that I have a system update, for marshmallow 6.0. When I'm downloading it through settings>aboutbphone>system update, every time it gets stuck on 99%. (644.6 MB/651.1 MB).\nI have already tried downloading thrice. Checked my WiFi connection n all, everythings proper.\nCan someone help me out with this?", "time": "12-27-2015 02:29 PM", "replies": []}, {"postID": "post4918769", "text": "Hi, welcome to the forums! I'll send a message to the moderators and see if they can move this thread to the X Style forum where it could have more visibility.", "time": "12-27-2015 10:01 PM", "replies": []}]}]
[{"title": "What does pure android mean?", "thread": [{"postID": "post4851434", "text": "Thinking about getting a moto phone next year as I like the bigger battery. But what does pure android experience mean with these phones? The only minus thing is that's it's bigger than my phone which is a Samsung galaxy S4. Need something the same size really but the moto x style, moto x play & moto x force all seem really good what I've read. Can't find these phones on EE's website unfortunately. So what does pure android experience mean?\nPosted via Android Central App", "time": "11-23-2015 08:15 AM", "replies": []}, {"postID": "post4851444", "text": "A good basic definition is that a \"Pure Android\" device has no carrier bloatware/no added apps.\nJust Google apps are on the device. \nThe Nexus line is the best example of this.\nMav.", "time": "11-23-2015 08:19 AM", "replies": []}, {"postID": "post4851592", "text": "That sounds good to me but dunno if I can get one of the moto phones I mentioned on my first post with a carrier like EE or Vodafone etc? So if the phone is 16GB's I'll get near enough the 16GB's? My S4 is 16GB's but only got 9.25GB's to use which is nearly all used up.\nPosted via Android Central App", "time": "11-23-2015 09:32 AM", "replies": []}, {"postID": "post4858880", "text": "I highly recommend getting a phone with minimum 32GB. Even if you have an SD card, you'll need space for the OS and even the the most basic apps.\nI don't know anything about Europe and Motorola phone availability. But, pure Android is the way to go. Skins on top of Android like Samsung's TouchWiz suck.\nLet us know what happens. \nPosted via the Android Central App", "time": "11-26-2015 02:51 PM", "replies": []}, {"postID": "post4861839", "text": "Went to the carphone warehouse today to look at these 3 phones & I loved them. They are a bit bigger than my phone so would have to get use to the size of it. I played around a lot with the moto x style & it had 24GB's left out of what i think is 32GB. Not bad on the memory, definitely a lot more than what I had available on my Samsung S4 as I only had 9GB. This phone is looking very likely for my next phone next year. I'm hoping it will be a bit cheaper next year too.\nAlso does this phone have a battery percentage so I know how much battery I have left etc? \nPosted via Android Central App", "time": "11-28-2015 01:17 PM", "replies": []}, {"postID": "post4898489", "text": "If you get an app called percent enabler from the play store you can see the level in the battery icon.\nPosted via the Android Central App", "time": "12-16-2015 05:13 PM", "replies": [{"postID": "post4903972", "text": "Cool will have to check that out when I get either the moto x style or force. Thanks. \nPosted via Android Central App", "time": "12-19-2015 02:01 PM", "replies": []}]}, {"postID": "post4904786", "text": "It looks like this by the way.\nPosted via the Android Central App", "time": "12-20-2015 05:41 AM", "replies": []}, {"postID": "post4904909", "text": "If you have Marshmallow 6.0 you can have the percentage in the battery icon without adding an app. You need to enable System UI Tuner.\nPull down the notification shade and long-press on the Settings gear icon for about 5 seconds then let go. You should see a pop-up with the message “Congrats! System UI Tuner has been added to Settings.” Now you cam go nto settings, scroll to the bottom, and find an option for System UI Tuner. Among other things, there's auln option to display the percentage in the battery icon.", "time": "12-20-2015 08:09 AM", "replies": [{"postID": "post4905398", "text": "I heard about this trick. Doesn't a message come up saying some things may brake or something along those lines?\nPosted via Android Central App", "time": "12-20-2015 02:10 PM", "replies": [{"postID": "post4908280", "text": "Hi, \nMy wife was looking to upgrade her Note 3 a month ago, she was with EE. She decided to leave and go to O2 as they had the Nexus 5x, which she wanted. Nexus & Moto offer very similar devices (pure Android) the sales rep from EE told me that in 2016 they plan on getting the Moto X, Moto G, Nexus 6p and Nexus 5x so maybe by the time you are ready for a new phone they might have it. \nPure Android is the way to go, it's fast, smooth and looks good. Other companies like Samsung, HTC, Sony all run Android, but they have their own version of how it should look. \nAs for storage, every phone uses up some space for the current operating system it's running, but pure Android devices will have more available as they don't have bloatware like Samsung, HTC and Sony offer. \nI currently have the Moto X Style and love it - my wife's Nexus 5x is also awesome so you can't go wrong  it might be worth while checking out the Nexus 5x as it's smaller and lighter than the Moto phones.", "time": "12-22-2015 04:36 AM", "replies": [{"postID": "post4909802", "text": "I'm with EE at the mo but when I popped in one of the stores to return my power bar I looked at there phones & they had both Nexus devices. Don't think I saw any moto phones though. Not sure if I should get the phone from EE or the carphone warehouse as EE will probably but a load of bloatware on which I don't want. My S4 has loads of bloatware on it & only left me 9GB which is nearly full, have to keep clearing the cashe every month.\nPosted via Android Central App", "time": "12-22-2015 04:31 PM", "replies": []}]}, {"postID": "post4908283", "text": "Oh, and to answer your question, no - nothing will break  when you press and hold on the settings wheel, it gives you some UI tweaks in the settings menu. The only two useful ones are being able to display the percentage of the battery in the battery icon and having the ability to arrange the quick toggles in the drop down menu.", "time": "12-22-2015 04:39 AM", "replies": []}]}]}, {"postID": "post4905417", "text": "The message says something like things may break, be removed or added in the future. It only applies to the options added by System UI Tuner. Don't worry, ignore it. The same exact things could be said about any app you install.", "time": "12-20-2015 02:21 PM", "replies": []}, {"postID": "post4910771", "text": "Hi, I'm not sure if they would put bloatware on the phone, on your S4 - do you have EE bloatware? Either way I would suggest going with Carphone Warehouse, they usually can get you a decent deal", "time": "12-23-2015 03:22 AM", "replies": [{"postID": "post4912368", "text": "It's either EE putting the bloatware on or Samsung when I've had updates for my S4. I think Deezer is to do with EE & I've had Deezer since I got the phone. Never had kids mode before & that appeared after an update. Was thinking of going with the carphone warehouse coz when I looked at the moto x style & the moto x force they had about 24GB's left. Seems ok for me. Much more than 9GB's.\nPosted via Android Central App", "time": "12-23-2015 07:16 PM", "replies": []}]}]}, {"title": "Android 6.0 Marshmallow for the Moto X Style", "thread": [{"postID": "post4826337", "text": "https://plus.google.com/+DavidSchust...ts/KfeLZerX4Ua\nRoll-out starts with Brazil and India retail models.", "time": "11-12-2015 10:15 AM", "replies": []}, {"postID": "post4827058", "text": "Per Sandy Speirs' comments, this will include the November 2015 security patch.https://plus.google.com/u/0/+SandySp...ts/i7fwsy8AhJo", "time": "11-12-2015 02:31 PM", "replies": []}, {"postID": "post4828477", "text": "I wonder how long before it hits europe..", "time": "11-13-2015 05:02 AM", "replies": []}, {"postID": "post4908555", "text": "Wish it had came with a new camera layout. I'm using Google Camera the now as I prefer their UI, but don't like the fact I can't use the twist feature to launch it.", "time": "12-22-2015 08:18 AM", "replies": []}]}, {"title": "Battery life for Moto X Style/Pure after Marshmallow update", "thread": [{"postID": "post4853839", "text": "Those who have updated their Moto X Style to Marshmallow 6.0, can you tell me your experience with the battery life before and after updating.\nThough I have updated my device also, I don't see much of a difference in battery life. May be I could not see it.\nHence, anyone with a valid experience can share it here.", "time": "11-24-2015 07:29 AM", "replies": []}, {"postID": "post4855433", "text": "I got my phone on monday.. and I got the marshmallow update just when I turned the phone on.. my battery has lasted me quite well with moderate use.But still its not above average.", "time": "11-24-2015 08:15 PM", "replies": []}, {"postID": "post4867504", "text": "Getting good battery life after marshmallow.... This is with data disabled and on WiFi for whole day.\nPosted via the Android Central App", "time": "12-01-2015 12:03 PM", "replies": [{"postID": "post4868286", "text": "How many hours of sot did that equate to?", "time": "12-01-2015 05:50 PM", "replies": [{"postID": "post4868692", "text": "It took me through the whole day.. Approx 12 13 hours..", "time": "12-01-2015 09:46 PM", "replies": [{"postID": "post4870000", "text": "Great but how many hours of screen on time was that?", "time": "12-02-2015 03:16 PM", "replies": []}]}]}]}, {"postID": "post4908551", "text": "I haven't noticed much of a difference, but my battery was decent before 6.0 and it continues to be decent. I guess I can see that it's got slightly better, I no longer drop much when I take it off the charge first thing in the morning, before it would drop to 99% instantly.", "time": "12-22-2015 08:17 AM", "replies": []}]}, {"title": "Music player does not mute when I receive a call on my Moto X style/pure edition (Marshmallow), how can I fix this?", "thread": [{"postID": "post4870880", "text": "Usually when you are listening to music and you happen to receive a call the music playback is interrupted and the ringtone is played...but this is not happening in my phone...even though the phone vibrates and the call is displayed on my screen there are chances for the call to go unnoticed when am using an earphone. Could someone provide a solution to this so that the music playback is interrupted when I receive a call...or are there chances that my phone is faulty??", "time": "12-03-2015 01:02 AM", "replies": []}, {"postID": "post4908544", "text": "Hi, does this happen all the time or just once? I have tested out the above to see if I had the problem and I don't.", "time": "12-22-2015 08:13 AM", "replies": []}]}, {"title": "Moto x style: Turbo Charger?", "thread": [{"postID": "post4723364", "text": "I just noticed that the moto x style international have a 3 Pin Mains Adapter... where the hell do I connect this to?? (I live in israel)\nIf this is the international version of the phone, why do I get a charger with 3 pins??? I have no where to connect this to, and my phone is already being shipped by CLOVE\nGot this reply from clove:Then told them why not put a 2 pin charger for me the first placeJust great!!\nNow I cant enjoy a fast phone charging.What am I suppose to do now?", "time": "10-02-2015 02:25 AM", "replies": [{"postID": "post4908293", "text": "Why did you buy it from a UK site? of course a UK retailer is going to ship with a UK plug. Could you imagine all the thousands of people that bought a Moto X from Clove who live in the UK didn't get a UK plug??\nThe Moto X Style is the international version of the US Moto X Pure - buy your products direct from Moto if you want the charger compatible with your country or better yet, buy it from a retail store in Israel.", "time": "12-22-2015 04:51 AM", "replies": []}]}, {"postID": "post4797520", "text": "An adapter shouldn't affect charging speed.\nPosted via Android Central App", "time": "11-02-2015 04:05 PM", "replies": []}]}, {"title": "When will Moto maker be available in India?", "thread": [{"postID": "post4810966", "text": "I want to buy moto x style in india,but there are only two colours.so how can i customize my phone in various colours and frames?", "time": "11-07-2015 11:07 AM", "replies": []}, {"postID": "post4908292", "text": "Hi, they do have plans to launch this in India, but no concrete date has been agreed yet. Can you not buy one from the UK and have it shipped to yourself?", "time": "12-22-2015 04:45 AM", "replies": []}]}, {"title": "What camera option to use?", "thread": [{"postID": "post4822742", "text": "What camera should I use on the Moto X Style and why?\nA) 21MP with 4:3 ratio.\nB)16,1MP with 16:9 ratio.\nThanks for all the feedback!\nPosted via the Android Central App", "time": "11-11-2015 08:55 AM", "replies": []}, {"postID": "post4882198", "text": "Hi, B looks better on the phone, but A is better for cropping and printing the photos. B is basically a cropped version of A to make it fit the screen.", "time": "12-09-2015 09:12 AM", "replies": []}]}, {"title": "Moto X style from carphone warehouse", "thread": [{"postID": "post4828444", "text": "Hi all, \nJust being a bit paranoid, but if I am to buy a moto x I'll probably buy it form a UK retailer called carphone warehouse and get it sim free. Just wanted to check that these will be eligible for the 6.0 update. I remember reading some where about carrier ones not being eligible for update. \nP.S. Should of mentioned that it will be of course sim free\nThanks for all your help in advance \nJames", "time": "11-13-2015 04:05 AM", "replies": []}, {"postID": "post4828563", "text": "Hi James, welcome to the forums! The X Style is one of the first phones in line to get the Marshmallow update. Yesterday it was announced that the OTA update is already on in Brazil and India. Being an unlocked phone the update will arrive pretty soon.", "time": "11-13-2015 06:27 AM", "replies": [{"postID": "post4828749", "text": "Thank you! Basically I just wanted to check that I will get the update even though I am not buying direct from moto", "time": "11-13-2015 08:38 AM", "replies": []}]}, {"postID": "post4828899", "text": "Yes, don't worry, you'll get the update sooner than later", "time": "11-13-2015 09:34 AM", "replies": []}, {"postID": "post4828947", "text": "Here is the link. http://forums.androidcentral.com/sho...d.php?t=607657\nAndroid 6.0 Marshmallow for the Moto X Style", "time": "11-13-2015 10:00 AM", "replies": []}, {"postID": "post4829393", "text": "Thinking of buying this one myself from the same place! It's either the moto or a lg4? What's your overall impression of the moto x style?\nPosted via the Android Central App", "time": "11-13-2015 01:06 PM", "replies": []}, {"postID": "post4831025", "text": "I haven't bought it yet, I am still debating between this and the nexus 6P and still can't make up my mind!", "time": "11-14-2015 08:13 AM", "replies": []}, {"postID": "post4849918", "text": "I couldn't decide which to buy either. Bought the 6P. Loved the build quality and materials, the camera, and the fingerprint scanner, as well as knowing it would always be up to date. Trouble is I missed the Moto features from my Moto X 2013 so I bought a Moto X Style instead. Love the build and the camera on this too, but now I miss the scanner but often use Smart Lock at home. Now I want a 6P again. First world problems hey!\nPosted via the Android Central App", "time": "11-22-2015 12:56 PM", "replies": []}, {"postID": "post4868299", "text": "psteve2005 why do you want the 6P back is it just for the scanner?", "time": "12-01-2015 05:55 PM", "replies": [{"postID": "post4869706", "text": "Combination of scanner and knowing you're always up to date. I've since in fact done a straight swap - Moto X Style for a 5X and I love it. Didn't think I would coming from a 6P but its a cracking little device.\nPosted from my Nexus 5X (w/Moto 360)", "time": "12-02-2015 12:37 PM", "replies": [{"postID": "post4882190", "text": "Curios, where did you do the straight swap?", "time": "12-09-2015 09:10 AM", "replies": []}]}]}]}, {"title": "Why aren't my photos updating in the native gallery or any app?", "thread": [{"postID": "post4869143", "text": "Hi,\nI'm using Moto X for past 1 week. Completely satisfied with phone. Only thing not satisfied is about some problems with Photos and gallery app. \nI was saving in all photos and videos in sd card in my previous phone Asus Zenfone 5 (1st gen). Now the folder have some 800 odd pics (1.22 GB) and 90 odd videos (6.8 GB). it was working fine with the native Asus Gallery app or Quick pic (before CM lab takeover). But this is not working in Moto X. I tried with native gallery, Photos and all the top line 3rd party apps for this. I can see the pic when i restart the phone and open the app, if i close and reopen its all blank squares only as thumbnails.I formatted the sd card and copied all the pics once again and checked still the same issue.\nIs this a problem of reading from SD card or is it bcos of too many items in one folder. If latter is the case a weaker phone Asus was handling it nicely.\nAnyone could help on this. \nThanks in advance", "time": "12-02-2015 06:38 AM", "replies": []}, {"postID": "post4870281", "text": "Welcome to Android Central! The problem might be with the card itself. Have you tried a different card?", "time": "12-02-2015 05:59 PM", "replies": []}]}, {"title": "Why £399 not £359", "thread": [{"postID": "post4686267", "text": "Hi,\nWhy has the price for the Moto X Style gone up in the UK?? It was predicted to be £359, but now you can pre-order the Moto X Style off the Motorola store (32 GB, no additional things/covers) for £399!! This is just too much as it contradicts all the predictions, and it isn't such a good-value-for-money phone as advertised. It also doesn't match up with the exchange rate between pounds and dollars, as the phone costs $399. If the £399 was to be accurately converted to dollars, it would cost over $600. I have emailed the Motorola support team and I am waiting for a reply.\nHas anyone got any theories/ideas why this has happened? It has really ruined the idea that the phone was at an affordable price, as it isn't so much now, at least not for people in the UK.", "time": "09-15-2015 03:50 PM", "replies": [{"postID": "post4776652", "text": "I have payed € 499,99 for my 32 GB retail Black version. I'm happy with the choice I made coming from the OnePlus One, but the price should have been lower. The main reason is, because in certain countries you pay the retail price and not the price from direct distribution channel like Moto Maker. I live in Belgium and would love to had the choice making my own Moto X Style, but I didn't got the option to do so.\nPosted via the Android Central App", "time": "10-27-2015 01:09 AM", "replies": []}]}, {"postID": "post4686844", "text": "Just to clarify, these were predictions, correct?", "time": "09-15-2015 08:44 PM", "replies": []}, {"postID": "post4687246", "text": "I was surprised to see the phone priced at £399 but was glad to see it was the 32GB option and not the 16GB option, which is offered as the base spec in America. For the memory upgrade there they charge an extra $50 so we are paying a little more for those extra 16GB. \nThis won't be the first or last device where the UK advertised price is at a £1 to $1 rate and I've sort of come to expect it. One thing to bare in mind is that VAT is added on top of the US price while it is included in the UK price. Our VAT is also 20% while I think it is typically below or 10% in the states. \nSo if you subtract 20% tax and downgrade the memory (subtract $50) the UK price is £299.89 compared to a converted US price of £260.21. Yes it is more and there maybe other factors like import duties, exchange rate flucation, and operating costs for the smaller market that I have not considered but in general it is not as bad as it first looks.\nPosted via the Android Central App", "time": "09-16-2015 02:41 AM", "replies": []}, {"postID": "post4687464", "text": "Well Clove technology UK are selling this phone in black 32gb for £350 so that is where I will buy mine from and it looks great in black but black is your only choice.", "time": "09-16-2015 07:05 AM", "replies": []}, {"postID": "post4687468", "text": "That is a good deal. I really wanted one with a wood back but it is hard to justify an extra £70 for it.\nPosted via the Android Central App", "time": "09-16-2015 07:07 AM", "replies": [{"postID": "post4687625", "text": "I agree it is hard to justify and the phone looks great in black.", "time": "09-16-2015 08:42 AM", "replies": []}]}, {"postID": "post4687966", "text": "Got a reply from Motorola, this is what they said:This does seem to make sense, but I am still quite suprised at just how big the taxes, import prices and regulation costs are.\nWhat do you guys think? Also I'm not 100% what they mean when they say the phones are not the same. I thought that the Moto X Pure Edition WAS the Moto X Style, just working on all USA carriers and not purchasable from carriers, am I missing something??", "time": "09-16-2015 10:53 AM", "replies": [{"postID": "post4688397", "text": "The phones may have different radio bands though I don't know for sure. The US uses different LTE bands than most of the rest of the world. I've picked up phones over there before but the LTE doesn't work back here but at the time it didn't matter to me but now it does. I'm not sure how this would really impact the price though so I'd personally say it is more down to higher costs from taxes/duties/regulatory stuff as virtually all electronics are cheaper in the states.", "time": "09-16-2015 01:54 PM", "replies": []}]}, {"postID": "post4689485", "text": "Someone from Motorola must have mensioned the £359 price. Every website couldnt have just ran with speculation surely. And Motorola should have prevented them from running it by just coming out with the price pre-release like they did in the US.\nArses.\nProbs will still buy it though lol\nSent from S3 via Tapatalk App.", "time": "09-17-2015 12:45 AM", "replies": []}, {"postID": "post4689720", "text": "Handtec have the Style in white with a bamboo back for £347. I can't link as haven't posted enough but you can find it on hotukdeals.\nPosted via the Android Central App", "time": "09-17-2015 05:50 AM", "replies": [{"postID": "post4689741", "text": "http://www.handtec.co.uk/motorola-mo...te-bamboo.html\nSent from S3 via Tapatalk App.", "time": "09-17-2015 06:17 AM", "replies": []}]}, {"postID": "post4689752", "text": "Thanks. I'm tempted but think I'll wait to see the new nexus phones first.\nPosted via the Android Central App", "time": "09-17-2015 06:25 AM", "replies": []}]}, {"title": "Pre Orders in the UK are live", "thread": [{"postID": "post4685123", "text": "Just preordered one for me and one for the wife!", "time": "09-15-2015 08:08 AM", "replies": []}, {"postID": "post4685256", "text": "http://forums.androidcentral.com/e?l...token=tdHhmkeY\nAlso you can use promo code UKWELCOME10 for £10 discount.", "time": "09-15-2015 09:11 AM", "replies": []}, {"postID": "post4685257", "text": "The price seems off though. I thought it was toing to be £360", "time": "09-15-2015 09:11 AM", "replies": [{"postID": "post4686259", "text": "Me too. I asked Motorola about it and I am waiting for a reply.", "time": "09-15-2015 03:48 PM", "replies": [{"postID": "post4686481", "text": "I dont see how they could just do a direct conversion? Make the 32GB the vase model and think charging 400 is acceptable.\nSent from S3 via Tapatalk App.", "time": "09-15-2015 05:27 PM", "replies": []}]}, {"postID": "post4686845", "text": "Was that in Motorola's announcement?", "time": "09-15-2015 08:45 PM", "replies": [{"postID": "post4687730", "text": "This.\nIts been everywhere thats it going to be £359 for base 32GB model.Well considering the price was mensioned from all those websites who attended the event. Whats worse is that Motorola let all I mean national newspapers, Major Tech websites all state the £359 price is stupid on their part.\nBut they blatently just had a change if heart and decided to charge £400 after seeing it be such a huge hit in the US and since most people decided to use motomaker they were buying it much more than the $400 base price. Thats my theory anyway lol.\nStill havent decided what to do ... I do love the phone so might just have to buy a black base model from Clove.co.uk for £350.\nSent from S3 via Tapatalk App.", "time": "09-16-2015 09:32 AM", "replies": [{"postID": "post4688018", "text": "I agree with you and I am unsure about what to do, I think the black one that Clove are doing looks superb and at £350 it is the price I was led to believe it would be but at £400 I am just not so sure! I am also a bit concerned at the yellow tints on the screen as I want a nice bright white screen so what to do!", "time": "09-16-2015 11:21 AM", "replies": [{"postID": "post4688263", "text": "Yeah hopefully the tint is just a few defective phones and not widespread. I love the AMOLED screen on my S3 I must say (minus the cracked glass at the min lol).\nSent from S3 via Tapatalk App.", "time": "09-16-2015 12:56 PM", "replies": []}]}]}]}]}, {"postID": "post4687250", "text": "I posted this in the other thread but here it is again:\nI was surprised to see the phone priced at £399 but was glad to see it was the 32GB option and not the 16GB option, which is offered as the base spec in America. For the memory upgrade there they charge an extra $50 so we are paying a little more for those extra 16GB. \nThis won't be the first or last device where the UK advertised price is at a £1 to $1 rate and I've sort of come to expect it. One thing to bare in mind is that VAT is added on top of the US price while it is included in the UK price. Our VAT is also 20% while I think it is typically below or 10% in the states. \nSo if you subtract 20% tax and downgrade the memory (subtract $50) the UK price is £299.89 compared to a converted US price of £260.21. Yes it is more and there maybe other factors like import duties, exchange rate flucation, and operating costs for the smaller market that I have not considered but in general it is not as bad as it first looks.\nPosted via the Android Central App", "time": "09-16-2015 02:49 AM", "replies": []}, {"postID": "post4687299", "text": "Most media outlets reported a UK price of £359 when the Style was announced on the 28th of July, so surely this price must have come from Motorola and wasn't just speculation.\nPosted via the Android Central App", "time": "09-16-2015 04:30 AM", "replies": []}, {"postID": "post4687314", "text": "Wasn't that for the 16GB version which for some reason they are no longer offering?\nPosted via the Android Central App", "time": "09-16-2015 04:47 AM", "replies": [{"postID": "post4687428", "text": "Nope, the 16GB has never been available in the UK. Check out the specs on the UK site, it's either 32GB or 64GB, the same spec applies for 3rd party sellers.", "time": "09-16-2015 06:36 AM", "replies": [{"postID": "post4687730", "text": "This.\nIts been everywhere thats it going to be £359 for base 32GB model.Well considering the price was mensioned from all those websites who attended the event. Whats worse is that Motorola let all I mean national newspapers, Major Tech websites all state the £359 price is stupid on their part.\nBut they blatently just had a change if heart and decided to charge £400 after seeing it be such a huge hit in the US and since most people decided to use motomaker they were buying it much more than the $400 base price. Thats my theory anyway lol.\nStill havent decided what to do ... I do love the phone so might just have to buy a black base model from Clove.co.uk for £350.\nSent from S3 via Tapatalk App.", "time": "09-16-2015 09:32 AM", "replies": [{"postID": "post4688018", "text": "I agree with you and I am unsure about what to do, I think the black one that Clove are doing looks superb and at £350 it is the price I was led to believe it would be but at £400 I am just not so sure! I am also a bit concerned at the yellow tints on the screen as I want a nice bright white screen so what to do!", "time": "09-16-2015 11:21 AM", "replies": [{"postID": "post4688263", "text": "Yeah hopefully the tint is just a few defective phones and not widespread. I love the AMOLED screen on my S3 I must say (minus the cracked glass at the min lol).\nSent from S3 via Tapatalk App.", "time": "09-16-2015 12:56 PM", "replies": []}]}]}]}]}, {"postID": "post4687346", "text": "I was waiting for the moto style here in UK but the price has now put me off, with new nexus devices round the corner and the nexus 6 getting even cheaper moto style doesn't appeal anymore.\nPosted via the Android Central App", "time": "09-16-2015 05:28 AM", "replies": []}, {"postID": "post4687386", "text": "I was super excited when this phone was announced as it had the potential to sway me from my iPhone. (Not easy but possible) \nBut I think Motorola fluffed the announcement.... No clue as to when pre orders would begin at all for Europe. So I waited , and waited and watched the U.S. Get their pure edition. And still waited ! Getting more annoyed day by day. \nThen Apple announced their 6S along with a preorder timetable and an availability date. That's how it should be done. It reminded me of the great service I get from them in all their stores too. \nI decided to order a 6S plus on pre order day and got a delivery date of Sep 25th. I like clarity and a company that doesn't keep you in the dark like Motorola did. \nAnd now finally we get a pre order option for the Moro x style (for oct 6th delivery). Not good enough Motorola. \nI was tempted at first and nearly swayed but the gap between announcement and pre order with no indication of the preorder date cost them a sale.", "time": "09-16-2015 05:58 AM", "replies": []}, {"postID": "post4690075", "text": "I ordered the Moto x Style yesterday. Was given a delivery date of October 9th. When I check the order status it says the device has already been built and the order is complete. It's now waiting for delivery. Surely it's not going to take until the 9th October to deliver??", "time": "09-17-2015 09:26 AM", "replies": [{"postID": "post4690120", "text": "This happened to those who ordered in the US. Ignore the order status. The Moto system will fix itself in a few days and go back a few steps ... kinda bad from motorola for not fixing this glitch. I'd say expect it earlier than the 9th maybe by a day or two but I dont think it will be shipped for atleast a week or so.\nI could be completely wrong ... just basing it on what the situation with the US orders has been like so far.\nSent from S3 via Tapatalk App.", "time": "09-17-2015 09:43 AM", "replies": []}]}, {"postID": "post4690145", "text": "I did think it unlikely that they'd accept my order in the morning and have the build finished the same day!", "time": "09-17-2015 09:55 AM", "replies": []}, {"postID": "post4690320", "text": "Has anyone whos ordered the Style from Motomaker had their card charged?\nCurious if they charge asap or once they are ready to ship it.\nSent from S3 via Tapatalk App.", "time": "09-17-2015 11:19 AM", "replies": []}, {"postID": "post4691931", "text": "They charge it right away", "time": "09-18-2015 05:14 AM", "replies": []}, {"postID": "post4691955", "text": "Seems like the price has scared off loads of buyers.\nNot much buzz on here.\nSent from S3 via Tapatalk App.", "time": "09-18-2015 05:42 AM", "replies": [{"postID": "post4691973", "text": "I think people might holding off to see what the new Nexus phones have to offer as well.\nPosted via the Android Central App", "time": "09-18-2015 06:07 AM", "replies": [{"postID": "post4700955", "text": "I'm holding off. My concerns/disappointments\n1) No orange trim (seriously a big deal, I wouldve preordered now if had orange accents)\n2) Battery life appears poor from US reviews. I have avg 4-5 SOT and this would prob last me until 2pm from leaving the house at 7am. I don't want to be tied to charge even with turbo charging. \n3) The size. I have an N5 now and am comfortable with a slight increase partner has an S6 and that's OK. Just worried it will be too big. Would like some hands on if possible before committing.\n4) Some lag seen on other reviews when using Moto Display. Would get annoying at times. My N5 is still pretty snappy only really struggling if using intensive apps. \nUntil I see reviews from Alex Dobie and MKBHD I'm on the fence.\nReally thought this was my next device so a little downbeat on what I've heard so far but will await the full reviews with baited breath.\nPosted via the Android Central App", "time": "09-22-2015 09:48 AM", "replies": []}]}]}, {"postID": "post4692157", "text": "I ordered, but let's see how it goes, by October nexus will be announced but man the extra moto features are really good and hard to live without if I was so go back to nexus\nPosted via the Android Central App", "time": "09-18-2015 08:20 AM", "replies": [{"postID": "post4700414", "text": "What eta did you get for delivery? I'm sitting at the 6th of Oct the now.", "time": "09-22-2015 04:54 AM", "replies": [{"postID": "post4703984", "text": "9th October", "time": "09-23-2015 04:07 PM", "replies": []}]}]}, {"postID": "post4692384", "text": "Is there any other way to get a custom Moto X Style apart from the Motomaker in UK and in Germany?\nWhat about the rest of EU?", "time": "09-18-2015 09:46 AM", "replies": []}, {"postID": "post4694407", "text": "Its on Amazon.co.uk now for £350 for the 32GB free delivery\nMotorola Moto X Style SIM-Free Smartphone - Black - http://www.amazon.co.uk/dp/B014UUQGD...cUvbUpU4694407\nSent from S3 via Tapatalk App.", "time": "09-19-2015 10:03 AM", "replies": []}, {"postID": "post4700560", "text": "I got an email to say that it is on its way. Link to DHL which shows that it has left China. Estimated delivery is showing as 28th September.", "time": "09-22-2015 06:59 AM", "replies": [{"postID": "post4700572", "text": "Awe man - hopefully mines changes status soon. I did only order it at the weekend", "time": "09-22-2015 07:07 AM", "replies": []}]}, {"postID": "post4700740", "text": "Bloody Amazon have just changed their stock date to October 21st!\nGuess waiting for the Nexus release makes sense now.", "time": "09-22-2015 08:18 AM", "replies": []}, {"postID": "post4700949", "text": "Seriously, October 21st? Clove has just updated status online, saying that first shipment has been delayed till september 29th.. It's not entirely clear when the phone will arrive through amazon, clove, ...", "time": "09-22-2015 09:45 AM", "replies": []}, {"postID": "post4700957", "text": "Seriously, October 21st? In the meanwhile, clove has updated their site, saying that first shipment has been delayed till september 29th.I really wonder what the true shipment date will be.\nEdit: Belgian smartphoneshop still says it will be shipped on the 25th of September\nEdit again: sorry for the repost  first post was being approved", "time": "09-22-2015 09:49 AM", "replies": [{"postID": "post4701670", "text": "What Belgian shop?", "time": "09-22-2015 03:11 PM", "replies": []}]}, {"postID": "post4701730", "text": "It's pdashop\npdashop.be/product/634476/motorola-moto-x-style-zwart.html", "time": "09-22-2015 03:41 PM", "replies": []}, {"postID": "post4703059", "text": "I have notification that my package is at the DHL pickup point. I will go and collect after work.", "time": "09-23-2015 09:22 AM", "replies": []}, {"postID": "post4703987", "text": "when did you order? what was your delivery eta?", "time": "09-23-2015 04:08 PM", "replies": [{"postID": "post4705075", "text": "I ordered mine on the 18th - when I track my order it's waiting to be shipped. I could have hopped a plane to China quicker myself  still showing as the 6th of oct del", "time": "09-24-2015 04:41 AM", "replies": []}]}, {"postID": "post4704959", "text": "So picked up the phones and set them up last night. Pretty impressed, although I have had a few occasions where the top of the screen didn't respond to touch. I noticed this in GMail when trying to hit the menu button. Pressing the power button twice (to turn the screen off then on again) resolves it for a bit. I have sent a message to Motorola Support.", "time": "09-24-2015 02:27 AM", "replies": [{"postID": "post4705074", "text": "Does that only happen with Gmail?", "time": "09-24-2015 04:39 AM", "replies": []}]}, {"postID": "post4705114", "text": "I have seen it in GMail, Calendar and when trying to input into the Google Search on the homescreen. It only seems to be in the top left of the screen which is where these controls exist.", "time": "09-24-2015 05:42 AM", "replies": [{"postID": "post4705191", "text": "Let us know what Moto tell you? Hopefully they can get a new model sent out to you asap.", "time": "09-24-2015 07:13 AM", "replies": []}]}, {"postID": "post4705115", "text": "I contacted customer support todat as my order has been showing as complete since September 18th and awaiting delivery. I had an estimated delivery date of 9th October. The support guy told me my phone has been exported and is currently waiting to be allocated someone to deliver it. He couldn't tell me who this would be or how long it would take but if it's been exported i'd hope to get it well before the estimated delivery date", "time": "09-24-2015 05:45 AM", "replies": [{"postID": "post4705190", "text": "that's interesting, so even though it shows as \"not sent\" they told you it's already been exported? I might chat to them and see if I get the same response. It's only a week or so until my delivery date but I don't want to wait haha!! plus my wife is due to give birth to our Son on the 5th of Oct, which will collide with my phone delivery. We all know which is more important", "time": "09-24-2015 07:12 AM", "replies": []}]}, {"postID": "post4705523", "text": "I will do. My order originally state October 9th as the date. I was surprised to get a SMS on Monday afternoon with the DHL tracking number.", "time": "09-24-2015 10:05 AM", "replies": [{"postID": "post4705549", "text": "Also how long did it take from when you recieved the tracking number?", "time": "09-24-2015 10:18 AM", "replies": []}]}, {"postID": "post4705546", "text": "Do they also email you? At the moment my phone is busted so I can't recieve SMS", "time": "09-24-2015 10:17 AM", "replies": []}, {"postID": "post4705565", "text": "Motorola Store emailed on the 21st at 0936 to say it had been dispatched. I got an SMS on 21st at 13:40 to say it was on its way with the link to track it. It arrived at 12:51 on the 23rd.", "time": "09-24-2015 10:28 AM", "replies": []}, {"postID": "post4705578", "text": "Was the DHL tracking also sent via email.", "time": "09-24-2015 10:35 AM", "replies": []}, {"postID": "post4705878", "text": "No just SMS.", "time": "09-24-2015 12:39 PM", "replies": []}, {"postID": "post4707594", "text": "My device has been picked up.", "time": "09-25-2015 09:34 AM", "replies": [{"postID": "post4707855", "text": "From which store?", "time": "09-25-2015 11:45 AM", "replies": [{"postID": "post4708243", "text": "I meant from China. Sorry should've included more info. I got my tracking number from DHL.", "time": "09-25-2015 02:55 PM", "replies": []}]}]}, {"postID": "post4711261", "text": "Also got a dhl text. Seems it's just about to leave China despite what motto customer service told me. At least it's on the way", "time": "09-27-2015 02:39 AM", "replies": []}, {"postID": "post4711375", "text": "Who are you ordering from as Clove don't have stock yet nor do Amazon or Handtec, I have never heard of Handtec are they any good and are they good with returns if faulty?", "time": "09-27-2015 05:00 AM", "replies": [{"postID": "post4711624", "text": "I got mine from Motorola website. I've never bought anything from Handtec so not sure.", "time": "09-27-2015 08:48 AM", "replies": [{"postID": "post4711770", "text": "Ahh ok it is just £40 dearer on the Motorola site isn't it but you can choose your colours as with other UK places it is just black or white", "time": "09-27-2015 10:15 AM", "replies": [{"postID": "post4712010", "text": "Yes that's correct.", "time": "09-27-2015 12:32 PM", "replies": [{"postID": "post4712029", "text": "What colour combo did you order?", "time": "09-27-2015 12:39 PM", "replies": [{"postID": "post4712315", "text": "Black front with walnut back and light gold accent", "time": "09-27-2015 03:40 PM", "replies": []}]}]}]}]}]}, {"postID": "post4712412", "text": "Oohh that sounds very nice.", "time": "09-27-2015 04:25 PM", "replies": []}, {"postID": "post4713347", "text": "Got a dhl note on Saturday to say it was leaving China. Just got a text this morning to say it is being delivered today! That's well in advance of the 9th October they originally said", "time": "09-28-2015 04:42 AM", "replies": [{"postID": "post4713601", "text": "I'm literally in the same boat as you  got an email this morning to say it was on route so I made my 9 months pregnant wife stay in for it haha! Our phones must have been on the same flight to the UK", "time": "09-28-2015 08:02 AM", "replies": []}]}, {"postID": "post4713439", "text": "Any idea to why the phones for UK in general are delivered way earlier than the orginal data? Faster production or less demand?", "time": "09-28-2015 06:21 AM", "replies": []}, {"postID": "post4713509", "text": "I just think they're rubbish at estimating. It was the same for the US", "time": "09-28-2015 07:10 AM", "replies": []}, {"postID": "post4713533", "text": "Anyone remember from previous Moto Xs if there were other options in non-Motomaker sites?\nIn Amazon, Clove, Handtec there are only two designs available (mainly white, black). Will there be other options or the only way is the Motomaker site?", "time": "09-28-2015 07:26 AM", "replies": [{"postID": "post4713609", "text": "I remember when I was going to buy the 2014 model that Amazon / Clove / Carphone Warehouse all had the two basic models, so yeah I think Moto Maker is the only real way to get a customised model.", "time": "09-28-2015 08:04 AM", "replies": []}]}, {"postID": "post4713630", "text": "My Phone is waiting for me at home! Can't wait to finally get my hands on it.", "time": "09-28-2015 08:14 AM", "replies": [{"postID": "post4713713", "text": "Same here  what style did you go for? I went for the cognac back and grey accents with a black front.", "time": "09-28-2015 09:08 AM", "replies": [{"postID": "post4713741", "text": "Walnut with light gold accent and black front for me. I would've gotten white front if the sensors were better hidden.", "time": "09-28-2015 09:20 AM", "replies": []}]}]}, {"postID": "post4713729", "text": "Just check the DHL site and it's been delivered and signed for. Signed for by \"BBQ\" which I assume means the courier signed for it himself and left it under the barbeque!", "time": "09-28-2015 09:12 AM", "replies": [{"postID": "post4713765", "text": "thankfully we don't have good weather here in the UK and someone hasn't lit up the bbq before you've had a chance to head home", "time": "09-28-2015 09:35 AM", "replies": []}]}, {"postID": "post4714287", "text": "Received my Moto x Style today\nvery surprised at the size , It feels alot smaller than the nexus 6 actually and about the same footprint as the Moto x Play too..\nI'll try and take a picture of all 3 to show.\nalso delivery was actually pretty quick \nanyone using a case with their style ?", "time": "09-28-2015 12:56 PM", "replies": []}, {"postID": "post4714650", "text": "Yeah my phone has been delivered. The leather Smells fantastic\nPosted via the Android Central App", "time": "09-28-2015 03:27 PM", "replies": []}, {"postID": "post4714823", "text": "I am LIVID!\nMy X doesn't work properly. Google play services stops working and phone constantly restarting.", "time": "09-28-2015 05:03 PM", "replies": []}, {"postID": "post4715355", "text": "I'm going to see what the Nexus announcement brings tomorrow and if left disappointed I shall be ordering this bad boy.\nPosted via the Android Central App", "time": "09-28-2015 09:37 PM", "replies": []}, {"postID": "post4715735", "text": "Have you reported it to Motorola Support? I have been supplied with DHL labels to return mine.", "time": "09-29-2015 02:49 AM", "replies": [{"postID": "post4715745", "text": "Yes. I am tempted to just send it back and get a nexus", "time": "09-29-2015 03:03 AM", "replies": []}]}, {"postID": "post4715764", "text": "Got mine (under the BBQ) and I love it. I'm coming from the HTC M8 and it doesn't actually feel significantly bigger. Love the screen and the camera and the leather back feels great", "time": "09-29-2015 03:50 AM", "replies": []}, {"postID": "post4715795", "text": "How good does the leather smell eh lol? I might look daft, but it's a great sniff.", "time": "09-29-2015 04:25 AM", "replies": []}, {"postID": "post4724550", "text": "to clarify, what is the difference between the X Pure Edition and the Moto X Style?", "time": "10-02-2015 02:22 PM", "replies": [{"postID": "post4724731", "text": "The Pure is available in the USA nd the Style is available in Europe but they are one and the same phone.", "time": "10-02-2015 03:50 PM", "replies": []}]}, {"postID": "post4724810", "text": "great so 100% identical in all the main specs? most reviews i see have been for the pure edition and those reviews are what have got me interested", "time": "10-02-2015 04:42 PM", "replies": [{"postID": "post4724952", "text": "Yes, just go for the style then  the only difference is in the radio bands that are available", "time": "10-02-2015 06:27 PM", "replies": []}]}, {"postID": "post4734347", "text": "I wonder if the white/silver/bamboo version is ever going to be sold. It's listed as a standard model.\nPosted via the Android Central App", "time": "10-07-2015 09:00 AM", "replies": []}, {"postID": "post4736808", "text": "Ordered mine from Amazon UK. Have ordered lots of stuff from there but never a device. Are their support as good as the US Amazon? In case there are problems with the phone.", "time": "10-08-2015 11:59 AM", "replies": []}, {"postID": "post4736930", "text": "yes Amazon support is great\nalthough remember if its a issue with the device you should really go direct to manufacturer (motorola) \nthey have a live chat system\nany other problems just contact amazon and they will sort it out for you (they also have a live chat system and a call back system if you wish to speak to someone )", "time": "10-08-2015 12:54 PM", "replies": []}]}, {"title": "motomaker choices poor", "thread": [{"postID": "post4689780", "text": "As the real 'Flahship' moto x I'm really disappointed with the choices for customisation.\nThe colours are very limited. The trim in particular especially when comparing to the Moto G and the Play. \nReally wanted metallic orange trim as per the Play and really disappointed not there. It's actually nearly a deal breaker. Black front/ black ash back and orange trim wouldve been ace. \nI'm now eagerly awaiting Nexus updates and news.\nPosted via the Android Central App", "time": "09-17-2015 06:53 AM", "replies": []}, {"postID": "post4689926", "text": "I don't think it's that bad. At least there is someone out there who is allowing a custom build like this. At least your choices are more than black and white.", "time": "09-17-2015 08:19 AM", "replies": []}, {"postID": "post4690470", "text": "Agree but if you compare accents between the G the Play and Style some decent colours left out IMO.\nPosted via the Android Central App", "time": "09-17-2015 12:18 PM", "replies": []}, {"postID": "post4690630", "text": "There are some colors that were available on the second gen Moto X that aren't available on the Moto X Style. Disappointing - yes. But it could be a case where not enough people ordered those colors.", "time": "09-17-2015 01:12 PM", "replies": []}]}, {"title": "Clove UK - Delivering/Stock Date (delayed by 2 days)", "thread": [{"postID": "post4687465", "text": "Hour ago the First stock, due and shipping was still on 21th, now it's 23th...", "time": "09-16-2015 07:05 AM", "replies": []}, {"postID": "post4689507", "text": "What I have noticed with clove is that they keep shifting the dates of pre order items. I will guess the date will change again a few times.\nSent from S3 via Tapatalk App.", "time": "09-17-2015 01:13 AM", "replies": []}, {"postID": "post4689519", "text": "Exactly what I thought, I guess the release date will be almost the same like that of Motorola UK, which is around october if I am not wrong.", "time": "09-17-2015 01:28 AM", "replies": []}]}]
