[{"title": "Can i connect to a TV using a HDMI to USB-C adaptor?", "thread": [{"postID": "post6090468", "text": "I'd like to be able to watch Netflix on a TV using my phone.\nI have a USB-C to HDMI adaptor that i used on a Lumia 950 to connect to a TV. however, it doesnt seem to work with the X Compact. Do i need a different adaptor, or is a there a setting / app that i could use?\nI know that Chromecast is only £20, but i thought it may be easier to use what i already have.", "time": "11-30-2017 04:07 AM", "replies": []}]}, {"title": "Disapearing Shortcut Icons", "thread": [{"postID": "post6089066", "text": "I have saved a bunch of app shortcuts to a separate screen so my kids know where their apps are. \nHowever, they keep disapearing randomly and i have to keep replacing them. Does anyone have any suggestions to fix this?\nI am using MS Launcher, so i dont know if that is the cause?\nThanks.", "time": "11-29-2017 01:50 AM", "replies": []}, {"postID": "post6089470", "text": "Are the shortcuts for apps that are stored in SD card?", "time": "11-29-2017 10:28 AM", "replies": []}, {"postID": "post6090466", "text": "aha, i see where you're coming from. I have used the memory management features to shift things to the SD card, so its likley that some of them are. i'm using a class 10 Sandisk memory card, so i woud hope it was quick/reliable enough, but any suggestions would be great.\nHowever, this is really only hapening on a second homescreen - the apps on my main homescreen have been mostly fine, with just an occsaional icon disapearing.", "time": "11-30-2017 04:03 AM", "replies": []}]}, {"title": "Lumia 950 charger with Xperia X Compact", "thread": [{"postID": "post6068765", "text": "Can anyone tell me if i can get fast-charging on the X Compact using the USB-C wall charger from the Lumia 950? It is rated to 3amp, but i have no idea how this translates to a charge-time on the X Compact.", "time": "11-14-2017 04:15 AM", "replies": []}, {"postID": "post6070498", "text": "Thanks for the advice- that makes sense. I guess the benefit of a 'standard' is all the variation it offers. A bit like HDMI, i suppose.", "time": "11-15-2017 03:13 AM", "replies": []}, {"postID": "post6070508", "text": "I've done a bit of testing, and doesn't seem to charge very quick after all, so the fast feature on the L950 was probable proprietry and doesn't provide quick charge. Never mind.", "time": "11-15-2017 03:32 AM", "replies": []}, {"postID": "post6075521", "text": "I'd suggest one of the new breed of \"Smart Chargers\" that have variable voltages and amperages available. They communicate with your phone to regulate output so it matches what your phone wants.\nI've been getting great results from a couple different Aukey units for myself and my wife over a variety of devices. Currently, my X laps up juice pretty fast via an Aukey through the USB C port on the charger and a C<->C cable with a C<->micro adapter at the phone end. The phone doesn't get hot and I recently did a spot check where I was getting over 1.3% per minute during a 20 minute top up.\nHere's the one, although it is currently unavailable. You can find similar units all over Amazon. https://smile.amazon.com/gp/product/...?ie=UTF8&psc=1", "time": "11-18-2017 08:06 AM", "replies": []}]}, {"title": "Xperia x cheap at Argos uk", "thread": [{"postID": "post6070507", "text": "For UK buyers, the xperia x is reduced to £255 at Argos including a £10 voucher! Seems like a bit of a bargain.", "time": "11-15-2017 03:30 AM", "replies": []}, {"postID": "post6072400", "text": "Yes, a bargain I missed out on having paid £300.", "time": "11-16-2017 04:11 AM", "replies": []}, {"postID": "post6073950", "text": "you still get a nifty phone, though, and its never healthy to keep waiting for the next best thing.", "time": "11-17-2017 04:38 AM", "replies": []}]}, {"title": "Pictures / Videos Taken With Sony Xperia X", "thread": [{"postID": "post5983682", "text": "Here's two I snapped just yesterday...", "time": "09-19-2017 06:39 PM", "replies": []}, {"postID": "post5985292", "text": "try the HDR and it'll offer more dynamic colors.", "time": "09-20-2017 04:27 PM", "replies": [{"postID": "post6010658", "text": "So I've revisited this. I may have been a bit hasty. It is RAW that Sony doesn't enable under the Camera2 API.\nI reinstalled ProShot and here is why I ditched it the first time:Doesn't save RAW filesDoesn't go above 8MP (which is odd for the 23MP shooter on the X)It does take bracketed shots, but it doesn't merge them on the phone like ProShot does on Windows Phone and the range is limited to +/- 2ev and not +/- 3ev as it does on WP\nSo I reinstalled ProShot and found an app named Vibrance HDR...\nHere, again, is an 8MP capture using the native camera app from Sony and the HDR \"filter\" which, IMHO, is more about saturation than luminosity.\nSo, thanks to @jasonandrews25788 I pushed myself to explore this camera more fully.\nI went to the same vantage point as the above shot at almost the same time of day (early morning, just after sunrise) and took a couple pics with ProShot. Here is the 8MP \"neutral\" shot. (Note that the exif says +0.3 steps where it should be +/- 0.)\nBut I had the shot bracketed at +/- 2ev. Afterwards I merged them in Vibrance HDR (with a few tweaks) to get this result.\nI like this result much better than the HDR \"filter\" that Sony uses in the native camera app. It is much more of what I expect from true HDR. The picture has a more \"textured\" aspect and the objects have more depth to them. Definitely deserves to be played with further.", "time": "10-08-2017 09:56 AM", "replies": []}]}, {"postID": "post5986876", "text": "Sure, I do HDR sometimes. I'm under the impression that the HDR Sony put in the Xperia X camera app is more a filter and less a merge of several exposure values that were bracketed before hand. Near as I can tell we lack full access to Camera API 2 that would allow true HDR through alternate apps like ProShot.", "time": "09-21-2017 03:04 PM", "replies": [{"postID": "post6010658", "text": "So I've revisited this. I may have been a bit hasty. It is RAW that Sony doesn't enable under the Camera2 API.\nI reinstalled ProShot and here is why I ditched it the first time:Doesn't save RAW filesDoesn't go above 8MP (which is odd for the 23MP shooter on the X)It does take bracketed shots, but it doesn't merge them on the phone like ProShot does on Windows Phone and the range is limited to +/- 2ev and not +/- 3ev as it does on WP\nSo I reinstalled ProShot and found an app named Vibrance HDR...\nHere, again, is an 8MP capture using the native camera app from Sony and the HDR \"filter\" which, IMHO, is more about saturation than luminosity.\nSo, thanks to @jasonandrews25788 I pushed myself to explore this camera more fully.\nI went to the same vantage point as the above shot at almost the same time of day (early morning, just after sunrise) and took a couple pics with ProShot. Here is the 8MP \"neutral\" shot. (Note that the exif says +0.3 steps where it should be +/- 0.)\nBut I had the shot bracketed at +/- 2ev. Afterwards I merged them in Vibrance HDR (with a few tweaks) to get this result.\nI like this result much better than the HDR \"filter\" that Sony uses in the native camera app. It is much more of what I expect from true HDR. The picture has a more \"textured\" aspect and the objects have more depth to them. Definitely deserves to be played with further.", "time": "10-08-2017 09:56 AM", "replies": []}]}, {"postID": "post6009105", "text": "HDR'ed this one. 8MP capture.", "time": "10-07-2017 11:08 AM", "replies": [{"postID": "post6009201", "text": "That's a great shot!", "time": "10-07-2017 12:05 PM", "replies": []}]}, {"postID": "post6015916", "text": "", "time": "10-11-2017 08:55 PM", "replies": []}, {"postID": "post6070514", "text": "hi, i am new to Xperia (and Android), having just sold a Lumia 950. that was baslically a phone built around camera so I was a bit spoilt and I'm now trying ot learn how to get the best from the X Compact.\nI have a few DSLR and mirrorless Canons, but i still want to take ecent snaps with my phone. \nI have found that it tends towards forcing a longer shutter in slightly dark conditions, which is not good for fast moving subjects (i.e. my kids), and cant find an option to create presets so I have to rmbr use the manual settings.\nDo you have any tips or suggestions to get quick fast snaps? Are 3rd party camera apps worthwhile? Thanks in advance.", "time": "11-15-2017 03:41 AM", "replies": []}]}, {"title": "I need help flashing my Xpreria X to enable the fingerprint sensor please. How do I do it?", "thread": [{"postID": "post6032106", "text": "So I just bought a new Xperia X model after buying an X Performance that was supposedly like new in box but it had a bad screen. I sent it back and now I've purchased the Xpreria X. I need help from someone to guide me through the steps of flashing the European firmware to my phone to enable the fingerprint sensor. Does anyone mind helping or stepping me through the process along with sending me the appropriate links? I would greatly appreciate your time and help. I really want to be able to use the fingerprint sensor of course but I can't figure out how to fully do it. Any help is much appreciated. Thank you.", "time": "10-22-2017 06:22 AM", "replies": []}, {"postID": "post6032140", "text": "By the way I ordered my Xpreria X from B &H and they have good deals on both the X and X Performance right now. I really wished I could have afforded the X Performance but the X is definitely a good solid device and there isn't that much difference between the two. I do like the X Performance is water proof. And I really wanted that 820 processor. It really bites because I had it but only for the guy to try to hose me with a defective screen on the device so I had no choice but to run with the Xpreria X brand new instead as the X Performance don't come up used very often like I found the one that was bad or defective. Now I've just got to figure out how to enable my fingerprint sensor and I'll be set to go. I had ordered about $75 dollar worth of accessories for the X Performance so I assume they will work with the X model or I hope they do. Actually since they are so close in build I ended up ordering a combination of X and X Performance accessories so I hope to be good to go. I'm really looking forward to the Red sleeve which I might have to send it back and exchange it for the X model as they told me there is a 2mm difference in size so the one I ordered was for the X Performance so it may fit a little big on the X but I'm hoping it'll still fit good enough to keep and not have to exchange. Here is a pic of the sleeve I've got on the way.", "time": "10-22-2017 07:05 AM", "replies": []}, {"postID": "post6034032", "text": "Anyone out there who can help me or guide me through the process at all? Please any help would more than greatly appreciated.", "time": "10-23-2017 10:50 AM", "replies": []}, {"postID": "post6069989", "text": "Did you get this done?", "time": "11-14-2017 08:11 PM", "replies": []}]}, {"title": "Come Sail Away", "thread": [{"postID": "post5775477", "text": "These guys are ready to blow up. And about time too. I've been waiting for them to mature.Sailfish OS and Sony Open Devices Program\nNot just that, but look how they've bounced back from almost toppling over the edge. These ex-Nokia meego folks are tough. And if you've ever demoed Sailfish you know it could be the cat's meow. Gesture driven and well thought out. Love the \"Live Covers\" as well. \nAnybody excited to see Sailfish OS coming to Xperia X with an official ROM?", "time": "04-21-2017 04:54 PM", "replies": []}, {"postID": "post5777457", "text": "Here is a FAQ about using Android Apps on Sailfish and it has a recent date of April 05, 2017.https://jolla.zendesk.com/hc/en-us/a...do-I-get-them-", "time": "04-22-2017 12:37 PM", "replies": []}, {"postID": "post5778905", "text": "Here's a user community Q&A I'm scrolling through now: https://together.jolla.com/question/...ony-xperia-qa/", "time": "04-23-2017 07:26 AM", "replies": []}, {"postID": "post5873473", "text": "Jolla is releasing the ROM to Cbeta testers first. https://blog.jolla.com/sony-xperia-project-update/", "time": "07-04-2017 06:22 PM", "replies": []}, {"postID": "post5985196", "text": "It's almost here... https://blog.jolla.com/sailfishx/", "time": "09-20-2017 03:41 PM", "replies": []}, {"postID": "post6007210", "text": "https://jolla.com/sailfishx/", "time": "10-06-2017 07:50 AM", "replies": []}, {"postID": "post6042942", "text": "So, as luck would have it I traveled to Portugal for vacation and Sailfish X is currently only available in the EU, Norway and Switzerland.\nYup, I downloaded it. I'll install it on my Xperia X single SIM when I return to the states.", "time": "10-28-2017 01:24 PM", "replies": [{"postID": "post6042984", "text": "Looking forward to hearing about your experience with it.", "time": "10-28-2017 01:57 PM", "replies": [{"postID": "post6045204", "text": "When I get back home I'll install it. I hope to do a review video to post to the sites.\nI'm pretty excited to install it, but it isn't fair to my wife if I spend days of our vacation flashing and setting up.", "time": "10-30-2017 03:31 AM", "replies": []}]}]}, {"postID": "post6061094", "text": "Looking good so far. Had a bit of confusion over the USB drivers for Fastboot. Two different instruction sets and I was following the wrong one at first. Got it sorted and got Sailfish X installed on my Xperia X F5121.\nHave the phone jumping through a few hoops already. Microsoft Integration is pretty deep. Loving the UI.\nA couple of hurdles to get over still. Need a YouMail apk to sideload and trying to get my Iron browser to sync from desktop. Other things have proceeded pretty easily. So far it's a pretty good return for the time I put in setting up. Very pleased.\nMoar soon.", "time": "11-08-2017 11:28 PM", "replies": []}]}, {"title": "Experia X APPLog", "thread": [{"postID": "post6056223", "text": "Hi everyone. According to one of my friends, there should be files on my phone that logs apps. i have seen pictures/Screenshots of it and it says APLog_2017 and date and so on. I have an Experia X model F5121. I have an idea that these logs will show logs for different apps including messaging. Can anyone recognize this description i gave for the log, and where to find these log files in that case? \nPlease help\nind regards jakob", "time": "11-06-2017 04:15 AM", "replies": []}]}, {"title": "My Xperia X will arrive tomorrow", "thread": [{"postID": "post6034927", "text": "Looking forward to getting this phone. I had my heart set on the X Performance so I hope I still like this one. How do you all feel about the Xs performance? Do you see any lag on the 650 chip.set? I heard it's equal to the 810 processor.", "time": "10-23-2017 07:06 PM", "replies": []}, {"postID": "post6036384", "text": "Wasn't the 810 a generally disliked chip?", "time": "10-24-2017 02:53 PM", "replies": [{"postID": "post6037155", "text": "I've heard it was fairly decent which was why I spoke about the 650 in a video I watched and article I read saying the 650 barely beat the 810. I figured that to be impressive according to what I've read. Do you know the 810 to be bad or something. I thought it to be repspected for it's time in use. So what does that say about the 650 then in the X. Sounds like not so good. If that is a fact i would just return mine and probably opt for the Honor 8 instead. Either way is fine by me but if say the 810 was not any good then I would think the 650 to be the same since they were on par with one another. Is this your point?", "time": "10-25-2017 12:01 AM", "replies": [{"postID": "post6037541", "text": "The 810 ran hot. The 650 should be fine though, it was fine on the smaller version of this phone.", "time": "10-25-2017 08:06 AM", "replies": [{"postID": "post6037560", "text": "Yes this must be what I am recalling.", "time": "10-25-2017 08:14 AM", "replies": []}, {"postID": "post6038281", "text": "This phone runs might hot too with the camera overheating and shutting itself down.", "time": "10-25-2017 02:37 PM", "replies": [{"postID": "post6038326", "text": "Sorry that this is happening to you. This happens a lot with Sony phones. With recent ones, this is much better now and not an issue.\nAre you still going to use it or not?", "time": "10-25-2017 03:01 PM", "replies": []}]}]}]}]}, {"postID": "post6038329", "text": "I'd say it's an issue since it happens so quickly. I'm sorry but it's a definite issue. Maybe 7 or 8 minutes of using the camaera and video it overheats and shuts down. Yeah compared to most all other phones I would say it's an issue. No way around that even if it's the norm for Sony. I love Sony but I'm a realist and yes this is an over heating issue for sure.", "time": "10-25-2017 03:05 PM", "replies": [{"postID": "post6038387", "text": "Don't apologize. It's sad that Sony took so long to fix this. I have the XZ1 Compact and have never had this issue on it. Sounds like you'll have to debate if you'll want to deal with that long term or not. I wish you good luck with your decision.", "time": "10-25-2017 03:34 PM", "replies": [{"postID": "post6038390", "text": "Oh really. Have they since fixed this on the X model. I just bought it again and have not even been in the camera yet. So the issue is fixed now or does it still over heat?", "time": "10-25-2017 03:37 PM", "replies": [{"postID": "post6038397", "text": "I have had the camera open for more than the time you said and I haven't had any overheating. Even trying camera apps continuously for like 25 minutes still made it get a little warm but no warnings or shutting down. \nOnly if you do 4k/slow motion, it can overheat eventually but that's to be expected.\nThe XZ1 is up there (since it just came out) but I would think that any of the phones released this year, like the XZ Premium (same camera in both) should be fine.", "time": "10-25-2017 03:44 PM", "replies": [{"postID": "post6038402", "text": "Yeah but the X doesn't have 4k only 1080p up to 60 frames per second. No way it should over heat due to that. But if it's gotten better then that's a good thing.", "time": "10-25-2017 03:46 PM", "replies": [{"postID": "post6038412", "text": "Oh, true I forgot that about the X. \nEven when doing my shootout between the iPhone SE and the XZ1C, the XZ1C didn't break a sweat at all and I took at least 6 pictures. I'm not sure why it took so long for Sony to get here but much better.", "time": "10-25-2017 03:51 PM", "replies": [{"postID": "post6038465", "text": "The X should have and could have supported 4k video but they couldn't put on bc it would have over heated immediately since the 1080p at 60 frames per second over heats so quickly.", "time": "10-25-2017 04:16 PM", "replies": []}]}]}]}]}]}]}]}, {"title": "My Xpreria X Performance will be here on Thursday", "thread": [{"postID": "post6024897", "text": "It's taking forever waiting until Thursday for my X Performance. The first thing I'm going to do to mine is flash the European firmware on it to enable the fingerprint sensor. Has anyone done that to their X or X Performance yet? If so how's the fingerprint sensor. The guy I bought it from is super nice and he's going to step me through the process of flashing it to enable the fingerprint sensor. I don't think I could use a phone these days without a fingerprint sensor now. So that's my first thing that I'm going to do when it arrives on Thursday. My past one the regular X model I never enabled the fingerprint sensor so I'm unfamiliar with Sony's fingerprint software. Hoping it's fast and easy and more so the process of flashing the European firmware on it. Anyways just another day and half and I'll join the club. Looking forward to doing a little mini review write up on the X Performance.", "time": "10-18-2017 01:11 AM", "replies": []}, {"postID": "post6025154", "text": "On the X, the fingerprint reader is uber fast. You'll like it.", "time": "10-18-2017 07:59 AM", "replies": [{"postID": "post6025941", "text": "Awesome!! What do you have the international version or the US version that you have flashed with the European firmware?", "time": "10-18-2017 03:15 PM", "replies": [{"postID": "post6025962", "text": "I paid a premium for the International F5121.", "time": "10-18-2017 03:31 PM", "replies": [{"postID": "post6025980", "text": "Oh really. They are more expensive? I thought it was the other way around.", "time": "10-18-2017 03:36 PM", "replies": []}]}]}]}, {"postID": "post6026292", "text": "Pretty sure it was more for the international on Amazon than the US/CA version. That was a few months ago though.", "time": "10-18-2017 07:09 PM", "replies": [{"postID": "post6026571", "text": "That's interesting as I've always seen the international models being cheaper than the US models due to the lack of warranty from the international models. \nI'm excited to get mine tomorrow. I'm going to flash the European firmware to it to enable the fingerprint sensor then download the Amazon video apk file to get ready to watch Thursday night football live stream from Amazon video prime. This will my ultimate test for my new phone to see if I can comfortably watch a football game on it even though it has a 5 inch screen. I know I can watch movies as I remember watching several on my X model I used to have but a football game will be a good test for clarity and so on. I am also happy to see that Amazon offers Thursday night live NFL football to prime members. That's huge and my X Performance Will be used to watch it tomorrow night!", "time": "10-18-2017 10:02 PM", "replies": []}]}, {"postID": "post6032030", "text": "I got my X Performance in and the seller tried to take me or scam me as he sent me a defective device! I was so mad at him that he paid for shipping back to him plus he gave me the 10 dollar swappa fee. Here's what my screen looked like when I turned it on. So I ended finding a brand new Xpreria X on sale for $199 so I went ahead and bought it instead. I'll have to see If I'm going to keep it or not as I had my heart set on the X Performance.", "time": "10-22-2017 04:31 AM", "replies": []}]}, {"title": "Looks like I'll be an Xperia X owner now. No go for the X Performance", "thread": [{"postID": "post6027857", "text": "So my X Performance arrived today and the guy tried to pull one over on me as the entire bottom of the screen is discolored. I never buy phones used when minute I do I get burned. So I'm returning it as he is giving me my money back and I'm getting the Xpreria X at B&H for $229. I'm pretty upset over it but at least I'll be buying my phone brand new this time so I know I won't have any troubles. I guess he thought I wouldn't notice.", "time": "10-19-2017 03:29 PM", "replies": []}, {"postID": "post6028052", "text": "the xperia x is a great phone also.", "time": "10-19-2017 05:01 PM", "replies": [{"postID": "post6028264", "text": "Do you guys mind telling me about the 650 processor? I just can't remember back far enough when I originally owned the Xpreria X model to remember anything about the 650. I do recall it being pretty fast. I just had my heart set on the X Performance but that phone is gone now. However I did spend a lot of money on Xperia Performance accessories which will work with the X model build. Plus I can get the Xpreria X on sake right now for 229 which is not a bad price for a brand new unit. What do you guys recommend I buy with a budget of around $275? Any help is greatly appreciated. Oh although that X performance was like new in box here is what the screen looked like when I turned it on and the seller claimed he had no knowledge of this. Wow!!! This is why I don't like buying used phones.", "time": "10-19-2017 07:55 PM", "replies": []}]}, {"postID": "post6028329", "text": "That stinks. I hope you get another phone soon. Good luck.", "time": "10-19-2017 08:43 PM", "replies": [{"postID": "post6028666", "text": "Thanks. Do you think I should just go with the X model instead now? I'm not sure what I should do to be honest now. I had my heart set on the Performance but it's not happening now.", "time": "10-20-2017 02:50 AM", "replies": []}]}, {"postID": "post6031015", "text": "I found the Xpreria X for $199. The cheapest I can find it. What do you guys think? Should I go for it?", "time": "10-21-2017 12:29 PM", "replies": []}, {"postID": "post6032019", "text": "Well I ordered it at $199. Should be here this mid week. Looking forward to it. Have my screen protector on order for it and I have already a ton of cases for it. Hopefully it will fill the void of the X Performance like I had gotten and wanted. I liked how beefy the X Performance felt being a little larger than the X. But at $199 it's hard to beat brand new. I'll keep you guys updated and hope to update with good news that I'll be keeping it. I'll have to see how it feels compared to the X Performance first. I did order about $75 dollars worth of accessories for it so I probably should keep it. I'm sure I will. Have any of you had experience with both the X Performance and the X side by side and if so what are your thoughts on size difference and feel?", "time": "10-22-2017 04:18 AM", "replies": []}]}, {"title": "This just arrived today for my phone tomorrow", "thread": [{"postID": "post6026563", "text": "So over the past few days I've been on a shopping spree if you will for my new X Performance and I found this paper thin like case that adds absolutely zero bulk to the phone. They have this color which is a smoke type grey and a whitish color too which I ordered both but my white one like this won't arrive until the 24th. This will be my go to case if I even use one. I also will picture a folio case I won't mind using either as I'm just not much of a case guy but I know I'm asking for trouble if I don't use one. The smoke color one is made for the performance where the brown folio case was left over from my X model I had before from a while back.", "time": "10-18-2017 09:56 PM", "replies": []}]}, {"title": "Will all my Xpreria X cases fit my new X Performance?", "thread": [{"postID": "post6021145", "text": "So I have about 5 or 6 cases which all are a combination of X and X Performance cases. Will all of my X cases fit the X Performance okay. I really didn't know there was a difference externally to the X and X Performance?? Anyone know about this? Thanks.", "time": "10-15-2017 06:28 PM", "replies": []}, {"postID": "post6021454", "text": "The dimensions are slightly different: https://www.phonearena.com/phones/co...ones/9988,9986. Cases for the X, if they do fit, would be pretty snug on the Performance.", "time": "10-15-2017 10:59 PM", "replies": [{"postID": "post6021889", "text": "Thanks! I'm hoping they will fit as I have several X cases already. I kind of thought the X Performance would be a little thicker but not by much. I'll know cone Wednesday or Thursday when mine arrives. I went ahead and ordered a few X Performance cases for it yesterday just to be safe. Still though it would be nice if what I have already fits it. I appreciate the information on that and letting me know. It's much appreciated.", "time": "10-16-2017 08:45 AM", "replies": []}]}, {"postID": "post6022002", "text": "A major concern is button placement. Trust me, you don't want the camera button getting pushed randomly while in pocket. Been There Done That on a different phone where even the official case caused an issue. Next thing you know the phone is hot and when you pull it out and examine it you have 547 pictures of the inside of your pocket.\nStick with cases that are made for the Performance, IMHO.", "time": "10-16-2017 09:57 AM", "replies": [{"postID": "post6022733", "text": "That's a good point. I didn't think about that. I've read so far that if I have the Sony Xperia X cases that if they fit the X Performance they will just fit a little more snug as I have this really good looking light brown folio case that I want to use on my X Performance whenever it gets here Thursday which by the way is taking forever!! I'm so ready to get it. I've ordered several other cases for it to be covered just in case my X cases didn't fit. I typically don't use cases really so I ordered this sleeve which I've heard is awesome. Here it is along with a full body protector and screen protector kit that is anti glare and of course anti fingerprint too. Here's a pic of both.", "time": "10-16-2017 06:23 PM", "replies": []}]}]}, {"title": "Has anyone ever flashed the European firmware to their US model before here?", "thread": [{"postID": "post6020528", "text": "So I want to use the fingerprint sensor. I read that you can flash the US model with the European firmware to enable the fingerprint sensor. Is this true and if so does anyone know how to do it that you would mind explaining to me as to how one would go about doing it? Any help is much appreciated.", "time": "10-15-2017 10:07 AM", "replies": []}]}, {"title": "So which of these two should I buy?", "thread": [{"postID": "post5822634", "text": "Should I buy the Xperia X or the Xperia X Performance? Both are at pretty good pricing now. Which is the better buy and why? I've owned the Xperia X before but not the performance. So the X is at $265 and performance at $375. Which would you go for and or which is the better buy at this point? I'm getting one of these two but unsure of which one. Any help or advice is much appreciated.", "time": "05-20-2017 10:40 PM", "replies": []}, {"postID": "post5823604", "text": "well from looking at the specs for both of these phones, they are both pretty much the same. BUT, the Xperia X performance is just a little bit faster than the Xperia X.\nXperia X - snapdragon 650\nXperia x performance - snapdragon 820\nso the one you should go for is the Xperia X performance", "time": "05-21-2017 08:15 PM", "replies": [{"postID": "post5824724", "text": "Do you think it's worth the $100 dollar price jump?", "time": "05-22-2017 07:12 PM", "replies": []}]}, {"postID": "post5840474", "text": "As far as I know Xperia X Performance has the resistivity against water unlike Xperia X, this is one important difference for me. Also these phones are very similar ,so it depends on how you are gonna use the phone.. I suggest Xperia X performance", "time": "06-06-2017 07:37 AM", "replies": []}, {"postID": "post5866690", "text": "Regular X will be the first to get the official Sailfish OS port, due any day now.\nIt's uber important to me. YMMV", "time": "06-28-2017 01:37 PM", "replies": []}, {"postID": "post5977094", "text": "I found an X for a pretty good price much lower than what it typically sells for so I'm going to go ahead and order it. I can't pass this deal up. By the way what is the X running right now? Has it been updated to 7.1.1?", "time": "09-15-2017 06:35 PM", "replies": [{"postID": "post5983670", "text": "International single SIM F5121 is at 7.1.1 with the September security update.", "time": "09-19-2017 06:31 PM", "replies": []}]}, {"postID": "post6007224", "text": "Thank you. I lost out on that deal because I waited until the next morning. I am still kicking myself over it. Right now I have my brand new Nexus 6p 64g up for trade for either a Xperia X Performance or the X plus cash my way. Hopefully I'll get a bite. My Nexus 6p is brand new so I'm trying to find one in the same condition and that comes in the original box with all contents. I prefer the X Performance but I'll go for the X too. Not really too sure if many people out there ever bought many of these two models but I've owned the X before and I miss the 5 inch display on it. I hate to let my new Nexus 6p go as it was hard to find complete brand new but when you get your mind on one it's hard to let go. I'd rather get my hands on the X Performance just because I've not owned it before but I know all my cases will fit it from when I had my X. The one I missed out on was new in box for only $178. I just figured no one would buy it over night and I'd buy it the next morning but when I went to purchase it, she was gone. It was the white model just like I wanted too. Hopefully I'll locate the X Performance since it's on par with my Nexus 6p in terms of processor and overall performance. If not I'll just keep my beloved 6p as it's one of my all time favorite phones. The X Performance and regular X were both so over priced when they first released it was crazy. Now they both are much better in line in terms of pricing. Anyone out there have the X Performance? How fast is it. Any lag on that one at all? Is the screen resolution the same with both models? I know the X runs a 650 and I think the performance runs a 820? Anyways check my post out on the market place if you have one of these two models in the original box and it's in like new condition as mine is. Mine is only 5 days old so it's still new. Would be a good trade for someone. My 6p is running 8.0 Oreo already with a security update as recent as to of yesterday. If I can't find a trade for one of these two models where is the best place to buy them at? Amazon? Also or lastly haven't both of these models been discontinued? How much longer will Sony support updates to these two devices. Like my 6p has a whole nother year left. I'm skeptical of letting my 6p go for one but I miss my X so I really want to locate a performance if all possible and do a even trade. If it's an X cash would have to come my way and I'd rather just keep it an even trade. Best buy used to sell these but I don't see them anymore on their site. What happened to this line? Why didn't they do well? I love a 5 inch phone. It's the perfect size for a phone in general to me. Other than the processor, what else are the differences between the two models? Thanks for any info on this.", "time": "10-06-2017 08:05 AM", "replies": []}, {"postID": "post6009128", "text": "@Dconn1975 Single Sim Xperia X F5121 might start getting a bit more scarce or expensive as Sailfish X hopefuls snap them up. I'm going to Europe in less than 2 weeks and may download the ROM while there instead of waiting for the US/CA release... I'm on the fence about this. It would ensure I can get the ROM, but I'd have to pay the dreaded VAT.\nFWIW, F5121 is still up to date with the October security update hitting it on October 4. I have the international version (yay fingerprint reader!). I got mine on Amazon. The price is higher than what I paid in July ($290). B&H Photo has the US unlocked X, in white, for $230. Looks like they are blowing out the stock. It's the last color left and who knows how much longer they will have it in stock... If you've not used B&H before they are top notch for service and support and they give you a 1 year warranty. I've used them many times and swear by them. Only reason I didn't get my X through them was I wanted the international to have the best shot at porting Sailfish X.", "time": "10-07-2017 11:24 AM", "replies": [{"postID": "post6012555", "text": "Do you think I should go with the X model and also get the international version?", "time": "10-09-2017 03:50 PM", "replies": []}]}, {"postID": "post6012565", "text": "The International X would only win out over the North American if you need/want fingerprint reader.\nI don't find the SD 650 to have any lag in my daily use. YMMV.\nBetween the X and the X performance, go with the latter if the IP68 protection is what you crave.\nReally only you can decide that last one.", "time": "10-09-2017 04:00 PM", "replies": [{"postID": "post6017577", "text": "I think I would just be fine with the Xperia X only as I really rather not spend the extra money difference on the performance due to it not being really all that much faster. I'd be fine with the X. Are you saying that I could buy the international version here in the US and be fine on coverage? I'd really like the fingerprint sensor to work. I just thought the international model was not compatible with the US market. Is that wrong or right?", "time": "10-13-2017 06:51 AM", "replies": []}]}, {"postID": "post6017614", "text": "So far as I can ascertain all models of the X have the same radio which includes LTE Bands 1/2/3/4/5/7/8/12/17/19/20/26/8/38/39/40/41 and H+ Bands including 4 which is AWS 1700/2100 MHz and T-Mo relies heavily on that.\nThey are world ready phones for GSM. Obviously they won't work on CDMA such as Verizon or Sprint. Not had any problems with mine on Cricket which uses AT&T towers. I had the international dual SIM and then moved to the single SIM international as that was the one needed for Sailfish. Neither had a problem in the US.\nI am traveling to Portugal soon and I'm happy to see my Xperia X will get LTE there. My wife's AT&T Note 4 will only get H+.", "time": "10-13-2017 07:29 AM", "replies": [{"postID": "post6020004", "text": "So I ended up finding a killer deal on the Xperia X Performance. It still has almost a year left on warranty and is coming complete with original box and contents. I was able to get it for $220! I'm excited to see how it compares to the regular X model. Anyone had experience with both before? Also I read where I could flash the European firmware to my US model and that would in fact enable to the fingerprint sensor. I'd this correct and if so how would I go about doing that? I don't want to mess my new phone up but I really don't want to use a phone without a fingerprint sensor at all and especially if it's there just software related not enabled. But if I can software related flash it and enable the feature of course that's what I want to do. Anyone know about this? Lastly do you guys think I did pretty good on the overall price I paid for the X Performance? I had planned on getting the regular X but cane across this deal right before I was about to order the X. Thoughts??", "time": "10-14-2017 09:28 PM", "replies": []}]}, {"postID": "post6018821", "text": "And this! Sony good at updating", "time": "10-14-2017 01:48 AM", "replies": [{"postID": "post6020009", "text": "So it is running 7.1.1! Good deal. Will we ever see 8.0 Oreo? I became spoiled by having the Nexus 6p and already being on Oreo for a while in fact. Will the X and X performance ever see Oreo at all?", "time": "10-14-2017 09:31 PM", "replies": [{"postID": "post6020300", "text": "Congrats on your deal. Glad you found an X Performance at such a good price.\nOreo? Yup https://blogs.sonymobile.com/2017/08...roid-8-0-oreo/", "time": "10-15-2017 05:32 AM", "replies": [{"postID": "post6020519", "text": "Wow!!! That is so awesome!!! I didn't expect that answer!! I'm super stoked. I liked Oreo. It is a good update and software. Even the icons have changed. Even now if we all wanted there is a apk file download of the pixel launcher if you guys want to use it. No root is needed. Just download the apk file then install then choose launcher 3 as your default launcher and it gives you the identical set up as all the pixel phones one and two. Notification dots. Pill shaped Google search bar and Google now assistant works just like the pixel does. Requires 7.1.1 and up. You can find it on the XDA site if you Google pixel Oreo luancher. Does anyone know the rough date of the Oreo release on our models. That article didn't say. \nYeah I think I did pretty good at $215 on my X Performance. It still has factory warranty left until 05/18. I had planned on buying a brand new X from B&H on sale for $229.99 but when I saw the step up for only $215 on swappa and it came with original box and all contents being like new in box I thought that might be the better deal as I typically don't buy used phones but this one caught my attention at the price. I mean this was Sonys flagship of 2016. I couldn't pass it up. I certainly hope it's indeed like new in box bc I'm very particular about my phones. I've got a skin kit already on order and plus I've already got about 6 cases from back when I owned the regular X which will fit the X Performance too. I've also got this cool sleeve on order since I've gotten to where I don't use cases. I've heard guys talk about this sleeve as being the best one out there. The leather is soft and supple. It's made by FitBag and heres a picture of it. It comes in 16 colors. I ordered beat red. Beat orange beat blue and beat yellow all looked good too.", "time": "10-15-2017 10:00 AM", "replies": []}]}]}]}, {"postID": "post6020523", "text": "By the way I'll probably start posting over here even though I will have the X Performance if that's okay with you guys. There is zero action or talk on the X Performance forum what so ever. Here you guys actually interact. I guess not that many X Performance sold so there aren't many guys that have it. Have any of you ever used it before? Just wondered if I'll be able to tell a difference between the X and X Performance?", "time": "10-15-2017 10:05 AM", "replies": []}]}, {"title": "I've just watched several reviews between the X and X Performance", "thread": [{"postID": "post6017812", "text": "So in my research between the Xperia X and X Performance I've found that the X is every bit as good as the X Performance for some odd reason. Even in speed texts the X seemed to win over the X Performance. I think I'm going to sell my brand new Nexus 6p 64g and buy the Sony Xperia X. I've got sold I think but it's up for sale on the market place right now. I know I'll miss my larger 5.7 screen but I've got my mind set to it now so I'm going to get the X.", "time": "10-13-2017 10:28 AM", "replies": []}, {"postID": "post6018817", "text": "Just got me the X bnib where I could have gotten a used performance by $10 cheaper... I'm happy", "time": "10-14-2017 01:42 AM", "replies": []}]}, {"title": "What's it like to hold?", "thread": [{"postID": "post5891549", "text": "I've handled a few times in stores but don't see how you could easily avoid triggering the volume rocker and the camera launch button with fourth and fifth fingers respectively. I'm assuming the phone to be held in the left hand.\nIs this in fact a problem in practice? Do you have to learn a new grip?", "time": "07-19-2017 03:48 PM", "replies": []}, {"postID": "post5898824", "text": "Well it looks like I'll have to try to answer the question myself:\nYes, the volume rocker is in an awkward position if you're used to it being higher up. Yes, you'd have to learn a new grip.", "time": "07-25-2017 07:03 AM", "replies": []}, {"postID": "post5905030", "text": "I've had the phone for two weeks and have never accidently triggered the volume buttons or camera. The phone is an absolute joy to hold and I'll never be going back to terrible thump hostile 5,5“screens!", "time": "07-29-2017 11:37 PM", "replies": []}, {"postID": "post5942957", "text": "Same here. That's why it's called a \"Compact phone\" small manageable yet a joy to use. Web browsing is so nice too. Got her this phone you'll not be disappointed", "time": "08-28-2017 12:14 PM", "replies": []}]}, {"title": "Fingerprint sensor activated on my US version of Compact X", "thread": [{"postID": "post5933881", "text": "Well, after a few attempts and watching multiple You tube videos I've been successful in the activation of the finger sensor. Wow is it fast. A very happy Sony user... 😀", "time": "08-23-2017 02:00 PM", "replies": []}]}, {"title": "Is the X Compact still a solid choice?", "thread": [{"postID": "post5874484", "text": "Currently looking at phones to replace my LG V10. My main issues with it are size and battery life. I knew what I was getting into when I bought a phablet, but it's become a nuisance with how large it is in my pocket/wherever else I choose to put it. And battery life at this point is probably 3 1/4 hours SOT on an average day.\nBasically, I'm just looking to make sure that the XC has comfortable usability, good battery life (basically only use Twitter, Slack, GroupMe, and some Google Now for news) and no major issues that you might not see in a review.\nThank you so much for any help! There's not a tonof stuff out there about this phone, looking to make the most educated purchase possible", "time": "07-05-2017 04:20 PM", "replies": []}, {"postID": "post5880801", "text": "Oh. No response. I just looked in here to find some opinions myself. I keep thinking about this phone because of its good specs and small size, but like you am uncertain. The corners seem a bit sharp and I wonder whether they'll be palm-diggers. The curves on the screen edges might make screen protectors a problem. I have one or two other slight doubts but the specs are indeed respectable and the price is not high. Shall we buy?", "time": "07-10-2017 09:23 PM", "replies": []}, {"postID": "post5887673", "text": "My wife has had one for about two weeks and so far very impressed. Responsive, very little bloatware and excellent battery life. If it's the size you want, go for it", "time": "07-16-2017 06:26 PM", "replies": []}, {"postID": "post5892052", "text": "I think it's still a good choice if it's not too expensive where you live. It's a really comfortable phone to hold in the hand due to the curve sides, though if you use your pinky to support the bottom of the phone it might be a bit sharper. For me i could get around over 5 hours SOT on the X Compact, but we all have different uses, so can't really compare. I haven't used the V10 before either so can't really give you a good gauge.\nIf you want a smaller phone, this is a great choice. The specs might seem a bit underwhelming, but the nougat update did wonders for the phone. The UI responsiveness is actually really good, and performance is pretty decent too. It's something that I can definitely live with comfortably for the apps that I use.\nI like Sony's UI too since it's pretty clean, and sony is pretty on the ball when it comes to updates. It got 7.0 like early this year, and was updated to 7.1.1 recently. Mine's running the July security patch.\nThere are a few things to take note too though. The speakers isn't really the loudest I've heard, and screen protector can be a bit challenging to find, especially if you're looking for glass ones. The glossy plastic back shell picks up hairline marks really easily which is to be expected, so just have to take note of that.\nSo yeah, i'll definitely still recommend one if you can find one for a good deal. I had the black colour one but sold it a few weeks back. Immediately regretted it, and i just picked up another one a few days back in mist blue.\nI did a short and quick video review too if you're interested. Despite not being super popular, it's a pretty lovely phone if you ask me.", "time": "07-20-2017 02:08 AM", "replies": []}, {"postID": "post5915650", "text": "Would like something this size and price, but, Verizon? Bah!", "time": "08-07-2017 04:34 PM", "replies": []}, {"postID": "post5922642", "text": "I've had my Compact X for a month or so now and its and amazing little phone. I've had Sonys before and actually came back from both the HTC U11 and the Honor 8. The camera is amazing, battery life well oh my goodness and it's fits nicely in my pocket. Calls are very clear, Web pages load fast even when I'm not on WiFi. The only challenge of course would be the lack of the fast finger print sensor. Unfortunately I'm unable to activate with the flash tool software but that's OK. If you're hesitating don't.. Go get this phone..", "time": "08-13-2017 06:46 PM", "replies": [{"postID": "post5924812", "text": "You chose the X compact over the u11??", "time": "08-15-2017 08:58 PM", "replies": [{"postID": "post5924956", "text": "Sure , why not. For someone wanting a smaller , more compact device it sounds perfect. I have an HTC 10 but wish I could go smaller. Not everyone likes big phones and I got burnt out on carrying them around. The 10 is my limit size wise and I wish it were smaller. I'd check this compact out if it worked with Verizon.", "time": "08-16-2017 12:28 AM", "replies": []}, {"postID": "post5925825", "text": "Yes I did. Though I have no complaints about the HTC U11 technology and it's capabilities, I just didn't like phone size. I like a small phone that's fits easy in my pocket.", "time": "08-16-2017 04:57 PM", "replies": []}]}]}]}, {"title": "Finger print sensor", "thread": [{"postID": "post5919711", "text": "Love the phone. Small, compact, powerful and we'll darn.. Fits in the pocket lol. I'd like to get the fingerprint sensor working. Tried to download the flash drive with no success. Please any suggestions? Windows 10 software on my PC.", "time": "08-10-2017 07:12 PM", "replies": []}]}, {"title": "Xperia X Camera2 API support?", "thread": [{"postID": "post5840838", "text": "Hi everyone!\nI'm very interested in using smartphones as (additional) video production tools and some of you might have heard about the Camera2 API, an Android API that Google introduced with Lollipop to give camera app developers better access to full manual photo & video controls. Unfortunately not all developers have implemented Camera2 API to the full extend in all of their phones. So I would be interested in how well Sony has implemented Camera2 API in the Xperia X. There are two small (and of course free) apps on the PlayStore that can test that in a second:Camera2 probe\nandCamera2 Probe\nWould somebody who owns the Xperia X be so nice to quickly run one of those apps and let me know which hardware level support category is shown for the X? There are four different levels: \"Legacy\", \"Limited\", \"Full\" and \"Level 3\". \"Full\" and \"Level 3\" are the best.\nThanks a lot!\nFlorian", "time": "06-06-2017 12:32 PM", "replies": [{"postID": "post5866699", "text": "Surprised no one did this yet.\nI do wish it would take RAW.", "time": "06-28-2017 01:50 PM", "replies": []}]}, {"postID": "post5872314", "text": "Thanks for checking!", "time": "07-03-2017 04:29 PM", "replies": []}]}, {"title": "Any of you guys ever used Sony Xperia before?", "thread": [{"postID": "post5822642", "text": "Okay there is not much interaction over on the Sony threads like this forum. So I pose the question for you guys if any of you have used or had either the Xperia X or X Performance? I want a 5 inch phone. These two fit the bill. They also on Amazon are going for good prices. Which of the two would you educated guys go for. The Xperia X has a 650 processor and performance has a 820 but there is a $100 dollar price difference. Which would you guys opt for? I ask here for a specific reason and it's because the intelligence level on this forum is high. Let me know your suggestions. Thanks​ to all for allowing me to ask this question here. I tried the Sony boards and got nothing.", "time": "05-20-2017 11:01 PM", "replies": []}, {"postID": "post5823385", "text": "Sony phones in the US can't use fingerprint scanners but are no cheaper than their international counterpart models.", "time": "05-21-2017 04:41 PM", "replies": []}, {"postID": "post5823408", "text": "I haven't seen a sony phone in person since 2014 or 2015, they are very unpopular in the US.", "time": "05-21-2017 05:15 PM", "replies": []}, {"postID": "post5823421", "text": "I have not used Sony devices personally, but I know they are good devices. You can't go wrong with either, IMO.", "time": "05-21-2017 05:21 PM", "replies": []}, {"postID": "post5823567", "text": "Dconn, I actually used the Xperia X which I really liked and used on a daily basis. Not a bad phone overall. Frustrating for me I had to unlock with a code or password no finger print touch. In Europe and Asia finger print works well, banned in the U.S. for some reason. Must be a patent problem I guess.\nThere's a way to make this work in the U.S. It's on the XDA's website though I didn't have the guts to try it.\nAfter the X I bought the XZ and hated it. Slow, clumsy and the battery was awful. I traded it on eBay and purchased the honor 8 which I use today.\nI've heard​ the XA1 is a good little phone for $299 but no fingerprint user available and the battery might be suspect on daily use.\nHope this helps!", "time": "05-21-2017 07:43 PM", "replies": [{"postID": "post5823814", "text": "I'm thinking about jumping out and on the X Performance this time around. I too have had the X and I liked it. I can live without a fingerprint scanner so I'm good there. I just hope to see noticable differences in performance between the X and performance. I can pick the white performance up on Amazon right now for $360 which for a flagship speced phone isn't a bad price or I can go as low as $277 on the X it self to save if I want to. Another one I'm considering is the Sony compact but the 720 resolution is a deal killer for me on it or that would be the phone I went for.", "time": "05-22-2017 02:41 AM", "replies": []}, {"postID": "post5825016", "text": "I also want try the Sony x compact as well. It's a bit more expensive and although this really doesn't matter much on a 4.6 display, 720p just bothers me for a top end device.", "time": "05-23-2017 03:22 AM", "replies": [{"postID": "post5827202", "text": "I'm with you here on this point. The compact needed to be at least 1080p and I'd already had gotten that device. That said the 720 display killed it for me too.", "time": "05-24-2017 10:11 PM", "replies": []}]}]}, {"postID": "post5826838", "text": "I really want to try an Xperia phone. I'd love to have the XZ, XZS or XZ premium to try for a couple weeks. Not many used ones out there either. I can't pull the trigger for full price yet. Just can't. Youtube reviews are general pretty good. The XZ1 and XZ1 Compact are supposed to be announced this Sept and sound like they might be strong contenders.", "time": "05-24-2017 03:32 PM", "replies": [{"postID": "post5827124", "text": "Yeah, I'd love to use a Sony phone too! It will be interesting to see how the Compact series fares in the fall.\nI personally think Sony devices are cool and underrated. My brother had one a few years back and I loved it!", "time": "05-24-2017 08:39 PM", "replies": []}]}, {"postID": "post5832998", "text": "I'm out on the Sony Xperia. They just discontinued the line.", "time": "05-30-2017 10:25 AM", "replies": []}, {"postID": "post5832999", "text": "Along with the compact too! They just released that one too!!", "time": "05-30-2017 10:25 AM", "replies": []}, {"postID": "post5834474", "text": "Mod note: Moved out of the Honor 8 forum to an Xperia forum since this is not about the Honor 8.", "time": "05-31-2017 02:36 PM", "replies": []}, {"postID": "post5835392", "text": "Just bought the XZS off ebay for a pretty good price and I'm loving it so far. International version with fingerprint scanner. Have yet to activate it on AT&T. Hopefully I won't have any issues there. Will keep posted on my experience with the XZS!", "time": "06-01-2017 10:39 AM", "replies": []}, {"postID": "post5840272", "text": "i have hade always had but then was was it Ericsson later sony-ericsson and now is it sony but is still swedish teknologi love xperia X dont know how many Eriksson.sony-ericsson.and Sony xperia tack för mej or thanks for me mvh conny", "time": "06-06-2017 01:08 AM", "replies": []}, {"postID": "post5840273", "text": "i have hade always had but then was was it Ericsson later sony-ericsson and now is it sony but is still swedish teknologi love xperia X dont know how many Eriksson.sony-ericsson.and Sony xperia tack för mej or thanks for me mvh conny ps Sony Xperia Z5 still have it lov wen u can film in K4 soo ******* nice agen. Conny", "time": "06-06-2017 01:08 AM", "replies": []}, {"postID": "post5840409", "text": "Im using Xperia X since 5 months, I did not experience any problem so far like crash problems, lagging issues etc. It works all games,applications very well ,so performance is not bad,and it has nice camera. It is nice phone for its price, it worths. I wish it has the ability of working under water", "time": "06-06-2017 06:14 AM", "replies": []}, {"postID": "post5840601", "text": "I've used the XZ before. It was a solid device.\nHonestly, wait for the XZ1. The Compact is rumored to return to the usual \"high-end specs in a small body\" ethos.\nThe XZ Premium is nice, though. I legitimately want to give it a shot, moreso than some other phones.", "time": "06-06-2017 09:52 AM", "replies": []}, {"postID": "post5853685", "text": "I love Sony phones. I had Z3 from T-Mobile and Z5 Premium. I broke both and told myself no more expensive phones. Got an axon 7 for 400 because x performance was way too much. Now that its 350 on Amazon I would say X performance all the way. Great size, great processor, Sony's bare OS is great because I like simple. Camera I'm sure is great. Nobody is taking pics for NatGeo on their phone so let's not get into a pissing competition a out camera quality. Fingerprint can be activated by flashing a UK rom from Sony onto it. Don't buy international stock without warranty. That boned me over with my Z5P", "time": "06-17-2017 10:17 AM", "replies": []}, {"postID": "post5854510", "text": "Sony stopped making entry level phones for developing markets which i think was a bad business move. Phones like Moto E and G series are quite popular and selling millions so not having that market is bad decision. \nIf Sony manages to make a decent $150 phone with decent specs then i would give Sony a chance. \nAs it is right now, Sony phones are a rip off for the price. Less than HTC but more than most other brands.", "time": "06-18-2017 05:22 AM", "replies": []}, {"postID": "post5860380", "text": "I, ve got mine on contract with 02 and although the fone, s brilliant 02 customer service is ****. With a big S.", "time": "06-23-2017 01:26 AM", "replies": []}]}, {"title": "6 day battery from Xperia X compact", "thread": [{"postID": "post5840977", "text": "I get 6 days out of my Xperia X. 6 full 24 hours days. I use a few calls and texts each day, and a bit of internet. I dont use streaming, camera, games or videos in general, and I do notice when Im using music player it goes down fairly quickly, at a guess about 10% per hour.\nBut even when Ive finished and if Ive got only about 20% left, that will still do me for 2 days, so it not a problem if music drains it. Other phones would be dead within an hour or 2 with 20% left\nIf I use an app with bright screen on, such as notepad for hours, that will drain it quick. I was surprised as I thought notepad wouldnt use much processing power, but I suppose its the bright screen that takes it. I was using if for about 4-5 hours and it drained about 70% of it\nI was totally surprised as I expected it to be 2 days max for normal usage. I used to have a Nokia N8 which would last 5-6 days, and I kept putting off upgrading as I thought no modern smartphone would do anywhere near as well as that, but 6 days is no problem with the Xperia X. \nI do have battery saving on, but just the standard one, not the super one, and it doesnt change performance really. There is rarely a tiny bit of drag when swiping screens across, like the animation isnt smooth, but very rarely, I cant notice it in normal use.\nIts the Xperia X compact if thats any use, I also notice the shape of my phone seems a bit different to the ones in articles on the internet, the corners are more sharp, the ones in the pics seems quite rounded. Maybe its just my eyes or the way the pic seems?\nDoes anyone else have this kind of performance with their Xperia X?", "time": "06-06-2017 01:55 PM", "replies": []}, {"postID": "post5845545", "text": "I don't think 6 days is possible using the phone on a normal way like accessing emails.", "time": "06-10-2017 03:07 AM", "replies": []}, {"postID": "post5846957", "text": "Yeah that's what I thought. It might be closer to 5 1/2 or 5 if I test it. But it's about there. I took it off charge Thursday morning and I'm on Sunday at 56% now", "time": "06-11-2017 11:57 AM", "replies": []}, {"postID": "post5847829", "text": "Good to know. It might be my next purchase to join my S7 and use it as a secondary phone. I am also thinking about new the Moto Z2 or the iphone SE. Any thoughts?", "time": "06-12-2017 10:08 AM", "replies": []}, {"postID": "post5849130", "text": "To be honest I think the Xperia X compact (or non-compact) is rare to get 6 days. Its supposed to get about 2 days. Thats why Im checking about to see whats happening with other peoples phones. \nWhen I was checking for phone reviews and stats I never had a look at Moto Z2 or iphone SE", "time": "06-13-2017 11:18 AM", "replies": [{"postID": "post5859056", "text": "So what would be your recommendation?", "time": "06-22-2017 01:42 AM", "replies": []}]}]}, {"title": "Thoughts on the Xperia x", "thread": [{"postID": "post5298048", "text": "Has anyone bought the Xperia X?\nI am thinking of buying as would like Change from the Samsung!\nAny views would be great\nThank you", "time": "08-03-2016 11:31 AM", "replies": []}, {"postID": "post5298059", "text": "Mod note: moved to Xperia X forum for more exposure.", "time": "08-03-2016 11:35 AM", "replies": []}, {"postID": "post5305211", "text": "Don't get it. Costs $700 in my country however the specs resemble that of a $250 phone like Moto G4 Plus or $150 phone like Redmi Note 3.Does that sound like a good value to you? If it does then get it. Mid range cpu in a $700 phone when phones costing a fraction of that have same specs. \nSee my similar post in Xperia XA forum. Just helping spread the knowledge that Sony phones are not good value.", "time": "08-06-2016 12:25 PM", "replies": [{"postID": "post5409844", "text": "One thing to note though is that Xperia phones usually keep their value longer than most other Android phones.", "time": "09-10-2016 07:36 PM", "replies": []}]}, {"postID": "post5410048", "text": "I have the Experia X and I can tell you it's my favorite phone. I actually just ordered a Skinomi kit for mine and now it's completely covered front, back, sides and top and bottom. I've seen that is now has been lowered to $449 from $549. At $449 I would do all I can not to pay anything over $400 for it but still at 449 it's an awesome phone. The camera is awesome. Processor is really fast and it's my go to phone. A true one hander phone and then it has 1080p which is great. I actually watched a movie on last night and it's crystal clear. You won't regret it. I believe if Sony had priced it right in the first place the X would not be underrated and lots more would have bought it. I was extremely lucky and got mine at Best Buy due to poor service I experienced for $199. At that price I was so happy BC I would have paid $549 for it. I'm thinking its every bit as good as the performance or very close. Get it man. You will enjoy the heck out of it. My other two phones are the Moto Z Force and Moto X Pure. The Sony is what I use 80 percent of the time. It's great.", "time": "09-10-2016 09:49 PM", "replies": [{"postID": "post5410494", "text": "I didnt quite get the deal you got on the X but I'm actually very impressed with this phone. It's a very attractive phone and fits the size I wanted. I'm tried of larger phones that are bulky and heavy. This has a sweet spot for sure if you're looking for that perfect 5 inch screen and weight. Battery 🔋 life is amazing. I'm not a gamer but surf the web and use the phone a lot during the day. I'm get about 1.75 days per charge not too shabby. If they would have price this phone for around $355 - $375 I think they would have moved more phones and gained more traction in the market. So far happy 😊 buyer", "time": "09-11-2016 05:47 AM", "replies": []}]}, {"postID": "post5410510", "text": "I agree definitely. Simple economics and they would have shown a profit by quantity sold. Plus if they want to compete in the US, there's just too many other great phones like the X out there that are selling at market value. Thats what I do for a living is real property valuation. Same applies with a good. Not the slightest idea of what the group of minds thought in a meeting to conclude that we should sell the X for 549 when real market value suggest 350 to 450 tops. Maybe supply and demand are defined differently in other countries of the world. Flat out economics 101 or either they truly thought that highly of themselves on the X and Performance. That being said, the X is pretty awesome.", "time": "09-11-2016 06:16 AM", "replies": []}, {"postID": "post5411591", "text": "I watched a movie on mine the other night and it was crystal clear. No buffering and I actually enjoyed it. First time I've ever watched a movie on anything smaller than my 9.7 iPad. I used my free trial vouchers for the Sony app and watched Total Recall the 2012 version. Cool movie by the way. I've been debating on forums with others about the truth behind the movie. Nothing better than a deep minded action movie. Makes you think long after the movie is done. I'm still on threads debating if the movie was reality or dream state. Cool stuff. Nothing beats the Matrix though if you want to dig in mega deep. Wait, this is about the X! Sorry. So the X is great with deep movies too!", "time": "09-11-2016 04:51 PM", "replies": []}, {"postID": "post5840441", "text": "I have bought it since 5 months, according to the price performance ratio I think it is very good. It is a nice. A good choice for midrange price option..", "time": "06-06-2017 06:54 AM", "replies": []}]}, {"title": "Reply to this thread if you have the Experia X or are going to get one", "thread": [{"postID": "post5413070", "text": "I'm curious of how many people have the Experia X like I do. I'm starting to really think that not many have it. I'm sure it's bc of the sky high price point it began at. It's dropped now but this phone is better than any of my other iPhones I've had. If you have this phone or tried it, post here and let me know your thoughts good or bad.", "time": "09-12-2016 10:31 AM", "replies": []}, {"postID": "post5415451", "text": "No one with the X?? Wow it must not have sold much at all. I love mine. It's my favorite phone. I guess they price themselves out of most of their potential market buyers. Sony, please understand at least US economics and market valuations. Neither of these two are wrong if utilized accordingly and one can't exist without the other. So Sony tried to sell a phone leaving out one of the said two criteria. From the response or lack of response to my thread it seems I'm right. Too bad bc Sony made a good phone with the X. I've enjoyed mine and it's my go to phone.", "time": "09-13-2016 10:34 AM", "replies": []}, {"postID": "post5458571", "text": "Yes I just bought the x and I say it is a very underrated phone. This phone is awesome.", "time": "10-01-2016 05:31 PM", "replies": []}, {"postID": "post5523100", "text": "I have had this for 3 months now and have no complaints. . I have used Samsung phones for the majority but glad I switched. \nI like its functionality and the look of the phone. \nI read the pros and cons and reviews before buying. But nothing troubles me about the phone.", "time": "10-25-2016 02:55 PM", "replies": []}, {"postID": "post5526864", "text": "Nice to finally see some others out there with this phone. I just got a new case for mine. I'll post it up in a second. The phone is very underrated.", "time": "10-26-2016 10:40 PM", "replies": []}, {"postID": "post5526869", "text": "Here it is. Got if from Amazon. Not bad for 10 dollars. Real leather and fits perfectly.", "time": "10-26-2016 10:43 PM", "replies": []}, {"postID": "post5529424", "text": "Few more cases I've found on Amazon", "time": "10-27-2016 10:09 PM", "replies": []}, {"postID": "post5604258", "text": "I have the sony Z3 compact. I need to upgrade.\nBut the reviews of the xperia X scare me a bit.\nFirstly it has a snapdragon 650 where the Z3 compact has a faster one 801.\nSecondly, the pictures arent that great to the z3 compacts. I have a camera so i dont rely on a phones camera really\nAlthough i do use it a lot. Some reviews say the pictures arent up to scratch, where other say they arent bad at all\nits not water proof...well thats not such an issue to me..\nIt doesn't have the universal USB charger port.....ok also not such an issue.'\nFinger print sensor Yippie....\nBut as we know with reviews, its all relative...if you have an Apple 8, all other phones you will find faults \nThe phone is slightly expensive for what it does.\nBut yes its a great phone , i will certainly give it some thought.\nMy other choices Huawei P9 and LG G5 se.....\nBut i like sony so post more convincing stuff and i might fall for it ,,", "time": "12-12-2016 10:25 AM", "replies": [{"postID": "post5721082", "text": "I guess 650 is faster than old 801, I've read about it as better as 808 but more power efficient tho.\nWhere did you know about the camera is less good than Z3 compact?\nAnd it is have microUSB 2.0 just like Z3 compact btw.\nAnd I do look for a new phone, now the price is dropped already, I guess it is a good value to get X. Or maybe X compact.", "time": "03-22-2017 09:32 AM", "replies": []}]}, {"postID": "post5775181", "text": "Just pulled the trigger on an Xperia X in Lime Gold, international F5122, 64GB. Coming in next week by Wednesday. It'll be \"my first Sony\" LOL (for phone anyway).", "time": "04-21-2017 02:36 PM", "replies": []}, {"postID": "post5822659", "text": "I'm about to get another one but can't decide on the X or X performance. Any of you guys ever used both models? Is the X performance that much better like $100 dollars better? I'm trying to decide which to go for. I know I need and want a 5 inch one hander phone.", "time": "05-20-2017 11:26 PM", "replies": []}, {"postID": "post5840415", "text": "I have it since 5 months, according to the price performance ratio I think it is very good. It is a nice. A good choice for midrange prices..", "time": "06-06-2017 06:18 AM", "replies": []}]}, {"title": "Better than the z5 compact?", "thread": [{"postID": "post5449701", "text": "I have been using the z5 compact ever since my Note 4 gave up on me. Since the X compact is out I have been contemplating buying it. \nYour views on x compact vs the z5 compact.", "time": "09-27-2016 09:29 AM", "replies": []}, {"postID": "post5453136", "text": "...", "time": "09-28-2016 08:42 PM", "replies": []}, {"postID": "post5467377", "text": "I too am attracted to it. The use of a Snapdragon 650 and other cost cutting measures don't seem to have compromised it enough to matter, though the UK price is still a little high.", "time": "10-05-2016 03:33 PM", "replies": []}, {"postID": "post5492611", "text": "Well I personally feel the cuts are too much to compromise. Lack of waterproofing alone is a lot. Plus the design seems to have taken a step in the wrong direction. Dsnt make owning a small phone as rewarding as the z5 compact. \nStill, owing a newer phone is a tempting proposition!\nI hope nougat lands soon enough on the z5 compact. Will make it easy to make a decision", "time": "10-14-2016 11:14 AM", "replies": []}, {"postID": "post5615265", "text": "I have about a dozen devices I rotate through (I'm a software developer) and have to say the X Compact is my favorite.. The camera on the X Compact is noticeably better than the Z5 as is the battery life in my experience. Frankly, since I've never dropped my phone in water, I don't care about the waterproof feature...it's fine with an occasional couple of drops of rain which is all I need.", "time": "12-20-2016 04:44 PM", "replies": [{"postID": "post5827713", "text": "I agree with this. I had and loved the Z3C and the Z5C.... The XC is a durn fine phone.. Don't let the specs fool you as it's actually snappier than my Z5C is..\nCamera is better on the XC, the phone does not get hot like the Z5C did and battery life is a little better on the XC..\nMy one and only complaint is the glossy finish on the XC.. I wish they had kept the same exact form as the Z5C but all in all I highly recommend the phone..", "time": "05-25-2017 10:21 AM", "replies": []}]}, {"postID": "post5675508", "text": "The camera is still crap like the Z3C and Z5C but otherwise it's a solid device.\nI don't base my purchasing on how good the camera is, but my iPhone 7 takes way better photos.", "time": "02-12-2017 07:43 AM", "replies": []}]}, {"title": "Will silver metal back on the xperia get dirty", "thread": [{"postID": "post5740382", "text": "Like all other white phones, wiil the silver metal back on the xperia x model get all dirty and stained permanantly.\nIf not which would look best, the white or black version of xperia x", "time": "04-03-2017 01:27 AM", "replies": []}, {"postID": "post5775162", "text": "Personally, I just went with the Lime Gold. I like my phone to have personality. Imma coat it all over with Liquid Glass.", "time": "04-21-2017 02:31 PM", "replies": []}, {"postID": "post5783446", "text": "I saw an 8 months later re-review (after Nougat update) of the X in silver. Still looked great. \nMy Lime Gold Xperia X just came in and it is drop dead gorgeous.", "time": "04-25-2017 08:18 AM", "replies": []}]}, {"title": "Will the Unlocked Sony Xperia X work with MetroPCS?", "thread": [{"postID": "post5674446", "text": "It says compatible with metropcs but can anyone confirm if it really does?", "time": "02-11-2017 03:38 AM", "replies": []}, {"postID": "post5775523", "text": "It's got all the frequencies you need for Metro which is really on T-Mo towers. All the 3G and LTE bands included out of the box.\n2G bands\tGSM 850 / 900 / 1800 / 1900 - SIM 1 & SIM 2 (dual-SIM model only)\n3G bands\tHSDPA 800 / 850 / 900 / 1700(AWS) / 1900 / 2100 - F5121, F5122\n4G bands\tLTE band 1(2100), 2(1900), 3(1800), 4(1700/2100), 5(850), 7(2600), 8(900), 12(700), 17(700), 19(800), 20(800), 26(850), 28(700), 38(2600), 39(1900), 40(2300), 41(2500) - F5121, F5122\nF5121 is the North American and F5122 is the international. They both have the same radio. Most telling for you is the 3G 1700 AWS. Gotta have that on T-Mo and the band 12 LTE as well.", "time": "04-21-2017 05:11 PM", "replies": []}]}, {"title": "Looking For A Keyboard Like The Galaxy S7's", "thread": [{"postID": "post5755731", "text": "I'm trying to find a keyboard for my Sony X Compact that is like the S7's. What am I looking for? Swiping, word suggestions, long press keys for alternate function, .com key for websites, and learning of phrases and emails. Any of them have all of that? It's not possible for me to get the actual S7's keyboard, right?", "time": "04-12-2017 11:20 AM", "replies": []}]}, {"title": "Short battery life xperia x compact", "thread": [{"postID": "post5750736", "text": "When my xperia compact is fully charged it gives me 22h of use when checked in settings, is that how it should be?", "time": "04-09-2017 05:38 AM", "replies": []}, {"postID": "post5751248", "text": "Welcome to Android Central! That depends on a lot of factors, like what apps you're using, how much you're keeping the screen on, how strong your cell signal is like, and many more. It would help to see some battery stats. Charge up to 100%, then let it drain to 20-30% with normal usage, without charging in between. Then show us: \n1. The main Settings>Battery screen.2. The fullscreen battery graph screen (which shows Awake time and Cell Signal Strength).\n3. The Screen category (to see total Screen On time).\n4. The Cell Standby category, if present (to see Time Without Signal). http://forums.androidcentral.com/gen...d-central.html \nYou might have to install a 3rd party battery monitor, like GSam Battery Monitor, to get the Cell Signal Strength graph.", "time": "04-09-2017 01:32 PM", "replies": []}]}]
[{"title": "Emulated storage and SD Card directory", "thread": [{"postID": "post5721837", "text": "Would someone explain what emulated storage is! I want to create directories on my SD card but I cannot do that. I can create directories on emulated storage.", "time": "03-22-2017 06:45 PM", "replies": []}, {"postID": "post5721967", "text": "Welcome to Android Central! Which file manager app are you using? To create a directory on the external SD card, look for the directory /storage/sdcard1 (which may also be shown as /storage/emulated/1). Sdcard0 (or /storage/emulated/0) is actually the internal storage.", "time": "03-22-2017 08:54 PM", "replies": []}]}, {"title": "A 4.6 720 screen?", "thread": [{"postID": "post5389419", "text": "I can understand why they did this. It helps to bring the cost of the device down some. I really don't think it will detract that much from the enjoyment of the device. However, if you are already going with a higher display resolution, say the 1400s for a while, you will most likely notice the difference. For me, it reminds me of the Moto X 2013.", "time": "09-02-2016 10:46 PM", "replies": []}, {"postID": "post5395144", "text": "I think this is a reasonable choice.", "time": "09-04-2016 11:54 PM", "replies": []}, {"postID": "post5403112", "text": "I agree. They should have went with the 1080p in this phone. If I don't get it, that will be why. 1080p is hands down better than 720. It's noticeable to me.", "time": "09-08-2016 05:00 AM", "replies": []}, {"postID": "post5409836", "text": "For a a screen that size, I really don't think I could notice much of a difference. Despite the fact that I use a QHD phone.", "time": "09-10-2016 07:33 PM", "replies": []}, {"postID": "post5421706", "text": "For a small screen size 4.6\", 720p is sufficient above 5\" i would agree that 1080p makes a difference.", "time": "09-15-2016 05:30 PM", "replies": []}, {"postID": "post5467392", "text": "The 312ppi LCD display of my 4.7\" Lumia 550 gives sharp viewing. Look very close and you can see pixels, but you do have to stop and look close, rather than just getting on with using the phone. All other things being equal - which they probably aren't - the 4.6\" Xperia ought to be a tad sharper.", "time": "10-05-2016 03:39 PM", "replies": []}, {"postID": "post5615266", "text": "If you were to actually use the device, you would have no trouble at all with the display.. It's quite crips and sharp!", "time": "12-20-2016 04:45 PM", "replies": []}, {"postID": "post5649549", "text": "I cannot see a difference on this screen size at all lovely screen", "time": "01-19-2017 01:56 PM", "replies": []}, {"postID": "post5651853", "text": "I came from a QHD screen and can't notice any real difference. I think I like this display even more. I'm glad they went with a lower resolution. Improves performance and battery life with no noticeable difference in quality.", "time": "01-21-2017 04:03 PM", "replies": []}, {"postID": "post5675512", "text": "It works out at about the same ppi as my 2560 x 1600 Lenovo tablet - fine for everyday use.\nAbsolutely though I couldn't use a laptop with less than full HD and preferably more - it depends on how far away from the screen one is.", "time": "02-12-2017 07:47 AM", "replies": []}]}, {"title": "Price drop on the X to $449... Thoughts", "thread": [{"postID": "post5401844", "text": "So anyone more interested in the Experia X now with the recent price drop? I think it's way more in line with market value now. Had to replace my first X but this one has been great. Had Sony priced it right, I think the phone wouldn't be so underrated. It's plenty fast and the camera is amazing.", "time": "09-07-2016 02:49 PM", "replies": []}, {"postID": "post5461417", "text": "You're right, a very underrated phone, I just bought mine 9_1_2016 and I think this phone has slid under the radar. Camera is as good as any out there I think and it is definitely the right size for me, Wow!.", "time": "10-03-2016 11:47 AM", "replies": []}, {"postID": "post5462736", "text": "Finally someone who has it. It's a awesome phone.", "time": "10-04-2016 07:02 AM", "replies": []}, {"postID": "post5469115", "text": "Update =sorry, I bought it 10_1_2016", "time": "10-06-2016 08:41 AM", "replies": []}, {"postID": "post5635179", "text": "Best Buy has it for $350 now. Seems like a more appropriate price.", "time": "01-07-2017 08:25 PM", "replies": []}]}, {"title": "Price drop", "thread": [{"postID": "post5534945", "text": "Just a heads up that this phone is now $399 on Amazon. Not sure if it's temporary but I believe it is definitely worth it at this price point. Sony really does make a nice phone. I think I may grab one to go next to my pixel for a back up.", "time": "10-30-2016 03:59 PM", "replies": [{"postID": "post5535615", "text": "OMG, I am going to look right now! At $400, it is worth a try. I think I might do it. Thanks for the heads up!", "time": "10-30-2016 10:39 PM", "replies": []}]}, {"postID": "post5536090", "text": "Also I may try for B&H. Their price shows $449 but I think that they price match. If so, they also send tax free if out of state+ free shipping!", "time": "10-31-2016 06:15 AM", "replies": [{"postID": "post5536099", "text": "Yeah, I really like them too. Wish that they had the Mist in stock. I'll have to see how much it turns out to be after tax and such on Amazon. If it's higher than I would like, I'll probably wait for b&h to list the Mist. Not sure why they made the white one cheaper though.\nEdit: Since I have Amazon credit, even with the most expensive shipping (and tax), it's still under $400 for me so this time, Amazon wins so I ordered from Amazon.", "time": "10-31-2016 06:19 AM", "replies": [{"postID": "post5536449", "text": "Nice! I'm still debating white vs mist. Let us know when you get it!", "time": "10-31-2016 09:28 AM", "replies": [{"postID": "post5536460", "text": "Both are great colors! I will hopefully let you all know later (impulsively went with same day shipping, because it was $10 rather than like $20 >.< )!", "time": "10-31-2016 09:32 AM", "replies": []}]}]}]}, {"postID": "post5538122", "text": "I got it, the Mist is really nice looking to me. I feel like I can really use it with one hand. It is really a great size. Not a fan of superior auto mode in low light, but when you hit manual, it looks better. Need better light to see it how it goes.", "time": "10-31-2016 10:33 PM", "replies": []}, {"postID": "post5540400", "text": "After a day with it, it's going back to Amazon for me. It's refusing to sync my contacts and keep them synced! (I don;t have a Google email address, but if you do, you wouldn't have this issue.) Contacts are very important, and having it do that even though I did everything the right way is tiring.", "time": "11-01-2016 09:46 PM", "replies": [{"postID": "post5541527", "text": "Sorry to hear that. Did you try to set from another device?", "time": "11-02-2016 01:17 PM", "replies": [{"postID": "post5541537", "text": "Nope. I always set up fresh. Really liked it a lot though.\nI added and removed my contacts a couple of times too.", "time": "11-02-2016 01:22 PM", "replies": [{"postID": "post5541556", "text": "Yeah I didn't even know it was possible without a Google account.", "time": "11-02-2016 01:27 PM", "replies": [{"postID": "post5541557", "text": "My mistake, I do have a Google account but not a Gmail address. My google account is kind of a shell for my outlook. It just didn't work for me with syncing it, even though it normally does.", "time": "11-02-2016 01:29 PM", "replies": [{"postID": "post5544879", "text": "Btw did you like the color? Or do you think white would be a better option? Just don't want it to look feminine", "time": "11-04-2016 05:37 AM", "replies": [{"postID": "post5544923", "text": "I thought that the color was nice, kind of reminded me of the Ice color of the Nexus 5x but cooler looking. The white would be nice too, though.", "time": "11-04-2016 06:18 AM", "replies": []}]}]}]}]}]}]}, {"postID": "post5570068", "text": "I wish I would have grabbed one at $399.00, I'm hoping maybe there will be a Black Friday sale on the X Compact?", "time": "11-19-2016 06:13 AM", "replies": [{"postID": "post5605000", "text": "And it dropped another $100 on Amazon (and Best Buy), just for the black and white though (lame). Shocked at this.Deal: Sony Xperia X Compact now costs just $299", "time": "12-12-2016 08:51 PM", "replies": []}]}]}, {"title": "The best small Android phone of 2016?", "thread": [{"postID": "post5389397", "text": "Sony Xperia X Compact hands-on | Android Central\nI love smaller phones. I am not quite particular on the screen size inching closer and closer to hybrid size, and I love that Sony is still looking at making phones below 5\". The only thing I ma somewhat disappointed in is that Sony doesn't seem to have a market in North America. Now, I get that the North American market isn't the only one, but I think it is fair to say that to ignore it is foolish.I truly hope that Sony starts getting in the black. I have said it before, and I'll keep saying it: I don't want OEMs to fall out of the running. I don't want my future choices of smartphone to be a Samsung or an Apple.", "time": "09-02-2016 10:38 PM", "replies": [{"postID": "post5415077", "text": "I agree big time. Now that I finally purchased a Sony Experia X, I am digging it. What an awesome phone. I'm interested in the compact now. I've ask your question too. Why is Sony not popular in the US? Why are they almost frowned upon by all major US carriers. The only option is to buy unlocked like I did. At times I wonder if I should have gotten the performance but I managed to pick up the X model for $199 brand new. Now knowing this phone I would have paid the new retail of $449 for it. Glad I didn't have to but definitely knowing how underrated it is now, I would have bought it for the higher price. Why is Sony not thought of here in the US like the top three or Four companies?", "time": "09-13-2016 07:21 AM", "replies": [{"postID": "post5415262", "text": "Another stumble that Sony has, at least from my point of view, is price points. By the time Sony introduces a phone that I am interested in, once I see the price, I'm like, no thanks.", "time": "09-13-2016 09:11 AM", "replies": []}]}]}, {"postID": "post5395149", "text": "It could be. It's sad that Sony seems to be alone here. I am curious to how well it will review and of course the U.S. price.", "time": "09-04-2016 11:56 PM", "replies": []}, {"postID": "post5409839", "text": "Absolutely. I don't see anyone else releasing a phone of this size for Android anytime soon.", "time": "09-10-2016 07:34 PM", "replies": []}, {"postID": "post5427749", "text": "This phone is set to come out on September 25 in the U.S. too! That is nice, but however, it's $500. Sony Xperia X Compact now available for pre-order in the US for $499.99\nThey are so confused on their pricing. This is just laughable to me. At that price, you can get the 64GB iPhone SE and have a fingerprint sensor and money left over! Lol Sony.", "time": "09-18-2016 01:16 PM", "replies": []}, {"postID": "post5441083", "text": "Sony Xperia X Compact Full Specifications\nMemory and storage\n3GB RAM\n32 GB eMMC*\nUp to 256 GB microSD™ card\nSIM capability\nSingle SIM\nNano SIM\nOperating System : Google™ Android™ M\nProcessor (CPU) : Qualcomm® Snapdragon™ 650, 64-bit processor\nBattery\n2700 mAh\nQnovo Adaptive Charging\nBattery Care\nSTAMINA mode\nQuick Charge\nDurability : Corning® Gorilla® Glass®\nWeight : 135g\nDimensions : 129 x 65 x 9.5 mm\nColour\nMist Blue\nUniverse Black\nWhite\nDisplay and design\n4.6” HD 720p\nTRILUMINOS™ display for mobile\nX-Reality® for mobile picture engine\nDynamic Contrast Enhancement\nMain camera\n23 MP\nTriple image sensing technology\nPredictive Hybrid Autofocus\nFast Capture\nLow-light photo: up to ISO 12800\n1/2.3” Exmor R™ for mobile image sensor\n24mm wide Sony’s award-winning G Lens\n5x Clear Image Zoom\nThe BIONZ® for mobile image-processing engine\nSteadyShot™ with Intelligent Active Mode (5-axis stabilization)\nFull HD video 1080 (60fps)\nHDR photo\nFront camera\n5 MP\n1/5” Exmor R™ for mobile image sensor\nLow-light photo: up to ISO 3200\n25mm wide-angle lens F2.4\nNetworks\nGSM GPRS/EDGE (2G)\nUMTS HSPA+ (3G)\nLTE (4G) Cat 6\nConnectivity\nA-GNSS (GPS + GLONASS)**\nWi-Fi Miracast\nBluetooth® 4.2 wireless technology\nDLNA Certified®\nGoogle Cast™\nNFC\nFingerprint sensor : Fast and secure unlock\nSound\nHigh-Resolution Audio (LPCM, FLAC, ALAC, DSD)\nDSEE HX\nLDAC\nDigital Noise Cancellation\nClear Audio+\nS-Force Front Surround\nStereo recording\nEntertainment: PS4™ Remote Play\nApplications\nMusic\nAlbum\nVideo\nMovie Creator\nSpotify\nNews\nWhat’s New\nSound Photo\nAR Effect\nPrice: $469.00 + $4.77 shipping Right Now on Amazon", "time": "09-23-2016 04:43 AM", "replies": []}, {"postID": "post5470231", "text": "Sony is failing miserably in advertising, PR, design and release schedule for their mobile division. \nThe only explanation that I have for this is that Samsung and apple habe bribed the Sony Mobile CEO to be absolutely useless.", "time": "10-06-2016 02:55 PM", "replies": []}, {"postID": "post5525520", "text": "I really wanted to get the Xperia X Compact, unfortunately it doesn't work on Verizon. Does anyone know of a new android phone that isn't massive? I currently have the Motorola Droid 4 which has a 4\" screen and it's about 5\" tall and about 2.7\" wide and that is good. If it was a little smaller that would be ok with me. However, through Verizon any phone made in the last year or two is like 6+ inches tall and 3+ inches wide. I want a phone not a tablet. Everything small I find is a few years old but I want a new phone because my phone is older so it seems silly to get an old phone. I was hoping to get a quad core close to 4gb of ram like the new massive phones, but maybe that just isn't possible. So any suggestions?", "time": "10-26-2016 01:04 PM", "replies": [{"postID": "post5526686", "text": "Yeah, there's nothing right now really. The Google Pixel (not the XL) is your only choice right now, unless you're willing to go really low and get the Moto g4 play.", "time": "10-26-2016 09:15 PM", "replies": []}]}, {"postID": "post5604401", "text": "I am from South Africa.\nSony is big here with lots of Sony phones from the budget ones right up to the Sony XZ\nBut i have to admit the Sony is very much more expensive for what you can get compared to others.\nSony Xperia Xz\nSony Xperia X\nSony Xperia X Compact\nSony Xperia Z5\nThere is an excellent Sony repair service also here.\nDont know why they dont promote themselves enough in the US. There could be an agreement between the manufactures that also \ncould be the issue.\nWe dont get the Motorola and many of the HTC phones here. We used to but us South Africans are a little weird in some ways.", "time": "12-12-2016 11:50 AM", "replies": []}]}, {"title": "Just noticed, $399.00 today with free shipping", "thread": [{"postID": "post5571416", "text": "Just got a Best Buy note, the X Compact on sale for $399.00 with free shipping. I wonder if it will drop even more on Black Friday? Wouldn't mind paying around $369.00 if it will get that low...", "time": "11-20-2016 05:56 AM", "replies": []}, {"postID": "post5576509", "text": "It's been $399 for a while on Amazon and Best buy. About a month. B&H just recently caught on and they have no tax outside of NY. That's the best bet. I bought a UK version from Clove to get the fingerprint scanner and it was like $410 shipped. I'm very happy with the phone.", "time": "11-23-2016 06:24 AM", "replies": []}]}, {"title": "What is my Sony Xperia X worth if I sold it outright complete being like new?", "thread": [{"postID": "post5568276", "text": "I might be selling my Xperia X and I'm really not sure what a like new in box Xperia X is worth in the US. Anyone have any advice or thoughts on that? Any help or suggestions are definitely welcomed and appreciated.", "time": "11-18-2016 04:05 AM", "replies": []}]}, {"title": "Screen protector for Sony X Compact", "thread": [{"postID": "post5539651", "text": "Hi there - is anyone aware of a screen protector (preferably tempered glass) for the Sony X Compact phone? I've seen a lot of reviews that state that most protectors don't work well with the phone's curved edges?\nThanks!", "time": "11-01-2016 04:10 PM", "replies": [{"postID": "post5540609", "text": "None of the tempered are going to look right. I have the Xperia X and have tried several tempered glass. I assume the compact has the same slightly curved bezel screen. I found the liquid skin by Skinomi to the best out there with full coverage. I dont think you'll find a tempered glass that's going to lie flat on its outer edges anywhere.", "time": "11-02-2016 01:20 AM", "replies": []}]}, {"postID": "post5540688", "text": "Almost all cases, the phone landed on the ground (direct onto the face), once the screen protector cracked, and the whole screen including the actual display failed when the phone was dropped.\nWhy? Let us see, how the screen protector protect the phone. \nA glass protector will spread the impact force onto a much larger area. This act can protect the top glass of the screen protect itself. And both the top glass on your screen and the screen protector have a thin layer of \"glue\", which acts like a shock absorber. So unless an impact goes deep enough so the pressure on the actual screen is too much only the protector should fail, once the protector failed, the screen would crack directly. \nThe other cases, the phone landed on the ground (direct onto the edge of screen protector). In these case, the glass protector failed easily under a little gentle shock. \nSo when we saw a glass protector cracked under a gentle drop without screen shattering, which did not mean glass protector protected our phone well. It mean the truth that glass protector is fragile, it is too easy to crack. \nWhy is it so easy to crack when shocked on the edge of a glass protector?\nFor it can’t spread the impact force onto a much larger area. So it just crack on the edge. Then the whole protector will crack after the edge cracking. \nThat’s the reason for glass screen protectors need to be replaced every time you drop the phone.", "time": "11-02-2016 03:43 AM", "replies": []}, {"postID": "post5542133", "text": "Cool - thanks for the advice.", "time": "11-02-2016 06:27 PM", "replies": []}]}, {"title": "Google history suddenly not showing", "thread": [{"postID": "post5523108", "text": "All of a sudden Google history isn't showing anymore. This is on the search bar and not the history in settings. . Does anyone know why this might be and what I can do about it. \nThanks", "time": "10-25-2016 02:59 PM", "replies": [{"postID": "post5533307", "text": "I'm sure you are signed in to google. I'd sign out clear your history if you want to and sign back in. If you're signed in to chrome as always and nothing as changed then your history should show. Another thing that may have happened is that some how your history was cleared while signed in. This would be the only explanation. Definitely not a software related Sony deal. Something cleared your browsing history and this is in Google settings. I'd sign out and sign back in and go to google settings and see what you have checked in regard to browsing and if it's set to erase history after each use. There is a setting for that on Google I believe", "time": "10-29-2016 07:48 PM", "replies": []}]}]}, {"title": "Found this case for the X and Performance on Amazon this week. Just arrived", "thread": [{"postID": "post5419603", "text": "I was looking the other day for a slim style case in red. Found this one and it is a good one. Coat was around 10 dollars. Fits both the X and Performance.", "time": "09-14-2016 09:22 PM", "replies": []}, {"postID": "post5459295", "text": "Thanks, heading over to Amazon now.", "time": "10-02-2016 08:15 AM", "replies": []}, {"postID": "post5469128", "text": "Will accessories for the performance fit the x", "time": "10-06-2016 08:45 AM", "replies": [{"postID": "post5514741", "text": "Yes anything X Performance will work with the X. Everything I've ordered actually has been for the Performance. I just received a new case for mine this morning. It's so slim and low profile that you can't tell it's on there. I have a frosted white and frosted grey of the same case which also provides full coverage. I also just put a full body skinomi coverage on it with the back piece being a silver carbon fiber. Pretty cool looking.", "time": "10-22-2016 02:14 PM", "replies": []}]}]}, {"title": "Anyone thinking about picking up the Xperia X now that's at the price it should have been?", "thread": [{"postID": "post5501382", "text": "Been seeing the X heavily discounted as of late. I think like 385. That's actually a good price as I've now had a lot of tim", "time": "10-18-2016 01:32 AM", "replies": [{"postID": "post5501386", "text": "Time with mine. It's a good device and now priced well in line of where it should have been starting off.", "time": "10-18-2016 01:33 AM", "replies": []}]}, {"postID": "post5505408", "text": "385.00 for me dconn, white", "time": "10-19-2016 11:35 AM", "replies": []}, {"postID": "post5506803", "text": "Camera is right there with Samsung I think. Just got nice case and glass screen protector, I'm feelin it.", "time": "10-19-2016 07:53 PM", "replies": []}, {"postID": "post5512548", "text": "Took my black X back to best buy, paid 456.00 with tax. Got a white one for 385.00.", "time": "10-21-2016 04:31 PM", "replies": [{"postID": "post5514738", "text": "So you picked up the white version? What do you think? I think the X model is a great phone! Although I got mine for $199, I definitely would have paid 350 to 400 for it. It's a great device.", "time": "10-22-2016 02:11 PM", "replies": []}]}, {"postID": "post5512549", "text": "At Amazon", "time": "10-21-2016 04:31 PM", "replies": []}]}, {"title": "X Compact", "thread": [{"postID": "post5384528", "text": "Android users who prefer a small device which at the same time is of high quality and spec will know how poor the choice has been in recent years. Sony has been one of the go-to manufacturers with their Xperia Z Compact series, and they've done it again with this model. Sony Xperia X Compact hands-on | Android Central", "time": "09-01-2016 02:04 PM", "replies": []}, {"postID": "post5384678", "text": "Glad that they are finally releasing one. We'll see how the price fares though.", "time": "09-01-2016 02:55 PM", "replies": []}, {"postID": "post5384735", "text": "A no compromise small flagship no longer. What a shame. Id never buy this, its not even water proof anymore. Wow", "time": "09-01-2016 03:15 PM", "replies": [{"postID": "post5467399", "text": "It's more affordable though, still has good specs, and from stuff I've read here and there, better in some respects than the Z5 Compact.", "time": "10-05-2016 03:42 PM", "replies": []}]}]}, {"title": "US - fingerprint reader", "thread": [{"postID": "post5441614", "text": "There seems to be some confusion about the fingerprint reader, and that it might be in the US spec. Any ideas?", "time": "09-23-2016 09:40 AM", "replies": []}, {"postID": "post5445706", "text": "It's most likely not there. It isn't on Sony's US website.", "time": "09-25-2016 08:14 AM", "replies": []}, {"postID": "post5448952", "text": "It's fact that it's not activated", "time": "09-26-2016 10:40 PM", "replies": []}]}, {"title": "How can I install a MTP program on my Sony Experia?", "thread": [{"postID": "post5446351", "text": "I cant saves photos anymore.", "time": "09-25-2016 04:22 PM", "replies": []}, {"postID": "post5447065", "text": "Welcome to Android Central! It's not a program--it should be part of the system. When you connect your phone to your computer via USB, swipe down the notification panel on the phone and tap the USB icon. You should be able to select MTP there. If you don't see anything when you swipe down the notification panel, then the cable might be faulty--try a different one.", "time": "09-26-2016 01:45 AM", "replies": []}]}, {"title": "Saved a cropped photo found the original had been deleted. Is there anyway to recover the original?", "thread": [{"postID": "post5431047", "text": "I recently tried to crop a photo on my Sony Xperia using 'Photos' editor and upon saving found the original had been deleted. Is there anyway to recover the original? It hasn't done this before, it seems to have replaced the original with the crop. Help please?", "time": "09-19-2016 08:39 PM", "replies": []}, {"postID": "post5435131", "text": "Welcome to Android Central! Are you talking about the Google Photos app? Select the photo, tap the Edit button, then tap Menu>Undo Edits. That should bring back the original.", "time": "09-21-2016 01:29 AM", "replies": []}]}, {"title": "Snapdragon 650?", "thread": [{"postID": "post5389410", "text": "Do you think this will be an adequate CPU in the Xperia X Compact? It's almost to the point where I am kind of surprised they didn't go with an 801.", "time": "09-02-2016 10:43 PM", "replies": []}, {"postID": "post5390083", "text": "https://www.quora.com/Which-is-bette...Snapdragon-808\nThis doesn't have the latest 820 but the 650 seems to be somewhere between the 808 and 810 with a slightly slower clock speed. Im a noob so this might be wrong.lol but it seems that the 650 would still be faster than the 800/801", "time": "09-03-2016 07:47 AM", "replies": []}, {"postID": "post5391559", "text": "Very good point. I'm kinda lost when it comes to CPUs too, but this may be a situation where clock speed may not matter in this case.", "time": "09-03-2016 04:57 PM", "replies": []}, {"postID": "post5403110", "text": "I'm highly considering this phone. I currently have the Experia X with the 650 processor and it's pretty fast. I don't see that much of a difference actually in my Droid Z Force than my X to be honest. Paper is different than real world. I think it will be a good phone. My only drawback is why didn't they go 1080p on it. I know it's a small screen but 1080p is definitely better real world.", "time": "09-08-2016 04:58 AM", "replies": []}, {"postID": "post5421702", "text": "The 810 in the Xperia Z5C is actually slower than the 650 in the X Compact, why? Because the 810 had to be underclocked to reduce overheating and also power consumption. If you search Youtube there are a couple of comparisions of both devices.", "time": "09-15-2016 05:28 PM", "replies": []}]}, {"title": "Deal of the century! Scored the Experia X for $199, Best Buy", "thread": [{"postID": "post5361937", "text": "So I've struggled with either the XA or X but price difference was what I was unsure of. Due to a faulty XA and poor customer service the other day, the manager gave me an even exchange for the XA to X. That totally eliminated my uncertainty of the more than double price difference in regard to if it was worth it or not. Looking forward to it arriving as it had to be ordered. I hope the XA case and Tempered Glass protector fit the X as I had purchased both for the XA. Anyone know if they are the same fit? I'm terribly new to Sony phones so if anyone has the X, please let me know how you like it. Thanks in advance.", "time": "08-24-2016 12:07 PM", "replies": []}, {"postID": "post5364871", "text": "You are a lucky one! Let us know how you like it.\nThe XA is slightly wider. Your experience actually has me looking into the X, since the XA sounds pretty bad with the battery life.", "time": "08-25-2016 11:02 AM", "replies": []}, {"postID": "post5368696", "text": "I just picked up the X in fact 10 minutes ago from Best buy. I'm still in shock I got this phone got $199. I've read a lot of mixed reviews on it but they were done before the release of the X Performance so much of all the comparisons were to top line flagship phones. This X is a top end mid range phone and my research leads me to find that it's comparable to the iPhone 6s in pretty much all aspects which for me personally, I find to be perfect. I'm about to set it up and will report back shortly if indeed it stands up to compare to the Apple 6s which I happen to know quite deeply. Stand by and I'll be back shortly with a detailed short review of my thoughts. I just knew I liked the XA but I wanted more performance and at $199, it was to me the deal of the century and now I'm rather thrilled that I had the terrible service from Best buy to be able to get this top end X at the low end XA price!!!", "time": "08-26-2016 02:11 PM", "replies": []}, {"postID": "post5369534", "text": "Okay, so I'm a bit concerned. I'm noticing some lag on the internet both on wifi and mobile 4g. My thoughts would have been at least twice as quicker than than the XA. I just did a factory reset and starting over. The X should be on par with the iPhone 6s from my research. No complaints for the $199 price I paid for it. I'm just reporting what I'm experiencing. More to come.", "time": "08-26-2016 07:26 PM", "replies": [{"postID": "post5369540", "text": "That's odd about the lag. Let us know if the reset works.\nSent from mTalk", "time": "08-26-2016 07:29 PM", "replies": []}]}, {"postID": "post5370722", "text": "Seems to be okay. I will definitely say look wise and feel wise, the XA in a subtle way is better than the X. The X is slightly larger as I can see it and feel it. I've not seen or handled the Performance so Im not sure about it. All in all I like the XA better but needed the better performance. That being said, I'm thinking hard on just going all in and getting the performance now and go top end specs. It's just a thought as the X is a better phone than the XA noticeably. The XA had less bezel therfore making it feel much smaller. Kind of odd they make a less or inferior phone feel and look better than the superior double in price X.", "time": "08-27-2016 10:16 AM", "replies": []}, {"postID": "post5386025", "text": "My X all the sudden had touch screen problems two days ago. I thought best buy was going to give me the X performance instead but ended up exchanging it for another X. I'm waiting on it to arrive now. This will be my 4th Sony phone! What's up with their software? I love the X and it's completely fast enough and at the $199 price I got it for its definitely worth that! I just can't grasp three phones with bad software. Two XA and now one X.", "time": "09-02-2016 03:17 AM", "replies": []}]}, {"title": "Is $399 a good deal on the Experia X?", "thread": [{"postID": "post5361038", "text": "I'm about to pull the trigger on this X model over my XA but I'm just torn and new to Sony phones. $399, does this price make it worth paying the extra $200 over my XA?", "time": "08-24-2016 06:15 AM", "replies": []}]}, {"title": "Just ordered the Sony Experia X, taking the XA back. Advice.", "thread": [{"postID": "post5353677", "text": "So is this upgrade noticeable or is it worth her price difference? . Any advice would be greatly appreciated", "time": "08-21-2016 08:59 PM", "replies": []}]}, {"title": "Short cut removal on Samsung Galaxy J2", "thread": [{"postID": "post5330412", "text": "I have an email short cut (not an app) on my home page that I wish to remove and replace with the gmail app how do I do that please.", "time": "08-15-2016 09:23 PM", "replies": []}, {"postID": "post5330641", "text": "I posted this earlier but it would not show my user name so I have reposted.\nI have an email short cut (not an app) on my home page that I wish to remove and replace with the gmail app how do I do that please.", "time": "08-15-2016 11:18 PM", "replies": []}, {"postID": "post5330659", "text": "I mean it seems too simple so I must be missing something. You say shortcut, to the app, to a specific email, to a specific email account...? The obvious answer is to press and hold until remove appears at the top of the screen. Then drag the unwanted item to the trash. To add something open your app drawer and press and hold it until your home screen appears then drop it in the location you'd like, or press and hold the screen in an empty location until add appears, and either add an app or widget. What am I missing? More details please.", "time": "08-15-2016 11:30 PM", "replies": [{"postID": "post5333109", "text": "Thanks that did the trick, This is my first smart phone and I am still trying to sort things out. I looked in the user manual d/l but could only find >edit >select app with minus sign which the email short cut did not have. hope this explains my lack of knowledge.", "time": "08-16-2016 05:00 PM", "replies": []}]}, {"postID": "post5330885", "text": "I merged your threads and moved them to the More Samsung Phones forum (was originally in the Sony Xperia X forum).\nIf you're new to Android, check out this guide: http://forums.androidcentral.com/gen...-lollipop.html", "time": "08-16-2016 02:24 AM", "replies": []}]}, {"title": "SD card works with Samsung Galaxy but will not work with Sony Xperia Aqua M4", "thread": [{"postID": "post5070350", "text": "Hi everyone,\nSandisk class 10 sd card 32gb has no trouble working with my Samsung Galaxy 3 and S3 mini.\nHowever when I try to put it into the Sony Xperia Aqua M4. I am told the SD card is damaged, which is rubbish since when I put it into another phone it works seamlessly?\nAnyone have any idea as to why this doesn't work?", "time": "03-18-2016 03:26 PM", "replies": []}, {"postID": "post5071086", "text": "Welcome to Android Central! Insert the card into your computer and run chkdsk to look for bad sectors: http://forums.androidcentral.com/amb...d-sd-card.html\nDo other SD cards work in the Sony without problem?", "time": "03-18-2016 10:51 PM", "replies": []}, {"postID": "post5071279", "text": "I only have one SD card.\nThe card works fine in all other phones. Just not in the Sony...\nIt's the Sony that's the problem not the card.\nedit: To add the Sony phone is practically new out of the packet, I have also just tried a brand new Sandisk SD card, all working fine with the newest Samsung Galaxy Note as well as other phones, again SD card damaged message comes through on the Sony, it is the Sony that is the problem.", "time": "03-19-2016 02:24 AM", "replies": []}, {"postID": "post5072236", "text": "I agree. Try blowing the SD card slot out with a can of compressed air, in case there's some debris stuck in there. If that doesn't help, it might be a defect--return the phone to the store, or contact Sony.", "time": "03-19-2016 04:01 PM", "replies": []}, {"postID": "post5097339", "text": "Try a different make of sd card, I had an M4 with the same problem using a sandisk card and switched to a kingston.\nPosted via the Android Central App", "time": "03-31-2016 05:16 PM", "replies": []}]}, {"title": "Android Update Now Can't See Notifications On Lock Screen", "thread": [{"postID": "post5066138", "text": "I have an Android OS on my Sony Xperia. I use to be able to see my notifications on my lock screen. Monday evening, Android OS updated, now I cannot see those notifications. 1) How do I find out what Xperia model do I have 2) how do I get my notifications to show on my lock screen? Thanks.", "time": "03-16-2016 07:54 PM", "replies": []}, {"postID": "post5068180", "text": "To find out the model, go to Settings>About Phone, and look for the Model Name/Number.\nFor lockscreen notifications, go to Settings>Sound & Notification and see if there is an option there. It might also be in a Settings>Screen Lock & Security menu. Different manufacturers may arrange their menus differently.", "time": "03-17-2016 05:11 PM", "replies": []}, {"postID": "post5070057", "text": "Thank you and thank you!", "time": "03-18-2016 01:37 PM", "replies": []}]}, {"title": "Unbrick bricked Xperia x10 mini?", "thread": [{"postID": "post5066734", "text": "I know this is a very old phone, but I would like to get this X10 mini up and running again. I followed some steps provided to install a custom recovery to my device, but somehow I rather ended up bricking it. Is there anything I can do or try to unbrick it?", "time": "03-17-2016 03:47 AM", "replies": []}]}, {"title": "Kit kat lock screen app safety", "thread": [{"postID": "post5026633", "text": "Hi, I have a small window in my case which, with kit kat I could view the clock AND who was calling. With lollipop now I can only see half the clock and not who is calling. My kit kat setup was perfect. I have tried installing apps that bring back the kit kat lock screen but they require so many permissions that makes me unsure of how safe they are. Any ideas?", "time": "03-01-2016 11:08 PM", "replies": [{"postID": "post5038856", "text": "Welcome to Android Central!\nI usually take a look at most of the reviews for an app to determine if I want to go with it or not. Just read through them and see what people say about the app.", "time": "03-07-2016 07:24 AM", "replies": []}]}]}, {"title": "The Sony Xperia X", "thread": [{"postID": "post5011771", "text": "This looks like it might be a pretty good device, given the specs. I am curious if this is the new flagship model?Sony Xperia XA, X and X Performance specs | Android Central", "time": "02-23-2016 01:52 PM", "replies": []}]}]
