[{"title": "zenfone 4 restore contacts", "thread": [{"postID": "post6178706", "text": "I backed up my old pone, a zenfone 2, before I ran an update and the phone bricked. I save the backup locally on the SD card and now I want to restore my contacts to my new zenfone 4 max but when I try it keeps prompting me for a google account which I don't have or want. How can I restore my contacts from a file stored locally on my SD card?\nThank You\nAlan", "time": "03-04-2018 09:37 AM", "replies": []}]}, {"title": "Zenfone 4 Max a good deal at $200?", "thread": [{"postID": "post6012136", "text": "I know it has a Snapdragon 430 processor, but I don’t play demanding games on my phone (aside from word and trivia games and Pokémon Go). The unit I saw at Best Buy impressed me, it has a good bright screen, smooth UI, fast dual camera, huge 5000mAh battery, and a sleek metal build. It’s only $200 which is a great deal. What do you guys think?", "time": "10-09-2017 11:05 AM", "replies": []}, {"postID": "post6012705", "text": "think about moto g5s", "time": "10-09-2017 05:10 PM", "replies": []}, {"postID": "post6021929", "text": "I've had the Max for a couple of weeks now. It's the first phone I've ever had that runs lots of apps and actually lasts all day without issue. Beats 4000mah phones hands down.", "time": "10-16-2017 09:09 AM", "replies": []}, {"postID": "post6026094", "text": "I've had this phone for a couple of weeks now as well. It isn't my daily driver just yet, but I'll say that it'd been a good experience. In so far as the value for the price I'd say its a bit tougher to say. I haven't really had any other phones that are typically floating around this price range (Moto E4 Plus, G5 Plus, Axon 7 mini, etc). What I would say is that it really depends on what you are looking for. And by the sounds of it I would say this is probably a good phone for you.\nHere's my pros and cons\n+Great build quality. The phone has a nice weight to it and while it might be too heavy for some, I appreciate that Asus put in a good effort in so far as the build.\n+Have fun trying to kill the battery quickly. Like I said I haven't used this as a daily driver, so I can't say quite how it is day to day, but take this for what you will. \n+Main 13MP camera actually takes some pretty good pictures. Asus does a pretty good job in so far as camera performance in this price range. Camera software is also pretty good as it offers a nice range of shooting modes including a Pro mode. Low light photos, while noisy, can actually come out alright. My one complaint is that there is some overexposure in some spots. But again for the price everything else is fine.\n+Fingerprint sensor is good. I wouldn't say great, but its very accurate. All I'd say is that its just on the slow side in so far as unlocking the device.\n+Asus is on top of their devices with updates. I had a ZF2 and they frequently put out updates for that device. I already got one in the two weeks that I've had this phone. can say how well they'll fair with major software updates, but they do listen to the community and try to address any bugs or performance issues when ever they can.\n=Performance has been good for the most part. The one thing that has bothered me a bit has been scroll performance in certain spots (in particular Chrome). This has improved after the update though, so it hasn't been that much of an issue of late. \n=Earpiece speaker has good volume, but people sound a bit muffled.\n-Screen is ok. Brightness is good, but colors are pretty drab. I guess its tough being that my other phone is a OnePlus X with a great 1080P AMOLED screen. There are certain things that also let you know you are holding a 720P 5.5 inch screen, in particular text and some images. I'd say this is probably the phone's biggest weakness. \n-Secondary rear camera with wide angle lens is just meh. With good lighting you might be able to get a good image, but there's plenty of noise in most images. Pictures also come out a bit darker (honestly not surprising since the aperture is smaller at f/2.2 v f/2 for the main camera). I appreciate Asus' effort to bring high end features to lower end devices, but I'd rather have something more useful like laser auto-focus, which they included in one of the lower-end ZF3 phones last year.\n-Speaker is modestly loud, with just a hint of bass. Asus has an outdoor mode that increases the volume, but does away with any bass and sounds shrill at the highest volume levels. \nHere's an album with some of the pictures I've taken with the ZF4Max.: https://photos.app.goo.gl/HV34VmlbL6FM9QRf2", "time": "10-18-2017 04:39 PM", "replies": []}, {"postID": "post6052507", "text": "Disappointing development. The ZF4M got two big scratches. One is fairly deep as well. Not sure what sort of glass is supposed to be on this, but there's no indications on Asus' website. I have a feeling its not Gorilla Glass though because I've had a OPX for a couple years and it doesn't have any scratches that are as deep as the one that is on my ZF4M. Ditto for my Nexus 4 which I used for 2 years and has been rolling around in drawers and shelves for another 2 years. I haven't even been using the ZF4M as my daily driver, so I'm not sure what could have caused these scratches. Screen protector for the ZF4M is a must.\nShallower scratch: https://photos.app.goo.gl/XcEXxpkMH0yfeycK2\nDeeper scratch: https://photos.app.goo.gl/b70UWct5Bh1jaIzV2", "time": "11-03-2017 04:42 PM", "replies": []}, {"postID": "post6160636", "text": "Yes it is. I like it a lot. I bought it for my girlfriend and I think it is excellent phone for the money.the batter is just insanely good.", "time": "02-12-2018 01:03 AM", "replies": []}, {"postID": "post6160709", "text": "i have it \nit is the best phone for 200 and it has also 5000 mA battery", "time": "02-12-2018 04:15 AM", "replies": []}, {"postID": "post6160838", "text": "This one has been on my radar along with the Honor 7x, but I can't figure out which bands are on the 3GB/32GB variant. Looking for Bands 2/4/12/17 for AT&T.", "time": "02-12-2018 08:51 AM", "replies": []}]}, {"title": "Zenfone 4 with snapdragon 660 in Canada", "thread": [{"postID": "post6160637", "text": "Where can I buy it. 660 with 6Gb of ram. All the ones I seen are 630 with 4gb of ram", "time": "02-12-2018 01:05 AM", "replies": []}]}, {"title": "Asus Zenfone 4 Max fingerprint sensor question", "thread": [{"postID": "post6096544", "text": "Hello.\nI bought this phone and so far I'm pretty happy with it. It has a fingerprint sensor and I've been thinking of using it. I know in the past some phone manufacturers made the mistake of storing the fingerprints with no encryption. I don't think it's the case with this phone running on Android Nougat but I was wondering if there is any way to for sure that this phone stores the information safely.\nThank you for taking the time to read and respond back.", "time": "12-05-2017 10:20 AM", "replies": []}, {"postID": "post6096641", "text": "Welcome to the forums! You could definitely contact ASUS customer support to see if they have any definitive answers for you. I would think that it would be safely stored (especially since ASUS specialises in computers too); however I would recommend contacting ASUS.", "time": "12-05-2017 11:51 AM", "replies": []}]}, {"title": "Zenfone 4 Max ZC554KL 5000mah battery", "thread": [{"postID": "post5999307", "text": "I picked up a Zenfone 4 Max ZC554KL at Best Buy for $199, and they threw in a $1 Simple Mobile BYOD Sim Card and a $40 Mobile Plan card and knocked $50 off.\nSo far so good, but I'm just putting it into full service. Battery life is really, really good so far - I've had a Blu R1 Plus and a Huawei Mate 8 recently, both with 4000mah batteries, and this is much better in the real world. I use hundreds of apps and Google navigation and am hoping this may finally be a phone that can handle a full day without a charge.\nThe phone has the rare LTE Band 12 (and all the other US GSM bands) which I need for service with MetroPCS. Cases and screen protectors are available on Amazon and AliExpress with a decent variety for a newer phone. So far I haven't noticed any lag to speak of with the octa-core Snapdragon 430 and the 3GB of RAM. I don't game so that doesn't matter.\nThe only things I find missing or annoying are the reversed Micro USB port (larger side to the front/screen) and the lack of 5Ghz Wi-Fi. Beyond that, I might actually keep this phone in service for awhile - the battery life is the key for me, and it will charge okay even without using the 2A factory charger - another plus for my usage. The phone has fast charging and it shows.\nThe Moto E4 Plus is the other phone now available with a 5000mah battery and LTE Band 12, but it's got 2GB of RAM and a Snapdragon 427 Quad-Core, and for the same money the Asus is a better bet for me.", "time": "09-30-2017 08:33 PM", "replies": []}, {"postID": "post5999512", "text": "Thanks for the info! I think ASUS makes good phones -- I enjoyed my ZenFone 2. How's the camera?", "time": "10-01-2017 01:34 AM", "replies": []}, {"postID": "post5999535", "text": "I haven't used it yet... The rear camera is a dual setup with a separate wide angle lens. Reports online are that the cameras are good, not great, which I'd expect at this price point. Will post back after I actually shoot some with it.", "time": "10-01-2017 01:49 AM", "replies": []}, {"postID": "post6003246", "text": "And as expected...good if not great on the camera. The wide angle lens option is nice, but it's only 2MP, so just when really needed.", "time": "10-03-2017 09:55 PM", "replies": []}, {"postID": "post6003320", "text": "The ZenFone 2 was really good for macro photography, since it had a pretty short minimum focus distance (significantly better than the Nexus 6P). How is it with yours?\nOff topic, I wonder what ASUS is going to do for the next generation of ZenFones. The ZenFone 5 was released in 2014, so they can't use that name (unless they call it something really stupid like the ZenFone 5 II -- bad flashbacks of the HTC One Mini 2!).", "time": "10-03-2017 11:37 PM", "replies": []}, {"postID": "post6008019", "text": "Question. Do you get VoLTE? I got one to mess around with as a secondary phone and I was hoping that it'd be able to get VoLTE since it has band 12.", "time": "10-06-2017 04:00 PM", "replies": []}, {"postID": "post6008027", "text": "I have not gotten Wi-Fi Calling to work, and I have switched it on. I have yet to see a report that anyone has it working... A couple of other people have said the same thing.", "time": "10-06-2017 04:05 PM", "replies": []}, {"postID": "post6016437", "text": "Yeah, no luck on my side so far. If the ZenFone 3 Deluxe is anything to go by chances are that the ZF4M probably doesn't support it for T-Mobile or At&t.", "time": "10-12-2017 09:56 AM", "replies": []}, {"postID": "post6028896", "text": "ASUS Taiwan tells me they consider Wi-Fi Calling and VoLTE as seperate, which I never have prior, at least in practice. They have also suggested I check with MetroPCS to see if it's enabled for this phone, which I have no reason to believe it would be through them as it's not a phone sold by MetroPCS or T-Mobile directly. I was of the belief if a phone had wi-fi calling built-in, especially if it was being used with an ASUS router optimized for same, that it would work. I've had unlocked Nexus phones with wi-fi calling enabled that worked without issue.", "time": "10-20-2017 08:38 AM", "replies": []}, {"postID": "post6029108", "text": "If I'm not mistaken, manufacturers usually have to get some sort of approval/certification to be able to do WiFi Calling and VoLTE on T-Mobile. That's what's come up in the past when certain manufacturers list Band 12 on their phones, but no VoLTE on the phone. As a matter of fact:T-Mobile: All Band 12 LTE devices on our network must support VoLTE, E911 | FierceWireless", "time": "10-20-2017 10:56 AM", "replies": []}, {"postID": "post6029140", "text": "I've made an inquiry over at T-Mobile Forums on this, as the phone has service on LTE Band 12. https://support.t-mobile.com/message/618564#618564", "time": "10-20-2017 11:16 AM", "replies": []}, {"postID": "post6029144", "text": "Here's the ASUS support thread for reference:https://www.asus.com/zentalk/forum.p...ead&tid=185396", "time": "10-20-2017 11:17 AM", "replies": []}]}, {"title": "ZenFone 4 range", "thread": [{"postID": "post5926810", "text": "Manufacturers normally offer one or perhaps two versions of their latest device, but Asus has decided that six is right. Namely:\nZenFone 4\nZenFone 4 Pro\nZenFone 4 Max\nZenFone 4 Max Pro\nZenFone 4 Selfie\nZenFone 4 Selfie Pro\nAs you can see, the range really consists of three pairs, so it's not too confusing. The ZenFone 4 Pro is the highest-specced device in the range: a 1080p 5.5\" OLED display; powered by a Snappy 835; 6gb of RAM and a minimum of 64gb of storage; dual cameras, one a 25mm equivalent, the other a 50mm equivalent; and a 3600mAh battery. \nAll will run Android O out of the box, and as a bonus, promise to have much fewer pre-installed apps compared to previous Asus phones.\nSound good so far?", "time": "08-17-2017 03:34 PM", "replies": []}, {"postID": "post5927497", "text": "I like that they are trimming down the OS. But beyond that, I don't get why there needs to be so many variants.", "time": "08-18-2017 08:53 AM", "replies": []}, {"postID": "post5927693", "text": "I think so many variants will just confuse potential customers. Less tech savvy customers might even have difficulty understanding the differences between all those variants.", "time": "08-18-2017 12:37 PM", "replies": []}, {"postID": "post5941888", "text": "Wow, this is a great lineup! And I'm very impressed with the 3600 mAh battery on the Pro! Fantastic!", "time": "08-27-2017 07:25 PM", "replies": [{"postID": "post5975806", "text": "Where is the 5000mah variant? I was going to go pick up a Zenphone3 zoom for that battery alone. But it is now a year old, and since I keep my phones forever, I like to buy from when it is released.", "time": "09-15-2017 07:28 AM", "replies": [{"postID": "post5976842", "text": "Sorry, I'm not sure!", "time": "09-15-2017 04:37 PM", "replies": []}]}]}]}, {"title": "Six variants...is this a little overboard?", "thread": [{"postID": "post5927496", "text": "So this phone series has 6 variants. See here: https://www.androidcentral.com/asus-zenfone-4 \nIs this a bit much? I kind of think so. To break everything down there is a base Zenfone 4, 4 Selfie, and 4 Max, each one with a Pro version. I guess I just don't see why this device should have 6 SKUs.", "time": "08-18-2017 08:53 AM", "replies": []}, {"postID": "post5927697", "text": "I agree. I'm also inclined to believe that less tech savvy customers may not even understand the differences between all those variants.", "time": "08-18-2017 12:39 PM", "replies": []}, {"postID": "post5941885", "text": "Wow, that is a little much. So they all most likely have six different price points. Maybe they also did it this way so they can always have at least a couple of their \"line models\" in stock at once when their demand is high... But that's still a little strange.", "time": "08-27-2017 07:24 PM", "replies": [{"postID": "post5941931", "text": "Maybe it made sense when they came up with the idea...but still. I think there could have been a solution without having 6 different phones.", "time": "08-27-2017 07:49 PM", "replies": [{"postID": "post5941934", "text": "Absolutely! Maybe have three - not six!", "time": "08-27-2017 07:52 PM", "replies": []}]}]}, {"postID": "post5965928", "text": "Six is kind of less. Zenfone 5 to have 11 different variants.", "time": "09-09-2017 11:56 AM", "replies": []}]}, {"title": "ASUS unveils it's new lineup", "thread": [{"postID": "post5927507", "text": "From the blog: https://www.androidcentral.com/asus-zenfone-4-official\nThe Max sports a 5k mAh battery according to GSMArena. At nearly 9 mm thick: Asus Zenfone 4 Max ZC554KL - Full phone specifications\nWhat are your thoughts?", "time": "08-18-2017 09:05 AM", "replies": []}, {"postID": "post5927734", "text": "I'm most excited about the huge battery and their software improvements, ASUS is becoming one of the most trusted OEMs in my honest opinion.", "time": "08-18-2017 01:02 PM", "replies": []}, {"postID": "post5927738", "text": "Ok, a cm thick and about 5000 mAh, that sounds great!", "time": "08-18-2017 01:05 PM", "replies": []}, {"postID": "post5941884", "text": "Hmm I don't know much about the lineup as of now, but it does seem to look good! Gotta do more research on them! I wanted a Zenfone 3 last year and almost pulled the trigger on it... Who knows what will happen this year! Haha.\nAlso, do we know when these phones will be available for purchase? Checked Asus' website and there was no \"where to buy\" option for the 4 Pro (not that I was gonna buy it - I was just looking! 🤣).", "time": "08-27-2017 07:23 PM", "replies": []}]}]
