[{"title": "App isn't installed but it did.", "thread": [{"postID": "post6153217", "text": "I'm using Honor 7x and currently installing several apps such as WhatsApp and Wattpad. It did appear on my homescreen and went well at first but then, when I wanted to click on the icon again, it showed \"App Isn't Installed\". I'd tried to update the app and reboot my device. Well it worked but then it happened again after that. Anyone knows how to fix this? And why does it happen?", "time": "02-03-2018 06:10 AM", "replies": []}]}, {"title": "Huawei Honor 7x Damage", "thread": [{"postID": "post6143930", "text": "I received my Huawei Honor 7x on a Friday. I put a screen protector and phone case on it the same day. As soon as I turned it on I noticed problems. The screen wasn't responsive at times, especially at the bottom of the screen. I thought, well maybe I can deal with it but the problem worsened. On Monday I called their (crappy) customer service to arrange for phone repair and went back to using my old but dependable HTC. Three days and two more phone calls later they finally sent me a shipping label. \nYesterday I got my Honor phone back. A note said they wouldn't repair it because of liquid damage, which also voided the warranty. The phone has had a screen protector and phone case the entire time I've had it, it's never been near water, but the problems started as soon as I used it.\nI'm furious, obviously called them, but there's nothing they will do. The phone evidently was damaged before they even sent it to me and now I've been ripped off. \nMeanwhile, the problems are worse. The phone will not play sound now. I'm furious. \nIs there anything I can do to fix it, or is there anyway to get Huawei to replace it?", "time": "01-23-2018 01:31 PM", "replies": []}, {"postID": "post6144059", "text": "Welcome to Android Central! I moved this from the Honor 7 forum to the Honor 7X forum, just to be specific.\nProbably the only thing you can do is be persistent, and keep calling. Ask for things to be escalated to the next customer service level. Be firm but polite -- don't sound like you're losing your temper, because that will just make them less willing to help. It would have been ideal to take a video of the phone in action as soon as you saw the issue, because the timestamp of the video might have helped show them that you didn't have the phone for very long before the problem started (just something to remember in the future). The problem is that there's no definitive way to prove that the phone wasn't exposed to water while in your possession, so it's essentially your word against theirs.\nWhen you talk to a higher level of customer service, try buttering them up and talk about how excited you were to get your 7X, and how you were hoping to continue using Honor products in the future. Ask them if there's anything they can do to help you remain a Huawei/Honor customer. Good luck!", "time": "01-23-2018 04:20 PM", "replies": []}]}, {"title": "Honor 7 How to disable mobile data package and re-enable mobile data?", "thread": [{"postID": "post6115813", "text": "I'm currently vacationing in the UK (I'm from Finland) and I was using roaming data whenever I was out of Wifi range. I figured I'd put in a limit so my bill wouldn't be astronomical so I used the mobile data settings to put in 1GB. Since the phone calculates used data per month instead of when the package was put in I quickly got to the max and my phone cut off mobile data altogether. Now even when I turn it on it won't connect. I've tried rebooting, setting the limit higher, changing the setting to notify me after the package is exceeded and resetting the network settings. Nothing works, it just won't connect! There seems to be no way to turn off the package (except resetting the network settings and that didn't help). Please help me fix this soon, it's ruining my Christmas.", "time": "12-23-2017 06:44 AM", "replies": []}, {"postID": "post6116156", "text": "Just unchecking the \"Set mobile data limit\" box should re-enable mobile data.", "time": "12-23-2017 02:14 PM", "replies": [{"postID": "post6116770", "text": "Unfortunately there is no box to check or uncheck... After the limit has been set I can only alter the limit, I can't even set it at zero. There wasn't a box to check to start with and there isn't one after it has been set.\nI ended up restoring factory settings to fix this and even that didn't help.", "time": "12-24-2017 07:29 AM", "replies": []}]}, {"postID": "post6116247", "text": "Also, you should shut off background data on all apps that you don't need to sync, to help reduce your data usage.", "time": "12-23-2017 04:52 PM", "replies": []}, {"postID": "post6118653", "text": "Update: I'm getting a feeling this isn't about the data limit at all. Today I tried texting and calling and neither worked! I have sufficient reception (3-4 bars) and my phone says there is none. For my operator, 60 euros per month is the automatic limit for roaming buildup and once you've got the limit they send you a text. I've used data for less than 2 euros and haven't made any calls or sent any texts. I'm taking my phone in for service once I get home, but this really ruined my holiday.", "time": "12-26-2017 04:16 PM", "replies": []}]}, {"title": "Can you disable the \"do not cover the top of your phone\" msg?", "thread": [{"postID": "post4924066", "text": "My son has an Honor 7 and wants to wear it in a plastic/elastic armband when he goes for a jog. But when he puts the phone in the plastic case, he gets the message \"do not cover the top of the screen - Make sure the screen is clean - You can also press the power and volume buttons to disable this mode\". But this does not help. Any suggestions?", "time": "12-30-2015 02:37 PM", "replies": [{"postID": "post4929549", "text": "I'm very interested knowing that too.", "time": "01-03-2016 02:49 AM", "replies": []}, {"postID": "post6049314", "text": "just disable Settings -> Accessibility - Palm rejection - turn off", "time": "11-01-2017 05:59 PM", "replies": []}]}, {"postID": "post4961679", "text": "Yeah, have same problem. I just turn off blocking but still when I want to change something on phone then I need to fold back top of armband. I think it's impossible to change that without root. Or he can use transparent armband.", "time": "01-22-2016 10:02 AM", "replies": []}, {"postID": "post5225150", "text": "So would I.\nIt's a really really really annoying feature that some muppet of a developer decided to design in.\nI have a transparent armband, and a transparent bike case, and it still does it.\nIt's also a pain with the buttons on my P8 to disable it EVERY ********** time GRRRR! :-", "time": "06-15-2016 09:49 AM", "replies": []}, {"postID": "post5230401", "text": "Go into Settings, click Smart assistance and inactivate Touch-disable mode\nPosted via the Android Central App", "time": "06-19-2016 03:10 AM", "replies": []}, {"postID": "post5657483", "text": "The feature is supposed to be for when you have it in your pocket or in a bag so that you don't butt dial somebody or so it doesn't change your settings or call somebody or charge your account that's what it's for and you can disable that is called touch in your settings so that \"Muppet\" of a developer actually cure the but the problem other than having a phone lock on or a password cuz a lot of people don't do that we ain't got nothing to hide we put the locks on our PayPal XD you would have been thanking that \"muppet\" like 10 years ago", "time": "01-26-2017 10:24 AM", "replies": []}, {"postID": "post5670054", "text": "I tried the \"settings\" and click smart assist- but I do not have a smart assist option in my settings.. \nIs their any other way I can do this?", "time": "02-07-2017 01:43 AM", "replies": []}, {"postID": "post5693149", "text": "\"Smart assist\" is just the title of that group of settings selections (on my phone at least). For me the switch to turn it off is the \"More...\" selection under the smart assist heading.", "time": "02-27-2017 01:34 PM", "replies": []}, {"postID": "post5700938", "text": "Simultaneously hold the power, and the volume up buttons a few times to disable! :-)", "time": "03-06-2017 06:00 AM", "replies": []}, {"postID": "post5727642", "text": "Yeah, I'm having this issue too. It wasn't a big deal before but now, it started doing it when its in my bike's phone mount.\nMy phone mount doesn't even cover much of the top. Just the corners of the phone. I kinda need out to map check for my courier work.", "time": "03-27-2017 12:19 PM", "replies": [{"postID": "post5819987", "text": "do as me\npray for me ^_^", "time": "05-18-2017 01:40 PM", "replies": []}]}, {"postID": "post5727650", "text": "I think I just found it. I'm using a huawei y3ii and under accessibility, I found anti-inadvertently function. Turned it off and now I'm free again.", "time": "03-27-2017 12:25 PM", "replies": []}, {"postID": "post5820127", "text": "Smart assistance>> More >> Touch-disable mode", "time": "05-18-2017 03:55 PM", "replies": []}, {"postID": "post6053747", "text": "If you have a Huawei Y6 Elite and want to turn off the touch-disable mode.... Go to Settings < Smart Assistance < More < turn off touch-disabled mode. Once you have done this restart your phone or it won't disable. :-)", "time": "11-04-2017 01:16 PM", "replies": [{"postID": "post6054692", "text": "I have the same issue. I don't know why the phone entered the Touch Mode and now even if I restart it or pus simultaneous the volume and power button still remains in that mood.\nThanks!", "time": "11-05-2017 05:07 AM", "replies": []}]}]}, {"title": "Can I root LEM-21 without data loss using kingroot desktop app?", "thread": [{"postID": "post5963695", "text": "So I wanted to root my Huawei Honor 7 Lite, but the problem was that kingroot android app just wint do it, there's no get root button, so I wanted to know, will using the desktop kingroot app wil try to unlock my phone's bootloader, because I read somewhere that if I try to unlock the bootloader, it would wipe my phone's data, but I dont really want to loose it, also I used kingroot app on 2 diffirent phones before, and it worked perfectly.", "time": "09-08-2017 07:16 AM", "replies": []}, {"postID": "post5963957", "text": "I've never had to use kingroot, but if the desktop program has to unlock the bootloader, then yes, it will wipe the device.", "time": "09-08-2017 09:50 AM", "replies": []}, {"postID": "post5963964", "text": "Well it would be nice to know if it unlocks the bootloader. EDIT: I just realized that there is KingRoot and kingoroot diffirent apps.", "time": "09-08-2017 09:56 AM", "replies": []}, {"postID": "post5964040", "text": "So I tried using KingoRoot to root my phone, and it failed, I also tried using the android root app, it failed too. What do I do to make it root?", "time": "09-08-2017 10:30 AM", "replies": []}, {"postID": "post5964236", "text": "Magisk is much much better than kingoroot.", "time": "09-08-2017 12:05 PM", "replies": []}, {"postID": "post5964422", "text": "I need a way of not unlocking bootloader and flashing custom recoveries. Also magisk wont help because it needs a phone with root, or a custom recovery, which i dont have any of these, also, here's a tip, read everything, because you missed a lot of details here, did you even read the title of this question?", "time": "09-08-2017 01:38 PM", "replies": [{"postID": "post5964488", "text": "Mod note: there is no need to be rude. It's easy to overlook part of a post.\nIf you need a custom recovery installed, there is no way of getting around unlocking the bootloader. At least not that I am aware of.", "time": "09-08-2017 02:08 PM", "replies": []}]}, {"postID": "post5964496", "text": "Personally, I dont feel that I need a custom recovery installed, because I dont plan on doing any stuff like flashing other systems and such, I just need to root my phone. I tried using Framaroot but it did not find any exploits on my phone.", "time": "09-08-2017 02:11 PM", "replies": [{"postID": "post5964497", "text": "The custom recovery is most likely needed to flash the superuser file.", "time": "09-08-2017 02:12 PM", "replies": []}]}, {"postID": "post5964501", "text": "Oh well, that will means I wont root my phone.", "time": "09-08-2017 02:14 PM", "replies": []}, {"postID": "post5964505", "text": "What do you need root access for?", "time": "09-08-2017 02:17 PM", "replies": []}, {"postID": "post5964513", "text": "It's going to be very difficult to root a modern phone without an unlocked bootloader and customer recovery due to several changes Google has made to Android starting with version 5. Specifically one of the big changes is that to make the necessary modifications to the system image to have the thing boot, you need a modified boot image... that isn't something you'll do with an app.\nIf you can load an app and clicky click unlock and root it... a malicious app can do the same thing without you having any idea.", "time": "09-08-2017 02:20 PM", "replies": []}, {"postID": "post5964662", "text": "If only data loss wouldnt be a problem when unlocking bootloader, i might do it.", "time": "09-08-2017 03:48 PM", "replies": []}]}, {"title": "Can I use a UK PAC code to transfer my number to a French mobile provider?", "thread": [{"postID": "post5889740", "text": "So here goes.\nI have an Honor 7 phone (which has a dual sim slot). I had a UK sim with 3 on a contract and was using that in my phone in London. I have recently moved to France and tried to insert a new sim in the other slot. I failed to do that and in the process the original sim appears to be damaged.\nAfter lengthy discussions with 3 I'm going to cancel the contract and I have my PAC code from them. So ideally I would like to be in a situation where I can do the following:\n1. Keep my UK number and have a pay as you go sim.\n2. Have a French number and a cheap contract or pay as you go sim.\nIs this even possible?!\nThank you so much for any help on this. I have until this Saturday to get it together.", "time": "07-18-2017 11:07 AM", "replies": []}]}, {"title": "Smart key error", "thread": [{"postID": "post5869802", "text": "Having received the phone a few days ago most everything seems fine after completing a factory reset.\nThis is my first attempt to set the honor 7 smart key up.\nSelecting:settings / Smart assistance / Smart key\nresults in the following message:Smart key error\nThis app does not have the necessary permissions needed to run. Please check your permission settings.\nI've looked around but can't find where to do this - short of a factory reset any advice would be appreciated.", "time": "07-01-2017 09:18 AM", "replies": []}, {"postID": "post5869929", "text": "Try going to your app manager and select that app and try to give it all permissions that it is requesting", "time": "07-01-2017 11:07 AM", "replies": []}, {"postID": "post5869959", "text": "Thanks.\nIn settings / Apps there does not seem to be any app with a name that is obviously related to the Smart key. \nHowever, on the basis the message is related to a Huawei app, I selected: \nHuawei Mobile Services (which had Permissions listed as \"No permissions granted\") & enabled all permissions - result for the smart key = no difference.", "time": "07-01-2017 11:31 AM", "replies": []}]}, {"title": "Why won't Huawei Honor 7 Lite be recognized by my computer?", "thread": [{"postID": "post5861841", "text": "So I have Huawei Honor 7 Lite phone, and I wanted to move some files from the phone to the PC, but I couldn't do that. All the time it's just recognizing My CD Drive with Huawei HiSuite installer on it. I tried installing Huawei HiSuite, but it still didn't work, neither the phone got recognized by it. I've tried many times switching HDB and ADB on and off, and only one time it worked, but the files i needed weren't there. I am running windows 10 64bit, the phone is running Android 7.0 Nougat. Oh and also, why can't I access the cat collection minigame on the phone, on my old phone with custom firmware it worked.", "time": "06-24-2017 07:57 AM", "replies": []}, {"postID": "post5862843", "text": "When you connect via USB, swipe the notification panel down and tap the USB icon -- make sure it's set to MTP.\nThe Android easter eggs don't always show up -- it depends on the manufacturer. Huawei presumably removed it in their build.", "time": "06-25-2017 10:53 AM", "replies": []}]}, {"title": "How to hide videos", "thread": [{"postID": "post5854709", "text": "I downloaed some video s of actress how to hide from gallery", "time": "06-18-2017 10:24 AM", "replies": []}, {"postID": "post5854792", "text": "Download a file manager app from the Play Store and use it to create a new, separate folder for videos, and any other multimedia files you don't want to indexed and cataloged by apps like the Gallery app. Create a new file in this new folder and name it '.nomedia' (no quotes) The file type isn't an issue, it's the file name in this situation that's the key. Anyway, any media apps that auto-scan folders for media content will skip any folder with a .nomedia file in it.\nAs for a good file manager, if you're rooted I recommend Root Explorer. If not,. take a look at Solid Explorer or File Expert.", "time": "06-18-2017 12:22 PM", "replies": []}]}, {"title": "Headphones not working with Honor 7 Lite", "thread": [{"postID": "post5816024", "text": "My headphones, wich are for my xbox one, used to work on my phone before the new EMUI 5.0 upgrade. After the upgrade, it doesen't connect to my phone, but they are not broken, I have used them on my xbox. The weird thing is, thar I have another set of xbox headphones, but they are connected to the xbox with a stick. They are connected to my phone with a removable cable. The headphones need recharge if it is important. I think the problem is within the new upgrade on my phone, but I don't know how to fix it. If someone knows what to do, please reply.", "time": "05-15-2017 04:32 PM", "replies": []}]}, {"title": "my huawei honor 7 dual sim issue", "thread": [{"postID": "post5788516", "text": "hi!\ni'm facing a weird problem with dual sim network. sim 1 or sim 2 whichever is assigned with 2g/3g/4g option gets cellular network only and the remaining one shows 'emergency calls only'. assuming that this is an software issue, i've changed the rom using HiSuite; but the problem yet prevails! the phone was okay for last around a year and this issue just happened couple of days back...\nis there any solution/suggestion to get rid of the problem? thanks in advance!", "time": "04-27-2017 03:01 PM", "replies": []}]}, {"title": "How to delete theme wallpapers", "thread": [{"postID": "post5694123", "text": "So I installed some themes but I didnt like them so I uninstalled them. However the wallpapers from those themes are still in my phone and I cant find them anywhere except if I try to zoom out in my homescreen and press wallpapers, it lets me choose from: gallery, wallpaper or one of these wallpapers I got from the themes. Those wallpapers are rotating as my backround like a slide show and I want to do it with different pictures so I want to get rid of those pictures. My phone is Huawei Honor 7 lite", "time": "02-28-2017 10:15 AM", "replies": []}]}, {"title": "Cannot connect to Google servers error after factory reset", "thread": [{"postID": "post5639885", "text": "Hi all, I thought this could be useful for those who like me have looked for a solution to this problem.\nThree days ago I had to carry out a factory reset on my Honor 7 (PLK-1) Android 6.0 smarphone. The result of it was that I couldn't sign into my Google account anymore. The message I was getting after typing in my credentials and agreeing to Google's policies was \"Cannot connect to Google servers. Please try later.\" My smarphone was unable to comunicate with google. A true nightmare, as you may imagine. Unfortunately, nothing of what I found on the net was applicable to my phone.\nHowever, I won't be annoying you with what troubleshooting steps did not  work. I'd like to share WHAT WORKED in my case.\nFrom Settings-Apps I opened one by one the\n*Google app (Launcher)\n*Gmail app\n*Google Play services app\n*Google Play store app\nand \n1. Cleared the cache\n2.Under \"Manage space\" hit \"Clear Google Search data\" and \"Clear all data\"\nTurned the phone off and on (not \"restart\")\nand marvelously everything started running as it should! \nI was finaly able to sign into my Google account, Sync my Gmail, Calendar, Maps, Apps ect. \nI hope this article will help you out. If it does, please let me know. Or if you have had any other solution, please add it here.\nCheers and good luck!", "time": "01-11-2017 10:34 AM", "replies": []}, {"postID": "post5640255", "text": "Welcome to Android Central, and thanks for the tip!", "time": "01-11-2017 03:24 PM", "replies": []}, {"postID": "post5659694", "text": "Great post!\nBut, what if this message comes before you install the phone?\nIn other words: I gave my phone a factory reset, when it boots the first time, I have to choose a language, then connect to WiFi and after that it'll check my internet connection. It then says 'Cannot connect or communicate with Google servers' and offers me to try again later. It doesn't let me proceed to boot the phone, which is quite annoying as I can't use my phone now.\nAny ideas?", "time": "01-28-2017 10:20 AM", "replies": []}, {"postID": "post5659775", "text": "Found a solution: take out the simcard, reboot and try again.", "time": "01-28-2017 11:28 AM", "replies": []}]}, {"title": "Allocating SMS alerts (not ringtones) for contacts with Emotion UI...?", "thread": [{"postID": "post5610913", "text": "Hi guys.\nI want to allocate SMS alerts tones (not ringtones) to specific contacts with my Honor 7: can I do this?\nSamsung’s TouchWiz, has an option to add a message alert to contacts, i.e. “Add another field >message alert”. However, Emotion has no such option. Those available with EMUI are portrayed in the screenshots, where it can be seen no facility to add a specific message alert to a contact exists. \nIf this can't be done via the OS can anyone recomend an app (other than Ringo which doesn't work) which can allow specific alerts/message tones to be allocated to individual contacts?\nThanks in advance for any help. \nHonor 7\nAndroid 6.0\nEmotion 4.0.1Attachment 248314Attachment 248315", "time": "12-17-2016 04:48 AM", "replies": []}, {"postID": "post5621289", "text": "Hi, there! Unfortunately, I do not think these options are available via Emotion's UI. How do you feel about changing your stock messaging app? I feel like Textra had a setting in which you could apply different notification tones to different contacts, and you could also reset the process on all contacts if you wish to start over. Good luck!", "time": "12-26-2016 08:49 AM", "replies": []}]}, {"title": "New huawei x2/from the box/home screen does not rotate/ everithing else rotate/PLEASE HELP", "thread": [{"postID": "post4812659", "text": "Hi people \nHi , I bought a brand new Huawei X2 Honor , 7 inch ,32 GB, 3GB RAM, GOLD , from Ainol- novo - a website I buy second time now from - the first thing a bouth was mediapad m2 , 8 inch phablet - perfect condition , work as a lightning - I am so happy with it !!! \nPackaging and everything was perfect ....\nUntil I powerd on the phablet!!!!\nEveritnig seems to work ok, until I want it to turn it in landscape mode!!!\nOn PAGES landscape mode WON'T WORK!!!!\nEverywhere else landscape mode work normal\nAuto-rotate screen is turn ON!!!!\nI had nothing installd on the device!!!\nI did 3 times- the 3 different ways of factory reset!!!! NOTHING HELPT !!!! \nThe google play was already installd \nThen I installd from google Play store the app -Screen Rotation Control.\nWhen I turn the auto mode of landscape mode, pages are now rotating.....,\nBut the DOCK apps, one of which is Dialer and Contacts, are disappearing !!!\nIt is only one app moving to the right side on the landscape mode screen!!! The rest are gone!!!\nAlso now the layout of the pages in landscape mode is too low !!! \nThe dots showing that number of pages are behind the bottom line of the page !!!\nIt is clearly a defect in the software!!!! So - called BUG !!!!\nThe phablet is on Android version 5.1.1\nBuild number GEM- 703LV100R001C233 B109 - this is the last up to date update as we are 08/nov/ 2015 of today\nIt was the same remaining problem with the 3 previous build numbers\nThe last 3 build numbers I instal in a matter of couple of minutes .\nEach time I instal a new build number after minute or two it was a new one available !!!\nThen I uninstall the app and instal onother one - Rotation Locker -again rotate the home screen, but again with missing apps from it!!!! Again BUGS \nANYONE please help\nThank you very much in advance and have a nice day", "time": "11-08-2015 04:37 AM", "replies": []}, {"postID": "post5617653", "text": "I have the same problem. Any progress?", "time": "12-22-2016 02:10 PM", "replies": []}]}, {"title": "My running app randomly stops working on Honor 7", "thread": [{"postID": "post5452593", "text": "I bought an Honor 7 back in July, and ever since then my running apps randomly stop working. It almost never works for longer than a couple of hours or so (my last three sessions cut out after 63, 102 & 89 mins), and then it just stops without any warning. \nI'm not sure what the phone was delivered with, but it has now updated itself to Android 6.0. It didn't work before the update and it doesn't work now. I'm 99% sure that this isn't an issue where it can't find a GPS, as my previous phone had no problems and I haven't changed my routes. The GPS always seems to be picking up strong signals.\nIt has been suggested on other sites that it might be the power manager turning my app off, but the running apps I use are protected. I can't see a way of turning off the power manager to test that theory out.\nDoes anyone have any suggestions? Other than ditch the phone and go back to my old one.", "time": "09-28-2016 02:47 PM", "replies": []}, {"postID": "post5454348", "text": "Welcome to Android Central! Which apps are doing this? Are they running in the foreground or background?", "time": "09-29-2016 12:25 PM", "replies": []}, {"postID": "post5454837", "text": "Hi! I use Runkeeper mainly, but I've tried it with Google Fit too and it still failed after about 70/90 mins. I've tried it running in the foreground and the background, but it doesn't make a difference. I'm really just looking for any ideas to try, which will be gratefully received.", "time": "09-29-2016 03:46 PM", "replies": []}, {"postID": "post5455209", "text": "Any other 3rd party battery-saver apps installed? Or a carrier-branded app that either the carrier installed or you installed?", "time": "09-29-2016 07:11 PM", "replies": []}]}, {"title": "Apps \"reset\" after a while", "thread": [{"postID": "post5422758", "text": "Say I'm browsing imgur or some other website and I'm at a certain point, a specific image or place in a text/article. If I minimize the app or open another app, after a couple of minutes or when I turn my screen off and on again, the website or imgur or whatever will have \"reset\", meaning it's back to the front page and not at the picture I was looking at last, or top of the article I was reading instead of the middle of the page where I left off. Does anyone have any idea why this happens and if it's possible to turn off? Thanks.", "time": "09-16-2016 02:34 AM", "replies": []}, {"postID": "post5425058", "text": "Welcome to Android Central! It might have to do with Huawei's aggressive RAM management. Look in Settings>Advanced Settings>Battery Manager>Protected Apps, and make sure the browser is Protected. If it isn't, then it's prone to being closed quickly by the system in order to \"clean RAM\" (the utility of which I always question, because this isn't how Android was designed).", "time": "09-17-2016 02:31 AM", "replies": []}]}, {"title": "Honor 6 stuck in a infinite restarting loop", "thread": [{"postID": "post5410440", "text": "hey guys! \nso i was trying to unbrick my phone and I used the MULTITOOL-instructions for it but after I applied the different img's my phone got stuck in this restarting infinite loop. Holding down the +- buttons for the fastboot screen doesnt work either because it just keeps on restarting. Connecting it to the PC doesnt work since it wont recognize it. so please can somebody help me? (dont want to buy a new phone  )", "time": "09-11-2016 04:26 AM", "replies": []}]}, {"title": "accessibility permissions", "thread": [{"postID": "post5319918", "text": "Simple problem, I just can't find the cm security or clean master app in the accessibility app perm list. I can find any other app there\nPosted via the Android Central App", "time": "08-12-2016 03:02 PM", "replies": []}]}, {"title": "HELP!!! - Phone reset whilst updating - HELP!!!", "thread": [{"postID": "post5312175", "text": "Hi,\nMy phone is the Honor 7, previously running EMUI 3.1, now running a dodgy EMUI 4.\nThe back story; (For additional information)\nI wanted to get the new EMUI 4 update on my phone, but needed to update to B180 from B121. This update would constantly fail at 10%. I figured this was due to the 'root' I had on my device. However, this was a partial-root as some things would work and some things wouldn't. I originally rooted my phone with KingRoot. I could not un-root my device with superuser, SuperSU or KingRoot. I tried to install a custom recovery but that failed. I came across a thread with OTA updates and new 'stock' ROMs for EMUI 3.1 and EMUI 4 for my device specifically (PLK-L01). I downloaded this and followed the instructions in the provided pdf. I navigated my phone on windows and copied the entire internal storage to a folder named 'Backup'.I also used  to make a copy of 'all' my phones files - once the command ran it spent 5 minutes skipping 'special files'. I took out my SD card and backed this up too, in a folder called 'SD_Backup'. I formatted my SD card ready for the update file.\nI placed the update.app into the /dload folder on my SD card and typed  and selected Software Upgrade, SDCard Upgrade, OK. The phone promptly rebooted and booted into the update screen. The update went swimmingly until 100% where it flashed Done, then Software Install Failed. The phone automatically rebooted and I was greeted with a setup screen, asking for my prefered language. I figured it had worked, but then to my horror none of my apps were there and all my files had been wiped. I was distraught and still am.\nI after checking the backups after the reset I have found that most, if not all the folders were empty from my 'Internal Storage' backup. I am not too bothered about losing my apps as most of these are cloud apps, however I am most worried about my contacts and messages. I am not installing any apps as of yet, in my knowledge the files haven't been overwritten yet so technically they're still recoverable? I had a lot of contacts that took time to get and knowing my status, it will be difficult to get them back. Additionally, some apps, like the camera, have updated to bring a whole host of new features to the Honor 7, however the music app has not, I do not have 'Screen Candy' or 'Protective Eye Mode' which are shown on the offical EMUI 4 features website here\nSo the questions;\nHow to recover my contacts and/or messages? (Google, helpful as always, did NOT backup my contacts or messages)\nHow to recover apps that were 'installed on SD card'? (As all SD card data is, hopefully, intact)\nHow to update settings and other appropiate apps?\nWHY THE FLIPPING HELL DID THE UPDATE WIPE MY PHONE?!\nIs there any way to recover anything at all? \nThanks so much for reading all of that,\nJake", "time": "08-09-2016 05:32 PM", "replies": []}]}, {"title": "Hi, the side button of my honor 6 plus has stopped working. cant switch it on.", "thread": [{"postID": "post5286410", "text": "Hi, the side button of my honor 6 plus has stopped working. cant switch it on. is there any way to deal with this, will it get switched on once it is 100% charged? the side button has stopped working, tried many times.", "time": "07-28-2016 01:27 AM", "replies": []}, {"postID": "post5287524", "text": "Welcome to Android Central! If it doesn't power on after pressing and holding for 10-15 seconds, then it could be a faulty power button, a dead battery, or a faulty motherboard. You'll have to bring it to repair shop to figure out the exact problem.", "time": "07-28-2016 04:04 PM", "replies": []}]}, {"title": "MMS pictures white screen", "thread": [{"postID": "post5263738", "text": "So whenever i get a picture sent from another phone and i try to open it my screen goes White and a play button appears at the bottom of the screen and a display showing 6 / 10 seconds. anyone know what might be wrong and how i can properly display Pictures on my phone?", "time": "07-13-2016 05:34 PM", "replies": []}]}, {"title": "stock smart headphone controls not working", "thread": [{"postID": "post5139501", "text": "Ever since I cleared the notification for the smart headphones by error all they do now is pause the track. The volume keys do nothing?\nAny ideas how to fix?\nThanks\nPosted via the Android Central App", "time": "04-21-2016 06:36 PM", "replies": []}]}, {"title": "How do you add or remove items from the pull-down notification panel on the Honor 7?", "thread": [{"postID": "post5138035", "text": "As per the title how can I add or remove items from the notification panel? In other Android 5 phones it's easy enough but I can't find the settings in the H7.", "time": "04-21-2016 03:27 AM", "replies": []}, {"postID": "post5139495", "text": "Pull down notification bar, click shortcuts then scroll to bottom of shortcuts and you'll see edit \nPosted via the Android Central App", "time": "04-21-2016 06:33 PM", "replies": []}]}, {"title": "Google monthly security updates", "thread": [{"postID": "post5109939", "text": "Hi! \nWould you know if honor is providing the Google monthly security updates on a regular basis for the honor 7 ?\nI would like to buy the international unlocked version of the honor 7 (not sold by a carrier) but I am concerned security leak fixes.\nThx !\nPosted via the Android Central App", "time": "04-07-2016 05:04 AM", "replies": []}]}, {"title": "How can I root my H7 (Marshmallow, build B320)", "thread": [{"postID": "post5075394", "text": "Hi all\nI successfully updated my H7 to Marshmallow & build B320 (EMUI 4.0)\nI could after that install the chinese version of TRWP (2.8 I think, available on most tutos on how to install custom recovery and root)\nHowever, impossible to root my device, despite using several Update-superSU versions which either :\n- put the phone in bootloop\n- put the phone on blackscreen after the boot logo\n- went to completion, phone started but superSU app says \"no root installed\"\nhas anyone succeeded in rooting on the same config ?\nThrough which method ?\nThanks for any help!", "time": "03-21-2016 09:58 AM", "replies": []}]}, {"title": "Honor 7 Marshmallow Review", "thread": [{"postID": "post4974590", "text": "Hi guys. I was thinking of buying the Honor 7. It has started receiving the Marshmallow update in UK and India. Can anyone with the phone and the update post their review of the MM update?\nCovering things like new UI changes, performance/battery/camera improvements etc. Screenshots would be great, thanks.", "time": "01-31-2016 05:05 AM", "replies": []}, {"postID": "post4976960", "text": "I'm not sure about other UK Honor 7 owners but I am yet to receive my MM update.", "time": "02-01-2016 03:42 PM", "replies": [{"postID": "post4981548", "text": "My apologies, I wasn't clear. It was available as a beta test in UK:You can now beta test the Honor 7 Marshmallow update in the UK | Android Central\nNot sure if the update in India was kind of a soak test, as the listing for the phone shows as Upgradeable to MM in Feb:Honor 7 is getting Android 6.0 Marshmallow update in India | Android Central\nAnyway, let us know if you get the update\nEdit: The update in India was a beta test.", "time": "02-04-2016 04:07 AM", "replies": []}]}, {"postID": "post4993723", "text": "Well, looks like there aren't many AC readers using Honor 7. Or they haven't downloaded the beta MM update.", "time": "02-12-2016 03:39 AM", "replies": []}, {"postID": "post4993724", "text": "How are you finding the phone? I'm thinking of buying it, just because I want to try something else than stock Android.", "time": "02-12-2016 03:40 AM", "replies": []}, {"postID": "post5005308", "text": "I picked the phone up yesterday, for that exact reason - I was interested to try a Chinese phone, so far I love it - it's a bit different coming from stock Android, but it's a welcome change. My past few phones have been the Nexus 6, Nexus 5x and Moto X Style so going to something totally different is refreshing. \nI'll give it a couple of days and report back on performance etc.", "time": "02-20-2016 07:38 AM", "replies": [{"postID": "post5036218", "text": "Thanks for the response. I bought it and am liking it so far. My past phones were also stock-ish - Moto X and OnePlus One. \nSo far, the 7 seems good- great screen and battery life, good performance, decent cameras. Will have to play more with some EMUI themes now \nMy phone should get MM in the next week. It has already started rolling out in India. Will post a review once I get it.", "time": "03-06-2016 05:04 AM", "replies": []}]}, {"postID": "post5025796", "text": "Had my honor 7 for a little over a week and all is very well indeed. Good battery life ans for coming from always had a 5.5 screen is still plenty big enough at 5.2 for videos , etc. It's always responsive and the MIUI needs a bit of getting used to, but so what once you know your way around ir does the job perfectly well. The fast charge is just that, very fast in a few mins you get 30/40% charge if not more (depends what you do or don't have running). Huawei just needs to come good with their promise of MM in March, bring it on!\nPosted via the Android Central App", "time": "03-01-2016 03:01 PM", "replies": []}, {"postID": "post5059918", "text": "No MM for me either, also based in UK\nPosted via the Android Central App", "time": "03-14-2016 03:20 PM", "replies": []}]}, {"title": "Googly Play Services using 70 % of the battery", "thread": [{"postID": "post5036183", "text": "Is there any way to fix this, I have minimal if any apps running and the phone is in sleep mode most of the time. Any advice would be apprecaited. I have checked on the phone to see if there are any updates to download and there are none.\nCheers", "time": "03-06-2016 03:59 AM", "replies": []}]}, {"title": "EU Marshmallow update release date?", "thread": [{"postID": "post5028475", "text": "Last I saw it was the end of February but we're into March now. Anyone know what the new release date is please?\nPosted via the Android Central App", "time": "03-02-2016 05:51 PM", "replies": []}, {"postID": "post5028524", "text": "Apparently they don't even know!", "time": "03-02-2016 06:23 PM", "replies": []}]}, {"title": "Restore data from PC?", "thread": [{"postID": "post5026941", "text": "Hello. I've backed up my Messages and Contacts to PC and now after formatting my phone can't get it back. How can I do it besides using MobileGo? Its Honor 7 and isn't rooted. Backup files are in .xml. Thank you.", "time": "03-02-2016 04:50 AM", "replies": []}, {"postID": "post5027649", "text": "Which phone are you using?", "time": "03-02-2016 11:32 AM", "replies": []}]}]
[{"title": "Call forwarding", "thread": [{"postID": "post5005763", "text": "Hi my Honor 7 keeps going direct to answer phone , how do i de select call forwarding , think it may be my works phone that is at work right now somehow sending my calls to each phone the wrong way round for instance when i phone my works number it too goes direct to answer phone ??", "time": "02-20-2016 02:02 PM", "replies": []}]}, {"title": "Honor 7 notifications", "thread": [{"postID": "post5005619", "text": "So I just upgraded to this phone and all is well, love it! But, I'm having major issues with notifications. Facebook, Messenger and Whatsapp all have issues. Messenger works, sometimes and Facebook and Whatsapp just don't work. Checking the apps in power saving I've made sure they're protected to not turn off, notification manager I've checked to make sure notifications are on and also do not disturb isn't on. In App manager I've made sure notifications are set to on also and on the apps themselves I've checked to make sure notifications are on so I think I've covered all bases but nope, nothing.\nPosted via the Android Central App", "time": "02-20-2016 11:34 AM", "replies": []}, {"postID": "post5005621", "text": "The only way to check I've had a reply is to physically open the app which is so poor. Surely this isn't right.\nPosted via the Android Central App", "time": "02-20-2016 11:36 AM", "replies": []}]}, {"title": "Suddenly any media play slightly faster?", "thread": [{"postID": "post4970031", "text": "Hello, since yesterday my Honor 7 started to play music, videos, and also streaming videos/music slighlty faster than normal, let's say it is x1.2.\nI can notice this also looking at the timing bar in player, seconds flow faster than real seconds.\nLast days I was playing a bit with Tasker doing some batches for GPS and location, but i think this cant be the cause. Would be nonsense.\nI searched a lot around the web and found lot of people having this kind of problem, but not exactly this one, they found their device playing a lot faster (i.e. 2x, 3x, chipmunkie style). So i couldn't find any solution for now.\nI am on LLP 5.0.1, unlocked, twrp, rooted.\nAny help is really appreciated!\nThanks!", "time": "01-28-2016 04:53 AM", "replies": []}, {"postID": "post5005310", "text": "Did you find any solution to your issue? I haven't noticed this, but I've only had it 12 hours  does the issue happen with the stock video and music player on the phone or does it happen with any media content regardless of the playback software?", "time": "02-20-2016 07:40 AM", "replies": [{"postID": "post5005361", "text": "Dunno everything is magically back to normal", "time": "02-20-2016 08:24 AM", "replies": []}]}, {"postID": "post5005456", "text": "Brilliant :-)\nPosted via the Android Central App", "time": "02-20-2016 09:33 AM", "replies": []}]}, {"title": "What does Octa core mean?", "thread": [{"postID": "post4643917", "text": "Ok so I am so new to phones. I am getting the Huawei Honor 7 and I want to know what Octa Core means? Please don't be mean......", "time": "08-28-2015 09:09 AM", "replies": []}, {"postID": "post4961701", "text": "It just means that processor (phones \"brain\") have eight cores so it can make 8 tasks simultaneously. In another words - it's faster and you can turn on more apps on it without noticing much efficiency loss.", "time": "01-22-2016 10:19 AM", "replies": []}, {"postID": "post5005311", "text": "Taken from Google - The terms octa-core and quad-core denote the number of processor cores in a CPU. Octa is eight, quad is four. So far, so obvious. But the key difference between the two – at least when talking about mobile chips in 2015 – is how these processor cores are set up.", "time": "02-20-2016 07:41 AM", "replies": []}]}, {"title": "How can I get my contacts onto it?", "thread": [{"postID": "post4644004", "text": "How can I get my contacts onto my Huawei Honor 7? I have a flip phone and no Google Contacts. Will I have to type them in one at a time or can transfer them over Bluetooth?", "time": "08-28-2015 09:46 AM", "replies": []}, {"postID": "post4961698", "text": "I depends how old flip phone you have. You can use contacts app from google store to import them to PC and then to Honor OR hope that they will be imported from sim card. Again - it depends on what flip phone do you have.", "time": "01-22-2016 10:17 AM", "replies": []}]}, {"title": "Honor 7 - Is Emotion UI a let down", "thread": [{"postID": "post4915964", "text": "i am really impressed with the specs and display of honor 7 and planning to consider it over oneplus 2. However i am seeing online that the EMUI is a let down . I have never used an android before and i dont want my first time experience to be let down by a below par android customized os. Please suggest me if Honor 7 software would be good enough or should i think of oneplus 2 ?", "time": "12-26-2015 08:30 AM", "replies": []}, {"postID": "post4916471", "text": "Welcome to Android Central! I don't have a phone with EMUI, but from my understanding, part of the dissatisfaction is with how they try to make it work like iOS. There's less ability to customize your homescreen (for example, I think all app shortcut icons must appear on the homescreen, as opposed to having a separate App Drawer).\nBut you can easily get past this by installing an alternate launcher like Google Now Launcher or Nova Launcher.", "time": "12-26-2015 02:31 PM", "replies": []}, {"postID": "post4961696", "text": "Tbh - I love it. And I've never been apple fan. Everything looks clear, is easy to find and manage. I've had some problems with making new folders, but fast google fixed it (you have to just pull one icon on another). I can recommend it, it's really advantage not disadvantage.", "time": "01-22-2016 10:15 AM", "replies": []}]}, {"title": "What size sim card can I put in it?", "thread": [{"postID": "post4643936", "text": "What size sim card can I put in the Huawei Honor 7? Is there an unlimited size of space I can input into it?", "time": "08-28-2015 09:18 AM", "replies": []}, {"postID": "post4961691", "text": "Nope, just nanosims.", "time": "01-22-2016 10:12 AM", "replies": []}]}, {"title": "Can I make it into a hotspot?", "thread": [{"postID": "post4643950", "text": "Can I make the Huawei Honor 7 into a hotspot? If so, how?", "time": "08-28-2015 09:26 AM", "replies": []}, {"postID": "post4961690", "text": "Yes, just use top menu and turn on icon \"Sharing wifi point\"", "time": "01-22-2016 10:12 AM", "replies": []}]}, {"title": "Is this an Android product?", "thread": [{"postID": "post4643937", "text": "Is the Huawei Honor 7 an Android product? If not, how do I get an Android OS on it?", "time": "08-28-2015 09:20 AM", "replies": []}, {"postID": "post4643962", "text": "Yes it does. \nFrom the blog: 'The Honor 7 runs Huawei's EMUI 3.1 software atop Android 5.0'http://www.androidcentral.com/honor-7-review", "time": "08-28-2015 09:35 AM", "replies": []}, {"postID": "post4961689", "text": "Yep, android, but be aware! It's very IPhone looking! It has folders instead of menu with apps like other android phones.", "time": "01-22-2016 10:11 AM", "replies": []}]}, {"title": "What is a good case for it?", "thread": [{"postID": "post4644011", "text": "What is a good, strong, sturdy case for the Huawei Honor 7? I need something that will withstand a toddler! Thanks", "time": "08-28-2015 09:48 AM", "replies": []}, {"postID": "post4961688", "text": "I use oxygen series case (just find adequate one) and highly recommend it. It has rubber inside preventing phone to overheat.", "time": "01-22-2016 10:11 AM", "replies": []}]}, {"title": "So is it a tablet or a phone?", "thread": [{"postID": "post4643953", "text": "Is the Huawei Honor 7 a phone or a tablet? I have heard some call it a phablet and some call it a phone. So which is it?", "time": "08-28-2015 09:30 AM", "replies": []}, {"postID": "post4644182", "text": "I would consider it a phone. My personal classification of hybrid is anything 5.5\" and above.", "time": "08-28-2015 10:48 AM", "replies": []}, {"postID": "post4961686", "text": "Yea, totally a phone. Is completely something different than galaxy note.", "time": "01-22-2016 10:08 AM", "replies": []}]}, {"title": "Can someone find me this wallpaper?", "thread": [{"postID": "post4875581", "text": "Can't find this anywhere on the net and unfortunately you can only set this as a lock screen background within the phone! Thanks, Gary.", "time": "12-05-2015 04:44 PM", "replies": []}, {"postID": "post4875603", "text": "Gee, I can't find it either.", "time": "12-05-2015 04:58 PM", "replies": []}, {"postID": "post4875623", "text": "lol, I was having major issues trying to get that screenshot to upload!", "time": "12-05-2015 05:09 PM", "replies": []}, {"postID": "post4961685", "text": "Sorry, couldn't find it :/ Just found something like that:", "time": "01-22-2016 10:08 AM", "replies": []}]}, {"title": "The new Huawei Honor 7", "thread": [{"postID": "post4641620", "text": "Featuring a 5.2\" display, 3 GB RAM, 3100 battery, and 16 GB internal storage. Seems to be ok...It might depend greatly on how much space the ROM takes.\nFrom the blog: Honor 7 review | Android Central", "time": "08-27-2015 11:49 AM", "replies": []}, {"postID": "post4946848", "text": "Cool... looks really interesting!", "time": "01-12-2016 11:45 PM", "replies": []}]}, {"title": "Why am I not able to change storage settings?", "thread": [{"postID": "post4936671", "text": "i want to change the storage setting form internal to external storage how to do this?\nand we can download android apps from pc and use it in mobile?", "time": "01-07-2016 08:30 AM", "replies": []}, {"postID": "post4936771", "text": "The OS may be limiting you from setting the storage location to the SD card. What are you trying to put there?", "time": "01-07-2016 09:30 AM", "replies": []}]}, {"title": "How can I reinstall my OS to Huawei Honor 7?", "thread": [{"postID": "post4923651", "text": "I have a rooted Huawei Honor 7. I accidentally wiped everything.", "time": "12-30-2015 10:58 AM", "replies": []}, {"postID": "post4923662", "text": "http://forums.androidcentral.com/sho...d.php?t=627142\nPosted via the Android Central App", "time": "12-30-2015 11:01 AM", "replies": []}]}, {"title": "Why are apps installing automatically without permission of administration?", "thread": [{"postID": "post4817847", "text": "apps installed automatically and those apps become system apps in my howai honer phone.", "time": "11-10-2015 09:13 AM", "replies": []}, {"postID": "post4817853", "text": "Are you experiencing something like this? http://forums.androidcentral.com/sho...d.php?t=606384", "time": "11-10-2015 09:15 AM", "replies": []}, {"postID": "post4883632", "text": "Looks you rooted ur devices", "time": "12-09-2015 08:03 PM", "replies": []}]}, {"title": "My Huawei Honor Holly phone has a white screen and it turns off automatically, how can I get the pics off of the phone?", "thread": [{"postID": "post4742345", "text": "when i was using my phone it stucked and the screen was running fast.after few seconds it turned off.then i again switched it on.again the same thing happened and now i can't switch it on.it displays only a white screen when i try turning on it.i want to get the pics saved to phone memory.i tried to connect it to my pc.but a message popped out saying that the device is not working.is there any way to get those pics?please help me.", "time": "10-11-2015 09:17 AM", "replies": []}, {"postID": "post4742421", "text": "The challenge is if you can't get the phone into any type of bootable or recovery mode it will be a challenge to get the data back. Here are a couple threads on similar challenges in recovering data on a dead phone.http://forums.androidcentral.com/t-g...ead-phone.htmlhttp://forums.androidcentral.com/htc...ck-5-days.html", "time": "10-11-2015 09:56 AM", "replies": []}]}, {"title": "Does it have Google Play installed already?", "thread": [{"postID": "post4642319", "text": "Does the Huawei Honor 7 have Google Play services installed already? If not, is this something that is easy to install?", "time": "08-27-2015 04:01 PM", "replies": []}, {"postID": "post4642398", "text": "Yes, Google Play Store comes preinstalled.", "time": "08-27-2015 04:28 PM", "replies": []}, {"postID": "post4709385", "text": "How is the camera quality compared to the huawei p8 specially at low light conditions?", "time": "09-26-2015 06:40 AM", "replies": []}, {"postID": "post4727394", "text": "The P8 camera is better at low light conditions than the H7 camera since the P8 camera has OIS. The H7 camera is better at normal to good light conditions as detail is a lot better due to higher resolution. I use both of the two phones but prefer the H7 now due to better detail.", "time": "10-03-2015 11:35 PM", "replies": []}]}, {"title": "Why can't I change my ringtone using audio profiles in Huawei Honor Holly ul-19?", "thread": [{"postID": "post4678620", "text": "i have huwai honor holly ul-19 phone from the last month i not able to change the ringtone using audio profiles, and with music player i can change but it is for both sims, any body have got any idea about this issue. regards,\nudayan", "time": "09-12-2015 12:13 AM", "replies": []}]}, {"title": "How big is it?", "thread": [{"postID": "post4643963", "text": "How big is the Huawei Honor 7? I don't care for huge bulky phones.", "time": "08-28-2015 09:35 AM", "replies": []}, {"postID": "post4644179", "text": "Please do not spam the boards with the same questions over and over. Please use your existing thread.http://forums.androidcentral.com/hua...let-phone.html\nThanks.", "time": "08-28-2015 10:44 AM", "replies": []}]}, {"title": "When will the 64 gb version be available?", "thread": [{"postID": "post4643990", "text": "When will the 64gb version of the Huawei Honor 7 be available? The more space the better!", "time": "08-28-2015 09:43 AM", "replies": []}]}, {"title": "Does it support the Arabic language?", "thread": [{"postID": "post4643958", "text": "Does the Huawei Honor 7 support the Arabic language? I would like to know this before making a purchase. Thanks", "time": "08-28-2015 09:33 AM", "replies": []}]}, {"title": "What network does it work with in the US?", "thread": [{"postID": "post4643946", "text": "What network does the Huawei Honor 7 work on? Are there multiple networks it can go on or a specific one?", "time": "08-28-2015 09:24 AM", "replies": []}]}, {"title": "Which model should I get, is there a big difference?", "thread": [{"postID": "post4643930", "text": "Which model of the Huawei Honor 7 should I get? I heard there are 3 different models. Would I be able to choose which model I get or are they each on different carriers?", "time": "08-28-2015 09:15 AM", "replies": []}]}, {"title": "Is this something I can root?", "thread": [{"postID": "post4643910", "text": "Can I root the Huawei Honor 7? How can I do this?", "time": "08-28-2015 09:05 AM", "replies": []}]}, {"title": "Will it be Windows 10 ready?", "thread": [{"postID": "post4643904", "text": "Will the Huawei Honor 7 be Windows 10 ready? I like the Windows 10 look and feel and would like to get it on it.", "time": "08-28-2015 09:03 AM", "replies": []}]}, {"title": "Can I put a sim card in it and use my mobile data on it?", "thread": [{"postID": "post4642304", "text": "I am considering getting the Huawei Honor 7, if I put my sim card into it can I use my mobile data on it?", "time": "08-27-2015 03:56 PM", "replies": []}, {"postID": "post4643215", "text": "If the phone is compatible with the SIM card's carrier network, and if you have a data plan on that carrier, then yes.", "time": "08-27-2015 11:50 PM", "replies": []}]}, {"title": "Where is the charging port?", "thread": [{"postID": "post4642310", "text": "One the Huawei Honor 7, where is the charging port?", "time": "08-27-2015 03:58 PM", "replies": []}, {"postID": "post4643213", "text": "The image on this site shows a microUSB port at the usual location, the bottom of the phone: Huawei Honor 7 Review", "time": "08-27-2015 11:48 PM", "replies": []}]}, {"title": "Can I get Apple Music on it?", "thread": [{"postID": "post4642325", "text": "Can I get Apple Music on the Huawei Honor 7? Do I need to put an iOS system on it to get it?", "time": "08-27-2015 04:03 PM", "replies": []}, {"postID": "post4643203", "text": "Welcome to Android Central! No and no. Unlike Google, Apple doesn't open up its ecosystem to other platforms very readily.", "time": "08-27-2015 11:45 PM", "replies": []}, {"postID": "post4643212", "text": "You can when Apple releases the app on Android this fall. Has a three month free trial \nSent from my Note 4 using Tapatalk", "time": "08-27-2015 11:48 PM", "replies": []}]}, {"title": "Can it take a Micro-SD Card?", "thread": [{"postID": "post4642316", "text": "Does the Huawei Honor 7 take a Micro-SD Card? I wold like to use a spare that I have instead of having to buy a new one altogether.", "time": "08-27-2015 03:59 PM", "replies": []}, {"postID": "post4643207", "text": "Yes. Huawei Honor 7 - Full phone specifications", "time": "08-27-2015 11:47 PM", "replies": []}]}]
[{"title": "What OS system does it come with?", "thread": [{"postID": "post4642330", "text": "What OS does the Huawei Honor 7 come with? KitKat, Lollipop? Does it even come with an Android OS?", "time": "08-27-2015 04:05 PM", "replies": []}, {"postID": "post4642396", "text": "Duplicate. Check here. http://forums.androidcentral.com/sho...d.php?t=572950", "time": "08-27-2015 04:27 PM", "replies": []}]}]
