[{"text": "2 1080p displays, not even amoled, and yet only a 3180 mAh battery?!? I imagine battery life must be terrible.", "date": "01 Apr 2018"}, {"text": "Is not japanese, is chinese!! Find first some info, bub", "date": "04 Mar 2018"}, {"text": "It's 12.2mm in folded state, it has two displays. Just think of it as the Nintendo DS of phones.", "date": "04 Mar 2018"}, {"text": "The primary camera is also the secondary camera, you just flip the phone around to use it", "date": "14 Feb 2018"}, {"text": "What about this one's secondary cam? Here it has mentioned as no.", "date": "05 Feb 2018"}, {"text": "Or you could have a spare screen if one cracks lol", "date": "26 Jan 2018"}, {"text": "Hi guys, ive been currently using this phone since the 20th when it out. I got the chinese model where it has better specs which comes in 6gb of ram with 128gb of storage. If you are planning to get this phone you might as well pick up the 128gb of storage with the 6gbs of ram. Due people using this phone more as a tablet i think having the bigger storage and more ram will help you run this phone a lot smoother. Overall been using this phone for a few days. Its not amazing but its truly unique. does turn a lot of heads. Overall the phone was built for the Chinese market. So anyone who is living in china or hongkong or taiwan will probably love this phone. the game pad and stuff will work amazing with the local big moba games like &#29579;&#32773;&#33635;&#32768;­. Probably wont run as smooth and wont be able to utilized the game pad on the dual screen when playing game from the overseas google playstore. Camera is alright not amazing but i would prefer them having two cameras one on each screen then just having one on the main. It gets really annoying when using it to scan QR code or when you are taking any pictures. It does take some getting use to. Another issue i had with the phone is probably the finger print sensor. Its definitely not in a good spot and pretty hard to use. they should have just made the finger print sensor on the bottom of the main screen when they have so much bezel space. Other then that the phone is decently made not really Ergonomically friendly but you will get use to it slowly. I see people using this more as a secondary phone or a tablet  that would be easy to carry out that doesn't take up a lot of space. ", "date": "24 Jan 2018"}, {"text": "Is Japanese serviceable?", "date": "21 Jan 2018"}, {"text": "It was a fun device to look at. I checked it out at my local bestbuy and the camera is very very good. My only concern is now you have to worry about getting 2 screens instead of 1 cracked.", "date": "21 Jan 2018"}, {"text": "What are the bands this provider uses? if it matchs. it does.", "date": "13 Jan 2018"}, {"text": "Sigh. not compatible with my country... I really wanted one. T_T \r\n(my country uses LTE bands 1,3,5. (2100/1800/850)", "date": "13 Jan 2018"}, {"text": "does it work on freedom mobile in canada?", "date": "18 Dec 2017"}, {"text": "How do I get one I live in Canada", "date": "26 Nov 2017"}, {"text": "Even in a small rectangular device with few buttons, there are many possible layouts and design choices. What we are missing is a universal grammar to describe those forms.  Then it would be possible to: \r\n(1) Iteratively list all possible configurations \r\n(2) Evaluate each according to formal criteria, and score appropriately (depending on which criteria you prefer). \r\nIf we had this formal grammar, I wouldn't need to make the following point, as it would follow naturally from the evaluation of the design options. \r\nIn this particular case, this type of screen-size-doubling concept is just what I'd like, EXCEPT that I want it to close with the screens on the INSIDE, so they are protected, and so that closure defines a \"screen/power off\".  That means that your screen(s) are physically protected, and that your software is also protected from randomly triggering in your pocket.   \r\nThese were some of the key attractions of the old flip-phones, which some people love so much.  Its a very reassuring feeling to close a flip phone and know that you can't scratch your screen and that you have definitely finished the call and finished using the software (till you open it again). \r\nHaving the screens close on the outside, as in the Axon M, means you can use tent mode to play to someone sat opposite you - which is something I'll use if I ever have a 90 year old friend (that doesn't own a smartphone) who has the same taste in movies sat opposite me. In other words, not very often. \r\nScreens on the outside also means that you only need one camera (and a few other things ... but a 2nd camera is small and cheap, so that should not dictate a fundamental design decision. \r\nWe need to all get away, somehow, from these design issues becoming a kind of personal vendetta, and instead see each device as reflecting the optimum of a preferred set of criteria.  You don't see people arguing in restaurants about whether cheesecake is better than chocolate cake.  Different things work for different people in different circumstances.", "date": "25 Nov 2017"}, {"text": "Very original design!!! like Xiaomi Mi Mix!!! when I saw this phone, reminds me NEC Medias Dual-screen", "date": "23 Nov 2017"}, {"text": " I like your comment here. What's your opinion of Samsungs W (flip smartphone line) series?", "date": "22 Nov 2017"}, {"text": "nice concept and different phone, something new for a change.....Hope they develop this concept it certainly have more pontential. ", "date": "21 Nov 2017"}, {"text": "Please, let smartphones have their diversity, there's no need for every OEM to follow the bezel-less trend.", "date": "21 Nov 2017"}, {"text": "Most of you don't understand that the display can extend out to two displays. ZTE could've easily jumped onto the mainstream train with the bezel-less display and curved ergonomics, but instead they chose to stay away from mainstream and focused more on innovating, and I like it. I personally love this bulky metal rectangular design that pays homage to the iPhone 4's aesthetics, reminds me of a time where smartphones were more simple looking and less showy.\n \r\nEDIT: Okay maybe it would've been nice to see a bezel-less variant, but I like this too, gives me nostalgic vibes.", "date": "21 Nov 2017"}, {"text": "Lol it's not a mainstream device. It's meant for a niche market obviously. If you can comprehend that. ", "date": "20 Nov 2017"}, {"text": "Because this is a wholly better and more optimized execution, also you're pedantic and contrarian. ", "date": "19 Nov 2017"}, {"text": "R u kidding me.................... 12.2mm", "date": "19 Nov 2017"}, {"text": "ZTE Axon M is proving an innovation, yeah though it also already ever produced with Kyocera Echo but this has new design and also OS Nougat support, it will more futuristic if maybe 2018 later, hope dual screen with bezel-less display, HDR 10, 3D touch, Face ID/AI, 18:9 ratio, 5.5 inches, ip68 certificate. don't know later what it's ZTE, Samsung, LG, HTC, Xiaomi, Oneplus, Motorola, Kyocera, Asus, Nokia, Blackberry or iPhone.", "date": "18 Nov 2017"}, {"text": "Love those \"tiny\" bezels", "date": "17 Nov 2017"}, {"text": "This phone looks pretty good, and I'll probably end up getting one.  For those referring to the Kyocera Echo, think more Docomo Medias W.  It definitely has some of the same features and no doubt took inspiration from there.  I have the Docomo Medias W and have been wishing for an upgraded version to come along.  2 screens definitely come in handy at times.", "date": "16 Nov 2017"}, {"text": "Comparing this to the Kyocera Echo is like comparing Android 2.3 to Android 7.0. If you are someone that never appreciates the android split screen feature, move along, this is not for you. If you do use the split screen feature you are going to love this because now you get to run two apps fully opened on their own display screens. I see they have a car mount for it. I'm so sick of split screening my music app and google maps when driving on a split screen. ", "date": "15 Nov 2017"}, {"text": "The ZTE Axon M is basically an updated version of the Kyocera Echo, which was considered one of the worst phones of all time. Also, why has (almost) everyone forgotten about the Kyocera Echo?", "date": "08 Nov 2017"}, {"text": "Tnx ZTE for this feature but this year is for bezel-less screens, i think a new phone from ZTE at the end of this year with 2 screens, bezel less, new specs, a big battery, will be great and will be the 2018 fashion. ", "date": "04 Nov 2017"}, {"text": "People areoften brainless we cant do anything with that. ", "date": "01 Nov 2017"}, {"text": "iPhone X has specs close if not similar to the Galaxy S6 & people are willing to pay $1200 for a 2015 phone.", "date": "31 Oct 2017"}, {"text": "Man Snap 821 is from July 2016 so its more than a year old.  \r\nI know its not too much but anway a 700 eur phone should be much better, ", "date": "31 Oct 2017"}, {"text": "Damn dat price for last years SoC..... Better get a SoC 835 instead.", "date": "31 Oct 2017"}, {"text": "get your facts right. the CPU is from 2016. it was the PREVIOUS CPU that you considered glorious. RAM was still quite mandatory as 4 GB in 2016. so again. I do agree though that the thickness. when folded is HUGE. but considering one screen is 9mm and the other is 3.2 then it makes sense tho.", "date": "31 Oct 2017"}, {"text": "That M stands for mediocre? Or middle range? \r\nBecause price is too high for its specs.  \r\n700 eur for a phone with specs of 2014-15 WTF", "date": "21 Oct 2017"}, {"text": "Two things, I would assume, drives any market... Demand and innovation... \r\nAfter a device as impressive as Axon 7, this is a serious let down... \r\nDemand part, I am trying to picture someone who would want that and for what? \r\nInnovation part, you can have little tiny hinges with double sides tape and tape two iPhone SE, 5s to other square phones and it would look much better than this and probably do more. \r\nI heard from somewhere M stands for multitasking... What Android 6 midrange or above phone is not capable of running multitasking? \r\nI do not see anything outside the box here in regards of neither the hardware nor the software. \r\nPersonally, I think my LG v20's second screen is more packed with innovations than this one. And, I also personally think, I would only embarrass myself if I buy this phone.", "date": "20 Oct 2017"}, {"text": "Haha!! This cheap thing won't even compare to Microsoft's upcoming foldable Surface Phone running Windows Core OS!:)", "date": "20 Oct 2017"}, {"text": "This is not 10 inch screen", "date": "19 Oct 2017"}, {"text": "LOL. 1.5 hours of screen(s) on time...", "date": "19 Oct 2017"}, {"text": "a 10 inch display with 3100 mAh battery. It will not even last you half a day of battery life. ", "date": "19 Oct 2017"}, {"text": "Kyocera Echo???", "date": "18 Oct 2017"}, {"text": "lol", "date": "18 Oct 2017"}, {"text": "designed by sony in japan assembled by zte in china", "date": "18 Oct 2017"}, {"text": "Sony, is that you?", "date": "18 Oct 2017"}]