[{"text": "Only P10 plus have stereo sound..", "date": "09 Apr 2018"}, {"text": "Does this phone support stereo sound, because Huawei say it does, but i don't know how to enable it", "date": "08 Apr 2018"}, {"text": "It's been with me now almost one year... I m changing it now and buying v10... I loved p10 no doubt its a very good device still in love &#128525;, no hang, only the battery issue but its alright due to its fast charging available.. Oreo is here and after oreo update battery is improved ", "date": "08 Apr 2018"}, {"text": "Already released EMUI 8 ", "date": "08 Apr 2018"}, {"text": "no oreo update ... no OTA .... shame on you Huawei .", "date": "07 Apr 2018"}, {"text": "Oreo update? ", "date": "07 Apr 2018"}, {"text": "Any pros and cons for Oreo?  Not sure if I want to upgrade.  On XDA forum I see some people go back to Nougat.", "date": "05 Apr 2018"}, {"text": "philippines here. still no update (postpaid user). any help please", "date": "05 Apr 2018"}, {"text": "this is fixed in the Oreo update", "date": "05 Apr 2018"}, {"text": "There is no comparison here, P10 hands down. The P10 is comparable to XZ1. The XA1 is comparable to P10 lite.", "date": "05 Apr 2018"}, {"text": "I've had this phone for 3 months now, it's really nice and great value (if you're buying in KSA, bec. I don't know its price elsewhere), I compared its camera to other phones of the same price or higher (Nokia 8, LG G6, even Sony XZ1) and the P10 wins. Before it, I had the Samsung Galaxy S8, I must say the S8 has a much better screen and its camera is much better in low light as well, but I like the P10's camera more in good light!! Speed wise it's comparable to the Samsung, but I feel it's slightly faster. I like Huawei's software more though, easier to manage and the fpr on huawei wipes the floor with Samsung, on my S8 it would sometimes take it 3-5 times to recognize my finger.", "date": "05 Apr 2018"}, {"text": "Yes I got in KSA about a week ago", "date": "05 Apr 2018"}, {"text": "Try turn off OIS", "date": "05 Apr 2018"}, {"text": "I still dont have oreo update im from macedonia too", "date": "05 Apr 2018"}, {"text": "Forgot to tell.\n \r\nThe pictures are just fine. Color og monochrome. \n \r\nMain problem is video. \n \r\nAll pictures and videos are recorded directly to the device. ", "date": "03 Apr 2018"}, {"text": "Does anyone experience bad 1080p 60fps video recording. It's not sharp enough. Its difficult to explain but it looks like its pixelated. \n \r\nIf I record in 4K everything is really sharp.\n \r\nThe P10's 1080p 60fps video is not so sharp as my earlier iPhone SE.\n \r\nWhy is that? \n", "date": "03 Apr 2018"}, {"text": "Updated on 30.03.18. After 3 days using oreo i fell big battery improvement. Well done Huawei. Probably is faster but i can't tell except  before antutu was 124.000 and now is 156.000 ", "date": "02 Apr 2018"}, {"text": "I recived ota oreo update here in Macedonija &#127474;&#127472;. It is L29 version. Everything was very fast. Only 15 min to download 2.6 gb and install.  Super excited. ", "date": "30 Mar 2018"}, {"text": "nokia 8 without doubt\n", "date": "30 Mar 2018"}, {"text": "Anyone get oreo update in Gulf country's ", "date": "28 Mar 2018"}, {"text": "Hi everyone, Im thinking of changing from my iphone 5s for the P10, but Im still not sure because of the lack of upgrades in further years I really praise updates and keeping fresh. So I want to know If I can buy this phone and Install any future customs roms will the dual camera still work well, like wont I see much change with it. I really need to know because this Leica system looks good. So can someone please clear my mind.\n \r\nThank you in advance", "date": "24 Mar 2018"}, {"text": "Is anyone using this phone one year or more? It is good choise to buy? Now I'm using samsung, and I believe samsung and iphone, but this huawei p10 looks me soo good", "date": "23 Mar 2018"}, {"text": "Maybe A8 is worse in the specs, but on P10  the phone makes crashes in apps. That is the most common comment(Not now).", "date": "22 Mar 2018"}, {"text": "Never", "date": "22 Mar 2018"}, {"text": "have you ever tryed to make a master reset Manifacturing settings on the phone is it runs? Did you checked is the secondary SIM MODULE is Working or not? ", "date": "21 Mar 2018"}, {"text": "huawai P10 or sony xperia Xa2?", "date": "20 Mar 2018"}, {"text": "Hi guys m using P10 lite and I'm battling to use my second sim card it doesn't recognize it what can I do please help ", "date": "19 Mar 2018"}, {"text": "in greece i got android 8 and emui 9 in my p10 since 12 of march", "date": "18 Mar 2018"}, {"text": "Hey guys, I'm using P10 Plus. I have updated my P10 plus yesterday by using Huawei firmware finder. It works really well for me. Huawei has done great job. New navigation key is the best. Adjustable resolution will also increase your battery life. let's see..", "date": "16 Mar 2018"}, {"text": "I got it today too.... there is alredy big bug :)    You can't turn off google assistans and \"ok google\" function.  \r\nSettings are gray \"ok google\" still working, even if you turn it off. ", "date": "12 Mar 2018"}, {"text": "My mobile operator is Telekom (Mobitel) and I got update via OTA. ", "date": "09 Mar 2018"}, {"text": "Which is your network operator in Slo? \r\nDid you update via OTA? (not firmware finder itd...) ", "date": "09 Mar 2018"}, {"text": "I got Oreo today (Slovenia). It's practically the same as Nougat, there's no major changes.", "date": "08 Mar 2018"}, {"text": "well i m big fan of huawei. but lite versions cameras re very best against flagship devices. lecia cam is very poor quality in p10. total waste", "date": "08 Mar 2018"}, {"text": "im buy this phone..now my phone cant working.so sad only 2 month.. maybe i make display only in my home", "date": "08 Mar 2018"}, {"text": "This phone or Nokia 8?", "date": "08 Mar 2018"}, {"text": "you can update to oreo using firmware finder app", "date": "06 Mar 2018"}, {"text": "Android P is comming and there is still no official oreo for P10 :) \n", "date": "06 Mar 2018"}, {"text": "its ok. nothing special. 4 hours SOT.", "date": "05 Mar 2018"}, {"text": "Amazing battery, almost 2 days.", "date": "05 Mar 2018"}, {"text": "How is your battery life guys ?\n", "date": "05 Mar 2018"}, {"text": "Well I don't think the OIS is the biggest thing you need", "date": "04 Mar 2018"}, {"text": "Just a quick question..I can't seem to be able to click on the sleep ...it's not lit up to access ..any idea on how to? Is there another button that will high light the sleep ?", "date": "03 Mar 2018"}, {"text": "I had the same problem. I sent it back to Huawei, and they replaced the handset. Sorry to hear about your bad experience. They gave always been very helpful with me. ", "date": "26 Feb 2018"}, {"text": "Ok thank you, I am very grateful for your help. ", "date": "26 Feb 2018"}, {"text": "I have no idea what your problem is with the phone. You should try and be more specific and use more words, build an idea you know , like an adult. \r\nI have the phone for three months and it's working like a charm.  \r\nI'll tell you how I came to buy it. We were at a restaurant/hotel who had very bad reception(and even shittier WIFI) . I had a BB Keyone and the rest had mostly Iphones and we were trying to make calls, send some pictures and browse the web and it was not working for anyone. Except for the guy with a P10. Absolutely amazing reception for voice and data. \r\nIf you think this is worst then a Iphone 5 well you are a troll.", "date": "26 Feb 2018"}, {"text": "Firmware finder for Huawei,  Download from play store. ", "date": "26 Feb 2018"}, {"text": "it must be grateful to P10 this is not just a phone this would be part of your life. super nice and great!", "date": "26 Feb 2018"}, {"text": "Without OIS for this money? haha .. No thenks,...", "date": "25 Feb 2018"}, {"text": "A8 2018 is much better!", "date": "25 Feb 2018"}, {"text": "what app?", "date": "23 Feb 2018"}, {"text": "Someone get 8.0 update, how it looks", "date": "22 Feb 2018"}, {"text": "in 100% low light condition,yes u have to use pro mode to get the best shot", "date": "22 Feb 2018"}, {"text": "The only way of resolving the internet wifi speed is to manually update the device through an app. I had that problem for 8months because Huawei are absolutely useless at software updates in countries like the UK, yet other countries have regular updates. Shocking !!!!", "date": "21 Feb 2018"}, {"text": "What was your best phone ? Nokia 1100 ? How you can say that this is amazing?  Internet is working like a sloth. By the way,  can anyone tell me how to solve this problem, if I can solve it ? My previous phone was iPhone 5, and was a better phone than this one .", "date": "21 Feb 2018"}, {"text": "I bought the P10 because I was attracted to the camera. \r\nHowever, barely 6 months later,  the phone camera couldnÂ\u0092t auto focus any more. \r\nEvery photo is blurry.\n \r\nI brought it down to your service centre at 313 Somerset, Singapore  on 27 Dec 2017,  \r\ntheir customer service told me that the camera is spoilt,  \r\nso they will replace it in mid Jan 2018, when the replacement camera stock arrived.\n \r\nDespite calling to follow up with their service hotline three times. \r\nEach time they told me to wait for another two weeks. \r\nItÂ\u0092s almost two months now and I am still waiting for the replacement part to arrived. \r\nBad phone, terrible customer service. \r\nNever buy Huawei again.\n", "date": "21 Feb 2018"}, {"text": "This or iPhone 7 (Plus)?", "date": "21 Feb 2018"}, {"text": "Thank you for the advice. I'll try that then. ", "date": "19 Feb 2018"}, {"text": "try mounting it on a tripod .. ;) \r\nhappy shooting with Huawei P10 ..", "date": "19 Feb 2018"}, {"text": "If you bring the main menu up, using your finger pull the main menu from the left of the screen. You will notice night shot, select this option. The trick is to keep the camera very still as the software does its magic. The camera takes the shot on a timer so not brilliant when taking shots of moving objects but there are more options you can play with. Almost impossible to get a perfect shot in low light with a 2.2 lens, picture has too much noise and blur. ", "date": "19 Feb 2018"}, {"text": "How do i take a good night photos then. ", "date": "18 Feb 2018"}, {"text": "It's no good in low light conditions. ", "date": "18 Feb 2018"}, {"text": "Hi there, can someone please help me with taking good photos with the  night mode function. I can't seem to get the hang of it. Thanks! ", "date": "17 Feb 2018"}, {"text": "P10 is the best android phone i ever had.... And i'm sad the P20 will have so big screen. People can go for Mate 10pro if they want a big screen. Huawei did a mistake,.... ", "date": "16 Feb 2018"}, {"text": "Earphones is terrible on Huawei p10, I have JBL earphones from Alcate Idol 3 is very very better quality ", "date": "16 Feb 2018"}, {"text": "How to fix dimming problem in some apps like messaging and chrome?", "date": "15 Feb 2018"}, {"text": "P10 definitely. What is with 8.0 upgrade does anyone know? ", "date": "14 Feb 2018"}, {"text": "p10 or galaxy a8 2018?", "date": "14 Feb 2018"}, {"text": "Which is better, Iphone 7 Plus or the Huawei P10?\n \r\n(Price range aside)", "date": "13 Feb 2018"}, {"text": "Dude just get p10 its better", "date": "10 Feb 2018"}, {"text": "I have the phone over 6 months... and i love it... Very fast, amazing camera and the battery keeps one day. If you open the gps the battery keeps only few hours but isn't problem i don't use is often.   ", "date": "09 Feb 2018"}, {"text": "The best sound !!! What phone have you got cause it's far from the best sound.  \r\nIt may be a new upgrade for you but it seems a downgrade for others.", "date": "08 Feb 2018"}, {"text": "Trying to decide between p10 and Samsung a8 2018", "date": "07 Feb 2018"}, {"text": "You don't have much of an option if you think it's amazing. Yes it's ok but far from it's competitors. Any one else in the UK or other parts of Europe are having to update the device manually through an app and not through the devices system update menu or hicare. It's a joke as this was ment to be last year's flagship. The wifi issue can only be corrected by a software update that Huawei ensured I would receive about 7 months ago. My country has good wifi, over 200mb download speed and when you have a device that can only reach 30mb it's embarrassing when even budget phones can achieve higher. I received no further help from Huawei after sending emails and tried live chat with somebody not from my country and could not help. Just told wait for update and the last update I received was a security patch in March 2017. You may be happy with the device but I'm not considering I paid a flagship price when I purchased the device. Luckily I have other devices which are better and receive regular updates.", "date": "07 Feb 2018"}, {"text": "Not true. Here in Romania Huawei have a dedicated support hotline. Had no Idea it even existed till I cracked the screen to a 1 month old P10.  \r\nThan I was advised by a friend to call that hotline and I found out that I will get a new screen replacement every time I break my screen for the first 3 months after the purchase. 5 days later had my phone with a brand new screen.I call that decent customer service. \r\nBeside that the phone is amazing , especially considering the price. The best signal/reception/sound. ", "date": "07 Feb 2018"}, {"text": "iSheep detected: the iPhone se has a tiny little battery and it doesn't even have a 720p display. My brothers iPhone se is slowing down just after 4 months of use!", "date": "05 Feb 2018"}, {"text": "Huawei Phone are good. but they did not update software. Better go for Sony or Nokia. ", "date": "02 Feb 2018"}, {"text": "later on February ", "date": "02 Feb 2018"}, {"text": "Stay away from this phone if you purchase the device outside of China. There will be no real customer service especially in the UK, you will be fobbed off with excuses and told to wait for updates to resolve any and every issue you have with the device. I see why the carriers in the USA stay well away. The device gets super hot when using the camera for even short periods of time the software updates that I was told to wait for never happened so I'm left with a phone that does not perform as advertised. I could go on and write an essay for you all, but the fact of the matter is this originally was priced and marketed as a flagship and that may be so if I lived in China where they have had software updates to fix battery and the WiFi problem that I have had since the start of owning the device. Huawei you are shocking, this will be the only phone I will ever own from you. If you sell the device outside of your country be fair and equal to all your customers, Apple, Google, Samsung, Sony, HTC, LG all learned this years ago and that's why they all trade in the US. I'm a real owner of the p10 and not just hating on the manufacturer, so if you are thinking of purchasing the device I personally recommend staying well clear if not you've been warned. ", "date": "30 Jan 2018"}, {"text": "Thank u, for the advice.. I looking for a good camera and performance, also I like P10 size.. and build quality, so, I will buy P10. Cheers!!! :)", "date": "30 Jan 2018"}, {"text": "i'm thinking also to get p10 due to top performance. Only thing which i have doubts is size, i have want some bigger size because for the vision problems, but however, i will decide these days. :) \r\nthanks.", "date": "30 Jan 2018"}, {"text": "Go for Huawei P10! Have this phone for about 6 months and it was very smooth. Got many games such as COC, mobile legends, Asphalt 8, and more but the phone didn't hang up. in terms of camera as well, you don't need to change settings or have your photos to be edited since it was clear. For the fingerprint also its 200% fast! and the phone was handy. But if your looking for a bigger phone not looking for good specs, go for Samsung A8. Actually im an iphone user originally but I have loved this phone after 6 months with it. ", "date": "30 Jan 2018"}, {"text": "I have the same dilema.. :) :/", "date": "30 Jan 2018"}, {"text": "Huawei p10 or Samsung A8 (2018)? Any recommendations?", "date": "30 Jan 2018"}, {"text": "This is the badest phone that I ever had! I am using Huawei P10 about 4 months.This stupid phone hangs up a lot that i can't do anything,it always turning off by his self...I hate this phone!", "date": "30 Jan 2018"}, {"text": "Does the Huawei p10 support voLTE?", "date": "29 Jan 2018"}, {"text": "P10 is absolutely great, I honestly didn't expect that from Huawei. Battery lasts even two days if you don't use it intensively, but it can also last for only 5-6 hours of continuous gameplay.", "date": "29 Jan 2018"}, {"text": "Hi there, I had the same problem. If your phone is in warranty please bring it back for repair. I ended up getting charged for a replacement phone from Huawei as it couldn't be repaired. I advise you to get it back to the phone shop for them to send it back to Huawei. Good luck! ", "date": "28 Jan 2018"}, {"text": "Hi, just a quick question my p10 camera is blurred, auto focus seems to be not working. its not looking in - need help please - does this needs to be cleaned up? thank you ", "date": "27 Jan 2018"}, {"text": "Hi, I had the same problem too. I took it back to the shop and they sent it off to Hauwai. And they sent me another one under warranty. As it was an issue with the model. The one I have now works perfectly. I still have to work out how to take good night photos in Night mode.  ", "date": "25 Jan 2018"}, {"text": "P10", "date": "25 Jan 2018"}, {"text": "Iphone SE", "date": "25 Jan 2018"}, {"text": "Same question here", "date": "25 Jan 2018"}, {"text": "Should i buy p10 or iphone SE?", "date": "24 Jan 2018"}, {"text": " \r\nwhen this phone will get android 8", "date": "23 Jan 2018"}, {"text": "should i buy the p10 or go for the honor 9?", "date": "22 Jan 2018"}, {"text": "I took G6 around 4 days ago and to be honest i am really satisfide! It's feel great in hand, screend and camra are great. Battery life depends how much you use phone, for me easily go full day of use.", "date": "22 Jan 2018"}, {"text": "I had a Samsung s5 neo for last 2 years absolutely luv it...I went to upgrade to s7 but came across a huawei P10 and I am very impressed ..great quality feel and it's very fast too...I will post again as it my 1st day owning it .", "date": "21 Jan 2018"}, {"text": "what did you choose? I'm confused between the two options as well. I really like the compact look and the features of P10 but I am concerned about battery life", "date": "21 Jan 2018"}, {"text": "Is a very good phone but it doesn't have. built in radio.  how can I use offline radio on it", "date": "21 Jan 2018"}, {"text": "its good fone im happy so far except the low camera aperture n overheating at times", "date": "20 Jan 2018"}, {"text": "I Agree", "date": "20 Jan 2018"}, {"text": "P10 or Galaxy S7?  I dont know witch to chose.... :/ Any help???", "date": "20 Jan 2018"}, {"text": "This is the best phone I ever had! I couldnt beleive the level of personalization of the phone, I can even change the battery indicator and network and everything using downloaded themes created for the phone its just awesome! I had so many android phones \"big brands\" but Huawei is the best I seen so far!!! I bought it on very good offer but from now on I would pay even full price for Huawei phone as I know it worth it!", "date": "20 Jan 2018"}, {"text": "P10 is the best. I have a P9 and I know that there isn't a really big difference in performance against P9 Plus. If you want to get a Mate 10, you should go for the pro version, otherwise P10 is the better option because it's better than the lite version.", "date": "18 Jan 2018"}, {"text": "Its very easy , go for p10. No reason to explain why , its just one year old phone..", "date": "18 Jan 2018"}, {"text": "hey guys iam very confused to choose between (mate 10 lite, or p 10, or nova 2 plus, or p9 plus) please advise", "date": "17 Jan 2018"}, {"text": "Hey \r\nI can use my P10 camera in monochrome only \r\nOtherwise my camera is blurred what is the problem", "date": "17 Jan 2018"}, {"text": "Ok. Is it not good to use the night mode function then? ", "date": "15 Jan 2018"}, {"text": "it is very good but you have too know how to use the pro mode. because the p10 its not that phone to take out and fast shoot. you have to learn how to use that camera to get some nice shots", "date": "15 Jan 2018"}, {"text": "Can someone please tell me how to good night photos ", "date": "15 Jan 2018"}, {"text": "Go for p10 man. This is the b rest choice ! \r\nBelieve me. Even me after few days go to buy it p 10. Xz1 is just rubbish. That's it. ;)", "date": "14 Jan 2018"}, {"text": "Guys any updates on oreo with our P10??", "date": "13 Jan 2018"}, {"text": "Anyone having network problem especially when making call or receiving call and always no line for using Huawei P10?", "date": "13 Jan 2018"}, {"text": "Nice camera.. crisp and clear..amazing vid", "date": "12 Jan 2018"}, {"text": "What 's new in today update in 610mb", "date": "11 Jan 2018"}, {"text": "Sony phones are good. Quality build. They are fast. Updates and support are great.  \r\nBut last month i sold XZ and bought P10... Why? \r\nThey are havey, fingerprint is really bad (specialy for left handed) and they have bad camera! My ex lg g3 had better camera then sony xz.\n \r\nI am happy now with p10. Minus: its not watterproof :) ", "date": "10 Jan 2018"}, {"text": "Hi evry one i have not 8 but it is very big phone so i m thinking about p10 so this is my right disigon or no", "date": "08 Jan 2018"}, {"text": "compared both mobile phones almost everthing is good on both phones but huawei p10 camera is always ahead of xz1 camera in every aspect(wide aperture mode,dslr effect,potrait mode,seflie camera),thus sony  comes with super slow motion and p10 look is much better and handy with very good battery life and fast processor than xz1.", "date": "08 Jan 2018"}, {"text": "I am using p10 for almost 3 months,very good battery life,more than enough to use for full day on a single charge from 0-100.\n", "date": "08 Jan 2018"}, {"text": "Hi, anyone have this phone who can tell me if the battery life is good? compared to iphone 7 which sucks", "date": "08 Jan 2018"}, {"text": "Thinking of buying a phone with all around great performance and I'm very much confused choosing from P10 or Xperia XZs....Please Help guys...", "date": "07 Jan 2018"}, {"text": "I have p10 its awesome phone but wait and buy p20 its almost there &#128521;", "date": "06 Jan 2018"}, {"text": "Is it still worth buying this one now, what do you think, guys?? ", "date": "06 Jan 2018"}, {"text": "In terms of auto mode, both the 6s and P10 are on equal footing. But when you usue the manual mode on the P10. It will produce better pictures and offer more creativity. Especially in low-light scenarios.", "date": "03 Jan 2018"}, {"text": "Any long exposure shot at night will be a blurred mess if you don't put the phone on a steady surface or mount it on a tripod. Get a tripod. It will make your low light shooting easier.", "date": "03 Jan 2018"}, {"text": "Is that in night mode? ", "date": "02 Jan 2018"}, {"text": "Just turn off the flash and hold the phone as still as possible.", "date": "01 Jan 2018"}, {"text": "Hi there, I'm still trying to get good night photos. Does anyone have any times or tricks to advise me on. ", "date": "31 Dec 2017"}, {"text": "I have just ordered a new Samsung S7 but am now considering changing the order to the P10. The P10 is cheaper and seems to have better hardware and performance, but as my last phone broke due to water damage I'm not sure if it's worth changing. \n", "date": "31 Dec 2017"}, {"text": "Which one is better 6s or P10?Or can you suggest any other good models in this price range with good camera and battery which is very important for me.My iPhone  5s now slows after iOS 11 update and have to charge 2-3 times per day.Your suggestions will be highly appreciated..", "date": "31 Dec 2017"}, {"text": "Huawie P10 &#128079; ", "date": "30 Dec 2017"}, {"text": "Trying to decide between p10 and Samsung either A5 or S7", "date": "29 Dec 2017"}, {"text": "Trying to decide between p10 and Samsung either A5 or S7", "date": "29 Dec 2017"}, {"text": "How much time?", "date": "29 Dec 2017"}, {"text": "P10 ", "date": "29 Dec 2017"}, {"text": "Had the same doubt, went for the p10. \r\nS7 edge is a stunner but it is more expensive to buy. \r\nP10 (even my ugly gold one) is ok, much more compact and lighter, less expensive and it was a huge surprise when it comes to performance and photo capabilities. This thing at night with a tripod are amazing cameras! \r\nOne of my concerns with the EDGE is this: we all know the screen can break and what will it happen when it does? how expensive is it to replace? I would assume a lot is the answer. \r\nBesides, P10 as a great battery and an insanely fast charger! Go for it!\n", "date": "28 Dec 2017"}, {"text": "P10", "date": "28 Dec 2017"}, {"text": "Keep in mind that they have a big difference in their size. I really like the OnePlus devices, as well as other ones, but they are huge for using them with one hand. The P10 offers a good balance of compact size, features, and price.", "date": "26 Dec 2017"}, {"text": "Guys I need your help. Huawei P10 or OnePlus 5? ", "date": "25 Dec 2017"}, {"text": "Huawei P10 or Iphone 7 (maybe 8)?", "date": "25 Dec 2017"}, {"text": "Apart from Android 8.0, do you think this is going to receive more future Android updates? I am coming from stock Android and I wouldn't like to get stuck at an older Android version in two years.", "date": "23 Dec 2017"}, {"text": "replace it with p10. p10 has a feature that you can't see in your iphone", "date": "23 Dec 2017"}, {"text": "I want to know if I would keep my I phone 6 or to replace ir with P10 and enjoy it's features that i cant find in the i phone", "date": "22 Dec 2017"}, {"text": "I phone 6 or p 10", "date": "22 Dec 2017"}, {"text": "Expensive\n \r\nI can only afford it G6 or P10...", "date": "22 Dec 2017"}, {"text": "of course P10 :)", "date": "21 Dec 2017"}, {"text": "I bought her the pink at 2017 and she loves it", "date": "20 Dec 2017"}, {"text": "Huawei p10 or galaxy s7 edge?", "date": "20 Dec 2017"}, {"text": "P10", "date": "20 Dec 2017"}, {"text": "I want to buy a new phone for my wife! Two choices: Huawei P10 or Samsung A5 (2017)???", "date": "19 Dec 2017"}, {"text": "G7", "date": "18 Dec 2017"}, {"text": "Battery not good. Normal usage makes it warm, gaming makes it really hot.", "date": "17 Dec 2017"}, {"text": "LG G6 or Huawei P10?\n \r\nWhich phone is better and why?", "date": "15 Dec 2017"}, {"text": "Battery is horrible. Gotta charge few times. \r\nNo gaming or streaming. Just regular use", "date": "14 Dec 2017"}, {"text": "Serious issue\n \r\nWhen i am recording a video, mostly at 1080/30 fps, (e-stabilization ON), sometimes when im panning, the videos show some stutter/lag, like they are missing frames. Like a jello effect. Not a lot, but specially at lower light. Im assuming its the EIS, that doesn't do a good job at keeping up with the change of scenery but i could be wrong. Im frustrated..Such a good phone to have this issue. Anyone has this issue?  Any help appreciated. (Im thinking of returning the phone)", "date": "14 Dec 2017"}, {"text": "G6 back camera is awesome compared to p10 \r\nUsed both", "date": "13 Dec 2017"}, {"text": "I got the same problem as well, after pressing button it's not working and sometimes working... But after restart the phone it works ", "date": "13 Dec 2017"}, {"text": "Yes I have tried that. It can read a 1TB external hard drive. ", "date": "11 Dec 2017"}, {"text": "After 5 months of use, camera is not focusing properly although no problem in monochrome and selfie shots", "date": "11 Dec 2017"}, {"text": "why is my data turn off sometimes at midnight..I press the mobile data button..its on but no 4g symbol and no internet..I turn on airplane mode over and over again..restart it again..sometimes itll turn on and sometime it dissapears..wht is the problemm..", "date": "11 Dec 2017"}, {"text": "Used both Huawei p10 and lg g6..LG is bulky where as Huawei is handy phone, excellent back and good front camera than LG. Go for Huawei ", "date": "11 Dec 2017"}, {"text": "I have an LG v20 will you recommend to get the p10?", "date": "10 Dec 2017"}, {"text": "Get p10. i used both and p10 is much more better.", "date": "09 Dec 2017"}, {"text": "I have the same question... but i need to choose between P10 or G6", "date": "08 Dec 2017"}, {"text": "I am about to renew my Galaxy S6 and am between choosing LG G6 or the HuaweiP10 ... what do you recommend?", "date": "08 Dec 2017"}, {"text": "Estabilization sucks, display LCD,  5.1inches,  battery weak.I don't think it is a good deal.", "date": "06 Dec 2017"}, {"text": "If you are referring to one plus 5 vs Huawei p10, one plus 5 would be the clear winner for heavy gaming. The battery lasts a lot longer and the snapdragons adreno 540 gpu is much better than the mali-g71 mp8. I find my Huawei p10 gets very hot and drains the battery very quick compared to other devices when using the device for heavy graphic intensive tasks. A better comparison would be the new Huawei mate 10 vs one plus 5 because the Mate 10 has the new mali-g72 mp12, a much better gpu. ", "date": "04 Dec 2017"}, {"text": "The only thing bad about this phone is the OS updates.", "date": "04 Dec 2017"}, {"text": "Huawei P10\n", "date": "04 Dec 2017"}, {"text": "Huawei P10 has Mali G71 MP8 GPU while the Oppo F5 has Mali G71 MP2 its obvious P10 wins", "date": "04 Dec 2017"}, {"text": "Screen Flash ", "date": "04 Dec 2017"}, {"text": "Hello there. I'm wondering, this phone will receive an ipdate to Oreo? And if it does, when will be?", "date": "03 Dec 2017"}, {"text": "Anyone knows if it has a front flash for the selfie camera?", "date": "03 Dec 2017"}, {"text": "Guys, P10 or Op5? For heavy gaming, camera and os update 2-4 years\n \r\nSorry bad grammar\n \r\nThanks", "date": "03 Dec 2017"}, {"text": "P10 or Xperia xz", "date": "02 Dec 2017"}, {"text": "I had purchased a P10 mobile phone and presented this to my wife while we were in Oman. Lately, we have moved to India, but the equipment has got a reference to an Oman telephone number to which alone the PIN would be communicated. How do  I set this right and get information to be available through an Indian mobile number? ", "date": "02 Dec 2017"}, {"text": "Been using this phone for a long while now and there's one thing in curious and I need your helps. The earphone that comes with it,what is it's frequency range?", "date": "01 Dec 2017"}, {"text": "Huawei P10 64GB Dual Sim or honor 7X ?", "date": "30 Nov 2017"}, {"text": "Set the iso to 1000- 1600 set shutter speed to 30 or set iso to automatic then shutter speed to 30.. this phone has a legit dslr camera. ", "date": "28 Nov 2017"}, {"text": "For those outhere who still wondering about this phone.....It´s superb. Best phone i ever had by far... \r\nTop notch photos, easy to use iterface with central button helping a lot \r\nGreat perfomance \r\nNice overall design (if a little similar to iphone) but that´s  not a bad thing\n \r\nHuawei is definitely on the right pad", "date": "28 Nov 2017"}, {"text": "After 6 months my Huawei P10 is very slow. What can I do for it.", "date": "28 Nov 2017"}, {"text": "Hello guys. :) My mobile operator just gave big black Friday sale on Huawei p10 and I am considering taking but, but I am also torn by the fact that P11 is coming soon (announced on MWC 2018 February). So is worth waiting for the game or should I just take P10? The only reason I am considering waiting for it is because I assume it will have f/1.6 unlike p10 which has f/2.2. Some advice would be very much appreciated. :)", "date": "25 Nov 2017"}, {"text": "I got one of these for free from my cell phone provider. The previous phone was a Zenfone 3 Laser. This is miles and miles ahead in quality and performance, and I'm extremely happy with it. It never lags, handles any game, movie or app I throw at it and looks just beautiful. I have it in Prestige Gold and I love it. The fingerprint scanner that also accepts gestures took some getting used to but now  \r\nI absolutely love how quick it is to navigate. Very happy with this phone, won't be upgrading for awhile.", "date": "23 Nov 2017"}, {"text": "Is anyone have problems with their camera focusing ", "date": "22 Nov 2017"}, {"text": "I'm getting heating problems when I'm using the Camera.", "date": "22 Nov 2017"}, {"text": "Need advice guys..\n \r\nMy carrier has a discount on the P10 for like 12Â\u0080/month for 24 months from the original price of 21Â\u0080-ish.  \r\nMy Galaxy S6 that I bought at day one is starting to show its age and i want to upgrade, is it worth it?  \r\nReally like the design too :) \n \r\nWant your opinions :)", "date": "21 Nov 2017"}, {"text": "Everythings is good except battery life. Battery drains fast especially gaming, GPS, camera, multitasking while downloading. (Need to charge twice or more). Battery saving features by Huawei/EMUI is not helping at all. Hope updates will fix this!\n", "date": "21 Nov 2017"}, {"text": "Whats the best camera setting in auto mode? \r\nClueless about cameras just would like to take nice photos in auto mode\n \r\nIf you guys can give some examples of suggestions what to adjust in the setting that would be great \n \r\nBy the way night pictures are very terrible on this phone. Like a 2012 smartphone or something", "date": "21 Nov 2017"}, {"text": "huawei p10 is good mobile for use or not.and also coments on hawei 6x honor .which one is good????????????plz guide me?????", "date": "20 Nov 2017"}, {"text": "I have the same problem with internet...don't work first time...should restart.", "date": "18 Nov 2017"}, {"text": "p10?or mate10lite?", "date": "16 Nov 2017"}, {"text": "is huawei p10 capable of reading a 1tb hardrive on otg...i plan to purchase p10 hahah...help guys", "date": "16 Nov 2017"}, {"text": "Nokia 8 because Snapdragon 835 is better than Kirin 960", "date": "15 Nov 2017"}, {"text": "p10 or nokia 8?", "date": "15 Nov 2017"}, {"text": "Next year, beginning of March. ", "date": "15 Nov 2017"}, {"text": "I'll try to answer your question about the EMUI. I'm in kinda the same situation as you right now. I hope my comment isn't late :)  I own a Moto X2 which runs Lineage 14.1. and as you may guess I'm a fanboy of a stock Andorid. My wife uses P9 for about 6 months and here I started looking towards this Huawei device and comparing it to my old phone. I know it's a P10 thread, but we are talking about EMUI. Well, yes it looks like someone was designing Android based OS which still has to look like iOS. But in general experience is smooth. Behavior of basic parts of the system is the same (notifications, phone configurations etc.). It just visually looks different. For me switching to EMUI would be a trade-off. I'll tell you why: \r\n- EMUI manages battery life amazingly (plus, battery capacity isn't too small itself)  \r\n- Device has a rich featured camera (night shot, time lapse, bokeh effect and many more) \r\n- P10 just looks great. \n \r\nSo, in the wake of that EMUI becomes a quite OK-ish operating system to use. I'm thinking to buy P10, when I save some money for that :)", "date": "15 Nov 2017"}, {"text": "Any idea when will the P10 get the Oreo update? I'm really looking forward to the update. ", "date": "14 Nov 2017"}, {"text": "Oh it works on P9 ? Well that's unfortunate :( . I wonder what is causing this bug then ... It's kind of strange that the P9 works correctly but not the P10.\n \r\nI doubt they will fix it in Oreo release, but it would be a nice surprise. In February of 2010 the issue was first mentioned and some duplicated issue posts were created. As of May 2015, regardless of the number of complaints they received, they clearly stated that they will not fix this issue ... and today there is still devices that plays ringtones/notifications sounds through speakers when headphones are plugged in. It's kinda saddening.\n \r\nHearing though that it works on P9 gives me hope that they will indeed fix this in some other way for good one day !", "date": "13 Nov 2017"}, {"text": "of course mamen,.haha..your in data mode. if you understand that mode you'll not gonna wonder. that's why its called data mode because it limits the data usage on every apps you've used. simple as that. ok?", "date": "11 Nov 2017"}, {"text": "Thank you so much\n \r\nI visited the store where i bought the phone. It was the same problem. So it must be a software bug. The store also told me that the P9 plays the ringtone through the headset.  \r\nThey only have problems with the P10. \n \r\nAnother thing was they said wait for the Oreo update maybe they will fix it. The Volume for notifications will also maybe be availible.\n \r\nSo.....we should wait ", "date": "09 Nov 2017"}, {"text": "Hi Xalo Dogan,\n \r\nI'm pretty sure this is a bug and it's not a feature you can turn on or off (until proven otherwise). I have been waiting for a fix of this for years from Google on many phones I owned and they never proceeded to fix this issue. This bug seemed to followed in OS branches of Android as well. You could open a ticket with Huawei to report this issue and hope you'll get a positive response (either It's a feature ! You just have to do the following, or We look forward to fix this soon !).\n \r\nOtherwise, I may suggest you to install a third party application that does a workaround of this problem. It's a very ugly a disgusting workaround, but it works. Personally, I learned to cope with this bug because I hate installing an app and suffer their ads for improving basic functionnalities of a phone.\n \r\nIf you Google \"ringtone in headphones android\" , you'll get many many many results of apps and workarounds in the results.", "date": "09 Nov 2017"}, {"text": "Hi Ahs9,\n \r\nAs to adress your three main concerns : \r\n- No oleophobic cover : As a previous user said, the P10 is already covered with a really good protective cover on the screen. If you don't remove it OR put another cover if this plastic one doesn't suit your need, I don't think it'll be a problem. I wouldn't recommend peeling off the plastic protector that's already on the screen. I bought a glass protector, but I regret removing it since day one lol. It fits a lot better than most plastic/glass protectors you'll find and it is of good quality. I don't know how the recent P10 are manufactured now, but maybe they fixed the oleophobic issue. \r\n- overheating : I don't think you'll have that much of a problem with heat considering the activities you stated... it will heat up a little, but I doubt it'll be anywhere near levels which are uncomfortable or affecting performance. Putting a case on your phone may help cover the heating part. I know I don't notice it that much since I've put a case around it.  \r\n- EMUI : Emui is a very clean looking Android OS. Most of the themes I tried keeps that cleanliness intact and it is possible to get something close to stock as look and feel (through third party app... I'm thiking about SimpleFlat and SimpleO themes if you want to google them). I don't see stock android any better or worse than EMUI, just different. As someone who ALWAYS root/mod/reinstall stock on my previous phones, the thought never occured to me to do this with EMUI. It's just good as is and it has interesting features ! I'm pretty sure you'll like it as well.\n \r\nHope this helps !", "date": "09 Nov 2017"}, {"text": "Can someone tell me how to get good night and low light photos on this phone? ", "date": "08 Nov 2017"}, {"text": "I hope someone can help me here \n \r\nWhen i plug the original Huawei headset i can listen to music and etc. My main problem is when i recieving a call the ringtone plays only through the telephone...not through the headset. \n \r\nI cant hear the ringtone....the telephone vibrates and rings.", "date": "08 Nov 2017"}, {"text": "Mobile data does not work at first, u hv to restart the mobile then it start working .. Is it only me with my device or any one else hv the same issue", "date": "08 Nov 2017"}, {"text": "I don't have any heating issues with my p10. The performance on this phone is awesome. Multi-tasking is also excellent, it keeps every app opened in the background without an issue. I recommend you to get this phone or wait for its successor if you want a bezel less display. ", "date": "08 Nov 2017"}, {"text": "Data mode doesn't have an internet, even in 4G. Same problem anyone?", "date": "08 Nov 2017"}, {"text": "My main use would be Flac music 24bit 192khz with simple to drive 62 ohms and 200 mW headphones AKG K701. So the 3.5 jack is pushing 192 kHz out, but if i send it to 44.1 kHz 16bit music center to play from speakers, is there setting to pre resample the hi-res music to CD audio spec?", "date": "05 Nov 2017"}, {"text": "As a P10 user I m really in love with this phone... Got no issue at all except when gaming its become hot... No problem for me... Luckily I got the memory type ufs 2.1storage which is fastest one..... I highly recommend this phn... So many out there complaining abt it's emui but in my opinion I just loving it so simple n costumizable", "date": "05 Nov 2017"}, {"text": "Source: Huawei P10 user\n \r\nIssue 1: Don't remove the already attached glass screen protector if you can't handle a phone without oleophobic coating. I don't know about later P10s but mine does not have oleophobic coating (I can tell by the fingerprints, and yes, I removed the glass protector, and no, I did not regret it because I can live without oleophobic coating).\n \r\nIssue 2: I play mobile legends (game) a lot. And the game is pretty demandable. Despite that, my P10 doesn't heat for the first 2 hours more or less. It starts heating after that though but not as hot as you think. So gmail, facebook and whatever light apps are fine on the P10.\n \r\nI also talk with my woman on the phone a lot (around 2 hours more or less everyday), my P10 never heated. \n \r\nHowever, it does heat when using the camera for long periods of time (still not as much as you think)\n \r\nIssue 3: It's my first time using emui and I am definitely loving it. It's so easy to handle. I would say it's better than most. I never changed the icons because they all look pretty sophisticated for me. \n \r\nI definitely recommend buying this phone. Very fast and elegant. 5.5 inch phones are still pretty easy to handle when it comes to texting (I have big hands).\n \r\nHope this helped. &#9996;", "date": "05 Nov 2017"}, {"text": "hi,  \r\ncould you tell me about DUAL sim functionality? Is G4/G3 or even G4/G4 possible? Or only G4/G2? \r\nThanks :) \r\nMatthias", "date": "05 Nov 2017"}, {"text": "I don't know others but in my opinion I just wanted a phone like p10 n that's why I get it.. I m useing it from may n I m impressed... It's all in one what I liked, size,  almonium back, camera, fast charging and performance... I don't need big phone with water resistant... Yes it become hot when gaming but it's no problem for me As I like so many things", "date": "05 Nov 2017"}, {"text": "Hi everyone, I need your help. \n \r\nI'm looking for a phone and after a LOT of research, I'm considering buying the P10. I've read most of the opinions and, as always, they're different. I assume it all comes down to how you use your phone, so:\n \r\nI talk a lot.  \r\nI use Gmail a lot.  \r\nI use Google Drive / Microsoft Office a lot (reading mostly , rarely editing) \r\nI text a lot (mostly SMS, hangout, less messenger).   \r\nI search a lot and copy information from websites, and need to switch between apps very fast.  \r\nI don't play games.\n \r\nFor the past years, I've been using a Oneplus One. My experience is great actually. The battery life was excellent (even now it's great but dropped to levels I can't work with), I have no lags whatsoever using apps or switching between them. It looks good (no glass back with fingers on it). But the phone is too big to handle easily with one hand. And has no fast charging capabilities (although charges surprisingly fast with the right charger)\n \r\nSo...\n \r\nOn the paper the P10 looks perfect for me:\n \r\n- small \r\n- bigger battery than what I started with on the OPO One \r\n- I like the design (matte back - no fingerprints like on Galaxy s8) \r\n- better processor and more RAM\n \r\nBut...\n \r\nI have three main concerns:\n \r\n- no oleophobic cover - I've heard the rumors and seen the effects and that was unacceptable. I've heard though that this issue was resolved and the late P10's don't have the problems. Can anyone confirm this?\n \r\n- overheating - as I've said I don't play games but considering my mentioned usage I just can't have a phone that after sending ten emails and making 5 calls gets hot. What's your experience on this?\n \r\n- EMUI - I'm used to stock Android and just hope that using the themes I can make these icons and notifications \"bearable\" (It looks awful out of the box). I can, right?\n \r\nPlease help me either by providing any useful information on these three topics or maybe recommending a phone a just didn't notice (?)\n \r\nThank you in advance.\n\n\n\n\n\n\n", "date": "04 Nov 2017"}, {"text": "Not IP68 certified .. not expect from Huawei  :( ", "date": "04 Nov 2017"}, {"text": "Yeah!, I agree on the heating part and the data per month but overall the phone is decent! I love the screen ratio and the build quality of it ( I don't like glass phone / 18:9 ratio phones ). I think some future updates can solve the heating of the P10. ", "date": "04 Nov 2017"}, {"text": "I'm using Huawei since the day it was available (around june I think) and I am really liking this phone. I use my phone to call, text, check emails, listen to music and every now and then browse and watch Youtube. It's my first experience with a Huawei phone and it has been a very pleasant experience so far. I like its size factor (all phones seems to be 5.2+ inches and up these days exception iPhone...) and its snappy performance for common tasks of communication... and that's mostly what I need ! It also takes beautiful pictures...for a phone ! I could never manage to take pictures as impressive as what they advertise though... I would even say that my face seems stretched vertically on selfies, which is a bit annoying. I wouldn't recommend this phone for a gamer or someone who uses heavy processing : It tends to get hot as soon as you do something slightly demanding. Software wise, there is room for improvement. As example, phone data can only be calculated from the first day of a month till next month ... You cannot chose the first day of billing. It still intrigues me as to why they removed a feature that was BASICALLY AVAILABLE SINCE ANDROID 4! There has been some crashes and hiccups occasionally. The software looks very clean however and professional, which I appreciate. It IS a decent phone !", "date": "03 Nov 2017"}, {"text": "Does the Huawei P10 have video calling? ", "date": "03 Nov 2017"}, {"text": "(update) \r\nI factory reset my P10 and the heating issue lowered down a little but still there is heating on the upper back and in the upper front. Maybe the ambient temperature in my area is helping the phone to heat! I live in a country where its really hot, 33-30C and this might help heat the phone, and this might be also the reason why yours isn't heating that much", "date": "03 Nov 2017"}, {"text": "My p10 doesn't get heated up while watching videos or browsing etc. It does heat up just a little bit when i play games for a long time. \n", "date": "02 Nov 2017"}, {"text": "2017 flagship phone that gets hot while using wifi and FB, Messenger, and Youtube! imagine playing games with it, you'll get a free iron for your clothes", "date": "02 Nov 2017"}, {"text": "still no water resistant in 2017.", "date": "02 Nov 2017"}, {"text": "Yes it is normal", "date": "01 Nov 2017"}, {"text": "Is that normal when u r using the P10 as a wifi hotspot that been used by other 2 phones and laptop where the battery only last for about 5hours?", "date": "01 Nov 2017"}, {"text": "It's been a week and still the phone tends to get hot after 5 min of messenger and facebook, I also notice that the phone generates heat at the Huawei logo ( and up ) and near the cam at the back and also in the front cam area! is it normal? My note 5 never had this issue on heating! is it because it is bigger and made of glass? but speed wise and and overall experience the Huawei p10 rocks! but sadly the heating issue is irritating. I would like to ask does your P10 heat up to? or is it just mine", "date": "01 Nov 2017"}, {"text": "Yes it is compatible but can you tell me the name of the developer of the game so i can make sure that i checked the right game for you", "date": "29 Oct 2017"}, {"text": "It is", "date": "29 Oct 2017"}, {"text": "It's normal. I remember when I first had my device,  it got a little bit better after a week or so. Still gets hot when using the camera or playing graphically intensive apps for longer than 10mins.", "date": "29 Oct 2017"}, {"text": "Just got my phone from a carrier, and I'm to be honest the phone is pretty fast, good camera, and I love the everything about it! But sadly I have 1 issue about heating.. the phone gets quite hot everytime I use Wifi, Facebook, Youtube or just surfing the web. Is it normal to heat? about 37 - 39 degrees celsius? hope someone can answer back! Thnx ", "date": "28 Oct 2017"}, {"text": "hi! i have same proplem with my huawei p10. but only colour camera. the white/black camera works perfect! you fix the problem? how? Thanks", "date": "28 Oct 2017"}, {"text": "Thanks. that solved google keep force closing everytime.", "date": "28 Oct 2017"}, {"text": "Hi, if you own the P10 can you please check for me whether the game, sand : box, is compatible with this phone. Thanks in advance", "date": "27 Oct 2017"}, {"text": "I have a new one of these and have an issue where it doesn't accept my Hotmail address. This is a known issue. Does any one else have this issue?", "date": "27 Oct 2017"}, {"text": "I have the P10 but originally wanted the S7. My provider just has a cheap offer for P10 that's why I bought it. I'd say if you have the budget, go for the S7. It's AMOLED with a good camera and it has IP certification, too. Choose the S7 flat variant though, not the Edge since I heard about a lot of issues with the Edge. I hope it helps.", "date": "25 Oct 2017"}, {"text": "You have to bring that to a service center. Sad to say, it's a common issue to P10 devices. They need to calibrate the camera.", "date": "25 Oct 2017"}, {"text": "mate 10 all the way :) ", "date": "24 Oct 2017"}, {"text": "First Huawei phone I owned. And I've owned flagships from all make and models even iphones\n \r\nCamera is nothing great really. Very similar to what you see in most mid range phones \r\nPhone doesn't heat but that's because I only do browsing. Nothing heavy. So I can't say for sure \r\nBattery is decent.  You definitely gotta charge couple of times a day", "date": "24 Oct 2017"}, {"text": "I want to buy this phone but need to know if the camera is really good,phone doesn't overheat and batt is good. \r\nBut again which is better between mate 9 & p10? Thank you.", "date": "24 Oct 2017"}, {"text": "Thank you very much. I currently possess an iPhone 5s which I got just over 2 years ago and itÂ\u0092s really bad now. IÂ\u0092m just waiting for Christmas for the prices to drop to about £350 AÂ\u0092s now itÂ\u0092s £400 which still isnÂ\u0092t bad for a flagship phone but just waiting for that extra £50 less", "date": "23 Oct 2017"}, {"text": "Yes there is option of SD card but the internal storage 64 GB in base model is enough for me. Battery is not bad,  full day charge in heavy use ", "date": "21 Oct 2017"}, {"text": "Can someone please tell me whether you can use a MicroSD card as internal storage on this phone. And also how long the battery lasts for. Thanks in advance :-)", "date": "21 Oct 2017"}, {"text": "Just laughable, I know you feel you have to defend the choice of phone but this is not as amazing as you make out. The battery life is bad and seems to be getting worse. The speed is good but after using the device for a while the phone gets hot and that's when I start noticing lag and apps crashing. Don't believe me, just run a benchmark such as antutu use the camera or play a game for 10mins then run the benchmark again you will be amazed at the difference. The phone gets so hot it throttles almost as bad as the snapdragon 810 did in the HTC m9. I like the phone but will be honest in its faults. This may be slightly above midrange level but not in the league of this year's flagships. Just remember Huawei released a midrange phone the Huawei honour 9 with the exact same SoC an identical camera and pretty much the p10 in a different case. ", "date": "20 Oct 2017"}, {"text": "R u serious??? MIDRANGE??? This phone is better than S7 (even from the s8) or lg g6.. maybe front camera nog so good, but everything elese is superb: speed, performance, build quality, camera, ram menagment.....!!! I have s7, and I can say, p10 is wayyy better... THE END.", "date": "20 Oct 2017"}, {"text": "This is a mid range phone at best.  Nothing special \r\nI downgraded from a LG G6. \n", "date": "20 Oct 2017"}, {"text": "Hi, my P10 suddenly the camera cannot focus.......... The selfie camera is ok. Anybody with similar experiences. Thanks. ", "date": "20 Oct 2017"}, {"text": "Are you using the original charger and wire? I bought the 3rd party cable and the charger speed dropped pretty much.", "date": "20 Oct 2017"}, {"text": "Charging about 1,5 hours and i just got from 26% to be 45% only. Is it normal? Or i have a deffective charger or usb c? ", "date": "20 Oct 2017"}, {"text": "Mate 10 as it is the newest with a better SoC, much better camera. The p10 has become a bit of a let down for me to be honest, more of a midrange phone. ", "date": "20 Oct 2017"}, {"text": "Which one is better? Huawei p10 , huawei mate 10 or oppo r11? ", "date": "20 Oct 2017"}, {"text": "For those with app crashes, go to Settings>Battery>Click the Gear Icon>Disable the option for \"Close excessively power-intensive apps\"", "date": "19 Oct 2017"}, {"text": "used to have galaxy s6, and lg g3. this one is by far me best phone i ever had", "date": "19 Oct 2017"}, {"text": "If you are up to maximum android version update, choose Nokia or Google Pixels.", "date": "19 Oct 2017"}, {"text": "Yes I had the Chrome issue for a while but it went away after an update in the app store. Still experiencing problems, battery seems much worse like it has deteriorated, at least 2 charges a day on moderate use. The phone gets quite hot regardless what I use the device for, using camera, games or Web and YouTube after about 15mins or so. To be honest I don't expect much more out of Huawei now as they will concentrate on there new mate 10 but I would place a huge bet that because the chip is using a cpu that is almost identical, the mate 10's kirin 970 will throttle as bad as this 960 does. Real shame as most of the problems could of been helped by software updates something that Huawei really lacks in. ", "date": "18 Oct 2017"}, {"text": "Yes.", "date": "18 Oct 2017"}, {"text": "crap software no sense in device, every system app is thirdparty app.", "date": "17 Oct 2017"}, {"text": "This one or Nokia 8", "date": "16 Oct 2017"}, {"text": "This one or Nokia 8?", "date": "16 Oct 2017"}, {"text": "is anyone here have a problem with google chrome browser not respond quickly? sometimes \r\napps force close, video lagging.. ? ", "date": "14 Oct 2017"}, {"text": "Which is better between Samsung S7 and Huawei P10 ? \r\nI am interested also that mobile which receive Maximum number of latest Android version updates.", "date": "13 Oct 2017"}, {"text": "I am using since april ..alredy 6 months .i have no issue ...camera is good and performance is better than any other phone no lagging no hanging...those are commenting bad review you all are bias....", "date": "13 Oct 2017"}, {"text": "me likie\n", "date": "12 Oct 2017"}, {"text": "igot this device for 58000pkr...  no font option idiots. ", "date": "10 Oct 2017"}, {"text": "OK, thank you for your advice. ", "date": "09 Oct 2017"}, {"text": "Dont get mate 10 get iphone10 lgv30 or s8+", "date": "08 Oct 2017"}, {"text": "Thanks, I am very disappointed with this phone. I may have to buy the mate 10 or iPhone 10 when they are released. ", "date": "08 Oct 2017"}, {"text": "I dont know which i better the Huawei P10 (dual-sim) or the huawei mate 9 ? ", "date": "08 Oct 2017"}, {"text": "This year* sorry typo", "date": "07 Oct 2017"}, {"text": "Huawei leica camera isn't as good as in the ads or reviewers says, get a tripod as it seems even with ois sucks and use manual mode you must learn basic photography skills tought .I had p9 and I sold it due horrible selfie camera and got an g6 way much better imagine lg v30 1,6 vs huaweeis 2.2 or 2.4 . with the p9 last year they had an scandal that actually the Leica lens are actually just certified by leica and actually produced by sunny optics Chinese company and also this were there were the memory fiasco .I also got no updates on my p9 for near half a year .", "date": "07 Oct 2017"}, {"text": "Hi all, I'm still finding it difficult to get good night photos. Can anybody help me on how to set it up. My photos come out either dark or blurry when taken. It's becoming frustrating now. ", "date": "06 Oct 2017"}, {"text": "Oh well I have never faced any issue after helping my father replace the screen protector, it works fine", "date": "06 Oct 2017"}, {"text": "is it good charged phone?", "date": "05 Oct 2017"}, {"text": "The P10 is simply a FANTASTIC phone, even more so when you consider the price! I have gone from iPhone 6 to the P10 and I have never looked back. It's lightning fast and the camera is just amazing \n \r\nHIGHLY RECOMMENDED ", "date": "05 Oct 2017"}, {"text": "a egg the Huawei P10 is more better that HTC Desire, because that is ugly! that is a true its a damn true!!", "date": "03 Oct 2017"}, {"text": "which is better Huawei P10 or HTC DESIRE 10 PRO\n", "date": "03 Oct 2017"}, {"text": "How is it low light camera performance ?", "date": "03 Oct 2017"}, {"text": "Thanks a lot brother \n", "date": "03 Oct 2017"}, {"text": "Yes it has OIS. My wife has the phone and it has a very capable camera. I myself use the Mi 6 and the camera is not as good (however she likes cameraphone and I prefer performance). If you are looking for a good cameraphone, the p10 is a good choice.", "date": "03 Oct 2017"}, {"text": "Yes", "date": "02 Oct 2017"}, {"text": "How is it camera performance ? Specially in Low light. It has OIS ?", "date": "02 Oct 2017"}, {"text": "does it support OTG?", "date": "01 Oct 2017"}, {"text": "Using P10 for more than 2 months now. Not faced even a single issue so far. Excellent performance, best camera and always smooth no matter how many apps you are running. The only thing that is bit unlikely is the screen is too much fingerprint catchy, they should have done some coating.  \r\nOverall undoubted choice to buy, far better than s8. ", "date": "01 Oct 2017"}, {"text": "How many Hours will take the bluetooth headset of Huawei P10 to get fully charged", "date": "01 Oct 2017"}, {"text": "How many hrs will take the bluetooth headset of Huawei p10 to get fully charged ???", "date": "01 Oct 2017"}, {"text": "I have been using the P10 for 19 days. It's a great phone no problem at all , and I am a heavy user lots of apps running at the same time and always smooth. Camera is really good no complains there either. My girlfriend has an S8 and actually I feel there is nothing to envy to the S8 from this side. Some times she can get better pics but performance is quite the same. I got an excellent deal with my carrier and included 2 year full warranty. First time with a Huawei and I think Will stay with the company for long.", "date": "30 Sep 2017"}, {"text": "Just take it off and replace it with a tempered glass protector, I did. Anyway I heard that they did start putting a coating on the device since they received so many complaints. The coating only lasts about 3 months anyway on any device. ", "date": "30 Sep 2017"}, {"text": "Amazing camera and I really like the navigation key feature.", "date": "30 Sep 2017"}, {"text": "I don't have the P10. I'm considering it. \r\nI had the G6 for a few days and had to return it because people could not hear me unless I put on speaker. It's a known bug :(. Great phone apart from that, great speaker, screen is good but white balance is once again not perfect (typical LG problem). \r\nI did not like the camera post processing, faces looked sooooo fake. The G4 and G5 were way better ( I had both ), though the G5 also oversharpened.", "date": "29 Sep 2017"}, {"text": "Did the oleophobic coating issue resolved ?\n \r\nI am planning to buy but worried about the issue. I don't like keeping the screen protector. But i saw comments it is not recommended to remove on p10", "date": "29 Sep 2017"}, {"text": "Huawei p10 or LG G6?", "date": "28 Sep 2017"}, {"text": "Thanks for your advice. But I still don't know how to set it up to get good night photos ", "date": "28 Sep 2017"}, {"text": "I don't know why huawei don't like updating, we always use the features on up.. Anyway I love huawei phone, &#127757; ", "date": "28 Sep 2017"}, {"text": "Was given a p10 by my company, everything is incredible except for the random apps crash daily. Tried googling for a solution and tried various methods but doesnt seem to be working. Guess we just have to wait for system update.", "date": "27 Sep 2017"}, {"text": "I have same problems,after last system update also have crashs in Apps and games. \r\nDid someone have solution for this crash problem?", "date": "27 Sep 2017"}, {"text": "P10 best", "date": "27 Sep 2017"}, {"text": "Honor 9.", "date": "27 Sep 2017"}, {"text": "use pro mode", "date": "27 Sep 2017"}, {"text": "I need advise. I am torn between LG G6 or Huawei P10, which is better? I tested their Display unit and it is really difficult to choose. Thanks in advance.", "date": "26 Sep 2017"}, {"text": "You should use the stand to hold your phone while taking the night mode photo.", "date": "26 Sep 2017"}, {"text": "Turn on flash light", "date": "26 Sep 2017"}, {"text": "p10\n \r\nalthough the new mate 10 would be even better", "date": "26 Sep 2017"}, {"text": "1st and 2nd month using this phone, is in perfect condition, but now is the 4th month with this phone, apps keep crash like favebook, WhatsApp, wechat and others game etc. I believe that is the android operation system issue for this phone.", "date": "26 Sep 2017"}, {"text": "I have the p10. But the night mode isn't as clear. Is it possible to give me some advice on what to do to get good photos in the night. As I am not a photographer.\n\n", "date": "25 Sep 2017"}, {"text": "Which is better P10, Honor 9 or S7? Help. Tnx", "date": "25 Sep 2017"}, {"text": "I have the p10. But the night mode isn't as clear. Is it possible to give me some advice on what to do to get good photos in the night. As I am not a photographer. ", "date": "25 Sep 2017"}, {"text": "Hello guys..i need your advice...which one is the very good device for using it about 2 years and so on ??...Huawei P10 / Huawei P10 Plus / Samsung S8 / Samsung S8 Plus / Samsung Note 8 ???...Thanks for the advice...", "date": "25 Sep 2017"}, {"text": "Huawei mate 9, P10 or LG V20? \r\nLooking for a phone primarily for gaming but with good overall camera and sounds. Comments of phones from other brands are very much welcome. I'm from the Philippines btw so I'm also considering the accessibility of service centers.. \r\nThanks in advance to those who'll comment. ^_^", "date": "24 Sep 2017"}, {"text": "Really crashed?", "date": "24 Sep 2017"}, {"text": "Im using my p10 for 2 months and i haven't faced any problems especially with the games. I highly recommend this mobile phone. ", "date": "19 Sep 2017"}, {"text": "YEs i kjnow", "date": "18 Sep 2017"}, {"text": "The smartphone using Mediatek Helio p20 chi", "date": "18 Sep 2017"}, {"text": "Right.... Me same, can't go for samsung or other brand instead Huawei or lg..... ", "date": "17 Sep 2017"}, {"text": "Have been using the p10 for a month now. I Love it the camera is excellent and that's from a ex photographer, who is comparing to Apple 5se, HTC ONE M8 and LG G5. Its not crashed once and battery life and recharge speed is excellent. I was going to go for the plus as it's only £50 more and has a better lense in low light but just isn't quite as sharp (minorly). The Plus model is just slightly to big for a top pocket. Finger print recognition is light speed so its pretty secure and can be set up for individual apps like banking or facebook. Its a fast phone and doesnt seem to use much battery life through the day. I haven't tried a samsung but I cant see me trying a different brand other than LG or Huawei from now on. The camera quality is great.", "date": "17 Sep 2017"}, {"text": "wrong", "date": "17 Sep 2017"}, {"text": "Plan to buy p10 are you sure it crashes?so not good for games?", "date": "17 Sep 2017"}, {"text": "Dont buy p10, camera is good, but its OS is not stable, any apps can crashed any time", "date": "16 Sep 2017"}, {"text": "is this otg supported?\n", "date": "16 Sep 2017"}, {"text": "what the best phone for gaming?", "date": "15 Sep 2017"}, {"text": "well.bro ur exactly right .. 100% agreed", "date": "13 Sep 2017"}, {"text": "In some countries, the Huawei P- (regular) is the most compact flagship/high end Android phone officially available (since Sony has stopped making their xperia compact series available). I hope that next year, P11 will keep the same dimensions and have IP certification (aside from the usual upgrades like the newest SoC, etc.) Personally, I hope it will still have the 16:9 aspect ratio but with narrower top and bottom bezels but I know this won't happen..", "date": "13 Sep 2017"}, {"text": "It is very good I'm feeling very well", "date": "12 Sep 2017"}, {"text": "It's a good phone but not without its faults.\n \r\nLet's start with the device it's self, the phone gets hot When using the the camera for more than 5mins and also using Google maps. Using the device for every other task is a breeze and quick.\n \r\nThe next issue is using Google Chrome, the device does not start the app until at least 3 to 4 seconds when touched. I had to resort to a factory reset to solve the issue. I do clear the history and also tried resetting the app by clearing the catch. I honestly believe it's a software problem.\n \r\nNext my biggest issue WiFi. I am in the UK and have used many different networks and routers with all the same results, the device struggles to gain faster speed than 30mbps which is a joke considering the LTE speed can reach much higher speeds, it's just the WiFi issue. There are a few videos on the Internet showing this problem. I contacted Huawei who fobbed me off with an excuse that the device will receive a update to the software to resolve the issue, guess what that was three months ago and no update making the technical adviser a lier. I am not impressed at all.\n \r\nBuild and everything else is good. But don't expect real support and answers from Huawei. This is Not a flagship that they like to make out but a higher midrange or a last year flagship standards. The fact that they have released another midrange phone with the exact same hardware and pretty much same camera is evident. \r\nI believe most of the issues I mentioned are software related so hope Huawei sort the issue out for us customers or they will lose out on sales. \r\nI'm not a troll, I do own this device but feel the need to address people looking to purchase this device of the real issues. ", "date": "12 Sep 2017"}, {"text": "I have a question. I have a picture in Gallery. How can I send to a friend as Whatsop?", "date": "12 Sep 2017"}, {"text": "Man, you have no idea.", "date": "12 Sep 2017"}, {"text": "I'm having the same issue with broadband speeds. Won't go over 30mbps. I bought another P10 for my wife from the 3 store 2 weeks ago, this P10 has no issues, over 100mbps on a speed test. Going to contact Huawei tomorrow", "date": "12 Sep 2017"}, {"text": "p10 of course", "date": "11 Sep 2017"}, {"text": "If media g6 if user experience p10. ", "date": "11 Sep 2017"}, {"text": "LG G6", "date": "11 Sep 2017"}, {"text": "Shame it's no stock android and has no snapdragon chipset otherwise I would have bought it. ", "date": "10 Sep 2017"}, {"text": "LG G6 or Huawei P10!?", "date": "09 Sep 2017"}, {"text": "which one is better in terms of overall performance and camera? mate 9 or p10?", "date": "09 Sep 2017"}, {"text": "Is anyone having issues with Google chrome. Some times after the phone has been sat idle or after using other apps, Google chrome takes a while to respond and does not open straight away. Seems to take 3 to 4 seconds at times.", "date": "08 Sep 2017"}, {"text": "p10 run real racing 3 at 60fps even iphone 7 cant do that", "date": "08 Sep 2017"}, {"text": "I'm also getting the 3D mark result as 1511. But I don't feel any lag in the device and I'm not a heavy gamer either. So it doesn't really matter to me.", "date": "08 Sep 2017"}, {"text": "No bro, this is so wrong. Gaming on Huawei phones are not so cool, they usually lag like hell. Low FPS, geez. If you just tried playing graphic intensive games like, Vainglory, MCV, GTA and damn. Low FPS. I tried all the settings I can do. Play with low spec settings on game and still it sucks. Yea the phone is good for media use, camera is cool, but not on gaming man, trust me, if you're a gamer then it will really break your heart, PROMISE.", "date": "07 Sep 2017"}, {"text": "Gaming on P10 sucks, believe me. I had this phone and it does not play games well I usually get low FPS also playing MCV, geez the lag a GODLIKE!. This is just a midrange phone better buying a iPad to play games with. Yea that will be cool", "date": "07 Sep 2017"}, {"text": "After 1 month use: \r\n* best camera \r\n* easily overheating \r\n* useless screenshot \"double knock\" \r\n* fm radio??? \r\n* but nice design \r\n* fast finger print \r\n* no waterproof? \r\n* where can i buy nice casing???? \r\n* love the super charging", "date": "07 Sep 2017"}, {"text": "i love the phone so much my appeal is you upgrade the flash camera to a crystal like please i doesn't capture well during the night thank you ", "date": "07 Sep 2017"}, {"text": "i have all the games on my phone\n", "date": "06 Sep 2017"}, {"text": "I have also saw you making nagative comments about Huawei phones .  \r\nYour probably make comments based on benchmarks results rather than actual performance of the phone . Only by giving a powerful Processors and Graphics unit doesn't make a phone better all the time . \r\nHuawei latest phone all of them which I have experienced myself is excellent in gaming and every other task available in Android platform. Even after all periods they are silky smooth.  \r\nMy Xiaomi Mi 6 which has SD835 performs better at the beginning but at long period performance falls dramatically. So, dont judge a phone only by its processors. As Huawei phones uses their own processors, they are extremely well optimized for performance.", "date": "06 Sep 2017"}, {"text": "For me Huawei i say many years now the best company fo far(wate to see the Mate 10)But the last years start to be very expensive without to give something new to the phones.Samsung is sleeping and they make the same mistake.Too much money for what......Xiaomi is coming with good and CHIP phones so Huawei WAKEUP.......", "date": "05 Sep 2017"}, {"text": "I dont hate Huawei, as I said many times it has a good lineup if you are looking for a budget device or midrange one BUT Huawei flagship's GPU on a weak side also more often than not they use eMMC instead of UFS storage. These wont impact average consumer, but for a power user/gamer Huawei phones isnt ideal, and not the best that money can buy. \r\nGamers always should look for phones with Adreno GPU, if one doesnt care much about gaming, then Huawei good option\n", "date": "04 Sep 2017"}, {"text": "I'm confused. Please help. P10 or honor 8 pro? Tia", "date": "04 Sep 2017"}, {"text": "Excellent story . You should be writing books . Your power of imagination is top notch. I think your stories will be well excepted and books will sell very well . You will get super rich in no time.", "date": "04 Sep 2017"}, {"text": "Swim swim is a big hater of Huawei . And try his best to prove Huawei phone are bad , their GPUs are weak etc problems . Dont value is opinion. His is just a hater . No matter how a phone is he will criticize it. He didn't even touched and used a current Huawei flagship and make comments baesd on 4-5 old Huawei phones. ", "date": "04 Sep 2017"}, {"text": "Hi guys can anyone tell me what is the resolution of camera photo of p10 ? I mean dimensions width and length", "date": "03 Sep 2017"}, {"text": "P10", "date": "03 Sep 2017"}, {"text": "Which the best p9 plus or p10  \r\nPlz advice me because I want to buy one this month", "date": "03 Sep 2017"}, {"text": "2031 on mine plus I got UFS 2.0 flash storage so consider my self one of the lucky ones. I have noticed that now and again when the phone has been idle Google chrome is hesitant to start.", "date": "01 Sep 2017"}, {"text": "I always advise against Huawei flagships, because those who pay for them always get burned in the end, your story just another drop in the sea, hopefully this saves few people to get scammed by Huawei. \n \r\nHuawei okay choose when its budget or midrange phone, but flagships full of cut corner. Gpu is so weak, that in most case a midranger adreno gpu lot better. Never buy huawei phone for heavy gaming!", "date": "31 Aug 2017"}, {"text": "Instead of running benchmarks (seriously, who does that to see if something is wrong? =| ) contact customer support, there's obviously something wrong with your device specifically...it's 2017 dude, this is common sense.", "date": "31 Aug 2017"}, {"text": "Hello Everyone,\n \r\nMy name is Moshe, after a lot of contemplation I decided to buy a new P10 Huawei phone which I purchased a few days ago.\n \r\nI had, amongst many reasons, decided to go with the P10 rather than the MI6 of Xiaomi because of the Operation System which seemed to have really nice features, and so I wanted to own their device.\n \r\nAfter I purchased the phone I naturally installed the apps I use, not to many since I am not a heavy user, but I did install my favorite game Clash Royale.\n \r\nUpon playing the game I noticed when it gets crowded and new items are added to the game the phone freezes! My nephew who is 9 years old and is a very heavy user, plays Clash Royale every available moment  he gets (a little scary at times) owns a Homtom HT17 Pro 4G Phablet that cost on Ali Baba about 80$, the game runs perfectly so you can imagine the frustration!\n \r\nSo, I did some tests and used all benchmark apps, with the appropriate instructions and ran them. I have found that my new device performs very badly, with the worst result appearing on the GPU.\n \r\nI ran the app 3DMarks   \r\nThe test results were around 1270 +- every run for at least 10 runs after I let it cool down, and during different hours of the day. When you look at the phone while the test is working, you can see it's not working well.\n \r\nThe app said that my results are very bad for the hardware and I should clean the ram and wait for the device to cool down and try again (Average result is around 1870 for P10). When I saw tests done from other youtubers, I saw that they got 2200+ and one other got 2680, thatÂ\u0092s more than x2 my result. \n \r\nAfter speaking to HuaweiÂ\u0092s customer service department, which was absolutely useless, I decided to go to Huawei Official lab, where they said that they do not know how to test it    (O M G) and will contact Huawei Global to see how they can test it.\n \r\nThey also told me that if they don't find anything wrong, I will have to pay for the lab tests!!! \r\nSoÂ\u0085not only do they not know how to test it, they will also charge money for their ignorance!\n \r\nI saw a picture on their wall stating that P10 is better than iPhone 7, I have an iPhone 7 and I ran same 3dMarks testing and got 2160 and told them about it and their response was \r\nÂ\u0093What do you expect, its iPhone 7Â\u0094.\n \r\nEven at their official lab they stated that, the phone is bad compared to other flagships. \r\nOn top of it all, the customer service told me that my new phone will be fixed and not replaced because that's their policy. \r\nNow can you imagine, buying a new phone, it does not work properly and they offer to fix it for you? Disgraceful...\n \r\nIf anyone has a P10 Huawei, and can run a 3DMarks test and would be prepared to send me the output, I would very much appreciate it!  If we find something wrong with most devices I will act to get a recall for the device.\n \r\nIf you own any other Huawei device that is malfunctioned in anyway and you are not being treated fairly please do contact me and send me all details with pictures, explanations and links here or to the mail huaweiclassaction@gmail.com.\n \r\nI will work as best as I can to make sure Huawei will start to care about its products and the end users one way or another, and try to make sure the end user will not suffer from their low production, maintenance and customer services quality. \n \r\nIt really is shameful to treat end users badly and provide them with terrible service, especially when there is so much competition out there!!!\n", "date": "31 Aug 2017"}, {"text": "How is going battery hiw much percent in minute", "date": "31 Aug 2017"}, {"text": "There is no glass pre installed, there is two plastic covering one with red label on the top, you have to remove it and the other is plastic cover from company side that is covering your p10 real screen so its better that you don't remove it,  because removing ll cause finger smadges on your screen .. Thats it..  if u ll remove it then you can  put a glass or plastic according to your wish to cover", "date": "30 Aug 2017"}, {"text": "I bought my P10 online and got several free gifts including tempered glass. So, I brought the tempered glass to the nearest phone accessories shop and ask them to install it to my P10. However, the shop said that my P10 already has tempered glass installed after removing the 1st plastic screen cover. In addition, the box is still sealed when I got it. Therefore, my question is do all the P10 already have the tempered glass installed or it is not tempered glass at all and I need to install it? Thanks.", "date": "30 Aug 2017"}, {"text": "I have had A7 & A5 2017 before & they are good phones, But I like better the Huawei P10.... for its size, design & most importantly the Camera... equipped with Leica dual lens. P10 is indeed a flagship phone. Great Build, Superb Leica lens front & back camera, Superfast charging, pre-installed nougat OS, Very responsive finger scanner(Best in the business I think), Decent Battery life, Gorilla glass 5 protected, Usb Type C port... cool colors to choose from...  et_al... :) ", "date": "30 Aug 2017"}, {"text": "P10 far exceeds A7 in every aspects. go with P10 buddy", "date": "30 Aug 2017"}, {"text": "1% is going in 3 minut. All is on off only net and brigthess is set on low. ", "date": "30 Aug 2017"}, {"text": "Can somebody explain me how is going battery on Huawei P10. In my phone one % is going in 3 ", "date": "30 Aug 2017"}, {"text": "Hey. P10 is better.", "date": "30 Aug 2017"}, {"text": "Can anyone help me decide which to buy???   The Huawei P10 or the Samsung Galaxy A7 (2017)???    Which is more better???   i can sacrifice screen size btw for performance..", "date": "29 Aug 2017"}, {"text": "Bring P10 to Panama", "date": "29 Aug 2017"}, {"text": "Well  i agree but has it been released yet? Is it available on Amazon??? Now I'm seeing 10mp camera noted in the description does the camera have as iPhones? ", "date": "27 Aug 2017"}, {"text": "Let's talk fairly what you need in a phone. 1.  design.... A compact thin and easy to hold 2. Performance... Fast smooth like butter with no lag 3.camera...a good one 4. Battery... Should be good enough for heavy use  at least one day( with fast charging ) ... 5.Color... Too many options  \r\nSo I think it's all available in p10 even  with name of flagship and price is also not that high like other flagship\n\n", "date": "27 Aug 2017"}, {"text": "HI guys  anyone know actual user space in a p10 lite 32 gb ?", "date": "26 Aug 2017"}, {"text": "Php29000 for p10 and Php36000 for p10+", "date": "26 Aug 2017"}, {"text": "bring the p10 to the united states!", "date": "26 Aug 2017"}, {"text": "How much is the Huwawei P10 here in the Philippines?", "date": "26 Aug 2017"}, {"text": "Me too my laptop asus A43s can't access to p10 hotspot", "date": "24 Aug 2017"}, {"text": "\n \r\nI am reviewing as a user only,   using P10  for a while.I need only to share my experience to help people to choose with no other intention.\n \r\nThe design is good and sleek.  \r\nBattery back-up is good. \n \r\nBack camera (leica) is good if light is sufficient but in low light conditions it is far below my galaxy s 7 with less bright photos and more noise. My S7 camera is far better than that of my P10.\n \r\nMy p10 is always freezing when I start the default Video App. or sometimes even prompt that the app. is not responding and I can wait for it or quit. This is really annoying very poor indeed and make you feel that the phone is only a piece of metal crap. \n \r\nThese issues make me think that ((the P10 is not a flagship phone but actually a mid range phone with the design and price of a flagship)). \n \r\nP10 should be compared to mid range phones only such as galaxy A5 2017 but even this one has aspects that beat P10 for instance 16 megapixel cameras (but only lacks enough internal memory 16 gb is crap) and water resistant unlike the far expensive P10.\n\n\n\n\n", "date": "24 Aug 2017"}, {"text": "hi all the productive manager  \r\n  This phone the best phone for every iphone becoue iphone the camera mega pexl is less than this product.my name is abebe eshetu from addis abeba \r\nEthiopa i am a trader for this mobile thank you for thise phone inovatin\n\n", "date": "24 Aug 2017"}, {"text": "No, I have not had any heating problem, even when gaming. Though I'll admitt I'm not a heavy gamer, 10 - 15 minutes tops", "date": "23 Aug 2017"}, {"text": "Do you have any heating problem?? i bought it,and it has heating after using phone more than 15min(not gaming)", "date": "23 Aug 2017"}, {"text": "this phone is more cheaper than s8 , u11 and iphone 7 and its design and performance is the same \r\nso  i buy it surly", "date": "22 Aug 2017"}, {"text": "For gaming purpose buy one plus 3t or 1+5 or honor 8 pro not honor 8 ", "date": "20 Aug 2017"}, {"text": "hi evryone i wanna know that   is it just a little improvement on performance between950 and 960 like sd 820 or 821 or it is quite noticeable ? i wanna get honor 9 but its not available in my country also price is a bit more then my budget honor  9 is a great device but honor 8 is also one of the best 2016 device is it okey that i get a honor 8 note (i like heavy games and can't wait to play top heavy hight graphics games on my new device ) honor 8 is okey ? or I should wait for honor 9 to come in my country or better device then these in future \r\nim a gamer i like  performance not a camra lover thank you in advance for helping me out ", "date": "20 Aug 2017"}, {"text": "but but ... ?", "date": "19 Aug 2017"}, {"text": "Yes I believe it's new but with good manufacturing but Huawei is the king &#128081; ", "date": "18 Aug 2017"}, {"text": "But the truth is when come to real war this owesome p10 easily won the war, and I really enjoy when p10 overcome laggy samsung.... It ll hurt you samsung guys but  truth can't change..... &#128530;&#9996;&#65039;", "date": "18 Aug 2017"}, {"text": "p10 have a radio. \r\nbut in the specs. u guys do not mention that.", "date": "18 Aug 2017"}, {"text": "oneplus is best brand from china..not xiaomi...\n", "date": "18 Aug 2017"}, {"text": "S8??.. lol .. are u compairing  premium samsung flagship with china phone??... p10 doesnt even meet minimum requirements to match with it ", "date": "18 Aug 2017"}, {"text": "yeah its S8 but i think p10 has what it takes do be Relly good in gameing", "date": "17 Aug 2017"}, {"text": " I belive that S8 would be better for gaming. :)", "date": "17 Aug 2017"}, {"text": "I think Amin, you already know the answer to this.", "date": "17 Aug 2017"}, {"text": "What do you think is better in Gameing P10 or The samsung S8?", "date": "17 Aug 2017"}, {"text": "Lol looser huawei need water resistant", "date": "17 Aug 2017"}, {"text": "Works good for me when gaming...", "date": "16 Aug 2017"}, {"text": "Need waterproof Huawei beside that good phone with specs ", "date": "16 Aug 2017"}, {"text": "Hi,\n \r\nI've had this phone for almost 3 weeks now. I must say, it's gorgeous to hold and look at; light and fits well in the hand. I'll list the prositives:\n \r\n1. Screen size is just about right (for me that is) and is bright enough \r\n2. Battery will last through the day and then some if you are a light user. Heavy users will just have the day and a bit. Batter charging is very fast especially if it's 49% and below. You may not notice the 'super fast charging' if it's above 50% \r\n3. The camera is wonderful. Performs as expected especially during the day. Quality night time shooting will require a bit of tweaking the in-built camera app (Pro Mode) to get the best shots. My advice is take time to learn a bit of photography to get the best shots possible \r\n4. EMUI ver.5 is good. I'm a new user to the user interface and I find it easy to navigate. I have not enabled the App drawer and hence I have all my apps on the screen (like iPhone) \r\n5. The navigation 'button' will take a while (depends on how comfortable one is with it) to get used to (switching between apps and closing apps). A couple of days use for me was sufficient to leave it as the only button and for go the on-screen keys \r\n6. The fingerprint sensor (also doubles as the navigation 'button') is super fast. I hardly notice I have the sensor enabled. Its easy to use since one can store up to 5 fingers. For me I have a couple of the both left and right fingers. Note, every 3 days as a security measure, the phone requires one to enter the PIN number. It isn't bothersome; just something to do \r\n7. I have not experienced any lags, so the phone is smooth when switching between apps of screens \r\n8. I am based in East Africa (bought the phone locally and have the requisite version for this region) and yesterday (15-08-2017) received an update (VTR-L29C185B163, 529MB). It mostly dealt with battery optimization (for power consumption), Goolge security patches and twin app patches\n \r\nThe negative aspects of the phone...I'm still looking\n \r\nAll in all, I'd give this phone an 8/10 rating due to a combination of factors, namely: price (bought it for $ 475), size, camera, and smooth and quick operation. Would I recommend it to anyone? Yes I would...again and again (my girlfriend wants one!), though I'm not in an authoritative position to advice one which to pick between the P10 and another phone\n \r\nThanks", "date": "16 Aug 2017"}, {"text": "Good phone. Reliable and well designed. Only but so far: Charger is too bulky and the cord too short. The charger should be redesigned to be smaller and slimmer and the cord at least twice as long. \r\nGood job.", "date": "15 Aug 2017"}, {"text": "Looking to get this phone or the google pixel as they are both the same price and im wanting to venture away from the commercial iphones and Samsung products.  If you have either of these would you recommend either one and why?", "date": "15 Aug 2017"}, {"text": "well recently bought the fone i must say im impressed im a heavy user hasnt froze even once my onli prblm is th display. this fone is perfect but they must work hard on th screen res..super amoled is still boss", "date": "14 Aug 2017"}, {"text": "Not  a gaming phone. PROMISE", "date": "14 Aug 2017"}, {"text": "P10", "date": "12 Aug 2017"}, {"text": "mate 9 pro", "date": "12 Aug 2017"}, {"text": "P10", "date": "10 Aug 2017"}, {"text": "What phone size do you want? Then you'll know which one to choose. All other aspects between the two are the same.", "date": "09 Aug 2017"}, {"text": "Should I buy mate 9 or P10?", "date": "09 Aug 2017"}, {"text": "got that thingy today im impressed had a honor 7 premium before this is lighter with more durability and longer akku and an impressiv screen ", "date": "09 Aug 2017"}, {"text": "I am an iPhone user since beginning, but all my friends using Huawei say it is a good phone", "date": "08 Aug 2017"}, {"text": "I m useing Huawei mobiles since 2014, my 1st huawei g7 impressed me a lot due to its long lasting battery and after that I bought mate 8 that never hang for a minute in whole year super fast and smooth,  then honor 8 for 5 mnths n now p10 which is a really mind relaxing, I love  &#128525; it", "date": "08 Aug 2017"}, {"text": "U are a liar and bias person ...mobile has such no flaw...i have p10 ", "date": "08 Aug 2017"}, {"text": "I read some of the comments and honestly I think my P10 is the best Huawei phone I ever had. I used to be a Samsung fan and since I purchased my 1st Huawei it was the P9 Lite, and since then I won't change to another phone. The Huawei is user friendly, easy to operate and fast. I love the phone.", "date": "08 Aug 2017"}, {"text": "The phone is the worst I had- the camera is too bad - it only takes good photos once in a while - most of the time it is blur \n \r\nIn monochrome mode it is good , at the same time when I switch to Normal photo mode - I get dull and blur images \n \r\nI had tried all software update - in a nut shell this phone is not a good one to have \n\n", "date": "07 Aug 2017"}, {"text": "Ohhhh really..... ", "date": "07 Aug 2017"}, {"text": "Xiaomi is the best of China  \r\nHuawei is stupid one", "date": "07 Aug 2017"}, {"text": "P10 is a very good powerful phone no issue, just you need to taught your self that it's a phone,  not the only phone in world that u want it to be the last and perfect... Every month so many phones are coming so be limited and don't cross border you ll soon feel relaxed as I felt after realizing the fact... And now enjoying my p10 the king &#128081;  \r\n&#9786;&#65039; &#128522; ", "date": "07 Aug 2017"}, {"text": "browsing the WEB eats battery fast, chrome is top on the list of the power intensive app list. Also the phone is not good in terms of gaming, lots of lag showing and frame drops after they updated the phone the quality of the phone was lowered. I got a 150456k score on ANTUTU benchmark but after 2 months I tried it again and it went down to 120145? that is a very big difference. I got a little disappointed on this phone, I'm already planning to sell it in exchange for the iPAD 9.7 that is 200$ cheaper than the P10. This phone is GG.", "date": "07 Aug 2017"}, {"text": "No I'm not using the phone when is plugged in. ", "date": "06 Aug 2017"}, {"text": "No it's not normal for the device to heat up when charging. Are you using the device whilst its on charge? If not use the Huawei hicare app to contact them and they can help you. If it's within 3 months Huawei should swap the device without hassle if it is a hardware problem which includes the battery. Either way the device is under warranty so they will fix the issue if there's a problem.", "date": "06 Aug 2017"}, {"text": "I just bought p10 and when I'm charging its geting too hot.Its that normal ?", "date": "05 Aug 2017"}, {"text": "I always keep it on charge when it's charge left in between  20 to 30% n plug it off when it's charged 90%   and that's way it runs me full day... I m a heavy user ", "date": "05 Aug 2017"}, {"text": "Battery life u can say good but not that good as you said... In heavy use u can run full day n in average use may it run you 2... I keep it on charge at the end of every day.... N yes i m a heavy user  \r\n&#128522;", "date": "04 Aug 2017"}, {"text": "1. It takes 30min to charge upto 50%(super fast charging) \r\n2. Battery life is Fabulous. Extremely heavy use - full 1 day with 20% left, Heavy use - 1.5 days min, Medium use - 2 days min \r\n3. Screen is not amoled, but it's best normal full HD display in market right now. ", "date": "04 Aug 2017"}, {"text": "Loool! A brand can't be a reliable brand if you \"follow\"! Xiaomi is a bloody \"SHIT\" brand, pathetic qualityless phones, their bezel less phone mi mix is such a crap that it cracks completely after falling from mere 2ft!!! Huawei is completely unique style. Huawei is going to Introduce world's best Smartphone ever with bezel less screen ", "date": "04 Aug 2017"}, {"text": "Look forward for the mate10. I guess it will have minimal bezels. ", "date": "04 Aug 2017"}, {"text": "This is phone specs site not phone support. Best if you go to phone support or where you bought your phone.", "date": "03 Aug 2017"}, {"text": "I'm with ya, had this device for about 3 months now and find it does what ever I need it to do without issue. It may not have the greatest screen tech or be top on benchmarks but what it does give you is a all-round device. Only real criticism is there's no water resistance, which isn't really problem for me.", "date": "03 Aug 2017"}, {"text": "What? Please reword your sentence.", "date": "03 Aug 2017"}, {"text": "Please anyone can answer me!! Please my huawei p10 back camera glass and  the skin scratches all back can I get another back cause ", "date": "03 Aug 2017"}, {"text": "I wonder when Huawei will follow the footsteps of Apple Xiaomi and Samusung and make bezeless phones. ", "date": "03 Aug 2017"}, {"text": "For all those who have this phone, disable or uninstall all huawei service apps especially their health app as it drains the battery very quickly. Also, I noticed that reducing resolution doesn't visually change anything. ", "date": "02 Aug 2017"}, {"text": "Any one help me,, \r\nI have P10 dual sim 64 GB \r\nWhen i tap \"mibile network\" in \"more\" setting \r\nIt doesn't go through, just stuck and restart the network.", "date": "31 Jul 2017"}, {"text": "is there any difference between single sim and dual sim model,because in my country the single sim is 50 euro more expensive", "date": "30 Jul 2017"}, {"text": "Yep same here love my black p10 so far", "date": "30 Jul 2017"}, {"text": "Hello I'm tinking to buy p10  \r\nCan any of p10 user tel me  \r\n1...how long it takes to charge battery frome 0 to100% \r\n2... Bettry last for 4.5 hours of medium use....? \r\n3.... Is there a amolet time display on screen ...? \r\nThanks ", "date": "30 Jul 2017"}, {"text": "I got my huawei p10 dazzling blue last week. Love everything about it specially the camera. Rear camera is amazing, front camera I would say it's above average. Batter life is good. I got 4-5 hrs SOT with heavy usage (gaming, youtube, taking photos etc.) Supercharge is dope! I got 45% battery for just charging in 30 minutes. No complain about the performance, no lags, no stuttering, multi tasking in this device is great. Overall, I would totally recommend this device. Good job huawei!", "date": "30 Jul 2017"}, {"text": "There is 2880p like pictures? ", "date": "29 Jul 2017"}, {"text": "Having the fingerprint in from of the device is a pleasure to me, I can conveniently unlock the phone without picking it up and fully operate it. At work, I just leave the phone beside my pc keyboard when the screen lit up for notification, I just simply tap the finger print scanner and boom. I love it being in front of the device as it gives me more flexibility. Thank Huawei for the P10.", "date": "28 Jul 2017"}, {"text": "Is yours graphite black too? If so dont worry,its normal. My friend has a white one and it doesnt get as hot as black because of colour", "date": "28 Jul 2017"}, {"text": "How much screen on time do you get guys? i have iphone se and i wanna buy this phone but i am worried about battery.", "date": "27 Jul 2017"}, {"text": "Is it worth to but P10-Plus over P10?", "date": "26 Jul 2017"}, {"text": "Not we, I think you want it on back, because for me it is easy to unlock my phone when it is on table. \n\n", "date": "26 Jul 2017"}, {"text": "Imo i would never consider buying a phone without a headphone jack (mi 6)  \r\nBut that depend o you", "date": "26 Jul 2017"}, {"text": "you made a mistak on putting the fingerprint infront...what you did on the recent phones is the best it was unique and it was easier to unlock more than on the font..with the fingerprint on the back you can easily unlock your phone with one hand \n\n\n \r\nso please we want the fingerprint at the back ...", "date": "26 Jul 2017"}, {"text": "Spec wise, refer here\n \n \r\nMi6 has better performance than the Kirin 960 of P10. However, Mi6 availability and it's frequency bands maybe an issue to your country. P10 has better camera than the Mi6. P10 has also more color and back build options. Mi6 is cheaper than P10 though. It all depends on personal preference since both are superb phones. ", "date": "26 Jul 2017"}, {"text": "Does this p10 have chinese.", "date": "25 Jul 2017"}, {"text": "Xiaomi  Mi 6 or Huawei p10 which is better.", "date": "25 Jul 2017"}, {"text": "Check your otg cable. ", "date": "23 Jul 2017"}, {"text": "I just bought this huawei p10. I had an iphone 7 plus before this one. Before then i had a samsung s7 edge. And I have to say that I am very disappointed. All I'm really happy about with this Huawei is the photo camera on the back. Video is somewhat bad. The same applies to the interface and I will not start at the front of the camera at all. I would say if you have to buy a phone at this price go for a samsung galaxy s7 or s7 edge. For 650 dollars is far too much money for a phone that I personally think is a bad phone.\n", "date": "23 Jul 2017"}, {"text": "My brother bought it for me. :D. super nice phone and the camera is really nice too. far more better than my S7. haha. thanks for the info. :D", "date": "21 Jul 2017"}, {"text": "Do display dongle adapters work on this device?", "date": "21 Jul 2017"}, {"text": "no otg on my p10", "date": "21 Jul 2017"}, {"text": "It will not affect your data's APN settings. We do have same location. Where did you get your P10? ", "date": "20 Jul 2017"}, {"text": "Thanks for your advice. I think I will stick with the p10. Thanks again. ", "date": "20 Jul 2017"}, {"text": "Does updating lost APN settings of my Data?", "date": "20 Jul 2017"}, {"text": "If you want to spend extra the s8 does offer more. I would say the camera is equal if not better to the average user because the portrait mode is one of its best features especially in mono on the p10. Battery I find to be on par on both devices. If you're into benchmarking device speed the s8 will clearly be the device to have. The actual speed of the device is again equal, some apps load faster on p10 and others are faster on s8. Where at the point now where all flagship devices from 2016 to 17 have a lot more processing power to run every app in the app store with no problem. I would say it's down to personal choice on the UI and design. Also your getting wireless charge Bluetooth 5 iris scanner and so on if you get the s8 but a lot of the features feel more of a gimmick although it's nice having the option. Possibly the biggest advantage could be the ip68 rating on the s8 but again you have to part with a lot more of your money.", "date": "20 Jul 2017"}, {"text": "Just thought that the s8 has made more advancements than the p10. But the p10 is built well. Very fast fingerprint scanner \n\n", "date": "20 Jul 2017"}, {"text": "I just thought this phone was more basic than other new phones out at the moment. ", "date": "20 Jul 2017"}, {"text": "Totally agree.", "date": "20 Jul 2017"}, {"text": "Why would you like to get a S8? ", "date": "19 Jul 2017"}, {"text": "I have a P10 but I may change and get an s8. Does anyone have any suggestions?", "date": "19 Jul 2017"}, {"text": "Updates are good so just update it. Congrats! ", "date": "19 Jul 2017"}, {"text": "Hi, just purchase P10, about a week ago. \r\nprompt to Update, is it necessary to update my software? why?\n \r\nThanks ", "date": "17 Jul 2017"}, {"text": "why always hot?", "date": "17 Jul 2017"}, {"text": "It has a multi-use home button like the iPhone 7 and it's not mechanical (it doesn't move), it's just a touchpad with haptic feedback. But there's an option that allows you to use virtual navigation buttons on the bottom of your screen (like on P9 for example).", "date": "16 Jul 2017"}, {"text": "Does this phone have physical home, back and recents button or virtual button? ", "date": "15 Jul 2017"}, {"text": "Then what about the Find series? Is it not Oppo's flagship? ", "date": "13 Jul 2017"}, {"text": "Sorry, R series is OPPO flagship. \r\nI can agree R9 is not that flagship, simply because of the usage of midrange processor (SD625, SD652, SD653), but the same cannot apply to R11's SD660 processor, which is almost as powerful as Huawei's Kirin 960. \r\nOther things are down to brand perception, OS optimization, camera optimization, and also preference. \r\nIf I got to choose, both I also don't want to purchase, simply because both also using crazy marketing gimmick to boost their sales rather than honest to their phone's capability, and sold at a price that is not match to their product value.\n", "date": "13 Jul 2017"}, {"text": "Download APP2SD. That help you to move apps from phone to SD card. Works perfectly.\n", "date": "12 Jul 2017"}, {"text": "Can any P10 owners confirm whether it supports USB-on-the-GO? and does one even get USB-C on-the-go adaptors/cables?\n", "date": "12 Jul 2017"}, {"text": "thanks for the reply!", "date": "12 Jul 2017"}, {"text": "You r right.. ur answer is based on fact.... P10 is an amazing device..... ", "date": "12 Jul 2017"}, {"text": "R11 is in the upper mid-range class while the P10 is a flagship class. R11 is surprisingly good in terms of performance, overall design, and the camera is great! You can check out the review. R11 is worth your money. But as for me, I would easily choose P10 over the R11. ", "date": "11 Jul 2017"}, {"text": "considering between the P10 and the OPPO R11. which should i get?  \r\nand...does the P10 heats up when taking pictures? ", "date": "11 Jul 2017"}, {"text": "till today\n \r\nim glad that i chose the P10 OVER THE S8", "date": "11 Jul 2017"}, {"text": "got huawai p10 qtr-l29 does not work in usa!.  t)", "date": "11 Jul 2017"}, {"text": "That's because this phone is showing you the megabyte per second while the other phones are showing megabit,  yes there is a difference between Mb and MB,  convert your Internet speed from 200 megabit to megabyte and you will see the speeds are correct and you are in fact not getting a drop in connection but rather you are shown just a different for of identification.  For instance I am on a 250Mb line but that's 250 megabit,  my actual Internet speed however is showing approx 40 megabyte down and 10 megabyte up which is correct for that megabit (with of course distance from from infrastructure and placement on the line) ", "date": "09 Jul 2017"}, {"text": "I believe P10 is still cheaper than the mate 9. You can consider the Honor 9 as well or the latest nova series, they are not that pricey. P9 is also a good choice. ", "date": "07 Jul 2017"}, {"text": "Good luck.", "date": "07 Jul 2017"}, {"text": "Great review on it guys but I don't understand how I get 144714 with a bunch on stuff on the phone and you Antutu6 6 126xxx? Anybody want to take a guess at it?", "date": "07 Jul 2017"}, {"text": "What compilation do you have? For example i have vtrl09c432b150 you can see in about the phone.", "date": "07 Jul 2017"}, {"text": "the battery being non removable turned me off", "date": "07 Jul 2017"}, {"text": "Battery life not very good. Doesn't last n full day. Any reason.? ", "date": "07 Jul 2017"}, {"text": "I got my  p10 3 days ago.  The battery does not last n full day.  ", "date": "07 Jul 2017"}, {"text": "hi all....considering that p10 is out, I am torn apart between p10 and mate 9 ...I want to have a phone with good camera quality..so am wondering beside huawei..any other brand that is good and not that pricey?", "date": "07 Jul 2017"}, {"text": "yes", "date": "05 Jul 2017"}, {"text": "its like you confused between buying samsung A5 or S8 ... it has different range, honor6x on mid range and p10 is huawei flagship. if you have budget surely go for p10. if not, 6x also worth for its price ", "date": "05 Jul 2017"}, {"text": "I am confused whether I'll go for Honor 6X or the P10. I want to consider which phone is worth the price.", "date": "05 Jul 2017"}, {"text": "Yes, P10 has the better build quality but the P9 has the better look", "date": "04 Jul 2017"}, {"text": "I'm saying that P9's design is much better coz it looks like a flagship than a P10's Mid-range look. Just look at that home button at first i tought it was a Meizu or vivo or something. ", "date": "04 Jul 2017"}, {"text": "\"improving on everything the P9 introduced - the build quality, the finish,...\" That's according to GSMArena. Whom shall we believe then? You or them?", "date": "04 Jul 2017"}, {"text": "When the predeccesor has a way more better design. ", "date": "03 Jul 2017"}, {"text": "As posted earlier I contacted Huawei, had to give them the IMEI, build number and the place and date of purchase. They sent me a reply informing me this is a software problem that will be fixed on the next software update. The more people contact Huawei over the wifi connection speed the faster they will have to react to this problem and give us this update that we need.", "date": "03 Jul 2017"}, {"text": "I am having the same issue in the UK with WIFI connection speed.  The broadband is running at 200mb but the P10 wont go above 30mb.  The iMac, Windows Laptop, iPhone SE, HTC One Me and Nvidia Shield all run between 150 and 200.\n \r\nThis must be an issue with the phone.  Tried so many devices and on so many networks with nothing over 30mb?!?!?!?!", "date": "03 Jul 2017"}, {"text": "i just got a. p10 as i was a huge fan of the p8...ive hads it for nearly a month and im undecided if i like it...the one major issue i have is the random freezing ....everything just freezes up cant power down, no touch works , eventually after holding power button for a minute plus it finally restarted.....and its about once every two days it happens...thinking of returning it...lg g6 would be a better option ...my opinion anyways", "date": "02 Jul 2017"}, {"text": "Hi,I am at buying a new phone and I am stuck between huawei p10 and lg g6 or maybe a s7/s7+ ,what is a better option?\n", "date": "01 Jul 2017"}, {"text": "Buy the p,, 10 lite it's much better and the blue one", "date": "01 Jul 2017"}, {"text": "Huawei sucks very poor battery only 3200mah. At least they should have put 3500mah above. Overall its good.", "date": "01 Jul 2017"}, {"text": "Whoow, good to know! Thanks bro!", "date": "01 Jul 2017"}, {"text": "Got a reply back from Huawei and they ensure me my wifi problem is because of a software issue that will be fixed on the next update. Just got to wait and see.", "date": "01 Jul 2017"}, {"text": "Bought a Huawei P10, phone was overheating and now is on repair for 5 weeks and nobody on customer service Huawei cares about it. Disappointing.", "date": "30 Jun 2017"}, {"text": "D130Mbps U109Mbps on 600Mbps network with DT WRT3200ACM", "date": "29 Jun 2017"}, {"text": "I had bad experiences with upgrading to newer versions of Android also with Samsung phones (mid-range ones). But, this is the case with Android OS I guess, and sometimes can be only bad luck.  \r\nBut at least, they get updated, I had at some point a chinesse smartphone (sold in some brand name in my country) and I didn't get any updates for 1 year (I mean no security updates, camera improvements, nothing).  ", "date": "29 Jun 2017"}, {"text": "Does the 20 MP color mode uses the 2 camera? And does the 12 MP color mode uses the 1 cam only? ", "date": "29 Jun 2017"}, {"text": "Hoping this will be fixed with future updates. Perhaps Huawei mistakenly capped the internet speed. As for now, this really does not matter to me since our internet speed here in our country hardly exceeds 5 mbps. Hahahaha. Do post an update here please. ", "date": "28 Jun 2017"}, {"text": "I upgraded my P9 lite to nougat and it crashed the motherboard. Huawei told me not to upgrade any lite model P8 or P9 to nougat", "date": "28 Jun 2017"}, {"text": "just purchased my P10. Facebook dashboard do not display on how it was suppose to be. went to service center but they point the error on wifi and date connection. im'm just sad. :(", "date": "28 Jun 2017"}, {"text": "What download speed are you reaching pls? Also I'm in the UK which country are you from because I'm wondering if the wifi issue may be a problem with certain units.", "date": "28 Jun 2017"}, {"text": "this phone or G6?", "date": "28 Jun 2017"}, {"text": "My wifi is connected easily and speed is great i dont think it has any issue ...i have been used p1o since april...i dont find any issue", "date": "28 Jun 2017"}, {"text": "I'm also having issues with download speed, only reaching 30mbps on a 200mbps connection. I have tried multiple tests using different internet providers, still getting same results. All my other devices reach over 150mbps on same connection. I have tried everything to improve the wifi speed but no joy. I have also contacted Huawei and had a conversation with someone on there support team who told me that he was unaware of this issue and gave me a email address in order to get better information. This is not a problem with any other part of the device and I fell luck when testing the memory speed which was ufs 2, another problem that other owners are unhappy about. I am now waiting for a reply from Huawei to explain why this problem exists on a 2017 device. Hopefully this is a software issue that an update can fix.", "date": "27 Jun 2017"}, {"text": "Planning to purchase Huawei P10 next month. Really like its design. Recently, I watched performance comparison of iPhone 7, S8, G6, and Pixel. P10 performs well but seems it has issues with WiFi. I don't know but it only had reached 26mbps compared to the other 4 who reached 100mbps+ and they used same WiFi connection. Anyone?", "date": "27 Jun 2017"}, {"text": "My friend have a huawei p9 he got a update android nougat and emui 5.0 he is using almost 1.2 years", "date": "27 Jun 2017"}, {"text": "Its gorgeous my more than 2 yrs old P8 lite still gets updates", "date": "24 Jun 2017"}, {"text": "There is still less expensive than a Samsung S8.  \r\nBut, I wanted to ask, if you had Huawei phones in the past, how are their software updates going?  \r\nBecause in my experience, when it comes to software updates, Sony is the best around. How is Huawei comparing to them?  \r\nThanks. ", "date": "23 Jun 2017"}, {"text": "If you say you are custom with Samsung Android skin, than you probably will feel better with a Samsung S8. But, just for the fun of changing things around, you can't go wrong with a Huawei P10 either. In my opinion they are both very good phones.  \r\nGood luck!  ", "date": "23 Jun 2017"}, {"text": "so I am currently stuck in the position of purchasing either the s8 galaxy or the p10 .....I am impressed with the p10 features but ive become accustom to the Samsung range .....just some advise on which to get   ", "date": "23 Jun 2017"}, {"text": "This phone is so nice and elegant... about the specs WOW! you would love it too!!!", "date": "22 Jun 2017"}, {"text": "Hi, I'm from South Africa, I just got offered the P10 on a 2yrs contract. Please tell me more about it & if I should take it? How about the P10 plus?", "date": "22 Jun 2017"}, {"text": "Gorgeous device, had it for about 3 weeks and it is flawless. \r\nThe camera is the best aspect of the device, especially at night it is very good. \r\nWould recommend the device although it is a bit expensive.", "date": "20 Jun 2017"}, {"text": "I love the p10 but I'm not going to deny that the device gets hot when using the camera for longer than 15mins. Also when playing graphic intensive games, though I haven't noticed any decrease in performance when it does heat up. Other than that it's a very quick device with no lag that I have come across as yet. I have had the device for 2 months now and still very happy with it.", "date": "19 Jun 2017"}, {"text": "Thanks", "date": "19 Jun 2017"}, {"text": "I've never had any warm issues with my p10. ", "date": "18 Jun 2017"}, {"text": "Really warms ???", "date": "18 Jun 2017"}, {"text": "it is not the best place to ask opinion, I think if you go the iPhone SE opinions and ask a same question they will suggest that phone for you.\n", "date": "16 Jun 2017"}, {"text": "yes", "date": "16 Jun 2017"}, {"text": "hello, I would like to know if the included charger can support Huawei SuperCharge out of the box? ", "date": "16 Jun 2017"}, {"text": "That is selfi feature of this phone to take clear and bright selfi like apple iphone", "date": "16 Jun 2017"}, {"text": "hi to all when using font camera at night white screen before shot..", "date": "15 Jun 2017"}, {"text": "this one", "date": "15 Jun 2017"}, {"text": "This is my first high end phone in a while since the ip5s and I had it for almost two months now. I'm so effin in love with it.  Like seriously. Battery life, camera performance, specially on low light.  But the camera is not really the point and shoot kinda thing. If you'd like to really get hd pictures, you need to learn about the manual mode. Kinda difficult at first but you'll get the hang of it. If you're thinking about buying this phone, go ahead. I want to try other phones as well so I might swap this phone to a high end phone in a month or two. ", "date": "15 Jun 2017"}, {"text": "This one or s7 edge?", "date": "14 Jun 2017"}, {"text": "Sorry that was my mistake that I set my mobile screen on 15sec auto off after inactivity.... It's perfectly fine doing after b133 update... A very good and stylish device love and happy to hv this beast in beauty", "date": "13 Jun 2017"}, {"text": "I 2nd the motion.!!!", "date": "13 Jun 2017"}, {"text": "you need to boot to recovery mode to wipe cache", "date": "13 Jun 2017"}, {"text": "Definitely huawei p10", "date": "12 Jun 2017"}, {"text": "Why iPhone this is much beter got bether cameras beter procesor larger screen and I think beter battery life so go with p10\n", "date": "12 Jun 2017"}, {"text": "Update to what excuse my ignorance", "date": "12 Jun 2017"}, {"text": "Seem like a nightmare to me to have a phone like this", "date": "12 Jun 2017"}, {"text": "What is wiping cache?", "date": "12 Jun 2017"}, {"text": "Any reviews about battery life heating problems?\n", "date": "12 Jun 2017"}, {"text": "Huawei P10", "date": "12 Jun 2017"}, {"text": "I suggest the Huawei P10", "date": "12 Jun 2017"}, {"text": "This or iphone se? I badly needed some opinion. Thanks", "date": "11 Jun 2017"}, {"text": "got mine .. and i love it .. I love the specs .. the use of the camera too.. ", "date": "11 Jun 2017"}, {"text": "just recently upgraded to b133 and im not experiencing that kind of issue", "date": "10 Jun 2017"}, {"text": "planning to buy this phone in 2 months, need some opinions about this phone", "date": "10 Jun 2017"}, {"text": "May be all this negative comments are from the competitors", "date": "09 Jun 2017"}, {"text": "I want to buy this phone in next 2 month...\n \r\n Can I get some advise what should I check this phone when i buy it like \r\n \"using camera n feel the temperature n the latest update\"..\n \r\n Hope anyone can help me...TQ...\n \r\nNaka  \r\nMalaysia", "date": "09 Jun 2017"}, {"text": "If you have just bought the phone then this is due to the battery saving app that anaylzes your  usage and then modulate the necessary factors to increase the battery life.. This app works for a couple of weeks maybe less.. And then it automatically stops", "date": "08 Jun 2017"}, {"text": "After b133 on my p10, games after 5 second of inactivity screen became off, I think it's for better battery life . Is it for all user there after b133 update or just my device.... Plz reply", "date": "08 Jun 2017"}, {"text": "i also facing the same problem, battery drain quickly, i suggest to drain the battery until the phone turn off automatically and then charge using fast charging, then when it goes to 4% turn again the phone and leave it until 100%. and wait again up to 20 min of 100% charging and remove the plug, it will relearn or refreshing the battery status and voila. maybe this will helps you.", "date": "08 Jun 2017"}, {"text": "ît is a Flash for better capture of the Image. lol ", "date": "07 Jun 2017"}, {"text": "Plz help.... After b133 update my front camera when I take selfie, the screen become white while taking photos for 2 to 3 second.... What is this?how it can be fixed or its normal and all other user have it too... Plz help", "date": "07 Jun 2017"}, {"text": "What is the latest update for p10, I update recently b133 any update next then b133", "date": "06 Jun 2017"}, {"text": "I have problem with adaptive selfie(automaticlly wide angle mode on front camera) with new b133 update he does work..Do you have same problem?", "date": "06 Jun 2017"}, {"text": "update: mine works perfectly fine after wiping cache no heating issues while playing heavy games or charging or using the camera. SOT- 4-5 hrs playing mobile legends non stop with facebook running in the back ground and google chrome while on mobile data. hopefully it will be permanent. cheers", "date": "06 Jun 2017"}, {"text": "Yep you r right I m Huawei,s fan too I love this phone size and everything so far.. I hv heating issue when talks but it does not effect me, I love it,  it's so fast n attractive. I just pick it in black color because mate attract me then diamond cut.... ", "date": "05 Jun 2017"}, {"text": "I bought this phone a few days ago, when i shaky at the top of back side is like loose", "date": "05 Jun 2017"}, {"text": "My my, why am I reading all this negative things about this phone? I have had 1 for 3 weeks now, and this phone is amazing. NO battery issues. My battery lasts me between 2 and 4 days on a single charge. As for heating issues, absolutely nothing. Never, no matter what I do. This is the best phone I have ever had, and I won't change it. With all the features and the best and fastest camera today, what more do you want. If you want a bigger screen, then get a phone with a bigger screen. Don't buy this one, and then complain. Hauwei, nice one, forever your number one fan.", "date": "05 Jun 2017"}, {"text": "My p10 when talking gets hot like burning n 2nd issue  when I click Bluetooth in notification lid then it is not turned off by clicking again til I have to go to main settings n turned it off there, is it OK n any one out there have this issue too", "date": "05 Jun 2017"}, {"text": "I try wiping cache and see if it will work and the issue still persist im going to get a replacement anyways it's still under warranty", "date": "05 Jun 2017"}, {"text": "Your phone is defective then because mine, after I updated it phone works properly even in gaming. No heating issues.", "date": "04 Jun 2017"}, {"text": "Just update your phone bro.", "date": "04 Jun 2017"}, {"text": "Same problem I was facing but thanks for the customer service of huawei they update my phone now there is no heat problem and whenevwr I try to use dual wtsapp  battery drain very quickly so my advice do not use dual wtsapp only use one... And then you will get 24 hrs battery timings or more..... ", "date": "04 Jun 2017"}, {"text": "when using the phone for games and web browsing with mobile data on phone is working fine no heating issues or lag whatsoever. the only time I experience heating issue is when using the camera and while charging but not too much heat..battery is good so far 4-5 hours on mobile data while playing online games and facebook, no battery drain while idle I sleep around 7:00PM with 19% battery and woke up around 11:30PM and battery is still 19%", "date": "04 Jun 2017"}, {"text": "it started since I update my device to b133", "date": "04 Jun 2017"}, {"text": "Update your phone bro", "date": "04 Jun 2017"}, {"text": "Go to Smart assistance, you will find what you need there. Also update your phone for the newer version for battery problems.", "date": "04 Jun 2017"}, {"text": "update your phone bro.", "date": "04 Jun 2017"}, {"text": "Update your phone bro.", "date": "04 Jun 2017"}, {"text": "For the users that has problem with the battery, there's a new update the optimizes the battery performance update is about 638 mb. I already updated mine and the phone works perfect but I guess they optimized the cpu's work because the games that I played on the phone somehow is dropping frames already from 60 on the previous version now is dropping to 55 to 50 on the new update. But its okay phone is no longer heating :) nice job Huawei team.", "date": "04 Jun 2017"}, {"text": "hi just bought a p10 recently and I notice that the phone is getting warm while using the camera. I snap 2-3 pics and the gets warm is this normal??thanks", "date": "04 Jun 2017"}, {"text": "Hi I just bought a P10 I always play games on my phone mobile legends and lords mobile and im always using data. from 100% down to 30% for 3 hrs of playtime vice versa with lords mobile and mobile legends. is that good enough for the battery??TIA and sorry for my bad English.\n", "date": "04 Jun 2017"}, {"text": "wow is beatiful phone i work everyday with him its great ", "date": "03 Jun 2017"}, {"text": "Huawei does get hot for me when using the camera for more than 10 minutes. This is because the cpu - gpu has thermal paste going directly from the processor to the back metal case to dissipate the heat directly through the case which is how all phones release heat but not with thermal paste. A lot of the new phones now come with a small cooling strip which are designed to contain some liquid or gas fluid to help thermal throttling which happens with processors restricting performance to cool down the phone at certain temperatures. This was the case since the snapdragon 810, possibly the worst chip ever made by Qualcomm. I think this heat is quite normal for this phones design as it is very thin with a large battery for the size of the phone, although I would of expected the battery to last longer considering the screen resolution of this device. I feel future updates should concentrate more on battery life as I feel it's more to do with software than hardware issues. Certain cases can also Effect the heat on the device trapping heat rather than releasing it.", "date": "02 Jun 2017"}, {"text": "Yes. My phone becomes very hot", "date": "02 Jun 2017"}, {"text": "I experienced HUAWEI P10 for more than one month. The worst phone out there in the market of the similar price category. First problem: In back to back touch with other phones the HUAWEI P10's screen lits up. Meaning unnecessarily opening the screen of phone. Second Problem: the phone becomes unnecessary hot while browsing net or taking with. ", "date": "02 Jun 2017"}, {"text": "Disappointed with the design of the Huawei P10 device, Huawei was known for it's unique buttonless design smartphone devices with it's previous P series designs and the new P10 now replicates the design of the S series from Samsung smartphone design.", "date": "02 Jun 2017"}, {"text": "I've been using it since day one, officially. (31st March) \r\nFull format one time due to it's battery consumption.  \r\n 5 to 6 hours (100% of charging) but not all P10 users face the same problem, only a few... I am one of them. \r\nIt did overheating which happened occasionally, so the best way is to turn it off for a while.\n \r\nMy advice... go for Huawei P10+... you will enjoy it more. \n", "date": "01 Jun 2017"}, {"text": "is there any info when it will be available in india ?.. and what would be the price of p10 ?.. ", "date": "01 Jun 2017"}, {"text": "Hi, can dual sim both support LTE at simultaneous?", "date": "01 Jun 2017"}, {"text": "Hi! I have a problem with instagram. Although my location is turned on for the app, it won't find any location. I reinstalled instagram, still nothing. Any suggestion?", "date": "01 Jun 2017"}, {"text": "yes. harassment filter", "date": "31 May 2017"}, {"text": "im having issues with the battery before. then i saw the mobile network settings, carrier aggregation and data mobile always on.. that prolongs my battery.. just another tip but this wont resolve if your using mobile data for your streaming.. and by the way do not use other charger.. you may use 4-4.5A chargers.. :)", "date": "31 May 2017"}, {"text": "This is the worst phone i ever had. The battery is not lasting at all and many time it is hang while taking the contact. Very difficult to take a contact details while driving.It can take only from the contact on the dialer and favourites no search area. only good in this phone is the camera nothing else. I am very disappointed about this phone with this price. Even half of the price it is not worth  ", "date": "31 May 2017"}, {"text": "So why didn't you just get the Plus version if you have a problem with the screen size?", "date": "31 May 2017"}, {"text": "64Gig on Board memory. \r\n4Gig Ram", "date": "31 May 2017"}, {"text": "I have this phone now, my complaints are: \r\n1. Battery. If you're a heavy user, expect just ~5 hour full usage of internet/browsing \r\n2. Screen size is quite small for a flagship phone, not used to it. \r\nBut aside from the said cons, the rest are VERY GOOD. SPECIALLY THE CAMERA, the super fast charging, the voice commands, the very fast (literally) fingerprint sensor and yeah the LAGLESS performance.", "date": "30 May 2017"}, {"text": "Even basic phones have that option so....", "date": "30 May 2017"}, {"text": "my laptop cannot connect with my p10 hotspot...somebody got the same issue? \r\nmy laptop is dell latitude 3470 & Asus A45V..both cannot connected with the hotspot.", "date": "30 May 2017"}, {"text": "Yes it does. ", "date": "28 May 2017"}, {"text": "Does this phone have number blocking?", "date": "28 May 2017"}, {"text": "You can go to dealer for one to one exchange. My friend did it", "date": "27 May 2017"}, {"text": "battery charging is fast and not generate much heat", "date": "27 May 2017"}, {"text": "is it okay to update EMUI 5.1?", "date": "27 May 2017"}, {"text": "Storage is ~50gb out of box for 64gb model.  Source: p10 owner from today", "date": "26 May 2017"}, {"text": "U are a liar", "date": "26 May 2017"}, {"text": "Battery performance is very good..u made a false statement and no heat issue", "date": "26 May 2017"}, {"text": "16gb", "date": "26 May 2017"}, {"text": "Cheaper then many other flagships. Had no problem with battery send it back.\n", "date": "24 May 2017"}, {"text": "P10 \r\n-Better Battery Life \r\n-Better CPU \r\n-More Stylish \r\n-Better Camera\n \r\nAlso S7 is out dated ", "date": "24 May 2017"}, {"text": "P10", "date": "24 May 2017"}, {"text": "32GB or 64GB and has an expandable storage slot to store up to 256GB", "date": "24 May 2017"}, {"text": "64GB plus memory card slot. ", "date": "24 May 2017"}, {"text": "My P10 Work normal", "date": "24 May 2017"}, {"text": "Hi, \r\nis there anyone already own the P10 can tell how much available storage out of the box? \r\nneed to know how much the system taking up storage space.\n \r\nthanks! :)", "date": "24 May 2017"}, {"text": "S7 \n", "date": "23 May 2017"}, {"text": "Poor battery performance and excess heat. Too expensive. First time experience using huawei and i disappointed.", "date": "23 May 2017"}, {"text": "P10 or S7", "date": "22 May 2017"}, {"text": "huawei p10,,\n", "date": "22 May 2017"}, {"text": "I'm from Ghana!!!!! Guys!!! how did you see the gorilla glass 5 ?  \r\nHuawei will step ahead with this p10 and poaches design mate 9.... \r\nWe are waiting for mate 10!!  \r\nAsk me about huawei P10", "date": "22 May 2017"}, {"text": "get the Huawei honor 8 look it up on youtube", "date": "21 May 2017"}, {"text": "I'm here to ask some of your advices, is that should I buy Huawei p10 plus or oppo F3 plus? Bcoz I used to text a lot. Which one is better? Thank lots!!!!", "date": "20 May 2017"}, {"text": "This is probably true. 5.0 GHz seems to have an issue with that but on 2.4 GHz apparently it's fine.\n \r\nAs I have a 802.11 a/b/g/n/ac Dual-Band router I luckily have no issues on 2.4 and 5.0 GHz  \r\nWi-Fi ever.\n \r\nI have a P9 btw which does not suffer from these issues. I wouldn't upgrade to a P10 myself haha because I already got the P9.", "date": "20 May 2017"}, {"text": "Huawei P10 is a great phone.It has better camera than iPhone 6.The battery and display are better than iPhone 6.I don't know so much avout this phone.But I know this phone is great and cheaper than other flagships on the market. But if you love the Apple iPhone 6, just go and get it. It is your choice. ", "date": "19 May 2017"}, {"text": "great spec except that camera is aweful. f/2.2 is really bad nowawadays", "date": "18 May 2017"}, {"text": "I actually bought this phone over Samsung S8. I own iPhone 6S atm and I'm switching to P10 (android) now. My friend who works at T-mobile gave me S8 and P10 for 2 day testing and i like P10 more. True that S8 has better spec and it is \"next gen\" phone but P10 has some fearures that work a lot better for me. Fingerprint is great, slider on home button is pretty cool and hany, pfhone quality is very good. It fits hand like a charm. Overall there isnt a thing not to like. And my favorite is fast charging - i use phone for surfing and busainess all day so this is my key fearure. Cam is good - in range of iPhone 6S which has awesome cam - didnt test video yet. Overall P10 is a great premium phone, with great slick and lux design, some smart fearures and reasonable price. I rhink this is a good choice and reliable phone. (I concluded this jn 2 day testing hahha) Aleo, friend who works at t-mobile alao ordered P10 for himself so that is a plus for me", "date": "18 May 2017"}, {"text": "give it some time...at first my battery life was ugly but after 2,3 days it was great... i think new emui identifies and control battery usage according to the user", "date": "17 May 2017"}, {"text": "Is Portrait mode better than iph 7 plus?", "date": "17 May 2017"}, {"text": "The best Phone ever I had", "date": "17 May 2017"}, {"text": "the best p10 i have it!!", "date": "15 May 2017"}, {"text": "Tq for your response. But i watch on utube show p10 speed(on wifi/network) are slow. Is it true??", "date": "15 May 2017"}, {"text": "P10!!! \r\nBest phone i ever had", "date": "15 May 2017"}, {"text": "what should i buy, huawei p10 or xiaomi mi6(128gb rom)", "date": "15 May 2017"}, {"text": "I've bought it,  this product have good feature like good camera both of camera are Leica,  4g plus support with cat 12, very fast fingerprint and very handy. ", "date": "15 May 2017"}, {"text": "Must  p10", "date": "15 May 2017"}, {"text": "Hi \r\nShould I buy s6 edge or p10", "date": "14 May 2017"}, {"text": "I just purchased the p10 yesterday, and my Bluetooth kept malfunctioning :( I cannot pair my wireless headphones :( And my battery runs out fast!", "date": "14 May 2017"}, {"text": "Hi,I planning to buy this phone because its spec and smaller size that really handy for people who always on the go like me,For those who already bought it,can you share info about battery life,what the best screen on time did you get.? Camera Quality.? and the performance itself..please help guys", "date": "14 May 2017"}, {"text": "I am using this phone for a month very good and very reaponsive this is thd first time in  3 years i use a small phone and i don't regret it super fast great cam and a very good battery life i recomend it ", "date": "14 May 2017"}, {"text": "If talking about truth every year n every month coming new flagship from different companies, there is nothing perfect just need to choose according to choices  n preferences so choose what is on your top... And be happy ... I really like p10 it's compact small thin design   that's why choosing it..... ", "date": "13 May 2017"}, {"text": "exactly! if Huawei goes on like this they'll face the fate like blackberry and nokia", "date": "13 May 2017"}, {"text": "No innovation, Poor battery performance, flagship pretender camera,  Lame touch sensitive FP scanner (absolute horror), and the price jesus christ!  Your not even getting an amoled screen.This phone should be around $450-500. Over here in at my place, i can already see people selling this off after 1 or 2 weeks and nobody is willing to buy it even at $50-100 cheaper. This ain't a flagship killer, its a flagship suicider. ", "date": "12 May 2017"}, {"text": "best phone in price categori !!! &#128512;", "date": "12 May 2017"}, {"text": "Anyone encounter an issue with Bluetooth connectivity?  I bought a Bluetooth shutter remote and it is not connecting at all.   Just pairing but not connecting.  ", "date": "12 May 2017"}, {"text": "LG G6 with its price drop is competitor to Huawei p10.", "date": "11 May 2017"}, {"text": "Please anyone give me this phone's competitors and tell me how this is better than the rest. I'm searching for the best phone in this phone's price range. ", "date": "11 May 2017"}, {"text": "Please anyone give me this phone's competitors and tell me how this is better than the rest. I'm searching for the best phone in this phone's price range. ", "date": "11 May 2017"}, {"text": "i wanted a compact and low weight phone. i own both p10 and x compact. p10 is faster and has great camera and battery life but x compact is great for me for everyday usr as its charging slightly faster than my p10 and more handy and also sony update security patch every month but huawei not", "date": "09 May 2017"}, {"text": "I propose the p11 will using the Samsung 2×12mp(f1.7) in rear side and 12mp(f1.7) in front side.They will be best camera phone in the world.", "date": "09 May 2017"}, {"text": "make yourself a favour and consider the price difference between the p10 and s8 of $300+. btw I've never seen 'any other Chinese phone' in this dark blue colour and have a glass and brushed metal combination and a dual camera setup, have you?", "date": "08 May 2017"}, {"text": "Defintely i would choose P10", "date": "08 May 2017"}, {"text": "I have and it looks and feels great. I purchased a tempered glass protector from amazon and its much better than the factory fitted plastic one. Feels like it will protect the screen better and doesn't show fingerprints as bad.", "date": "08 May 2017"}, {"text": "Mi5 fits all your demand", "date": "07 May 2017"}, {"text": "Advantages of front fingerprint: \r\n1) makes use of the bottom bezel. Huawei not ready for bezel less phone and FP inside display not ready yet.\n \r\n2) can use the display in full by getting rid of the on screen navigation bar.\n \r\n3) rear fingerprint is a big pain if you want to turn on screen when phone is on the desk. Every time you have to pick the phone or otherwise type the password. ", "date": "06 May 2017"}, {"text": "Hi ..should I change the factory fitted screen protector?", "date": "06 May 2017"}, {"text": "P10 is a great phone, but why did you move the fingerprint scanner from the back to (front-mounted)? That was your trademark.", "date": "06 May 2017"}, {"text": "Looks like any other chinese phone...Very difficult to get accessories...And resell value next to nothing. If you are here it means you like phones. So make yourself a favor and buy the best, you will have pleasure every day: S8 !", "date": "06 May 2017"}, {"text": "I have a P10. And I think(from my personal opinion, I. Think it is a great phone. Super fast, very fast charging, quick response on finger print scanner. I got a day half out of the battery with moderate use. Solid build body. It is all down to preference. But in my opinion it is a very good Phone. 10 out of 10.", "date": "05 May 2017"}, {"text": "I'm struggling to chose between this a7 2017 or Huawei p10. Help me bec I'm after if which of these things are better vis a vis \r\n1.UI \r\n2.SOFTWARE SUPPORT \r\n3.SCREEN \r\n4. BATTERY \r\n5. GAMING", "date": "05 May 2017"}, {"text": "Can I know, this phone have cut off charger?", "date": "05 May 2017"}, {"text": "I used to be a samsung fanboy  i lived the note series accept the note 5 cz no sd card then i used htc then bought sony z5 premium  it was a good phone but wben my sony got totaled i bought the huawei p10 and guys i say this with honesty it is a beautifull phone battery that just won't die beautifull fhd diaplay, pro front and back camera, fast phone a very fast one,  sd card&#9786;&#65039;, and even a good speaker and the design it may be looks like an iphone but it is way better and the ui is close to stock as possible, fingerprint is ultra fast i have no reason at all to complain about,  before u judge it try it  you may end up wowwed by what that phone can do and for the record this is the first time in 4 years i used a small 5.1 display and i had no trouble adapting to use a smaller display. Huawei you are doing good  keep it up and you may end up the  world's best. DON'T JUDGE THIS PHONE BEFORE YOU REALLY TRY IT. ", "date": "05 May 2017"}, {"text": "Sad phone with iPhone design", "date": "04 May 2017"}, {"text": "As far as I know there's a feature of EMUI wherein you can hide an app. I think this feature is available the old version of EMUI. The latest does not have. It is just weird why did they removed that feature or is it a bug of the latest version. I hope they get it back soon.", "date": "04 May 2017"}, {"text": "I don't intend to disable it, just hide. In past version of EMUI hiding the application is an available feature. Did they intentionally removed the feature to hide the app icon or is it a bug? I already tried to reach the EMUI team but they don't have a respond so I am guessing it is a bug. Hope there is a fix ASAP.", "date": "04 May 2017"}, {"text": "we got the same issue :D but still, I love the phone.", "date": "03 May 2017"}, {"text": "You don't have this phone actually, so sad.", "date": "03 May 2017"}, {"text": "You cant hide the apps, but you can disable them.", "date": "03 May 2017"}, {"text": "I just got this phone 2 days a go and the phone is perfect, fast, but to get this phone running totally fast you need to somehow disable a few running apps or unused apps.  \r\nAll other system apps can also be removed like DOCS and other ETC. Because if you don't optimize the phone it gets hot and performance goes down. Also for gaming it does get hot but depending on the game you are running, if you play like heavy games that has a massive graphic content, the GPU really works hard so that's normal, it gets warm. So far, phone really is great, but battery is a little bit of an issue. Battery drains fast, like playing or browsing like when I play the game Vainglory, a 5 minutes of gameplay is 5% or 6% of battery consumption tho charging is fast, it would just take 1 hour and a few minutes, im not so sure yet but charging is fast on this phone, just on this phone I tried using the charger on a different phone and it takes time. But still phone is really great, the display, camera is also great, people who say that the camera quality is low, but I think their eyes are just blurry I think, the image quality is also great. Performance and I even tried testing the Antutu benchmark on it, and I got 130546 as a score on it. Great phone. Anyone that is planning to get this phone, I say go for it. :)", "date": "03 May 2017"}, {"text": "already tried that nothing is happening.", "date": "02 May 2017"}, {"text": "Use two fingers and swipe out from home screen.", "date": "02 May 2017"}, {"text": "why there is no option to hide apps? Is anyome here have the same problem? I dont wanna use third party apps 8n playstore because it will require root access which will void my warranty.", "date": "02 May 2017"}, {"text": "is it OTG ready? which is worth the money, P9 or P10?", "date": "02 May 2017"}, {"text": "Needs a little more improve. I can't record the voice of the caller while others phones do.", "date": "30 Apr 2017"}, {"text": "Bought this phone recently, P10 (regular, blue) and so far it's a great phone.  Paid $466 which is really competitive for a brand name flagship phone.  It's blazing fast (I have the UFS 2.1 type, thankfully), runs cool and decent battery while having a really nice camera.\n \r\nMy only real complaint is the lack of oleo-phobic coating on the glass which is a shame but it's not too bad (still not ideal in this price range), can be solved with a glass screen protector with such coating which is available.   ", "date": "30 Apr 2017"}, {"text": "I don't care ,whatever you say about this phone.........I have here Already hahahha", "date": "29 Apr 2017"}, {"text": "For the price, processor and the issue of cheating by using lowgrade internals on some versions of the phone its not worth it unfortunately.", "date": "28 Apr 2017"}, {"text": "Great phone. My next phone ", "date": "28 Apr 2017"}, {"text": "The P10 phones sold in Singapore,do they have dual sim capability?", "date": "28 Apr 2017"}, {"text": "It's to do with your camera settings.  For example there's a menu and the bottom where you can change the iso,  exposure,  focus amongst other things. \n \r\nIf you don't know what you're doing just put them on auto and they'll be fine ", "date": "27 Apr 2017"}, {"text": "Tried switching off potrait mode or beauty mode i have also seen its kinda blurry bt wen thy show sample pictures it luks gud enough jst tinker a bit with settings and try ", "date": "26 Apr 2017"}, {"text": "Ok so i came to ask something about this phone but had to post few comments.Nvm.I went in the stores to check up on this phone and found out it's selfie camera is very flashy and blurry.The pics take on P10,P10 plus and P10 lite were blurry and with tons of noise. \r\nAnyone knows why their selfies had really white,blurry and cloudy selfies ? It supposed to take clear pics.I noticed the same blurry selfies from youtube reviewers as well.", "date": "26 Apr 2017"}, {"text": "-Every brand makes modified android and it's EU version,huge points to Huawei making it look great as others competitors.You can always order online too. \r\n-Update isn't even needed that much.The stock apps and version are enough.Tho it might need more updates for it's Honor brand \r\n-Their flagship Huawei Mate 9 uses AMOLED.Huawei Honor Magic too.Do a little bit of research and think before you speak.This site is meant for research about phones not bashing random comments based on poor knowledge you have. \r\n-Some Huawei phones have snapdragon. \r\nHuawei spends tons of money on making a chipset to run the best on their modified anroid and be smooth as upper range snapdragons.Huge respect towards Huawei for not being a sheep for using chipset that everyone does.But a snapdragon 835 version would be welcomed tho. \r\n-Depends on the seller.Take note Huawei spends money on making their own chipset like iPhone and spends money on advertising.Something iphone does ? But the Huawei flagship phones could be a bit cheaper. \r\n-Amazing design,slick and smooth.Outbeats Samsung and other brands.\n \r\nIntelligent people who know real quality and know a lot about good phones for their value.", "date": "26 Apr 2017"}, {"text": "A decent answer.But dude,fix your spelling ....", "date": "26 Apr 2017"}, {"text": "Oneplus is doin grt bt sadly its nt available everywhere i wud love to get one ,lg has its issues i like wat kg and Samsung does take risks in design fr the ppl and change things bt both have their own problem like g6 has average camera and battery with variants depending on region and s8 being edgy with problems already getting talked bout ,no phone is perfect and ur pushing down huawei jst coz u dont c ", "date": "26 Apr 2017"}, {"text": "Do u even remember leica cameras of p9 lasy year ,dual cameras bokeh effect??? Any idea of tht ,p9 was grt ,i agree tht after they had made the 6p thy wer mre knwn to ppl bt here it seems ur jst hating , ppl recommend Huawei ,xiaomi does make bad product last year i removed frm my recommended list coz one its product i dono hw manu blew and tok bout samsunh best frm the bging bt still no one care bout tht laggy software samsung cud b the best to me bttt tht shitty software will thy ever change, sony i respect wat thy do too bt no marketing in my place even xz hasnt arrived yet Sony cud b the top bt its going down ,jst look back at huawei ,i m not saying thy r the best bt thy r nt bad thy make products at low price mayb p10 is the frst with a bit higher price than usual bt i think rest is fine ", "date": "26 Apr 2017"}, {"text": "Thank you forma tour suggestions guys! \r\nJust about the alternatives you mentioned I need to say that HTC 10 is considered to have weak battery performance while oneplus' dimensions are too big in my opinion, I was looking for something more compact. I have considered the S7 by Samsung but I had a really bad experience with S Advance a few years ago (no update, fast general decay of performances...) so I would prefer something else. I'm actually using a Moto X 2013 which I enjoyed for almost all the time. In the last months I had issues with lollipop update which killed its daily battery life and it never recovered from that. So it's time for a good replacement!", "date": "25 Apr 2017"}, {"text": "if xiaomi mi6 will be available in your Country, go for it, it's more cheaper than this, share the same specs. & I don't trust kirin chipsets", "date": "25 Apr 2017"}, {"text": "I think I prefer Xiaomi Mi6 to this........", "date": "25 Apr 2017"}, {"text": "i don't know if it's wise to compare Huawei with LG, Sony or Samsung..... they're always trying to innovate something new, LG went with modular phones, this year gave us a while new bezel less design. Sony wowed us with the camera specs this year. Samsung put the scale up high with the s8, so much improvement on the UI.... this is called hard working, they deserve to have the premium price tags. i don't know what's Huawei is doing....... \r\nand about the fame..... Huawei didn't earn it's fame by hard working, they earned it by Nexus 6p, and after that started selling phones copying it's design..... \r\nxioami earned it's fame by giving the best specs at the lowest price...... \r\nOnePlus literally killing the flagships out there....... \r\nHuawei intact is an another Chinese manufacturer not any better than the others, maybe a little less than others", "date": "25 Apr 2017"}, {"text": "Ur points r somewat true bt nt mostly ,many have their own skin on android emui is nthin too heavy its simple i dono wat bad specs u tkin bout 4gb ram,64gb storage ,lecia camera,fastest fingerprint,3200 mah,processor of last year which is yet bttr competing with snap 835 arent these enough ...huawei has been doin the smartphone game fr long and xiaomi is still growing , if u ask me i wud say lg is a bit over priced sony is Samsung is ,ppl r buyin it stil thy r getin wat thy want , just say me one reason p10 is disappointing u and nt givin u flagship level performance ,which mobile do u have?", "date": "25 Apr 2017"}, {"text": "Huawei knows its price and thy aint like other china phones thy have been working hard enough to b recognized more u cnt say jst coz its china it has to be cheap ,i mean kirin is huaweis latest processor which is on par with snapdrag 835 ,and is 515 dollars too high fr thn to ask fr , every flagship has their own price xiaomi isnt as famous as huawei ,xiaomi is gud bt nt yet at tht level ,one plus i doin a gud job bt it started same as huawei did get mre in less , huawei is competeinh eith apple and smsung and these specs r gud enough ,ppl love huawei and so thy r buying i m nt defending bt sayin wat it is emui is improving and even lg uses lcd ,i take kirin processors over snapdrag and u cud updates r slow one annoying thing ,huawei prices usually reduce , design never knw which p9 was gud p10 is quite somthing", "date": "25 Apr 2017"}, {"text": "i was just pointing out the key selling point of an Android phone, those are the key specs that most of the Android users want.  \r\ni don't know how Huawei is surviving the battle here with those premium prices and opting out the most demanding specs. \r\nif your gonna sell Androids with specs like this (any Huawei phones) at least price em like xioami .", "date": "25 Apr 2017"}, {"text": "Huawei p10 no doubt fits your needs. Will give you 1 1/2 day battery life with moderate usage. Looks premium and feels great in hand.. Green and blue colors will break some necks. Neo IPS display (deep blacks). Excellent camera. In addition zippy fast UI with many features.   Optional dual sim/expandable memory.  Pricing depends on your region. Where I live it costs about 550$ which is big margin of difference from S8 ( which is ofcourse a great phone as well).", "date": "25 Apr 2017"}, {"text": "Everyone hu gives a f*ck bout using different storages :) ,its around 520 dollars (conversation) here and it doesn't actually effect performing and ppl pls dont say ur payin and nt getin wat u want jst look overall huawei isnt lagggy jasnt got a bad camera ,gud speaker ,gud build ,gud design ,fast fingerprint&#8203; gud storage ,fast performance ,fast charging like everything is gud fr anyone hu wants a gud phone and thn one small issue and everyone freak out huawei is huge thu do care bout ppl and the performance of their product of u jst frgt bout this and use ur p10 thn u wudnt feel a difference in ur use ... Here is the link  ", "date": "25 Apr 2017"}, {"text": "Samsung still better than huawei...sad but true..", "date": "25 Apr 2017"}, {"text": "Nt everyone is like u hating ,many use skins and samsung sucks fr its skin and their ui is getin bttr bt i recommend using a launcher tht shud do it other thn tht everything else is fine ,as its huawei price will get lower as time goes, lcd is nt bad too , trst me kirin is way bttr than snapdrag mayb nt at benchmarks bt at real life performance complain after u use an high end huawei ,u cud say design this year was a mix bt no one complaines wen iphone copies or samsung copies or pixel copies , just dont defend wat u have and hate on others", "date": "25 Apr 2017"}, {"text": "With few tweaks and if u make ur phone clean and delete the not necessary things u cud get 5 hrs + screen on time its hard to get 6 hrs screen on time on mst phones,and emui is nt bad stop spreading this non sense kst use a launcher probably u dont like the default launchers look and ur blaming the ui ", "date": "25 Apr 2017"}, {"text": "So as u need a front mointed fingerprint i can suggest yhe p10 and oneplus 3t ", "date": "25 Apr 2017"}, {"text": "get oneplus ", "date": "25 Apr 2017"}, {"text": "If you are okay with something from the last generation, you could buy the S7, S7 Edge or the HTC 10.", "date": "25 Apr 2017"}, {"text": "i don't even know why Huawei mobiles are selling so good. \r\n-- nowhere near stock, heavily modified Android version \r\n-- updates take months \r\n-- no AMOLED \r\n-- doesn't use Snapdragon \r\n-- so pricey \r\n-- somewhat designs\n \r\nwho's buying these phones", "date": "25 Apr 2017"}, {"text": "As my opinion this is not a good phone. The battery is not even lasting the charge for 6Hrs. All crap phone. \n \r\nI lost the mony and software also is crap. My earlier phone was HTC M9+ this is not good at all only camera is good. Better buy a separate camera and buy Phone something else.  ", "date": "25 Apr 2017"}, {"text": "Hi all guys, \r\nI am struggling to find my best compromise phone which has to have: \r\n- good battery life \r\n- one handed usability (around 5.2 inches display or no more than 150 mm length)  \r\n- really good photos quality \r\n- front mounted fingerprint scanner \r\n- not too expensive for Italy's market (to give you an idea Samsung S8 is around 850-900Â\u0080 which is too much for me, like iPhone) \r\nAfter months of research I may found that this P10 could be the right compromise (it can be found at a relatively cheap price, around 550Â\u0080). May I be right? Anyone can suggest other alternatives I should consider? \r\nThank you very much!", "date": "24 Apr 2017"}, {"text": "I dint mean to say no one shud care ,i mean if no body even knew bout this ppl wud buy it without worry and stay happy only coz now thy knw thy r questioning its also cheap in my place so it doesnt bother me mch", "date": "24 Apr 2017"}, {"text": "No Radio again??? \r\nIn that price? CRAP!!!", "date": "24 Apr 2017"}, {"text": "hey, do u guys know how to increase the vibration intensity? or any apps that recommended to increase it? (no root apply >", "date": "24 Apr 2017"}, {"text": "Why should I pay the same money and get slower phone? It's not a little difference in performance, actually the difference is quite huge. \r\nAnd I don't like the Huawei strategy, I'm not buying a ticket in a lottery for $1000. I was waiting for this phone but sorry Huawei, this is killing it for me.", "date": "24 Apr 2017"}, {"text": "So guys dont freak out over the different components used on the p10 its nt effecting much of the performance no one wud even care if thy hadnt said so b glad they agreed even p9 is emmc 5.1 it doesn't matter did anyone ever have a issue or said it was slow ,so stop making it a big mess it doesn't really matter ur gettin everything u want , every smartphone is smart and fast enough fr a particular user jst use ur common sense and only care bout the things u need in a phone rather than asking for something u dont really knw bout ", "date": "24 Apr 2017"}, {"text": "Thanks", "date": "23 Apr 2017"}, {"text": "Dual sim active except for 3g/4g which you have settings option to switch between anyone sim.", "date": "23 Apr 2017"}, {"text": "Google the \"huawei p10 parts difference\" and read the first hit. Huawei uses different parts in P10 (and in P10 Plus as well). You never know what exactly you are buying, your phone might be much slower than someone else's same phone. \r\nI wonder why there isn't an article about this on GSM Arena. Maybe Huawei paid to cover this up?", "date": "23 Apr 2017"}, {"text": "Is it dual SIM active like p9, mate 8?", "date": "23 Apr 2017"}, {"text": "I am considering it, can you tell me if it has any battery saving mode or an app that lets you limit the fps of certain apps/games like Samsung game tuner? To enhance battery life even more?", "date": "23 Apr 2017"}, {"text": "thank you buddy!", "date": "22 Apr 2017"}, {"text": "thank you jon :D", "date": "22 Apr 2017"}, {"text": "I recommend this phone (Huawei p10) especially when you are more on gaming and this phone has a much longer battery life, not just that, a good quality of camera as well.", "date": "22 Apr 2017"}, {"text": "This is better than iphone 6 no doubt.  \r\n- bigger and better display \r\n- better cameras \r\n- better battery life and fast charging \r\n- better performance \r\n- dual sim \r\n- sd card expansion \r\n- Gorilla glass 5 \n", "date": "22 Apr 2017"}, {"text": "it depends how will you use the phone.", "date": "22 Apr 2017"}, {"text": "No need the wireless charging.......huawei p10 is fast charging have.....samsung s8 is 570ppi and battory life 3000mAh \r\nBut huawei p10 3200mAh and 432ppi... \r\nHUAWEI P10 ISI BATTORY LIFE GOOD.", "date": "22 Apr 2017"}, {"text": "Huawei p10 is good mobile... \r\n2017 wold namber one(1st place)slem mobile HUAWEI P10 \r\nI am use the p10.is are good mobile. \r\nSamsung s8 is no good.", "date": "22 Apr 2017"}, {"text": "Huawei P10 is a great phone.It has better camera than iPhone 6.The battery and display are better than iPhone 6.I don't know so much avout this phone.But I know this phone is great and cheaper than other flagships on the market. But if you love the Apple iPhone 6, just go and get it. It is your choice. ", "date": "22 Apr 2017"}, {"text": "I'm not sure whether to choose this one over iPhone 6 or the other way around. pls help me to decide...", "date": "22 Apr 2017"}, {"text": "All users with the P10 outside of China, check in Androbench app what are your scores. Make sure to restart the device and test it fresh without any other apps opened. I wonder if the devices sold outside China uses anything less than UFS2.1.", "date": "22 Apr 2017"}, {"text": "The resolution is so cheap for beatiful specs 1080-1920 432 dpi but this phone is have a great specs.", "date": "22 Apr 2017"}, {"text": "s7 edge is bater and on 2nd place p10 3rd g6 ", "date": "22 Apr 2017"}, {"text": "Guys.... I have it for 3 days for now... Why is the Subway Surfers and Snapchat always crashes on my P10 any suggestions?", "date": "21 Apr 2017"}, {"text": "How you get in half price?  Where?", "date": "21 Apr 2017"}, {"text": "it goes with 3 years of warranty, 1 year for the screen, 3 for the hole phone.", "date": "21 Apr 2017"}, {"text": "I just bought it, like 10 hours ago. Its great and I got it for half prize on promotion. I had the P9 version but so far I like this more. :)", "date": "21 Apr 2017"}, {"text": "When I receive video on whatsapp I try to open it and I get 3 options: photos, videos, & oculus video, but neither of them opens the video. However, when I try to open it from the galery, it is working normally!! Any idea??", "date": "21 Apr 2017"}, {"text": "Not worth it 1100 in Canada mind as well buy samsung s8+", "date": "20 Apr 2017"}, {"text": "guys help me....p9 plus vs p10?\n", "date": "20 Apr 2017"}, {"text": "Yawn! \r\nOld specs. New name.", "date": "20 Apr 2017"}, {"text": "Same problem here", "date": "19 Apr 2017"}, {"text": "This phone software are good? how about battery life, can it stands from morning until night at 9pm with moderate usage? Had anyone try using other launcher like google, nova or other in this phone? how the performance? still good? Does this phone will good for long term like 2-4 years? \r\nThanks for the help :)", "date": "19 Apr 2017"}, {"text": "Disappointed?? Y?", "date": "19 Apr 2017"}, {"text": "No wireless charging ,trst wireless charging feels useless ", "date": "19 Apr 2017"}, {"text": "Yes it is indeed", "date": "19 Apr 2017"}, {"text": "wireless charger? ", "date": "18 Apr 2017"}, {"text": "Oh nooooo.... 5.1inch screen n 3200mah battery... Disappointed", "date": "18 Apr 2017"}, {"text": "i like it and it look more like iphone, and it has never disappointed me as i hv huawei p6 and p8", "date": "18 Apr 2017"}, {"text": "Can any body tell me about lock screen notifications. Doest it shows only one line of sms or email  or you can intract with lock screen notifications by quich reply and.......", "date": "18 Apr 2017"}, {"text": "so I just received my Huawei p9...overall what are yall opinions on this phone??????is it a good phone????need to know what others think of it...?", "date": "18 Apr 2017"}, {"text": "April 10.", "date": "17 Apr 2017"}, {"text": "Thank you . \r\nThat is what I wanted \r\nBut when did they announce the winner", "date": "17 Apr 2017"}, {"text": "Hi, I don't really understand your question but yes, we had a giveaway but it's already over. You can see the winner here:  ", "date": "17 Apr 2017"}, {"text": "Guys there was a recent Huawei P10 giveaway and what was the results for it. They never posted it in there page.  \r\nReply if anyone know.", "date": "17 Apr 2017"}, {"text": "In the presentation they only showed the P10 with 64 GB of storage, is there a 32Gb model? or the information is incorrect?", "date": "17 Apr 2017"}, {"text": "I have P9 for almost a year now and i can say it was a great phone based on what it can do to what i need for a phone. If Huawei didn't reposition  the fingerprint scanner based on P9 ,but just upgraded it to the functionality of P10,then P10 would be one of the greatest phone to date.", "date": "16 Apr 2017"}, {"text": "Anyone updated to B120? How was it? Mine drain battery just like vampire sucking blood. ", "date": "15 Apr 2017"}, {"text": "I always used Samsung phones, but now I wanna this beauty.. P10 will be my next phone, very soon! ", "date": "15 Apr 2017"}, {"text": "Hello, i'm from Romania too, the phone doesnt heat at all and it's brilliant, had it on pre purchase. Go for it.", "date": "15 Apr 2017"}, {"text": "I would prefer XZ premium ", "date": "15 Apr 2017"}, {"text": "The fingerprint position for P9 was the best.", "date": "15 Apr 2017"}, {"text": "you used it already?", "date": "14 Apr 2017"}, {"text": "G6", "date": "13 Apr 2017"}, {"text": "Hands up.", "date": "13 Apr 2017"}, {"text": "P10 it's a beast,look at Geekbench 4 results", "date": "13 Apr 2017"}, {"text": "That physcal button is shitty. Seriously? No one likes that lame thing! Even Samsung removed theirs. ", "date": "13 Apr 2017"}, {"text": "P10, lovely phone but terrible battery life", "date": "13 Apr 2017"}, {"text": "Galaxy s7", "date": "13 Apr 2017"}, {"text": "Am I the only one who DOESN'T like the design of this phone???", "date": "12 Apr 2017"}, {"text": "And not think twice*", "date": "12 Apr 2017"}, {"text": "I wud say g6 and p10 either of the 2 both r grt g6 mayb a bit overpriced bt this both r the best u can buy and think twice", "date": "12 Apr 2017"}, {"text": "G6 or V20 or S7 Edge or P10 or P10 Plus or Xperia XZ.. please need urgent response", "date": "12 Apr 2017"}, {"text": "nothing like that, it's absolutely genuine", "date": "12 Apr 2017"}, {"text": "Just got mine yesterday, I am rolling different brand's flagships lately and I'll have to admit this one is simply gorgeous in every aspect, for the first time I am looking for it in my pocket - simply love the touch of it and damn that home button and FP scanner is so brilliant!", "date": "12 Apr 2017"}, {"text": "Copying is a common thing now ,all if fair if it can satisfy the users :)", "date": "12 Apr 2017"}, {"text": "Its brilliant but it the front looks like a samsung s7.", "date": "11 Apr 2017"}, {"text": "Just use app store", "date": "11 Apr 2017"}, {"text": "Yes I would liek to have radio also..", "date": "09 Apr 2017"}, {"text": "radio is not avalibal its to bad", "date": "09 Apr 2017"}, {"text": "I can last one day easily.", "date": "09 Apr 2017"}, {"text": "Nope it's all gud to go ,no heatinh issues ", "date": "09 Apr 2017"}, {"text": "It can click photo while recording video der shud b an icon even my p9 does tht -_-", "date": "09 Apr 2017"}, {"text": "How about the battery? Is it work all day morning to the evening with average usage such as texting and social media?", "date": "09 Apr 2017"}, {"text": "That phone is a Monsteeeeer! Those specs, design and that veeeery killer 2 dual-lens camera at the back is so superb! I was really blown away ", "date": "09 Apr 2017"}, {"text": "Is there any network issue", "date": "08 Apr 2017"}, {"text": "Here,in Europe (I'm from Romania) it costs 530 Euros, it's an OK price for such a beast ( Kirin 960 it's a close match for A10 Fusion ). But it gets hot if you are using it intensively ??? I'm asking because I really want to buy this phone.", "date": "08 Apr 2017"}, {"text": "This phone is so stylish. Wish i could buy it", "date": "08 Apr 2017"}, {"text": "From the reviews I have seen online, i bealive ot has the best camera :)", "date": "06 Apr 2017"}, {"text": "I also like the band capabilty", "date": "06 Apr 2017"}, {"text": "I already have. it's for the ones who whine for the small one. I got a 20Ah external battery. \r\n(20,000mAh if you don't know the conversion)", "date": "05 Apr 2017"}, {"text": "Only in single core and with 1080p phone. ", "date": "05 Apr 2017"}, {"text": "I fell in love with the P10 when I first laid eyes on it; the design is beautiful, especially the dazzling blue one. And it's the PERFECT size, my main complaint with my note 5 is that it's too big, but this is perfect. But it was stupid that they didn't add an Oleophobic coating.", "date": "04 Apr 2017"}, {"text": "Amazing camera!", "date": "04 Apr 2017"}, {"text": "No, not a ground loop. I'm talking about RF interference on the car's FM radio. And it didn't happen with my Motorola Droid 4, or with iPhones that my friends have plugged in at various times.", "date": "04 Apr 2017"}, {"text": "Is it water resistant?", "date": "03 Apr 2017"}, {"text": "Jarir Bookstore i think.", "date": "03 Apr 2017"}, {"text": "That's a ground loop, it's not specific to these phones, I get the same thing with iPhone 6S and P9 when plugged in to charge while also plugged in to AUX input.\n \r\nBuy an inexpensive ground loop isolator for your 3.5mm jack.", "date": "03 Apr 2017"}, {"text": "I've had this phone for a few weeks now, taking over from a P9 Lite. One thing I noticed - when I plug the phone in to charge, in my car, it washes out the car radio with interference. Both the P9-Lite and the P10 do this; it seems their charge circuits are very poorly shielded. No other phone I've ever seen has done this. I'm a bit surprised these phones passed FCC certification. (My previous phone was a Motorola Droid 4, and several of my friends have plugged their phones in in my car as well and this has never happened. Just with Huawei.)\n \r\nReviewers: please check this out. Phones should not be causing FM radio interference like this.", "date": "02 Apr 2017"}, {"text": "S8 any day ", "date": "02 Apr 2017"}, {"text": "Buy yourself a Sony Xperia ZX Premium.. :) but.. you have to wait for it..", "date": "02 Apr 2017"}, {"text": "How i wish they set the price in the likes of one plus 3T. The price is quite high for this phone :(", "date": "02 Apr 2017"}, {"text": "Should I buy this or galaxy s8 ????????????? HELP PLEASE", "date": "01 Apr 2017"}, {"text": "wrong, A10 Fusion is by far the most powerful processor yet", "date": "01 Apr 2017"}, {"text": "Nothing new in P10.Very disappointing!", "date": "01 Apr 2017"}, {"text": "What i like most on this phone is the Camera.", "date": "01 Apr 2017"}, {"text": "Yes it can play it very easily, kirin 960 is the most powerful processor yet &#128515; these r flagships so u can xpect grt gaming ", "date": "31 Mar 2017"}, {"text": "huawei p10 ! NICE phone ever ! even do it look a bit like iphone ...", "date": "31 Mar 2017"}, {"text": "Is this phone can play heavy game?", "date": "30 Mar 2017"}, {"text": "it's not for me. It's for the one who wants to stick a +4Ah in a 5 incher. o_o", "date": "30 Mar 2017"}, {"text": "No removable battery? Yeah... Skip this one.", "date": "30 Mar 2017"}, {"text": "buy a power bank. ", "date": "30 Mar 2017"}, {"text": "Nothing but dual camera", "date": "28 Mar 2017"}, {"text": "Bruh. no phone today offers a removable battery. and there's the bigger sibling with 5.5 inch and 3750 mAh battery.", "date": "28 Mar 2017"}, {"text": "the one thing that stops me from buying this phone is the non removable battery  if you could put a bigger battery i would buy this but i will not be buying one because of this feature ", "date": "28 Mar 2017"}, {"text": "What store my friend?", "date": "27 Mar 2017"}, {"text": "Great phone. Super camera. Well done Huawei!", "date": "27 Mar 2017"}, {"text": "very cool camera!", "date": "27 Mar 2017"}, {"text": "Best phone ever", "date": "26 Mar 2017"}, {"text": "Dual Leica camera", "date": "26 Mar 2017"}, {"text": "Superb camera", "date": "26 Mar 2017"}, {"text": "The Best thing in this phone is Camera, It is very clear as compared to other handsets", "date": "26 Mar 2017"}, {"text": "Yes ! It works with each slot", "date": "25 Mar 2017"}, {"text": "Saudi price SR1899 plus 599 worth of free goodies..very good", "date": "24 Mar 2017"}, {"text": "Opinion after one week use: I think it's a very good phone and I'm happy  with the shopping. It's quick, it has quality finishes, good camera... I got the Huawaei offer with the smartwatch for free, so veeery good price. I don't find fingerprint sensor in front to be a problem. I find EMUI with apps drawer better than my old Samsung Touchwiz. \r\nCons:  \r\n - Mine has \"glossy\" finish back. It's very slippery and quite fingertouch attractor. Sandblast or diamond cut finishes should be must better. I think it depends on the color choice. Anyway it's solved with a good cover. \r\n - Camera: Good but quite many times produces oversaturated colors. It has some very nice bouché effects and PRO mode (manual adjustments), but at the end it's just a phone camera: the shutter aperture cannot be set. It's always f2.2. Bouché effects are all made by software, normally with impressive results, but sometimes you can see some errors (blurry zones that should be focussed or vice-versa). You cannot shoot with low speed in high light scenes (for example for \"soft waterfall\" pictures) as you cannot close de shutter (bigger f) and the picture would be \"burned\". Summing up, don't expect a real camera, but the outputs are very good. A pitty it cannot shoot pics at the same time you're recording video as Samsungs do.", "date": "24 Mar 2017"}, {"text": "Its all okey but, lakes water resistant and dust proof.", "date": "24 Mar 2017"}, {"text": "Price and design wise, i would recommend the P9", "date": "22 Mar 2017"}, {"text": "My question is: Does dual SIM on this phone works with 4G network for both SIM at the same time? \r\nBecause most phones with dual SIM have one SIM on 4G but the other SIM is forced to be on 2G only. \r\nPlease confirm.", "date": "22 Mar 2017"}, {"text": "P10 has better spec than P9 but a little bit more pricey . Both is okay but P10 sure have a lot of advantag. Better camera, more advance and powerful chipset (the new cortex A73) and  bigger battery but I don't have any of it, so that's all i can say.", "date": "22 Mar 2017"}, {"text": "Plz a sincere reply p9 or p10.... ", "date": "21 Mar 2017"}, {"text": "No", "date": "21 Mar 2017"}, {"text": "Its released over here in the UK, this in on contract tho.", "date": "19 Mar 2017"}, {"text": "It's done you r not in your senses... Not even g7s is close to this lovely brand phone... Called Huawei p10", "date": "19 Mar 2017"}, {"text": "Is huawei p10 waterproof\n\n", "date": "18 Mar 2017"}, {"text": "Is this phone have front flash for front camera for night?", "date": "18 Mar 2017"}, {"text": "Hasn't been released yet, will Q3 of 2017", "date": "17 Mar 2017"}, {"text": "Missed the best position of their finger print reader.....", "date": "17 Mar 2017"}, {"text": "You just convinced me to buy this phone. I loved the S2. Best smartphone ever made", "date": "17 Mar 2017"}, {"text": "Stop smoking what you are smoking!!! Lol.....!!", "date": "17 Mar 2017"}, {"text": "Yes of course. The P10 is like an upgraded design version of the Samsung Galaxy S2 ----> goo.gl/2rtDc8", "date": "17 Mar 2017"}, {"text": "I have L09 with 64GB internal memory.", "date": "17 Mar 2017"}, {"text": "I live in the US, where can I order one?", "date": "17 Mar 2017"}, {"text": "Waiting for this to come to the uk!! ", "date": "16 Mar 2017"}, {"text": "Best design of 2017. I really like the way Huawei making their phones better every time with combination of Design & Performance\"", "date": "16 Mar 2017"}, {"text": "First time using Huawei products, but its really nice smartphone ", "date": "15 Mar 2017"}, {"text": "Did Samsung old design come even close to the design of this lovely piece?!! You smoking something!", "date": "13 Mar 2017"}, {"text": "If you have the p9, theres no reason to upgrade to the p10, when p9 released, it was unique, dual leica camera, something no one has made but then the p10 was released, its a mate 9/pro mini, you might like it bcuz of its smaller screen size, but if you want bigger, get the p10 plus, much much bigger upgrade to the mate and p, water resistant, new colors, better camera(leica 2.0 pro), but if you want mate specs in a smaller body, the p10 is the closest thing you can get", "date": "13 Mar 2017"}, {"text": "Disappointed with the design. Looks like an old Samsung model.", "date": "13 Mar 2017"}, {"text": "Over priced \r\nNothing more to add at this stage", "date": "12 Mar 2017"}, {"text": "Anything look better than iPhone - on that part we can agree . but it doesn't make dual camera on P10 look good at all , and what benefit there is form that dual camera , is it two times better than single one ? ok , maybe that would be too much to expect but at least 30-40% better..but it isn't !!! It can't come close to the exact phones you mentioned from the last year and it's in line with two year old phones like S6 and Z5 .... so lets conclude , dual camera is just a gimmick that looks ugly...but hey maybe adding one camera is not enough to show positive results , maybe they should make a triple camera ,or even quadruple camera ! why not ? the more cameras sensors they add the bigger innovation it is ! \n \r\nSo the octa or deca camera is not out of the question either , lets have phone full of camera sensors , who cares about the other hardware like battery , 3.5mm jack and boring stuff like that....enough with the nonsense two camera sensors is all that phone needs one on the back and one on the front .\n \r\nimo they could actually use that space for something useful like proper flashes or even better xenon flash ! do you know how much that would improve indoors low light photography ? ", "date": "12 Mar 2017"}, {"text": "2014 standard!", "date": "12 Mar 2017"}, {"text": "Is it still missing the camera button?", "date": "12 Mar 2017"}, {"text": "No one mentions it but both the P10 and P10 Plus has basic splash resistance. Just like some of the Moto G phones.", "date": "12 Mar 2017"}, {"text": "You are wrong. This is one of the best looking phone launched at MWC. Certainly looks better than any other iPhone and Sony phones. For the price, every other flagship that will be launched in 2017 will be more expensive than this. Only the upcoming Xiaomi Mi6 might be cheaper than this. The chipset is equal to Snapdragon 821 and even LG G6 lauched with Snapdragon 821. Camera is junk ? It seems you haven't seen this.\n\n \n \r\nIt has the third best camera after Giogle Pixel and Galaxy S7 Edge.", "date": "12 Mar 2017"}, {"text": "This phone is utter crap , where are the complains about big bezels ... ??? or those complains only apply to SONY ? and this phone has nothing unique , design wise is just what everyone else is making (not to mention that fugly dual camera), and it's not cheap as Huawei branded phone should be ( I can get flagships from better recognized brands for same amount of money !! ) , there is nothing impressive just a regular phone and standard specs...\n \r\n''960 chipset offers class-leading CPU and GPU performance''  \r\n- that is simply not true bc it still can't match yet alone beat old Adreno 530 lololol and Adreno 540 is gonna knock it out of park !\n \r\ncamera is also junk and this proves it ''using the manual mode and a tripod makes wonders''  \r\n-sure but I'm not gonna carry that around in my pocket , with the tripod I'll actually use real camera !", "date": "12 Mar 2017"}, {"text": "Guess we'll just wait until the camera comparisons, eh?\n \r\nWell, my other points are still valid. So...", "date": "11 Mar 2017"}, {"text": "Not sure what makes you think the XZs has better cameras. Sure, the front camera has more mps, which are fairly redundant. The rear camera is plain, no interesting features, EIS instead of OIS, their focus game is subpar. Seriously, try out the P10. I've tried it and the camera stunning. Also not a fanboy, but I'm just not sure where your arguments come from.", "date": "11 Mar 2017"}, {"text": "It's picture man. see it with your eyes first then judge it later. at least it would be more beautiful than the 5C from apple.", "date": "10 Mar 2017"}, {"text": "the green one looks pretty dank. unfortunate that it's got a white front, though. but that's just personal preference of course", "date": "08 Mar 2017"}, {"text": "The L029 is the one with 64 GB. it's not yet sure if there's a dual sim model.", "date": "08 Mar 2017"}, {"text": "Is  model L-029 the dual sim one?\n \r\nthks.", "date": "08 Mar 2017"}, {"text": "Well using the criteria you created, surely the Sony Xperia XZs would be the best phone launched. Here's why:\n \r\n1. The XZs checks your points 1 and 2, as it has a 5.2\" screen and is only 0.7 mm taller. \r\n2. The specs are all around better on the XZs, the only aspect in which the P10 beats the XZs is battery size (although performance has not been tested yet), and maybe... weight? (if that matters). :/ \r\n3. The XZs has better front AND rear facing cameras. \r\n4. The XZs has FRONT FACING STEREO SPEAKERS and is IP68 DUST/WATER PROOF.\n \r\nI'm not a Sony fanboy, in fact I've never liked Sony phones until they unveiled their new ones at MWC. I just want their NEW devices to get the recognition that they deserve. :)\n \r\nOh, and also both phones are said to be in the same \"price range\" but I don't think there's any info on the XZs' pricing. :)", "date": "07 Mar 2017"}, {"text": "Me!!! I'm so proud to show up my hand. thanks for asking.", "date": "07 Mar 2017"}, {"text": "I feel like the p10 is a mate 9 pro mini(with same specs but some are better at the p10) idk whats the purpose of the p10 plus,mits just a mate 9 pro but with no edge screen and more colors and probably more popular.", "date": "07 Mar 2017"}, {"text": "Its almost same as mate 9 with litte defference", "date": "06 Mar 2017"}, {"text": "Everyone is talking about the bezels of Xperia XZp, Come here and see SONY is not the only company innovative with bezels though..", "date": "06 Mar 2017"}, {"text": "It Has Got An IR Blaster & Runs On Android 7.1", "date": "05 Mar 2017"}, {"text": "And will cost more than s8 in India. No wonder they haven't cracked Indian market", "date": "05 Mar 2017"}, {"text": "iphone copy P9 copy, but it is actually more beautiful than all. I have watched the comparism of P9 and P10 and realised that the P10 looks  better with good rounded curves and also better in software and hardware. Great staff. Only thing I don't like is dropping the \"screen to body ratio\".  They dropped it because they copied iphone. Even iphone self wants to increase their own screen to body ratio.  Will in 2017 slimmest bezels and bezel-less phones will be order of the day including high screen to body ratio around 74%  to  90 %. As for me 80% - 90% is best for me.", "date": "05 Mar 2017"}, {"text": "Yes", "date": "03 Mar 2017"}, {"text": "p10 plus is water proof", "date": "02 Mar 2017"}, {"text": "im actually interested in buying Huawei flagships but as long as Huawei wont make there phone waterproof... its a no no for me..... btw nice phone!! ", "date": "02 Mar 2017"}, {"text": "LOL no it isn't.", "date": "01 Mar 2017"}, {"text": "Yes, seriously, because Type-C is the future. Deal with it.", "date": "01 Mar 2017"}, {"text": "Opposite of ugly. \r\nPlus, people like options :)", "date": "01 Mar 2017"}, {"text": "It's very low.", "date": "01 Mar 2017"}, {"text": "Is that good? ", "date": "01 Mar 2017"}, {"text": "I've seen on article and youtube reviews, you can enable the on screen button via the setting and customize it to set which button you want to appear", "date": "01 Mar 2017"}, {"text": "That's opposite of how electricity works - it's the \"Amps\" that make the wires hot and cause fires...", "date": "01 Mar 2017"}, {"text": "SAR Value is 1.01 W/kg", "date": "01 Mar 2017"}, {"text": "I think this is the best smartphone that got launched out there in the MWC 2017, \r\nReasons \r\n1. 5-5.2\" screen is more than enough for 90+% of mobile users \r\n2. Small form factor means easy to use even with 1 hand \r\n3. Good display,specs,processor,battery,camera everything is well balanced \r\n4. Still not overpriced , I think its priced apt", "date": "01 Mar 2017"}, {"text": "The Home buttons ruins it. Wish the top and bottom bezels were like the P9 at the most.\n \r\nDoes anyone know if you can still enable on screen buttons with the default ROM? There's no way I will ever consider another phone that doesn't allow this. Designed for soft buttons is better of course, but giving the option is a good second place.", "date": "01 Mar 2017"}, {"text": "This was a conscious decision. They lowered the Volts and increased the Amps to keep the battery from getting too warm, meaning more power is going through the cable, but with less 'force', so to say. And since the resulting Watts are still high it does charge very quickly.", "date": "28 Feb 2017"}, {"text": "Why the many colours thou???...they look ugly ", "date": "28 Feb 2017"}, {"text": "anyone knows sar values of this device? :/ Tnx.", "date": "28 Feb 2017"}, {"text": "It's design, looking nice. ;-)", "date": "28 Feb 2017"}, {"text": "type C 1.0?? seriously??", "date": "28 Feb 2017"}, {"text": "Ahaaa, see this honor 7i  is 5'2 but has height or length of 141.6 mm  but  P10 is 5'1  but has length of 145.3. So you see P10 is very long. Wasted up and down space in front. The height or length of honor 7i is very nice.", "date": "28 Feb 2017"}, {"text": "Yes from the look of things it seems the Mate series is the main flagship phone of Huawei. They always research and bring their new upgraded versions of softwares and hardwares in the Mate series, but makes it better in the P series in march April the following year. The mate is in October November. So for the software and the hardware I believe there is improvement there in This P10 variants. Ofcourse they have upgraded their EMUI from 5.0 to 5.1 too.", "date": "28 Feb 2017"}, {"text": "Wow, opportunistic \"HUAWEI\" samsung made it clear that they will move from 5'1 screen size to 5'8 so you moved there from your normal 5'2. Also you made iphone 7 plus incarnate in honor 8 pro which is same as honor V9. hahaha! The phone is powerful though.", "date": "28 Feb 2017"}, {"text": "iphone 7 is exact copy of Huawei P9 (released in April 2016 ) \r\niphone 7 (released in September 2016 ) \r\nIt's take some time to copy  \r\nIt's P10 intoxicated s#ee/^", "date": "28 Feb 2017"}, {"text": "Samsung Galaxy S6 camera is the best in quality vs price", "date": "27 Feb 2017"}, {"text": "LG 6 is mid range phone", "date": "27 Feb 2017"}, {"text": "is it hspa+ ?", "date": "27 Feb 2017"}, {"text": "To compare this phone with the G6 is dumb, they are two different category. The Mate is the flagship of Huawei, P series is sort of upper-midrange.\n \r\nThe design concept are different, P10 have a front finger print scanner (of course the bezel is bigger) with a benefit you can leave the phone lying flat on the table and unlock it without lifting. If you work at a desk this is more beneficial.\n \r\nAlso I'm going with Huawei/Honor for camera. Despite having an excellent camera software, LG is still insisting on using older camera sensors than the competition, as in they rather have more megapixels, but smaller pixel size so letting in less light. 2017 and their camera is still 1.12um (which means more noise in the dark), while phones are 1.25 to 1.55um (better low light photos). Also Huawei dual camera works differently, it takes two photos and merge them to create better dynamic and color accuracy. The P10 Plus cameras are 20MP f/1.8 OIS (probably 1.25um), which I think is just going to blow the G6 out of the water.\n \r\nThe G6 is also using last gen CPU. Snapdragon 821, while the Galaxy S8 will have 835. Of course the P10 CPU isn't new either, but it it's the same CPU as last year flagship, Mate 9, on a phone that isn't flagship. The flagship Mate 10 CPU is going to be even better.\n \r\nAlso less risk of bootlooping on the Huawei. In term of software, I think they both suck. I hate both EMUI and LG skin.", "date": "27 Feb 2017"}, {"text": "Dat bezels. LG G6 is better.", "date": "27 Feb 2017"}, {"text": "iphone 7, is that you? :)))", "date": "27 Feb 2017"}, {"text": "U think that useless features on the Samsung should be in all major flagship ???? ", "date": "27 Feb 2017"}, {"text": "Actually p9 is iPhone 6 in disguise while p10 is iPhone 7. Seriously huawei? Could you come UP with your won design?? Smh ", "date": "27 Feb 2017"}, {"text": "Soo.. is there anybody could tell me what's the different between these camera on p10 with MATE9? I mostly love the camera and they said (Based on article) it have the same sensor as Mate9, i don't really look at the performance as long as it doesn't lag it is good enough for me. I'm already targeting this p10 phone actually but now knowing that it has the same sensor as mate9 i'm on dilemma again, should i get this p10 or the mate9... My priority is the camera so can anyone elaborate me on that.\n", "date": "27 Feb 2017"}, {"text": "Its not a flagship phone. ", "date": "27 Feb 2017"}, {"text": "No radio, no IR, no barometer, no hart rate sensor... What is added value on this phone? No QHD screen resolution, no big battery... Is this a flagship phone in 2017?", "date": "27 Feb 2017"}, {"text": "huawei p10,p10 plus looks like an iphone 7 plus,/p10 lite looks like an iphone 7,so i guess u can get cheaper phones with some kind of an iphone design which looks gorgeous", "date": "26 Feb 2017"}, {"text": "A Good SoC. \r\nA pair of Good Cameras. \r\nA Good Display. \r\nA Good Resolution of 1080X1920 for such SoC. \r\nA Good Body to display ratio.\n \r\nA Good replacement for P6.\n \r\nP7, P8 and P9 were incompatible to their race.", "date": "26 Feb 2017"}, {"text": "Why smaller screen than p9?", "date": "26 Feb 2017"}, {"text": "Front fingerprint sensor? But why?? :( Rear mounted is much better, easyer to reach, easyer to use for sliding...", "date": "26 Feb 2017"}, {"text": "i will probably buy it...but of course after the reviews", "date": "26 Feb 2017"}, {"text": "not LG", "date": "26 Feb 2017"}, {"text": "4 GB of Huawei ram would be faster than 6 GB ram of many brands. I can guarantee it.", "date": "26 Feb 2017"}, {"text": "Y this all the mobile brands copy apple ? Suckzzz", "date": "26 Feb 2017"}, {"text": "beautiful green, i like this so much", "date": "26 Feb 2017"}, {"text": "pass", "date": "26 Feb 2017"}, {"text": "well that design is just repetitive and far from innovative!!!I mean just COME ONNNNNNN!!!!!!!", "date": "26 Feb 2017"}, {"text": "They could have at least added a radio, they're still ripping us off regardless.", "date": "26 Feb 2017"}, {"text": "it has ois.", "date": "26 Feb 2017"}, {"text": "China now wants to sell us an 800$ 5.5 inch phone that has a Mali GPU with only 8 cores ? Good one.", "date": "26 Feb 2017"}, {"text": "Incredible phone with great specifications and an incredible design, and all the haters can go cry in the corner. Far better than the ugly, disappointing LG G6, and the P10 will surely sell better than the G6. \n \r\nKudos, Huawei! Another successful smartphone! :)", "date": "26 Feb 2017"}, {"text": "Man, the green looks really amazing! They have made a good job with the colors this year, and I am glad this has OIS. In my opinion, the P10 is a major upgrade over the P9. Huawei made a good job with the P10 this year.", "date": "26 Feb 2017"}, {"text": "no one said that Huawei was the first dual camera phone series, but they put it in evidence", "date": "26 Feb 2017"}, {"text": "no ois? rally?", "date": "26 Feb 2017"}, {"text": "I like how Huawei makes an effort to make their phones thin and light. much easier to handle the phone.", "date": "26 Feb 2017"}, {"text": "mmmmm... With the move to less bezels (Samsung,LG) I was thing Huawei would have moved that way as well. Big Huawei fan here, thought their P9 series was great, I just hope they haven't missed the boat / trend here.", "date": "25 Feb 2017"}, {"text": "HTC will reminds us that they had a dual camera smartphone first, if you should asking.", "date": "24 Feb 2017"}, {"text": "I think this P10 model will costing RM2,699 for 4gb+64gb spec on Malaysia market.And P10 plus model will costing RM3,099.", "date": "23 Feb 2017"}, {"text": "IKR iphone copied the duel cameras from huawei ", "date": "23 Feb 2017"}, {"text": "No radio? Pff", "date": "23 Feb 2017"}, {"text": "Looks nothing like an iPhone, iPhone copied the dual camera from Huawei and LG,HTC.", "date": "22 Feb 2017"}, {"text": "No way the Bluetooth is 5.0.\n\n \r\nSure it will be 4.2", "date": "22 Feb 2017"}, {"text": "Huge Bezels on the top and bottom.", "date": "21 Feb 2017"}, {"text": "official presentation is near so it's a reliable piece of info... no ois. Shame on you!", "date": "21 Feb 2017"}, {"text": "this is not the official.. w8 for the announcement. SHAME ON YOU", "date": "20 Feb 2017"}, {"text": "Doesn't look THAT much like an iPhone unlike some other phones (cough cough Vivo V5 Plus)", "date": "20 Feb 2017"}, {"text": "Amoled means burn-in issues", "date": "18 Feb 2017"}, {"text": "Your hint is like this:  \r\nArtwork larceny in light's day=Elaborate! \r\nLook at the P10 once again (from head on)", "date": "18 Feb 2017"}, {"text": "Pls elaborate!", "date": "18 Feb 2017"}, {"text": "In fact huawei P10 is combined from: \r\niPhone+Samsung+Pixel actually 3 souls in one body!", "date": "17 Feb 2017"}, {"text": "no amoled ??????", "date": "17 Feb 2017"}, {"text": "no Optical Image stabilization.. SHAME ON YOU huaweii Never expected this from you", "date": "17 Feb 2017"}, {"text": "The P10 looks amazing in green color! :)", "date": "17 Feb 2017"}, {"text": "These companies have got to stop making new phones that resemble iphones so much. Who wants to invest hundreds of dollars in a new android phone for features and/or performance that might even exceed that of the current iphone, just to have your peers think it's an iphone or some kind of imitation? ", "date": "17 Feb 2017"}, {"text": "still no OIS, shame. I hope they will include it", "date": "17 Feb 2017"}, {"text": "this colour is looking like a cartoon. and those hugee top and bittom bezels", "date": "16 Feb 2017"}, {"text": "Look like our long awaiting Nokia, some say it is Big Brother in mobile world, hope he not going to disappoint us. Huawei is so desperate to win over Apple, so what our Big Brother has in mind will wait to see in coming weeks.", "date": "16 Feb 2017"}, {"text": "looks like Iphone7, nah... :/", "date": "16 Feb 2017"}, {"text": "on radio?", "date": "15 Feb 2017"}, {"text": "4gb ram confirmed!", "date": "14 Feb 2017"}, {"text": "Just go for it dude! You'll never experience it if you looking for the phone from the specification paper. Hope you'll enjoy with your laggy samsung phone LOL.", "date": "14 Feb 2017"}, {"text": "Can't wait. I wish they'll have the Blue color like the old one of my p9 limited edition color.", "date": "14 Feb 2017"}, {"text": "26.02.17", "date": "13 Feb 2017"}, {"text": "Mate 9 Pro has OIS and i believe P10 will also have it", "date": "13 Feb 2017"}, {"text": "Any new info about the release date ?", "date": "09 Feb 2017"}, {"text": "Samsung A9 Pro only have 32 GB Internal memory and 4GB Ram. But in Huawei P10 Which says that they are Providing 64 GB Internal and 4 GB Ram or 128 GB Internal and 6GB Ram. Which is very good.", "date": "08 Feb 2017"}, {"text": "Samsung A9 pro is a better choice (than P10) with OIS for rear camera. Sammy rocks.", "date": "06 Feb 2017"}, {"text": "The leaks say both the P10 and P10 Plus have the same screen size 5'5, that is not understandable but it seems they have different designs. If it is so then it will be P10 and P10 pro rather than P10 Plus.", "date": "05 Feb 2017"}, {"text": "But Huawei already did. Using broadband. Been using 4.5G since last year in Hong Kong. \n\n ", "date": "30 Jan 2017"}, {"text": "I really hope back and front panels have the sAme color.", "date": "26 Jan 2017"}, {"text": "Huawei P10 will have a 5.2 inch FullHD display. P10 Plus will have 5.5 inch QHD display.", "date": "26 Jan 2017"}, {"text": "no OIS, again...pfff still not good enough in video recording.", "date": "26 Jan 2017"}, {"text": "Yeah it will be best combination", "date": "26 Jan 2017"}, {"text": "The P10 won't support 5G. lol", "date": "26 Jan 2017"}, {"text": "You really spoke sense my friend but am waiting anxiously for this phone. Still there is no mate 9 in my region. Mate 9 or P 10 which ever come here first I will buy it. I believe they may of identical performance. I am waiting oo hhmmm!!!", "date": "25 Jan 2017"}, {"text": "Not another 5.5 inch phone!!! Isn't the market saturated enough with 5.5 inch phones?? That's a deal breaker for me. Why not 5 inches or, at most, 5.2 like the previous model, the P9??", "date": "25 Jan 2017"}, {"text": "Samsung and apple user here but the design looks pretty nice. Only if it was stock (same wish for samsung).", "date": "25 Jan 2017"}, {"text": "Top great Design! Many end users unware that Huawei has set the specification for a standard for next 5G mobile communication adopted by the world. You can be sure if it is Huawei Mobile Phone products. P10 can support the next generation of 5G communication service. The coming any brands of new 5G hand phones more or less follow the Huawei 5G standard.", "date": "24 Jan 2017"}, {"text": "I wish they would stop using IPS and just switch to AMOLED.", "date": "24 Jan 2017"}, {"text": "Specifications are not confirmed. I hope video recording will be autofocus. Wellcome to flagship P with QHD  panels.", "date": "23 Jan 2017"}, {"text": "display size is good 5.5\" p10plus also 5.5\" i sugest 5.7\" or 5.9\"good for p10plus", "date": "23 Jan 2017"}, {"text": "i hope p10 lite become 5.2\"display kirin655 and dual 12+2camera", "date": "23 Jan 2017"}, {"text": "Latest leaks show 2.0 apperture dual 12 MP cameras at back not 1.7 like at description here.", "date": "21 Jan 2017"}, {"text": "Well, the only latest Huawei device that using Snapdragon chipset was Huawei Nova Plus which is a mid-range handset .Check out Huawei Nexus 6P, that's the only flagship grade phone from Huawei that use high-end(former) Snapdragon 810 chipset.", "date": "15 Jan 2017"}, {"text": "Yes....till now still love my superphone g2....front notification light and back led light that looks tooooo sexy...1080p....sd800....4k videos work perfectly...and IR blaster which i love them the most........and 2013 model lol.......", "date": "13 Jan 2017"}, {"text": "I agree. 5 to 5.2\" screen is the sweet spot.", "date": "13 Jan 2017"}, {"text": "Fair, but they could use Adreno when they decide to produced a Snapdragon phone", "date": "12 Jan 2017"}, {"text": "In my opinion P10 should be 5.2 maximum and smaller than P9 i mean with better screen ratio and less bezels...\n \r\nDo you remembe LG G2 this was the best size everything above is unconfortable for average sized hands.", "date": "11 Jan 2017"}, {"text": "I think so, too. That'd be the best choice.", "date": "11 Jan 2017"}, {"text": "Ewww, I don't even like iPhones. The size 5\" to 5.2\" is the best for me", "date": "11 Jan 2017"}, {"text": "Boy go back to your small 4 inch iPhone and be salty somewhere else", "date": "11 Jan 2017"}, {"text": "I think that the regular P10 will be the same size as the P9 with a 5.2 inch screen, then the P10 Plus with either a 5.5 or 5.7 inch screen fits in nicely in Huawei's lineup of higher end phones", "date": "11 Jan 2017"}, {"text": "Adreno was Qualcomm own Snapdragon chipset GPU,Huawei made their own chipset Hisilicon Kirin that's based on ARM Cortex-A CPU so they're using ARM developed Mali as their GPU as well and same goes with Samsung Exynos chipset.Its not they don't have the option but they never will use Adreno since Adreno GPU are ONLY for Snapdragon chipset.Mali-G71 MP8 already have a lot of firepower in it and far more better than P9's Mali-T880 MP4 dude so quit complaining", "date": "11 Jan 2017"}, {"text": "Adreno was Qualcomm own Snapdragon chipset GPU,Huawei made their own chipset Hisilicon Kirin n so they're using Mali as their GPU same goes with Samsung Exynos chipset.Its not they don't have the option but they never will use Adreno since Adreno GPU are only for Snapdragon.Mali-G71 MP8 already have a lot of firepower in it and far more advance than P9's Mali-T880 MP4 dude so quit complaining and saying they have the option to choose Adreno", "date": "11 Jan 2017"}, {"text": "Don't hope for that, because it won't be.", "date": "10 Jan 2017"}, {"text": "I hope the screen size is 5.7\" ", "date": "10 Jan 2017"}, {"text": "Guys, calm down. I doubt the P10 and the P10 Plus will have the same screen size. The P10, perhaps, might have a 5.2'' or 5.3'' screen, while the P10 Plus might have a 5.5'' screen. Or perhaps the P10 might have a 5.5'' screen and the P10 Plus might have a 5.7'' screen. Nobody knows yet. Stop worrying and wait for an official announcement.", "date": "10 Jan 2017"}, {"text": "Huawei always using Mali as their GPU when they are allowed to using Adreno", "date": "10 Jan 2017"}, {"text": "I hope it's not 5.5\". There are plenty of 5.5\" phones out there both low and high end, but less and less good options for ~5\" high end phones.", "date": "10 Jan 2017"}, {"text": "If this has 5'5 inch screen,whats the point of having p10 plus then ? More money to grab ? I don't see any reasonable answer.Maybe an overclocked 960 or some 3D touch but not much.Or a bit better camera for the p10 plus but i doubt it.", "date": "09 Jan 2017"}, {"text": "I believe iPhones are 4 inches ;) \r\nIn life, it's just a matter of tastes. Each person has their own tastes. The P8lite 2017 is 5.2 inches, maybe this one will suit you.", "date": "09 Jan 2017"}, {"text": "How is 5.5 inches too big?  It's basically the norm nowadays.", "date": "09 Jan 2017"}, {"text": "I knew it! That is the reason why I am hesitant to buy the P9 coz P10 is on its way maybe on march, april or may, 2017.", "date": "09 Jan 2017"}, {"text": "You could wait for the lite version or maybe the honor 9 (if it called like that )", "date": "09 Jan 2017"}, {"text": "disgusting with dat samsung home btn !", "date": "09 Jan 2017"}, {"text": "Too big ffs", "date": "09 Jan 2017"}]