[{"text": "Get the HTC U11 and stay away from the rest that you have mentioned.", "date": "10 Apr 2018"}, {"text": "Hi guys! \n \r\nI am wondering if i should buy the Google Pixel 2 or another cheaper phone like the LG G6 or the HTC U11/Ultra. \n \r\nThank´s in advance for any advise =)", "date": "08 Apr 2018"}, {"text": "Like seriously the battery is not so satisfying", "date": "07 Apr 2018"}, {"text": "I hv compared pixel 2 with redmi 5 plus ...both are similer in aps opening only differnce is on games...regarding camera ...there is a difference but its not day and night difference ...i dont know whh people spemd 700$ on phones...even cheaper phone can provide you the same comfort ..and satisfaction..buy redmi 5 plus ..180$...", "date": "07 Apr 2018"}, {"text": "Lol its your fault mate.. Next time be more careful with the device. Why would they help you only because you was not careful enought? I wouldnt too", "date": "07 Apr 2018"}, {"text": "why Google put little battary only 2700 mAh. they can put 3000 mAh easily.\n", "date": "05 Apr 2018"}, {"text": "It's a nice phone with an awesome camera but it is really fragile.  I dropped mine from my pocket to a wooden floor. Not a big hit. That was enough to break the LCD screen (not the glass) and the charging port.  Phone was 4 months old, and Google would not exchange it. Took it to Ubreakifix, and authorized dealer, $129 for the screen and $40 for the charging port + Tax.  I won't buy again.", "date": "04 Apr 2018"}, {"text": "Go for pixel 2 ", "date": "04 Apr 2018"}, {"text": "Go for Pixel 2, as it has stock UI, guaranteed updates/upgrades and less bloatware. As for Xperia, don't know much about how these devices work, but a few years ago when I decided to buy my first Android device, I tried an Xperia M and almost bought it. But as I watched a review on youtube which showed that the device has poor network issue for voice calling, I changed my decision and went to my first Galaxy device. Anyway, that is my personal experience. You should take a good demo of the devices first and then the buy the one which you like most.", "date": "04 Apr 2018"}, {"text": "i think this is the best mobile i had ever seen with amazing features and stylish look.", "date": "02 Apr 2018"}, {"text": "Hoping that Google company will open stores in SEA.", "date": "01 Apr 2018"}, {"text": "don't spend money on sony mobile...", "date": "29 Mar 2018"}, {"text": "Pixel 2 of course......", "date": "26 Mar 2018"}, {"text": "guys i'll buy a phone but i'm confused. Pixel 2 or sony xperia xz2 compact what do you think?", "date": "25 Mar 2018"}, {"text": "Haven't you ever used any Android phone? \r\nHome screen can be designed and laid out just as you like with launcher app like Nova", "date": "23 Mar 2018"}, {"text": "can the google search bar on the home screen be removed?", "date": "22 Mar 2018"}, {"text": "This this definitely, except the design, S8 has no chance in anything. ", "date": "22 Mar 2018"}, {"text": "This is way way better in all aspects, regarding to the price yes it is pricey XD. ", "date": "22 Mar 2018"}, {"text": "pixel ", "date": "19 Mar 2018"}, {"text": "I'd pick Pixel 2 any day.\n \r\nWhen I use iPhone 6 OS updates slowed down my phone significantly after years of use (let alone 4 years), while Android, which was Sony and LG back then, OS updates made my phone even snappier.\n \r\nAs a bonus if you get new iOS update maybe so does your friend but when you get new Android update, your friends with Samsung hasn't! You'd feel better :)\n \r\nAnd let's not forget that Pixel 2 has 2 years product warranty thanks to bigger sibling's screen fiasco.", "date": "19 Mar 2018"}, {"text": "It wouldseem that google cert team has google seamless so if pixel 2amd or3 comes avaialable shouldnt dissappoint.", "date": "18 Mar 2018"}, {"text": "guys which phone do you recommend, pixel 2 or iPhone 8 (not interested in Samsung phones). Pixel 2 has portrait modes and few more good features but software/security support for maybe 2 more years while iPhone 8 at the same price in India will give software support for at least 4 more years. I mostly use Google apps so wanted to buy Pixel 2, but worried about support and after-sales service in India.  \r\nAlso, for Apple we have stores every few kilometers and availability of accessories like the homepod, watch and airpods is easy while google has no stores nor do we get any google accessories here like home speakers, pixel buds etc. here.  \r\nWhich phone to choose really confused.", "date": "18 Mar 2018"}, {"text": "Why is this so pricey??.... just a 5incher!! this or S7 be better plz???", "date": "18 Mar 2018"}, {"text": "Why isn't this border less design like the XL version? I am going to skip the pixel for the second time, maybe 3rd pixel will be my next phone!", "date": "17 Mar 2018"}, {"text": "Pixel 2 or Samsung s8? Going travelling and getting into landscape photography/video making with a gimbal. Can get either for about the same price. I'm coming from an iPhone. Any opinions?", "date": "16 Mar 2018"}, {"text": "Thanks but why? smaller is not good?", "date": "15 Mar 2018"}, {"text": "Better go for Pixel XL 2 ", "date": "14 Mar 2018"}, {"text": "Hi everyone, please guide me to buy new mobile i am planning to buy google pixel 2 smaller one is this good phone or  i can go with any other mobile ,please tell me ...thanks in advance right now iam using galaxy s6 edge...suggest better one please...", "date": "12 Mar 2018"}, {"text": "Please factory reset your phone..then try for installing", "date": "08 Mar 2018"}, {"text": "Correct me if I'm wrong, but didn't Chinese government restrict connection to specific sites? \r\nMost Google-related services are banned, I heard. \r\nAre you using VPN, proxy service or whatever to avoid that? If no, better ask your friend", "date": "07 Mar 2018"}, {"text": "I got a pixel 2 in china, through a friend in india by flipkart , i can't update the os tried several times, just says installing security update ,for several hours the same screen after few hours it says couldn't download, can anyone tell what i can do to solve this problem? The phone is still running 8.0. and also the selfie portrait isn't working", "date": "07 Mar 2018"}, {"text": "One more gripe.\n \r\nNot only omitting headphone jack, it (most likely deliberately) omits Miracast. \r\nBoth are inexcusable, evil intents.\n \r\nI love this phone overall though", "date": "07 Mar 2018"}, {"text": "Very Expensive :(   ", "date": "06 Mar 2018"}, {"text": "Google sucks at all design: their apps, their Android UI, their phones. They good at storing info and serve it to you. Sad they think otherwise.", "date": "05 Mar 2018"}, {"text": "Really good ideas but you know sadly they have theirs", "date": "05 Mar 2018"}, {"text": "I got mine a couple of days ago and absolutely love it.\n \r\nThe camera is great, this is practically going to be my digital camera. \r\nThe battery life is significant upgrade from OnePlus 3T, and I get 6 hour of screen-on-time with every function turned all on (including always on display), auto brightness, aggressively connecting Bluetooth devices, watching YouTube using speaker..  \r\nI don't play game though.\n \r\nSadly, aside from superb camera, almost all the goodnesses of this phone are invisible; timely update, extended guarantee, stability, photo storage, squeeze, etc. so there is no wonder Pixel is being battered and called overpriced.\n\n \r\nP.S. Listen up Google,  I've been using Bluetooth headphones since 2012 and now I bought Pixel 2, but I NEVER mean to forgive them for removing headphone jack by any means! \r\nIt's nothing like \"removing USB-A\", \"removing RGB Port\" thing, because removing 3.5mm jack doesn't bring any benefit nor evolution at all!", "date": "04 Mar 2018"}, {"text": "How often camera app stop working and how about the battery life ? thinking to get one tomorrow.", "date": "26 Feb 2018"}, {"text": "Well regarding pricing, on offer this handset costs Rs.40,000/- but the sad part is that my Pixel 2 created problems 3 times and each time Google is replacing the handset with a new one, today I am going to receive my 3rd replacement. Hope this time it works perfect \r\n1st Set Camera app stop responding, 2nd Set Power Button stop functioning, 3rd Set extreme overheating that too before the Feb update. Still I like the set due to its perfect size, speed, camera and hopes that atleast the phone works perfectly\n\n", "date": "23 Feb 2018"}, {"text": "TL;DR", "date": "22 Feb 2018"}, {"text": "Seems a bit overpriced for price sensitive markets like India, in spite of the regular offers. While Samsung and Chinese handset manufacturers have cracked the pricing code in India, Google lags behind...", "date": "22 Feb 2018"}, {"text": "Sorry to hear that mate \r\nThat's not general thing of Android, but certainly the battery drain bug caused by notorious February security update for pixel, and patche's coming soon. \r\nBefore that happened, users report excellent battery life in their reviews here and there. \r\nIsn't it too early to jump into a conclusion? \r\nA lot of YouTubers I sub left iphone in favor of pixel. And I'm almost buying mine..\n \r\nI understood it's 100% Google's fault and not your fault, anyway.", "date": "21 Feb 2018"}, {"text": "Switched from iPhone 6 to android with this device. Expected a lot. But had to face the reality. I mean the camera was really good. But the Battery drains very quickly. I stopped all the background data/refresh. Then started deleting apps that i installed. Best i got, ~18 hrs after full recharge. Even if i keep the device idle,without touching a bit, it loses 5% battery. \r\nOne more thing, bottom part of the screen sometimes became unresponsive. \r\nReturned it after 5 days use.  ", "date": "21 Feb 2018"}, {"text": "Sorry...I meant Snapdragon 855 for the XL.", "date": "20 Feb 2018"}, {"text": "Idea for Pixel 3 (let me know if you guys agree. Never know if Google is watching):\n \r\nPixel 3 mini: $400\n \r\nDisplay: 5.0\" 1080 x 2160 Super AMOLED full HD; Gorilla Glass 5 protection \r\nAluminum Body \r\nSnapdragon 636 \r\nRAM: 4 GB \r\nHard Drive: 64GB/128GB ($100 more for the 128GB) \r\nStereo Speakers (subwoofer on the bottom of the phone) \r\nHome Button/Fingerprint Sensor in front \r\nBattery: 3,000 mAH removable battery (to compensate the sensor in the front) \r\nSD slot? Hybrid Dual SIM (up to 256GB for the MicroSD) with eSIM embedded \r\nRear Camera: 12 MP (same as the Pixel 2) with 1080p/60fps video capture \r\nFront Camera: 8 MP with 1080p video capture \r\nIP53 Splashproof \r\nHeadphone Jack with DAC \r\nAndroid Oreo 8.1\n \r\nPixel 3: $600\n \r\nDisplay: 5.5\" 1440 x 2560 pixels; P-OLED; Gorilla Glass 5 protection; Dolby Vision \r\nHalf Aluminum/Half Glass \r\nSnapdragon 845 \r\nRAM: 4GB/6GB ($100 more to upgrade) \r\nHard Drive: 64GB/128GB/256GB ($75 more per Hard Drive upgrade; $150 max) \r\nFront-Firing Stereo Speakers (Dolby Atmos or Harmon/Kardon) \r\nFingerprint Sensor in the back \r\nBattery: 3,500 mAH Battery; embedded \r\nSD slot?: Hybrid dual SIM (up to 256GB for the MicroSD) with embedded eSIM \r\nRear camera: Dual setup with 16 MP and 12 MP Wide-angle Lens; 4K/30fps recording \r\nFront camera: 8 MP \r\nIP67 Waterproof/Dustproof \r\nHeadphone Jack with DAC \r\nIR Blaster \r\nAndroid Oreo 8.1\n \r\nPixel 3 XL: $750\n \r\nDisplay: 6.2\" 1440 x 2880 pixels P-OLED; Gorilla Glass 5; Dolby Vision \r\nHalf Aluminum/Half Glass (enabling Wireless Charging) \r\nSnapdragon 655 \r\nVariants: 4GB RAM/64GB ROM; 4GB/256GB ($150 more); 6GB/128GB ($125 more form the base price); 6GB/256GB ($200 more from the base price), 8GB/256GB ($300 more from base price) \r\nFront-Firing Stereo Speakers (Dolby Atmos or Harmon/Kardon) \r\nFingerprint sensor in the back. \r\nBattery: 4,000 mAH Battery; embedded \r\nSD slot? Yes; dedicated slot (up to 1TB) with dual SIM and embedded eSIM \r\nRear camera: Dual setup 16MP + 12MP Wide-angle lens; 4K/60fps recording \r\nFront camera: Dual setup 12MP + 12MP Wide-angle lens; 1080p/60fps recording \r\nIP68 Waterproof/Dustproof \r\nHeadphone Jack with DAC and FM radio \r\nIR Blaster \r\nAndroid Oreo 8.1\n \r\nThey can all come with the quick charge cable and brick, pre-applied tempered glass screen protector, and wired headset made by H/K or Google.\n \r\nWhat do you guys think?", "date": "20 Feb 2018"}, {"text": "Small battery? You should check out the Sony Xperia XZ1 it has the same sized battery while having a bigger display and not Amoled. Lol...", "date": "17 Feb 2018"}, {"text": "Poor battery \r\nNo micro sd slot", "date": "17 Feb 2018"}, {"text": "small battery, \r\nalso what about a super compact 5 inch bezel less display phone ????????", "date": "17 Feb 2018"}, {"text": "The design looks 4 years old already...look all the other HTC phones", "date": "17 Feb 2018"}, {"text": "- As OS Gets bigger (Marshmellow 6.0.1 = 5GB) \r\n- Android Games start to become the size from PSP Roms (~1GB) to PS2 Roms (~4GB) \r\n- Small simple (Google Play, Youtube, Facebook, etc) apps are going from 10MB to 100-500MB+\n \r\n- Data isn't as cheap as an SDCard & Neither Faster, if you break your phone with an SDCard in it, you can take out the SDCard...if you weren't connected to Data between your last upload & usage then you've lost some stuff \r\n = Con for SDCard, if you lose the phone, you lose everything with it", "date": "16 Feb 2018"}, {"text": "Everything is good.. except battery..", "date": "15 Feb 2018"}, {"text": "why 145mm tall for a 5inch screen? ", "date": "15 Feb 2018"}, {"text": "...Except downloaded apps and stored music. Online cloud storage is useless in this case. This phone is OTG enabled, so you can use the supplied adapter to transfer any photos, files etc to SD card.", "date": "12 Feb 2018"}, {"text": "Pixel 2 wasnÂ\u0092t available January 2017 IÂ\u0092m pretty sure ", "date": "11 Feb 2018"}, {"text": "@Lukong, Google provides limitless storage in the cloud, that is actually a feature of the phone, so your device should always have space when it needs it. Your device negotiates the uploads with your associated Google account, and whatever is uploaded will still be accessible even if you switch to a non-Google phone later.", "date": "09 Feb 2018"}, {"text": "Sony ?.. I doubt it ", "date": "07 Feb 2018"}, {"text": "Average users hardly use more that 30GB on their smartphones! And most things are cloud storred ;)", "date": "06 Feb 2018"}, {"text": "They advertise this as a phone that doesn't run out of space...but put no SDCard Slot...people who don't check the Specs will Regret buying this phone\n ", "date": "04 Feb 2018"}, {"text": "That's why only Sony and Samsung could only declared as winner!", "date": "02 Feb 2018"}, {"text": " this could have been a winner but with no card slot and no earphone jack        and a high price it's a loser", "date": "01 Feb 2018"}, {"text": "Fantastic phone, very nice design, very fast, decent battery time for a 2700mah battery, exceptional audio quality (ear and loudspeakers (stereo btw)). \r\nThe bad: no headphone jack WTF?, USB C for charging is picky as hell, very little battery packs works with this phone, same with car adaptors,i couldn't find not one on my region with power delivery standard, so it's a problem!.", "date": "31 Jan 2018"}, {"text": "worst design ever period ", "date": "30 Jan 2018"}, {"text": "The listened to your advise and bought HTC to help them ", "date": "30 Jan 2018"}, {"text": "Good joke", "date": "28 Jan 2018"}, {"text": "Hi all I have bought this phone. It developed some issues in a month so I had to send it for repair but after 1 month also they are not able to repair this device. They basically don't have any service provider team. So don't go for this phone as if it gets any issues u ll be a lot troubled", "date": "25 Jan 2018"}, {"text": "If you get an unlocked one from a google store unstead of a career it will work all across the world ", "date": "23 Jan 2018"}, {"text": "Never go to made in Pakistan or made in china products for the sake of our country. ", "date": "21 Jan 2018"}, {"text": "Google need a new design team.. ", "date": "20 Jan 2018"}, {"text": "you'll need 1tb RAM to run google", "date": "19 Jan 2018"}, {"text": "Oneplus 5 is better than the google pixel 2.", "date": "19 Jan 2018"}, {"text": "If you like 5.5 inch display then go to oneplus 5. It's the best but cheapest..", "date": "18 Jan 2018"}, {"text": "Hi friends iam from india.pls suggest me which one is best one plus 5 or Google pixel 2.thanks in advance", "date": "18 Jan 2018"}, {"text": "With a 5,3 screen and 143 mm tall it would be perfect.", "date": "18 Jan 2018"}, {"text": "Google assistant is better than siri, Android 8.1, Now playing song display on screen. The most amazing phone I hv ever bought but missing samsung music player, file manager & wireless charging. Don't like orange & yellow colour ugly music player.", "date": "18 Jan 2018"}, {"text": "Google's R&D department need firing. First of all, the designs of the phone suck. They give the smaller phone chunky bezels, and for the XL device they use an inferior LG screen. I was tempted by the camera & clean Android exp but I'll wait and see if the Pixel 3 is any better.", "date": "17 Jan 2018"}, {"text": "Battery rating seem awful. wtf!", "date": "17 Jan 2018"}, {"text": "Great Phone...  No complaints ", "date": "16 Jan 2018"}, {"text": "Good phone missing wireless charge ", "date": "15 Jan 2018"}, {"text": "Good camera, everything else is bad.", "date": "10 Jan 2018"}, {"text": "Nice set, good camera ", "date": "05 Jan 2018"}, {"text": "Really a dream phone. I just bought it 2 weeks back from USA. Camera picture quality, sounds, video, touch sensitivity all are perfect. No doubt to recommend for pixel 2.", "date": "05 Jan 2018"}, {"text": "Get the lg v20. You could replace the battery yourself quickly and inexpensively.", "date": "05 Jan 2018"}, {"text": "Excellent device but we want dual sim", "date": "28 Dec 2017"}, {"text": "I would suggest a dslr as you have full control of the imagers you take and have the option of other lenses. You will be able to creat exactly what you want to creat. ", "date": "28 Dec 2017"}, {"text": "For actual photography system camera can always give best results with dedicated lenses for different purposes. \r\nCameras crammed into tiny space in phones are even more compromise, than compact cameras and able to fit only single focal length lens. While bigger fixed lens cameras can have quite a lots of zoom range and versatility... \r\nThough at the expense of pocketability.\n \r\nWhich is where system cameras compromise: \r\nWhile in fixed lens compacts you have even heavily ruggerized and waterproofed cameras (like Olympus Tough serie) in pocketable size, in system cameras you really don't have much of pocketability. \r\nEspecially in DSLRs, which with their flapping mirrors are still semi analog in design. Besides that mirror hampering full integration of video shooting... \r\nTo use analogy DSLRs are like smartphone with old rotary dial. \r\nOnly area where they have overall advantage over mirrorless is fast moving target tracking, thanks to phase detection AF. (which is now found only from some mirrorless bodies)\n \r\nThat mirror box causes it's own limits to lens design heavily increasing size of wide angle lenses. \r\nAnalog film era legacy sensor formats add their requirements to lenses. \r\nSo when you add more than one lens amount of stuff needing carrying starts to increase fast. \r\nAnd no matter how capable equipment is it doesn't take any photos (not even badly composed/framed/exposed/focused ones) if you don't bother to carry it much, because of bulk/weight! \r\nReason why traditional cameras have lost share in photography to cameras built into phones is convenience.\n \r\nWith even tiny digital sensors exceeding performance of 35mm film (smallest analog format good enough for most uses) there's very little need for those legacy formats for general consumer use. \r\n\"Four Thirds\" format of Olympus (+Panasonic) designed without film era legacy baggage of Canon/Nikon strikes very good balance for that: \r\nWhile technically not as good in everything as bigger formats skilled photographer using proper lenses can produce fully same level quality than typical Canikon DSLRs in not so many years ago. \r\nMore importantly it allows very good scaling in lenses, depending if user wants smaller and lighter system or more quality/performance and ergonomy. \r\nIn some lens types you can get that high optical quality in really small size and light weight compared to film era legacy systems. \r\nAnd it has way largest lens selection of mirrorless systems all the way to higher optical and construction quality lenses with two manufacturers invested in it.", "date": "26 Dec 2017"}, {"text": "How does the offer applicable ?? ", "date": "25 Dec 2017"}, {"text": "Mine too", "date": "25 Dec 2017"}, {"text": "Pixel and Pixel2 both have the same camera Einstein!!!", "date": "24 Dec 2017"}, {"text": "you should go for pixel2 . becose i have it and its camera is just amazing rather then dslr ", "date": "23 Dec 2017"}, {"text": "Both One Plus 5T and Google Pixel 2 is great choice. But I guess Pixel 2 is a better choice in the two as it will get more upgrade and updates in next few months. \n \r\nAs for using 3/4 years, it is impossible. May be you can use a laptop (mine is 6 years old with a second new original battery and keyboard) for 4/5 years. But a smartphone is impossible, as first now a days the battery is seal packed and as the battery dies, the phone dies. Second software upgrades every year with new features and technology and third new innovative hardware like the new dual cameras/long 18:9 screen etc.\n \r\nSo, my opinion is don't go for very high end device like 40K/50K, but a mid range in maximum 25K and use it for 2 or maximum 3 years. than buy a new one. Currently I am using a J7 Prime (nouget) for one year and will keep it for till next year. Than I will buy a  new device with Android P. Regards.", "date": "18 Dec 2017"}, {"text": "If you are really serious about photography than go for a DSLR, because you can customize with various lenses like wide, telephoto etc. My cousin brother is a doctor and photography is his serious hobby and a he uses a Nikkon DSLR from D series. Trust me his photographs are really amazing. He won many awards and appreciation. So, I will suggest you to go for a well branded DSLR from Nikkon or Cannon. They will last long, have many Lense options and more professional than a smartphone camera. Regards.  ", "date": "18 Dec 2017"}, {"text": "Should I buy a Pixel 2 or an entry level DSLR for around Rs. 30-40K, for photography.....please answer from your experiences, Thank You.", "date": "17 Dec 2017"}, {"text": "I don't think iPhone is as reliable as you might imagine. \r\nAt the time I use iPhone 5s it occasionally freezes, and now my sister's 6s is luggy as hell with latest OS (compare to my oneplus 3T). \r\nPixel 2 would be better option.", "date": "17 Dec 2017"}, {"text": "Lengthen your short list.", "date": "16 Dec 2017"}, {"text": "Guys i am planning to buy a new mobile by year end. I have short listed OP5t and Pixel 2 both are at almost same price after Pixel 2 getting heavy discount on Flipkart India. \n \r\nWhich one should i choose for long term reliability i.e. for 3-4 years. Is buying the Pixel 2 on Flipkart safe and why is it so cheap. Or should I go for iPhone 7 in terms of long term reliability. Here with reliability i mean hardware wise. Also let me know if there are any other in this price range. Thanks in advance. ", "date": "16 Dec 2017"}, {"text": "my Nexus 6P still up to date... thx Google for O 8.1 \r\nsimply and fast... ", "date": "16 Dec 2017"}, {"text": "Quiet expensive for his phone..", "date": "16 Dec 2017"}, {"text": "Simply loving the camera. Its just awesome as advertised. ", "date": "15 Dec 2017"}, {"text": "Today i got 8.1 update...(india) ", "date": "15 Dec 2017"}, {"text": "I've had a Pixel 2 for a week and opted to return it.  It is a decent device, but not much of an upgrade from the original.  The dongle works but is cumbersome.  The quality of the sound using the dongle is quite good, better than the original Pixel's jack but it's just not worth the hassle. Overall performance is pretty snappy, but not a huge improvement over the original.  Bluetooth reliability has been improved.  The giant bezel makes it look old.  Having the latest and greatest software updates is not much of an advantage.  Bottom line, unfortunately, the Pixel 2 is just not much of an upgrade.  ", "date": "14 Dec 2017"}, {"text": "I purchased pixel 2 couple of days ago, have seen announcement of 8.1 on pixel and rollout is already initiated. But I did get only 1 update so far and no December security patch for  8.1. Is it available on OTA in India ? Still on November security patch, what's wrong here ? Did anyone from India got 8.1 OTA update ?", "date": "13 Dec 2017"}, {"text": "I wanted to know is it safe to use Google pixel 2? I mean to say all the talked issues which were in media abt Pixel 2 is now resolved or it is still not? I want to buy from flipkart,India..pls confirm.", "date": "13 Dec 2017"}, {"text": "How is the audio quality through headphones using the supplied adapter as well as through bluetooth headphones when compared with htc phones like u11", "date": "13 Dec 2017"}, {"text": "i have pixel 2, I've noticed the display is warmer, is it normal?", "date": "12 Dec 2017"}, {"text": "Any reason you say so , i found 5t impressive ", "date": "11 Dec 2017"}, {"text": "Few facts, Samsung is always year or two ahead of the android, from \"multitasking\" to other features. And to me, as someone who got used to Samsung - stock android is not just boring, but also LACKS FEATURES. \r\nThen this phone... no headphone jack, no SD slot, only IP67 water ressistance... is there anything that this phone has??? \r\n- YES! ----- BEZELS! HUGE BEZELS!!! \r\nComparing this to my S8 is just sad, ironically Pixel 2 is even more expensive in my country, and is newer production date.", "date": "10 Dec 2017"}, {"text": "Damn! I'm totally impressed with my Pixel 2. I just came here to see if iPhone X got the better loudspeaker and again I'm impressed because Pixel got Voice 70dB, Noise 77dB and Ring 81dB while iX got  Voice 68dB, Noise 74dB and Ring 76dB.\n \r\nGuys, go for Pixel, see the real world :D", "date": "10 Dec 2017"}, {"text": "Pls go for Pixel bcs I am already using one plus 5t and I do not feel any thing impressive than Pixel so I ordered my newvpixel2", "date": "09 Dec 2017"}, {"text": "definitely pixel ", "date": "09 Dec 2017"}, {"text": "Pixel 2 is available in India @ at a discounted price tag of 39,990 (620 $) till 9th of Dec. \r\ninitially i had made up my mind to buy One Plus 5T 128 gb variant which cost 37,990 (600 $) \n \r\nNow i am confused which one to go for as both the flagship devices are available in the same price range.\n \r\nSo what you guys suggest one plus 5t or Pixel 2???\n\n", "date": "08 Dec 2017"}, {"text": "Pixel 2 is available in India @ at a discounted price tag of 39,990 (620 $) till 9th of Dec. \r\ninitially i had made up my mind to buy One Plus 5T 128 gb variant which cost 37,990 (600 $) \n \r\nNow i am confused which one to go for as both the flagship devices are available in the same price range.\n \r\nSo what you guys suggest one plus 5t or Pixel 2???\n\n", "date": "08 Dec 2017"}, {"text": "It does work. But get unlocked one.", "date": "07 Dec 2017"}, {"text": "yes and I already ordered one its on the way from The US to my country Saudi Arabia", "date": "06 Dec 2017"}, {"text": "Does it have automatic call recorder? ", "date": "06 Dec 2017"}, {"text": "Good day! \r\nCan someone kindly answer my question? \r\nSince the price of the Google Pixel 2 is cheaper in the US and Canada, if I buy one in one of those countries, will the phone work with the network frequencies in the Philippines and other Asian countries? \r\nThank you very much!", "date": "06 Dec 2017"}, {"text": "Ha ha ha I've become the joke of the year myself. sorry bro I misunderstand your comment no shame to admit it. Look the thing is : first some of thinesst phones like iPhone 6 had 3.5 port so there is no excuse there second there is no advantage to USB c and lightning.third as someone who live with music 24/7 and posses a lot of high end earphones I can absolutely tell there is no wireless earphone or headphone in the world that can compete with the wired version for god sake only 1 time test 2 earphones side by side thed one wired a very normal pair like Nocs NS500 and the most high end  Bluetooth or wireless one like xelento wireless then come back and tell what's the deal with BT and wireless", "date": "04 Dec 2017"}, {"text": "Ha ha ha joke of the year. Sir could I have 12 Balanced Armatures in my fxa6 instead of 1 ??? No sir but I think apple will release something like that really soon!!!   \r\nAll earphones have limited space. \r\nPS first understand difference between earbud and earphone ", "date": "04 Dec 2017"}, {"text": "I will try to be polite. Your comment isn't about Pixel 2. It's about Youtube app, on any android device, probably ios as well. So you offended posting rules \"deliberately and repeatedly bashing the same brand\".", "date": "04 Dec 2017"}, {"text": "Because those devices aren't limited on space for hardware", "date": "03 Dec 2017"}, {"text": "Last year's designs were better.", "date": "02 Dec 2017"}, {"text": "There is no better Android phone on the market for the price: don't buy it. Google is a great designer, and did very well. But they forgot one thing: the customers. Google has repeatedly sacrificed user interface for money. We see this when you have to buy Verizon (12 months on cheapest plan costs more than the base pho e), or pay $200 extra. YouTube is a direct app, despite the phone's capability to have it be an indirect one. This means you must have the YouTube app open or the YouTube tab open for sound to play. On a Google chromebook, and any other device, YouTube can play in the background. This useful feature is conveniently locked behind a paywall, and you need YouTube Red (also trash and screws small YouTubers) to have that feature. To top it all off, I have had 3 adds for Uber on the same YouTube page almost every video (including video adds), despite me telling Google \"not interested,\" and \"already seen this.\" I have a car, I don't need Uber.\n \r\nYou can't get a better made Android for the price, but you will pay for it in headaches and frustrations. Don't buy it, try and see if Google learns from it's mistakes in the Pixel 3. I hope it does...", "date": "02 Dec 2017"}, {"text": "I actually use wired headphones as a matter of choice and probably you should too...because bluetooth is a wireless device and adds to wireless radiation around you..so you want to avoid further radiation or bathe in more wire less radiation?? So that's where all the cribbings and \"why did they remove headphone jacks\" talk come from...Hope you get it..no?", "date": "30 Nov 2017"}, {"text": "I think its a good, powerful phone and will consider the purchase of it! :)", "date": "30 Nov 2017"}, {"text": "Carphonewarehouse did it again. £50 is off Pixel 2. I bought mine last week and no issues so far.", "date": "27 Nov 2017"}, {"text": "I bought my Pixel 2 last week and it's been perfectly fine. No issue so far.", "date": "27 Nov 2017"}, {"text": "After I had a Pixel 2 for 3 week I ended up returning it. It would've been a great phone, if it wasn't plagued by issues that are seemingly ignored by Google. My Pixel 2 was randomly rebooting itself, despite resorting to the Pixel Community for help as per suggested by Google. I ran it in Safe Mode, did a Factory Reset, even wiped its Cache Partition, yet still, it randomly reboots. This is an issue that plagues hundreds of users, but since it's just hundreds of users, Google doesn't see it as a high priority.  \r\nOn top of the random reboots, the device also makes a high pitched coil whine when making phone calls, this is also not a common issue, though affecting hundreds of devices. \r\nAnyone looking to buy a Pixel 2 or Pixel 2 XL should be aware that their device might be plagued with these issue as well. I would strongly recommend waiting for Google to fix these issues before dropping your money on these devices.  ", "date": "25 Nov 2017"}, {"text": "only 2700 mah of battery :( i'm disapointed \n", "date": "24 Nov 2017"}, {"text": "Good stuff", "date": "23 Nov 2017"}, {"text": "Its 'NO'Until now we  don't have a dual sim version from Google i mean nexus and pixel ..", "date": "23 Nov 2017"}, {"text": "The pixel is fantastic. I would have got it had it had a smooth screen edge to frame feel like HTC A9 and others.", "date": "22 Nov 2017"}, {"text": "Is there any versions that have dual sim or not? ", "date": "21 Nov 2017"}, {"text": "so if it so yesterday why do cars still come with a audio jack....why do high end audio equipment still use the audio jack....even computers still come with a audio jack....so you can't say its yesterday tech when it is still every where ", "date": "20 Nov 2017"}, {"text": "The Nokia 8 can compete with the pixel 2 in a number of area's sure. For camera quality though it isn't even close, the pixel 2 isn't just a league above its more like 3 league's.\n \r\nBut yes the Nokia 8 could be argued to be better value for money at £399, it's camera is bad though.", "date": "15 Nov 2017"}, {"text": "People like me, who reasonable treat a smartphone as simply a smartphone, need to justify paying £629 (at carphonewarehouse) for a phone. It'd be better to price it at £500 and give the rest to charity. But I'll wait a bit longer when carphonewarehouse slashes the price as it did with Pixel XL at reasonable £399.", "date": "15 Nov 2017"}, {"text": "With the same design as last year, a screen that doesn't get any brighter and a battery that is marginally better, Google has not really done enough IMO. IP67 is welcome though. Nokia 8 seems better value (now £399 in UK).", "date": "15 Nov 2017"}, {"text": "No headphone jack kills it for me.  Don't tell me about Bluetooth, I've tried several versions and they just don't work consistently well.  There are NO good USB-C earbuds yet.  If either of those two ever come about, I'd go for it.  My first gen Pixel works just fine. NO THANKS GOOGLE! ", "date": "15 Nov 2017"}, {"text": "Since my last post about 10 days ago, I'm still having a good experience with the Pixel 2. The only issue I get is that I am unable to use the built in file Manager in the way that it will only let me move files to the Downloads folder. Can't transfer to any other folder. Thus I cant even move to an OTG connected sd card. The only solution is to use a third party File Manager App. Also, if you still haven't got the November 5th patch with the vivid colours, you need to manually search while connected to WIFI. \n", "date": "09 Nov 2017"}, {"text": "Thats on the XL brah... cheers!", "date": "08 Nov 2017"}, {"text": "phone too big for the screen size. this thing should be made a compact", "date": "08 Nov 2017"}, {"text": "You should never buy a phone (2 XL) today based on the promise of a software tomorrow. And make no mistake: I do not believe that GoogleÂ\u0092s software changes are going to alter the experience of this screen.", "date": "05 Nov 2017"}, {"text": "Camera is phenomenal, videos are like it's on rails, image stabilization is fantastic as is it's night cababilities. Recorded a video in a nightclub and it not only shows clearly in the dark it responds quickly to bright lights and doesn't over expose. \r\nAs close a phone camera to your own eyes as I've seen.", "date": "04 Nov 2017"}, {"text": "Open Battery Optimization in your settings. It will get better. ", "date": "04 Nov 2017"}, {"text": "Too big for the phone with the fingerprint sensor on the back. Too expensive. Too small battery capacity. Typical HTC (& SONY, unfortunately) characteristic. Sorry guys, but you should look at Chinese and Korean friends, and learn how to make modern phones.", "date": "03 Nov 2017"}, {"text": "I think will take google pixel 2 because the dimension is very good for my hand", "date": "03 Nov 2017"}, {"text": "Using it for since a week. As of now, am facing heating and battery drain problem. Just 40 mins of whatsapp usage drained 30% of battery. The photos app drained some 25% for some 10 mins usage and the phone has hardly 4 photos. The stereo speakers sound so good. ", "date": "01 Nov 2017"}, {"text": "Read some review on DxO Mark, Google Pixel 2 camera surpassing iPhone 8 and 8 Plus in almost every aspect, simply the Pixel 2 is the Best camera phones at least for now. Since Nexus 5x, 6P, and Pixel, Google really have good experience of making a really good camera phones.", "date": "31 Oct 2017"}, {"text": "waiting for the detailed review.. and loudspeaker power and volume for calling and all", "date": "30 Oct 2017"}, {"text": "please,put in site camra quality for compare.", "date": "30 Oct 2017"}, {"text": "Man i was very correct.  \r\nTypical in present era big companies brainwashing other people usualy with advertising and other crap. But this advertising is so expensive that raise the phone price by margain number in case of companies like apple is 30%. Rest is other useless thigs which basic consumer ignore. Like sallary of CEO. Transport from china to world etc.  \r\nIn case of ceo an US worker earn per month same money or even more than company leader in china. No matter how you look at is very real. ", "date": "30 Oct 2017"}, {"text": "Being Google doesn't mean being good at everything. It is not good phone. ", "date": "30 Oct 2017"}, {"text": "Upmarket in price but not quality", "date": "30 Oct 2017"}, {"text": "I have to say Best Smartphone Ever in terms of camera. Thank You Google.", "date": "30 Oct 2017"}, {"text": "I think I would go for Pixel 2 over 2 XL. Because its cheaper & I prefer HTC over LG on reliability. I don't trust LG. And about the bezel on HTC bezels, I prefer HTC boomsound over smaller bezel.", "date": "29 Oct 2017"}, {"text": "Screen resolution 1080 only, yawn...", "date": "29 Oct 2017"}, {"text": "Best battery life ever !! Moderate usage and alot of youtube and from 7:00am to 1:00am the following morning, I had 49% battery left ! No biggy on the loss of the headphone jack as I have wireless earphones. Great phone so far.", "date": "27 Oct 2017"}, {"text": "Man if you don't like  and if you like Mi  or X or Y kindly refrain you words against these", "date": "27 Oct 2017"}, {"text": "Bezels on a phone don't bother me, but I also haven't had a phone without them. The camera on this thing is great, as are the front-facing speakers and IP67 dust/water resistance. USB-C is a lint magnet, but I'd rather have that than a proprietary connector. Losing a headphone jack is slightly annoying, but life goes on. I do wish Pixel took on the same size at an iPhone, but on the flip side you can run split screen apps whereas that may be too small on an iPhone. Overall I'm quite pleased with the change up from Pixel 1 or iPhone 7.", "date": "26 Oct 2017"}, {"text": "Google Pixel 2 review: dated design lets down smartphone that almost had it all,", "date": "25 Oct 2017"}, {"text": "Man you are the one of these people who buy no matter what. What a waste of money. \r\nSame politics like Apple- Iphone x cost 1300 eur + 150 per wireless charger and people will buy because apple brainwash their heads.  \r\nIt can cost 5000 eur and people will still buy even if they have to starve on streets for 2 years.  \r\nOh man what kind of age we live.  ", "date": "23 Oct 2017"}, {"text": "Yup thats correct. ", "date": "23 Oct 2017"}, {"text": "You don't get it, I don't care if it is the newest, actually I care if it is old so I know it works. A second generation of a model is ALWAYS more stable and durable. For me stable and durable wins over taking a chance on something that may catch fire (ie S7) ", "date": "23 Oct 2017"}, {"text": "Yes, it's camera is the best in the high mid-range category, but it is only one of the best among newest flagship phones. For example comparing Px2 to a 6 months old gs8: f/1.8 vs f/1.7, sensor size 1/26 vs 1/2.5\". For many of us camera is a secondary thing there are much important things such as lack of SD card, wireless charging, iris scanner, heart rate monitor, IP68, bigger batter, audio jack, and so on... During Nexus era Google offered \"reasonable price for high specs\" vs today \"reasonable specs for high price\"", "date": "23 Oct 2017"}, {"text": "Exactly. Lately the only \"innovation\" is removing the audio jack  without adding anything else. ", "date": "23 Oct 2017"}, {"text": "There is a lot to be missing for its price.  \r\nGoogle probbably dont know how to earn money.  \r\nIts like a king and his counselors in middle age.  \r\nAnd these counselors took money but create nothing. \r\nThey only believe people are so naive that they would buy no matter what.  \r\nSame politics like apple. ", "date": "23 Oct 2017"}, {"text": "Samsung Sony and Apple veterans? Where? how? \r\nMotorola were first back in 1979 and from then all copying something that someone else made. Sony is expensive as google pixel and their devices also. Evena low model with low specs cost as medium to high end model. \r\nSamsung does phones thats true but Samsung does everythign else. From Shaver or Microwawe over to freezers TV, Hifi, Audio, Video, PC and everything else. They making really high quantity but really low quality. (I stands for a words that if company making just one type of product that this product is really high in quality because company focuses only here. Samsung does opposite). \r\nAnd Apple is special category they have everything ownand nothing trully own apart from IOS rest is a copy from other companies like Super Amoled Screens IP68, 4k recording etc. Also Apple dont do low or mid rangers. Maybe Apart from Iphone 5c which was medium model but for a high end price. \r\nBut even a high end phone cost up to 600 for a china made phone. Apple which is also china made dont hesitate to ask 1300 for new iphone X plus 150 for wirreles charger which is not included in phone.  ", "date": "23 Oct 2017"}, {"text": "Nothing wrong with IP67, but to be honest, for that price Google should do much better. ", "date": "23 Oct 2017"}, {"text": "And what's wrong with ip67? Most people wouldn't dare submerge such an expensive device in the first place. Its there mostly for protection from accidental dunks into water.", "date": "22 Oct 2017"}, {"text": "actually i dont know a single person whos listening music from his phone via headphone jack.. so yes its yesterday.. atleast in Europe..  \r\nmby in Africa u cant buy bluetooth earplugs or youre car (or horses) do not have bluetooth capabilty..  sry but thats youre probem m8!", "date": "21 Oct 2017"}, {"text": "Ok, got my Pixel 2 on Thursday, it's running the 'September 5th' security patch, no sign of October's. \n \r\nWhat gives, I thought these Pixel things were supposed to be bang up to date all of the time? \n \r\nThe Galaxy S8 series just got the October patch, as have a number of the new Nokia's and the Xperia XZ1 range.", "date": "21 Oct 2017"}, {"text": "\"headphone jack is YESTERDAY .. do you know thing called BLUETOOTH?\"\n \r\nHilarious comment. You do know that Bluetooth technology for wireless headphones is well over 20 years old now, don't you?", "date": "21 Oct 2017"}, {"text": "weaker camera? LOL it has THE BEST camera on the market.. headphone jack is YESTERDAY .. do you know thing called BLUETOOTH? ", "date": "20 Oct 2017"}, {"text": "That's right. They really need to improve and give some additional features like what you said. This phone is totally overpriced but lacks too many features. Hope for the best for Google.", "date": "20 Oct 2017"}, {"text": "I am a Google fan. I received my new Pixel XL today. I don't think that phone is bad from any perspective but I am still returning. There isn't any significant difference from my existing first generation Pixel XL. Pixel XL still is as good &#128512;", "date": "19 Oct 2017"}, {"text": "I was hoping that Pixel 2 could compete against galaxy s8. However, it looks that they compete only against galaxy A5. The Pixel 2 has Android O, but it lacks: audio jack, no micro sd card, smaller battery, no iris scanner, weaker camera, only IP67, no wireless charging, etc... \r\nI only hope that next year Pixel 3 would catch up with galaxy S.  ", "date": "18 Oct 2017"}, {"text": "I wish there would be a built in headphone jack, i hate having to use adapters.", "date": "18 Oct 2017"}, {"text": "OK bb", "date": "17 Oct 2017"}, {"text": "Thanks, Captain Obvious.", "date": "16 Oct 2017"}, {"text": "old pixel and new one 2?, not huge diff in battery?.....", "date": "16 Oct 2017"}, {"text": "Agree", "date": "15 Oct 2017"}, {"text": "1955? What??? Smartphone and bezels didn't exist then. ", "date": "15 Oct 2017"}, {"text": "I don't think 128GB should be qualified with 'only'. \r\nAs for swappable battery, show me a phone from 2017 that has it.\n \r\nI love havng swappable battery and microsd card slot in my phones though.  That is why i bought an LG V20 last week.", "date": "15 Oct 2017"}, {"text": "What is the deal with those MASSIVE top and bottom bezels? What year is this? 1955?", "date": "15 Oct 2017"}, {"text": "Very true!", "date": "14 Oct 2017"}, {"text": "Another great phone at a ridiculous price point. \r\nThe phone has great specs except, no swappable battery, no SD card slot, no dual SIM and only 128GB storage. They really don't want to give us the missing functionality and why you ask because like me you'll never give up a phone that has all the missing functions once you have one. \r\n I won't be replacing my 950XL anytime soon I suspect, FFS! \r\nNot to mention built in call recording.\n", "date": "13 Oct 2017"}, {"text": "yes", "date": "13 Oct 2017"}, {"text": "I always wanted to own a Google phone, but in my country there is no company or store that provides Google products.", "date": "13 Oct 2017"}, {"text": "Please go back to working on your search engine and leave the making of mobile phones to the Veterans : Samsung, Sony and Apple? Google Pixel 2 is crappy and does not stand a chance to its competitors. -__-", "date": "12 Oct 2017"}, {"text": "Does the Pixel 2 have wifi calling capabilities?", "date": "11 Oct 2017"}, {"text": "If you think pixel bezels are really thick why don't you take a look at iPhone 8 &8 plus which is a real piece of  s*** I only agree that this phone is overpriced no other problem so far I don't listen to music with my phone since my DSD collection doesn't fit into a 64 or 128 handset other than that I never shoot my photos with an smartphone that's why there are cameras out there and no one asked you to buy this handset I use my phone only for texting and calling and downloads not much other than that ", "date": "11 Oct 2017"}, {"text": "I don't think so, that's why I use an iPhone", "date": "09 Oct 2017"}, {"text": "Came here to take a quick look at the specs, thinking \"any chance they have finally added an SD card slot\"... and what do i discover instead... no, they didn't and they have removed the 3.5mm audio connector!!! Way to go, Apple^H^H^H^H^H^H Google.", "date": "09 Oct 2017"}, {"text": "64/128GB storage eMMC 5.1", "date": "09 Oct 2017"}, {"text": "Another ugly duckling on flagships, first the iPhone, next is this one... Lg v30 is little bit better in terms of design, s8 also, but the finger placement is just ridiculous. It's hard to reach.", "date": "09 Oct 2017"}, {"text": "You already thought of upgrading to Pixel 2 and thats where exactly android fails miserably ! lame os which needs 2 gb ram additional to survive every 2 years. ", "date": "09 Oct 2017"}, {"text": "I'm already satisfied with the first generation Pixel, but I already think of getting the Pixel 2. Android is superior to iOS.", "date": "09 Oct 2017"}, {"text": "Of cource it is a whole package, BUT it needs to be on all three sides (design, hardware, software). Even if two of them are fine, and the other is bad, then the phone is bad. \r\nLet me make a point: \"if you have a bucket with honey, and you put a teaspoon of faeces in it, would you eat the honey?\" it is still 99.99% super pure honey! \r\nWhat I try to say here, it is not enough to have a good hardware and pure android to have a good phone if it looks like one pulled out of year 2012. You can buy few other phones with same or better hardware and software, PLUS cheaper (i.e. Galaxy S8, S8 plus, xiaomi Mi6, Essential, Mi MiX2) all of them are great looking! and they have same or better hardware, and most of them are cheaper!! Wafer thin is not a feature, it is stupid - who care if their phone is 7.9mm or 8.1mm, if they can add 0.2mm and much bigger battery - prefer that. \r\nSo, why buy an UGLY phone for so much money, when you can buy the same hardware, but better looking one?! \r\nThis I call FAIL! \r\nI can't beleive someone decided to release such a joke.\n", "date": "09 Oct 2017"}, {"text": "Well Apple has its marketing schemes which promote their phones as \"the best phone yet\"...plus their history of phones are good with almost no fails...so we could call this a fail as it did happen, and based on the latest news of people who have actually tried the Iphone 8 and 8 Plus product have experienced battery issues, and software glitches...so we can accept that Apple is indeed in a big fix right now.  ", "date": "09 Oct 2017"}, {"text": "Do you buy gadget by only looks?\n \r\nA gadget is not just what it looks outside. It's a complete package of hardware and software well synced for an experience.\n \r\nIn that case you should be using only premium phones which are wafer thin and almost bezeless and still have huge battery capacity. Even iPhone X, Essential and Mi Mix2 shall be ughly phones.\n \r\nWhich are those wafer thin phones with huge batteries? Please share your knowledge so that even we learn something on how to judge a phone by external looks of it.\n", "date": "09 Oct 2017"}, {"text": "wat no sd????? no buy", "date": "09 Oct 2017"}, {"text": "Battery should be 3000. hmmm!! ", "date": "09 Oct 2017"}, {"text": "iPhone=Pixels & Pixels= iPhone ---> Faceoff \r\n#Alliance of fruit & G.Robogirl... lol", "date": "09 Oct 2017"}, {"text": "no 3.5mm, no sd card, no fm radio....Iphone with android.", "date": "09 Oct 2017"}, {"text": "Who said, we cannot comment the fail without hands-on experience. \r\nI don't need hands on experience to see that the design is tattal fail! \r\nExtremely ugly, looks like hwawei from 2012! Pixel 2 is as huge as 6-incher but it has only 5\" screen! And you need to cary that \"brick\" in your pocket. \r\nI'm not even started with the failed aspects of the phone. Look at the \"tiny\" 2700 mAh battery, my next to last phone (LG G2) got 3000 mAh battery and that was 5 years ago! \r\nSuch a huge phone with small screen, what they put in it? Compressed air? \r\nShame on you google, it is tottal ****.", "date": "08 Oct 2017"}, {"text": "The only huge fail is iPhone 8 ,8 plus 4 years the same look!!!.There was once upon a time  a person that was called S.Jobs now????", "date": "08 Oct 2017"}, {"text": "How do you know it's a fail? Have you used it? \r\nDon't comment if you don't know what it is. \r\nNo device is perfect. But that doesn't mean you comment without any hands on experience.\n", "date": "08 Oct 2017"}, {"text": "Hahaha those bezels! 2010 called and want them back!", "date": "08 Oct 2017"}, {"text": "\"Kinda Blue, Just Black, Clearly White\" \r\nTBH, their color monikers made me laugh since Pixel 1. So unique! Haha", "date": "08 Oct 2017"}, {"text": "I'm gonna buy Pixel 2 XL, \r\nI love it! ", "date": "07 Oct 2017"}, {"text": "What a huge fail! just like the previous one.", "date": "07 Oct 2017"}, {"text": "Exactly!", "date": "07 Oct 2017"}, {"text": "To each his own.", "date": "07 Oct 2017"}, {"text": "Groan - I said I'd upgrade my Pixel XL to the Pixel 2 XL if it had two features.. IP67 (which it does thankfully) and Qi Wireless charging (which its lacking) - guess I'll wait for the Pixel 3..", "date": "07 Oct 2017"}, {"text": "Dude ,I'm going to NYC just to get this!", "date": "07 Oct 2017"}, {"text": "Non-removable battery and now non-removable sims... \r\nBig Brother wants to be sure to track you where ever you go...\n \r\nJust Saying...\n", "date": "06 Oct 2017"}, {"text": "Now, when finally GOOGLE has answered  my prayers.. that i need a waterproof max 5` screen android phone with good camera... its finally here.. only problem is that its not \"FOR SALE IN ESTONIA\".. i only have one question. .. WHY!?!? :) I dont care if this phone costs 100euros on 1100euros.. it just one of a kind.. previously i used Sony compact phones.. wich are really good.. except Sony cameras SUCK HARD... im gonna travel to another country if i need to.. just to get this phone..", "date": "06 Oct 2017"}, {"text": "Samsung and Apple have offered eSIM enabled devices in the past. \"Embedded SIMÂ\u0094. ItÂ\u0092s a standardized SIM chip open to multiple mobile operators globally. Meaning, if you have an eSIM you donÂ\u0092t have to replace one SIM card with another when switching carrier. Since the eSIM can be programmed remotely, it allows you to choose another carrier by just messaging the old and new provider. The Pixel 2 has both eSIM and Nano SIM Card slot. ", "date": "06 Oct 2017"}, {"text": "That's only a fingerprint reader on the back. Power button is on the side.", "date": "06 Oct 2017"}, {"text": "The Samsung s8 is 8.0mm which is 0.2mm thicker. \r\nThat comment makes no sense.", "date": "06 Oct 2017"}, {"text": "i rather buy dslr camera for 700 ....and phone for 100......after 2 years I get 50 inch tv and 100  $  phone......after 2 years I get  laptop and 100 $ phone......and I wont cry if I dropp the phone", "date": "06 Oct 2017"}, {"text": "Love the phone but hate they drop 3,5mm jack audio, they trying to be apple but apple is suck, google on the way to be", "date": "06 Oct 2017"}, {"text": "hahahaha I agree !", "date": "06 Oct 2017"}, {"text": "The final version is just as bad", "date": "06 Oct 2017"}, {"text": "Google is smart. One small size and one large size phones for optional purposes. The specs are powerful. I never really needed the extra memory card slot. The power button is on the back is what i like. That's why i like lg phones. The overprice turns me down.   ", "date": "06 Oct 2017"}, {"text": "I disagree. I find the phone nicer than many flagships. Bezels do not trouble me in the slightest. I grew fond of them over the years. For you there are for sure bezel-less to choose from. I repeat there are people out there like me for whom couple of pixels here and there do nada.", "date": "06 Oct 2017"}, {"text": " I hope gsmarena make dislike button for those phone only ", "date": "06 Oct 2017"}, {"text": "No card slot = no go and passing on it. Battery is too small too. =/ What were they thinking?!", "date": "06 Oct 2017"}, {"text": "Ugliest phone of 2017 and a whooping price tag...Shame on you Google!!!", "date": "06 Oct 2017"}, {"text": "What's the different between nano and eSim?", "date": "06 Oct 2017"}, {"text": "I can imagine this phone sold as a mid-ranger, but the bezels would still be unattractive, making it hard to choose whether to buy it or not. But it's a flagship so, no. There are a lot more better options.", "date": "06 Oct 2017"}, {"text": "Lol compare their price differences before you say another Nokia in the making!!! You can almost buy 2 flagship Nokia with XL's overpricing crap and it doesnt even have Jack, SD Card Slot, Dual SIM, 4GB Ram, etc. \n \r\nThis is just another POS wannabe Apple product.", "date": "06 Oct 2017"}, {"text": "The first thing I do with a thin phone is slip a rubber case to make it more grip friendly.", "date": "06 Oct 2017"}, {"text": "$650 without taxes. \r\nIn EU prices are final, so if we add, let's say, 20% VAT, you get $780.", "date": "05 Oct 2017"}, {"text": "Might as well buy a HTC U11 instead of this. It's basically a Pixel 1 XL 2 (5.5\" screen). Pretty much the same internals and an SD Card slot but cheaper. Only things the Pixel gets you are software, camera(?), and an AMOLED screen. ", "date": "05 Oct 2017"}, {"text": "If I remember correctly,\n \r\nLOOK LIGHTNING MCQUEEN! Google Pixel 2 is finally on the Top 10 Daily Interests. Are you happy?", "date": "05 Oct 2017"}, {"text": "truer words have never been spoken", "date": "05 Oct 2017"}, {"text": "Price: $650 / Â\u0080800 / £630  lol. 800 EUR = 650$ ??????'", "date": "05 Oct 2017"}, {"text": "you were good at the time of  selling nexus serious  and now nexus place is acquired by 1 plus which is doing good giving worth at good price. \r\nyou have still no identity at all , you are making pathetic phones since you came with new identity  named pixel in the premium phone it does not mean you own adroid o.s and selling phones at 45 k or 55 k which has no worth at all for new premium buyers , making fool out of people in the name of google..  google is nothing its search engine , offers all services related to digital market , social media but you are still far away from the phone point of view , so stop creating myth by the name of google phone google phone.. ...bullshit phone with etc ordinary hype by selling at 1 price point 50 k  to make google exceptional in this area ... be aware my friends and  apply your mind before giving them money first for third class item which is really annoyed me a lot since i saw their new launching product.", "date": "05 Oct 2017"}, {"text": "Such a thick phone with 2700 MA battery. Really sucks. Another nokia in makling.\n\n", "date": "05 Oct 2017"}, {"text": "oh man! \r\nbattery is sucked  \r\nits really bad at this time which other flagships uses 3000 battery but this one", "date": "05 Oct 2017"}, {"text": "no LG eletronics", "date": "05 Oct 2017"}, {"text": "Who wants this phone with thick ugly bezels and 2700 mah battery with exorbitant price? Google you are not Apple as far as mobile phones are concerned.", "date": "05 Oct 2017"}, {"text": "card slot: No \r\nare we f... serius? in 1017 and no card slot? 64gb is too low..\n \r\nnext one plz..", "date": "05 Oct 2017"}, {"text": "It would be great if bezels are thinner. Phone is longer than my One m9 And same width . \n", "date": "05 Oct 2017"}, {"text": "It's made by HTC.", "date": "05 Oct 2017"}, {"text": "Ugly ", "date": "05 Oct 2017"}, {"text": "worse screen to body ratio than nokia 8 and sony xz1...... bezels are a thing of the past. get with the program", "date": "05 Oct 2017"}, {"text": "Yaaaaaak what are these disgusting bezels , any uglier smartphone than this out there ???", "date": "05 Oct 2017"}, {"text": "King of Bezel? No SD Card, No Jack, overpriced lol", "date": "05 Oct 2017"}, {"text": "i hope pixel 2 made by LG", "date": "05 Oct 2017"}, {"text": "Nothing special except improved rear camera. \r\nEven the design of 1st generation pixel is much more better than pixel 2.", "date": "05 Oct 2017"}, {"text": "The undisputed winners for best android phones this year are s8,s8+,note 8 and lgv30. This highly anticipated phone proved to be a joke. Go take pictures of where the sun doesn't shine and shove it to your dxo rating. ", "date": "05 Oct 2017"}, {"text": "We have to pay too much for the bezels... \r\nThis was not EXPECTED...", "date": "05 Oct 2017"}, {"text": "Just use USB-C headphones, holy crap. ItÂ\u0092s battery will be good enough so you wonÂ\u0092t have to charge and use headphones at the same time. Losing the headphone jack is not that big of a damn deal", "date": "05 Oct 2017"}, {"text": "At least you have really good speakers where those bezels are. Better than IPhone ", "date": "05 Oct 2017"}, {"text": "Please, someone, hang designer and people responsible for bezels", "date": "05 Oct 2017"}, {"text": "Yet another phone wihout audio jack. I'd rather pass all Google and HTC ideas. Waht next? No microphone? No volume control?", "date": "05 Oct 2017"}, {"text": "Flop ! \r\nFailure ! \r\nJoke !", "date": "05 Oct 2017"}, {"text": "its too pricey in india if any one has to spend 61k then why would not he go with i phone 8 ....even apple has excellent after sale service !! come on google you are not apple ", "date": "05 Oct 2017"}, {"text": "brother you love the software experience. But I am telling you put same software in a more practical device and see the magic. They lost it completely. They had all the ingredients to make the best and still they are not doing so well. Just have a look at the design of moto x 2nd gen which was also made under google. A bigger screen in smaller size. Amoled display which saved battery like anything. 2300 mah battery would last almost a day. And was one of the fastest android devices even though it was not having the best processor. Front facing speakers, ring flash which looked good around the camera and most advanced voice commands which worked like breeze. Wont you like it if your phone is constantly listening to your voice without losing any battery while the mic receiver is on all the time. It was hell of a phone. I dont know what all the professionals are thinking.?", "date": "05 Oct 2017"}, {"text": "It isn't all about design you gotta look at all other stuff It surely outperforms all other smartphone either it be the camera software and reliability.I simply love it except for it could put in a 3.5mm headphone jack in it.", "date": "05 Oct 2017"}, {"text": "the design is worse than $100 xiaomi phone", "date": "05 Oct 2017"}, {"text": "Smartphone trend started by apple : \r\nUr phone is a Internet device + Music Player + Phone.\n \r\nLater Nokia added camera to the equation.\n \r\nThen Apple removed the Music aspect from Smartphone by removing 3.5mm headphone Jack. Reasons: \r\n1. Camera aspect of smartphone is more emphasized in social media (instagram, twitter, facebook ...) \r\n2. Buy our Ipods.\n \r\nHTC followed it and Google followed it too...\n \r\nThey are fooling us with these quality terms. These ratings can be easily beaten by a $250 Sony Digicam(slimmest one's are produced by Sony). \n \r\nSince music player aspect is removed from smartphone, we have to buy dedicated music players. Might as well we buy Digicams and used our laptops and buy a Nokia 3310.\n \r\nThen these assholes will learn their lessons.\n \r\n3yrs security and support !!! We are already getting 10 yrs support from Windows 10. Digicams doesn't need security and updates, as well as Music Player and Nokia basic phone. Well anyways Nokia basic phones has audio jacks.\n \r\nLet's boycott this all in one smartphones and teach them a lesson.", "date": "05 Oct 2017"}, {"text": "This phone is more disappointing than it should actually be. It definitely won't be as popular as it's predecessor.", "date": "05 Oct 2017"}, {"text": "If it doesn't have a headphone jack, I don't want it. ", "date": "05 Oct 2017"}, {"text": "Google first ruined motorola by selling it to lenovo, now it is ruining itself by permanent collaboration with HTC. If anyone has used moto x will understand completely what it was and how it all ended. Even if today someone checks on youtube, most famous of reviewers had moto x as their personal device for a time longer than usual. That phone is one of the most practical phones to use even today when it has no updates. If it was hyped properly it would have become biggest success for google and motorola both. But, i believe its all about satisfaction of those white collared people who sit in top management and think they know better. Jim Wicks, (designer of moto razr v3i) had something in mind when he suggested moto x. People are hardly aware what that phone was like. But if i tell properly it easily puts most of the phones to shame even after 4 years of its launch. Being a product designer myself i can clearly tell where they lost it while they could have conquered the world with that design and proper strategy.\n\n", "date": "05 Oct 2017"}, {"text": "sony xperia pixel", "date": "05 Oct 2017"}, {"text": "No headphone jack hahaha. Samsung forever.", "date": "05 Oct 2017"}, {"text": "Asus Zenfone 3... But it's no high end and might not be available in all countries", "date": "05 Oct 2017"}, {"text": "Guess what Google has remove the essential 3.5mm headphone jack from the phone. Looks like Google is an apple fanboy after all.", "date": "05 Oct 2017"}, {"text": "Obviously Google should start thinking seriously about their phone's design Especially when they're selling high end ones. Nowadays smartphone is more image device rather than just an all-in-one phone-mini-computer. And yes, Galaxy S8 is a great example. Currently it is the best phone I've ever hold in my hands. It looks fantastic, feels expensive and runs fast. Definitely worth money spent on it. Not sure that I will say the same about Pixel 2. And this is not good.  ", "date": "05 Oct 2017"}, {"text": "My Sony Xperia Z5 is 146mm and it has a 5,2 screen. This pixel 2 is 145,7mm (which is 146, a hair difference) and it's 5 inches.  \r\nSo yeah, obviously Google wants people to go for the xl. Maybe that's the reason it has such an ugly design.", "date": "05 Oct 2017"}, {"text": "Seriously are Google having a laugh with this one, Galaxy S8 is a much better phone at a cheaper asking price, No dual camera, Wireless charging, Still 1080p, Bezels are huge, design Look's stupid. By the Look's of thing's there's nothing Google can do for HTC by signing that contract. ", "date": "05 Oct 2017"}, {"text": "Weh!", "date": "05 Oct 2017"}, {"text": "67.9% screen to body ratio?!?! You gotta be kidding me, they're going backwards by making it even worse than last year's already huge bezels &#128514; &#128514; &#128514;", "date": "05 Oct 2017"}, {"text": "You people act like HTC designed the phone... \r\nHTC made the phone, but GOOGLE designed it...\n \r\nI like it except it doesn't have a headphone jack... \r\nI've been holding out on a Google phone for too long, been using my Nexus One lately, since my HTC One (m7) won't hold a charge any more.\n \r\n*NOTE: It has OIS and EIS... What other phone has this??\n\n", "date": "05 Oct 2017"}, {"text": "What a disappointment. The amoled looks much bluish than the previous one. I liked the previous pixels amoled since it is not as bluish as samsungs but not it seems to be the same plus the phone is bulkier than the previous pixel.", "date": "05 Oct 2017"}, {"text": "Hm, once again nice design is not the feature of this phone. But I can live with it (I wish it would similar to S8 look).  I'm more concerned about hardware reliability and assembly quality. First Pixel has suffered with childish, not forgivable for highly priced phone issues like GPS and microphone / speakers failure. Also I had an opportunity to completely disassemble the first Pixel and wasn't impressed at all. It doesn't look like US$800 phone inside. Hope this time it will be better.", "date": "05 Oct 2017"}, {"text": "So disappointed, what only real differences.. stereo speakers and a gimmicky squeezable edge?  pass..  \r\nBack to apple I go ", "date": "05 Oct 2017"}, {"text": "Why no sd card slot? :", "date": "05 Oct 2017"}, {"text": "Very disappointed design, a big no", "date": "05 Oct 2017"}, {"text": "big body with small screen, large bezel, and great price. ", "date": "04 Oct 2017"}, {"text": "Awsome software, right screen size, front facing speakers, top noch camera, design is meh but premium, and the headphone jack...", "date": "04 Oct 2017"}, {"text": "skip this. save up and get the xl instead. or repent", "date": "04 Oct 2017"}, {"text": "google pixel 2 is a great smartphone with useful features. \r\nWho wants to talk about headphone jack ! should talk first about boring  i Phone !", "date": "04 Oct 2017"}, {"text": "Awsome software, right screen size, front facing speakers, ", "date": "04 Oct 2017"}, {"text": "Honestly, small bezels are overrated. I'll take stereo speakers with a thicker bezel than a bezeless device with a bottom firing speaker. I still like the design of the phone. A phone doesn't need small bezels to be a marvel. We're finding out too small of a bezel on laptop messes with function and palm rejection. So yeah, I'm good with bezels. ", "date": "04 Oct 2017"}, {"text": "first of all, dont go for HTC when designing a phone. HTC design is focusing on on how get larger bezels in a phone which you certainly dont want.  \r\nsecond, no headphone jack is a big no no. dont be d**k like apple plz. \r\nthird, I do have to say good job on front facing speaker, nicely done! \r\nand finally, why only 2700mAh? is putting more battery into a phone gonna be the end of the world?", "date": "04 Oct 2017"}, {"text": "Worse screen to body ration than the Pixel? How? HTC seem to be stuck in 2012 where if they want to add something below the screen they need to add room because of the large display connector. It's like the galaxy s3 vs s4, Samsung fixed it in 2013. Speaking of, the latter had the same sized display in a body almost 10mm shorter, and with a similar sized (removable!) battery 4 years ago!", "date": "04 Oct 2017"}, {"text": "Even Sony phones have less bezel size.", "date": "04 Oct 2017"}, {"text": "ultimate meme phone? \r\nback look like those shitty nokia lumia/ iphone 5c and and front bezels are like iphone which are the ugliest bezels. And speakers look like those motorola moto phones ", "date": "04 Oct 2017"}, {"text": "ugly... no headphone jack... no sd card... google!!!  realy???!!!", "date": "04 Oct 2017"}, {"text": "Wow... people just complaining about bezels  :D  I think it's a great phone!  :)", "date": "04 Oct 2017"}, {"text": "Front facing speakers are awesome.  Wish this size had an edge to edge display, though.", "date": "04 Oct 2017"}, {"text": "I like the Pixel 2 quite a bit, it's far less boring that the original Pixel and a better phone overall... But I still think it's beaten by the likes of the Samsung Galaxy S8, LG V30... Nice try though.. ", "date": "04 Oct 2017"}, {"text": "What about the HeadPhones??", "date": "04 Oct 2017"}, {"text": "Beautiful bezels.", "date": "04 Oct 2017"}, {"text": "ugly ... ugly  look", "date": "04 Oct 2017"}, {"text": "disappointing looks ugly", "date": "04 Oct 2017"}, {"text": "Ugliest phones ever build by someone.", "date": "04 Oct 2017"}, {"text": "Big, ugly phone with small non-removable battery, I'd rather buy a 5\" Xiaomi for $120 and install Custom ROM from XDA.", "date": "04 Oct 2017"}, {"text": "Looks like a cheap chineese phone from 2012. And you ask 700 Euro. I don't think it is going to happen", "date": "04 Oct 2017"}, {"text": "And Google don't have advance SoC like Apple", "date": "04 Oct 2017"}, {"text": "about 700 euros for a bang average phone", "date": "04 Oct 2017"}, {"text": "Google u r not Apple.  \r\nU r losing out few advantages you have like Headphone Jack , expandable storage etc... \n \r\nApple has ipods to sale... so it can neglect audio quality. \r\nApple has to be ip67 and a big taptic engine to support it's home button, which it has to make virtual because of again IP67... \r\nWhy did u drop 3.5mm jack ? \r\nEve if u support ip67, ur cousin brother Sammy is giving audio Jack. So ?\n \r\nWe are charged 700$ n HTC made ur pixel and headphone audio quality sucked... why ?\n \r\nIf we have to pay 700$ and get less features then we will buy Apple...", "date": "04 Oct 2017"}, {"text": "While other manufacturers advertise screen to body ratio, in 2017 Google is advertising bezel to body ratio.", "date": "04 Oct 2017"}, {"text": "If all of those specs described are the final specs, then it only has slightly bump at CPU and internal storage from previous Pixel. No other enhancement and improvement for camera terms, display, and all the rest specs. 1 year research from many genius people can only bring this to the market?", "date": "04 Oct 2017"}, {"text": "Google and his pixels R blind Apple's followers! 700 euro and no headphone jack no SD card slot  \r\nTo Google! Why I should buy your pixels!? With this situation iPhone 8/8+/X is not good choice to pixels!? In my opinion: yes it was too", "date": "04 Oct 2017"}, {"text": "700Â\u0080 for this phone?  Can not belive. Nobody w", "date": "03 Oct 2017"}, {"text": "Can safely say it's the ugliest phone of 2017", "date": "03 Oct 2017"}, {"text": "Pixel 2 ise ugly as hell.. too bad.. i hoped for a new NORMAL SIZE phone for myself.. with a good camera.. lets hope for the best.. but i think i will be dissapointed..", "date": "03 Oct 2017"}, {"text": "What is the point of Google pixel 2 its absolutely the same", "date": "03 Oct 2017"}, {"text": "it's already confirmed the pixel won't come with a headphone jack and a single camera setup. Let's see if the camera lives up to its expectations like the previous pixel. \r\nI'm not dissing the pixel, it's the continuation of the nexus line. And i always loved the NExus line. I just find the pixel to be an expensive piece of hardware like apple just because Google garantuees continuous updates for 2 years and security updates for 3 years.", "date": "03 Oct 2017"}, {"text": "I'll wait for tomorrow's announcement, but if it is what we are seeing here, i won't be buying anything from google.", "date": "03 Oct 2017"}, {"text": "Phone specs are not bad but design needs to get improved.  \r\nUgly phone. ", "date": "03 Oct 2017"}, {"text": "You thought the HTC One M9 was bad? Well, you haven't seen the HTC One A9. Double the price of the OnePlus X and worse than the OnePlus X.", "date": "03 Oct 2017"}, {"text": "Hey easy don't be so quick to judge I bet it gonna blow you guys up I know it apple already sh***ed their pants with their iPhone X since the money matters not to me I was considering X as my next handset but that was a clear message we don't value our customers only profit matters to us so now I am considering getting a pixel 2  I only hope it'll have a 3.5 port as far as I know there is no advantage to USB C or Lightening but I might have to carry around my dedicated music player", "date": "03 Oct 2017"}, {"text": "HTC is manufacturing the smaller model and LG is making the bigger one.", "date": "02 Oct 2017"}, {"text": "Is HTC making the Pixel 2? If so, I won't buy it. HTC One M9 is a POS. Currently looking at ASUS.", "date": "29 Sep 2017"}, {"text": "hope for the best", "date": "29 Sep 2017"}, {"text": "Thought the pixel launched already... wait, no redesign? \r\nStill that boring look with that fragil glass in the back. No Qi charge, no headphone jack. I bet it will get the IP54 certificate, not even IP68... \r\nNo OIS, still the same 5 inch display. Guess the battery will get a 30mah bumb to at least total of 2800mah. \r\nThe only thing this phone is good at is with updates, everything else just fails. \r\nToo expensive with too few features \r\nThe oneplus 5 is a much better bargain", "date": "29 Sep 2017"}, {"text": "This is just a rumor dude, the official specs aren't published yet.", "date": "28 Sep 2017"}, {"text": "No earpiece jack, no storage SD = No go! Junk", "date": "26 Sep 2017"}, {"text": "Why wouldn't they have had the impetus to drastically change their ways?", "date": "21 Sep 2017"}, {"text": "of course :D ", "date": "18 Sep 2017"}, {"text": "No sd card slot, premium pricing for a sub-par hardware phone...google is smoking the wrong stick.\n \r\ni rather get the note 8 or s8 plus...at least these phones don't make me pay over and over again for things i already owned.\n \r\ngoogle need to get it clear, give the consumer what they want!!! if people want to be fleeced, they go buy an iphone. if google wants their phone to compete, LISTEN!!\n \r\nandroid users are not idiots who go buy iphones, they buy android coz they can do whatever the hell they want with their phones.", "date": "17 Sep 2017"}, {"text": "Yes", "date": "16 Sep 2017"}, {"text": "its a rubbish phone", "date": "13 Sep 2017"}, {"text": "Yes, usb c -> 3.5 mm expected to ship in the box", "date": "12 Sep 2017"}, {"text": "Hello \r\nI want to know your opinion... \r\nIs it possible to listen music with google pixel 2 \r\nwith adapter USB Type C to 3. 5mm\n \r\nThank you \r\n:)", "date": "07 Sep 2017"}, {"text": "Release 05/10", "date": "25 Aug 2017"}, {"text": "Cheap... 850$", "date": "25 Aug 2017"}, {"text": "Bezel is outdated. Agree. Maybe they just need to trim it down a little. No need to go 'Mi Mix' style all of a sudden. Just do it like G6 style is good enough. Emphasize more on software. Need to improve pixel launcher to be more simple. Direct rival of iphone. ", "date": "22 Aug 2017"}, {"text": "It would be so bad if this phone ends up with normal bezels like the first Google Pixel. The bezel-less design like in the Iphone 8 looks soo-soo good. It would be a shame if this one didn't have something similar.", "date": "17 Aug 2017"}, {"text": "What has gone wrong with google? screw up after screw up... gone are the golden days of nexus 4 and 5. Flagship at midrange. They improved camera over last 2 iterations of google phones but then shot the price up by twice. Barring camera there wasn't much premium about last year's phone, now they have decided to remove 3.5mm jack?? seriously? what's the motive? i bet pixel 2 isn't going to be any slimmer than iphone 7 which wasn't slimmer than iphone 6 which had a 3.5mm jack and yet the slimmest iphone till date(6.9 mm vs 7.1mm for 6s and 7). The corporate greed for sale of additional adapters and wireless headsets wins over consumer needs.", "date": "16 Aug 2017"}, {"text": "It has android Oreo\n", "date": "12 Aug 2017"}, {"text": "If LG makes it then it might be cheaper", "date": "10 Aug 2017"}, {"text": "No 3.5mm jack, huge bezels...  hhhmmm no thanks, obviously google leadership as tone deaf to their customers as they are to their employees!", "date": "08 Aug 2017"}, {"text": "Will it have biscuit?", "date": "03 Aug 2017"}, {"text": "It most likely pack android 8.1, google always introduces a new version of android with its phones, and has them run it for the first time. We've seen it on the nexus devices and last year with the pixels. Android 8 is already out there and will be released officially way before the pixels launch", "date": "25 Jul 2017"}, {"text": "I want to know if the regular Pixel 2 will have hi res audio. FYI: new rumors suggest at least one the new models will have a Snapdragon 836 chipset.", "date": "24 Jul 2017"}, {"text": "Band 71?", "date": "17 Jul 2017"}, {"text": " I totally agree with there my friend. By the way... you come across as a respectful, calm person  for the record. :-) .", "date": "17 Jul 2017"}, {"text": "Hopefully it will include a microSD slot this time.", "date": "16 Jul 2017"}, {"text": "The pixel 2 xl will have qhd", "date": "15 Jul 2017"}, {"text": "I'd rather it be qhd.", "date": "14 Jul 2017"}, {"text": " It's interesting that you say that you hope that the phone is 5 inches, because I literally was just about to say the same thing. Seems like these days people are into to 4.7 inch or sub 5 inch displays, or 5.3 - 6.3 inch models. I've owned several 5 inch handsets, and think that 5 inches is dead on.", "date": "14 Jul 2017"}, {"text": "I hope this is 5 inches, full frontal screen without borders or very small ones. The size of the old Sony's Z Compact line but nearly all screen.", "date": "13 Jul 2017"}, {"text": " You made me laugh, and as I've said before, I like laughing. ", "date": "01 Jul 2017"}, {"text": "There is no way that it's a 1080P Screen!!!!", "date": "29 Jun 2017"}, {"text": "I don't think the picture of the phone is the one that is coming.", "date": "29 Jun 2017"}, {"text": "I hope LG won't make that same stupid rear design of metal & glass for the larger Pixel phone. This design switched me off together with the gigantic bezels of the current Pixel XL!", "date": "28 Jun 2017"}, {"text": "5.0\" and NO headphone jack ? lolol i better get S8+", "date": "28 Jun 2017"}, {"text": "that bezels are so horrible that I'm almost about to scared on it. lol", "date": "28 Jun 2017"}, {"text": "3.5mm jack\tNo \r\nStupid!!!!! Go to hell!", "date": "27 Jun 2017"}, {"text": "lol no headphone jack...do they not want people to buy the phone??", "date": "27 Jun 2017"}, {"text": "2011 design. ", "date": "27 Jun 2017"}, {"text": "so is KitKat.. Why not they are making some cooperationm.", "date": "27 Jun 2017"}, {"text": "hope to see innovation, not like basic specification upgrade like OnePlus 5. \n", "date": "27 Jun 2017"}, {"text": "I hope this one has a  reasonable price :)", "date": "27 Jun 2017"}, {"text": "Oreo is a brand not a dessert :p", "date": "27 Jun 2017"}, {"text": "And what's the point of being a 5.0 when it's the size of 5.5?", "date": "27 Jun 2017"}, {"text": "Love if it was 5 inch, just getting boring with 5.5 inch phones released nowadays, hope they put decent battery capacity. Also, Oatmeal-Cookie Android sounds weird lol why not Oreo", "date": "26 Jun 2017"}, {"text": "guys thats the rumored spec and look not the final version, geeez!", "date": "26 Jun 2017"}, {"text": "The renders of this phone by uSwitch and Benjamin Geskin look awesome. Finally got rid of those bezels! ", "date": "26 Jun 2017"}, {"text": "Same ram (slow), same bezels (ugly). It's as if Google wants this phone to fail. Too bad that the phone with the best software in the world is also nothing special... Almost positively problematic from the get go", "date": "26 Jun 2017"}, {"text": "WOW, on-screen buttons to waste space and yet HUGE bezels which could easily be smaller with physical buttons.\n \r\nI'd take it ...If they paid me to. Wait...i'm not sure i would even if they did.", "date": "26 Jun 2017"}, {"text": "This thing needs reduced bezels more than anything else", "date": "26 Jun 2017"}, {"text": "no change in camera. it's should be changed. they can progress the camera in megapixel,aperture, image stability ois. ", "date": "26 Jun 2017"}, {"text": "High price for nothing...google...", "date": "26 Jun 2017"}]