[{"text": "9months with the motion im very satisfied no problems wath so ever. Ty bb", "date": "10 Apr 2018"}, {"text": "BB with sd 821 or sd 835 is not there yet. It's too late BB !!!! Waiting for a better option....", "date": "06 Apr 2018"}, {"text": "The  BB  motion  phone  is  one  of  the  highest  phone  in  blackberry  I  should  know   because  I'm  an  product  consultant  manager   so  I  know  blackberry  phones  well   you  should   becarfull  with  facts  you  say  you  could  get  sued ", "date": "06 Apr 2018"}, {"text": "BB Motion is ok for mid rangers but I still wonder why they can't bring high end phones !!!!", "date": "05 Apr 2018"}, {"text": "Obviously my friend. Those who never ever had this device they can speak stupidity like this. I am a die hearted fan of this device and i will continue it.", "date": "03 Apr 2018"}, {"text": "bbos is amazing compared to any other os.I love it so much,and I'm waiting for new bbos", "date": "31 Mar 2018"}, {"text": "Hello . \r\nLater this year 2 new keyboard devices !", "date": "23 Mar 2018"}, {"text": "I'm waiting for next generation of black berry. when will is I can see?\n", "date": "23 Mar 2018"}, {"text": "I chose the BB Motion strictly for the security and the suite of BB apps, the phenomenal battery life help my choice as well. I've got a Samsung Note 5, but I didn't enjoy the android experience at all, so I moved back to BB10 in a Passport ( excellent device ). Unfortunately, I've come to the conclusion that it is time to move on as the support and apps for BB10 seems to diminish on a daily basis, or so it seems. When I got the chance I went to have a first hand look at, and played around with the BB Motion. Even though I find the BB motion to be a little on the large side of things ( I think a Z30 form factor would be the perfect size ), I found it very easy to use and I really appreciated having the familiar apps on board. Some may think it's over priced, but I value the security and reliability of a Blackberry device.", "date": "19 Mar 2018"}, {"text": "There is no FM Radio in the europe version integated.", "date": "19 Mar 2018"}, {"text": "Yes Xiaomi much Cheaper but you forget about Security System\n \r\nBlackberry has been known the best Security in the world", "date": "17 Mar 2018"}, {"text": "You forgot to say it's waterproof. No other BlackBerry has that. ", "date": "17 Mar 2018"}, {"text": "This phone looks worthwhile, but Xiaomi has the same spec sheet for half the price (Mi A1).I haven't seen the review yet but the price might fool me into thinking it's too expensive. Then again, spec sheets can blind you.", "date": "11 Mar 2018"}, {"text": "what?", "date": "09 Mar 2018"}, {"text": "Is so why are you writing on Blackberry motion, go and buy your iphone.", "date": "08 Mar 2018"}, {"text": "Are U kiddinÂ\u0092?", "date": "07 Mar 2018"}, {"text": "Hi blackberry, what are you thinking about? Blackberry Motion with low spec for hi-end user? Haha.. Even Xiaomi Redmi Note 5 Pro with better spec only for about 200 EUR. So, whose gonna buy BB Motion with low spec for that hi-price, about 430 EUR? LOL", "date": "04 Mar 2018"}, {"text": "aproximattely like samsung s9, \r\nbut it is 2 times cheaper than s9", "date": "27 Feb 2018"}, {"text": "I have been Moto user since started android. My last BB device was Q20. I have used almost all model which were with BB Physical keypad. \r\nNo I switched to BB Motion. Few things are bad but over all a best. Firstly I will share bad\n \r\nFront Cam \r\nMissing Stereo Speakers \r\nLack of Accessories \r\nOld chipset \r\nFast Charge\n\n \r\nBest I found is Battery, remarkable even \r\nSound Quality on call \r\nDiamond Quoted Glass \r\nContinued Notification Light \r\nBB Same Keyboard \r\nBlackBerry Theme \r\nCool Display \r\nNo Heating issues \r\nNo Crashes of apps \r\nHandy device, not too heavy or filthy \r\nGood Rare Cam and its Video Recording. \r\nDedicated Key \r\nThe most unique feature is \"Privacy Shade\"\n \r\n Its not the best but I can say a good option. Price should be a bit lower. \r\nI can say honestly that I am happy with this.\n", "date": "27 Feb 2018"}, {"text": "Looking at Blackberry's recent offerings just invokes even more nostalgia, back when the Bold was considered to be one beast of a smartphone... And BBOS will never be forgotten, so many good memories :)", "date": "27 Feb 2018"}, {"text": "It's not the greatest, but it's not the worst.", "date": "23 Feb 2018"}, {"text": "Thanks ", "date": "21 Feb 2018"}, {"text": "I  own dtek60. MY biggest complaint about it is the voice quality. I was considering to change to Motion  but this is the wrong news. The first function is to use as a  handset, anyway.", "date": "17 Feb 2018"}, {"text": "its not BlackBerry, its a TCL device. blackberry have to develop its own BBOS for Upcoming new devices. we all love BBOS,", "date": "17 Feb 2018"}, {"text": "Black Berry was known for Safety and Privacy on highest scale in business world. Why they trying so hard to be made in the same store? ", "date": "16 Feb 2018"}, {"text": "You are absolutely right ", "date": "14 Feb 2018"}, {"text": "I bought the mobile three weeks ago after using z10 for years.  \r\nThis mobile is not a blackberry. It is a TCL. \r\nBattery barely stay for 1 day and a half though I m charging from laptop USB. Fast charge stays for more than one hour. \r\nThe camera and the camera software are very bad compared to the z10.  \r\nThe phone dialler is very small and not handy so I decided to use third party. \n \r\nEnd of the day, but any android device and download the bb keyboard.  \r\nDon't imagine that your life would be better using this device.  \r\nOS10 is the best and BlackBerry Co. Should have invested in enhancing the development kind instead of moving to android  world. They lost all.  \r\nOS 10 users don't buy any bb android based device.\n", "date": "11 Feb 2018"}, {"text": "Only if you take a lot of videos.  It does nothing for photos.", "date": "08 Feb 2018"}, {"text": "Hi, \r\nKnowing that the camera doesn't have the OIS (image stabilizer). Is this option really important regarding the choice of a cellular phone? \r\nThanks,", "date": "01 Feb 2018"}, {"text": "Black Berry Motion has dual sim card feature", "date": "30 Jan 2018"}, {"text": "Hello Sir, \r\nI am also BB fan, kindly share your Blackberry Motion experience.  \r\nI am planing to purchase one.\n \r\nThanks n Regards \r\nShad\n", "date": "30 Jan 2018"}, {"text": "yes Whats App is working like all other apps on android phones", "date": "30 Jan 2018"}, {"text": "I have been using Blackberry since 10 years, for the past two it was the Priv, which I absolutely loved. I just got the Motion, as the updates for Priv are no longer available. IIt is a very strange device: a big phone with small text! Very Chinese (cheap) looking and feeling and very unpleasant to use . If you have been using Priv, never go for the Motion, it is several steps back from the Priv and the most recent models of Blackberry. Perhaps the Keyone would be a better option.", "date": "28 Jan 2018"}, {"text": "I love BLACKBERRY mobiles with bb10 os not android lol phone", "date": "28 Jan 2018"}, {"text": "any body can't my voice call recording have option this set??please tell me have this option BlackBerry Mobile Model Number ", "date": "27 Jan 2018"}, {"text": "Hello  \r\nGo for the BB motion,because it's better than the DTEK line.Great battery life(last at least 2 days),good build quality.", "date": "27 Jan 2018"}, {"text": "I had the DTEK60 and it was amazing. Go with that over the 50.", "date": "27 Jan 2018"}, {"text": "Pls can anyone here help me with a useful info about a dtek50. Its battery life in particular and any other info. Was thinking of buying it", "date": "26 Jan 2018"}, {"text": "exelent phone, Im a blackberry FAN, there is nothing better than this, flawless batery life , great speed, of course can not be compare with Iphone, BUT...... still a blacberry .....love it ", "date": "23 Jan 2018"}, {"text": "Hey guys, i am a blackberry fan I've been using bb from bold to classic but now am using sony XZ, its a good device with 64 gb and 23 camera but i never felt like its a 23 camera, also the volume of this device is so bad despite there is two speakers on this sony XZ and any one using this version can understand what am taking about, am confused about having this Motion or not i liked it alot but having some doubts about the sound quality and volume cause it has only one speaker, can any one help me please with this or make it clear for me.... ", "date": "23 Jan 2018"}, {"text": "have radio FM ? someone confirm please.", "date": "21 Jan 2018"}, {"text": "well you know what a fan or not a fan , that only proves that you go with the first thing that you will think is better ,  but ios is totally a crap , and be honest you cannot buy one phone that has ios I really don't think so!!! \r\nso well , yeah bye q0_0p", "date": "20 Jan 2018"}, {"text": "as an old fan of BB, i think BB new phones are not competent anymore..\n", "date": "19 Jan 2018"}, {"text": "On the other hand, major new OS versions are less certain. One device (the Priv) got one major OS upgrade (Lollipop to Marshmallow), but owners were disappointed when it didn't also get upgraded to Nougat. Some devices (such as the DTEK series) have never received and new OS upgrades at all. \n \r\nSo you really need to separate OS upgrades and security patches out into two different questions. They are better than most OEMs at keeping up to date with security. They may be disappointing with OS upgrades.", "date": "19 Jan 2018"}, {"text": "Yes. Since switching over to Android from their previous proprietary OS, they have regularly published monthly security patches, most often less than a week after Google's public disclosure. However, if you bought your device through a carrier, then your carrier might delay the release of security patches somewhat.\n \r\n(Blackberry/TCL has, on a very few occasions, missed a month. On the other hand, sometimes they release fixes for some security flaws even faster than Google. For example, the Android-powered Blackberry devices were they very first Android devices in the world to receive a vendor-supported fix for KRACK.)", "date": "19 Jan 2018"}, {"text": "What about the Whatsapp, working or NOT", "date": "18 Jan 2018"}, {"text": "I would love to have a BB but where iam in Zambia ,nothing now comes ,,,,,,especially this one ", "date": "18 Jan 2018"}, {"text": "Yes, the BBD100-6 version of the Motion has dual SIM", "date": "17 Jan 2018"}, {"text": "Any users pls confirm is it dual sim?", "date": "15 Jan 2018"}, {"text": "I've been a BB loyalist for years. But BB on Android is a no-no for me. I better port to iOS.", "date": "13 Jan 2018"}, {"text": "It's not likely.", "date": "10 Jan 2018"}, {"text": "for sure, im bb loyal user and customer, however i dont want android at all. come up with passport flagship with original bb os that runs android as slave ", "date": "09 Jan 2018"}, {"text": "Happy New year BlackBerry. I wish to see a new BlackBerry flagship this year a new passport mabe whit BB11 os , and fingerprint and a dualcamera .  \r\nBlackBerry remain my best phone , but never with android.", "date": "07 Jan 2018"}, {"text": "Very good comparation . I hope to see this someone front BB.", "date": "07 Jan 2018"}, {"text": "BB Motion forsure ", "date": "06 Jan 2018"}, {"text": "Yes. Spot on. I have been a BB user since 2001 and don't see that changing anytime soon. Not interested in stupid candy crush or any other games. This is a secure work tool. ", "date": "06 Jan 2018"}, {"text": "If you compare the sales figures of say Ford motor company and Ferrari you will see Ford global sales are almost 100% more than Ferrari, so does this mean Ferrari make a bad car?  ", "date": "06 Jan 2018"}, {"text": "Android and secure don't go hand in hand", "date": "06 Jan 2018"}, {"text": "Wonderful comments... For a while, I thought I was the last bb die hard fan who existed.....now  I know I am not alone..#bbrocks ", "date": "05 Jan 2018"}, {"text": "Still waiting for Gsmarena review, I will buy it depending on the battery endurance test", "date": "05 Jan 2018"}, {"text": "Does blackberry devices gets regular android security patch update and OS update? ", "date": "05 Jan 2018"}, {"text": "blackberry motion vs htc u11 life?", "date": "27 Dec 2017"}, {"text": "BlackBerry Motion very good if...\n \r\nGorilla Glass 4 \r\nSnapdragon 630 \r\nDisplay 18:9 ratio \r\nAndroid 8.1 \r\nUSB On-The-Go", "date": "26 Dec 2017"}, {"text": "Great phone.cant wait to get one ....", "date": "25 Dec 2017"}, {"text": "Thats great with battery performance as u told its nice ", "date": "25 Dec 2017"}, {"text": "Ohh my.. That big bezel, you can even add another fingerprint scanner.", "date": "24 Dec 2017"}, {"text": "No radio but strong battery. Last for complete 24 hrs.", "date": "22 Dec 2017"}, {"text": "Specific type of customers that doesn't know how to use their keyboard to type correct english and i don't need to go to bb shop to explain me anything because i bought one of their \"fancy schmancy\" phones. \r\nAs for the rest of your speech no comment really.", "date": "22 Dec 2017"}, {"text": "And what does that have to do with anything? Ask anyone at BB Mobile and they'll openly tell you this is a niche device designed for a specific type of customer so I'm really struggling as to why you think it's cool to deride that and why you think you're hot stuff for coming up with pointless statistics. Thank you for what, exactly?", "date": "21 Dec 2017"}, {"text": "All people that still defend Blackberry phones if you are not \"Electronic Committee\" work for this company please read the news to know that Their sales do not exceed 2% \r\nThank You", "date": "21 Dec 2017"}, {"text": "Biggest bezels in a phone released in 2017, ever.", "date": "20 Dec 2017"}, {"text": "I also had this issue...but got my device replaced and now no more issues at all", "date": "17 Dec 2017"}, {"text": "I had there cellphone called (9300 curve ) the most disgusting cellphone i hold with its price back then i could buy (nokia x6) with the wide difference in specifications   bad quality and surrounded with bad rubber material \r\nThe most failing company in the history of the planet i don't understand how this company still in the business any way", "date": "16 Dec 2017"}, {"text": "See many of you that comment here arent or havent used a blackberry in ur life.. U cant compare a bb to an iphone or a chinese phone.. Comparing it to a iphone itself is downgrading the bb. Those who wanna say its expensive compared to a certain please use a iphone and a blackberry and the certain cheap priced phone for a week and then decide. Those who have used the bb 7 and bb 10 os wont b impressed with the iphone x os or even an android O os as all these os are inspired from a blackberry os 10.  Im proud to say that im a bb fan an have been using blackberry since the bb bold generation and for the past 8 years and still goin on.. Love this new era phones from bb keyone and motion certainly gives Ray of hopes for us fans.", "date": "16 Dec 2017"}, {"text": "BlackBerry Motion Pictures...\n \r\n:D", "date": "15 Dec 2017"}, {"text": "More RAM less speed is mainland marketing, even the scale of china is big but still to achieve xiaomi etc price they downgrade some part quality, but put big RAM so looks like good value but not for long run", "date": "15 Dec 2017"}, {"text": "why do u need more ROM? uv been given an option of an SD crd slot,aint tht enough? some complains  are none sensical....\n\n \r\ntht device handles games well,runs smooth ..etc..4GB  ram is enough infact ul realise u seldom use qll the ram in ur daily activities...", "date": "14 Dec 2017"}, {"text": "Pls Go to any BB shop only for touch not to buy. Hold any Blackberry Phone in your hand, watch your own eyes and go back home. Think what is Blackberry.   ", "date": "13 Dec 2017"}, {"text": "So true. You spoke directly from my heart! :)", "date": "13 Dec 2017"}, {"text": "U forgot to mention that their \"phone\" also needs to cook a great dinner and drive them to their work....", "date": "12 Dec 2017"}, {"text": "It seems people want a camera with sim card. Its not that. BB is a class phone for class ppl. Very hurt to see ppl comparing it with xiaomi....they need 8gb ram 128gb rom 24+24mp dual back camera with 12+12 front camera and ya it must have options to control satellite staying at home using india jio network...Price must not exceed 5000 rupee (100 USD) oh ya battery?? Battery of a car is ok.", "date": "07 Dec 2017"}, {"text": "Fantastic phone with the added security that BlackBerry is known for. I go to try one recently and was pleasantly surprised with how nice the phone is. I am still on the Priv, but if I decide to upgrade this year, it will definitely be the Motion.", "date": "07 Dec 2017"}, {"text": "Please just buy a Xiaomi Mi A1. \r\nLook at the specs and price and you will see why. \r\nSame specs but Xiaomi is like 250 euro which is 200 euro cheaper + better software maintenance. Upgrade to Android O/8 coming in couple of weeks.\n \r\nBlackberry is just wanting to get some money with high margins don't buy this ever!", "date": "07 Dec 2017"}, {"text": "Well said... I agree with you !", "date": "07 Dec 2017"}, {"text": "I bought this device (the dual sim version). Evrithing is fine exept people are teling me that they do not hear me very well....", "date": "06 Dec 2017"}, {"text": "please i am in china,i really like this phone but i do not know where to buy it", "date": "06 Dec 2017"}, {"text": "99% of these comments don't make any sense, sounds like children just wanna complain. People are forgetting that some of the apple apps, were found to be sending all your personal info back to china, noting much was posted in the press, and here's a little side note for the kids. Apple was secretly trying to buy BB OS system. If you really look at all the phone commercials all they sell is very expensive camera and apps. when it comes down to it, a reliable phone consists of a strong signal tough body, with privacy. I had every type of phone from apple to Samsung over priced, the best phone by far was and still is BB, and that it was being built in North America, I'm not a big fan of BB contracting their phones too China, had a feeling that was going to happen when they hired the new CEO! But I'm still a BB fan will always buy a BB because of the what the phone offers me. So if u want a expensive camera go buy another model. ", "date": "05 Dec 2017"}, {"text": "I am proud of been a Blackberry Motion owner.4 Blackberry phones till now I used. Happy customer. Excellent workout.", "date": "04 Dec 2017"}, {"text": "It did with many iPhone 5,6,7,8 huge double chin", "date": "30 Nov 2017"}, {"text": "Keyone and Motion attract some the of the old users of blackberry to think again about blackberry. But I think they need to do more about slimness of body, design, full screen display or combination with keypad (Like Keyone),increase RAM&ROM and top of that battery MAH should be 5000plus.  I am waiting for these specifications to buy blackberry at any price. ", "date": "28 Nov 2017"}, {"text": "well  very   product\n", "date": "28 Nov 2017"}, {"text": "I am 2 weeks now with this phone. It's an excellent phone with a lot of native Blackberry features. I love it. It's fast, very comfortable and washable! :) It looks solid and serious. It works fine.", "date": "27 Nov 2017"}, {"text": "625 snapdragon? really? worthless.", "date": "25 Nov 2017"}, {"text": "exactly like Z10 + waterproof and removable battery", "date": "24 Nov 2017"}, {"text": "I & all others may prefer a new BB phone like this: \r\nDesign : Z10 design almost. \r\nDisplay : 4.5 inch Oled or Super AMOLED display with true tone \r\nOS : BB 10.3 or BB 11.0 \r\nApps : Support Android apps also \r\nStorage : 32 / 64 (internal) \r\nRam : 4/6 \r\nChipset : high speed Snapdragon chipset latest  \r\nNetworks : 2G, 3G, 4G and 5G  \r\nCamera : Hasselblad or Leica 12 MP camera \r\nSound : Dolby Atoms \r\nheadphone jack : top side \r\nPower Button : top center \r\nSensor : Fingerprint (side mounted), accelerometer, gyro, proximity, compass, barometer etc \r\nNFC : yes \r\nBattery : 3000 mAh or more\n\n \r\nHope it becomes true...........................................\n\n\n\n", "date": "24 Nov 2017"}, {"text": "oh my god!!! i cannot stand those bezels!!! they are off-putting!!!", "date": "23 Nov 2017"}, {"text": "Blackberry you have just created a phone of awkward size. If you want your sales back you need to go after the big boys with something extra special. The Motion is not the model to compete and it will only get a few die hards to purchase. There are so many mid range phones out there that people will buy ahead of this. Go for the gold!!!!", "date": "22 Nov 2017"}, {"text": "Hi guys. I dont know if you ever had Blackberry phone. Good old but let down os10 was the best experience that you may have. All flamboyant ioses and androids were nowhere near. If bb kept same stability, same logical menus, hub, keyboard and other original bb features than you dont need Snapdragon 835, all other high specs because this phone will give to you good reliable service, office extension, communication possibilities. If you are up to gaming... Buy device with at least 10\" screen. ", "date": "18 Nov 2017"}, {"text": "another SnapDragon 625?? owhhh mannnn....", "date": "17 Nov 2017"}, {"text": "BlackBerry Motion \r\nUSB On-The-Go ?", "date": "16 Nov 2017"}, {"text": "the back looks nice but the front...not that much \r\nim just wonderng when snapdragon is gonna let a53 go!", "date": "15 Nov 2017"}, {"text": "That big chin.. Ooww emmm,.. It won't fly. ", "date": "11 Nov 2017"}, {"text": "Blackberry logo embedded on home button just ruins the look of the phone design. ", "date": "11 Nov 2017"}, {"text": "Full hd 1080p ....huh .... better if Qhd display", "date": "11 Nov 2017"}, {"text": "As, I have seen at German site,yes,all models have FM radio.", "date": "08 Nov 2017"}, {"text": "Wat about sony then??? Xperia xzs.. one of the fastest phone uses 4gb ram... ", "date": "06 Nov 2017"}, {"text": "Follow-up: BBD100-6 will be dual SIM, most likely hybrid dual (ie, one SIM plus either microSD or secondary SIM but not both).\n \r\nAll others will most likely be single SIM plus microSD only.", "date": "06 Nov 2017"}, {"text": "As posted earlier, BBD100-6 (sold as one of two models available in EMEA regions) will be dual-SIM.\n \r\nSome other models (such as those sold in North America) models will most likely be single-SIM.", "date": "06 Nov 2017"}, {"text": "why u need more RAM??", "date": "05 Nov 2017"}, {"text": "Hello, do the blackberry motion have inbuilt FM radio &#128251;. Please check and confirm. Thanks ", "date": "04 Nov 2017"}, {"text": "I think so ridiculous for blackberry, all brands try to make 6 or 8 RAM but blackberry try to stay in 4GB RAM, I think manager blackberry still stupid ", "date": "04 Nov 2017"}, {"text": "It is dual sims. Sure. But hybrid. ", "date": "03 Nov 2017"}, {"text": "Both, depending on where you buy it and which model you buy.\n \n \r\nThis tells me there will be at least 5 different models: \r\nBBD100-1 will be sold in Europe, the Middle East, Africa, and Asia Pacific. It is explicitly single-SIM.\n \r\nBBD100-2 will be sold in Canada, Latin America, and throughout North America on the open market. Because this is the variant destined for Canada, I am confident that it will be single-SIM, although it doesn't explicitly say so on this page.\n \r\nBBD100-3 will be sold in the USA by Sprint. It will be a CDMA variant, and customers will only need to use a SIM card for accessing LTE Internet. It will most likely also be single-SIM.\n \r\nBBD100-5 will be sold in China. I could only guess about its SIM card configuration.\n \r\nBBD100-6 will be sold in Europe, the Middle East, Africa, and Asia Pacific in a dual-SIM configuration.", "date": "03 Nov 2017"}, {"text": "FM radio  Pleas ", "date": "03 Nov 2017"}, {"text": "This is dual sim or single sim anybody is knows please conform", "date": "03 Nov 2017"}, {"text": "NOOO no single sim pls", "date": "02 Nov 2017"}, {"text": "This device will be sold in Canada via the major carriers. Given the Canadian carriers' business practices, this fact by itself pretty much guarantees that, at the very least, there will be a variant of the device that is single-SIM.\n \r\nWill there also by a dual-SIM variant? Possible, but not certain.", "date": "02 Nov 2017"}, {"text": "Any confirmation it's dual?", "date": "01 Nov 2017"}, {"text": "Check out the internet. A Sd card may be combined with a sim card on one card. The only thing you need is strate hands.", "date": "01 Nov 2017"}, {"text": "I'd buy a priv with dual sim but it does not exist.", "date": "01 Nov 2017"}, {"text": "BB is still a strong company, but they do much of their business with other businesses. That said, the KEYone did have huge popularity in Canada, according to Rogers, the largest (in subscribers) operator in Canada", "date": "31 Oct 2017"}, {"text": "Stop this trend with every new device coming out with the trashcan SD 625 already", "date": "31 Oct 2017"}, {"text": "no qc...sad", "date": "30 Oct 2017"}, {"text": "This phone does not have dedicated memory card slot. It has hybrid card slot. I am disappointed. ", "date": "30 Oct 2017"}, {"text": "so in love with its  size and structure.for some of who ain't fans of bulky stuff,it will be worth a go for it.\n", "date": "30 Oct 2017"}, {"text": "shows you know nothing about sears and even less about BlackBerry ", "date": "29 Oct 2017"}, {"text": "super mobiles  bbm ", "date": "29 Oct 2017"}, {"text": "loffer bbm ", "date": "29 Oct 2017"}, {"text": "BlackBerry Hub! Excellent app and tool!", "date": "27 Oct 2017"}, {"text": "Mid ranger specs, as any Chinese set 64-4 but even worse internals, only prices way up. BB has nothing to do with this set, it's on contract made. Forget even now! ", "date": "26 Oct 2017"}, {"text": "i hope this is not dual sim? yeah?", "date": "25 Oct 2017"}, {"text": "FM radio ?", "date": "25 Oct 2017"}, {"text": "is it Dual Sim ?", "date": "24 Oct 2017"}, {"text": "So would the camera and display on this phone not even be as good as the Priv?", "date": "22 Oct 2017"}, {"text": "Dual sim ??", "date": "21 Oct 2017"}, {"text": "There are a few reviews out there, emphasis on a few, but they're all based on quick hands on experiences at the recent launch and also on pre-production models. Most reviews are based on 10 days+ tests and use on full production models which I would imagine are going on now and we'll probably see the full reviews in the next couple of weeks or so, before the pre-orders are released. If you're looking for reviews ASAP, keep an eye on traditional BlackBerry sites like CrackBerry but most tech type sites will probably have full reviews/hands-on videos a few days after.", "date": "20 Oct 2017"}, {"text": "Details about audio quality  and loudspeaker  is possible?  Thanks! ", "date": "19 Oct 2017"}, {"text": "Blackberry is the Sears Canada of the cellphone industry. ", "date": "18 Oct 2017"}, {"text": "You can't explain it without using privacy, you just can't. Privacy and security signatures are actually hard-baked into the individual components of the BlackBerry hardware. On top of that, the Android OS has been massaged to be a lot more secure to the point that BlackBerry has the only Android based range of devices to secure the top security ratings of the world's top governments and militaries. This all costs money. Add to that all sorts of additional secure and privacy applications through BB UEM and you have a device that cannot be beaten for privacy and security. If none of that is a big deal to you then this is not a device that will ever interest you. This is a device whose primary customers will be Enterprise, Government and military with some consumer interest thrown in for good measure. I'm guessing that doesn't include you.", "date": "17 Oct 2017"}, {"text": "The blackberry is the only android phone that can not be cracked \"till now\" that is why you pay more", "date": "17 Oct 2017"}, {"text": "Comparing to the legendary Iphone 8 plus :) which has (67.4% screen-to-body ratio) , Motion is better with its 71%.\n \r\nThe Blackberry is a mid range phone with almost half the price of the Iphone 8 plus. ", "date": "17 Oct 2017"}, {"text": "Details about loudspeaker and quality sound ?", "date": "16 Oct 2017"}, {"text": "71% Screen to body ratio ? \r\n32 GB memory ? \r\nLimited Color ! \r\nBlackberry is now Backberry  living in 2008!", "date": "16 Oct 2017"}, {"text": "I hate apple but apple has an advantage i.e. iOS which is owned by Apple and is present only in iPhone. Now tell me what BlackBerry has that others don't except all that privacy they talk about? They had BlackBerry 10 os, they could have enhanced their own os to compete with other major brands but they followed crowd and now BlackBerry is just another android phone and Sony and Nokia also build durable phones with reasonable cost. Why is BlackBerry charging so much money? Explain it without using the term privacy. I am not fan of brands I buy value for money and durable phones.", "date": "16 Oct 2017"}, {"text": "How come there's no dual band for wifi?", "date": "16 Oct 2017"}, {"text": "Average mobile, same plastic back cover, camera f/2.0 horrible, BB goes for cheapest chipset, Gpu, specs below standard, even OPPO f1 is 64/4 camera f/1.9 6\" screen, still 290$° BB and Apple have a rod in their necks, to miserably fail, but not compromise on Price, it's is average 15.96% year by year. Still Crib on, state of affairs. In the End this has to Happen, maybe sooner! ", "date": "15 Oct 2017"}, {"text": "Hi i have one very important question before i decide to buy . This BBRY Motion Dual Sim Version, does it have a dedicated SD Card Slot? I have a Key One Dual SIM version bought from India. But the only downside on it is that the SD Card Slot is hybrid, that this I have to take out SIM 2 if I want to install SD card. So either one Sim card and SD cars OR two SIM Cards and no SD Card. If BBRY Motion can accommodate 2 SIM Card PLUS SD card at the same time, then I will buy this. ", "date": "15 Oct 2017"}, {"text": "Like their design. They dont look like all other phones. Nice phone. ", "date": "14 Oct 2017"}, {"text": "is it available in any other colors like white or gold color ?\n", "date": "14 Oct 2017"}, {"text": " Dual sim ????", "date": "14 Oct 2017"}, {"text": "Dual sim please the work  people use dual sim!!!!!!", "date": "14 Oct 2017"}, {"text": "motion looks nice, can't wait 4 it 2 b launched!", "date": "13 Oct 2017"}, {"text": "The Snapdragon 625 supports 4k recording. Your video recording listing should be updated. \n \r\nIPS LCD is interesting... Amoled screens degrade over time, looks like they're really aiming for longevity and durability with this phone. ", "date": "13 Oct 2017"}, {"text": "Camera should be 2160 not 1080\n\n", "date": "13 Oct 2017"}, {"text": "Very true -  it's better than Motion ", "date": "12 Oct 2017"}, {"text": "the design is totally horrible... it's unthinkable that Blackberry can continue to sink to the point of falling into the mistakes of the past that cost him his morbid situation today. I expected better but Blackberry disappointed me! ", "date": "12 Oct 2017"}, {"text": "it is good phone \r\nfor those who say it should have lower price tag i'll say apple gives you a shit whit price of 999.99$ and you still buy it! whay that price is ok but when bb pulls price a little bit up you get upset? \r\nand hence bb know how to optimize android os and ui is far better than what you think which gives even better ux! \r\njust think a little bit and than start judging it!", "date": "12 Oct 2017"}, {"text": "Hello \r\nWith the snapdragon 625,the battery will last much more ,than the snapdragon 800 and up.I have the BB Keyone since June ,and the battery last at least 2 days,because has the Proccessor 625,which is very good.You don't need e last proccessor,because with this mid-range,is far better.This is the Pros of the Blackberry device,and this price is very reasonable +the security features.With this price ,the company is very competitive,which are much cheaper than other smartphone.", "date": "11 Oct 2017"}, {"text": "No Fast Charging? BB must be joking, it's not 2013", "date": "11 Oct 2017"}, {"text": "i had 3 blackberries, latest was 30. all of them were fantastic. recently i tried s 7 and xiaomi. incomperable. bb 10 is designed much better and more stable. unfortunately did not continue. no matter how good does it look and how good does it feel price is too high. and thats it. ", "date": "11 Oct 2017"}, {"text": "it should be dual sim", "date": "11 Oct 2017"}, {"text": "Here's the thing. Android is not well optimized for its hardware like apple. I am sure overtime the OS will lag a bit. Heck even my galaxys7 sees more lag than iphone 6 plus (i use them both and I dont play games on them). So I am pretty sure SD625 wont give a buttery smooth experience. ", "date": "11 Oct 2017"}, {"text": "- Big screen \r\n- Android 7.1 \r\n- Snapdragon 625 \r\n- Adreno 506 \r\n- Bluetooth 4.2 \r\n- NFC \r\n- Fast batterry charging \r\n+ Good battery \r\n+ Good resolution\n", "date": "11 Oct 2017"}, {"text": "Come on Blackberry, you still did'nt awake. You are in a competitive world. Even companies like sony and samsung do not sell their products with such specifications, at high price. I am Using Z30. I was using Z10 and Q5. I m a fan of Blackberry mobiles.  If you don't change your pricing policy you will lose your customers and have face the fate of Microsoft mobiles.", "date": "11 Oct 2017"}, {"text": " 401 ppi, on a 5.5, 32 GB expandable , 4 GB RAM, water proof and one of the biggest battery .... mmmm", "date": "11 Oct 2017"}, {"text": "Price is high! \r\n500£!!!!\n", "date": "11 Oct 2017"}, {"text": "Yeah ! Priv is the best ! Large screen + slider keyboard ! :)", "date": "11 Oct 2017"}, {"text": "It's for battery efficiency, 625 is an extremely efficient chipset and reasonably fast. It's for business purposes, not anything  graphically intensive ", "date": "11 Oct 2017"}, {"text": "BlackBerry Motion\n \r\nUSB: USB On-The-Go ??? \r\nWLAN: \tWi-Fi 802.11 a/b/g/n  ???", "date": "11 Oct 2017"}, {"text": "There are many good spec device with that same price tag . BB is asking too much for this device nothing pleasant about specs and if they are asking for security features that too is too much. Blackberry should price its product so that they can reach to many peoples . By telling of today , todays mid range devices have greater specs than this", "date": "11 Oct 2017"}, {"text": "Doesn't even have fast charging feature. Even 2.0 is enough for this price.", "date": "10 Oct 2017"}, {"text": "Too costly just for a SD625.", "date": "10 Oct 2017"}, {"text": "Blackberry motion nice looing.", "date": "10 Oct 2017"}, {"text": "just never saw bb put a powerful chipset in their phone. what is wrong with them?! at least give us a sd821", "date": "10 Oct 2017"}, {"text": "Beautiful phone. Am a T-Mobile customer, they release this with 2,4,12 LTE bands and I'll order in a heartbeat.", "date": "10 Oct 2017"}, {"text": "Haters will always hate even if they get the phones for free.  \r\nIf you want a kids phone for gaming, angry birds, candy crush, without needing security then you have plenty of phones to choose from.  \r\nLeave the Blackberry Secure WORK phones for the grown ups. ", "date": "10 Oct 2017"}, {"text": "What's the point buying a midrange BB if it doesn't even have a physical kb? They need to make a \"Priv 2\"", "date": "10 Oct 2017"}, {"text": "Yea you are right. Like my Skoda fabia has the same 1.4 TFSI with Audi A4.... Because only the \"engine\" matters for price tag....", "date": "10 Oct 2017"}, {"text": "Rightly said... even i have the same feeling.. BB always mess things up when it comes to pricing. Its high time they realize that there are many competitors in the smartphone market who sell phones with similar features, about 30-50% lesser the price than what BB charges.. They need to stop charging more and try getting profit by volumes.", "date": "10 Oct 2017"}, {"text": "This device may not sell well enough because of its price in contrast of specs but there are many beloved devotee bb fans who is going to buy it anyway .", "date": "10 Oct 2017"}, {"text": "Hehehehhe jalan", "date": "10 Oct 2017"}, {"text": "Wow nice phone", "date": "10 Oct 2017"}, {"text": "Blablabla. Expensive phone.... Useless", "date": "10 Oct 2017"}, {"text": "it has same Snapdragon as MiA1,.. the price is high, it needs to be cheaper actually", "date": "10 Oct 2017"}, {"text": "I actually like the look.  Square at the top, rounded at the bottom.\n \r\nI wish that back was carbon fibre, like the old Moto Droid Razr.  Just metal with a covering sadly.\n \r\nIt costs too much, but I don't hate it.", "date": "10 Oct 2017"}, {"text": "Front looks good back looks ugly as f..k specs compared to price are really bad wonder if someone buy thi thing. ", "date": "09 Oct 2017"}, {"text": "Agreed", "date": "09 Oct 2017"}, {"text": "Video camera, should be 4k.", "date": "09 Oct 2017"}, {"text": "I love this phone,i would like the buy this phone", "date": "09 Oct 2017"}, {"text": "finally a simple and nice design with decent specs and price. I would buy this in a heartbeat. ", "date": "09 Oct 2017"}, {"text": "why the price is so high for such mediocre specs? \r\nit should have been around 300Euros at max. \r\nthey are lagging so behind than current dominating smart phone makers in terms of looks,hardware,camera etc..etc. \r\nBB if u want to return back than do some thing extra ordinary with less price tag.", "date": "09 Oct 2017"}, {"text": "If lighter than a pixel, I'll consider it", "date": "09 Oct 2017"}, {"text": "Thats specs and about 400 euro? Ok, bye.", "date": "09 Oct 2017"}, {"text": "Seems better than the competition... Good waterproofing, great battery...", "date": "09 Oct 2017"}, {"text": "its already dead , stop it !", "date": "09 Oct 2017"}]