[{"text": "S9 price too high for me, having A8 which is half the price of S9. Just don't like S curve edges. Less a bit on specs. But services and availability is why I bought Samsung since my S2 now obsolete (still working). ", "date": "11 Apr 2018"}, {"text": "Still enjoying my S8, no useful bw 8 & 9, can't wait to embrace 10", "date": "11 Apr 2018"}, {"text": "Leave where? Lmao I'm pretty sure all new devices are curved atm.", "date": "10 Apr 2018"}, {"text": "I have the galaxy s8. It's very comfortable and I have never touched the edges. The problem is that the bigger variants are a nightmare to hold. I agree with you. But the small variant is good. Sad thing that bigger variants have bigger batteries and more features like dual cameras. ", "date": "10 Apr 2018"}, {"text": "I've been a Samsung fan for many years (since Note II), but since Samsung insist on the stupid curved screen as the only option, I have to leave. I am so sick of the curve - it's uncomfortable to hold, it makes protectors bulky and ineffective, can't use the pen (note 8) on the edges, can't touch on the edge of the playing field in games, extra touches and miss-touches because your other fingers are already touching the screen just by holding the phone. Just because you can do something, doesn't mean you must. There is really very, VERY, little advantage to the stupid curve. Now opinions will vary, and that's ok - problem is that Samsung don't offer the flat screen option anymore - so they will lose those people. Like me. And I am disappointed about that.", "date": "10 Apr 2018"}, {"text": "I love samsung design. I dont like other android brands looking like an iphone x. Samsung and sony are the only brands im buying", "date": "09 Apr 2018"}, {"text": "But 3.000 mAh battery is monsterous for Symbian", "date": "09 Apr 2018"}, {"text": "#benben - its not samsung, its the carriers/providers, they are trying make as much money, capitalizing on this new samsung S9 (+) they are competing against  each other.  the price of of factory unlock from samsung is the same, and selling ! carriers dont like that, thats why all this \"deals\"", "date": "08 Apr 2018"}, {"text": "lol s9 is not doing so well I guess. Samsung is offering all sorts plans to switch to S9. People from s7 and s8 won't switch as it would be almost useless. Better skip this one sammy. Focus on bringing something useful in S10 like proper battery and under screen FP. Try not to mess it up with 6.5 or 7 inch lol. ", "date": "08 Apr 2018"}, {"text": "samsung have a lot ofoney from apple so now they dont care about the user . They are morecinto making more money and profit out of it ", "date": "08 Apr 2018"}, {"text": "stick witb i phone or go for other brand samaung is not the only one . Just chose whIch android suite u ", "date": "08 Apr 2018"}, {"text": "no only screens motherboard all all kind of nonsence ", "date": "08 Apr 2018"}, {"text": "coz they were force to as the phone either going to break or break down all together ", "date": "08 Apr 2018"}, {"text": "Exactly . Thats why i ran to other brands . I think they are copying Apple IPhone technique but they make sure that evidence is erased unlike apple got caught in the scene . Now giving free battery with a discount ?", "date": "08 Apr 2018"}, {"text": "Which android application name please ", "date": "07 Apr 2018"}, {"text": "You dont need upgrade if you want wait pixel next year", "date": "07 Apr 2018"}, {"text": "I bought the S9 to have the best camera phone of 2019, and until now it didn't dissapoint. But with the p20 pro released, i think i might have to upgrade. Anyway, here are some of the best comparisons i found on youtube with mate 10 pro and pixel 2. It's a new channel, but seems legit, not like tech town, tech swich or other fake channels\n ", "date": "06 Apr 2018"}, {"text": "Does it support new UFS cards? UFS use less power while being faster compared to microSD", "date": "06 Apr 2018"}, {"text": "Yes they have. I found call recorder on the Android apps.", "date": "05 Apr 2018"}, {"text": "They have screen recorder. But not call recorder. But I don't like call recorder.", "date": "05 Apr 2018"}, {"text": "I love this phone. Samsung has done so much better job then Apple and is at less off a price. Plus I like see some off the older Samsung's for sale still such as the S6. Next year's S 10 very excited about.", "date": "05 Apr 2018"}, {"text": "Still no application developers has developed call recorder for s9. How much we have to wait for that. Any idea. ", "date": "05 Apr 2018"}, {"text": "Ok, can you please provide a reliable source that confirms that \"almost every phone is made there\" then? \n \r\nThanks in advance", "date": "05 Apr 2018"}, {"text": "a 3000mah battery no way", "date": "04 Apr 2018"}, {"text": "I cant say percentage but Foxconn is world biggest factory for making the cell phones. ", "date": "04 Apr 2018"}, {"text": "  \r\nS8 vs S9", "date": "04 Apr 2018"}, {"text": "I bought Galaxy S9, after using Galaxy Alpha for 3.5 years.\n \r\nI would say, This is the phone with no compromise. Everything is top notch without that stupid notch(iphone X). Camera and display is best at this time, there is no any other phone which can compete with Galaxy S9. \n \r\nSamsung experience ui is great. Everything including Edge lighting, dual speakers, Edge panel, super slow no, F1.5, Force touch home button which actually feels like home button, Performance is great as well.\n \r\nBattery could have been better, but it's fine for me. It can survive whole day with 4-5 hrs SOT.", "date": "04 Apr 2018"}, {"text": "Samsung rarely gives updates, using a S7 and S8 and till now oreo has not yet come.............very slow in giving updates cause by the time oreo for sammy, pixel would have a new version for their fones............samsung fones are gr8 - gud camera and formfactor and looks - overall gud but OS still cant compare with Pixel fones.........so end of the day OS i.e stock android plays a major role.", "date": "03 Apr 2018"}, {"text": "fake news at its best ", "date": "03 Apr 2018"}, {"text": "S5 and S7 were amazing phones. Still about 80 million working great world wide. S6 was the dud model. Guess, your just a troll here, probably a Sony fan boy", "date": "03 Apr 2018"}, {"text": "haven't had this phone yet but from what I see and hear out there its the best in 2018. Am ma buy this phone, working on my budget", "date": "02 Apr 2018"}, {"text": "It seems Samsung suffers from the oddity curse, that is, every single odd-numbered release of their flagship phone has suffered from one or more design flaws.\n \r\nS: \r\n1. Phone slow startup after just 6 months of purchase brand new.\n \r\nS3: \r\n1. Screen burn-ins \r\n2. Enexplained crashes even though using firmware released by Sammy + the telco addons.\n \r\nS5: \r\n1. Sensor underneath the AMOLED screen would caused the screen to flash continuously at low brightness level (less than 10%). Once the problem starts, can't fix it; require a complete screen + sensor change. \r\n2. Performace degrades after 11 months of constant usage.\n \r\nS7: \r\n1. Can't stand the Australian heat if you accidentally left the phone on the dashboard for about an hour. Phone heat up and died. Such worthless fragile heap of gimmick junk, it's really laughable! Remind me of overpriced European cars with crappy aircon. Eh? Forget that it was supposed to be made for the Australian market and extreme weather condition. \r\n2. Video time is half of what was claimed by Sammy and \"independent\" review sites. Notice the double quotes!\n \r\nS9: \r\n1. Battery life is utter crap, despite the bogus claim from Sammy and its legion of fanboys! Try watching videos and games with intensive graphic sequences and you'll see what I mean. Remember to bring the damn charger with you everywhere you go! \r\n2. Dual audio lines recording not working at all (You can write a test app/case in Java to prove this point yourself). \r\n3. Back gorilla glass surface, as always, is not a good heat dissipator (Neither was plastic from their previous Galaxy SN flagship phones), where \"N\" is a numeric designator. \r\n4. Non-removable battery won't help if you need to fix your phone OS yourself. Developer will know what I mean. \r\n5. No IR blaster and radio-receiver chips - useful features not included.\n \r\nAll up: Don't bother anymore with over-hyped, gimmicky Samsung Galaxy S-series flagship phones! You just throw money down the drain even if you can afford it comfortably.\n\n", "date": "02 Apr 2018"}, {"text": "You can easily uninstall any bloatware that you want. This is a big plus for Samsung. Other brands like \"Sony\", you can't uninstall most bloatware.", "date": "01 Apr 2018"}, {"text": "When it comes to functionality and performance(except battery life), Samsung's flagships almost had it all. \n \r\nExpandable memory. \r\nGood Screen, Camera, Hardwares \r\n3.5mm headphone jack(Thank Samsung for keeping this.) \r\nGood looking phone. IP certs.\n \r\nThe only thing hindering from buying them are the amount of bloatwares. \r\nLooking back to my First generation Samsung Note, I never used any of its bloatwares.", "date": "01 Apr 2018"}, {"text": "hspa", "date": "30 Mar 2018"}, {"text": "Mobile is ok but its very heating and batterie pack up ok but heating lot sometimes hanging lot while playing games charging bit slow i give 3star money wasted i thinking pls choose other mobile my opinion have a nice day", "date": "30 Mar 2018"}, {"text": "Hm, I wonder what to get... This, or two Playstations, a laptop, computer, a second-hand scooter, maybe a cheap car? Perhaps save it for gas money, to go to work, for like six months. It's such a tough decision (not :))", "date": "30 Mar 2018"}, {"text": "It is also my impression that the s9 is the best looking phone in the galaxy (pun intended) right now. For me the looks donÂ\u0092t do all the deal but itÂ\u0091s true itÂ\u0091s damn gorgeous", "date": "30 Mar 2018"}, {"text": " galaxy, galaxy has a fair question I believe. ", "date": "30 Mar 2018"}, {"text": " s9's battery life is not as good a s7 edge's battery running marshmallow. Overall, the s9 with the 845 is fast, and battery is slightly \"below\" average. The 835 is has better battery life in general.", "date": "30 Mar 2018"}, {"text": "I go into the shop and I still see s9 looking the best.", "date": "29 Mar 2018"}, {"text": "bring back the irblaster", "date": "29 Mar 2018"}, {"text": "Shareit is working on Bluetooth mode only", "date": "29 Mar 2018"}, {"text": "With respect this is not a great question to ask here and I will explain.\n \r\nEach person's perception of good or bad battery life will be different and will depend on there past experiences. E.g If they get more S.O.T with the s9 compared to previous phones that they have had they might say \"Yes it's fantastic!\" BUT the opposite may apply if they are now getting less S.O.T.... and what would that tell you anyway? \n \r\nShock, horror people have biased views also..... Some will defend whilst some will attack the S9 and it's impossible sometimes to find the truth.\n \r\nWe all use our phones differently, more or less calls taken or made.... more or less gaming or using social media apps or we may stay in a very hot country where the sun shines brightly and to compensate the screen brightness may be turned up so that the screen can be seen clearly... this will drain battery quicker than someone who spends most time in doors or stays in the northern hemisphere for example. So people may give you different answers........ and what would that tell you?\n \r\nAlso someone who receives a good signal will be less affected than a person that receives a very poor signal strength...... also do they use Wi-Fi or mobile data...play videos .... how many apps do they synch?  Etc I could go on and on \n \r\nSo to just ask random people may not help you too much. Best to.look at the reviews here and look at some of the test results than to ask different users because we are all different. At least test conducted are all conducted under similar conditions so that is the best quite and will give you a much clearer answer. \n \r\nProbably best starting here tbh and work from there\n\n \n \r\nAll in my humble opinion.\n\n", "date": "28 Mar 2018"}, {"text": "Is this phone have bad battery life i want to know", "date": "28 Mar 2018"}, {"text": "If someone bought an S9  from their local store in Germany would you expect  that person to say they bought \"I bought it from China\" when asked,  just because it was manufactured there? ", "date": "27 Mar 2018"}, {"text": "I was talking about CSC codes - E.g. UK & Ireland (XEU) or France (XEF) or Germany DBT.\n", "date": "27 Mar 2018"}, {"text": "Yeah, admittedly I wasn't very clear - what I mean is that if you buying a S9 from Germany for example and using it in the UK. Thats what I meant where it came from. Post manufacturing when it moves to the retail markets and sold.in a particular country for the first time.", "date": "27 Mar 2018"}, {"text": "\"Chinese Foxconn almost every phone is made there and then send worldvide\"\n \r\nWhat happened to Vietnam? \n\n \r\nWhen you say 'almost all' what percentage are you talking about? ", "date": "27 Mar 2018"}, {"text": "The phone does so many things is overwhelming.", "date": "27 Mar 2018"}, {"text": "I got my Samsung Galaxy s9 2 says ago and on day 1 of using it I've charged it twice and by the time I got home from work which wasn't long after I charged it the second time I was on 20 percent 20 minutes later I was on 7 percent I had the same issue with the note 8 I returned so which do Samsung make such crappy batteries because there is no excuse for them and what's the point in bring out a phone with shitty battery life seriously it's a complete joke......", "date": "27 Mar 2018"}, {"text": "Foxconn doing almost everything for a mobile department for many brands. ", "date": "27 Mar 2018"}, {"text": "But yes you did. ", "date": "27 Mar 2018"}, {"text": "Thank you bro!!", "date": "27 Mar 2018"}, {"text": "yes", "date": "27 Mar 2018"}, {"text": "I just have one question. Will Samsung pay work with machines that doesn't have magnetic swipe as well as NFC i.e. the machine will accept only the insertion of card. Will Samsung pay work on these POS terminals in India?", "date": "27 Mar 2018"}, {"text": "its okay can hold 1 day standart smartphone now", "date": "27 Mar 2018"}, {"text": "Hi \r\nYou got the point. It is low price online then UK market. Going to buy this \r\nThanks a lot ", "date": "27 Mar 2018"}, {"text": "I love how the image of the S9 needs that huge 9 there to differentiate it from the S8 since they look identical.\n \r\nI mean really the only difference is that S9's back setup looks more like the Mi MIX that Samsung's been trying to copy for over a year. Samsung fans you are welcome for the Mi MIX's better fingerprint sensor placement. It could have been even better but looks like Samsung overstocked on those small rectangle sensors. Otherwise you could have had a decently sized MIX style sensor.", "date": "27 Mar 2018"}, {"text": "The firmware region/country. ", "date": "26 Mar 2018"}, {"text": "Wasn't talking about where the phone is made!", "date": "26 Mar 2018"}, {"text": "Man at Chinese Foxconn almost every phone is made there and then send worldvide.  \r\nFoxconn doing tons of brands Apple, Samsung, Sony ETC, ", "date": "26 Mar 2018"}, {"text": "Please drop your complaint here to get a support.\n  \r\nPlease anybody else having this issue drop a comment on this site to raise this issue for Samsung. \n", "date": "26 Mar 2018"}, {"text": "this problem is being reported elsewhere too. Samsung fails. I have an S7 edge and it eill ne my lasy Glitchsung device", "date": "26 Mar 2018"}, {"text": "S9 has thicker side bezels. Buyer beware. Its basically an S8 with Snapdragon 845 and a better camera... ", "date": "26 Mar 2018"}, {"text": " Does the S9 support 802.11ax standard.?", "date": "25 Mar 2018"}, {"text": "Have difficuty touch the right corner edge. Dont buy first before they solve d issue", "date": "25 Mar 2018"}, {"text": "The reason that I ask about the CSC code is that will tell you the phones original region/country. Quite handy if buying over the net and you are not sure where the phone originally come from.\n \r\nThe phone will also receive updates for that particular region/country.\n\n", "date": "25 Mar 2018"}, {"text": "Do you know the phones CSC code? If you have access to the phone I can tell you how to see it. ", "date": "25 Mar 2018"}, {"text": "If it's the G960FD that you are talking about then you will have no problems with it.\n \r\n It's the Global/international version. \n \r\nIt will also contain the Exynos SOC which many would argue is superior to the Snapdragon.\n\n\n\n", "date": "25 Mar 2018"}, {"text": "It should be a nice phone for 400 eur if its manufacturing price is 347 but thats not this case. So no buy. ", "date": "24 Mar 2018"}, {"text": "Hi \r\nThanks for quick response. I need more help from you please. I see this model is low price online store. Will this work in UK on EE. \r\nBest Regards", "date": "24 Mar 2018"}, {"text": "Don't know if I will explain it well but will try.\n \r\nThere are variations of a particular device, as in this case, the S9. An obvious would be the size of storage for example. \n \r\nAnother example will be that the international variant will be fitted with an Exynos SOC but the American and Chineses devices for example will be fitted with Snapdragon.\n \r\nThe D means Dual SIM, Which I think you already knew. Well that just means that you can put two SIM cards in that model instead of one SIM card on another model.\n \r\nIn short - there are different versions of the phone, and that code just tells you what each version is. \n \r\nI'm probably not making any sense. \n \r\nDunno.if this'll help..\n\n \n\n", "date": "24 Mar 2018"}, {"text": "Superb camera and fast prosseor", "date": "24 Mar 2018"}, {"text": "HI \r\nAny body can explain about different models of Samsung S9 like Samsung Galaxy S9 G960FD Dual Sim 4G 64GB - Cor.. what is the mean of G960Fd? Can I use it in UK? Thanks a lot for ", "date": "24 Mar 2018"}, {"text": "Not possible to record calls on Galaxy S9,Trying to record calls through your newly bought Galaxy S9/S9+ unit, and failing? Well, donÂ\u0092t bother downloading different third-party apps to test why ainÂ\u0092t your phone recording calls. \r\nHereÂ\u0092s what we dug out Â\u0096 teams behind at least a couple of third-party applications have confirmed that call recording isnÂ\u0092t possible at all on these devices, and SamsungÂ\u0092s to blame. try recording the call ,their phone only records their voice, not that of the person on the other end of the call.", "date": "24 Mar 2018"}, {"text": "How's s9 ? Performance, battery,camera \r\nPlez give me genuine opinion", "date": "24 Mar 2018"}, {"text": "Thanks ", "date": "24 Mar 2018"}, {"text": "I have had this phone for just over a week. I replaced my Samsung S7 and use the phone for business. As I use the phone for business I need to record business calls (it is legal to record conversations in my country as long as you inform the other party). It only records my side on the conversation which is totally useless. I will be getting rid of it in the next couple of weeks if this is not sorted as it does not serve on of the main purposes that I need to use it for. As I have already got rid of my S7 I will now be getting a phone from another manufacturer that does allow me to record both sides of the conversation. This is one of the most expensive phone on the market (got the 256GB model) and it does not do what is required and what all my previous cheaper phones did. Exceptionally disappointed with Samsung as I have being using them since the S3 was launched.", "date": "23 Mar 2018"}, {"text": "The variable aperture reminds me of .... my lumia 1020. Well just open and close for lumia 1020 than wider or smaller aperture.", "date": "23 Mar 2018"}, {"text": "S9+ ???\n \r\nBut how's the s9 in battery department", "date": "23 Mar 2018"}, {"text": "I know xiaomi product made good job in term battery life on their smartphone..I'm xiaomi fan too..but u no need to compare between mid range n flagship phone... ofc mid range phone has many cons n prob..btw I love s9 chill :)", "date": "23 Mar 2018"}, {"text": "48gb", "date": "23 Mar 2018"}, {"text": "Plus size is best in every department", "date": "22 Mar 2018"}, {"text": "If u R talking about plus size then sorry but yes small one has a poor battery ", "date": "22 Mar 2018"}, {"text": "hows the battery life of it", "date": "22 Mar 2018"}, {"text": "Samsung must be on crack if they think I am going to shell out for an S9 wich is basically an S8 with an upgraded camera... glhf Samsung better luck next year", "date": "22 Mar 2018"}, {"text": "Why so many xiaomi fans like to mocking another brand? Always said that xiaomi's better. Are u get paid by 'em? This makes me doubt bout this product :( are xiaomi makes people being hateful? LOL", "date": "21 Mar 2018"}, {"text": "After 1 week of use, great phone, even better low light photos and faster processor though battery life could be better if it can last longer. Nice size to hold and light and easy to touch screen function. Give it a test try before you buy.", "date": "21 Mar 2018"}, {"text": "Very very poor battery, disappointed, i regret purcshasing this phone", "date": "21 Mar 2018"}, {"text": "If your device is defected, doesnt mean other phone will be the same. Stop spreading hate.", "date": "21 Mar 2018"}, {"text": "Poor battery backup compared to the redmi note 5... Lags a lot... PLEASE don't buy... My advice ", "date": "21 Mar 2018"}, {"text": "how's the battery life? \r\nI'm considering to get s9 but all the reviews made worry about the battery.. ", "date": "21 Mar 2018"}, {"text": "Which call recorder application is working both voice in Samsung galaxy s9 ", "date": "20 Mar 2018"}, {"text": "I have no complaints about the sound I get from them but yes I agree with the quality and fragility of headphones where the wire connects to the 3.5 Jack certainly. \n \r\nWent through 2 pairs. Bad connection, sound loss in one ear, ended waggling the wire at where the wire goes into the Jack just to get stereo sound, annoying, new pair required!\n \r\nHope they have taken note of this and sorted out the problem whether it be a flaw during manufacturing, design or quality of products used. ", "date": "19 Mar 2018"}, {"text": " \"There is also a premium AKG-tuned in-ear headphones with mic bundled with the Galaxy S9.\"  \r\nPremium as it may be, they did not seem to be well made. \r\nCable is braided only on small part, and very thin. \r\nThey are better then  most other in ears U can get with other phones, but from my own expirience, they wont last u half a year until they broke, so much for the build quality....", "date": "19 Mar 2018"}, {"text": "It depends how and what you drop it on...... but that can be said for all the major flagships imo.\n \r\nI would highly recommend a case.", "date": "19 Mar 2018"}, {"text": "Good camera with same features as of S8 released last year. Too pricey to waste money on. S8 is a tested fone and works well. Just releasing a phone to compete with IPhoneX and pricing it a bit less than them won't work. Not worth 800 USD. ", "date": "19 Mar 2018"}, {"text": "Got this beauty 3 days back, can't find a fault. The screen is sensational, the phone is much faster than my previous S7 Edge. ", "date": "19 Mar 2018"}, {"text": "samsung s9 camera is only for low light and super slow-mo. it isn't as crisp even as one plus 5t. samsung really need at least 16mp.", "date": "19 Mar 2018"}, {"text": "what the....guys the design is perfect..\n", "date": "18 Mar 2018"}, {"text": "1. MicroSD cards up to 400GB are verified and tested by Samsung to work with the S9. But microSD cards on paper support 2TB of storage, so I guess those could work in the future, when available. \r\n2. MicroSD card supported on all models of the S9.", "date": "18 Mar 2018"}, {"text": "Unable to foreword or copy the messages received from a company. Very very bad. No call recorder working only one side is recording. Anybody using call recorder with both sides recording. Which is that application please.  \n", "date": "18 Mar 2018"}, {"text": "does this phone can stand still with a clean screen when i accidentally drop it? i dont want putting cases to my phones i want a phone that can be seen the design not hiding the design. the designer has a hard time to think of the design then we just hide. shame. ", "date": "18 Mar 2018"}, {"text": "just buy an android device flagship that can support your phone fast security updates and system updates and with lower cost with same specification.  ", "date": "18 Mar 2018"}, {"text": "I spoke to Samsung, the duel sim card model is overseas, not here. You might be able to irder it on the web from overseas merchants; but, buyer beware.", "date": "18 Mar 2018"}, {"text": "I parallel it to buying a car before your allowed to drive it. No matter where you pick it up to Â\u0091check-it-outÂ\u0092, you cannot. They are setup eith a caged software program that is nothing more than a fancy ad. Can you look at Â\u0091settingsÂ\u0092 to determine if you can setup a default naming pattern for the camera, NO. Maybe you would like to stream yourself during a call, NO. Our fancy ad will keep you in your seat and not let you even get up to use the rest room. \r\nI am not psyched up where I buy blindly, like you wish me to; but I did so want to evaluate Android for file system usage and determine if everything of MINE must be placed on the cloud. BUY IT FIRST!  \r\nIf I wanted to be blind sided again, IÂ\u0092d stick with the rotting Apple.", "date": "18 Mar 2018"}, {"text": "Camera may be 16 MP \r\nBut \r\nFor Memory Card -- Uses Sim 2 slot -- is CHEATING \r\nI hope this will be considered in it's next flagship. \r\nThen only I will buy the phone otherwise not.", "date": "18 Mar 2018"}, {"text": "Biggest upgrade over S8 is the camera on S9, and S9+ really holds the advantage with dual camera. Second are a bit faster processor, and stereo speakers. \r\nBut S8 has better design, and same battery (with exception of it already being a bit downgraded from full year of use). \r\nFeature wise, I donÂ\u0092t use either Bixby or Google Assistant or anything like that. Only Bixby vision text extraction sometimes comes handy, the same like abillity to scan part of the screen, or take long screenshots and make GIF animations. \r\nBottom line: The S9 is definitley a better phone than S8. But if you arenÂ\u0092t really rich or if you donÂ\u0092t feel like spending money and already have S8 - you will probably stick with the S8. Unless you are a hard case of camera person.", "date": "18 Mar 2018"}, {"text": "Why keep making the screen so big,i will need a clown pocket , ridiculous", "date": "18 Mar 2018"}, {"text": "Why so heavy and ugly design??", "date": "18 Mar 2018"}, {"text": "ask apple why iphone 6 like 6s, 7, 8 in designe hhhhh", "date": "17 Mar 2018"}, {"text": "Why the hell samung put 4 GB Ram in his flagship phone? Why this phone looks like the s8 again where is creatively ha? Why so boring design again? I expected something remarkable from samsung but it seems like they prefer to remain Boring... such a waste.", "date": "17 Mar 2018"}, {"text": "I have questions. 1. The phone supports microSD card up to 400GB? I've heard of some phones supporting 2TB microSD cards, although those are probably not real(I haven't followed SD card news in a long time). 2. It says \"(uses SIM 2 slot) - Dual SIM model only\" Does this mean no SD card slot on single sim model?", "date": "17 Mar 2018"}, {"text": "what is the available space from 64 gb in s9 when i get it new", "date": "17 Mar 2018"}, {"text": "All phones that has the digitizer screen wafered with lcd is prone to lcd burn. Just make sure to rest your phone if heats up like a flat iron. ", "date": "17 Mar 2018"}, {"text": "If you have the money in your pocket (or will have the money in your pocket soon) and you are itching to buy but haven't done so yet.  Worth pointing out that previous Galaxy Flagships have seen big price drops and promotions shortly after release. So if you can hold out and you are on a tight budget it could be worth holding out for a couple.of months. \n \r\nI point this out because almost guaranteed there will be many a post moaning/complaining about big price reductions and promotions that they see a couple of months down the line. \n \r\nDon't say you were not warned. You know the score :)\n \r\nAlso\n \r\nThe S8 or the S8 Plus are already to be found at good prices, if you have not considered either of those options and retailers will likely reduce prices even further due to the launch of the S9's. \n", "date": "17 Mar 2018"}, {"text": "Ok friends, thought to update everyone.\n \r\nUsing s9 from last 1 week, everything is super fine however the battery life is very poor. Approx full charge will give you around 6hr to 8 hrs only.\n \r\nI had s7 edge earlier which was much better interms of battery life i.e. 12hrs to 14hrs", "date": "16 Mar 2018"}, {"text": "Agreed with me its even 10 hrs.\n \r\nPreviously using s7 edge which works for atleast 16 hrs", "date": "16 Mar 2018"}, {"text": "Bring back the infrared port. I can't move on to the S9 because there is no IR port", "date": "16 Mar 2018"}, {"text": "problem with samsung s9 and s9+ is it dont have dual sim 4g stand by", "date": "16 Mar 2018"}, {"text": "Battery is dissapointment for me. Comig from iphone SE that has 2x smaller batter and lasts twice as long. \r\nBattery estimate 14h This is very poor. \r\nScreen is exelent.", "date": "16 Mar 2018"}, {"text": "I just sold my OnePlus 5T for $500. I paid $460 for it 4 months ago, and with Samsung's student discount, an ongoing eBay promotion, and trading in a different phone, it will essentially be an even trade for a much nicer phone.", "date": "15 Mar 2018"}, {"text": "no its not its performance is equal to apple's a11 bionic which is a hexa core processor of 10nm\n", "date": "15 Mar 2018"}, {"text": "We don't.  I am considering this purchase to replace my S4 which replaced my Note 4 when it died after 2.5 years.", "date": "15 Mar 2018"}, {"text": "from what i know, Exynos is more power efficient than Snapdragon - in gaming not so much. I know it was developed by Samsung with the help of Qualcomm and my issue was regarding  battery life which I supposed to be better than S8 due to newer and more power efficient processor. Time will tell.", "date": "14 Mar 2018"}, {"text": "Exynos is a replica of snapdragon. Doesn't quite perform like snapdragon even in terms of gaming", "date": "14 Mar 2018"}, {"text": "Since when samsung users often change their phone? Which people are you talking about? Samsung phones is one of the best market, their flagships phones could be relevant after a years, even S7 edge still can a best buy this year. iPhone users mostly live in cave, change phone every year even there is no different every new iPhones released. Same ui, design, not top on camera and ugly design if they appear new design LOL.", "date": "14 Mar 2018"}, {"text": "Can anyone please provide me with the hexadecimal of the Samsung Galaxy S9 colors? \r\nMidnight Black \r\nTitanium Gray \r\n Coral Blue", "date": "14 Mar 2018"}, {"text": "Since normally these units they review aren't the ones u buy from stores, things can go wrong u know, it is unpredictable what flaws the very early \"prototype\" units have compared to those bought in stores", "date": "14 Mar 2018"}, {"text": "Because, if the don't do this, sooner than later Samsung galaxy will sit next to those of Lumia series, Nokia Symbian series, Sony Ericsson, etc.\n \r\nFan means this. This is bad, but if those little LG's Optimus fans continued support of their platform, then they still had theirs.\n \r\nHTC is next loser thanks to small fan base. After 2 years of missing HTC, they will find what they lose, \"Self made imaginary trust\".", "date": "13 Mar 2018"}, {"text": "Samsung owners are just like iPhone owners. Every time a new one comes out ,they have to update their phone! Why?", "date": "13 Mar 2018"}, {"text": "I agree with what you are saying but, the same tests performed upon S8 last year showed a better battery life. How is that possible considering that all mentions regarding Exynos 9810 say that is more power efficient than Exynos 8895? Could the tests be wrong ? ", "date": "13 Mar 2018"}, {"text": "You samsung haters forget something about slow update:  \r\n-ios have 1 major update per year at the same time ( week before or after new iphone).  \r\n-android release new os on the last quarter (often sept oct november) for their nexus or pixel.  \r\nIf you look carefully itÂ\u0092s the same for samsung (or other brands). Because samsung release every year the update of s series times before or after new galaxy s (feb or march). In fact itÂ\u0092s the same one year update. True Google release android early on spetember or october but samsung has is own release date and they respect that every year. I donÂ\u0092t understand why people want update at the same time with nexus. Sure itÂ\u0092s the same android os but itÂ\u0092s not so simple. It take time to customise android and add touchwiz on the front. SamsungÂ\u0092experience android # google vanilla android ", "date": "13 Mar 2018"}, {"text": "It costs a lot of money for u but it doesn't cost a lot for us, that's it", "date": "13 Mar 2018"}, {"text": "In the end, the battery endurance test doesn't proof to show that it is similar to your real day to day battery life. U can get better battery life than that if u use it in moderation", "date": "13 Mar 2018"}, {"text": "Why does S9 has a lower battery life than S8 considering they said newer CPU's have a much lower power consumption? ", "date": "13 Mar 2018"}, {"text": "I would like to see a huge improvement on flash too. This is a decorative artifact on my S8+ because it's too weak and narrow to be usable. It's interesting the citation of GALAXY S2 flash in this review, since I owned a S2 for about 5 years, and the flash was awesome powerful, the best I've seen, surpassed only by the Nokia N8 xenon flash. \r\nTruly, the dual aperture is a great thing, but the common sense was about an VARIABLE aperture rumor. So, this is kind of a half-disappointment. \r\nSince this is the major improvement, I don't wanna trade S8+ by S9. Waiting for Note 9 or the S10 (not X, please, or leave the galaxy brand)", "date": "12 Mar 2018"}, {"text": "hey guys I got a 2 month used S8 for Rs 37000 (570$). I know if i take care of the mobile it can last 3-4 more years and then when I go in used market for the latest Galaxy phone I would have to spend around Rs 40000 (615$). So thats roughly 800 to 1100 Rs per month based on 3-4 years of usage. \r\nWhat I was thinking is if I sell my mobile after using for 1 year i would still fetch somewhere around 20-25K and I have to put 10-12K more for next used Galaxy (mostly S9) and in this way I can have almost new phones every year and all the galaxy flagships. \r\nWhat do you think do any of you do this or you all keep your phone for as long as possible.\n", "date": "12 Mar 2018"}, {"text": "When released \" Samsung Galaxy S9 MINI edition\"  ????? \r\nI hope this year to release mini edition of samsung flagship, let it be like sony xperia xz2 compact, not bigger than 5\" inch", "date": "12 Mar 2018"}, {"text": "S9 Bixby vision doesn't have food option, i have a phone from Europe version. No food option is available in Europe.", "date": "12 Mar 2018"}, {"text": "I like s9.. its fun", "date": "12 Mar 2018"}, {"text": "Absolute nonsense regarding any screenburn. \r\nI've had this Galaxy S6 for nearly 3 years, no slowdown, lag or anything, it's good as new & I'm still receiving support via updates, I started on Lollipop & now I'm on Nougat & soon Oreo. \r\nSo beware of some posters that have clearly never owned a Samsung, let alone a flagship model.", "date": "12 Mar 2018"}, {"text": "I think this is a better phone, but I still think the position off the camera and finger print reader is in bit weird place and looks strange. I think the Samsung A8 looks better, and has better size, but my problem is Samsung could not put in an S9 what they can put in an A8 phone because size smaller on the A8.", "date": "11 Mar 2018"}, {"text": "something looks wrong in the performence chart..... WAY too close to the s8. \r\ncan you check it out? are these really the performence?", "date": "11 Mar 2018"}, {"text": "i like s9 with dual camera. next year i hope samsung make s10(not s10 plus) equipped with dual camera. s9 plus is too big", "date": "11 Mar 2018"}, {"text": "That's the beauty of Android,you have tons of choices.Samsung makes smartphones for every type of user and every type of budget.", "date": "11 Mar 2018"}, {"text": "I've NEVER seen ANY software lag in any S or Note model that  I've owned.I've owned every S model except for the 7.Notes 3,4 and 5 were fine as well", "date": "11 Mar 2018"}, {"text": "78h endurance rating wut?", "date": "10 Mar 2018"}, {"text": "1440*2960 pixel display", "date": "10 Mar 2018"}, {"text": "With delibrate slowing down the speed ;-)", "date": "10 Mar 2018"}, {"text": "Android user. Mind you. I've had in my past also LG, Huawei, and other brands. And Atleast I do. But for a g2g system (give to get) I am reselling my old one to save a massive chunk of the price (in this case, when I bought the S9, I saved 1800 ILS (about 580$) when returning the note 8. And the rest of the 240$, was cold 'ard cash. ", "date": "10 Mar 2018"}, {"text": "What u call innovative..xiaomi flagship model so many cons than Samsung\n \r\n1.no micro SD slot \r\n2.no ip rating(just splash resist) \r\n3.no 3.5 mm jack\n \r\nJust their price can beat Samsung overall samsung win", "date": "10 Mar 2018"}, {"text": "Huawei is way better than Samsung. I've had both phones, Samsung is crap. Horrible battery life, software slows down after a couple of months. Huawei phones you can keep for years. ", "date": "10 Mar 2018"}, {"text": "xiaomi is more innovative than this brand period.\n \r\naddition: \r\nthis phone is made in china but its still pricey. ", "date": "10 Mar 2018"}, {"text": "they are scared to upgrade their battery it would explode and that would be that last day we will see samsung if that would happen. ", "date": "10 Mar 2018"}, {"text": "Do Samsung users change their phone that often? This costs a lot of money. I always keep my iPhone for years.", "date": "10 Mar 2018"}, {"text": "I don't know what it is about it, but I think the S9 design is much more mature than that of the S8. It looks less gimmicky and unproportional, but more serious.", "date": "10 Mar 2018"}, {"text": "Hi friends. I need some advice for my next phone. I have a iphone se and looking to upgrade. Here in India iPhone 8 64gb and Galaxy S9 both are available at same price of around Rs52000. I know specs wise and features wise iphone 8 looses big time against S9, but i also know perfomance wise and security wise iphone 8 should last 4 to 5 years as against around 3 years for the S9. What should I buy. I am comfortable with any OS, so thats not an issue. I am looking more from value for money and longevity as i am not going to spend 50k every few years so my phone should last me around 4 to 5 years if i spend so much.", "date": "10 Mar 2018"}, {"text": "So, s9 better in good light, worse in low light than S8", "date": "09 Mar 2018"}, {"text": "WTF .... really ?? Do you kind of guys exist on the planet. Are you actually comparing the S9 with the shitty Huawei China Filthy garbage. I think you should stick to 2013 phones like note 3. Cz that also has 3GB of ram and 32gb of Storage cz that's all you guys want.  ", "date": "09 Mar 2018"}, {"text": "No dex station support for S7", "date": "09 Mar 2018"}, {"text": "Don't talk rubbish. I have had an s6 for more than 2 years and it is perfect. I now have the s8 and it is absolutely magnificent. If you don't know what you're talking about then best to shut up. ", "date": "09 Mar 2018"}, {"text": "HAHAHAHA what? I've owned an s6 since the day it came out and I have never once had any burn in.", "date": "09 Mar 2018"}, {"text": "the battery should be at least 4500 mAh for a 5.8'' screen. ", "date": "08 Mar 2018"}, {"text": "ill never buy a samsung phones anymore all amoled screen will get burn from s6 and up. stop wating your money. ", "date": "08 Mar 2018"}, {"text": "The below bezel for S9 is thicker than S8\n", "date": "08 Mar 2018"}, {"text": "Such a hifi quality with low power battery...what a waste!!!", "date": "08 Mar 2018"}, {"text": "too big, too ugly and hard to handle ... \r\nphones just keep getting bigger.", "date": "08 Mar 2018"}, {"text": "Samsung S9 Is Better than Iphones...", "date": "08 Mar 2018"}, {"text": "Bye bye Note8...", "date": "08 Mar 2018"}, {"text": "Me to still love my S7 not upgrading!!!!!!!!", "date": "08 Mar 2018"}, {"text": "S7E is better. \n \r\nUseful aspect ratio, front facing fingerprint sensor, same screen quality (pretty much), slightly worse camera, *more* battery, same performance (4GB of RAM, Exynos 8890 ~ Exynos 8895).\n \r\nS7 still the best Samsung since S4. Buy S7 (better than S8, slightly worse than S9)", "date": "07 Mar 2018"}, {"text": "I got today the S9. Bye bye Note 8. hellooo S9! it's amazing. the preformance is godlike. and the Fingerprint placement is perfect. not to mention it's even more pleasing to listen to music with my friends! highly suggested!", "date": "07 Mar 2018"}, {"text": "hey \r\ni have an s9 and de camera is fabulous  \r\ni have fallen inlove with this phn \r\nde slow motion camers and the 1.80..............read more", "date": "07 Mar 2018"}, {"text": "This phone should be named as S8 camera edition.", "date": "07 Mar 2018"}, {"text": "We are working on the review at the moment, so expect these soon.", "date": "07 Mar 2018"}, {"text": "I am from India and heck I'm still using the s7 edge as my primary phone and for what it offers still, I'm quite impressed and will continue to use it until it starts to show it's age and slow down. Until then I don't see any fault on this phone yet. However this may not be the same in western countries as they want the latest technology with the latest features.", "date": "07 Mar 2018"}, {"text": "This has nothing to do with the s9 which is a much improved phone. I have an s8 and it never gets hot.", "date": "07 Mar 2018"}, {"text": "I have the s8 and it is excellent. A lot may depend on how long you intend to keep your new phone as future updates will be more limited with the s8 since it is already almost 12 months old. Other than future updates the s8 should be all that you may ever need. Having said that it's also nice to have the newest on the market so your choice.", "date": "07 Mar 2018"}, {"text": "Unless you're filthy rich and have money to throw around I say buy the S8+ then save up some money for the S10 because the S9 is not worth the extra cost unless you're a super fanboy and really want that slow motion camera.", "date": "07 Mar 2018"}, {"text": "Obviously because some people don't have a lot of data to use on apps like Spotify and FM radio is free and over the air.", "date": "06 Mar 2018"}, {"text": "Thanks for sharing these. \r\nI am also really curious about the \"check quality\" test shots. The ones where you can compare them to other smartphones test shots (grey/color poster). Thank you!", "date": "06 Mar 2018"}, {"text": "I agree since we're getting exynos SOC it's better to buy something cheaper with the same performance", "date": "06 Mar 2018"}, {"text": "The Galaxy S9 is just a refurbished and alternate model of the Huawei P10 Lite. I say Huawei Lite series is a strong alternative. Highly recommended compared to the S9.", "date": "06 Mar 2018"}, {"text": "S8 is enough for you. ", "date": "06 Mar 2018"}, {"text": "take the s9 so you dont have to change it for like 3 years or so", "date": "06 Mar 2018"}, {"text": "Unless you absolutely need the latest processor (lots of gaming, etc) I'd personally save my money and take the S8. It's still a fast, brilliant phone, and the camera - while perhaps not as good in low light - is brilliant. And looks pretty much identical too. ", "date": "06 Mar 2018"}, {"text": "Hei guys im planning to buy a new phone.. should i take the more expensive s9 or the cheaper s8 are enough for me?.. ex xiaomi mi5 user", "date": "06 Mar 2018"}, {"text": "very expensive", "date": "06 Mar 2018"}, {"text": "We took some camera samples in Barcelona. They are posted in the preview:  ", "date": "06 Mar 2018"}, {"text": "Hei gsmarena. \r\nI was wondering when the camera test shots will be available for S9 and S9+. \r\nThank you \r\nCheers y'all", "date": "06 Mar 2018"}, {"text": "There is heat issue on s7 screen and phone I feel a bit regret to own it. ", "date": "06 Mar 2018"}, {"text": "Maybe it depends on how you use it and the memory capacity. And it has too many bloats. Im switching to samsung s9. Thanks man. ", "date": "06 Mar 2018"}, {"text": "I want to get samsung s9. Samsung flagship phones look great. and i like the features. Im getting bored on iphone but i think its still the best on long term use", "date": "06 Mar 2018"}, {"text": "No it is not true. I have had my s8 since September and it is stunning. No lag whatsoever. Prior to my s8 I had an s6 for 2 years and it never faltered. You can change with confidence.", "date": "06 Mar 2018"}, {"text": "I'd say yes from my experience, it's probably because it has too many features. \r\nI don't think you really want to switch to Android, you're clearly acting as Samsung is the only manufacturer using Android. Lol... \r\nJust check reviews or something.", "date": "06 Mar 2018"}, {"text": "Is it true that samsung flagship phones starts to lag after a year of usage or even about 6 months of usage? Im planning on switching to android if its true i might stick with my iphone 8", "date": "06 Mar 2018"}, {"text": "y only usa and china has snapdragon 845... other no... is it other nation useless and no important....and can improve profit margin n reduce cost by using cheaper processor?...y...... forcing us to go sony and other ? please change n have been a few year", "date": "06 Mar 2018"}, {"text": "Been test for a while right on my hand this plug n play galaxy s9. The plus version was good it has 6gb ram (other competitor has 8gb already) my point is why the sudden change from model to model of this Samsung  \r\nHas to copy features  from other maker than make this galaxy the first make of some sort the Â\u0093originalityÂ\u0094 then sell it in the market like they are first discovered their own Â\u0093versionÂ\u0094 of innovation? Why Samsung do that? I donÂ\u0092t even know the answer one thing I know was Samsung has no originality then pays a lot of dollars for that. ", "date": "05 Mar 2018"}, {"text": "iPhone X has been so nice if it where galaxy s9 has to be. Why so long to take pride with this model when it looks exactly a copycat of the first one. Nothing beats the originals. ", "date": "05 Mar 2018"}, {"text": "there's no difference between Galaxy S9 and S8...\n", "date": "05 Mar 2018"}, {"text": "4 GB ram at this price... Disgraceful", "date": "05 Mar 2018"}, {"text": "why should people do that? \r\nSecondary camera is trend. \r\nPrimary is for professional using of phone.", "date": "05 Mar 2018"}, {"text": "thats not valid measurement for quality. \r\ntest resolution and sharpness.", "date": "05 Mar 2018"}, {"text": "8mp isnt low, test resolution.", "date": "05 Mar 2018"}, {"text": "A camera has so much more to it than just the pixel count. pixel quality matters more than the actual number of pixels in a camera sensor, especially when it comes to smartphone cameras. :)", "date": "05 Mar 2018"}, {"text": "But its better then 24 megapixel compare to another smartphone. First you should see the result of that camera because its like note 8 camera.........", "date": "05 Mar 2018"}, {"text": "Wait forever thats the smartest", "date": "05 Mar 2018"}, {"text": "Nothing wrong about s8 it has one of the best cameras", "date": "05 Mar 2018"}, {"text": "Right, the selfie cameras should be better than main camera, they should be main camera. I wish to soon see comparisons of smartphones camera full of peopleÂ\u0091s faces", "date": "05 Mar 2018"}, {"text": "be honest to your users dont troll them", "date": "05 Mar 2018"}, {"text": "8mp, low selfie cam :( ", "date": "05 Mar 2018"}, {"text": "Then it would be twice as thick and twice as heavy.", "date": "05 Mar 2018"}, {"text": "There is nothing wrong with the s8. It is an excellent phone. If you always want to wait for the latest you would end up never up-dating as there is always a new model every 12 months.", "date": "05 Mar 2018"}, {"text": "You should have upgraded to S8 when it came out, not Samsung's fault if you bought it so late? Lmao. people...", "date": "05 Mar 2018"}, {"text": "I guess you're trolling SD845 because it scored lower than the Exynos 9810 in Geekbench but, the SD845 still scores over 8k in multi score, certainly not a midranger lmao...", "date": "05 Mar 2018"}, {"text": "Samsung is the best phone type to have it is better than apple because you don't need a credit card to use the phone eg. iTunes... the shitty thing though is that Samsung releases new phones very quickly...whats happens to the people that already upgraded to the s8 like about 4/5 months ago... really messed up.", "date": "05 Mar 2018"}, {"text": "What medications are you taking? Xeetechcare already made a speed test comparison between S9+ and IphoneX and it beat the Iphone X. See for yourself on youtube", "date": "05 Mar 2018"}, {"text": "That does not even exist..... \r\nSnapdragon 845 is the newest and fastest chip Qualcom has ever made.", "date": "05 Mar 2018"}, {"text": "Samsung really out did them self OMG!!!!!1", "date": "04 Mar 2018"}, {"text": "Are you drunk?", "date": "04 Mar 2018"}, {"text": "snapdragon s845 is midrange cpu , where is snapdragon 855 or 865 . ", "date": "04 Mar 2018"}, {"text": "ugly ", "date": "04 Mar 2018"}, {"text": "Excellent work from Samsung, to bring 128/256 models of S9/S9+. However, I am wondering why there is no 128/256 internal memory models of Galaxy Note 8 in ME region or UAE? What is the problem? Unbelievable ...\n\n", "date": "04 Mar 2018"}, {"text": "that's my next dvice", "date": "04 Mar 2018"}, {"text": "Samsung Galaxy S9 and Samsung Galaxy S9+ is the best, still using 3.5mm jack, has no design like  iPhone X with notch, it only has AR emoji feature and good, but i also hope ever Samsung said about Galaxy S9 Mini.", "date": "04 Mar 2018"}, {"text": "when you get stuff of same quality and standard at a lower price, yes it is called cheap ! Wht is wrong in it ?  I used mate 9 Pro and my wife use Galaxy 8.  As such mate 9 Pro battery lasts more than Galaxy 8 and is very user friendly unless size if compared.  There are many people who go for quality irrespective of the brand.", "date": "04 Mar 2018"}, {"text": "My next phone", "date": "04 Mar 2018"}, {"text": "such a dumb comment from your dumb knowledge....camera sets new standards, display sets new standards, software features are on top , everything is freat about S9/S9+... YOU NEED TO .COMEOUT FROM CHINESE COPY CHEAP UGLY USELESS BAG ...", "date": "03 Mar 2018"}, {"text": "Same spec as s8.battery life is not good.too expensive not worthy I love my galaxy s7.", "date": "03 Mar 2018"}, {"text": "Nokia 7 plus batter  than this mobile \r\nBattery .look and android one \r\nNokia is back", "date": "03 Mar 2018"}, {"text": "Too expensive. As the trend goes now they give you primitive optics for camera and try to compensate it by cheap silly functions. Software requires no materials. 12MP? What a disgrace.", "date": "03 Mar 2018"}, {"text": "Phone is good looking but battery is not good enough, finger sensor is annoying. Same specification of S8 and S9 just little bit difference. S8 batter then S9 if you wish to buy Samsung.\n", "date": "03 Mar 2018"}, {"text": "hello \r\nh r u  huawei and samsung better than huwaie  brand very excellent i am using mate 8 also now i am using mate 10 pro i am very happy battery very excellent battery no heating and performance very very very good and nice  i hate samsung mobile and huwaie excellent model ", "date": "03 Mar 2018"}, {"text": "The reason that happens is because apple doesn't make long lasting phones and don't care about battery life so they throw a bulldozer inside a mine while android chips try to do it the smart way and use people to dig up and process all small things that come out of the mine thus making the process slower but efficient in not using too many resources thus better battery life and more functions. There's no denying that apples processors are faster but the packaging they come in is useless for me in the day to day use and no one yet needs that much processing power out of a phone that's why apple phones might be faster but if you take a closer look you'll see that android phones can do a looooot more stuff with a weaker processor than the iphone can do with their bulldozer. Plus samsung makes their own gear vr hardware with the help of oculus and it's pretty amazing when compared to the generic iphone headsets. I for one don't like the iphone eco system and the fact that their phones are pretty locked down that's why i have and S8 which i love and after almost a year of usage i haven't gotten tired of using it but when i do i'll just root it and breathe new life into it something which apple can't do quite like the androids friendly eco system.", "date": "03 Mar 2018"}, {"text": "the phone is good only sad part is the battery. with that processor  my self I expected the battery to more than 6000amh ", "date": "03 Mar 2018"}, {"text": "No Memory??? You can purchase the S9 Plus with 6GB RAM, up to 256 GB Internal Memory then add 400 GB more on a Micro SD Card. That's more memory than any other Smart or iPhone. ", "date": "03 Mar 2018"}, {"text": "My S8 Plus came with the FM Radio, Honk Kong version SM-G9550, 6 GB Ram, 128 Internal Memory.", "date": "03 Mar 2018"}, {"text": "$719.99 in the USA.\n\n ", "date": "03 Mar 2018"}, {"text": "Well I had a phone with 2900mah and lasts so long and it never had issues with fast batter draining or performance\n", "date": "03 Mar 2018"}, {"text": "OMG \r\nVariable apeature is Samsung's innovation? \r\nHa ha", "date": "03 Mar 2018"}, {"text": "Hi dude \r\nExynos of latest can't even beat the Apple A 10  fusion....... \r\nIt is worse than S8 and S9 is not a clear winner even with iPhone 6s \r\nI am an android user but we have to accept the truth", "date": "03 Mar 2018"}, {"text": "Not good? Exynos is currently the fastest and most advanced mobile processor. It's better than Apple A and Snapdragon. A lot better and more efficient. What makes you think Exynos is horrible?", "date": "03 Mar 2018"}, {"text": "true also noting so high here we hope for 4k display alredy so I wait for galaxy x", "date": "02 Mar 2018"}, {"text": "I dont wanna buy a Phone with only 3000 mAh capacity.", "date": "02 Mar 2018"}, {"text": "nice", "date": "02 Mar 2018"}, {"text": "Does sony have a variable aperture? \r\nNO \r\nNO THEY DONT! \r\nAre sony's phones beautiful? \r\nNo! They are hard to look at...", "date": "02 Mar 2018"}, {"text": "Oh well, best phone at the market yeah.... \r\nOr best phone based on it brands?", "date": "02 Mar 2018"}, {"text": "So Samsung trying to copy Sony XZs camera recording ability? nice try but Sony wins with the 19MP resolution on primary and 13MP on secondary", "date": "02 Mar 2018"}, {"text": "Change for change's sake often proves irrational. 18:9....18.5:9. Then? 19/20:9? How funny! Do we want mobiles or sticks? I guess seeing football or any video on the 18.5:9 screen may be a bad experience. Are we going mad or going to make the companies mad?", "date": "02 Mar 2018"}, {"text": "that's far away from perfection . ..", "date": "02 Mar 2018"}, {"text": "Its' the same display as on S8 .. ", "date": "02 Mar 2018"}, {"text": "      In S9 and 9 plusame 2D face recognition system which can be fooled by photos \r\n     Unlike iPhone X Animoji.....S9 3D animoji is rough and creepy \r\n     The innovation of S9 is \"it can change the apertures\"??? \r\nSo boring and lacking excitement and underwhelmed move", "date": "02 Mar 2018"}, {"text": "Replaced by what?", "date": "02 Mar 2018"}, {"text": "This phone has a good price on my region. S9 costs MYR3299 (USD842), same as S8 launching price! S9+ with 4/64 costs MYR3799 (USD969) and 6/128 doesn't have much different with MYR3999 (USD1021), same as Note8 launching price! Still lower than Pixel 2 XL and iPhone X price, thanks Samsung! I'll get it next month.", "date": "02 Mar 2018"}, {"text": "Around $845", "date": "02 Mar 2018"}, {"text": "The Samsung Galaxy S9 is the best OLED display ever made, according to DisplayMateÂ\u0092s rigorous testing, earning the highest score achievable. Despite running at the same 2,960 x 1,440 resolution as its predecessor, the Samsung Galaxy S8, a number of improvements have been made to the new device.\n \r\nMost notable among the screenÂ\u0092s many highlights is its improved color accuracy. DisplayMate lauds the S9Â\u0092s support and high level of execution of multiple color gamut standards, like DCI-P3, RGB and sRGB, and has awarded Samsung with a rating of Â\u0093Visually Indistinguishable from PerfectÂ\u0094 in this department. \n \r\nTo that end, the research firm states that this screen is Â\u0093almost certainly considerably better than your existing living room 4K Ultra HD TVÂ\u0094.", "date": "01 Mar 2018"}, {"text": "840 euro ;) ", "date": "01 Mar 2018"}, {"text": "What would be Samsung Galaxy S9 Price ?", "date": "01 Mar 2018"}, {"text": "This Samsung Galaxy S9 looks better than the previous model. I have decided that I will not upgrade my S7 to S8, But will purchase S9.", "date": "01 Mar 2018"}, {"text": "It's old technology replaced by better ones.", "date": "01 Mar 2018"}, {"text": "Where is the infrared blaster ??? :'(", "date": "01 Mar 2018"}, {"text": "And ugly turtle humpback with ugly cam and fp position.", "date": "01 Mar 2018"}, {"text": "No, it's they innovated it, just ask fans.", "date": "01 Mar 2018"}, {"text": "did samsung copy sony's gimmick feature!!? hahahahahahahaha!", "date": "01 Mar 2018"}, {"text": "my money is already ready to buy 5pcs. s9 but my s8 to this phone doesnt differ that much. i am very disappointed. samsung innovation please. you are losing you path. there are a lots of smart phones out there that are very innovative now. ", "date": "01 Mar 2018"}, {"text": "S9 is the best phone in the market right now......S8 was good but S9 raised the bar more higher for other phones to compare.....I have S8 and I can say that it is one of the best phone ....till now.....must buy if you want the best android phone with beautiful design.....", "date": "01 Mar 2018"}, {"text": "Sad spec  \r\n4GB ram? Low battery capacity  \r\nI go for Nokia 8 Sirocco and Nokia 7+ more higher better then s9", "date": "01 Mar 2018"}, {"text": "just missing ir blaster.......sensor...", "date": "01 Mar 2018"}, {"text": "It's difficult to improve on perfection.", "date": "01 Mar 2018"}, {"text": "unbox your phone\n", "date": "01 Mar 2018"}, {"text": "When the hell top samsung will have just FRONT CAM FLASH ?! the f*ck!!!? :/", "date": "28 Feb 2018"}, {"text": "It's strange that it has same screen to body ratio, as it is: \r\n- shorter in length (which should increase it) \r\n- wider screen is as wide as phone do it also should increase the ratio\n \r\nCould you double check it?\n \r\nTo tell you the truth there should really be proper method for screen to body ratio, probably based on area of screen divided by area of phone\n \r\nThanks for running such a great service!\n \r\nRichard\n", "date": "28 Feb 2018"}, {"text": "super ugly poring phone with low battery and unfair price ", "date": "28 Feb 2018"}, {"text": "go with s9...\n", "date": "28 Feb 2018"}, {"text": "s9", "date": "28 Feb 2018"}, {"text": "worser quality", "date": "28 Feb 2018"}, {"text": "planning to buy a flagship phone should i wait for apple phones or i just go with s9 \n", "date": "28 Feb 2018"}, {"text": "exactly", "date": "28 Feb 2018"}, {"text": "Correct. \r\nAlso the cpu, camera and other improvements. \r\nIts also slightly smaller in total size than the S7 Edge.", "date": "28 Feb 2018"}, {"text": "Why should I buy S9? it's exactly the same as S8 ... Samsung needs some new adeas such as dual facing cellphones.", "date": "28 Feb 2018"}, {"text": "Fm radio in asia... please sammy! S4 to s8, none. Note 3 to note 8, none...", "date": "28 Feb 2018"}, {"text": "computing power capable of breaking into nasa and NO memory behind it!!! \r\nStill going for OP5T", "date": "28 Feb 2018"}, {"text": "The phone seems good. Besides the new optics and stereo speakers, not much to offer. Sammy should focus on improving the front facing camera. IMO the s8 is still an amazing option. ", "date": "28 Feb 2018"}, {"text": "IPhone x is short with an ugly notch on the top of display. I am surprised by the failure of Apple in designing that deformed mobile ", "date": "28 Feb 2018"}, {"text": "The design is new not from 3 years.. It is designed last year, and imitated by other companies...regardless that the design is improved from the last year.  I think you are mixing between the repeated design of iPhone from 7 years and Samsung. Samsung is the first company to make the graceful infinity display design .  other companies like LG,  Huawei, Sony and others try to imitate,  because they see it beautiful and pleasing for customers. ", "date": "28 Feb 2018"}, {"text": "Please Samy cosentrate  Grey as a classic elegant color ", "date": "28 Feb 2018"}, {"text": "It is still the most elegant and most beautiful design in the world. When the Chinese company Huawei make an edge phone the price transcend the limits. ", "date": "28 Feb 2018"}, {"text": "Hi  \r\nThe Different of S7 Edge ( 534 ppi ) and S9(  570 ppi ) , Is that Right.", "date": "28 Feb 2018"}, {"text": "More than 3 years with the same design .. I am disappointed ", "date": "28 Feb 2018"}, {"text": "really???with that big ugly notch. LOL", "date": "28 Feb 2018"}, {"text": "Just tried it, great phone. \r\nBut just the same as my S8, so no need to buy...will get the S10, i wonder how they can improve it next year....would love fm radio, front flash and 128 GB memory.", "date": "28 Feb 2018"}, {"text": "I hope the design will be revamped in S10.", "date": "28 Feb 2018"}, {"text": "nothing new. i will just stick to my s8. samsung signing off", "date": "28 Feb 2018"}, {"text": "Disappointingly have to agree", "date": "28 Feb 2018"}, {"text": "The same problem have iphones,same mp but better picture ?", "date": "27 Feb 2018"}, {"text": "A thing this year iphone X have something new .this s9 is the same like s8 :(", "date": "27 Feb 2018"}, {"text": "Well maybe Animoji and 1 second of high speed filming are crucial for you but if I wanted a handset that's nearly 2 cm longer and almost twice the weight of my S6 edge for the dual cam and didn't want to buy an iPhone X at the same size as my S6 I'd buy a Note 8 at 25% less!", "date": "27 Feb 2018"}, {"text": "MWC2018 is such a disappointment with The over hyped Samsung Galaxy S9, almost identical to S8 & S8 plus. Lol", "date": "27 Feb 2018"}, {"text": "there's no difference between s8 and s9. iPhone X remains indisputable", "date": "27 Feb 2018"}, {"text": "Wrong \n\n \n", "date": "27 Feb 2018"}, {"text": "The Galaxy S9+ is available with up to 256 GB Internal Memory and 6 GB RAM. ", "date": "27 Feb 2018"}, {"text": "Samsung please input the infrared to enable the remote on the phone.", "date": "27 Feb 2018"}, {"text": "The Sony is definitely better", "date": "27 Feb 2018"}, {"text": "Phone price 900 eur and don't have fm radio?", "date": "27 Feb 2018"}, {"text": "?\n \r\nSorry, that sentence makes no sense. Could you please rephrase? ", "date": "27 Feb 2018"}, {"text": "All the best samsung .i am proudly  partner of your company, naver change it", "date": "27 Feb 2018"}, {"text": "still 4 gigs ram and quick charge 2.0? Good luck samesung", "date": "27 Feb 2018"}, {"text": "why? you wanna use a triangle shaped phone? they are not changing cause its perfect, but inside changes.", "date": "27 Feb 2018"}, {"text": "Most youtubers out there were Samsung and Apple fanboy.", "date": "27 Feb 2018"}, {"text": "Yes, I feel you too. Wish I could afford a flagship someday, but we all have our priorities. Then again, I love my first ever bought smartphone, Galaxy A5 2017:-)", "date": "27 Feb 2018"}, {"text": "The same design over 3 years without a single change .. No need to change S8 & S7 ", "date": "27 Feb 2018"}, {"text": "Woooow! This phone is really great. Paired with Over the Horizon 2018. How I wish I could get a flagship Samsung someday. :)\n \r\n- from an A5 2017 user", "date": "27 Feb 2018"}, {"text": "Some famous youtubers bashed on u ultra for having 5.7 screen with 3000mah battery. But s9 with 5.8 screen and same 3000mah battery is somehow ok. Not nice..not nice.", "date": "27 Feb 2018"}, {"text": "What are you talking about, you have S9+ with dual cam setup, best phone of 2018, even though it has just started. And considering the size, S9+ is almost the same size as iphone X bud with much better and bigger screen, camera, battery, better OS...", "date": "27 Feb 2018"}, {"text": "...960FPS!!! WHAT!!! 960!!!!!!!! I'm still here at 30fps... Seems like an awesome phone with the Snapdragon 845 with 2.8GHZ!! The ram is low though and the battery could have been bigger. ", "date": "27 Feb 2018"}, {"text": "Only Sony fans here jealous of the s9. Cause Sony made them a brick phone ", "date": "27 Feb 2018"}, {"text": "I'm a big fan of samsung.I like samsung very much.", "date": "27 Feb 2018"}, {"text": "Same edge screen garbage which breaks with 1 fall.. Innovation is gone. Samsung is new apple now", "date": "27 Feb 2018"}, {"text": "Try before you buy. Megapixels will not matter if the phone has an inferior lens. s8 and s9 have a far superior lens to s6. I had an s6 and now have an s8 and I assure that the s8 is superior. Don't be brainwashed over megapixels. ", "date": "27 Feb 2018"}, {"text": "I had the s6 and now have the s8. I can assure that the s8 camera is superior to the s6. You will not need better.", "date": "27 Feb 2018"}, {"text": "me too... im stickin with my s6. ", "date": "27 Feb 2018"}, {"text": "I have a note 8, and has never heated, even on intense use", "date": "27 Feb 2018"}, {"text": "Samsung puts all the features but fails on standby time.  \r\nEg - If you keep Bluetooth + GPS and LTE data switch on battery wont last long and phone gets hot. It doesnÂ\u0092t matter you have a bigger battery than an iPhone if it doesnÂ\u0092t last long. So that makes Samsung Galaxy lacks practicality and uncomfortable in my pocket.&#65279;", "date": "27 Feb 2018"}, {"text": "Serously?  ", "date": "27 Feb 2018"}, {"text": "Like I agree, same with the XZ2, like people are so unhappy, like 80% of them are not even going to buy them.", "date": "26 Feb 2018"}, {"text": "Does it have Air Play like iPhone? Or something similar to play witlessly? ", "date": "26 Feb 2018"}, {"text": "it does", "date": "26 Feb 2018"}, {"text": "Galaxy will not be the end with S9 as there is the Galaxy X coming later this year", "date": "26 Feb 2018"}, {"text": "Been waiting for Sammy to answer all the competition with dual cams at same size as my current S6 and once again they come out with just another cynical marketing non event. Pathetic. I'm switching to Chinese now.", "date": "26 Feb 2018"}, {"text": "Galaxy will be end with S9", "date": "26 Feb 2018"}, {"text": "I love samsung mobile it's only best android in the world. I want who want samsung android phone", "date": "26 Feb 2018"}, {"text": "how did you know that no one really complained? do you know all the people in the world & everyone of them told you that they they have no complain on ip8?", "date": "26 Feb 2018"}, {"text": "why? for bragging?", "date": "26 Feb 2018"}, {"text": "Wish S9 supports 4k 120fps. ", "date": "26 Feb 2018"}, {"text": "if you don't upgrade your old s7 to s9, it can only mean you are a broke excuse for a human.", "date": "26 Feb 2018"}, {"text": "No one complained about the iPhone 8 eh?\n\n", "date": "26 Feb 2018"}, {"text": "I don't really think I should upgrade my S7 Edge with this.", "date": "26 Feb 2018"}, {"text": "iPhone 4|4S - same design, no complaints.  \r\niPhone 5|5S - same design, no complaints.  \r\niPhone 6|6s - same design, no complaints.  \r\niPhone 7 - slightly changed, no complaints.  \r\niPhone 8 - used glass, instead of metal, no complaints. \n \r\nSamsung offers new design every year for S|Note series. \r\nThis year Samsung has decided to offer same design with new specs, updated camera and software and everyone is complaining af. What is wrong with you people? They have saved their ideas for 10th anniversary Galaxy S. ", "date": "26 Feb 2018"}, {"text": "Doesn't matter how many cores it has , as long as the applications are made for less cores than it has ... ", "date": "26 Feb 2018"}, {"text": "How many cores in adreno 630 ?? I don't known because in mali gpu the number is clear mp2 = 2 cores or mp4 = 4 cores ... in adreno not easy to know &#128531;", "date": "26 Feb 2018"}, {"text": "it only records 0.2 sec of 960FPS slow mo, which translates to a 6 seconds video at a time, like live photo by apple but in slow mo i guess", "date": "26 Feb 2018"}, {"text": "Battery on 3000 mah. S7 edge has 3600 mah.  They should have put bigger battery in s9.", "date": "26 Feb 2018"}, {"text": "No thank you", "date": "26 Feb 2018"}, {"text": "Same everything like S8 apart from SD845 and twice the cost of current S8.  \r\nWaste of money.  \r\nSamsung lost its mind. ", "date": "26 Feb 2018"}, {"text": "The things that I like most are 720p 960 fps slow motion. But my question -is it continious 960 fps video or limited for few seconds like sony..? And another great thing is that 3.5mm jack is still in it. I don't like about removing this jack personally.", "date": "26 Feb 2018"}, {"text": "not big jump from s8...", "date": "26 Feb 2018"}, {"text": "higher megapixel doesn't mean better photo's the processing on the S9 is better than the processing on the S6 so pictures look better on the S9 than on the S6", "date": "26 Feb 2018"}, {"text": "I have a Galaxy S6 and don't want to upgrade Samsung phones due to the less MP camera on all of the Galaxies that follow. What the heck, Samsung?", "date": "26 Feb 2018"}, {"text": "It's just a bit 'meh' really. It's a lovely phone, sure, but not really worthy of upgrading from my S7 Edge. Not at THAT price point. \n \r\nI'll keep that for another year, reduce my monthly bill by going sim only, and wait for the big design change we had all hoped for in 2019. I don't wan't to be stuck on the 's' upgrade cycle if this is Samsung's new approach. ", "date": "26 Feb 2018"}, {"text": "samsung now shaiting them out like nokia back in the day", "date": "26 Feb 2018"}, {"text": "i will not buy this phone.", "date": "26 Feb 2018"}, {"text": "i already stop buying a new coming flagship s series made by samsung because samsung  will never really gives what we wanted to have.stuck with 12mp main camera that has a tiny miny upgrade.3500 mAh battery is enough, the price keep rocketing and last is samsung  will never ever try to learn from the other company to keep their smartphone in right track for a new trend that will coming..just like the old nokia ..always ignore to trend will cost you to collapse..", "date": "26 Feb 2018"}, {"text": "looks the same as s8", "date": "26 Feb 2018"}, {"text": "Yeah, it's February. ", "date": "26 Feb 2018"}, {"text": "Im going for the s9 ;)", "date": "26 Feb 2018"}, {"text": "if the battery is graphene battery ill buy ...not only 1 buy 3...", "date": "26 Feb 2018"}, {"text": "pretty much same as s8 with slight improvements based on complaints, aswell as next gen chip. not worth overpaying 350 eur i'd say.", "date": "26 Feb 2018"}, {"text": "Only if this had 20MP single lens, then I would buy it. ", "date": "26 Feb 2018"}, {"text": "Ever used any edged phone?", "date": "26 Feb 2018"}, {"text": "This phone is perfect. I love its look and specs (except the ram size which I'd prefer 6 GB). This is the best smartphone of 2018 so far. ", "date": "26 Feb 2018"}, {"text": "Too big screen why cant u made smaller screen phones", "date": "26 Feb 2018"}, {"text": "I don t like the size , why all high end phones has to be big . Why not make the s-series smaller ? People who want high end and bigger size they allready has option like s-plus series or note series. But S7 edge, S8 and S9 are really to big , some of us want at least decent size like s6 edge , s7 .   \r\nI don t understand why Samsung high end series has to be big . Some of us want more compact verions.", "date": "26 Feb 2018"}, {"text": "Can't wait for batter test to see if the A55 cores do better than the A53 in the S8 or not. If the score reaches 87h+ it's win situation.", "date": "26 Feb 2018"}, {"text": "I think there is no reason to change the design it's great. Why change something it's already nice. Fingerprint sensor is placed in a more convenient position this time. Battery could have increased but I Samsung did this to save cost. The best part it still have a headphone jack which fantastic. ", "date": "26 Feb 2018"}, {"text": "I think that will be one of the positive love/hate changes. I'd personally like my S8 better if it was a bit more fitted for my hand. Thicker and heavier. Not that the current weight really matters a lot.", "date": "26 Feb 2018"}, {"text": " better to call it S8 2018. \r\nno design change, so useless.  \r\nsame old charger 2.0 huh \r\nthickness 8.5 huh \r\nheavier damn \r\ns9 buyers must be happy. lolz die. huh", "date": "26 Feb 2018"}, {"text": "Yeah but the S9 can record in 4K @ 60fps, while the S8 is \"only\" capable of doing 4K @ 30fps. Not that I'm willing to pay the extra for the small improvements.", "date": "26 Feb 2018"}, {"text": "better to buy S8.. the same, but cheaper", "date": "26 Feb 2018"}, {"text": "12mp. is it the same as s8 and s8+. i cant wait for S9. ", "date": "26 Feb 2018"}, {"text": "My next phone phone. Cant wait for it to be available here in the philippines", "date": "26 Feb 2018"}, {"text": "you got the Plus model for that.", "date": "26 Feb 2018"}, {"text": "i don't like edge , it should have simple also. ", "date": "26 Feb 2018"}, {"text": "Single camera lens? Hello!", "date": "26 Feb 2018"}, {"text": "What kind of design could be better than S8? Even though they don't upgrade much the design from S8, at least they make sure big changes on camera performance.", "date": "26 Feb 2018"}, {"text": "samsung is also behind apple ..... only changing the names ...nothing else\n", "date": "26 Feb 2018"}, {"text": "Slowl motion is useless... \r\nI would prefer Samsung dex software update \r\nFull linux mint working environment. \r\nWith my usb printer", "date": "26 Feb 2018"}, {"text": "Such a uninspired design by the overated brand..\n \r\nGalaxy s6,s7 already fail due to low sale..", "date": "26 Feb 2018"}, {"text": "same crappy s8 design \r\nsame software jimmick", "date": "26 Feb 2018"}, {"text": "I prefer S8 2018! LOL!", "date": "26 Feb 2018"}, {"text": "Beautiful, exynos soc, a beast!", "date": "26 Feb 2018"}, {"text": "Stereo Speakers, Powerful Chip and Headphone Jack... Okay Im gonna upgrade my S8", "date": "26 Feb 2018"}, {"text": "good bye Samsung.... i'm prefer choose iPhone X.", "date": "26 Feb 2018"}, {"text": "No matter what you do you will never please everyone. So please tell us what disappoints you rather than just mouthing off.", "date": "26 Feb 2018"}, {"text": "When you grab best features from other smartphone manufacturers and make a smartphone with all those features, you're getting a really great smartphone &#128513;\n \r\nAnd...\n \r\nWould be much better if these all features were available in a single device :-\n \r\nÂ\u0095 Oneplus's performance(from software optimization) \r\nÂ\u0095 Stereo speakers from Razor phone \r\nÂ\u0095 Probably underscreen fingerprint scanner (Vivo) but we can live without that right? \r\nÂ\u0095 S9's camera hardware looks promising but pixel devices always (yes i think always) come up with a great camera. So Google's camera algorithm (remember pixel 2 takes great photos and the bokeh effect even without a dual camera setup) \r\nÂ\u0095 Mate 10 pro's batery  \r\nÂ\u0095 Oxygen OS/Stock android  \r\nÂ\u0095 Neural processing from huawei (will help on the long run) \r\nÂ\u0095 3D touch from Apple &#128513; \r\nÂ\u0095 Face ID &#128513; (A more reliable version) (and yes we can live without it, but if it's possible it would be great) \r\nÂ\u0095 Water resistance which we already have on samsung galaxy 's \r\nÂ\u0095 Super AMOLED's (already have) \r\nAnd the \r\nÂ\u0095 S pen &#10084;&#65039;\n \r\nHope the note 9 will include at least se of these features...", "date": "26 Feb 2018"}, {"text": "I think it's not so bad....no issue with quick charge 2.0, though indeed quick charge 3.0 is newer, you're should see other specs and features like Bluetooth 5.0, Snapdragon 845, AR emoji etc,  \r\ni think this phone is the best flagship phone. ", "date": "26 Feb 2018"}, {"text": ">Quick Charge 2.0\n \r\nUhhhhh....... Lol? Please tell me that's a joke....\n \r\nEDIT: So I just checked the S7 & S8 and apparently they all still have QC2.0, what??? I always assumed Samsung would use the latest quick charge, which is like QC4.0 or something. Huh weird.", "date": "26 Feb 2018"}, {"text": "8.5mm thick than s8 which is 8.0mm, and also a bit heavier. Won't change to s9 yet", "date": "26 Feb 2018"}, {"text": "Yepp I'm totally agree with u...confirm this year I'll be back for Samsung s9..move on from ios suck battery life", "date": "26 Feb 2018"}, {"text": "aptX only?", "date": "26 Feb 2018"}, {"text": "samsung galaxy s9 use Li-ion or Li-Po battery?", "date": "26 Feb 2018"}, {"text": "Right..always same..only camera improved and cpu..", "date": "26 Feb 2018"}, {"text": "loads better than iPhone X which is more feature phone", "date": "26 Feb 2018"}, {"text": "again exynos cpu not good.", "date": "26 Feb 2018"}, {"text": "The best news to me is that they have kept the headphone jack and with that they have added the FM tuner! Thank you Samsung for understanding our concerns!", "date": "25 Feb 2018"}, {"text": "What more can you expect? Exynos 9810 is really powerful, the most powerful mobile processor so far. Camera is going to be great and has 4K 60 FPS. We don't need 16 core smartphones with 12 GB of RAM. The S9 can be compared to the iPhone X and is probably even better. Battery is 3000 mAH but it always isn't about battery. Software optimizations also need to be good. The S8 lasts longer than the S7 even with same battery capacity and a little higher resolution because of better optimizations. And it's also about the processor. Exynos 9810 is 10 nm and is really efficient while being powerful. ", "date": "25 Feb 2018"}, {"text": "Finally stereo speakers. Thank you!", "date": "25 Feb 2018"}, {"text": "Why is Samsung is so stubborn for making the s9 with single camera? Knowing that most of the new 2018 cell phones are coming with a dual camera. I know that the s9+ have a dual camera but why that isn't in s9?", "date": "25 Feb 2018"}, {"text": "There is FM radio, at least in North America, following a US Congress decision. It was there all along, even on S7 and S6, but was disabled by carriers. So, yeah, it has FM.", "date": "25 Feb 2018"}, {"text": "It should have been named as S8 v 2.0 !", "date": "25 Feb 2018"}, {"text": "Totally disappointed! I expected more, MUCH more after s8 wasn't spectacular at all! At least totally infinity screen... Another Samsung's failure. Too bad, I'm a real Samsung fan :( ", "date": "25 Feb 2018"}, {"text": "If IT has 32 Bit/768kHz was my next phone...", "date": "25 Feb 2018"}, {"text": "Samsung be like \n \r\nAdd Front Speaker Like SONY Do  \r\nAdd Slow mo like SONY  \r\nAdd Animoji Like APPLE  \r\nAdd Translator Like MICROSOFT \n \r\nAND HERE IS ALL NEW S9 ", "date": "25 Feb 2018"}, {"text": "Why would you want FM Radio ???\n \r\nIt's Crap\n \r\nListen to your own music on Spotify or Google play music &#128515;\n", "date": "25 Feb 2018"}, {"text": "Its rubbish ...what is much deffrent between gs7 edge and s9, and y apply and samsung always make larger screen is more faster  then small versions and force peoples to buy large screen", "date": "25 Feb 2018"}, {"text": "Am buying,   am happy I am good  ", "date": "25 Feb 2018"}, {"text": "1080p@60fps???????  1080p full HD video with 480 fps or it is fake!!!!!!!!!!", "date": "25 Feb 2018"}, {"text": "Pretty much the same story for me... I will give sony a chance. But people always say: \"oh sony uses stock poor android, apple way!\" \"Samsung is years ahead of google!\" But actually, IT'S A PHONE! A PHONE! And a PHONE for me means, clean UI, smooth animations, long year support or at least agility, great sound, long lasting battery life(also removable) and durability. I really miss the galaxy s5 and note 4. I really do... hell, since 2016 I started to like apple more than sammy! Just my opinion, don't take it too serious people. Everyone has their own opinion. ", "date": "25 Feb 2018"}, {"text": "Same as s8. Just difference is in camera.", "date": "25 Feb 2018"}, {"text": "These are all ancient artifacts by now, we're buying the phone for the future not for the past.  If you need them for professional use just get a second handset.", "date": "25 Feb 2018"}, {"text": "Maybe in Galaxy S10", "date": "25 Feb 2018"}, {"text": "if the chip is their often xda devs get it working.\n \r\n3.5mm jack ,,yes good move Sammy.", "date": "25 Feb 2018"}, {"text": "I'm with Note 3 because of OLED and IR blaster too.", "date": "25 Feb 2018"}, {"text": "again no fm radio , no ir blaster , no remowanle battery", "date": "25 Feb 2018"}, {"text": "why not fm in world wide/", "date": "25 Feb 2018"}, {"text": "yes! i want the infared light sensor or port back TT\n", "date": "25 Feb 2018"}, {"text": "why not run this to your own tizen os than using a third party android by google, then compete to google and apple. then will see your sales.", "date": "25 Feb 2018"}, {"text": "why not fm in europe?", "date": "24 Feb 2018"}, {"text": "Bring back the infrared port. That's why I am choosing to remain with my S6 Edge and I am sure I am not alone ", "date": "24 Feb 2018"}, {"text": "because it releases for preorder tomorrow", "date": "24 Feb 2018"}, {"text": "I wish they manage to put in screen finger print reader and not have back one.", "date": "23 Feb 2018"}, {"text": "How do they know this is what the phone will look like?.", "date": "23 Feb 2018"}, {"text": "market expect much more form the Samsung because every time the same way introduce the Android 8.0 till now the more then 5 years the Samsung still base on and depend on android and why not going established there own os and as I guess like these giant company its easy make own os and much more ...", "date": "23 Feb 2018"}, {"text": "Still 4gb with ÂÂ\u0080841 price tag? Not acceptable at all. Time to move from samsung.", "date": "23 Feb 2018"}, {"text": "Let me tell you a story. My journey begin with the S6 Active. In the end, I won't forget how knox only made rooting more difficult and my active died due to water immersion. But the specs were good. I decided to purchase the entire VR package for the samsung S7. First of all, it works. (with a little fan to help cooling) You will lose yourself in a unique experiance that you won't find anywhere in this world. But as time goes on, this feature became a gimmick. As a phone, the S7 revealed a nature that ultimately lost all my faith for what this company believes in.  \r\nThe truth is that samsung fans don't believe that there is anything better because samsung market their products extremely well, so well that even I my had trouble to look away. Unfortunately for samsung, I do understand what a true, user-orientated phone can achieve. My first non-apple experiance was a blackberry z10. If you've never tried a z10, I highly suggest that you should give it a go. Their minimalistic approach, followed by a concise point in all their applications resulted in something practical. Swipe up and right and you pretty much have all your emails and text brought up. Swipe up and left opens the menu. Double pressing volume up and down skips a song and battery is swappable so you don't have to worry about it. Unfortunately blackberry now produce junkfood. Should you be interested, just google blackberry z10 virtual keyboard and tell me how nifty is that.  \r\nAs for the S7, the battery simply won't last for a day. It comes bloated with S home, Sgear, S-every where. Regardless if my mother makes a good application, samsung thinks they can make it better. In the end? All the propiotary apps are unable to be removed. An update later will more than likely re-enable them. Samsung-pay beggs you throughout your week to try it and while Samsung finally found out that they needed more cpu power, they just upgrade the main-chip and call it a S8.  \r\nSimply said, I currently have a Sony Xperia xz1 Compact. Clean android performance with a snapdragon 835. A nostagic attempt in trying to bring the compact factor back into android(reminded me my z10 when I saw it in bestbuy) and, to my surprise, it lasts twice as long as my s7. Yes, I forgot to charge it one night and it was avalible the NIGHT OF NEXT DAY.  It doesn't overheat when I needed to run google play and google maps in my car during the summer and thank god that it won't ask me to try samsung pay every sunday.  \r\ntldr for people who still buys a samsung, just give sony or another company a chance. You are going to like the way you look. If you don't look things at a diffrent angle, you are just a pray for the anglerfish.\n", "date": "22 Feb 2018"}, {"text": "Any chance that this phone would also support Windows 10 ARM?  Could be interesting if it does.", "date": "21 Feb 2018"}, {"text": "I really hope they bring back the FM Radio & perhaps the IR blaster simultaneously. That'll be awesome. It should be implemented on all versions of the S9.", "date": "21 Feb 2018"}, {"text": "osum device", "date": "21 Feb 2018"}, {"text": "Lol u actually named urself \"It HAS radio!\"", "date": "21 Feb 2018"}, {"text": "then buy a radio \r\ngenius ", "date": "20 Feb 2018"}, {"text": "So, it is wider than the S8. No thanks. ", "date": "20 Feb 2018"}, {"text": "They say it HAS FM Radio built in!   \n \r\nBut I still miss the IR blaster, must have.  Stupid manufactures.", "date": "20 Feb 2018"}, {"text": "No fm radio !!! \n", "date": "19 Feb 2018"}, {"text": "Release date \r\nSamsung has confirmed that the Galaxy S9 and S9 Plus will launch on 25 February at MWC\n ", "date": "19 Feb 2018"}, {"text": "Good job you told me as I haven't known that for years........", "date": "19 Feb 2018"}, {"text": "lol no point in beating A10 because it's last years SoC", "date": "18 Feb 2018"}, {"text": "It is due to DRAM memory. Sony only puts 1GB DRAM which only could manages 960fps for only 0.2 seconds long. Sony itself can make it longer like 1 second, but it'll need lower FPS because lower frame rate, longer duration could be recorded or otherwise. To make longer duration at a same time higher FPS, it should be packed bigger DRAM memory size. It's very hard to explained it more detail, but you can learn about it from any reliable sources like Wikipedia about how DRAM works.", "date": "18 Feb 2018"}, {"text": "What's the point when the record time is so limited.", "date": "18 Feb 2018"}, {"text": "52mm for 2x optical zoom, maybe same as Note8.", "date": "18 Feb 2018"}, {"text": "It's not about the processor that determined the ability to capture slow-motion video. It's about the DRAM chips that dedicated on camera sensor. Moreover, 480fps is not enough, it should be more than 1000fps because they're in way to beat Sony's Motion Eye camera.", "date": "18 Feb 2018"}, {"text": "I expect two S9 models, the Galaxy S9 with 4GB RAM and S9+ with 6GB RAM", "date": "18 Feb 2018"}, {"text": "Exynos version has beat A10 fusion nice Samsung keep it up ..hope ur chipset can beat apple one day", "date": "18 Feb 2018"}, {"text": "Don't buy it early when release..just wait for few month n price will huge drop then buy it", "date": "18 Feb 2018"}, {"text": "Yes", "date": "17 Feb 2018"}, {"text": "This is bullshit,it has dual cameras not only one and the CPU is wrong,its not snapdragon,its exynos 9000 series, also the s9+ will have 6B ram also i'm pretty sure the GPU will be Mali and Adreno,not only Adreno.", "date": "17 Feb 2018"}, {"text": "The price will be 850 euros in Europe?  Is that true?  Thanks ", "date": "16 Feb 2018"}, {"text": "what is the focal length of the secondary camera?", "date": "16 Feb 2018"}, {"text": "4 GB RAM....for a 2018 phone.Why Samsung.", "date": "15 Feb 2018"}, {"text": "has ha", "date": "15 Feb 2018"}, {"text": "because Samsung is a Premium phone. So don't compare it to those cheap China brands. not all Android phone are the same.. But if you know it, Spec wise and feature wise, Samsung is far more better and cheaper compare to the latest iPhones.. \r\nif you cannt afford to buy one, then stick to the brands which suites your budget...", "date": "15 Feb 2018"}, {"text": "As the s9 has the lastest snapdragon 845.. it should be able to record videos 4k with 60 fps, 1080p with 240fps and 720p with 480 fps. Only if the camera sensor supports it tho.", "date": "14 Feb 2018"}, {"text": "Samsung 8 costs $500 less than an Iphone X. The most recent phones.", "date": "14 Feb 2018"}, {"text": "You were wrong. It is not the ratio that makes phone smaller, it is because bezel size. S8 with 5.8 inch slightly smaller than S7 edge with 5.5 inches. I put my friend S8 side by side with my S7, my S7 still little bit smaller. I wonder how much small if they make bezelless on 5.1 inches like my Galaxy S7....it would be very pocletable and at same time, you get 5.1\" in a compact 4.7\" inches phone. Perfect!", "date": "14 Feb 2018"}, {"text": "samsung phone is overpriced compare to other china brand phone.samsung still in 64gb rom and 4gb ram that wouldnt enough for me.samsung quick charge 2.0 is really outdated .i wish samsung can reduced the price of s8 and s8+ then i will buy it", "date": "13 Feb 2018"}, {"text": "If you want a laugh compare the s8 and s9 specifications side-by-side and drink every time they are the same...", "date": "13 Feb 2018"}, {"text": "one S....kidding, better camera, processor and face detection software, the main point will be the camera which is rumored to be dual in the S9+", "date": "13 Feb 2018"}, {"text": "agreed, people stuck with Apple dont want to admit it. Apple is no value for money but still resale is easier than any android", "date": "13 Feb 2018"}, {"text": "wat arer the differences between s8 and s9??", "date": "12 Feb 2018"}, {"text": " Is it just me, or does this phone look like a LG G6??", "date": "12 Feb 2018"}, {"text": "No , the 5.8\" with 18.5:9 is very small and 5.1\" with 16:9 is larger than that , if you see the galaxy s8 you will understand", "date": "12 Feb 2018"}, {"text": "Rather have a Super Amoled + screen at 1080p like on Sammy Bada Wave that was superb screen.", "date": "12 Feb 2018"}, {"text": "They do not need a mini version the phone is already small in your hands it looks like a 5-inch phone that's my opinion", "date": "11 Feb 2018"}, {"text": "You know that the size of that phone with 5,8 inch screen is about the same as your S7. \r\nIt's because of these stunning bezzels.", "date": "11 Feb 2018"}, {"text": "I hope Samsung makes mini version for this one. I want a phone that could fit on my pocket. At least make around 5 inch or lower until 4.5 inch it's enough pocketable. That's why I still sticked with my Galaxy S7 5.1 inch phone.", "date": "11 Feb 2018"}, {"text": "It's a lot early for this to pop up there.", "date": "11 Feb 2018"}, {"text": "Two variant for this one, exynos 9810 and snapdragon 845", "date": "10 Feb 2018"}, {"text": "where is exynos..gone?", "date": "10 Feb 2018"}, {"text": "Not a fan of the asymmetry but if they had to do it, at least it's the bottom bezel that's trimmed and not the top unlike the ugly mi mix and the sharp aquos. Still, the note8 already appears to be much more worth the price tag if leaks are to be believed. ", "date": "09 Feb 2018"}, {"text": "Not wasting a 1000dollars on this. I just buy an iphone if im gonna spend a thousand dollars on a phone", "date": "09 Feb 2018"}, {"text": "Note 8 will beat s9+ too but if u have s6 or s7 the S9 will be a worthy upgrade", "date": "09 Feb 2018"}, {"text": "More of 4gb of RAM you said useless? Maybe now... But who knows in the 2 or 3 next year...? Technology must be developed and so do android...  Maybe next android will need 2gb or more of RAM in minimum specifications... ", "date": "09 Feb 2018"}, {"text": "Nothing new here..Just more of the same if not slightly better than S8.. Note 8 beats both hands down. ", "date": "09 Feb 2018"}, {"text": "There can never be too much ram.", "date": "09 Feb 2018"}, {"text": "Yup", "date": "09 Feb 2018"}, {"text": "Yeah u ment *note 8", "date": "09 Feb 2018"}, {"text": "I want to see Samsung's claims  \r\nDouble single core  could reach the high 3000s\n \r\nAnd 40 percent improvement in multi core \r\nSo s8 ,note 7 us about 6400-6600  so i expect high 8000s maybe even 9000\n \r\nThe snapdragon 845 leaks show over 8000  \r\nBut who knows\n", "date": "09 Feb 2018"}, {"text": "What you talking?You are not using even the half of that ram.There are pcs with 4gb ram.More than 4gb ram is useless ", "date": "08 Feb 2018"}, {"text": "who ever said apple are the king of smart phones you need give your head a wobble apple is all about £££££ Samsung are easy top dog of smart phones", "date": "08 Feb 2018"}, {"text": "Better to stick with S8 Nothing Special here....!!!", "date": "08 Feb 2018"}, {"text": "Will there be purple one for S9 for sure ,anybody knowing this?..If it will then i can wait for purple; my favourite colour , otherwise i wouldn't because i have to get a new phone (using mine for 5 years).But my situation is exceptional ,people in need for a new phone urgently ,do not wait it ofcourse , as there is nothing much additional..", "date": "08 Feb 2018"}, {"text": "4gb ram in a flagship year after year after year....this is a joke!!! this is why I bay OnePlus for past 3years.\n \r\n4gb is great for capturing selfies and thats all! \r\nIt has processor good enough to guide a spaceshuttle trough solar system but cant remember a thing. \r\nIt's like giving wasted person a Ferrari to drive back home....what's the point?! \r\nSamsung embarrass itself same like LG did with G5. \r\nPeace", "date": "08 Feb 2018"}, {"text": "It's look like LG G6...!  What a brilliant idea Samsung with  higher price than last year S8 and design look like LG G6...! Your decision make you look like a copycat from iphone ideas....", "date": "08 Feb 2018"}, {"text": "  Wish Samsung would include an IR Blaster again.", "date": "08 Feb 2018"}, {"text": "wasted your time and money when you already have S8 swap to S9 jusy because they put fingerprint under the lens camera.", "date": "08 Feb 2018"}, {"text": "this phone is awesome in 2018", "date": "08 Feb 2018"}, {"text": "Yeah have fun for wasting almost a 1000 dollars just good for 1 year", "date": "08 Feb 2018"}, {"text": "Dear samsung you are only good to look at...but you so suck by a large largin....people are damn rite saying that android phones slow down after some time and samsung is one of them.....even my note 8 lags when you boot it and connect to the internet....the display freezes sometimes and app closes back and forth....i think im gonna optfor the upcoming iphone Xl plus....apple is the king of all smartphones!!!", "date": "07 Feb 2018"}, {"text": "Lol", "date": "07 Feb 2018"}, {"text": "You forget to mention the fingerprint reader under screen. ", "date": "07 Feb 2018"}, {"text": "looking forward for the sexiest galaxy phone ever!!!", "date": "07 Feb 2018"}, {"text": "Aspect ratio now more awkward.", "date": "07 Feb 2018"}, {"text": "Come on sammy if you are releasing a flagship phone give us some unique design. Let's see what happens. I am counting on Nokia. They are the game changer!", "date": "07 Feb 2018"}, {"text": "Battery endurance to snapcrocodile is a few better", "date": "07 Feb 2018"}, {"text": "it is simple bullsh*t", "date": "07 Feb 2018"}, {"text": "Why a smartphone must be too long? Because the foldable phone is coming to blow away 18:9, such marketing isn't a great idea! ", "date": "06 Feb 2018"}, {"text": "super flop ", "date": "06 Feb 2018"}, {"text": "Seriously? Not such occurrence on my Galaxy S8, hell it lagged on my old LG G5. Qualcomm Snapdragon is more prone to that than Exynox, maybe your phone is is either low or midrange or just trolling.", "date": "06 Feb 2018"}, {"text": "Samsung exynos chipset not good for videos and games. (hanging,restarting and over heat).", "date": "06 Feb 2018"}, {"text": "What you mean minor changes? Did you even hear what the performance of the new Exynos chipset will be", "date": "05 Feb 2018"}, {"text": "I mean wth. Its just duplicate of samsung galaxy s8 with minor changes like chipset and reduction of battery. S8 is that you :/ ", "date": "05 Feb 2018"}, {"text": "Yup, I'm also thought the same, I think it's better to buy Note8 than S9. 6GB RAM vs 4GB RAM, dual camera vs single camera, additional S Pen. The processor just a little changes on some particular things, additional AI or machine learning and about 40% more powerful on S9. But SD835/E8895 was beast enough to have a powerful for daily tasks and gaming purposes.\n \r\nFor people who appreciated user experience, Note8 is better choice than S9.", "date": "05 Feb 2018"}, {"text": "Ram to be 6gb which may lead next 2 years sorry samsung", "date": "05 Feb 2018"}, {"text": "Only 4gb ram for a flagship in 2018, thats will not be enough for next 2,3 years. IÂ\u0092m going to buy some other brand first time, thanks samsung.", "date": "05 Feb 2018"}, {"text": "Hey al I m using iphone x seriously speaking I never liked iphones but X is something different..but I have an option of buying sam sung s9 plus wehen it comes to India..here my question is it gud to change from x to s9 plus..give me ur opinions ", "date": "05 Feb 2018"}, {"text": "Galaxy G9..lol", "date": "05 Feb 2018"}, {"text": "Welp the battery capcity was rumored to be 3100-3300, but sadly its just 3000, considering they used the new chipset which wont be So power efficent, will be -1 to -2 hours less than the s8. I am NOT a hater but if you in for the battery chose s8 or s7 (i personaly u use s7 and dont wanna swich)", "date": "04 Feb 2018"}, {"text": "but, its samsung, dude.", "date": "04 Feb 2018"}, {"text": "I was expecting the specs to be higher like: \r\n1. 128GB internal storage. \r\n2. Dual Rear camera similar to note 8. \r\n3. 4,000mah battery.\n \r\nBut if it would have the same specs as last years phone. And the only changes are the camera and the processor? I would rather buy the last years phone.", "date": "04 Feb 2018"}, {"text": "Well, to be sure, we have to wait a bit more and eventually see what exactly it will include and what not (specs wise). But currently, it doesn't give the impression that it will be worth it an upgrade from the Note 8 (not even S8+), (4 ordinary working class guys).", "date": "03 Feb 2018"}, {"text": "Really Do Not Buy it ! if you have the previous models. Really !", "date": "03 Feb 2018"}, {"text": "I see nothing special, RAM 4gb is not enough, battery 300mAh also not enough", "date": "03 Feb 2018"}, {"text": "i am not going to buy samsung S9 this year,the model s9 look same as s8 \r\nand i hate brixby button.come on samsung ", "date": "03 Feb 2018"}, {"text": "The company is hyping the event with a video teaser that promises a Â\u0091reimaginedÂ\u0092 camera. The word on the street is that the S9 will feature the companyÂ\u0092s new ISOCELL sensors, which are detailed on SamsungÂ\u0092s site. Get More Samsung Galaxy S9 Reviews Get More Samsung Galaxy S9 Reviews", "date": "03 Feb 2018"}, {"text": "they are good at copying.", "date": "03 Feb 2018"}, {"text": "Good design and parts but power is more concern.  Atleast 4000mah batt for powerful chipset.", "date": "03 Feb 2018"}, {"text": "Google Pixel 2 XL copy :P ", "date": "02 Feb 2018"}, {"text": "Baterry must  be min 4000 mAh and with 6gb ram/ for 64 gb/. It's the same like S8!!! People needs from strong battery!!!", "date": "02 Feb 2018"}, {"text": "Only 3000 mAh battery?!?! :O What the Fudge?!? Will they use 2500 mAh next time? :|", "date": "02 Feb 2018"}, {"text": "A lot of people are on a 24 month contract, plus if phones were to change so greatly in one year, they'd 100% run out of ideas, people will non stop claim and want more and more. There's only so much you can do with the factor form of a 16:9 or 18:9 shape. ", "date": "02 Feb 2018"}, {"text": "And multi core could reach 8800-9100 geekbench \r\n This is Samsung claiming this   hopefully it's quite true", "date": "02 Feb 2018"}, {"text": "exynos 9810 much better performance  \r\n40% better multi core  \r\nDouble single core \r\nIt'll be around 3800-4000 single ckre\n\n\n", "date": "02 Feb 2018"}, {"text": "They is", "date": "02 Feb 2018"}, {"text": "why is there no radio and the camera is only 12mp ?", "date": "01 Feb 2018"}, {"text": "Its meant to be 6 GB, maybe there is a base model with 4 GB not sure bout that.\n", "date": "01 Feb 2018"}, {"text": "phone is releasing in 15 days.  ", "date": "01 Feb 2018"}, {"text": "S8 Looks more attractive then S9... ", "date": "01 Feb 2018"}, {"text": "\"Unofficial preliminary specifications\" \r\nStatus: Rumoured\n \r\nLet's not complain.", "date": "01 Feb 2018"}, {"text": "Why only 4GB ram?", "date": "31 Jan 2018"}, {"text": "phones now are for giants", "date": "31 Jan 2018"}, {"text": "so it isnt with infinite display anymore??", "date": "31 Jan 2018"}, {"text": "Yes, and also on RAM. Samsung should start at least on 6GB RAM for non-plus version and 8GB RAM for plus version. 4GB RAM on 2018 seems retarded while on last year 2017, most of brands start using 6GB RAM on their flagships.", "date": "31 Jan 2018"}, {"text": "If money is not a problem, then wait", "date": "30 Jan 2018"}, {"text": "The problem with samsung high end phone like s8, note 8 is their poor battery backup... Though they have fast charging, but for that you always have to carrey a charger or power bank, where as lg v30+, oneplus 5t, google pixel 2 xl even iphone x have really good battery backup... ", "date": "30 Jan 2018"}, {"text": "samsung S9 is for 2018 with snapdragon 845 but not that popular because it is launching in early 2018 and since note 8 was release few months ago. It does not give a strong impact so if you want to save cost then go for LG V30+ instead since samsung S9 going to cost about USD 800-900+", "date": "30 Jan 2018"}, {"text": "I love iris scanner on S8 so much. work really good and fast. but i don't understand why on the S9 just have one lens...Camera should be the same like S9 plus just different about the screen is enough. Please don't try to copy Apple. you did really good.", "date": "30 Jan 2018"}, {"text": "LG V30", "date": "30 Jan 2018"}, {"text": "There is a dedicated MicroSD Slot", "date": "30 Jan 2018"}, {"text": "They could at least give a dedicated microSD slot....", "date": "30 Jan 2018"}, {"text": "Maybe someone can help me.. now I'm about switching my phone, should i wait for S9 or get an LG V30+ ? ", "date": "30 Jan 2018"}, {"text": "Not that much difference with its predecessor, just one thing that S8 was gorgeous and this design stand them among other crowd. Processor is definitely top notch. But no underscreen fingerprint sensor and no dual camera makes no sense for world leader smartphone manufacturer's flagship in 2018. Hope this camera is as good as Pixel 2's camera, and enough to kick out fruit company's crap-phone from market.", "date": "29 Jan 2018"}, {"text": "Actually this is a bigger upgrade compared to the S8 which wasnt that new compared to the S7", "date": "29 Jan 2018"}, {"text": "well might be worth a look if you got the s7 or earlier but otherwise leave it alone", "date": "29 Jan 2018"}, {"text": "Not much new \"technical toys\" compared to the S8 to warrant an upgrade or new purchase and be milked by Sammy in the process.\n \r\nI'll be more interested in what LG is offering this year.", "date": "29 Jan 2018"}, {"text": "AMEN", "date": "27 Jan 2018"}, {"text": "Just changed the fingers print sensor position", "date": "26 Jan 2018"}, {"text": "Hello s8 2018 edition", "date": "22 Jan 2018"}, {"text": "Hope to see the [IR Blaster] on all mobiles", "date": "21 Jan 2018"}, {"text": "I am a happy note owner. (waiting for the S9 Though) and You can remove quite a lot of their bloatware. ", "date": "21 Jan 2018"}, {"text": "do note the \"b\"'s size. you are referring to GB. (GigaBYTE) and not Gb (GigaBIT). as BIT is eighth of byte. \r\n128 Gb SD card is 16 GB.", "date": "21 Jan 2018"}, {"text": "If S9 and Note 9 will have simmiliar design as it show here.I will get Note 8 instead of this.This looks ugly.Btw I know it will not going to look like this!But If it really happend I'm sorry Samsung...", "date": "19 Jan 2018"}, {"text": "Easy, just pop in a 128Gb uSD card and make it 192Gb", "date": "17 Jan 2018"}, {"text": "People have been asking Samsung not to slow down the phone with TouchWiz and useless bundled apps or at least allow users to easily remove those themselves. Samsung is not listening so I got myself 1plus5 as an alternative to S8 and i'm very happy with it. ", "date": "17 Jan 2018"}, {"text": " I have been seeking new, concrete evidence discussing the inclusion of 4x zoom in the S9.  \r\n I have yet to find any in 2018. When I do, I will update.", "date": "16 Jan 2018"}, {"text": "Only 64GB internal memory in 2018 for such a phone??? no way too small... make it 128Gbs\n", "date": "15 Jan 2018"}, {"text": " Last year, a 6gb ram version of the S8+ came out.", "date": "13 Jan 2018"}, {"text": "The specs are just rumored ", "date": "13 Jan 2018"}, {"text": "Becoming another great device of Samsung S9 and the screen 5.8\" is just perfect. I wish to see next new Galaxy note 9 with the same screen size come bezel less display too.. all the best & cheers to Samsung & Andriod ", "date": "13 Jan 2018"}, {"text": "Only 4 GB of RAM?? I would have loved for it to be 6 GB of RAM or 8 GB RAM. I'll stay with my S7 no big inprovement only the 64 GB of memory the rest is almost the same. No change at all. ", "date": "13 Jan 2018"}, {"text": "there is a big difference", "date": "12 Jan 2018"}, {"text": "Very sad to see, that the microSd slot has to be shared with SIM2, and no 128GB + 8GB. \n \r\nOld news in a new box. ", "date": "10 Jan 2018"}, {"text": "Has the same display as the Galaxy S8, a bit faster chip, dual camera on the Galaxy S9 Plus and possibly more internal storage. If I had a Galaxy S6 or S7 it would be worth a look but for me there aren't enough improvements over the Galaxy S8 to consider upgrading. ", "date": "10 Jan 2018"}, {"text": "no !", "date": "10 Jan 2018"}, {"text": "I have S8 now.\n \r\nDoes it have meaning to replace S9?", "date": "10 Jan 2018"}, {"text": "How can they be so sure this will be the looks?", "date": "08 Jan 2018"}, {"text": "Hi! I don't see 4x zoom on that list.", "date": "08 Jan 2018"}, {"text": "SAMSUNG NOTE 9 \r\nUnofficial preliminary specifications\n \r\nNETWORK\tTechnology\t \r\nGSM / HSPA / LTE \r\nLAUNCH\tAnnounced\tNot announced yet \r\nStatus\tRumored \r\nBODY\tDimensions\t- \r\nWeight\t- \r\nBuild\tFront/back glass (Gorilla Glass 5), aluminum frame \r\nSIM\tSingle SIM (Nano-SIM) or Hybrid Dual SIM (Nano-SIM, dual stand-by) \r\n \t- Samsung Pay (Visa, MasterCard certified) \r\n- IP68 certified - dust/water proof over 1.5 meter and 30 minutes \r\nDISPLAY\tType\tSuper AMOLED capacitive touchscreen, 16M colors \r\nSize\t5.8 inches, 85.4 cm2 \r\nResolution\t1440 x 2960 pixels, 18.5:9 ratio (~568 ppi density) \r\nMultitouch\tYes \r\nProtection\tCorning Gorilla Glass 5 \r\n \t- 3D Touch (home button only) \r\n- Always-on display \r\nPLATFORM\tOS\tAndroid 8.0 (Oreo) \r\nChipset\tQualcomm Snapdragon 845 \r\nCPU\tOcta-core \r\nMEMORY\tCard slot\tmicroSD, up to 256 GB (uses SIM 2 slot) - dual SIM model only \r\nInternal\t64 GB, 4 GB RAM \r\nCAMERA\tPrimary\t12 MP (f/1.6, 26mm, 1/2.5\", 1.4 µm, Dual Pixel PDAF), phase detection autofocus, OIS, LED flash \r\nFeatures\tGeo-tagging, simultaneous 4K video and 9MP image recording, touch focus, face/smile detection, Auto HDR, panorama \r\nVideo\t2160p@30fps, 1080p@60fps, HDR, dual-video rec. \r\nSecondary\t8 MP, f/1.6, autofocus, 1440p, dual video call, Auto HDR \r\nSOUND\tAlert types\tVibration; MP3, WAV ringtones \r\nLoudspeaker\tYes \r\n3.5mm jack\tYes \r\n \t- 32-bit/384kHz audio \r\n- Active noise cancellation with dedicated mic \r\nCOMMS\tWLAN\tWi-Fi 802.11 a/b/g/n/ac, dual-band, Wi-Fi Direct, hotspot \r\nBluetooth\t5.0, A2DP, LE, aptX \r\nGPS\tYes, with A-GPS, GLONASS, BDS, GALILEO \r\nNFC\tYes \r\nRadio\tNo \r\nUSB\t3.1, Type-C 1.0 reversible connector \r\nFEATURES\tSensors\tIris scanner, fingerprint (rear-mounted), accelerometer, gyro, proximity, compass, barometer, heart rate, SpO2 \r\nMessaging\tSMS(threaded view), MMS, Email, Push Mail, IM \r\nBrowser\tHTML5 \r\n \t- Samsung DeX (desktop experience support) \r\n- Fast battery charging \r\n- Qi wireless charging \r\n- ANT+ support \r\n- Bixby natural language commands and dictation \r\n- MP4/DivX/XviD/H.265 player \r\n- MP3/WAV/eAAC+/FLAC player \r\n- Photo/video editor \r\n- Document editor \r\nBATTERY\t \tNon-removable Li-Ion battery \r\nMISC\tColors\tVarious", "date": "08 Jan 2018"}, {"text": "the iT Philosophy head  \r\nSamsung S9 and S9 plus is similar to Note 9 \r\nspecification is same  \r\nreviews  \r\nCRYSTAL LED LCD glass and Lenses  \r\n4DX Theatre version and 4K touchscreen ", "date": "08 Jan 2018"}, {"text": "I understand. Thank you.", "date": "06 Jan 2018"}, {"text": " I will look. I remember that the allegation was that Samsung was working on developing 4x zoom for it's (flagship potentially) cameras, although the article I read, in retrospect, may not have indicted that the tech would be available for the S9 duo. Again, I will provide a link if and when I encounter the info again. Today is January 6 fyi. The article I read was from the summertime of 2017. ", "date": "06 Jan 2018"}, {"text": "The s9+ is rumoured to have a dual camera like the note 8 and the regular s9 will have a single camera. ", "date": "02 Jan 2018"}, {"text": "pretty much", "date": "02 Jan 2018"}, {"text": "S5=S4", "date": "31 Dec 2017"}, {"text": "Does the regular S9 have to have a single camera unlike the S9+?", "date": "30 Dec 2017"}, {"text": "s9=s8; s7=s6. Guess I'll have to wait another year...", "date": "30 Dec 2017"}, {"text": "its revolutionary you cake face....unlike other brands Samsung has a distinct of being the super social and its those small features that it has that makes it what it is ....you cant expect all phones to be the same that's ridiculous!!!", "date": "30 Dec 2017"}, {"text": " Samsung Galaxy S9 has really got good specs, waiting for its launch eagerly ", "date": "29 Dec 2017"}, {"text": "Maybe but its samsung speciality to fail with everything they call an innovation. \r\nLike curved screen iris scanner 4k display etc.  \r\nAll theses have no future in a real phone and are useless for a human kind. ", "date": "29 Dec 2017"}, {"text": "Curved screen is maybe even worse mistake.  \r\nResistant to screen cover slippery in hand and a feature where text running on bottom of your screen is definitely ugly. Also i forgot to mention it cost much more than a flat screen so BIG NO.  \r\nIf a curved screen or apple notch means innovation i would like to come back to stone age.  \r\nOld fashioned Nokia 3310 from 2000 was more innovative than these new ugly bathroom bricks. ", "date": "29 Dec 2017"}, {"text": "Wow, that 4x zoom part sounds great. I never heard about that rumor, but I read about mobile tech everyday. Do you have a source link?", "date": "29 Dec 2017"}, {"text": "I hope they would make it smaller. S7 edge and S8 was to big . People who want bigger screen can buy the plus version , some of us don t like big phones, i don t need a phone to be like a tv , i want to be at least decent size like s6 , s6 edge and s7 ( the last s-eries decent size)", "date": "29 Dec 2017"}, {"text": " Not sure about those things.  However, I have heard that the S9 and/or S9 Plus camera(s) will come equipped with 4X zoom. I hope they both get it.", "date": "29 Dec 2017"}, {"text": " I know a cellphone shop manager. He told me the same thing.", "date": "29 Dec 2017"}, {"text": " The curves aren't my cup tea on the s6 edge nor the s7 edge. Larger batteries are cool (ie s7 vs. s7 edge's slightly larger battery),  but taller and wider displays could eat into battery life.", "date": "29 Dec 2017"}, {"text": "Despise the edge. had one, sold it bought a standard s7. ", "date": "27 Dec 2017"}, {"text": "edge screen is easily breakable", "date": "26 Dec 2017"}, {"text": "How do you know? do you have a source?", "date": "25 Dec 2017"}, {"text": "they have said that from S8 and onwards there is ONLY the edge variant. as they saw the EDGE Version is more successful in the S6 and S7 arc. ^^;", "date": "25 Dec 2017"}, {"text": "Please dont do an EDGE screen model only", "date": "25 Dec 2017"}, {"text": "they promised us the future is foldable phones. how are we getting the same boring slab design for s9.", "date": "24 Dec 2017"}, {"text": "This is not a real picture, only render, but probably the S9 will look very similar to the S8.", "date": "24 Dec 2017"}, {"text": "Will the S9 rock the new 24 MP Samsung camera sensor? What do you think guys? Or the Note 9 will have this? Or both the Note 9 and S9+?", "date": "24 Dec 2017"}, {"text": "Same design, no stereo speakers, too bulky, s8 with very minimal changes..no thanks", "date": "24 Dec 2017"}, {"text": "is really s9? \r\nsamsung kidding people? \r\ni see s8 with some changes like one plus5 and one plus5T. \r\ni think after s7 edge Samsung only work on mid range an low end  smart phone for more benefit only . \r\nafter this we must see technology on china brand like huawei with real prices. \r\nif nokia and sony Ericson available until yet strongly and work, Samsung brand available only in south Korea. \r\nchina barand take only product prices not like Samsung and Apple. \r\nso we will see very soon china brand will be success and two this   company with this society for producing and selling is only losers.", "date": "23 Dec 2017"}, {"text": "Yeah I got that by following your comments here. \r\nAnd I was trying to tell you that I don't think Samsung will make the Note7 mistake ever again.", "date": "23 Dec 2017"}, {"text": "There will be no S9, like there is no iphone 9, or windows 9. It will be s10 or sX", "date": "23 Dec 2017"}, {"text": "Dont know what you talk about but i dont like Samsung brand either. ", "date": "23 Dec 2017"}, {"text": "No sir. \r\n\"Only the less attentive gets trapped twice by the same trap at the same spot.\"", "date": "23 Dec 2017"}, {"text": "Number 9 is considered as bad number.  \r\nSo we can expect Note 7 problems or worse. ", "date": "23 Dec 2017"}, {"text": "1000 eur for a phone and good buy? You are funny.  \r\nMy Moto X4 does the same for 380 eur. Thats a good buy. ", "date": "23 Dec 2017"}, {"text": "Only major upgrade will be price.  \r\nAnd as expected from Samsung it will start at 1000 eur.", "date": "23 Dec 2017"}, {"text": "Samsung is always same.  \r\nSame phone new chipset and +200-400 eur. \r\nThanks no. ", "date": "23 Dec 2017"}, {"text": "Number 9", "date": "23 Dec 2017"}, {"text": "I'm glad I got note8 that still best phone.. good buy then I wait next one if major upgrade then think about but gn8 still great all the way  ", "date": "23 Dec 2017"}, {"text": "It won't be major upgrade as it just minor like few change still much same as s8 the next time major upgrade due start from 2020 or 2021...  nothing change just few upgrade..", "date": "23 Dec 2017"}, {"text": "WHY (uses SIM 2 slot). why not dedicated slot", "date": "23 Dec 2017"}, {"text": "Well.Samsung always makes great phones in the flagship section.But the ram and everything else remained the same.Except for the chipset of course.Would have been better with 6 gb ram and 16 mp camera but,oh well.No dual cameras except on the plus model too.", "date": "22 Dec 2017"}, {"text": "What is new?", "date": "22 Dec 2017"}]