[{"text": "I agree with you but looking at how overpriced other vendors with msm8996/msm8998 are this seems to be \"cheap\" by comparison - unfortunately.", "date": "02 Mar 2018"}, {"text": "In MWC you heard about the top brands like a Samsung, Huawei, LG, Sony, and other. But there are dozens of emerging brand showing off their innovative device as well. I saw too many similar designs with equally matched features and quality. Just like an iLA Silk and  ZTE Blade V9. If you see the design of both upcoming smartphones you will be not able to define company brand. let's wait for price and official launch. ", "date": "27 Feb 2018"}, {"text": "Shame it doesn't have USB C", "date": "27 Feb 2018"}, {"text": " Seriously, $300 for sd450? What a joke.", "date": "25 Feb 2018"}, {"text": "Why downgrade from snapdragon 625 to 450? ", "date": "25 Feb 2018"}, {"text": "Well we will see. ", "date": "08 Feb 2018"}, {"text": "Snap 450 is more than enough.With 4 gb will doing every job very well.This phone is also very nice, good cameras.With price below 200 $,this will be great deal.", "date": "07 Feb 2018"}, {"text": "i was shocked at first 2 know its still not announced when its here please tell us why or its just a big mistake if it is please correct it cause people who loves this phone will be hingly confused like me , if this is just a miss understanding im sorry but you also need to explain yourselves , cause i want to buy this phone , tell us when this will be out .", "date": "25 Jan 2018"}, {"text": "lol", "date": "15 Jan 2018"}, {"text": "I Do Only Nice Telephone  \r\nCause All Rare Extra gb \r\nAlso Shimmer Handset  Is Toally awesome  \r\nnow only read the capitalized letters  jajaja \n", "date": "09 Jan 2018"}, {"text": "If the price is below 200 dollars, it will be a great deal.", "date": "08 Jan 2018"}, {"text": "Well we will see.  \r\n4GB ram looks promising camera too.  \r\nColour is also nice. ", "date": "08 Jan 2018"}, {"text": "Just wait for it's release starting price whether its worth it...", "date": "08 Jan 2018"}, {"text": "Strange phone.  \r\nDoesnt looks bad but why only 450 snap as CPU? \r\nIts a new era to offer a midranger with an entry level chipset?", "date": "03 Jan 2018"}]