[{"text": "Perfect phone, excellent job google. Goodbye Iphone I've been using it for 8 years and it's a total cr*p. Google is google.", "date": "11 Apr 2018"}, {"text": "This is not to do with any issue with the microphone.  The implementation of Voice over LTE is faulty, ask your carrier to disable this feature for your personal service on their end and you will once again have a steady connection for your calls, albeit a less hi-fidelity one.\n \r\nGarbage phone.", "date": "08 Apr 2018"}, {"text": "Hi guys :) need help pls.Do I need to buy a software protection and anti virus after the  warranty finishes? And what is the worst thing of this phone? Thanks.", "date": "05 Apr 2018"}, {"text": "It's better to iPhone no hanging speed procceror camera fantastic I already used iPhone no clear in camera . totally fantastic phone hatts off Google phone manufacturer...", "date": "03 Apr 2018"}, {"text": "This is a Google Pixel's opinion page", "date": "28 Mar 2018"}, {"text": "Amazing phone!!! Love ir.. It's been 2 years of the phone already but this never gets old! Amazing pictures, very fast and smooth(Snapdragon magic) and this phone made me realize that Android is so much better than apple! Pure Android phone. Android lovers should definitely get this phone and Android haters back off.", "date": "26 Mar 2018"}, {"text": "Never buy Google phones. Their updates are full of bugs. Every update creates a new problem. Example is the Feb and March 2018 update. Worst support. This is not a flagship phone at all.", "date": "25 Mar 2018"}, {"text": "My phone had a problem with the display 2 months after I bought it. The support team took it, and after 2 weeks without offering any reason said that it would cost me 15000 as  there was a hardware damage which is not covered by warranty. Which I paid. \n \r\nThey took 2 more weeks,  brought the phone back and the phone was not charging this time. \n \r\nThey have taken the phone once again to have it fixed  and I am waiting for the second time...  I bought this phone because i am a  fan of Google services like most people and this has been a very very disappointing experience with both their product and more than that their service.", "date": "24 Mar 2018"}, {"text": "IPhone 7/8/X should be compared with Pixel 2. And IPhone should be of better value than Pixel. \r\nIf you are going for Pixel 2, that's a better choice.", "date": "24 Mar 2018"}, {"text": "Hi guys I can't pick between the goole pixel and the iPhone 7 please help  \r\nThank You", "date": "23 Mar 2018"}, {"text": "Very bad phone mic PCB saund not work ", "date": "11 Mar 2018"}, {"text": "The second one came from the top of the phone, base on what I know...", "date": "08 Mar 2018"}, {"text": "I own one, can confirm", "date": "06 Mar 2018"}, {"text": "i am unable to connect wifi.  \r\nStuck on \"Obtaining IP Address\" \r\nStatic IP also not working. please suggest if someone is facing and have solutions.", "date": "27 Feb 2018"}, {"text": "It does not have dual speakers. Right one is the microphone, left is the speaker.", "date": "15 Feb 2018"}, {"text": "Allegedly, it's not meant to work: \n \n", "date": "14 Feb 2018"}, {"text": "Right speaker not working, pls suggest", "date": "04 Feb 2018"}, {"text": "pixel camera photo/video is way better day AND night..i had both of them so i know what i am talking about", "date": "12 Jan 2018"}, {"text": "The Pixel has a way better software experience : stock Android, faster and smoother, more reliable, and it's still up to date !\n \r\nOverall photo quality is great for both devices : Pixel is a bit better at dayshots, V20 a bit better at nightshots. Pixel is a \"point-and-shoot\" device, it has no manual mode.\n \r\nVideo recording is better for the V20 overall : Pixel has better stabilization, but it's nightshots are garbage.\n \r\nV20 has micro SD slot, Pixel's not (but unlimited native quality, storage photos and videos via Google Photos)\n \r\nV20 is 5,7 inch, if you like bigger screens.\n \r\nI personnally choose Pixel for the software experience and smaller size, but V20 is cheaper and better for video recording, it's still a great shot.\n \r\nPick what you need most, it's up to you.", "date": "10 Jan 2018"}, {"text": "hi! I couldn´t chose between Google Pixel ang Lg V20 \r\nPlease Help", "date": "08 Jan 2018"}, {"text": "Tq, getting interested with this phone since they've been claimed have the best camera on smartphones...", "date": "08 Jan 2018"}, {"text": "you will hearr both speakers without surround effects. But the camera and video recording is super best!", "date": "07 Jan 2018"}, {"text": "I read that GSMArena said that this phone recorded a video with mono audio. But could someone tell me, if I heard the audio through the headphones, is it both side speakers sounded without 3D surround or I will heard just on left/right speakers? Sorry for bad english. Hope uoll understand. Thanks for the reply.", "date": "06 Jan 2018"}, {"text": "i have pixel and oneplus 5...not the 5t BUT oneplus 5t is better than pixel on every aspect EXCEPT de camera :) pixel battery is weak .. no way as good as the battery on 5t", "date": "28 Dec 2017"}, {"text": "oneplus 5T is a very good phone but the pixel is a flagship with pure blistering fast software. the camera on pixel is hands down the best on any phone. i own an iphone 7 alongwith pixel. though i prefer the iphone 7 but the camera on pixel has no match.  \r\nthe battery is also too good on pixel. the battery endurance of any phone depends on the moderate user or heavy user. both 5T and pixel have fast charging.  \r\nif you are on a budget oneplus 5T is the best option, otherwise go with the pixel or the pixel 2.", "date": "28 Dec 2017"}, {"text": "Can anyone please tell whether one plus 5t is better or the Google pixel ?? Consider the camera quality... Hardware and software on both the phones.... And post your opinions. Please.... ", "date": "26 Dec 2017"}, {"text": "Best Androaid mobile phone.", "date": "22 Dec 2017"}, {"text": "cool phone, but I ordered one honor x7 from brotechstore. \r\nNext time I will buy this one.", "date": "22 Dec 2017"}, {"text": "i did..last night", "date": "15 Dec 2017"}, {"text": "Stable Android 8.1 Oreo to roll out starting today, December 5 (Update: official!) \r\nAll of these tech sites saying it's available but I haven't seen anything yet.  Waiting.....\n", "date": "10 Dec 2017"}, {"text": "Only 64h endurance.. how turd is that", "date": "10 Dec 2017"}, {"text": "Battery life is lacking. Charge twice a day.  3 hour screen time.", "date": "28 Nov 2017"}, {"text": "Can anyone tell me about battery backup of pixel 2016 which has 2700mah battery? Can u guys tell how much screen on time u get?? Is it still a better choice at budget of 35k on 2017(compact phones)", "date": "23 Nov 2017"}, {"text": "I want inbuilt app locker which lock specific apps not whole phone or like secure folder.", "date": "18 Nov 2017"}, {"text": "I thought exactly the same. I would like to buy it but without Radio, noway. I'll look for a Xiaomi Redmi Note 4 that has it and is cheaper.", "date": "14 Nov 2017"}, {"text": "I am facing problem with my google pixel. My phones dialer and microphone function getting hanged repeatedly and as many people are facing the problem of small crack in microphone solder codec my complaints are very similar.. I am not able to find out why i am facing this problem.. I requested google to resolve issue free as problem is related to some flaws in manufacturing. My request not accepted. I had a very good experience with nexus $ but i am unhappy with Pixel. Google Pixel help is a very good feature but no body knows about this feature. report your problem immediately to google help. ", "date": "10 Nov 2017"}, {"text": "Can't belive the \"12 mp really?\" comment.  Pixel number is just a marketing trick to attract consummers. You can have a 8mp camera that will produce much, much better pictures than a 16mp camera.  The real picture quality actually depends on the lens number, quality, material (plastic versus glass), picture processing (software), sensor physical dimensions.  If engineers would get a 16mp phone camera and replace the sensor with a 8mp one, they will be able to get a much better picture quality.  In fact, the more the pixels, the harder is to get a good picture quality.", "date": "05 Nov 2017"}, {"text": "Google pixel got no radio ?...ohhh...", "date": "03 Nov 2017"}, {"text": "Absolutely recommend the Google Pixel over the Galaxy S8, as well as, the iPhone 8. Even the first generation beats out newer phones. ", "date": "03 Nov 2017"}, {"text": "1st option Iphone7 \r\n2nd option Samsung S8 ", "date": "03 Nov 2017"}, {"text": "Which one do you suggest  \r\nIphone 7, galaxy s8 and google pixel.  \r\nWant your opinions ", "date": "01 Nov 2017"}, {"text": "Depends at what price you are getting at.\n \r\nThough its a lot better than other brands phone latest launched phones.", "date": "01 Nov 2017"}, {"text": "Bro. should I buy this phone or not please suggested.", "date": "01 Nov 2017"}, {"text": "Man, the Pixel have only 12.3mp cause this helps for having a very big pixel size (1.55 on the pixel). This means that if you have bigger pixel size, the density of the shots is very big and the photos even zoomed are still very clear and sharp. Having 41 megapixels on an sensor that small is stupidity. To fill so much megapixels you need an sensor that size is 6-7 times biger than the pixel one. When there are more megapixels there is smaller pixel size (making photos less clear and noisy) and having less megapixels lead to a bigger pixel size(make photos very sharp and clear, even on zooming). Hope you understood!", "date": "31 Oct 2017"}, {"text": "This is the 21st century and some people still don`t get it that nr. of megapixels doesn`t matter", "date": "31 Oct 2017"}, {"text": "12 megapixel, really? Four years after the 41 megapixel camera was available in a smart phone? Why so backward? This is the 21st century isn't it? \r\nI understand this is a Google product and as such might have issues like it's developer, but a 21 megapixel deficit? Try again, Google.", "date": "29 Oct 2017"}, {"text": "I just paid over $600 for my new Pixel XL and loved it until I discovered unfortunately that it had a faulty microphone and no one that I called could understand anything that I said because of it constantly cutting out and sound breaking up. I spent a day and a half and hours on the phone and was sent to three different Verizon locations and I now have a \"like new\" Pixel that I am paying\"new\" price for. I was an loyal customer of Verizon for over 11 years but after this I will be hunting me another carrier and I will never ever buy another\"new\" phone. I cannot understand how Google and other manufacturers can be allowed to replace a new phone with a used one and you are still expected to pay full price. This is a known defect in this particular phone and I highly recommend you think of getting something else or check it out very carefully in the store if you are foolish enough to buy one such as I did from Verizon. I was put in touch during my ordeal with Google and they were no help either and frankly the guy I spoke with was pretty much an asshole to me. I will certainly not be buying any other Google product. ", "date": "14 Oct 2017"}, {"text": "Was just checking out my old S4 with 5inch screen. Has smaller bezels than this does and a smaller footprint. I know this is last year, but it is still for sale. ", "date": "12 Oct 2017"}, {"text": "sounds like you have a faulty device or have attempted to overclock the phone with a root upgrade . the phone is flawless and performance is top notch if you avoid downloading spamware or viruses ", "date": "11 Oct 2017"}, {"text": "I hate this pixel. My husband loves google and services. He decided to get us on google fi. When I first switched from samsung it was very awkward and hard to use it. I lost my contacts and some other stuff where the google cloud didn't work as well as wired options. So, I had to except the fact. Then it stopped working and getting so hot ( it was not even month 2-3). Bluetooth is always blue. It doesn't work 80% of time and I have to add/remove my devices all the time. Eventually they agreed to change the phone as it was defected. Regardless of that device the entire batch is very bad design: do not disturb option turns on and off randomly, bluetooth turns on and off while I am driving and using map. Now I have a brand new device which actually shattered in my handbag. I contacted to google for replacement as I have protection. They also arrogant enough to add an extra cost of deductible. I cannot wait until the end of period where I finish paying. It is misleading, worst ever experience I had and worst ever phone.. Don't think twice of you are like me to get a phone and forget about it as long as it works. ", "date": "10 Oct 2017"}, {"text": "And it's still ugly. But it will probably work just as fine as before, perhaps better.", "date": "06 Oct 2017"}, {"text": "I've had the Pixel almost a year now & at 1st  I loved this phone.... now I can't stand it. The phone tends to get really hot, alllllll the time. It also freezes ALOT!!!", "date": "05 Oct 2017"}, {"text": "@harrison A 1080p display so under-specced that our eyes can't even tell a difference with a 1440p one in a phone that size.", "date": "05 Oct 2017"}, {"text": "Never realized that the original Google Pixel had a pitiable display of Full HD until now.", "date": "04 Oct 2017"}, {"text": "I got the blue version.  The Pixel May be the ugliest phone I loved dearly.  The darn thing just worked and did so flawlessly.  Looking forward to the next one.   ", "date": "01 Oct 2017"}, {"text": "I sold it for a GS8.  Big mistake.", "date": "01 Oct 2017"}, {"text": "And then there comes the oneplus 5 which destroys the pixel in every way possible", "date": "29 Sep 2017"}, {"text": "dude , stop taking drugs..is not good for u", "date": "28 Sep 2017"}, {"text": "Worst phone never buy a phone of google....im using a pixel ....have to send it 2 times in 7 months in a service center for repair.... \r\n..dont spend 57 thousands for a G , spend 10 thousands  for another's G that is gioni it will work better its a crap waist of money", "date": "28 Sep 2017"}, {"text": "The alarm application that came with the phone randomly stops working. It's caused significant disruption in my life because there are literally no steps I can take to prevent it or foresee it. I use it to remind me to take medication and as an alarm clock in the morning. Customer service/help line were useless and didn't speak very good English (not that I hold that against them, they just can't help me if they don't understand my issue and we can't communicate). ", "date": "27 Sep 2017"}, {"text": "Two shortcomings with this phone. \r\n1. Sound quality is bad. No depth. \r\n2. It comes from a Freemason company and the G is in the back of the phone :(. Research masons and G. ", "date": "27 Sep 2017"}, {"text": "Actually it focuses very fast. The only issue is that in low light it hunts a lot until you tap to select then it doesn't hunt, weird. Quality is great. You can use hdr+ on for better quality than just auto, in low light. ", "date": "27 Sep 2017"}, {"text": "The colors \"Quite Black, Very Silver, Really Blue\" made my day! Super unique! Haha", "date": "25 Sep 2017"}, {"text": "The Google Support team told me to go into backup & reset and do a complete reset. I did that and a black screen with a red triangle appeared with the message \"This device is corrupt\". I chucked the phone in the bin and bought a Oneplus 5 which has performed faultlessly since new. I'll never trust Google phones again!", "date": "25 Sep 2017"}, {"text": "Get the iphone x", "date": "24 Sep 2017"}, {"text": "I need download the apk for play store", "date": "21 Sep 2017"}, {"text": "Battery life has settled down after a few days from a restore to new and it's about the same from Nougat. Maybe a tad worse but standby seems better. I still don't think Oreo is a noticeable update but it's more liveable to use than iOS11.\n \r\nI only get 5 hr SOT using LTE on this Pixel. Not bad but nothing special. I got 6-7 hr SOT on my G5 with Nougat once. ", "date": "20 Sep 2017"}, {"text": "are you sure...!?  do you have the phone!?", "date": "19 Sep 2017"}, {"text": "The in box accessories like headphones carries a warranty of 6 months. Atleast in the case of Samsung ", "date": "18 Sep 2017"}, {"text": "No", "date": "14 Sep 2017"}, {"text": "Isit it true that this google pixel can not download PDF files!?", "date": "14 Sep 2017"}, {"text": "bad advice :) the perfect time to buy google pixel is after pixel 2 will launch..then the price of google pixel will drop..and that water protection..for me personally is useless", "date": "09 Sep 2017"}, {"text": "Those who are going to buy pixel, I would suggest them to wait for few more days, and buy pixel 2. Because pixel doesnot have IP68 or IP67 certification. May be Google put these in their next model...", "date": "08 Sep 2017"}, {"text": "I want to buy Pixel again now it has come down in price but I had such bad photos/video in low light I sent it back. The photos take the longest time to focus than any camera I have had in my life and video in low light looks like wasps invaded the screen.\n \r\nSo we have people even Marcus Brownlee saying best camera on phone ever but I get bad results,,,maybe had a faulty unit it was second hand. Everything else brilliant.\n \r\nThere is always something special about having a Nexus now Pixel device but best was Nexus 5 for me.", "date": "08 Sep 2017"}, {"text": "I have tried and spend money on many high end phone but never been satisfied  ! Now I have finally found the pixel to totally satisfied me ! Man what a monster phone ! It totally beats the competition in terms of build quality easy to use speed fluidity ii usage and even the superb camera ! What else can I say ! A pure Google experience with no bloatware an absolute jewel ! I am so happy now !", "date": "07 Sep 2017"}, {"text": "no change in the battery life", "date": "07 Sep 2017"}, {"text": "Hi, how about the battery life with Oreo update?", "date": "06 Sep 2017"}, {"text": "If headphones is crap that won't mean phone is crap too. Buy any headphones and use it with your Pixel. Just simple.", "date": "05 Sep 2017"}, {"text": "Android is deeply flawed u say....boy wake tf up", "date": "05 Sep 2017"}, {"text": "Bro do this phone will support 5g ,,, a gye said me that google phone will cover any g,, is that right,,,, is this phone will support any up coming generations,,,  plZ reply ", "date": "05 Sep 2017"}, {"text": "Bro do this phone will support 5g ,,, a gye said me that google phone will cover any g,, is that right,,,, ", "date": "05 Sep 2017"}, {"text": "iphone 4 bezels! this thing embodies everything wrong with google. Android is deeply flawed. use ios. (coming from a android user of 7 years)", "date": "03 Sep 2017"}, {"text": "Dude... I never even got headphones with mine. It's not meant to ship with that. The fact that you got them really does mean they were a free gift. Saying it's bad because of headphones is stupid...", "date": "02 Sep 2017"}, {"text": "U will love it and lucky to have pixle", "date": "01 Sep 2017"}, {"text": "Best of best \r\nNothing like pixle\n", "date": "01 Sep 2017"}, {"text": "Nokia 8 is cheaper and better specs.", "date": "31 Aug 2017"}, {"text": "so...google pixel is a shit phone because your headphones doesn`t work anymore..and for that nobody should buy the PHONE even do u had problems with the HEADPHONES :))) u are one smart and logic dude", "date": "29 Aug 2017"}, {"text": "Do not buy the Google Pixel. After buying this for my son who has saved for a long time, the included headphones lost sound on one side after 6 weeks. After contacting Google I am told that they are a free gift and not covered by a warranty and are very poor quality and not meant to last even the 6 weeks. What a joke!! No where on the box does it say they are a free gift, nor do the retailers tell you that when purchasing one. This is surely Illegal to not warrant something that comes as part of the product. If this was an iPhone they would have been sent to us the following day. Thank you Google for disappointing a young boy who has saved up top buy this phone. CRAP !! Back to Apple we go to buy quality products with customer service to match. Certainly not buying anything made by Google EVER again. ", "date": "29 Aug 2017"}, {"text": "I do. ", "date": "27 Aug 2017"}, {"text": "Almost asif bad as a black berry Google should be ashamed", "date": "25 Aug 2017"}, {"text": "I am unable to use picture in picture mode even after official 8.0 Oreo update. Anyone facing same issue? Do reply.", "date": "23 Aug 2017"}, {"text": "Yes", "date": "23 Aug 2017"}, {"text": "Huawei P10 or Google Pixel?", "date": "19 Aug 2017"}, {"text": "Those who have this phone, would you recommend this handset!? ", "date": "18 Aug 2017"}, {"text": "For me this is overpriced phone.", "date": "17 Aug 2017"}, {"text": "Horrible experience in the two weeks I've had the Google Pixel. 24/24 phone and chat support is friendly and polite, but useless.  I will go back to my iPhone 4, on which I never had to download any app, whether to read an MS Word, Excel, Powerpoint or PDF (etc.) attachment, which converted MS Outlook calendar event automatically into the built in calendar and which allowed me so much more customization. Who would have thought that Mac OS would be more compatible with Microsoft OS than Android is?  Who wants to buy that Pixel from me?", "date": "08 Aug 2017"}, {"text": "^ Agreed. \n \r\nThis might be my new favorite smartphone ever over my G5 and V20 mainly because it is rarely given me issues. My G5 has ghosting and Sprint is awful. My V20 is too bulky and kinda lags. My Pixel is the smoothest phone I ever experienced. \n \r\nThe Pixel's software experience is what I wanted the Nexus One to be 7.5 years ago. See I plan to be loyal to one carrier, Verizon + Pixel is the only way for me going forward. Android is the ecosystem I want to stay in. Nomore Samsung or LG for me. \n \r\nGoogle Phones, ftw! ", "date": "05 Aug 2017"}, {"text": "It's quad core phone. Nothing special in it then why price is too much high..? \r\nIts price should be in 400$ \n", "date": "05 Aug 2017"}, {"text": "'Play Services has stopped', 'Phone has stopped', 'Gboard has stopped', 'Clock has stopped'. etc. etc. I've stopped caring now, the phone is in the bin!", "date": "31 Jul 2017"}, {"text": "how about moto z? I'm planning to buy it after watching gsmarena negetive review on google pixel. Please share your thought. ", "date": "30 Jul 2017"}, {"text": "I can see a lot of trolls in here, this phone is amazing, maybe one of the best cameras on the market with unlimited storage for photo and video, you cant ask for more. Go on Youtube see all the tech geeks talk about how they always going back to the pixel. Battery is one of the best in any smartphone. If you all had so much problems with this phone you guys must be very unlucky or have a fake product. There is alot of good phones out there but no one this clean and fast. \n \r\nWould not recommend because of the price tho. But if you are like me an entusiast and want to be on a journey to see how this phone evolve with time you should buy it :)\n \r\nPhones Ive used this year: \r\nIphone 7 \r\nHuawei P10 \r\nSamsung S8 plus \r\nMoto Z  \r\nSony XZ\n \r\nPixel is hands down best android phone on the market, no other phone will guarantee you with new OS and security updates fast until 2019, maybe longer who knows.\n\n", "date": "29 Jul 2017"}, {"text": "Thats a main board failure, happened to my sony XZ. They fix stuff like that on warranty. ", "date": "29 Jul 2017"}, {"text": "Following..", "date": "28 Jul 2017"}, {"text": "serious questions everyone!! \r\nI'm reading a lot of negative stuff on here about the Pixel, do i press go and get one or will i regret it?  \r\nAnd do i go Pixel or Pixel XL?", "date": "26 Jul 2017"}, {"text": "i was being ironical baby, take a 2nd look at my comment", "date": "14 Jul 2017"}, {"text": "WTF? i had iphones before and using this is a totaly different thing! i would NEVER go back to IOS after this phone.", "date": "14 Jul 2017"}, {"text": "best? right you are an apple user.. So yeah, you make sense", "date": "08 Jul 2017"}, {"text": "Opinion: poor.\n \r\nHW: GPS failed on International version within 6 months.  On a phone that cost over AU$1000.  Google replaced it with a refurbished US version.  This is not what I wanted and not what they said they would do.  I'm having to take it to small claims court.\n \r\nSupport: Horrible.  They have not done a single thing they said they would.  Slow.  And this is for a former employee and current shareholder.\n \r\nAndroid: random restarts, crashes, oddness.  As a shareholder wanting a \"pure android\" experience on something remotely competitive with an iPhone, I'm stuck with the Pixel.\n \r\nPS: my Pixel C also failed.  Half screen died.\n \r\nBoth devices with be replaced with Apple devices.  iPad Pro 2 and upcoming iPhone 8.", "date": "07 Jul 2017"}, {"text": "go for iphone7 . iPhone only the  best mobile phone in the world and OS also.", "date": "05 Jul 2017"}, {"text": "I bought it because Google advertises this phone as having LTE B7 support, but I can't use 4G because of a famous bug. Remember: for Google we are all beta testers for a product that may or may not ever get a correction to work like it should on day 1. Don't advertise all LTE bands if you cannot deliver. Simple as that.", "date": "27 Jun 2017"}, {"text": "Wanted to know is there a way to find out the manufacture date of the phone on the phone? \r\nI just received my pixel 6 days back. It was from an online store in India. The box mentions manufacture month as April 2017. But I read somewhere online that HTC codes its serial number to the date of manufacture. Mine shows that date as 2016 October. So am wondering how is it mentioned April on the box, and shows October on the phone? Is it refurbished? Because I purchased a new device, paid for a new device. HTC service centre is very far from my place to go there. Any idea or does anyone else have a similar problem?", "date": "23 Jun 2017"}, {"text": "Bad luck eh.", "date": "19 Jun 2017"}, {"text": "I share your pain. My pixel went into a boot loop all on it's own. Now it just continues with the loading screen until the battery goes flat and there is nothing you can do about it. It's a common problem, just Google 'Google pixel boot loop' to see how many people are suffering with the same problem. All is not lost though; because the phone is wedge shaped I can use it as a door stop to keep the door open!", "date": "17 Jun 2017"}, {"text": "I like this size but the design is butt ugly. Pixel 2 better deliver.", "date": "13 Jun 2017"}, {"text": "I am on my fourth refurbished Pixel phone since I purchased it on December 18, 2016. I have had so many issues with phone. One of the main issues is the keyboard \"sticks\" or \"hangs up\"  when I  am trying to text. Other times, I cannot even use my 4-digit unlock code pin to get into my Pixel. The screen freezes, I get error messages when I am at the Home Screen. Google technicians are so incompetent. One technician asked me what a \"Factory Data Reset\" was. Another technician wanted the last four numbers of the credit card that I used to pay my email account with every month. Seriously? Since when does having an email account cost money. I have tried to resolve my issues directly with Google. All attempts have been unsuccessful. I was told that I would have to send my phone to Google for a minimum of 15 business days so their technicians could \"figure out what the problem was\". I was told by Google that the issues are hardware issues, not software. I finally went to the new media with my complaints as Google advised me to contact my cell carrier to assist me with any further problems with the Pixel. I will never purchase another product made by Google. ", "date": "12 Jun 2017"}, {"text": "no, not in iphone", "date": "09 Jun 2017"}, {"text": "Yes but after one day of using the phone will not heat up a lot because the CPU is now fired up and ready to make the phone work", "date": "07 Jun 2017"}, {"text": "I got it and it is really awesome...worth buying it...it has amazing features .. but it heats up fast and this is common in all the latest phones", "date": "01 Jun 2017"}, {"text": "you won't be disappointed ", "date": "28 May 2017"}, {"text": "Guys had the phone a couple of months. Still the best phone I have ever had. Quick, clear and robust. I recommend this phone", "date": "28 May 2017"}, {"text": "HTC is good. But Samsung? Never. Laggy phones. HTC or Sony.", "date": "26 May 2017"}, {"text": "It's an algebriac expression\n \r\n1 + 3t\n \r\nThe actual inequality is\n \r\n1 + 3t > px", "date": "25 May 2017"}, {"text": "Don't buy it...The back glass is extremely weak..Mine has cracked .. without any reasons ..I am not sure how it has cracked   without falling down...As told by service center Physical damage is not covered under warranty..and replacing the same will cost around 7500 inr. as the total back side needs to be replaced.Not worth ..the money you pay..If you are an Android fan...go for Samsung or HTC.... Please avoid it\n", "date": "25 May 2017"}, {"text": "The design really sucks!!!Will never ever buy it just because of the design!", "date": "25 May 2017"}, {"text": "mines arriving next few days and have these expectations so hope it lives up to them.I wanted 128gb but cannot afford that and this unit is used 32gb. I love the Nexus range but after Nexus 5 the 6 was too big,Nexus 6P too bighead 3 Nexus 5x all had failed cameras or just stuck and now this which is  so expensive. I seems like years since had a Nexus even though I like them.\n \r\nI want them to build a Pixel 2 made of polycarbonate perhaps 6xx  series chip/6gb RAM and be £349 for 128gb model.", "date": "24 May 2017"}, {"text": "The price level is too high dont you think", "date": "22 May 2017"}, {"text": "Agree and it is the same with this DxO mark most Sony's got big score but actual real life was not good. We really do not need massive GHz CPU even for gaming it is the GPU that matters. A 21MP camera could produce awful photo but 8 MP can be stunning.\n \r\nA lot of these reviewers just get the phone, test it out for 1 day and return it. It is when you live with the phone after 1 month then 6 months then a year that counts.\n \r\nWhat about using the phone in busy rush hour is it hard to handle?is ring loud enough?etc  what about as you travel going between cell towers will drain battery faster, these reviewers have no true meaning of anything they just sit in office take a few photos that is it.\n \r\nThe best thing is as you say, real life.", "date": "21 May 2017"}, {"text": "What are the pros and cons of this phone... How's the battery? Cuz I'm a heavy user", "date": "21 May 2017"}, {"text": "Specs don't matter.  \r\nThis has been true for years. The original MotoG was smoother than the Samsung Galaxy of its day, and the Pixel is smoother than any other currently available Android device. Specsmanship is what lead to the megahertz race, the megapixel race, the core count race, etc. All that matters is the user experience. ", "date": "18 May 2017"}, {"text": "Cant wait to get a Pixel just one month to go on contract.", "date": "17 May 2017"}, {"text": "Room temperature is around 35C usually, but my Google Pixel heats up to 41C when using camera or snapchat. Is this normal? I have updated to Android 7.1.2 and the issue still persists. ", "date": "17 May 2017"}, {"text": "Oneplus 3T has better specs. 6gb RAM, with the same chipset. Fingerprint Scanner on the Home button. and has good camera too.", "date": "06 May 2017"}, {"text": "New google smartphone need to be new great desing like LG G6 or samsung s8, new clean display Super Amoled, and cheaper.....\n \r\n1.Display.- 5.3 WQHD - Super Amoled - CGG 5 - IP68 \r\n2.Memory.- 4 GB RAM \r\n3.Chipset.- Snapdragon 835 \r\n4.USB.- 3.1", "date": "03 May 2017"}, {"text": "I do not recommend the Google pixel.\n \r\nMultiple problems with it , poor battery life, Google commands very unreliable, phone software was working then failed, no service or support.   EE the distributor refer you to Google and Google to EE!\n \r\nGoogle don't care they just need your data.", "date": "03 May 2017"}, {"text": "I bought this phone because it was advertised as providing up to 7 hours charge in 15 minutes which is an outright lie.  They get around the sale of goods act by stating \"up to'.  The EE shop where i bought it made it charge 1 hour after 1/2 charge.\n \r\nThen the voice commands which are essential for hands free dialling only work about 20% of the time.  So 1 minute it will take your instructions and dial the next minute not.\n \r\nFinally having synced my phone to my outlook contacts which all worked fine suddenly it's lost all my contacts and i now have to call using outlook which means incoming calls are no longer identified.\n \r\nFinally 24/7 support is another myth.  No response even to emails.   These people are just cheats who think they can ride roughshod over users.\n \r\nDo not buy Pixel until they prove it works.", "date": "03 May 2017"}, {"text": "But better :)", "date": "02 May 2017"}, {"text": "This phone looks like Chinese copy of iPhone ", "date": "29 Apr 2017"}, {"text": "Best phone I've ever had. Works well, excellent photos, intuitive, does everything I want. I had a Google Nexus before. This is even better. Very glad I took the plunge.", "date": "29 Apr 2017"}, {"text": "Stop trolling, Samsung fanboy. \n \r\nThe Pixel does not have an inferior camera to the iPhone 5. My $30 Lumia 640 has a camera as good as the iPhone 5. Pixel blows both away. S6? That's even worse to hold and laggier than the S7 duo. Stop it. Nice try though. \n \r\nMy only qualms with the Pixel beyond the boring design is it can't be recognized on my MacBook using Android File Transfer. My LG and Samsung could though. And when using ES File Explorer's app manager when I want to Bluetooth transfer an app apk to the Pixel, it won't accept it. Seems Google really closed this one out. \n \r\nBut other than that, still better to use than a Samsung. The Pixel has the newest SwiftKey update and no lag on this dialog box. Smoothest and most fluid Android smartphone I have ever owned. As fluid as iPhone. ", "date": "24 Apr 2017"}, {"text": "One plus 3T what does it mean?\n", "date": "23 Apr 2017"}, {"text": "How about the camera clarity of pixel bro", "date": "23 Apr 2017"}, {"text": "If the fingerprint is front mounted i can buy it, rear mounted is shit one. damm it. ", "date": "22 Apr 2017"}, {"text": "Try one plus 3T it is better then this phone", "date": "18 Apr 2017"}, {"text": "So I done some research and not all was good but you get that with everything. \r\nI decided to go with it anyway. \r\nThe design is great I love how it looks, I like the fingerprint sensor at the back too. \r\nIt's kind of iPhone looking but with android so if you're an iPhone fan but hate restrictions this could be the phone for you. \r\nThis however is where my opinion changes. \r\nThe volume button is on the wrong side and placed perfectly so when it's in an in car holder the volume gets pressed, very annoying. \r\nThe phone is not as fast as I expected. \r\nThe camera was disappointing compared to Samsung and even my iPhone 5. \r\nThe first thing that happened when I put my sim in and started downloading apps was a \"force close\" type thing. \r\nIt crashed everything I tried for the first hour. \r\nAfterwards it improved long enough to have a play but still threw me out of apps and games randomly until day 4. \r\nPerformance was however quite slow considering. \r\nThen when playing games my Internet was constantly dropping out on WiFi, I contacted my service provider 7 times and in the end had an engineer visit to fix my net but there was nothing wrong with it, he had an old Samsung like the first smart phone ever and he was streaming videos fine. it turns out the pixel has a WiFi connection issue since it was returning speeds of 30mbps and although stayed connected had no Internet connection, totally unreliable. \r\nMobile signal was strong though, where I would normally get no signal or very little I was picking up 2 bars + happily.\n \r\nI got rid of the pixel after just 6 days of owning it, I'd had enough of the faults and quite honestly what I was led to believe was great performance camera etc etc. \r\nAll very disappointing. \r\nAlso the battery life wasn't that good considering the battery that's powering it. \r\nI now have a galaxy S6 again I'm getting Internet speeds over WiFi of 130mbps and no connectivity issues. \r\nCamera is very good. \r\nPerformance feels faster than the pixel. \r\nIt's the same size as the pixel well a little bigger. \r\nBattery is about the same as the pixel. \r\nAnd Web browsing is of ease where as the pixel some things were awkward to navigate and adverts with multiple pictures were where the pixel got stuck as it didn't give you the arrows or tap to change to see all the other pics.\n \r\nHighly recommend staying away from this phone!!\n \r\nSamsung is allot nicer to look at and hold. \r\nEverything works well even apps feel like they were designed for the phone.", "date": "17 Apr 2017"}, {"text": "Thank you for the info!  I did some research, but finally decided on this phone anyway.  I finally got to put an order through Google.  I guess they finally got some more in stock.", "date": "12 Apr 2017"}, {"text": "Hearing Problem \r\nMy phone Google pixel has developed an technical fault. The mic and the receiver of the phone doesn't work when mobile data is turned on and both works fine when mobile data is turned off. Please be kind enough to instruct me on what can I do about this. \r\nThank you", "date": "11 Apr 2017"}, {"text": "Updated to 7.1.2 through Verizon earlier and it fixed the double tap to wake. I was having issues with it on 7.1.1 that I also had to turn on the raise to wake feature. Now it is probably more accurate than my LG phones and even wakes up under a blanket with no lighting. Good job, Google. \n \r\nI will say that the camera on the Pixel is more overrated than the S7 edge. I had a shootout and the surprise winner was the G5 even in low light. Very sharp and I like its colors even if it comes off a little fake.  S7e was only a little better and sharper than the Pixel.\n \r\nWhile Pixel has the worst for still photos, it excels in video recording followed by Samsung. LG has the worst video recording of the trio. S7e has the best front cam thanks to wide angle. G5 is best overall thanks to still photos and wide angle on the rear. They all have their strengths and weaknesses over each other. \n \r\nPixel is my favorite to use overall thanks to the fluid software and more one-handed friendly size. G5 is my favorite phone to do everything overall though. S7e is clearly 3rd for me personally but still a solid bronze winner with a beautiful design, VR, GIF maker, and water-resistance that the other two lack. Software just bogs down the usability along with the annoying curves. ", "date": "08 Apr 2017"}, {"text": "It is definitely one of the best phones I have ever had. I am just a phone user. I like the size, screen resolution, speed, camera, etc. even when my camera turns red/yellow when is a little dark and I don't know how to fix it. The other problem is the app communication with the system apps; by example I use windows exchange, Contacts and calendar, don't sync properly; like, when I create a new contact. I save it in my exchange. minutes after look in my contacts and is not there. Battery is another problem, it does not last the whole day, definitely better than any Iphone and a Windows 10 though. ", "date": "07 Apr 2017"}, {"text": "Try GSMArena's phone finder tool. It may help:\n\n \n", "date": "06 Apr 2017"}, {"text": "What would you recommend instead that has a 5.0 in screen?  My problem so far in my search is that all the newer phones have giant screens.  Thoughts anyone?", "date": "06 Apr 2017"}, {"text": "the phone is really good . nice camera . works really fast . \r\nif the beggest star and singer owns this phone , then you should too .  \r\ngo ahead . if you are a fan of justin bieber , buy it right away .  \r\nand if you are not......buy it anyway", "date": "04 Apr 2017"}, {"text": "you guys really spending that much for a phone when u can get a better phone for a cheaper price ............. that's really smart -_-", "date": "04 Apr 2017"}, {"text": "This is the best mobile I have ever had, my first in 1991. It is quick, takes great pictures. Cannot comment on the music facilities as I do not download, but the phone works well", "date": "04 Apr 2017"}, {"text": "Hi  \r\nI had purchased a Google Pixel a month ago and even though it's a fantastic phone the service that Google provide in India is atrocious. Within 2 weeks of buying the phone the bottom facing speaker conked off! Even though Google admitted that it was a manufacturing defect on the phone they wouldn't take any responsibility for it. How they treat their customers in India is truly disappointing. I would disuade anyone to buy this phone for the shear lack of support on their part. \r\nVery disappointed customer.", "date": "03 Apr 2017"}, {"text": "Do durability w class. I shifted from OnePlus 3 to Google pixel. And I am impressed. Build Quality, software Experience, performance, battery backup w  w a palm i pre w i xdxdxdxdxd hahahahah hahaha", "date": "01 Apr 2017"}, {"text": "Google Pixel is really cool. Sorry Samgsung", "date": "30 Mar 2017"}, {"text": "Go For Pixel. Its Lightening Fast.\n", "date": "28 Mar 2017"}, {"text": "This phone is perfect..we don't need anything better", "date": "27 Mar 2017"}, {"text": "Pixel batery is more durable this phone is beast", "date": "27 Mar 2017"}, {"text": "I'm really confused between Google Pixel and Galaxy s7.In India,Pixel is available for 45k and GS7 for 39k.Can any one comment about the battery performance of Pixel?", "date": "27 Mar 2017"}, {"text": "good ", "date": "27 Mar 2017"}, {"text": "Best in class. I shifted from OnePlus 3 to Google pixel. And I am impressed. Build Quality, software Experience, performance, battery backup every thing is impressive. Camera is truly the best. Yes the price is bit high. But the phone is awesome. ", "date": "26 Mar 2017"}, {"text": "Over-priced.", "date": "24 Mar 2017"}, {"text": "If the often maligned but underrated LG G5 is my #1 favorite smartphone ever because it has every feature I want, then the Pixel is like my #1A. I really do prefer using this phone right now. I also like that Verizon didn't brand the phone on the back. I see no boot up animation from Verizon or any of their bloat. Works wonderfully with T-Mobile.\n \r\nI just updated to 7.1.1 and love the double tap to wake. My lockscreen wallpaper says Google with a black background and the home screen says Android in black as well. I want it black since OLED. Even my SwiftKey is a black theme. The effort of waking it while seeing Google and then Android, sliding up for my app drawer, and locking it is just so SEAMLESS. Smoother and quicker than any iPhone I ever used too. \n \r\nI also didn't expect to use Google Assistant alot but I do especially to make calls, open my Gmail, check weather, or find addresses. Believe the hype. It might look ugly with a weird back and too much top and bottom bezel, but it delivers in daily performance. Will probably go XL with a Pixel 3 since typing on 5\" can feel cramped after using 5.3-5.5\".\n \r\nThis is a great phone, folks. Don't judge a book by its cover. The price might be a bit steep but it isn't like every Nexus device was inexpensive. Nexus One was priced originally at $530. Nexus 6 and 6P were $650+. A 32gb iPhone 7 is priced similarly. Google doesn't want to associate Android as a poor man's iOS and wants to show it fast ajd fluid unlike Samsung's skin. \n \r\nThe quality is there especially inside the Pixel where it truly counts. People who judge this phone based on design or price but never actually owned it yet is similar to Luke Skywalker prejudging and underestimated Yoda early in The Empire Strikes Back. That is why THEY FAIL. ", "date": "22 Mar 2017"}, {"text": "I have complain with new pixel phone ...issue is mobile data is off and I tried several times to on it but it's not getting connected  and issue nov2 is touch pad I,e square button and circle one both keys buttons not working.... \r\nWhen I have paid big amount 60k...why should I face such problems\n \r\nMore over my kids told me to buy I phone but went against them thought google is big company will  not fool customer with such low QUALITY phone  . \r\nCustomer care asked me leave my phone behind to resolve the problem but why should I  \r\nWhen I have paid big amount and ITS YYOUR COMPANY GIVEN GOOD QUALITY PHONE \r\n...if can't help me ... \r\nLET ME BE THE .LAST PERSSON TO GET FOOLED. \r\nThank you \r\nChaya", "date": "21 Mar 2017"}, {"text": "Google pixel needs to take responsibility for dropped calls hardware issue and stop trying to pass the blame buck to my carrier.", "date": "20 Mar 2017"}, {"text": "Getting the silver/32gb of this model right now. Will use it as a backup to my silver G5. I love Android and want both phones to have great cameras which they do. I also prefer the size of the 5\" Pixel. Give me a month to give it a decent synopsis of this Pixel. The first, true branded Google phone! To think differently and try to be unique, avoid Apple and Samsung. Go Google! ", "date": "18 Mar 2017"}, {"text": "your phones are not seen in jumia, is only one type am seening everyday", "date": "16 Mar 2017"}, {"text": "It was manufactured by Hate This Company so expect issues with their Hi-Tech Crap. HTC is extremely overrated by whatever small fanbase it has.", "date": "16 Mar 2017"}, {"text": "Calls and apps keep dropping and stopping suddenly", "date": "16 Mar 2017"}, {"text": "sorry to hear ur story \r\nactually there is no need to buy expensive phones ever. \r\ni mean i would recommend ppl to stick to budget phones use it for a year or 2  \r\nthen but another ..", "date": "12 Mar 2017"}, {"text": "I realized it isn't the height of the phone that makes it feel bulky but the width! My taller but narrower LG G5 feels better in the hand thanks to the width than my Xiaomi Mi 5. I have a Note 3 which isn't that much taller than my G5 but it is quite wide and just doesn't feel right in the hand for me. That few mm difference can make all the difference! \n \r\nThe SE is just way too narrow for a comfortable keyboard. I did see the Google Pixel XL for the first time today at Best Buy. I actually like the hand in feel with it better. I would get the \"5 Pixel but probably will wait for it in 2018 when Android turns 10. The Pixel 3 with Android Pee... Ahem, Android Pie. And P is my favorite letter of the alphabet because that's what my first name starts with and I love the p in women. Pie lover. \n \r\nI think the Pixel might have been the best overall Android from last year. This is pure Android at its finest. I think a white Pixel would work well with my silver G5. I would have two phones that not everyone uses and I get the best Android experience with two of the best cameras from last year. But I shall wait for the Pixel 3 with Android P. Special 10 years of Android with my favorite letter of the alphabet and dessert from women. I love me some pie filled with cream. ", "date": "04 Mar 2017"}, {"text": "Apple should make 5\"2 display iphone like 4 years ago", "date": "03 Mar 2017"}, {"text": "I think that this is not possible. And you also forgot that the width is the most important factor for handling.", "date": "03 Mar 2017"}, {"text": "Pixel is the best Android phone because of the perfect software. But for 700-800$ it's a bit overpriced considering the hardware. Pixel 2 should have a more original design, better choose a aluminium unibody than glass panel with aluminum, stereo speakers,6GB of RAM and 64GB or storage, OIS and f1.7 aperture on both cameras, autofocus on selfie camera, water resistance, 5.2\" screen on the same footprint(no fancy G6 or S8 bezeless design, just 5.2\" on the same dimensions) and bigger battery, like 3000-3200mAh. If Pixel 2 will have all of this (it can have them with Google's will, no miracles out innovation like on G6/S8) I will give 700-800$ for it.", "date": "03 Mar 2017"}, {"text": "How long have you had it for?", "date": "26 Feb 2017"}, {"text": "The iPhone SE feels like toy for little kids' hands. Many gotten so used to typing on a roomier keyboard. I despise \"4. It isn't the display but the footprint. Apple could easily put a \"5 display on a SE if they trimmed the top and bottom bezel and made it a tad wider. ", "date": "26 Feb 2017"}, {"text": "I have been using both apple and a diversity of different android phone. This Google pixel is the best android phone I ever had. I have no complaints about anything. It's fast, its powerful, it last, the sound is strong, it's resistant it's slim and doesn't overheat . Best camera in town for such small megapixel, not as detailed as the Sony Xperia but way better taking in consideration it own half the megapixel. The splash resistant and dust resistant is not fake, the glass is strong. This is the perfect basic phone with all the normal features you would like to have. If you prefer more slim and accessories go for the moto x, if you prefer bigger go for the iPhone 7 plus. But at the end, pixel is the best overall", "date": "26 Feb 2017"}, {"text": "Thank you for your excellent post. It is more proof that Google phones belong in the bargain bin at a grocery store.", "date": "22 Feb 2017"}, {"text": "Leaving aside the performance, Camera and Batter life, here are 6 reasons to not Buy Pixel/Pixel XL in India: \r\n1.\tApart from Camera and Battery life thereÂ\u0092s nothing great about the phone.  \r\n2.\tThere will be Wi-Fi, Bluetooth, Network connectivity issues within 2 months of purchase. \r\n3.\tDue to Pathetic quality of LED and Panel even using a basic silicone case leads to Discoloration. \r\n4.\tDespite so many issues, the service center will not provide with a replacement unless the phone is entirely dead and cannot be repaired within 14 days from the date of purchase. And the reason behind this is, Google doesnÂ\u0092t sell these phones directly, they sell it through Third party resellers and thus the 14 day clause, which is not mentioned anywhere. But this seems to be an eyewash and the real reason is unknown. \r\n5.\tWhen the phone is submitted for service, since itÂ\u0092s a sealed phone from all sides, they heat the LED and apply pressure on the sides to get the LED out of the Panel, which leads to more damage on the Panel due to pathetic quality of the paint used on the panel. But the service center or Google Support know this, they will never accept it, as the damage can always be dropped on the customer on the grounds of Â\u0093AESTHETIC ISSUEÂ\u0094. \r\n6.\tProper answers will never be given by Google support or the service center. They are trained to put the blame on the customer and to make the customer run from pillar to post that will make them energy less so they can finally accept the faulty product as thereÂ\u0092s no other option left, since selling the product for a dirt cheap price isnÂ\u0092t something anyone would be willing to do and Indian judicial system isnÂ\u0092t great at supporting the helpless consumers. \r\nSo if youÂ\u0092re ready to go through the turmoil just to have a good camera and a decent phone for 57000(basic Pixel 32 GB) and above. Please go ahead.\n \r\nRegards, \r\nA Royally Disappointed, Exhausted Ex-Google Lover\n", "date": "20 Feb 2017"}, {"text": "You're a troll buddy. And from the sounds of it, a fancy one.  Are you wearing sequins and rhinestones? ", "date": "18 Feb 2017"}, {"text": "Well said. ", "date": "13 Feb 2017"}, {"text": "Over price", "date": "13 Feb 2017"}, {"text": "according to your response, now people will sell all their smarthphones and help the poor, feed the fish and stop hunting birds, oh no I forgot you'd rather say: people talking about smartphones and there is 2 golden fish in your aquarium hungry,, feed them", "date": "13 Feb 2017"}, {"text": "My god people are so rude and ignorant. You're on here talking about smartphones, not saving lives. Get a grip. If you don't like a phone, great, and if you do, great. However you don't need to attack people. End of rant. ", "date": "11 Feb 2017"}, {"text": "I know very well about bluetooth speakers dont lecture me about them, what i was asking was whether the inbuilt speakers make that crakling sound when playing music at high volumes, the speakers of the pixel have an hardware issue even google has admitted to this, i just wanted to know from the users whether this issue has been fixed. ", "date": "11 Feb 2017"}, {"text": "Mobiles are personal devices with music as secondary functions. Using it with earphones will give you best results.\n \r\nBut if you try to use it as a music system, it will surely have not give desired results. If you wish to have a boombastik output, connect it to some nice Bluetooth speakers. \n \r\nPlease learn to use a device. Don't ab- use it.", "date": "09 Feb 2017"}, {"text": "I had visited a retailer when Pixel siblings were launched in India. Pixels, iPhones and Samsung shared same display bay. People were more interested in Pixels ( iPhone running android impression) and literally moving away from Samsung counters. Efforts by samsung attendants failed , inspite of mention of leading market brand of mobile in India.\n \r\nLast Sunday I visited same place. And to my surprise, Samsung had moved it's counter away from bay where it shared space with iPhone and Pixels. When I asked the floor manager, he simply said - Pixels overshadowed Samsung and Sales dropped. Had to move them away from Pixel and iPhone areas.\n \r\nThis is the effect of Pixels.seems people simply love to buy iPhoneish design with Android OS.\n\n\n", "date": "09 Feb 2017"}, {"text": "Now im useing google pixel and I can tell this is great phone the camera are Insane  \r\nOnly I do not like in this phone large frame at the sides is only the lack of it...  \r\nI'm from Italy but I bought it in England paying him about 700Â\u0080 that price killed me, I chose between HTC 10 SG7 I did not like this phone S7 can be seen everywhere and there where bought  pixel remains only 20 pieces and the seller told me very lucky  cuz i find it ", "date": "09 Feb 2017"}, {"text": "This phone is unarguably the best, although the back design isn't pleasant to look at, but I could forgive that.\n \r\nThe problem is that at this price, No water resistant? that's a deal breaker for me. So maybe Pixel 2", "date": "09 Feb 2017"}, {"text": "Has anyone here experienced the loudspeaker crackling sound with their pixel, especially when playing music at high volumes?", "date": "08 Feb 2017"}, {"text": "You can't judge a device only by camera, RAM and software. There are lots of factors. In short take a demo of the device first and than decide to buy. It doesn't mean that if your friend says that X device works great or you believe one like a review about a Y device and than bought it. Most of the times you will get frustration.", "date": "06 Feb 2017"}, {"text": "Agree with you. Spending on a good branded device is far better choice than saving by buying on cheap product. In the long run the later cost double or triple including mental tension.\n \r\nI also use only Samsung galaxy devices for last 4/5 years. Started with a humble S7392 (popular as Galaxy trend), still it is working now and I have just changed the battery. Than few months back I got an On 7 Pro, a J Max and A5 (2016) for father. Also after getting 2 JIO SIMs I bought another J7 Prime for official purpose. All these devices are running well and I am sure they will work for at least 2 years without any issues. Last but not least all those 4 devices are using one JIO is a primary SIM and the JIO apps are running well.\n \r\nLike you are planning to buy a Google Pixel, I am saving for a Galaxy Edge also.\n \r\nRegards and respect.", "date": "06 Feb 2017"}, {"text": "If you're a sporty type who loves outdoor activities, go for the smaller iPhone SE as you won't feel it in your trousers pocket. I've used different 5\" phones before. Believe me, 4\" is the sweet size. Today's young people are handicapped by 5\" phones because they have to carry it on their hand everywhere they go. Yeah, people will argue that 5\" phones fit in their pockets, and they do. But when you sit down, it just doesn't feel so good. I've everywhere for 4\" Android phones with good cameras (>8MP). Funny thing, they just don't make it. ", "date": "06 Feb 2017"}, {"text": "Agreed!I do not like this phone at all.", "date": "05 Feb 2017"}, {"text": "I was expecting more than 12 megapixels but all other specs were good 4.9 Stars", "date": "04 Feb 2017"}, {"text": "this phone literally has the best camera of any smartphone, it's not a matter of opinion it's a matter of specs you complete weapon", "date": "03 Feb 2017"}, {"text": "The camera on this phone is NOT good, so disaponted!", "date": "03 Feb 2017"}, {"text": "Both are good. Chose any you like.\n \r\nNeed lots of free apps, go for Pixel.\n \r\nNeed closed and stable OS, go for iPhone", "date": "03 Feb 2017"}, {"text": "Iphone 7 or Google Pixel?", "date": "02 Feb 2017"}, {"text": "Same feedback...amazing phone...really happy with the performance...impressed with it instead", "date": "28 Jan 2017"}, {"text": "I agree. Especially as they do not even last that long. If you think also of the labour hours of the average working class person. It is a lot of wonga. Google nexus range was my limit", "date": "23 Jan 2017"}, {"text": "I have been using nexus 5 for 2 and half years. If you plan to change ur phone every after one year then you should go for the phones like geonee, vivo, micromax etc. this phones start laging after 2/3 months. I have friends who uses these types of phone and each after one months they give factory set up. In my whole tenure of nexus I did it only once. all of my those feiends who used those non brand phone they changed their phone after 10/12 months. and thy bought another mobile of good brand(samsung,htc,I phone)so they spent the same money in two times l. and I spent once. o m still using nexus without any problem. amd now I m plannig to biy PIXEL", "date": "23 Jan 2017"}, {"text": "And given all the choices in phones available, it seems by comparison the Google Pixel and Google Pixel XL are plain flat-out ripoffs.", "date": "23 Jan 2017"}, {"text": "You forget one fact- one+ uses base of same Google's software to run its show. It's software is not independent or different. It's just a modified version of the same as used by Pixel.yet It needs higher ram than Pixel.\n \r\nAll those who claim to be better than Google Pixel, should not forget that their existences are coz of free software base that Google provided them.if it had been paid software,then even OPPO VIVO GIONEE would be as costly as Pixel.\n \r\nPrices of Pixels are high coz it is a premium offering by Google. You have choice not to buy.\n", "date": "22 Jan 2017"}, {"text": "Personally, $350 is my limit. Sooner or later, the price of flagships reach this pointin time when I can finally afford them after patiently waiting for the price drop. \n \r\nA $400 phone is just overpriced.", "date": "22 Jan 2017"}, {"text": "This phone is way tot expensive for Â\u0080980,- i preffer the oneplus 3(t) which has more GB RAM and a better software. The FPS is also much higher you van buy this SmartPhone for at least Â\u0080440,-", "date": "10 Jan 2017"}, {"text": "the camera of this device is awesome hope, so the development of device is also awesome!", "date": "08 Jan 2017"}, {"text": "i am facing error on installing gapps 6.0 on my device i used this   package for my device. Help me !\n \r\nThank you ", "date": "08 Jan 2017"}, {"text": "my solution to you @Ady254k is replace your phone with j7 prime so you will not suffer from your issue in your device....j7 prime is a good phone over all its a elegant design and better performance over all", "date": "07 Jan 2017"}, {"text": "Bought this phone in the first month of its release and it is giving me major errors less than 2 months away.  \r\nFirst up were random hanging of the phone specially the phone dialer app. Next came camera app freezing issues. After that came HARDWARE issues.  \r\nI spoke to the Google support center and they asked me to show the product at the nearest service center which was in Noida, whereas I am based far away from that. I went all the way to Delhi then to get the phone fixed.  \r\nThe hardware issue was sorted out in 2 days but less than 2 days later more trouble arrived: \r\n1) The selfie camera doesn't function properly \r\n2) Phone app hangs every now and then \r\n3) The system is using unprecedented amounts of data (40GB in less a week) thereby finishing of monthly data limits. \r\n4) The system is not moving to the next update for some unknown reason \r\n5) Random calls do not go through at times\n \r\nBuying a premium phone from Google, this was surely not expected. Can't expect so many issues from such a premium device from Google. I have been an avid Android user since the very beginning and clearly this has been my WORST experience so far.  \r\nI have been using the Day Dream device on the phone, that surprisingly does well till now. I am sure with the way things are, soon enough that too will start getting all sorts of glitches.  \r\nDefinitely not happy about the product. \r\nMUST NOT BUY. ", "date": "05 Jan 2017"}, {"text": "Such a bs. Been using this phone and it's awesome. So fast, awesome camera, long battery life, fast charging. ", "date": "05 Jan 2017"}, {"text": "a great phone.i saw one from my american friend and it was so cool.please distribute this phone to africa too..we are sure to want it", "date": "04 Jan 2017"}, {"text": "What about its battery backup?", "date": "30 Dec 2016"}, {"text": "Don't blame iPhone users, Samsung users are way more aggressive", "date": "29 Dec 2016"}, {"text": "Yes because iPhone users can't accept that Apple would be bankrupt so they try their best to bring down android phones. I feel sad for Samsung because of Note7. Hahahaha", "date": "28 Dec 2016"}, {"text": "Hi everyone one. Am using Google pixel XL since last month. It excellent phone without any issues. Also it super fast. Once you started using it, you will really start love this phone. If you are looking for a budget phone, I recommend Nexus 6P. That was my previous phone.", "date": "27 Dec 2016"}, {"text": "There is no such issues. That's only gossip from iPhone users. Am using pixel XL last one month. It's exciting phone with no issues at all..", "date": "27 Dec 2016"}, {"text": "looks like u didn't get that sarcasm", "date": "27 Dec 2016"}, {"text": "Google is having hard times to keep up with the Pixel demand, but the company is also having a hard time keeping up with the issues regarding the phones. After already several big software-related issues, including the audio distortion and shutdown issues, there is yet another possible major issue on the horizon.\n \r\nUsers of Google Pixel phones, both the Pixel and Pixel XL, are now reporting that they are randomly experiencing software freezes that render them unusable from anywhere between a few seconds to several minutes.", "date": "24 Dec 2016"}, {"text": "Looks just like the iphone can clearly tell that, although its a nice design having the home button on the back of the phone. By doing this they should have expanded the screen would have made it look even better than it does.", "date": "24 Dec 2016"}, {"text": "My point is simple - design and components supplier was as per Google's and only assembly line of HTC was used to put things together.\n \r\nIn Nexus times OEM had right to put their branding on device. But in Pixel it only Google. \r\nIt is known fact that pixels were first offered to Huawei, but they denied since it was not to have it's name on it. \r\nHTC is running in red, hence they accepted the offer only to assemble the stuff for Google.", "date": "23 Dec 2016"}, {"text": "nonsense, this is ipixel from apple.\n \r\njust look at the design for christ's sake!!\n \r\napple did a reversal on removing the headphone jack and moved the home button to the back. making this phone look real stunning. \n \r\ndon't try and call this a google phone. google haven't the guts to copy (outright) apple's designs....besides, everyone knows how douchey it is to be copying other people's designs.", "date": "23 Dec 2016"}, {"text": "What's your point?  This is no different than any of the previous Nexus devices.\n \r\nGoogle did not manufacture or assemble the hardware components. \n \r\nGoogle should tread carefully with this direction of branding their own phones that runs their OS.  Hardware manufacturers generally don't like this and will explore other OS options if they feel Google is encroaching on their turf.   \n", "date": "22 Dec 2016"}, {"text": "Htc only assembled it, it has been designed by google", "date": "22 Dec 2016"}, {"text": "Is it possible to  root ? \r\nInternal memory is given as 128 GB. But Google may use 100 GB. ", "date": "21 Dec 2016"}, {"text": "who is bill jobs", "date": "21 Dec 2016"}, {"text": "Hey guys, this an Android Phone from Google, and not a phone from Apple!!", "date": "21 Dec 2016"}, {"text": "best phone it is ,I really like it and bought a phone case 4 days before i get it.", "date": "21 Dec 2016"}, {"text": "I just wanted everyone to know that every thing in the above mentioned comment is without a shadow of a doubt true...the ipixel is honestly the best phone on the market and is the thing that is going to pull apple out of the ashes after the death of their leader Bill Jobs...At this rate samsoong will not be able to compete because Steve Gates only cares about himsel and making a quick buck. I hope that this comment convinces you to upvote the previous comment so maybe one day Steve Gates himself will see this and know that everyone knew samsoong was only going to go bankrupt, he will know that everyone knew his company will fail but him.", "date": "20 Dec 2016"}, {"text": "love the ipixel!!!\n \r\nfinally, apple realise their error and put back the headphone jack!!!\n \r\njust look at the stunning design by htc and glad to hear that htc finally join the apple camp to wipe out google douchebaggary ways!!!", "date": "19 Dec 2016"}, {"text": "HTC has only assembled the phone. \n \r\nGoogle designed and detailed it.\n", "date": "19 Dec 2016"}, {"text": "Point of correction, it's htc that made this phone including pixel XL ", "date": "18 Dec 2016"}, {"text": "Plus it's a premium phone, you get what you pay for in terms of performance, build quality, and how long it'll last.", "date": "18 Dec 2016"}, {"text": "I hate this design.", "date": "16 Dec 2016"}, {"text": "good but bad but alright", "date": "16 Dec 2016"}, {"text": "it uses bing\n", "date": "16 Dec 2016"}, {"text": "during this festive season, what better way to gift your love ones with this ipixel from google!!", "date": "16 Dec 2016"}, {"text": "Bro the reason of having so expensive is that Google made the phone as well as created it's own software(android).unlike samsung,sony,lg and etc .", "date": "16 Dec 2016"}, {"text": "any suggestion  \r\nk6 power or moto x play", "date": "16 Dec 2016"}, {"text": "can get a branded phone with same specification for half of its price", "date": "15 Dec 2016"}, {"text": "You are same guy writing 4 comments as if you all are different people.\n \r\nFirst anonymous talks about research about lg v20 better than Pixel.\n \r\nNext 3 anonymous commented are supporting your choice of lg v20.\n \r\nYou forget one fact that everyone you post a comment,a specific code is also mentioned besides date and time. All your comments have same code - 7kMQ.\n \r\nYou are one and same person commenting differently in support of your own comment. \r\nSilly.\n", "date": "15 Dec 2016"}, {"text": "massivley over priced!! and what i hate most is there is all that space at the bottom yet they still put home keys on the screen which i think spoils any phone", "date": "14 Dec 2016"}, {"text": "I so hope these effen greedy phone manufacturers(especially ones such as newb Google)pay the \"price\".Why you ask,'cause it's not rocket science, as mentioned earlier,it's just a freeking phone.", "date": "13 Dec 2016"}, {"text": "I like specifications ", "date": "13 Dec 2016"}, {"text": "Just like iPhone or samsung it's just a phone , a phone .?", "date": "13 Dec 2016"}, {"text": "Way over priced, bet it will be half or less in six months.", "date": "12 Dec 2016"}, {"text": "A good phone,but i dont have enough money,the price range is very high", "date": "11 Dec 2016"}, {"text": "love the phone ahd it a week and loving it. sleek smart and fast. the internals are brill they may not be the top but they get the job done. love the camera. its not a flashy phone which is good. less likley to be stolen. its suits me really well and i love it", "date": "10 Dec 2016"}, {"text": "yeah, you stick with your tracphone.", "date": "09 Dec 2016"}, {"text": "Not too impressed with it, already gone back.  Wouldn't connect via Bluetooth to my JVC car system, microphone worked intermittently and the camera produces terrible flare in most sunny conditions.  I was told that these are \"known issues\".", "date": "09 Dec 2016"}, {"text": "Google did a great Job, they did not follow the rest as everyone else did.  \r\ni love this phone. iphone not ready as yet bcuz i had a iphone 6s and it was slow as hell \r\nfouse touch was not loading fast. \r\njust this phone fast very fast. \n", "date": "09 Dec 2016"}, {"text": "tu is very right regarding the phone comments!", "date": "09 Dec 2016"}, {"text": "they are great\n\n", "date": "08 Dec 2016"}, {"text": "Pixels are a first step towards marketing Android as a premium OS.\n \r\nMarket is flooded with affordable offerings by many OEMs in low segment and mid segment. Everyone is using Android base. Nexus phones were positioned at mid segment. \r\nThere are flagships, but most have their own bloatware. \r\nIn this scenario, Android's true premium feel is lost.Due to flooding of cheap android phones by various OEM, it seemed it is popular coz it's cheap and free.\n \r\nNexus was a reference,which nobody followed( except Motorola). When Nexus line came in,it was a different time with not much OEMs.But in current time a New Nexus would have been just another phone in crowd (thanks to new OEMs and their android versions ).\n \r\nOnly way to make the difference from others was to offer something premium,something beyond the cattle herd who uses android to run the show.\n \r\nThose who cry for its pricing will never understand beyond the price tag.\n \r\nComing generation of Pixels will surely be great choice in Android world.", "date": "08 Dec 2016"}, {"text": "this phone is too expensive to be discussed.  \r\nwasn't nexus series enough to rob people ?", "date": "08 Dec 2016"}, {"text": "For me..this is a good phone..it has an almost unique design..a UI that is slightly customized by google..in a review watched it includes a otg adaptor that has a usb type c plug..though because this is bought online it'll be a hassle to find a service center..but i think the price is just right..it is not made for people who has low on budget..", "date": "07 Dec 2016"}, {"text": "Yes, thats what i've done. ", "date": "06 Dec 2016"}, {"text": "Quite you peasant. Anyone who can afford over 200 for a phone can get what they want.", "date": "06 Dec 2016"}, {"text": "Anyone paying over 200.00 for any phone is nuts !!!!!!!!", "date": "04 Dec 2016"}, {"text": "Its samsung then apple dude...check the sales all over world", "date": "04 Dec 2016"}, {"text": "Will the US version 4G band work in Europe or I should get only the global version since I live in the middle east?\n \r\nThanks", "date": "03 Dec 2016"}, {"text": "Already problems started here \n\n ", "date": "03 Dec 2016"}, {"text": "hello my dear, \r\nwhat you get on a Google pixel is not unique nor something special, \r\n1. Android OS is the common thing in majority of mobiles from low end to high end and a free OS. \r\n2. Configuration not best in class. \r\n3. Hardware quality is also not that superior. \r\n4. Just to drive the market and to with stand from other Android ther are providing unlimited CLOUD strorage. That's it.......... \r\nJust THINK a bit, even you are comparing with APPLE there it LIES the standards.......", "date": "02 Dec 2016"}, {"text": "Good spec, but a Big price tag for the Pixel. I would definitely consider a Xiaomi Mi5 instead......Very similar spec and features, but better camera, Dual sim & dual network support, bigger battery. All at a far far lower price. You can even buy the 128gb model for a lot less than a 32gb Pixel.  \r\nXiaomi........who are they you might ask?   Probably the best known phone manufacturer you haven't heard of!   The largest phone manufacturers in the world currently are in this order:  1. Apple   2. Samsung   3. Xiaomi ", "date": "01 Dec 2016"}, {"text": "when it will get in malaysia ", "date": "01 Dec 2016"}, {"text": "Am...I was reading comments below and above all, I saw complaints about the price. How come none of the Apple fans are crying out about prices?  \r\nGoogle Pixel, after using it for a week or so, is just what I expected and wanted. Ape quality build (which is something to be expected from HTC) and pure Android. Price is where it should be. I hate cheap things. Battery is good, speed of phone is good, smoothness all around, great camera...not water resistant...wtf?! You go showerig with your phone?! Not what resistant? And the backside finger scanner is SO MUCH MORE CONVENIENT than the edge 7 I just gifted my brother with...\n", "date": "01 Dec 2016"}, {"text": "Google is in plans to slash the prices upto 35% down, to increase it's sales and to face the tuff compitation among other brands. They gona announce a week before the Christmas.  \r\nSo GOOD LUCK google!!!!! Hope at least now u might find some crazy buyer's. ", "date": "30 Nov 2016"}, {"text": "So, what alternative we have with new os version and similar specification?", "date": "30 Nov 2016"}, {"text": "RahulCR7 this is easily resolved by using a case. I would say that most people use a case to protect their phone given the excessive expense of most phones. Especially in the case of the Pixel.", "date": "29 Nov 2016"}, {"text": "Guys please don't waste your money on this mobile which is good for nothing except the brand name G. Think logically and reviews of various tests like drop test, scratch test, liquid etc and all. There is no proper service centre for this Brand and only thing which you get is stock Android and early updates that's it. In this case one can choose moto which is reliable and most successful in the market. There are plenty of options available in the market like Samsung, htc, LG, Sony, moto, etc which are of not only good build quality but after sales service and one can expect a good resale after using it for a desired period. ", "date": "29 Nov 2016"}, {"text": "Yes this the best upgrade you will be going in cell phones at last you came to know that this is 21st century .. Btw how you are planning to upgrade yourself in phones by selling ya organs ?\n", "date": "28 Nov 2016"}, {"text": "I've been using this this phone for almost a month. The OS is soo smooth, amazing camera, above average battery life (1 and half day), super awesome multi-tasking, gaming experience is mind blowing. \n \r\nThe only negative point i personally feel is the slippery design ", "date": "28 Nov 2016"}, {"text": "hTC is awesome bro", "date": "27 Nov 2016"}, {"text": "Irrelevant the way we see our phones today because competition is nose to nose approx. With all phones. But speeking frenkly i use the Lg g4 and now Lg g5 and i can say its the most reliable and strong phone i ever used. Its just an opinion. ", "date": "27 Nov 2016"}, {"text": "What a poor phone from Google. This Google PICKLE is good for nothing, after using this phone for a week I came to know that I have wasted so much of money on this stupid phone rather I would have bought samsung, Sony, or at least apple....etc  \r\nGuys don't waste your money on this, later you will regret. ", "date": "26 Nov 2016"}, {"text": "all perfect. but design? i dont like it at all... and fingerprint on back of the phone its annoying to me", "date": "26 Nov 2016"}, {"text": "Android is NOT open system, that's Google's fine tuned lie! You can't uninstall their bloatware or/and change (root) your Android system without loosing your warranty - why if it is \"open\" as they're saying to us?  \r\nOfcourse, Pixel also proves what Android really is - it is a colorful salesman's bait for masses. It is unoptimized and full of commercials and bloatwares (sometime also full of malwares, especially if you buy cheap chinese phones).   ", "date": "26 Nov 2016"}, {"text": "Don't comment if you don't know what's going on. I have Lumia 950 and it STILL gets updates, on monthly base regulary or twice a month. And it will going on. Now it's even more faster (especially camera and Edge), it is stable, friendly (you can uninstall apps without rooting the phone) and all in all Windows mobile is very good OS. Much better than Android. Microsoft sold their share and factories to Foxconn (who produces Iphone also) to focus on Windows mobile which have bright future if they continue as now. And yes, I am very satisfied with my Lumia 950, it is a really fine piece of hardware. And in next year we have to watch closely on market because Nokia is coming back. ", "date": "26 Nov 2016"}, {"text": "I currently have the google pixel and the galaxy s7 edge.  To be honest I love them both and can ever decide which one to use.  I firmly believe that the s7 edge is a better phone with all of its features and being waterproof but I still love the simplicity of the pixel.  I will switch between phones every day if not more than once a day..", "date": "25 Nov 2016"}, {"text": "its dependent on the company making the phone. The RAM and Processor usually last for 2 OS upgrades if not more. ", "date": "24 Nov 2016"}, {"text": "Many people wanted to have an Iphone that runs on Android . this why Google made this phone.", "date": "24 Nov 2016"}, {"text": "What it is that is not worth the money? Have you used it yourself OR are you just commenting based on what others say?\n \r\nCost is not for raw materials used. Cost is based on what is final product from raw materials. And above all its is software which is equally important.\n \r\nBe it APPLE iPhone or Google Pixel, a complete package of hardware and software which is priced.", "date": "24 Nov 2016"}, {"text": "What it is that is not worth the money? Have you used it yourself OR are you just commenting based on what others say?\n \r\nCost is not for raw materials used. Cost is based on what is final pro", "date": "24 Nov 2016"}, {"text": "it's not worthy for money , maximum 20 k is ok it's to cost ", "date": "24 Nov 2016"}, {"text": "Since this is made by HTC for google, i am very worried that the screen will stop working after 1 to 1.5 years. I have had bad experience with 2 HTC phones (Desire S & One M8 Eye) who's screen stopped working after 1 year of use, and am very skeptical about purchasing anything made by HTC. Sure it looks great quality from outside and all but is still not durable. \r\nAlso the price is too high to purchase at this point.", "date": "24 Nov 2016"}, {"text": "As a Developer this phone is not just a phone it is a tool for developers. Same as iPhones is it also a tool for Apple app Developers. so any other brand i will think it twice before buying them.. ^_^....Hello Pixel", "date": "24 Nov 2016"}, {"text": "a big \"NO\".does it really worth it??!!!", "date": "23 Nov 2016"}, {"text": "is the update of android version to next version (5.0 to 6.0) dependent on the processor or on RAM. or is it dependent on the company making the phone ?\n", "date": "23 Nov 2016"}, {"text": "what is it extra for such a huge price $799 ...  \r\nis it value for money.", "date": "23 Nov 2016"}, {"text": "I'm currently using Nokia 1600 and I'm planning to upgrade. So do guys think Google pixel is the right option? \r\nSawyer here\n", "date": "22 Nov 2016"}, {"text": " I'm sorry", "date": "22 Nov 2016"}, {"text": "You should probably upgrade to google pixel if you really want to upgrade because upgrading from iphone 6s to iphone 7 doesn't make sense by upgrading to pixel you should have something whole different to use. :)", "date": "20 Nov 2016"}, {"text": "The design would've been pretty much acceptable if they could keep it straight; with uniform thickness throughout, as opposed to its wedge shaped housing.  \r\nBesides the design and the pricing and the lack of an sd card support, this phone is definitely a win.  \r\nThe same goes for its bigger brother as well. \r\nMaybe the next iteration will snag a place in my pockets. Until then, i'm happy with my iphone 5s. ", "date": "20 Nov 2016"}, {"text": "i think if that one get the high security of the iPhone  ,will be better than the iPhone. ", "date": "20 Nov 2016"}, {"text": "iphone 7", "date": "18 Nov 2016"}, {"text": "Windows is a nice OS.\n \r\nWindows,iOS,BBOS are great but are not popular as android coz - they are propreitory systems not open to all. Plus apps market is limited or it is paid ones. \r\nBut very few understand that these are highly optimized systems and work smooth at minimal hardware. All those of critisize are either ones who have never used it OR they have absolute no idea about how systems work.\n \r\nAndroid is free system and lots of free apps to download ( wanted and unwanted). But it is not optimized as above systems. Even with 4/6gb rams it shows lags. But it is flexibilty of android which has made it immensely popular.", "date": "17 Nov 2016"}, {"text": "no SD Card dead phone one's your this phone suddenly crashes and you wont be able to recover your data coz you will definitely throw this when it happens'", "date": "17 Nov 2016"}, {"text": "@Gogs \r\nLumina phones are so good that Microsoft has stopped all production of them after managing to grab less than 10% of the world market. That is why you got one so cheap, MS are desperate to dump the last of their stock on unsuspecting people like you.", "date": "16 Nov 2016"}, {"text": "After using Lumia 950 and Windows (now they are really good) I have no desires to go back to Android, especially not for something expensive as that Pixel is. I've been with Android for almost 10 years and I'm sick of it. It's unoptimized garbage with lot of bloatware which you can't delete. And it's ugly, especially today with those trashy white \"material\" design. No, but no thanks. 10 years is enough. Now I'm enjoying my Lumia (pretty cheap and most underrated mobile phone today). ", "date": "16 Nov 2016"}, {"text": "Do you plan on browsing the web for 7 hours straight?", "date": "16 Nov 2016"}, {"text": "Go for Pixel! A Device that has it all and does it all! \r\nPerformance, User-friendly, Quality, Camera, Pure Google Hardware and software, lot of new technology and with a better Name to Show of than i!", "date": "15 Nov 2016"}, {"text": "Great phone \n \r\nEspecially like fast finger print. Integrated google assistant, started to use it a lot.\n \r\nCamera is absolute leader even when there is not much light", "date": "14 Nov 2016"}, {"text": "this is the sequel to the moto x.  thanks google", "date": "14 Nov 2016"}, {"text": "The iphone runs well; i had a 5 and a 6 and they delivered (for about 3 months after which battery was unbearable); but that is mainly because they can't do much...innovation, customization and overall intuitiveness is out the window with iphones - you can't even multiscreen, can't design a homescreen, nothing...it's just a bland looking and bland performing piece of technology...\n \r\nYou don't need a lot of RAM and GHz to open up snapchat or check news about Bieber or whatever iphone users do...", "date": "14 Nov 2016"}, {"text": "its pixcel all the way....this time...Iphone 7 has a real competitor....iphone struggle story begins....", "date": "14 Nov 2016"}, {"text": "LOL name one task the iphone beats the pixel at? All performance tests I've seen put the pixel squarely ahead of the iphone in every category", "date": "14 Nov 2016"}, {"text": "Sorry to tell you this, but raw specs don't matter, what matters is performance. And the iOS is incredibly optimized to the iPhones hardware which results in better performance.", "date": "13 Nov 2016"}, {"text": "Google Pixel.", "date": "13 Nov 2016"}, {"text": "I will suggest you to buy Google pixel  because it has beaten iPhone 7 in five main specifications... For further details read out TOI today edition..... ", "date": "13 Nov 2016"}, {"text": "It's not better if you want to clone SD card data, from a camera.", "date": "13 Nov 2016"}, {"text": "pixel xl coz of better technology & battery backup", "date": "13 Nov 2016"}, {"text": "i am using iphone 6s. Can any one suggest me should i upgrade it to iphone 7 or google pixel?", "date": "13 Nov 2016"}, {"text": "Removable storage on Google phones? not going to happen anyways Integrated memory is a lot better than removable storage.", "date": "13 Nov 2016"}, {"text": "LOL!", "date": "12 Nov 2016"}, {"text": "I Waited For Sony Xperia Xz. But when I watch reviews understood that phone is Overpriced Crap \r\nSony is going to hell very fastly :( another legend also going to hell like Nokia ", "date": "12 Nov 2016"}, {"text": "Android Flagship With No SD Card Slot??? Seriously Google?  \r\n.!. Hope you 'll put SD card on next gen\n", "date": "12 Nov 2016"}, {"text": "Wait for next gen Pixels.\n \r\nNexus are tried and tested gadgets. With stock Android it will surely run smooth,at least till next gen Pixels are out.\n \r\nNext gen Pixels may be better,after learning from current gen experience.", "date": "11 Nov 2016"}, {"text": "I am using nexus 5x its running smooth an great....i am planning to upgrade to pixel...should i or wait for next google phones??", "date": "11 Nov 2016"}, {"text": "I totally agree with u. It's very bad phone, has horrible sound quality especially with headphone attached .", "date": "11 Nov 2016"}, {"text": "Finally an Iphone that runs on Android.", "date": "10 Nov 2016"}, {"text": "it is made by HTC \n", "date": "10 Nov 2016"}, {"text": "HTC provides services to pixel \r\npls check it man...... \r\npixel&#128170;", "date": "10 Nov 2016"}, {"text": "I meant 62% in 5 HOURS.", "date": "10 Nov 2016"}, {"text": "@czesc \r\nI get two and a half days use out of the battery on my Pixel; and that is with 4G and WiFi on all the time. If you are using 62% in 17 hours then you are doing something seriously wrong!", "date": "10 Nov 2016"}, {"text": "May be you got the defective phone!\n \r\nPhone is awesome, The build quality and the performance is top notch (simple and yet powerful).This is the best version of android I ever used, 50% charge in just 30 mins and full battery lasting for a whole day on heavy usage. \r\njust go for it & you wont regret.", "date": "10 Nov 2016"}, {"text": "Just downloaded and installed an update to Android 7.1 Nougat. It's 66.6Mb and 'improves stability & performance'. Build Number is now NDE63V", "date": "10 Nov 2016"}, {"text": "If you are planing to buy this phone...please STOP! this is one of the worst phone I used..i exchanged it as a replacement of Note 7 exchange program and trust me next day I ran to the strore to change it and took S7 edge. The built and the software is worst! I never expected a cell phone Google like this. Battery is horrible..charged whole night..took phone to my work around 7am and 38% around 12pm!!! If you need opinion from a user..please do not buy this phone! ", "date": "10 Nov 2016"}, {"text": "no card slot??? so bad.", "date": "10 Nov 2016"}, {"text": "mate 9 is(for me) more reliable\n", "date": "10 Nov 2016"}, {"text": "Are these pixel & pixel xl completely made by google or is it combined with some any other company like htc or some other ? if i buy these phone and if i get any problem with the device then where should i repair it ? which company's service centre ? - i am from india so i dont know ", "date": "10 Nov 2016"}, {"text": "Wrong! Review posted on November 9, 2016. Check it out.", "date": "09 Nov 2016"}, {"text": "web browsing time of 7:40h seems a little weak compared to the competition", "date": "09 Nov 2016"}, {"text": "Yep, I bought 2 G4's - 1 for me and my wife.\n \r\nWe're on replacement #3 for each phone - all under warranty/at no cost, but I'm done with LG for life. ", "date": "09 Nov 2016"}, {"text": "Bro, you are correct. G4 is amazing,  Im also using LG G4. and it has Radio in it.", "date": "08 Nov 2016"}, {"text": "Rumor has it that GSMA is not going to do a separate review of the Pixel because it is so similar to the Pixel XL.", "date": "08 Nov 2016"}, {"text": "Lg G4 eh, good luck with the bootloop issues lol", "date": "07 Nov 2016"}, {"text": "No radio, no removal battery? Hmm it looks like it is designed for failure. My lg g4 is better cheaper and has all i need. The only downsize no radio too. But for a free upgrade from my carrier what can i ask more, maybe some pickles, hehe. But rhey are salty so no. Hey Google have you sold one yet?", "date": "06 Nov 2016"}, {"text": "Divyesbhai,\n \r\nGoogle Pixel can only answer if you buy one. Without buying how can it answer your question? Buy a Pixel and then ask your question. It will answer.\n \r\nAlso are you looking for a Dolby digital output speakers or looking for a phone??\n \r\nIt's a phone of flagship grade. All required things are good as it is supposed to be.", "date": "05 Nov 2016"}, {"text": "Never posted here before but I read some comments and I decided to give mine :) \r\nFirst of all, I bought the Motorola Droid Turbo like a month after it was launched and I can tell you this: IT WILL BE THE LAST MOTOROLA PHONE I WILL EVER BUY !!!!!!! \r\nThe phone is only 2 years old, maybe even less, and already the camera is dead, speaker\\audio volume is terrible (seriously, I can't use it without putting it next to my ear) and last but not least, the fact that it is Verizon makes it even worse !!! Their support is the worst one I have ever experienced !! I'm still waiting for last year Android 6 update !! \r\nRegarding the Pixel phones, I agree that their price is way to high! \r\nI was planning of getting the XL but after I found out they are branding that thing as Apple brand theirs and basically overpriced their phone just because it is a Google phone well...I will probably buy a different one ! \r\nTo sum it up, get off that tree you were climbing Google and give this phone a reasonable price !!!", "date": "05 Nov 2016"}, {"text": "Google Pixel phones in Serbia cost from 1100 eur to 1800 eur, are u f***ing insane?", "date": "05 Nov 2016"}, {"text": "Moto e3 power.. best in its range. try it only 8k. Google sucks in phone belive me ", "date": "04 Nov 2016"}, {"text": "How calling speaker output ? Is it low? Google pixel please answer\n", "date": "04 Nov 2016"}, {"text": "Its 3 days now I bought this phone for me, works awesome. Though the looks of this phone are yawning but the processor speed and camera is awesome. I am disappointed just because of charging speed. It charges in normal speed (15W). Wherein Pixel XL gets charged by high speed (18W). Like every other inbuilt battery phone it has a heating issue but that is not a big deal. Compared to Samsung S7 Edge, This phone is way better in every case. Its like Android OS in iphone. Overall i will rate 4.5/5 to this phone.", "date": "03 Nov 2016"}, {"text": "Started with SONY, currently on Motorola and BlackBerry (BBOS only) full time.\n \r\nXiaomi phones are used by few of my relatives. Nexus was work horse for my partner,who switched to Pixel XL recently. \r\nSamsung units come to me for review by some of local vendors. I get first hand experience on most Android devices,since my bro in law is an Android developer.\n \r\nI gave up after iPhone 4 battery problem and switched over to iPad mini for ios.\n\n\n\n", "date": "03 Nov 2016"}, {"text": "Yep.Spot on.Phones prices are ridiculous,and people pay because,lets face it,they are hooked/addicted.They cannot help themselves.Sure i am using one too,but some people just have to have the latest gadget.People are bored with their lives,and sure enough their phones.But in the end noone cares what phone you are using but you.If you have a Pixel,enjoy.An iphone 7plus here is close to $1700....laughable.Google Pixel was nice to hold.Since this comment is supposed to be about phone thought I should throw that in there.\n", "date": "02 Nov 2016"}, {"text": "What phone do you use Aatif Khan?", "date": "02 Nov 2016"}, {"text": "What phone do you use Harry323?", "date": "02 Nov 2016"}, {"text": "Im with you", "date": "02 Nov 2016"}, {"text": "Have you ever used any of Motorola or Xiaomi phones? \r\nThey are better and sturdy built. \r\nYou would know if you have experienced it. But your comment prooves that you have not even touched any of above 2.\n \r\nTake any Samsung and it will look pathetic in few months.\n", "date": "02 Nov 2016"}, {"text": "buy a 20k handset of any company you will get both durability and quality.. Google sucking on phones. Its seeling its name not phone.. price is high coz GOOGLE name is there. It don't deserve 57k. its should not be more than 20k with respect to specs", "date": "02 Nov 2016"}, {"text": "does it has notification LED and Auto Brightness ?", "date": "02 Nov 2016"}, {"text": "Its your opinion mate.the price is high but you have take it in your hand first before say bad words about whatever thing like this.its important", "date": "01 Nov 2016"}, {"text": "its ok for now, but in 5 months probably not as good.  typical android. ", "date": "01 Nov 2016"}, {"text": "I see GSM Arena has posted a review and battery endurance tests for the Pixel XL. Will they be posting a review and battery endurance tests for the Pixel also? If so, when is it expected to be posted to the site?", "date": "01 Nov 2016"}, {"text": "I disagree", "date": "01 Nov 2016"}, {"text": "i think its same as iphone7 max is 8 apps running ,but still ok ;)", "date": "01 Nov 2016"}, {"text": "How's the ram management, can it keep at least 10 apps in memory without refreshing.", "date": "01 Nov 2016"}, {"text": "Actually nothing new here. Mobile market is slowing down because there isn't anything revolutionary and today even cheap \"no-name\" Chinese phone is very similar to the much expensive flagship from some established company. In fact I have bought Lumia 950 just because it differs from lousy androids (also because today it's cheap and has fantastic camera). Speaking of, Lumia 950 is most underrated phone today, just like this Pixel is the most overrated. And certainly overpriced.  ", "date": "01 Nov 2016"}, {"text": "Yawn.Nothing new to see here.It seems like new phones gain a little processor power,little memory,little bit better camera,etc etc.Am I the only one that feels phones,apart from their operating systems,some of which could be better or more streamlined,have really gone as far as they are going to go for a while.The only diff I can see worthy of upgrade is if it can handle a great blur free VR experience...or if it doesn't self combust.", "date": "31 Oct 2016"}, {"text": "Google Pixel XL review is available since 28 Oct 2016 on GSMA with its Battery test. \n \r\nGoogle Pixel are being reviewed.\n \r\nPlus GSMA has complete list of detailed battery test for most of the devices.\n \r\nRequest you to use phone and information technology smartly. Don't be a literate dumb.\n\n\n\n", "date": "31 Oct 2016"}, {"text": "Why no battery test?", "date": "30 Oct 2016"}, {"text": "IPhone 7 google pixel are the best phones till now.pixel phone is high price and scaner rear.", "date": "30 Oct 2016"}, {"text": "I heard the 32gb version was gonna cost around Â\u0080800 in our country if/when it's released. No way in 800 years I'd pay that much for this phone unless I'm a millionaire! Nothing in this phone is worth that much. Nothing! Google seems to want to be the next Apple with their exclusive hardware, only accessible to people with way too much money >.> 500-600 euros would have been enough to compete with Samsung's flagships, the S7 and S7 Edge.\n \r\nAnd despite the steep price the Pixel was already sold out in the US. So there must be a lot of stupid people living there who happen to be rich too.", "date": "30 Oct 2016"}, {"text": "I disagree. I don't buy the \"more is better\" marketing hype in which over the years the screens, resolution, number of processors, and price keep getting bigger. I don't want anything bigger than 5\" in my pocket. I still use a non tablet computer for most things. I type 53 wpm I cannot do that on any touchscreen, no matter how large.", "date": "29 Oct 2016"}, {"text": "I will buy, if there is IR", "date": "29 Oct 2016"}, {"text": "Never said that.", "date": "29 Oct 2016"}, {"text": "Google had to my opinion 2 mistakes: price- I'm sure Samsung will see more sales of 7s and edge. The 2nd is screen size- not too many people will look for 5\" nowadays. The deal of T mobile will help them to sell some and some out dated technology used , i think samsung and moto give best technology , google mobile give to  much costly  , it survive so decreased priced.", "date": "29 Oct 2016"}, {"text": "why you think Apple has own factory to build iphones?", "date": "29 Oct 2016"}, {"text": "Motto and  Xiomi suck when it comes to quality and durability. Xiomi just feels cheap in hand ", "date": "29 Oct 2016"}, {"text": "Google had to my opinion 2 mistakes: price- I'm sure Samsung will see more sales of 7s and edge. The 2nd is screen size- not too many people will look for 5\" nowadays.\n \r\nThe deal of T mobile will help them to sell some", "date": "28 Oct 2016"}, {"text": "the only advantage is you will get unlimited cloud storage to store your pics and videos. I will never buy 57000 phone for just one benefit and will never recommend anyone to buy this.  \r\nMoto, samsung, Xiomi to mention few selling much better phone than this as low as 20K.. NEVER BUY THIS PRODUCT", "date": "28 Oct 2016"}, {"text": "I have an interesting observation about this phone. Of course this may not be true every where, but I just can't ignore it too.\n \r\nI was at local authorised retailer outlet of Pixel. They had put up demo handsets of Pixels,iPhones and Samsung next to each other. Most of People looking for good handset and willing to pay amount (specially Novo rich),first asked for iPhone. But after looking at Pixels next to iphones,they were curious. And after knowing that it runs Android ( though looking like iPhone) they were happy to buy it. \r\nInterestingly though on-counter person explained about Samsung also, yet 80% preferred Pixels , specially Pixel XL. \r\nIn fact Samsung counter had all its current top end handsets ( S7,S7edge and all A to Z siblings with numbers) on display. Yet it was Pixels which attracted crowd.\n \r\nMakes me feel that Google must have spent time on market research before freezing the Design of Pixels. Probably people want physical looks of iPhone but a soul of Android.\n \r\nI doubt if any retailer would be able to confirm this observation,since they may never have such specific data in place.and their overall concern shall be more on overall sales rather than such pin point observation.\n \r\nIt will be great if someone has any such or some different observations.", "date": "27 Oct 2016"}, {"text": "Few days back,GSMA had commented in one of the blog that their review handsets of Pixels have been delayed due to unknown reasons. \r\nHence, they are unable to provide with detailed review.\n", "date": "27 Oct 2016"}, {"text": "The phone is released for more than a week now. Its strange that GSMARENA doesn't have any review yet. I have the phone for last two days. Its pretty early but i think google did a brilliant job. Yes its not waterproof, and the benchmarks are not what was expected. But when it counts it delivers. The camera is very very good and the performance is phenomenal.  ", "date": "27 Oct 2016"}, {"text": "Not goof enough camera..better I buy dtek 60..high end spec and most secure smartphone and good safety", "date": "26 Oct 2016"}, {"text": "Plus others add bloatware over vanilla android which needs higher ram than normal ones. \r\nSamsungng,LG,one+, VIVO,are all examples of bloated Android.that is why your phones stst lagging in course of time,no matter ho high ram you have on board.\n \r\nMotorola has nearly stock Android. SONY has minimal add one. Xiaomi modifies the Android but it is still lightweight compared to Samsung and others.", "date": "26 Oct 2016"}, {"text": "No. \r\nPixels are going to have tailor made software , optimised for minimal hardware. Same like apple iPhone.", "date": "26 Oct 2016"}, {"text": "Everyone is not like you, most of them will opt for a cheap sd card and then they will blame the phone that it is \"slow\".", "date": "26 Oct 2016"}, {"text": "DxOMark is useless, don't bother with them. ", "date": "25 Oct 2016"}, {"text": "I'm not sure about the other specs but the camera does appear to be better on the Pixel:  ", "date": "25 Oct 2016"}, {"text": "lmao. androidcentral just posted the most logic defying review in the history of phone reviews claiming pixel is \"best overall android phone\" even though its inferior to an S7 is EVERY SINGLE CATEGORY and has the same MSRP. Oh they are also subverting the comment section to make sure nobody exposes their stupidity.", "date": "25 Oct 2016"}, {"text": "Yeah like they are not gonna make new phone next year. *cough* every single year.", "date": "24 Oct 2016"}, {"text": "too late for google pixel \r\nnext year all ram will be at least 6gGB plus sd card. \r\nin other words google pixel will be out of date.\n\n", "date": "24 Oct 2016"}, {"text": "Guys this phone is not for previously Android users. This attempt of google is only and only targeted for iphone sheeps that to iphone 6s and previous versions... because iphone users just feel at home with price , no memory card,  like siri google assistance, non removable battery,... I think lg v20 is the most complete Android powerhouse  with extraordinary camera,  audio and build.", "date": "24 Oct 2016"}, {"text": "MicroSD is nice-to-have feature, but is not necessary. I survive without it very well. ", "date": "24 Oct 2016"}, {"text": "It really matters because it will be times when you dont have access to Internet and the boom! No more space! Please delete some files, because this greedy phone dont allow MICROSD and want everything from you in our clouds to keep you watched. LOL", "date": "24 Oct 2016"}, {"text": "Is GSM Arena going to do battery endurance tests on the Google Pixel? ", "date": "24 Oct 2016"}, {"text": "i have 6p as daily driver. all my needs are met.  i do not see any advantage to upgrade to pixel. using the pixel launcher on 6p running beta 7.1.1 i wouldnt notice a difference. possibly... ", "date": "24 Oct 2016"}, {"text": "I hope it's gonna cost somewhere around the current price of a Galaxy S7 in my country. This looks like one hell of a phone I'd like to spend my monies on. But the only downside of this phone is that it has a lithium ion battery. They should have sticked to the lithium-polymer ones that the Nexus phones had. Those are the best!", "date": "24 Oct 2016"}, {"text": "It has 100mah lesser battery power than the S6 on paper. Having said that, it will last more than the S6 does because of much much better hardware software integration. Hence it should last you an entire day. ", "date": "24 Oct 2016"}, {"text": "Funny story I actually left my z3 for the pixel (regular) so far its been a good experience.", "date": "24 Oct 2016"}, {"text": "Can someone tell how the battery life of the pixel is ? \r\ni have an galaxy s6 and i have to charged it in the middle of the day most often to last until midnight. \r\ncan someone tell from their experience ? ( if someone own it here ) ?", "date": "23 Oct 2016"}, {"text": "It has unlimited cloud storage for photos and 4K videos and you get 7hrs of battery life with just a 15min charge. So . That should take care of the lack of Sd card and small battery. ", "date": "23 Oct 2016"}, {"text": "You're welcome. Those are nice devices hands down but I'm still stuck with my Xperia Z3 :)", "date": "23 Oct 2016"}, {"text": "Thanks for your interest dude! I use iPhone 6s as my daily driver and a Nexus 6P as a backup device. ", "date": "23 Oct 2016"}, {"text": "I went yesterday to a store near my home .. the google pixel xl costs 1600$ ( factory unlocked version) oh what the hell !! Are u kidding me google ???!!! The last month i bought alienware 15 oled laptop  and galaxy s7 for only 1700$ .. thank u google i will never buy it even if it cost 600$!!!!", "date": "23 Oct 2016"}, {"text": "Keep believing on yourself.. lol", "date": "23 Oct 2016"}, {"text": "Purchased the phone few days back and have been using it. I have too say this is the most pleasing android experience ever. I have used many cellphones including nexus 4 and S6 edge, but I have to say the way the software has been integrated with the hardware  - its tremendous! Camera is excellent, memory doesn't matter anymore because all photos are stored in cloud from the beginning. And the design is really aesthetic and feels extremely pleasant in hand. Battery life is good for one day. Overall it really is the (Iphone) android customers have been waiting for. \n \r\nAnd the price? Iphone doesnt have excessive features yet always has been priced the most and people bought it anyways! Pixel is for premium users and there is no denying that fact. Its a phone which is made to advertise google as a premium phone maker and not some brand with multiple variants! One thing is for sure, this is a start to something great!\n \r\nPremium users! Its your time :)", "date": "23 Oct 2016"}, {"text": "Sony XZ is the best flagship phone. Good choice.", "date": "23 Oct 2016"}, {"text": "People don't need to justify their reasons for wanting an SD Card. Just because you don't need one, doesn't mean others don't. Also, why should it be \"valid\" in your eyes? \r\nMaybe someone puts a lot of work in something you may not find valid or justified. Buy nevertheless that person cares. \r\nPersonally I do so many things with my 32GB Cass 10 card: \r\n- Over 20.000 photos (im into graphics, photoshop) \r\n- APK kits and backups (in case there's no light, no Internet) \r\n- Usually I download torrents straight on my phone \r\n- Some videos, clips \r\n- Music and e-books \r\n- Documents, pdfs \r\n- And the most important thing, I keep my ROMs on my SD Card. Whenever I feel like, I get in recovery, erase everything and flahs a new ROM without the need of cables. \r\nI won't tell you how many files I've lost for having them on the internal memory. I'm into extreme de-bloating, playing with the OS, changing it how I want it and many times when something goes wrong you get bootloops, which basically means you lost everything on the internal memory and you need to reflash the ROM. \r\nALSO, you can drop your phone, get it wet, render it useless, BUT you can always get the SD Card out and all your data si safe. \r\nThe cloud thing isn't for everyone.  For one I barely use it. What happens if you have no Internet?  Ups! \r\nAlso, I don't want my data on fuggle's hard drives.  \r\nThe bottom line is people still use them, still need them and we are many. When I pay a lot of cash on a HIGH-END smartphone there are some features that I demand. This is how the market goes. People ask and others provide. I always want waterproof and SD Card or I'm not interested from the start, no matter how gorgeous or shiny or GOOD the phone is. \r\nA highend smartphone on Android without SD Card is not highend in my eyes and many others that are into IT, graphics, photography and the list goes on. \r\nMaybe it's your who should not buy a highend phone and go for a midrange device or a Fixel :)) and let the nerds properly use a SMARTphone. ", "date": "23 Oct 2016"}, {"text": "Excuse me sir, what is your current phone in use?", "date": "23 Oct 2016"}, {"text": "SD card, IR, Dual Sim Variant, Waterproofing are the most important features that any modern flagship must have in order to be a really great phone! I dropped both Pixel and XZ for not having the IR and honor 8 for not having the dual-sim variant in my country. \n \r\nGive me a phone with no more than 5\" with a unibody design, IR, waterproofing, SD, dual-sim, USB C and take my efin money!", "date": "22 Oct 2016"}, {"text": "Dont comment on that and make your life even simpler!", "date": "22 Oct 2016"}, {"text": "I did read your explanation before I replied to the person (faizy).  \r\nYours is a genuine case and you have a valid reason and that is the why I didn't reply on your comment.\n \r\nBut most of people on here demand SD card, coz they fear they will run out of storage and other reason being - costly phone and no SD card ( other demand is of FM tuner and IR blaster for costly phone). \r\nHardly few will have genuine reasons like yours.my comment was not for you, but for those whi demand SD card slot with out a justification.\n\n", "date": "22 Oct 2016"}, {"text": "Scroll down a bit, I explained why.", "date": "22 Oct 2016"}, {"text": "Why are you worried about SD card?\n \r\nBasically SD card is external means of data storage.you have OTG option to connect other external storage devices. Plus use data cable for connecting it to computer. \r\nAnd finally if you want lot of storage, go for 128/256 GB version.\n \r\nI don't understand, people want to have SD card, high internal storage, OTG so that they can have good data storage. \r\nIt seems you are looking for a hard disk with calling options.\n\n", "date": "22 Oct 2016"}, {"text": "Don't buy it and make your life simple.", "date": "22 Oct 2016"}, {"text": "Now this is the real definition of overpriced junk. No microSD, No WaterProofing, Mono Speakers, Ugly design..... ", "date": "22 Oct 2016"}, {"text": "very good phone at this price, but there is no SD-card slot makes me little unhappy.", "date": "22 Oct 2016"}, {"text": "Phone looks awesome phone is excellent back desighn is super i saw it on Youtube water test its absolutely super 30 minutes water restriant only thing pls provide etc accessories like case etc...", "date": "22 Oct 2016"}, {"text": "You are so right!   \r\nThe phone has good specs but 3 MAJOR flaws: \r\n- No SD Card  \r\n- No real waterproof  \r\n- UGLIER than most of the phones out there  \r\nI'm getting the XZ form Sony. ", "date": "22 Oct 2016"}, {"text": "Can anyone tell me how many times digital zoom the Pixel and Pixel XL have?", "date": "22 Oct 2016"}, {"text": "I just paid $32.99 for SanDisk 128GB card from amazon. Seems to me like the cost to upgrade 32 to 128 should be less than the price I paid since the mass quantity discount of a phone production company.", "date": "21 Oct 2016"}, {"text": "It matters, yes. They're ran on a different pipeline, so if you want to copy data from the USB port to the microSD, you actually get faster speeds than simply slitting the USB port. I use my phone to clone SD cards, for photography purposes. \n \r\nHaving data on the SD card also means it doesn't get uploaded to the cloud, which is good because I don't always want to upload things to the cloud. Most cloud services I know of have been compromised at some point or other.\n \r\nSSDs also have limited write cycles, so if you're constantly writing data that you're obtaining from the cloud, it will lessen the lifespan of the phone considerably.\n \r\nHow does it negatively impact the customer? I understand from the manufacturers point of view it makes sense not to include a microSD card slot because they can sell the more expensive phone with more storage, but please remind me what your issue is against having a microSD card slot. ", "date": "21 Oct 2016"}, {"text": "Does it really matter when they give you unlimited cloud storage for images and videos (at full resolution)?", "date": "21 Oct 2016"}, {"text": "Transfer speed of SD memory its very slow... it's like difference between HDD and SSD. In the end someone like you, will blame the device because is too \"slow\"... it's not enough 128Gb?", "date": "21 Oct 2016"}, {"text": "some people has the stupid notion that having no removable memory is a feature of premium phone.", "date": "21 Oct 2016"}, {"text": "Really google? Not having Micro SD slot, what a joke", "date": "21 Oct 2016"}, {"text": "i mean this not having a removable battery is logical imo, 15minute charge for 7h\n", "date": "21 Oct 2016"}, {"text": "That doesn't always mean they are out of stock. Sales will definitely not be as good as the previous Nexus lines. Just sit back and watch the show lol", "date": "21 Oct 2016"}, {"text": "please Please PLEASE bring back the Mighty MicroSD!!! \r\nI love having a 200Gb flexible reliable internal storage solution that WHEN my phone breaks I can simply pull out intact! \r\nI don't care that the I/O is relatively slow.  It's fine for anything I use it for!", "date": "20 Oct 2016"}, {"text": "whats so new beside the \"words\"  \r\nok, so Apple and the rest did round the edges and now the rest is doing it, Apple started with the NON-removal battery, all is doing it, Apple started with NO extensible memory...and so on BUT how about a new phone like Pixel....with the rest of possibilitys and 2-3 more things; and y'all cant tell me that there is nothing else to add to a phone, please, all those geeks there and for what cause the system is the same  ", "date": "20 Oct 2016"}, {"text": "troll", "date": "20 Oct 2016"}, {"text": "That is exactly what I was thinking. \r\nThe XL has a better screen to size ratio. \r\nI was hoping it would be a little closer to the 72- 73%", "date": "20 Oct 2016"}, {"text": "Can you guys add this to the battery test list to see how it fares against the S7 edge", "date": "19 Oct 2016"}, {"text": "iPhones are utter junk", "date": "19 Oct 2016"}, {"text": "hate the tiny screen to size ratio... feels like an iphone.", "date": "19 Oct 2016"}, {"text": "Including the iPhone sht... phone with no memory is a dumb choice imo even it has 200gb internal mem or make it 1TB phone with a mem is a safe choice imo...", "date": "19 Oct 2016"}, {"text": "LOL... What about the iPhone? ", "date": "18 Oct 2016"}, {"text": "full review please ", "date": "18 Oct 2016"}, {"text": "What the fck for real people wan a phone with no memory card? Oh boy all Google phone sucks including nexus sht!", "date": "18 Oct 2016"}, {"text": "Does it have a LED indicator, or any other way to notify you of missed calls/new emails etc?", "date": "18 Oct 2016"}, {"text": "Everyone is saying no one will buy them yet they are out of stock on pre-orders. lol", "date": "18 Oct 2016"}, {"text": "IMO the bezel is still to large, if the left-right more closely from edge it will looks more classy, and then up-down too, maybe 67-70% area looks good.  Using 2,5D display not necessary, even edge display. And the edge of case too roundly. I dont know, sharpen edge looks more exclusive i think, look at some xperia design they've good design. \r\nplease take a largest internal capacity if you want to buy this, refer to it missing microSD slot.", "date": "18 Oct 2016"}, {"text": "Flop of a phone. Nexus 5 was excellent. Nexus 5X was a flop and now this super flop. Its overpriced and more costly than an iPhone! Best to look elsewhere, such was the OP3, iPhone SE, Huawei and Honor.", "date": "18 Oct 2016"}, {"text": "Haha.. lol.. :D", "date": "17 Oct 2016"}, {"text": "Pixels have forgotten all nexus Inovative designs and price structure. Used to be 550 max, much attractive. Now most dudded and tag of 1000's. Definately a pass or fail scernario", "date": "17 Oct 2016"}, {"text": "Motorola moto z force, Shatterproof, excellent design, cámara and battery. ", "date": "17 Oct 2016"}, {"text": "i wish to have this phone in Tanzania ", "date": "17 Oct 2016"}, {"text": "And micro sd.", "date": "17 Oct 2016"}, {"text": "I think my next phone going to be Moto Z Play , every reviewer saying it is no slouch using 6xx chipset plus mega battery and headphone jack and quick security updates and vanilla Android.", "date": "17 Oct 2016"}, {"text": "WOW...the new google Iphones are here..............sarcasm/off", "date": "16 Oct 2016"}, {"text": "So they wanted to compete with iphone and S7 and they came with this? \r\nReally Google? What were they thinking? They dropped the only advantage HTC had with sound quality and the main advantage the Nexus used to have in price. \r\nDo they actually think that the iphones are successful because of their big bezels, no dual sim option, no sc card, non removable yet tiny batteries, no IR, no Radio and a crapload of UI restrictions like the new unremovable searchbar that occupies 15% of the screen? \r\nThey might have lost their minds, but its to the US based customers to behave them! \r\nThey must mass boycott this notion and let them know why, so hopefully, when they will return, we will get what we really need and not what they want to impose on us!", "date": "16 Oct 2016"}, {"text": "People who are buying this phone is absolutely stupid for the price and what you are getting is nothing than Google assistance and standard android updates for only 2 years. There are tons of great android phones out there guys with exceptional value for money which this phone does not have. ", "date": "16 Oct 2016"}, {"text": "Please do us a favor fire the designers immediately ", "date": "16 Oct 2016"}, {"text": "Even huawei honor 8 better than this phone. The design just like $200 phone. Bad design but they try to sell this phone on equal price to iPhone? Big NO ", "date": "16 Oct 2016"}, {"text": "The screen-body-ratio is 69% better than iPhone 7 (65.6%) and 7 plus (67.7%). About battery the iPhone 7 is 61h endurance rating and Nexus 5x 62h, so I think will be better in the pixel.\n \r\nWaiting for the price in my country, I want it, if not the moto z play is 330 dollars with a monster battery", "date": "15 Oct 2016"}, {"text": "apple-very expensive \r\ngoogle-very expensive  \r\nas long as it is american brand it is expensive. even cars. ", "date": "15 Oct 2016"}, {"text": "Bad design, bad name, bad price. ugh.", "date": "15 Oct 2016"}, {"text": "bad design and  bad bezel,and very costly google learn from one plus or huawei and price your product", "date": "15 Oct 2016"}, {"text": "Get the HTC 10. It has a better display and sound..and it is cheaper. The display on the HTC 10 won't burn in unlike the amoled on the pixel, especially those on screen buttons!", "date": "15 Oct 2016"}, {"text": "Better to keep my HTC 10. It is almost the same, just that this pixel does not have a great sound and design like the HTC 10.  Should be a good phone, no doubts, but if you compare, there are other better phones. I use to had the Nexus 5, amazing phone! with design, but can't say the same on this pixel. :) ", "date": "14 Oct 2016"}, {"text": "bezel very bad looking.poor design and too costly.prefer Iphone", "date": "14 Oct 2016"}, {"text": "Would it be fair to say this is a HTC 10, only with a glass on the back minus audio? If it's close which would you go of out of two?", "date": "13 Oct 2016"}, {"text": "Anyone with $27 a month.  You do realize most phones are on average around this price range, right? Do you think Samsungs and iPhones are just like $120?", "date": "13 Oct 2016"}, {"text": "ok fine s7 won't explode, but if you ever drop it and glass gets shattered, (glass is ultra thin so you can count on it)\n \r\nreplace it is half the price the phone, even if screen is perfect, i would consider any other brand now ", "date": "13 Oct 2016"}, {"text": "who can buy this at such a high price?????57000.not satisfied with this\n", "date": "13 Oct 2016"}, {"text": "Thats stupid, cause the S7 has a bigger battery and it doesnt explode. ", "date": "13 Oct 2016"}, {"text": "Can any one confirm that there's a Notification LED..? I couldn't find any though...  Thanks in advance. .  ", "date": "13 Oct 2016"}, {"text": "I am nexus lover and using from last 2 year. this time they released a master piece, but price is too much 57000 approx as per current market competition. ", "date": "13 Oct 2016"}, {"text": "the power of battery is very low and the camera is not good as compraed its price", "date": "13 Oct 2016"}, {"text": "The display size is more than enough. Actually the perfect size is that of the iPhone 7. But since the width is 69.5. This phone would do. I still prefer Galaxy s7 over pixel. I hope they don't increase the size in galaxy.", "date": "13 Oct 2016"}, {"text": "for charging with the adapter provided by google, you need a type c to type c cable \r\nfor data transfer your cable is gd to go", "date": "13 Oct 2016"}, {"text": "The cost is too much than the i phone 7 . can reduce the price or add some features like SD card slot and battery life extension ......", "date": "13 Oct 2016"}, {"text": "That much price and 5 inch display, and so much less battery, u r kidding. \r\nDid google really think they can overcome Iphone with that keeping the same price band.  \r\nIphone is status, google isnt.", "date": "13 Oct 2016"}, {"text": "If it is dual SIM that would be better", "date": "13 Oct 2016"}, {"text": "Just wait until MKBHD and other youtubers review it. You will know what you are paying for\n", "date": "13 Oct 2016"}, {"text": "last time someone used 3500mAh the phone explodes lol", "date": "12 Oct 2016"}, {"text": "Why is the battery so less? Why dont you incorporate a 3500mAH battery?", "date": "12 Oct 2016"}, {"text": "LOL bottom-firing speaker? We back in 2002 now? For that kinda money and with that humongous bezel on the bottom of the front fascia, they couldn't ask for stereo speakers?", "date": "12 Oct 2016"}, {"text": "IF it was 5.2 display & QHD it would be uniqe.", "date": "12 Oct 2016"}, {"text": "This cable can work with this cable?https://www.amazon.co.uk/dp/B01KNKBC26/ref­=twister_B01LPJBX4Q?_encoding=UTF8&psc=1", "date": "12 Oct 2016"}, {"text": "Thinking same thing but HTC 10 still expensive. Still 450 GBP at our well known second hand shop here in UK (CEX). Also liking Moto Z Play and it got headphone jack .", "date": "12 Oct 2016"}, {"text": "In future, only 64GB & 128GB, no more 32GB", "date": "12 Oct 2016"}, {"text": "Very cool phone. But price is too high. Might as well go for HTC10. More features like SD card slot and also cheaper. This has VR but who asked for this?", "date": "12 Oct 2016"}, {"text": "Its like donald trump named them", "date": "11 Oct 2016"}, {"text": "LMAO even the front layout looks like iPhone...", "date": "11 Oct 2016"}, {"text": "plzz add mmc option in next phone. it will be superhit phone.", "date": "11 Oct 2016"}, {"text": "the world of android is starting to crumble. Best device outside Nexus is destroyed (Note7) and this phone is a real joke in its price.  \r\nAndroid is still a bit less behind IOS. You cannot ask for the same price.  \r\n819£ for iphone 7plus and pixel xl (128G) ...easy choice ", "date": "11 Oct 2016"}, {"text": "looks god but price dxnkfrn gdfskn ", "date": "11 Oct 2016"}, {"text": "This phone will fail. Android in price of iOS? No, thanks.", "date": "11 Oct 2016"}, {"text": "Why is there no 64GB model? That would be the best selling option.", "date": "11 Oct 2016"}, {"text": "Agree 100%. No removable battery, no FM radio, no MicroSD, giant bezels, and last but not least, price too high.", "date": "11 Oct 2016"}, {"text": "Battery capacity is too small, non removable, still Li-ion. Camera might be impressive, but how long can you operate it with that battery. Small capacity will leads to more charging, affects the battery lifespan, non-removable never a good idea. ", "date": "11 Oct 2016"}, {"text": "Htc one a9s is better than this\n", "date": "11 Oct 2016"}, {"text": "Will this phone be launched in India ? Who will after sales support for it ? Does anyone have any idea ?", "date": "11 Oct 2016"}, {"text": "There was/is a 16 GB version of M4 aqua too. Shoud have bought that 1.", "date": "11 Oct 2016"}, {"text": "The specs are nice, hope the price will be too. The color spectrum they've come up with are quite unique, isn't that right \"Quite Black\" ? lols", "date": "11 Oct 2016"}, {"text": "according to hi-tech mail.ru, just like nexus 9, pixel phones won't be available worldwide. just us and few more countries.", "date": "11 Oct 2016"}, {"text": "All AMOLEDs are Super AMOLEDs now. First generation AMOLED hasn't been in production since very very long time", "date": "11 Oct 2016"}, {"text": "what is can make this device starter new era? \r\ni think this can start new era; \r\nLG working for screen on touch ID(reader)", "date": "11 Oct 2016"}, {"text": "Anyone, pls tell me different of super amoled with amoled?", "date": "10 Oct 2016"}, {"text": "You should tell that Sony. My m4 aqua from 2015 has 8gb  of storage with 4GB taking up android and 2GB of bloatware", "date": "10 Oct 2016"}, {"text": "I am not iphone fan, even i dont like iphone, but the fact is pixel's design really looks like iphone, circle home button less. The only one special thing on this phone is \"ok google\" thing. Its more powerfull, smarter than old version. Because of i have not enough money, i will pick xiaomi resmi 3s prime. Even if i have a lot of money, i dont buy this phone. I will take gionee marathon 5 couse it has sd 821 and 4050mah battery with 7.5mm of thickness. Haha", "date": "10 Oct 2016"}, {"text": "I hope these companies stop making 32gb version now. 64gb should be standard. 32gb is just not enough ", "date": "10 Oct 2016"}, {"text": "Only after 1 year after the Nexus 5X & 6P were released, they will no longer get the latest Android OS as promised by Google; for a minimum of 2 years... Future outlook with tech advances progressing rapidly warns buyers that Google will make another phone in one years time and the Pixel and Pixel XL will be left standing alone and the newest Android OS only be available on the newest Google phone.....", "date": "10 Oct 2016"}, {"text": "This is a pure software phone. Specs aren't special, design isn't special, only the new pixel launcher and many Android updates as soon as they are released.", "date": "10 Oct 2016"}, {"text": "32 gb and no sd slot?", "date": "10 Oct 2016"}, {"text": "This phone needs more data. you can only store pictures and videos tru gmail with the used of data, using google assistance require data. but the good thing about this is when the phone sleep. even if you let your mobile data turn On , it will authmatically turn OFF unlike most of the phone that can eat all of your data by just forgetting to turn it off. Manufacturere says that its much better if you used this phone with the use of wifi. and you can charge the phone for 15 mins only and good for 7 hours. ", "date": "10 Oct 2016"}, {"text": "There is nothing really extraordinary about the  phone,all those things can be seen in other phones", "date": "10 Oct 2016"}, {"text": "i think pixel google phone is new era of smartphones i bet that has the quality....and unlimited cloud free....to bad is expensive for my pocket so i can see with my eyes", "date": "09 Oct 2016"}, {"text": "Apart from the fingerprint sensor and the snapdragon chipset, there is nothing special about it", "date": "09 Oct 2016"}, {"text": "Pixels have forgotten all nexus Inovative designs and price structure. Used to be 550 max, much attractive. Now most dudded and tag of 1000's. Definately a pass or fail scernario", "date": "09 Oct 2016"}, {"text": "I am using Nexus 5x also google phone futures and performance are too good. I am happy to see google new phone.  ", "date": "09 Oct 2016"}, {"text": "The best about this phone is it's color way names\n \r\nvery silver \r\nquite black \r\nmuch 2010 \r\npretty meme", "date": "09 Oct 2016"}, {"text": "It definitely is a huge gamble!  \r\nSpecs are good but then again one cannot be sure before using it. But I expect it to perform pretty good, if not outperform any other high end device. And Google assistant might do wonders for some.  \r\nHowever it does lack some features present in its competitors like water and dust protection (ip53 means negligible protection when compared to ip67 or ip68). Also wireless charging is not available which would have been welcome. And its definitely pricey!\n", "date": "09 Oct 2016"}, {"text": "Still thinking Google made a mistake launching these phones.Don't appeal to public, lack basically great features presents in others phones said inferior.Lets wait to see, but I don't bet in Pixels no. ..", "date": "09 Oct 2016"}, {"text": "hey u dont give useless comments. phone looks good and it has a good options compare to iphone and samsung it good", "date": "09 Oct 2016"}, {"text": "Don't know about overseas but here in Australia the telco's are quite skimpy when it comes to data! So unlimited storage online won't please many. Besides a SD card you always have it even in the not so well covered areas. ", "date": "09 Oct 2016"}, {"text": "Android is google software, and the google pixel it going to use it.", "date": "09 Oct 2016"}, {"text": "how can you  maximize the use of this mobile, yes you will get 4gb RAM but 32gb of internal memory of this mobile and cant put any micro SD card on it?!!! will next to 32gb is 128??? I bet that will be expensive mobile..", "date": "08 Oct 2016"}, {"text": "Look Ugly....... Apple and Samsung better design........... No one talk after one week............ Redmi Note 3 Again Take No.1 In Popularity ;)", "date": "08 Oct 2016"}, {"text": "Google played smart. First they matured their mobile platform through different OEMS and once they got through the Android's major nuisance as ( that annoying lag and stuttering) they jumped right in to take on the iPhone. Now they'll have more confidence since it will be Google's own hardware integrated into their own OS like NEVER BEFORR. ", "date": "08 Oct 2016"}, {"text": "So android is turning into bloatware....", "date": "08 Oct 2016"}, {"text": " Iphone 7 has 65.6% screen-to-body ratio. How are you today?", "date": "08 Oct 2016"}, {"text": "very very very very very EXPENSIVE!!!!!!!!!!!!!!!!!!!!!!!!!!! \r\nthe spec not worth its, no wireless charging like samsung \r\ndoen't reallt worth it. i would not going to buy, support samsung and iphone more worth!", "date": "08 Oct 2016"}, {"text": "The most overpriced Android offering so far. And 69% body do screen ratio? Come on, you've gotta be kidding me. Is it 2005 again?", "date": "08 Oct 2016"}, {"text": "Yawn....", "date": "08 Oct 2016"}, {"text": "But HTC logo not printed HTC must be desperate to do that", "date": "08 Oct 2016"}, {"text": "Asus Zenfone 2 ZE551ML is much nicer to use and only 1/3 on its price!!! Asus user here for 2 years and planning to upgrade ZENFONE 3...", "date": "08 Oct 2016"}, {"text": "Specs correction: The colours are actually Quite Black, Very Silver, and Really Blue.", "date": "08 Oct 2016"}, {"text": "Very, Quite, Really ... Expensive", "date": "08 Oct 2016"}, {"text": "it's designed by htc", "date": "08 Oct 2016"}, {"text": "great price great specs", "date": "08 Oct 2016"}, {"text": "It really does have chamfered edges on the back, HTC 11 :D", "date": "08 Oct 2016"}, {"text": "Just want to know the LTE chip category for Pixel XL and Pixel for US version and the rest of the world version?\n \r\nIs it CAT-9 for all or CAT-12?", "date": "08 Oct 2016"}, {"text": "They probably  applied to get the water resistance IPL certification ...but may have been told that the phone can only handle 5.3 drops of water  thus got an IP53 certification and instead of water resistance said it's splash resistant....lol lol lol....funny ....", "date": "08 Oct 2016"}, {"text": "And priced like HTC lol", "date": "07 Oct 2016"}, {"text": "it's IP53. it's barely \"anything\" resistant", "date": "07 Oct 2016"}, {"text": "Is this phone really \"Splash and dust resistant\" or is this a typo? I havnt seen anywhere else it states its \"Splash and dust resistant\". Please confirm this!!", "date": "07 Oct 2016"}, {"text": "American don't like working under pay, need good working condition, healthcare, PTO, 41k and don't support child labor.\n \r\nSo yeah we expensive worker and government taxes everything! That just one reason why its US Made things are expensive.. you not just paying for the product but paying for everything that goes in to make that product.", "date": "07 Oct 2016"}, {"text": "-No OIS -  no camera hump \r\n-No SD Card support - not need these days.. Cloud is way better \r\n-No Dual Sim support - Just go buy a Chinese phone only 3rd world country phone have it! \r\n-Not water resistant - this would have a nice feature sad they missed it!", "date": "07 Oct 2016"}, {"text": "Excellent. I don't know what miracles people want from cellphones.", "date": "07 Oct 2016"}, {"text": "It's a cellphone, buddy. What more do you want? Breast feed your baby? Get out of here.", "date": "07 Oct 2016"}, {"text": "we have seen many promising smartphones this here....some weird issues as well like explosion, no headphone jack, huge chins.....but I am waiting for Nokia to release their android smartphones which are promised to come to market at the end of this year......once they come, it will be pretty interesting to see the competition..... ", "date": "07 Oct 2016"}, {"text": "bezels, bezels everywhere.", "date": "07 Oct 2016"}, {"text": "I strongly believe that google would definitely make a great smartphone like this, the price is expensive anyway :D ", "date": "07 Oct 2016"}, {"text": "Doesn't have anything new and appealing. I think I will live with my Note 3.", "date": "07 Oct 2016"}, {"text": "Because trump", "date": "07 Oct 2016"}, {"text": "Nothing special so boooooring ", "date": "07 Oct 2016"}, {"text": "why american products are very expensive?this is very annoying. Like apple iphone 7. American products are made of gold.", "date": "07 Oct 2016"}, {"text": "from some reviews I've read, I think this google pixel is a powerful phone and google is getting serious at aiming premium users like iphone and samsung so I understand why they put pixel's price so high. I hope the newest android os is lighter than its predecessors which will be advantage.", "date": "07 Oct 2016"}, {"text": "Will there be a dual sim version?", "date": "07 Oct 2016"}, {"text": "(~69.0% screen-to-body ratio)... \r\nOnly 2770 mAh at end of 2016... \r\nI will keep my Oneplus X\n", "date": "07 Oct 2016"}, {"text": "Price in tonnes and looks Shuns.  Will get to Half of price with in two - three months. Overpricing device.", "date": "07 Oct 2016"}, {"text": "Samsung galaxy s7 better choice and design this looks like a HTC knock off design ", "date": "07 Oct 2016"}, {"text": "tell me about phone performance\n", "date": "07 Oct 2016"}, {"text": "It's really nice phone from Google. Why gsmarena doesn't showing Google in Category brand section?? You should be respect to Google because your website can't be find if we're end-user. :) ", "date": "07 Oct 2016"}, {"text": "could put hardware navigation button or speaker at the bottom -.-", "date": "07 Oct 2016"}, {"text": "Your Nexus 6P is 5.7 inches, this is only 5 inches, comparable to Nexus 5X. The Pixel XL is the one comparable to the 6P and that one has a 3450mAh battery just like the 6P.", "date": "06 Oct 2016"}, {"text": "Compared to s7 its complete crap. Dont be a fanboy", "date": "06 Oct 2016"}, {"text": "Ugly phone looks like a cheap Chinese knockoff iPhone. Except cheap Chinese phones like the xiaomi Redmi note 4 actual look nicer.", "date": "06 Oct 2016"}, {"text": "Seriously why were you expecting specs, google never use?\n \r\nSome people just moan for the sake of it!", "date": "06 Oct 2016"}, {"text": "what on earth is this pricy cost for ? \r\ni was ready to buy , but now it is not rational ", "date": "06 Oct 2016"}, {"text": "Thank you :)", "date": "06 Oct 2016"}, {"text": "Actually it's the exact same price as Apple. Nice try, but pleas do some research next time.", "date": "06 Oct 2016"}, {"text": "Not at all impressive! \r\nLooks like a half baked product, \r\nFor years google tries different product to compete with iphone but it cant even compete with the likes of samsung.  ", "date": "06 Oct 2016"}, {"text": "-No OIS \r\n-No SD Card support \r\n-No Dual Sim support \r\n-Not water resistant\n", "date": "06 Oct 2016"}, {"text": "Btw, that google pixel are made by Htc. But google want that phone are having google logo.", "date": "06 Oct 2016"}, {"text": "Upgradable storage please!!!", "date": "06 Oct 2016"}, {"text": "Well it is kinda useful when holding the phone horizontally, since that bumper allows you to hold the phone at that point without interfering with the screen. ", "date": "06 Oct 2016"}, {"text": "Can't last a day? I see bigger numbers than Nexus 6P and my 6P battery is really good (despite of that fact that because of problems with electicity at home it turned off charging 40 000 times per week and it still works!). I tested my battery many times at trips, so I used it for 13 hours of playing music via BT, browsing with LTE, facebooking and vibering for long time, gaming, took 96 photos and used GPS several times. At ordinary day I unplug it at 8am and it still have ~18% of battery at 00:30 am. And my phone changes pc for me so it's in use all the time. So that are results with smaller numbers than Google Pixel.", "date": "06 Oct 2016"}, {"text": " ", "date": "06 Oct 2016"}, {"text": "I don't understand why Google and some other smartphone manufacturers do that not elegant, not useful bottom bumper, and then they use software buttons on screen. I love how Apple, Samsung, HTC and some others use that bumper for navigation buttons, push or sensitive, it does not matter, just because they use that space, i love them for this. I hope some manufacturers will understand me and they will do top and bottom bumpers same color, and same material as screen, just use glass. I see this as a future of smartphone, i think it would feel like real premium class smartphone. ", "date": "06 Oct 2016"}, {"text": "Another lame battery, when will google realize that battery capacity is much prioritize these days. Another failed product like nexus 5. They didnt even think that theyre 2770 mah battery cant last a day?", "date": "06 Oct 2016"}, {"text": "Don't know what is google trying to prove. already nexus phones are in the market. what was the need of releasing this device separately (just to create hype) and that too with prices exceptionally high.  \r\nAlmost every Google apps fail (allo). They should focus on making apps and devices that makes sense and within the reach of common man.\n", "date": "06 Oct 2016"}, {"text": "lg you guyz gat nice product but lacks battery.phones with higher specs yet you will see 2770mah whereas other products are thinking about 5000mah and above...note: whether you manufacture your phone with the highest gpu n processor etc the phone is still useless without power.you guyz should think about your battery aspect.", "date": "06 Oct 2016"}, {"text": "HTC knock off design with HTC master piece pricing!! Google device  isn't great anymore other Android manufacturer does matter ", "date": "06 Oct 2016"}, {"text": "nexus use to be a great brand... \r\npixel is just a ordinary phone.\n", "date": "06 Oct 2016"}, {"text": "Google should strategically remains on lower price with greater value to make loyal customers in all business segments more loyal. Otherwise in this new 'Apple strategy' will cause to loose some business segments. \r\n\"Too much price with little distinguishable feature not a good new drive\"... \r\nHope HTC won't follow this style in coming years ....", "date": "06 Oct 2016"}, {"text": "I hope it's available on the Philippines. I want it for my birthday... so please make it possible on the Philippines\n", "date": "06 Oct 2016"}, {"text": "This is an ultimate device.. but \"MI 5S PLUS\"  is far much better than this with \"LESS PRICE\"", "date": "06 Oct 2016"}, {"text": "this is really an expensive one.. if price matter than i would go for an apple device.... \r\nBut overall this is a nice phone..", "date": "06 Oct 2016"}, {"text": "too much expensive......Why Google is following Apple iPhone like single sim, no extendable memory and most important with a higher price tag, technology is changing very fast.... half of the world wants the smartphone with latest spec...but not every one wants to spend this much of money on phones... coz. they won't last long...", "date": "06 Oct 2016"}, {"text": "For India Google should think abt dual-sim + a little bigger battery 3000 mAh.....no body wants to have 2 phones in their pocket....... looking at the specs its too expensive......if Google wants people to buy pixel then cost must be reasonable, especially in India. It should be around 25k. ", "date": "06 Oct 2016"}, {"text": "High price, no card slot.. i compared it to my samsung A5 2016, and i think samsung is much better.. :)", "date": "06 Oct 2016"}, {"text": "No memory card slot!\n \r\nNon removable battery!\n \r\nWhy does google even bother making a phone like this?", "date": "06 Oct 2016"}, {"text": "Less like google ,more like apple with twice the price", "date": "06 Oct 2016"}, {"text": "If you have read the news section you would know that HTC actually did manufactured these two phones. Guess you are the one talking nonsense.\n ", "date": "06 Oct 2016"}, {"text": "Costly, since it is Google... No one can beat this company neither commenting others technology...", "date": "06 Oct 2016"}, {"text": "The phone is beautiful and a bit look like iphone, anyway, the price shouldn't as high as iphone.  ", "date": "06 Oct 2016"}, {"text": " \r\nI do like this phone. But, to head on clashing with iphone's price is tad too ridiculous. \r\nWith 1.4 mm thicker than iphone with almost same expensive price range? Nuh. \r\nI always believe that phones nowadays should be lighter and slim, no worries about battery capacity since smartphones now are fast charging enabled and power banks option is now a necessity. \r\nThough nice screen size made! I like pretty much like it. \r\nHTC is keen of making thicker phones. \n", "date": "06 Oct 2016"}, {"text": "Thi pixel series phones are too much expensive. The features google is giving in pixel phones, you can get same features at moto smartphones. i.g. Moto z and so others. So, according to my thought, going towards moto is better than pixel. ", "date": "06 Oct 2016"}, {"text": "from where did you got that information .. ????  \r\ndont tell us informations u didnt sure about it .. (shit talking) -.-", "date": "06 Oct 2016"}, {"text": "Can't wait to get my Pixel &#128526;", "date": "06 Oct 2016"}, {"text": "just one thing is missing, \r\ncard slot. \r\n plzz ad it on next .it will booom", "date": "06 Oct 2016"}, {"text": "does it have usb otg? ", "date": "06 Oct 2016"}, {"text": "Yup, it's actually made by HTC :)))))", "date": "05 Oct 2016"}, {"text": "I think is expensive phone. ", "date": "05 Oct 2016"}, {"text": "Too much over priced. . If i wanna pay this much amount y should i go for it there are too many phones which have more technologies in the same cost... at this cost their is even iphone... ", "date": "05 Oct 2016"}, {"text": "HTC is involved as a contract manufacturer.", "date": "05 Oct 2016"}, {"text": "I am a normal person and I can afford this no problem?", "date": "05 Oct 2016"}, {"text": "Its HTC product . But never have any brand sign in it other than google . Thts how google done in  Nexues too .", "date": "05 Oct 2016"}, {"text": "Actually, HTC and Google teamed up to build the 2016 \"Google Pixel\" and \"Google Pixel XL\"", "date": "05 Oct 2016"}, {"text": "Just Awesome Made by Google............ ", "date": "05 Oct 2016"}, {"text": "HTC made hardware", "date": "05 Oct 2016"}, {"text": "It's actually cute however the price is too expensive. It's way better than my iPhone 6s. ", "date": "05 Oct 2016"}, {"text": "Overpriced I think.Future will tell if Google is right or wrong...", "date": "05 Oct 2016"}, {"text": "It's made by HTC :)   ", "date": "05 Oct 2016"}, {"text": "it is made by google no companies are involved in it \n", "date": "05 Oct 2016"}, {"text": "It has some amazing specs ...but the price is too high which normal people cannot afford....", "date": "05 Oct 2016"}, {"text": "100% right. A phone for nobody ", "date": "05 Oct 2016"}, {"text": "Dose this phone supports volte..??", "date": "05 Oct 2016"}, {"text": "NO , new phones became fast that's all", "date": "05 Oct 2016"}, {"text": "The phone is made by google. It's their new phone. Unfortunately it's only being sold by Verizon :(", "date": "05 Oct 2016"}, {"text": "Google should make a phone size comparison with iPhone 7 or 5s. Those has the best size for a phone. Over 5\" or 5\" means a phablet. Phone should be handle in one hand and pollex . Its the 1st smart feature of a smart phone...... hi google think twice and make pixel 2 in smaller size less than 5\". Fed-up by using over 5\" phones now......", "date": "05 Oct 2016"}, {"text": "I don't understand the hype, it has nothing special -coming from iPhone 6 & S7 Edge user!", "date": "05 Oct 2016"}, {"text": "I hate the design honestly it looks a ugly phone on the back like you broke half of the glass on the back and typical boring HTC knock off design in front.. Not worth my money ", "date": "05 Oct 2016"}, {"text": "Nice review ", "date": "05 Oct 2016"}, {"text": "As boring as the iphone. No dual sim. No sd card. No ir blaster. Chunky body that doesn't translate to marathon battery life. Overkill screen resolution that doesn't serve any purpose other than giving a marginally better VR experience that nobody is going to bother after a few nauseating experiences or after the novelty fades. Google assistant? You only talk to your phone at home or when driving unless you want to look silly in public talking loudly to a phone. For this, get an Amazon echo or Google's copycat version. And the price? Forget it. You can have the same or better specs and features at half the price elsewhere. Try oneplus or xiaomi or oppo or vivo. So what is the target market of this phone? Iphone switchers? Nope. Samsung flagship users? Nope. Nexus owners? Yes, but only a very small percentage as most Nexus owners value price:performance over prestige. In short, this phone is going to flop big time unless it captures if not all, at least most of the features android enthusiasts want in an android phone. High on the list for many android users aside from good camera and video (given) are sd card support, removable or large 4000mAh+ batteries, water resistance, ir blaster, wireless and/or fast charging, dual sim support, slimport or mhl support, option for larger (6.0\"-6.8\") screen sizes.", "date": "05 Oct 2016"}, {"text": "of course not,it is made entirely by google both from in and outside ,htc will be only manufacturing it for them,just like Apple's iphones are manfucatured by foxconn. ", "date": "05 Oct 2016"}, {"text": "I could not help getting the feeling about MS Surface to challenge iPad. Isn't Google way too late to the scene trying to recreate a \"high-end\" Android category when the market is flooded with cheap, commoditized,Android knockout?", "date": "05 Oct 2016"}, {"text": "Malaysia : /", "date": "05 Oct 2016"}, {"text": "it is made by Google ", "date": "05 Oct 2016"}, {"text": "Google does not have brick and mortar stores. But they sell via online retailers like Amazon, flipkart etc.\n \r\nWhich country are you from?", "date": "05 Oct 2016"}, {"text": "Why do you care what it is worth in 8 months? The next better SoC hasn't even been ANNOUNCED yet, won't even be SAMPLING, let along shipping in anything in 8 months. This phone will be the best of the best for a considerable amount of time, PLUS, nobody with an ounce of sanity will be replacing their phone in only 8 months.\n \r\nOn top of that, you don't buy apple, because you **can't do anything with it**.", "date": "05 Oct 2016"}, {"text": "700 for something that sh#t and ugly!?!?!?!?!?!\n", "date": "05 Oct 2016"}, {"text": "Damn that mean I can't get this phone :/  \r\nCuz my country doesn't have Google store #sad", "date": "05 Oct 2016"}, {"text": "If they say that the company make the world's ugliest phone,Google is the first", "date": "05 Oct 2016"}, {"text": "From my experience with Sony, they don't get slower, only faster :P", "date": "05 Oct 2016"}, {"text": "I doubt if they will be available. \r\nGSMA doesn't list these under HTC Brand. They are placed under Google brand.\n \r\nEven in past no Nexus was available at OEM outlets / stores.", "date": "05 Oct 2016"}, {"text": "Is this phone build by HTC? If so, will it sells in HTC store?", "date": "05 Oct 2016"}, {"text": "Ya I do know iPhone 4s got 5 years updated... My iPhone 4s has been updated to 9.3.5 ... But I must ask do ur phone slow down :) try not to lie :)", "date": "05 Oct 2016"}, {"text": "The iPhone 4s has been supported with updates for 5 years.\n \r\nGoogle take note!", "date": "05 Oct 2016"}, {"text": "I understand, but if the phone is exceptionnally optimized, it doesn't need a version better than kitkat honestly. You wouldn't know the difference. Only if you're a tech geek and want always the next best thing.", "date": "05 Oct 2016"}, {"text": "seriously i cant belive.... that VOLTE is missing", "date": "05 Oct 2016"}, {"text": "If Google was REALLY serious about taking a chunk of the market, they would do what Samsung learned with the S6 and put a SD card slot in this thing (which Samsung put back in on the S7).  That's the only reason I won't buy one of theses, no SD card slot.", "date": "05 Oct 2016"}, {"text": "I'm not so sure\n \r\nLG G3 D855 here, still a good phone but no nougat coming for it...\n \r\nThe larger of these might be an interesting replacement.", "date": "05 Oct 2016"}, {"text": "the ugliest flagship phone so far!!! under 3000mAh battery is not acceptable! and the bad thing from apple: 32/128 Gig options!!!! i need 64 Gig.....", "date": "05 Oct 2016"}, {"text": "It has NFC, correct info pls", "date": "05 Oct 2016"}, {"text": "Yes because Google don't like violence", "date": "05 Oct 2016"}, {"text": "Actually it's around 750$.", "date": "05 Oct 2016"}, {"text": "Just compare it with Samsung Galaxy S4.  \r\nThe S4 is 300$ and launched 3 and a half years ago, on the other hand Pixel is 650$. \r\nIs 350$ worth 2 Gb extra RAM and a better camera, but no card slot and non-changeable battery?", "date": "05 Oct 2016"}, {"text": "Too simple, too pricy, the Nexus line is dead and gone. Just stick to LG, who is always ahead of the competition and always innovating. Maybe they don't have the marketing capabilities of Samsung and Apple, but from Apple point of view, they will never lose their clients, as they represent a niche in the smartphone market. But as far as Samsung is concerned, they will slowly decrease in interest, the Note 7 and S7 scandal was something way too big to be ignored, especially because Samsung was seen as a top of the line phone. I have to admit that I always hated Samsung phones for their cheap build, ton of useless features, crappy software optimization, and above all, the price range. And always thought how can people fall into their marketing scheme. My LG V10 is the third LG phone I have, and honestly, even though I like this brand, I am not a fanboy or something like that, I just realised that this brand is really, but really underrated. I believe that the 3 LG Nexus versions so far speak the truth. Samsung, by the way, is on the verge of decaying as Nokia soon.", "date": "05 Oct 2016"}, {"text": "I can understand the quality and functions Google Pixel has and that the idea is to compete with IPhone7 and Samsung S7 but they could do that with a much lower prince tag... C'mon... Google has TONS of money, they could define a new standard in mobile phone scene internally but no... all they show is how greedy they are. I'm sure they will still sell tons of units, another mobile phone for the elitists, not for the common of mortals. tsc tsc. shame", "date": "05 Oct 2016"}, {"text": "its strange Google has made apparently high end phones with such thick bezels and very ordinary looks at least from front. I'm curious about camera performance though and how the experience differs from a nexus", "date": "05 Oct 2016"}, {"text": "samsung s7 edge is the best choice ....", "date": "05 Oct 2016"}, {"text": "@ ivo    ...This phone is awesome... looks like younger bro of iphone7", "date": "05 Oct 2016"}, {"text": "nice phone~ ", "date": "05 Oct 2016"}, {"text": "Please send me link", "date": "05 Oct 2016"}, {"text": "Looks like cheap motorola phone", "date": "05 Oct 2016"}, {"text": "That's because most of the stuff imported from us to india is always expensive", "date": "05 Oct 2016"}, {"text": "LTE means 4G...read the specification carefully.", "date": "05 Oct 2016"}, {"text": "yes, LTE means 4G", "date": "05 Oct 2016"}, {"text": "Costs as much as an iPhone and looks like a poor man's iPhone, honestly. These devices are missteps by Google in my opinion. Time will tell.", "date": "05 Oct 2016"}, {"text": "This phone does not have sim card slot", "date": "05 Oct 2016"}, {"text": "Why is it so expensive? It costs like an iPhone! Way too much nowadays!", "date": "05 Oct 2016"}, {"text": "hahahahahahahaha", "date": "05 Oct 2016"}, {"text": "This phone costs 56,000 in India. The xiaomi Mi 5s has the same Snapdragon 821 chipset and aluminum body but it will not cost more than 25,000. What was Google thinking?", "date": "05 Oct 2016"}, {"text": "No, This comes with 2G", "date": "05 Oct 2016"}, {"text": "Will this be available worldwide? Nexus was not.", "date": "05 Oct 2016"}, {"text": "No..it only supports..GPRS...", "date": "05 Oct 2016"}, {"text": "Does anyone know the price of this phone?", "date": "05 Oct 2016"}, {"text": "Expand 'Network' section..", "date": "05 Oct 2016"}, {"text": "Yes, it support LTE aka 4G", "date": "05 Oct 2016"}, {"text": "U will get the same Spec in paper not in actual performance. This phone is made by HTC under Google Platform. Should be Amazing Phone. Waiting for Release Date.", "date": "05 Oct 2016"}, {"text": "lte means 4g", "date": "05 Oct 2016"}, {"text": "this phone cost less than iPhone7 nor 6 ", "date": "05 Oct 2016"}, {"text": "Is this device supports 4G ?", "date": "05 Oct 2016"}, {"text": "Yes, Even i don't want to spend such a high amount to this ordinary phone. Lot of options available in the same specification with less amount. So it is useless to spend high amount to this phone.  \r\nSo sorry google. Better luck next time.  \r\nTry to innovate something new. ", "date": "05 Oct 2016"}, {"text": "nope. they used cat 9-12. see the specification on google site.", "date": "05 Oct 2016"}, {"text": "Does it support a micro SD card?", "date": "05 Oct 2016"}, {"text": "Whether its going to support pen drive or not ?", "date": "05 Oct 2016"}, {"text": "Why spend so much on Pixel when you can get the same specs at a reasonable cost! \r\nWhat happened with 5X and 6P is gonna be same with these phones. \r\nFail.", "date": "05 Oct 2016"}, {"text": "yep\n", "date": "05 Oct 2016"}, {"text": "Does it support 4g and what will be the price", "date": "05 Oct 2016"}, {"text": "no sdcard and limited storage with over-priced hardware??\n \r\nbasically this is a icrap 7 with the home button at the back and google forgot to remove the earphone jack,thus missing the chance to grab more money by forcing people to buy air-p(ixels)ears.\n \r\nno amount of rebranding is going to set this \"new\" pixel phone from icrap phones.unless they start offering what crapple cannot, this is just another icrap phone wannabe.", "date": "05 Oct 2016"}, {"text": "Exactly.. could have made really a compact phone with 136mmX68mm.. That would be awesome for pocket friendly minded folks..", "date": "05 Oct 2016"}, {"text": "mad pricing\n", "date": "05 Oct 2016"}, {"text": "there is no duel sim on it", "date": "05 Oct 2016"}, {"text": "why the huge bezels", "date": "05 Oct 2016"}, {"text": "Yes they did.", "date": "05 Oct 2016"}, {"text": "Yes. Nexus is dead", "date": "05 Oct 2016"}, {"text": "One plus agrees to disagree with you...", "date": "05 Oct 2016"}, {"text": "This happens when you dont let htc make the design", "date": "05 Oct 2016"}, {"text": "Google changed the name of Nexus devices to Pixel", "date": "05 Oct 2016"}, {"text": "At least Google didn't remove the headphone jack. LOL", "date": "05 Oct 2016"}, {"text": "lol", "date": "05 Oct 2016"}, {"text": "Qualcomm SOC are the second  best affter A10 chip from apple,Exnoys are third ,mediaTek is a joke ,anyway position 4 does not receive a medal.No hard feelings on MediaTek", "date": "05 Oct 2016"}, {"text": "Wait!!!,is that my htc one A9 brother???? Your father from Taiwan visit US ,and fall in love with Google ,Google conceive and have a son named Pixel.How i will be explaining to my htc one A9.The similarities are all over ,even the back/ home/ recent buttons are a copy cut from htc theme store.The only difference here is fingerprint positioning,SD 821,botton antenae the rest is a slight difference from A9", "date": "05 Oct 2016"}, {"text": "144mm tall. Too much for a smartphone. Should be 134-135mm tall with 4,7'' screen.", "date": "04 Oct 2016"}, {"text": "Has Google discontinued the Nexus line?", "date": "04 Oct 2016"}, {"text": "So am I .", "date": "04 Oct 2016"}, {"text": "Complete phone but one issue \r\nThey used cat 6  \r\nI don't know why they didn't use 9 or 12.", "date": "04 Oct 2016"}, {"text": "32gb built in, no sd card, no water proofing, no wireless charging and have the looks of a baby born from iphone 6s and 5c marriage.. definitely not worth $650!!", "date": "04 Oct 2016"}, {"text": "AMOLED and on-screen buttons - welcome burn in .", "date": "04 Oct 2016"}, {"text": "Plot twist: this project is not only running an operating system.  \r\nIt's also running out of ideas for the design. ", "date": "04 Oct 2016"}, {"text": "Their phones are also garbage. ", "date": "04 Oct 2016"}, {"text": "Can't believe after such a long anticipation, Google didn't even include water and dustproof on this device. And frankly, other than the Google assistant and Daydream compatibility, there is really nothing ground breaking. As a die-hard Google fan, I am really disappointed this time.", "date": "04 Oct 2016"}, {"text": "OnePlus 3. That is all. ", "date": "04 Oct 2016"}, {"text": "Unimpressed. Same price as an iPhone 7, so despite being technically superior my daughter will want to follow her sheep-like Apple-following pals. \n \r\nGoogle, is starting to stand for too little, too late. ", "date": "04 Oct 2016"}, {"text": "Do I dislike Qualcomm's SnapDragon SOC's or what! I prefer Exynos, Kirin, Spreadtrum & MediaTek.", "date": "04 Oct 2016"}, {"text": "Totally agree. We dont expect google to compete with HTC, LG or Samsung. But to always raise the bar of how much need to cost a phone with good specs.", "date": "04 Oct 2016"}, {"text": "Xiaomi is still cheaper ...", "date": "04 Oct 2016"}, {"text": "Last years 6P 'nexus' also wasnt cheap.. Why suddenly b.tch about googles price one year later?\n \r\nP.S. Days when customers cry about price is GONE! If customer wants to buy the device then he spends no matter the cost! Apple or Samsung is great example! They are releasing flagships for few years now with even 1000Â\u0080 price tags and ppl buy them, if you cant afford to place all the cash on counter there are many 'contracts' and so on! \r\n Google now also shifted and now follows the same money making principle. Only fair game... \r\nP.S. 'Affordable' is not a trend anymore! ;)", "date": "04 Oct 2016"}, {"text": "I think you could consider a Nexus 6P, a Oneplus 3, or a moto z play.", "date": "04 Oct 2016"}, {"text": "Where is OIS (Optical Image Stabilization).....?", "date": "04 Oct 2016"}, {"text": "Internal non removable battery? A bad phone!", "date": "04 Oct 2016"}, {"text": "The design is like an iphone", "date": "04 Oct 2016"}, {"text": "£599 for basic Pixel in UK? I'm genuinely shocked...", "date": "04 Oct 2016"}, {"text": "oneplus 3", "date": "04 Oct 2016"}, {"text": "say what?", "date": "04 Oct 2016"}, {"text": "This phone is designed by Google. \r\nOlder Nexus phones weren't designed by Google.", "date": "04 Oct 2016"}, {"text": "Theres no camera bump because the whole phone is a thick slab at 8.6mm vs iphone7 at 7.1mm", "date": "04 Oct 2016"}, {"text": "just buy the one plus three", "date": "04 Oct 2016"}, {"text": "Well I waited and do want one but not at that price. Another device crossed off my list.", "date": "04 Oct 2016"}, {"text": "The unlimited photo and video storage is enough for this phone to be named best in the world for the majority of people now and 5 years from now until someone makes the same offer. Couple this with \"maybe\" the best camera, google updates, best Android chipset and an Amoled screen, it's enough to recommend this phone for everyone at $650.\n \r\nIt does lack Samsung's screens, the bezels are HUGE and the device itself really doesn't look that good(in photos at least), but the above pros might make it a better deal than the Note7 and for sure it's better than the iPhones.", "date": "04 Oct 2016"}, {"text": "I expected something extraordinary from Google but nothing new.", "date": "04 Oct 2016"}, {"text": "Just unfavorited once I saw the cost", "date": "04 Oct 2016"}, {"text": "100% with you. Why get this over iPhone? At least with iPhone you can sell it after 8 months and get 80% of the money back while Android pones drop in price like no tomorrow. This is $900 CAD and I can pick Galaxy S7 for $550. ", "date": "04 Oct 2016"}, {"text": "£699 For the 128gb version!!!!!!!\n \r\nGoogle are insane! This all looks nice and pretty, but that price is lunacy. \n\n", "date": "04 Oct 2016"}, {"text": "But he speaks the truth, as a big follower of Google phones its overpriced and goes against the core principle that defined a nexus phone in the past", "date": "04 Oct 2016"}, {"text": "Who is the producer of this phone. It's LG or Huawei again?", "date": "04 Oct 2016"}, {"text": "Price is very costly and battery is very low 2770mAh in terms of other competitive phones which is low in cost as well.", "date": "04 Oct 2016"}, {"text": "Seems like a good phone but price is too costly.", "date": "04 Oct 2016"}, {"text": "starting from 649 USD?! This must be a joke with poor taste... Price/performance was the greatest advantage of these phones... Google finally has ruined that... What can be bought that is closest to nexus in that sense?", "date": "04 Oct 2016"}, {"text": "your comment is useless, unwanted and obviosly not helpful at all.", "date": "04 Oct 2016"}, {"text": "lol", "date": "04 Oct 2016"}, {"text": "Design remains me iPhone", "date": "04 Oct 2016"}, {"text": "It looks just like any generic smartphone, esp in white. Only the back might differ slightly. That small battery bleh! 3000+ is what's in these days guys.", "date": "04 Oct 2016"}, {"text": "But Redmi Note 4 is inferior and LG G3 is outdated", "date": "04 Oct 2016"}, {"text": "Are you surprised? Most flag ship model don't have this...", "date": "04 Oct 2016"}, {"text": "i wonder if they will make the mini version of this, at least 4'3 inch, getting tired  seeing phone getting bigger lately", "date": "04 Oct 2016"}, {"text": "Stop bashing HTC. the HTC 10 have higher screen-to-body ratio(71.1%) WITH fingerprint scanner + navigation keys + OIS selfie camera. This is totally the big G's fault.", "date": "04 Oct 2016"}, {"text": "not support dual sim = useless", "date": "04 Oct 2016"}, {"text": "I hope it support dual sim.", "date": "04 Oct 2016"}, {"text": "It really doesn't look like an HTC at all, I'm surprised that this is true. And also, I'm even more suprised that Google chose to work with HTC this year, we all know how HTC is doing at the moment.", "date": "04 Oct 2016"}, {"text": "Not worth the price\n \r\nI rather get a Xiaomi redmi note 4 or an LG G3 which is super cheap now", "date": "04 Oct 2016"}, {"text": "This is great!, an Iphone with Android installed", "date": "04 Oct 2016"}, {"text": "I was waiting for this release but I utterly hate the design. I am not a woman so don't think that bigger is better so rather but LGs G4 with same dimensions but 5'5 screen. \r\npeace", "date": "04 Oct 2016"}, {"text": "Google Pixel is made by HTC. It is google branded. Tech specs is of google but made by HTC\n", "date": "04 Oct 2016"}, {"text": "google is not manufacturing, actual manufactures is HTC.", "date": "04 Oct 2016"}, {"text": "Designed by google manufactured by HTC.", "date": "04 Oct 2016"}, {"text": "Apparently HTC are the ODM so disregard that part.", "date": "04 Oct 2016"}, {"text": "Google have 'made' phones in the past. The Nexus series; though they would sell the rights to this off to other manufactures such as Huawei. This will be the first phone that they have manufactured themselves. \r\nAdditionally; it's probably likely to have or at least support Andromeda (Android + Chrome OS fusion) for its operating system.", "date": "04 Oct 2016"}, {"text": "Its H/W made by HTC and S/W by google", "date": "04 Oct 2016"}, {"text": "Not impressed", "date": "04 Oct 2016"}, {"text": "it was designed by google and produced by htc also htc was i part of google idk if they are still. but it is also pure android ", "date": "04 Oct 2016"}, {"text": "Well apple does the same and its called revolutionary, whats wrong if someone else does it?", "date": "03 Oct 2016"}, {"text": "Google is manufacturing phones now.", "date": "03 Oct 2016"}, {"text": "htc", "date": "03 Oct 2016"}, {"text": "why is this phone branded google ? \r\nis google now making phones or is some other manfacturer building this phone in google's name?\n", "date": "03 Oct 2016"}, {"text": "If it's the same cpu as the larger one then I'm in. \r\nI went from the nexus 5 to iPhone 6s because the new google phones had \r\n- only premium on a large phone...too large for me \r\n- not enough memory on the smaller one (I wanted over 64gb)\n \r\n6s filled all those requirements plus some (yeah, yeah...I know, android is better etc...)  I did jailbreak it though so I could add more use to it.\n \r\nIf they put wireless charging back, then that'll be excellent.   \r\nI don't think for a minute google will put an sd card in...their cloud business makes too much.\n \r\njust one pro and con though if I did get this...\n \r\nPro...woohoo, back to a decent os I can mod and install basically what I like to do what I want...eg; auto changing wallpapers....\n \r\nCon...I will miss the 3d touch, it has become useful in ios10.  I kinda hope google add this but I doubt it will be a smooth as apple.\n \r\nCome on wish list...come true...only hours to go now!", "date": "03 Oct 2016"}, {"text": "its seams like a good option....", "date": "03 Oct 2016"}, {"text": "This could actually be a very good phone. If it works out I'm buyin' it, especially if it's gonna cost lower than Samsung phones.", "date": "03 Oct 2016"}, {"text": "Still does not come close to LG G2 from 2013. Pixel has larger body, smaller screen, smaller battery. Why can't they do another G2 with updated chipset?", "date": "03 Oct 2016"}, {"text": "if this phone is 8.0 mm or below.. its gonna be a perfect phone", "date": "03 Oct 2016"}, {"text": "No it is now copy of ipony. This offers much more than ipony.", "date": "03 Oct 2016"}, {"text": "any phones on Android always have bloatwares, we can keep dreaming of our phones on their platform to have no bloatwares", "date": "03 Oct 2016"}, {"text": "Because its not a iPhone that why you should buy it", "date": "03 Oct 2016"}, {"text": "sd card support? \r\nthat's not can happen.\n", "date": "03 Oct 2016"}, {"text": "Its not a fake iPhone. It is google's flagship device. It is another version of nexus but just named pixel....\n", "date": "03 Oct 2016"}, {"text": "An android phone would never be a copy of an iPhone.  The flexibility of an android device and the ability to customize it, which is impossible with an ios phone, rules out apple completely for users who take advantage of these features.", "date": "03 Oct 2016"}, {"text": "HTC to Google. \r\nGoogle we have idea.Let copy anttena strips and edges from iphone and back design from honor 8 to make it difficult to sue us lets put very strange back panel that was never seen before.Btw we will also integrate our huge basels if thats okey \r\nGoogle:Ok we have a deal", "date": "03 Oct 2016"}, {"text": "Just because it has got a minijack?? :) and a sd card slot??  :) and it is android??", "date": "03 Oct 2016"}, {"text": "agreed !!!", "date": "03 Oct 2016"}, {"text": "Unofficial preliminary specifications \r\nDisclaimer. We can not guarantee that the information on this page is 100% correct. Read more", "date": "03 Oct 2016"}, {"text": "Now this is a perfect phone . It contains all the features that I actually wanted. Then is no unnecessary blot wares . No extra large screen. It actually fits perfectly in our hand . ", "date": "03 Oct 2016"}, {"text": "Why would i buy a phone that is copy of Iphone when i can buy a real Iphone.", "date": "03 Oct 2016"}, {"text": "There is a slot upto 256gb clearly mentioned ..", "date": "03 Oct 2016"}, {"text": "The specs look good, the front looks good, but that back looks like \"what the hell happened to this\"", "date": "03 Oct 2016"}, {"text": "Again Lack of MicroSD card slot. :-(", "date": "03 Oct 2016"}, {"text": "Must admit I am personally not liking the Pixel name Nexus is far more space age,, used to go to a few raves here in UK named Nexus.", "date": "03 Oct 2016"}, {"text": "Goes on all the time. The media drive everything in the public domain. A person could get knocked over and killed in the North of England everyday and media report nothing yet if someone gets knocked down in London(south England) its on news.\n \r\nEvery year apple is on news with its new phone what about all the other phones?\n \r\n They always name the man in an ALLEGED rape case but not the victim, when the man is proven innocent the woman should be named for the atrocity and news should give apology for tarnishing man, they never do tho.\n \r\nBackhanders and so on this world is ruled by greed.", "date": "02 Oct 2016"}, {"text": "I agree", "date": "02 Oct 2016"}, {"text": "Why not the Snapdragon 821 - see Xiaomi mi5s", "date": "02 Oct 2016"}, {"text": "An ultra smartdevice with high qualities always be upgraded and updated by Google but without independent external memory slot!!!Whys!!!?The same devices will have different tagged prices!!!A memory card of its best 64 gigs price is $20!!But the lowest internal memory to the highest internal memory cost is $1500!!An example is iPhone 7 plus with 256 gigs but $2500 dollars!!!Of course,deceptions of any kinds morally is illegal and illegitimate plus!!!But who dares write these facts factwritings about the strongest richest powerful influentials such as Google,Samsung,Samsung,etc which dictate to phone sites to delete truth and hide even minor flaws!!?In other words the mentioned brands get their shares somehow in different names!!!Today by publishing or not publishing these vivid facts,provesits ABABSOLUTE DEPENDENCE OR INDEPENDENCE!!!Trial of gsmArena has just started now based on moral faith guidelines!Thanks all mentioned names that don't get embarrassed by being just examples!!!Justice Rights Arena to prove its honor and integrity plus!!!Omid46.Justice protector!Possible!?Time proves!!", "date": "02 Oct 2016"}, {"text": "The fact that the phone is made/will be made by HTC is already a dissapointment. HTC has this inside slogan; 200 dollar specs with 300 to 400 dollar pricetag. \r\nSo that means that these $300 phones become $600+ just to call it an Flagship.  \r\nIf the Next Nexus/Pixel will be made by OnePlus you'll see the truth defenition of a Google Phone. Huawei and LG were good but no flagships, HTC must just go and stay away from Google.", "date": "30 Sep 2016"}, {"text": "Well guys, if Google phone should catch up fast, latest smart phone specs offer by Asus, Xiaomi and of course Samsaung are CPU: exacore, RAM: 4GB and Storage: 128 and SD slot up to 256GB cheers ", "date": "29 Sep 2016"}, {"text": "Finally great phone make by google, I hope it can be better spec for upcoming new phone too thanks google..\n", "date": "29 Sep 2016"}, {"text": "if there is low price around $200 using sd 615-650 quadcore(hexacore) / intel inside, ram4g dual sim, sdcardslot up to 1tb ", "date": "28 Sep 2016"}, {"text": "Does it water resistant ip something?\n", "date": "28 Sep 2016"}, {"text": "this phoney looks very old. last time i saw a phoney like this way back when i was useing my old phoney. worst phoney ever!", "date": "28 Sep 2016"}, {"text": "dat bezel tho", "date": "27 Sep 2016"}, {"text": "The heck are you talking about? Are you from 1993 tried to talk nonsense?", "date": "27 Sep 2016"}, {"text": "This post is brilliant, no multitasking as apposed to other android phones?", "date": "27 Sep 2016"}, {"text": "Besides the common specs of almost any cheaper phone than this,with design from 2011 i don't see why this device has such huge price.The high price i am guessing it's coming from the fast upcoming updates.So i guess this will get the Android 8.0 and 9.0 without any difficulties and other fast updates to Google apps.Waiting to see Geekbench results.", "date": "26 Sep 2016"}, {"text": "Google Andriod Handset are flop and they have no charm. Google have changes so many manufacturers and still no decent demand for Google Stock Andriod . Google Stock Andriod is Pentium 486 of today with no multitasking at all. ", "date": "26 Sep 2016"}, {"text": "its IP53 dude, read some news.", "date": "26 Sep 2016"}, {"text": "It's almost 2017, and they still decided to make a phone with no water/dust resistance, and no memory expansion.", "date": "25 Sep 2016"}, {"text": "Yes, Google has it's own smartphone series (Nexus). These phones are designed by Google and always get latest software, but they are manufactured by other companies (such as Motorola, Huawei, LG, etc). This year, though, they changed the name into \"Pixel\" and now HTC builds the phones.", "date": "25 Sep 2016"}, {"text": "Hi I am not familiar about with smartphones but have question. Does Google have its own smartphone? Apart of smartphone companies that use Android...  Is this the first Google owned smartphone? ", "date": "25 Sep 2016"}, {"text": "Isn't it supposed to be 5.0 inches?  Anyway, huge top and bottom bezels!!!", "date": "25 Sep 2016"}, {"text": "I would bet that Pixel will have QHD display... and sAMOLED on top  of that. \r\nWhy? Project daydream of course! \r\nGoogle will have to put low persisent amoled screen in order to work good with VR glases.And they'll need resolution for that also.", "date": "25 Sep 2016"}, {"text": "Wait, I'm sorry but what? I was just complaining about how everyone is complaining how there is no difference between the Pixel and Pixel XL. Never did I once say in my previous comment that Nexuses were the best phones during their times. I was just confused why people are complaining their difference in size despite having similar specs. I was just wondering why when I opened the comment section, I was greeted with: \"WHY SHOULD I BUY THE PIXEL XL WHEN THE PIXEL HAS THE SAME SPECS?!\" , \"THE PIXEL XL IS A BIG WASTE OF MONEY!\". That's all ¯\\_(&#12484;)_/¯", "date": "25 Sep 2016"}, {"text": "Reading all possible specs and design, i could not find where's the \"BIG thing\" many are talking about...never mind google. Just keep my pocket closed for you", "date": "25 Sep 2016"}, {"text": "\"Snapdragon 820\" Um yeah, no thanks Google.", "date": "24 Sep 2016"}, {"text": "Nobody bats an eye to Google Nexus devices, period. Many Huawei and Xiaomi phones have outsold Nexus devices. Google Nexus/Pixel devices are niche. Google is not a hardware company. They rely on Samsung and others to help sell Android which helps Google sell mobile ads. They lack retail stores for true aftercare services. They lack an ecosystem since any mobile browser in any platform can work their services. \n \r\nWhat is special about this Pixel device? Nothing except fastest software updates. Nexus devices were never really best at the features they offered. Samsung doesn't offer anything new but they excel at hardware aspects like display, battery life, camera, and recently design. Not in any given year prior was a Nexus device ever the best smartphone of the year. They never excelled in camera and battery life. They never had the best displays or audio. They no longer hold a price advantage. \n \r\n2010 - Nexus One, Nexus S. Not the best that year. Went to iPhone 4.\n \r\n2011 - Galaxy Nexus. Not the best. Weak TI OMAP SoC. Best was probably S2, 4s, N9, or first Note. \n \r\n2012 - Nexus 4. Weak glass and battery life. Poor camera and washed out display. Best was probably iPhone 5 or Note II. \n \r\n2013 - Nexus 5. Same issues as predecessor. Best was Note 3 surpassing LG G2... \n \r\n2014 - Nexus 6. Probably the first truly excellent Nexus. But best still goes to Note 4 surpassing it, OnePlus One, iPhone 6 Plus, and HTC One M8. Last Note with removable battery. \n \r\n2015 - Nexus 6P, Nexus 5X. Best probably was another Samsung with the S6 edge or + variant. Note5 took a step backwards. \n \r\n2016 - Pixel, Pixel XL. Note7, S7 edge, iPhone 7 Plus, and maybe LG V20 surpasses this. \n \r\nThe last 4-5 years a Samsung had the best overall phone even if Google's oil don't mix well with Samsung's vinegar. Samsung should leave Android. That's Samsung's main Achilles. Their software skin is no good on Android. But they excel in hardware and the only true OEM out there. \n \r\nAll you are buying is for faster software updates with Google devices. It isn't BEST in any other aspect except maybe in Android speed tests. It loses in many other areas and have zero hope it tops in camera and battery life being an HTC. Refuse to buy phones that lacks microSD slot. These Pixels are no better than the HTC 10 and OnePlus 3 with just Nougat 7.1 on it. ", "date": "24 Sep 2016"}, {"text": "Wov What a google announcement expectation for the past year now.. 2015 ? that too for a 2016 release version of android Ha ha !!!", "date": "24 Sep 2016"}, {"text": "i think that huge bezel on bottom is for the G logo!", "date": "24 Sep 2016"}, {"text": "IP53", "date": "24 Sep 2016"}, {"text": "It's been highly rumored that both the Pixel and Pixel XL will have the Snapdragon 821. Also the screen size is rumored to be 5 inches not 5.2. ", "date": "24 Sep 2016"}, {"text": "Why is everyone complaining about the sizes of the Pixel and Pixel XL? When Samsung did it, No one batted an eye but when Google does it, everyone loses their minds. The S7 and S7 Edge also didn't have any features that set them apart except for the Dual Edge screen and Larger Battery of the S7 Edge", "date": "24 Sep 2016"}, {"text": "There are various rumors out there, some say the Pixel will be 5.0\", others 5.2\". My money is on 5.0\". I saw rumored dimensions of 143.8 x 69.5 x 8.5 (mm). I'd like for the height to be less than 140 mm, but with a 5.0\" display and large bezels, 143.8 mm seems likely. Other phones I'm considering are a Sony Xperia X Compact or Apple iPhone 7. I had a Nexus 5 in the past (perfect size) and currently have a Nexus 5X (a little too big).", "date": "24 Sep 2016"}, {"text": "Since it was first rumored to be a Nexus device, some people assume there will be no card slot. But nothing has leaked about that.", "date": "24 Sep 2016"}, {"text": "Exp. announcement 2015, October\n \r\nTime travel o.o", "date": "24 Sep 2016"}, {"text": "Pixel, I really don't like that name. Sounds like one of those cheap Alcatel pixi phones. Pixi is a like a leprechaun type creature who likes to play tricks. Pixel sounds like Pixi. Don't like it.", "date": "24 Sep 2016"}, {"text": "expt announcement 2015 October !!!!!!!!!!!! \r\nlol \r\nnice spec though", "date": "23 Sep 2016"}, {"text": "If the Pixel has 64gb storage, and specs nearly identical to Pixel XL why do I need to pay for the premium?", "date": "23 Sep 2016"}, {"text": "5.2\" and 5.5\" phones?. Doesnt seem to be much difference between them... Should have been 5\" and 5.5\" phones..", "date": "23 Sep 2016"}, {"text": "No SD Card slot and no waterproof.. \r\nSuch a waste of good hardware - SD820", "date": "23 Sep 2016"}, {"text": "Not long now thank goodness,, feels like an eternity. If this works like the legendary Nexus 5 it's a winner. ok bar battery life and speaker.", "date": "23 Sep 2016"}, {"text": "HTC", "date": "23 Sep 2016"}, {"text": "i heard htc", "date": "23 Sep 2016"}, {"text": "This phone will be perfect if packed with a at least 3500mah battery inside. \r\nlower than that will be disappointing.", "date": "23 Sep 2016"}, {"text": "It is being made by HTC", "date": "23 Sep 2016"}, {"text": "Yeah, but last years' Nexuses have had their names from the manufacturers.", "date": "23 Sep 2016"}, {"text": "Exp. announcement 2015, October?", "date": "23 Sep 2016"}, {"text": "Designed by google, made by HTC", "date": "23 Sep 2016"}, {"text": "HTC", "date": "23 Sep 2016"}, {"text": "its from HTC", "date": "23 Sep 2016"}, {"text": "HTC", "date": "23 Sep 2016"}, {"text": "Pixel is 5 inch.", "date": "23 Sep 2016"}, {"text": "Same platform? it's pity. I believe that will be Snap 821/823 inside Pixel XL.", "date": "22 Sep 2016"}, {"text": "Pls is this google phone from huawei or from LG? I am not clear. ", "date": "22 Sep 2016"}, {"text": "I will really miss the Nexus named devices, Pixel does sound like a Wreck-it-Ralph name.", "date": "22 Sep 2016"}, {"text": "Plain ugly. I really hope this model render is fake. \r\nSpecs-wise I don't doubt it will be good, I just hope it's not too expensive.", "date": "22 Sep 2016"}, {"text": "Looking at the promotional video, I thought that all these leaks with an ugly design is a fake. I thought a real design will be a screen full face panel area. Now, looking at teaser sculpture, I find this idea is yet another confirmation. \r\nAt least I hope that Google and HTC will not made such ugly freaks :), this is exactly the HTC does not.\n", "date": "22 Sep 2016"}, {"text": "The Pixel is designer by Google, and Built by HTC.", "date": "22 Sep 2016"}, {"text": "5\" would be perfect", "date": "22 Sep 2016"}, {"text": "Aren't these Pixels by HTC (not google)? Sorry if I'm wrong. \r\nAlso Exp. announcement should be 2016 not 2015. :D", "date": "21 Sep 2016"}, {"text": "5.2 inches is the largest i'd ever go :D", "date": "21 Sep 2016"}, {"text": "battery, \r\nplz be good !!!!", "date": "21 Sep 2016"}]