[{"text": "Hi , I have an IPhone 5s and I want to buy a new phone . Is Huawei Mate 10 worth buying ?", "date": "11 Apr 2018"}, {"text": "My S7 Edge screen has developed a pink stripe running through it - not an uncommon problem - and insurance is replacing it. I am tired of Samsung's stupid edged screen and all its problems. It's a pain in my life, and since they don't offer a flat screen option, I'm afraid I'm done with Samsung. \r\nHello Huawei Mate 10. :)", "date": "10 Apr 2018"}, {"text": "my friend, Mate 10 has the better everyday use specs than P20 unless ur more on photography for daily use. Yes, P20 is lighter, has bigger internals and better secondary camera BUT Mate 10 has expandable storage, bigger battery life, dust and splash protection, better resolution 499 ppi and screen size, better audio quality 32-bit, and MORE cheaper nowadays :) that's my friendly opinion.", "date": "09 Apr 2018"}, {"text": "just received an update, latest version ALP-L29 8.0.0.131 (185) 429MB\n \r\nChange log: \r\nThis update improves system security with Google security patches.  \r\nOptimizations: \r\nIntegrates Google security patches released in Mar 2018 for improved system security.\n \r\nAt least HUAWEI in this model is consistent on monthly updates.\n \r\nSatisfied Mate 10 owner :)\n", "date": "09 Apr 2018"}, {"text": "sorry about your frustrations but i have had the mate 10 (non pro) for over a month now and it excels in every single department i've put it through ... if you are talking about the hybrid sim tray/sd card i can confirm its true and plus it depends on the model and your region  \r\n( i have the hybrid sim tray just saying ) ", "date": "09 Apr 2018"}, {"text": "Dearest Huawei + China quality seekers +complete GSMArena following fans.First of all I don't trust recent rumours about Huawei products !? What information do I have that even worthwhile for Huawei collecting them !!!? Above this smartphone !? Without hybrid , plus rds.Bluetooth 5.1 this phablet could have been the best smartphone of 2017-18 ! Hopefully Huawei public relations consider eradication of notorious ugliest limitation making products hopefully!!! Plus reading complete review,hopefully Huawei that can make the best do it the best!Hopefully GSMArena dares releasing the facts for the both brands and public interests....J7 pro of Samsung is made in China by China under Samsung license ! So hybrid__less is possible! Thanks all mentioned names!Justice Rights loves all quality maker products....", "date": "08 Apr 2018"}, {"text": "if you're a photography enthusiast and want a phone camera better than a DSLR, go for the p20 :)", "date": "07 Apr 2018"}, {"text": "No brainer.....MATE 10 (non-pro) 100%", "date": "07 Apr 2018"}, {"text": "Mate 10 of course, you get higher screen ppi, bigger battery, bigger screen and a headphone jack on mate 10.. The camera doesnt has much difference in comparison", "date": "06 Apr 2018"}, {"text": "Hi, which one is better? Huawei Mate 10 or P20? (PS: Currently both of them have the same price at my place and memory card slot available isn't a big issue for me)", "date": "06 Apr 2018"}, {"text": "Great phone. Used HTC, LG, Iphone & Sony before but Huawei definitely managed to outperform all rivals with their latest offerings. They have started producing the best value for money phones lately and Mate 10 is no exception. Great Camera perfromance, great battery, smooth UI with lots of customizations, proper updates and great hardware quality.", "date": "05 Apr 2018"}, {"text": "Hi I am undecided between Huawei Mate 10 and Oppo R11s.  \r\n1. Which is a better phone? \r\n2. Does Mate 10 come with slots for 2 sim cards?\n \r\nThank You!", "date": "05 Apr 2018"}, {"text": "Absolute beast of a phone. Samsung and apple have tough battle ahead.", "date": "02 Apr 2018"}, {"text": "Huawei Mate 10 Pro (Unlocked) [BLA-A09] or Huawei Mate 10 Pro Dual Sim (Unlocked) [BLA-L29]", "date": "01 Apr 2018"}, {"text": "Using this phone since one week.\n \r\nIts very nice phone i switched from Samsung to Huawei y7 Prime then Mate 10. both are good phones in price range. \r\nMate 10 camera is very nice wide aperture  blur effects in the pics are amazing. \r\nbattery is good. \r\nsound is nice and loud.\n \r\nGB\n", "date": "31 Mar 2018"}, {"text": "It's more than OK for choosing mate 10 for gamers like u ..I'm just using redmi 5 plus n play games like u mention..pubg,ML n etc..it's run smoothly on my device not to mention if using mate 10. it will be fantastic phone for gaming", "date": "30 Mar 2018"}, {"text": "Unlocked Mate 10 or Mate 10 pro will work with GSM --- T-Mobile", "date": "30 Mar 2018"}, {"text": "Apple send to other spy services ", "date": "29 Mar 2018"}, {"text": "You have nothing to worry about, it just sends your personal info to china spy servers. ", "date": "29 Mar 2018"}, {"text": "Which version is compatible with T-Mobile?", "date": "28 Mar 2018"}, {"text": "Hello, I am looking for a phone with great battery life and high RAM. Is 4GB ram enough for this phone?  Does this phone have a lot of background app running and taking up much ram, making it laggy while surfing Facebook,Youtube, or playing games like PUBG mobile and mobile legend(if compared to 6GB ram of mate 10 pro)? Does this phone has battery issue or overheating problem? What are other minor issues of this phone,if any? Thanks in advance!", "date": "27 Mar 2018"}, {"text": "Had a Nexus 6p previously. Poor battery, got too hot when used as a hot spot. Camera okay but phone died of the  boot loop disease.  Mate 10 has great battery life, a useful Leica camera and replaced the TV and blu-ray remote in my system. Screen is plenty gorgeous enough without Amoled. ", "date": "27 Mar 2018"}, {"text": "huawei mate10 or bb dtek60 ??????", "date": "26 Mar 2018"}, {"text": "why dont you take it back to the store?", "date": "22 Mar 2018"}, {"text": "Best Phone for me. of course its cheap than Samsung note 8. because its LCD and not AMOLED but still a good phone, Spec wise it's better. More battery life, Camera AI technology is good. low light shots are good. It does not heat so much, all phones overheat when you do heavy processing of course. Aesthetic is good, nice body and all I say its a pretty good phone for professionals. :) ", "date": "22 Mar 2018"}, {"text": "I have bought mate 10 and i found a problem with mobile mic and the sound comes from hand free, is this ever happened to any one? ", "date": "21 Mar 2018"}, {"text": "Thanks a lot bro ", "date": "17 Mar 2018"}, {"text": "Thanks bro ,what about camera performance in bright and dark environment ?", "date": "17 Mar 2018"}, {"text": "mate 10 f/1.6 aperture vs S8+ f/1.7 aperture. Honestly, I was quite surprised at the camera output on the Huawei Mate 10 Pro Â\u0096 the low-light shots impressed everyone in the team, too. For a few years now SamsungÂ\u0092s smartphone cameras have arguably been the best shooters in low light, but the Mate 10 Pro proved that Huawei is catching up Â\u0096 fast.", "date": "17 Mar 2018"}, {"text": "I've not noticed any over heating yet.. More than happy with this device and the battery life is amazing/ Even if I have 50% of battery life left I did need to worry about looking for a charger ", "date": "17 Mar 2018"}, {"text": "Thanks bro ,what about mate 10/ mate 10 pro camera performance compared to Samsung Galaxy S8 plus camera ?   Cos I'm seriously considering to buy any of these two phones .\n \r\n Secondly ,does mate 10 lag at all ?please I need your honest opinion.", "date": "16 Mar 2018"}, {"text": "no heating isue only little bit warm when i play mobile legends. powerful phone for me. i like it very much.", "date": "16 Mar 2018"}, {"text": "Main thing is S8 battery cant even last a day while mate 10 can easily survive 1.5 - 2 days. Others specs about the same, just based on your preference (design/large screen/emui or samsung ui. Search youtube for the differences.", "date": "15 Mar 2018"}, {"text": "Samsung 8 or Huawei mate 10 ? for all around performance pls help..tnx\n", "date": "15 Mar 2018"}, {"text": "Please guys ,does this mate 10 or 10 Pro have any heating issue under normal usage ? ", "date": "15 Mar 2018"}, {"text": "16:9 way better than 10 Pro's 18:9!  Do wish it was AMOLED though. ", "date": "14 Mar 2018"}, {"text": "Thanks man ", "date": "12 Mar 2018"}, {"text": "does it overheat while gaming?and how is the audio quality via headphone jack?", "date": "12 Mar 2018"}, {"text": "mate 10.....if u still curious abt it just youtube it ", "date": "12 Mar 2018"}, {"text": "Which better to buy .. \r\nLg v30 or Huawei Mate 10 ?", "date": "11 Mar 2018"}, {"text": "but what about long term usage, it is known that android phones come slow after awhile??", "date": "11 Mar 2018"}, {"text": "My Mate 10 has the same build", "date": "10 Mar 2018"}, {"text": "My latest build number is ALP-L29 8.0.0.131", "date": "10 Mar 2018"}, {"text": "Go for mate 10", "date": "10 Mar 2018"}, {"text": "gaming sot??", "date": "09 Mar 2018"}, {"text": "The Mate 10 is better than the iPhone 7.", "date": "08 Mar 2018"}, {"text": "Hi guys, please huawei mate 10 vs oneplus 5T, which one has a better camera in bright and dark conditions? \r\nThanks ", "date": "08 Mar 2018"}, {"text": "mate 10 is an android phone. iPhone 7 is an iOS. Fingerprint on Mate 10 is very quick and responsive. Mate 10 have dual lens while iPhone 7 dont. Battery on Mate 10 is much better than iPhone 7. Big screen and thin bezel is also an advantage for Mate 10. For me, I would choose the Mate 10 because it much worth it and i love android. Before this, i was using iPhone but now, I'm using the Mate 10. Plus, iphone 7 is a 2016 device while the Mate 10 just realeased last year. Iphone 7 has a iP67 certified while the Mate 10 has a ip53 certified. It's up to you to choose. Google those device and choose wisely. Good Luck!", "date": "08 Mar 2018"}, {"text": "Please, which is better Iphone 7 or Huawei mate 10 ??", "date": "07 Mar 2018"}, {"text": "My mate 10 also restarts on its own. Once during a call.", "date": "07 Mar 2018"}, {"text": "Mate 10", "date": "07 Mar 2018"}, {"text": "Yes slow blinking green light", "date": "07 Mar 2018"}, {"text": "I really am a basic user. I try to use the built-in apps as much as possible b4 installing additional ones from Play Store. I know very well that there's many free apps over there, but I do not want to load my phone with lots of apps even smaller ones.", "date": "06 Mar 2018"}, {"text": "hello guys. what can you tell me about led notification? does huawei mate 10 have only green light when getting the notification?  \r\nplease answer, i really wanna know ", "date": "06 Mar 2018"}, {"text": "I would hate to turn my phone over ever time I had to unlock it. Talk about inconvenient! You can use your code or pattern, but isn't that defeating the point of the sensor?", "date": "06 Mar 2018"}, {"text": "although higher performance cpu n gpu but screen motion flow is poor.", "date": "05 Mar 2018"}, {"text": "I guess you are a basic user, and no one can blame you But for your information there many video players in the play store that you can use ranging from Mx player, vlc and many more that can play your mkv videos. No one uses the native player  because they are crap and don't support many video formats, I guess now you know.", "date": "05 Mar 2018"}, {"text": "download a video player from Google Play Store.. not too many people I know use the native built-in player for their phones..I have never done it as well", "date": "05 Mar 2018"}, {"text": "Hi all friends! I own Mate 10 more than 2 months ago and so far I have not experienced any problem of charging, auto dialing, auto restart. My only problem is it cannot play videos in wmv format using the built-in video player app. I hope Huawei will fix this in the upcoming software updates. ", "date": "04 Mar 2018"}, {"text": "Camera,battery life, performance..ofc mate 10", "date": "04 Mar 2018"}, {"text": "hi,anybody hv problem with the mate10 series charging ? pls advise", "date": "03 Mar 2018"}, {"text": "which is a better buy, Nokia 7 plus or Huawei Mate 10 in terms of reliability, performance?", "date": "03 Mar 2018"}, {"text": "FUDO, What I found when I bought Sam S8+, it said '' 5hrs to full charge'' CHANGE the NEW USB cable, that worked, could be?", "date": "03 Mar 2018"}, {"text": "Yes I have the mate 9 and the mate 10 and both seem to make calls on its own when I disconnect from a call.", "date": "01 Mar 2018"}, {"text": "Ermmm.. Nowadays majority smartphone have smart enough to trickle phone when charging is 100%", "date": "01 Mar 2018"}, {"text": "I bought Mate 10 here in the Philippines for just 30k plus. I chose black and it's so freaking awesome. But sometimes, the phone would restart without pressing the power button. I don't know what happened but maybe it's because of the learning machine of this phone. I tried to write my opinion here but its not actually an opinion. I just really want to ask if there's something n Mate 10 that would be really a great help to stop the charging if you forgot to remove your device from the socket like more than 3 hrs? Is it possible that your phone will have some battery problem because of that or does it have feauture that will help your phone to stop the charging even if your device still intact n the socket?", "date": "28 Feb 2018"}, {"text": "The front camera is fixed focus.", "date": "28 Feb 2018"}, {"text": "Lg g6. Hifi dac sound is a boom and camera more useful got wide angle shot.", "date": "26 Feb 2018"}, {"text": "Go for mate 10 only its better coz it has micro sd card support.", "date": "26 Feb 2018"}, {"text": "Go for lg v30 plus.. Only lg using wide angle using 2nd camera..", "date": "26 Feb 2018"}, {"text": "I just got my mate 10. I am disappointed on the front camera due to blur issue. It is not focusing when I took the close up photo. Do you facing this problem? ", "date": "26 Feb 2018"}, {"text": "Thanks", "date": "25 Feb 2018"}, {"text": "My phone recently charge up slow.. I checked the cable and the charging port, they seem okay.. But it still slow to charge up.. Can anyone help me? ", "date": "23 Feb 2018"}, {"text": "Yes we CAN and SHOULD ask for more!! \r\nI need an AMOLED screen (while mate 10 pro is not for sale in my country)", "date": "23 Feb 2018"}, {"text": "Go to Lazada, Set by Huawei Malaysia..", "date": "21 Feb 2018"}, {"text": "Unfortunately, there isn't on mate 10 but you can download dark themes for free in Play Store.. What I did was paid for P77 (pesos) to purchase a dark themed mate 10 pro theme and its fantastic looking! ", "date": "21 Feb 2018"}, {"text": "This phone is a breather. Samsung ang other friends are too popular these days. Try Huawei in particular this Mate 10 unit. I just bought one. All aspects are great with this phone. You can't ask for more. A lot of free themes and wallpapers are gorgeous with display that will not hurt your eyes. ", "date": "21 Feb 2018"}, {"text": "I am due for an upgrade later on. I am confused on which phones should I get.The U11, Mate 10, S8/Plus. I like both front and rear camera to be decent shots. Helppppp", "date": "20 Feb 2018"}, {"text": "HI, where exactly brah? ", "date": "20 Feb 2018"}, {"text": "I've been using the phone since December 2017 and there were none of the worries you listed present. Phone still looks as good as the day I bought it", "date": "19 Feb 2018"}, {"text": "Yes it does support OTG", "date": "19 Feb 2018"}, {"text": "Huawei Malaysia make some discount right now.. Official retailer had offer $470 (RM2250) only for Huawei Mate 10 alongside special box contains lot of item such as Monopod, Huawei headphone and Samsung Evo 64gb memory card.. AMAZING!", "date": "19 Feb 2018"}, {"text": "In Singapore Mate 10 2 yrs contract M1 telco with 2 years Huawei  warranty", "date": "19 Feb 2018"}, {"text": "its cheap in your country can you buy for me", "date": "13 Feb 2018"}, {"text": "Does it have the \"Darken Interface Colours\" like on the Pro?", "date": "13 Feb 2018"}, {"text": "its available here in philippines", "date": "13 Feb 2018"}, {"text": "Pro is best", "date": "13 Feb 2018"}, {"text": "Ok I got it, thank you very much. Mate 10 is not officially sold in my country too. I am going to buy from amazon. I am using LG G6 Plus at the moment, its a great phone too but I like big screens. So if I buy it will be a solid update. Thank you bro for answering my questions", "date": "13 Feb 2018"}, {"text": "In my country, Huawei does not officially sell Mate 10; only Mate 10 Pro is officially sold with warranty. The build quality of Mate 10 is top notch and i experience no problem so far.", "date": "13 Feb 2018"}, {"text": "Guys i have a question. Im trying to find out if this mate 10 support otg . And iff its possible to us wireless keyboard and mouse. Thanks for who can answer properly. ", "date": "13 Feb 2018"}, {"text": "So what are you going to do? Does the phone has any warranty? But overall the phone is good? Yeah. The build quality besides the issue you mentioned", "date": "12 Feb 2018"}, {"text": "bottom edge near frame panel.", "date": "12 Feb 2018"}, {"text": "You mean on the actual screen or near frame panel?", "date": "12 Feb 2018"}, {"text": "Hi, mine has screen bleeding on bottom edge/part close to the fingerprint scanner. It is noticeable only when the screen is white and we look at it not straight on top but from the top angle. ", "date": "12 Feb 2018"}, {"text": "I wanna buy Mate 10 but I have some worries. During this week I looked the device in 2 different shops selling it, and the glue was visible on the edges of the screen (on the contact line of the screen and frame). And as Mate 10 is not IP 67 or 68 sertified and it has narrow bezels, I have worries if the screen will not peel off the frame during using the phone, e.g. during a year. (I have had that type of issue with my Xperia z3 compact and Z3 plus 3 years ago). So I have worries about the build quality. Who has the phone, who has used it, pls share with me with your thoughts. \r\nThank you", "date": "11 Feb 2018"}, {"text": "Go 4 mate 10 ...almost same as Pro \r\n Just the bigger ram(6) same cam 20mp. \r\nI just bought one Mate10 last night. ", "date": "11 Feb 2018"}, {"text": "What is the name of your country?", "date": "11 Feb 2018"}, {"text": "i choose mate 10", "date": "11 Feb 2018"}, {"text": "which is better, huawaei mate 10 or mate 10 pro? pls help me, i wanna buy this month but confused which of which", "date": "11 Feb 2018"}, {"text": "need your help guyz coz i plan to have new cp this wk... which is better, mate 10 or lg g6 plus particularly in camera and play music using headset. especially those who are now user this 2 handset. thanks lot and gd day to evryone... ", "date": "11 Feb 2018"}, {"text": "Go to settings, smart assistance and enable touch disable mode. That way it won't accidentally use your phone whilst in your pocket", "date": "10 Feb 2018"}, {"text": "I cant say in words how good is this intelligent machine!!! ", "date": "09 Feb 2018"}, {"text": "Got mine 4 days ago. Loving it. Ufs 2.1 speed, WiFi 5ghz reached 300mbps as my home broadband capped at 300. IR blaster works on my TV and AC.\n \r\nNo complaints so far. ", "date": "09 Feb 2018"}, {"text": "Hi all,\n \r\nI having problems with my mate 10 which I put into my pocket sometime will auto call to other.\n \r\nAnyone face the same problems?please share.\n\n", "date": "09 Feb 2018"}, {"text": "Bought this phone couple of months ago, and so far it has been absolutely fantastic in every metric, brilliant build quality, great and consistent performance with zero lags or slow downs, exceptional battery life, on top of that the AI seems to really kick in and help optimize battery usage when idle. Great Camera.", "date": "09 Feb 2018"}, {"text": "Please, do not forget to make an insurance for your Gadget! ;)", "date": "08 Feb 2018"}, {"text": "i'm using the phone for the last 2 weeks and so far i had no issues...excellent piece of tech! \r\neverything works flawlessly,camera's are absolutely amazing,battery life is fantastic and it fully charges from 0-100% in 60minutes wich is amazing...no overheating issues,audio quality is better than it was on the Mate9,call quality is the best i've ever had on a phone.. \r\nmy only gripe is that they decided to make the back panel out of glass and the fact that this phone is nowhere to be found if you want to purchase one. \r\nhighly recommend it.", "date": "08 Feb 2018"}, {"text": "Yup...i bought mine from an online retailer here in Romania,and Huawei told me that this model will not be officialy imported and thus will not benefit any kind of warranty and repairs because they only sell the Mate 10 Pro...this type of marketing is mind-boggling to me,but i'm happy with my phone so i don't care that much about their shaddy business practices...", "date": "08 Feb 2018"}, {"text": "They made the best phone and decided to not sell it pretty much anywhere. Same here in Europe. You can only buy the \"pro\" (lame) version. View 10 is nowhere to be found either. WTF is up with that?", "date": "08 Feb 2018"}, {"text": "When this phone will come to India, so far no news about launching in India. Eagerly waiting for this phone. ", "date": "07 Feb 2018"}, {"text": "hi am from mauritius too.the mate10 has equalizer built in and also some effects preset", "date": "06 Feb 2018"}, {"text": "30 days using this phone, it feels great..nice camera and i like the monochrome mode, still fast when i use bunch of application, the sound is confortable for me, and the graphic is amazing.. super fast charging is really super fast..greatest phone i ever use....", "date": "05 Feb 2018"}, {"text": "It costs 485$ in my country Its even cheaper than the samsung A8 plus (500$) mate 10 is the best phone in this price range even better than the more expensive s8 and iphone 7 plus", "date": "03 Feb 2018"}, {"text": "$480 where did you get in this cheap", "date": "02 Feb 2018"}, {"text": "2 month with Mate 10, what a phenomenal device.. Buy it at RM2350 (around USD480) and I'm from Malaysia... \r\n- Fantastic battery life with fast Super Charge tech. \r\n- Great camera ability, video is good but could be better. \r\n- Kirin 970 is the beast, performance is superb. \r\n- Screen is very sharp and bright (16:9 is perfect). \r\n- Latest EMUI is smooth, fluid and full of features.\n \r\nUntil now still no hiccup or let down with Mate 10 so I'm very impressed. For anyone who searching for good device and all rounder performer, go with Mate 10, it definitely worth it..", "date": "02 Feb 2018"}, {"text": "Just purchase Poweramp from playstore then thank to me later. ", "date": "02 Feb 2018"}, {"text": "Yes it happened to me also few times. I think is their software issues. Using mate 9.", "date": "02 Feb 2018"}, {"text": "So..? I'm using this phone as a phone, not a life jacket. I don't intend to swim with it", "date": "31 Jan 2018"}, {"text": "Can anyone tell me more about the music player improvementbon the huawei mate 10", "date": "30 Jan 2018"}, {"text": "Hello Adj well im from mauritius island and i intend to buy the for mate 10 and would like to now if the music player ui get a little push up and also if huawei finally integreted music equaliser on this smartphone im been watching reviews of the mate 10 and request reviews on the music player itself but no one made it yet thanks ", "date": "30 Jan 2018"}, {"text": "Hello Adj well im from mauritius island and i intend to buy the for mate 10 and would like to now if the music player ui get a little push up and also if huawei finally integreted music equaliser on this smartphone im been watching reviews of the mate 10 and request reviews on the music player itself but no one made it yet thanks ", "date": "29 Jan 2018"}, {"text": "Using for last one month, no issues yet encountered ", "date": "29 Jan 2018"}, {"text": "After 3 months, I have to say I am quite satisfied.  I am still using my Mate 8 and on one of the apps I am using, I was initially disappointed, as it felt smoother on the Mate 8 and even on a Mate 9, but now it feels just as smooth and fast as running it on those devices.  Maybe machine learning actually works.  I love the loud speakers, which is a huge improvement over my old Mate 8.  Battery life is excellent, and I rarely need to charge twice in one day.  Only issue I have is when you turn on the bluetooth from the control panel by swiping down, the phone freezes or shuts down.  I need to go to settings to turn it on to avoid this.", "date": "27 Jan 2018"}, {"text": "It does not support Dual sim standby like mate 8 \r\nAlso has font issues during call and in notifications.. ", "date": "24 Jan 2018"}, {"text": "It does come in 6 and 128. You can find it with a international rom. I've had mine since they first available. It has been flawless.", "date": "24 Jan 2018"}, {"text": "IP 53 LMAO!!! what a joke", "date": "21 Jan 2018"}, {"text": "it has better..... \r\nu can have a private space that u can access. try search how to use private space in huawei mate 10", "date": "18 Jan 2018"}, {"text": "please Does Huawei  android mobiles has same samsung secure folder?", "date": "18 Jan 2018"}, {"text": "Only today my Maten was updated to firmware v128 with call quality improvement and battery optimization for extended use.", "date": "18 Jan 2018"}, {"text": " \r\ni am reading a lot of whiners here regarding mate 10's battery, first if you really own one then you won't keep whining. to resolve battery issues you should disable all apps that are sending notifications under Apps and Notifications > Notifications management coz by default all apps there are enabled including apps you recently installed. Me and my wife own a Huawei Mate 10 mocha brown and haven't find any battery problem coz from the start of unboxing after we bought, together we explored the system and each of menus. I have 39 apps blocked from sending (notifications). Everyday we use WiFi and networks data after office, some calls mostly Facebooking and Messenger, playing Clash Royale and streaming TV series via Terrarium or Putlocker during office breaks. Our Huawei Mate 10's battery life last at 28-35% at the time we arrived home from 12-hours work. We love this phone very much! Thanks HUAWEI. ", "date": "15 Jan 2018"}, {"text": "Better if come with 6gb/128gb just like P10 Plus or HTC U11. But still, Mate 10 is fantastic and amazing overall..", "date": "15 Jan 2018"}, {"text": "What kind of marketing \"genius\" decided not to sell it pretty much anywhere? \r\nI won't buy the crappy \"pro\" (Lame) version with no 3.5mm jack, no sd slot, massive price and ridiculous 18:9 aspect ratio. ", "date": "15 Jan 2018"}, {"text": "I really like this phone wonder full cemra and owsam battery time with 4000mah \r\nI am also use Samsung 7edge but this mobile far better in every department  \r\n         Well done Huawei ", "date": "15 Jan 2018"}, {"text": "professional review, a shocked news: Huawei Mate10 these days are cloned by Meiigoo Mate 10, 100% same appearance", "date": "15 Jan 2018"}, {"text": "where can I get instructions re:  use of the basic functions \r\n list of recent calls \r\nadding apps not in google play store \r\nTx\n\n", "date": "14 Jan 2018"}, {"text": "How come my Maten software is still 8.0.0.119 (C636) ALP-L29? I saw some of you already got newer.", "date": "12 Jan 2018"}, {"text": "Sorry to hear about your experience but mine is working absolutely fine. I have had the Mate 10 for a month also but I never had any issues at all including battery life. I can use the phone for 3 hours with still 75-80% battery juice left at my disposal. As for firmware updates, I have had 3 updates on my phone already from the stock 115 to 119 to 126 and just today to 128. That is absolutely great firmware update support from Huawei. I have used so many Samsung flagships before and they were the worst when it comes to firmware updates. Your case is isolated and I can't possibly explain your issue but I am just stating the fact that not everyone will have the same experience as yours.  ", "date": "11 Jan 2018"}, {"text": "My Mate 10 is getting 8 to 10 hours SOT on the old firmware 119. I don't see how it is considered \"poor battery life\". I don't even charge the battery to 100%. Usually its between 80 and 90%. ", "date": "11 Jan 2018"}, {"text": "Had this phone for a month and it's been great save for a few things.\n \r\nBattery life is REALLY bad for a 4000mAh capacity. My HTC U11 has been consistant and has been easily getting 6-7 hours SOT with heavy use.\n \r\nThe Mate 10 is great when you don't use the phone but as soon as you start using it the device eats through the battery.\n \r\nFor those saying it's a rogue app or a faulty device, it's neither. I thought that I had a faulty device because of the battery and obtained a replacement. It too suffered from poor battery performance. I factory reset the device 4 times and eliminated any apps that I thought were affecting the battery and it performed exactly the same - really poor.\n \r\nSecond gripe is that EMUI 8 is poorly optimised and doesn't run well as EMUI 5.1. I owned the Honor 9 prior and it was easily faster. I guess that Huawei need to iron out all the bugs to get decent performance from the phone but in it's current state I would not recommend this phone to anyone.\n \r\nThe only decent things about this phone are the build quality and camera. Aside from that buy another phone and stay clear of this.\n \r\nHuawei's promise of monthly security updates hasn't materialised either and I will get rid of this phone ASAP and buy something else once MWC 2018 has finished and all the major players have announced their phones for 2018.\n \r\nNice try Huawei but not good enough....\n", "date": "10 Jan 2018"}, {"text": "Hello peeps!\n \r\nRemember that we don't comment to discredit but to improve. \n \r\nThis phone is great if you use if offline... Or on wifi. \n \r\nThe reason I'm saying this is because I have been using Mate 10 since launch. Initially, I thought my piece was faulty, I bought another... Same problem. Now I have 2pieces of mate 10 and 1mate 9.\n \r\nI get disappointed when I've spend so much money and still someone says we have a beast.... On paper. \n \r\nI suggest that Huawei comes clean on the following. \n \r\n1. AI should conserve power \r\n2. Kirin 970 should stop heating up \r\n3. 4G/LTE high speed is power angry \r\n4. Camera is flattening images. \r\n5. Developer mode autoresets after restart... Especially max dpi, background process switch. \r\n6. EMUI 8.0 should learn a thing or two from EMUI 5.1.1 simplicity and finesse.\n \r\nOn my view. ", "date": "10 Jan 2018"}, {"text": "Those saying this phone battery life is bad either don't own the phone or there's something very wrong with your phone. Be it rogue app or faulty battery. SOT is not really a good measurement since app & usage varies between people. Use it a lot in a day and surely you'll get a lot of SOT (6-8 hours) but if you use it intermittently for 2 days surely you'll get less SOT (4-5 hours) but more standby time.", "date": "09 Jan 2018"}, {"text": " ", "date": "09 Jan 2018"}, {"text": "I guess not. The battery is so awful. It looks like 2800MA. Bad battery shame on huawei 4000MA and last less than a 5 hours. ", "date": "09 Jan 2018"}, {"text": "Very bad battery life ", "date": "09 Jan 2018"}, {"text": "Brown looks cool in pictures", "date": "07 Jan 2018"}, {"text": "My mate 10 have a issue ? Y screen  brightns  reduce  any solution to fix it ?", "date": "05 Jan 2018"}, {"text": "Thanx wich color is nice?", "date": "05 Jan 2018"}, {"text": "Is there any setting where I can turn on the network mode (2G, 3G or 4G) icons right above/near the signal bar, except data connection?", "date": "03 Jan 2018"}, {"text": "Anytime dear!", "date": "02 Jan 2018"}, {"text": "Thanks for all the help really appreciate it", "date": "02 Jan 2018"}, {"text": "Then I think it will be a perfect fit for you. It's only a matter of self preference what I said. \r\nAs I told you, the phone gets snappier the more you use it (self learning machine).", "date": "02 Jan 2018"}, {"text": "Hi guys.... I im considering this phone... Can anyone tell screen on time so i can buy... Thanks in advance", "date": "02 Jan 2018"}, {"text": "Its called \"Intelligence Algorithm\" thingy.", "date": "02 Jan 2018"}, {"text": "And I really like huawei customizations even though it looks like iOS but I wont mind looks if its great performing", "date": "01 Jan 2018"}, {"text": "I used my friends honor and it was pretty snappy and does it lag in heavy gaming like asphalt8, asphalt extreme and other games. Well its great that performance is getting better", "date": "01 Jan 2018"}, {"text": "Not that big fan of EMUI to be honest, due to heavy iOS like customizations and animations. I really wish Huawei can invent their own skins and be more creative like what current Samsung TouchWiz is for instance.\n \r\nThe phone is snappy but definitely not the snappiest. Performance is not consistent as you sometimes feel that touch is sluggish and other times it flies. Huawei says it improves over time as it learns, overall I can see phone is showing improvement over the days.\n \r\nNo over heating issues at all. This phone is a beast in staying cool, no matter what heavy tasks are.\n\n\n", "date": "01 Jan 2018"}, {"text": "One last thing how is UI? Is EMUI smooth? Does it lag? And is overheating true?", "date": "01 Jan 2018"}, {"text": "Good day everyone, Happy New Year!!\n \r\nI am having trouble with my HotSpot, I am able to share my data/internet for the others but I am, myself, not able to browse.\n \r\nAnyone having this problem or am I doing something wrong?\n \r\nThanks", "date": "01 Jan 2018"}, {"text": "My pleasure :)", "date": "31 Dec 2017"}, {"text": "Thanks", "date": "31 Dec 2017"}, {"text": "I'm more into point and shoot photography where this phone is brilliant at.\n \r\nManual mode is a wealthy in options though, I think it can be useful for those who use it.", "date": "31 Dec 2017"}, {"text": "Alright! I've tested demo units for a while and came out to be the best alternative to Note8, which is expensive. Im buying this in January!", "date": "30 Dec 2017"}, {"text": "Thats nice and how is manual picture and video mode which options does it have? I am pretty interested in Mate10 (non pro)", "date": "30 Dec 2017"}, {"text": "In terms of speed; you can notice elevated performance as it gives priority to apps you frequently use.\n \r\nIn terms of camera; it recognizes scene and objects and auto sets the best setting for a punchier result.\n \r\nIn terms of usage; it learns your habit and self adapts, like for instance you are used to call someone using loud speaker, after few times, the phone will automatically turn on loud speaker, or for instance you are manually turning on night mode or eye comfort as Huawei calls it, it will learn and auto turn on at the times you're used to.\n \r\nThat's basically the machine learning, and it's really cool to have it as first over here.", "date": "30 Dec 2017"}, {"text": "How does NPU affects day to day usage, how do you know it adapted to your setting (or whatever it does)", "date": "30 Dec 2017"}, {"text": "Blue and brown are great", "date": "30 Dec 2017"}, {"text": "I'm using this phone for a month now and overall, superb device.. Performance and camera is fantastic.. Battery life is great and build quality is beautiful.. Go for it dude!", "date": "30 Dec 2017"}, {"text": "Good day to everyone! Im planning to buy a flagship phone, and Galaxies are too expensive. Is the Mate 10 worth the budget? Pls response. Thx", "date": "30 Dec 2017"}, {"text": "My pleasure dear.", "date": "29 Dec 2017"}, {"text": "Thanks AdelJ for prompt and detailed information. Many Thanks. ", "date": "29 Dec 2017"}, {"text": "I have snapped lots of stunning pictures using this camera. Both front and rear can outcome really fine results even in low light situation.\n \r\nI also noticed objects recognition, camera identified objects (food, animals, etc.) and automatically adjusted settings for amazing results.\n \r\nBokeh effect can really give you closest to perfect scene separation, giving pleasurable results.\n \r\nFinally, 4K video recording have been really pleasing for me.\n \r\nOverall nothing to complain about.", "date": "29 Dec 2017"}, {"text": "No one should use a glass back phone naked.", "date": "29 Dec 2017"}, {"text": "Hi,Thanks for review but you have not said anything about camera quality in daylight and in evening-low light.Also about video quality.  \r\nPl.clarify. Thanks in advance. ", "date": "29 Dec 2017"}, {"text": "Wonder which phone you talking about. I've been using this phone camera for quite sometime and I can tell it has amazing capabilities in comparison to other flagships.  \r\nObjects and scene recognition works amazing!", "date": "29 Dec 2017"}, {"text": "i have tried to test my phone and it got scratches really easy and now i am taking it back.", "date": "29 Dec 2017"}, {"text": "agreed!", "date": "29 Dec 2017"}, {"text": "its very good battery and also screen. but it has a terrible camera honestly. i am using it. ", "date": "29 Dec 2017"}, {"text": "This is the best phone I have ever tried among so many other flagships I tried lately. For the below reasons:\n \r\n1- Battery capacity, performance and recharging is the best you can get. \r\n2 - Headphone jack (can't belive I'm naming this as feature). \r\n3 - Wonderful vivid LCD screen with fairly high amount of PPIs \r\n4 - Day to day performance is outstanding! No hiccups, no glitches, this phone flies! \r\n5 - Dual speakers  \r\n6 - IR blaster \r\n7 - Very strong WiFi and cellular signal. \r\n8 - Neural Processing Unit, which adapts to your usage behavior and provides with with tailored performance and lots more!\n \r\nOverall the experience is outstanding. Huawei did really great job this year!\n", "date": "29 Dec 2017"}, {"text": "Who tried to play NBA2K18 or any game with high graphics with this phone. Have you encountered heating issue with this phone or lag? Please reply with my comment. I'm planning to buy this phone. Thanks!", "date": "29 Dec 2017"}, {"text": "Hi peeps,\n \r\nI think the hitches with mate 10 series are related to Oreo 8.0.\n \r\nMate 9 got an update last week and it's performing better than mate 10\n \r\nDon't adj me how... Because I have both of them and I choose them ", "date": "28 Dec 2017"}, {"text": "Security - BAD. rebooting the device to factory default erases the security feature. that happens when you turn off the phone and turn it back on holding the volume up and power for 10 secs. that will restore the factory default setting. (I know it's going to erase the content but that won't matter to whoever will steal your phone does it? lol)\n \r\nFile sharing - I'm a fan of \"share it\" app. for some reason file sharing using share it for MATE 10 is a bit confusing. I usually just pick the file to share then send it to the receiving party. based on my experience I have to let the other party input some \"key\" before sharing happens. Not sure if it's app related but my OPPO F1s didn't do that.\n \r\nfinger print sensor - bad for navigation if you have a casing on. specially a bulky casing (you need a casing to protect the glass back). pros, very responsive (no lags at all).\n \r\npracticality - comparing to other flagship phones, MATE 10 is the best you can get at a low price. \n\n \r\nNOTE: so far in the past month of using this phone those are the only bad things I've noticed. I'm still not sure how the AI works lol!", "date": "28 Dec 2017"}, {"text": "I'm not sure about durable back. it's glass, so I bet you know what's gonna happen if it falls. You just have to have a good casing I guess. cheers!", "date": "28 Dec 2017"}, {"text": "Had been using the Mate 10 for 1 month now. I'm still not sure how the AI works. Youtube - I'm not sure if it's the app but when I access youtube it doesn't load the home screen. This is my first flagship phone and I'm pretty impressed. The camera is awesome. Cheers!", "date": "28 Dec 2017"}, {"text": "IMO Mate 10 is better than Mate 10 pro", "date": "27 Dec 2017"}, {"text": "Anyone has trouble with the Hotspot where others are connected but not your own? ", "date": "27 Dec 2017"}, {"text": "New update... \r\nALP-L29 8.O.O.126 (C185)  \r\nBut overheating persist ...\n \r\nBattery.. 8 hours SOT. \r\nYOUTUBE HAS LAGS", "date": "27 Dec 2017"}, {"text": "Yes agree on this one if you compare it side by side LCD vs. Amoled. More Punchy Colors. But Mate 10's IPS LCD screen is not bad at all. My previous phone is Samsung Amoled, but Im still very satisfied with my mate 10's monster 5.9 16:9 ratio screen. Watching movies is a treat!", "date": "27 Dec 2017"}, {"text": "Pro for sure. I have mate 10 but I know that LCD is no match to Amoled", "date": "26 Dec 2017"}, {"text": "I hate that gold color. \r\nHuawei always makes a phone with terrible colors", "date": "26 Dec 2017"}, {"text": "I have been using this phone for about 2 weeks. Its really fast and superb battery life. Fast Charging really brings a lot of convenience. Coming from a samsung phone, Im now getting used to huawei emui. So far so good, been enjoying the big screen in a compact phone. Great camera, great stereo speakers. I havent experience any heating issues as some reviews are mentioning here.", "date": "26 Dec 2017"}, {"text": "Samsung Touchwiz lags after some time and heats up too even with those heat pipes. Battery life is mediocre and you will surely regret buying a Samsung due to to its poor signal strength especially for dual-sim variants. Go for Huawei Mate 10 its worth every penny and the Samsungs are just overpriced, overrated phones in my own experience. Samsung also has the slowest firmware updates known to mankind! While the Mate 10 is already running on Android 8.0 Oreo, Samsung is still on Beta Oreo up to now.  \r\nDo not believe the hype!", "date": "25 Dec 2017"}, {"text": "Hi friend! When you said heating issue, could you be more specific and give more details, for example, in what conditions the phone was used, how long it has been used until it heated up, etc.? This would be more helpful.", "date": "25 Dec 2017"}, {"text": "so huawei mate 10 or mate 10 pro? which one should i go for", "date": "25 Dec 2017"}, {"text": "Huawei Mate 10 has Project Treble, which matters the most for faster Android updates. The next big thing is AI-powered which pretty much many other tech-giants are adapting. I can see a good scope in this.", "date": "24 Dec 2017"}, {"text": "Unfortunately overheating itÂ\u0092s true after I used the phone mate10 and 10 Pro doesnÂ\u0092t has cooper heating pipes like S8/S8 plus, Nokia 8, Note 8 and Lg V30. ", "date": "24 Dec 2017"}, {"text": "Try out both phones and S8 better mate 10 has some heating issue and gaming performance not that good.", "date": "24 Dec 2017"}, {"text": "Mate 10 off course , remove the edge screen and what i samsung s8.", "date": "24 Dec 2017"}, {"text": "Huawei Mate 10 or Samsung S8? \r\nWhich is best if edge Screen does matter", "date": "23 Dec 2017"}, {"text": "mate has video out with samsung dex like features, much larger screen ( 15% or so larger in actual  area but for all practical purposes is much larger as it is wider) . not top heavy and more comfortable to use as it does not have the stupid 1:2 screen ratio. ", "date": "22 Dec 2017"}, {"text": "If you prefer long-last battery and more attractive smartphone phone design, you should choose mate 10. Before this, I underestimate Huawei, but after I've been introduced with this smartphone, I felt in love with its design, camera and display.. Very clear and satisfied ", "date": "22 Dec 2017"}, {"text": "Well aspect ratio is not a problem and do you have mate 10?", "date": "22 Dec 2017"}, {"text": "I'm thinking about this phone but i have questions: \r\nStorage type is ufs2.1? \r\nIs the back durable? Or it's easy to scratch/break?", "date": "22 Dec 2017"}, {"text": "Go for the Mate10. Its an alll rounded excellent device and probably a rarity considering no other compact 16:9 ratio phone available on the market. ", "date": "22 Dec 2017"}, {"text": "Guys which phone should I buy V30 (online retailer cause its not officially available in my country), Huawei Mate 10 (non pro) or wait for Honor View 10 \r\nThis my list of priorities \r\nCamera \r\nBattery \r\nDisplay (oled or lcd doesnt matter but size does) \r\nPerformance \r\nSound Quality with 3.5mm jack \r\nLoud Speaker \r\nI was really eyeing V30 but its not officially available and its pretty expensive $860 while Mate10 is much cheaper $680 and is great (based on specs) cheapest option is View 10 $390 and is great (again based on specs) I am really confused", "date": "21 Dec 2017"}, {"text": "Mate 10 \r\n- Fresh design build \r\n- Bigger screen area and not an elongated 5.5inch screen like OPO5t. \r\n- QHD resolution for more crisp display \r\n- Bigger battery and more battery life as per gsmarena results \r\n- Better camera \r\n- Expandable memory  \r\n- Front Fingerprint \r\n- Dual loud speakers \n \r\nOPO 5T \r\n- Slightly narrower size for holding in hands \r\n- Oled display giving more popping colors \r\n- Almost Stock android UI (for those who like it) \r\n- 6gb/8gb ram\n \r\nIf Mate 10 is officially available in your market than price of Mate 10 4gb/64gb is at 630$ and OPO5T 8gb/128gb is at 550$.", "date": "21 Dec 2017"}, {"text": "hi, help me choose between mate 10 & oneplus 5t.", "date": "19 Dec 2017"}, {"text": "Hey peeps!\n \r\nI am using both mate 9 and mate 10 and I have to say... \n \r\nMate 9 is superior. \n \r\nIn my opinion. ", "date": "19 Dec 2017"}, {"text": "Dear Huawei, \r\nMate 10 is great, but is still missing something.\n \r\nWith P11 you can beat Samsung,  just improve this: \r\n- add auto HDR option, some photos from mate10 have blown highlights compared to pixel2, \r\n- temper sharpening - in Mate 10 its a bit too much, \r\n- improve video stabilisation \r\n- add real optical zoom e.g. with third lens as some rumors say \r\n- P10 didnt have a barometer, now it has also Samsung's A serie,  I hope P11 will get it. \r\n- if some overheating problems are true, please fix them. \r\n- I would welcome some hub with lan connector support. As an EHS person I would occasionally use it not only in desktop mode.\n \r\nYour design is already great, for me much better than fragile curved screens. \r\n Why is anybody upgrading his phone? Many people just because of camera. Samsung doesnt intent to put dual lens camera in a compact  device in 2018. Its almost impossible to find a compact device with best camera up to date. Pixel 2 has a great camera, but bigger bezels that nexus4 5years ago and they ask for a premium price. \n \r\nIf above mentioned issues are fixed, P11 will be a huge success. \r\nGood luck.", "date": "17 Dec 2017"}, {"text": "agreed with u. no problem of overheating. editing photos n videos are really fast. have kirin 960 with 6gb ram before(honor 8 pro), mate 10 with only 4gb, but 5 times faster when using quik n cyberlink video producer in processing all the photos n videos, even sets in high quality, 1080p 60 fps.\n \r\ni am shocked on how much diff even using same cpu(kirin 960 vs 970). i think npu combination really make things totally diff.", "date": "14 Dec 2017"}, {"text": "I have been using this phone for 1 week ... In my opinion, this phone works well and great.. the battery life is superb and can last for around 6 hours.. i have no regret for buying this phone :)", "date": "13 Dec 2017"}, {"text": "tnx mate!", "date": "12 Dec 2017"}, {"text": "If you live outside China Mainland, do not buy Chinese version of Huawei because it will be has a lot of pre-loaded app(like Baidu trash combination which you don't need to and occupy your RAM when you start up your phone. And make your phone lag)  And I believe thats the reason why Chinese version has 2GB more RAM than International version. ", "date": "11 Dec 2017"}, {"text": "Does monochrome also has pro mode?", "date": "11 Dec 2017"}, {"text": "I don't think Samsung has the best camera resolution out there. Samsung is fooling us by making a very bright screens so pictures will come clean and beautiful but the truth is when you put it on a pc that's the only time you will realize that the picture isn't perfect as it was on your phone. ", "date": "11 Dec 2017"}, {"text": "Thanks Darko for your detailed reply. ", "date": "08 Dec 2017"}, {"text": "To those Mate 10 owners who plays games, do you use the default FHD resolution or the QHD?  Any noticeable difference when playing at the higher resolution?", "date": "08 Dec 2017"}, {"text": "All my previous phones was flagship phones from LG mostly but also Samsung my wife still have S7Edge and by far I found the 7Edge camera the best in almost every aspect to all previous phones... Optimus , G3 ,G4 ,V10 , S7edge , S8 (had one for nearly a month didn't like the format) now S8 and S7 I cant see much of a difference they both perform almost the same I have to say EXCELLENT and this camera on M10 is up to pair with both however If you want to play with PRO settings and go manual then M10 outperforms both of Samsung's in my opinion. The Mate 10 camera AI is really good and in most cases I found myself trying to make better picture with PRO settings while in fact the AI made excellent job .. night shots slightly less however there the PRO settings are coming  handy . Everyday fast SNAP ..PERFECT! Front camera is never Im really looking at form time to time for a selfie shot or group and it does it well but I was never impressed by any front camera. It is safe to say the camera is on top of the game . I paid my unit around 630USD", "date": "07 Dec 2017"}, {"text": "Heat issue I guess it was pointed out on the benchmark testing, in real life usage you won't notice any issue regarding heating! I can assure you on that. There is a big difference in benchmark testing and real life usage", "date": "07 Dec 2017"}, {"text": "I has read some articles regarding heat issue about this phone, please do research before you buy. Good Luck.", "date": "07 Dec 2017"}, {"text": "SAR value??", "date": "07 Dec 2017"}, {"text": "Why", "date": "06 Dec 2017"}, {"text": "I think that \"Resolution: 1440 x 2560 pixels, 16:9 ratio (~499 ppi density)\" is not correct. \r\nMust be: 1080 x 2160 pixels, 18:9 ratio (402 ppi density)", "date": "06 Dec 2017"}, {"text": "Its simple they did it because they wanted to sell pro variants if mate 10 had ip67 only a few would buy pro over vanilla as vanilla is much better and cheaper they didnt needed pro variant they could just increase the price of vanilla mate10 a bit and add pro features thats all", "date": "06 Dec 2017"}, {"text": "is the ALP-AL00 mate 10 version china which has 6gb/128gb can use network in other country?, or it has a problem?, tnx", "date": "06 Dec 2017"}, {"text": "Just because they could do it doesn't mean everyone else can. Some have suggested copy right issues which prevents them from simply imitating Samsung and LG.", "date": "06 Dec 2017"}, {"text": "Vanilla mate10 is much much better than mate10 pro O advice those who are thinking if buying mate10 dont even think about mate10 pro it lacks features and is expensive", "date": "06 Dec 2017"}, {"text": "I can't except that explaination though since V30 and Note 8 have the jack and still able to get even IP68 rating. It's not a deal breaker but i feel they just want to differentiate the normal 10 and the Pro.", "date": "06 Dec 2017"}, {"text": "Huawei has officially stated that they removed headphone jack from Mate 10 pro to get the IP67 certification. So it certainly is the headphone jack on Mate 10 that is the weak point in water proofing.", "date": "06 Dec 2017"}, {"text": "  I know It's not IP67 certified but I saw on a website both mate 10 and the pro version being dismantled and all the seals look very similar. On the face of it there is no reason why mate 10 wouldn't survive a trip down the toilet or a quick bath. And this video sims to confirm it:   I wonder if the headphone jack or a front fingerprint sensor is the reason huawei couldn't get the certification. Conspiracy theory would be that mate 10 is waterproof but huawei don't want to mention it as it would reduce the appeal of pro even further with it's higher price less features portfolio. Oled is the only reason I'm still considering both but that 18:9 is really putting me off. What's the f...... point of having big screen if you gonna loose some of it to black bars when watching video. Alternatively software will fill the screen buy cropping someones head down to his eyebrows :-)", "date": "05 Dec 2017"}, {"text": "What about camera quality in daylight and in evening. Also video quality. You have not said a word about it . Pl.reply. Also how much it costs for phone in dollars. \r\nThanks in advance", "date": "05 Dec 2017"}, {"text": "is the ALP-AL00 mate 10 version china which has 6gb/128gb can use network in other country?, or it has a problem?, tnx", "date": "05 Dec 2017"}, {"text": "Wow! I got my new smartphone mate 10 last week and iM so empressed with this Phone! The battery was the Best coz in the morning 100% fully charge just half an hour of charging! Wow haha, so i used it evey minute like surfing, and sometimes i play games, etc then when i got home at 5pm my Battery has 50% left &#128526; fantastic! Unlike my previous phone note 3 the battery was easily drained but it was also great phone even if its was old.. This phone was very fast in terms of surfing, games not heat, no lag etc.. But it also depends upon the network when you surf. It was smooth, no delayed.. Not hang up.. Also the camer was so so Good!.. Front and back,  For me,  this phone was Great as of this time.. It has so many Features! Goodluck and Godbless. ", "date": "05 Dec 2017"}, {"text": "Razor is crap it only has processing power and speakers other than that total waste it got dimmest screen, bad battery life and average camera with average looks \r\nS8 is great with greatest display ever though Mate10 is a little bit better than S8 in almost everything else and is cheaper too", "date": "05 Dec 2017"}, {"text": "Mate10 or XZP you cant go wrong with both of these but I prefer Mate10 cause it got larger battery, better camera and speakers and design with fastest fingerprint XZP have 4k display and faster than Mate10 which you probably wont notice until compared other than that Mate10 is great and it cost only $720 much cheaper than other flagships", "date": "05 Dec 2017"}, {"text": "Maybe its just excessive load of benchmarks", "date": "05 Dec 2017"}, {"text": "thank you", "date": "04 Dec 2017"}, {"text": "Using Mate 10 since last month, and in general usage or gaming no major issues with excessive heat. ", "date": "04 Dec 2017"}, {"text": "IF only gaming is your primary objective, Razor is pretty damn good. However, as overall allround package Mate 10 or S8+ are very good choices. Though Mate 10 has edge with Android 8 out of the box and project treble support, along with great battery life and offcourse the dual camera setup. ", "date": "04 Dec 2017"}, {"text": "tnx for ur suggest, do you think that they are even when it becomes in performance?, i'm a gamer but 5t design and built quality is far from this two, ", "date": "04 Dec 2017"}, {"text": "delete the cache of play store, restart the phone n try to refresh play store to look for updates again. ", "date": "04 Dec 2017"}, {"text": "It's a tough choice.  It all depends on what your primary needs are.  If you just want monster performance and the highest specs you'd go for the Sony.  If you want a great camera and a phone that has a proven track record of never slowing down then go for the Mate 10.  However, the best of both worlds is the 5t.  It is faster than the Mate, but slower than the Sony, has the weakest screen of the bunch, but that gives its battery more staying power with screen on.  TBH there's no absolute stand out device at the moment.  I'd spend half the money and buy a Xiaomi Mi Mix 2 and live with it's shortcomings.  It's half the price and gives almost identical performance to all of them, only it's almost full body screen gives it a bit of a wow factor.  ", "date": "04 Dec 2017"}, {"text": "guys i'm choosing between mate 10, xz premium and oneplus 5t, can you help me decide, tnx guys!!!", "date": "03 Dec 2017"}, {"text": "You can use 2 SIMs at the same time", "date": "02 Dec 2017"}, {"text": "You can chose from a lot of different languages. Like most Android phones. What language do you need?", "date": "02 Dec 2017"}, {"text": "Please what languages does the menu appear ???", "date": "02 Dec 2017"}, {"text": "Hello everyone can someone help me, im uaing mate 10 also but why i cant download apps to my playstore event though i have a strong &#128170; wifi signal.. It only says download pending.. Please plaease help me.. ", "date": "02 Dec 2017"}, {"text": "Performance gain is probably because of NPU", "date": "30 Nov 2017"}, {"text": "Huawei mate10 looks great and reviews I checked are positive and can someone tell me about real world usage I heard it gets extremely hot while heavy gaming and why is there a pro when normal is much better than it", "date": "30 Nov 2017"}, {"text": "Have the Mate 10 (not pro) for a month now and It is really really good as more I use it the better it performs .Don't know how to explain this but when I started using it and now  a month later I feel the phone actually performs better . Battery time is very good Im not really hesitating to use my phone in any field so yes it is pretty much in use with everything and I take him off the charger in the morning 6AM and when I go to bed around 1 AM there is almost always 40-25% battery left . Quality of the sound plays a big role to me and it sounds amazing on different headphones/earbud types . As a travel companion it is really handy dual sim 4G works perfectly , video and screen is beautiful and i like the format ,maybe it is me but I just prefer 16:9 more then 18.5 makes the phone somehow fitting better and its better to look at a wider screen when in landscape mode . The 3.5 jack is  very welcomed I do use it from time to time as a backup to my wireless headphones . Other then that factory installed screen protector and supplied silicone case makes things even more welcoming . All in all , very good smartphone for quite demanding tasks with lighting fast performance .", "date": "30 Nov 2017"}, {"text": "Mocha Brown", "date": "30 Nov 2017"}, {"text": "Mate 10 or the iPhone", "date": "30 Nov 2017"}, {"text": "Go for Mate10 if you love photography and over all", "date": "30 Nov 2017"}, {"text": "OnePlus 5 (64gb, 6 GB) x $370, Huawei Mate 10 x $550 and iPhone 7 plus (32gb) x $530, which one would you recommend me? I need the one that the best at photos shooting and heavily internet using.", "date": "30 Nov 2017"}, {"text": "Mate 10 or s8?which one you perfer?", "date": "30 Nov 2017"}, {"text": "can sim 2 work at the same time with sim 1 or must activate one sim only  ", "date": "29 Nov 2017"}, {"text": "Go back to your Samsung then. I prefer Mate 10 because it's IPS LCD. ", "date": "29 Nov 2017"}, {"text": "man mate 10 resolution is more than the mate 10 pro", "date": "29 Nov 2017"}, {"text": "Thank you ...", "date": "29 Nov 2017"}, {"text": "Yes", "date": "29 Nov 2017"}, {"text": "Yes. It has led notification ", "date": "29 Nov 2017"}, {"text": "Mate 10 is IPS Lcd, then you should buy Mate 10 Pro, that is Amoled. ", "date": "28 Nov 2017"}, {"text": "I also want to ask that this device has notification LED ? Please let me know .", "date": "28 Nov 2017"}, {"text": "Is this device is OTG supported ? Please let me know .", "date": "28 Nov 2017"}, {"text": "Would GSMarena add what type of memory the phones used like: \r\nLPDDR4x /  UFS 2.1/2.0 what so ever...", "date": "28 Nov 2017"}, {"text": "No super AMOLED display. Huawei sucks.", "date": "28 Nov 2017"}, {"text": "I think your phone is rooted right? I have same problem after rooting it.. so i try to full flash and the problem solved but i lost root... ", "date": "27 Nov 2017"}, {"text": "I think your phones is rooted right? Coz i have same problem after rooting.. then i try to unroot by flashing full firmware and the issues is solved..", "date": "27 Nov 2017"}, {"text": "  I like it.  \r\nGood job!, Huawei.", "date": "26 Nov 2017"}, {"text": "bought the ALP L29 version 3 days before, overall performance is very good.. \r\n- fast battery charging is superb (full charged about an hour) last about a day for heavy user \r\n- the fingerprint responsiveness is very fast \r\n- both front & rear camera is doing a good job \r\n- the stereo speakers is amazingly loud \r\n- no heating issues \r\n- no problem at handling high graphic games", "date": "26 Nov 2017"}, {"text": "Works almost fine for me. Selfie appears in gallery but a little bit blurry. \r\nMy problem is with whatsapp call...phone vibrates once only when receiving a call...do u have this problem?", "date": "25 Nov 2017"}, {"text": "it's counterfit buddy", "date": "25 Nov 2017"}, {"text": "Ive bought it just today and found out that its front cam is not taking selfie properly.. After taking selfie the pic doesnot open in the gallery.. Its blurred all over with loading written on it in the center Ive tried to take selfie in every kind of mode tried to change every setting but this bug just dont go away.. Want to know if any other buyer  has experienced the same.. ", "date": "24 Nov 2017"}, {"text": "I'm using for a week, I had once while updating software. other than that, no.", "date": "24 Nov 2017"}, {"text": "How do you download song from Music App... \n \r\nI use to have the P8 brought from china. and it enable me to download songs then. \n \r\nAlso, where is the record button (on the call page), in which you can record your call during important conversation. \n \r\nPlease help", "date": "24 Nov 2017"}, {"text": "The most phones are from china ...", "date": "23 Nov 2017"}, {"text": "Yes for the chinese market only", "date": "22 Nov 2017"}, {"text": "Available for you Matte 10 Pro 6GB.Ram-128GB storage space\n", "date": "22 Nov 2017"}, {"text": "Hi, \r\nIs there Mate 10 6GB RAM & 128 GB storage?", "date": "22 Nov 2017"}, {"text": "Have you really watched the the GPU comparison of kirin 970?! You don't not what you are talking about. GPU on kirin is way better now, on par with adreno 540 and trumps Exynos", "date": "22 Nov 2017"}, {"text": "Guys i have this phone for a week. All is greatbutbi have one issue.\n \r\nWhen receiving a whatsapp voice call, the phone vibrates only once! (As if it was a text message)\n \r\nFor example: in loud mode it vibrates once and rings normally\n \r\nIn vibration mode: it vibrates once only!\n \r\nDoes someone else have the same problem?", "date": "21 Nov 2017"}, {"text": "Thank you Huawei for bringing back IR Blaster many useful applications to which i use. Its the selling point for me. As for camera when comparing note 8 and mate 10 its more like a nikon or canon meaning depends on whom you are asking on which one is better. As for perfomance quite satisfied with it hopingly it will be that way until mate 11 comes out.", "date": "21 Nov 2017"}, {"text": "HTC U11 plus better snapdragon 835 and adreno 540 GPU better than Kirin 970 especially GPU Kirin G 72 MP12 worst than Samsung G71 MP20 when it comes to graphics performance due to the less core. Adreno 540 in gaming still better than both huawei G72 MP12 and Samsung mail G71 MP20.", "date": "21 Nov 2017"}, {"text": "just download google playstore. i've been using china version huawei m3 china version. i just download playstore n i can download youtube, facebook, ig, etc ", "date": "21 Nov 2017"}, {"text": "Check this site out - it should help you on how to accomplish installing Google Play Store on Chinese versions Andriods \r\nhttps:// (not sure if I am aloud to place links but, here you go) \r\nandroidauthority.com/how-to-install-download-goo­gle-play-store-312812/", "date": "21 Nov 2017"}, {"text": "it is impossible for having no app running in the background unless u turn off ur phone.", "date": "21 Nov 2017"}, {"text": "u need to tick all in manual batch launch to allow android to take fully control of ur phone. dont worry,oreo is really good in managing apps in background", "date": "21 Nov 2017"}, {"text": "Is there a way to install Google Play on the Chinese version of the phone?", "date": "20 Nov 2017"}, {"text": "Jus now disabled auto launch . \r\nI will observe now. \r\nThanks for ur concern,I appreciate.", "date": "20 Nov 2017"}, {"text": "Battery life is very on this device , \r\nReally no complain about that battery. \r\nEven with 50-60% charge battery would easily last for whole day.", "date": "20 Nov 2017"}, {"text": "I have for 5 month huawei mate 9 and i dont have any issues with the phone it works flawless wonderful phone heating issue maybe you should look in some app or game that you have might instaled and causing that", "date": "20 Nov 2017"}, {"text": "disable automatically launch control in battery setting. it will solve then problem", "date": "20 Nov 2017"}, {"text": "I got black, because I didnt have a choice. I would rather go with Mocha as its different. ", "date": "20 Nov 2017"}, {"text": "I have only had my phone for 4 days. On one of the charges it did get to 40 degrees, but other than that time I have no issues.", "date": "20 Nov 2017"}, {"text": "I quite like the fingerprint on the front as if you have the phone down with screen facing you eg, on desk, and you are busy doing something, you dont have to lift the phone up to scan your fingerprint. Way quicker.", "date": "20 Nov 2017"}, {"text": "does the mate 10 have problem in heating", "date": "19 Nov 2017"}, {"text": "Towards higher side, prices are exorbitant, against OPPO, vigo, 1+1, shu'd be under 500$ as other Chinese products. No resale or demand only when it's cheaper. All pomp and show but without glamour. ", "date": "19 Nov 2017"}, {"text": "Why did the mount the fingerprint sensor on the front???? ? On the back is way more comfortable!!! ", "date": "19 Nov 2017"}, {"text": "i strongly sugggest mate 10. dont ever buy mate 9. most of mate 9 product hving heating issue.. ", "date": "18 Nov 2017"}, {"text": "yup.. same to me. my mate 9 heating issue still unsolveable... \r\nnot playing games, no running apps at bckground. it juz heat when put in pocket. battry also drain very fast, not even until 10hours", "date": "18 Nov 2017"}, {"text": "how long the battery stays with u ", "date": "18 Nov 2017"}, {"text": "Indeed Mate 10 is a great phone indeed one of the greatest phones ever, but the new chipset and new Android version Oreo 8.0 is not fully  optimised. when is gets fully optimised you would see it full strength and performance. I hope you will get that by January", "date": "17 Nov 2017"}, {"text": "I have mate10 since one week and I have noticed that this phone tends to heat modeately and temperature goes around 40°c while using YouTube on wifi. \r\nI have also noticed that some times it hangs for a short time while using youtube. \r\nApart from that I didn't noticed any abnormal behavior of this phone. \r\nHope Huawei will fix this issue with next update.", "date": "17 Nov 2017"}, {"text": "All flagships are practically the same. Simply pick the one with larger battery capacity. Don't give your self headache over these things. Hope i was helpful. Great day/night y'all.", "date": "17 Nov 2017"}, {"text": "Which phone is better? Huawei Mate 10 or HTC U11+", "date": "17 Nov 2017"}, {"text": "about gaming, u dont really know cuz i dont play games, but i use chrome heavily,plus fb,insta,whatsapp,telegram,google+, all running in background,no problem of heating.\n \r\nunless u have instal antutu, aida64,use google photos n music, then these apps will run continuously in background n causing little cores being used to max, so other tasks need to use big cores. after uninstal n disable those apps, the little cores will be free, n race to idle is faster, so less heat.\n \r\nand disble launch management automatically under battery setting will help a lot.", "date": "17 Nov 2017"}, {"text": "My only serious concern on Mate 10 about the heating issue is still not addressed. Please, could someone who have the phone test this thoroughly?", "date": "17 Nov 2017"}, {"text": "Mate 10 pro 800Â\u0080 - mate 10 700Â\u0080\n \r\nWhy there is a 100Â\u0080 difference between them?", "date": "16 Nov 2017"}, {"text": "Get the Mate 10.", "date": "15 Nov 2017"}, {"text": "I'd wait for Mate 11 if I already have a Mate 9.", "date": "15 Nov 2017"}, {"text": "In my opinion, the only advantages the Samsung FE has over Mate 10 that are worth noting are FE's stylus pen and AMOLED screen. In all other aspects, Mate 10 all the way.  Mate 10 has stereo loudspeakers. Much better for listening when you're not using headphones.  USB connection is now upgraded to 3.1, Type C.  Huawei's signal quality is also very good, judging from my P10, which I think is even better than Samsung's. And, bloatware much easier to manage than Samsung's.", "date": "15 Nov 2017"}, {"text": "Should i buy Mate 9 or Mate 10? To be honest i love the design, body colors, material and touch pad at the back of Mate 9, compared to Mate 10. Guys, which 1 do you prefer? I would love to make a present for my husband. Please please comment! =)", "date": "15 Nov 2017"}, {"text": "You can go for Mate 10, better processor and bigger battery life. But you can go for Note FE, you can get different user experience than other brands such as S Pen and iris scanner. But Mate 10 isn't bad either.", "date": "14 Nov 2017"}, {"text": "Guys, now Im using Samsung Galaxy A7 2017. Its worth change to Mate 10??? Pls advice... \r\nMate 10 or Galaxy Note FE; wich 1 better option???", "date": "14 Nov 2017"}, {"text": "You know nothing about Huawei phone.. Don't comment too much.. just keep quiet.....", "date": "14 Nov 2017"}, {"text": "Guys hello.Any one knows for sure when it is launching in INDIA ? \r\nOr even PRO is launching ?", "date": "13 Nov 2017"}, {"text": "Will it be worthwhile to upgrade from Mate 9 to Mate 10?", "date": "13 Nov 2017"}, {"text": "the phone is really great, plus oreo battery management is awesome.\n \r\nsome niggle bugs from some app like google photos, gmail n aida64 causing the little cores to works to max, maybe oreo bugs(gmail n aida64), color mode bugs(normal mode has bug, vivid is ok, but its ok cuz i like punchy colors).\n \r\nafter solving the above problems by disabling it, its a beast.\n \r\ncamera in lowlight is great, flash didnt even fired, but still can take the photos nearly as the natural scene at night.\n \r\nbattery is awesome for daily use, 7 hours sot with 2k screen mode and a day standby,beating my honor 8 pro easily 6 hours sot. now trying the fullhd native mode to see how much can regain.", "date": "12 Nov 2017"}, {"text": "just bought it and love it so much! Extraordinary design and it has punchy color and the camera is unexpected good! ", "date": "12 Nov 2017"}, {"text": "i know this isn't SOLD in the US, but someone from the US can still buy.  would it work on a US carrier?  the bands on gsmarena it supports includes the bands AT&T uses.  i don't really understand how this works if someone can enlighten me...", "date": "12 Nov 2017"}, {"text": "Indeed I love this one and I will get this one Mate 10 when it gets reduction by the time it gets to my country. ", "date": "12 Nov 2017"}, {"text": "That thing looks sweet! A real flagship. \r\nmicroSD slot, front-mounted fingerprint sensor (to be able to switch of that retarded navbar) and it has a freaking headphone jack. Perfect.", "date": "11 Nov 2017"}, {"text": "should i buy mate 10 black or mocha brown ", "date": "11 Nov 2017"}, {"text": "Should i buy mate 10, mate 9 or samsung NOTE FE?", "date": "11 Nov 2017"}, {"text": "does it have a heating issue? ", "date": "11 Nov 2017"}, {"text": "I think u should stick with your HONOR 9. To be frank, the performance is somewhat the same for loading speeds, except u are getting better frame rates in games because of the newer graphics, but that is it, that is the HUAWEI MATE 10", "date": "10 Nov 2017"}, {"text": "Why you choice mate 10 instead of mate 9 pro? Is mate 9 pro any bad issue?", "date": "08 Nov 2017"}, {"text": "I am using Honor 9 having 6 GB RAM . Now I am thinking of buying Mate 10 but it has 4 GB RAM . Does it matter ? Would there be difference in performance between them ? Please let me know . I am hard core mobile gammer . ", "date": "08 Nov 2017"}, {"text": "buy mate 10\n", "date": "08 Nov 2017"}, {"text": "As indicated on the review, yes, it has.", "date": "08 Nov 2017"}, {"text": "i'm a happy mate 10 user. i'm just annoyed by the home button. why it act as a back button in the desktop while there is virtual keys but once you choose to navigate with the home button alone it does act as a back button in the desktops. and instead you have to keep pressing to go directly to home !!! ", "date": "07 Nov 2017"}, {"text": "Should I buy mate 10 or mate 9 pro?", "date": "07 Nov 2017"}, {"text": "Does it have a notification light?", "date": "07 Nov 2017"}, {"text": "Actually huawei mate 10 vs 10 pro who is better &#65311;Anyone can give some solutions?", "date": "07 Nov 2017"}, {"text": "Strongly agree, this phone is a lot better than Note8 and it is less expensive.", "date": "07 Nov 2017"}, {"text": "Who needs the slow wireless charging when you have the supercharge?", "date": "07 Nov 2017"}, {"text": "After reading the review of gsmarena, I am reluctant to get Mate 10 due to heating issues (under continuous load and/or long gaming session). This is the only remaining concern I have now. Please, guy, can you test your units and share your views on this?", "date": "07 Nov 2017"}, {"text": "I love this type of phone, my mom loves it. This phone is amazing", "date": "07 Nov 2017"}, {"text": "No wireless charging!!", "date": "06 Nov 2017"}, {"text": "Can anybody who has the phone tell me how the mobile signal strength is? \r\nI read in a review that is was fairly weak and often dropped from 4G to 3G.\n \r\nAlso, is the vibration motor strong or weak. With my current phone (OP3) I can't feel it when it is in my pocket.\n \r\nThank you in advance! ", "date": "06 Nov 2017"}, {"text": "Best camera I've seen in recent phones. Even better than note 8. Not sure where you get your opinion from, go use it and then comment. ", "date": "06 Nov 2017"}, {"text": "Just bought mine 4 days ago, it is a splendid phone which has all what I was looking for undercutting all other flagships price wise.", "date": "06 Nov 2017"}, {"text": "you are right about the camera\n", "date": "06 Nov 2017"}, {"text": "If u don't give a shit for the Spen, then go for Mate 10..at least you will get 7+ battery SOT instead of 3+ . Note8 has a very bad battery &#128077;", "date": "05 Nov 2017"}, {"text": "Can i ask u plz if it's like mate8 dual active sim?? ", "date": "05 Nov 2017"}, {"text": "Mate 10 beats the LGv30;\n \r\n- 16:9(mate 10)  vs 18:9 (lgv30) despite that Mate 10 only 2.5mm wider and 1mm shorter. So with minimal difference in build size you can enjoy full screen videos without any black bars that the 18:9 ratio of LGv30 will face.\n \r\n- front fp (mate 10) vs rear fp. Front is better.\n \r\n-  QHD IPS (mate 10) vs QHD Oled (LG oled facing problems)\n \r\n- Both phones have 4gb ram, memory slot, dual sim, headphone jack\n \r\n- Mate 10 has better front and rear camera\n \r\n- Gsmarena battery test give similar results but Mate 10 should get better with more optimization.\n \r\n- Kirin 970 slightly better and more future proof than SD835\n \r\n- 700 Euros (mate 10) vs 900 Euros (lgv30)", "date": "05 Nov 2017"}, {"text": "Can anyone help me to choose between huawei nova 2i and oppo f5? considering the speed and others important facts like processor, camera, display. advance thank you", "date": "04 Nov 2017"}, {"text": "Mate 10", "date": "04 Nov 2017"}, {"text": "Its true. If somebody have mate 9 will know what he talking. And mate 10 its just betters ", "date": "04 Nov 2017"}, {"text": "I have note 8 and i will change for huawei mate 10 because before i was happy whit mate 9 and i like more.  \r\n1. Better battery (more long time live) Two days use and note8 sometimes no one day. \r\n2. Better do photos ( in note 8 just little you move phone and photo is not good quality and in huawei don't have problems whit that) \r\n3.more faster written message. More comfortable is keyboard.  \r\n4. Note 8 is just little to big. ", "date": "04 Nov 2017"}, {"text": "Should I Buy Mate 10 or Note 8?", "date": "04 Nov 2017"}, {"text": "If I were to buy a new flagship phone right now (Android ones at least), for sure this phone will be one of my top 3 choices. For what it offers, it looks more appealing then other flagship phones out there.  ", "date": "04 Nov 2017"}, {"text": "Yes you can lower to 1080p and also to 720p. You also have a smart mode where the resolution changes automatically based on what is the best for what you are doing on the phone. ", "date": "04 Nov 2017"}, {"text": "is there any option for lowering the display resolution to 1080p , please reply", "date": "04 Nov 2017"}, {"text": "I'm definitely interested in the Mate 10 but could someone please tell me about the audio quality from the headphone jack? I have free p9 and it's mediocre so I'm hoping this is better. Will this be good enough to drive some high end headphones? Thanks in advance.\n", "date": "04 Nov 2017"}, {"text": "Mate 8 doesnt have any leica, have u tried mate 10 in real life?", "date": "04 Nov 2017"}, {"text": "Shut up! If you don't know what you are talking about!! Have you even watched mate 10 YouTube camera reviews!!?? ", "date": "03 Nov 2017"}, {"text": "yes, yes and yes", "date": "03 Nov 2017"}, {"text": "Rubbish phone.nothing is new.lieca camera lens are very bad.they cant even focus properly.i am still using mate 8.so there is nothing new between 8 and 10.so dont waste your money to buy mate 10.better to buy some different brand.huawei cameras are very bad and cheap\n", "date": "03 Nov 2017"}, {"text": "Does Mocha Brown looks good?", "date": "03 Nov 2017"}, {"text": "What? How is that a deal breaker? You should already be thankful that it has a headphone jack and a MicroSD slot AND water resistance. Better than the current newest flagships out there.", "date": "02 Nov 2017"}, {"text": "Waste model.\n \r\nNo sAMOLED display\n \r\nNo autofocus for front camera.", "date": "02 Nov 2017"}, {"text": "Hi Guys,\n \r\nI bought Mate 10 black. No issues and I love the overall performance. My only regret is that I should have bought the Mocha Brown color :(", "date": "02 Nov 2017"}, {"text": "Mate 10 is 100$ cheaper.  The main difference would be S8+ is taller than Mate 10 by 9mm but narrower by 4mm. So you need to hold both devices and select your preference in size and display.\n \r\nBoth have 3.5mm jack and external card slot. Mate 10 has better camera. Mate 10 more newer chip with NPU and so more future proof. Battery life is similar but Mate 10 should get better with time. Both are QHD display but the S8+ has all the advantages of Amoled. Emui is better than Touchwiz. Mate 10 has front fingerprint which can be used as navigation controls. S8+ has the bad positioned rear fp but it has iris scanner. Mate 10 has stereo speakers. ", "date": "01 Nov 2017"}, {"text": "shell i buy s8+ or mate 10", "date": "01 Nov 2017"}, {"text": "Should I go with the mate 10 or Samsung s8 plus not the snapdragon CPU.thx", "date": "01 Nov 2017"}, {"text": "I want to know that is the camera equal in mate 10 & mate 10 pro", "date": "31 Oct 2017"}, {"text": "Please be more specific, I don't understand your question. I'm only sharing my opinion, since I have a lot of experience I thought I'll do some good.", "date": "30 Oct 2017"}, {"text": "My friend what are u fighting for here!!!! Trolls", "date": "30 Oct 2017"}, {"text": "Should I go with the mate 10 or Samsung s8 plus not the snapdragon CPU.thx", "date": "30 Oct 2017"}, {"text": "Hoy about tje battery life? Is it better than sony xz1 compact? How much Screen on Time(SoT) did you get? ", "date": "30 Oct 2017"}, {"text": "Almost all advantages that mate 10 has over mate 9 will be destroyed by unescesary high resolution...It means it won't be any faster...Main differences are it's newer, probably will be supported a bit longer, has USB 3.1 spec and has IP rating that doesn't mean anything because companies don't stand by their phones and will cancel your warranty in case of water damage. Been there, done that. Choice is Yours. \r\nOh, and don't be fooled by audio specifications, anything higher than 44khz 24bit is useless. Only the chip itself can have better audio reproduction, not those high numbers. So audio quality must be verified by people who do proper tests and are competent.", "date": "30 Oct 2017"}, {"text": "How is the Google play works? Is it slow? Does it draining battery like the pro, what's the update for mate 10 here?", "date": "30 Oct 2017"}, {"text": "my 2nd day using huawei mate 10.. outstanding performance!", "date": "30 Oct 2017"}, {"text": "amazing phone ", "date": "29 Oct 2017"}, {"text": "Go for Mate 10 without doubt.", "date": "29 Oct 2017"}, {"text": "Hello, I am currently using a Mate 8, is it worth upgrading to a Mate 10 or should I settle for a cheaper Mate 9?  I do a lot of gaming on my phone, so gpu performance is quite important to me. ", "date": "29 Oct 2017"}, {"text": "How much Screen on Time(SoT) did you get in heavy usage? ", "date": "29 Oct 2017"}, {"text": "Completely agree with you.", "date": "29 Oct 2017"}, {"text": "I love the design and 4000mAh battery is real nice too!", "date": "29 Oct 2017"}, {"text": "Can't believe they use pentile tech for LCD screen.", "date": "29 Oct 2017"}, {"text": "I just bought the Mate 10 and i love it! \n \r\nThis is my 3rd Huawei Phone (Mate8 and Mate9).\n \r\n1) Charging is super duper fast and even faster than Mate9. \r\n2) Camera is improved compared Mate 9. \r\n3) The AI with Translator is really superb! \r\n4) The screen is much better compared to IPS LCD Mate 9.  \r\n5) Battery is also improved tremendously compared to Mate 9. Used for 1 hours plus On Screen time and i have 87% Battery left.  \r\n6) It feels much much smaller (footprint) and easier to hold compared to Mate 9.\n \r\nThe only set back compared to Mate 9 is the position of the fingerprint sensor. Awkward positioning. I love the Mate 10 Pro but i don't think it is worth paying that much for additional AMOLED, IP67 and Fingerprint position at the back", "date": "29 Oct 2017"}, {"text": "I think Im going to skip the idea of buying a phone now, no phone seems to tick all boxes, LG V30, nice main camera, headphone jack etc, rubbish front camera, and no twin app feature in the OS which means I will need 3rd party app to have 2 whatsapp etc, this should be standard on all dual sim phones, Note 8, the stupidest finger print reader place ever, Huawei mate 10, no water proofing, hmmmmmm, mate 10 pro, no headphone jack, lower resolution, I will wait till Samsung S 9, or hopefully the new HTC to be good", "date": "28 Oct 2017"}, {"text": "Mate 10 has 7% more screen and 6% more battery than P10 plus but yet Mate 10 has 13% more battery life. So yes Kirin 970 is better than Kirin 960, which should be obvious.", "date": "28 Oct 2017"}, {"text": "if you check the user experience of Mate 9 whether in xda forums or elsewhere you will see gsmarena battery tests don't reflect their experience. Also because both Kirin 960 and Kirin 970 gets first implemented on the Mate devices, the reviews are performed quite early before Huawei optimizes the battery life with later software updates.", "date": "28 Oct 2017"}, {"text": "In terms of performance, the Kirin 970 with 12 core GPU is performing as much or better than the Exynos which has a 20 core GPU.", "date": "28 Oct 2017"}, {"text": "Improvement is only in talk time (And still not impressive for a 4000 mah battery), but the important aspects - browsing and video playback is worse.", "date": "28 Oct 2017"}, {"text": "How does it perform worse ? gsmarena tests do show improvement by 5hrs. Huawei promised 30% improvement in battery life however since battery life benchmarks are done differently and likely gsmarena tests alone don't cover all aspects. \n \r\nKirin 970 improved in efficiency because 10nm and more efficient G72 GPU but also have to take into account GPU now has 4 more core from the Kirin 960 which was Mp8 as well take into account that Mate10 is QHD display.  Do we have other IPS QHD display phones to make comparison because phone with Amoled display are not a proper comparison.", "date": "28 Oct 2017"}, {"text": "Guess you're right. Big let down by Huawei - they promised much better power efficiency, but instead the new Mate performs even worse than the previous. Pass.", "date": "28 Oct 2017"}, {"text": "Makes sense. If one looks at the Note 8 battery tests, the SD835 (which used A73) scored far lower than the Exynos 8895.", "date": "28 Oct 2017"}, {"text": "Problem with the 960 comes with the power hungry cortex A73. Now that 970 is still using those, I don't think the efficiency's gonna improve much.", "date": "28 Oct 2017"}, {"text": "I agree with you and by the way I hate those 18:9 skinny displays!!!", "date": "27 Oct 2017"}, {"text": "Umm check again? The processor is actually the most important improvement as 960 was too power hungry and warm.", "date": "27 Oct 2017"}, {"text": "mmmm I see the processor is the same in both in mate 9 and 10 . maybe there is no need for change", "date": "26 Oct 2017"}, {"text": "Yes.  I do own mate 9 pro for the last two months and i am very happy with it.  I am not rich or mad to buy the new mate 10/pro.  My opinion is from the specs and you will note that i have not commented on other things. ", "date": "26 Oct 2017"}, {"text": "It's not that Huawei doesn't want to use Oled screen, because 90% of Oled screen is made by Sammy which the supply is very limited to other phone makers. Sammy and Apple have been used most of the screen. Huawei must find other suppliers.", "date": "25 Oct 2017"}, {"text": "if it is not a money issue, why buy the old version while a new one is here. Remember it is new technology for Mate 10", "date": "25 Oct 2017"}, {"text": "I own a Huawei Mate 9 regular which I've been happily using for several months without any problem. Now it's time for me to upgrade to this one which is an improvement over the mate 9 in every way.", "date": "25 Oct 2017"}, {"text": "Have you at least used/owned mate 10 or pro tp say these rabbles?", "date": "25 Oct 2017"}, {"text": "Your forgetting the bezels of Mate 10 series are small making the Mate 10 shorter than Mate 9 pro and slightly wider while the Mate 10 pro is only 2mm taller than Mate 9 pro.", "date": "24 Oct 2017"}, {"text": "The amoled is the shit because burning display... The IPS LCD is the better option! ", "date": "24 Oct 2017"}, {"text": "Mate9 Pro is cute, comparitively smaller but faster and battery stable.  Feels better than the 10 / 10 pro which are bigger in screen unable to manage with one hand.\n", "date": "24 Oct 2017"}, {"text": "guys buy this or mate 9 pro? im very hard deciding between this two phones", "date": "24 Oct 2017"}, {"text": "Howcome it says in Mate 10, Corning Glass \" Unspecified\" ...What does it mean? Does it have a better Durability & Quality compare to iPhone 7/ Samsung S8 or less?", "date": "23 Oct 2017"}, {"text": "Yes it is IP53 rated. ", "date": "23 Oct 2017"}, {"text": "They do use AMOLED but in the PRO version.", "date": "23 Oct 2017"}, {"text": "On the specification it says it is SPLASH AND DUST RESISTING.....Can anybody CONFIRM weather its true or not", "date": "23 Oct 2017"}, {"text": "Not worth", "date": "23 Oct 2017"}, {"text": "I agree, hope Huawei soon use AMOLED technology on their phones plus bring back Radio.\n", "date": "23 Oct 2017"}, {"text": "u should wait till mate 10 releases then the price will drop. i saw from lazada, some shops sell less than rm2,000.", "date": "23 Oct 2017"}, {"text": "order mate 10 already...... ", "date": "23 Oct 2017"}, {"text": "AMOLED and 128GB/6GB RAM and Mate 10 can be the BEST in the market, with  \r\nmilions sold for couple of hours, but no, this is Asia, copy the apple or die...", "date": "22 Oct 2017"}, {"text": "camera 23mp is wrong in the up of the page\n", "date": "22 Oct 2017"}, {"text": "I admire Huawei for coming up with a 16:9 phablet when all the rest have joined the 18:9 NarrowView display insanity for fear of being left out. I admire Huawei for providing their flagship phones with 4000mAh batteries when all the rest of the flagships have just barely over 3300mAh or less. I admire Huawei for equipping there Mate 10 with IR blaster when all the rest don't have it or have removed it. I admire Huawei for keeping the 3.5mm headphone jack when many have ditched it. Now if only Huawei brings back the FM radio which the Mate 8 and Mate 7 has, then it would be the rarest have-it-all flagship phablet in 2017.", "date": "22 Oct 2017"}, {"text": "So you mean to say it is only the battery as the deciding factor to upgrade? \r\nHow about the features? \r\nCamera, AI, resolution, etc....", "date": "22 Oct 2017"}, {"text": "Huawei had resolution changer in EMUI 4 and 5 as well..", "date": "22 Oct 2017"}, {"text": "It has USB 3.1 and display port on its type-c connection.", "date": "22 Oct 2017"}, {"text": "Do we have the option to adjust the screen resolution to FHD for better battery life?", "date": "22 Oct 2017"}, {"text": "Can I control this device using my laptop screen, mouse and keyboard over USB without airplay or alike?", "date": "21 Oct 2017"}, {"text": "worth for an upgrade because chipset inside mate 10 built in 10nm compared with 16nm in mate 9. This will affect battery life. Mate 10 also has HDR display, great speakers(i have watched reviews),sharp display,battery idk but for sure it will be great. Only drawback is Bluetooth 4.2 not 5.", "date": "21 Oct 2017"}, {"text": "i just bought the mate 9 the day before mate 10 launched lol,btw is it worth the upgrade to mate 10?mate 10 pro is too expensive for me....the price for mate 10 in my country is RM2699 and thats Rm200 more than my just bought mate 9...any advice?", "date": "21 Oct 2017"}, {"text": "During the Huawei presentation, the slides mentioned Mate 10 series has a 30% improvement in battery life over the Mate 9. However when looking at the breakdown of official battery stats listed on their shopping site for the Mate 10 atleast, the increase in not uniformly distributed. \n \r\nMate 9 \r\n3G call: up to 30 hours;  \r\n4G web browsing: up to 20 hours;  \r\nVideo playback: up to 20 hours;  \r\naudio playback: up Up to 105 hours;  \r\nstandby time: up to 21 days; \n \r\nMate 10 \r\n3G call: 25 hours; \r\n4G web browsing: 21 hours; \r\nVideo playback: 20 hours; \r\naudio playback: 160 hours; \r\nstandby time: up to 22 days;\n \r\nSo in all the Mate 9 to Mate 10 upgrade will give a minor boost in battery in real life usage depending on the your tasks. The efficiency of Kirin 970 is balanced out by the QHD display and additional 4 cores on the GPU. No breaking records to be expected.", "date": "21 Oct 2017"}, {"text": "Right!! exact the same", "date": "21 Oct 2017"}, {"text": "Mate 10 probably is the only 16:9 screen phone with such small bezel. This is an excellent upgrade over the Mate 9 from incredible design in being as compact as a 5.5 inch phone yet retaining the screen size and 4000 mAh battery, headphone jack and dual sim/external memory. Also have improved display, new efficient and smart Kirin 970, and top level camera. Front fp is bonus for those who keep their phone on the desk. I like the mocha brown and black colors although the midnight blue of Mate 10 pro looks the best. ", "date": "21 Oct 2017"}, {"text": "How is the camera 23MP?\n \r\nI thought both Mate 10, and 10 Pro have the same camera, right?", "date": "21 Oct 2017"}, {"text": "mate 10 is. beta cuZ. of battery life,  A I,  artificial Intelligent ", "date": "20 Oct 2017"}, {"text": "Confused between Sony Xperia XZ1 or Huawei Mate 10.....?\n \r\nCurrently owning Xperia XZ since last year, \n \r\n Huawei mate 10 launch in uae at price of 2299 dirhams while Xperia XZ1 have cheap at 1999 dirhams.. ", "date": "20 Oct 2017"}, {"text": "prefer fhd amoled screen over 2k ips-lcd screen", "date": "20 Oct 2017"}, {"text": "Only 4gb Ram? My Huawei P10 Plus & Honor 9 is better then this atleast with 6gb Ram..", "date": "20 Oct 2017"}, {"text": "Buy mate 10 or mate 9 pro?  Which one is better?", "date": "20 Oct 2017"}, {"text": "How many cameras are sure to be 20 or 23?", "date": "20 Oct 2017"}, {"text": "No water resist?", "date": "20 Oct 2017"}, {"text": "Are you sure mate 10 have usb 3.1 ??", "date": "19 Oct 2017"}, {"text": "Mate 10 plugin led notification light&#65311;", "date": "19 Oct 2017"}, {"text": "True. \n \r\nThe Malaysians are getting a free smart scale instead of the power bank. ", "date": "19 Oct 2017"}, {"text": "Always On Display", "date": "19 Oct 2017"}, {"text": "What is AOD (https://en.wikipedia.org/wiki/AOD) ?", "date": "19 Oct 2017"}, {"text": "With memory card option, 16:9 screen and jack plug, I'd think that in fact this is the model, which is the \"PRO\" version J", "date": "19 Oct 2017"}, {"text": "The usual goodies. Already have those goodies since I bought Mate 8 and P9.\n", "date": "19 Oct 2017"}, {"text": "Yes it is Sterio Speaker... Confirmed by Unbox Therapy... Check Youtube! \n ", "date": "19 Oct 2017"}, {"text": "LOL", "date": "19 Oct 2017"}, {"text": "Preorder started in Saudi as well for Mate 10 4+64gb for 610$ with free goodies. ", "date": "18 Oct 2017"}, {"text": "nobody cares what  u think.", "date": "18 Oct 2017"}, {"text": "That said i prefer the home button at the front. \r\nIt's so difficult to chose a phone these days to your own preference.\n", "date": "18 Oct 2017"}, {"text": "If that's true about the battery i might as well go for the Pro version. \r\nSD is nice to have but 128GB is enough for me. \r\nHeadphone jack is nice to have they supply an adapter. The best features of plugging a cable directly to external screen without a dock and the Leica cameras best ever.\n", "date": "18 Oct 2017"}, {"text": "Mmm i contacted Huawei support because their specification page does not mention if it is usb 2.0 or 3.1.  The response  \r\n\"Thank you for contacting Huawei UK Customer Care Team. \r\nRegarding your query, the USB type C cable will have to be the 3.1 version. \r\nWe trust the above information is of assistance to you. However, should you have any further queries, please do not hesitate to get back in touch.\"\n \r\nSo if that is right the specs here should be corrected ....", "date": "18 Oct 2017"}, {"text": "Very fantastik look in 6th gen.", "date": "18 Oct 2017"}, {"text": "Good specifications but design is quite ugly. Honor 8 design is beautiful.", "date": "18 Oct 2017"}, {"text": "1. Amoled screen are known for battery saving if the phone have true black background. pair it with 1080p lower resolution and 4000mAh battery..Theoretically  the pro version battery is better. but need to see actual real life test to confirmed \r\n2. Yes. PC version available in all mate 10 vers. \r\n3. No wireless charging for any vers.", "date": "18 Oct 2017"}, {"text": "get the porche vers. if you have the money", "date": "18 Oct 2017"}, {"text": "I love this phone. It looks cute and nice.", "date": "18 Oct 2017"}, {"text": "man if this had 8g ram and waterproof, it'd be perfect.", "date": "18 Oct 2017"}, {"text": "Does the regular Mate 10 has PC mode?", "date": "17 Oct 2017"}, {"text": "I am leaning towards getting the Mate 10 against the Pro because the SD card expansion. \r\nDont care about IP67, wifi recharge. I want something to fit in my pocket, good screen to watch movies and read, fast performance and long battery life.\n \r\nCan some one tell me \r\n1. Which one Drains the battery quicker LCD(Mate10) or OLED (Mate10 Pro)? \r\nI am a heavy user i want long battery life over a day. \r\n2. Does Mate 10 support the desktop monitor functionality.\n \r\nThanks all.\n", "date": "17 Oct 2017"}, {"text": "The mate 10 is smaller than the P10 plus and beats the p10 plus at every level. No reason to buy p10 plus anymore and have to wait for P11 if someone needs a 5.5inch screen in 5 inch screen body. ", "date": "17 Oct 2017"}, {"text": "Even though it lacks Bluetooth 5.0, the Mate 10 series with BLE 4.2 supports aptX, aptX HD and LDAC HD audio.", "date": "17 Oct 2017"}, {"text": "I was gonna buy the p10 plus but I am so glad I waited for this. Since the pro has 1080p screen and no audio jack I will rather get this one, just wish it had wireless charging and ip68 rating. Great phone though, love the design and the screen technology.", "date": "17 Oct 2017"}, {"text": "Nokia cheaper.", "date": "17 Oct 2017"}, {"text": "this phone's retail price in Malaysia has been confirmed,it sells at a price of 2699 Malaysian Ringgit,same as last year's Mate 9's retail price", "date": "17 Oct 2017"}, {"text": "All of that perfection will be on the Mate 13 :-D", "date": "17 Oct 2017"}, {"text": "my choice will be LG V30, because it has wireless QI loading. ", "date": "17 Oct 2017"}, {"text": "Don't we all use headphones oh i forgot you can't on the Mate 10 Pro", "date": "17 Oct 2017"}, {"text": "made", "date": "17 Oct 2017"}, {"text": "this is the ugliest phone ever", "date": "17 Oct 2017"}, {"text": "Still Bluetooth 4.2? \r\nCome on!", "date": "17 Oct 2017"}, {"text": "The design is actually perfect, because it still has the fingerprint sensor below the screen which is the only logical position, besides the power button.", "date": "17 Oct 2017"}, {"text": "What's amazing is that this Mate10 is shorter and narrower than the iPhone 8 Plus despite its bigger screen", "date": "17 Oct 2017"}, {"text": "Shame Huawei have taken the fingerprint sensor from the back, it was a great feature on the 8 and 9. A deal breaker for me.", "date": "17 Oct 2017"}, {"text": "The Mate series has always been big phones, what did you expect?", "date": "17 Oct 2017"}, {"text": "Lack of stereo speakers is dissapointing.", "date": "17 Oct 2017"}, {"text": "Very sad, the one having ip67, but no sd card slot. The one with card slot, no IP67 feature and only 4GM RAM. Initially, I have the intention to switch from my current Huawei P9 plus to Mate 10 with the bigger screen, seem cannot fulfilled my requirement, just wait for mate 11 or P11 plus or may be switch to iphone perhaps.", "date": "17 Oct 2017"}, {"text": "Finally have a flagship phone that is 16:9 and bigger than 5.5 inch. Mate 10 is so compact.", "date": "17 Oct 2017"}, {"text": "Is the dimensions of the phone correct? The length is only 150 mm? Vow that's impressive...", "date": "17 Oct 2017"}, {"text": "Once bought mate 9 and done... No more Huawei... Bad camera.. Rest was all good ", "date": "17 Oct 2017"}, {"text": "No it doesn't! they shouldn't have used glass in the first place because it's a stupid finger print magnet!", "date": "16 Oct 2017"}, {"text": "not supporting band 66 broke the deal for me", "date": "16 Oct 2017"}, {"text": "Any idea of there are physical buttons on the bottom except the fingerprint sensor?, that would be awesome", "date": "16 Oct 2017"}, {"text": "where is sensor buttons under display?", "date": "16 Oct 2017"}, {"text": "Excellent !", "date": "16 Oct 2017"}, {"text": "Just another big fking phone, nothing with thin bezel under 5Â\u0094 display. Well, i keep my SE.", "date": "16 Oct 2017"}, {"text": "NFC yes !  irLED yes ! headphone jack yes ! but why usb 2.0 ? (it needs to be able to charge while using it as a host, which requires 3.1). So again skip ....\n", "date": "16 Oct 2017"}, {"text": "You know there are no 32bit files so far do you ?", "date": "16 Oct 2017"}, {"text": "After many years as a Note user, i can say i`m gonna switch to this baby :\n \r\n5.9 inch display FLAT SCREEN \r\n16:9 ratio -> perfect ratio \r\nQHD Display \r\n4000 mAh battery \r\n3.5 mm jack\n \r\nI really don`t care about the waterproofing - not gonna go swimming with the phone \r\nDon`t care about the AOD \r\nDoesn`t matter it doesn`t have DAC sound like LG -> it`s 32-bit 384 kHz & that`s more than good sound.\n\n\n\n", "date": "16 Oct 2017"}, {"text": "Good overall..btter than the Pro...but the price is high with no any waterproofing , no AOD...but with bigger battery good", "date": "16 Oct 2017"}, {"text": "Maybe because it has wireless charging, it has to be glass. ", "date": "16 Oct 2017"}, {"text": "ugggggglllyyyyyyy!!!!!!! ", "date": "16 Oct 2017"}, {"text": "My new favorite phone; finally a zero bezel phone with 16:9 ratio that doesn't shrink videos. It even has a navigation button with fingerprint scanner on the bottom bezel. Everything else looks great; digging that 720 nits screen and the dual f1.6 camera's. Perfection!", "date": "16 Oct 2017"}, {"text": "Why 4 gb?? \r\nCome on Huawei... \r\nPretty much the same as mate 9", "date": "16 Oct 2017"}, {"text": "Looks great as long as the camera doesn't suck. The only thing I really dislike is that there's enough branding and text on the back for a light novel.", "date": "16 Oct 2017"}, {"text": "Wrong ! Actually it's 32-bit 384 kHz (i watched the livestream) .", "date": "16 Oct 2017"}, {"text": "The Mate 10 will come out at the end of October and will cost ÂÂ\u0080699 (£620).", "date": "16 Oct 2017"}, {"text": "Agree.  \r\nIP67 or IP 68 is just waste of money for nothing. \r\nget a water protective case from alliexpress for like 5 eur and you are good to go. No need to get this crap for 200 extra bucks. ", "date": "16 Oct 2017"}, {"text": "699 Euro", "date": "16 Oct 2017"}, {"text": "Well i assume you not gonna swim with your phone, i can confirm  my Mate 9 can handle short time in water, cause i accidentally dropped my mate 9 pro in the bathtub for 5 seconds.\n \r\nMost people would be able to get thre phone fast ip if they dropped there phone in water, home/work.\n \r\nOutdoor in the rain paroide in south america/asia`?, maybe not the best scenario but if you look on the phone,  all the plug in connection are under the phone. so water can come in if you are carefully. .\n \r\nThe phone in your pocket under heavy rain.? use your good sense.and be carefully  :)\n", "date": "16 Oct 2017"}, {"text": "??? What's wrong with that?", "date": "16 Oct 2017"}, {"text": "colors : Pink Gold, , Mocha Brown,Chapagne Gold,and Black, ", "date": "16 Oct 2017"}, {"text": "Same.", "date": "09 Oct 2017"}, {"text": "24-bit 192kHz...!? No buy", "date": "09 Oct 2017"}, {"text": "Changing resolution doesn't do a lot for battery life, the screen still has to light up all the same pixels and that is the main battery sucker. It merely means the GPU doesn't have to work as hard, which can save a fraction of a watt for active use (not static image displaying) and mean smoother performance.\n \r\nBasically it is just re-sampling a lower resolution over the same higher amount of pixels that make up the screen. The screen can't turn off pixels as the large gaps between them would look horrendous and it would cause uneven sub-pixel life decay on OLED screens.", "date": "08 Oct 2017"}, {"text": "The back design really switches me off. Why everyone is copying the stupid google style of their pixels's back?!!", "date": "07 Oct 2017"}, {"text": "All the Mate 10 specs are great. BUT all the Mate 10 variants must have dual sims AND a separate dedicated micro sd slot.", "date": "07 Oct 2017"}, {"text": "Very glad that Huawei decided to implement resolution changer in its next EMUI 6.0. I bet the next mate will be beast when it comes to battery lifetime. ", "date": "07 Oct 2017"}, {"text": "Please include a black version with black frame. Why do you insist on not adding a black version on launch. Dont you want to sell your product", "date": "06 Oct 2017"}, {"text": "Very sad bcos no waterproof.", "date": "06 Oct 2017"}, {"text": "now the price of note 8 will be down", "date": "04 Oct 2017"}, {"text": "These sets looks very attractive. Hope they perform well.", "date": "03 Oct 2017"}, {"text": "Dearest quality seekers.The best possible high ends specifications for a Huawei flagship with reference to the gsmArena disclaimer !! But hopefully , Huawei needs to modify and added USB V3.1+otg and radio before its release to be one of the best of 2018 and later.Of course Huawei Mate 10 pro and Mate 10 light need the necessary modifications too !!!?Hopefully Huawei public relations considers tenderly friendly recommendations + fact following fact writing gsmArena cooperation in making the best.Justice Rights.Omid12Omidvar cares about what's made not who is made the best most completely smartdevices !!Thanks gsmArena,you and Huawei,", "date": "03 Oct 2017"}]