[{"text": "What made u ignore all the pros of the device and post in its forums a very few cons if it has those. I doubt!", "date": "11 Apr 2018"}, {"text": "5.8 Inch 18.7:9 screen is equivalent to a 5.2 inch 16:9 screen.", "date": "11 Apr 2018"}, {"text": "And your P10 has the same body size....  \r\nso why not utilize it better?", "date": "11 Apr 2018"}, {"text": "U can hide it and make ur phone a notchless phone", "date": "11 Apr 2018"}, {"text": "Notch yuk....no use of big screen unless it is without notch..", "date": "11 Apr 2018"}, {"text": "I'm disappointed by huge screen. If i want a huawei with big screen i can buy a mate10pro.  So i will keep my p10 &#128578;... ", "date": "11 Apr 2018"}, {"text": "it does not have.. huge disaster if uask me for this kind of price.... total madness remove it", "date": "11 Apr 2018"}, {"text": "I made a mistake P20 doesn't have a 3.5 mm jack. I just saw gsmarena specification and they mentioned that it has 3.5 mm but they later corrected it.", "date": "11 Apr 2018"}, {"text": "Is it still good to buy Mate 9? ", "date": "10 Apr 2018"}, {"text": "Recently got this phone and I'm absolutely loving it, keep describing it as \"Androids iPhone X\". For a rather good price it offers a great screen, excellent audio, a sleek and stylish design, and a good quality phone. The software runs extremely quick and is very customisable. I highly reccomend this phone!", "date": "09 Apr 2018"}, {"text": "Mate 10 is LCD, Mate 10 pro is OLED. Read the specs, mate :D", "date": "09 Apr 2018"}, {"text": "No one ask you tho. go find midrange for sure you can get less than $500. and do yourself a favor, try to go back to school or at least use dictionary and search what replica means. ", "date": "08 Apr 2018"}, {"text": "Why don't you post under the phone you buy?? ", "date": "08 Apr 2018"}, {"text": "Umm, it does come with a headphone jack. ", "date": "08 Apr 2018"}, {"text": "im not paying 500$+ for iphone replica. the but the only 2 downside for this phone is the LTPS display and the stupid notch. \r\ni forgot the lack of headphone jack as well. ahhhhhh", "date": "08 Apr 2018"}, {"text": "this is absolutely the real deal", "date": "08 Apr 2018"}, {"text": "Standard Mate 10 is OLED.  ", "date": "08 Apr 2018"}, {"text": "Of course it will be no performance difference between Kirin 970, 980 or even 960 in real life. I just wanted to say that I'm not gonna pay such a high price for this year flagship phone with last year chipset. This is very wrong from principle. If Huawei would put Snapdragon 845 into P20, I'd buy it with no questions asked.", "date": "08 Apr 2018"}, {"text": "Mate 10 pro looks like the better phone overall. it has 6GB RAM, water resistance, 4000mah battery and an OLED screen. What I like about it also is the rear-mounted fingerprint reader, which to me is much easier to use than front-mounted. Only caveat is the lack of a headphone jack.  ", "date": "08 Apr 2018"}, {"text": "There is NO 3.5mm jack on this model.", "date": "08 Apr 2018"}, {"text": "Some Advantage of P20 over Mate Pro : \r\n1) Slightly Smaller phone so more reachable and the 5.8\" display is not so smaller than mate 10's 6\".  \r\n2) Slightly Better Rear and Front Facing camera but Mate 10 Pro is also flagship grade.  \r\n3) 3.5mm jack while Mate 10 pro doesn't have it.\n \r\nAdvantages of Mate 10 pro over P20 : \r\n1) 6\" OLED Display and No notch. \r\n2) IP67 rating - water, and dust resistance. \r\n3) Bigger 4000 mAh battery while P20 has 3400 mAh battery. \r\n4) 32-bit/384kHz audio while p20 has 24-bit/192kHz audio. \r\n5) loudspeaker with stereo speakers\n \r\nSo mate 10 pro seems to be a good deal and I don't know what version you're getting cause mate 10 pro also comes in the 6gb/128gb variant which is also an advantage. \r\nAnd you should watch some reviews.", "date": "07 Apr 2018"}, {"text": "I have the same problem. I ordered huawei P20 over carrier and I have a deal, new Mate 10 pro for new Huawei P20! What should I do? ", "date": "07 Apr 2018"}, {"text": "What can you do when huawei fans are hypocrite. Bash apple when they launch the iPhone x with notch and samsung for high price. Now they enjoy the copy and spy information product. ", "date": "07 Apr 2018"}, {"text": "Yes you can demand all the top specs into your next phone,  but then you will keep waiting forever, cause development never stops... Will there be a real life diff b/w kirin 970 and 980??  Whopping miliseconds!!!  LOL ", "date": "07 Apr 2018"}, {"text": "The only thing that stops me from buying it is old (last year) chipset. To my opinion, it's not fair to as \"full price\" for it. \"Kirin 970 is amazing and fast enough chip\" is not excuse for me. Brand new, latest model smartphone with last year chipset sounds dodgy by definition. All this reminds me the story with the latest Chinese jet fighter - J-20 Chendu which has ...engine from the previous model :).", "date": "07 Apr 2018"}, {"text": "Well I saw the Mate 10 new on Ebay sellers with gaurantee for 430 eur, the P20 was 650 eur here.\n \r\nI don't know about the Mate 10, I just got one a few days ago and my camera doesn't seem good, maybe it's just me but it seems too soft and not sharp. (I changed from a OnePlus 5t and I thought the 5t camera wasn't good)\n \r\nI don't think you should get the Mate 10 if it's the same price, I am sure the P20 is better because it's newer. (Also when you look for camera specs of the Mate 10 they don't publish the pixel sizes anywhere :/ only the f-stop).\n \r\nSo if it's the same price, go for the p20 for sure. Maybe Oneplus just has fast phones but the mate 10 also seems slow when going through the OS.", "date": "07 Apr 2018"}, {"text": "What 1080p.", "date": "06 Apr 2018"}, {"text": "Hi, which one is better? Huawei Mate 10 or P20? (PS: Currently both of them have the same price at my place and memory card slot available isn't a big issue for me)", "date": "06 Apr 2018"}, {"text": "I woder if the LTE bands will work with T-Mobile on the US", "date": "06 Apr 2018"}, {"text": "Oh and fingerprint sensor on the front which I dig :)", "date": "06 Apr 2018"}, {"text": "Hi,  \r\nThis should be your own decision. \r\nI wanted to buy to Mate 10 pro, but I didn't like size, it was too big for me. \r\nTherefore I have waited and already ordered the P20, basically the same specs minus the battery and IP proofing. Smaller body size, improved camera and I like the design better. And its a fresher model and also slightly cheaper. \r\ncheers", "date": "06 Apr 2018"}, {"text": "Guys, I have a serious problem. I can not choose between the Huawei mate 10 Pro or the Huawei P20? Who has an suggestion and why? ", "date": "06 Apr 2018"}, {"text": "Which one should I choose and why? The Huawei mate 10 Pro or the Huawei P20. Help me guys ", "date": "06 Apr 2018"}, {"text": "Personally i feel the P series phones are better than the Samsung S range because of price. I currently have the P9 Lite and while this is considered an entry level phone at around R2600 brand new it fairs really well against the S series, the only phones in the S series which currently outdo it are the S8 and S9. In saying this the P9lite has half as many features as the P20 so i have no doubt that the P20 will outdo the S8 and S9.... with regards to pricing and features. the main feature on the S8 that outdoes the P9 lite is the camera however the P20 outdoes the P9lite second to none with regards to camera. The interface of the Huawei is very user friendly and the phones come with the developer option which can be accessed on the S series but it is not a standard feature that shows up , you must know what you are doing to access this feature which i guess is to help avoid unwanted changes in terms of developer mode but if you know what you are doing then the Huawei offers a better developer option with more features. Im a solid Huawei fan..... i must say though that i used to be a solid S series fan and never had phones which werent part of the S series so Huawei has stolen me away ", "date": "06 Apr 2018"}, {"text": "They're both very good. Get the cheapest of the two or the one that looks nicest to you. Not just body, but user interface as well", "date": "06 Apr 2018"}, {"text": "Are you sure this has a 3.5mm headphone jack?", "date": "06 Apr 2018"}, {"text": "Hi, need an advice. P20 vs Samsung S8 ? Which is better?", "date": "06 Apr 2018"}, {"text": "OK it have 128GB storage, cost round 700EUR and you dont get card slot. ", "date": "05 Apr 2018"}, {"text": "There is not Galileo (GNSS) support?", "date": "05 Apr 2018"}, {"text": "You might wanna take a second look under the sound specs", "date": "05 Apr 2018"}, {"text": "Ok I want to tack back what I post earlier,\n \r\nEven P20 PRO price same as Samsung S9 in Malaysia. This is superb Huawei congrats. \r\nI think other brand should follow Huawei pricing range.", "date": "04 Apr 2018"}, {"text": "I'm pretty sure this device doesnt have a headphone jack... only the Lite model does.", "date": "03 Apr 2018"}, {"text": "year 2018: the obsession of phone manufacturers on notches.", "date": "03 Apr 2018"}, {"text": "I think i see the act of Chinese COPY.... lol ", "date": "02 Apr 2018"}, {"text": "It can't be removed, just can  hide it. lol", "date": "02 Apr 2018"}, {"text": "You can remove the notch in the settings", "date": "01 Apr 2018"}, {"text": "The P20 does NOT have a 3.5mm Jack neither FM radio, i bought it yesterday and you can rest assured :p", "date": "01 Apr 2018"}, {"text": "sometimes we need IR port for remote control ", "date": "01 Apr 2018"}, {"text": "Dude where do you live???? Do you have any idea that Huawei p20 pro has the best camera than any other phone at the moment!!", "date": "01 Apr 2018"}, {"text": "No Water Proofing...!!!\n", "date": "01 Apr 2018"}, {"text": "Go and get your P10. No one is stopping you.", "date": "01 Apr 2018"}, {"text": "Feel ease now.can i get my p10 today?p20 was not as my expectations", "date": "01 Apr 2018"}, {"text": "i use ir port in 2000... why you need this port people? evolve!\n", "date": "31 Mar 2018"}, {"text": "On pay monthly can only get it in black from Vodafone - disappointed as wanted pink gold.  Didn't know there is no memory card backup. Do I have to back up to my computer instead?", "date": "31 Mar 2018"}, {"text": "No, it is coming with android oreo 8.1.", "date": "30 Mar 2018"}, {"text": "luck of memory slot eliniates any phone from my list but question: maybe is a chance to mount memory in second sim slot???", "date": "29 Mar 2018"}, {"text": "You can turn off the notch in the settings.", "date": "29 Mar 2018"}, {"text": "I am a p9 lite user. Impressive phone but this notch... is sOOO ugly and obtrusive. The old design was better. \r\n128 GB are more than enough for a phone so the removal of the SD card is not much of a problem. The headphone jack is missing on the p20 pro... Would be good if they remove it on the other phones next year. \r\nFor this price I expected better processor (Qualcomm and Exynos are one step ahead this year so I can't wait to see Kirin 980 and 660/670). \r\nI really hope to see a better design without notch on the next release + better battery and a new processor.", "date": "29 Mar 2018"}, {"text": "No memory card slot = bullshit.", "date": "29 Mar 2018"}, {"text": "It`s good that they mounted the finger print sensor on the front side. I like it even if the screen is not full front size", "date": "29 Mar 2018"}, {"text": "128GB isn't enough for you?Like dude i had a 320gb HDD on my PC and i did not encounter any big problem with space(Witcher 3,Fifa 18,League and uni projects without any problem+other games and programs).", "date": "28 Mar 2018"}, {"text": "i will stick to my p10 plus \r\nat least it has sd card support\n\n", "date": "28 Mar 2018"}, {"text": "notch can be turned off, check on youtube", "date": "28 Mar 2018"}, {"text": "Fm radio whitout headphone jack?", "date": "28 Mar 2018"}, {"text": "Get rid of that ugly notch and to be fair to the consumers, manufacturers should state the screen size after deducting the space taken out by the notch. Why remove the support for SD card? It is true that they are not as good or reliable as built-in memory but at least leave it there as an option for users.\n \r\nI was considering upgrading my old Honor 8 to this one but what a disappointment. They could have at least upgrade the camera on the non-pro models. If this is the direction that Huawei is taking, I am seriously considering switching to Nokia.", "date": "28 Mar 2018"}, {"text": "it doesn't have headphone jack \r\nfix it", "date": "28 Mar 2018"}, {"text": "No IP certification, the fingerprint scanner for some reason looks incredibly uncomfortable and this notch is disgusting. No thanks.", "date": "28 Mar 2018"}, {"text": "Horrible notch. Suck", "date": "28 Mar 2018"}, {"text": "Stop with the notch QQ already. You can hide it. Most of you can not even afford the phone or you dont know the notch can be hidden using software but you still dare to complain about it. ", "date": "28 Mar 2018"}, {"text": "Iphone x copy cat design. Poor huawei", "date": "28 Mar 2018"}, {"text": "For heaven's sake, the notch? Sorry, not for me. ", "date": "28 Mar 2018"}, {"text": "finally you can disable the notch , perfect!", "date": "27 Mar 2018"}, {"text": "... and no AMOLED\n", "date": "27 Mar 2018"}, {"text": "Notch trend is looking very bad", "date": "27 Mar 2018"}, {"text": "They have or not expandable memory? official page says no.", "date": "27 Mar 2018"}, {"text": "Ugly notch  \r\nNo Qi wireless charging \r\nNo IP 67 ( P 20 ) \r\nSorry Huawei, after 3 phones, back to Samsung", "date": "27 Mar 2018"}, {"text": "Wow apple attempted to make a full screen phone but with a notch cause somehow they canÂ\u0092t take away the front camera, front stereo speakers, mic and other sensors which are very important. Now that a lot of android phones emerge with the same notch but not with the same technology that it houses. The notch of the iphone X was not meant for the design alone but with a purpose. Lol. How come that there are too many manufacturers out there canÂ\u0092t make up on their design that they even manage to copy the positioning of the camera? Most of these copycats however failed to make their own version of iphone X in making it look like fuller as it has thick bezel at the bottom. Crazy. It doesnÂ\u0092t even look proportion (with the exception of the notch) since the bezels around the corner are not uniform. I donÂ\u0092t understand why would big manufacturers out there such as huawei, Asus, LG, Vivo and Oppo would just shamelessly copy the design of apple with their iphone X versions. Apple has been very good with the performance of their camera in their iphones for years now however I still prefer Nokia for firing photos and they were very advance since day 1 with the raw images! I was so sad with the recently released huawei p20 boasting their camera when I think IÂ\u0092ve seen it all back in nokia days.", "date": "27 Mar 2018"}, {"text": "kindly update the phone dimensions", "date": "27 Mar 2018"}, {"text": "Only Oreo 8.0 and IP 53. \r\nCome on Huawei", "date": "27 Mar 2018"}, {"text": "Great phone and good price.There will be 2 years updates at least.", "date": "27 Mar 2018"}, {"text": "Looks absolutely terrible. And what's the deal with the front fingerprint scanner?", "date": "27 Mar 2018"}, {"text": "You are looking for the PRO version", "date": "26 Mar 2018"}, {"text": "will it be 4K", "date": "24 Mar 2018"}, {"text": "Its dual 20mp f1.7 cam \r\nSuperimposes depth and scans as 40mp picture. Its 960fps video with 1080p, superimposes by second camera 1080p with increase in pixels than resolution \r\nSo will do wonders in color and sharpness \r\nBrightness may take a hit but vivid contrast will make u crazy \r\nand 4100mah battery. No 64gb only 128gb+6gb or 256+8 gb.", "date": "23 Mar 2018"}, {"text": "IR port?", "date": "22 Mar 2018"}, {"text": "Something went wrong on display", "date": "22 Mar 2018"}, {"text": "when will it launch in India", "date": "21 Mar 2018"}, {"text": "Huawei P20. \r\nThis model must be same IP67 Water resistant!!!. ", "date": "21 Mar 2018"}, {"text": "Will it be launched in India?", "date": "20 Mar 2018"}, {"text": "IR port?", "date": "17 Mar 2018"}, {"text": "1. Nokias don´t bad cameras ( they´re actually good) \r\n2. you forgot an \"a\"  a potato", "date": "17 Mar 2018"}, {"text": "IR port?", "date": "17 Mar 2018"}, {"text": "would be better if have bluetooth 5.0", "date": "14 Mar 2018"}, {"text": "design is not good :(", "date": "14 Mar 2018"}, {"text": "I still hoping that this phone will be waterproof... ", "date": "12 Mar 2018"}, {"text": "It is FP Sensor", "date": "12 Mar 2018"}, {"text": "Till now I was planning on LG V30s+ but s I will wait for this one too. Coz after sales service is way better than LG. ", "date": "12 Mar 2018"}, {"text": "I really wanted to buy this phone, but that stupid notch is making it really hard for me. On one hand, I almost never watch videos on phone, and this is the only scenario in which I would be bothered with that. \r\nOn the other hand, sheer stupidity of it is really turning me off... but what is the alternative? OP 6 will have it, S9 has baaad battery, I don't want iOS... so much phone and never less choice for me.", "date": "11 Mar 2018"}, {"text": "I can see home button ", "date": "11 Mar 2018"}, {"text": "Same here", "date": "11 Mar 2018"}, {"text": "Nokia camera is like potato. ", "date": "10 Mar 2018"}, {"text": "Why HUAWEI haven't any new model that have both of InfraRed and FM-Radio ?", "date": "10 Mar 2018"}, {"text": "Well and it was like a pretty nice phone with good specs until the moment i saw a notch and go vomit :-(", "date": "09 Mar 2018"}, {"text": "Nice lies man.  \r\nYour camera in Samsung S9 cost 1000 eur on a phone which manufacturing cost is 320.  \r\nNokia outpreforms Samsung in camera and nokia 9 will be best camera phone ever released. ", "date": "09 Mar 2018"}, {"text": "Not really. All companies are actually copying each other including apple. For example, the dual camera at the top left design was already featured on huawei honor 6 plus since 2014. That design and feature was started used by apple on iphone 7 plus on 2016.", "date": "09 Mar 2018"}, {"text": "Man i'm done with all these so called company like Huawei, Xiaomi, Oppo, Oneplus. If you aint gonna have a great camera like Iphone or Samsung then forget about competing with them. All they do is give people a great design but when it comes to camera. Iphone and Samsung are the best. Work on your cameras not the design geez", "date": "09 Mar 2018"}, {"text": "It just shows apple is the number one brand. All of the companies like huawei, asus, onplues, and xiaomi  copying apples design and features", "date": "09 Mar 2018"}, {"text": "i dont like notch trend but from the picture itself the design look very nice, i plan to buy this new p20.", "date": "09 Mar 2018"}, {"text": "IP67 or IP68 certified?", "date": "09 Mar 2018"}, {"text": "Why does everybody needs to copy apple? Their new design is nothing special, lots of people do not like it, but still - all the cnhinese companies copy it....WTF?!?", "date": "09 Mar 2018"}, {"text": "More than 1~5: Monday, Tuesday, Wednesday.. It's neo trend also known notchism infection..", "date": "08 Mar 2018"}, {"text": "It's deformed version of iX not more..", "date": "08 Mar 2018"}, {"text": "I like everything about the phone expect for this ugly ugly home button ._.", "date": "08 Mar 2018"}, {"text": "In phones lineup (1~5): those notches, ALAS..", "date": "08 Mar 2018"}, {"text": "yea yea..but consider this!...this is the first smartphone with the notch and a front placed fingerprint sensor!...now that is real innovation!...1000$ please!", "date": "08 Mar 2018"}, {"text": "Huawei.....Huawei......Huawei!!!", "date": "08 Mar 2018"}, {"text": "So they copy the notch on the iphone, ignore the Amoled display,go with the cheap LCD and still charge premium .... I can only hope that the lcd part is not official and its the autofill, cause otherwise this is a complete joke of a product. ", "date": "08 Mar 2018"}]