{"84ptn4": {"title": "[USA] Best phone for the buck ($250)", "text": "USA\n\nVerizon\n\n250 Max\n\nScreen size doesnt matter too much, care more about general battery life. \n\nMostly used for streaming youtube and netflix. \n\nDon't mind going used, but I have a samsung galaxy j7 V right now and I really like how power efficient it is, but the lack of ram hurts my multitasking sometimes. I was thinking of getting a google pixel XL, but wanted to get some suggestions from here. ", "created": 1521146682.0, "replies": [{"text": "If you’re willing to switch to an iPhone, the iPhone SE is a really great phone for the value. I have the 64GB version and it runs very smoothly. It has the same internals as an iPhone 6S and Apple Pay NFC. Mine is about a year and a half old and I think I could keep it for another two years easily. I googled iPhone SE and found a seller refurbished 64GB iPhone SE for $235 here: Apple iPhone SE Smartphone (Choose AT&amp;T Sprint GSM Unlocked Verizon or T-Mobile) | eBayhttps://www.ebay.com/itm/Apple-iPhone-SE-Smartphone-Choose-AT-T-Sprint-GSM-Unlocked-Verizon-or-T-Mobile/302232416298?hash=item465e74b02a:m:m8ZEn28-5VgcjMAIloFL0IQ", "created": 1521147561.0, "replies": []}]}, "84gb9m": {"title": "Which dumb phone should I get?", "text": "Located in the US\n\nWhich dumb phone should I get\n\nWife had her s8 stolen and is over the smartphone thing. She wants a semi basic phone to get off the grid. It would be used for calling and texting and that's pretty much it. She doesn't want any apps or anything.\n\nIs there a good legacy decide that would work and still work with att? I was looking at an old blackberry device maybe? Since it would have basic internet for emergencies but doesnt have the app distraction. \n\nI figured to at least get something with a keyboard.\n\nAny thoughts or recs are greatly appreciated! ", "created": 1521056738.0, "replies": []}, "835br6": {"title": "Budget phone, long battery life", "text": "I'm looking for a budget phone - the cheaper the better, as long as it meets these requirements:\n\n* Longest battery life possible\n* Durable charging port/cable\n* Enough screen resolution so small text looks clear, no visible pixels\n* good GPS\n* headphone port, reasonable sound quality through headphones and speakers\n* smaller is better (favorite screen size was iPhone 4 - 3.5 in.) but this is not that important\n\n**Used for:**\n\n* apps (puzzle games, podcasts, music streaming, sleep tracking apps, etc.)\n* navigation (Google maps)\n* browsing the internet and reading books\n* occasionally watching videos\n\nI don't care about the camera, aesthetics, fingerprint scanner, or other features like that.\n\nI currently use an iPhone 5 and it's great except it runs out of battery soooo fast, even kept in battery saver mode, and the charging port is busted so it doesn't charge half the time.\n\nThank you for your help!", "created": 1520585624.0, "replies": [{"text": "The most immediate question is what your definition of \"budget\" is.  After that, probably your preferred resolution--although, if you're angling for a small phone, this question may well be moot unless you get an iPhone SE.", "created": 1520644617.0, "replies": [{"text": "&gt; iPhone SE\n\nHuh, I'd never even heard of that before!  I'll take a look at that and similar competitors.  Thanks!", "created": 1520668255.0, "replies": []}]}]}, "82wsy8": {"title": "Budget Smartphone in Australia. Optus.", "text": "Country: Australia\n\nProvider - Opus\n\nPrice Range - Budget 200 - 300 (350 absolute max) AUD\n\nYour TOP features in a phone are: Reliability and battery life. \n\nAnything we should know?: I'm on the precipice of purchasing this https://www.ebay.com.au/itm/Xiaomi-Mi-A1-Black-64GB-4G-LTE-Dual-Sim-AU-WARRANTY-Smartphone/202071895129?epid=28006469653&amp;hash=item2f0c6c6c59:g:18oAAOSwiKlZ01ce\n\nI want to make sure this is not a bad decision, I worry there might be something better around. \n\n", "created": 1520508398.0, "replies": []}, "82wn9x": {"title": "Mid-range phone - £300-400", "text": "UK based. Looking for new phones for me and my wife.\n\nCurrently we have an HTC One M8 and a Sony Xperia Z3.\n\nDecent camera and a good battery life are priorities.  Would be nice to have some level of waterproofing, but not essential.", "created": 1520506306.0, "replies": []}, "81d2ty": {"title": "Undecided on what phone to get.", "text": "I am gonna upgrade from a Huawei P9 this April and I am currently on the fence between the Samsung Galaxy S9 and the iPhone 8 as both are under my budget. Which phone would last longer? ", "created": 1519982952.0, "replies": [{"text": "Unless you love the apple eco system, the s9 is a better value, more so competing with the iPhone X rather than the iPhone 8. The screen alone is a great reason to get the s9.", "created": 1519996468.0, "replies": []}]}, "808z2p": {"title": "Find me a phone! (DESPERATE)", "text": "Hello, reditors of r/PickMeAPhone. Does anybody know a good phone under US$400 minimum 16gb of storage. Back Camera 12MP+ f2.0 or less &amp; Front-Facing Camera 5MP+ f2.0 or less. Fingerprint sensor somewhere if possible and some form of water resistance if possible. Thanx hunay-boos, for your future advice ily! 😘😘😘\n\nYour strangely affectionate geek friend,\nKidChild", "created": 1519606086.0, "replies": [{"text": "A5 2017 ?\n\n5.2 screen, 32gb, 3gb ram, 16mp, fingerprint sensor, ip68 water proof", "created": 1519734472.0, "replies": []}, {"text": "LG G6 from amazon or the Moto X4 seem like your best bet. ", "created": 1520064855.0, "replies": []}]}, "8056nk": {"title": "Need help picking a new carrier for a family plan", "text": "Currently have At&amp;t but don't have good coverage to where we moved. Have 4 lines and use a lot of data. Having hotspot availability would be great. Still paying off cell phones on AT&amp;T so if there is a plan that helps with the cost of moving over that would be nice, otherwise I can payoff the phones and then move. ", "created": 1519573427.0, "replies": []}, "804chh": {"title": "Samsung Galaxy A5(2017) or j7(2017)?", "text": "I don't know which phone to buy.I like every feature on both phones besides on: A5-the camera is shitty(shitty autofocus and doesn't have OIS(Optical Image Stabilization) J7-doesn't support 4G(the internet is slower)\n\nA5 has more storage and has better processor.Both baterries are good.\n\nSo...suggestions?What should I buy?\n\nCountry-Serbia    \n\n", "created": 1519564262.0, "replies": []}, "802f10": {"title": "Mid Range phone, Low Light Camera", "text": "Looking to get a **mid range phone** ($200-400+). I work in darks places and want a phone that will be able to take reasonably good photos in **low light settings**. \n\nBonus features:\nWireless charging,\nMicro Sd card slot\n\n", "created": 1519535147.0, "replies": [{"text": "The LG G6, Honor 8, and Samsung S7 are your best bets for lowlight camera with the S7 being the strongest.  The G6/S7 have wireless charging and all 3 have mSD slots. ", "created": 1520065286.0, "replies": []}]}, "7zxxg8": {"title": "Help me pick a phone", "text": "I'm deciding between the \"LeEco Le 2 Pro X625\" \nor \nthe \"LeEco Le S3\"\n\nI have a budget of 150 dollars what phone do u recommend or which phone should I get?\n\n", "created": 1519492377.0, "replies": [{"text": "S3 should have comparable performance/specs, but better battery life.", "created": 1520065822.0, "replies": []}]}, "7z7z23": {"title": "Upgrading from a 1st gen Motorola, literally anything is an upgrade at this point", "text": "**Country:** Canada\n**Provider:** Freedom Mobile (switching from Virgin Mobile)\n**Price Range:** Anything is fair game!\n**Your TOP features in a phone are:** Responsive, display, camera, storage   \n**Anything we should know?:**    \n\nHi all!\n\nI'm planning to move from Virgin Mobile to Freedom Mobile (data is WAY cheaper on Freedom), and looking to upgrade my 1st gen Motorola Moto G into a new phone! My current phone takes a good 20-30 seconds to load apps like Facebook and Twitter and is just super slow and sluggish. It can't even run Snapchat or Animal Crossing: Pocket Camp without crashing :(\n\nMy main uses are going to be social media and messaging, and a few basic games (like Pocket Camp or Fire Emblem: Heroes), along with some Netflix/Youtube from time to time. I will also be taking photographs occasionally!\n\nThank you all for your help!", "created": 1519239069.0, "replies": [{"text": "If price really is flexible you'll want a flagship. If you're looking to stick with Android check out the Pixel 2 or Galaxy S8. If you want an iPhone, the X is pretty awesome IMO.", "created": 1519249590.0, "replies": []}, {"text": "-Money is no object: S9/iPhone X/ Pixel 2 XL (depending on your Android/iOS preference, given how comparable the phones are otherwise)\n-High Midrange: OnePlus 5T (flagship performance but slightly inferior camera/screen)\n-Low Midrange: moto z(2) play (multi day battery life)\n-Budget: Honor 7X: 75%+ of the flagship experience for 25% of the cost\n\nBest camera: S9/Pixel 2   Best Screen: s9   Best performance: iPhone X", "created": 1520065699.0, "replies": []}]}, "7z3gae": {"title": "Need help deciding on new phone", "text": "Title basically says it all. My Galaxy S7 is getting old and I have an upgrade. My carrier is Verizon.\n\nI'm really stuck on if I should get the Galaxy Note 8 or wait for the Galaxy S9 and grab that.\n\nMy only requirements are that the phone is fast and has a headphone jack. Price is no concern. Ideally I want something with a really nice display; snappy colors and resolution and a good camera.\n\nAny other cool phones out there I should be considering? If you have the Note 8 are you happy with it?\n", "created": 1519193835.0, "replies": []}, "7z16vs": {"title": "does anyone else own the LG Stylus 3? which are your reviews?", "text": "", "created": 1519173501.0, "replies": []}, "7w22c4": {"title": "$547 Brandnew Galaxy Note Fe Should I buy it?", "text": "", "created": 1518061541.0, "replies": [{"text": "did you end up getting the phone ??", "created": 1520797058.0, "replies": [{"text": "no not yet", "created": 1520809695.0, "replies": [{"text": "what holding you ?", "created": 1520826575.0, "replies": [{"text": "it lacks software developer support\ni am looking for a devices that will last even after the official update from the oem", "created": 1520855488.0, "replies": [{"text": "are you getting note 8 instead ? ", "created": 1520875499.0, "replies": []}]}]}]}]}]}, "7uv8ic": {"title": "Google Pixel 2 worth replacing my A7 ?", "text": "Hi, About a month from now I'm planning to take a vacation, and I want to take photos and videos to share with my friends, so I decided that I might need a new smartphone or a camera in order to record.\n\nCurrently I have Samsung Samsung Galaxy A7 SM-A700FD, and I feel the camera is not very good. Should I get google pixel 2 or I'm better off buying a standalone camera ?\n\nThanks.", "created": 1517611457.0, "replies": [{"text": "Standalone camera will be produce better images, but it may or may not be convenient for your trip.  As the saying goes \"the best camera is the one you have with you.\" Pixel 2 will be a big step up in picture quality from the A7 though. ", "created": 1518569875.0, "replies": []}, {"text": "buy a sony a6000 mirrorless camera. I just did 3 months of research to buy a camera for vacation. It's amazing.", "created": 1520355892.0, "replies": []}]}, "7uklxs": {"title": "Looking for a durable Budget phone with the highest quality of camera and display", "text": "**Country:** USA\n**Price Range:**   around $400\n**Your TOP features in a phone are:**  The highest possible quality of camera in this price range.\n**Anything we should know?:** I don't play games on my phone.\n\n", "created": 1517508127.0, "replies": [{"text": "At $400, your options are great! \nI suggest looking into the original Google Pixel, you can typically find it for less than your price range, and the camera still holds up. \n", "created": 1517861917.0, "replies": []}]}, "7ue0yu": {"title": "Is there any 4G CDMA flip phone where I can disable the camera, internet, games, etc?", "text": "", "created": 1517438888.0, "replies": []}, "7u57xn": {"title": "samsung S8 and s9 price speculation", "text": "When Samsung's Galaxy S9 becomes available, anybody want to speculate what happens to the price of the S8? I'm needing to upgrade from a dying S5 and I'm hoping I can hold out until the price of the S8 drops. Thanks in advance for any responses. I'm in the United States on TMobile, fwiw. \n\n", "created": 1517353791.0, "replies": []}, "7s600k": {"title": "Keep my ZTE Axon 7 or get a new phone because of security concerns?", "text": "**Country:**  USA \n**Provider:**   ATT\n**Price Range:**    &lt;300\n**Your TOP features in a phone are:**  Something of similar spec/battery life (Snapdragon 820+) \n**Anything we should know?:**    ZTE possibly has Chinese Government backdoors, and i'm concerned about it.  Does it make sense to get a new phone?  Possibly LG V20 or Z2Force\n\n", "created": 1516630516.0, "replies": []}, "7rwtv9": {"title": "Trying to choose between Mi A1, Redmi Note 4/4X, Redmi 5 plus - help?", "text": "", "created": 1516526845.0, "replies": [{"text": "my choice would be the Mi A1. As i see it, it only lacks that ~900mah of battery that the others have, but it is powered by google.", "created": 1517260472.0, "replies": []}]}, "7rwhjy": {"title": "Which one to buy: mi a1 or 10rG", "text": "Really confused between mi a1 and 10rG. I am from India . \nMia1 has good reputation and performance here. 10rG is a new entrant but features look promising but few service centres.\n\nWhat do you suggest folks?", "created": 1516520699.0, "replies": []}, "7rqri5": {"title": "Huawei Mate 10 Lite Vs Iphone 6 32gb .. what should i get?", "text": "**Country:**   egypt\n**Provider:**   \n**Price Range:**   \n**Your TOP features in a phone are:**   living a long time with me\n**Anything we should know?:**    \n\n", "created": 1516459710.0, "replies": []}, "7r56yt": {"title": "What should I pick? =)", "text": "Iphone 7 or Oneplus 5T? Both cost the same, and im all about battery time and camera quality. Hope you can help me ;)\nPS: Im from Norway ", "created": 1516230574.0, "replies": [{"text": "Battery goes to the 5T, comparable camera quality (slight edge to the 5T in good lighting, 7 has slight edge in low light).  ", "created": 1516488400.0, "replies": []}]}, "7r2v7e": {"title": "Can someone tell me which phone I should get?", "text": "**Country:**   USA\n**Provider:**   Verizon\n**Price Range:**   &lt;$500\n**Your TOP features in a phone are:** FRONT fingerprint sensor, qi charging, not sluggish.   \n**Anything we should know?:**    I'm fine buying a used phone.  I have been using an iPhone for years and the prices have finally got to the point where it's just not worth it to me anymore.  I used a Galaxy S8 + because a bunch of people told me it was the best android phone I could get and I am not a fan of the back fingerprint sensor or the poor facial recognition.\n\n", "created": 1516212132.0, "replies": [{"text": "I'm thinking Note 5....", "created": 1516222182.0, "replies": []}, {"text": "Now I'm thinking S7....  :)", "created": 1516296477.0, "replies": []}, {"text": "Note 5 and S7/Edge are your best bets for Front FP, wireless charging, and Verizon.  ", "created": 1516489083.0, "replies": [{"text": "Thank you!  I ended up ordering an S7 from swappa and it got here today.  It's working great!  I think I'm going to order a gear s2 to pair with it because I miss my apple watch.", "created": 1516662180.0, "replies": []}]}]}, "7qj9lu": {"title": "ASUS Zenfone Zoom S vs iPhone SE", "text": "Hello,  \nI'm trying to choose between the two phones.  \n\nI will use it to browse Reddit/other social, as a GPS navigator, and to play a bit (Candy Crush and similar games, nothing \"heavy\")  \n\n\nThe Zenfone is cheaper (399 € vs 539 €), and also has a larger display.\n\nOn the other side I have small hands, so the SE would be better, but I fear a smaller display will strain my eyes.  \n\n\n**Your TOP features in a phone are:** Camera  \nWhat really matters to me is the rear camera.\n\nHas the ASUS a nice camera, or the iPhone one is way better?\n\n\nThank you!", "created": 1516017785.0, "replies": [{"text": "The SE has a better camera; the only better options in that price range for camera quality would be a 2016/17 flagship (Samsung S7/S8, LG G6, Pixel, HTC 10), Honor 9, or an OnePlus 5/5T.  ", "created": 1516488275.0, "replies": [{"text": "Thank you for your answer!", "created": 1516491828.0, "replies": [{"text": "No problem, if you don't mind, could you let me know on which one you decide?  Just curious! ", "created": 1516493316.0, "replies": [{"text": "I don't mind at all!\n\nTL;DR: Samsung S8\n\nThe SE is really too small and as I've said I don't want to strain my eyes too much. \nThe S8 is a bit more expensive but is also newer, online reviews say it has a pretty nice camera, so I will go for it.\n\nThanks again!\n", "created": 1516604940.0, "replies": [{"text": "Sweet, that's a great choice.  It is a relatively small phone, with a beautiful, big screen; the camera is a great as well!  Enjoy! ", "created": 1516652445.0, "replies": []}]}]}]}]}]}, "7qczcs": {"title": "Clarify an iPhone fan's claim, please", "text": "**Country:**   US\n**Provider:**   Unknown\n**Price Range:**   iPhone 7\n\nI had said that with my current Android phone I could go into (as an example) Canada, buy pre-paid service, and then use my phone after changing the SIM card to that provider's card. \"What's a SIM card?\" he asked.\n\nRebutting my comment about my Android phone, the friend, who has an iPhone 7, told me he can use his phone virtually anywhere in the world \"just the way the phone is right now.\" He says he's done that in locations as diverse as Canada and China.\n\nI thought that phones will only send and receive within the coverage map of whoever is supplying phone service. I don't think he has some exotic service plan, but I did not ask him. Where am I confused?\n\n", "created": 1515949171.0, "replies": [{"text": "My guess would be your friend is mainly communicating with other iphone users in which case iMessage and Facetime calling don't require any changes to use anywhere as long as you're connected to WiFi. \n\nSource: Have worked with cell phones for 10+ years.", "created": 1515967103.0, "replies": []}, {"text": "If he has T-Mobile, they offer free international roaming on their phones and the iPhone 7 has many of the bands used internationally as well the on network ones.  Some Android phones have this capability or even more bands, like the Pixel, S7 and newer Samsungs, Motorola phones, and Unlocked model LG flagships G5 or newer.  ", "created": 1516501407.0, "replies": [{"text": "Thanks. My phone is an international model Motorola. My US carrier requires I use their SIM card. I'm still confused.", "created": 1516507410.0, "replies": []}]}]}, "7qcc64": {"title": "Out of touch with phones, whats a decent andriod thats around £100 2nd hand or new! (UK, on EE network or unlocked)", "text": "", "created": 1515942779.0, "replies": []}, "7q3jmv": {"title": "Help me pick between Nokia 8, Z2 Play and ZTE Axon 7", "text": "**Your TOP features in a phone are:**   web browsing (reading comics, watching videos), camera, fast charging time, gps\n\nIssues/pros I've seen with each:\n\nNokia 8 \n\n* bad noise isolation in calls\n* heats up a little\n* camera app kinda slow, not many features\n\nZ2 Play\n\n* slow wifi\n* big baterry drain during idle\n* good sound isolation, but call quality not so good\n* good camera, but app doesn't have a link to gallery\n* too wide for my hands\n\nZTE Axon 7\n\n* software is a lot more intuitive than the other two\n* very small battery drain in idle\n* very good sound\n* camera is ok, could be better. Has smile detection and ois.\n* capacity buttons under screen are not illuminated and it's not always easy to find them\n* fingerprint sensor in on the back", "created": 1515835121.0, "replies": [{"text": "I would choose a Nubia Z17 😃. I think it's better than those phones.", "created": 1515920102.0, "replies": []}]}, "7ot3nv": {"title": "Which phone should i get?", "text": "Samsung galaxy a5 2017 32gb Or  Huawei honor 8 lite 16gb?        Which one do you prefer?\n\n", "created": 1515356996.0, "replies": [{"text": "Galaxy a5 2017 32gb", "created": 1515872881.0, "replies": []}]}, "7olrnw": {"title": "Phone stolen would like suggestion for a new one", "text": "So my GF phone was stolen recently (Samsung Galaxy not sure the exact type) so I'm looking to get her a replacement as birthday gift in 2 weeks.\n\nPrimary considerations: \n\nBudget: under $300 preferably closer to $200\n\nBand: She's currently in France for the year so I'd like something compatible with Orange mobile's band frequency. Here's a link for this https://www.frequencycheck.com/carriers/orange-france\n\nUnlocked/Locked: Preferably unlocked for the reasons above otherwise I can go through the process of unlocking it myself\n\nBattery life: She's horrible at charging her phone so something with good battery life\n\nCamera: a nice camera would be a plus since she like to record dance videos and we video chat often\n\nSIM: either microsim or nanosim\n\n\nThanks!", "created": 1515271077.0, "replies": [{"text": "Moto g5 plus fits the criteria, love mine.  Great battery, close to stock Android, good specs", "created": 1516399707.0, "replies": [{"text": "Lol I actually decided to buy that last week. Thanks for confirming its a great choice (c:", "created": 1516420857.0, "replies": []}]}]}, "7oimxz": {"title": "Mate 9 or try iOS and get used 6s Plus?", "text": "Hi guys,\n\nI broke my S7E and i have to buy new phone. Not wiling to spend much tbh. Since i dont want curved display anymore i have to change the brand or try iOS (never had iPhone). I prefer used iPhone like 6s Plus because i'm not sure if ill like iOS. The other phone which i really like is Huawei Mate 9. Beatiful, metal back, big screen, big battery, USB Type-C etc. Also the Mate is only q year old while the 6s Plus is 2 and a half. \n\nShould i try iOS or simply go with the Mate?", "created": 1515235975.0, "replies": [{"text": "Camera edge slightly goes to the 6S Plus, otherwise the Mate 9 wins elsewhere (battery, screen, storage, size, and fast Type C charging).  ", "created": 1516501536.0, "replies": []}]}, "7oh8m1": {"title": "About to throw my Xperia X Compact into a swamp, but I need a replacement before I do", "text": "**Country:**   US  \n**Provider:**   ATT  \n**Price Range:**   Ideally &lt;$400, absolute max is $500  \n**Your TOP features in a phone are:**   In order: good 1080p display, good, solid, reliable camera, battery life, multitasking, single-task performance/gaming, no bricks  \n**Anything we should know?:**  I'm coming from a Sony Xperia X Compact. The phone's display is underwhelming and the 3GB of RAM frequently shows its limitations, but the bigger issue for me is that the camera has a tendency to frack up at the worst possible time. Examples: the eclipse (lost my shot and almost lost my view trying to save the shot), the recent Florida snowstorm (had to snatch my wife's Moto X Pure to get video). I love the size and form factor of the X Compact, but I know I'll have to go bigger. Just, no bricks.\n\n", "created": 1515215144.0, "replies": [{"text": "Probably an Honor 8: 5.2\" screen, 4GB RAM, great CPU, very bright 1080p screen, good battery life, quality dual camera setup, SD slot, headphone jack, snazzy appearance, and it has Type C.  No water resistance though.  ", "created": 1516503899.0, "replies": []}]}, "7oazge": {"title": "Broke my s7 edge. Give me a suggestion please!", "text": "**Country:** Greece (Europe)  \n**Provider:** Doesn't matter  \n**Price Range:** 400 euros tops  \n**Your TOP features in a phone are:** CAMERA (back and front). Loudspeaker,battery.  \n**Anything we should know?:**  \ni would like a phone with **best camera** possible (back and front). A large battery and a loud speaker would also be appreciated. I don't play any games and don't do heavy multitasking, however i need the phone not to be laggy.\n**Screen** should not be larger than **5.7** inches , no less than **5 inches** either, and NOT curved or \"edge\", i think it makes the phone more fragile and is useless to me anyway, just makes me type slower. I have a 64GB SD card, and in combination with 32gb of internal that my s7 edge had, total storage was never above 75%. I don't care about what the brand will be.\n**Budget** is limited, **400 euros** tops. I don't want to \"invest\" any more than that, as my hands are shaky (apparently, because i tend to get a broken screen within 8 months) and repair cost is always expensive on expensive phones. So the cheaper the phone will be (but fitting the above requirements), the better it will be for my bank account and for me to make a decision. Thank you in advance!\n\n", "created": 1515156310.0, "replies": [{"text": "LG V20.\nThe only issue is the battery is average but its got a removable back for multiple batteries or extended battery ", "created": 1515164987.0, "replies": []}, {"text": "Have a look at [ZTE Axon 7](https://www.notebookcheck.net/ZTE-Axon-7-Smartphone-Review.182649.0.html), it might not have the best camera possible, but it's got great image stabilization, 2 speakers and for what it offers it's very cheap.", "created": 1515694062.0, "replies": []}]}, "7o4cy6": {"title": "Looking for something pretty basic... [Canada]", "text": "**Country:**  Canada \n\n**Provider:**   Koodo, but doesn't really matter\n\n**Price Range:**   maximum $150\n\n**Your TOP features in a phone are:**  Podcasts, music, text\n\n**Anything we should know?:**    I want it as simple as possible... I don't care about taking pictures or anything. I'd prefer to be on a phone that doesn't require a data plan.\n", "created": 1515085595.0, "replies": []}, "7o2co4": {"title": "Huawei Mate 10 Pro vs Galaxy Note 8", "text": "Hi guys!\n\nMy main key points on a phone are :\n\n-Battery Life\n-Good and quick automatic camera (pull out and shoot)\n-General Speed\n-Long-lasting(Won't be unviable after 2-3 years.)\n\nWhich phone would you recommend?\n\nThanks in advance!\n\n", "created": 1515064604.0, "replies": [{"text": "Pixel 2 XL or iPhone 8+ would be best for lagfree user experience and longevity in update and battery life. Samsung phones ain't the smoothest in user experience.  My S8+ has 2-3 secs delay when launching, but 1 sec delay once in background. As for Chinese phones, I don't trust most Chinese oem due to lack of software update and non-existing customer support. Chinese brand phones seem like great deals with low prices, but if something unfortunate happen to your phone then you're so out of luck.", "created": 1518545391.0, "replies": []}]}, "7o1iut": {"title": "22F looking for some flip phone recs", "text": "I have been contemplating ditching my smartphone for a while. I only got one in the end of 2013 and honestly, I could do without it.\n\nI feel like having a smartphone is not great for me, my sleep schedule is atrocious and I think that I could focus on my work more if I didn't have that much of a distraction available at all times.\n\nI'd like something that has a decent battery life and ideally something I could use a garbage ass version of facebook on. Expandable memory would be amazing too. \n", "created": 1515052217.0, "replies": [{"text": "Try this article: [https://turbofuture.com/cell-phones/flip-phones](https://turbofuture.com/cell-phones/flip-phones)", "created": 1515609273.0, "replies": []}]}, "7n3ql4": {"title": "Phone recommendations for an old/cheap but still supported android smartphone?", "text": "It's for my father, literally just to keep in contact with us through Facebook Messenger. £50 or below if possible.\n\nThanks!", "created": 1514664581.0, "replies": [{"text": "Moto G? It's on the small side, though, so your dad's eyesight must be reasonably good.", "created": 1514738545.0, "replies": []}]}, "7mz8k4": {"title": "Pixel 2 64gb or 128gb", "text": "I've managed to pick everything out of my own, but I can't really decide if I should get the 64gb version or the 128gb version for 100usd more. Currently I'm on a Galaxy s4 with only 16gb which is full then then some (I have to delete things in order to patch my apps) so they both seem like a huge luxury to me.\n\nAny opinions or help?\n", "created": 1514604502.0, "replies": [{"text": "If you plan on using it for a long time i'd go with 128gb because it has no expandable storage.", "created": 1514609657.0, "replies": []}, {"text": "64GB, the unlimited and free cloud storage on photos and videos will help you out a lot.", "created": 1514724489.0, "replies": [{"text": "Yeah, this option is fine as long as OP doesn't have cap in their data plan. Sometimes it's nice to have access to physical data not on cloud. A buddy of mine has a Samsung phone with 320 gb storage total, using 256 gb microsd. Crazy.", "created": 1518544790.0, "replies": []}]}]}, "7muzfz": {"title": "Should I upgrade to a Moto E4 Plus?", "text": "**Country:**   USA\n**Provider:**   Boost Mobile\n**Price Range:**   $100-200\n**Your TOP features in a phone are:**   Large, High Res, Beautiful Screen, Quick and snappy, Front Facing Speakers\n**Anything we should know?:**    I have a Galaxy Note 4 Running on Boost Mobile byod from sprint.  Recently, it's been really showing its age. I've performed factory resets etc. but the phone still isn't as responsive as it used to be (a year ago when I got it).\nApps take 3-4 seconds to pop up and switching between apps takes 5+ seconds. Even the home button takes 2-3 seconds in delay before showing the home screen.  I haven't noticed a decrease in performance in the apps themselves however, so I'm thinking its just the recent updates to firmware.\n&amp;nbsp;\n\nThe Moto E4 is on sale right now for 99$, when looking at the specs I see it has a lower resolution screen, slightly smaller screen, and slightly worse camera.  I have no idea about the processor though: Qualcomm Snapdragon 427 8920 VS\tSamsung Exynos 7 Octa 5433.\n\n&amp;nbsp;\n\nMaybe its because my Note 4 is no longer listed on Boosts compatible phone list anymore? They since removed it. Would getting an actual Boost Mobile phone like this be better?\n\n", "created": 1514562056.0, "replies": [{"text": "I have a Moto LTE and am leaning to the Moto E4 (not the plus).  Then again I'm not a heavy phone or photo user, probably 90+ percent wi-fi for general Internet and youtube casting.\n\nOnly reason for upgrading is the LTE is alway running out of space.\n\nso to answer your question directly: **YES**", "created": 1514930329.0, "replies": []}, {"text": "E4 Plus will be faster, brighter, have much, much better battery, a slightly worse camera, get a FF speaker, but you do lose the beautiful, high res AMOLED screen.  For the money, it is hard to beat.  ", "created": 1516501801.0, "replies": []}]}, "7lyi4t": {"title": "Xiaomi MI A1 or Huawei P10 lite?", "text": "Hey, im about to buy a phone around 200e , these are the ones i picked, but cant choose between them. Help me decide.", "created": 1514161643.0, "replies": [{"text": "i personally don't own any of those but my father and friend do.\nSo first the A1 is such a no thrill phone but it does what it does the best way it can. Xiaomi makes phones that actually hold their battery, the camera is not flagship but man is it good when you consider that you need to pay enough to buy a second one to get a better camera. In her words \"There is nothing good in this world with the word LITE in it\". It's a phone that even though it's new find a way to stutter, the camera can be compared to skimmed milk, literally ok, nothing more and the battery lasts a day. Xiaomi does twice more than that. You won't feel a difference in performance, it will do (pig), it will do.\nSo on my take Xiaomi is the winner here", "created": 1514303732.0, "replies": []}]}, "7l8j68": {"title": "Unlocked Budget Phone / Removable Battery / No Fingerprint Scanner / Good Camera / Does this exist?", "text": "**Country:**\nUnited States\n**Provider:** \nTello\n**Price Range:**   \n~$50-$200\n**Your TOP features in a phone are:** \n-Carrier unlocked -- works on any carrier\n-Bootloader unlocked or unlockable -- available third-party/open source firmware\n-or, at least easily rooted\n-Decent quality camera\n-Powerful enough CPU and enough memory to run modern applications smoothly\n-Removable battery preferred\n-Prefer no fingerprint scanner\n-Prefer no NFC\n-Prefer smaller form factor\n**Anything we should know?:**    \nHi everybody,\nI'm looking for an unlocked budget phone with some consideration for privacy, which may be a bit of an oxymoron in the world of smart phones. My usage is fairly pedestrian, though -- basic communications applications, some music and audiobooks, a couple of fitness related applications. I don't really play games, though I might if I had a nicer phone. Currently, I have an LG Tribute 2, which is rooted with some modifications made using XPosed framework. I actually like the phone overall, but it is constantly running out of storage space. I'd also like a better camera.\nI don't think any phone checks all the boxes, at least at the price point, but I'm leaning toward one of the Moto E or G varieties, such as Moto G4 Play. \nAny input is appreciated.\n\nEdit:typographical error", "created": 1513850466.0, "replies": [{"text": "G4 play or moto E4 are your best bet, but only the G4 play avoids the fingerprint sensor.  Any reason why you do not want one?  You can just use a different means to unlock the phone.  Otherwise, a LG G5 ($249 on B&amp;H Photo for the network unlocked model) would be a good bet.  ", "created": 1516501298.0, "replies": []}]}, "7kwcjk": {"title": "Phone for my mum's birthday", "text": "Hello, I am seeking for help.\nMy mother's birthday is nearby and this year we decided to purchase a new phone for her. My mum isn't that great with phone's. She knows the basics and doesn't need more than that. Although she likes taking pictures, mainly of my dog and landscapes. Her current phone isn't unusable, but definitely could use an upgrade. The phone I am seeking for contains these demands: decent battery, enough storage space, not too big, user friendly (Android, Apple, etc...), 200-400$ (is debatable) and MOST IMPORTANTLY a great camera! I already spotted the nexus 6p and I myself use the Xiaomi Redmi Note 3 (camera is decent meh..) \n\nAny help is appreciated!\n\n", "created": 1513718316.0, "replies": [{"text": "My friend has the nexus, and according to him, it's already starting to age. The camera has gotten fogged up, the build quality is subpar, and it's starting overheating and turning off.", "created": 1513978506.0, "replies": []}]}, "7knwey": {"title": "Samsung J3 (2017) Vs. Xiaomi RedMi Note 5a vs. Cubot Max", "text": "Hey guys, I'm looking to buy a new phone since my current one is a Samsung Trend 2 Lite that's running on fumes(had it for a couple of years and it's gotten glitchy and slow). I am on a budget since I just got some money but don't want to spend too much on a fancy phone. What I am looking for is durability... the most important factor is how long the phone is going to function normally before I have to get a new one since I don't know when is the next time I'll get this much money to spend on whatever :( Anyway, these three phones fit my price range and my expectations, but I lack experience and would appreciate the advice of someone more knowledgeable than myself. Thank you\n\n", "created": 1513628710.0, "replies": [{"text": "I have never even heard of cubot. I would avoid it, I couldn’t find anything that wasn’t an ad for it. ", "created": 1513661266.0, "replies": [{"text": "That's what I was thinking too... I remember my highschool classmate had one and it spectacularly broke down! It's the specs that blinded me now XD\n", "created": 1513668260.0, "replies": []}]}]}, "7kf4c7": {"title": "Moto G5 Plus (w/o ads) vs. Moto X XT1562?", "text": "I'm trying to choose between the above two phones, just no idea which to choose.\n\n**Country:** \nU.S.A.\n  \n**Provider:** \nCricket\n  \n**Your TOP features in a phone are:** \nStorage\nNot being glitchy\n\nThanks!", "created": 1513532569.0, "replies": []}, "7jfjnj": {"title": "Looking for a mid-range Android", "text": "**Country:**  \nCanada\n\n**Provider:**\n\nFido, possibly moving to Public Mobile\n\n\n**Price Range:**   \nSub-$600 CDN (480 USD)\n\n**Your TOP features in a phone are:**   \n\nUnlocked\n\nAndroid\n\nLong Battery Life\n\nSpeed\n\nLow-light Camera (Maybe)\n\n3.5mm headphone jack\n\n**Anything we should know?:**    \nI'm finally trying to replace my old Nexus 5, I really liked its size, but my screen's now cracked in 2 places, and it is showing its age now. Quite a few of the new flagships are getting really expensive, and I don't want to invest too much into a new device, but I also want it to be fairly future-proof.\n\nThanks!", "created": 1513126856.0, "replies": [{"text": "Moto g5 plus, awesome battery, close to stock Android, and only about have your budget for the higher spec one with more memory.  Best  phone for the money imho", "created": 1516399596.0, "replies": []}]}, "7jf4qv": {"title": "Help picking a phone for the year", "text": "I am a heavy user of social media apps and media apps like Netflix Android and music. I have a axon 7 mini but burn has ruined where the on screen keys are at. I need a sub $200 USD phone. So far I've been leaning towards the Alcatel Idol 4 or another axon Mini. Which one would serve me better?\n", "created": 1513123098.0, "replies": []}, "7jd8vb": {"title": "Recommend me a Cheap Android MP3 Player", "text": "**Country:** USA   \n**Provider:** AT&amp;T/Straight Talk (not important)   \n**Price Range:** &lt;$50   \n**Your TOP features in a phone are:** SD Card and 3.5mm Jack   \n**Anything we should know?:** I'd like to be able to install a custom ROM on this phone, but not necessary. I basically need something that will run Google Music while I'm snowboarding. I just recently almost lost my S8.    \n\n", "created": 1513106977.0, "replies": [{"text": "Moto E LTE.  Dirt cheap, good battery life, and SD slot.  ", "created": 1513571677.0, "replies": []}]}, "7jagq2": {"title": "first smartphone for my mother (150€)", "text": "Hello :)\n\nIm looking for a phone for my mother (Android).\nShe never used a smartphone before but she needs it for work.\n\nShe wants to hear music on it and maybe a little bit of surfing in the browser.\n\nI think 100-150 € is enough for a phone for her.\n\nWhat about the Galaxy J3 is that any good ?\nOr are there better phones for that amount of money?\n\n", "created": 1513082381.0, "replies": []}, "7iufrp": {"title": "Best phone in early 2018 under 300$?", "text": "**Country:**  Czech Republic \n\n**Provider:** T-Mobile\n  \n**Price Range:**  300$\n \n**Your TOP features in a phone are:**  Battery life, good specs and display\n \n**Anything we should know?:**   For the last three years I've been using Lg g3 and apart from short battery life and battery issues in general I was satisfied with it. \n\nThe phone now finally broke so I'm looking for a new one.\nRight now the Xiaomi Redmi note 4 64gb seems like the most performance for a reasonable price. The only think keeping me away from it right now is the issues I heard about MIUI and the design which I'm not exactly a fan of.\n\nI'm open to any suggestions right now, thanks in advance.\n \n\n", "created": 1512919275.0, "replies": []}, "7ij379": {"title": "LF Android Phone with decent camera &lt;200€", "text": "**Country:**   Austria/Europe\n**Provider:**   w/e\n**Price Range:**   &lt;200€\n**Your TOP features in a phone are:**   Camera, battery\n**Anything we should know?:** \n", "created": 1512777374.0, "replies": []}, "7hzgfd": {"title": "Moto G5S or iPhone SE", "text": "Looking to upgrade from my Motorola G3. I'm looking for a snappy and responsive experience for medium to heavy use. Which phone do you think will last me longer? Camera doesn't really matter much to me but battery life and performance are big to me.\n\nHappy to consider other phones around that price range too.\n\nThanks!", "created": 1512580462.0, "replies": [{"text": "iPhone SE, but leave it on iOS 10. ", "created": 1512614701.0, "replies": [{"text": "I plan on buying a phone next week, if I buy the SE wouldn't it come shipped with iOS 11?", "created": 1512617512.0, "replies": [{"text": "It depends. Where are you buying it from? ", "created": 1512617961.0, "replies": [{"text": "Either the official Apple store or Kogan.", "created": 1512618001.0, "replies": [{"text": "If you’re buying it new, it’s most likely going to be on iOS 10. If it’s used it’d probably be iOS 11. ", "created": 1512618552.0, "replies": []}]}]}]}]}]}, "7hyqqd": {"title": "Need a flip phone?", "text": "Can anyone suggest me a flip phone for Verizon. My dads' current (very old phone) started to act up. It's a really old touch screen (not smartphone). He doesn't wanna switch to a a smartphone and money is really tight right. Any suggestions?", "created": 1512574015.0, "replies": [{"text": "[LG Revere 3](https://www.verizonwireless.com/basic-phones/revere-3/). $50 full price.\n\nI mean, that's pretty much it. Anything else is $120+.", "created": 1512582454.0, "replies": [{"text": "Thank you!", "created": 1512583257.0, "replies": []}]}]}, "7hpht9": {"title": "New phone to replace Galaxy A3 (2015)", "text": "**Country:**   UK or Belgium\n\n**Provider:**   Viking Mobile\n\n**Price Range:**   Up to 700 GBP or EUR\n\n**Your TOP features in a phone are:**   WhatsApp, Photos, Light Gaming\n\n**Anything we should know?:**  I currently have and A3 which I bought in late 2015 and it is starting to have issues so I need to replace it. I can spend more on a phone this time but I am not sure I want/need to given a phone is basically just a whatsapp machine for me. The biggest issue I have with my current A3 is storage size. I would like a Galaxy S7 as I like having the button and I am not sold on the Galaxy S8. But, I don't want to buy it and then realise it doesn't function quickly with an updated android system in a year. I don't really want an iPhone because I think they are not good value for money. Please help me.\n\n", "created": 1512478716.0, "replies": []}, "7hirp0": {"title": "Help deciding what to do with my phones...", "text": "I have issues with retail therapy and it is always having to do with me buying electronics. \n\nI have 3 phones right now, a note 8, pixel 2 XL and an iPhone 8+. Right now I am primarily switching between the iPhone 8+ and note 8.\n\nI am 99% sure I'm going to sell the pixel 2 XL when I get the rebate from TMobile and trade in from Google.\n\nThis leaves me with a note 8 with TMobile still on eip and an iPhone 8+ purchased unlocked from the Apple store...\n\nI like both phones. The screen on my note 8 is amazing while the way apps work on iPhone is so much better. I ultimately want only 1 device. I just can't decide between the 2.\n\nI like iMessage but I also like the customization of Android.\n\nHelp?", "created": 1512408347.0, "replies": [{"text": "I suggest you go with Android", "created": 1512453762.0, "replies": [{"text": "Why do you say that?", "created": 1512456151.0, "replies": [{"text": "I just like that Android is far more customizable and I myself have not had any mayor problems with their phones", "created": 1512457043.0, "replies": []}]}]}, {"text": "Keep the note 8 and sell the 8+ for an iPad(you can use iMessage on that too) ", "created": 1512682564.0, "replies": []}]}, "7gz8sl": {"title": "Best phone for video?", "text": "Want to buy a phone for cinematic videos. Got some questions with that.\n\n1) why iPhone is considered a best phone for video?\n\n2) how long I can shoot 4K videos? (I have read that Android phones overheat very fast and video automatically stops)\n\n3) I’ve seen video where phone is changing the color of objects while moving (https://youtu.be/DR3GadJb3xI?t=7m26s) Look at the table – first it is white, then cameraman moves the phone and table gets yellow. So I got another questions with that too:\n\na) is it because it is a cheap phone?\nb) or this thing is common for all phones?\nc) if I use cinematic apps will it remove this problem?\n\n4) Does a phone need to have OIS if I’m going to use a stabilizer?\n\n5) What phone would be good for lives?\n", "created": 1512173154.0, "replies": [{"text": "I'm not an expert. But according to recent reviews the best phone for videos should be LG V30.", "created": 1512192344.0, "replies": []}]}, "7gvi04": {"title": "Oneplus 5T 6GB (€500) or HTC U11 4GB (€509)?", "text": "Hi guys, I'm hoping you can offer me some advice.\n\nI was all set to purchase the Oneplus 5T today when I noticed a significant price drop for the HTC U11 from a local online retailer. \n\nMy main concern is, am I passing up a great deal here? I much prefer the design of the Oneplus 5T and the additional RAM, but the [HTC U11](https://www.gsmarena.com/htc_u11-8630.php#single-sim) has some pretty great all around specs. \n\nWhich one do you think is more value for money when they are essentially priced the same?", "created": 1512140485.0, "replies": []}, "7gojwq": {"title": "Need a new phone . I have 200 or less", "text": "**Country:**\n\n\nChile - South america   \n\n\n**Provider:**   \n\n\nClaro\n\n\n**Price Range:** \n  \nLess than 250 or 200\n\n\n**Your TOP features in a phone are:**   \n\nA good amount of space so i can play games \n\n**Anything we should know?:**    \n\nMy last phone died today and it was an iphone 5 s , i'd like something that resembles iphone's   UI. \n", "created": 1512067527.0, "replies": []}, "7g0j49": {"title": "Help! So Frustrated with Phones right now.", "text": "**Country:**   USA\n**Provider:**   Cricket\n**Price Range:**   350 and Under\n**Your TOP features in a phone are:**   Camera/Video\n**Anything we should know?:**    \n\nLongevity. I bought the lg v10 back in January only to have it completely freeze up about a month ago with the whole boot loop problem. I lost all of my photos and videos from a one in a lifetime road trip to see family from another country.\n\nToo replace the v10, I bought the Samsung S7 Edge. I fricken loved this phone and its features. The videos were smooth. Photos were Crisp. I even had a pretty decent battery life.\n\nYet to my horror, it boot loop 3 times in the past month before completely becoming stuck on the last boot loop random shut down. I am lucky it is still under warranty so I can get a full refund in the next few days.\n\nCan someone please recommend a phone that won't give me this kind of grief? I am scared to get another LG and now Samsung has the same issue.\n\nI need a decent smartphone with a good camera and video function for my youtube channel and random shots. Good Battery. Good Camera. And, not completely crash after only a few months of owning it. I have to buy used since I can not afford a new phone.\n\nMaybe my s7 edge was a dud? Is boot loop that common now?\n\nAlso. What are good pre-own type insurances for phones? ", "created": 1511834381.0, "replies": [{"text": "Get a V20, chances are slim to none for bootloops.", "created": 1512682735.0, "replies": []}]}, "7fuksl": {"title": "Help me choose between these two phones", "text": "https://m.gsmarena.com/compare.php3?idPhone1=8291&amp;idPhone2=8263\n\nShould I buy Xiaomi Redmi Note 4 (MediaTek) or Xiaomi Redmi 4 Prime.\nThe comparison is in the link, still can't choose.", "created": 1511782462.0, "replies": [{"text": "I was also comparing and choosing between these two and the mediatek version ended up winning, still not sure if I should buy it or not tho.", "created": 1512919711.0, "replies": []}]}, "7fto4d": {"title": "Looking to upgrade to a new phone!", "text": "Hello! My current phone (Samsung J5) is on its death bed so I would like to upgrade to something better. My biggest problem with my samsung was the really small internal memory. The system upgrades really took a big part of it and I ended up with having a maximum of 3 apps installed on it (I got a SD card but there are many apps I use daily i.e Facebook that only cannnot be installed on the SD) before I couldn't download anything anymore. My current budget is 380$ \nThank you for your help! c:\n", "created": 1511770179.0, "replies": [{"text": "For that price you could get a one plus 3T. It's a very fast phone with 64Gb or 128 (depending on which model you buy) of internal storage. No SD card expansion though, but I doubt you'd need it.", "created": 1511806239.0, "replies": []}]}, "7fqsaa": {"title": "Wanting to upgrade from Galaxy S5 I got in 2014.", "text": "I was really interested in the Google Pixel, but I never got around to upgrading. Then a new one just recently came out, and I thinking of getting it. But then I realized that there wasn't a headphone jack, so I most likely won't be getting that.\n\nI don't have to stick with android, but it's what my past couple phones have been. If someone here thinks Apple is just objectively better I would consider it. There just aren't many options lol.\n\nI have been eyeing the Samsung Galaxy 8 in particular. I don't know much about it though, I haven't kept up with the smartphone market for a while.\n\nWhat are some of the other big phones right now that you might recommend over the S8?", "created": 1511739328.0, "replies": [{"text": "I'm in the same boat as you are , coming from a galaxy s5 and wanting to change something, I'm just learning about all of the stuff people consider when buying a new phone and its hurting my fricking brain, I've considered Lg V30, Huawei mate 10 or huawei mate 10 pro,and sony xperia xz premium but I have a very hard time choosing between any of these /:", "created": 1512523589.0, "replies": []}]}, "7fqmmb": {"title": "Looking for the best 350$ phone !", "text": "Hi, I am looking for a not really expensive new phone (something about 300-350 $/€). If possible, one that has the best camera of the mid range phones out there, and of course, a good general performance.\nThanks in advance.\n\n", "created": 1511737829.0, "replies": [{"text": "iphone SE ", "created": 1511850671.0, "replies": []}]}, "7fmppm": {"title": "Looking for a phone with HD screen and long battery life for christmas", "text": "**Country:** UK  \n**Provider:** o2  \n**Price Range:** &lt;= £150  \n**Your TOP features in a phone are:** HD screen (1920x1080), long battery life   \n**Anything we should know?:** unlocked/removable SIM and a removable battery would be nice. Also, price range is just if I want to get it as a christmas present, any price is fine if I buy it myself.\n\n", "created": 1511700677.0, "replies": []}, "7fixj6": {"title": "What's the best all-around Android with a smaller screen and good specs?", "text": "**Country: USA**   \n**Provider: The People's Operator (T-Mobile)**   \n**Price Range: ~$400**   \n**Your TOP features in a phone are: Solid specs, smaller screen &lt;5.3\" preferred, good battery life, SD card support, at least 32GB**   \n**Anything we should know?: Bonus features I love are an IR blaster, removable battery and limited bloatware**    \n\nFurther details below.  Optional read.\n\nI'm located in the USA and use a smaller service provider called The People's Operator. It primarily uses the T-Mobile network.\nI use my phone quite a bit and would need something with decent to high-end specs. At least 3GB RAM, 32GB internal storage and SD card support is a must. \n  \nI've been through a bunch of phones recently trying to find one that is a good fit for me without any glaring flaws. I've tried the LG G5, Moto X 2014, and Moto X pure.  \nThe LG was a solid phone with awesome features rarely found these days, such as an IR blaster (love this) and an easily swappable battery... but definitely has a larger display than I'd prefer.  \nThe Moto X 2014 has a bit more compact size, but the lack of SD card access is a deal breaker.  \n  \nThe Moto X Pure that I'm currently using is a good phone, but the screen is much larger than I'd prefer. Another strike against it is that the battery life is just awful. If it had a swappable battery this would be less of a concern, but nope. It has also been a little glitchy from time to time.  \nI absolutely love the Moto features, particularly the ingeniously elegant and wave/approach display lock screen. Being able to check the time and notifications with a wave over the screen or a slight nudge is one of my favorite phone features of all time. I've tried several apps that somewhat replicate this feature, but none have come close to properly executing on it.  \nI'm taking a hard look at the Moto G5 Plus 64GB, though it is still on the larger side within tolerance with a 5.2\" screen.\nAlso interesting is the Pixel 1, with a nice 5.0\" screen. I'm doing some research on this now and there seems to be some mixed reviews. Also I think it would lack some of those Moto features I love without proper equivalent replacement features.  \nSo yeah. I'm leaning toward the Moto G5 at this point, but I just want to be done with this searching and sampling and rebuilding my home screens and whatnot. It's taking up more time than it's worth.  \nSince I use my phone a lot I figure it is worth the investment to do a lot of research, but I'm reaching the overdone threshold.  \nAny thoughts?", "created": 1511652960.0, "replies": []}, "7fh8uf": {"title": "Upgrading from iPhone 6", "text": "I have been using iPhone 6 for quite sometime and I would like to make the switch to Android now. Not into photography and stuff like that(took about 6 photos in past 9 months). Suggest me a phone below $1000. \nP.S.: I tend to drop my phone pretty often but somehow this phone has lasted my torture. ", "created": 1511637040.0, "replies": [{"text": "If you're looking for that characteristic \"iPhone speed\" the One plus 5T comes in SIGNIFICANTLY cheaper than $1000 (About $500) and is well regarded as one of the fastest Android phones to date. For the durability you asked for I'd say get a case of some kind. Hope this helps.", "created": 1511651280.0, "replies": []}]}, "7fh0bn": {"title": "Honor X6 or G5 (s/or not; plus/or not)", "text": "**Country:** Slovakia  \n**Provider:** O2  \n**Price Range:** 180-300€  \n**Your TOP features in a phone are:** Battery life, smooth performance, will last long time (my last one, htc desire 300 lasted 4 years)  \n**Anything we should know?:**    \n\nG5 for 194 €   \nG5s for 218 €   \nx6 for 242€  \nG5 plus for 266 € (the site claims 3GB ram, but wikipedia says 2 or 4)  \nG5s plus for 290€  \n\nG5 seems a bit weak and G5S plus too expensive. I'd mainly like x6 or G5s or G5 plus.", "created": 1511634859.0, "replies": [{"text": "I own Honor 6X and it's a great phone for its price. The battery lasts easily through the whole day, and I don have any lags. Ok camera, EMUi is not that bad as other say. You might even love it if you think stock Android is boring.", "created": 1512193012.0, "replies": []}]}, "7f5wfc": {"title": "S7 , S7 Edge or S8 ??", "text": "good day , so im into a bit of a dilemma between the s7 and s7 edge is 50 dollars and between that and s8 is 150-200$ is it worth it to get the s8 ? ", "created": 1511508797.0, "replies": []}, "7egv6z": {"title": "I would be most grateful if somebody could recommend me a phone with these specs", "text": "Water resistant, as near to stock Android as possible, decent size screen (Nexus 6p kind of size but not bothered about super high resolution), good battery life and it must have a headphone jack. Mid range and above. Also available in the UK. If anyone can help I would be so grateful! Many thanks in advance", "created": 1511259438.0, "replies": [{"text": "Sony XZ1/ Premium would good choices: 5.5\" screen, headphone jack, good battery, and flagship performance.  ", "created": 1511289777.0, "replies": []}]}, "7dunu4": {"title": "Need recommendations for Straight Talk phone", "text": "**Country:**   USA\n**Provider:**   Straight Talk\n**Price Range:**   $400-$600 Retail (which is around 200-400 amazon/ebay) \n**Your TOP features in a phone are:**   Fast, Good Camera, large screen\n**Anything we should know?:**    Unfamiliar with how Straight Talk lets you choose phones if you buy them through ebay.\n\n", "created": 1511029226.0, "replies": [{"text": "Which network are you going to use for Straight Talk?  ", "created": 1511121836.0, "replies": [{"text": "I guess I do not know the answer to this. I thought straight talk was the network lol i have an auto payment with them monthly for unlimited", "created": 1511157519.0, "replies": [{"text": "Sorry for not asking my question clearly: are you going to use AT&amp;T, T mobile, Sprint, or Verizon as the network provider on Straight Talk?  The big carriers sell their network to Straight Talk and some like Sprint and Verizon only allow certain phones on their network.  ", "created": 1511194411.0, "replies": []}]}]}]}, "7du4oe": {"title": "New phone, cant decide", "text": "Hey so I'm trying to choose a new phone. Currently have an LG V20. I love the new 2:1 aspect ratio of the new phones coming out now and I can't decide. \n\nI'm currently trying to decide between the Note 8, LG V30 and the Pixel XL 2. I have a Google finance account so I may be leaning twords that but idk. \n\nIf someone else has another phone they'd suggest I'm open to it", "created": 1511024438.0, "replies": [{"text": "Off-topic: is there anything you dislike about the V20 other than the aspect ratio?", "created": 1511201665.0, "replies": [{"text": "Hey nope nothing is wrong with it, in fact I love the phone. Just wanted a change since my wallet hates me :')", "created": 1511223726.0, "replies": []}]}, {"text": "Pixel XL 2 has screen burn-in issues, unless you want the stylus from the Note 8, the v30 is probably your best choice.", "created": 1511661530.0, "replies": []}]}, "7dqmg6": {"title": "350$-450$ Smartphone", "text": "**Country:**   \n**Provider:**   \n**Price Range:**   350$ - 450$\n**Your TOP features in a phone are:**   Beast build quality , good screen . \n**Anything we should know?:**   Need something at least stand 4 years like my M8 . I'm considering LG V20 , Galaxy S7 , LG G6 ( not plus ) , Oneplus 3 , HTC 10 . \n\n", "created": 1510979147.0, "replies": []}, "7dbrau": {"title": "i want a new phone", "text": "**Country:**   \n**Provider:**   \n**Price Range:**   around 160$\n**Your TOP features in a phone are:**   -big screen // -lowkey good camera\n**Anything we should know?:**    \n\n", "created": 1510831151.0, "replies": [{"text": "hey dude try to tell us what's your options so you might get some answers . sometimes 160$ differ from place to place . \nin this league I can say Samsung A5 , A7 , some of the Samsung C series . \nalso you might check Huwaei probably mid range classes . \nMotorola has some low budget great value phones too . ", "created": 1510979300.0, "replies": []}, {"text": "Honor 6x or Moto E4 Plus would be good picks. ", "created": 1511121883.0, "replies": []}]}, "7d6l2s": {"title": "November 2017 - Android 'Oreo' smartphone in 250$-300$ range", "text": "Looking for the best value/quality Android 'Oreo' smartphone in the range of 250$-300$. Would prefer the Android OS to be as 'clean' as possible.\n\n- Good camera\n- Screen in the 4.7 - 5.2\" range\n- EU region", "created": 1510774621.0, "replies": [{"text": "Anyone? :(", "created": 1510837243.0, "replies": []}]}, "7d4sr4": {"title": "Recommend me a flip phone", "text": "**Country:**   USA\n\n**Provider:**   Walmart Family Mobile (runs off t-mobile towers)\n\n**Price Range:**   $100\n\n**Your TOP features in a phone are:**  Needs to be a flip-phone and can't be a smart phone.\n\n**Anything we should know?:**    \nIt just needs to be compatible with my Family Mobile sim card and needs to be a flip phone. Amazon links would be nice.\n", "created": 1510759557.0, "replies": []}, "7d1itw": {"title": "Good battery life and custom Rom support?", "text": "What phone should I purchase? I currently have a moto g5 plus andove it. I need a 2nd phone tho. My top priorities are battery life and custom ROM support. I don't care about camera. I also need it to support LTE band 12 for T-Mobile in united states. I really like the moto e4 plus because of its massive battery, but custom ROM support appears to be lacking on XDA. I wish Xiaomi phones supported T-Mobile bands. Suggestions?", "created": 1510718794.0, "replies": []}, "7cpi3r": {"title": "Looking for a serviceable phone with decent app library that isn't retarded enough to dispense with the headphone jack.", "text": "**Country:**  Canada\n\n**Provider:**  Freedom Mobile (the freedom to drop your signal anywhere!)\n\n**Price Range:** $700-ish max, but obv the lower the better\n\n\n**Your TOP features in a phone are:**  Still has a m---------ing headphone jack for one. Has, at minimum, YouTube, Netflix, Imgur, and Uber apps available. Twitch, Instagram, Facebook, Snapchat, and Tinder are nice-to-haves. _Hoping_ for something that isn't going to f--- me with planned obsolescence in a few years (why yes, I _am_ switching from Apple!).\n\n\n**Anything we should know?:** Couldn't care less about camera quality or features. Used to having pretty bad battery life so I'll take what I can get there. Hoping to find something marginally mainstream so I have _some_ ability to find decent cases for it, but again, I'll take what I can get.", "created": 1510600891.0, "replies": []}, "7ciqnv": {"title": "Switch from Nexus 5X to iPhone SE?", "text": "A year ago I bought a used Nexus 5X to replace my aging Galaxy SII. I was a little worried about the screen size but hoped I'd get used to it.  The reality is that I never really did, besides that 32 Gigs of storage proved to be less than ideal for my use. It also started to get seriously laggy from time to time after the Oreo update.  So I was thinking about replacing it with something smaller, but with similar specs (camera, battery life and overall performance/smoothness are most important to me) and the only thing I could come up with is the 64 GB iPhone SE. I would like the phone to last at least three years but I'm not sure how long the SE will be receiving updates. I think in terms of being futureproof, the iPhone fares better than its android counterparts like the Sony Xperia Z5 Compact, which isn't even getting Oreo.  Is it really the only option or am I missing something? Thanks", "created": 1510526487.0, "replies": [{"text": "iPhones receive at least 4 years of updates and the SE came out in 2016, so you should be good for the next 3 years.  The SE is a very good phone.  The only other option would be the Sony X Compact or XZ1 Compact.  The battery life is better on the XZ1 Compact (the SE and X Compact are comparable), the camera is better on the SE, and performance edge goes to SE but all are very powerful.  If you want a bigger screen in the same size body, go for the Sony's, otherwise the SE is much cheaper than the XZ1C and only a bit more than the X Compact. ", "created": 1510678894.0, "replies": [{"text": "I definitely plan on keeping it for a while and I want to receive updates and I'd say I have a bigger chance with iPhone than Sony (or android in general unless it's straight from Google) so yeah, the SE it is. I'm gonna stick around until Black Friday though, there could be some sweet deals ", "created": 1511099779.0, "replies": []}]}]}, "7cglzm": {"title": "Looking for a good phone for Christmas", "text": "Hello! I'm Looking For a Good Phone this Christmas and i was hoping you guys would help me. Here are my specifications\n\nCountry: England, UK\n\nCarrier: N/A\n\nPrice: £150\n\nSize Preference: Large\n\nWhat will it be used for: Photography, Gaming, Chat (Including texting and face timing)\n\nPreferred Brand: LG/Samsung\n\nOther: NFC Compatible, Inferred (Optional), SD Card Slot (A Must)\nThank you!", "created": 1510506902.0, "replies": []}, "7censm": {"title": "Searching for the king of dumbphones", "text": "", "created": 1510481283.0, "replies": []}, "7cccsq": {"title": "Nokia 2 or Moto C Plus", "text": "Just cracked the screen of my Lumia 920. Bought it new and had it for 4 years and loved the ease of use. But being a user in Pakistan, I couldn't use Google Maps which was a downside. My budget is $150. The Moto C Plus is available for $140 here and has the better specs on paper but I like Nokia 2's design. Plus the Nokia 2 doesnt have the annoying capacitive buttons but 1 GB Ram seems insufficient. My use is for non graphic intensive apps, i.e Whatsapp, wikipedia, maps, uber, fm radio. I hope the phone lasts me for 4 years. I can wait for 6 months if anything better in the budget category is coming up.\n\nAny help appreciated!", "created": 1510448625.0, "replies": []}, "7c2b1z": {"title": "Spring dumbphone", "text": "Title should read SPRINT, durr\n\n**Country:** USA   \n**Provider:** Sprint (in fact, Ting CDMA)  \n**Price Range:** flexible\n**Your TOP features in a phone are:** dumbphone with good build quality; QWERTY keyboard a plus  \n**Anything we should know?:** I have loved my LG Remarq, but it has become unreliable with MMS on my network, so I need a newer phone; ideally as much like that one as possible.\n\n", "created": 1510332797.0, "replies": [{"text": "DuraXTP. It’s the nicest “dumbphone “ out there. No QWERTY, but durable and not cheap plastic.", "created": 1510525907.0, "replies": [{"text": "I found an older model DuraXT (without the P) on Ebay for less than $30. I need a good dumbphone for my smart sister. Will the XT work just as well on Sprint postpaid as the XTP? or do you know where I get one guaranteed to work on postpaid for less than $40?", "created": 1510593149.0, "replies": [{"text": "The XT is a decent-enough phone for the job. I still had an XT on postpaid up until about six months ago, and it still ran great even after all this time and regular use (not by me, but a friend who is hard on phones).\n\nIf you can swing the XTP, it's a huge upgrade in terms of build quality. But I understand the price differential. \n\nGo with the XT for &lt;$30 on eBay and you won't be disappointed. If you can make the $70 XTP work, you won't be disappointed.\n", "created": 1510593798.0, "replies": [{"text": "Thanks for the advice, it is much appreciated. Where can I find the XTP for $70?", "created": 1510594255.0, "replies": [{"text": "I found it [here.](https://www.ebay.com/itm/Sprint-DuraXTP-Basic-Flip-Phone-VGC-Rugged-Clear-ESN-Tello-Ting-Prepaid-MVNO/142572606459?epid=548015356&amp;hash=item2131fd53fb:g:ZM8AAOSwY~1aBCQ6)", "created": 1510594425.0, "replies": []}]}]}]}, {"text": "Thanks. Couldn't find an XTP that felt like a good deal and worked on my network, but I got an XT.", "created": 1510782512.0, "replies": []}]}]}, "7c23kv": {"title": "Help me pick between the iphone 6 and galaxy s6", "text": "**Country:**   Portugal\n**Provider:**   \n**Price Range:**   250-300 €\n**Your TOP features in a phone are:**   camera, battery life\n**Anything we should know?:**    \n\nHey guys i was just wondering if you could help me out , i currently own an iphone 5 and i want to switch to either an iphone 6 or galaxy s6 and i don't know wich one to get, since the iphone has worse camera and battery life but better os , even though i'm not really sure about the camera on the s6 since it was seems a bit weird for me (front facing one)\nthank you !", "created": 1510330905.0, "replies": [{"text": "The S6 has a better rear camera, but a softer, worse front facing camera.  Neither will have great battery life and both should offer comparable performance.  The screen is much, much nicer on the S6.  Android v. iOS is pretty comparable in ease of use.  Hope that helps!", "created": 1510526070.0, "replies": []}]}, "7bxae5": {"title": "Novice user looking for good software + battery life (price range up to 350e). Should I get an iPhone? If so, which one?", "text": "Hello, Im a journeyman smartphone user. Didnt have too many of them, a couple of androids, first Sony Xperia U then Galaxy. Basically I dont play games on my phone or anything like that. I just use the basic apps like Whatsapp, Viber, some GPS, maybe some website apps like LinkedIN or Soundcloud. So, Im only interested in that the phone is not buggy/slowish and has a decent battery life such as 1.5-2 days. Androids are cheap and theres a lot of choice for Android smartphones, but I cant stand how slow and bloated they become after a couple of years. So you can say software (like OS) is more important to me than hardware (like octa-core and other stuff). I heard from some people IPhone 5 is still pretty solid and cheap. Thoughts? Tnx\n\n\nEDIT: I saw I should assign a flair, but I don't see the flair button? Where is it?", "created": 1510270425.0, "replies": [{"text": "From your requirements, an iPhone does sound like a good option. An iPhone 5s would fit comfortably in that price range, but if I were you I'd look for a good deal on an iPhone SE since it'll be updated longer", "created": 1510302092.0, "replies": []}, {"text": "Switch to desktop site for flair button. ", "created": 1510619765.0, "replies": []}]}, "7bqcng": {"title": "Currently with Meizu MX5, switch or wait?", "text": "I'm currently with Meizu MX5 16gb. The phone works well, but I have a big annoyance with Meizu and them not caring about their older phones. That and their incredibly buggy new version of Flyme 6.\n\nI can spend around 200$. I've been looking at the Xiaomi Redmi Note 4 4gb RAM version. Unlike Meizu they will be updating to Android 8.0 (I'm currently stuck with 5.1 and no way to get a custom ROM.). Also the 4gb RAM would be a small upgrade. I'm not sure how much of an upgrade the Snapdragon 625 would be to my Helio X10, but I've seen shops selling the chinese version of the note 4 with Helio X20, not sure if that is worth it. \n\nShould I wait another year for my contract to be over, so I can get a newer phone when i re-sign or get the Note 4 or another phone in that price range, now? \n\nTl;dr : My phone is good enough with specs for me, but I hate that I am stuck with Android 5.1, should I get a new one with similar specs but newer Android? ", "created": 1510194027.0, "replies": []}, "7bk8by": {"title": "Looking forward to replace my Galaxy S5", "text": "**Country:**  South East Asia \n**Provider:**  Unlocked\n**Price Range:**   US$250 or below\n**Your TOP features in a phone are:** Battery Life  \n**Anything we should know?:**    \n\n5 inch screen\n\nAt least 2GB Ram\n\nAt least 16GB Internal\n\nBack Camera should be as good as the Galaxy S5\n\nFront Camera, I'm ok with a 5mp snapper. I don't take selfies much but does some video calling here and there\n\nHas Fast Charging\n\nNot a heavy user, as long as the basics work good (GPS, Browsing, Messaging, Calls)\n\n\nOptional but not a Necessity:\n\nWater Resistant\n\nFingerprint Scanner\n\nThank you in advanced!!", "created": 1510132702.0, "replies": [{"text": "One Plus 5t for 479.00", "created": 1510191897.0, "replies": [{"text": "a bit over budget tho.", "created": 1510291960.0, "replies": []}]}, {"text": "Moto E4 or anything from Xiaomi.  ", "created": 1510525790.0, "replies": []}]}, "7bbqlh": {"title": "Flip phone with decent GPS.", "text": "**Country:**   USA\n**Provider:**   T-Mobile\n**Price Range:**   Under $200\n**Your TOP features in a phone are:**   Calls, texts, GPS/navigation\n**Anything we should know?:**    I've been doing a bit of research and the general consensus is that GPS on flip phones is simply not good. Am I out of luck or is there a model out there with what I would prefer?\n\n", "created": 1510040712.0, "replies": []}, "7b8qw1": {"title": "XPERIA X OR P10 LITE", "text": "**Country:Balkans**   \n**Price Range:225 euro**   \n**Your TOP features in a phone are:Lifespan,display,smoth browsing and lite gaming experience**   \n**Anything we should know?:The choice is betwen those 2 phones**    \n\n", "created": 1510007489.0, "replies": []}, "7actic": {"title": "s7 active vs blackview 8000 pro which rugged phone would do better for gamming ?", "text": "I'm trying to decide between these two moderate budget phones for semi casual gaming and video play.\n\nWhile one has better overall specs the other has better reviews and brand recognition\n\nhttp://gsmversus.com/blackview-bv8000-pro/samsung-galaxy-s7-active/", "created": 1509641469.0, "replies": [{"text": "Snapdragon 820(S7 Active) crushes the P20(BV) gaming wise. \nYou also get better screen, camera, waterproof and better durability on the s7 active. ", "created": 1510620075.0, "replies": []}]}, "7a34fu": {"title": "My LG G3 recently died and I'm looking for a smaller replacement", "text": "**Country:**   \nBelgium\n\n**Provider:**\nTelenet (800/1800 MHz)   \n**Price Range:**   \n€600-800 \n\n**Your TOP features in a phone are:**\n\n- great battery life\n\n- great camera\n- great performance \n- screen between 4.5\" and 5.2\"\n- sturdy build\n- fingerprint sensor  \n\n**Anything we should know?:**    \nI've been using my G3 for the past 3 years and while I loved having a big screen for media consumption, I feel like going back to a smaller screen. OLED looks better on a smartphone, but I could live without that. I used android since my first smartphone, but I might be swayed. \n\n", "created": 1509537896.0, "replies": [{"text": "The only phones in that size range are the Pixel (1 and 2) and the Sony XZ/XZ Compact.  The pixel will have a much better camera performance, but otherwise they will be comparable.  ", "created": 1510525884.0, "replies": []}, {"text": "Check LG V30 , LG G6+ great build , camera and high audio capability.   ", "created": 1510979518.0, "replies": []}]}, "79mtwv": {"title": "Looking for Phone with 3.5mm and SD card More high end", "text": "Title", "created": 1509359120.0, "replies": [{"text": "Note 8 or S8 Plus ", "created": 1510054503.0, "replies": []}, {"text": "Oneplus 5t, Samsung Note 8/S8/S8+, LG G6 (bargain choice), or LG V30.  ", "created": 1510525947.0, "replies": []}]}, "79kj3z": {"title": "Trying to decide between an LG G5 and a G6", "text": "I have a G4 and love it, but it's getting kind of old and worn so I was gonna get a new one. Is the G6 that much better of an upgrade or is the G5 fine enough", "created": 1509325691.0, "replies": [{"text": "The big difference is in the build quality: the G6 has a glass back metal unibody versus the G5's metal modular build.  Having used both, the G6 does feel \"nicer\", but the G5 was sufficient for me, a lot cheaper, and has the replaceable battery.  The GPS on the G5 is questionable for some models. ", "created": 1509326380.0, "replies": []}]}, "796lrd": {"title": "Looking for a $400 phone", "text": "Right now I have the iPhone 6s in mind, I’m kinda looking for Android phones better than the 6s (performance wise) so open for suggestions..\nIt would be great if it’s lower than $400 too\n\nEdit: Bought a LG V20", "created": 1509144140.0, "replies": [{"text": "For raw CPU power, nothing is going to beat an iPhone 6s or newer iPhone.  However, flagship/flagship killer phones are fast enough now that you are not likely to notice a difference in everyday use. The LG G6, Honor 8, and ZTE Axon 7 would be good choices.  The G6 has the best camera and screen, Honor 8 best performance, and the Axon 7 is the best for music and has a very good AMOLED screen.  ", "created": 1509311857.0, "replies": []}, {"text": "Go to sprint and try the essential phone if you want to try Android.", "created": 1510005511.0, "replies": [{"text": "Bought the LG V20, thanks though.", "created": 1510026988.0, "replies": []}]}, {"text": "hey how the LG v20 going ? I'm considering it and the galaxy S7 . ", "created": 1510979568.0, "replies": [{"text": "Depends, how long are you gonna keep it for and what do you need from a smartphone? \nIf its a long time I would suggest the v20 because removable battery, the s7 edge has a larger better but it wears out fast. \nS7 also has battery resistance and wireless charging, arguably better screen, but the v20 has dual cameras, 2nd screen, quad dac, ir blaster and metal body vs glass on the s7.", "created": 1510981464.0, "replies": []}]}]}, "78pkok": {"title": "Best battery and camera, Verizon, under $175", "text": "Edit: Android", "created": 1508955367.0, "replies": [{"text": "Moto E4 Plus may be a good candidate:\n\nBattery: 5000mah\n\nCamera: \n13+ megapixel / f/2.0 aperture, LED flash / panorama, HDR\n\nVideo: 1080p HD\n\nCost: $160-200", "created": 1508967082.0, "replies": [{"text": "&gt; Moto E4 Plus\n\nThanks! I'll check it out.", "created": 1509311064.0, "replies": []}]}]}, "78me8s": {"title": "AT&amp;T - USA - Less than 5\" screen, Around $100 (Nexus 4 replacement)", "text": "My dad has broken his Nexus 4 screen for the second time, after paying for it to be repaired previously. He is really not into larger phones. The Nexus 4 is about 5.25 tall but a 5.5\" tall phone MIGHT work. That is the critical dimension as he keeps his phone in his buttoned shirt pocket and tall phones prevent this. Other requirements are just that it is 16gb+ (or expandable) and has a decent camera. He would much prefer a phone that would work on AT&amp;T and Verizon but beggars can't be choosers. It's really pretty unlikely that he will switch anyway.\n\nHe seems to like the iPhone SE, actually, but it is out of his price range ($150). He likes the thickness of it and overall dimensions. There doesn't seem to be many sub-5\" screen phones being made any more. Used or new is fine. I could possibly get him to go over $100, but certainly nothing over $150 shipped. Any suggestions?", "created": 1508920820.0, "replies": [{"text": "Used Sony Z3 compact, X compact, or iPhone SE are really your only options.  ", "created": 1509326174.0, "replies": [{"text": "Thanks, these were all great recommendations but he ended up just picking another Nexus 4 for cheap. Not what I would choose but probably fine for him.\n", "created": 1509450245.0, "replies": []}]}, {"text": "If he wants something that will last long(both battery and performance) and doesn’t like to tweak much(Android customization is way better than iOS) then get the iPhone SE.\nIt’s basically a iPhone 6S in a 5S body without the 3D Touch", "created": 1509327197.0, "replies": [{"text": "Thank you for the recommendation.", "created": 1509449993.0, "replies": []}]}]}, "78fwh6": {"title": "lg g6 vs oneplus 5", "text": "Help me choose which one could be better for me. Important things are\n-camera\n-battery\n-build quality\n\ni can get g6 32gb for 420€ and oneplus 5 for 499€\n", "created": 1508853540.0, "replies": [{"text": "Camera: G6 (Huge Edge) Battery: OP5 (pretty big edge) Build: Tie.  ", "created": 1509326235.0, "replies": []}, {"text": "OP5 = Snapdragon 835; 8GB Ram; 1080P Screen\n\nLG G6 = Snapdragon 821; 4GB Ram; QHD+ Display\n\nBoth have same battery size, the obvious winner is the one plus 5 with that battery efficient processor and 1080P display, not to mention much better performance.\n\nEdit: About the camera, if you want zoom lens go for the OP5 and if you want wide angle go for the LG G6", "created": 1509326796.0, "replies": []}, {"text": "What did you decide in the end? Both are pretty good.", "created": 1510270571.0, "replies": []}]}, "77mluk": {"title": "Looking for a $200 - $350 Android Phone", "text": "As the title says I'm lookign for a capable $200 - $350 Android phone.  The closer to stock Android, the better.  I'm not super fussed about camera.  Performance and durability are more important to me.  I was looking at the Moto G5S Plus, what other options are there?", "created": 1508511409.0, "replies": [{"text": "Moto is probably your best choice.  ", "created": 1509311901.0, "replies": [{"text": "Cool that's kinda what I figured.  Any good sites I should be looking at?  I've narrowed it down to the G5 Plus; reviews seem to say the G5S Plus isn't enough of an upgrade for the price hike.", "created": 1509366552.0, "replies": []}]}]}, "76q072": {"title": "Iphone 8 or Samsung s8?", "text": "Currently have an iPhone 6. Can't seem to decide between these two it's 50/50. Main thing putting me of another iPhone is the loss of a headphone jack. \n\nIn terms of Samsung I like it because of the look, screen, I think it's better for gaming? Also would be nice to try something different. But mostly im buying it because it's an aesthetically pleasing phone. Oh and also because transferring files is a lot easier than with stupid iTunes.\n\niPhone obviously loss of headphone jack is huge for me and it's not a big upgrade for the money. I mostly want it because I already have an iPhone and cloud is great. Obviously love the operating system and I do also like the look.\n\nAny ideas?", "created": 1508155403.0, "replies": [{"text": "The iphone 8 comes boxed with an 3.5mm headphone adapter, so it's not that much of an issue. The S8 has a gorgeous, \"futuristic\" design while iphone 8 is.... well, an iphone. I switched from S8+ to iphone 8 because I just prefer iOS, battery life seems better, and I don't mind the traditional look. Both of them have great cameras and smooth performance, although iphone generally has better longevity than Samsung.", "created": 1508245833.0, "replies": [{"text": "Hey thanks for the info! Yeh i'm actually slightly leaning towards the Iphone. I don't actually mind the design as it is very compact and I love IOS. Also have heard battery life is much better as the A11 chip is amazing. In terms of transferring files do you miss that? I always love how I can click and drag files onto my Samsung tablet in minute. Iphone on the other hand you have to fire up itunes, convert files, etc. Also they only take MP4 files which sucks :(", "created": 1508249196.0, "replies": []}]}, {"text": "Galaxy s8. Don’t make the iPhone mistake ", "created": 1510054613.0, "replies": []}]}, "76jgo9": {"title": "looking for large Rugged phone", "text": "**Country:**   USA\n\n**Provider:**   AT&amp;T at the moment, but considering a switch to Verison due to little service at home\n\n**Price Range:**   Ideally $200-$400, but willing to go up to $600 if extremely ideal\n\n**Your TOP features in a phone are:**   \n1 Ruggedness.  I drop my phone a lot and would not like to join the spiderweb phone fanclub. Also waterproof and dust proof. I work in a machine shop with oil and chips.  I believe IP67 or IP68 is the proper designation?\n \n2 Size.  I have a Kyocera Duraforce right now, and that is about as *small* as i want to go.  I used a friends Samsung Rugby Smart and the keyboard was way to small for texting frequently. Also I like to watch videos while on the treadmill so **larger would be better**.   I have no qualms about hauling around a bulky phone\n\n3 Bloatware.  Please as little as possible.  Not something easy to quantify, since the same phone provided by a carrier might have more than the same phone not on the carrier, but I've recently purchased unlocked phones that still have useless, un-deletable memory hogs.\n\n4 Headphone jack.  I have old school cheapo earbuds\n\n5 (not especially important, but it makes the list) Battery life.  As long as it can go 20ish hours without needing a charge i'll be ok.  i use infrequent texting most of the day, as well as playing music, and I stream video for about an hour everyday.  \n\n**Anything Else:** \n\nI see a lot of rugged phones coming from china or japan.  I have no problem where the phone is made, but I would like shipping times to be less than 2 weeks if possible.  Unless, of course, the phone's release date is only sometimes in the future.\n\n", "created": 1508080299.0, "replies": [{"text": "Samsung Active line is your best bet.  Otherwise, Moto Z Force has an \"unbreakable\" screen as well, but is not waterproof like the Actives and lacks a headphone jack.  LG X Power/Venture might be options, a little lower end, but still in the rugged line of phones.  Good luck!", "created": 1509312091.0, "replies": []}]}, "76hs1s": {"title": "Need cheap phone but not sure what to buy", "text": "**Country:** Australia (can use package forwarding so can come from anywhere)\n**Provider:** preferably unlocked but anything really\n**Price Range:**   0$ :) -$150aud 118usd\n**Your TOP features in a phone are:**  physical keyboard, not REALLY SLOW, can run basic web searches and passable back camera \n**Anything we should know?:** \ni only like physical keyboard because ive only used slow phones and i found the one on my original huawei to be to slow and unresponsive but as i have no other experience with phones i dont know if a phone in this price range will have the same issue (ive had two phones both budget, cheap and unable to do internet in someones lifetime\nthanks for any help/ suggestions\n\n", "created": 1508054475.0, "replies": [{"text": "You might be able to find a Blackberry Priv on eBay for around the top-end of your budget. Quite a large phone but it has a cool slide-out pkb, curved screen and will handle basic apps with ease.", "created": 1508246136.0, "replies": [{"text": "thanks but its a bit out of my budget. i found a asus zenfone for $80", "created": 1508629956.0, "replies": []}]}]}, "76ff9w": {"title": "Traveler looking for new phone", "text": "Hi. American with Verizon here. I have had various iPhones for half a decade and I'm ready to make the switch. I'm heading to Israel &amp; then South America within the next year for about 6 months of backpacking. I'm looking for a phone I can use at home and abroad with a few main features in order of importance:  \n\nLong battery life   \nLots of storage for pictures/audiobooks/music    \nGreat Camera     \n   \n\nAdditionally, it would be nice to have a phone that isn't monstrously big, but I'm flexible on size. I'm a writer and musician, so I'm looking for a phone that facilitates large data transfers and makes it easy for me to use word processors/transfer documents via cloud between devices.\n\n", "created": 1508022305.0, "replies": [{"text": "Pixel/2, Unlocked Samsung S8, or Unlocked LG G5/6.  The S8 and G5/6 have microSD slots, so you can bump up the 64 and 32GB, respectively, very cheaply and making ease of data/photo transfers to a PC.  These devices have huge band coverage, so you should be safe.  ", "created": 1509311566.0, "replies": []}]}, "75ugww": {"title": "iPhone 5S screen just cracked, time to upgrade?", "text": "Just broke it, finalllyyyyy after dropping it so many times. Time to buy a new phone? Considering iPhone 6s or 7 because money is kind of tight. Or just repair screen? ", "created": 1507779929.0, "replies": [{"text": "Probably can get a great deal on a 7.", "created": 1507791832.0, "replies": []}]}, "75d96d": {"title": "Best Smartphone For Business: High Call Quality", "text": "I'm located in the US and use AT&amp;T. I currently use a Moto G5 Plus phone that has poor reception in general and very quiet speakers. I want to upgrade my phone to use for business and would prefer a flagship phone. No limit on budget. \n\nThank you!", "created": 1507593476.0, "replies": [{"text": "I guess.... I'll answer my own question? I just bought the Samsung S8+. The speaker for calls is way better than the G5 Plus. Everything sounds clearer and louder. \n\nReception is a bit better, but the big piece is wifi calling. That makes the call sound a lot better, but you need to buy the phone directly from AT&amp;T to use wifi calling. I couldn't before because it was an unlocked phone. \n\nLastly, it's a beautiful screen. It's only a little bit bigger than the G5 Plus, but the screen is massively bigger and has brighter colors. ", "created": 1509111639.0, "replies": []}, {"text": "Good choice ", "created": 1510054652.0, "replies": []}]}, "75ci89": {"title": "Phone help please!", "text": "I'm in the US, currently on AT &amp; T but willing to switch around. I a currently on a Samsung S4/16g,that is running out of space. I am looking for a phone with more internal space and good video quality. I run the FB page for my roller derby team and would like to start posting more video content like coaching tips and exercises. Aside from that I mostly use phone for e-books and snapchat.     \n\n", "created": 1507585968.0, "replies": [{"text": "Look for a phone with a microsd card slot, so you can get 128 or 256 gb of space to store the videos.   At 1080p it won't take long.  ", "created": 1508252920.0, "replies": []}]}, "75bftf": {"title": "Upgrade time: on the fence... Android or iPhone", "text": "**Country: Canada**   \n**Provider: Bell but going to switch to Koodoo probably in Dec**   \n**Price Range: plan: 400 down pluse 60-70/month OR ideally 800-900 outright **   \n**Your TOP features in a phone are: REALLY GOOD PROCESSOR and either lots of memory or expandable memory**   \n**Anything we should know?: I kinda lean towards the s8 but have a macbook which makes me feel like I should continue using iPhone**\n\nSo I'm currently rocking the iPhone 6 16gb (LOL) and I'm in desperate need of an upgrade. That being said I have a few options I am looking into based on my preferences and needs.\n\nOption #1 aka Shut up and Take my Money: I go ahead and keep being a shill to Apple and pay $1400 (thanks Canada) for an entry level iPhone X which, for all intents and purposes is a more expensive Galaxy S8. I get to keep the emojis I like (and have animated emoji?) and imessage is still useful as I also own a Macbook pro.\n\nOption #2 aka Together We Shall Rule the Galaxy s8: I buy a Galaxy s8 for $800 Canadian and essentially get a slightly better iPhone X for a much more reasonable price (and that gorgeous infinity screen!)\n\nOption #3 aka MegaPixel: I go for the Pixel 2, what I understand to be the android competition to iphone 8.\n\nI could of course always get one of these devices cheaper if I commit to a plan from a local provider but I don't really like being tied down to how expensive our big cell companies are up here in the great white north.\n\nAlso, though it sounds silly and you guys will probably hate me for this, I REALLY like my Macbook pro, it's a good computer despite what some may think of OS X. Do any android users out there have apple laptops? Is having \"incompatible\" technology not really an issue or do you desperately miss having your imessages etc all synced together on your phone and computer? Are there any work arounds or apps that make owning both an android and a Macbook easier?\n    \n\n", "created": 1507576697.0, "replies": [{"text": "I use android with Linux.   All the pictures and text and whatever come through the Chrome browser, or when I connect it via usb it just  shows as another drive.   I'm not sure what you're using on both though.   I've seen too many people lose their music collections to itunes to ever consider using it myself, along with the DRM issues and proprietary formats.     If you have a gmail account, and use hangouts, the messages will go to phone and computer.   \n\nI've never been willing to spend enough on gizmos to buy apple products, but I have supported some.   To me the premium is not worth it.   If I could stand the size and the price I'd go with the Pixel.   I had the first nexus, and it was the tits.  As Google's reference design, it's cutting edge.        Android has a lot larger installed base the ios, and Steve Jobs is dead, so eventually Android is going to win out over Apple like Microsoft did, and for the same reasons, being that Android runs on diverse hardware, and because of that there are more Androids, so because of that more apps.  \n\nFurthermore, I like Project FI for a carrier, but I don't trust Google not to drop it, as they did with desktop search.  They might be less likely to because it is a revenue stream.  I've been using Google Voice for years, with the transcribed voicemail going every where is really handy.   Aside from that, I'm not really willing to drop $600 on a phone again, when a $200 phone will do.   If you do go for the pixel, you might as well drink the coolaid, providing it's available up there.", "created": 1508253765.0, "replies": []}]}, "758dzw": {"title": "Pixel or pixel 2?", "text": "I am trying to decide between the pixel and pixel 2 (not pixel XL) and can't decide if the $100 or so the pixel 2 is over the original pixel is worth it", "created": 1507547777.0, "replies": []}, "74tka1": {"title": "£150 budget for android phone, older high spec or a moto G5?", "text": "Hi all, looking for a phone in the uk, got a strict £150 budget due to being off work due to long term sickness, my htc one m8 has just died and was getting too slow ans sluggish for me, I mainly use phone for internet browsing and youtube, I am tempted by a moto G5 but my reservations are that I am used to high end phones and that it does not have gorilla glass as I am clumsy and prone to dropping my phone, does not having gorrila glass mean the screen is much more likely to break?\n\nI am also concerned I will really notice the difference coming from high end devices so would a secondhand htc one m9 or lgg4 still cut it and last me a few years without being way to slow and sluggish and would a G5 be likely to be good after a few years?\n\nAlso not interested in importing a chinese phone as need a new phone ASAP\n\nThanks for any help.\n\n", "created": 1507361449.0, "replies": []}, "74omru": {"title": "Looking for a big budget smartphone", "text": "country is uk. Looking for a smartphone that is big in size (easy for dad to read on it, something like 5.5 inches should suffice) and it has to be cheap (&lt;£150). will be used mainly for checking emails, calling and browsing the internet/watching videos. \n\nthanks.\n\n", "created": 1507306301.0, "replies": [{"text": "The Samsung Galaxy Mega 6.3 and 5.8 were giant phones and really low cost when released. I'm sure you can find one for very cheap now. It was basically a very large Galaxy S3. You can still get new batteries for those models. Sometimes I thought of getting one just for the lols... but those phones are truly mega size and have very large buttons. ", "created": 1507348757.0, "replies": []}]}, "74mpz1": {"title": "What phone has a good screen-to-body ratio, good camera and enables ok google?", "text": "Hey, \n\nSo i'm on a galaxy s6 edge and I love most things about it. The battery is starting to annoy me and so i'm looking for a new phone. \n\nI was looking at the galaxy s8, but with I don't know how I would fare with the bixby thing. Ok google while the screen is off is kind of an important to me and my current samsung phone has this feature disabled (except for when the phone is charging, but what's the point in that?)\n\nSo below are the most important features in this phone that i'm looking for. \n\n- ok google (as close to stock android as possible)\n- fast charging\n- high screen to body ratio\n- oled screen\n- good camera\n- headphone jack\n\n\nIf anyone can give me a good phone that will fit my requirements, I would appreciate it. \n\nThanks.\n", "created": 1507285057.0, "replies": [{"text": "LG V30.\n\nhttps://www.phonearena.com/news/Apple-iPhone-X-vs-Google-Pixel-2-XL-vs-Galaxy-Note-8-vs-LG-V30-Specs-and-size-comparisons_id98695", "created": 1507299974.0, "replies": []}]}, "74ml6c": {"title": "S8 or iPhone", "text": "They're both pretty much killer phones but i was wondering which one would survive more with me and does the s8 have good camera quality ?", "created": 1507282947.0, "replies": [{"text": "S8", "created": 1510054684.0, "replies": []}]}, "73ydc6": {"title": "Picking out a new phone based on speakers", "text": "I'm trying to decide between the iphone 8+ and the galaxy s8+ Maybe another if the speaker is good, I have a galaxy 7 edge and I'm tired of the mono downwards facing speaker that is insanely quiet. do either of these new phones change it up? is there another new option that does? I'm with ATT if that helps. Every app i use has good iphone versions as well.", "created": 1507007302.0, "replies": [{"text": "S8+ has the same down-facing mono speaker setup that the S7E has so you're not really getting away from anything. iPhone 8+ has the front earpiece speaker used for media as well for the \"stereo\" effect so it's a bit better for separation and gets pretty loud. Neither of these phones are really known for speaker quality though, something like an Axon 7 would be where you'd want to look for if that's your top priority. ", "created": 1507054543.0, "replies": []}, {"text": "The new pixel does have stereo front facing speakers.", "created": 1507300097.0, "replies": [{"text": "If only they didn't partner with Verizon", "created": 1507311879.0, "replies": [{"text": "Why does that matter? It can be used on all networks.", "created": 1507312072.0, "replies": [{"text": "Can't do a trade in discount then.", "created": 1507345411.0, "replies": []}]}]}]}]}, "73u1m6": {"title": "Flip Phone with an internet browser", "text": "**Country:**   USA\n\n**Provider:**   Wal-Mart Family Mobile\n\n**Price Range:**   $100 Max\n\n**Your TOP features in a phone are:**   \n\n- Flip Phone\n\n- Possibly Android or has Chrome or some type of Internet app\n\n- Touchscreen would be a big plus\n\n**Anything we should know?:**    \nNeeds to be a flip phone that can take a Family Mobile Sim Card (runs off t-mobile towers)", "created": 1506963424.0, "replies": [{"text": "This phone doesn't exist. Samsung makes a smart flip phone but it's very expensive. ", "created": 1506972016.0, "replies": []}, {"text": "I wanted the same thing.  Then I got a motoG with a flip case, and although it flips sideways, it gets me the same protection and almost the same on/off (still have to press a button to answer) with a regular smart phone.   Currently I'm looking for a new phone with a requirement being the flip case capability.  I've noticed Asus phones have flip cases for them but they are a bit north of $100, when I am evaluating any new phone, it's my first look.    ", "created": 1508254603.0, "replies": []}]}, "73rddl": {"title": "Wife upgrading from firephone, suggestions please (j3, OnePlus x, Moto 5g plus)", "text": "She doesn't love new technology and is looking for an intuitive phone. She likes smaller phones, 5\" or below if possible, 5.25 Max. $250 or less, good battery, decent camera. She has an iPhone for work and doesn't like it, so is looking for Android. These are the phones I've found that I think might be good for her, any other suggestions welcomed.\n\n\nSamsung J3\n\n\nOne Plus X\n\n\nMoto 5g plus", "created": 1506929392.0, "replies": [{"text": "Well if she doesn't want new technology have you considered a used phone? ", "created": 1506957201.0, "replies": [{"text": "Do you have any recommendations of a good used phone model?", "created": 1506967264.0, "replies": [{"text": "Wow for $250 you can get an amazing used phone that's small.  \nThe Samsung S6, Sony Xperia Z5 Compact, Sony Xperia X Compact. All around $250 used and on the small side of smartphones. They will hold their value on the used market much better than those cheap phones you listed. They are also old \"flagship\" phones so they have way more performance and battery life. ", "created": 1506971290.0, "replies": [{"text": "Thank you", "created": 1506971615.0, "replies": []}, {"text": "Hi! This was a super useful reply. I was wondering what your thoughts are one going a little bit lower budget to $200. Is the Samsung S5 getting too old to hold up? I think my needs are similar to this thread, but I have a thread over here too if you're willing to look:\n\nhttps://www.reddit.com/r/PickAnAndroidForMe/comments/74lj8l/replace_galaxy_s3_for_at_or_under_200_with_quick\n", "created": 1507268478.0, "replies": []}]}]}]}]}, "73lyy5": {"title": "Upgrading from iPhone 5s", "text": "**Country:** Germany   \n\n**Provider:** Unlocked (Prepaid)\n\n**Price Range:**  Less than 1000 €\n\n**Your TOP features in a phone are:**  Camera, Processing power, Should help me in my graduate studies, offline navigation, Reliability (+ it should last more than two years, regarding updates, security and so an)\n\n**Anything we should know?:**   Currently, I'm using an iPhone 5s in combination with other Apple products (Mac and iPad - I. love the simplicity of this ecosystem &lt;3). Hence, I consider buying the new iPhone 8. However, due to the high price/innovation ratio, I think the Galaxy S8 is the better option for me. Is the extra money worth to stay in the Apple Ecosystem or should I just get the cheaper Galaxy S8/ another Android Device?\n\nThanks in advance\n\n", "created": 1506868755.0, "replies": [{"text": "I lot of first gen pixel phones will be going on sale soon. It has a great camera and probably cheaper than the S8", "created": 1507300156.0, "replies": []}]}, "73naro": {"title": "Google Pixel 2 vs. iPhone 8", "text": "I know, I know, I'm jumping the gun a little bit here. But I've had an iPhone 6 for a few years, having to switch the hardware out every few months because I lose the ability to get any cell service. This has happened now with 4 separate phone \"bodies\", 2 different SIM cards, and I'm kind of stuck on a family plan with AT&amp;T. Things I like about iPhone: Imessage (all my friends are on it).... and that's about it. Do I maintain the status quo or do I make the jump to Android?", "created": 1506882069.0, "replies": [{"text": "iPhone 8 is not a huge improvement for the money and is definitely more fragile. You'd be better off saving some money and going with the 7 or just go with the X. \n\n\nAs far as Pixel 2 goes it hasn't been announced officially yet so nobody knows how good of a phone it is until we can actually see it. ", "created": 1506916951.0, "replies": [{"text": "What would you say about choosing between the 7 and the Pixel 1?\n", "created": 1506918716.0, "replies": [{"text": "If you want to stick with the Apple ecosystem and how it works, the iPhone 7 is not a bad phone. Just seems like kind of a minor upgrade coming from the 6, which might make the X seem more of a worthwhile switch.\n\nIf you're fine with the learning curve of switching to Android or are already familiar, go with the Pixel.\n\nIf you use your headphone jack at all, go with the Pixel.", "created": 1507047021.0, "replies": []}]}]}, {"text": "Best 2 phones available are the iPhone X and Google Pixel 2 XL.  iPhone X does have wireless charging.. as does the iPhone 8.  It depends what features you want.", "created": 1507299753.0, "replies": []}]}, "73ltny": {"title": "Need Help Picking Specifications of New iPhone", "text": "I'm in the UK. Deciding to take a risk on Virgin Mobile because of prices. I've only ever had pretty terrible phones before, and I don't want to regret this choice. \n\nI'm thinking of going for an iPhone 7, but please lmk if you think there's no point and I should save money going for a 6, OR if it would be worth a little extra going for an 8. \n\nRight now I have an iPhone 4 with just 8GB of space. It is infuriating. But would a 32GB be enough? I don't keep much on my phone. I don't really listen to music, I do sometimes listen to podcasts but mostly at home without downloading them, don't do any streaming/downloading and will only have a handful of apps compared to other people, at least. The main thing I want is a good camera to take good pics - but I also like to keep my phones neat, so I won't be hoarding thousands of them on my phone throughout the years. \n\nThe one thing I always do run out of is data. I'm pretty sure I have 500MB at the moment on my contract? I usually run out about half way through the month, sometimes even less though. Would I be ok with 1.2GB, or should I go for a 4GB plan? \n\nThat being said, my main concern is a good camera. And just having a phone that runs smoothly and quickly, rather than not being able to process the most simple of requests. \n\n\n", "created": 1506867073.0, "replies": [{"text": "If you've been getting by with 4gb and you don't download the internet or keep thousands of photos on your phone... I think you might even get by with the 16gb iPhone 6+. I say this because I have one and we have identical usage characteristics.  \n  \nThe newer iPhone 7 has more features and a faster processor but that amounts to nothing if you are using your phone for basic tasks. The camera on all newer models have been basically the same since the 6+ with built in optical image stabilization and slow motion. Still, a massive step up from your iPhone 4.   \n  \nYou could always save even more money by picking up a used iPhone in good shape from a reputable vendor with some warranty. There are really good deals out there on iPhones with minor scratches. It would be easier to get rid of your iPhone 4 since they would take it in as trade value. ", "created": 1506915004.0, "replies": [{"text": "Thank you! Weirdly, the iPhone 6 plans are more expensive than the iPhone 7 ones at the moment but it's reassuring that I don't have to shell out for a 128GB model. ", "created": 1506936922.0, "replies": []}]}]}, "739zwx": {"title": "Need a phone, i listen to a lot of music", "text": "**Country:**   Norway\n**Provider:**   Any\n**Price Range:**   Any\n**Your TOP features in a phone are:**   I use my earphones more than anything so i guess a good dac/amp. Battery life is also important\n**Anything we should know?:**    So i work a lot in a storage area and i take the bus everyday. I need a new phone because my zenphone 2 is shit.\n\n", "created": 1506712092.0, "replies": [{"text": "budget? do you want a cheap phone that has to be replaced every year or a full-on flagship that can carry you through the days? if you're considering a flagship, wait for LG v30. LG v20 is also not a bad choice, the DAC is pretty amazing has a removable battery and secondly a good battery, but because LG cant figures their heating out it might break in like 1 or 2 years. ", "created": 1506808492.0, "replies": [{"text": "what do you mean by heating out exactly ?? I'm considering LG v20 or the Galaxy S7 . ", "created": 1510979762.0, "replies": [{"text": "apologies for the late reply, but in sum, All LG phones before the g6 is prone to overheating, and varying on your use will eventually burn out in a year or two. They're great phones but their heating is absolute garbage. ", "created": 1511558974.0, "replies": []}]}]}]}, "72l95k": {"title": "I need help deciding between my two phones...", "text": "**Country:**   USA\n\n**Provider:**   T-Mobile\n\n**Price Range:**   N/A\n\n**Your TOP features in a phone are:**   Signal Strength, Data, Screen (I watch a lot of YouTube videos on my phone), &amp; Camera (starting a YouTube Channel).\n\n**Anything we should know?:**    I have the Note 8 and the iPhone 8+ (with the AirPods and Apple Watch Series 3). I love the continuity between the AirPods, Apple Watch and phone. I love iMessage (which most of my friends use).\n\nThe rest of my family uses Android. So, I don't have iMessage with anyone in my family.\n\nWhy I want to keep the iPhone? Continuity, reliability, &amp; iMessage. Having bezels is nice as I can lay it on my bed and no rogue touches are happening from the covers or my boobs, depending on how I am holding it. This is one thing I always have issues dealing with when holding my Note.\n\nWhy I want to keep the Note 8? Customizability, screen size, SPen and Samsung Pay (earning those points!). I use the SPen nearly 24/7 while I am using the phone. I love having the option.\n\nAs you can tell I'm very indecisive, I make a decision for one minute and then I go back on it a few hours later. Which is why customization is nice on andorid. On iPhone it is just moving apps around on a set space. There is an app drawer on android which gives me the ability to hide apps. But iPhones just work, they are reliable... I don't get app crashes at all (never randomly goes back to the home screen) and the camera is perfect for my needs.\n\nI'm not sure what to do. I have until the 1st to make this decision. I'm hoping I can make it sooner rather than later though!\n\nHelp?", "created": 1506441053.0, "replies": [{"text": "Do you legitimately see yourself using the Apple Watch on a daily basis and depending on it? If so, go with the iPhone. If not, I strongly suggest keeping the Note 8. You'll find that well after the factory warranty expires, rooting the phone will get you software updates for several years down the road. There are Android phones that were released 5 years ago that are still getting software updates from the community. Apple is starting to forcibly make people upgrade so their old phones lag, or stopping updates altogether. That is extremely dangerous as exploits can make those devices permanently vulnerable. ", "created": 1506472068.0, "replies": [{"text": "Yes out of every smart watch the Apple watch is my favorite by far.", "created": 1506475312.0, "replies": []}, {"text": "Those updates do worry me though... I am picky and don't like slow phones.", "created": 1506475432.0, "replies": []}]}, {"text": "Starting a youtube channel with a phone... I can see why you'd want to do so but trust me just use a camera. But at the thought of starting a youtube channel with an iPhone kills me a little on the inside. I do realise iPhone has made a huge jump from the 6 to the 7, but the specs on the note 8 are still way superior and if you do not like Note 8's colour recreation as android tend to create cooler colours than iPhones, there's always a little something called editing your videos. Trust me no matter how much reliability and continuity or iMessage, its still a much worthy deal to get a Note; battery life, non-mediocre updates and better specs will thank you.", "created": 1506809615.0, "replies": [{"text": "I plan on getting a camera but don’t have the money for a $600 point and shoot. So I’m just gonna save up for the cannon rx series.\n\nI understand what you are saying but you have to start somewhere.", "created": 1506809810.0, "replies": [{"text": "Yes, I see, but if so go for note 8 I trust android cameras for their history more", "created": 1506973703.0, "replies": []}]}]}]}, "71r193": {"title": "New Phone", "text": "Hi,\n\nMy BlackBerry has become useless because a lot of popular apps such as WhatsApp are no longer supported.\nWhat is the best phone overall with microSD support ideally on the market to own assuming infinite budget?", "created": 1506087571.0, "replies": [{"text": "Audi S3 with hotspot.  \nJokes.  \nThe Samsung S8+ ", "created": 1506146542.0, "replies": []}]}, "715c0x": {"title": "Google Pixel vs iPhone SE", "text": "**Country** - United States of America     \n**Carrier** - Verizon   \n**Price Range** - N/A  \n  **Valued Traits** - Its functionality as a note-writing/communications/scheduling tool. I rarely consume content on my phone (too many other pretty devices to use for that) and use it almost entirely for these three tasks, as well as retrieving small bits of information quickly (like what the weather is or which corner the Pizza Shop is on.)     \n**Notes** Long term Android user, most recently on a Google Pixel which started to experience connectivity issues with the charging port. I had always found the 5.0 inch format too big for my tastes, but stuck with it mostly because there were no desirable smaller phones on the market when I was buying one. So I took the opportunity to pick up a 32GB iPhone SE from the Apple Store, which I have 14 days to decide on. I will likely get my Pixel replaced either way but I am trying to decide which to keep. It is a storage downgrade, as the Pixel was 128GB, but then I only had 29GB used when I backed it up last night. Thus far I utterly adore the hardware and design of the SE (I never had a 5s so this is my first extended brush with the design) right down to the hard mute switch. In particular I find the size of the phone much preferable to the hand-cramping and pocket-stretching Pixel. (I do not know what people with a Pixel XL do...) iOS is more a of a mixed bag. It is sleek, and mostly well designed, but leaves me with a dozen itches to customize and alter and tinker. I am not super fond of the default messengering app, and SMS' cannot be routed through another app without convincing the user on the other end to switch to a messenger app themselves. All sorts of things that resist alteration like this irk me about it.  Ultimately, the big question comes down to whether the smaller phone format (which I love) or Android's customizability (which I dearly miss) is more important.", "created": 1505848352.0, "replies": [{"text": "It's up to you to decide iOS vs Android but I think Android is superior.", "created": 1506018848.0, "replies": []}, {"text": "P I X E L. please. for the love of anything, do yourself a favor and keep the android. siri will always be inferior to android and the specs will never be as good as the pixel. ", "created": 1506808583.0, "replies": []}]}, "70u17r": {"title": "Battery life beast with good specs", "text": "Australia:\nUnlocked\n$500-$1000AUD\n\nI'm looking for a phone that has **great battery life** without compromising on specs (aka would like 2017 specs). I've been doing Samsung Galaxy's for a while and I am sick of the terrible battery life. But I don't want an old old phone with a removable battery just so I don't have my phone die on me after a few hours of screen on time. Fast charging is essential too (unless the battery is really that good it will never need it), wireless charging isn't a priority.\n\nI also do use a camera a lot, mainly photos and not video, so that is pretty important to me. I also do like stock-ish Android and customisability of buttons/UI is nice but can live without. Like having lots of storage and good RAM is always nice to avoid slow downs. Don't really care that much about bezel-less display but like a decently big screen. Good signal strength is actually pretty important because I always find searching for a connection (despite living in a big city) is a massive battery drain.\n\nI mainly use my phone for social media, photos, music and videos, messaging people, taking notes (a lot), and some productivity apps.\n\nWhat do people reckon? Thanks!", "created": 1505729259.0, "replies": [{"text": "Sounds like the Sony XZ Premium might be your wheelhouse. It has almost stock Android with a light Sony skin, and super smooth performance. Personally I was not over-impressed with the camera for a flagship, I think it suffers from lack of OIS and struggles with lowlight but it's still a decent snapper and has a super slo-mo 960fps mode. Also, I LOVED the battery life on this phone. With some average browsing, messaging, etc. I could easily get 2 days out of it. ", "created": 1508246451.0, "replies": []}]}, "70r7kh": {"title": "Looking for an Android phone with color accurate screen and camera", "text": "**Country:**   Canada\n\n**Provider:**   Probably Rogers but can go with others, buying unlocked\n\n**Price Range:**   Around $700 CAD, $900 max if worth it\n\n**Your TOP features in a phone are:**   Color accurate screen and good camera (not oversaturrated like Samsung's)\n\n**Anything we should know?:**    Considered many options. Basically Samsung's have the best screen but supersaturated cameras. Other phones like OP5 have good screen but 1080p, and weak camera. iPhone's are the best for color accurate display and camera but my apps are on Android.", "created": 1505692133.0, "replies": []}, "70kwdu": {"title": "Looking to upgrade from HTC m9! G5? HTC 10? Galazy S7? Google Phone? Help!", "text": "Hello! So I've been on my HTC m9 for 2 years now. I'm starting to have issues with it and it's time to upgrade. Looking to spend $150-250. Used on ebay obviously, and for Sprint.\n\nI really haven't kept up with the latest phones in the past 2 years.\n\nI'm looking between the HTC 10, Galaxy s7 (I drop my phone A LOT, I don't think this one would last), Lg G5/6? and some of the google phones like Nexus 5, 5p, and anything else (Google phone?) I'm missing?. I really appreciate the stock android experience, and if I can't get stock, I'll probably root my phone to get stock and get rid of all the crap bloatware.\n\nThese are the phones that I've seen are about the same level on performance. I might be missing some since I haven't stayed up-to-date on all the latest phones.\n\nCan you guys suggest something for me? I'm leaning towards the HTC 10 at the moment, as I can get it for about $170. Only thing I dislike are the sub-par camera, but these HTC's are tough, so I'd have peace of mind knowing I wouldn't break it.\n\nAnything is helpful. Thanks!", "created": 1505613382.0, "replies": [{"text": "hey dude what did you end up buying ? I own HTC m8 and I'm really clumsy as well I abused the hell out of my m8 still working like a beast and I'm looking for upgrade .", "created": 1510979915.0, "replies": [{"text": "I got the HTC 10. I got a like-new one on ebay from a seller for about $180. Hooked up to my carrier (sprint), and I was set. Very simple and easy. \n\nI'm very satisfied with it. The charging is very very fast especially if you have a Qualcomm 3.0 charger.\n\nLet me know if you have any questions! ", "created": 1511014268.0, "replies": []}]}]}, "708jwq": {"title": "Easy, decent battery/cam, useful GPS and preferably up to 100 dollars, what do you suggest?", "text": "I've had an iPod Touch 5 for the past 3 years because it was given to me, not because I wanted one. Now that I finally sold it, in order to find an actual phone where I can use my internet data and finally use GPS and a bunch of apps the iPod didn't support, I would really appreciate your help in this.\n\n\n**Your TOP features in a phone are:**\n\nDecent battery life. I like a good camera, not because I think I'm a photographer or anything, but something around the iPod 5 quality would be nice. GPS is absolutely needed (preferably easy to understand/use), I want to learn how to use it when I need to go somewhere and don't have WiFi. Preferably something that accepts all/most formats, since Apple only accepted mp4 and mp3 songs and it was pretty annoying. I also hate iTunes. It doesn't have to have lots of memory, but a memory card slot sounds ok too. It's also okay if it doesn't have one.\n\n\n**Anything we should know?:**    \n\nMy grandmother has a Microsoft phone and I hate that piece of shit (the phone). I don't know if it's good or bad, but it was probably around a good 170 dollars, and its layout, way of handling, everything about it annoys me. She's had it for a year and I still don't know how to help her when she wants to learn something about it. The last time I've actually had a smartphone was in 2007, so I'm pretty ignorant with this. Mind you I'm not particularly into Apple, especially since I hate their iTunes faggotry, but I liked its simplicity at least. As well as the fact that the iPod fell every single day since September 2014 and it NEVER broke or stopped working at all, only breaking its screen last month in the stupidest way possible (short height fall, screen facing up).\n\nI'm from Portugal, so we use EURO btw. Suggestions?", "created": 1505464204.0, "replies": []}, "707vaz": {"title": "Cheap S7 edge vs expensive S8+", "text": "Looking on the secound hand market. It's about 280 euro for s7 and s8 is about 500 euro.\n\nI have a old Samsung note 4. Don't know if the extra price is worth what the difference. Since the hardware is somewhat similar. ", "created": 1505453048.0, "replies": []}, "701hza": {"title": "Best Android phone for around 200-300€", "text": "My Nexus 5 has just died, what android phone do you recommend me for this price range? I've been looking at phones like the P8 Lite, Honour 6X and Moto G5, but I'm not sure which to get and I'm completely opened for any other suggestions!\n\n", "created": 1505386978.0, "replies": [{"text": "same problem here.\nif you want another android only there is the new xiaomi mi A1, it has the same hardware of the xiaomi redmi note 4 a better camera maybe, but worst battery.", "created": 1505463317.0, "replies": []}]}, "6zvgh3": {"title": "Iphone x or note 8", "text": "Help me pls", "created": 1505318199.0, "replies": [{"text": "iPhone = no viruses.\nNote 8 is prettier. \nIf it matters to you, it'll probably still be cheaper to fix an iPhone than a Note even with the new screens/bezel. ", "created": 1505318382.0, "replies": [{"text": "Im mostly concerned about the cpu factor in which apple crashes note 8", "created": 1505319495.0, "replies": []}]}, {"text": "I'm in the same boat. I have an iphone 6+ and am looking to upgrade. \nThe lack of a headphone jack really annoys me though. I don't mind not having touch id since it barely works for me (sweaty hands). ", "created": 1505416201.0, "replies": []}, {"text": "Are you thinking of purchasing a phone that will last you for +2 years ??? If so, I would go for the Note 8. It can be rooted and modified to last significantly longer than the iPhone. We still aren't quite sure how reliable the iPhone X face recognition system will be with sweat, makeup, dirt, sunlight, rain, etc. ", "created": 1505954253.0, "replies": []}, {"text": "Honestly it should be the Pixel 2 vs iPhone 8", "created": 1506018739.0, "replies": []}, {"text": "Note 8. Better at pretty much everything.", "created": 1506048347.0, "replies": []}]}, "6ycm3x": {"title": "Upgrading to an APTx phone!", "text": "**Country:**   France\n   \n**Price Range:**   250-350€/$, \n\n**Your TOP features in a phone are:**   Sound quality (APTx for bluetooth), camera and sd slot\n\n**Anything we should know?:**    i like simple designs but it's not that important.\n\nThanks :)\n\n", "created": 1504662634.0, "replies": []}, "6y5hnj": {"title": "Need to replace my Nexus 6P, looking for suggestions.", "text": "**Country:**  \nUSA\n \n**Provider:**   \nAT&amp;T\n\n**Price Range:**   \nWould spend up to a grand if need be, like to buy my phones at face value right away.\n\n**Your TOP features in a phone are:**  \nCamera, battery life, overall functionality of it needs to just allow for ease of life really.\n \n**Anything we should know?:**    \nLooking really between the Note 8 or waiting until the LG V30. But I am at the point where my phone cant be off the charger for more then 3 hours before dieing randomly anywhere between 15 - 35% battery remaining. So looking for an Android phone that may be a good replacement. Any help would be great!\n", "created": 1504583433.0, "replies": [{"text": "Pixel 2 in a month. ", "created": 1505255701.0, "replies": []}]}, "6xve91": {"title": "Replacing an old Samsung Galaxy S3 with a budget phone", "text": "**Country:**     Norway\n\n**Price Range:**   ~200 EUR \n\n**Your TOP features in a phone are:**   \n\n* Obviously not too pricey\n* On the smaller side (I have small hands) - less than 5\" hopefully\n* One that'll last for some years\n\n**Anything we should know?:**    \n\nI'm looking to replace my five year old S3. \n\nI just want a simple and easy to use phone. My phone usage is heavily for calling, texting and occasional browsing and the odd times I play a video along with a calendar, alarms and maps.\n\nHeavier things like gaming are things I do on my handhelds/desktop, so I won't need a good gaming phone.\n\nOf the \"newer\" stuff that my S3 didn't have - I'd like VoLTE (not sure if it's yet an obvious standard?) and maybe a fingerprint reader although that isn't a must. Not fussed about NFC.\n\nAlso looking into getting a new provider, but currently the deals (phone + carrier and the like) I've seen here aren't ones I'd like all too much.\n\nI've been looking at the Moto G5 and the Honor 8 Lite as they're smaller phones and cheaper (latter is currently on sale here with 20% off; making it the same price as the G5).", "created": 1504468842.0, "replies": [{"text": "The iphone 5s is a great phone for your needs. It supports VoLTE, it has a fingerprint scanner, NFC, no lags, great os for simple tasks, no viruses, and its 4,5''. I'm pretty sure, you can find a new one on ebay for under 200€. If you find the iPhone SE for 200€, that would be a great deal. If you can't find them cheap, you can also check:\n\n* Lenovo ZUK Z1 mini\n* Samsung Galaxy A3 (2017) \n\nAll the phones, are great, but if I were you, I would go with the iPhone.", "created": 1505140326.0, "replies": [{"text": "The thing is, Apple is known for making their old phones annoying by making the updates almost compulsory and, at the same time, making those updates slow down old devices like the 5s. \n\n\nI feel like for that price and characteristics you could buy a BQ or a cheap Huawei. \n\n\nEDIT: Also, I live in Spain so I don't know what's it like in Norway, but I would advice everyone not to get their phones through their carrier. They deals they give you are usually bad if you do the math for the long run, and if the company is prone to shady business they may take advantage of your compromise to stay in the company for X months and try to inflate the bills or make up reasons to charge you extra.", "created": 1505323021.0, "replies": [{"text": "Thank you for the reply, not sure if I'd easily go for iPhones anyways (the odd charging system and iMessage or what it is sound weird to me)\n\nI added the bit about the provider at the end as I felt bad about not filling out a 'what provider' part of the form. Generally I don't find them to be, as you said, good deals\n\nHowever, this thread didn't show up on the subreddit for a long while; I mostly forgot about it and so went with the aforementioned G5, SIM-free", "created": 1507023249.0, "replies": []}]}]}]}, "6xubdu": {"title": "my dream phone • r/PickAnAndroidForMe", "text": "https://www.reddit.com/r/PickAnAndroidForMe/comments/6xu3sh/my_dream_phone/", "created": 1504458124.0, "replies": []}, "6xdyo8": {"title": "Need new Phone (with LineageOS) to replace my (very) old Samsung S3", "text": "**Country:** Germany      \n**Provider:** currently 1&amp;1, but I also thinking about a new Provider, so a recommendation mobile (phone) + contract is fine. (I don't know what to pick)\n**Price Range:** Without contract: **300-400 EUR** (or even 500 EUR if it is really good), other wise 20-40 EUR a Month contract is fine, too   \n\n\nCurrent Phone: [Samsung Galaxy S III i9300](https://en.wikipedia.org/wiki/Samsung_Galaxy_S_III)\n\n\n**Your TOP features in a phone are:**   \n\n - **plays nice with LineageOS**\n - Mostly Messaging stuff with Telegram, Discord, ... or E-Mail stuff  (no WhatsApp or Facebook needed)\n - Browse stuff, Twitter, Reddit\n - a bit Management: TODOs, Notes, Calender, ... (I don't need an office)\n - Multimedia: Netflix, YouTube, Amazon(Music)\n - Bluetooth (duh)\n - Navigation, Maps\n - Security: 2FA, Passwordmanagment, Privacy\n - No Gaming needed\n\n\n - Display: 1080p is fine\n - Not sure about (Display) Size, maybe 4.5 - 5-inch\n - I don't always make Photos but a better Cam would be nice (12 MP?)\n - RAM: &gt; 2GB (?)\n - Battery Life: don't really care, I use powerbanks\n - Storage: I think 64 GB is fine, I use the storage mostly for Music (not really for Pictures)\n - External storage: Not sure maybe if I want to use Offline-Netflix (128+ GB (?)) \n - fits in front jeans pocket\n - Volume-Buttons\n - Nice to have: Color Black (or I just use a nice Case)\n - Nice to have: \"NEW\" Fancy sh*t like Fingerprint\n\n\n**Anything we should know?:**    \n\nCurrently I think my old Phone is dying, I don't know if this is a software problem or just (old) broken Hardware (RAM, internal Storage, WiFi, ...).  \nI'm running LineageOS 14.1 with Android 7.1.2, RAM usage is 82 % (this is fine, IMO use all the RAM you can).\nNot sure if SD-Slot is working, my old SD-Card got broke.\n\n\nI mostly use WiFi, if my Display gets off my WiFi gets disabled, if its gets on it's get enabled.\nSo the Problem is my Phone gets freeze if the WiFi gets enabled, something like \"Ohh I have Internet lets just pull the Messages, Notifications, Updates and stuff, ...\". Sometimes it can handle it (after a few secs. and a minute) OR its just restart.\nSometimes it just restart random or takes forever to starts the keyboard, inputlag, too.\n(I think it has some major I/O issues maybe the internal storage are a bit broken/blocking, WiFi is blocking (?), ...)\n\n\nAlso my headphone jack is broken, so I use Bluetooth Headphones, IMO I don't need an headphone jack but it's nice to have the option.\n\n\n\nI also thinking about an Note-ish Smartphone with Pen, for drawing and scribbling stuff.\nBut I don't know if 6-8+ inch is to much.\n\nI think everything is better then my current S3 :(", "created": 1504265868.0, "replies": [{"text": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/pickanandroidforme] [Need new Phone (with LineageOS) to replace my (very) old Samsung S3 (xpost \\/r\\/PickMeAPhone)](https://np.reddit.com/r/PickAnAndroidForMe/comments/6xpil1/need_new_phone_with_lineageos_to_replace_my_very/)\n\n[](#footer)*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*\n\n[](#bot)", "created": 1504392362.0, "replies": []}, {"text": "Most phones with a high capacity storage don't have expandable storage. I think it's best to get the 128GB Pixel when the Pixel 2 comes out as it will be discounted. As with most phones, it has no SD slot, but 128GB should do you fine.", "created": 1504422038.0, "replies": []}]}, "6xdhy9": {"title": "Complete phone newbie looking to upgrade the phone with some specifications", "text": "**Country:**   UK\n\n**Provider:**   Giffgaff\n\n**Price Range:**   Will even buy the S8?\n\n**Your TOP features in a phone are:**   \n\nAlright so I really want to get into the social media thing, instagram snapchat and will also go on vacations to paradise destinations so I really need a very good camera.\n\nAs for size, I'd rather have a bigger phone than a smaller one\n\nBattery life is a needed thing, I currently need to charge my huawei phone every day which is annoying. I heard the s7 is terrible with this\n\nSomething that could run PSP emulator would be a very nice thing to run games during down times.\n\nI really have a preference towards androids so I wouldn't like an iphone\n\n**Anything we should know?:**    \n\nObviously I would like a nice value per money spent, I really think the s8 is overpriced but I  wouldn't shy away from maybe buying it on discount on black friday\n", "created": 1504258961.0, "replies": []}, "6wuhnj": {"title": "Need a new phone for Cricket Wireless ASAP - $200 - $250 budget", "text": "**Country: USA\n\n**Provider: Cricket\n\n**Price Range: $250 Max\n\n**Your TOP features in a phone are: Reliability, GPS, Speed, Multitasking\n\n**Anything we should know?: General purpose phone for work.  Most used features will be Maps/Navigation, Phone Calls, E-mails, Tethering to iPad/tablets \n\n ", "created": 1504042809.0, "replies": [{"text": "ZTE Axon 7 Mini ($200 New anywhere)\n\nMoto G5 Plus ($230 New anywhere)\n\n\nPushing budget but nice...\n\nSony XA1 ($300 new anywhere)\n\nFavorite one is the Axon 7 Mini. Has a full metal body, great screen, and camera.\n\nOnly down side is it takes like 3 minutes to power on.", "created": 1504050088.0, "replies": []}]}, "6wp0p1": {"title": "Need a replacement for my Asus Zenphone 2", "text": "My asus zenfone 2 has been acting up lately, random shutdowns, without any warning at pretty much any battery level including charging with the original charger. It's gotten beyond any sort of minor annoyance into some major issues.\n\nBrazil - May be US when GF goes to NY in a month or so, but has to work down under.\n\nPreferably under US$ 400 \n\nTop features would no doubt be battery life, then signal strength, then wifi. But some requirements are dual SIM (non negotiable since I can only get affordable internet via a dedicated tablet/ notebook  SIM, and phone calls, texts through another line), Dedicated MicroSD card (or storage over 64Gb, preferably 128 Gb), Minimum resolution of 1920x1080, minimum camera on video fullHD, Minimum front camera Full HD pictures, Minimum overall rear camera of 8MP. \n\nWould like water resistance, and/or removeable batteries .\n\nPhone to operate in Brasil. GF May or may not get it in NY upon her next trip.\n\n", "created": 1503981967.0, "replies": []}, "6wld57": {"title": "Need new phone - Must be sold at Bestbuy", "text": "**Country: USA**   \n**Provider: T-Mobile**   \n**Price Range: &lt;$600**   \n**Your TOP features in a phone are: Longevity: something that I can continue to use for the next 3 to 4 years, OS/Security updates, clean UI**   \n**Anything we should know?: Nexus user since Nexus 4. I like the prompt OS/Security udpates, and the UI. I don't like the idea of paying $800+ for a phone. The phone will be mostly used for web browsing, text messaging and watching videos. Something that can take decent low-light photos would be a plus. I've looked at the Galaxy S8, but I'm not liking the screen edges. Must be sold at Best Buy because I have gift cards.**    \n\n", "created": 1503945160.0, "replies": []}, "6w4gdt": {"title": "LG V20 or LG G6 (asian)", "text": "help pls?. both with quad dac hi fi. lg v20 is 118usd cheaper. its bigger dual screen but less camera res I think. uhmmmm ", "created": 1503735179.0, "replies": []}, "6vxqqr": {"title": "Need a 5-5.2\" android phone with dual sim.", "text": "Norway\nMax 600 USD\ngood storage space, good performance\n\nI was thinking of Huawei P10, it fits me perfectly, but is it not a good buy at this moment in time?\n\n", "created": 1503659143.0, "replies": []}, "6vizh4": {"title": "Waterproof phone with good front camera under $600", "text": "**Country:** Philippines\n\n**Provider:**  I usually get openline phones so I'd prefer not getting stuck with a single provider. \n\n**Price Range:**   $550 and below (openline)\n\n**Your TOP features in a phone are:**   I would prefer the phone to have the following specs:\n\n* Good selfie camera with wide angle capabilities. This phone will be used mostly to take group photos. I already have a mirrorless camera with a flashair card (to transfer photos to my phone for instagramming and whatnot), so I will seldom use the phone's rear camera, except for those cases where my mirrorless runs out of battery, so it would be nice if the rear camera is decent as well. \n\n* Waterproof. There are just too many times where I get my phone wet since we live in a tropical country and when it rains, it REALLY POURS and I usually end up drenched (along with all gadgets on my body). There are also many other instances where the phone will get wet, so I just want to play it safe. I don't like using thick cases as I like putting the phone in my pocket (I'm a female, and as you know our pockets are tiny :)) ) so I prefer the waterproof capabilities to be built-in like my old Xperia. \n\n* Wireless charging\n\n* Expandable memory or at least 64GB if it's not expandable\n\n**Anything we should know?:**    \nI'm coming from an Xperia Z1, so anything at this point is pretty much an upgrade already, but I would prefer it to still be a significant upgrade to warrant the price I'm willing to spend for it. So far, I think the LG G6 is my most viable option, but I tried it out in person the front camera isn't as nice as I hoped it would be.  If you guys could suggest any other phones with the criteria listed above, that would be great! If there's a phone coming out that will have the criteria listed, I can also wait for it! Thanks a lot!!! \n\n", "created": 1503495266.0, "replies": [{"text": "Best buy and Amazon (us) should have the unlocked galaxy s8 for $575 ", "created": 1503538721.0, "replies": []}]}, "6v51cm": {"title": "Looking for a good looking phone.", "text": "I'm in the US on MetroPCS and have a budget of $400, but would prefer something cheaper. \n\nI'm not a power-user by any metric, but I do play a lot of phone games, so a strong battery life or quick charge feature would be nice. I'm coming from a Oneplus X (which I think is a beautiful phone) and I'm a sucker for aesthetics. Also a big fan of smaller phone manufacturers (considered a Nexbit Robin, but I've read somethings.)\n", "created": 1503341122.0, "replies": []}, "6uymod": {"title": "$220 or less phone", "text": "**United States**   \n**Metro PCS**   \n**$220 or less**   \nI need it to have these things.\n\n-About $200  \n-Fingerprint sensor  \n-At least 64Gb of storage  \n-At least 3Gb of RAM  \n-1080p screen  \n-Large battery  \n-USB type C port  \n-4 core snapdragon CPU or better  \n**Other thoughts**  \nI don't really care about the camera  \n\n", "created": 1503266455.0, "replies": [{"text": "Check out:\n\n* Oneplus 2\n* Nexus 6P\n* Mate 9\n* Xiaomi mi 5\n* Lenovo Zuk Z1\n* Leeco le max 2", "created": 1505139803.0, "replies": []}]}, "6u6bzp": {"title": "$250 budget. Android. Verizon prepaid", "text": "Just looking for an all around decent Android phone for about $250. I have a very old moto g ive been using for 3 years and with all the recent updates i am unable to even successfully use Google Maps for GPS when I'm working so I have no real choice but to upgrade.\n\nI'm looking for (in order of priority):\n* Battery life\n* Overall speed of phone (able to run multiples apps at once)\n* Clean and bright display\n* Light notification on the front\n\nThanks for the help in searching for my next phone!!", "created": 1502929289.0, "replies": [{"text": "You could get a galaxy s6 for less than that if you'd like me to send you a kind to my store. ", "created": 1503166744.0, "replies": []}]}, "6u0hd8": {"title": "New phone for our vacay!", "text": "Hi! My fiancee wants a new phone to replace a Nexus 5. She's looking for something affordable, that can take good pictures of our honeymoon, and has good battery life so it doesn't die while we're on our honeymoon. She  does regular stuff on her phone, plays burger bash cafe or something and Google maps.\n\nWe're considering the Nexus 5x as she's had Good experiences with her Nexus 4 and 5. But we're curious if there might be other good options. She was also considering an iPhone 6s, or an appropriate LG in the same price range, as they're supposed to have great cameras right? \n\nAny help appreciated! Thanks!", "created": 1502868731.0, "replies": [{"text": "Don't get the 5X due to the bootloop problem. If change phones every year, then it might be good. You can also take a look the new Nokia phones. The 5 or 6 are the good ones.", "created": 1502990184.0, "replies": []}]}, "6twwdl": {"title": "Is Super AMOLED alright for light use for years?", "text": "I want to buy Lenono P2 mostly due to the beast battery\nhttp://www.gsmarena.com/lenovo_p2-8319.php\n\nBUT it has Super AMOLED display and from what I read that tech has a burn-in issue and also color degradation when one color (blue first) goes out and it affects the overall picture quality.\n\nI read posts about people having a burn-in on top and bottom of a device after weeks even.\n\nNothing about this particular device but that is because it is relatively new (end of 2016).\n\nNow, I usually have brightness at around 20 to 40 per cent and dont play games much. I also dont leave the screen on for too long or at least not on the same screen.\n\nAlso as with any tech, it is getting better over the years and AMOLEDs have been around for a while so maybe it is better now?\n\nWould I be able to have at least three years without these issues? What is an average life span of Super AMOLED?\n\nThanks.", "created": 1502828657.0, "replies": [{"text": "Yes. Of course. But it depends on the brand and how they make use of it. For example, you can see color degradation on Samsung S line because they over-use the display to get more brightness and higher contrast. But other brands don't do that. I had a Nexus one and my father a HTC Desire and used them for 4 years without any problem even though they had first gen AMOLED. And my Nexus 6P's display is without any problem. ", "created": 1502990623.0, "replies": []}, {"text": "Install \"Navbar apps\" What it does is,It changes the top &amp; bottom bar's Colour from app to app.\n\nBy default if you've not installed Navbar apps both stay Black always &amp; this is a recepie for slow pixel fatigue &amp; screen burn after many weeks.Every Amoled panel has burn in if any image stays Constant like what the top &amp; bottom bar has.\n\nThe app doesn't even show up in the battery gaps.", "created": 1503152520.0, "replies": []}, {"text": "Also don't worry about screen brightness.Use as much you need.", "created": 1503152607.0, "replies": []}]}, "6tv8i2": {"title": "The age old conundrum: iPhone or Samsung? (Long Description inside)", "text": "My upgrade will be in a couple months on VZW, and with it looming I have an issue about which os phone to choose. I currently have a Galaxy S6 and have been an Android user/ modder since my Galaxy Nexus, but my S6 is good and bad for these reasons:\nPROS\nAMOLED screen with no burn-in\nManageable size\nPowerful for its age\nGood speaker \n\nCONS\nnot water resistant\nNo expandable storage\nSmall battery\nFragile glass\nTouchWiz\nCarrier bloat\n\nCurrently my battery is weakening, the headphone jack is broken and Bluetooth doesn't play further than a couple feet from the speaker.  \n  My daily routine is watching YouTube and Netflix on device for a half hour in the morning, casting video to tv for an hour, general redditing, gaming, listening to podcasts on device and through BT throughout the day.\n  My choices have boiled down to the inevitable \"Galaxy s8 vs iPhone 7+\" and I have a list of pros and cons for each.  I'm basically looking for anecdotal info on my list and wisdom from switchers from either side to the other.  \n\nIN THIS CORNER, WEIGHING IN AT 5.36oz, the Galaxy s8\nPROS\nbattery life\nQuick charge\nFamiliarity with Android ecosystem\nGpu &amp; multicore cpu power\nManageble size\nAMOLED screen\nExpandable storage\nNotification led \nFreedom of system (download a Gameboy emulator, install APKs)\n\nCONS\nInfinity edge distortion(?)\nUfs 2.0 storage (chip lottery)\nStretched screen (niche market)\nSlow system updates\n\nAND IN THIS CORNER, WEIGHING IN AT 6.63oz, the iPhone 7 plus\nPros\nExcellent memory management\nFast NVME storage\nBright color accurate display\nTimely updates straight from Apple, long support life\nApple store everywhere \nOptimization of apps and  gen stability\n\"Stereo\" speakers\nNo carrier bloat\n\nCONS\nhuge size compared to other 5.5\" phones\nWeak battery life(?)\nMore expensive\nSystem freedom limitations\n\nI'm hoping by Black Friday that there will be deals to help my decision but right now I can get $100-$200 off a galaxy s8 if I trade in my Galaxy s6\nMy alternative choices besides these are\nGoogle Pixel 2\nLG G6\nLG V30\n\nAs I type this at noon, my phone is at 40% battery under normal useage that I described above, I don't remember is this is good or not, off charge at 4:30am.\n\nThank you to anyone who has read this far and any insight into these choices is greatly appreciated!", "created": 1502814423.0, "replies": []}, "6tjijw": {"title": "Oneplus 5 discount referral code", "text": "Hey if anyone is looking at the great Oneplus 5 then use this referral code to get $20 off any accessory. That would get you a phone case!\nhttps://oneplus.net/invite#EE6RPNALWWV87PT\n\n", "created": 1502677239.0, "replies": []}, "6tdpxj": {"title": "Samsung Galaxy A5 Duos user looking for something smaller", "text": "**Country:US and Europe   \n**Price Range: any price   \n**Your TOP features in a phone are: I like the specs on the A5, but am looking for something a bit smaller. I can't get used to the screen size even after a year of use. I'm willing to sacrifice some bells and whistles for a better size. A slot for an SD card or other memory upgrade is a huge plus. \n\n", "created": 1502606707.0, "replies": []}, "6t6r5s": {"title": "Stolen NEXUS 5", "text": "Last night, my 4 year old Nexus got stolen while I was asleep in the bus. I loved the phone, I had Android 7.1.2 on it with Resurrection Remix, Substratum turned everything into pitch black theme.. Three months ago I changed the jack socket, the micro usb socket, the battery and I recently bought a 60$ leather bookcase for it. It was perfect, I pesonalized the shit out of it. Had my website logo as a navigation button in the bottom, the carrier name was my website name, everything was working smoothly just like in day one. I don't want another phone, but I realized some of the features of Nexus 5 are outdated if I were to buy another one. I hate today's phones with their 2 year lifespan and low support. I bought my Nexus with android 4.4 and I dragged it until 7.1. You can't just do that with today's money pits. Thank you, to whoever wishes to help me in this awful times.", "created": 1502515790.0, "replies": [{"text": "Is waiting for Pixel 2 a viable option? It's really expensive and I don't need water protection. Only a good camera, nice screen for reading, and that's about it.", "created": 1502528438.0, "replies": [{"text": "If the Pixel 2 is expansive for you, wait for Pixel 1 to get cheap. That's how I got my Nexus 6P", "created": 1502990866.0, "replies": []}]}, {"text": "bump. please, can someone take the time to share their opinion?", "created": 1502528486.0, "replies": []}, {"text": "I have been using Nexus phone since 'One', and I get you. I suggest a pixel as it's the best option.", "created": 1502990768.0, "replies": []}]}, "6spcuv": {"title": "I'm looking for a good phone for taking pictures and listening to music.", "text": "Country: USA  \n\n\nProvider: Metro PCS, although I don't have any problem with changing providers. ATM my monthly bill is 50 bucks so if anyone else can beat that and provide a better phone then I'm all for it.\n\n  \nPrice Range: $100-$300 any more than that and it'd feel like highway robbery.   \n\n\nYour TOP features in a phone are: The main things I'm looking for is to be able to have enough memory to be able to put a lot of music on it. If the battery and memory card is exchangeable that's also a plus. Same thing with the camera, if it's good that's a bonus but that's all I'm really looking for. \n  \n\nAnything we should know?: I don't play phone games and I never will. All I'm going to need from this phone is the ability to play music. My current phone is an \"LGMS323\" it's got like 3 gigs of memory and any external memory card above like 16 is incompatible. I bought a new memory card to put in but you can't freely access it without downloading an app and can't have things automatically be saved to it, you have to transfer everything manually making it completely useless unless I do everything from my computer. Also the camera is crap. I've never cared about phones before this point. Growing up people were always running around with the next new $700+ phone every 3 weeks, using Snaper and Digimon Battle and all that. Then you've got me, had a flip phone / brick phone for the majority of my life and has this LGMS323 for who knows how long. It was too weak and out of date to do any of these fancy phone apps so I missed the boat on all that. All I want to be able to do is put a bunch of music on it so that I can just strap it to my arm when I go for runs and other exercises. If the camera is good then I can take some nice scenic shots.  \n\nI don't need any of these pointless bells and whistles that seem to be standard now a days like \"finger print recognition\" and \"heart rate sensors\" or any of that. A simple number lock is good enough for me and I don't need to know what my heart rate is, I can do it manually if I need to know. \n\nI never text but I like to have the option to with unlimited texting. That also goes for minutes. I don't know what's been going on with phones locking people out of the internet for being on the internet too long, I haven't had that happen to me for a few years but I've heard that's still going on regularly.\n\n**TL;DR** If I could just build my own phone with unlimited call/text with a nice camera and at least 35GB built in with an exchangeable battery and room for easy access memory cards so I can buy more memory should the need arise then that'd be great. I'd want it to fit in my pocket so it wouldn't have to be huge. It would be a touch screen as well just because that's the times we live in. That's pretty much everything.      ", "created": 1502320749.0, "replies": [{"text": "Sony Z5 is the way to go. Everything is right with that phone and it's also really durable.", "created": 1502462810.0, "replies": []}]}, "6skrbk": {"title": "I need help picking a phone for my dad", "text": "**Country:**   Australia\n\n**Provider:**   Telstra\n\n**Price Range:**   $900\n\n**Your TOP features in a phone are:**   Camera, ease of use, fluidity, Deep customisation, easy to work with the Microsoft ecosystem\n\n**Anything we should know?:**    This phone is for my father, who is a Windows Phone lover, but accepts that its a dying platform. He uses Microsoft Services heavily and strongly dislikes both Android and iOS, even though he has never owned one. \n\n", "created": 1502276945.0, "replies": [{"text": "&gt;He uses Microsoft Services heavily and strongly dislikes both Android and iOS, even though he has never owned one.  \n\nCan't dislike something he's never tried. I'd wait for the Google Pixel 2 honestly. Android devices work better with google/microsoft services usually.", "created": 1502293940.0, "replies": []}]}, "6rvd7n": {"title": "Best Verizon phone for field/work phone preferably under $600", "text": "**Country:**   USA\n**Provider:**   VERIZON\n**Price Range:**   &lt;$600\n**Your TOP features in a phone are:**   Replaceable/extended battery, removable Micro SD\n**Anything we should know?:**    \n\n", "created": 1501979513.0, "replies": [{"text": "A LG V20? ", "created": 1502303604.0, "replies": []}]}, "6rs9d0": {"title": "Need a phone with awesome battery and camera", "text": "Currently running a v20, cant get a full day out of it even with an extended battery.\nNeed a phone with a great battery, quick charge and a great camera for taking videos on the range.\nSize doesn't matter, if Apple is better that's fine too.\nThanks", "created": 1501945949.0, "replies": [{"text": "[ZTE nubia z17](http://www.gsmarena.com/zte_nubia_z17-8677.php#)\n\nThis is the perfect phone for you then. If you don't like that go with this-\n\n[Huawei p10 or p10 plus](http://www.gsmarena.com/huawei_p10_plus-8515.php)\n\n", "created": 1501993695.0, "replies": [{"text": "Are these Verizon compatible?", "created": 1502022734.0, "replies": []}]}]}, "6rhzaw": {"title": "Shipping off to the army soon and need help looking for a phone", "text": "**Country:**   Usa\n**Provider:**   unlocked\n**Price Range:**   200-670\n**Your TOP features in a phone are:**   5.5\"-6\" screen,sim card,4+gb ram,64-128gb storage,works overseas\n**Anything we should know?:**    \nSo I'm going in to basics soon and STRAIGHT out of basics to active duty so i won't be able to buy a phone in between. I was told there is a high likely hood of me being stationed overseas. I could use a smartphone the can use both a usa/\"other country\" sim. \n\n    I know you must be asking, Why are you looking for such a big phone ?, (I know your not asking I just wanted to put why XD) Well to tell you the truth i have long fingers and the usual 5 inch TOUCH screens are a living nightmare that I cant walk up from. \n\n     I did look up some phones before asking here and would love to hear some advice on them. \n\nasus zenfone 3 ultra\nhuawei mate 8,9 pro and porsche edition\nhuawei p10 &amp; p10+\nZTE Nubia Z17\nXiaomi MI MIX", "created": 1501818560.0, "replies": []}, "6r89fu": {"title": "Any ideas for a low cost upgrade over Droid Turbo 2?", "text": "Looking for a US Verizon (Total Wireless) or T Mobile (Metro PCS) compatible phone for my wife who says her Droid Turbo 2 isn't good enough anymore, due to lagging and freezing.\n\nI need to stay below $300, have SD expansion, and be able to take good photos for her work. Her Turbo is on Android 7.0, so I would rather not have an earlier version of Android than that.\n\nI had concluded that the G5 Plus was my best option. After comparing hardware side by side, the G5 doesn't look like an upgrade at all. Am I wrong? \n\nAre there other, better options for an upgrade under $300, or is it not possible in that price range?\n\n\n", "created": 1501716503.0, "replies": []}, "6qxg3x": {"title": "I liked my Note 3, but it died and it's time for a replacement!", "text": "* **Country:**  USA\n* **Provider:**   T-Mobile\n* **Price Range:**  Not concerned about price\n* **Your TOP features in a phone are:** *(in order of preference)*\n 1. Able to fit in my [DJI Osmo](http://store.dji.com/product/osmo-mobile?vid=7221), my Note3 just barely fit - max dimensions for a phone are 61.8 x 48.2 x 161.5 mm\n 1. Note taking ability (stylus or finger I suppose) - I really like Samsung's S-Note\n 1. Expandable Memory\n 1. Removable/replaceable battery\n* **Anything we should know?:**  I really enjoy being able to take Notes on my Note 3.  It's not something I use often, but it's something that, when I need it, it's there, and S-Note will sync with my Galaxy Note 10.1 which is nice.  I've come to depend on it in a pinch but at the same time, I suppose, I could use OneNote for this and just my finger, but a stylus is much more elegant and accurate.  The obvious answer is wait a couple weeks for the Note 8 to come out, but I'm not sure it will fit in my DJI Osmo, and I really like the DJI so whatever I choose needs to fit.\n\n", "created": 1501605585.0, "replies": []}, "6pmsia": {"title": "Replacement for nexus 5x", "text": "**Country:**   NZ\n**Provider:**   Vodafone\n**Price Range:** NZD  $499-550\n**Your TOP features in a phone are:**   Camera, Usability Smallish form factor\n**Anything we should know?:**    Hi so my Nexus 5x recently boot looped and the store I bought it from is offering to replace with a phone of the same price.\n\nOptions are Samsung Galaxy A3 2017, Sony Xperia XA1 and iPhone S.e\n\nWas wondering which one was the best, and if there are any key features that about the nexus 5x that I'll miss if I buy one of the 3. \n\nE.g Xperia XA1, no fingerprint reader\n", "created": 1501059294.0, "replies": [{"text": "I'm in the same spot as you, mine started to bootloop today and I'm looking for a replacement.", "created": 1501694661.0, "replies": []}]}, "6pes66": {"title": "Need an unlocked phone.", "text": "United States   \nMetro PCS   \n$150-$250   \nGood battery, good ram   \n  \n\n", "created": 1500970276.0, "replies": []}, "6owc10": {"title": "I'm trying to find a mildly innovative phone.", "text": "**Country:** Sweden\n\n**Provider:** Unlocked \n\n**Price Range:**  Anywhere in between 200-650 USD\n\n**Your TOP features in a phone are:** I want them to have some innovation involved. I really liked the Xperia play when I was younger. Nowadays I'd prefer a more discrete phone with some innovative features I can really see that a Windows or Google phone would be something that I'd like, but I'm no phone connoisseur and does not know if they are worth the price tag.\n\n**Anything we should know?:** I have no issue with tall and wide phones, they're pretty nice to watch Netflix or browse Reddit with. If possible I'd like the phone to look a bit more original than the phones that all look like iPhones.\n\nThanks a lot in advance.", "created": 1500745741.0, "replies": [{"text": "What kind of innovative features do you want?  \n\n\n\nhttp://www.techradar.com/reviews/phones/mobile-phones/lg-g5-1315187/review. \nYou can get one of these for $280 and the mods can be had rather cheaply do to the initial failure of sales.\n\n\n\n\nThis one has a second screen and can be had for between $350 and $500.\n\n\nhttps://www.cnet.com/products/lg-v20/review/\n\n\n\n\nYou can wait. They are coming out with a Q8 which is a smaller version of the V20 \n\n\n\nThe Meizu Pro 7 is going to have a second screen on the back.  \nhttp://m.gsmarena.com/meizu_pro_7_appears_on_tenaa_with_10nm_helio_x30_chipset-news-26305.php\n\n\nYou can get one for less than  $600.  It's the first phone on 10 core Hello X30 chip. \n\n\n\n\nThe New Nokias (other than the 2 or 3) are made out of a single block of aluminum and are supposed to get regular updates from Android.  The 8 looks really cool. \n\nhttps://www.forbes.com/forbes/welcome/?toURL=https://www.forbes.com/sites/ewanspence/2017/07/21/android-news-headlines-samsung-galaxy-note8-nokia8-oneplus5-microsoft-bixby/&amp;refURL=android-app://com.google.android.googlequicksearchbox&amp;referrer=android-app://com.google.android.googlequicksearchbox\n\n\n\n\n\n\nThe new Motos are pretty cool. I want a G5S Plus or the X4. Here's the Moto z play.  It has all kinds of mods you can add- JBL speakers, better camera, extra battery, a projector. They are pricy but the phone isn't.  You can always buy mods as you go along.  They should get updates for Android quickly since Google sold them to Lenovo. \n\n\n\n\n\n\n\nhttps://www.motorola.com/us/moto-mods?gclid=Cj0KCQjw78vLBRCZARIsACr4cxxVgduWT5Qkg2k4PrFbT4qTyGVirqfpNls2FSPjtuylMEQFIygRjlMaAj4NEALw_wcB&amp;dclid=CJG76bLVntUCFdAIDAodniQH_g\n\n\nIf you give us a list of features, we can give you more ideas.\n", "created": 1500787793.0, "replies": [{"text": "Incredible answer! The Motos looks pretty nice with their customisation abilities. \n\nI don't really have anything specific that I really need but I think some cool marketing gimmick like a projector would be something that I'd be very interested in. \n\nI actually think you captured what I need. Thanks a lot pal!", "created": 1500807778.0, "replies": [{"text": "The Moto Z play is fairly inexpensive but as I said, the mods can cost a little more.  ", "created": 1500822576.0, "replies": []}]}]}]}, "6opco2": {"title": "looking for a durable dumb/feature phone compatible with tracfone", "text": "My tracfone broke, and i need a replacement phone i can use the same sim card with\n\n**Country: us**   \n**Provider: tracfone**   \n**Price Range: 0-30$**   \n**Your TOP features in a phone are: ruggedness, full keyboard that folds/slides out**   \n**Anything we should know?: im mostly talking about phones from the \"golden age\" of feature phones. Most of them dont go for much and are still pretty great, but now that they're so old, theyre a bit hard to find. amazon has a few though** \n\nThanks!   \n\n", "created": 1500657441.0, "replies": []}, "6ne29q": {"title": "Thoughts on the Huawei p9 lite 2017", "text": "I am currently looking for a phone on a 300USD budget and stumbled upon this Huawei on a local store wich seemed pretty decent for the price. But is it actually that decent? Should I rather look for something else? That's why I need reddit to help me out\n\n**Country:**   Portugal\n\n**Price Range:**   300 USD\n\n**Your TOP features in a phone are:**   Camera (rear, I don't have that much use for a selfie camera), Fingerprint sensor, Gaming to some extent.\n\n**Anything we should know?:**    \n\nScreen size: Between 4.7 and 5.2 inches\n\nMust be avaiable in a dark colour\n\nShould be an Android, preferably of a known brand\n\nRegarding gaming, I currently play pokemon go since I enjoy it and it makes me get the minimum of exercise. I would like to be able to play that game without many issues\n\n\n\n**EDIT: Title is wrong, I actually meant the p8 lite 2017, not the p9**", "created": 1500092870.0, "replies": [{"text": "For android I usually suggest Google (Pixel / Nexus), or Motorola. ", "created": 1500326515.0, "replies": []}]}, "6naxzo": {"title": "Best budget 5.4\" AMOLED Phone?", "text": "**Country:USA but I travel to Asia**   \n**Provider:*Project FI*   \n**Price Range:*$250-$350*   \n**Your TOP features in a phone are:*Excellent screen due to partial vision loss. Good battery life. Durability*   \n**Anything we should know?:**\nJust wanting something budgeted since I need to come up with an engagement ring soon.  I'd jump for the Oneplus 5, however, I want to budget it down some.  I have a $230 like new condition Honor 8 coming from Amazon, however, it's no bigger than my Nexus 5x and I'm told the screen is lackluster.  I fatigue easily for reading and strongly prefer clarity along with battery life over everything else.  I've spent an awful while reading and there's just too many options.  Axom 7 and Zenfone 3 zoom come to mind though...\n\n", "created": 1500057223.0, "replies": [{"text": "Perhaps a used Samsung Galaxy S7? ", "created": 1500571734.0, "replies": [{"text": "I seriously considered it because they're waterproof, however, I decided on the OP5, and figured I'll avoid water plus it's more durable drop wise.", "created": 1500573777.0, "replies": []}]}]}, "6mx2m7": {"title": "150 Euros : Good screen and smooth ?", "text": "**Price Range:**  150 Euros\n**TOP features in a phone are:**  Smooth, colorful.\n**Anything we should know?:**  Can be Nougat 7.0 (Through official or unoffcial ROMs), popular enough (so It has a lot of custom ROMs etc)\n\n", "created": 1499894672.0, "replies": []}, "6mq8i0": {"title": "Huawei P10 lite or Moto G5 plus?", "text": "Just asking which one to get, thing is i'm afraid of going back to Moto/Lenovo because of G4 plus's problem with the screen.", "created": 1499817170.0, "replies": [{"text": "Can't be as bad as Huawei's build quality. It's a gamble with Huawei. And for Moto G series, the only decent one was the first gen, it fell apart after Lenovo took over (used Moto G till third gen)", "created": 1500042171.0, "replies": []}]}, "6mq3x5": {"title": "Pick meh a phone pl0x", "text": "**Country:**  Irelund \n**Provider:**   unlocked\n**Price Range:**   500-600 euros\n**Your TOP features in a phone are:**   Hurdur\n**Anything we should know?:**    I looked at oneplus 5 (was always a fan of the phones never got one ) or LG G6 \nFor now Im rocking a Galaxy S5.\n\nEdit: Idk anymore I binged OP5 reviews and Im just in a meltdown I just like everything about it the clean OS, so many customizations n pussibilites, how responsive it is when you tap on a app but then I read reddit and other forums that seem to diss on it and Im just like (੭ ˃̣̣̥ ㅂ˂̣̣̥)੭ु    (ﾉಥ益ಥ）ﾉ﻿ ┻━┻, ┬─┬﻿ ︵ /(.□. \\）\n", "created": 1499815803.0, "replies": [{"text": "I see all the hate too but I ordered it anyways lol", "created": 1499823611.0, "replies": [{"text": "if only I had what it takes, I have the site opened with \"buy now\" and Im like nearly about to press it and than just back out,Idk Im just scared of being dissapointed cause I still think its a great phone at least with its performance and thats what really matters to me THE PERFORMANCE n GAMES , everything else is second seat.\nbut I mean 8gb of ram...just damn...", "created": 1499824188.0, "replies": [{"text": "yeah and I mean others suggested I get the S8, G6 etc. as cost isn't a factor for me but honestly the OP5 looked way too buttery smooth and I was kinda tired of my Galaxy S6 so didn't want another Galaxy device, as well I actually really like the design of the iPhone and didn't mind it looking the same.\n\nI will say though i'm worried about potentially having a defected unit when mine comes in as I've seen all the negative stuff about the customer service, etc. so don't want to get scammed in that sense. In terms of the jelly scrolling and some of the criticism of the camera, don't really care at all for those. but still in the end I pulled the trigger and am confident lol. Ordered mine from Canada and it's expected to come on July 31 which is soo long from now though :(", "created": 1499826826.0, "replies": [{"text": "Yea the jelly scrolling but still its a oke phone just with it performance", "created": 1499864821.0, "replies": []}, {"text": "Just ordered mine Ill get It By Jul 19, I can let ya know what I think about it :3", "created": 1499980993.0, "replies": []}]}]}]}]}, "6m6di2": {"title": "Greetings from Canadia! Replacing my Nexus5x bootloops.", "text": "**Country:**canada\n\n**Provider**: public mobile (4gb for 36$ a month is bae)   \n\n**Price Range**: anything cheaper than a pixel. maybe a pixel if everything else is terrible.\n\n**Your TOP features in a phone are**: snapchat. good camera isnt a priority. \n\n**Anything we should know**?: Hi all. I like listening to myself talk so this part is mostly irrelevant, but here is my tale: \n\nin ninth grade i was given an LG Rumor. I got mugged later this year but the phone was in such bad shape the muggers didn't want it. \n\nFirst year I bought an LG Optimus on a two year contract, and *lost* it in two semesters later.\n\nReplaced it with a Nexus after a while. I somehow managed to *fry* the LCD screen (?) according to the asian men working at chinatown, and they told me it'd be cheaper to buy a new phone.\n\nMy new phone was the one plus one, which i managed to keep for an entire year and a half, before *dropping* it off an eight foot basketball hoop.\n\nWhich brings me to my Nexus5x, which i got on sale from mobilepros1(ebay). The nexus5x currently has a *bootloop* issue, and google/lg are doing repairs IF you have proof of purchase (i dont).\n\nSo yeah. thanks for sticking around. And thanks for the suggestions. And pm me cause i have no friends.\n", "created": 1499587739.0, "replies": [{"text": "The 64GB version of the OP5 is great for you, I guess. I replaced my N5x for the same reasons and I only miss the rear fingerprint scanner (the OP5 is way faster tho) and the HDR+ capabilities of google. I still get somehow great pictures but is much more unreliable. Everything else is an upgrade. I simply can't notice the jelly screen efect, neither anyone I showed my phone)", "created": 1500770642.0, "replies": []}]}, "6m5ul4": {"title": "Stick with Samsung Galaxy S6 or get Iphone 7+", "text": "I game a lot on my phone (Vainglory). I got the option of getting an Iphone 7+  very cheap but I wonder if it's really that much better than the S6? Also considering the change in ecosystems?", "created": 1499578246.0, "replies": []}, "6luhdf": {"title": "Need an AT&amp;T Android phone &lt;$150, care most about no bloatware.", "text": "Hi. AT&amp;T customer. \n\nI'm currently rocking a five year old Android phone from HTC. It's ok but it's pretty much seen it's day. \n\nI'm looking to buy a phone that's a couple years old, spend less than $150 and get good battery life. It's very important that it not come with a bunch of shitty bloatware hogging ip my memory and cluttering up my app screen. The ability to EASILY (not that tech savvy) root said phone is also good I guess. If I can figure it out. \n\nI don't care much about camera quality at all. Don't care about water resistance or curved screen or resolution or anything. Just as long as it works and works well and isn't laggy or slow. Thanks.\n\nI'd like to shop on Amazon if possible for the 5% cash back but I'll look elsewhere if necessary. ", "created": 1499442170.0, "replies": [{"text": "Do you get 5% cash back at Newegg or B&amp;H? You may not be charged sales tax depending on which state you reside in. I would recommend a Moto E4 which is $130. The Moto E4 Plus has a much larger battery but costs $180 which is $30 above your budget (2800 mAh vs 5000 mA). If you don't mind the Amazon Prime ads the Moto E4 will cost you $100 and the E4 Plus should be under $150. ", "created": 1499530707.0, "replies": [{"text": "I can't find the Moto e4 plus anywhere, even Amazon. Link?", "created": 1499546033.0, "replies": [{"text": "The moto e4 plus is not released yet. I think it should soon since the moto e4 already came out", "created": 1499547578.0, "replies": []}]}]}, {"text": "You should check out slickdeal when the Moto E4 Plus comes out. For $6.00 more you can purchase it without Amazon ads. You have to make sure all those items are inside the cart for these deals. \n\n\nhttps://slickdeals.net/f/10327928-16gb-motorola-moto-e4-unlocked-phone-25-simple-mobile-airtime-106-free-shipping?page=6#commentsBox", "created": 1499641518.0, "replies": []}, {"text": "The moto G5 Plus is $180. Will probably be the best value. Do note it comes with Amazon ads and you need amazon prime", "created": 1499759285.0, "replies": [{"text": "Link?", "created": 1499772486.0, "replies": [{"text": "\n&gt; Link?\n\n[Here you go!](https://upload.wikimedia.org/wikipedia/en/3/39/Wakerlink.jpg)\n\n---\n\n^(I am a bot. | )[^Creator](https://www.reddit.com/user/alienpirate5)^( | Unique string: 8188578c91119503)", "created": 1499772488.0, "replies": []}]}]}]}, "6lflkh": {"title": "Best flagship atm?", "text": "Which phone should I get? Is the s8 worth getting after its already been out for a while and new phones will be rolling out?\n", "created": 1499276460.0, "replies": [{"text": "It depends what you are looking for. But the typical flagships are iPhone 8 (releasing soon), Samsung S8, Google Pixel 2 (releasing soon), LG G6, LG V30 (releasing soon), HTC U11, OnePlus 5", "created": 1499279822.0, "replies": []}, {"text": "Best software is going to be Apple or Google (Pixel)", "created": 1500326739.0, "replies": []}]}, "6la8n1": {"title": "Can't decide... Moto E4, E4+, G5+", "text": "**Country:**   USA\n**Provider:**   n/a\n**Price Range:**   $250\n**Your TOP features in a phone are:**   \n**Anything we should know?:**    \n\nI'm trying to decide between three models to replace my phone. I'm aiming for CDMA/GSM phones because I do occasionally cross into Canada and need to be able to use my phone there.   I have a promo credit to use on July 11 (Prime Day) so trying to decide between getting the E4, or G5+ there, or waiting for the E4+   if it's not out by then.  \n\nI don't have a HUGE budget (disabled college student) which is why I was looking at the E4.  I don't game on my phone nor do I take a TON of pics - though to be fair that's partially because my phone is old and starting to fail (it's an LG Volt).  I tend to use my phone until it dies, rather than being the type to upgrade because something newer is out there.  Mainly email/texts, some browsing if I'm out and about; heavy use maybe a few times a year of multi-day excursions where I need to be able to access data/maps/texts etc \n\nAny further thoughts or considerations to help me narrow it down would be helpful!\n", "created": 1499207885.0, "replies": [{"text": "There are rumors that the Moto E4 lineup will be released within this month. \n\n\nthese are the specs i found online. If you don't use your phone heavily a 2800 mAh battery can probably last you an entire day. However, I would be safe and go for at least 3000 mAh which the E4 Plus definitely takes the cake with a 5000 mAh battery. If you are in desperate need of a phone I would just say get the Moto G5/G4 lineup. If you aren't then the Moto E4 will probably be best for you. \n\n\nhttp://gadgets.ndtv.com/motorola-moto-e4-plus-4130-vs-motorola-moto-e4-4110", "created": 1499275605.0, "replies": [{"text": "I looked at the E4 and E4+ and I'm thinking it may be worth it to wait to get the +.  There's a few slight boosts, and my phone isn't totally dead - and supposedly they should be releasing that this month (the e4 is already out). ", "created": 1499276622.0, "replies": [{"text": "Its out only in certain areas (india) but keep waiting and eventually it'll be out", "created": 1499278682.0, "replies": []}]}]}, {"text": "Moto G5 Plus is $180 with Amazon prime. ", "created": 1499759344.0, "replies": [{"text": "Today only, yeah. ", "created": 1499781227.0, "replies": []}]}, {"text": "Moto E4 is officially out ", "created": 1499531605.0, "replies": [{"text": "I know, I'm watching for the E4+ version now :D", "created": 1499532001.0, "replies": [{"text": "It should be soon. Good luck finding your new phone ", "created": 1499532798.0, "replies": []}]}]}]}, "6l9t33": {"title": "Help me find a dumb phone (t-mobile)", "text": "**Country:**   USA/Canada\n**Provider:**   Tmobile\n**Price Range:**   0-$300\n**Your TOP features in a phone are:** Battery life \nMaybe have google maps?\n\nI've been using google's nexus line for the lasts few years now. I love the phones, but I want to get away from smart phones. I feel they distract me too often and I'd like to be more mindful in my life. So I'd like a dumb phone. The main thing I care about is a good battery life so I can comfortably go through the day without needing to charge it. Not sure if dumb phones have google maps or whatsapp but that would be a huge bonus as I'm always getting lost in new places.\nThanks.\n", "created": 1499202999.0, "replies": [{"text": "I bought my mom an LG 450 flip phone for $20 from Walgreens a year or two ago.  It's a T-Mobile prepaid phone but I'd imagine it'll work on any of their plans.  It won't have Google Maps or any map software (it is a dumbphone after all) but aside from that, it should work fine.  You might be able to find it at Target and WalMart as well.\n\nIf you really want map apps, why not get a Blackberry Passport.  App support is probably dwindling so it is effectively becoming a glorified dumbphone anyway.  Map apps should be built in, and you get a QWERTY keyboard and touchscreen as well.  They usually run for $199 from Best Buy, WalMart, etc.  Not bad considering they ran for something like $400-500 brand new.\n", "created": 1499614897.0, "replies": []}]}, "6l1302": {"title": "Cheapest Android phone with NFC capability", "text": "I'm trying to find a cheap Android phone because my friend has diabetes and an app they want to use to measure their blood sugar currently only has an android version while they have an iPhone.\n\nA perfect phone would be &lt;£50 with NFC, small and preferably not awful to use. Camera, fingerprint sensor etc are completely unneeded as she already has a decent iPhone.", "created": 1499100790.0, "replies": []}, "6kwnvy": {"title": "Need a phone, max budget $150", "text": "Criteria are:\n\nMust have a great camera...my wife takes a lot of pictures and she wants to be able to have high enough quality to play that she can have them printed off.\n\nMust be ATT or unlocked.\n\nMust be under $150.", "created": 1499041505.0, "replies": [{"text": "When you want a 'great camera', you need to pay $650+ and $150 phone with a 'great camera' is out of the equation. But my recommendation is Moto G4 Play as its 149.99 and it's an all rounder", "created": 1499077447.0, "replies": [{"text": "I don't think you need a $650+ phone to have a \"great camera\" experience. I have a Honor 8 that I purchased used in like new condition for $230 and it takes pretty nice pictures. Of course it doesn't perform as well as the Samsung S8, Google pixel, etc on most pictures but it does take very nice pictures which some of them may even be better. There's also the LG V20 that is on sale today for $380 on Newegg Flash and it also takes very nice pictures. ", "created": 1499129999.0, "replies": []}]}, {"text": "I'd recommend the LeEco Le S3. It's $150 on Amazon right now which is the lowest I've probably seen it. \n\n\nhttps://www.amazon.com/dp/B01MXLZIDS", "created": 1499130234.0, "replies": []}]}, "6kdnze": {"title": "Searching for a phone with a micro SIM slot", "text": "I have a Rugby (flip-phone), but I need a smartphone. If something happens to that smartphone, I'd like to be able to take the micro SIM card out of it and put it into my old phone. I'd prefer an android, but the sim card thing is my biggest hurdle.\n\nThe folks at the local AT&amp;T stores couldn't find a compatible phone in what they carry (most use nano SIMs instead of micro SIMs). I've looked around the internet and can't find a site that lists phones by the type of SIM card they use (because most folks don't care). Retailer descriptions and manufacturer manuals don't even have that information.\n\nDoes anyone know if there's a resource to find that information or know of an AT&amp;T-compatible android phone that uses a micro SIM card?\n\nUS\nAT&amp;T\n&lt;$200", "created": 1498796012.0, "replies": [{"text": "why not buy a nano-micro adapter (less than 10 bucks) and go for a smartphone that looks decent and has nano sim?\n\n(1st find on ebay: 1.12 usd, can't really go bad as it is completely a passive part http://www.ebay.com/itm/3-in-1-Nano-Sim-Adapter-Micro-SIM-to-Standard-SIM-for-all-mobile-phone-/221955218884?hash=item33ad8fddc4:g:CMMAAOSwjVVVt41- )", "created": 1498842299.0, "replies": []}, {"text": "Just get a phone with the nano SIM slot that you want, then buy a newer Android AT&amp;T Prepaid/GoPhone as a back-up.  They sell for well under $100, especially at Best Buy, Target, WalMart, etc. Better than restricting yourself to an increasingly outdated phone with a micro SIM slot just so that you can use it with your Samsung Rugby.\n\nLooking at BestBuy.com, the LG Phoenix 3 ($70) and Samsung Galaxy Express Prime ($80) both have nano SIM slots.  If you really want a cheapo micro SIM phone as a backup, get the ZTE Maven 2 which costs $40, often $30 on sale.\n", "created": 1499615376.0, "replies": []}]}, "6k609z": {"title": "Great phone with big battery life and good camera for less than $400?", "text": "Hey, I want to upgrade my Samsung Galaxy S5 mini and was wondering which phone would be a good upgrade, I was thinking of a Samsung Galaxy S7 but idk", "created": 1498709953.0, "replies": [{"text": "If you want something to last, and thinking about something similar to S7, Nexus 6P is the way to go", "created": 1498740201.0, "replies": []}, {"text": "Jumping in on this, I want that too.", "created": 1498792488.0, "replies": []}]}, "6jktv0": {"title": "Great all-around smartphone under $140", "text": "Preferably new. Have had 3 strikes with my last 3 refurbished phones, so I'm out on that. Needs?:\n\n* USB-C would be nice\n* Unlocked or branded to T-Mobile/MetroPCS\n* Great camera quality\n* Not shit battery life\n* New\n* Under $140\n* 5\" is a good size, but MUST be less than 6\"\n* Must be Android, of course\n* I'm in the US\n* NFC would be nice\n\nPreferably would be from this list:\n\n* Galaxy S5\n* Nextbit Robin\n* HTC One A9\n* Moto Z Play\n* Moto E4\n* Moto G4 Play\n* Moto G5 Plus\n* Moto X Pure Edition\n* One Plus 5\n* One Plus 3/3T\n* Nexus 6P\n* LAG V10", "created": 1498480857.0, "replies": [{"text": "You may want to keep in mind that for what you're looking for, I don't think under $140 is a large enough budget. How much are you willing to stretch that? ", "created": 1498503370.0, "replies": [{"text": "That's probably max. $10 more if there's anything in that stretch.", "created": 1498544084.0, "replies": []}]}, {"text": "A Moto G4 Play hovers around $100-150, depending on the sale.  That may be the best bet for your price range--and mine (I got one for $140 including tax about six weeks ago).  Not sure how the camera specifically stacks up, but the rest of it is nicely low-key and zippy...zero bloatware as well, which is definitely a bonus.", "created": 1498660440.0, "replies": []}, {"text": "Nextbit Robin is right around $130 on Amazon, however the battery isn't going to be as good as, let's say, the G5 Plus.", "created": 1498663421.0, "replies": []}, {"text": "Moto E4 plus...the only thing missing from your list is USB C. It's a cracking phone", "created": 1501441999.0, "replies": []}]}, "6jl0vk": {"title": "300 Euros decent phone in Italy?", "text": "**Country:Italy**   \n**Provider:Wind(Might change in near future)**   \n**Price Range:Around 300 Euros max**   \n**Your TOP features in a phone are:Decent SoC, good screen and battery, Custom ROM support**   \n**Anything we should know?:I was looking and i found the Zuk Z2 Pro, although it has spotty rom support, the Axon 7 from chinese vendors, but it seems to have a different modem for GSM and LTE.**   \n\n", "created": 1498483156.0, "replies": []}, "6j0aqz": {"title": "Help me pick something after Moto X Style", "text": "Hello,\n\nI am getting fed of my Moto X Style, mainly for three reasons: battery life has become substantially worse in the last year, it gets unbelievably hot even after 10 minutes of gaming and the ridiculous attitude of lenovo towards the updates\n\n\nPlease help me find something to change, but I don't want to go lower in terms of performance\n\n\nCountry:  Switzerland, but France also works if it can be bought from Amazon as fulfilled by Amazon (so it qualifies for delivery to delivery point/point de relais)\n\nProvider: carrier free\n\nPrice Range: 4-500 CHF/EUR (brand new)\n\nYour TOP features in a phone are: it should not be worse than my Moto X Style (QHD screen, 4k video, 3GB ram, QuickCharge), European LTE bands and \n\nit would be a deal maker if the phone would be dual active dual sim capable (so I could ditch my secondary phone as well in the same step) and had fingerprint abilities\n\nThanks", "created": 1498212755.0, "replies": []}, "6im79c": {"title": "Samsung Galaxy S7 Edge or Sony Xperia XZ Premium?", "text": "Country: UK\n\nI'm currently stuck between the Samsung Galaxy S7 Edge or Sony's Xperia XZ Premium. I have both phones but can only afford to keep one, so it's make my mind up time! But it's simply too close to call!\n\nS7E\n\n+ Curved Screen\n\n+ Great camera\n\n+ One-handed mode\n\n+ Lighter than XZP\n\n+ Always on display\n\n- Fragile\n\n- Older processor &amp; OS\n\n- Lack of longevity (heard a lot of complaints about lagging/battery drain after a few months)\n\nXZP\n\n+ Better resolution\n\n+ Better processor\n\n+ 4K video\n\n+ Slo-mo camera \n\n+ Smart battery tech\n\n- Outdated design (bezels, bezels, bezels)\n\n- No one-handed mode\n\n- Fingerprint magnet\n\n- Heavier/bulkier than S7E", "created": 1498055805.0, "replies": [{"text": "My partner had the S8 and I have the xz premium, the Sony is far away the better phone in real world conditions. \n\nSamsung and its bloatware is to much. ", "created": 1498166479.0, "replies": []}, {"text": "I would stick with the XZ premium. Its a much better device. Ok the S7 edge has nice looks however i like my XZ premium more. Its a much better daily. Even battery life is better than my S7 edge. ", "created": 1498629758.0, "replies": []}, {"text": "S8", "created": 1499616267.0, "replies": []}]}, "6ihf6s": {"title": "Broke College Student with Nexus 5 looking to upgrade", "text": "**Country:**   USA\n\n**Provider:**   Cricket/any At&amp;t MVNO\n\n**Price Range:**   300-500.\n\n**Your TOP features in a phone are:**   Good battery life and long term support\n\n**Anything we should know?:**    \n\n", "created": 1497996512.0, "replies": [{"text": "Oneplus 5 or Oneplus 3T", "created": 1498020517.0, "replies": []}, {"text": "You could find a clean Pixel 500ish. Or get the 6P like me. The bad thing about OnePlus is that the support and updates aren't really that great", "created": 1498124600.0, "replies": [{"text": "yes 6P is affordable right now but will it survive for incoming 2-3 years?", "created": 1498297583.0, "replies": [{"text": "From the looks of it, definitely. Battery is good, display is way better than S7 (S7 might look better, but after a year or so pixels either change color or die), camera is also still one of the best", "created": 1498298363.0, "replies": []}]}]}, {"text": "iPhone 6s or Nexus 6p or s7 edge ", "created": 1498243230.0, "replies": []}, {"text": "Lenovo Z2 Plus", "created": 1498431337.0, "replies": []}]}, "6idzrr": {"title": "Compact/light phone w/ contact exchange sync", "text": "Hi to everyone!\n\nI'm 'desperately' looking for a very basic, small and light phone.\n\nI don't need fancy features (no touch screen or camera needed), but at least the possibility to sync my contacts, preferably using microsoft exchange\n\nThe lighter and smaller, the better. \n\nCountry: EU  \nProvider: No \n\nPrice Range: below 150€/$\n\nYour TOP features in a phone are: contacts sync   \nAnything we should know?: light and small   \n\nThank you in advance", "created": 1497965033.0, "replies": []}, "6hv3jg": {"title": "Looking for a new phone on the (relatively) cheap", "text": "**Country: UK**   \n**Provider: Any**   \n**Price Range: &gt;£17 per month**   \n**Your TOP features in a phone are: Camera quality and smooth UI**   \n**Anything we should know?: I have been looking at the Sony Xperia XA1 and like it's feel and use but was curious if you guys and gals could recommend other phones to look in to. I am not a fan of apple in any shape or form. Thanks for reading!**    \n\n", "created": 1497725396.0, "replies": []}, "6hus09": {"title": "Which phone is more likely to get the Android P update, Nokia 7 or Moto X4?", "text": "I want both but that might be a tough sell with my wife. The specs are similar. I wonder if one or both continue to get preferential treatment with Android updates?  ", "created": 1497721943.0, "replies": [{"text": "Nokia 3-9", "created": 1497964689.0, "replies": []}]}, "6hqctl": {"title": "Looking for a phone under $200 that supports 4G LTE Band2 and Band4. (Preferably with a Snapdragon for custom rom support.)", "text": "**Country: USA**   \n**Provider: Haven't decided.**   \n**Price Range: &lt;$200**   \n**Your TOP features in a phone are: 4G LTE Band2 and Band4 Support, 1920x1080 screen, at least 3gb ram, and that it has a snapdragon for custom rom support.**   \n**Anything we should know?: I'm mainly looking for a China phone like Xiaomi or Leeco because of their low price and good specs, but if there is another phone with similar specs and price I don't care where it's from.**    \n\n", "created": 1497658099.0, "replies": []}, "6hfoof": {"title": "250 euro budget phone", "text": "Country: Spain\nNo provider\n200 - 250 price range\nBattery over 3500 mah\nIPS display\nrecent processor\nNO 2.5D glass\n\nI recently ordered an redmi note 4 without knowing it has 2.5 glass, it is really anoying for me not to be able to put ani protection over the screen, more if it doesnt have gorilla glass or something like that... If it werent for the fu***** 2.5D glass the redmi note 4 would me my perfect phone. I would love to have at least 6 hours SOT, fingerprint reader is nice but not really necessary.\nThank you for your time!\n\n", "created": 1497540227.0, "replies": [{"text": "The new Nokia models. They are all in that price range.", "created": 1498124707.0, "replies": [{"text": "They have 2.5D screen :( Seriously, idk how that shit became so trendy", "created": 1498124977.0, "replies": [{"text": "They have gorilla glass, I change phone every 4 years and never put screen protectors, they work great", "created": 1498125095.0, "replies": [{"text": "I had my mi4 which also does 3 days without a protector and collected a few scratches", "created": 1498126166.0, "replies": []}]}]}]}]}, "6hb1uz": {"title": "Need Help Looking for an Android Phone that is Compatible With Ting", "text": "**Country:**   \nUSA\n\n**Provider:**  \nTing/Sprint. \n\nI use ting as my provider but they are a Sprint company so I need to look for Sprint-brand phones\n \n**Price Range:** \n150-300  \n**Your TOP features in a phone are:**   \nDurable, not 100% shock proof, but I am clumsy and drop my phone often. \n\nExactly 32 GB of storage \n\nA really good camera\n\nCalling, texting, internet. Nothing too crazy.\n\nI don't want too huge of a phone, for example a Samsung note would be too big for me.\n\n\n**Anything we should know?:**    \n\nI'm not super knowledgeable about phones. But I use ting.com which is a Sprint contract-less company. So I am looking for a CDMA Sprint-brand phone. I'm not sure if that is considered an \"unlocked\" phone or not. I've been through an iPhone 5s and currently own an HTC M8. Because of affordability I'm sticking with Android. \n\nI hope this helps, Thank you!\n\n", "created": 1497480293.0, "replies": [{"text": "Hey /u/Roxxane2236, \n\nTing offers a GSM network now, too, so you don't have to limit yourself to a Sprint-compatible phone.\n\nIf /r/PickMeAPhone doesn't get a result that you like, Ting has their Personal Shopper program to do exactly what you're asking: https://ting.com/personal_shopper\n\nAll that said, I think if you're okay with the size of the Motorola Moto G5, that should be right up your alley. The unlocked version would work on either the GSM or the CDMA network, and we can help you switch if you get a phone that only works on one.\n\nIf you decide to go GSM and need a SIM card, let me know.\n\nSource and disclosure: I work for /r/ting", "created": 1497532052.0, "replies": [{"text": "Hey thanks for helping me out! \n\nI was considering the moto g5. I'm pretty much in between a Samsung Galaxy S6, the moto g5, or waiting next month until the new Samsung J7 comes out. I pretty much would like the best phone possible with 250$ \n\nAs far as the CDMA/GSM thing, I had online chatted with a ting employee and they had told me that I should stick with a CDMA sprint phone because that's what I currently have. I know this might be a stupid question, but would it be alright to switch to GSM?", "created": 1497827972.0, "replies": [{"text": "The best possible phone for that price range is probably the Moto G5, which is compatible with either the CDMA or GSM networks. \n\nThe recommendation not to switch is typically because you already know exactly where the coverage works for you and where it doesn't. A dramatic switch in network, while it doesn't cost anything, would change your coverage drastically and the phone may not work where it previously did. \n\nI agree with the employee you chatted with that a change in networks is not advisable. You absolutely can change networks if that's a thing you're interested in, but you should expect a change in coverage. Make sure you check the coverage map before you make that jump.", "created": 1497828733.0, "replies": [{"text": "Okay, sounds good. thank you so much!", "created": 1497833438.0, "replies": []}]}]}]}]}, "6gc87e": {"title": "Verizon, thinking S8, but considering their other options. Pixel? LG G6? HTC 10?", "text": "**Country:**   USA\n\n**Provider:**   Verizon\n\n**Price Range:**   Any\n\n**Your TOP features in a phone are:**   Camera, is I guess the main thing, as my old S4 is good for most anything, but feels slow these days.\n\n**Anything we should know?:**    I read good things about the S8, but am not sold on the curved edge screen thing, it seems that it would be hard to hold with out touching the edges giving unwanted input.  Camera quality and features is I guess the main thing, I see the HTC has image stabilization, which sounds nice.\n\nI will be using a case like an otter box defender, if that matters.", "created": 1497052748.0, "replies": []}, "6gc4u1": {"title": "Cheapest T-Mobile smartphone that supports 4G and full sizes SIM cards", "text": "**Country:USA\n**Provider:T-Mobile\n**Price Range:Cheap   \n**Your TOP features in a phone are:4G, full sized SIM card support\n**Anything we should know?:Using this to replace a piece of garbage Alcatel One Touch Evolve 2 that only runs on the 3G network, which in this day and age is useless.  Its for basic smartphone use for work purposes so it just needs to run Android and be some what up to date so I can download time tracking apps.  \n\n", "created": 1497051637.0, "replies": []}, "6fppc0": {"title": "iphone 6 plus or iphone 6s plus?", "text": "**Country:**   \nUSA\n\n**Provider:**   \nUnlocked\n\n**Price Range:**  \nN/A \n**Your TOP features in a phone are:**  \nbig screen   \n\n**Anything we should know?:**   \npicking a phone for not-so-tech-savvy user. they're used nexus 4, 5, and 5x and looking to try iOS. based on my research there's this \"touch disease\" for iphone 7 and 6? is it as big of a problem as i've seen? seems like there aren't too much difference between a 6+ and 6s+ \n\nthanks!\n\n", "created": 1496792379.0, "replies": [{"text": "Go with the 6+, since the user is not a tech savvy. The 6+ performance,battery and camera are good, and you don't need something more.. If you buy the phone new, it is going to have warranty so fixing the touch disease (if there is)  is going to be free.", "created": 1497533456.0, "replies": [{"text": "thanks!", "created": 1497541466.0, "replies": []}]}]}, "6f8z7g": {"title": "Phone with overwhelming signal", "text": "Hello community!\n\nI am searching for what the title say. Also, if the phone has a easy replaceable battery would be awesome. Ruggerized terminal is also welcome.\n\nThank you!\n\nEDIT: Oh, Android :D.\n\n", "created": 1496601817.0, "replies": []}, "6ejy3s": {"title": "iPhone 5s for $99 or Moto G4 Play for $150", "text": "Country: United States   \nProvider: Straight Talk  \nPrice Range: less than $200    \nYour TOP features in a phone are: call, text, light social media (just the basics)       \nI'd also like the phone to last for as many years as possible. That's key.\n\n", "created": 1496285308.0, "replies": [{"text": "You should go with the iPhone.  The iPhone is less likely to lag and is faster than the Moto. Plus, ios is better than android (my opinion), you will get the applications updates faster than android, and you will also get a software update when it comes out (no need to wait!)Ios is also more secure. However, the screen is small and you will probably stop receiving updates in 2 years.", "created": 1497534005.0, "replies": []}]}, "6e807c": {"title": "Nexus 5X on Project Fi or Moto G4 Play on Straight Talk (AT&amp;T Network)?", "text": "Which phone should I get? Keeping a low cost is an important factor. It's really Straight Talk's horrifying customer service vs. potential Nexus 5X bootloops. I'm also a bit attracted to the pay for every ounce of data plan of Project Fi as a way to keep me from being glued to the phone. Which of these options is the better deal?  \n  \nCountry: United States  \nPrice: around $200 or less    \nFeatures: basics (I used a dumbphone for 10 years until it recently died. I tried getting a new dumbphone on eBay and activating it, but it was a disaster. If dumbphones were an option, I'd do it.)  \n \n\n", "created": 1496157888.0, "replies": [{"text": "Stay away from LG NEXUS 5X or 6p.  I am a owner of a 5x and You are buying a broken phone that will bootloop. ", "created": 1496170175.0, "replies": []}]}, "6dfk3z": {"title": "Looking for a middle budget unlocked android phone", "text": "**Country:** Spain\n\n\n**Provider:** None, I want to buy a new unlocked one\n\n\n**Price Range:** 200-250e\n\n\n**Your TOP features in a phone are:** Screen between 5.30-5.50, 4 GB RAM if possible, (maybe 3 will be alright) Lasting battery, possibility of flashing custom roms\n\n\n**Anything we should know?:**  I was thinking maybe some xiaomi, I don't really care about external storage, as long as the phone has like 64-128 internal memory: I keep thing tidy, take pictures and empty the device before it even starts getting full. The flashing custom roms thingy is not that so important, as long as the device is still receiving the next major android update... Mi5, maybe? The note version seems nice, but not as powerful.\n", "created": 1495784749.0, "replies": [{"text": "I'm not sure about pricing or availability in Spain but the Asus Zenfone 3 zoom has the best battery you're going to get from any phone, not just mid-range.", "created": 1495826061.0, "replies": []}]}, "6d8c8n": {"title": "Dumbphone with whatsapp?", "text": "**Country:**   Austria\n**Provider:**   Hofer\n**Price Range:**   &lt;30 EUR\n**Your TOP features in a phone are:**   Bad-whatsapp\n**Anything we should know?:**    I am looking for a dumbphone with whatsapp\n\n", "created": 1495700842.0, "replies": [{"text": "I dont't think that there is a dumb phone that can run whatsapp 😕. You can go to https://www.whatsapp.com/faq/en/general/20951556 and see a list of all the supported phones.", "created": 1497534369.0, "replies": []}]}, "6cz8kx": {"title": "Looking for a Small Bodied (Under 5.5in height) Unlocked Phone for Sprint", "text": "**Country: USA**   \n**Provider: Sprint**   \n**Price Range: $150-250, will go a small bit over if it's worth it.  That being said, I really am not looking to spend a lot of money on a new phone.**   \n**Your TOP features in a phone are: BODY height (not screen) must be under 5.5in, preferably not much larger than 5.1in.**   \n**I would obviously prefer a newer, faster, reliable phone from a trusted brand but it's honestly more important to me that it's just affordable and doesn't feel awkward in my front pocket.**\n\nI need a new phone and I'm using Sprint.  I'd prefer to buy an unlocked phone that will work on this network.  \n\nMy current phone, which I've loved, is the Moto X (1st gen), and it's on its last legs.  I've been shopping around and I'm having trouble finding a phone that isn't big, referring to the body and not the screen.  \n\nThe Moto X was the perfect size for me (5.09 in x 2.57 in) and while I'm expecting I'll have to get something at least somewhat bigger, I'd prefer to keep it as close to that as possible.  \n\nAny recommendations?  Am I just better off limiting myself to phones sold by Sprint?  I'm coming up short.  \n\nI'd also appreciate any tips on finding unlocked phones that work on Sprint, it's been difficult for me...\n\n\n", "created": 1495591436.0, "replies": []}, "6caimt": {"title": "Recommend me a decent cheap AMOLED phone please", "text": "**Country:**   Poland\n**Provider:**   None (doesn't matter really)\n**Price Range:**   up to $140\n**Your TOP features in a phone are:**  AMOLED screen \n**Anything we should know?:**    Screen no larger than 5,2 inches please\n\n", "created": 1495289261.0, "replies": [{"text": "Samsung J5 can be bought in the US for about $140 used.  Or a samsung S5 maybe.  Not sure about Poland prices. ", "created": 1495512384.0, "replies": []}]}, "6c5bn9": {"title": "Mini credit card sized 4G phones?", "text": "I like playing with non-smartphones, and want to find a tiny one a la punkt/light/generic credit card sized ones (e.g. AEIK M1) that works on 3G/4G, so that I can actually use it in Canada. All of the tiny feature phones run 2G, which means I'd be stuck on Rogers, and probably not able to use it next year. \n\nApparently they exist in India, but I don't know how to get one here.\n\nAny suggestions would be great! ", "created": 1495216959.0, "replies": [{"text": "iPhone SE is the only one close to what you described that I even know of.", "created": 1496241076.0, "replies": []}]}, "6bxzje": {"title": "Help me choose smartphone for my mother please", "text": "**Country:**   Slovakia\n**Provider:**   o2\n**Price Range:**   146e\n**Your TOP features in a phone are:**   fluency\n**Anything we should know?:**  phone for my 58yo mom  \n\nHello guys, iam not so into smartphones and dont have much knowledge about it. I have to choose her phone from provider and there are 4 choices.\n\n1, Huawei Y6 II compact\n\n\n2, Lenovo Vibe S1 lite\n\n\n3, Lenovo Vibe K5 dual pro\n\n\n4, Xiaomi Redmi 4A\n\n- my mom is  58yo, those phones are mid to low budget, all 146euros from o2 provider. Personally i am inclined for that xiaomi but dont have any experience with any of those i mentioned. Can you help me please? :) Mom always had just old smartphones i changed or my sister and this will be her first brand new\n", "created": 1495131173.0, "replies": [{"text": "What did you go with? i might get mine a Redmi 4A, $95 now at geekbuyng.", "created": 1497986292.0, "replies": [{"text": "Went for redmi and no hesitation", "created": 1497994725.0, "replies": []}]}]}, "6bdhlk": {"title": "Android phone $150-$300 Range", "text": "Country:   Germany/US\nPrice Range: $150-$300\n\n   \nI want to upgrade my father's Moto G 2nd Gen, and want something long lasting, with good battery. Any suggestions? \n\n", "created": 1494886021.0, "replies": []}, "6baxvh": {"title": "(AT&amp;T) Phone with long battery life for senior", "text": "**Country:**   United States of America (TN)\n**Provider:**   AT&amp;T Go Phone Service\n**Price Range:**   Cheaper is better\n**Your TOP features in a phone are:**   A long battery life is the most important feature.  Hopefully something over a week using it to make a few calls a day.  A simple phone for calls is all he needs.  Prefer physical keys but not required.\n**Anything we should know?:**    My grandparents spend most of their time in the basement of a split level house, so the phone might be searching for service more often.  They do not text, play games, use facebook, or any other apps.\n\n", "created": 1494860969.0, "replies": []}, "6ajfzy": {"title": "Android Phone more powerful than a Note 2", "text": "**Country:USA\n\n**Provider:n/a   \n**Price Range:Cheap!   \n**Your TOP features in a phone are:Latest Android, at least 5.5\" screen \n**Anything we should know?:Right now I use a Note 2 as a bed side tablet because its a nice small form factor when compared to a big tablet but a bigger form factor than a very small phone.  It stopped receiving updates years ago and will never be moved past Android 4.3, so even basic things like the Amazon Alexa app can't be installed on it.  I want a phone that's at least as powerful as a Note 2 and cheap that I can replace it with.  Doesn't need any phone carrier as I will never have it hooked up to cellular.\n\n", "created": 1494501210.0, "replies": []}, "6aivyx": {"title": "Budget android smartphone that's better than my current one", "text": "**Country:**   Australia\n**Provider:**   Vodafone\n**Price Range:**   $100 - 300\n**Your TOP features in a phone are:**   Something that is faster than my current phone, preferably hardware buttons over on screen buttons, A decent front facing camera, preferably android 6 or above\n**Anything we should know?:**    Ive been using a Galaxy S3 with Cyanogenmod 13, and it takes around 5 minutes for the phone to open snapchat, and occasionally cannot access the camera. The phone also freezes when I connect to any WiFi network. So anything better than that. \n\n", "created": 1494491897.0, "replies": []}, "6agpge": {"title": "Android Phone Between $85-$135", "text": "**Country:**   United States\n**Provider:**   MetroPCS\n**Price Range:**   $85-$135\n**Your TOP features in a phone are:**   Just being fast in general, and has Android 6.0, high quality camera, equivalent or better features/software/hardware than my Galaxy S5\n**Anything we should know?:**  Currently have a Galaxy S5. Must be able to be purchased unlocked. Previously had a ZTE Zmax Pro, and was way too big. The S5 size is just right, but fuck me, the stupid charging port keeps busting. USB-C is a must as well.  \n\n", "created": 1494461911.0, "replies": [{"text": "Maybe check craigslist or swappa? Given your preference for unlocked and usb-c and limited price range? ", "created": 1494475726.0, "replies": [{"text": "I'm trying to find suggestions of what phone to get, not where I can find it cheapest", "created": 1494477840.0, "replies": [{"text": "I suggested those sites because there may be phones that check your boxes on those sites in your price range. But... they may not otherwise be found from other sources at your price points. ", "created": 1494483049.0, "replies": [{"text": "I agree. You're not going to find any phones within your price range with new phones, possibly with mint used phones as well. Best bets would be Chinese phones but good luck finding a phone that covers US bands OP. ", "created": 1499280776.0, "replies": []}]}]}]}]}, "6a9q3o": {"title": "broke my phone 5 times this year, help", "text": "So I am notorious phone-breaker. I broke my phone 5 times this year, each time trying to fix it. I decided to buy new phone and some good case. I am looking for something not very expensive and a solution how to make my phones live longer. Easy screen replacement is a good option too but not necessary.\n\n**Price Range:**   \nabout 100-200$\n**Your TOP features in a phone are:**   \nfast enough for internet and reddit browsing. dont play much games but would be nice to be able to play most 2d games.\nsome fast charge would be nice but not necessary\n", "created": 1494379161.0, "replies": []}, "6a8ebc": {"title": "Looking for cheapest, most basic non-smartphone that can run facebook messenger", "text": "Hey,\n\nI'm want to decrease my connectivity to the internet and be more present whenever I'm with others. I mostly use facebook messenger to contact other people. What is the cheapest and most basic dumbphone that supports facebook messenger?\n\nThanks!", "created": 1494365112.0, "replies": [{"text": "Nokia 215: https://www.cnet.com/products/nokia-215/review/\n\nUnless you live in North America\n", "created": 1494365300.0, "replies": [{"text": "I've been looking at that, but unfortunately I'm in Canada.", "created": 1494366133.0, "replies": []}]}]}, "6a2egz": {"title": "Pixel or Moto z play?", "text": "Can't decide between the two coming from a nexus 5x.\n\n", "created": 1494293174.0, "replies": [{"text": "What practical use will you have for a moto z? What potentially will you put on the phone as modules? If you're coming from Nexus pixel should be very familliar. The battery life is not the best but hey frequent updates and better specs", "created": 1495161682.0, "replies": []}]}, "69x4dl": {"title": "Upgrading from Note 4", "text": "Note 4 motherboard dying. Want something similar. Obvious upgrade would be Note 5. Anything esle?", "created": 1494236713.0, "replies": []}, "69kru5": {"title": "Samsung Note 4 dying, looking for upgrade (Note 5, S7, Xiaomi Note 4)", "text": "So I've had my Note 4 for approx 2 years and I'm really satisfied with it, but recently it's been dying after the marshmallow update (hard to boot up, gives different errors every time, random reboots etc) and I'm looking for a replacement. I want it to be similar to the Note 4 and hope that it lasts 2-3 years at least. Here's what I have in mind:\n\n\n\nNote 4:\n\nHonestly I wouldn't mind just getting another Note 4 since I really liked it, but I'm afraid the problem will reoccur. It's apparently quite a common problem since the new android version was released.\n\n\nNote 5:\n\nThis is what I have in mind, cons are the non-removable battery. Not sure if its a big deal though, anyone with the phone care to enlighten me?\n\n\nSamsung S7\n\nCons would be the slightly smaller screen and lack of stylus. I would pick this if I figure out that the Note 5 isn't good.\n\n\nXiaomi Note 4\n\nCheapest option; cons include a subpar camera which I find quite the dealbreaker. \n\n\nDoes anyone own any of the above phones and can give relevant advice?", "created": 1494070823.0, "replies": []}, "690el5": {"title": "I made an in-depth Pixel XL review in case anyone is still interested in picking one up", "text": "Hated seeing super short, 5 minute reviews that just talk about specs so I decided to start doing my own reviews with more detail. Most of them end up being about 30 to 45 minutes long. If anyone is on the fence about this phone I figured this might help out. \n\n[Super In-Depth Pixel XL Review: 6 Months Later](https://youtu.be/_H3RSK8247E)", "created": 1493818899.0, "replies": []}, "68y5yn": {"title": "(USA) (T-Mobile) $100-$300 Ability to run popular apps, good camera, can browse reddit smoothly and quickly", "text": "I mainly just want to be able to run tinder and snapchat, take pictures, use facebook messenger, and browse reddit. Don't wanna spend more than I need to for that, definitely not willing to spend more than $300. Ideally something used I can put a good case on. ", "created": 1493784881.0, "replies": [{"text": "https://swappa.com/buy/nexus-6p-unlocked", "created": 1494197453.0, "replies": []}]}, "68o1t2": {"title": "Looking for Android phone &lt;$100 that I can use with Cricket wireless", "text": "Currently have Verizon, but it is way too expensive and am looking to switch to another carrier for 3 lines total family plan and am thus looking at Cricket. Looking to get an Android phone that is less than $100 hopefully. Don't need the latest and greatest, just needs to be reliable and needs to have removable battery and SD card to increase storage if needed (last phone was a Motorola Droid Turbo which had neither of these and I can't stand not being able to upgrade storage space when it maxes out so easily). \n\nThank you! ", "created": 1493666153.0, "replies": [{"text": "Honestly right now is a great time to switch to cricket. They have really good deals on phones if you're switching and some just released that come with nougat. Such as the Samsung galaxy amp prime 2. Not crappy phone at all.\n\nUnder $100? I'd go with the ZTE Grand X 4. It's got a nice 5.5\" display, fingerprint sensor, good software, decent camera, and nice battery.", "created": 1493677012.0, "replies": [{"text": "Is it possible and worth it to get a phone on ebay that isn't sold by Cricket but compatible with them? Just wondering if there are any advantages to doing that than getting any of the phones Cricket sells themself (though their prices are quite good). ", "created": 1493683070.0, "replies": [{"text": "Of course, just make sure it works with AT&amp;T. If the phone is gophone or AT&amp;T branded, it doesn't have to be unlocked. Otherwise, it must be unlocked.\n\nAdvantages: Resale and/or moving to another carrier. More phone choices.\n\nIf you don't mind used, Swappa.com sells phones.", "created": 1493685275.0, "replies": [{"text": "Thanks - do you have any suggestions for phones? I'm not sure what to look for because I typically just get the Samsung Galaxy Sx that is the last model or model before last even. I'm not even sure if I need to look beyond the ones Cricket has.", "created": 1493688402.0, "replies": [{"text": "Well you set a budget of $100, that pretty much limits you to lower mid-range phones.\n\nCricket phones are pretty good around that price (unless you find a sweet deal on a used phone).\n\nPhones to look for would be a moto g4/g4 plus, honor 5x/6x, or the Zenfone 3 laser.", "created": 1493690978.0, "replies": []}]}]}]}]}]}, "68bmap": {"title": "Updated Sidebar", "text": "- I updated the sidebar to include phone recommendations in 3 price tiers. You can't go wrong with either.  I value software over bloatware, apps, and lagginess so I picked phones that are smooth and great to use. \n\n- Removed all the windows phone references since they're pretty much dead.  \n\n- I don't have a whole lot of time to answer questions.. and the sub isn't big enough for that.. so I'll try to just update the sidebar and links when I have time. \n\n", "created": 1493498895.0, "replies": []}, "67cwoo": {"title": "Looking to buy a Galaxy S7 for under $400, hoping the price has dropped due to the release of the S8. Have a few questions:", "text": "Hey, so I'm looking to buy a Galaxy S7, and I'm wondering if the price is going to drop more. The S8 just came out, so how much is the price expected to drop? Will it drop much more than it already has? I would like to buy it within the next month and want to know if waiting a month would make a difference. \n\nSecondly, what should I do regarding buying used phones, from say, eBay? My OnePlus One bricked from a critical hardware failure two months, so I'm scared to buy any phone now, especially one that doesn't have a warranty. Is this something I should worry about? Is Manufacturer Refurbished a good way to go? I'm fine buying used, I just don't want it to die on me within two years. Can anyone please help me? Thank you!\n\n(Looking for: Samsung Galaxy S7 GSM Unlocked, preferably black colored but not too important.)", "created": 1493077494.0, "replies": [{"text": "/r/PickAnAndroidForMe is a far more active sub where you might get answers", "created": 1493343741.0, "replies": [{"text": "I sure thank you man. I've gotten help there. ", "created": 1493393819.0, "replies": []}]}, {"text": "check swappa", "created": 1493499693.0, "replies": [{"text": "I've found a perfect phone but scared of getting it without a warranty, and the seller hasn't gotten back to me yet regarding it. ", "created": 1493515737.0, "replies": []}]}]}, "677jjz": {"title": "Searching for the right phone", "text": "Hello everyone.\n\nI´m looking for a new phone since my Zenfone 2 has more and more problems (random reboots and not detecting my sim are the main ones). I already looked at a bunch of phones but i am really bad at making decisions so i am asking for your help.\n\n\n**Things my new phone must have:**\n\n* Android\n\n* 5,5 inch or bigger screen\n\n* Capacitive buttons instead of on-screen buttons\n\n* Full HD or higher resolution\n\n* 4gb of RAM or more\n\n* Snapdragon 820 or newer/better processor\n\n* 3,5mm Audio Jack\n\n* The budget is max. 600€ in Austria.\n\n\n\n**Things that would be nice to have:**\n\n* IP67 certification or better\n\n* Optic image stabilisation\n\n* VR Capability (probably only useful with qhd display?)\n\n\n\n**Things that i don´t really care about:**\n\n* Stereo speakers, i don´t often listen to music with my phones speakers, as long as i can hear my ringtone it´s ok\n\n* Selfie cam isn´t really important, i took like 3 selfies in the last 3 years i think\n\n* IR-Blaster, don´t use it, don´t need it\n\n* Wireless Charging\n\n* Dual Sim\n\n\n\n**Phones i looked at and don´t consider anymore:**\n\n* All Meizu and Xiamo Models\n\n* Samsung Galaxy S7 Edge\n\n* Huawei Mate 9\n\n* Honor 8 Pro\n\n* Sony XZ\n\n* LG G5\n\nSo the phones i'm now looking at are the **OnePlus 3t** and the **ZTE Axon 7**.\n\nI'm not rly sure on the stock UI of the ZTE. Does it come with an appdrawer or would i need another launcher? I also heard about some problems with connectivity, has anybody more info on this?\n\n**From what i learned the pros for the Axon would be:**\n\n* Better display (higher resolution)\n\n* Better sound\n\n* Daydream/VR ready (is it any good or is it just a gimmick that you forget about 1 week later?)\n\n\n\n**And for the OnePlus:**\n\n* Better Performance due to lower resolution and slightly better hardware\n\n* Slightly better camera?\n\n* Better UI/Software experience\n\nIs this about right? Any other phones i should look at? About what time can we expect the Axon 8 and OnePlus 4/5 in europe and at what prices?\n\nTo everyone who has read this far and everyone who wants to help me a big thank you :D.\n\nSorry if i made a view mistakes and if my english isn´t the greatest but it´s not my first language.\n\n", "created": 1493017506.0, "replies": [{"text": "Try the [Phone Finder](http://www.phonescoop.com/phones/finder.php) if you want something specific. \n\nMy suggestions for the best phones are on the right in the sidebar though.", "created": 1493499581.0, "replies": []}]}, "66kk2y": {"title": "I have to pick btw 5 phones!! Help?", "text": "I will rate through price range:\n\n\nLg g3=150 euros - pro:great specs,nice design con:old hardware(I can run a custom rom after warranty)\n\n\nNote 4=270 euros - pro:great specs,awesome hardware,s pen(always wanted to own a note) con:2.5 years old and custom ROMs aren't that stable.\n\n\nGalaxy A5(2017)=300 euros - pro:really recent,great bang for buxs,latest official software con:not flagship material,camera,really close in price with s7.\n\n\nGalaxy s7=390 euros - pro:Best overall package con:high price,no s pen.\n\n\nNote 5=400 euros - pro:Best phone for me con:high price,not as good as s7,too large? \n\nOpinion:I would rather choose a One plus 3T but it's not offered in my country,the lg g3 seems great on paper my worries are hardware issues(3 years old phone) and bootloop from lg.\n\n\nthe Note 4 is the most likely to be purchased,it's just that 7.1 ROMs lose functionality and the s-pen looks cheap otherwise the hardware is great.\n\n\nThe A5 has great specs for it's price but it's price is so close to s7 \n\n\nThe S7 is the go to phone,hits all the check boxes just the price is a bit high.\n\n\nThe note 5 is what I want but again the price.\n", "created": 1492721241.0, "replies": [{"text": "Try the [Phone Finder](http://www.phonescoop.com/phones/finder.php) if you want something specific. \n\nMy suggestions for the best phones are on the right in the sidebar though.", "created": 1493499625.0, "replies": []}]}, "66cq52": {"title": "Screen cracked, looking at getting a new phone.", "text": "**Country:  USA**   \n**Provider:  Sprint**   \n**Price Range:  As low as possible**   \n**Your TOP features in a phone are:  At least as good as my Galaxy s4-mini**   \n**Anything we should know?:  The only phone available in my local Sprint store that is a reasonable price is the J3 Emerge, but as far as I can tell, it's worse than my S4-mini in almost every way, in spite of being 4 years newer.**    ", "created": 1492632240.0, "replies": [{"text": "Best Buy has the LG G5 on sale for $240 if you finance it at $9.99 a month through sprint.\n\nhttp://www.bestbuy.com/site/lg-g5-4g-lte-with-32gb-memory-cell-phone-titan-sprint/5027401.p?skuId=5027401", "created": 1492643879.0, "replies": []}, {"text": "Check out the ZTE Axon 7 Mini and the Galaxy S5 for sure. They're around $200, and the Axon especially is (imo) a really great deal for what you get.  If you want to splurge a little, maybe look for an upgrade through the Huawei Mate 9, the Moto X Play, the Axon 7, or the Galaxy S7. Good luck!", "created": 1492910101.0, "replies": []}, {"text": "Check swappa for 1 or 2 year old good conditioned phones or my suggestions in the sidebar.", "created": 1493499720.0, "replies": []}]}, "65l34s": {"title": "Best smartphone compact size", "text": "I use my phone to watch snapchat , facebook, webbrowsing, keeping up with mails,... Wondering if anybody could recommend a phone which has a +- 4.7\" screen (really want to stay under 5\")? It would be great if the phone would last 1.5-2 days with moderate use. Would be prefered if it stayed below 300€. Was looking at phones like Sony Xperia x compact and Samsung Galaxy A3 (2017).", "created": 1492286361.0, "replies": [{"text": "Try the [Phone Finder](http://www.phonescoop.com/phones/finder.php) if you want something specific. \n\nMy suggestions for the best phones are on the right in the sidebar though.", "created": 1493499631.0, "replies": []}, {"text": "You named the only two relatively compact Android phones that exist. Pick your poison. I'd go with the Samsung Galaxy A3 because Sony's customer service is a nightmare and the phone itself is plasticy and feels cheap. ", "created": 1495363207.0, "replies": []}]}, "65ejhy": {"title": "need suggestions for phone", "text": "i need phone \nAvailable budget (370 euro - 390$)\nbattery should be good \ncan stay with me for more than 2 years\ngood design\nno Xiaomi or oppo or any secondary company ( huawei is good)\n\n", "created": 1492197086.0, "replies": [{"text": "Try the [Phone Finder](http://www.phonescoop.com/phones/finder.php) if you want something specific. \n\nMy suggestions for the best phones are on the right in the sidebar though.", "created": 1493499641.0, "replies": []}]}, "64u41p": {"title": "HOMTOM HT37?", "text": "hey guys, have you seen the Homtom HT37? It's $59 at geekbuying atm, how's it?\n\n", "created": 1491948642.0, "replies": [{"text": "No one knows of this random phone bro", "created": 1493499740.0, "replies": []}]}, "64hja1": {"title": "Upgrading on Straight Talk", "text": "**Country:**   USA  \n**Provider:**   Straight Talk  \n**Price Range:**   $200 - 450  \n**Your TOP features in a phone are:** Big screen (5.7\"+) and stylus  \n**Anything we should know?:**  The charging port on my Note 4 is starting to go bad so I need a new phone. I don't want to any smaller on the screen size and I'd like to keep the stylus but if I lose it, it won't be the end of the world. I'm looking at the Huawei Mate 9 but I'm open to suggestions.", "created": 1491798192.0, "replies": [{"text": "The Note 5 was actually pretty good except for the lack of SD card. I'd say most big phones are great except for the Galaxy Megas. The Mate 9 has a big battery too.", "created": 1491914276.0, "replies": []}, {"text": "Try the [Phone Finder](http://www.phonescoop.com/phones/finder.php) if you want something specific. \n\nMy suggestions for the best phones are on the right in the sidebar though.", "created": 1493499664.0, "replies": []}]}, "64fq58": {"title": "Looking for the dumbest of dumb phones: no camera and no internet, much harder to find than it should be. Preferably unlocked.", "text": "**Country:**   United States of America  \n**Provider:**   Preferably unlocked. If not unlocked, a provider that I can get a prepaid plan on.  \n**Price Range:**   Dumb phones are cheap aren't they?  \n**Your TOP features in a phone are:**   More like top non-features. I want no internet access. I want no camera. I care very much about NOT having these things. Also, being able to get a prepaid plan. I do not call people often, I do not want to pay for hours that I do not use.  \n**Anything we should know?:**    Trying to simplify my life, part of that means simplifying my technology. No camera, no internet, pre-paid plans. I have been looking around on google and amazon for a dumb phone with no camera or internet without real success. The [Samsung e1720](https://www.amazon.co.uk/Samsung-E1270-Free-Mobile-Phone/dp/B00FFZORPE) seemed to be the answer to that... until I realized it wouldn't work in the United States.\n\nIt is shockingly difficult to find a truly dumb phone with no camera or internet. Surely there has to be some kind of demand for this that the market would respond to.\n\nThank you.", "created": 1491775705.0, "replies": [{"text": "Let me know if you get any good features. I want something that I can charge once every 3-4 days with moderate texting and that's it. My smart phone has turned me into some weird creature afraid of making eye contact and killing my productivity. So I am cutting loose, or as loose as I can get anyway. I hope someone has something good. \n\nSorry I can't offer more advice. The relaunched nokia 3310 or whatever it is looks intriguing, but it has too much stuff going on for you. At any rate, here's to hoping we'll be able to find something soon.", "created": 1491785789.0, "replies": [{"text": "&gt; My smart phone has turned me into some weird creature afraid of making eye contact and killing my productivity. So I am cutting loose, or as loose as I can get anyway.\n\nSee, shit like this is why I hate smart phones. They don't improve your life as much as they remove you from it.", "created": 1491879321.0, "replies": []}]}, {"text": "3-4 days you say? N o k i a 3310: the original one. If you're looking for something newer but clumsier, get a blackberry 7210, battery is not bad. Heck just get one of those Motorola or Nokia slide phones.", "created": 1492551069.0, "replies": []}]}, "6480tl": {"title": "Upgrading from near zero", "text": "I'm a filthy phone casual.  My current phone is an LG Sunrise (Tracfone), which is about the bottom of the proverbial smartphone barrel.  It gets me by, but it's slow and clunky.  Thus...\n\n**Country:** USA  \n**Provider:** Honestly, I'm open to suggestions.  I've been considering giving Cricket or T-Mobile PP a try, though if it comes to it I can just stick with Tracfone in a pinch.  \n**Price Range:** Ideally, around but preferably below $100.  Depending on the phone, though, there can be wiggle room.  \n**Your TOP features in a phone are:** In no order: a removable battery (this is a borderline dealbreaker--I'm kind of paranoid about this), at least 8GB of storage, a fair amount of durability because I'm ideally not replacing this thing until it dies (other than sticking it in a backpack I'm actually fairly gentle on my phone), and a 720p display if I can swing it.  \n**Anything we should know?:** I wouldn't mind a phone with a radio and headphone jack (so I can chuck my MP3 player and only carry one device around), but that isn't vital--especially if it's a larger phone, which invokes pocket space issues.  \nEDIT: one other thing--while I'm not necessarily averse to picking up a used phone, I'd rather go for a new or worst case refurbished one.  Touchscreen concerns, basically.", "created": 1491670310.0, "replies": [{"text": "Moto G4 Play: 16GB storage, 720p screen, removable battery, and good performance and camera. ", "created": 1491698585.0, "replies": [{"text": "Thank you...that indeed seems to be the one that ticks all the boxes for me.  (The next best thing, apparently, would either be an up-scale Moto or a Lumia.)", "created": 1491771698.0, "replies": [{"text": "Motorola has been awesome lately. G4 is really good. Keep in mind that Nokias have like no apps available.", "created": 1491914393.0, "replies": []}]}]}]}, "63zdz7": {"title": "First Smart Phone!", "text": "I'm in Australia.\n\n20, never had a smart phone, figured it was about time to upgrade from the brick of a nokia I've been using.\n\nI use my phone for as minimal as possible (we're talking like 15 texts and 10 calls a month *max*) and would want a very modest internet data allowance, if any at all (I'm in Wifi areas 90% of the time I want to access the net).\n\nNot sure whether buying outright or getting a bundle with a super cheap plan would be most suitable in that regard.\n\nAnyway, for the phone model itself, the only real prerequisites I could have are something that can run the latest iterations of Snapchat, Instagram, etc.\n\nAny suggestions? Thanks in advance!", "created": 1491557669.0, "replies": [{"text": "No clue about what kinds of service providers you have down under, but as for a phone...if all you want is something to Instagram with, the field's wide open.  You probably want to answer two questions, though:\n\n1. How much are you willing to spend?  \n2. What operating system do you want to deal with (iOS, Android, Blackberry off on the fringe, or Windows Phone)?", "created": 1491578555.0, "replies": []}, {"text": "Try the [Phone Finder](http://www.phonescoop.com/phones/finder.php) if you want something specific. \n\nMy suggestions for the best phones are on the right in the sidebar though.", "created": 1493499669.0, "replies": []}]}, "63ws6e": {"title": "Looking to buy a LG G5 or a Nexus 6P, which one do you guys think is better?", "text": "**Country:**   \n**Provider:**   \n**Price Range:**   \n**Your TOP features in a phone are:**   \n**Anything we should know?:**    \n\n", "created": 1491522263.0, "replies": [{"text": "The 6P by far. This is a nitpick but the G5 breaks really easily due to the weird curved screen.", "created": 1491914438.0, "replies": []}, {"text": "where r u planning to buy the P6 from? Cost? (I have been trying for one as well).", "created": 1492105960.0, "replies": []}]}, "63lslm": {"title": "Cheapest 1080p 6 inch Smartphone?", "text": "HI everyone. Title says it all. I'm looking for a phone in which a big screen that's at least 1080p is the priority, and nothing else besides workable battery life. What's the cheapest I can find? ", "created": 1491401930.0, "replies": [{"text": "One clarification question: are you looking for a 6\" display strictly, or just something in that size range (say, 5.5-6\")?  Going off [Phone Arena's search engine](http://www.phonearena.com/phones/full#/phones/full/?f[58]=273&amp;f[253][n]=5.7&amp;f[253][x]=6&amp;f[63]=1080&amp;f[64]=1920), you're almost certainly looking at a midrange phone at a minimum...", "created": 1491502170.0, "replies": [{"text": "Thanks for the info. I started looking into phones and soon dropped my \"cheap\" condition and ended up pre-ordering the Samsung Galaxy S8+. Certainly has a nice big, high resolution screen.", "created": 1492108766.0, "replies": []}]}]}, "63k34k": {"title": "Looking for decent bang for buck", "text": "**Country:** Ireland\n**Provider:** Unlocked Phone Required\n**Price Range:** 200-400\n**Top Features:** Good battery life, 5.5inch plus screen, Used mainly for Media Consumption", "created": 1491377063.0, "replies": [{"text": "Moto x pure edition. $250-$300 on Amazon", "created": 1491390587.0, "replies": [{"text": "On paper the Moto X pure is great.  But my wife's is having random reboots.  Google Moto X pure random reboot and you'll see a lot of users are plagued by the same problem.  I would not recommend the Moto X Pure.", "created": 1493030191.0, "replies": []}]}, {"text": "one plus 3T best bang for buck.440€ from the official OP", "created": 1491985155.0, "replies": []}]}, "63jocd": {"title": "Iphone 6 plus with 16 gig for $200 or Iphone 6 with 64 gig for $250", "text": "I'm from the U.S and I'm deciding which iphone is a better choice.  I have tmobile if that helps at all and I'm not too big on the amount of space however. It doesn't matter to much to me since I have a current 5s with just 16gig and i'm fine with it but what would really be the best?   \n\n", "created": 1491370317.0, "replies": []}, "63i29v": {"title": "Need a VoLTE capable phone on the T-Mobile network, that is water/shock-proof, or has cases that are. (x-post r/cellphones)", "text": "**USA:**   \n**T-Mobile:**   \n**Price Range: Cheap(er..est)**   \n**Your TOP features in a phone are: Waterproof/shockproof, VoLTE capable**   \n**Anything we should know?: It's for a job. I will also have a primary cell phone on the verizon network. The more affordable the better. A no contract or pre-paid plan would be best for me, as the job is seasonal.**    \n\nedit: words\n", "created": 1491350551.0, "replies": []}, "63cptc": {"title": "New features of the Nokia 3310...", "text": "I have here jotted down the best features of the new Nokia 3310 phone. Am going to get one when it releases...which of these features do you think is the most important? \n\nteks.co.in/site/blog/nokia-3310-is-back-check-out-its-top-12-features/", "created": 1491291183.0, "replies": [{"text": "Snek.", "created": 1492551200.0, "replies": []}]}, "638xy3": {"title": "Help on which phone to buy? My current phone is breaking.", "text": "**Country:**USA  \n**Provider:**Tmobile   \n**Price Range:**Any\n\n**Your TOP features in a phone are:**Watching videos, clean nice look, good native messaging app (not a must), good look and nice design, less bezel is good.\n\n**Anything we should know?:** I am looking into the LG G6, ZX or XZ PREMIUM (hasn't come out yet), S8 or +, Recommendations?\n\nI currently have the s7edge (screen is flickering green way to much, it can break any day), Im not in a hurry i can wait for any of these phones, but i would like s8 because its really bezel-less but i feel like its not a good enough update besides the screen. My only issue is touching the sides with the palm, hate that on the s7e. I need a case and i dont have big hands. and LG i never had a good phone with them, there was always a problem, for example my old LG G3, the headphone jack kept reading headset but i didnt have a headset plugged in, etc. Like i mentioned i really love watching videos and having a nice aesthetic touch to it, including software.\n\n*** Current phone is breaking because of steam in the shower. Not happening again. ", "created": 1491246873.0, "replies": []}, "62xlpd": {"title": "First phone", "text": "**Country:America \n**Provider:metroPCS\n**Price Range:120-200\n**Your TOP features in a phone are:can emulate games, good mic, and has good battery life\n**Anything we should know?:One of my favorite foods is Spaghetti \n\n", "created": 1491104544.0, "replies": [{"text": "Moto G4 or G4 Play.  LeEco S3 is another option with nicer hardware.  ", "created": 1491327845.0, "replies": [{"text": "Are those better than any Samsung or iphone I can get for around the same price?\n", "created": 1491332805.0, "replies": [{"text": "Yes.  You could get a used S5/S6/Note 4 for that or an iPhone 5s.  These will have better camera (note 4 might be better), new, and better battery life.  ", "created": 1491333364.0, "replies": [{"text": "Thank you!", "created": 1491335131.0, "replies": []}]}]}]}]}, "62siw6": {"title": "Looking for cheapest possible Android 4.2 or higher phone, please assist.", "text": "**Country:**  United States\n\n**Provider:**   Need phone without plans\n\n**Price Range:**  As low as possible, hopefully not more than $20 (USD) \n\n**Your TOP features in a phone are:**   4.2 android or above, Wifi,  screenshot capability (lesser)\n\n**Anything we should know?:**    Nothing that has not been stated.\n\n", "created": 1491051121.0, "replies": [{"text": "What carrier?", "created": 1491328792.0, "replies": []}]}, "6292kp": {"title": "Oneplus 3t vs Huawei P10", "text": "**Sweden**   \n**Unlocked**   \n**400+**   \n**Snapchat addict, audio/podcast and one hand use**   \n**What do you guys think of the options?**    \n\n", "created": 1490817790.0, "replies": [{"text": "Not on your list, but the Axon 7 is similar, but has the best audio in the price range by far. ", "created": 1491328431.0, "replies": []}]}, "61tthk": {"title": "Contract Free Budget for Collage Student", "text": "**Country:** USA   \n\n\n**Provider:** AT&amp;T , Cricket , T-Mobile\n\n \n**Price Range:** $200ish lower better   \n\n\n**Your TOP features in a phone are:** Big screen 5.5in+, Fingerprint Scanner   \n\n\n**Anything we should know?:** Looking for something contact free, AKA those cheap prepayed services like the AT&amp;T Go Phone (but I dont like any of those phones at all). You can read this as broke cheap and in school. Basically just looking for a large screen phone compatible with any of the above networks and that preferably has a fingerprint reader. Ive been looking at the Honor 5x and Blu 5r.\n", "created": 1490637851.0, "replies": [{"text": "Consider grabbing a Moto X Pure Edition. It doesn't have a Fingerprint Scanner but it's an amazing phone.\n\nhttps://www.amazon.com/s/ref=nb_sb_noss_2?url=search-alias%3Daps&amp;field-keywords=moto+x+pure", "created": 1490706584.0, "replies": [{"text": "Arnt they coming out with an undated one soon?", "created": 1490715464.0, "replies": [{"text": "Possibly, but it's going to be out of your price range. The one I referenced is still a great model and was made prior to lenovo taking over.", "created": 1490717542.0, "replies": []}]}]}, {"text": "Current options are Zenfone 3 max (frequently on sale for $149), Blu life one x2 (on sale for $139 often), and Moto g5 plus ($174.99 with Amazon ads)", "created": 1490715389.0, "replies": [{"text": "How are they??? Ive herd iffy things about Asus and Blu phones. ", "created": 1490715559.0, "replies": [{"text": "Well there's a reason they go on sale so much. Moto g5 plus is probably the best budget phone you can buy.", "created": 1490719748.0, "replies": [{"text": "So im going to read that as AVOID at all cost lol\n\nHow are Huawei", "created": 1490720299.0, "replies": [{"text": "They're ok. Just keep in mind they use proprietary processors so any dev work is very limited, also updates come slowly.", "created": 1490722669.0, "replies": [{"text": "I'll probably go with the 5x and flash stock Android to it. Lineage is maybe? That's what I've done for all the phones I've owned. Unless I'm mistaken the 5x uses Snapdragon", "created": 1490723222.0, "replies": [{"text": "Yup, that model is good to go. Snapdragon 617.", "created": 1490727013.0, "replies": [{"text": "Yah in my research the only short coming is that the software bogged it down, but that issues should hopefully be solved with flashing stock to it", "created": 1490727089.0, "replies": []}]}]}]}]}]}]}]}, {"text": "If you wait a few months there will be plenty of cheap handsets with fingerprint.", "created": 1490661694.0, "replies": [{"text": "I dont have a few months... try days :/ But just wondering whats going to be coming out? \n\nCurrent phone is busted (mic no work) and carrier and manu wont do anything about it. Wana get something ASAP. ", "created": 1490662186.0, "replies": []}]}, {"text": "If you're willing to buy a used phone you'll have a few options. Set what you want as options on eBay and see what's out there", "created": 1490664860.0, "replies": [{"text": "Probably not... The IMEI thing about used phones kinda freaks me out", "created": 1490715433.0, "replies": []}]}, {"text": "LeEco S3.  5.5\" screen, SD 652, and a fingerprint sensor.  They have a deal for student with free power bank and other accessories.", "created": 1491328330.0, "replies": [{"text": "Ive never herd of them before... Any good??? ", "created": 1491329266.0, "replies": [{"text": "They are reviewed pretty well, they are the company that bought Vizio and just started selling in the US last year.  ", "created": 1491331225.0, "replies": [{"text": "It's $159 on Amazon right now.\nhttps://www.amazon.com/gp/product/B01N1G0Z04?redirect=true", "created": 1491333194.0, "replies": []}]}]}]}]}, "61k3no": {"title": "Suggestions for ATT/GSM phone?", "text": "**Country:**   USA\n**Provider:**   Cricket \n**Price Range:**   Engineer Scrooge\n**Your TOP features in a phone are:**   battery life, no speed issues on pokemon go, quick charge.\n**Anything we should know?:**    I prefer larger 5\"+ phones, because I have big dude hands. so I would like a big dude phone.\n\n\nI'm looking for a good phone with decent battery life, no gameplay stuttering, quick charge, and a 5\" frame or larger. Would like to also have full ATT LTE support, since I have an internal Cricket dealer line and often use that to test coverage.\n", "created": 1490506110.0, "replies": [{"text": "Maybe a Moto X Pure? It's unlocked and has good specs. 3GB of RAM, good battery life, etc. Awesome camera.", "created": 1490535937.0, "replies": []}, {"text": "Moto g5 plus", "created": 1490571679.0, "replies": [{"text": "Got it, love it. \nSeriously needs some cases tho.", "created": 1491811783.0, "replies": []}]}, {"text": "LeEco Le Pro 3.  Huge battery, 5.5\" screen, Snapdragon 821, 4GB RAM, and 64GB storage.  ", "created": 1491328115.0, "replies": []}]}, "616k8n": {"title": "Looking for a decent mid range unlocked phone", "text": "**Country:**   Canada\n\n**Provider:**   Bell (Plan to switch to chatr)\n\n**Price Range:**   250 CAD or under (after any taxes or shipping/handling)\n\n**Your TOP features in a phone are:**   Good Battery life and Performance, decent camera, decent storage (or at least supports a big sd card)\n\n**Anything we should know?:**   I'm with bell currently but plan to switch to chatr (3 g data speeds, no 4G/LTE and Rogers is the parent company) so any opinions/comments/experiences on that would be appreciated as well.\n\nI have been looking at the asus zenofone 3 max for ~225 CAD (after taxes) (16 gb with up to 32 gb expendable storage) which doesn't seem too bad (but only up to 32 gb expendable storage is a bit of a bummer).\n\nI also looked at xiaomi and huawei phones but have no idea which model I would even want to get and which is the best for my money.\n\nMy current phone is a Samsung galaxy alpha and am looking for something that is a considerable upgrade from it.\n\nAny suggestions and help would be appreciated!\n \n\n", "created": 1490323872.0, "replies": []}, "611p64": {"title": "Upgrade from Nexus 5, Mi Max or Mi 5?", "text": "I' ve been using a nexua 5 for a year and its starting to get really slow. which should i buy any suggestions guys?", "created": 1490274046.0, "replies": []}, "609chf": {"title": "need a new flagship with dual sim, oneplus two ?", "text": "Country: Egypt\nProvider:Etisalat &amp; Vodafone\nPrice Range:less than 230$ ( i'm okay with used phones )\nTOP features in a phone are: i used to have nexus 5 , oneplus one and htc 816. i want a good performance and battery , big ram &amp; storage. updates &amp; roms ( i'm flashholic )\ni'm thinking of oneplus two 64gb it costs around 220$. am open to suggestions \n\n", "created": 1489916630.0, "replies": []}, "6080bb": {"title": "OnePlus 3T or iPhone 6 32GB?", "text": "Country: India\n\n\nProvider: Vodafone (Doesn't matter here, since all phones are unlocked in India. \n  \n Currently have a OnePlus One, really like it and was #TeamAndroid for a while, but it's REALLY slowing down and the charging port on the phone is messed up. \n\n Both phones are currently the same price (the 3T is at MRP, and the 6 is at a discount. They are literally the same price right now.) These are the problems I'm having with the decision:\n\n1. Screen Size: The 6 is a smaller screen than the One AND the 3T.\n\n2. Battery: Since I'm a student, I don't use the phone all day, so less battery is manageable. Plus I always carry a power bank.\n\n3. Storage: TBH, I don't really take many photos or videos. I have like 25 Apps, 3 movies and thousands of photos on my OnePlus One mostly because the excess space means I don't really need to clear stuff out. But still, is 32GB too low?\n\n[Note: The discount is ONLY one the iPhone 6 32GB. Not the 6+, Not the 64/128GB models. So it's either the smaller display and smaller storage phone, or no phone :P ]\n\n", "created": 1489891284.0, "replies": [{"text": "I would go with the OnePlus 3T. Yeah you are getting a good deal for the iPhone but how long will it last you? Sadly, Apple slows down their phones so you can upgrade to the newest phone and I feel like if you buy the iPhone, it will slow down within a year and you might need to upgrade again (that's my opinion). \n\nSince the 3T is newer, Snapdragon 821 chip, really good in price, I would say it's worth it and not only is it faster but it will last longer than the iPhone! It also has more storage while you said you won't have much use for it, but it helps to have extra storage just in case. \n\nI know you want a smaller screen but even though the OnePlus 3T is bigger, it's generally worth it compared to the iPhone.", "created": 1490168368.0, "replies": []}, {"text": "Since your other option is the iPhone 6, I would recommend you go with OP3T.\n\nThe 3T has higher specs in RAM (no comparison) and disk space and a better battery; plus its 2 news newer than the iPhone 6 hardware.", "created": 1492105656.0, "replies": []}]}, "5zyss9": {"title": "Sony X Performance or Moto Z?", "text": "**Country:**   Canada\n\n**Provider:**   Rogers\n\n**Price Range:**   0-200\n\n**Your TOP features in a phone are:**   look, battery, root, unlockable\n\n**Anything we should know?:**    phone is free with no contract as it is a replacement\n\n&amp;nbsp;\n\nSony X Performance for free, or Moto Z for 200?\n\nIt's a replacement for my busted phone, so no contract shenanigans. I care about being able to attain root and unlocking the device. Review wise, the Moto Z sounds better, but I wanted to hear what you lot thought.", "created": 1489770156.0, "replies": [{"text": "Not sure if you can root the Sony, but depending on which version of the Moto Z you get, it's possible you can root it. Both specs are similar but the Sony has a better camera. \n\nI would say go with the Sony since it's free because it doesn't have much of a difference with the Moto Z. ", "created": 1490168561.0, "replies": []}]}, "5zxei6": {"title": "LG G6 shortcomings and concerns?", "text": "Im coming off an iPhone 6 and looking for a flagship android. Right now I'm looking closely at the g6. I really like the idea of the 18:9 aspect ratio and I love the design. \n\nI'm not interested in xl/plus size models, so I'm wondering how the g6 stacks up against say, the pixel, or other flagship phones. Are there any areas where it falls short of the current competition?\n\nSimilarly, how real are concerns about bootlooping with lg? Is that issue ongoing or has it been mostly resolved?", "created": 1489755275.0, "replies": [{"text": "&gt;I'm not interested in xl/plus size models, so I'm wondering how the g6 stacks up against say, the pixel, or other flagship phones. Are there any areas where it falls short of the current competition?\n\nIt stacks up pretty well with the Pixel and other 2016 flagship phones, because it uses the 2016's Snapdragon 821 chip which is powerful but it's not the newest Snapdragon 835. Sadly, the G6 couldn't get the Snapdragon 835 chip until Samsung unveiled their Galaxy S8 since Samsung manufacturers the Snapdragon 835 chip. I would say just the processor is falling short for 2017 but it's not like it's a disadvantage at all. \n\nAs for screen size, since it's a 5.7 inch screen, you are getting a phablet sized phone such as the Pixel but the screen takes up majority of the phone so it is easy to use with one hand. And the rounded display looks really good! \n\n&gt;\n&gt;Similarly, how real are concerns about bootlooping with lg? Is that issue ongoing or has it been mostly resolved?\n\nI'm not sure whether the issue has been resolved but only time will tell whether it is fixed or not. I have a feeling LG got it right this time!", "created": 1490168049.0, "replies": []}]}, "5zt5pw": {"title": "dumbphone with long battery, easy messaging/full keyboard (like blackberry)", "text": "i wish for a phone with long battery life, a keyboard, and one app/hub for facebook messages, phone messages &amp; phone calls. a camera may also be there. i dont need any other battery consuming apps &amp; screens, i can wait to browse the internet &amp; shitbook &amp; instashit &amp; write webmails when i am at home on the pc.\n\nmy phone needs to be this: easy messaging, easy calling, pictures. nothing more, nothing less. \n\n(and having a long battery life is part of \"easy messaging,... my current touchscreen s3 goes from 100% to 0% in 3 hours)\n\ni really like the concept of rereleasing the nokia 3310, the only downside is that writing messages (sms or fb) will be a pain in the ass\n\n", "created": 1489696844.0, "replies": [{"text": "the Nokia 6820 is actually very good, if i could only have fb messenger on it", "created": 1489697130.0, "replies": []}]}, "5zo8b9": {"title": "The problem is picking the best company", "text": "Hi Guys \n**Europe**\n\nI've used the gsmarena phonefinder tool with the parameters I was looking for (fingerprint reader, not more than 5\" in a 110-170£ price range.\n I found actually a lot of phones​ really really similar between them (if not the same HW!).\n\nSo instead of asking to pick a phone i would ask to pick a company between :\n* Lenovo\n* meizu\n* xiaomi\n* Motorola\n\n(I'm willing to root and flash a custom ROM)", "created": 1489634142.0, "replies": []}, "5zfmy0": {"title": "Moto g5 plus vs ZTE blade v8 pro", "text": "**Country:** USA\n\n\n**Provider:**   At&amp;T\n\n\n**Price Range:** under 250\n\n\n**Your TOP features in a phone are:** battery life, processor speed, ram,  reliable updates, fingerprint sensor, reliability\n\n**Anything we should know?:**    \n\n\nI prefer the moto g5 right now just because it seems like a more trustworthy company than zte, and It seems like they have a better reputation for updates and build quality, but to be honest on paper the zte seems better in every way except screen size (I prefer smaller phones). What do you guys think?\n ", "created": 1489532621.0, "replies": [{"text": "Hardware means nothing if the software is thrown together with no care. Moto has some of the best software in the industry. ZTE on the other hand has tons of reviews criticising their software.", "created": 1489606857.0, "replies": []}]}, "5z6u3k": {"title": "Great......everything ( info in post )", "text": "Great battery \n2800 maH or more\n\nLarge screen\n5.5in or higher\n\nHD Display\n1080p or higher\n\n\nThanks in advance, have a nice day", "created": 1489430793.0, "replies": []}, "5yxnu3": {"title": "Looking for a good music/ high audio fidelity phone. Preferably normal sized, not plus sized.", "text": "Was going to upgrade to the Marshal London, however there's no word on a US release date, and just about everybody I've asked has said it's best not to import one, so I'm looking for good alternatives in that realm.\n\n**Country: United States:**   \n**Provider: Sprint (though I'm fine with changing providers if needed):**   \n**Price Range: $400-$700:**   \n**Your TOP features in a phone are: Sound card quality, readable audio file types, and storage.**   \n**Anything we should know?: I'm fine with sacrificing other features in favor for better audio performance. (ex: 720p instead of a 1080p screen in favor of a higher quality sound card) Music is the priority and everything else is secondary**    \n\n", "created": 1489304499.0, "replies": [{"text": "The older HTC flagships suit your needs and can be picked up cheap now. Here's one... http://www.pcworld.idg.com.au/review/htc/10/599962/", "created": 1489405586.0, "replies": []}, {"text": "Other than the old HTC phone suggestion, your only other choice is iPhone [the older ones, of course] and the LG V5 (has a good DAC). \n\n IMO iPhone is the way to go. I'm saying this as an Android User BTW, but the sound quality on iPhone is pretty good. [Not just \"good to listen to spotify,\" but \"able to drive some audiophile grade headphones\" type. You can check out a couple of posts on /r/Headphones for that.] The PROBLEM here is obviously the file types, and since you mentioned that specifically I'm guessing you're not gonna be content with Spotify etc.\n\n My suggestion is go to /r/headphones or /r/apple and ask if there's any app that can play those files (it's gonna be paid most likely, but worth it.) Since you don't care about the other frills, you can get a high storage, older model iPhone for cheap as well, since the Audio Quality doesn't really improve over the models.\n\nBTW, why not just buy a cheap Android and a FiiO music player?", "created": 1489891680.0, "replies": []}]}, "5yn6jb": {"title": "Durable button phone.", "text": "I'm looking for the best button phone that has the following features and thought I would try here as well as looking online.\n\nHas to be easy to use with big enough screen and buttons for older person with not the best eye sight.\n\nDurable as this person works outside and drops their phone often.\n\nA strong flashlight.\n\nOnce again. Easy to use.\n\nThanks for the help if anyway does help!", "created": 1489164990.0, "replies": [{"text": "I don't know if this is 100% what you're looking for, but the Kyocera DuraXE meets most, if not all, of your criteria", "created": 1489177133.0, "replies": []}]}, "5ykmxe": {"title": "Need a phone for work - wifi only, any brand, large screen preferred", "text": "I need a phone for work only but fortunately I have good wifi so I won't need cell service. I want to keep costs low so something 1-3 years old as long as it's not too slow. I'd preferred a large screen because I need large text. \n\nWill only be used for texts and email\n\nBattery life not a concern. I'm open to any brand/OS. \n\nThanks", "created": 1489127982.0, "replies": [{"text": "Oneplus 1/2/3/3t/X", "created": 1489129580.0, "replies": [{"text": "Those are more than I'd want to spend (at least on eBay the 1 is $150).\n\nHow do these compare to something like the Moto G4?\n\nI'd hope to get something $50-$100 used ", "created": 1489130314.0, "replies": []}]}, {"text": "The smallest and most basic one of these is oneplus x and it's also way ahead of moto g4 as currently I'm using it. For how much do u getting the g4?", "created": 1489131724.0, "replies": []}]}, "5y88kf": {"title": "Help picking out a new phone with great battery life", "text": "Hey, my Sony Xperia Aqua m4 is dying on me, so I am looking for help to as to what to pick for my new phone. \nThere are only two things that really matter to me, Camera, and Battery life, with battery life being the more important. Other than that, I'm not really fussed.\nIm looking to spend around $350 AUD, and I don't care about buying online or anything so long as its cheaper.\nI'm hugely appreciative of anyone that could help me out!\n\nThanks in advance,", "created": 1488983950.0, "replies": [{"text": "I reckon this might nail it. Can be had from $300-$400 too... http://www.pcworld.idg.com.au/review/motorola/x-force/606329/  =  http://m.shopbot.com.au/m?q=moto+x+force", "created": 1489405985.0, "replies": []}]}, "5x2qlv": {"title": "What phone has a good sound and video?", "text": "I was trying to decide between the ZTE Axon 7 which reviews says has a good sound and video vs the Samsung S7 which is on sale right now for $300. I am not sure how the audio quality compares between the two. I haven't been able to find a ZTE Axon 7 to test. I have Sprint as my carrier, but may not stay with them for long. Unless someone knows of a better phone than these 2.", "created": 1488454703.0, "replies": [{"text": "Sonys are good for this and their recent flagships have been overpriced but now are heavily discounted. This is a good bet now... http://www.pcworld.idg.com.au/review/sony/xperia-x-performance/602677/", "created": 1489406282.0, "replies": []}]}, "5x21w5": {"title": "futureproof 4k video phone below $500", "text": "I'm looking for a future proof phone I can use for the next three years which must be able to shoot 4k video (good quality is what I go by for this phone) and it should have a processor that will last me a while and at least 3GB of RAM. Ideally 4GB or more.\nI know I'm asking a lot in this price range:\n\n**Price Range:**  not more than USD $500, ideally under $400\n**Your TOP features in a phone are:**   good quality 4k video recording, minimum 3GB RAM. Don't need anything else.\n\n", "created": 1488442080.0, "replies": [{"text": "Sonys have the best video and only recently got superseded. Their prices have collapsed since these reviews appeared... http://www.pcworld.idg.com.au/review/sony/xperia-x-performance/602677/ and also http://www.pcworld.idg.com.au/review/sony/xperia-xz/608299/", "created": 1489406447.0, "replies": []}]}, "5wzm8h": {"title": "Budget phone for traveling mom", "text": "**Country:**   Canada/Poland/Ukraine\n\n**Provider:**   Freedom Mobile (AWS; 1700/2100), Kyivstar (GSM, 900/1800; and UTMS, 2100), and I'm guessing possibly Orange Polska (GSM, 900/1800; UTMS, 2100/900; and LTE 1800) (or if you can suggest another Polish carrier that has good reception in the Mazury farm areas would be greatly appreciated)\n\n**Price Range:**   Max $400\n\n**Your TOP features in a phone are:**   Long battery life especially when using GPS and google maps\n\n**Anything we should know?:**    My mom isn't super tech savvy but is planning to use the Fongo Voip app to call Canada when traveling and google maps for get around.", "created": 1488411088.0, "replies": [{"text": "I reckon the LG X Power hits the mark http://www.pcworld.idg.com.au/review/lg/x-power/608264/?pp=2", "created": 1489406587.0, "replies": []}]}, "5wqdqf": {"title": "My iPhone 5 has decided to start dying. What should my new phone be?", "text": "I really don't care about having the newest thing and am looking into older, cheaper smartphone models. I'm not very tech oriented and don't need anything super fancy. I have a couple of apps I use regularly (IG, FB, Gchat, insurance), take LOTS of pictures and videos, listen to music, and aside from that I mostly use google maps, email, some browsing and texting.\n\nI'm tempted to get another iPhone because ALL my shit is Apple. Mac, iPad, AppleTV, my car has an iPhone jack, and I like how everything syncs up and works together. It's just easy.\n\nI am thinking about getting an iPhone 6. What are the differenced between the 6 and the 6 Plus?\n\nWhat other models should I check out?\n\nI'll be getting it [here](http://www.bell.ca/Mobility/Smartphones_and_mobile_internet_devices) because all my shit is Bell and it's easy to manage.\n", "created": 1488315870.0, "replies": [{"text": "The 6s or 6s Plus should be available quite cheap or refurbished. They'll suit your needs.", "created": 1489408339.0, "replies": []}]}, "5wgg0v": {"title": "Want a new premium Android phone", "text": "Looking to straight up purchase one and switch the sim in my current phone. Coming from a Moto X Play, needed something cheaper at the time, but want a premium phone now.\n\nDon't care about camera\nBattery life is important\nWant a nice screen\nNeeds to be able to take a 64GB microSD\nAlso absolutely need a notification LED\nFingerprint scanner would be a bonus too\n\nAny recommendations?\nCurrently eyeing the ZTE AXON 7", "created": 1488198396.0, "replies": [{"text": "Moto z play", "created": 1488200264.0, "replies": []}]}, "5wfv6l": {"title": "Oneplus 3T vS Xiaomi mi5s plus", "text": "Greetings! SO basically:\n\nOneplus 3T (64GB) for 445 USD OR Xiaomi Mi5s Plus (128GB, 6GB RAM) for 430 USD.\n\nI'll use the phone for 4 years, so I'd like it to have.. well... \"longevity\"? As in, software updates. That's the main thing I'm focusing on.\n\n1st) Longevity 2nd) Performance 3rd) Camera\nWhat do you guys think?\n\n", "created": 1488188152.0, "replies": []}, "5wc1ve": {"title": "A dumbphone with great battery life", "text": "I'm looking for a basic dumbphone/feature phone.\n\nOnly required features are the ability to call and text message.\n\nGreat battery life is what I'm after. \n\nHigh quality audio or high volume is a plus.\n\nThanks :)\n", "created": 1488139278.0, "replies": [{"text": "The new Nokia 3310 would likely fit the bill. It's a dumb phone, but with Nokia quality and durability.", "created": 1488140394.0, "replies": [{"text": "Yeah, it looks like a good fit, but won't be out until Q2.", "created": 1488142801.0, "replies": [{"text": "I like the Nokia 3310 too but it's only 2G which most carriers have stopped supporting.", "created": 1488511340.0, "replies": []}]}]}]}, "5w9zgb": {"title": "Looking for a very basic little cheap smartphone, Samsung J7 or OnePlus 3?", "text": "I'm about to a buy a phone as a gift for someone, the user is not so tech savvy and all, and uses the phone mostly for like facebook and web browsing and phone calls, nothing too intensive\n\nShould i go with the OnePlus 3 (or 3T whatever), or you think Samsung J7 will be enough?\nThe price difference here where i live is about 100 dollars difference (J7 is cheaper), so which one is worth it?", "created": 1488113957.0, "replies": [{"text": "Both are overkill for basic usage like that. Try to find a galaxy J3 or a Moto g4 play.", "created": 1488131413.0, "replies": []}]}, "5w29u3": {"title": "Help Me Replace My Nexus 5X", "text": "Hey Reddit,\n\nI recently had to get rid of my Nexus 5X because it literally stopped working. I had to get a phone temporarily so I have 12 days to return the LG X Power I bought at sprint earlier this afternoon.\n\nI'm looking to spend no more than $250 on a phone. \n\nOS: Android\n\nFingerprint Reader: Optional but preferred\n\nNFC: Optional\n\nLTE: Required\n\nColor: Black, optional but preferred.\n\nUSB: C, optional but preferred\n\nFast/Rapid Charge: Required", "created": 1487996027.0, "replies": [{"text": "What about the Moto g4 plus", "created": 1488066637.0, "replies": [{"text": "That looks promising. ", "created": 1488165147.0, "replies": []}]}, {"text": "Wait for Moto G5's release.", "created": 1488011406.0, "replies": [{"text": "Which is when? I have 12 days to get rid of this lg power", "created": 1488035310.0, "replies": [{"text": "It will be announced tomorrow in MWC, but can't say about its availability in your place.", "created": 1488036085.0, "replies": []}]}]}, {"text": "ZTE blade v8 pro is on sale right now for $199 at Newegg.", "created": 1488037855.0, "replies": [{"text": "Doesn't seem to sprint compatible.", "created": 1488038250.0, "replies": []}]}]}, "5vt3fc": {"title": "Wanna Switch Over to iOS But Some Queries Beforehand", "text": "**Country:**   India\n**Provider:**   Vodafone\n**Price Range:**   30000 INR- 60000 INR\n**Your TOP features in a phone are:**   \n**Anything we should know?:**    \n\n\nI will try to keep it short. I use a Pixel XL now, while I am very happy with the phone I still feel that I need more smoothness out of it, but its just not possible, as I believe this is the best Android has to offer. I am a smoothness freak anyway. And in long run I would like to use a phone where I won't be needing to reflash a firmware just to keep it running smoothly, which is the case with Android. Thus I wanna try iOS, but there are some things I need, so I am asking them below:\n\nTake that I will jailbreak the iPhone without even thinking twice, so queries and corresponding responses should base off of that.\n\n1- Is there any Call Recording app for iOS? Which wil record both sides, at good quality? I mean no nonsense apps. \n\n2- Can I use the iPhone and transfer files to it with the need of iTunes? I hate that thing.\n\n3- How reliable are the Google Apps on an iPhone? I use almost all google apps, from GMail, Youtube, Maps, Photos and all, are those reliable on iOS? I mean proper push notifications for GMail, accuracy on Google Maps and all, there?\n\n4- Is there a way to hide all apps from homescreen and push them to an app drawer or something? I don't like the wallpaper to be all covered up with some damned icons.\n\n5- I have checked the technical measurements and all on GSMA, and its pretty average, but how is the call quality on them iPhones? I am looking at the 6S specifically, probably might even go for 7 if I feel right, but no 3.5 mm is utterly stupid, so might skip that.\n\n6- Does Apple intentionally push updates which creep down an older version of iPhone and only keep the latest iteration smooth? Like I said, I won't be formatting my phone unless there is an absolute need.\n\nThat's all I think, would love to see some responses.\n\nThanks in advance.", "created": 1487883924.0, "replies": [{"text": "[deleted]", "created": 1495857098.0, "replies": [{"text": "[deleted]", "created": 1495857211.0, "replies": [{"text": "**Here's a sneak peek of [/r/PickAnAndroidForMe](https://np.reddit.com/r/PickAnAndroidForMe) using the [top posts](https://np.reddit.com/r/PickAnAndroidForMe/top/?sort=top&amp;t=year) of the year!**\n\n\\#1: [Ditching iOS? Read This and Post Here. \\[iPhone 7 Switching Megathread\\]](https://np.reddit.com/r/PickAnAndroidForMe/comments/51s0i9/ditching_ios_read_this_and_post_here_iphone_7/)  \n\\#2: [PSA: Don't waste your old phones. Use them.](https://np.reddit.com/r/PickAnAndroidForMe/comments/4r9whb/psa_dont_waste_your_old_phones_use_them/)  \n\\#3: [What should those disappointed by the Pixel buy?](https://np.reddit.com/r/PickAnAndroidForMe/comments/55v60f/what_should_those_disappointed_by_the_pixel_buy/)\n\n----\n^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/5lveo6/blacklist/)", "created": 1495857219.0, "replies": []}]}]}]}, "5vg2q1": {"title": "Time to move on from my Nexus 5", "text": "Hi,\n\nI had a Nexus 5 16 GB since release. I absolutely love this phone. Now my battery is slowly dying and in retrospect I should have gone with a 32 GB instead. I use my phone both for personal and professional matters. I am thinking of changing phone. I want it to be an Android for sure.The Pixel sure looks nice but I find too expensive, same for Galaxy S7. So what should I get? Should I wait for new model to come out so the actual become cheaper?", "created": 1487731044.0, "replies": [{"text": "[deleted]", "created": 1487766717.0, "replies": [{"text": "Posted on another sub and Heard about the OnePlus 3T. I juste ordered it.", "created": 1487818158.0, "replies": []}]}]}, "5vfic7": {"title": "Which phone would you choose? Moto G4 Plus or Honor 6X?", "text": "", "created": 1487724671.0, "replies": [{"text": "Moto. Huawei doesn't release full sources.", "created": 1487730036.0, "replies": []}]}, "5vbmj5": {"title": "Between iPhone 6s or Samsung Galaxy Edge S7", "text": "\nTOP features in a phone are: -Battery life -Clean interface -Little lag -headphone jack -large storage\n\nAnything we should know?: Currently have had a iPhone 5s for 4 years. Love the clean look of IOS but am willing to try out an android phone for other features. Just looking for any suggestions\n\n", "created": 1487685718.0, "replies": []}, "5v9l9j": {"title": "Need a decent phone for messaging and apps", "text": "**Country:**   Canada\n**Provider:**   Fido \n**Price Range:**   under 500$ CAD\n**Your TOP features in a phone are:**   handle many apps (especially navigation) and bluetooth\n**Anything we should know?:**    \n\nMy current iphone 5s now has a non-functioning home button, Im not loyal to apple. I would like a phone that could handle having a bunch of apps open without lagging. I dont care to spend too much on it, so i'm okay with it not being the snappiest gadget. \nI mostly use google maps, text message, bluetooth for music/car connect, chat apps and can survive with ~ 300 songs stored at a time. (if changing media on the phone is easy, I dont mind a small capacity) \nI dont watch videos and I hardly make phone calls.  \nDecent battery life is nice, though im often near a charging port anyway.  \n", "created": 1487651584.0, "replies": []}, "5uz25n": {"title": "iPhone SE or Sony Xperia X Compact?", "text": "**Country:**  US\n\n**Provider:**   T-Mobile\n\n**Price Range:**   Preferably $500 range but am open\n\n**Your TOP features in a phone are:**   Not looking for any features in particular but a nice camera (good quality front cam would be a bonus) and good battery life would be great.\n\n**Anything we should know?:**    Currently an iPhone user; never had an Android. I really would like a small phone (iPhone 5 size). I am open to other suggestions though,  as long as the phones are compact. I'm not super set on just the SE or the X Compact.\n\n", "created": 1487522475.0, "replies": [{"text": "iPhone SE user.\nHappy with general performance however there's an annoyance with its radio signal which dropping off quite often in some areas and can be choppy.\nStandby battery is superb and iOS is optimised though the screen is small however it is not annoying for browsing.\nStorage size is better with 64GB SE vs 32GB X Compact and performance wise is better too. \n\nNevertheless for some reasons I am also tempted to switch to X Compact but haven't found the right excuse yet lol.", "created": 1487599554.0, "replies": [{"text": "I got the SE :)", "created": 1487975241.0, "replies": []}]}]}, "5uc9w8": {"title": "Compact, mid-range android.", "text": "**Country:**   US\n\n**Provider:**   Verizon\n\n**Price Range:**   &lt; $400, prefer it to be as cheap as possible. I've come to terms with the fact that the phone will break or perform extremely poorly for me after 1 year, so I'm not gonna spend $800 :-)\n\n**Your TOP features in a phone are:**   Screen size and form factor are important. Close to some of the iPhones or the Pixel. Around a 5\" screen, not much bigger. I feel like 4.7\" is a size that appears on a few phones, that's okay too.\n\n**Anything we should know?:**    Fingerprint reader is neat but far from required. I'm kind of done w/ Motorola...I've had two and they have either gotten cracks or otherwise been rendered useless from very small drops while in cases.\n\nI'm unwilling to leave VZW, as much as I'm sure I'd love a One Plus or HTC One a9 or whatever.\n\nFar from necessary but if it's a good phone for tinkering, rooting, putting cyanogenmod on maybe...always a plus.\n\nLastly- I'm aware a generate or two older iPhone is probably everything I want outside of being Android...but I'd really prefer to stay Android.\n\nThanks :-)\n\n", "created": 1487214209.0, "replies": []}, "5u9mux": {"title": "Having trouble choosing from these phones. Any advice?", "text": "There's currently a \"Free Phone For Everyone\" Metro PCS deal that offers 12 phone choices. The deal is [here.](https://www.metropcs.com/free-for-all.html?icid=home|main|freeforall) \n\nI take tons of pictures so I'm looking for a phone with a great camera. I'm also looking for a phone with great battery life and a removal battery. Thanks so much!\n\n", "created": 1487186719.0, "replies": [{"text": "ZTE ZMAX Pro is the best of the bunch, but only available to those switching from another carrier.", "created": 1487207756.0, "replies": [{"text": "Thanks! Unfortunately I'm an existing customer. ", "created": 1487282009.0, "replies": [{"text": "In that case, I'd go with the LG Aristo.", "created": 1487285818.0, "replies": []}]}]}]}, "5u6fzg": {"title": "Switching from Nexus 5X", "text": "**Country:**   UK\n**Provider:**   Giffgaff\n**Price Range:**   Up to 500£\n**Your TOP features in a phone are:**   Camera, battery life, being able to run more than just one app at a time (eg. browser with 3-4 tabs + whatsapp + reddit + messenger + spotify without constant app reloading)\n**Anything we should know?:**    Bought Nexus 5X mainly due to camera and I love it. Battery life sucks however, moreover phone constantly reloads apps which drives me insane as half of them do not persist app state. I need a \"seamless\" phone. Won't be gaming at all, just a daily driver.\n\n", "created": 1487150727.0, "replies": [{"text": "Moto z play, honor 8, or OnePlus 3T.", "created": 1487208257.0, "replies": []}, {"text": "I switched over from the Nexus 5x to a OnePlus 3T and haven't looked back. Battery is amazing and apps don't restart when switch between them. Camera is okay.", "created": 1488412721.0, "replies": []}]}, "5tqphp": {"title": "Simple Cell Phone", "text": "Trying to help out a friend who needs to source cell phones for working on a secure site. Cannot have any internet connectivity or camera. The closest thing to a device that can simply make phone calls (on a Canadian carrier) and hopefully be purchased quickly. Any ideas?", "created": 1486957609.0, "replies": []}, "5tn0wz": {"title": "Huawei P9 lite vs Lenovo K6 vs Xiaomi Mi 5", "text": "I'm trying to decide among these 3 phones. The xiaomi is a little bit too pricy but I'm wondering if it's worth the difference in price.\n\nUse case: I want a decent camera, fluid UI, want to last at least 3 years if not more.\n\nPossibly: Support for custom ROM for the future when the phone will not be supported any more. I don't want to play with ROM if not required. Root.\n\n**Country:**   Italy\n**Provider:**   \n**Price Range:**   ~200 Euros\n**Your TOP features in a phone are:**   Should be fluid\n**Anything we should know?:**    \n\n", "created": 1486923631.0, "replies": []}, "5thtdx": {"title": "Help Which phone would you Pick? Sony Xperia X , Samsung Galaxy s6, htc 10 or Oneplus 3t?", "text": "So I'm looking for a decent smart phone which will last a while. I live in New Zealand and at the moment these are the prices of the sub $1000 category.\n\nWhich phone would you Pick? and why? Sony Xperia X ($647.00), Samsung Galaxy s6 32gb ($699.00), htc 10 ($800) or Oneplus 3t 64gb ($800)\n\nHELP US HELP YOU Please include: Country: New Zealand Carrier: Spark Price: $500-$850 off contract Size Preference: 4.7-5.5 What will it be used for: Photography, Streaming ,Media Preferred brands: I don't like Huewei Phones and have had problems with other china phones like meizu and xiamoi and zte Other: NFC (would be nice) Storage space 32gb +", "created": 1486850419.0, "replies": [{"text": "They are different \"animals\". I think the real battle here is between HTC10 and OP 3T.\n\nThings in favor of HTC10:\n\n- smaller, lighter\n- dual speakers\n- VERY good sound on headphones\n- software (I like the Sense)\n- overall experience\n- much universal Quick Charge (it works with any Qualcomm approved charger)\n\n\nThings in favor of OP 3T:\n\n- bigger AMOLED display (5.5 vs 5.2)\n- dual sim\n- bigger memory and RAM (64Gb small variant and 6Gb vs 4Gb)\n- better processor (SD 821 vs SD 820)\n- bigger battery\n- bigger community\n\nWhat I dont like about OP 3T is their proprietary fast charge (Dash Charge) technology. You cannot use another quick charger from an old phone.\n", "created": 1486916441.0, "replies": []}]}, "5sjwp8": {"title": "Replacing a CM13 Note 4 -- Seeking other Android Device", "text": "**Country:**   US\n**Provider:**   Sprint\n**Price Range:**   $600 or less\n**Your TOP features in a phone are:** Screen Size,   \n**Anything we should know?:**    \n\nI'm a heavy user of my devices--lately I've been pushing them with mobile games a bit. So, battery is a nice to have, but I do carry around a 10,000 mAh battery pack for all my mobile devices. \n\nBattery aside, more importantly is something that I can put a custom ROM onto. A custom ROM that can support unlocked hotspot tethering. I have unlimited data through my carrier (but the bucket for tethering is 2GB --so I want to tap the unlimited mobile data resource).\n\nI like my storage space, so something that has an SD card slot.\n\nI prefer larger displays. The Note 4's screen size (5.7 in) feels about right. \n\nFor funsies, I play Pokemon Go on occasion. I do like rooting my devices, so something where I can finaggle workaroudns for the root on that. I have it working on my current CM setup, so I imagine I could mimic it on a new one.\n\n\nI don't trust Motorola and this Samsung Note has left me fed up. I hear good things about LG, but am uncertain.", "created": 1486449708.0, "replies": []}, "5s70np": {"title": "Need phone recommendation from Malaysia", "text": "**Country:**   Malaysia\n**Provider:**   webe and DiGi atm\n**Price Range:**  Around RM2500&lt; \n**Your TOP features in a phone are:**   Good specs, battery\n**Anything we should know?:**    I'm from Malaysia so there may be charges for importing a phone\n\n", "created": 1486295499.0, "replies": []}, "5s5j27": {"title": "Old Moto X's battery is dying looking for a budget replacement.", "text": "**Country:**   USA\n\n**Provider:**   AT&amp;T\n\n**Price Range:**   Looking to spend 100-200$ on Swappa\n\n**Your TOP features in a phone are:**   I just want a phone that works good. I don't use it for games mostly internet and texting, phone calls. Maybe some remote access to my pcs.  Stream spotify in my car. \n\n**Anything we should know?:**    I don't know jack shit about phones. I do want to stick with Android though. \n\n", "created": 1486267708.0, "replies": []}, "5quy8x": {"title": "Pixel (non-XL) vs 3T vs S7 Edge", "text": "If I could get any of these for approximately the same price (pixel 30 dollars more than 3T, and S7 Edge 70 dollars more than 3T) which of these would be best.\n\nI dont play any games, mainly just browse the web (4-5h a day), use FB messenger, snapchat, text. I'd probably say battery life and camera quickness are the 2 most important things.\n\nStorage: 32 gb Pixel, 64 gb 3T, 32gb S7 Edge\n\nShould note that the S7 edge would be the exynos variant.\n\nThanks\n", "created": 1485711710.0, "replies": [{"text": "Pixel of course. Then 3T. Pixel has a better camera and unlimited video/photo storage.", "created": 1485998726.0, "replies": []}]}, "5qnblk": {"title": "International Travel Smartphone", "text": "*thailand, vietnam, europe, usa:**   \n**Provider:**   \n**100-400:**   \n**apps, camera:**   \n\nHelp! I'm mid-travel and should have figured this stuff out, but oh well. I'm looking for a smartphone that will travel internationally but that I can then use when I bring back to the states (if theres something that would work with tmobil back in the states that would be great!). I'll probably try to buy the phone in bangkok when I get there in two weeks as i'm currently in southern india. i'd like something with a decent camera (currently have an iphone 5s) but beyond that I just use basic apps (maps, tinder, news, whatever). Would probably like to spend under $300 but I tend to throw my phones in a destruction-proof case and keep them for a long time so I want something good. thanks!\n\n", "created": 1485605808.0, "replies": [{"text": "Nexus 5X, or even the 6P if you can get it at a good price. They support every carrier in the US and with Project Fi, it's made to travel without having to switch provider's in 160+ countries. Factory unlocked so just pop in a sim and you should be good.", "created": 1485625045.0, "replies": [{"text": "hey thank you for the advice - however it looks like these phones are discontinued? any other recommendation? thank you!", "created": 1485668389.0, "replies": []}]}]}, "5q3k05": {"title": "Best camera android phone under $300", "text": "Few options would be greatly appreciated. I want to get a phone for my gf and she really only cares about the camera. \n\nI was looking at honor 5x but I'm not sure.. \nEdit:\nNow considering the following, Huawei p9 lite / p8 / honor 6 / honor 7 lite. Or galaxy a5 / j7\n\nI can get all of these for around $270. Which would be your pick? ", "created": 1485355774.0, "replies": []}, "85bttq": {"title": "finding a new phone- haven't bought one in years!", "text": "hi all,\n\nmy husband is quitting his job soon. both of us have had work-provided phones for the last 6 years or so now, and as a result we have no idea what the landscape is for getting phones. i am used to walking into a sprint store (or verizon or whatever) and getting a free cheapish phone with a monthly plan. as i am reading now, you need to pick verizon or sprint, the phones are not transferrable, you no longer get new phones when you sign up.... etc. \n\nsoooo\n\ni think it would be good at first for us to get a pay as you go cheaper plan, just because its definitely possible that he might get a new job that also provides a phone and then we won't even need this one. (edit: or on the flip side, if this becomes his primary phone, i think he would want to go with sprint, then? something about the brand name that seems like it'll work better? so we would like the option to transfer to sprint from a prepaid if needed) he would like to keep with sprint, we have been using sprint for years now (with work) and have always had good service. \n\nis it better to buy a phone online/somewhere else (ie. not at a sprint store) or is it better to get the \"deals\" that sprint would give us if we buy a phone with them? \n\nany insight would be appreciated! thanks!", "created": 1521386333.0, "replies": [{"text": "I would check out the nocontract subreddit. Lots of good info on there about plans. As far as phones go, I would check out no contract phones. For that, I reccomend phonearena. ", "created": 1521408299.0, "replies": []}]}, "85g1to": {"title": "One or the other...", "text": "So I'm trying to decide between an iPhone 6s and a Samsung galaxy note 4 I've seen them both used for about the same price and I can't really decide. I like the pen aspect of the note 4 but I like the iPhone's more updated system. Which one should I pick?", "created": 1521424659.0, "replies": []}}