[{"title": "Overall love", "rating": 5.0, "links": ["https://forum.xda-developers.com/oneplus-5/review/overall-love-t3646086", "https://forum.xda-developers.com/oneplus-5/review/overall-love-t3646086/page2", "https://forum.xda-developers.com/oneplus-5/review/overall-love-t3646086/page3", "https://forum.xda-developers.com/oneplus-5/review/overall-love-t3646086/page7"], "threads": [{"text": "I don't feel as though I'm being asked to make unacceptable compromises for a very competitively-priced phone that has a positively screaming performance. I came into this relationship with eyes wide open (and I don't need a DSLR-quality phone camera, either). So far, I couldn't be happier with the OnePlus 5.", "time": "28th July 2017, 12:10 AM", "postID": "post73198297", "replies": []}, {"text": "money well spent! Love the performance and battery life", "time": "8th August 2017, 09:53 AM", "postID": "post73326374", "replies": []}, {"text": "Awesome smart phone", "time": "14th August 2017, 10:41 AM", "postID": "post73396264", "replies": []}, {"text": "Best smart phone I've ever purchased.", "time": "14th August 2017, 12:24 PM", "postID": "post73397156", "replies": []}, {"text": "Got frustrated with the Nexus 6p after a year and 10 months, so I decided to buy a one plus 5.  Battery life is exceptional and overall performance makes using the phone a joy.  R.I.P. Nexus 6P.  Really liking the device so far.", "time": "16th August 2017, 03:15 AM", "postID": "post73417169", "replies": [{"text": "hello, \n\r\nAs a nexus 6p owner: how does the OP5 camera compares to the Nexus 6p? wich one is better in your opinion?\n\r\nthx in advance,", "time": "23rd August 2017, 12:18 PM", "postID": "post73508872", "replies": [{"text": "The one plus is the better camera, by some way. Don't get me wrong the 6P was a great phone, first and only Huawei I've ever had, my sister is still using it. \n\nAs ois is absent from both devices you're simply comparing the actual lenses and in this regard the one plus 5 smokes most phones.  It's really just ois that makes the difference , stability on EIS which the one plus does have just doesn't match up to ois. \n\nBut unless you're recording a video or trying to get a perfect image whilst zooming you can live without it. \n\nEven the iPhone 7 is without ois.", "time": "23rd August 2017, 12:29 PM", "postID": "post73508983", "replies": [{"text": "thx a bunch!", "time": "23rd August 2017, 12:31 PM", "postID": "post73509009", "replies": [{"text": "No worries mate.  The one plus is a beast man, it surprised me and I'm quite a critic.", "time": "23rd August 2017, 12:48 PM", "postID": "post73509187", "replies": []}]}]}]}]}, {"text": "Liking my OP5 so much. I can squeeze the battery to the maximum and get many screen time hours. The camera takes really good pics (not like an S8 tough, but pretty decent) and everyone can forget about the lag. As I said, really happy!", "time": "16th August 2017, 10:03 AM", "postID": "post73419846", "replies": []}, {"text": "Too soon to say, but it could end up being the best phone I've owned so far. 2 major things holding me back from that decision are the inconsistent battery life and camera performance.", "time": "16th August 2017, 12:04 PM", "postID": "post73421022", "replies": []}, {"text": "I can def say i've grown to like the device. The camera bugged me out at first but its getting better. Coming from a S8+, I missed the speed of stock android. touchwiz is beyond laggy. The only thing i can say that bugs me is the phone not being waterproof. And i wouldve preferred not having a physically home button.", "time": "16th August 2017, 11:48 PM", "postID": "post73428310", "replies": []}, {"text": "Ok so I've received my phone week ago after using it i have to admit that the phone is literally a beast! If you are looking for a phone for \"The fastest\" this is one you want in your hand. \r\nI am lucky that my op5 is not affected by the \"jelly effect\". The things i loved \r\n*Speaker ( almost like stereo.., actually i am a music person i listen to music most of the time i don't really like ear/head phones) \r\n*Speed (as i said the beast in performance. I have used galaxy s8 but don't really like the TouchWiz! Tbh TouchWiz itself feels laggy!)\n\r\n*Display ( i don't really care for qhd or anything so for me fhd is good for me i don't use vr.. if you are a frequent user of vr you may not like the display)\n\r\n*Camera ( ok i have to admit not the best camera phone in the market but at the sametime not the worst. I don't really like the low light pictures until now thanks to gcamera hdr+ so now i am very happy in the camera department.) \n\r\n*Battery ( i am getting 6.5hr+ sot. I am a music lover told you, my 4g volte + data always turned on , i use Bluetooth to connect and listen music, 3 hrs average Calling! Standby time is very good so i am very much satisfied)\n\r\nThings i hate \r\nI dont like the microphone for the Calls it captures more background sound not like the op3! Op3 was good! \n\r\nVibration motor! Still not that much improvement! Love the iPhone vibration though! \n\r\nNot water proof!", "time": "17th August 2017, 01:36 PM", "postID": "post73434566", "replies": []}, {"text": "Love the phone. Solid 4.5/5.\n\r\nPrior to this, I utilized a Samsung Note 3 and the performance is night and day.\n\r\nThis is literally the fastest phone I've used, it runs smoother than my friends S8. The battery life is amazing as well. I'd give the phone a 5/5 if it were waterproof and if it had OIS. The waterproofing isn't necessary but I live in an area where it rains quite frequently, so it would have been nice. The camera is great in regular light and the video recording is good (other than the fact that is clips the edges of the videos in order to electronically stabilize it).\n\r\nI'd love for it to be priced comparably to the OP3 but it is still a good phone nonetheless and hundreds of dollars cheaper than the competition.", "time": "18th August 2017, 05:35 AM", "postID": "post73442496", "replies": []}, {"text": "I'm in love with this phone, i come from an S7 edge, the interface is so much cleaner, no duplicate app, no lag, this phone is slightly larger and harder tu use in a hand but i prefer the OP5 material, the glass is too slippery and become oily. The camera of the s7 edge was a little bit better in low light, but in daylight the photo looks the same and the zoom is pretty fun to use.\n\r\nI have the soft gold version and it's really gorgeous", "time": "18th August 2017, 08:17 AM", "postID": "post73443499", "replies": []}, {"text": "voted 4, simply because OIS is missing, coming from the HTC 10 it's a major change and not in a positive way, the camera isn't awful by any means but OIS should have been mandatory, it's crazy that it wasn't especially seeing as they had made such noise about it.\n\nOther than that, the phone is a monster, primarily due to the snapdragon 835, it can play pretty much any game  / emulator, even ones previously unplayable, ie: PPSSPP and Gamecube games on dolphin.\n\nWould also have been nice to see waterproofing (even though it's already been tested to have some form of protection)\n\noverall i'm happy, it's just OIS not being there. Shame.", "time": "18th August 2017, 11:54 AM", "postID": "post73445414", "replies": []}, {"text": "It was the best \"shut up and take my money\" I have ever faced. The feeling off the touch is good, materials are premium, extremely fast OS and touch reaction etc..\r\nOfc, I felt in love with the dash charge! Ok, is not as fast as oneplus claims to be .. but is really fast! \r\nAh! I was about to forget .. do not let your GF take a selfie using the front camera! She will have your phone occupied for the rest of its life! \n\r\nHere is my oneplus 5 referral link (EU),  in case someone wants a -20e discount on accessories during his oneplus 5 buy.", "time": "25th August 2017, 08:31 AM", "postID": "post73532589", "replies": []}, {"text": "I am so anxious... I just bought the OPS 5 128gb... My friend is bringing to me on Sep 22nd....", "time": "25th August 2017, 03:47 PM", "postID": "post73537072", "replies": []}, {"text": "Had an Xiaomi Mi 5, absolutely fantastic in every way. But the screen was too small for me. Then changed to the Mi s plus, that's a perfect one! But I sold it and bought the op5, the only issue is the portrait mode, the Mi 5s plus was better. Despite that, it's really the best smartphone for now.", "time": "27th August 2017, 06:48 PM", "postID": "post73562761", "replies": []}, {"text": "Hey guys, I'm planning to buy the Oneplus 5. But I have some concerns regarding the audio jack performance. How does it compares to the Xiaomi Redmi Note 3 (Snapdragon). Is it better in terms of overall loudness, soundstage and quality. Is it noticeably better? I find the audio jack performance of the RN3 to be Decent.", "time": "28th August 2017, 03:49 PM", "postID": "post73572799", "replies": []}, {"text": "its been maybe 2 weeks now with my OP5 and Im very happy with it... previous phone was a Nexus 6P, it was a great phone but the constant signal lost (know problem with 6P) drove me to buy the OP5.  What took me a sometime to get use too was the buttons are opposite sides and the call answering is opposite motion. But 2 weeks later im getting use to that now. Im very happy with the camera, mostly use the pictures too share with family/friends on social media or by text. With that camera is just fine, quality is great for a camera phone.  For the price 128GB version you get alot for your money, and selling my old phone I made out pretty well with buying the OP5. I dont buy phones for the camera, but if some may ask how it compares to my old Nexus 6P again I will say camera very good. I dont have to worry about running out of space or any bloatware. The setup was very easy it asked me too hold both phones back to one another and it transferred stuff from my 6p to my OP5 once that finished and I completed my OP5 setup too my surprise most of my stuff was on OP5 like my wallpaper and lockscreen.  Everything works like its suppose too calls are nice and clear, TMO wifi calling perfect, GPS works, Android pay perfect, data speeds on TMO network are just fine, tethering works, battery is very good and I can connect it to mac just like my old phone.  Lastly the bluetooth works great, connects to my car with no problem and connects to my headphones and sounds great using the option aptX HD.", "time": "30th August 2017, 02:53 PM", "postID": "post73597504", "replies": []}, {"text": "It's the best siteam I've been to hands down", "time": "4th September 2017, 02:15 PM", "postID": "post73660521", "replies": []}, {"text": "I love my s5", "time": "5th September 2017, 12:46 PM", "postID": "post73672984", "replies": []}, {"text": "Hello Guys,\nQuery : Coming from Moto X Pure , i know i will miss stereo speakers and QHD screen(not that much).\nI am planning to buy Oneplus 5 (India) , seems the phone is grt but just worried about the Jelly effect. How big this is , as they say(Opo Inida) if you want to return ur device for Jelly effect we will not accept. So once brought i have to live with Jelly effect (if any).\nThe slow mo video showing the problem in you tube looks scary , but how does it feel in real use ? \nWould appreciate any help", "time": "5th September 2017, 04:10 PM", "postID": "post73675528", "replies": []}, {"text": "from nexus 4 to moto x play back to nexus 4, ordered mine yesterday, I hope I will like it.\r\nI just wish they traded the secondary camera for waterproofness", "time": "5th September 2017, 07:09 PM", "postID": "post73677907", "replies": []}, {"text": "It's one of the best phone. Great configuration and features.", "time": "7th September 2017, 11:44 AM", "postID": "post73700046", "replies": []}, {"text": "It's better if it's a waterproof. I know they minimilistic waterproof qualities but it would have been better if they have added that.", "time": "11th September 2017, 12:38 PM", "postID": "post73750988", "replies": [{"text": "That's the only thing that i don't like about the phone, no waterproofing", "time": "11th September 2017, 07:42 PM", "postID": "post73755894", "replies": []}]}, {"text": "No doubt at all!! Top pick smartphone in my opinion.", "time": "12th September 2017, 05:02 PM", "postID": "post73766473", "replies": []}, {"text": "Loving the battery, the speed is unrivaled, it does everything you throw at it, amazing audio quality on the MSM8998, and the screen is pretty good with colours. The only bigger issue si the jelly scrolling, which I've gotten slightly more used to, but it's still jarring.", "time": "12th September 2017, 06:18 PM", "postID": "post73767359", "replies": []}, {"text": "I had two random reboots, that I mainly explain on the fact that the device was tighlty pressed between my and some heavy object (a good old wooden piano). So I'm pretty sure it was caused by the fact that the Power button was pressed and held for a few seconds in my pocket.\n\r\nFor the love factor, I was slightly sad to see how bad the picture quality was compared to my older Nexus 5X. I'm not saying the pictures are terrible, but the lack of stabilization and the overall quality of the pictures coming from my 5X are still better than my Pro Mode pictures from my OP5. Also, night or low light is a pain and pictures are terrible. Then again, I'm an enthusiast photographer, so it's probably good enough for most people.\n\r\nI also miss the instant updates coming from Google.\n\r\n Cost me a total of $800 CAD taking shipping, taxes and a case and the glass screen protector from OnePlus into account. The 5X cost me $650 brand new.\n\r\nIn all other fields I just love the device.", "time": "28th November 2017, 06:26 PM", "postID": "post74670071", "replies": []}, {"text": "I love this phone.. since 4 months im using this beast and seems i cant tell how love that phone you have to use it first.. i specially loving fingerprint it looks like there is no lock on phone i mean you cant see it its fast like unlocked \"lockscreen\" and camera is pretty enough for me capturing really good pictures.. i can suggest Oneplus 5 to everyone who want fast stable phone.. and if someone still have doubts about jelly effect let me tell you something.. i was like u really i was have doubts and really hard doubts actually i just wanted a good phone like everyone who spent 500 bucks so after 1 week i guess maybe 3 days i dont know you cant see JELLY EFFECT there is no jelly effect i cant recognize it if i dont look specially to it so you have to be stupid if you want to look it.. End of word im loving this superb crazy maniac awesome phone thanks everyone  and im not paid for that words", "time": "21st December 2017, 03:34 PM", "postID": "post74919611", "replies": []}, {"text": "Selling mine if anyone wants it!", "time": "22nd December 2017, 06:58 PM", "postID": "post74932137", "replies": []}]}, {"title": "Community development strength", "rating": 5.0, "links": ["https://forum.xda-developers.com/oneplus-5/review/community-development-strength-t3646087"], "threads": [{"text": "If someone can also port Sailfish OS(A different OS with android support is also something unique), flymeOS(love the themes in flymeOS) and other custom OS, it will be good for the community as well as many", "time": "15th February 2018, 08:23 PM", "postID": "post75581593", "replies": []}]}, {"title": "Overall speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/oneplus-5/review/overall-speed-t3646088", "https://forum.xda-developers.com/oneplus-5/review/overall-speed-t3646088/page2"], "threads": [{"text": "My old phone which I had to replace as it got smashed had a Qualcomm MSM8996 Snapdragon 821 and I though that was fast until I got a OnePlus+ 5 which is in another league.", "time": "29th July 2017, 08:00 PM", "postID": "post73219248", "replies": []}, {"text": "Well, i am impressed by the overall speed and snapiness (coming from an exynos galaxy s7).\n\nThis thing can handle much without overheating! (A nightmare for galaxy s users)", "time": "2nd August 2017, 05:30 PM", "postID": "post73264247", "replies": [{"text": "Thanks for sharing !", "time": "1st October 2017, 05:05 PM", "postID": "post73999194", "replies": []}]}, {"text": "I simply love my experience so far with my OP5.. It is fluid, fast especially considering Android, bright screen, lightning fingerprint.. Coming from s7 edge only 2 months old which was so laggy after installing all the apps.. Hope Android O and other releases allows us to stay smooth and save battery, I may not change my phone for a year (can't say for longer )", "time": "4th August 2017, 09:10 PM", "postID": "post73289730", "replies": []}, {"text": "for me the backups in twrp and titanium are noticeably faster as is a normal boot.  i have yet to get rid of encryption but i think that will add further performance increase.", "time": "5th August 2017, 05:58 AM", "postID": "post73292700", "replies": []}, {"text": "Looks like i am the only one from \"humble\" beginnings here. 😂😂. I had a A5 2015 , i thought it was good and not that slow , i was gonna buy s8+ but then i saw op5 and omg its soooo much faster than a5 i am glad i bought oneplus .", "time": "5th August 2017, 03:07 PM", "postID": "post73296782", "replies": []}, {"text": "I had a Nexus 6 before with overlocked CPU custom Kernel and lineage os on the board, oneplus 5 everything  stock, no root, is insanely faster and the battery is much better, i lovee this phone", "time": "6th August 2017, 04:00 PM", "postID": "post73307552", "replies": []}, {"text": "Awesome", "time": "14th August 2017, 10:41 AM", "postID": "post73396268", "replies": []}, {"text": "sounds nice", "time": "30th September 2017, 12:14 PM", "postID": "post73985283", "replies": []}, {"text": "Compared to all the flagships I have ever had my hands on, the OnePlus 5 is the best of all, HTC U11 is very simillar in terms of overall performance.", "time": "2nd October 2017, 08:36 PM", "postID": "post74013150", "replies": []}, {"text": "8gb RAM version is quick. Really quick.", "time": "25th October 2017, 03:17 PM", "postID": "post74290450", "replies": []}, {"text": "I'd love to try using one plus 5 which is said to have great speed. However, I am still confused to use it, while I still have galaxy s8 phones, which memilliki OS and spare parts are no less far away with others.\n\n\r\nThank you,\r\npolarin.co.id", "time": "16th November 2017, 08:06 AM", "postID": "post74531534", "replies": []}, {"text": "I m using 6gb version and till date I haven't faced any hiccup of performance lagness etc nothing", "time": "23rd November 2017, 10:53 AM", "postID": "post74608861", "replies": []}, {"text": "This is the phone I would buy again n again irrespective of its successor Oneplus 5T.", "time": "4th February 2018, 09:22 PM", "postID": "post75448433", "replies": []}]}, {"title": "App launch speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/oneplus-5/review/app-launch-speed-t3646089"], "threads": [{"text": "Oxygen OS has shown improvement consistently over time!! App launching has never been faster.", "time": "16th October 2017, 04:34 PM", "postID": "post74180506", "replies": []}]}, {"title": "Multitasking/RAM", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-5/review/multitasking-ram-t3646090"], "threads": []}, {"title": "Scrolling smoothness", "rating": 4.0, "links": ["https://forum.xda-developers.com/oneplus-5/review/scrolling-smoothness-t3646091", "https://forum.xda-developers.com/oneplus-5/review/scrolling-smoothness-t3646091/page2", "https://forum.xda-developers.com/oneplus-5/review/scrolling-smoothness-t3646091/page3", "https://forum.xda-developers.com/oneplus-5/review/scrolling-smoothness-t3646091/page4"], "threads": [{"text": "I see no 'jelly screen'. Then again, I'm an old guy and I rely pretty firmly upon my progressive lenses.", "time": "28th July 2017, 12:12 AM", "postID": "post73198308", "replies": []}, {"text": "None of the jelly problems with my OnePlus+ 5 running the latest OS", "time": "29th July 2017, 08:03 PM", "postID": "post73219272", "replies": []}, {"text": "Scrolling smoothness is really nice on the 5. If you want a really smooth experience, change your CPU governors to OnDemand from interactive. The difference is very noticeable.", "time": "29th July 2017, 10:28 PM", "postID": "post73220504", "replies": [{"text": "can we do that on the stock kernel?", "time": "29th July 2017, 11:42 PM", "postID": "post73221037", "replies": []}]}, {"text": "Yep. I use the ex kernel manager and on stock rom with stock kernel. I have like 5 or so options for governor.", "time": "30th July 2017, 12:37 AM", "postID": "post73221325", "replies": []}, {"text": "One thing I've noticed with these last few builds.. if you have an app in app locker, there's frame drops and stutters if you scroll through in your recents..", "time": "19th August 2017, 04:41 AM", "postID": "post73453803", "replies": []}, {"text": "I've found same event. Then i chose to adjust  animation scale to 0.5 or 0.  Which makes it much better.", "time": "20th August 2017, 12:13 AM", "postID": "post73463678", "replies": []}, {"text": "No changes to animation speed, no changes to kernel or governor and have seen no jelly effect, this only affects a very small number of devices, I've had two Oneplus devices, bought one on launch at midnight then lost it four days later, ordered another and got it three days later, no jelly effect whatsoever.\n\nThe speed of this phone is insane.\n\nApps can lag that correct but only because of the app or the content, so for example a half loaded chrome page can lag, that has nothing to do with the phone at all my PC which is worth over £4000 can lag on webpages if they haven't loaded properly, it's not the hardware.", "time": "22nd August 2017, 09:03 AM", "postID": "post73492597", "replies": []}, {"text": "The jelly effect is there in all phones...just some people dont notice it", "time": "22nd August 2017, 10:12 AM", "postID": "post73493215", "replies": [{"text": "Yea its not mate. I'm not blind. I have perfect vision. Its not visible on either of my phones", "time": "23rd August 2017, 11:29 PM", "postID": "post73516443", "replies": [{"text": "Every op5 has the screen panel upside down...", "time": "23rd August 2017, 11:47 PM", "postID": "post73516583", "replies": [{"text": "Makes no difference, the jelly effect is not present on every device, assuming that everyone has a problem seeing it because you can on your device does not mean that they have defective devices! \n\r\nI've had two 1+5 devices and neither exhibited this issue, I tested it thoroughly, nothing is present, i recorded it and played it back in slow motion, comparable to any previous device i've ever had it's literally the same.\n\r\nI did a video next to my HTC, there is no jelly.\n\r\nPeriod.", "time": "24th August 2017, 08:45 AM", "postID": "post73520115", "replies": [{"text": "If yours is not defected you should try looking for the effect with your phone upside down if you see the jelly effect upside down its not defective but if you don't it is", "time": "24th August 2017, 03:53 PM", "postID": "post73524293", "replies": [{"text": "hahah mate you're missing the point, why would i hold my phone upside down? I appreciate once you've seen your phone has a defect it's impossible to ignore, i personally would make something up and send the bugger back until i got a phone that i couldn't notice it on, it would drive me mental, i don't care if they don't think it's an issue, it's bad if this many people have seen it.\n\r\nAll i'm saying is, I don't have this issue, check my video if you want or provide me with a fool proof test and i'll do it now, if it's me overlooking it then it's something so insignificant that i dont' actually mind, but maybe i would if i saw it.\n\r\nSorry i sound like i'm being a dick i'm not mate, but it's not present on either phone i've had, i'm sorry that yours is, funny thing is too a mate of mine just got one and he can't see it either, he mentioned that he did one time when scrolling on the web, but couldn't replicate it? Not sure if it's lag or something?", "time": "24th August 2017, 04:52 PM", "postID": "post73525110", "replies": []}]}, {"text": "Welp, not exactly.\n\nWhy? Because its not a hardware flaw, its a \"design choice\". The Display (of every current OP5 out there right now) is mounted upside down, meaning the direction the phone refreshes its display is from the bottom towards the top. \nWhile this is not a defect or problem from a technical point of view, it can still be perceived by a lot of people, since our brains are usually expecting the panel to refresh from the top towards the bottom. The Jelly comes due to the panel not updating all pixels at once but by line after line instead.. our brain gets used to the bottom of the screen beeing updated later and simply ignores it (very rough explanation but im missing the needed vocab here).. the screen refreshing towards the top the messes with some peoples perception, therefore they notice the \"Jelly\" aka the lines refreshing last at the top..\n\nThis issue is purely caused by our brain expecting the panel to refresh from a different direction, so its simply a matter of getting used to it. I had headaches when using the phone in the first week or so, now I barely notice the Jelly, if at all. \nSome, like me, will notice it instantly at first, others might never (Just like the discussions over frame rates, input lag and so on  ). There are several factors to consider, everyone has a different sensitivity towards stuff like this and in the end, remember, its no hardware flaw, its a design choice and technically present on every OP5.\nUnless they decide to either change the way the display refreshes within the Driver or Display Controller (well, that would actually be some serious work and would need cooperation with Samsung due to them producing the Displays and the Drivers, if its possible at all - again, several dependencies here) or change the direction of the screen in a later model, the \"Jelly - Issue\" will consist.\n\nBut hey, you are right in your other post, if you dont see it, be glad about it and dont bother to start looking for the Issue, no point to try to search for flaws that you didnt have for now, be happy with your phone \n\nJust trying to clear up some of the confusion \n\nYet, this shouldnt be the topic of this thread, since this is about Scrolling smoothness, which has nothing to do with the Jelly Effect....\n\n---Back to topic---\n\nFor me, it hasnt been the smoothest experience to be honest.. while the phone is crazy fast, the overall handling feels very jittery.. Lots of dropped frames, way more than on my Nexus 5 running MIUI.. My N5  and my iPhone 6 feel so much smoother..\n\nMight have to mess with custom kernels and so on a bit more, overall it at least feels smoother than an S8 tho", "time": "25th August 2017, 09:34 PM", "postID": "post73540914", "replies": [{"text": "Yep I do understand how the jelly effect happens, and I understand that \"some people\" have this gift of being able to see it whilst everyone else \"me\" are left thinking the world has gone mad.\n\nI've honestly put my two cents in here so many times and it's fallen on deaf ears by the sounds of things so I'm going to leave it, I don't have this effect on my phone, not did I on my previous oneplus five, I have video recordings of the screen in use and this jelly effect does not present itself, I'm sure that with video slowed down even me with my eyes could see it ? \n\nEven if all that were true, if I have to be watching things in slow Mo to see them then I think it's safe to say that it's something that I don't have to worry about.\n\nI also personally don't have lags and glitches on my device, I've also owned more devices than the average shop so i do have a basis for comparison, not only that but I have an unlimited phone supply partly due to where I work, comparing my phone side by side with any top tier device yields no other reason to believe anything other than what I've just written and that's not just me that's my work colleagues seeing the same.\n\nAppreciate that yourself and others see this issue probably more than I. \n\nIf you have a fool proof way of me testing my device then please let me know and I'll check, I'll record it and I'll apologise profusely if its present.", "time": "26th August 2017, 02:17 AM", "postID": "post73542769", "replies": []}]}]}]}]}]}, {"text": "I haven't notice any of the \"jelly effects\" ..ok I havent recorded my screen and play the exported video in -x16 speed to check it either..", "time": "25th August 2017, 08:22 AM", "postID": "post73532498", "replies": []}, {"text": "People are way to focused on the jelly here, I really don't mind it.\nWhat is worse for me is the stuttering. But it's hard to know if it's only me or not as nobody is discussing this, just discussing the jelly.\nFor me I get a weird stutter at the end of a lot of scrolls, happens more on small scrolls or flings, as it's slowing down I get a little stutter, especially noticeable in the likes of Instagram or YouTube or certain chrome pages like this (xda)", "time": "22nd October 2017, 11:28 PM", "postID": "post74258607", "replies": [{"text": "Same here bro, jelly scrolling is ignored by eyes after some time but stuttering is clearly visible, especially scrolling webpages in chrome.", "time": "31st October 2017, 09:51 AM", "postID": "post74355667", "replies": []}]}, {"text": "OK, here I recorded a video of the problem with stuttering scroll I'm talking about.\nIts really annoying and mainly only happens on small things, and worst app I have noticed for it so far is instagram. Conservative governor helps a little bit but its still bad.\nhttps://www.youtube.com/watch?v=_PCeofCYUek\nhttps://www.youtube.com/watch?v=_PCeofCYUek?autoplay=0&origin=https://forum.xda-developers.com\"\r\n  frameborder=\"0\">", "time": "6th November 2017, 04:19 PM", "postID": "post74426164", "replies": []}, {"text": "Yup I can see what you talking about, the funny thing is that I don't have that stuttering in my device... By the way Conservative governor will not help, you should use Interactive or Ondemand to improve smoothness.\nI'm on OOS 4.5.14 + Flash Kernel", "time": "7th November 2017, 06:37 AM", "postID": "post74432778", "replies": [{"text": "I'm actually about to try flash kernel right now, hopefully this will help.\r\nSo you're saying if you give it small scrolls like I'm doing in the video it doesn't stutter on yours? That's strange if it is device specific, then maybe its hardware.\r\nI don't see how it could be hardware though, its strange, are you completely certain it doesn't happen to yours, if you give it small flings (like in the video I give it a tiny fling with my finger, not touching screen for long, just enough to give it a very small fling) as with bigger scrolls it doesn't seem to happen near as much.\r\nThis video was me on OOS 4.5.14 + Lightning Kernel.", "time": "7th November 2017, 12:00 PM", "postID": "post74435023", "replies": [{"text": "It definitely happens on my device as well so I don't think it's an hardware issue. What i don't get though is why the hell aren't more people talking about this. It's such a serious issue. My nexus 5 was so much smoother than this supposed flagship.\n\n---------- Post added at 10:50 PM ---------- Previous post was at 10:49 PM ----------\n\n\n\r\nNope, It's still there.", "time": "2nd December 2017, 09:50 PM", "postID": "post74715747", "replies": [{"text": "Sadly I sold the OP5 and I bought the OP5T...I will receive it on monday, but I think it was the best idea. Some people can support the stuttering or the jelly, but I cant.", "time": "2nd December 2017, 10:01 PM", "postID": "post74715841", "replies": [{"text": "That was a smart decision. I wish I could do that too.", "time": "2nd December 2017, 10:02 PM", "postID": "post74715858", "replies": [{"text": "I just have to pay 25€ more, so...It was a good idea definetly.", "time": "2nd December 2017, 10:07 PM", "postID": "post74715887", "replies": []}]}]}]}]}]}, {"text": "For those with stuttering when scrolling, do you have anything turned on in \"Accessibility\" settings? It may have been posted before but anything turned on in Accessibility will make you whole device very choppy. \nThe problem has been around forever and is \"supposed\" to be fixed in Oreo.\nhttps://issuetracker.google.com/issues/37014027", "time": "7th November 2017, 08:11 PM", "postID": "post74440054", "replies": []}, {"text": "I have tried many kernels and i find that flash kernel with ondemand governor is the smoothest.", "time": "9th November 2017, 02:02 PM", "postID": "post74458633", "replies": []}, {"text": "Sometimes I feels like pictures with vivid colors act likes colors are switching on and off while scrolling.\nIt happens only with photos having very high colors details and it lasts only for a fraction of second.\nBut of annoying but its okay as it happens rarely", "time": "23rd November 2017, 11:00 AM", "postID": "post74608915", "replies": []}, {"text": "Hi guys, do you think that the stuttering will be fixed with the Android 8.0?", "time": "29th November 2017, 01:34 PM", "postID": "post74678618", "replies": [{"text": "People have been complaining about stuttering since the beginning of Android. So, to answer your question, very unlikely.", "time": "29th November 2017, 10:41 PM", "postID": "post74683995", "replies": []}]}]}, {"title": "Heat", "rating": 5.0, "links": ["https://forum.xda-developers.com/oneplus-5/review/heat-t3646092", "https://forum.xda-developers.com/oneplus-5/review/heat-t3646092/page2", "https://forum.xda-developers.com/oneplus-5/review/heat-t3646092/page3", "https://forum.xda-developers.com/oneplus-5/review/heat-t3646092/page4"], "threads": [{"text": "Much better than the s6, s7, s8 heat machine on which you can fry eggs .\n\nHeck, even when installing apps, update firmware or while charging the phone, it doesn't get insupportable to touch like other flagships.", "time": "26th July 2017, 06:41 PM", "postID": "post73182814", "replies": []}, {"text": "Definitely the coolest phone I ever owned!! Especially comparing to my old phone Xiaomi Mi Note Pro with the Snapdragon 810 that was known to run hot lol", "time": "26th July 2017, 06:46 PM", "postID": "post73182868", "replies": []}, {"text": "For me has been the reverse of some people here.  My One plus 5 is heating a little bit more than my S8 Plus and my Xiaomi Mi Mix. But it's not heating up to the point that it's uncomfortable I said it's in the normal range.", "time": "26th July 2017, 08:05 PM", "postID": "post73183781", "replies": []}, {"text": "I came from a vintage phone from LG G Pro with a snapdragon 600, and i can say this is alot hotter comparing to the op5. When i play clash of clans for a few mins, it heats up to 77 degrees celsius which can be a bother to battery and other components. \n\nHere at op5 i can play the same game and cpu is just 30 degrees celsius! Measured with cooltool.", "time": "27th July 2017, 08:25 PM", "postID": "post73196414", "replies": []}, {"text": "Compared to my Nexus 6p, this phone is cool as ice, my Nexus would sometimes get so hot that you couldn't touch it.", "time": "27th July 2017, 09:20 PM", "postID": "post73196954", "replies": [{"text": "Same for me.", "time": "1st September 2017, 01:20 AM", "postID": "post73617359", "replies": []}]}, {"text": "To be fair, my last phone was the LG G4. About an hour after plugging that in to my Chevy Volt's infotainment center (with Android Auto), I could pretty much cook an egg on that phone. Even with the back off, the LG G4 would overheat and report that it's recharging was temporarily halted. There's nothing like that going on, with the OnePlus 5.", "time": "28th July 2017, 12:14 AM", "postID": "post73198317", "replies": []}, {"text": "My 8/128gb is overheating, especially the zone right in between the camera and the 1+ logo. \nThe CPU temperature is constantly around 40°c in light use over wi-fi. Is it normal? What is the right range of temperatures? Anybody experiencing this overheating in the rear zone?", "time": "31st July 2017, 08:10 AM", "postID": "post73234800", "replies": [{"text": "40 is nowhere near overheating so nothing to worry about.", "time": "31st July 2017, 09:56 AM", "postID": "post73235584", "replies": [{"text": "Ok but the back becomes so hot that is difficult to hold it.", "time": "31st July 2017, 10:43 AM", "postID": "post73235996", "replies": []}]}]}, {"text": "i have played asphalt xtreme, injustice 2, marvel future fight, close to about 30-40 mins, and frequently switching between games, and no sign of any overheating at all.\nI used to own a zenfone 2, and it got real hot, not even warm.\nFantastic device for gaming, OP5!!", "time": "31st July 2017, 04:40 PM", "postID": "post73239688", "replies": []}, {"text": "This is the coldest phone i ever had.", "time": "30th August 2017, 04:21 AM", "postID": "post73591767", "replies": [{"text": "Same", "time": "3rd September 2017, 02:46 AM", "postID": "post73642344", "replies": [{"text": "I love the feeling of that cold back as well", "time": "9th September 2017, 04:37 PM", "postID": "post73729332", "replies": []}]}]}, {"text": "2 weeks and I have not had any heat issues my previous 6P use to get very very warm.", "time": "30th August 2017, 03:00 PM", "postID": "post73597578", "replies": [{"text": "Here too.. Oneplus 5 is the coolest phone i ever had.. my Nexus 6p as you touch it burns lol", "time": "31st August 2017, 07:21 PM", "postID": "post73614317", "replies": [{"text": "I bought, used, then sold three nexus 6p .. Such a beautiful phone with such a horrible cpu T__T Oneplus 5 is no comparison with heat whatsoever..that thing was a firecracker", "time": "3rd September 2017, 12:10 AM", "postID": "post73641527", "replies": [{"text": "You're right, snapdragon 810 was a failure  i only regret to have sold my Nexus 5, probably the best phone i have ever had  at least before i've bought OnePlus 5, really love this phone", "time": "3rd September 2017, 12:28 AM", "postID": "post73641639", "replies": []}]}]}]}, {"text": "after M7 the phone is cold as ice. always.", "time": "1st September 2017, 10:42 AM", "postID": "post73621252", "replies": []}, {"text": "Coolest phone i've ever used.\n\nChances are you've got a lot running, personally I've not had this happen once.\n\nEven running a gamecube emulator the phone kept cool, very efficient chipset and processor.", "time": "14th September 2017, 02:56 PM", "postID": "post73790133", "replies": []}, {"text": "What temperatures do you mean saying \"cool, cold, ice\"? It would be nice to add some real temperature, maybe of the battery or cpu, so we can do an objective comparison with other devices \nFor example my battery (usually reaches): 28° C while doing normal stuff like telegram and surfing on the web, 32° while playing Heartstone (atm is my \"most heavy\" game), 34° while using dash charge with the phone on stand-by and all apps closed", "time": "8th October 2017, 10:16 AM", "postID": "post74078115", "replies": []}, {"text": "Half an hour of Zelda Windwaker whilst connected to a Bluetooth pad, barely felt warm in the hand, this chipest /CPU / GPU from Qualcomm is a work of art. \n\nEven the battery life, breezes past a single day effortlessly. \n\nI'm currently on day two with over 7 hours SOT and just under half battery left. \n\nNo other phone out at the moment can boast this stamina, cooling or performance.\n\nThis is all largely down to the lower Res, I say low, 1080p is perfect for a 5 inch screen, bare in mind that most people's TVs are 50+ and 1080p, nothing wrong at that size so a phone using anything more is just overkill.\n\nVery happy with this phone.", "time": "8th October 2017, 12:53 PM", "postID": "post74079476", "replies": []}, {"text": "Incredible.", "time": "8th October 2017, 12:54 PM", "postID": "post74079484", "replies": [{"text": "Full stock rom?", "time": "19th October 2017, 10:02 AM", "postID": "post74215503", "replies": [{"text": "Lol no mate. Look at my signal bars\n\nFusion ROM", "time": "19th October 2017, 10:19 AM", "postID": "post74215634", "replies": [{"text": "Ah haven't noticed this  Ok, awesome!", "time": "19th October 2017, 10:24 AM", "postID": "post74215679", "replies": [{"text": "Bare in mind I've had over 10 hours SOT now", "time": "19th October 2017, 11:06 AM", "postID": "post74216024", "replies": [{"text": "How did you achieve that?  I mean, my best up to now was 7,5 SOT, which isn't bad already xD But assuming from your screenshots, you didn't play games, did you?", "time": "19th October 2017, 11:19 AM", "postID": "post74216152", "replies": [{"text": "No idea, wasnt even trying lol..\n\nTurned on battery saver when the phone was about to die.", "time": "19th October 2017, 11:22 AM", "postID": "post74216175", "replies": []}]}]}]}]}]}]}, {"text": "No heat at all coming from devices of htc and mi which heats like a frying pan", "time": "23rd November 2017, 11:15 AM", "postID": "post74609027", "replies": [{"text": "Depends on the chipsets mate, the 835 is an absolute masterpiece plus coming off the back of the last three chipsets they really needed to show they can change their ways.\n\nThe 835 has gobbled up everything I've thrown at it whilst remaining efficient.\n\nStamina wise it's incredible, I've had nearly 11 hours SOT on one charge over 2 days, nothing comes close.\n\nNow if the 845 can improve in the right departments then Qualcomms stock is going to go through the roof.\n\n---------- Post added at 12:55 AM ---------- Previous post was at 12:54 AM ----------\n\n\n\r\nMake sure it's the correct voltage / amperage, personally I wouldn't use anything but the dash charger.  Stays cool when charging too.", "time": "19th January 2018, 11:55 PM", "postID": "post75263459", "replies": []}]}, {"text": "I'm quite impressed with the OP5 here. I've only found some \"overheatness\" when charging the phone with a powerbank (an old one I must say, one of the first Xiaomi's powerbank)", "time": "19th January 2018, 03:36 PM", "postID": "post75258462", "replies": []}, {"text": "Colder phone I ever had", "time": "29th January 2018, 04:21 AM", "postID": "post75367975", "replies": []}, {"text": "No complaints about my OnePlus 5 here, as far as overheating is concerned.  This phone remains cool as a cucumber, despite doing heavy gaming with a Sony PSP emulator, or MAME, or other graphically demanding games.\n\nOn the other hand: my last phone, the LG G Stylo, used to overheat often.  The screen also occasionally flickers, while overheating.  That was so annoying.", "time": "31st January 2018, 06:51 AM", "postID": "post75392965", "replies": []}]}, {"title": "Low light", "rating": 3.5, "links": ["https://forum.xda-developers.com/oneplus-5/review/low-light-t3646093", "https://forum.xda-developers.com/oneplus-5/review/low-light-t3646093/page2", "https://forum.xda-developers.com/oneplus-5/review/low-light-t3646093/page3", "https://forum.xda-developers.com/oneplus-5/review/low-light-t3646093/page4"], "threads": [{"text": "Probably requires a little work on the SW, as I've noticed it takes great pictures at times, and then bad pictures in the same conditions at times. Misses one star for low light pictures.", "time": "27th July 2017, 07:28 AM", "postID": "post73188388", "replies": []}, {"text": "I deduct 3 star for low light, EIS doesn't work in still image & there is no OIS in OP5 (OP5 downgraded from op3 in stabilization) so, in pro mode it's impossible to use 30s long shot without tripod or stands(who the hell like to use tripod in smartphone).\nAnd the normal shots has lots of visible noises compared to advertised, portrait mode doesn't work in low light with flash, (missing on background lights bokeh), telephoto lens which is only 1.5x optical doesn't work in low light.\n😒😒😒😒😒😒😒😒😒😒😒😒😒😒😒😒😒😒", "time": "27th July 2017, 01:27 PM", "postID": "post73191615", "replies": [{"text": "What lol, who would use 30sec shutter time without tripod?", "time": "2nd August 2017, 10:52 AM", "postID": "post73259871", "replies": [{"text": "Isn't that possible with Stabilization?", "time": "2nd August 2017, 11:51 AM", "postID": "post73260402", "replies": [{"text": "No the photo would come out terrible. Tripod is a must on any phone with a long shutter time.", "time": "2nd August 2017, 11:52 AM", "postID": "post73260418", "replies": [{"text": "Now I ordered a tripod from Amazon, and a separate smartphone holder. I already got a Bluetooth remote that can be used as remote shutter.\nIf you are experienced photographer or using OP5. can you tell me what setup would be the best to take photos of half moon with lots of patterned light clouds, I tried to take photo of  that and the Moon is all blured out to a round bright circle, I tried on different iso and shutter speed, with focus on that landscape sign ...", "time": "3rd August 2017, 08:32 AM", "postID": "post73270519", "replies": []}]}]}]}]}, {"text": "It's great to my untrained eyes. XD", "time": "31st July 2017, 03:02 AM", "postID": "post73233050", "replies": []}, {"text": "I'm very impressed with the low light quality of this camera.\nhttp://i.imgur.com/b2OQGcZ.jpg\n\nIt even got the stars from the night sky.\nI putted an auto picture for comparison.\nAlso Consider the loss of quality from the collage app.\n\nIf you are interested in the originals or the shutter speed/ISO settings, just tell me.", "time": "7th August 2017, 06:36 PM", "postID": "post73320501", "replies": [{"text": "Do you have other low light shots? Can I use them in a video review please?", "time": "9th August 2017, 09:48 PM", "postID": "post73345282", "replies": [{"text": "Yes, I provide here the link for the photos.\nThese are a set of night pictures, all taken in the same place with a tripod and different settings. This was my first test with a lot of different manual settings.\nIn every picture taken there's the apperture, the shutter time and the ISO in the details.\nYou can see for yourself which settings took the best pictures.\nRemember this was complete night time with just a few street lights.\n\nThe download is pretty big, 427MB but they are the originals with the respective RAW files.\nhttps://mega.nz/#!eMVnBZqC!tWWE7MB-o...MsM81AoqIeBsw0", "time": "9th August 2017, 10:48 PM", "postID": "post73345769", "replies": [{"text": "Thanks, do you have any low light videos?", "time": "11th August 2017, 06:43 PM", "postID": "post73366933", "replies": []}]}]}, {"text": "How you do that? That's Amazing result", "time": "11th August 2017, 05:49 PM", "postID": "post73366317", "replies": [{"text": "EXIF: F/1.7 4mm 10 seconds shutter speed, ISO 500, White Balance 2300K.", "time": "14th August 2017, 04:02 PM", "postID": "post73399509", "replies": []}]}]}, {"text": "how is low light photos after 4.5.8 update ? is it still blurry ?", "time": "9th August 2017, 01:51 PM", "postID": "post73340033", "replies": []}, {"text": "How did you manage to take that shot from so dark to do bright? Settings please", "time": "13th August 2017, 09:09 AM", "postID": "post73384095", "replies": []}, {"text": "Google hacked hdr+ camera makes this camera see in the dark.", "time": "14th August 2017, 04:59 AM", "postID": "post73393867", "replies": [{"text": "can you shot some low light photos with that hacked app ?", "time": "14th August 2017, 09:49 AM", "postID": "post73395887", "replies": []}, {"text": "Did you use it? Did you notice some grid from small circles when you crop a picture?", "time": "15th August 2017, 10:42 PM", "postID": "post73415619", "replies": []}]}, {"text": "First one was done with stock camera, second one with Gcam HDR+", "time": "18th August 2017, 08:15 PM", "postID": "post73450582", "replies": [{"text": "That's a huge improvement o..o Really wish Google would add hdr+ to their stock app", "time": "19th August 2017, 04:39 AM", "postID": "post73453785", "replies": []}, {"text": "impressive", "time": "19th August 2017, 12:09 PM", "postID": "post73456968", "replies": []}]}, {"text": "First One with stock camera, second one with Google camera 2.2, third stock with flash", "time": "22nd August 2017, 11:52 AM", "postID": "post73494271", "replies": []}, {"text": "Google camera is worst, it is not possible to adjust exposure, stock camera in auto mode also. But the stock camera in pro mode is great.\n\nImages on the following link:\nhttps://photos.app.goo.gl/uSTFjSlL9bHumnVk2\n\n1) Stock camera unmodified\n2) Tree pictures with different exposure mixed with EasyHDR\n3) Stock camera unmodified\n4) EasyHDR, combination of tree pictures", "time": "31st October 2017, 12:43 AM", "postID": "post74352667", "replies": []}, {"text": "I have added some pictures with a description in the album of the previous link.\r\nOnly with the stock camera, some in total night.", "time": "1st November 2017, 12:00 AM", "postID": "post74363730", "replies": []}, {"text": "What is easy hdr?", "time": "9th November 2017, 06:18 AM", "postID": "post74455217", "replies": []}, {"text": "Look here https://www.easyhdr.com/", "time": "9th November 2017, 07:08 AM", "postID": "post74455504", "replies": []}, {"text": "received yesterday mine...\nok in good light, really good with the portrait mode.\nin low light is really poor... i came from a Nexus 6P and is not the best, but the one on the 5T is worst.\nbetter the 16mpx camera, if start to shoot with the 20mpx the quality is dropping a lot.\nsomethink is not working.\ni'm trying the Google camera modded, but no touch to focus. is an improve but OP have to work a lot.", "time": "25th November 2017, 05:17 PM", "postID": "post74633627", "replies": []}, {"text": "Low light photos seems to be improved with the lasts Oneplus Camera App (since 2.5.7)", "time": "8th December 2017, 10:37 AM", "postID": "post74775476", "replies": [{"text": "Could you show some samples or a link to read about it, please?", "time": "12th December 2017, 05:22 PM", "postID": "post74824274", "replies": [{"text": "+1", "time": "14th January 2018, 09:03 PM", "postID": "post75199616", "replies": []}]}]}]}, {"title": "Photo quality", "rating": 3.5, "links": ["https://forum.xda-developers.com/oneplus-5/review/photo-quality-t3646094", "https://forum.xda-developers.com/oneplus-5/review/photo-quality-t3646094/page2", "https://forum.xda-developers.com/oneplus-5/review/photo-quality-t3646094/page3", "https://forum.xda-developers.com/oneplus-5/review/photo-quality-t3646094/page10"], "threads": [{"text": "OnePlus did themselves a disservice, by hyping this camera as much as they did. It's a fine camera, more or less (for this price point).", "time": "28th July 2017, 12:15 AM", "postID": "post73198324", "replies": []}, {"text": "Does a fine job to me..", "time": "23rd August 2017, 04:31 AM", "postID": "post73504817", "replies": []}, {"text": "They just need better post-processing algorithms.", "time": "24th August 2017, 10:11 PM", "postID": "post73528522", "replies": []}, {"text": "no problems at all over 200 photos taken since owning and Im very happy with the quality of the photos.... remember its a phone with a camera most pics will be shared to social media and forgotten about.", "time": "30th August 2017, 02:32 PM", "postID": "post73597230", "replies": [{"text": "Maybe if your thirteen years old yes. I would say... remember it's a phone with a camera that will replace point and shoot camera's and even a DSLR when going on a trip with family. Pictures won't be forgotten and should at least be on par with galaxy and pixel of last year.", "time": "2nd September 2017, 07:08 AM", "postID": "post73631933", "replies": []}, {"text": "Exactly. I don't get this persuid for perfection neither.", "time": "9th October 2017, 06:27 PM", "postID": "post74096665", "replies": [{"text": "They  advertised the phone having an amazing camera and working with dxomark to get it done. The end result is a phone that can't even shoot pictures better than the Nexus 5X. And the annoying thing is that the hardware should be able to do much better.", "time": "9th October 2017, 07:30 PM", "postID": "post74097433", "replies": []}]}]}, {"text": "Not better than the oneplus 3.  Take a look of my post here\nhttps://forums.oneplus.net/threads/j...#post-16721573", "time": "30th August 2017, 05:54 PM", "postID": "post73599994", "replies": []}, {"text": "OOS 4.5.10 Stock Camera App", "time": "15th September 2017, 01:51 PM", "postID": "post73801987", "replies": [{"text": "Is this with no editing? Great picture.", "time": "21st September 2017, 12:47 PM", "postID": "post73876438", "replies": [{"text": "Yeah no edit auto settings with oos camera", "time": "21st September 2017, 01:36 PM", "postID": "post73877002", "replies": [{"text": "Glad I got this device!", "time": "21st September 2017, 01:41 PM", "postID": "post73877063", "replies": [{"text": "Great! Im sure you will like it", "time": "21st September 2017, 03:00 PM", "postID": "post73877918", "replies": []}]}]}]}]}, {"text": "Here is one of my shots. Shot in promode.", "time": "22nd September 2017, 02:21 AM", "postID": "post73884649", "replies": [{"text": "Nice chemtrail!\r\nI mean, nice shot!", "time": "29th September 2017, 06:29 PM", "postID": "post73978271", "replies": []}]}, {"text": "Nice photos on my OP5.", "time": "25th September 2017, 07:36 AM", "postID": "post73922845", "replies": []}, {"text": "Can't complain about picture quality...", "time": "28th September 2017, 02:23 AM", "postID": "post73958628", "replies": []}, {"text": "I took this photo while I was in a car which was running.\r\nI mean the car didn't even stop. I love the camera of this phone.", "time": "29th September 2017, 09:45 PM", "postID": "post73980021", "replies": []}, {"text": "Hi, Oneplus 5 owners\r\nThere are some reviews where they talk about poor and dificult focus when you use the zoom.\r\nIs that real?", "time": "3rd October 2017, 12:00 PM", "postID": "post74019487", "replies": [{"text": "I have not noticed it.", "time": "3rd October 2017, 07:21 PM", "postID": "post74024426", "replies": [{"text": "Hi. I already got the OP5 right now and I am quite satisfied with the purchase. And I've even taken some really good photos to begin with. But I read some complaints on some foruns related to zooming and ... having used in recent times the LG G4, which apart from excellent camera (better 2015, I think) has a more excellent QHD screen, I have to admit that the photo feature of the OP5 doesn't win that war so easily in all fields. In G4 the zoom impressed by the quality maintained to the detail, in this OP5 when zooming the photo easily gains some grain in a few low light situations.\r\nOk, hard to please at all. overall and so far, I am very satisfied with the OP. They are 8GB / 128GB", "time": "12th October 2017, 10:57 AM", "postID": "post74128774", "replies": [{"text": "I've come from the LG G4 to the OP5 and I am not at all happy about the camera. They teased it so much and said they would work with DXOMARK but it's much worse than the 2 year old G4 camera. Everything else about this phone is awesome. And even pictures of landscapes and so on may be good. But when taking pictures of faces in low light the quality is awful. Really thinking about switching back to LG and the V30.\n\n---------- Post added at 12:51 PM ---------- Previous post was at 12:47 PM ----------\n\n\n\r\nAbout the jelly effect I was wondering the same. Either you just get so used to it that you don't see it anymore or they worked on it. At least I practically don't see it anymore. The image quality, well maybe have to do more testing.\r\nI've installed the Goolge Camera now as well, hope that works better than the OP5s, otherwise will sell this phone.", "time": "12th October 2017, 01:51 PM", "postID": "post74130320", "replies": []}]}]}]}, {"text": "Camera is mid quality   daylight photos are  ok  the only issue is optical image stabilization", "time": "4th October 2017, 12:10 AM", "postID": "post74026831", "replies": [{"text": "The camera is the worst part of this phone.......", "time": "4th October 2017, 08:54 PM", "postID": "post74037377", "replies": [{"text": "For me, the most recent version did make some improvements to Camera thus quality in mid-light is little better than previous versions. Also, I did notice jelly-alike effect is reduced but still there.\n\r\nGoogle Camera with HDR+ makes a bigger difference against OOS Camera.", "time": "6th October 2017, 01:54 PM", "postID": "post74056588", "replies": [{"text": "So true with the last statement.", "time": "6th October 2017, 08:27 PM", "postID": "post74060784", "replies": [{"text": "I wish that there is an ability to make this as System App with custom ROM, many ROMS with default camera pretty sucks. Except for the SultanXDA's Camera module.\n\r\nI would want to port Sultan Lineage's Camera into PA.", "time": "6th October 2017, 09:55 PM", "postID": "post74061575", "replies": []}]}]}]}]}, {"text": "The camera is far more capable then what the OOS app can deliver. The Google camera with hdr+ is the proof of this. So I use that one for fast shooting good pics. If I have more time is use pro mode with stock OOS camera and I've taken some gorgeous shots with that. Shooting in raw and using Snapseed to tune it.", "time": "7th October 2017, 11:54 AM", "postID": "post74067104", "replies": []}, {"text": "", "time": "10th October 2017, 07:15 AM", "postID": "post74102575", "replies": []}, {"text": "I also tried the camera on this phone and i think it is better than Xiaomi Mi Mix picture for sure ! This camera have a good general quality", "time": "10th October 2017, 10:35 AM", "postID": "post74104180", "replies": []}, {"text": "Hope it works out for you soon.\n\nTBH, personally I don't see the need to use gcam mod. The original camera app seems to function OK, whether focus, color or detail. But i have largely worked with the pro mode and RAW only, and i have realistic expectations in low light conditions.", "time": "8th January 2018, 08:16 AM", "postID": "post75120962", "replies": [{"text": "I agree", "time": "14th January 2018, 09:03 PM", "postID": "post75199614", "replies": []}]}, {"text": "hi, im not sure what is it called..\r\nbut when i open my camera app, there is a black thing going on it\n\r\nis it banning effect or some sort of refresh? is there a fix on that?\n\r\nit will be gone after few seconds but it is irritating to wait for it before taking pictures\n\r\nthanks", "time": "5th March 2018, 09:34 AM", "postID": "post75778224", "replies": []}, {"text": "Auto mode photos enjoy!!Awesome op5 camera!!!\n\nWhole album\nhttps://flic.kr/s/aHsmfnAZX1\n\nIMG_20180304_174355 by Guardian, on Flickr\n\nIMG_20180304_114931 by Guardian, on Flickr\n\nIMG_20180303_120642 by Guardian, on Flickr\n\nIMG_20180303_120502 by Guardian, on Flickr\n\nLow light photos\n\nIMG_20180303_190708 by Guardian, on Flickr\n\nIMG_20180303_194522 by Guardian, on Flickr\n\nIMG_20180305_194022 by Guardian, on Flickr", "time": "5th March 2018, 06:55 PM", "postID": "post75783828", "replies": []}, {"text": "I just got my OP5 from Swappa. So far I'm loving it. I just found out we can do time lapse photography!", "time": "6th March 2018, 01:52 AM", "postID": "post75786987", "replies": []}]}, {"title": "Video quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/oneplus-5/review/video-quality-t3646095", "https://forum.xda-developers.com/oneplus-5/review/video-quality-t3646095/page2"], "threads": [{"text": "What do you guys say on 4K EIS? For me it's not that good as 1080p30FPS one also did they add EIS to 60FPS 1080p?", "time": "1st August 2017, 04:56 PM", "postID": "post73251833", "replies": [{"text": "I think EIS for 60fps 1080p has already been there as I'm on 4.6.6 and I do have EIS everywhere apart from 4k", "time": "1st August 2017, 05:30 PM", "postID": "post73252193", "replies": [{"text": "well thats possible", "time": "1st August 2017, 05:32 PM", "postID": "post73252213", "replies": []}]}, {"text": "From what i can tell, there doesn't seem to be any EIS on 1080p 60 fps, but 1080p 30 fps and 4K has it", "time": "2nd August 2017, 08:40 AM", "postID": "post73258663", "replies": [{"text": "Maybe they accidentally removed it with the update lol", "time": "2nd August 2017, 10:27 AM", "postID": "post73259637", "replies": [{"text": "But I don't think 60 fps has ever had Image Stabilization. Atleast not on my device, because I remember testing out how good the image stabilization was on 1080p 60fps and thought to myself that it was absolute ****, only to find out later that it had amazing EIS on 1080p 30 fps", "time": "3rd August 2017, 08:07 AM", "postID": "post73270341", "replies": [{"text": "funny you say that I just updated to 4.6.7 and 1080p 60fps has far better EIS than any other mode like it did on previous versions of OOS", "time": "3rd August 2017, 09:25 AM", "postID": "post73270947", "replies": [{"text": "Hmm... I just have a hard time seeing why there wouldn't be any EIS on 1080p 60 fps for me then, because clearly it is a software-wise, and i am running the latest update. Could you maybe provide me 3 videos. One from 1080p 30 fps, 1080p 60 fps and 4k? Only if you want to of course.", "time": "3rd August 2017, 09:42 AM", "postID": "post73271084", "replies": [{"text": "I was chatting **** lol, can confirm 60fps doesnt have eis", "time": "3rd August 2017, 11:14 AM", "postID": "post73271798", "replies": [{"text": "Okay good! Less worried then  But you sure did sound convincing my friend!", "time": "3rd August 2017, 01:35 PM", "postID": "post73273076", "replies": []}]}]}]}]}]}, {"text": "I think so, the 4k eis footage looks spectacular. 1080/60 has tons of jitters.", "time": "2nd August 2017, 03:09 PM", "postID": "post73262512", "replies": []}]}]}, {"text": "I will provide it today. I'm curious personally too so I will upload it directly.", "time": "4th August 2017, 10:24 AM", "postID": "post73283317", "replies": []}, {"text": "i tested it on metal concert, so 2 bugs with one shot. (4K EIS and audio recording)and im satisfied with it  \n\nhttps://youtu.be/IL1sUZuzZoQ?autoplay=0&origin=https://forum.xda-developers.com\"\r\n  frameborder=\"0\">", "time": "7th August 2017, 12:39 PM", "postID": "post73316708", "replies": []}, {"text": "Hey guys!!\nThis is a video that I recorded this afternoon between OP5 and OP3t.\n\nIt shows how wonderful OP5 EIS works after the lastest OTA 4.5.8\n\nJust see and make your own conclusions.\n\nRegards.\n\n\nhttps://youtu.be/hO9L98L9Gxw\nEnviado desde mi ONEPLUS A5000 mediante Tapatalk", "time": "7th August 2017, 11:58 PM", "postID": "post73323129", "replies": []}, {"text": "i really love the 1080p 60fps mode. I have tried some video yesterday\nhttps://www.youtube.com/watch?v=1e_xg_nvNac\nhttps://www.youtube.com/watch?v=1_Loqr2RVRI\nhttps://www.youtube.com/watch?v=WkxyOyK8kqM\n\nI cannot upload 4k video, so it's downscaled", "time": "15th August 2017, 08:32 AM", "postID": "post73407488", "replies": []}, {"text": "Noise in video even in normal lighting,  permanent eis I hate that,  they sud add an option to enable or disable it, \n60 fps 1080p that's OK, but if hardware support it than they sud try to increase it, \nSlow no video in 720p hate it, wish if they enable it for 1080p too, and the more slower video option (higher fPS)\nAlso manual mode needed for video, at least for focus and exposure.", "time": "24th October 2017, 07:52 PM", "postID": "post74281399", "replies": []}]}, {"title": "Selfie quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-5/review/selfie-quality-t3646096"], "threads": [{"text": "I wouldn't have minded a wider field of view. But this selfie is, IMHO, first rate.", "time": "28th July 2017, 12:15 AM", "postID": "post73198329", "replies": []}, {"text": "Compared to oppo devices, average front camera", "time": "24th October 2017, 07:54 PM", "postID": "post74281432", "replies": []}, {"text": "Very good front camera. I admits that many midranger have better camera than this but this is not a SELFIE only phone wo very happy with front camera and screen flash works good in low light camera is capable however due to poor optimizations it acts weird in low light", "time": "23rd November 2017, 11:14 AM", "postID": "post74609014", "replies": []}]}, {"title": "Time to take picture (camera launch speed)", "rating": 5.0, "links": ["https://forum.xda-developers.com/oneplus-5/review/time-to-picture-camera-launch-speed-t3646097"], "threads": [{"text": "Whenever \"speed\" is part of the criteria, this phone's screaming fast.", "time": "28th July 2017, 12:16 AM", "postID": "post73198333", "replies": []}, {"text": "Not too slow, nighter the fastest.", "time": "24th October 2017, 07:56 PM", "postID": "post74281449", "replies": []}]}, {"title": "Software (ease of use, features, etc)", "rating": 4.0, "links": ["https://forum.xda-developers.com/oneplus-5/review/software-ease-features-t3646098"], "threads": [{"text": "Lack of battery saver customization\r\nPoor Alert Slider option", "time": "14th September 2017, 07:43 AM", "postID": "post73786092", "replies": []}, {"text": "Too restricted camera apps. \nThey should have included options like more camera modes,  filters,  option to switch to telephoto camera, more depth effect tuning option, some more video options like slower slow mo, higher resolution slow no video, eis on off toggle, manual option for saturation contrast brightness... \nThere are lots more", "time": "24th October 2017, 08:20 PM", "postID": "post74281739", "replies": []}, {"text": "No dual apps very poor app locker very poor gallery app in terms of editing camera app in regular mode have no options no theme engine and no support for substratum no cloud storage.\nReally oneplus what are u doing?\nMiui is giving us all these options but a big gun like oneplus is not giving why?\nAll oneplus devices have greatest hardware of that time so why the are fearing to include such features whole very lower end devices support these.\nReally disappointed.", "time": "23rd November 2017, 11:12 AM", "postID": "post74608998", "replies": []}]}, {"title": "Charging speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/oneplus-5/review/charging-speed-t3646099", "https://forum.xda-developers.com/oneplus-5/review/charging-speed-t3646099/page2", "https://forum.xda-developers.com/oneplus-5/review/charging-speed-t3646099/page3"], "threads": [{"text": "It's about not only charging speeds... But also the heat while charging \n\nAnd in both situations, dash charge is superior to any quickcharge solution i've tested.", "time": "26th July 2017, 06:55 PM", "postID": "post73182972", "replies": []}, {"text": "I can confirm. Alot faster and still cool battery. It charges with 3 amperes through than with an anker charger that fills your battery with 1.2 amperes through.", "time": "27th July 2017, 08:30 PM", "postID": "post73196462", "replies": []}, {"text": "Dash charging is the bomb. Even without the Dash charger, the phone charges awfully fast.", "time": "28th July 2017, 12:17 AM", "postID": "post73198337", "replies": []}, {"text": "lighting fast", "time": "8th August 2017, 09:55 AM", "postID": "post73326386", "replies": []}, {"text": "Easily gets through a day with heavy usage with plenty of power left in the battery.", "time": "25th October 2017, 03:19 PM", "postID": "post74290461", "replies": []}, {"text": "Super fast charging speed.", "time": "1st November 2017, 04:49 AM", "postID": "post74365292", "replies": []}, {"text": "from 5% to 100% at 68 minutes. No limits ROM, bluspark kernel", "time": "1st November 2017, 08:14 AM", "postID": "post74366281", "replies": []}, {"text": "I don't think my phones ever overheated.\n\nDash charge works phenomenally well, I've never known a charger this fast.\n\nProblem for me is I have a tonne of other USB-C chargers which even though they have similar voltage and amp output they sometimes charge slowly or normally, so you would need to buy another dash charge to get the same speeds.\n\nI have another charger (Dash) but no second cable, lost it. Using another USB-C cable doesn't allow Dash, so the cable matters too.", "time": "1st November 2017, 01:51 PM", "postID": "post74368684", "replies": []}, {"text": "I saw a video on youtube with charge speed comparison between flagship phones, one+5 was fastest there (1 hour 13 mins). pixel 2xl there was around 2 hours 40 mins)", "time": "5th November 2017, 02:21 AM", "postID": "post74409695", "replies": [{"text": "wow, that's fast. what about battery health? I heard that quick charge can hurt the battery in few month", "time": "5th November 2017, 05:40 PM", "postID": "post74416479", "replies": [{"text": "Fast charging only hurts the battery health if it overheats.", "time": "5th November 2017, 06:56 PM", "postID": "post74417241", "replies": [{"text": "so this device can't be connected to wall charger more then 2 hours, right ?", "time": "6th November 2017, 09:48 PM", "postID": "post74429527", "replies": [{"text": "The time connected to the charger isn't exactly a factor here. You could leave it on the charger for days and it likely won't get very hot, because it will only be trickle charging it to keep it at 100%.\n\r\nNow, there are other things that cause battery life issues, but I was specifically referencing excessive heat, which is the number 1 battery killer.", "time": "7th November 2017, 09:20 PM", "postID": "post74440706", "replies": []}]}]}, {"text": "My girlfriend oneplus 3 after 1.5 year still got 6 h + sot, dash charge is great", "time": "9th November 2017, 07:13 PM", "postID": "post74461704", "replies": []}]}]}, {"text": "啥？", "time": "5th November 2017, 08:25 AM", "postID": "post74411510", "replies": [{"text": "Only English is allowed here. Unless you translate it into English as well.", "time": "7th November 2017, 11:35 PM", "postID": "post74441710", "replies": []}]}, {"text": "If my phone is on, it usually takes an hour or less. Since the last update it has been faster.", "time": "12th November 2017, 09:48 PM", "postID": "post74494062", "replies": []}, {"text": "DASH charging is super fast, while charging with QC 2.0/3.0 charger or any other charger its reaaaaally slow.", "time": "13th November 2017, 11:29 AM", "postID": "post74499025", "replies": []}, {"text": "No heating on charging even if i use this beast.\nGets me full charge in around 100 minutes.\nSometimes it charges really quick  around one hourin my office (i think power supply in my office is better than my home) but takes 100 minutes at home mostly.", "time": "23rd November 2017, 10:55 AM", "postID": "post74608874", "replies": []}, {"text": "Not that good...\nI charge my op5, with Dash charger & Dash, cable from 0% to 100%, with the phone OFF, in 1 hour & 30 minutes. I am on Oos ob4.\nIf you compare with op3, best time, in 45 minutes. Same conditions. Phone off...", "time": "21st January 2018, 06:40 AM", "postID": "post75277720", "replies": []}, {"text": "the phone charges awfully fast.", "time": "9th February 2018, 10:32 AM", "postID": "post75500441", "replies": []}, {"text": "I tested again, with the phone off.\nFrom 0% to 100% in 56 minutes. That's GREAT !\nOb 06. Stock kernel.", "time": "Yesterday, 06:51 AM", "postID": "post75928246", "replies": []}]}, {"title": "Screen on time", "rating": 5.0, "links": ["https://forum.xda-developers.com/oneplus-5/review/screen-time-t3646100", "https://forum.xda-developers.com/oneplus-5/review/screen-time-t3646100/page2", "https://forum.xda-developers.com/oneplus-5/review/screen-time-t3646100/page3", "https://forum.xda-developers.com/oneplus-5/review/screen-time-t3646100/page16"], "threads": [{"text": "If you use the device without too much idle/commute you can get real pretty SOT on wifi.\n\nDisplay at about 15-30% with auto brightness.\nChrome, YouTube, twitter, facebook, reddit, etc.", "time": "26th July 2017, 06:46 PM", "postID": "post73182876", "replies": []}, {"text": "awesome lol", "time": "27th July 2017, 08:07 AM", "postID": "post73188730", "replies": []}, {"text": "all wifi? can you post all battery details?", "time": "27th July 2017, 10:07 AM", "postID": "post73189760", "replies": []}, {"text": "I only get 4 hours of screen on time with Greenify", "time": "27th July 2017, 11:44 AM", "postID": "post73190641", "replies": []}, {"text": "Battery was good until yesterday, 8hrs SOT circa. Suddenly battery starts draining and can I barely reach 2,30 SOT. Any idea? No apps showed in battery page, the only app I downloaded yesterday was Textra SMS (Beta), but it's very strange that it can drains so much.", "time": "28th July 2017, 10:21 AM", "postID": "post73202303", "replies": [{"text": "did you download the 911 patch? if so there are users reporting drainage issues over on the official oneplus forums. reporting that they drain 20-30% overnight when the phone is in airplane mode.", "time": "30th July 2017, 09:38 PM", "postID": "post73231148", "replies": [{"text": "Yes I'm on 4.5.6 (aka 911 patch), I also noticed overheating, CPU is constantly around 40°c..", "time": "30th July 2017, 10:08 PM", "postID": "post73231367", "replies": [{"text": "im fairly certain Oneplus issued a statement eariler today in regards. i believe they said soemthing about a 4g LTE sim i nthe second sim card slot........ill go look and update this post.\n\nhttp://pocketnow.com/2017/07/30/afte...-up-power-fast", "time": "30th July 2017, 10:24 PM", "postID": "post73231505", "replies": []}]}]}]}, {"text": "I'm getting amazing battery life out of this thing. Regularly hit over 6hrs screen on time when I'm out and about, and at home on WiFi it's approaching 10hrs! That's with everything switched on and no battery saving measures applied ☺️", "time": "5th August 2017, 03:16 AM", "postID": "post73291912", "replies": []}, {"text": "+1, battery life is pretty good. Using phone for around 4 - 5 hours SOT watching video, with WIFI,4g and bluetooth on - using bluetooth headset - and goes from around 94% to 66%.... \nNot too shabby in this day and age. I have other phones that, with that usage, would be in the 10 - 20% range after that usage.", "time": "5th August 2017, 07:16 AM", "postID": "post73293128", "replies": []}, {"text": "Got my OP5 rooted and i want to install a dark theme + battery safer.\n\nDid some research but the stuff on playstore has tons of negative feedback that it is crap and doesn't work.\n\nSo how do you do it?\n\nI'm already using the systems own dark mode, but i want to utilize the maximum and use a dark theme that makes everything pure black.\nI read in the S8 forums, that the phone automatically doesn't light up pixels that are black, is it the same for the OP5? Is a \"turn off pixels\" app even needed?\n\nThanks for any help.", "time": "7th August 2017, 10:01 AM", "postID": "post73315446", "replies": [{"text": "I suggest you to go for custom ROM like Resurrection Remix Unofficial. It is OMS so theming is so easy peasy. I had so much trouble with theming OOS. Lots of time I got stuck on bootloop which can't even substratum_rescue.zip solve. And RR also now has OOS camera, so I will highly suggest you go and try it. It is battery friendly as well. Especially when you use Lightning kernel + spectrum app with battery mode.", "time": "13th August 2017, 01:57 PM", "postID": "post73386718", "replies": []}]}, {"text": "Usually my screen reach over 6 hours on.\nI always have the manual brightness.\n\nEnviado desde mi ONEPLUS A5000 mediante Tapatalk", "time": "8th August 2017, 12:05 AM", "postID": "post73323162", "replies": []}, {"text": "I got a close to 9 hour SOT, with mobile data, bluetooth continously on.\nCompleted the whole 5th season of person of interest on this phone with 12% juice still left.", "time": "9th August 2017, 02:32 PM", "postID": "post73340460", "replies": []}, {"text": "3h 13m SOT with 68% remaining = about 10 hours SOT. \n\nThis is Running xXx's NoLimits ROM with no GApps active. \n\nhttp://i.imgur.com/W0SQr5I.png\n\nhttp://i.imgur.com/9OWb4T3.png\n\nhttp://i.imgur.com/MkZbpuT.png", "time": "9th August 2017, 03:25 PM", "postID": "post73341056", "replies": []}, {"text": "Hi there \n\r\nHere's my first SOT \n\n\n\n---------- Post added at 12:41 AM ---------- Previous post was at 12:39 AM ----------\n\n8h44m AWESOME !!!!", "time": "13th August 2017, 11:41 PM", "postID": "post73392326", "replies": [{"text": "Which custom rom is it?", "time": "14th August 2017, 07:57 AM", "postID": "post73394973", "replies": [{"text": "Stock rom", "time": "14th August 2017, 11:19 AM", "postID": "post73396591", "replies": [{"text": "thats great. \n\r\nCan you share your rom and kernel details. Also usage details.", "time": "16th August 2017, 09:43 AM", "postID": "post73419680", "replies": [{"text": "Classic usage, phone, sms, internet, music, youtube, netflix (45mins). Play Store. Maps. \r\nNo heavy game yet.", "time": "16th August 2017, 11:20 AM", "postID": "post73420591", "replies": []}]}]}]}, {"text": "Great!", "time": "15th August 2017, 10:45 PM", "postID": "post73415644", "replies": []}]}, {"text": "SOT is pretty good, around 5-6 hours", "time": "18th August 2017, 08:18 PM", "postID": "post73450607", "replies": []}, {"text": "I always get 9 to 10 hours SOT", "time": "20th August 2017, 10:09 AM", "postID": "post73467630", "replies": []}, {"text": "SOT-  5 hr 41 min with 36% Remaining..", "time": "29th August 2017, 03:34 AM", "postID": "post73578887", "replies": []}, {"text": "I watched 2 films, browsing, whastapp and facebook.\n\nBest phone ever.", "time": "3rd September 2017, 02:47 AM", "postID": "post73642350", "replies": []}, {"text": "Gave up, it's been 6 hours of watching videos and nothing is done today, still with another 50%. Lol.\n\r\nUnfortunate, new members aren't allowed to post with outside link for screen shots.", "time": "3rd September 2017, 10:30 AM", "postID": "post73645729", "replies": []}, {"text": "I'm getting 6.5 - 7 hours usually\r\nBut mixed battery usage - video playback, web browsing, and ~30 mins phone calls, I've made it to 8 hours of SOT.\r\nComing from previously owning a Samsung phone, this feels out of the world..\n\n\r\n*Calculating from 100% to 1~2% remaining", "time": "3rd September 2017, 07:48 PM", "postID": "post73651948", "replies": []}, {"text": "On 4.5.10 stock rom getting average 6hrs SOT", "time": "3rd September 2017, 10:29 PM", "postID": "post73653467", "replies": []}, {"text": "is there any1 who can post complete SOT with all day on 4G?", "time": "6th September 2017, 09:00 AM", "postID": "post73684509", "replies": []}, {"text": "is there some1 who has:\nALL stock\nMassive outdoor usage, NO wifi\nand give us impressive SOT? \nAll i see here are always WOW sots with under wifi usage, i think it is a bit normal to achieve, at least, a good sot under wifi, the tricky one is when we go out home!!\nPlease, i'm waiting!    thanks!!!", "time": "Yesterday, 05:23 PM", "postID": "post75933502", "replies": []}]}, {"title": "Standby drain", "rating": 3.5, "links": ["https://forum.xda-developers.com/oneplus-5/review/standby-drain-t3646101", "https://forum.xda-developers.com/oneplus-5/review/standby-drain-t3646101/page2", "https://forum.xda-developers.com/oneplus-5/review/standby-drain-t3646101/page3", "https://forum.xda-developers.com/oneplus-5/review/standby-drain-t3646101/page6"], "threads": [{"text": "I am not too pleased about idle battery drain.\n\nOvernight, about 8h it consumes about 3%-5%. Sometimes more than 10%, if the device doesn't go in deep sleep for whatever reason..\n\nIf commute, it takes more battery (maybe sensors, switch to mobile data, etc). \nAbout 20% in 9hours. wifi most of the time with about 1h hour on mobile data. And movement in pocket about 20-30mins.", "time": "26th July 2017, 06:51 PM", "postID": "post73182932", "replies": []}, {"text": "My experience with idle drain has been good overall. Getting around 0.5% per hr", "time": "27th July 2017, 12:15 AM", "postID": "post73185906", "replies": []}, {"text": "My idle drain is horrendous. I'm getting around 20% drain over night (7h sleep) with nothing enabled but WiFi. And that's with Greenify. I'm thinking of rooting and flashing the EX Kernel, but wanted to wait for an obviously outstanding major update before doing so.", "time": "27th July 2017, 02:15 AM", "postID": "post73186495", "replies": [{"text": "Maybe check whats draining the battery \r\nI don't use greenify or anythinf and use only 4g. Im getting perfect battery life.", "time": "27th July 2017, 11:21 AM", "postID": "post73190414", "replies": [{"text": "Android System, Phone Services + Google Services, but only if WiFi/data is on. If they are off the battery life is perfect.", "time": "27th July 2017, 01:24 PM", "postID": "post73191579", "replies": [{"text": "Whats weird is my OP5 is the opposite. If I have wifi on idle drain is very good, but with wifi off idle drain is very bad.", "time": "1st August 2017, 10:08 AM", "postID": "post73247716", "replies": []}]}]}]}, {"text": "Battery was good until yesterday, 8hrs SOT circa. Suddenly battery starts draining and can I barely reach 2,30 SOT. Any idea? No apps showed in battery page, the only app I downloaded yesterday was Textra SMS (Beta), but it's very strange that it can drains so much.", "time": "28th July 2017, 10:15 AM", "postID": "post73202248", "replies": [{"text": "For me Chrome was a big culprit for battery drain. Try to delete the cache and the storage of the app. You can as well disable and it and re enable it. That should be enough. Anyway, Chrome is a battery hog. I am thinking about switching to Opera or Firefox. Any recommendation for browsers?", "time": "28th July 2017, 10:25 AM", "postID": "post73202333", "replies": []}]}, {"text": "I use Firefox with the add-on 'Dark Background and Light Text'. I have it set to turn the background of all pages to true black.", "time": "28th July 2017, 10:52 AM", "postID": "post73202570", "replies": []}, {"text": "2% over night (7 hours) pretty pleased. But it was even better on OP3 when the drain over night was 0-1%", "time": "28th July 2017, 12:13 PM", "postID": "post73203315", "replies": []}, {"text": "I'm on RR with no GAPPS and lost about 1.5% in about 8.5hrs of not being used (sleep + getting ready in the AM)", "time": "28th July 2017, 02:35 PM", "postID": "post73204757", "replies": [{"text": "No G-Apps? No play store? Would like that but bit of a ballache if you need an app on the fly.\n\n---------- Post added at 11:14 AM ---------- Previous post was at 10:58 AM ----------\n\nIdle drain for myself is usually around 1% overnight, more recently with different apps installed it's increased dramatically.\n\r\nFor me this is an age old android problem, the OS is amazing on it's own, it's what it's designed for, but as your apps go up they play their part in the destruction of your stamina, the system just has too much to carry.\n\r\nLightening the load is the best way to help get it back to the way it was, losing G-Apps although something i can't do myself is a great way to help, anything which is constantly connected or wanting access 24/7 will have an impact, apps like facebook, twitter, google now etc, all have an impact.\n\r\nBest advice i can offer is to go back to a clean installation, avoid titanium for now, restore only the apps you need from fresh with their own restore functions ie: Whatsapp, until you start to see an impact from one of your apps being there, takes time but it's the only real way to know for sure, remember how amazing the battery was when you got this phone? It was because there was so little on it, then sooner or later a bad app or just a heavy one got installed, coupled with any other similarly bad / heavy apps, it'll affect battery.\n\r\nOnce rooted etc, you back up your apps on titanium (also backing up the problem, or whatever rogue apps you had and their data) you re-install a fresh rom thinking it's going to help, then titanium puts the old problems back.\n\r\nOnly restore what you absolutely need, it'll help.", "time": "30th July 2017, 11:14 AM", "postID": "post73225116", "replies": [{"text": "There are alternative app stores: F-droid and Yalp Store are my recommendations. Yalp Store pulls the apks directly from the Google Play store and allows all the same updates and such. Neither allow piracy or getting paid apps for free, either.\n\nYou can also use MicroG which is an open-source alternative to google play services. They also have an altered Google Play store that works the same as the normal store, but without sending any information (other than your google account) to Google.", "time": "31st July 2017, 02:03 PM", "postID": "post73237930", "replies": [{"text": "I think that's a great idea, thanks mate i'm going to look into this, google services are a huge hog and most of the relaying info you can't stop, even the ones that you can will hinder you using your phone to some degree.\n\r\nCheers mate", "time": "31st July 2017, 02:13 PM", "postID": "post73238038", "replies": []}, {"text": "I actually had Yalp before, but it seemed that it didn't find updates for my apps. Do I need to be rooted for that (maybe a permission issue) ? \n\nWhen I installed Google Playstore again, it immediately found 5 updates. \n\nSecondly, how did you get MicroG installed? I tried it but said the package failed installing. I guess my unrooted hydrogenOS OP5 protects its own Google Services... How can I get rid of them when I finally root my phone?\nThanks in advance mate!", "time": "1st August 2017, 01:54 AM", "postID": "post73244576", "replies": [{"text": "Yalp finds and updates my apps in the background with no issues at all, but yes that does require root for the background installs. Once you are rooted, you can flash the NanoMicro package, which should(?) overwrite the existing google play services with the MicroG ones. However, I've never done that, I usually just install an AOSP ROM that doesn't include any GApps by default, then just flash the nano micro package and boom, you're done.", "time": "1st August 2017, 01:45 PM", "postID": "post73249709", "replies": []}]}]}]}]}, {"text": "I have TASKER, and have set airplane mode to come on 8pm - 3am.\n\r\nCurrently getting roughly 2-3% drain in that \"airplane mode\" time", "time": "28th July 2017, 03:26 PM", "postID": "post73205297", "replies": [{"text": "What the? Do you have gestures enabled (eg: double tap to wake)?\nIn my opinion it consumes too much.. one time i got about 3% drain in about 8-9h idle with wifi on and no commute.", "time": "28th July 2017, 04:08 PM", "postID": "post73205738", "replies": []}]}, {"text": "That's why i hate android idle drain. A never-ending issue.\n\nSOT only 34 mins, 1h mobile data, the rest on wifi.\nI've disabled gestures, location history, no google fit, etc etc", "time": "28th July 2017, 04:11 PM", "postID": "post73205782", "replies": []}, {"text": "Not bad here. About .3% per hour overnight. So about 2% overnight. That's on 4G as I rarely ever have my phone on WiFi. I also have email at to push (2 accounts) and I usually turn off the sync stuff in my Google account. Things like app data, calendar, contacts and the rest. I just sync when I make changes like adding a contract I then toggle the contacts on then off kind of thing. No need to let it sync all day and night for nothing imo.", "time": "28th July 2017, 04:25 PM", "postID": "post73205930", "replies": []}, {"text": "I just have that drain when location is set to \"high accuracy\". When its set to \"battery saving\" everthing seems fine.", "time": "29th July 2017, 11:24 AM", "postID": "post73214278", "replies": []}, {"text": "I don't know what's wrong with my device/apps. Several times now i had a standby drain in around 7 hours of 30%+. I didn't plug my phone in overnight because of Dash charging, when I went to bed, the battery was at 37%. The next morning I overslept massively and completely missed my shift because my battery died over night. This is with airplane mode on during 75% of the night. The highest drain in battery settings was displayed for \"Android System\" with around 12% or so, but that was with the last day counted in. I feel like the battery drain stats in settings are completely unreliable...\n\nExcept from that I get normal battery life during the day though, although during the first few days standby drain was higher than screen on drain...", "time": "29th July 2017, 01:17 PM", "postID": "post73215219", "replies": [{"text": "Yeah man you need to download accubattery or something to monitor the drain. That's ridiculous. And yeah I've been kinda confused about the stock battery stats as well. It seems to tell you nothing.\n\r\nI have noticed a lot more battery drain since the 911 update a few days ago. I was getting 7ish sot now I'm under 5hrs. I'll bet I'm not the only one who noticed it though. It'll be fixed don't worry.", "time": "29th July 2017, 04:17 PM", "postID": "post73216983", "replies": [{"text": "I had AccuBattery installed at first but it didn't give me any meaningful insights so I uninstalled it a few weeks later.\n\nI normally only get around 3 hours of SOT, but I'm not into mobile gaming or YouTube so that is normal...", "time": "29th July 2017, 04:25 PM", "postID": "post73217072", "replies": []}]}]}, {"text": "I notice significant drain in idle after the 4.5.6 update last week. Android system seems to be the culprit, but not sure what's process under this is actually causing the problem. \nAll radios on, and 2 mail accounts syncing.", "time": "30th July 2017, 08:49 AM", "postID": "post73224131", "replies": []}, {"text": "Idle drain is bad for me too. About 1 to 2 % an hour during the day. About 3 or 4 overnight but it should be 0 or 1 really.", "time": "30th July 2017, 09:27 AM", "postID": "post73224406", "replies": []}, {"text": "My op5 over night drain is some 5% (8hrs) , data and wifi off - recent apps cleared.", "time": "31st July 2017, 05:31 AM", "postID": "post73233825", "replies": []}, {"text": "The damn battery drain started happening after the 911 update, before that, everything was perfect. They really need to fix it fast, the battery is not even lasting 1 day right now.", "time": "1st August 2017, 02:14 AM", "postID": "post73244690", "replies": []}, {"text": "Same here. 911 update ruined my great battery life. It keep the device awake all of the time.", "time": "1st August 2017, 03:45 AM", "postID": "post73245209", "replies": []}, {"text": "I have about 1-1.5% drain per hour with turnig on all of notifications, sync from Gaps, nfc, 4G+, blutooth. It is really amazing!", "time": "15th August 2017, 10:53 PM", "postID": "post73415695", "replies": []}, {"text": "I Flashed my OP5 With OP% Oreo Beta 1 Update.\r\nThere are so many bugs in this beta version.\r\nThere is a lot of battery drain.\r\nMobile gets Hot even when i use it without a case.\r\nWidgets lost.\r\nLong Press to add widgets is also not working properly.\r\nThis Is My First Answer in XDA.\r\nHope it goes fine. I want to be an RD.", "time": "16th December 2017, 08:07 AM", "postID": "post74863177", "replies": []}, {"text": "Battery life all in all is awesome on this device, standby drain is the only issue. If this was better, then battery life would every other device easily.", "time": "18th December 2017, 10:20 AM", "postID": "post74884000", "replies": []}, {"text": "Google Chrome consume more battery and more CPU then other browsers like opera  is that true???", "time": "21st December 2017, 10:08 PM", "postID": "post74923186", "replies": [{"text": "yep it syncs a lot more though and battery loss aside it's still the best browser.", "time": "25th December 2017, 08:54 PM", "postID": "post74961011", "replies": []}, {"text": "Yeah, very true. It's why that I'll will never use chrome on my phone. I use habit browser. It's the lightest browser I've seen and maybe the most feature rich browser out there. Only problem is it's been awhile since any updates (March 2017i think) but I'm still using it with no issues.", "time": "1st March 2018, 07:42 PM", "postID": "post75739545", "replies": []}]}, {"text": "Standby drain on the official Oreo build is OK.", "time": "25th December 2017, 10:07 PM", "postID": "post74961476", "replies": []}, {"text": "1% on wifi 8h overnight with amplify and greenify donate", "time": "6th January 2018, 10:26 PM", "postID": "post75105369", "replies": []}, {"text": "Need to improve on standby drain specially is wifi is always on", "time": "15th February 2018, 08:24 PM", "postID": "post75581617", "replies": []}]}, {"title": "Heavy use endurance", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-5/review/heavy-endurance-t3646102"], "threads": [{"text": "This is a pretty light, to say at least, review section..", "time": "3rd August 2017, 04:29 PM", "postID": "post73274939", "replies": []}, {"text": "Played video for around 6 hours using MX Player with hardware decode on for both video and audio. \nWas watching MP4, MKV and HEVC content... \nFrom around 94% down to 66% in 6 hours isn't too bad. \nWas also using bluetooth headset...", "time": "3rd August 2017, 09:33 PM", "postID": "post73278107", "replies": [{"text": "6 hours of bluetooth and video and you only went down to 66% man my old nexus 6p would of died after 2 hours you sold me on this phone", "time": "10th November 2017, 09:29 PM", "postID": "post74473109", "replies": []}]}, {"text": "7-8 hours of 3d gaming. Web browsing is close to 10. Video and books - my patience wasn't enough to test that.", "time": "11th November 2017, 04:59 PM", "postID": "post74480660", "replies": []}, {"text": "Yeah easily last 6 7 hours on heavy usage (playing asphalt 8 for 3 4 hours and one hour of camera and one hour of navigation music 4g and Bluetooth were on all the times", "time": "23rd November 2017, 10:57 AM", "postID": "post74608884", "replies": []}]}, {"title": "Light use endurance", "rating": 5.0, "links": ["https://forum.xda-developers.com/oneplus-5/review/light-endurance-t3646103"], "threads": [{"text": "I live in fear that Google will pass me some #@!$%* Google Play Services, or some other update, that will tank this phone's endurance. So far, though, my OnePlus 5 has exhibited great battery performance.", "time": "28th July 2017, 12:19 AM", "postID": "post73198349", "replies": []}, {"text": "This was from a few weeks ago, few hours of data surfing web at work. The rest on wifi at home, using reading mode for most if that:", "time": "28th July 2017, 09:45 AM", "postID": "post73201967", "replies": [{"text": "Light and heavy use endurance are both awesome, even though standby drain is quite bad. Why the hell the device is kept awake for such a long time? BBS and co. don't bring light into darkness as well, nothing really special here....\n\n---------- Post added at 11:22 ---------- Previous post was at 11:21 ----------\n\n\n\r\nWhat the hell, how did you managed that?", "time": "18th December 2017, 10:22 AM", "postID": "post74884010", "replies": [{"text": "Easy !\r\nIf he works, can't play with the phone. If he got kids, can't play with the phone that much.\r\nIf you make some calls per day, few SMS, some email, baterry will last for days. If you close the phone at night even more. You can reach a week. I know. I did.", "time": "14th January 2018, 03:10 PM", "postID": "post75195879", "replies": []}]}]}]}, {"title": "\"Look\" of the device (aesthetics)", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-5/review/look-device-aesthetics-t3646104"], "threads": [{"text": "I couldn't care less that it looks like a few other phones. It looks good and its performance meets my highest demands for my daily driver.", "time": "28th July 2017, 12:20 AM", "postID": "post73198360", "replies": []}, {"text": "iPhone close, big bezels and all.", "time": "1st November 2017, 04:47 AM", "postID": "post74365278", "replies": []}]}, {"title": "Quality feel (use of materials)", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-5/review/quality-feel-materials-t3646105"], "threads": [{"text": "Nice, clicky on/off switch and volume rocker. Notification switch is stiff, but that's okay. The phone's a slippery devil, but I like a little skin on it and that makes it as grippy as it needs to be.", "time": "28th July 2017, 12:22 AM", "postID": "post73198368", "replies": []}]}, {"title": "Ergonomics (in-hand feel)", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-5/review/ergonomics-hand-feel-t3646106"], "threads": [{"text": "It feels very good in hand, a bit slippery but the metal back is so cool! I much prefer over glass back (which i started to hate).\n\nFor a 5.5inch display it feels quite compact in hands, dou i prefer 5inch.", "time": "26th July 2017, 06:58 PM", "postID": "post73183010", "replies": []}, {"text": "It's feels so much compact as is mentioned above really for 5.5\" it's super. Also that feeling is hand is for me orgasm I just can't take it away from hand if I won't use cover so good it is.", "time": "26th July 2017, 07:59 PM", "postID": "post73183725", "replies": []}, {"text": "Held vertically, the phone is great.  It's definitely a two-handed phone, as my thumb on the hand holding the phone only reaches ~70% of the screen.\n\nHorizontally, I find it way too easy to cover the speaker grille, muffling the sound from there.", "time": "26th July 2017, 09:17 PM", "postID": "post73184506", "replies": []}, {"text": "It is a bit slippery and it has a sharp edge on the sides, which makes it a bit uncomfortable after you hold it horizontally for extended time. \nThe speaker location is not the best one, as I often accidentally cover it.", "time": "26th July 2017, 10:02 PM", "postID": "post73184973", "replies": []}, {"text": "This is my biggest phone yet. Still trying to adapt to that. I would never use this phone without a cover. It's too slippery.", "time": "27th July 2017, 02:47 PM", "postID": "post73192611", "replies": []}, {"text": "Well everything here is true. It is slippy and bit sharp on edges but still as my first post here it's orgasm giving feel (atleast for me)  also you need sometimes use two hands or move your phone in one hand to reach top (for status bar) but since I have nova launcher I just swipe in middle of screen so status bar slide down so that's ok for me.\nAnd in horizontal position well you cover you speaker but personaly it's not big deal even if they switched side with jack it would be much better.", "time": "27th July 2017, 06:33 PM", "postID": "post73195176", "replies": []}, {"text": "The phone backside feels slippery, but i bought a tpu case for it so that it is alot better to keep in my hands than without. Holding the phone in landscape and watching videos needs to be learned because your finger covers the loudspeaker which affects the sound alot. \n\nThe buttons are placed where i usually want to have them. Comparing to LG g5 that has a button in the back, i just lay my finger on the homebutton which unlocks my phone.", "time": "27th July 2017, 08:19 PM", "postID": "post73196344", "replies": []}]}, {"title": "OEM skin/software", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-5/review/oem-skin-software-t3646107"], "threads": [{"text": "I haven't had much urge to flash a source-built ROM on this device. OOS gives you a lot of features while still maintaining the AOSP-style look.  I'm running some OOS-based ROMs, but nothing AOSP/CAF based yet.", "time": "26th July 2017, 09:57 AM", "postID": "post73177130", "replies": []}, {"text": "Oxygen OS for me personally it's the best OEM \"improvements\" over stock Android.\n\nHowever i don't like that we have no scheduled DND (you have to always move the slider to dnd position) . Very useful when you want to schedule every night dnd.. hope they will reconsider this.", "time": "26th July 2017, 07:07 PM", "postID": "post73183102", "replies": []}, {"text": "It's nice, and I will probably continue to use it until Lineage becomes quite stable.\n\nThings it's missing for me are pretty much all in the status bar.\n\nMiddle Clock\nBattery percent inside the icon\nShow battery bar on Bluetooth devices that support it.\n\nAlso, make the ambient display clickable like it is on Nexus phones. Like when the black and white screen comes on after picking the phone up or whatever, you can click the play button for media apps on Nexus phones and it starts playing, but it's non interactive on OOS.", "time": "26th July 2017, 09:10 PM", "postID": "post73184444", "replies": []}, {"text": "The only thing that I need for OOS is fully substratum support. Nothing else.\n\nThe rest is good as it comes.", "time": "27th July 2017, 12:26 AM", "postID": "post73185963", "replies": []}, {"text": "Oxygen OS is, from an aesthetic standpoint, what Android ought to be and what some many other phone makers fail to achieve.", "time": "28th July 2017, 12:23 AM", "postID": "post73198374", "replies": []}]}, {"title": "Outdoor visibility (max brightness)", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-5/review/outdoor-visibility-max-brightness-t3646108", "https://forum.xda-developers.com/oneplus-5/review/outdoor-visibility-max-brightness-t3646108/page2"], "threads": [{"text": "I find I fairly often have to adjust it to its brightest (when the automatic adjustment hasn't) in full sun.", "time": "28th July 2017, 12:24 AM", "postID": "post73198384", "replies": []}, {"text": "No issues here, screen is superb. \n\nVery few issues with this phone, camera when compared to my last phone.", "time": "28th July 2017, 01:21 PM", "postID": "post73203976", "replies": []}, {"text": "What I would like to have was a better access to the brightness bar. Instead of two swipe downs from the status bar, something more easy and pratical to just quick change the brightness.\nSome AOSP roms had swiping on the status bar to change the brightness.", "time": "29th July 2017, 11:44 PM", "postID": "post73221041", "replies": [{"text": "You can swipe down with two fingers.", "time": "30th July 2017, 12:43 AM", "postID": "post73221357", "replies": [{"text": "The phone is already difficult to hold with one hand..", "time": "31st July 2017, 10:04 AM", "postID": "post73235660", "replies": [{"text": "You must be yoking. First you're told how to use two fingers rather then one finger two times. Now you can't hold it.", "time": "8th August 2017, 08:22 AM", "postID": "post73325699", "replies": []}]}]}]}, {"text": "Personally visibility on sun is not that good as I had on OnePlus One or atleast I can't read nothing not direct sun. :/", "time": "30th July 2017, 03:50 PM", "postID": "post73227713", "replies": []}, {"text": "I asked on other threads about screen legibility, and many owners told me that it's perfect readable under direct sunlight, even more than Mate 9.", "time": "30th July 2017, 11:10 PM", "postID": "post73231876", "replies": [{"text": "I got the Mate 9 Pro and One Plus 5, and honestly my Mate 9 Pro is better under direct sunlight than my OP 5.  \nIf I compare the OP 5 with my Xiaomi Mi Mix, the OP 5 is better under direct sunlight than Mi Mix.  I also got the S8 Plus and that is better than the OP 5 under direct sunlight, but not for much.\nI still love this phone.", "time": "31st July 2017, 12:29 AM", "postID": "post73232310", "replies": [{"text": "I'm in doubt between these two phones. Actually, the Mate 9 non-pro of 6gb/128gb. Could you help me with your impressions?\n\nThanks in advance.", "time": "31st July 2017, 02:06 AM", "postID": "post73232762", "replies": [{"text": "Well, I don't have the mate 9 I have the mate 9 Pro. Honestly I like both, the Mate 9 Pro is a beautiful phone, nice camera, beautiful design.  The OP 5 is a nice phone, super fast, camera not impressive, I have the jelly effect, but not bad enough for me to return my phone.\nAt the end you have to weight your options, do you want good looking phone with good pictures and great design, good battery life, go for the Mate 9.  If you want a super fast phone, with good pictures depending on the light and depending on your shaking hands, great battery life and good development support go for the OP 5.", "time": "4th August 2017, 05:03 AM", "postID": "post73280885", "replies": []}, {"text": "I had the Mate 9 Pro and replaced it with the Oneplus 5.\r\nThey both have their strengths, it comes down to what you are looking for. \n\r\nSomething that surprised me though is that I feel the display of the Oneplus 5 is actually better. Even though it's 1080 and the Huawei is 2k.\n\r\nConsidering the price difference, the Oneplus is the better phone. It's also faster and has a better battery life. \n\r\nThe Huawei has infrared port, smarter implementations in the software such as knuckle gestures, screen recording and so on.\n\r\nIn the camera department, the Huawei has a much better front camera because of the auto focus. \r\nThe rear camera is also better in the Huawei, but Oneplus gained in a little with the latest update. The Huawei camera is more consistent, whereas the Oneplus is hit and miss sometimes. \n\r\nAnd lastly the Huawei has a better design. More stylish.", "time": "6th August 2017, 06:33 PM", "postID": "post73309119", "replies": []}]}]}]}, {"text": "For me, it's decent but not great. Better than the Asus Zenfone 2 I came from, but I could definitely have some more brightness under direct Indian sunlight.", "time": "1st August 2017, 09:00 PM", "postID": "post73254360", "replies": []}, {"text": "I find it pretty hard to see the screen but....I'm 54. You younguns still have good eyes. :P LOL (As you get older your vision needs more contrast/brightness in general.) \nBut, it's not just about brightness. It's about glare/reflectivity. If there are a lot of things other than the sun, like all manner of things in the world around us projecting their shiny bits at my phone, then it's mostly unreadable. \nI'm going to try a screen protector that is not so reflective.", "time": "3rd August 2017, 11:36 PM", "postID": "post73279128", "replies": []}, {"text": "One of the best performing phones in daylight as it's oled, no problems here at all. Might need to adjust brightness at best.", "time": "6th August 2017, 11:08 PM", "postID": "post73311451", "replies": []}, {"text": "Max brightness is way too low. Wish my OP3 were alive so I could compare them directly, it looks like 5's brightness is lower.", "time": "8th August 2017, 07:45 PM", "postID": "post73332491", "replies": []}, {"text": "For me, brightness could be a little bit better.\nSwipe left and right in the status bar for brightness would be very nice.", "time": "10th August 2017, 08:28 AM", "postID": "post73349075", "replies": []}]}, {"title": "Contrast (true blacks)", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-5/review/contrast-true-blacks-t3646109"], "threads": []}, {"title": "Color saturation & accuracy", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-5/review/color-saturation-accuracy-t3646110"], "threads": []}, {"title": "Clarity/resolution", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-5/review/clarity-resolution-t3646111"], "threads": [{"text": "Despite many rants regarding the only 1080p resolution... Actually the display is very good. I am using sRGB color profile.\nI personally hope they will continue with the same resolution, i think it's better for battery and performance and for this size it's perfectly fine.\n\nPs: i've used both the s6 edge, s7 for more than 2years, and except vr (which heat the devices like crazy), no real need for qhd for a display that has <= 5.5inch.", "time": "26th July 2017, 07:03 PM", "postID": "post73183055", "replies": []}]}, {"title": "Minimum brightness", "rating": 3.5, "links": ["https://forum.xda-developers.com/oneplus-5/review/minimum-brightness-t3646112"], "threads": [{"text": "I have to use twilight.\nTill date mi phones gave best minimum brightness ever.", "time": "23rd November 2017, 11:18 AM", "postID": "post74609054", "replies": []}, {"text": "When adaptive brightness turned on it is slightly dimmer side. Although the seekbar gives more steps compare to others.", "time": "24th November 2017, 06:15 AM", "postID": "post74617502", "replies": []}]}, {"title": "Call quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-5/review/call-quality-t3646113"], "threads": [{"text": "My calls have been quite good. Have not lost one. Very clear. If anything I've had to turn down the volume occassionally. Almost as good as Moto phones re: call quality.", "time": "25th July 2017, 11:14 PM", "postID": "post73172745", "replies": []}, {"text": "this happened to me more than once, but I figured that was because the network keeps changing from 4g to 3g or 2g at my place which causes problems for ongoing calls. Wherever I have good signal strength for 4G, I don't face this issue.", "time": "26th July 2017, 05:50 AM", "postID": "post73175127", "replies": []}, {"text": "I'm a truck driver and i use my phone all day long making calls in remote areas. I have cricket wireless. This phone gets better reception and has the least dropped calls compared to any other phone i have used (Nexus 5, Nexus 6, leo eco pro 3, Samsung note 3, Nexus 4) couldn't be happier. It seems as though when you go through a bad area the phone doesn't just disconnected like my older phones it waits a few seconds.\n\nI almost returned this phone because of camera and jelly scrolling. I said I'll live with this because reception is so good it's worth the miniscule problems. I don't even notice the jelly now lol. And the camera does fairly good with Google camera app", "time": "30th July 2017, 01:57 PM", "postID": "post73226635", "replies": []}, {"text": "My only issues with calling would be some weird buzzing noises than occur during some SIP calls. Not regularly though. The ability to activate auto-call-recording is a huge plus imo, I'm a very forgetful person and always having a recording of the last call to check WHAT exactly you should bring again from the grocery store in a life-saver sometimes", "time": "30th July 2017, 04:51 PM", "postID": "post73228386", "replies": []}, {"text": "In my case its not good.it does not sound crisp.rather very gloomy tone.i dunno if its because of the mono speaker or i am using a 3g sim.and i noticed call quality a little better when making whatsapp voice call.still it lacks crispyness.", "time": "22nd August 2017, 05:38 AM", "postID": "post73491028", "replies": []}, {"text": "Do cases affect call quality, I am considering the official karbon bumper case.", "time": "4th September 2017, 07:14 AM", "postID": "post73656666", "replies": []}, {"text": "Very good clear loud and crisp sound with best cellular reception", "time": "23rd November 2017, 11:19 AM", "postID": "post74609064", "replies": []}, {"text": "Call quality on op5t is amazing. I have never been experienced this level of quality before even over the high speed internet call. I have made a conference call using VoLTE and HD symbol was there. Also recorded the call and it was loud and clear.", "time": "24th November 2017, 06:12 AM", "postID": "post74617481", "replies": []}]}, {"title": "WiFi strength, range, and throughput", "rating": 4.0, "links": ["https://forum.xda-developers.com/oneplus-5/review/wifi-strength-range-throughput-t3646114", "https://forum.xda-developers.com/oneplus-5/review/wifi-strength-range-throughput-t3646114/page2", "https://forum.xda-developers.com/oneplus-5/review/wifi-strength-range-throughput-t3646114/page3"], "threads": [{"text": "WiFi is absolutely horrible for me compared to my Exynos Galaxy S7 and Snapdragon Galaxy S8, any walls in between and packet loss becomes an issue and the signal deteriorates a lot when I'm in my bedroom, with my S8, I have full bars, about 400Mb/s speed and zero packet loss. With the OnePlus 5, I get about 130 Mb/s and about 5% packet loss. \n\nEven in full range I get about 600Mb/s on the S8 and 300Mb/s on the OnePlus 5.", "time": "26th July 2017, 06:45 AM", "postID": "post73175536", "replies": [{"text": "Interestingly, I found OP5 for me to perform the same, if not slightly better than my brothers S8.  I tested a 5GHz network and both devices appeared to have the same bandwidth (reading Signal check Pro readings in dBm and thresholds.) Maybe I'll need to do a more thorough test though. \n\nNeedless to say.  It is 100% better than the 3T wifi performance due to 2x2 MIMO support.", "time": "26th July 2017, 09:56 AM", "postID": "post73177115", "replies": []}, {"text": "It may be because of manufacturing defect. Everybody who has purchased OnePlus 5 complains about the network issue. Check here; forums.oneplus.net/threads/wifi-issue-with-oneplus-5.555048", "time": "14th September 2017, 11:32 AM", "postID": "post73787937", "replies": [{"text": "That's not the issue I'm having, I'm not having any issues, the WiFi and LTE on the OnePlus 5 simply isn't as good as the Galaxy S7 and S8", "time": "14th September 2017, 09:36 PM", "postID": "post73794587", "replies": []}]}]}, {"text": "Yeah, i got half the throughput of s7 in same spot. Wifi @ 2.4ghz.\n\nAlso what i don't like about the wifi is that it drains more than many other devices(old devices). In idle or in use.", "time": "26th July 2017, 06:35 PM", "postID": "post73182742", "replies": [{"text": "This", "time": "3rd August 2017, 05:20 AM", "postID": "post73269311", "replies": [{"text": "As of 4.5.8 update, WiFi drain is no longer there.  Much better now.", "time": "10th August 2017, 07:53 PM", "postID": "post73355871", "replies": [{"text": "Wrong", "time": "11th August 2017, 06:22 AM", "postID": "post73359866", "replies": [{"text": "Are you ROM'd or running a custom kernel?  Possible you are not running kernel with WiFi patch.", "time": "11th August 2017, 02:01 PM", "postID": "post73363576", "replies": [{"text": "I am on the official 4.5.8 firmware. All stock!", "time": "11th August 2017, 03:54 PM", "postID": "post73364983", "replies": []}]}]}]}]}]}, {"text": "some times i get poor wifi connection with dead slow speed even when i am close to the router", "time": "2nd August 2017, 07:28 AM", "postID": "post73258119", "replies": []}, {"text": "Horrible speeds even with full bars, most of the time it slows to a dead crawl 1-5 KB/s if I'm lucky, on the 5GHz band.\nI usually have to turn off WiFi then turn it back on at least 2 times for it to come back alive, even then I get terrible speeds @ work where there's gigabit AC WiFi, which will be 5 MB/s max on this phone.\nEven after the 4.5.7 update, WiFi is still garbage on 5GHz, 2.4 GHz is 'just OK' compared to what I'm used to with my Moto X pure.\n\nReally thinking about RMA'ing the device. Honestly, I should've just returned within the 15 day window now that I think about it...", "time": "2nd August 2017, 04:08 PM", "postID": "post73263229", "replies": []}, {"text": "I have nothing to say about Wifi except that it is working excellent.\r\nFull speed 100/100 with a thin wall between the router.\r\nAlso, outside the house I get way more strength than my previous phone (LG G4)", "time": "3rd August 2017, 10:40 AM", "postID": "post73271531", "replies": []}, {"text": "Sooooo.... nobody else's WiFi times out? Stops at a dead crawl?", "time": "10th August 2017, 11:08 PM", "postID": "post73357508", "replies": []}, {"text": "4.5.8 - FreedomOS - 5ghz ; MCS256 - HT80 width. Works pretty good (I can probably get better upstream results if I do it off the internal network only rather than going via my Fibre connection.\n\r\ntl;dr - 411.3mbps rx, 90.37mbps tx.", "time": "11th August 2017, 05:51 AM", "postID": "post73359684", "replies": []}, {"text": "And have you run a Wifi Site-scan recently? It's more than possible you've had neighbors add/change wireless bands around since you put your stuff in. I generally do a site scan everymonth and tweak my frequency choices to avoid collisions where possible.", "time": "12th August 2017, 06:56 AM", "postID": "post73371900", "replies": []}, {"text": "It's not about that! There are not that many networks nearby, and the wifi channel is not crowded!\nAnd on same wifi network i get much better wifi battery consumption on a good old nexus 5 (about 3x better)", "time": "12th August 2017, 09:19 AM", "postID": "post73372947", "replies": []}, {"text": "Received my device yesterday. Updated to latest 4.5.8. Facing wifi issue. My 100mbps connection is shown as 40-50mbps in my device while it's recording full speed in other devices. Also I lose 5-6℅ battery overnight which sucks. Hope oneplus team fix it via ota update", "time": "13th August 2017, 03:31 AM", "postID": "post73381881", "replies": []}, {"text": "Next to my router I get my 100mbps which is the speed that comes to my house", "time": "8th September 2017, 05:24 AM", "postID": "post73710467", "replies": []}, {"text": "My connection is 150/150 Mbps and I used to get 150/5 on the OP5. My OPO actually had full speed so it was not my router. After some talks with OP support and 4.5.10  that fixed IPv6 connections my speed is now about 150/140. Although I didn't realize 2.4 GHz was so slow at around 25/80? I don't know what to say about that.", "time": "10th September 2017, 06:06 AM", "postID": "post73735700", "replies": []}, {"text": "Mine seems better than the Snapdragon s8 I switched from, but I don't know if it's the older router where I live was glitching out for a few days and then got better or what. \n\nStreaming from my s8 to my Chromecast kept freezing and my PC wifi adapter was showing no internet access on the wifi network also. Once I switched to the OnePlus 5 I've had no issues at all with the Chromecast and I haven't tried the PC since it wasn't working. \n\nI only had the s8 for a few days since I moved to my new place so I don't know for sure. All I know if everything started working fine once I got the op5.", "time": "15th September 2017, 05:20 PM", "postID": "post73804462", "replies": []}, {"text": "my wifi works very well. just as well as my s8. i get 500 Mb up and down from the next room over on 5g. the usual ~40Mb on 2.4g.", "time": "27th September 2017, 05:07 PM", "postID": "post73953897", "replies": []}, {"text": "Wifi disconnection on call sometimes feels different", "time": "15th February 2018, 08:30 PM", "postID": "post75581668", "replies": []}]}, {"title": "Cellular strength and throughput", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-5/review/cellular-strength-throughput-t3646115"], "threads": [{"text": "Device runs fantastically on T-Mobile network.  This is Band 4 (20mhz) + Band 2 (10mhz) speed test.  I haven't hit 3xCA yet but I know I will soon.", "time": "26th July 2017, 09:53 AM", "postID": "post73177088", "replies": []}, {"text": "It's very fast. The image below I got yesterday but in areas I would get 25-30mbps I sometimes only pull 3-5mbps down and the upload will still be 15mbps. Kinda strange. But even at those slower speeds anything I do browser or youtube is instant. So not sure if the app is wonky with the OP5. I mean I shouldn't be able to stream 1080p YouTube content with 2-4mbps download speeds, but I do.", "time": "26th July 2017, 02:47 PM", "postID": "post73180121", "replies": []}, {"text": "Does anyone use 3g instead of 4g? The problem I'm faceing is that it takes sometimes 5-10 sec before it starts loading the site when using 3g. This problem does not occur when using 4g. I didn't experience the same problem with my Oneplus 3", "time": "27th July 2017, 06:27 PM", "postID": "post73195104", "replies": [{"text": "I experience exactly the same problem. \nWhen I'm on 3g I can't load anything the first 10 seconds when screen is switched on. I have tested several SIM cards in my op5 (everything works fine with other phone)\nIt's extremely annoying", "time": "21st October 2017, 10:31 PM", "postID": "post74246858", "replies": []}]}, {"text": "i have very bad reception with my OP5. At Places where my OP3 had 3G or even 4G the OP5 has E or sometimes no internet... Only at places like a forest or in a basement under an airport (where i work) but my old OP3 has great reception with the same SIM card. Maybe i use the wrong settings or wrong SIM slot?", "time": "10th August 2017, 09:28 PM", "postID": "post73356817", "replies": []}, {"text": "does the op5 has \"Dual SIM Dual Active type\" of cellular connection?", "time": "17th September 2017, 03:53 AM", "postID": "post73821450", "replies": []}, {"text": "Best in class never experienced any problem.\nIn parts of Rajasthan where cellular reception is very bad, everyone runs toward me to have a call", "time": "23rd November 2017, 11:17 AM", "postID": "post74609041", "replies": []}]}, {"title": "Speakerphone (loudness, clarity)", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-5/review/speakerphone-loudness-clarity-t3646116"], "threads": [{"text": "Pretty happy with the speakerphone performance.", "time": "25th July 2017, 09:44 PM", "postID": "post73171966", "replies": []}, {"text": "No sterospeaker quite disappointing. Volumn is amplified i guess so i think this may lead to damaging the speaker very soon", "time": "26th July 2017, 06:29 AM", "postID": "post73175425", "replies": []}, {"text": "Speakerphone is glorious.  Very loud and clear.", "time": "26th July 2017, 09:53 AM", "postID": "post73177098", "replies": []}, {"text": "Speaker phone is fine. No need to boost it like I had to with my 6P. What I want is the vibration to be stronger. I mean hell, I can't ever feel it on my pocket and forget hearing it if it's 3 feet away from me on the desk. I tried EX kernel and set the vibration to 100% and it wasn't much different. Vibration motors should be super strong with the ability to reduce intensity as one sees fit.", "time": "26th July 2017, 02:52 PM", "postID": "post73180180", "replies": []}, {"text": "The speakerphone is loud but tiny/flat. And distorts at high volume.\n\nSo, not that good quality.", "time": "26th July 2017, 06:37 PM", "postID": "post73182772", "replies": []}, {"text": "The speaker sounds clear but it is not so loud as i expect. It feels a bit distorted at high volumes.", "time": "27th July 2017, 08:31 PM", "postID": "post73196481", "replies": []}, {"text": "Its loud and clear however while gaming at high volume it starts to sound like a cheap radio", "time": "23rd November 2017, 11:19 AM", "postID": "post74609060", "replies": []}, {"text": "Its clear but it also sounds harsh and distorted at high volumes. Its great for speech but not the best for music. TBH....quite disappointed.", "time": "15th December 2017, 07:38 PM", "postID": "post74858877", "replies": []}]}]