[{"title": "[Feng5 rom review]nexus experience 10.4 for mot0 x 2014 review", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x-2014/general/-t3464034"], "threads": [{"text": "2. Special function\nThis ROM support ambient display and live display. You can change the RGB in color calibration to fix the yellow screen problem .\nIt also support moto gesture, like twist for quick capture and chop twice for flashlight.\nYou can change which app can start when the phone boot up in memory menu.\nTheme engine is support cm theme pack,. It also can customize.\nThere is the one-click-clear  button in recent app list.\nYou also can back to previous app by holding recent button and lock screen by double tapping navigation bar.", "time": "18th September 2016, 12:43 PM", "postID": "post68745010", "replies": []}, {"text": "3. Performance \nI think this ROM is smooth in mostly time. In balance mode(this ROM have three battery mode: performance, balance ,power save). The geekbench4 result is about 1000(single-core) and 2500(multi-core). Let's see some screenshots(based on balance mode):\nSetting slides smoothly.\nGoogle now slides a little bit laggy.\nPlay store doesn't slide smoothly. \nScreenshots(based on performance mode):\nEverything is more smoothly.", "time": "18th September 2016, 12:50 PM", "postID": "post68745111", "replies": []}, {"text": "4. Battery life\nBattery data log:\n9/13\n0:07(100%)-21:45(29%)\nSOT(screen on time)   2h58m56s 556mah\nCell standby(LTE)   189mah\n\n9/14\n23:26(100%)-21:30(11%)\nSOT   4:57:30  907mah\nCell standby  366mah\n\n9/15 \n0:00(100%)-17:27(15%)\nSOT   4:10:01  802mah\nCell standby    247mah\n\n9/17\n0:00(100%)-22:27(31%)\nSOT     3:49:23   785mah\nCell standby  295mah\n\n9/18\n0:00(100%)-21:28(5%)\nSOT  5:8:55 1090mah \nCell standby 303mah\n\nI think battery life is much better than Miro's stock ROM. I just used ice box to freeze some apps that I seldom use. I don't use any battery save apps like greenify or prevent running.", "time": "19th September 2016, 05:26 AM", "postID": "post68756051", "replies": []}, {"text": "5.Summary \nI think this ROM is great. Battery life is great. The system is smoothly in most time. Many special functions are useful. But sometimes when you swipe to unlock your phone , you can feel laggy.\nMaybe this is a little bug and it doesn't  matter. \nSo, finally ,I think this ROM can be a daily driver.\nIt is stable now and without huge bug.\nSorry for my poor English .", "time": "19th September 2016, 05:39 AM", "postID": "post68756149", "replies": []}, {"text": "are u really sure Nexus based cm?I remembered it was based aosp not cm", "time": "20th September 2016, 12:07 PM", "postID": "post68775373", "replies": [{"text": "Oh,nexus experience is based on aosp. I already corrected in this article. I forgot this important thing", "time": "20th September 2016, 01:08 PM", "postID": "post68776124", "replies": []}]}]}, {"title": "Android N Preview 2 Emoji (Flashable Zip)", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x-2014/themes-apps/-t3364321"], "threads": [{"text": "Or you can download Emoji switcher on Play Store ! Easy and more choice", "time": "9th May 2016, 04:30 PM", "postID": "post66770433", "replies": []}]}, {"title": "[REQ] Android M Preview 3 boot animation for Moto X 2014", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x-2014/themes-apps/-t3181010"], "threads": [{"text": "http://forum.xda-developers.com/nexu...2#post62381522", "time": "18th August 2015, 06:41 AM", "postID": "post62381596", "replies": [{"text": "Thanks for the link! I replaced the existing boot animations in the following locations:\n\r\n\\DATA\\Local\\MOODLE  <---New Moto 'thread and needle' animation\r\nand\r\n\\SYSTEM\\MEDIA\\    <---Old Moto 'global' animation\n\r\nBoth of those animations contain mp4 animations. I replaced with the one you linked and rebooted...unfortunately only the tail end of the animation cycles. I may look into converting this animation into a MP4 in case that will help.", "time": "18th August 2015, 01:55 PM", "postID": "post62386139", "replies": [{"text": "Correction to my post - I was able to get the boot animation working fine. I did all the steps quoted above, in addition to changing the permissions on the bootanimation.zip file to RW+R+R. The animation plays properly and looks great too.", "time": "20th August 2015, 12:19 AM", "postID": "post62411718", "replies": []}]}]}, {"text": "I flashed it number of times.. still stuck with Moto default boot. \r\ni have bootanimation-encrypted.zip file.. Should i remove it den flash?\r\nPlz suggest.", "time": "19th August 2015, 08:59 AM", "postID": "post62399738", "replies": [{"text": "It's not a flashable zip. It needs to be manually copy/pasted to /system/media on the root partition of your device.  You also need to set the correct permissions to  rw-r--r--.", "time": "19th August 2015, 09:19 PM", "postID": "post62409674", "replies": []}]}]}, {"title": "Notification text preview in status bar not showing", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x-2014/help/-t3188503"], "threads": []}, {"title": "[Q] Question: Android M Developer preview porting", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x-2014/help/-t3122648"], "threads": []}, {"title": "[REVIEW] ToastMade Walnut Cover for Motorola Moto X 2014", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x-2014/accessories/-t2982123"], "threads": [{"text": "I'm on my 2nd Toast skin, and it's as nice as ever. Perfect for those of us who couldn't decide whether we wanted a permanent wood back or not.", "time": "25th December 2014, 01:57 PM", "postID": "post57740119", "replies": []}, {"text": "Does anyone else use these skins?  I would like to see some pics.", "time": "23rd February 2015, 05:56 AM", "postID": "post59029546", "replies": []}, {"text": "could  theese skins be used instead of the original back cover? since it is also only glued to the back?", "time": "27th February 2015, 11:48 AM", "postID": "post59116408", "replies": []}]}, {"title": "Skinnova Gadgetshieldz Premium Skins Review", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x-2014/accessories/-t3040933"], "threads": []}, {"title": "[REVIEW] i-Blason Prime Series Dual Layer Holster Case", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x-2014/accessories/-t2989022"], "threads": [{"text": "I think they market the identical case under the Fossman name too.  I have one for my Moto G and also only use it when active/traveling.", "time": "12th January 2015, 11:45 PM", "postID": "post58132541", "replies": [{"text": "Me too. Yesterday a tried to use the holster for a complete day and I couldn't.\n\nIt's still a hassle to take the phone out with one hand \nand the volume buttons get pressed every time you put it in. \n\n\n\n\n\n\n\nYou're right after days of use it is less prone to attract stuff to it. \n\nAlso noticed that the silicon fit is not as tight as the first days but at least the hard  plastic wrapping it keeps it in place.", "time": "18th January 2015, 01:49 PM", "postID": "post58255747", "replies": []}]}, {"text": "I use to run the Trident cases on all my devices..the \"SUPER MAGNET\" part, will probably go away after a few weeks of use..the silicone trim, when new, attracts ever particle of lint and dust, but I found, after a few weeks of use, the \"stickiness\" (newness) of the silicone goes away, and attracts alot less particles..\n\nsent by my:\n4.4.4_21.11.17.titan\nXT1064 Moto G (2nd Gen.)\nhttp://waynekent.com/page6.html\n\"Praise Jah\" YOU people.!", "time": "18th January 2015, 12:24 PM", "postID": "post58254319", "replies": []}]}, {"title": "[Q] How to enable scrolling text message preview in notification bar?", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x-2014/help/-t3001183"], "threads": [{"text": "Lollipop killed that feature in favor of heads up, as far as I know.", "time": "13th January 2015, 05:19 AM", "postID": "post58136763", "replies": []}]}, {"title": "Body Glove SATIN case - updated with review", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x-2014/accessories/-t2968127", "https://forum.xda-developers.com/moto-x-2014/accessories/-t2968127/page2"], "threads": [{"text": "I purchased this case from eBAy a couple of months ago. I like it, I switch between this case and the Hula bumper.", "time": "11th December 2014, 04:06 PM", "postID": "post57425372", "replies": []}, {"text": "Thanks for the pics but you said a few months ago? Lol man I have been checking for new cases a few times since I got the phone and never saw this case. Think the biggest problem is perhaps finding cases due to the official name being the same as last years.\n\r\nThink motorola needs to make an official name sequence or something like htc did with the HTC one m7 and m8. I think making the model year part of the name would be cool; like cars and most other things with wheels.", "time": "11th December 2014, 04:54 PM", "postID": "post57426610", "replies": [{"text": "Yeah I was searching on eBay for cases and came across the listing. I was nervous that it was going to be for the 2013 model but the description said 2nd generation so I gave it a try. It's really hard to find cases for the phone, one thing I look at in the pics are to see which wallpaper they show in the phone. Sometimes that helps to distinguish the different models. Try searching with 2014 and/or 2nd generation in your searches.  \n\r\nMotorola definitely should update the naming convention on these phones.", "time": "11th December 2014, 05:19 PM", "postID": "post57427135", "replies": []}]}, {"text": "The funny part is that some case makers are too lazy to update their wallpaper image. My tudia case arrived with a cardboard of the gen1 wallpaper and initially thought they sent the wrong one until I opened it. Also body glove on the moto x shows the gen 1 for the moto x but only has a case for the gen2 which is funny and maybe why I didn't notice this one sooner since I literally went on their site a few weeks ago.\n\nYeah the naming needs to be easier to tell which model year. Oh well. Love the phone lol", "time": "12th December 2014, 03:08 PM", "postID": "post57448678", "replies": []}, {"text": "It doesn't look too shabby but historically, body glove's cases haven't been the best quality.  Will wait to hear impressions before I decide if I want to order it or not.", "time": "13th December 2014, 09:39 PM", "postID": "post57479317", "replies": []}, {"text": "Well it came in earlier than expected (woo hoo!) and I updated the OP to include some pics. \n\r\nI like the look of the case, it seems to add some bulk compared to the Tudia case I have though. It seems and feels thicker I think due to the flatter lines (back is still curved) but both cases on the table visually cant be more than 0.5mm difference. I have mixed feelings about it, I wish the case was thinner honestly but I do like it. Really need to use it a day or two so I can form an opinion on it. There are \"sharp\" edges which really help the phone feel secure in the hand. The shock factor would be no greater than any other TPU case. Overall fit of it against the moto x is solid though. The power and volume buttons are I would say for a normal adult moderate/easy to press due to the size of the openings. The Tudia requires extra force to overcome the case materials flex and the body glove one your physically pressing the button but the opening can be a bit of a restriction for some (and I dont have sausage fingers either lol).\n\r\nI would say the one flaw I saw is the molding is a bit off on one of the mics which is seen in one pic. The hole is technically in the right spot and honestly its probably fine but its like there is some molding that needs to be cut a bit which I will do to my sample.\n\r\nOverall Im looking forward to using this case for the next few days and see how it goes. Cosmetics wise I think it beats the Tudia hands down, lets see how it goes functionally.", "time": "14th December 2014, 06:15 AM", "postID": "post57486166", "replies": []}, {"text": "of what material is the honeycomb pattern inside made. I ask because of a picture posted by one Amazon reviewer.\n\n\n\r\nI don't have a leather back, but do you think it would be pressing too hard on a soft touch back. ?", "time": "14th December 2014, 01:28 PM", "postID": "post57491817", "replies": []}, {"text": "Wow thats bad but with leather I could have seen that coming. Yesterday I saw a honeycomb on my soft touch back but looked like some oils from the case since it wiped off. After a full day today I will update.\n\r\nWorst case it will give me a good excuse to mod my back. I have been googling carbon fiber material to make my own back but havent had the courage to do it just yet lol", "time": "14th December 2014, 04:30 PM", "postID": "post57495253", "replies": []}, {"text": "Thanks for the pics but you said a few months ago? Lol man I have been checking for new cases a few times since I got the phone and never saw this case. Think the biggest problem is perhaps finding cases due to the official name being the same as last years.\n\r\nThink motorola needs to make an official name sequence or something like htc did with the HTC one m7 and m8. I think making the model year part of the name would be cool; like cars and most other things with wheels.", "time": "11th December 2014, 04:54 PM", "postID": "post57426610", "replies": []}]}, {"title": "[VIDEO REVIEW] Cruzerlite Bugdroid Circuit for Moto X 2014", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x-2014/accessories/-t2957543"], "threads": []}, {"title": "[VIDEO REVIEW] Poetic Affinity Case for Moto X (2014)", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x-2014/accessories/-t2941011"], "threads": []}, {"title": "[VIDEO REVIEW] Diztronic TPU for Moto X 2014", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x-2014/accessories/-t2900657"], "threads": [{"text": "just got the same case today, and it's definitely a keeper.  I tried the Hyperion and Tudia cases but chose the Diztronic because of fit and finish.  i also have a bodyguardz tempered glass protector and it fits with case, meaning no rubbing on the lip.  with the protector on, the lip is reduced to about 1/4 mm.  i removed the bodyguardz because of poor seal around the edges.", "time": "10th October 2014, 09:29 AM", "postID": "post55935405", "replies": [{"text": "I'm waiting for the XtremeGuard Spartan Glass for mine", "time": "10th October 2014, 09:31 AM", "postID": "post55935432", "replies": []}]}, {"text": "I agree with this review. The feel of the material is excellent. It adds just enough texture to make sure it doesn't slip out of your hand, without being so grippy that it is tough to get in and out of pockets. I also agree with the comments on the buttons. I think they have a very nice tactile feel and responsiveness to them.  I don't use a case often, but when I'm going to be outside on concrete or setting my phone down where it could get knocked over easily, I like to throw a case on it. This one adds very little bulk so I am pretty happy with it. Like the reviewer, I also wish Diztronic had included a cutout for the Motorola \"M\" dimple, but it is certainly not a deal breaker.", "time": "6th November 2014, 03:33 PM", "postID": "post56546774", "replies": []}, {"text": "I got the diztronic case but don't like it.  The raised power button keeps on pressing in my pocket and causes the phone to reboot.  I actually got a cruzrlite bugdroid circuit one with cutouts for the buttons.  This one is just as good as the diztronic one.", "time": "14th November 2014, 02:33 AM", "postID": "post56736516", "replies": []}]}, {"title": "Coming from Nexus 5 L preview, back to Kitkat", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x-2014/general/-t2894854"], "threads": [{"text": "I feel you, I also came from Android l to pure edition motor car 2014. I want android phone to be released so bad!", "time": "3rd October 2014, 06:28 PM", "postID": "post55816105", "replies": []}, {"text": "Yeah, it'll be nice to see the Moto X on L, it's smooth as is, but once it gets on L it'll get a lot more smooth.", "time": "4th October 2014, 12:45 AM", "postID": "post55821259", "replies": []}]}, {"title": "Review: Motorola Moto X for Verizon Wireless", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x-2014/general/-t2881048", "https://forum.xda-developers.com/moto-x-2014/general/-t2881048/page2", "https://forum.xda-developers.com/moto-x-2014/general/-t2881048/page3", "https://forum.xda-developers.com/moto-x-2014/general/-t2881048/page5"], "threads": [{"text": "It's good that Verizon didn't mess with it too much at least.", "time": "18th September 2014, 11:34 PM", "postID": "post55535987", "replies": []}, {"text": "The more I read about this phone the more I'm going away from it. Was really exited for this phone but I really can't regress in battery life and lose wireless charging and no SD card is ruining it for me. I keep trying to justify buying it, but don't think I can do it. Im currently on a G2, which from most reviews still rates higher. \n\nI guess I'll wait and see what this Droid Turbo has to offer. At this point I only think I would need root for a current moto phone.\n\nJust my opinion.", "time": "19th September 2014, 01:07 AM", "postID": "post55537083", "replies": []}, {"text": "So where the heck is it", "time": "19th September 2014, 04:13 AM", "postID": "post55539206", "replies": []}, {"text": "So, not a readable display in the outdoors!!\r\nHere we go again? Same as last x?\nhttp://forum.xda-developers.com/moto...glove-t2753559", "time": "19th September 2014, 02:31 PM", "postID": "post55546297", "replies": [{"text": "I'm I missing something? This thread is from the OG X section and the last post is 7/14 ... way before the 2nd Gen X was available", "time": "20th September 2014, 05:25 AM", "postID": "post55558654", "replies": []}, {"text": "Blah, the 2014 X is perfectly readable in direct sunlight, even when I have polarized sunglasses on.  Unless you're purposely trying to read thousand page novels in direct sunlight you're fine.", "time": "20th September 2014, 06:36 AM", "postID": "post55559280", "replies": []}]}, {"text": "Where's my verizon x 2014", "time": "20th September 2014, 05:12 PM", "postID": "post55567258", "replies": [{"text": "Looks like the 26th with possible free promo\n\nhttp://phandroid.com/2014/09/19/moto...rizon-sept-26/", "time": "20th September 2014, 05:47 PM", "postID": "post55567878", "replies": []}]}, {"text": "Wonder if the promo is with a white front because of the shortage of black.  Would consider white but all the sensors are too noticeable.", "time": "20th September 2014, 07:49 PM", "postID": "post55569965", "replies": []}, {"text": "Verizon Moto X available in stores (and on line) tomorrow (9/26), as predicted by many websites.\n\nhttp://www.verizonwireless.com/news/...e-sept-26.html", "time": "25th September 2014, 08:46 PM", "postID": "post55670607", "replies": []}, {"text": "So, not a readable display in the outdoors!!\r\nHere we go again? Same as last x?\nhttp://forum.xda-developers.com/moto...glove-t2753559", "time": "19th September 2014, 02:31 PM", "postID": "post55546297", "replies": []}, {"text": "Where's my verizon x 2014", "time": "20th September 2014, 05:12 PM", "postID": "post55567258", "replies": []}]}, {"title": "AnandTech Review -  Moto X (2nd gen)", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x-2014/general/-t2879944", "https://forum.xda-developers.com/moto-x-2014/general/-t2879944/page2", "https://forum.xda-developers.com/moto-x-2014/general/-t2879944/page3", "https://forum.xda-developers.com/moto-x-2014/general/-t2879944/page5"], "threads": [{"text": "Wow. Thanks for the link to review which I read in its entirety. This is giving me pause and I just received email from moto that my order is in assembly stage. I may cancel the order and wait for Nexus. I also think this phone will be discounted by Xmas like last year. ;(", "time": "18th September 2014, 10:28 AM", "postID": "post55522511", "replies": [{"text": "What do you mean discontinued? The OG x was never discontinued was it?", "time": "18th September 2014, 11:44 AM", "postID": "post55523433", "replies": [{"text": "He said \"discounted\" lol\n\nIdk if the new Moto X will get discounted by much, since looking at the chipset, it's really up to date. Even the s5 hardly got a discount. I don't expect it", "time": "18th September 2014, 11:46 AM", "postID": "post55523452", "replies": [{"text": "True. But if sales are slow like last year I wouldn't be surprised at a slight reduction to move them during the holidays to compete with you know who.", "time": "18th September 2014, 12:38 PM", "postID": "post55524175", "replies": []}]}]}]}, {"text": "Wow. Thanks for the link to review which I read in its entirety. This is giving me pause and I just received email from moto that my order is in assembly stage. I may cancel the order and wait for Nexus. I also think this phone will be discounted by Xmas like last year. ;(", "time": "18th September 2014, 10:28 AM", "postID": "post55522511", "replies": [{"text": "What do you mean discontinued? The OG x was never discontinued was it?", "time": "18th September 2014, 11:44 AM", "postID": "post55523433", "replies": [{"text": "He said \"discounted\" lol\n\nIdk if the new Moto X will get discounted by much, since looking at the chipset, it's really up to date. Even the s5 hardly got a discount. I don't expect it", "time": "18th September 2014, 11:46 AM", "postID": "post55523452", "replies": []}]}]}, {"text": "Wow. Thanks for the link to review which I read in its entirety. This is giving me pause and I just received email from moto that my order is in assembly stage. I may cancel the order and wait for Nexus. I also think this phone will be discounted by Xmas like last year. ;(", "time": "18th September 2014, 10:28 AM", "postID": "post55522511", "replies": [{"text": "What do you mean discontinued? The OG x was never discontinued was it?", "time": "18th September 2014, 11:44 AM", "postID": "post55523433", "replies": []}]}, {"text": "Wow. Thanks for the link to review which I read in its entirety. This is giving me pause and I just received email from moto that my order is in assembly stage. I may cancel the order and wait for Nexus. I also think this phone will be discounted by Xmas like last year. ;(", "time": "18th September 2014, 10:28 AM", "postID": "post55522511", "replies": []}]}, {"title": "moto x MKBHD review", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x-2014/general/-t2881457", "https://forum.xda-developers.com/moto-x-2014/general/-t2881457/page2"], "threads": [{"text": "I think I have to have this phone!! LOL", "time": "19th September 2014, 11:36 AM", "postID": "post55543829", "replies": []}, {"text": "I think this and pocket now reviews are 2 of the best out there. I'm debating now if I should have ditched leather and saved $25 lol", "time": "19th September 2014, 01:34 PM", "postID": "post55545392", "replies": [{"text": "If you really like the leather get it.  put a case on it, and only pull out on nice occasions", "time": "19th September 2014, 03:14 PM", "postID": "post55547048", "replies": [{"text": "i don't think that will be necessary. they make shoes out of leather. reviewers are far from careful with review units and they were no doubt poking and prodding at them at the announcement. and if they do tear up, all you gotta do is give moto a call.\n\non a side note... dod you see how freakin fast the moto is? omg!", "time": "19th September 2014, 03:46 PM", "postID": "post55547654", "replies": [{"text": "I'm willing to bet those scuffs were probably intentional by reviewers at the event just to see if it would.", "time": "19th September 2014, 03:47 PM", "postID": "post55547676", "replies": []}]}]}]}, {"text": "Droid life review said the scuffs seem to make it look better as they accumulate. Not sure why he mentions the fact that leather doesn't like water, last I checked smartphones don't like water.", "time": "20th September 2014, 01:34 AM", "postID": "post55556547", "replies": []}, {"text": "If you own leather things you know it is sensitive to scuff, but it will still last a long time. They let a company that is expert at it provide the material so they would know ahead of time how it'll be.\n\nOverall it's a balanced review, definitely doesn't bash the device,  he have a good command of viewership so it should help introduce the phone to a few more people.", "time": "20th September 2014, 01:38 AM", "postID": "post55556575", "replies": []}, {"text": "Watching any review makes me so frustrated when I remember that Motorola brought MotoMaker to Mexico before Canada", "time": "20th September 2014, 02:04 AM", "postID": "post55556842", "replies": []}, {"text": "Thats what she said!!", "time": "24th September 2014, 12:36 AM", "postID": "post55633702", "replies": []}, {"text": "a thumbs up to the best tech reviewer on youtube. yesterday cnn.money.com said that the new moto x is the best android smartphone. The Verge had the same thing today. mark my words next year's model will have a fingerprint scanner at the dimple in the back. i find that my finger always searches that darn thing even in my pocket before pulling it out.", "time": "24th September 2014, 01:42 AM", "postID": "post55634497", "replies": []}, {"text": "I think this and pocket now reviews are 2 of the best out there. I'm debating now if I should have ditched leather and saved $25 lol", "time": "19th September 2014, 01:34 PM", "postID": "post55545392", "replies": [{"text": "If you really like the leather get it.  put a case on it, and only pull out on nice occasions", "time": "19th September 2014, 03:14 PM", "postID": "post55547048", "replies": [{"text": "i don't think that will be necessary. they make shoes out of leather. reviewers are far from careful with review units and they were no doubt poking and prodding at them at the announcement. and if they do tear up, all you gotta do is give moto a call.\n\non a side note... dod you see how freakin fast the moto is? omg!", "time": "19th September 2014, 03:46 PM", "postID": "post55547654", "replies": []}]}]}]}, {"title": "GSMArena moto x 2014 review", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x-2014/help/-t2878639"], "threads": [{"text": "That's the thing. I don't want to accept 12 hrs as a good thing, when I could have 24 for example, plus other makers are doing it, even with smaller form factors (Sony Z3c) so I stand by my opinion that Moto dropped the ball with a small battery, especially as the new display is more battery hungry.", "time": "18th September 2014, 06:47 PM", "postID": "post55531219", "replies": [{"text": "I do agree that Moto could have done better with the battery size, but every person is different in what satisfies them in terms of battery. Totally understandable. I just need it to last half a day. I also have an external battery pack, so I am not too worried about not charging", "time": "18th September 2014, 06:52 PM", "postID": "post55531325", "replies": []}]}, {"text": "With the same usage moto x lasts more then my old s3", "time": "19th September 2014, 02:01 AM", "postID": "post55537748", "replies": []}]}, {"title": "PhoneArena Moto X review", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x-2014/general/-t2873118", "https://forum.xda-developers.com/moto-x-2014/general/-t2873118/page2"], "threads": [{"text": "I wish they'd compare it to the moto X 2013 battery life.  If it's the same or slightly better I can manage that.  If it's worse, then it's definitely a no-go.  Hopefully Nexus doesn't disappoint.", "time": "10th September 2014, 04:44 PM", "postID": "post55361795", "replies": []}, {"text": "Phonearena is a bit over the top with they're assessments.  They always rank phones so much lower than even the average customer.  Just look at the reviews of other moto x and nexus 5 etc customers always rate higher. I'll take the average persons word over these overly analytical reviewers", "time": "10th September 2014, 05:19 PM", "postID": "post55362506", "replies": []}, {"text": "This Phone Arena review mentions that there is only one speaker whereas specs sheet posted by them after the review has stereo speaker written in it. What to be believed?", "time": "10th September 2014, 07:02 PM", "postID": "post55364523", "replies": [{"text": "Do some research for god's sake. It's been answered three times in the same thread in the General section.", "time": "10th September 2014, 07:05 PM", "postID": "post55364596", "replies": []}, {"text": "It's been confirmed that it's single speaker, it even say so on motorola.com. But the speaker is supposed to be plenty loud. Not sure how good the audio quality is yet, but the quality of the previous X was good.", "time": "11th September 2014, 04:03 PM", "postID": "post55382328", "replies": []}]}, {"text": "Don't know but to me if the G has stereo why wouldn't the X makes nonsense", "time": "10th September 2014, 07:05 PM", "postID": "post55364580", "replies": []}, {"text": "There's also conflicting info on here so research only helps when facts are straight", "time": "10th September 2014, 09:33 PM", "postID": "post55367463", "replies": [{"text": "The facts ARE straight, there's only one speaker and it's on the bottom. I even posted proof of that in another thread. Read any review and most of them mention this. Look at Anandtech's hands on.", "time": "11th September 2014, 04:12 AM", "postID": "post55372884", "replies": []}]}, {"text": "Read the review, okay on all parts, but what's wrong with the camera samples? Just look at those low light shots (especially the road one and also another over the top view one), those look simply garbage. Was the shooter drunk?", "time": "11th September 2014, 02:26 AM", "postID": "post55371605", "replies": []}, {"text": "Maybe but when multiple voices say multiple things it tends to get confusing", "time": "11th September 2014, 02:37 PM", "postID": "post55380690", "replies": []}, {"text": "This Phone Arena review mentions that there is only one speaker whereas specs sheet posted by them after the review has stereo speaker written in it. What to be believed?", "time": "10th September 2014, 07:02 PM", "postID": "post55364523", "replies": []}, {"text": "There's also conflicting info on here so research only helps when facts are straight", "time": "10th September 2014, 09:33 PM", "postID": "post55367463", "replies": []}]}]