[{"title": "Overall love", "rating": 4.5, "links": ["https://forum.xda-developers.com/axon-7/review/overall-love-t3430714", "https://forum.xda-developers.com/axon-7/review/overall-love-t3430714/page2", "https://forum.xda-developers.com/axon-7/review/overall-love-t3430714/page3", "https://forum.xda-developers.com/axon-7/review/overall-love-t3430714/page9"], "threads": [{"text": "I'm extremely pleased with this phone, especially for $400! Only issues I've had were software conflicts with Dolby Atmos. Once I figured that out, I'm completely happy!", "time": "2nd August 2016, 03:01 PM", "postID": "post68011004", "replies": [{"text": "How do u get Atmos to work?", "time": "5th August 2016, 12:41 AM", "postID": "post68047783", "replies": [{"text": "2 Days with it and i'm pleased with this device ( coming from LG G4 H811 ) what will make me love even more and keep it till the SD823 or SD830 devices will be Unlock Bootloader + Root, having the ability to Change DPI per App with Xposed (miss Gravity Box and App Settings ) is a HUGE plus , but let hope for ZTE to release an OTA with unlock bootloader  \n\n\n\r\nyou either Turn it on using the App in  your Drawer or in your ZTE Music player", "time": "5th August 2016, 01:01 AM", "postID": "post68047925", "replies": [{"text": "The app is dead. I can't press anything in the app. It opens but that's it.", "time": "5th August 2016, 01:03 AM", "postID": "post68047945", "replies": [{"text": "check Images, Step 2 just pick what you one and tap that option to setup everything else", "time": "5th August 2016, 01:16 AM", "postID": "post68048049", "replies": [{"text": "Tapping that power button does nothing for me :-/", "time": "5th August 2016, 01:17 AM", "postID": "post68048057", "replies": [{"text": "try Wiping Data/Cache of the Dolby App and try again", "time": "5th August 2016, 01:43 AM", "postID": "post68048233", "replies": []}]}]}]}]}]}]}, {"text": "Already ahead of you. Did that to both of the Dolby apks in apps.", "time": "5th August 2016, 01:47 AM", "postID": "post68048263", "replies": []}, {"text": "[QUOTE=DrakenFX;68047925]2 Days with it and i'm pleased with this device ( coming from LG G4 H811 ) what will make me love even more and keep it till the SD823 or SD830 devices will be Unlock Bootloader + Root, having the ability to Change DPI per App with Xposed (miss Gravity Box and App Settings ) is a HUGE plus , but let hope for ZTE to release an OTA with unlock bootloader  \n\n\nAh great someone who swapped from the G4. I got the one plus 3 but sold it within days as the screen was really weird almost blurry / fuzzy ish and the camera was so poor and frustrating. Back on my g4 now and really excited the axon popped up ! Could you let me know what you prefer about it against the g4 please especially camera and screen. Thanks.", "time": "7th August 2016, 03:45 PM", "postID": "post68081713", "replies": []}, {"text": "Being a die-hard Blackberry fan. Scheduled power on and off made this purchase worth while by itself.", "time": "12th August 2016, 03:10 PM", "postID": "post68155915", "replies": [{"text": "I didn't see that before but i love this feature, i'm extremely please with this phone so far. Just looking at the phone at how beautiful it is and it's a pleasure just to hold it.", "time": "12th August 2016, 04:16 PM", "postID": "post68156784", "replies": []}]}, {"text": "Using multiple devices a year I would say this is the first Chinese OEM outside of OnePlus that has produced a phone I would consider a good daily driver. The ROM is close to stock Android but not as close as OnePlus which for me is a bummer. I'd much rather see ZTE keep things simple as their hardware design language and features are a big step up from OnePlus for me. the dual SIM or MicroSD+SIM option along with good speakers are key selling points for me. All of the basics are here and it runs circles around my Nexus 6 performance wise for my day-to-day use which entails a LOT of email using Nine Folders Microsoft Exchange client.", "time": "17th August 2016, 01:22 PM", "postID": "post68228901", "replies": []}, {"text": "The ONLY thing that bugs me about this phone is the buttons not being backlit and spaced out a little more..\n\r\nOther than that, the phon is lightning fast, charges extremely quickly, (An hour and 10 minutes for a full charge), has a beautiful feel, and the speaker quality is out of this world", "time": "17th September 2016, 04:57 AM", "postID": "post68725866", "replies": [{"text": "Right.  If they were going to do capacitive buttons, then do it the right way! \n\n I have two Moto XT1225 -- the \"international\" version of the Droid Turbo XT1254.  Has backlit capacitive buttons, along with 5.2\" 1440p AMOLED display, 3GB RAM, 64GB internal memory, 3900 mAh battery, Qi wireless charging...\n\n\n\nThis ZTE Axon 7 is the first phone since then to really catch my eye.  But ZTE messed up the capacitive buttons.  \n\nAlso, would have loved Qi wireless being included.  I have too many tilt 3-coil chargers to throw away.  My last two phones (including LG Nexus 5) had Qi wireless and I'm not giving up that feature without a fight.    I'm keeping my 2014 Moto XT1225 another year, but I may have to buy next year's Galaxy Edge -- since Samsung at least knows and understands the die-hard Qi wireless fans.\n\nAnd before anyone comments that \"all metal\" is not compatible with Qi, HTC refuted that.  They said they COULD do Qi wireless with all metal, they just did not want to .  So, I didn't \"want\" to buy their latest phone.", "time": "18th September 2016, 04:51 PM", "postID": "post68748369", "replies": [{"text": "Wtf!!! Is your entire back cover a speaker?!?! XD That's awesome!! XD \n\n\nYeah.. I've gotten used to the capacitive buttons after about 3 days.. At night or in low light situations it's all muscle memory. \n\nI had wireless charging for my note 4 and liked it.. But type C quick charge is so fast! And so hard to put the cord in the wrong way..  I'd give it a go! \n\n\nI strongly prefer these unlit capacitive buttons to on screen buttons, they do save some battery (extremely weak argument LOL). But ZTE could have included a switch for on screen  buttons like the oneplus 3. But you know how OEMs are with giving us simple options. our tiny brains might explode from having choices. \n\nBut I gotta clarify. This is the best (Best in terms of how much I like it after using it.) Phone I've ever had. I love the simple, stable, FAST, ui. \n\nBut thinking back to my Nokia 1100... That flashlight button was awesome. Have yet to seen a smartphone do this.", "time": "18th September 2016, 05:01 PM", "postID": "post68748527", "replies": [{"text": "No, my entire back cover is Kevlar overlaid with ballistic nylon.   All the Moto XT1225 have that.   My phone will stop a bullet for me in bad/dodgy neighborhoods.  \n\n\n\nAnd while Type C quick charge is fast it's not either/or.  That was Google's silly excuse for dropping it.  You can have both.   Samsung does BOTH with the Galaxy Note 7!  If I don't want to plug in the phone, then I don't want to plug in the phone.  The CONVENIENCE of Qi is addicting.  I do plug my phone in sometimes.", "time": "18th September 2016, 05:13 PM", "postID": "post68748718", "replies": [{"text": "Rofl! That's good technology!!!! \n\nAhh, I see what you mean. Maybe the axon 14 or whatever they call the successor to this phone will have both?  fingers crossed!", "time": "18th September 2016, 05:18 PM", "postID": "post68748776", "replies": []}]}]}]}]}, {"text": "I thought long and hard about buying this phone. I watched just about every online review I could find and in the end I made the choice on the basis that I could return it within the first 30 days should I dislike it. I must say after 2 and a half days, I got nothing but love for this phone. There are a few things I dislike but they are all things I knew about from the various reviews so I already tailored my expectations prior to getting the device. If anyone is on the fence about this device, take the plunge and get it. It's well worth it.", "time": "18th September 2016, 03:27 AM", "postID": "post68739961", "replies": [{"text": "Agreed!", "time": "18th September 2016, 07:34 AM", "postID": "post68741777", "replies": [{"text": "completely agree with this ... although i think it uses a nano sim i had to order a new one as i had a micro sim 😭", "time": "18th September 2016, 07:58 AM", "postID": "post68741995", "replies": [{"text": "Same.. But it seems that more phones are progressing towards nano. So it seems to be a good thing..", "time": "18th September 2016, 08:00 AM", "postID": "post68742012", "replies": [{"text": "yeah i agree with you @MrWilsonxD just wish i'd thought about it ... doh ... my bad that not the phone really, i also noticed a marked difference in volume level between headphones, the stock ones the axon comes with are very quiet, when i plugged in my Beats they were loads better, infact the Axon drives my beats better than any other device i have connected them to, just my opinion ofcourse but i love the phone", "time": "18th September 2016, 08:57 AM", "postID": "post68742485", "replies": [{"text": "Same! In my car,  when I connected the auxiliary to the phone my speakers FLEXED! Sound was significantly louder, more clear, more fidelity, and WAY more rich, full, seat shaking bass. \n\nI used to need viper for every phone or tablet I had... But this phone kind of just makes that irrelevant..", "time": "18th September 2016, 03:13 PM", "postID": "post68746992", "replies": [{"text": "Try downloading some FLAC of songs you normally listen to at 320kbps or on Spotify. Sounds absolutely amazing in the car or through quality headphones/speakers.", "time": "18th September 2016, 08:55 PM", "postID": "post68751778", "replies": [{"text": "Yes I have WAV currently!! Aren't WAV the same quality as flac? Or is flac higher quality? I mean A 3 minute song is 60+MB XD  Thank God they included external storage!", "time": "18th September 2016, 09:11 PM", "postID": "post68751989", "replies": [{"text": "There shouldn't be any difference between how WAV and FLAC sounds! They're both lossless formats", "time": "18th September 2016, 09:32 PM", "postID": "post68752270", "replies": []}]}]}]}]}]}]}]}]}, {"text": "Despite some comments i have seen on these forums i agree with @MrWilsonxD best phone i have had, i havent found much i dont like about it !", "time": "18th September 2016, 08:14 PM", "postID": "post68751272", "replies": []}, {"text": "I'm 3 days in using this phone coming from Gal Note 3 (rooted, safestrapped, xposed !!)  It is performing flawlessly so far. True to most of the comments here the weaknesses I've experienced are camera related. I find outdoor shots perfectly fine but indoor substandard, light or no light.  My connectivity is on par with anything I've used before. I'm not experiencing any signal issues.   The fit and finish on this device is perfect and coming from Samsung plastic (last 2 devices) the added heft (minimal) is welcome. It just \"feels\" good.  Very happy with the purchase so far (almost pulled trigger on a Note 7) and what a savings!  Now on to get the update and see how that goes.", "time": "19th September 2016, 01:37 PM", "postID": "post68760749", "replies": []}, {"text": "So i found this interesting article:\n\nhttp://www.androidauthority.com/zte-...peline-717314/\n\r\nSeems like Nougat isnt far away for the Axon 7 .....", "time": "20th September 2016, 10:15 AM", "postID": "post68774188", "replies": []}, {"text": "I returned my Axon 7 today before the 2 week return period expired at best buy. After I upgraded to b27 I hoped for the modem signal, auto focus problems to be resolved but they did not and I do not want to be stuck with a future hardware problem. I hope they go pure stock android when they upgrade to Nougat and eliminate the bell. I suffered when I returned it because I liked it a lot. The beautiful screen with 538ppi, the AWESOME front facing speakers and the POWERFUL 3.5mm headphone jack! It was a pleasure to finally being able to fully drive my expensive headphones while I bike! I'm going to wait 2 weeks for the Pixel. An extra $250 gets me 7.1 without problems but hope the Pixel XL has better speakers than the HTC 10 because even thou they are not loud they provide more clarity with that subwoofer for the mids facing down (2 speakers facing down and the ear piece speaker would be great). I might consider selling the Pixel next July to pay the full cost of the 2017 ZTE Axon!", "time": "22nd September 2016, 04:49 AM", "postID": "post68803236", "replies": []}, {"text": "Just tried it for watching a movie. Those front firing speakers make a huge difference! I'll be travelling for work semi regularly so this is important to me now.\n\r\nI have to try the dual sim + sd hack next \n\r\nEdit:\r\nGotta say, this phone was awesome value! Still enjoying it. Overall it just works and I'm very happy so far.\r\nIf I were to nit pick about things, a bigger battery would be better. Coming from Mate 7, I'm used to 4100MAh of range.\r\nThe Dolby Atmos app is pretty crap. I use ViPER4Android in the Mate 7 and I am missing the fine controls. The Atmos app is quite hit and miss with adjustment and no indication of any frequencies but I'll get over it. Once I have it how I want, I won't be playing with it. Fine tune in Poweramp instead.\r\nThe power app is probably an issue for many owners but being used to the Mate 7 which has the same sort of thing, I know the pitfalls.\n\r\nI was concerned the camera could be an issue from reading on this forum but so far it works fine for my needs. I installed snap camera HD and that works well for specific uses at work. I install it in any of my phones. Best overall camera app I've found.", "time": "13th September 2017, 08:00 AM", "postID": "post73773620", "replies": []}, {"text": "I am planning to buy this as a r refurbished phone. Will it be a good idea, especially in this late 2017 ?\n\n(One of the reasons for buying this one is because of its custom rom developments and SD 820)", "time": "28th September 2017, 09:32 AM", "postID": "post73961592", "replies": [{"text": "As a great toy to successfully play around with...Yes\r\nAs a great multimedia device, stockbased...Yes\r\nAs a phone for extremly samsung-focussed guys...No\n\r\nI like it....98% stock", "time": "28th September 2017, 07:35 PM", "postID": "post73967502", "replies": []}]}, {"text": "It's very good but mine is stock, trying not to mod this phone. I want life simple now and Nougat is pretty good.", "time": "28th September 2017, 01:38 PM", "postID": "post73963610", "replies": []}, {"text": "I've had mine for about a month. Originally had a Galaxy S5, then went on to an Honor 5x which I ran a custom ROM. In December I bought an Alcatel Idol 4s, which has basically the same specs as the Axon 7 - Qualcomm 820, front speakers, rear fingerprint sensor, AMOLED display. I tried to like it but the lack of apps really frustrated me. Also the fingerprint sensor didn't work very well, only about 40% of the time would it recognize my fingerprint on the first try. The Axon 7 is thee best phone I've had and I'm really enjoying it.", "time": "27th January 2018, 05:56 AM", "postID": "post75347012", "replies": []}]}, {"title": "Community development strength", "rating": 3.0, "links": ["https://forum.xda-developers.com/axon-7/review/community-development-strength-t3430715"], "threads": [{"text": "Interestingly quiet on this thread...", "time": "22nd November 2016, 12:56 AM", "postID": "post69732975", "replies": []}, {"text": "well... there isn't too much activity right now... but I think we all have our hopes that it will get better when/if ZTE step up.\nI'm ok with the ZAD Mix ROM, root and the debloated ROM already available.", "time": "22nd November 2016, 01:41 AM", "postID": "post69733316", "replies": []}, {"text": "They are getting the finishing touches on CM 13 - everyone knows how it works by now.  Once CM 13 gets going the rom scene EXPLODES!  Give them a chance to get that going first", "time": "22nd November 2016, 04:12 AM", "postID": "post69734450", "replies": []}, {"text": "What @tabletalker7 said.  Plus I will be making some cool new flashing tools soon.", "time": "28th November 2016, 02:42 PM", "postID": "post69832594", "replies": []}]}, {"title": "Overall speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/axon-7/review/overall-speed-t3430716", "https://forum.xda-developers.com/axon-7/review/overall-speed-t3430716/page2"], "threads": [{"text": "One of the snappiest phones I've used. On par, or better than the Nexus 6p.", "time": "2nd August 2016, 03:02 PM", "postID": "post68011018", "replies": []}, {"text": "The 820 chipset seems like a decent boost coming from the 801", "time": "25th August 2016, 02:34 PM", "postID": "post68360112", "replies": []}, {"text": "Does not lag at all", "time": "5th September 2016, 05:25 AM", "postID": "post68533758", "replies": [{"text": "I do experience lag. It's not as snappy as I would expect. https://community.zteusa.com/thread/12239", "time": "5th September 2016, 09:54 PM", "postID": "post68546098", "replies": []}]}, {"text": "I recently returned my Note 7 with all bloat disabled I could manage to get lag and skipped frames every few seconds... the Axon 7 is much faster, with almost zero lag during everyday use.", "time": "8th September 2016, 03:30 PM", "postID": "post68588606", "replies": [{"text": "How does it compare to the n7.", "time": "16th October 2016, 08:41 PM", "postID": "post69162162", "replies": []}]}, {"text": "I've had it a little over 36 hours.. This thing is blazing fast AND more importantly, SMOOTH. Transitions don't feel like knee jerk reactions.. When you press the home button or recent button to me it feels like the phone said \"I was already beginning to do that.\" \n\nI was previously using a note 4 (Samsung, it's funny how I have to clarify this as there are several other note devices from other oems now!) And this axon 7 runs laps around my note 4 regardless if my phone was on touchwiz rom, stock, rooted, overclocked, custom Rom, aosp Rom... Still axon 7 smoking my note 4..", "time": "16th September 2016, 04:09 AM", "postID": "post68710284", "replies": []}, {"text": "Best thing about the phone for me is that I can put it through some heavy usage without it becoming a mini furnace in my hand. Coming from a Oneplus One and Nexus 6p which both had issues where once the phone got hot it seemed to slow down a lot, the Axon 7 hasn't had this issue. Not sure if it'll suffer the same if it does get hot but so far I haven't had any slowdowns due to excessive heat.", "time": "17th September 2016, 08:07 PM", "postID": "post68736033", "replies": []}, {"text": "I notice on my phone that it thermal throttles a lot. Unless it's cool at around 30 degrees or cooler, it won't hit 2.15 ghz and will generally top around 1.5 on the high speed cores. My antutu scores range from 70k to 140k.", "time": "18th September 2016, 01:28 AM", "postID": "post68739163", "replies": []}, {"text": "Coming from a LG G4 H812, this phone is pure unadulterated butter! Android doesn't get any smoother than this. Absolutely no complains about overall performance.", "time": "18th September 2016, 03:29 AM", "postID": "post68739977", "replies": []}, {"text": "Compared to my previous phone with a Snapdragon 801...the Axon is a rocket.", "time": "17th October 2016, 08:11 AM", "postID": "post69167955", "replies": []}, {"text": "device speed is fantastic, performance is been off the charts .", "time": "12th January 2017, 09:28 PM", "postID": "post70525316", "replies": []}, {"text": "I used to have an Honor 8. Compared to Honor 8 it is a little bit slower\nHowever I haven`t seen any phone as fast as Honor 8", "time": "3rd November 2017, 02:08 PM", "postID": "post74392697", "replies": []}, {"text": "Been enjoying mine. It's fast at anything device based. Once you go online the network can make it lag but no phone can help that. I'd like to have a play with an SD835 or Kirin 970 device but suspect I wouldn't feel so much benefit compared to coming from my Mate 7 and Find 7 up to the Axon 7.\nInterested to see what ZTE bring to the market with the replacement of the 7.", "time": "4th November 2017, 09:50 AM", "postID": "post74401419", "replies": []}]}, {"title": "App launch speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/axon-7/review/app-launch-speed-t3430717"], "threads": [{"text": "Almost instantly, this is where it excels!", "time": "2nd August 2016, 03:02 PM", "postID": "post68011034", "replies": []}]}, {"title": "Multitasking/RAM", "rating": 4.5, "links": ["https://forum.xda-developers.com/axon-7/review/multitasking-ram-t3430718"], "threads": [{"text": "I LOVE the RAM management on this phone. I opened google maps and used navigation around 10:00, listened to music, went and watched a 3 hour movie, then put about 10 more apps in memory. (Gmail, Ebay, Play Store, Textra, BlackPlayerEx, BlackPlayer, tugaBrowser, ebay, swype, and xda labs) I looked in my recents to go between apps at 19:00 and was SHOCKED that when I pressed on maps and it resumed EXACTLY where I left it. I went through all the other apps and not a single one redrew itself. I was blown away! I am truly impressed by the ram management coming from Samsung crapwiz.", "time": "17th September 2016, 05:04 AM", "postID": "post68725906", "replies": []}]}, {"title": "Scrolling smoothness", "rating": 4.5, "links": ["https://forum.xda-developers.com/axon-7/review/scrolling-smoothness-t3430719"], "threads": [{"text": "I have not encountered any scrolling stutters at all. Very smooth.", "time": "2nd August 2016, 03:03 PM", "postID": "post68011052", "replies": [{"text": "I have slight choppiness in all browsers some worse than others. That's with no other apps opened in the background. I must be the only one.", "time": "12th August 2016, 09:16 PM", "postID": "post68161008", "replies": []}, {"text": "If I may ask, what version do you have?\nBtw, I have the U.S variant.\n\n---------- Post added at 02:32 PM ---------- Previous post was at 02:23 PM ----------\n\n\n\r\n10 would be a perfect device without any choppiness. So 8.5 is with a little choppiness or slight hesitation?\nMay I also ask what version you have?\nMaybe this problem I'm having is only effecting the\nU.S version.\n\nThanks.", "time": "13th August 2016, 02:32 PM", "postID": "post68169644", "replies": [{"text": "I also have the USA version", "time": "13th August 2016, 04:10 PM", "postID": "post68170982", "replies": [{"text": "OK thanks.\n\n I also noticed a little skip while scrolling in aida64.\nTried turning off smart power thinking it may affect the performance but no luck.", "time": "13th August 2016, 04:19 PM", "postID": "post68171105", "replies": []}]}]}]}, {"text": "8.5", "time": "13th August 2016, 08:57 AM", "postID": "post68166737", "replies": []}, {"text": "Seems pretty smooth to me. I wonder how much of that is the phone and how much is the limitations of ZTE's ROM. Kinda hard to compare it to something like the Nexus 6P that is running a perfect blend of software for the hardware. I did notice the Nexus 6P (nougat) might have been ever so slightly smoother but this might have just been the nice animations.\n\r\nThe AMOLED display might be throwing some people off though. If you are displaying a pure black background with colored text (reddit apps) the AMOLED display will turn off pixels it detects as pure black. This can make the image look flickery or stuttery if you're scrolling through text. You get use to it but at first it can look like there's something wrong. If you don't like it you can always switch to a dark background instead of a black one at the expense of saved battery power.", "time": "21st September 2016, 08:30 PM", "postID": "post68798826", "replies": []}, {"text": "After using a nexus 6p with Qualcomm 810 and the ZTE axon 7 with 820, It's my strong opinion that it's a Qualcomm problem with these two socs.  The exonos 8890  in the s7 and 7s edge is a 100% smooth with all browsers. Apps open faster and games are smoother. Perhaps Samsung optimized \nThe exonos for TouchWiz. However I have a tab s \nThat has a exonos 5 octacore and is very sluggish,\nProbably due to being underpowered for that qhd screen.", "time": "21st September 2016, 09:31 PM", "postID": "post68799600", "replies": [{"text": "That's interesting, I have no experience with modern exynos phones, but the 820 does absolutely everything buttery smooth unless the phone is charging (heats up and throttles)", "time": "23rd September 2016, 10:26 PM", "postID": "post68830666", "replies": []}]}]}, {"title": "Heat", "rating": 4.5, "links": ["https://forum.xda-developers.com/axon-7/review/heat-t3430720", "https://forum.xda-developers.com/axon-7/review/heat-t3430720/page2", "https://forum.xda-developers.com/axon-7/review/heat-t3430720/page3"], "threads": [{"text": "I have not noticed any excessive heat. Probably the coolest of all my past phones.", "time": "2nd August 2016, 03:06 PM", "postID": "post68011085", "replies": [{"text": "Agree it has been the coolest phone I have owned. The other phones I have owned have both got very hot which has made the phones very slow (CPU throttling?). The Axon 7 has stayed quite cool to the touch even when using things like GPS and camera.\n\r\nNexus 6p (toaster)\r\nOneplus One (hot)\r\nHTC M7 (hot)\r\niPhone 5s (mild)\r\nAxon 7 (cool)", "time": "18th September 2016, 09:39 PM", "postID": "post68752334", "replies": []}, {"text": "Yup and Yup.... \nComparing  the Axon 7 to previous devices,  A7 win by a long shot. \nI play PSP Games (this is hard on CPU+GPU) and doesn't transform into a toaster.", "time": "3rd November 2016, 02:50 PM", "postID": "post69442287", "replies": []}]}, {"text": "Got my Axon 7 today been using it for a few hours was warm throughout my usage, gave it a charge and was really warm/hot. Battery life wasn't all that great either, people are getting 5-6 SOT with a full charge, it came with 85% out of the box and used it for around 2~2.5 hours and it was down to 20% with brightness below 50% wasn't impressed. I'm hoping it'll get better with more use  as this phone is pretty great", "time": "3rd November 2016, 12:47 PM", "postID": "post69440602", "replies": []}, {"text": "If you play all day of course you wont get 6 hrs of SoT.", "time": "3rd November 2016, 01:39 PM", "postID": "post69441280", "replies": []}, {"text": "I've gotten 6.5 hours of screen on time, but this is with conservative use: web browsing/video watching with extremely low brightness settings. \n\nWhen playing Star Wars KOTOR, I've only gotten ~3.5 hours of play time.  Brightness heavily affects the drain speed.", "time": "3rd November 2016, 10:04 PM", "postID": "post69448576", "replies": []}, {"text": "it gets barely warm enough to notice it working at all.", "time": "4th November 2016, 11:35 PM", "postID": "post69464985", "replies": []}, {"text": "Got hot in pocket while doing nothing, GSam showed 38-40 celsius. Started today, exactly after 1 week when I got it. While using it it gets warm a little, but nothing serious compared to my old phones.", "time": "15th December 2016, 04:01 PM", "postID": "post70103891", "replies": []}, {"text": "Hi guys my Axon 7 is running the latest update (7.1.1) and my battery's temperature is 29°c when idling and the room's temperature is also 29°c, but when I start using social media apps like Instagram and Snapchat ,it gets around 37° and if I use Chrome for web surfing it gets around 40°c, so is this normal for Axon 7? And also if I use so heavy multitasking like downloading over mobile data, watch online videos , two sims both activated , and ten other apps open at the same time but no games , the temperature sometimes  goes up to 45°c. What is your Axon 7's battery temperature in different situations?please also mention the room temperature that you're in. ( to see the temperature go to settings/ power manager/ battery cooling)", "time": "25th July 2017, 08:12 PM", "postID": "post73171024", "replies": []}, {"text": "With Gsam Battery, it says 43 celcius when charging or reddit/games...\n\nIt was under 35c a few weeks ago", "time": "28th July 2017, 09:20 PM", "postID": "post73208939", "replies": []}, {"text": "It is normal for many phones.\nAnd the temp alert settings of the axon7 are very useful as I sit in sunlight very often and most times forget about phone temperature", "time": "30th July 2017, 06:43 PM", "postID": "post73229462", "replies": []}, {"text": "The battery monitor reports overheat warning after 20 minutes of using the GPS app called Waze.  The temp would reach 46°C easily. I don't get this issue when I use the Google Map.", "time": "6th August 2017, 06:48 PM", "postID": "post73309254", "replies": []}, {"text": "I have seen temperatures in excess of 50C when in direct sunlight in my hot car while using GPS (no A/C in my car). \n\r\nPlaying Hearthstone in my warm room can exceed 40C, which is where I have the warning set to.\n\r\nI hope I'm not slowly killing the device or battery...", "time": "12th August 2017, 12:11 AM", "postID": "post73369615", "replies": []}, {"text": "My A2017G gets a little hot (but definitely usable) when charging. Unplug it and it'll cool down pretty quickly.\n\r\nBut then that might be because I keep the phone on all the time (got an always-on screen app running just for screen-off OK Google)", "time": "14th August 2017, 07:20 AM", "postID": "post73394721", "replies": []}, {"text": "This phone doesn't get hot. You guys don't know what's hot until you have used a Xperia M4 Aqua \nMy Xperia M4 Aqua could reach temps of steady 82C while gaming and 74C while watching Youtube", "time": "10th October 2017, 08:19 AM", "postID": "post74103028", "replies": []}, {"text": "I've been getting issues using mine as a GPS with here maps. Battery heat warnings and yes, it felt hot, not to mention the app is causing navigation problems a lot.\r\nInstalled TomTom, see if it works better. It has some better UI and settings already.\n\r\nIf it doesn't run cooler I might buy a dedicated GPS but really don't want another device in the car.....", "time": "17th October 2017, 03:10 PM", "postID": "post74192200", "replies": [{"text": "That's really weird, my phone never gets hot while using GPS and driving. Are you sure you're not putting the phone in direct sunlight?", "time": "18th October 2017, 08:51 AM", "postID": "post74201611", "replies": []}]}, {"text": "Yeah, of course it had sun on it. You need it able to access GPS signal reliably for good navigation.\nIt was in a screen mount. I was using it heaps today on TomTom app with much more success and less heat. Seems there's something not right with Here Maps.", "time": "18th October 2017, 01:20 PM", "postID": "post74204137", "replies": [{"text": "You don't need the sunlight directed onto the device.\r\nI got a mount on my with a shieldscreen to protect it from sunlight so it won't get cooked. I am guessing you're enjoying a cooked phone while driving", "time": "19th October 2017, 08:54 AM", "postID": "post74214936", "replies": []}]}, {"text": "Shieldscreen?\r\nIs that a product you can buy or something you made?\n\r\nOf course I would like to have the sun off my Axon", "time": "19th October 2017, 10:32 AM", "postID": "post74215759", "replies": []}]}, {"title": "Low light", "rating": 2.5, "links": ["https://forum.xda-developers.com/axon-7/review/low-light-t3430721", "https://forum.xda-developers.com/axon-7/review/low-light-t3430721/page2", "https://forum.xda-developers.com/axon-7/review/low-light-t3430721/page3", "https://forum.xda-developers.com/axon-7/review/low-light-t3430721/page4"], "threads": [{"text": "Low-light is horrible picture\n\nSecond is made with s7 edge", "time": "2nd August 2016, 02:17 PM", "postID": "post68010360", "replies": []}, {"text": "Disappointed here, but I knew this was an issue going in. Not as bad as some phones I've had though, but should be better.", "time": "2nd August 2016, 03:07 PM", "postID": "post68011111", "replies": []}, {"text": "I wonder what the chances are that this can be fixed with software updates... as everyone says, the low-light pics are the only real camera problem", "time": "14th August 2016, 10:15 PM", "postID": "post68189245", "replies": []}, {"text": "question are you doing full auto or using manual mode to capture this low light pics ? Have you tried other apps to see if it makes it any better low light pics ?", "time": "16th August 2016, 08:10 PM", "postID": "post68218719", "replies": []}, {"text": "After some testing, i found that the lens is capable for decent low light shots if you use the manual mode...unfortunately seems that the auto mode has some problems..also i found that is better to take shots in 12mp mode instead of 20mp (even if you resize the 20mp to 12mp)...i attach some 100% crops from 12mp photos..the pillow shot is really low light and the moon shot is with zoom. Of course with minimum Photoshop work the photos can be really good for smartphone.", "time": "16th August 2016, 10:33 PM", "postID": "post68220613", "replies": []}, {"text": "They should had stick with a smaller MP.  \nThe reason low light sucks because the sensor size is too small for 20 MP. \nThere's a reason all Nexus 6P/5X and Samsung went to smaller MP to achieve better low light camera.  \nThe opposite is true for iPhone. 6s takes worse low light picture than 6 because they went to higher MP without increasing sensor size.", "time": "18th August 2016, 06:53 PM", "postID": "post68250669", "replies": []}, {"text": "Lowlight pic I snapped. Tried to expose for general scene which ended up blowing out the highlights on the sign (unrecoverable jpg). If you shoot with a steady hand and drop the shutter speed in favor of a lower iso it doesn't end up too mushy.", "time": "19th September 2016, 08:17 AM", "postID": "post68757448", "replies": []}, {"text": "My first lowlights pic with this phone. ISO 100  3.5 sec. Super soft corners, I didn't expect it to be sharp but boy this lens module is soft.", "time": "22nd September 2016, 04:01 AM", "postID": "post68802919", "replies": []}, {"text": "I've also found low-light is a lot better with manual mode, but sometimes we don't always have time to adjust. This brings hope for better software updates, however even when you go manual there's a decent amount of noise. Not sure the way around that but you do get brighter pictures.", "time": "20th October 2016, 06:50 PM", "postID": "post69224722", "replies": []}, {"text": "What about using a different camera app?", "time": "21st October 2016, 04:02 AM", "postID": "post69230647", "replies": [{"text": "Try snap camera. People seemed to be pretty happy with this app.", "time": "21st October 2016, 09:44 AM", "postID": "post69233684", "replies": []}]}, {"text": "I'm posting some pictures because it seems this part of the forum is kind of dead.\n\nTaken with A2017G, I find them pretty decent and overall they are better that what I expected. If you don't need the absolute best camera among smartphones, this is the device to get.", "time": "22nd January 2017, 07:54 PM", "postID": "post70677860", "replies": [{"text": "were those taken with the stock camera in auto mode?", "time": "24th January 2017, 01:09 AM", "postID": "post70697716", "replies": [{"text": "1 and 3 with the \"Night Mode\", the other 3 were on auto. All with the stock camera, the optical stabilization helps a lot in low light conditions.", "time": "24th January 2017, 07:46 AM", "postID": "post70700945", "replies": [{"text": "The low light performance seems better to me than I was expecting from the reviews. I got mine yesterday and it had an update waiting as soon as I turned it on. Perhaps the newer build has better camera software? Let's face it, low light performance is mainly software these days. Probably with expensive licensing attached.\n\nMy build is A2017GV1.0.0B08.", "time": "24th January 2017, 01:24 PM", "postID": "post70704884", "replies": [{"text": "Exactly the same phone and same version.\n\r\nAs I have seen, ZTE has improved a lot the camera on this device, because from all the reviews I saw that were made last year, I was just disappointed and wondering if I should get this one or not. It seems ZTE is focusing a lot in camera performance and it's improving everything with the updates, and I'm pretty much happy with how their acting with the Axon 7.", "time": "24th January 2017, 02:02 PM", "postID": "post70705415", "replies": []}]}]}]}]}, {"text": "More pictures on auto mode with stock camera:", "time": "24th January 2017, 06:29 PM", "postID": "post70709638", "replies": [{"text": "please take more after the nougat update which will be released this week \r\ncould you please shoot these after the update: one indoor during the day and night, 1 out door during the day and night, and one selfie during the day and night  it would finalize my purchasing decision on this phone as im a youtuber and need a good camera  with great battery life & audio recording which this phone almost has rn", "time": "25th January 2017, 01:07 AM", "postID": "post70714676", "replies": [{"text": "Nougat was delayed until February, because of the new Chinese year, but it seems we will have an update this week.\n\r\nRegarding the pictures, you can find them in the other threads where I have posted some, because this is only for low light. I tried to put as many pictures as I can because no one does, and the camera was also important for me. I was between this one and the Mate 9, and even when probably Mate 9 has a better camera, I have seen that is just slightly better but it lacks of some other important things to me like sound and display quality.\n\r\nAs for the camera, I don't think you need to worry at all as long as you are looking for a decent and nice camera. If you want absolutely the best one, then go with another phone because this is slightly below, but manual mode is really useful and can get really nice and sharp pictures as well.\n\r\nFor the price and the specs, I highly doubt you would get anything better.", "time": "25th January 2017, 09:18 AM", "postID": "post70718907", "replies": []}]}]}, {"text": "These are actually pretty good. I'm really curious as to how much the camera will be updated with the Nougat update. Might have to get an Axon 7 as a second phone to go along with my V20. At least ZTE seems to be TRYING to improve their phone. LG doesn't seem to care at all.", "time": "28th January 2017, 03:24 PM", "postID": "post70771100", "replies": [{"text": "I like what ZTE is doing with this device and with the community, they are opening themselves to suggestions and comments, and are trying to add what people think is useful. For me, the V10 and V20 were more like experiments, and indeed are excellent phones, but they won't get too much attention because no many people is getting them. People in 2016 went for the cheap and good options, phones no more than $400 USD with excellent specs, and pretty much is hard to justify paying the double for just marginal upgrades.\n\r\nI think the Axon 7 is the device to have for now, and is getting more and more attention from consumers and developments, which means longer life.", "time": "28th January 2017, 03:55 PM", "postID": "post70771483", "replies": []}]}, {"text": "Tonight's sunset in Los Angeles, captured with the stock camera, auto mode, enhanced with Google Photos \"blush\" filter. I'm rooted, with the Bad Boyz Nougat ROM.\n\r\nLink to full resolution image:\nhttp://68firebird.bravehost.com/imag...4_185732~2.jpg", "time": "15th March 2017, 07:16 AM", "postID": "post71435930", "replies": []}, {"text": "I'm rooted, with Bad Boyz Nougat ROM. Both of these pictures were enhanced with Google Photos \"bazaar\" filter:\n\nThis shot was taken in Manual mode, ISO100, 10 sec. shutter:\nhttp://68firebird.bravehost.com/imag...1_223549~2.jpg\n\n\n\nThis shot was taken in Manual mode, ISO100, 7 sec. shutter:\nhttp://68firebird.bravehost.com/imag...1_223259~3.jpg", "time": "22nd April 2017, 07:34 AM", "postID": "post71973962", "replies": []}, {"text": "I made a picture comparison between the Axon 7 and the LG G4, which I find has a very good and sharp camera, even in very low light:\n\r\nZTE Axon 7 A2017G, firmware B11:\nhttps://www.dropbox.com/sh/wjb4r175c...oHbZ_VZta?dl=0\n\r\nLG G4:\nhttps://www.dropbox.com/sh/rjss1bk5d...45dhFJsqa?dl=0\n\r\nFrom there you can zoom in into the original photos and even download them to see the EXIF data.\n\r\nGOOD LIGHT\r\n-the pictures in the daylight and from the bar were taken in auto mode, for one or two I adjusted the exposure with the slider\r\n-here, the Axon 7 wins in my optinion. The photos are very detailed, also small structures at the far end of the streets or in trees can be seen\n\r\nLOW LIGHT\r\n-the pictures with the desk and the TV box are just 100% crops from the whole image, taken under dark warm light; in the picture taken by the LG, the blue \"55 XD80\" writing on the box is much clearer and brighter than on the ZTE\r\n-I took these photos in manual mode, adjusting the ISO to 1600 (the maximum you can select) - auto mode would use around 4400 and was worse\r\n-the Axon 7 hasn't the ability to combine multiple pictures into one, like the G4 does in very low light (you can tell because there is no EXIF data regarding to the shooting mode in the photos - there were done probably 2 fast shots with different settings each) - the G4 is sharper and captures more light\r\n-the colors in the low light pictures are different between the 2 phones - but the Axon 7 captured them exactly how they looked in reality\r\n-the 2 low light pictures from outside: the ZTE isn't at all bad here, the fence in the front and the cars can clearly be seen (10_dark.jpg), but the G4 is still better\n\r\nAll photos on the G4 were taken in auto mode. It took the picture with the corridor in HDR mode, that's why the walls are much brighter. I don't remember if the ZTE used HDR there, but I reduced the exposure a little because originally the walls in the center were too bright.\n\r\nOverall, I'm glad I bought the ZTE, I can't fault it in any way. At least for my tastes it has a very good camera.\r\nFocussing was not much of an issue with it, even the LG had sometimes problems.", "time": "28th April 2017, 11:16 AM", "postID": "post72068957", "replies": [{"text": "Why not updating to the latest firmware?, you are in an old build, is not even Nougat.\n\nFor me, Nougat slightly improved quality and focus, so maybe you should give it a try. Latest version is B02 Nougat.\n\n\n\nP.D.: HDR and Night Mode are activated automatically on Auto mode in the Axon 7, and you have also the long exposure mode or you can set it manually as well. In dark conditions, I always set the exposure to 1/2 and adjust WB and I get pretty decent pictures.", "time": "28th April 2017, 02:48 PM", "postID": "post72076387", "replies": [{"text": "B11 is the latest that I received OTA (Marshmallow). Isn't Nougat still in beta? What is the newest build for A2017G? On the ZTE homepage I found only B10 to download.\n\nWith my build, 1/2 is too shaky, even 1/3 is tricky. I have no Long Exposure mode (just Super Night which is about 2s). The \"Night Mode\" and HDR do absolutely nothing on my phone.\n\nEdit: On ztedevice.com there is no Nougat but I just found it on ztemobile.de. But there is says, that in order to install it I first have to install B10. What if I have B11? Do I have to downgrade?", "time": "28th April 2017, 03:10 PM", "postID": "post72076713", "replies": [{"text": "The beta for Nougat was over like 2 months ago, the latest release is B02 and is available only for OTA. The B11 was an update made to receive the B02 which is really weird you are not receiving.\n\r\nIf OTA is not coming (which is pretty weird), you can try with the next version:\n\nhttps://www.androidfilehost.com/?fid=745425885120726375\n\r\nIs the whole update package from B11 to B02, you just need to put in on the SD root and then go to the update menu and it should see the update.", "time": "28th April 2017, 06:04 PM", "postID": "post72078933", "replies": []}]}]}]}, {"text": "I've got the Axon 7 (G) and I am in the same situation, B11 and no update to Nougat with OTA. The smartphone works fine so I'm gonna wait for the next few weeks. \n\nEnvoyé de mon ZTE A2017G en utilisant Tapatalk", "time": "29th April 2017, 10:12 AM", "postID": "post72086988", "replies": [{"text": "No need to wait, you probably won't receive it. The best way is to go to one of the threads that talk about the update B01, download the full B01 which should be called something like official7.1.1.zip and put it in the internal storage, then open Updates and wait until it appears, then flash. 100% legal", "time": "2nd May 2017, 12:07 AM", "postID": "post72123355", "replies": []}]}, {"text": "Some examples by night:", "time": "3rd May 2017, 10:20 AM", "postID": "post72142573", "replies": []}, {"text": "Some night shots:", "time": "26th June 2017, 08:23 PM", "postID": "post72814782", "replies": []}, {"text": "What camera apk is everyone using. I flashed AOSP ROM and it uses the stock google camera apk and it has very little options, low light pics aren't anywhere as good as these.", "time": "8th July 2017, 10:18 PM", "postID": "post72956575", "replies": [{"text": "I'm using stock camera with stock unrooted ROM, no development so far and for this kind of phones, I think is always the best to stay in stock.", "time": "9th July 2017, 07:28 AM", "postID": "post72959657", "replies": []}]}]}, {"title": "Photo quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/axon-7/review/photo-quality-t3430722", "https://forum.xda-developers.com/axon-7/review/photo-quality-t3430722/page2", "https://forum.xda-developers.com/axon-7/review/photo-quality-t3430722/page3", "https://forum.xda-developers.com/axon-7/review/photo-quality-t3430722/page35"], "threads": [{"text": "I feel the photo quality is on par with, or above the Nexus 6P and Moto X Pure. I actually like the camera design as well.", "time": "2nd August 2016, 03:08 PM", "postID": "post68011127", "replies": [{"text": "In good light, I can believe this.\n\n\n\r\nIn bad light, I can believe this.", "time": "3rd August 2016, 08:11 PM", "postID": "post68030582", "replies": []}]}, {"text": "I'm very disappointed in the camera. No where near as good as 6p.", "time": "3rd August 2016, 08:05 PM", "postID": "post68030506", "replies": []}, {"text": "I'm inside a florescent lit room and the name tags on a shirt are fuzzy. Not good at all", "time": "3rd August 2016, 08:12 PM", "postID": "post68030592", "replies": []}, {"text": "And today photos are much better. Very bizarre.", "time": "5th August 2016, 12:39 AM", "postID": "post68047765", "replies": [{"text": "that is an awesome picture of your Dog....", "time": "5th August 2016, 01:03 AM", "postID": "post68047949", "replies": []}, {"text": "cute pic, you know that irrespective of what camera does / is capable of doing - person pushing trigger matters more. Just saying.", "time": "5th August 2016, 02:05 PM", "postID": "post68054772", "replies": [{"text": "There was no reason why the photos the previous day were so terrible.", "time": "5th August 2016, 02:50 PM", "postID": "post68055331", "replies": []}]}]}, {"text": "And camera went to crap again.", "time": "6th August 2016, 09:19 PM", "postID": "post68072824", "replies": [{"text": "Are you sure there isn't any oil from your skin on your lens?  I know that I always make sure wipe mine with my shirt before shooting.", "time": "6th August 2016, 10:21 PM", "postID": "post68073370", "replies": [{"text": "Clean as a whistle", "time": "6th August 2016, 10:41 PM", "postID": "post68073541", "replies": []}]}, {"text": "wow \neven my so old galaxy s3 has better quality than this ****\nthis photos is totally full crap", "time": "7th August 2016, 03:38 AM", "postID": "post68075538", "replies": []}, {"text": "I heard that the camera is not the best so you will not able to take photos in low light are in High light just medium light for a perfect look.", "time": "24th August 2016, 01:21 AM", "postID": "post68333936", "replies": []}]}, {"text": "The hardware can't be insconsistent.\r\nSuposing you took both picture in automatic, it's either the software or you .", "time": "7th August 2016, 10:21 AM", "postID": "post68078453", "replies": [{"text": "I would say it's the software, my S7 Edge never had problems like this.", "time": "7th August 2016, 02:23 PM", "postID": "post68080800", "replies": [{"text": "Well then we just have to wait for camera updates ! They said it was one of their priority, let's see if they put their money where their mouth is !\r\nAnd maybe we'll have some improvement from the community, should the bootloader be unlocked, again, as they said .", "time": "7th August 2016, 03:09 PM", "postID": "post68081309", "replies": []}]}]}, {"text": "How is focus speed. Just sold my op3 as the camera a small lens were not good. Back to my trusted g4 . Anyone coming from g4 ?", "time": "7th August 2016, 03:36 PM", "postID": "post68081613", "replies": []}, {"text": "Omg I just found this video and the stablisatiim looks better than the s7 and many other phones !", "time": "8th August 2016, 12:25 AM", "postID": "post68087429", "replies": [{"text": "it's not better at all, it try to adjust the autofocus continuously", "time": "9th August 2016, 08:55 PM", "postID": "post68115601", "replies": []}]}, {"text": "how do photos look using a 3rd party camera app like open camera or fv-5?  that might help to determine whether it's the software or hardware.", "time": "8th August 2016, 02:23 AM", "postID": "post68088222", "replies": [{"text": "Same issue. It's really random though.", "time": "8th August 2016, 02:55 AM", "postID": "post68088436", "replies": []}]}, {"text": "Photo of my Moruga scorpion pepper plant.", "time": "8th August 2016, 06:02 PM", "postID": "post68097788", "replies": [{"text": "Could you post picture at full size or redirect to them ?\r\nJust want to see and judge the quality more .", "time": "8th August 2016, 06:44 PM", "postID": "post68098386", "replies": [{"text": "https://plus.google.com/103981168037...ts/66A4xbB3RV7", "time": "8th August 2016, 06:45 PM", "postID": "post68098407", "replies": [{"text": "Thanks !", "time": "8th August 2016, 07:23 PM", "postID": "post68098914", "replies": []}, {"text": "Looks great", "time": "8th August 2016, 11:00 PM", "postID": "post68101544", "replies": []}, {"text": "Looks good. I downloaded and examined the photos on the TechRadar review (lowlight, specifically). Between the GS7E, Axon 7, and the iP6S+, on the photo of the guy playing the claw game, if this is an example of the Axon 7's so-called poor lowlight then I have nothing to worry about when this phone arrives. \n\nThe iPhone does the best in noise control and preserves good detail, but the picture is too dark. The Galaxy is the purported lowlight king, and produces the brightest picture with the most pleasing colors, but the corner noise is higher than the iPhone (and arguably the Axon as well) and there are obvious signs of oversharpening and heavy post-processing (look at the area around the \"Barnes and Noble\" on the wall). The Axon blows out some highlights, and has a less pleasing color balance than the Galaxy...both are better than the iPhone. \n\nWithout pixel peeping, I like the Axon and the Galaxy photos better than the iPhone for everything. The Galaxy wins I think because of the obvious things like color balance and brightness and control of dynamic range, whereas I have to give the Axon the win for overall texture. That's without pixel peeping. The smoother gradients and less noise look good on the Axon. \n\nI wonder how much better the Axon would be with slightly less noise reduction? Perhaps the next update will show us.", "time": "13th August 2016, 08:30 PM", "postID": "post68174302", "replies": []}]}]}]}, {"text": "", "time": "9th August 2016, 03:22 PM", "postID": "post68110938", "replies": []}, {"text": "I looked at some of TechRadar's day photos. The scene in the city with the white car shows how well the Axon does preserving detail in daylight. The car (which I believe is the subject of the picture) is rendered the best on the Axon, whereas overall the Galaxy does the best rendering the entire picture. Brightness is good here, but I like the iPhone's color balance the best.\n\r\nThis is perhaps the most shocking of the day photos, and you'll see why. Take the bridge photo with the walkway and the people. If you look at the beams over the cars, there are posters/stickers on them. The iPhone is the worst, but even the Galaxy can't touch the Axon in how it actual renders readable text. The pole between the walkway and the beams is another example. The iPhone and the Galaxy show blurriness on it, while you can make out the words and graffiti on the pole in the Axon. Finally, the people on the walkway are more detailed on the Axon at a distance. If you use the people standing near the trash can/bench in the distance, the Axon clearly renders the most detail on faces and bodies.\n\r\nOverall, the Galaxy produces the most consistent pictures with the best overall balance. But this defeat when it comes to detail by a $400 phone comes as a testament to the disadvantages that come with a lower megapixel count and having every pixel split into two (dual pixel tech)...faster focus and brighter pictures (due to aperture?), but you lose a lot of potential detail.", "time": "14th August 2016, 04:20 PM", "postID": "post68184816", "replies": []}, {"text": "Someone try Snap Camera on play store please.\nUsually see big improvements with this app.", "time": "22nd August 2016, 08:52 AM", "postID": "post68302730", "replies": []}, {"text": "I found stock camera app will usually prefer to underexpose and preserve detail rather than brighten up excessively and blow highlights.\nSnap is good.\nHaven't tried open camera on the A7 as I usually find it has issues with the screen preview not matching the recorded result in regards to the captured area. It ruins photos or requires cropping too often.", "time": "24th December 2017, 07:56 PM", "postID": "post74951078", "replies": []}, {"text": "Log on edge of frozen lake, bright sunlight, auto settings beat manual", "time": "15th January 2018, 06:00 PM", "postID": "post75209907", "replies": [{"text": "ohh nice pic but if you guys missed out on this heres some tips to improve images here as stated: https://forum.xda-developers.com/axo...ageos-t3668011 \nit actuall does help a bit i get really nice shots in outdoors\n\nedit: forgot to mention that its for the default LOS cam or ROMs that uses snap cameras app", "time": "18th January 2018, 10:20 PM", "postID": "post75250504", "replies": []}]}]}, {"title": "Video quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/axon-7/review/video-quality-t3430723", "https://forum.xda-developers.com/axon-7/review/video-quality-t3430723/page2"], "threads": [{"text": "Entire Playlist\n\n4K Video/Audio Recording Test - Playing \"Dango Daikazoku\" on Piano\n\n4K Raw Footage\n\n4K Raw Footage 2\n\n1080p30fps Raw Footage\n\n720p/1080p/4K Comparison Video\n\nSlow Motion Video Reel\n\nStabilization Comparison", "time": "17th October 2016, 09:17 AM", "postID": "post69168577", "replies": [{"text": "Just wondering why 4k looks so much better than 1080p, even when watched on a 1080p screen.\r\nAlmost as if they deliberately made video less than 4k look crap.", "time": "21st December 2016, 12:28 PM", "postID": "post70191397", "replies": [{"text": "It has something to do with bitrate. LinusTechTips made a video about this but im not near a computer.", "time": "21st December 2016, 07:25 PM", "postID": "post70197130", "replies": []}]}]}, {"text": "Slo Mo video reel is worthless as the framerates aren't labeled.\nHere's a video of a goat drinking it's own urine at 1/12 speed. lol", "time": "20th October 2016, 06:25 PM", "postID": "post69224321", "replies": []}, {"text": "I wish the audio quality was better. I found out that axon records audio at 96 kbps which is lower than other phones. I wish I can increase the bitrate for audio.", "time": "21st December 2016, 04:27 PM", "postID": "post70194673", "replies": []}, {"text": "These clips should not be listed as \"raw\".  They should called ungraded or unedited.  Too much confusion with RAW.", "time": "23rd December 2016, 03:55 PM", "postID": "post70223467", "replies": []}, {"text": "While the video itself it really nice, and the audio is great in regular settings.... In LOUD settings, such as a full, live band, you get a terrible mic clipping noise. \n\r\nHere's an example", "time": "15th February 2017, 07:24 PM", "postID": "post71046080", "replies": []}, {"text": "Video of loud fireworks in Valencia:", "time": "19th March 2017, 03:15 PM", "postID": "post71496337", "replies": []}, {"text": "I have to set anti-banding to 50Hz (not to auto or 60Hz), there are a lot flickering.", "time": "5th February 2018, 06:58 PM", "postID": "post75458281", "replies": []}, {"text": "I took a video of starting and running my car after doing a lot of work to it and having it off the road for many weeks. I was very surprised at how well the mics picked up sound. As I moved around the front of the car, many different noises were easily identifiable and extremely clear. I shot it on the snap camera hd app instead of the stock camera.\n\nhttps://www.youtube.com/watch?v=Tlay...ature=youtu.be", "time": "6th February 2018, 11:57 AM", "postID": "post75465577", "replies": []}, {"text": "Here's a short vid I took today. Cold start cycle on the car. The phone handles quite a lot of loudness pretty well.\n\nhttps://www.youtube.com/watch?v=o0ZRt3fzsOM", "time": "18th February 2018, 04:02 AM", "postID": "post75607688", "replies": []}]}, {"title": "Selfie quality", "rating": 3.0, "links": ["https://forum.xda-developers.com/axon-7/review/selfie-quality-t3430724"], "threads": [{"text": "Can sombody post photos with front-facing camera?", "time": "21st January 2017, 06:10 PM", "postID": "post70661606", "replies": [{"text": "What kind of picture you would like?", "time": "22nd January 2017, 07:56 PM", "postID": "post70677895", "replies": [{"text": "I dunno, maybe 1 in low light and 1 with normal light. I just want to see the quality", "time": "22nd January 2017, 11:58 PM", "postID": "post70680693", "replies": [{"text": "Here you go, no edit or anything:", "time": "23rd January 2017, 04:47 PM", "postID": "post70691405", "replies": [{"text": "i like your white and gold jumper", "time": "24th January 2017, 12:52 AM", "postID": "post70697586", "replies": [{"text": "", "time": "24th January 2017, 07:48 AM", "postID": "post70700968", "replies": []}]}]}]}]}, {"text": "In b4 \"send nudes\"-meme", "time": "24th January 2017, 09:46 AM", "postID": "post70702186", "replies": [{"text": "lol", "time": "26th January 2017, 09:19 PM", "postID": "post70745340", "replies": []}]}]}]}, {"title": "Time to take picture (camera launch speed)", "rating": 4.0, "links": ["https://forum.xda-developers.com/axon-7/review/time-to-picture-camera-launch-speed-t3430725"], "threads": [{"text": "camera launches extremely fast and is ready to shoot before I finish saying \"One One-thousand\".", "time": "2nd August 2016, 03:10 PM", "postID": "post68011152", "replies": []}, {"text": "Standby shortcut to open camera: double tap on\\off button. \r\nAt least on EU model", "time": "4th October 2016, 12:24 PM", "postID": "post68976385", "replies": [{"text": "They decided to remove this shortcut, but I hope they could implement it again. It seems ZTE is aware of this and is working on that.", "time": "22nd January 2017, 08:01 PM", "postID": "post70677950", "replies": [{"text": "on which rom version???", "time": "3rd February 2017, 03:10 PM", "postID": "post70862407", "replies": [{"text": "I think after B03, the option is not anymore there. The only workaround would be to downgrade to B03, activate the option and then update manually to B10.", "time": "3rd February 2017, 03:39 PM", "postID": "post70862883", "replies": [{"text": "I have the B10, still working", "time": "3rd February 2017, 03:49 PM", "postID": "post70863024", "replies": [{"text": "I receive my phone with B08 and it wasn't there, and also I made a clean installation of B10 and neither. Some other user told me the same I just wrote to you, so probably you had the B03 and you updated manually since then. Try to make a factory reset and you will see how it disappears.", "time": "3rd February 2017, 03:58 PM", "postID": "post70863143", "replies": []}]}]}]}]}]}, {"text": "About a one mississippi, which is approximately 10 times faster than my old Note 4 if there were an SD card present.", "time": "5th October 2016, 09:12 PM", "postID": "post68997752", "replies": []}]}, {"title": "Software (ease of use, features, etc)", "rating": 4.0, "links": ["https://forum.xda-developers.com/axon-7/review/software-ease-features-t3430726"], "threads": [{"text": "I like the camera software and the gallery has some nice editing features. The gallery is a little slow to load though if you have a lot of pictures on your external SD card, but some of that could be due to a slower rated SD card too?", "time": "2nd August 2016, 03:11 PM", "postID": "post68011169", "replies": [{"text": "Yeah..I agree of m with everything you said .\n\nhave about 300 photos on my sd card.. And when I scroll through them, the pictures themselves take a second to load and I experience some minor skipping in scrolling. I have a sandisk extreme I believe.. 64GB. \n\nI like miflavor, close to stock with some nice tweaks. Like the fact we're on marshmallow, but we have nougat styled quick notification panel toggles.", "time": "22nd September 2016, 05:26 AM", "postID": "post68803492", "replies": []}]}]}, {"title": "Charging speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/axon-7/review/charging-speed-t3430727", "https://forum.xda-developers.com/axon-7/review/charging-speed-t3430727/page2", "https://forum.xda-developers.com/axon-7/review/charging-speed-t3430727/page3", "https://forum.xda-developers.com/axon-7/review/charging-speed-t3430727/page4"], "threads": [{"text": "On Quick Charge, it's fast. On a older computer, it's painfully slow. In my car, on a standard charger, it's not too bad. I just bought a QC 3.0 charger for my car and it'll charge about 30% in my 35 minute drive home (have to test that some more).", "time": "2nd August 2016, 03:13 PM", "postID": "post68011196", "replies": [{"text": "I would double check the charger port and make sure your plugging into the QC 3.0 port, and not the 2.0A port (not sure if yours has one as well or not) my Axon 7 charges about 45-50% in my 25 minutes ride home so It doesnt sound like its charging quite as fast, unless its QC2.0", "time": "2nd August 2016, 07:32 PM", "postID": "post68014901", "replies": [{"text": "Which car charger you have? \n\nΣτάλθηκε από το HUAWEI M2-A01W μου χρησιμοποιώντας Tapatalk", "time": "25th August 2016, 06:23 PM", "postID": "post68364024", "replies": []}]}]}, {"text": "Have tried to push the battery as hard as I can while charging at the same time. The phone won't stall or drop charge thankfully. Gets a little hot but nothing like other phones I've owned (Nexus 6P would boil, OnePlus one would slowly drop battery until it died, iPhone 5s would get too hot to touch, HTC M7 would also become too hot to touch and unresponsive). If you're wondering if you can use this phone with GPS, Bluetooth, Wifi Hotspot, Data, Spotify while charging at the same time you can.", "time": "21st September 2016, 08:34 PM", "postID": "post68798870", "replies": []}, {"text": "B27 A2017U, From 37% to 95% in 45 minutes. 5 minutes of screen and one 5 min call during charging. I won't use fast charge often because I don't need it, battery health is more important to me.", "time": "23rd September 2016, 11:13 PM", "postID": "post68831108", "replies": []}, {"text": "Charging speed is very fast.  Battery life is great.  I usually have ~20% left after running it from about 6AM to 11PM.   I did misconnect the charger dongle one night, and so was at 11% starting the day.  I switched to ultra power saving mode and was at 10% at the end of the day!?!", "time": "5th October 2016, 09:22 PM", "postID": "post68997883", "replies": []}, {"text": "Charging speeds tbh are fairly decent. On QC 3.0 i get about 95% in about 1 hour. Nothing compared to Dash charge on the OP3, that method is insanely fast. To compare OP3's 3000 mah takes about 40~45 minutes to top off. Considering the additional 250maH on the Axon, i think the 1 hour approx charging time is good. I suppose once you get the taste of Dash charging, QC becomes less palatable \n\nP.S. Axon's power saving mechanisms are actually quite good. No need for any 3rd party apps. I don't miss Greenify considering the background apps get killed when the screen goes off. So battery life being decent is a good trade off.", "time": "7th October 2016, 08:17 AM", "postID": "post69017242", "replies": []}, {"text": "I've been impressed by the charging speed. It's close to the Moto X Pure that I loved.", "time": "20th October 2016, 11:37 PM", "postID": "post69228399", "replies": []}, {"text": "I've personally never had a phone that had any type of quick charge until this phone, so I'm certainly impressed.", "time": "25th November 2016, 04:05 AM", "postID": "post69780160", "replies": []}, {"text": "Hello \nQuestion: is QC3 a killer of battery? Is charging at low amp better, or...? Cuz I read here and there that  it's still better to use a slow speed charging device so that the battery doesn't heat up and doesn't wear off too fast.\nWhat are your thoughts about that?", "time": "25th November 2016, 08:39 AM", "postID": "post69782373", "replies": [{"text": "If you charge it before you sleep,  I would use a charger with a lower am so it can prolong the battery's life.  Using quick charge 3.0 is convenient,  but it will certainly decrease the battery's life over a period of time. \n\nBefore bed: Not recommended to use another adapter to charge any phone that didn't come with it,  but I would use a different adapter with a slower charging rate and voltage.\n\nWhen you're about to go out or etc: Quick charge 3.0", "time": "25th November 2016, 08:47 AM", "postID": "post69782459", "replies": []}, {"text": "I don't trust it to keep the battery in good condition over a long time.  So I use a normal charger instead.", "time": "28th November 2016, 02:36 PM", "postID": "post69832485", "replies": []}, {"text": "For Maximum life battery should be kept between %20 and %80 at all times. Quick Charge has a logic chip which slows down the rate of charging after %80 so QC impact on battery life is minimal. Best thing yo can do to maximize battery life is to make a habit of plugging it in before going to sleep", "time": "30th November 2016, 07:42 PM", "postID": "post69868673", "replies": []}]}, {"text": "I use the Aukey charger. I have 2 portable QC3 and one \"traditional\" QC3 also. And I forgot which brand but a good one as a slow speed charger. \nI thought that QC3 was different than the \"old\" high speed charger because it had something to do directly with the SnapDragon. The \"old\" high speed chargers are just sending more amps like 2A or more, while QC3 is more \"controlled\" so it didn't affect the battery. Am I totally wrong?", "time": "25th November 2016, 08:55 AM", "postID": "post69782530", "replies": []}, {"text": "Has anyone noticed their charging time increase by 10-20 minutes or so? Could be my imagination as I also have an op3 now..", "time": "26th November 2016, 04:50 PM", "postID": "post69803183", "replies": [{"text": "Probably your imagination. Dash charge is much faster that QC. If your phone's charging up in an hour it's fine.", "time": "27th November 2016, 08:09 AM", "postID": "post69812499", "replies": [{"text": "even faster than QC3.0?", "time": "27th November 2016, 08:42 AM", "postID": "post69812799", "replies": [{"text": "Oh yes absolutely. I came from an OP3 to Axon. It's the only thing I miss about the OnePlus 3. And the ROM. And the front finger print scanner. And updates.  \n\nOn a more serious note, Dash charge is really fantastic. As advertised. 3000 mAh takes 40 to 45 mins, but the most important feature is that it doesn't heat the phone up and using the OP3 while charging is a better experience.", "time": "27th November 2016, 08:54 AM", "postID": "post69812926", "replies": []}]}]}]}, {"text": "Nice \nI think QC3 is already pretty fast, so... Charging low speed when I'm not in a rush, following some (your?) advices here. \nI had ordered a 1+3 and canceled when I saw the Axon7, but I had also a Dash Charger on the way and couldn't cancel that one. Too bad they're two different technologies \nThe 1+3T is... nice", "time": "27th November 2016, 09:28 AM", "postID": "post69813294", "replies": [{"text": "Yeah i absolutely hate the existence of the op3t cause it has everything that op3 didn't. And yeah don't use the dash charger with anything else unless you like watching things getting smoked up.", "time": "27th November 2016, 12:21 PM", "postID": "post69815164", "replies": []}]}, {"text": "I would not worry about quick charge killing your battery.\r\nUsed quick charge in  my car, and at home, and portable battery pack on my Zenfone 2 for 1.5 years , I couldnt tell you if there is a difference from day one. That phone lasted daily from day one. Made me regret buying all those QC devices actually. Only reason why I retired it is how painfully slow the camera was  and I got bored of it.", "time": "30th November 2016, 03:33 AM", "postID": "post69857536", "replies": []}, {"text": "My Axon 7 USA version took sweet 1 hr 30 min to charge from 0 to 100%\nIn between I had 5 to 7 mins on screen with whatsapp chat and 2 mins whatsapp call. \nI got this mobile 3 days back.. \nIs this the typical charge time or is my device defective?", "time": "1st December 2016, 02:18 AM", "postID": "post69872723", "replies": [{"text": "Hello,\r\nFrom 0 to 100%, 1h30 to charge is pretty fast and I think totally normal. Like thohac said, the charger slows down the charge after 80%, so it's really fast from 0% to 80% and then \"normal\" charge after. \r\nQC3.0 is really nice, you have 60% of battery in about half an hour. \r\nOh, don't go lower than 10% with the phone. Below that you might brick your battery, and you won't be able to charge it anymore.", "time": "1st December 2016, 12:22 PM", "postID": "post69878480", "replies": [{"text": "Thanks for the suggestion.. \nI was scared if it was defective.. \nI'll never got below 10% as u said. \nThank you", "time": "1st December 2016, 02:10 PM", "postID": "post69879943", "replies": []}]}]}, {"text": "I use Ampere to test my charge speed.  And use any cable and power supply which Google employee Benson Leung tests as compatible with USB-C specs (link to a spreadsheet someone on Reddit keeps up-to-date with Benson's tests).  Benson is well known in the Android community because he leaves comments on chargers and cables he buys on Amazon of his test results and the press coverage and fixes vendors do to get their act together.\n\nSo far, the speeds I've seen on various charging technologies over the years are around 500mA, then 1000mA and with a proper USB-C cable and charger around 3000+mA.\n\nThat should cover all of the charging knowledge you need", "time": "2nd December 2016, 04:05 PM", "postID": "post69897441", "replies": []}, {"text": "I measured some different charge cycles. I get approximately 50% charge in 40 minutes. I noticed that the battery charges faster when it is initially low (15-30%) but takes exponentially longer to fill once it's reached >85%. I'll try to post an update with a detailed log of the times and charge levels.", "time": "4th December 2016, 03:18 PM", "postID": "post69925322", "replies": []}, {"text": "This is the way QC3 works. It charges full speed till the battery reaches 80% then it charges normal speed till it's full.", "time": "4th December 2016, 05:44 PM", "postID": "post69927333", "replies": []}, {"text": "What's the charging mA that you guys are getting at Ampere? Mine is showing 1700 mA with the default charger. Is that ok for quick charge?", "time": "15th December 2016, 07:26 PM", "postID": "post70106841", "replies": [{"text": "It is once your battery is like 75 or 80% full. If it´s at say 50, it should be closer to 3000.", "time": "15th December 2016, 07:35 PM", "postID": "post70106962", "replies": [{"text": "Thanks, so definitely something is wrong, I am getting max 1700mA at 30%, I will ask for a replacement.", "time": "15th December 2016, 07:38 PM", "postID": "post70107005", "replies": [{"text": "How long does the entire charging process take?", "time": "15th December 2016, 07:44 PM", "postID": "post70107091", "replies": [{"text": "Thanks for the replies nupi, I am not sure, this is my 4th day with it, I will try to measure it.\nNow with 75% I am getting max 880mA, with original cable and charger.", "time": "15th December 2016, 08:18 PM", "postID": "post70107522", "replies": []}]}]}, {"text": "Yep that's the way mine works too. I don't use the original charger, I bought 2 Aukey QC3.0 chargers, and it's around 2700-3000mAh till 80%. Then it goes down to 2000 I think.", "time": "15th December 2016, 08:12 PM", "postID": "post70107443", "replies": []}]}]}, {"text": "@nupi I measured the charging today, it went from 9% to 100% in 2h 32m, I am not sure if this is ideal for quick charge 3, what do you guys think?", "time": "16th December 2016, 09:51 PM", "postID": "post70124421", "replies": [{"text": "Very slow. Using a 2amp charger does it in about 2hr with no quick charge.\n\r\nI'd say something is wrong.", "time": "21st December 2016, 07:16 AM", "postID": "post70188163", "replies": []}]}, {"text": "i'm using A2017G B08\r\ni have noticed inaccuracy with my battery indicator\r\nwhen i'm charging (quick/normal charge) yhe battery level increased very slowly\r\na reboot is needed to display the correct battery level all the time\r\nanybody experienced similar bug/problem? any potential solution?", "time": "29th December 2016, 03:07 AM", "postID": "post70298655", "replies": [{"text": "I did and turned out to be hardware fault. I had to RMA it.", "time": "13th January 2017, 03:04 PM", "postID": "post70535450", "replies": []}]}, {"text": "with QC3.0 this device charges pretty fast and i really have no complains with charging", "time": "12th January 2017, 10:19 PM", "postID": "post70525924", "replies": []}]}, {"title": "Screen on time", "rating": 4.5, "links": ["https://forum.xda-developers.com/axon-7/review/screen-time-t3430728", "https://forum.xda-developers.com/axon-7/review/screen-time-t3430728/page2", "https://forum.xda-developers.com/axon-7/review/screen-time-t3430728/page3", "https://forum.xda-developers.com/axon-7/review/screen-time-t3430728/page13"], "threads": [{"text": "One of the better SOT phones I've owned since coming from smaller 4.5 inch screens. I easily get 4 hours on a long day (16 -18 hours off the charger). I  watched 2.5 hour movie the other day and did some more stuff. In 8 hours, I had over 5 hours of SOT with 47% battery left.", "time": "2nd August 2016, 03:16 PM", "postID": "post68011238", "replies": [{"text": "How are you measuring SOT?  I can't find it in the stock battery stats.", "time": "3rd August 2016, 06:19 PM", "postID": "post68029207", "replies": [{"text": "you install an app like BetterBatteryStats .", "time": "3rd August 2016, 06:50 PM", "postID": "post68029564", "replies": [{"text": "Does better battery stats require root? Does it read system stats or does it create its own?\n\n\r\nI don't like gsam because it doesn't read the SOT from the system. It records it's own stats.", "time": "3rd August 2016, 07:14 PM", "postID": "post68029856", "replies": [{"text": "\"BetterBatteryStats is calling the \"batteryinfo\" service of Android to retrieve data already lying there without generating overhead\" and no it doesn't need root", "time": "3rd August 2016, 08:28 PM", "postID": "post68030784", "replies": []}]}]}, {"text": "GSam battery monitor. \n\r\nThere is a free version and a paid version, not sure which one this is but it'll get you close: https://play.google.com/store/apps/d...m.gsamlabs.bbm", "time": "3rd August 2016, 06:53 PM", "postID": "post68029593", "replies": [{"text": "How do you have 0% for phone radio? That's what is eating up my battery apparently.  Please let me know! Thanks!\n\n---------- Post added at 03:14 AM ---------- Previous post was at 03:11 AM ----------\n\n\n\r\nHow do you have 0% for Phone Radio? That's what's eating up my battery apparently. Let me know.  Thanks!", "time": "8th October 2016, 03:14 AM", "postID": "post69028464", "replies": [{"text": "The phone radio only shows up as usage when I use my phone to place or receive a call.", "time": "8th October 2016, 05:46 AM", "postID": "post69029358", "replies": [{"text": "That's concerning. Do you of any settings that could cause my battery to drain because of the phone radio?? I attached a screenshot of my results here.", "time": "8th October 2016, 12:37 PM", "postID": "post69032546", "replies": [{"text": "Dude, you have 2.5h of radio on time. You only lost 2% battery, i wouldn't call it a drain... Having data turned on could be the \"issue\" here.", "time": "8th October 2016, 03:54 PM", "postID": "post69034670", "replies": []}]}, {"text": "Guess I need to edit this reply... I'm currently on a lot of pain meds from surgery I had Wednesday evening \n\r\nMy phone radio is usually on as long as my phone is on, I was thinking of the actual \"Phone\". Currently, I'm at 12:07:46 being 37% of my usage... My battery is at 78% with 1:22:44 scree on time. \n\r\nSo, my phone has been on for just over 12 hours, with the screen being on 1 hour and 22 minutes of that time. My phone radio is exactly how long my phone has been on. \n\r\nSorry for the confusion, because I sure was!", "time": "9th October 2016, 05:03 PM", "postID": "post69049032", "replies": []}]}]}]}]}, {"text": "What settings do you guys have setup? My battery is down to 27% after only 8.5 hours off the charger and not much video watching. How do you have your phone setup concerning gestures and everything? I use the fingerprint unlock and the double tap feature and so far I am not impressed with the battery.", "time": "12th September 2016, 10:00 PM", "postID": "post68657434", "replies": [{"text": "Nothing special, really? It's basically stock, I just disabled some stock apps: Browser, calendar, stock email, Gmail, Hangouts, and stock messaging.  Everything else is left alone.... I even installed the actual Facebook app (aka: battery eater) for the first time in a few years, since my battery can keep up now.", "time": "13th September 2016, 01:24 AM", "postID": "post68659361", "replies": []}]}]}, {"text": "GSam battery monitor allows you to see the stock android battery stats and screen on time from there by going to the menu on the bottom right, clicking more and then Battery Use - Built In. If there is an easier way to get to stock android battery stats, I'd love to know.", "time": "3rd August 2016, 07:52 PM", "postID": "post68030342", "replies": [{"text": "Good to know, thanks!\n\n\r\nThis is exactly what I want. Sweet!", "time": "3rd August 2016, 08:41 PM", "postID": "post68030993", "replies": []}]}, {"text": "My first not-at-home day, I averaged just under 5hrs SOT in a 14 hour day.", "time": "4th August 2016, 10:20 PM", "postID": "post68046539", "replies": []}, {"text": "What settings are you using?  I'm barely getting10hrs of battery", "time": "12th September 2016, 11:16 PM", "postID": "post68658190", "replies": [{"text": "You either have very bad wakelocks or you've got a LOT of screen on time.", "time": "13th September 2016, 09:57 PM", "postID": "post68674231", "replies": [{"text": "No screen on time. I am in an area where I get no service and was using WiFi, so today I turned on Airplane mode and then WiFi and it seems to work a lot better. though I still need to investigate is battery drain is bad when using the phone in normal service area.", "time": "13th September 2016, 10:37 PM", "postID": "post68674740", "replies": [{"text": "Sounds like wakelocks to me", "time": "14th September 2016, 12:21 AM", "postID": "post68675801", "replies": []}]}]}]}, {"text": "This is the best phone I've owned in terms of battery life. With nova launcher and using nova's battery widget I can see my SOT. I average 5:30 which is alot for me. I have gotten as much as 6:40! This is all usually over 12-28 hrs. The phone is just phenomenal, just wish the camera was better.", "time": "14th September 2016, 02:47 AM", "postID": "post68676977", "replies": [{"text": "I would believe it. I got about 5 hours in my last run. What I think ate up about 20% was listening to music through the speakers.. The phone drained faster than normal Witt the speakers on at max volume.. Which makes sense and is 5000% tolerable because how amazing they sound.\n\nFurthermore, if I could get some stronger cell phone signal, that would help with screen on time too. I never have no signal, but I never see over two bars of signal either.", "time": "18th September 2016, 06:29 AM", "postID": "post68741245", "replies": []}]}, {"text": "Sorry about double post.. Forgot to include second one..", "time": "18th September 2016, 06:30 AM", "postID": "post68741257", "replies": []}, {"text": "Ok, I thought this was a battery beast but I think I was wrong. I don't expect any phone's battery indicator to be totally accurate but I've noticed that if I top the A7 up a little the battery doesn't drain *at all* for a long time. I've been letting it go down to 30% then topping it up to 40% where it stays without moving even while I'm streaming music and surfing for half an hour. Fishy.\n\nI thought that as I was on about 3:30 sot at 40% I'd let it go down further to see if it would reach 5 hours. Three charging cycles in a row the phone has hit 19% and then reported that it's empty and shut down.\nEU model build B03.", "time": "28th September 2016, 11:30 PM", "postID": "post68903144", "replies": []}, {"text": "According to better battery stats, I get 6 hrs or close to 6 hrs on average. I have location services turned off, bluetooth on, and wifi on.", "time": "29th September 2016, 02:32 AM", "postID": "post68904480", "replies": []}, {"text": "Are these sot's on mobile data or Wi-Fi ?", "time": "2nd October 2016, 03:49 PM", "postID": "post68951761", "replies": []}, {"text": "I'm quite satisfied with the sot, I'm getting an average of 5,5 to 6h. Although it varies quite a lot for me, due to quite a high stand by drain, but it might be because I have my MiBand2 connected via Bluetooth all day.\nI attached screenshots of my best sot until now of 9h on WiFi", "time": "3rd October 2016, 03:34 PM", "postID": "post68964735", "replies": []}, {"text": "I switched from Note 2 to Axon 7. I'm still pretty satisfied with the battery.", "time": "5th October 2016, 03:07 PM", "postID": "post68992809", "replies": []}, {"text": "Here's kind of an update....\n\r\n27% battery left\r\n25 hr up time\r\n4.5 hr SOT", "time": "10th October 2016, 06:05 AM", "postID": "post69056432", "replies": []}, {"text": "I just got the Axon 7 and am debating whether or not to keep it. According to GSam I'm getting 4h 38m which is an hour and change more than my Nexus 6p. So far that's the best battery life I've gotten at work.", "time": "20th October 2016, 10:15 PM", "postID": "post69227484", "replies": []}, {"text": "First estimate average SOT is 5-6h during 1 day and 4-4.5h during 2 days. Auto brightness. A2017G, b09.", "time": "12th January 2018, 10:25 PM", "postID": "post75177486", "replies": []}, {"text": "Hi guys, I bought the axon in September and I was not impressed with the battery life. I always get around 2h to 2.30h on average. Since I thought this was a normal thing I kept going. When I read this thread last month i was definitely not happy. I saw that many people are getting 5/6h of SOT and I don't understand how. Since then I always kept the auto brightness, the location on battery saving, the data on 3G, and I disabled basically every single app that I could disable (Allow deep-sleep, scheduled background wake-up and allow screen-lock cleaning) but nothing changed. The best that I could achieve was 3h20min. I'm using everything stock. Can someone help me?", "time": "28th January 2018, 02:35 PM", "postID": "post75361540", "replies": [{"text": "At the moment same for me, brand new phone being only 3 days old and SOT is around 3 hours. That includes the display being set to just 30% and even Greenify does not seem to help...", "time": "31st January 2018, 05:35 AM", "postID": "post75392445", "replies": [{"text": "SOT is not only deppendant on how much screen is on... it mostly deppends in your data signal, and the app that is running.... Its not the same 3hs reading a pdf, 3hs playing some game, or 3hs during all day...\r\nyou maybe can do 4hs SOT in 4hs usage, but probably after all day you cannot pass 3....\n\r\nAxon is not really good in battery, do the job, but not for intensive users...\r\nIn my case I do 3 hs, after a year, battery seems ok... but I need a charge in the middle of the day mosts days... with 15-20 mins of charge is enough...", "time": "20th February 2018, 05:16 AM", "postID": "post75630962", "replies": [{"text": "Hmmm, standby time seems to be excellent, however, for gaming or intense usage, it does not fair well compared to others...", "time": "20th February 2018, 05:25 AM", "postID": "post75631014", "replies": []}]}]}]}]}, {"title": "Standby drain", "rating": 4.5, "links": ["https://forum.xda-developers.com/axon-7/review/standby-drain-t3430729", "https://forum.xda-developers.com/axon-7/review/standby-drain-t3430729/page2", "https://forum.xda-developers.com/axon-7/review/standby-drain-t3430729/page3"], "threads": [{"text": "Left it off the charger last night for 7 hours - batter only drained 3-4%.", "time": "2nd August 2016, 03:21 PM", "postID": "post68011323", "replies": []}, {"text": "With the data off I lost 1% in 8 hours, with the data on about 15% in 8 hours (this is probably because of the notifications from AA and other apps )", "time": "2nd August 2016, 07:39 PM", "postID": "post68015005", "replies": []}, {"text": "Only lost 1% last night with data and wifi on, and all apps closed.", "time": "3rd August 2016, 08:55 AM", "postID": "post68022381", "replies": []}, {"text": "I lose 20-30% battery every night and I have yet to test how long it takes to charge from 0%, but it takes about an hour to charge back up to 100% in the morning. That's using the quick charger included. I'm thinking I may have a defective battery. I just unlocked my bootloader and rooted yesterday so looks like I won't be able to exchange it. The only reason I root is for AdAway. I haven't had my phone a week yet and had been using Netguard to block ads. I thought it was that, that was eating my battery but apparently not. No difference using AdAway. Woke up to 82% this morning.", "time": "23rd October 2016, 04:00 PM", "postID": "post69269123", "replies": [{"text": "Since you are root install the wake lock detector there u will find out if it probly another app that keeps the phone awake", "time": "23rd October 2016, 04:33 PM", "postID": "post69269558", "replies": [{"text": "[QUOTE=Android > Apple;69269961]\n\r\nPlease let us know what your findings are. I would really appreciate that.", "time": "23rd October 2016, 10:16 PM", "postID": "post69274347", "replies": []}]}, {"text": "Don't know if you're still having this problem - I had the same thing for the first few days of having the phone. Accuwewther seemed to be using a lot  of battery so I deleted it and ever since then drain had been normal (1-2% per hour when idle, compared with 8-10% with the weather app installed.) \n\r\nFor anyone else having battery issues, try th e above and see if it helps!", "time": "26th December 2016, 04:59 PM", "postID": "post70263532", "replies": []}]}, {"text": "[QUOTE=tupirujp;69269558]Since you are root install the wake lock detector there u will find out if it probly another app that keeps the phone awake\n\n\r\nOh ok. I'll try that. Thanks", "time": "23rd October 2016, 05:01 PM", "postID": "post69269961", "replies": [{"text": "[QUOTE=ProLen;69274347]\n\r\nHere are my findings so far. Can anyone shed some light on it? I'm not too familiar with the app.", "time": "23rd October 2016, 11:18 PM", "postID": "post69274950", "replies": [{"text": "Thanks! Could you sort on wakelock amount? Not sure what it's called precisely, but it should put the Google App on top of the apps shown in your screenshot (it focusses on the x526).", "time": "24th October 2016, 12:48 AM", "postID": "post69275724", "replies": [{"text": "Do you mean sorting it so the app that's causing the most drain is at the top? If so that's what I've done for that screen shot.", "time": "24th October 2016, 03:17 AM", "postID": "post69276898", "replies": [{"text": "It's now sorted by duration. It would be more interesting to see what apps do the most number of wakelocks (and thus preventing your device from going into deep sleep).\n\r\nSo, for example, from your screenshot we can see that 'Phone' did one request (x1) for a wakelock. But your Google App did it 526 times (x526). Try to find the option to sort on that information.", "time": "24th October 2016, 11:22 AM", "postID": "post69281354", "replies": [{"text": "The picture I posted was the CPU Wakelock option. I switched to wakeup triggers and the Google App shows 77 and there's nothing in the screen wakelock option.", "time": "24th October 2016, 03:02 PM", "postID": "post69284284", "replies": []}]}]}]}]}]}, {"text": "So I put my phone back to stock (relock bootloader, replace TWRP with stock recovery) because I was planning on returning it. It wasn't only the battery life I wasn't impressed with. It was the overall experience. I found the phone super laggy. When I put it back to stock it miraculously came to life. Battery life is great (only lost 2% overnight compared to 20-30% previously) and it seems much snappier. I'm actually really happy with it now. Even as I said before I unlocked the bootloader and rooted I had the battery issue and it still continued after rooting. I ordered a Pixel XL which I should be receiving tomorrow. I might end up sending it back and keeping my ZTE which is basically half the price. Also I would be charged a restocking fee of $78 plus I have to pay shipping back. There's pretty well $100 gone. I'm quite impressed now with the Axon 7 and I'm pretty sure I will be keeping it.", "time": "26th October 2016, 05:22 PM", "postID": "post69319575", "replies": []}, {"text": "i tunr off my phone. and the battery still gets empty by itself. does anbody has the same problem.", "time": "26th December 2016, 08:36 PM", "postID": "post70266017", "replies": []}, {"text": "I'm really pleased with this phone, the battery drain overnight is non existent:", "time": "24th January 2017, 06:29 PM", "postID": "post70709634", "replies": [{"text": "@Galaxo60 - That's great for you - but you must tell us if you are on stock or custom rom  and which version phone you have and which update you are on [ Bxxxxxxx ] for this information to be helpful", "time": "9th January 2018, 07:29 AM", "postID": "post75132804", "replies": [{"text": "I was always on stock, never did any development with the phone, but I don't remember the software version because that was a year ago. I just configured the stock settings and applications properly.", "time": "9th January 2018, 01:48 PM", "postID": "post75136094", "replies": []}]}]}, {"text": "on nB09 is about 0,5%/h after 1st charge,\nafter 2nd is is about 1%/3h", "time": "5th January 2018, 10:26 AM", "postID": "post75085458", "replies": [{"text": "Almost the same for me. \n\nEnvoyé de mon ZTE A2017G en utilisant Tapatalk", "time": "8th January 2018, 11:53 PM", "postID": "post75130034", "replies": []}]}, {"text": "I decided to check my idle drain last night. Charged to 100% and left one SIM on with data active. Woke up and looked, it has no battery data to see. A flat line over 7 hours, still on 100%. Not bad", "time": "12th January 2018, 07:56 PM", "postID": "post75176209", "replies": [{"text": "I know. Have that as well. Just beware though, the jump from 100% to 99% can be quite variable and most of the time, is not equivalent to the jump from 99 to 98% and so on.\n\r\nI've gotten up to 20 min SOT from 100 to 99%. If only it could be liked that for each % drop...", "time": "12th January 2018, 08:06 PM", "postID": "post75176294", "replies": []}, {"text": "Yes, battery very slowly drops from 100% (about 5-8h), but at any another percentage drops about 0,5%/h with two sim and wifi.", "time": "12th January 2018, 08:09 PM", "postID": "post75176330", "replies": []}]}, {"text": "Oh yeah, of course it will drop quickly once you use it, but it can show up misbehaving apps if idle is not efficient. I don't use Gmail app. I have Aquamail Pro. What charger do you guys use? I rarely use the QC3 original part. When I'm home I use a 2.4A generic and most of the time when in Sydney I use a 2A ASUS charger. My QC3 charger stays in my bag so it's with me when out and about if I need it.", "time": "12th January 2018, 08:22 PM", "postID": "post75176480", "replies": []}, {"text": "When I'm at the office, I often use the USB of the computer. When it's hurry, I use the QC3. \n\nEnvoyé de mon ZTE A2017G en utilisant Tapatalk", "time": "12th January 2018, 09:09 PM", "postID": "post75176915", "replies": []}, {"text": "Hi Guys,\n\r\nI have a battery of 20-40 % over night or when I do nothing on my ZTE Axon 7 and cleared all previous apps running.\n\r\nIn hte battery drain setting menu,  I don't see which applications are draining the battery apart from the Android system itself and the ZTE UI interface.  For sure I cannot delete those.\n\r\nIs there any way I can see more details about what happens when I don't use the phone without rooting (don't know how to do)? I even stopped data, bluetooth, wifi but it does the same. Anyone with this issue?\n\r\nThanks a bunch!", "time": "8th February 2018, 12:52 AM", "postID": "post75485065", "replies": []}]}, {"title": "Heavy use endurance", "rating": 4.0, "links": ["https://forum.xda-developers.com/axon-7/review/heavy-endurance-t3430730"], "threads": [{"text": "I'm quite the heavy user, but even so, since a while, I have to charge 2-3 times a day and sometimes, my battery level just remains stagnant for whatever reason", "time": "11th October 2017, 09:57 AM", "postID": "post74115917", "replies": []}, {"text": "If I watch streams(twitch) the battery lasts roughly 4.5 hours. If I play games like FGO or anything like that, battery lasts only 2.5 hours.\nThe phone lasts the longest if I only chat/browse the web, which is more than 6 hours.\nI am using stock so that might be why. I have a lot of different apps that requires the phone to be not rooted or running Android N. A good feature ZTE should add with their new upcoming stuff would be EAS and more low-power profiles. Because reading stuff, watching videos or playing lite 2D/3D games do not require the big cores to run between 80-100% all the time. I have noticed this happens all the time.", "time": "11th October 2017, 02:22 PM", "postID": "post74118418", "replies": []}]}, {"title": "Light use endurance", "rating": 5.0, "links": ["https://forum.xda-developers.com/axon-7/review/light-endurance-t3430731"], "threads": [{"text": "Before I put Facebook & messenger on it, light use was hardly noticed on the battery. Maybe 1% an hour. Even after the dreaded FB, it's not bad.", "time": "2nd August 2016, 03:19 PM", "postID": "post68011290", "replies": []}, {"text": "Its 16:23 now, I disconnected it around 6AM and I'm sitting on 53% with a reported 13 hrs remaining.    \n\nIts been a typical day at the office: several hours of podcasts listening mixed bluetooth and wired; 3 or 4 photos; ~30 seconds of video; periodic email, fb, hangouts use; a few websites.\n\nMy Note4 - even with an extended Anker battery would have been down to <20% at this point.\n\nSweet jesus how does one resize width=300px doesn't seem to work.", "time": "5th October 2016, 09:27 PM", "postID": "post68997951", "replies": []}, {"text": "Light browsing, some youtube videos, mostly note-taking.\r\nBattery never went below 50%.", "time": "19th November 2017, 08:00 AM", "postID": "post74562699", "replies": []}]}, {"title": "\"Look\" of the device (aesthetics)", "rating": 5.0, "links": ["https://forum.xda-developers.com/axon-7/review/look-device-aesthetics-t3430732", "https://forum.xda-developers.com/axon-7/review/look-device-aesthetics-t3430732/page2"], "threads": [{"text": "Does anyone have the Quarts yet? I have always been a white phone guy since the SGS3 but I am kinda liking the off gold color. What do you guys think of the gold vs quarts (gray) look.", "time": "16th August 2016, 10:33 PM", "postID": "post68220609", "replies": [{"text": "Well don't have any quarts at all since I quit drinking beer.  \n\r\nThe Quartz Gray phone is on the way and will be here Friday the 19th.", "time": "17th August 2016, 04:03 PM", "postID": "post68231277", "replies": []}, {"text": "Looks amazing. If you are into grey. \r\nIt gives it a less flashy look.", "time": "19th August 2016, 08:23 PM", "postID": "post68267617", "replies": []}]}, {"text": "For me with low vision I like the gold because greater contrast with black area where small nav keys are.", "time": "17th August 2016, 01:40 AM", "postID": "post68222428", "replies": []}, {"text": "worst thing about the Axon 7 looks wise is that god awful writing on the back of the phone.", "time": "25th August 2016, 10:17 AM", "postID": "post68356694", "replies": [{"text": "Is the writing/branding a decal or etched in?  (Mine should be here today!)\r\nIf a decal, maybe this will work...\n\nhttp://www.techtimes.com/articles/40...-remove-it.htm", "time": "15th September 2016, 04:54 PM", "postID": "post68702814", "replies": []}]}, {"text": "I have the quartz, I LOVE IT. I thought I'd never get away from the Samsung note series, but this phones aesthetics are beautiful.", "time": "16th September 2016, 03:33 AM", "postID": "post68710020", "replies": []}, {"text": "I may be a minority (maybe...) but as an owner of the chinese 6gb/128gb variant I do have to honestly say I REALLY like the faux 'wood embossing' on the speaker covers (they're plastic just like any other model, but for this one specific variant, they went an extra step to try to give it a bit 'more premium' look). That plus the overall gold look is a really nice package to me.", "time": "7th October 2016, 01:05 PM", "postID": "post69019800", "replies": []}, {"text": "I love the gold version. This is a VERY premium looking/feeling phone. I don't know how they got away with a $400 price tag..", "time": "20th October 2016, 11:50 PM", "postID": "post69228526", "replies": []}, {"text": "They totally ruined the look of the US version with the hardware keys.  Plus they are awful to use.  If I could figure out which version(s) don't have hardware keys and can run on US carriers, I would switch.", "time": "28th November 2016, 02:40 PM", "postID": "post69832545", "replies": [{"text": "The only variant without hardware keys is the A2017 ( Chinese ) and the Chinese as far as i know have 3 different variants :\n\r\n- A2017 with 4 GB Ram + 64 GB Storage.\r\n- A2017 with 4 GB Ram + 128 GB Storage.\r\n- A2017 with 6 GB Ram + 128 GB Storage + Force Touch.\n\r\nhaven't really look into if support USA bands.", "time": "29th November 2016, 02:35 AM", "postID": "post69841681", "replies": []}, {"text": "For me the hardware buttons are a plus! They leave the full screen space for apps and they're always available.", "time": "29th November 2016, 01:33 PM", "postID": "post69847867", "replies": [{"text": "yep I guess a lot of people feel the same. The problem is that they badly integrated them for no reason: the ZTE Nubia line has the same 3 capacitive buttons (dot circle dot) and they are backlit and well spaced. Even if they implemented them as a last time feature on the Axon, they already had the experience and the technology to do it well... The lack of backlighting is a real issue. For instance, on a samsung phone if you didn't use the light on the capacitive keys you would intuitively know that they are right and left of the home physical button. Whereas with the axon you just have a bar with 3 keys which don't have their \"safe\" space. So in the dark, even if you get used to it, it will always be kind of a guess attempt. That's why anyhow, it would great to have the choice between capacitive and on screen buttons, like in cyanogenmod.", "time": "3rd December 2016, 12:46 PM", "postID": "post69909131", "replies": []}]}]}, {"text": "I would hate to use valuable screen space for the buttons. Perhaps PIE would be a good option, although I don't mind those on the A2017U", "time": "29th November 2016, 03:40 AM", "postID": "post69842222", "replies": []}, {"text": "I think the design of Axon 7 is really superb. The phone is looking very great with metallic finishing.", "time": "1st December 2016, 05:19 PM", "postID": "post69882609", "replies": []}, {"text": "I think this phone is pretty sleek, even with a case on it. \n\nThe aluminum body and front facing speakers give it a premium look and feel. \n\nThe huge screen has many iPhone users envious, often asking me what phone this is. Yeah, it's sexy enough to convert users from iOS to Android.", "time": "4th December 2016, 03:14 PM", "postID": "post69925280", "replies": []}]}, {"title": "Quality feel (use of materials)", "rating": 4.5, "links": ["https://forum.xda-developers.com/axon-7/review/quality-feel-materials-t3430733"], "threads": []}, {"title": "Ergonomics (in-hand feel)", "rating": 4.5, "links": ["https://forum.xda-developers.com/axon-7/review/ergonomics-hand-feel-t3430734"], "threads": []}, {"title": "OEM skin/software", "rating": 3.0, "links": ["https://forum.xda-developers.com/axon-7/review/oem-skin-software-t3430735"], "threads": [{"text": "I like the skin, it's light and doesn't totally bog down the phone like others do. I love the launcher (I almost always download nova prime, haven't even downloaded it to this phone), I really really like the file browser. It's similar to the one Asus has on the play store, but polished a bit better, unlike other skins I feel this phones power saving mode actually makes a difference without destroying performance, the camera app is WAY better than the one from stock Android. I also like the short notification pull down menu. I can access Wi-Fi, data for both Sims, sound and gps. (They can be changed) , AND the voice recorder works extremely well. You can record in mid quality mp3 or high quality WAV. AND you can TRIM after.. \nThe most important things when I'm setting out driving. It's similar to that seem in nougat. \n\n it's missing some simple things like on screen button options,  a dark settings option, and it seems like there will be more themes made available than miflavor and stock Android. but coming from touchwiz, I can say I'm very pleased. \n\nOne bug I've noticed is while I'm on phone calls, her notification panel goes to garbage. It gets EXTREMELY laggy.. I mean... HORRIBLY laggy. Every other aspect of the phone works no differently than when I'm not on call.", "time": "25th September 2016, 04:38 PM", "postID": "post68854114", "replies": []}, {"text": "how you change themes i went to themes in settings but only 2 available and you cant download anymore", "time": "17th October 2016, 11:34 AM", "postID": "post69169949", "replies": []}, {"text": "I would love to see a NIGHT theme.", "time": "6th November 2016, 08:50 PM", "postID": "post69493655", "replies": []}, {"text": "For me the best dialer because T9 search also finds recently dialed numbers.\r\nNot a big fan of the launcher (Apple like) but I like the menus.\r\nDon't like the DND mode approach, which is burried in menus, though.", "time": "6th December 2016, 09:15 AM", "postID": "post69952546", "replies": []}, {"text": "How do you change the theme, that is a good question. since there are only 2 of them I would have also liked a dark mode.", "time": "6th December 2016, 02:26 PM", "postID": "post69956560", "replies": []}]}, {"title": "Outdoor visibility (max brightness)", "rating": 4.5, "links": ["https://forum.xda-developers.com/axon-7/review/outdoor-visibility-max-brightness-t3430736"], "threads": [{"text": "I would give it a 8.5 or 9 out of 10 for outdoor visibility. I live in the desert, it's very hot, dry, and bright out here for about half the year here. \n\nIt's much easier to see than my note 4 ( or 3 or 2 for that matter). \n\nI'd say 95% of the time I've been able to read outdoors in the summer with no issues. But there's been like... 3 days icouldn'tseejack because it was dangerously bright and hot outside.. (Shouldn't have been outside those days anyways because the UV index was through the roof)", "time": "25th September 2016, 04:49 PM", "postID": "post68854260", "replies": []}]}, {"title": "Contrast (true blacks)", "rating": 4.5, "links": ["https://forum.xda-developers.com/axon-7/review/contrast-true-blacks-t3430737"], "threads": [{"text": "I am coming from an amoled screen, yet I am amazed at how black the black is on the a7.   Using tbo Blacked Out apps are a no brainer.", "time": "6th November 2016, 08:53 PM", "postID": "post69493688", "replies": []}, {"text": "It's an Amoled screen, meaning the pixels are off when displaying black. The blacks are...black.", "time": "6th November 2016, 10:03 PM", "postID": "post69494449", "replies": []}, {"text": "What are the best color accuracy settings for the display?", "time": "6th November 2016, 11:27 PM", "postID": "post69495242", "replies": []}, {"text": "I'll go against the grain and say I'm mildy disappointed in the Axon 7's blacks. Vividness and high contrast are appealing to the eye, but so much detail is lost. \n\nhttp://www.lagom.nl/lcd-test/black.php\n\nAbove is a series of tests I use on all my displays. My TV and PC monitor are calibrated to have every black box visible on the above test. My Nexus 5 phone has all but the last box visible. My Axon 7 on the other hand loses six boxes which blend into the background. \n\nI honestly don't think this is a limitation of AMOLED hardware but likely the software configuration. I would be happy if ZTE released an sRGB calibration tool like OnePlus did for their OnePlus 3. \n\nYou can watch night scenes from The Dark Knight, B v S, Zero Dark Thirty, etc and really notice how much dark detail you're losing on the Axon 7.  \n\nI specifically remember a B v S scene where Batman is in his jet fighting Doomsday. A shot of Batman in his cockpit looks near completely black on the Axon: you lose all the detail of his cowl/mask, and the inside of the cockpit.", "time": "7th November 2016, 07:14 AM", "postID": "post69498621", "replies": [{"text": "Seriously? You used an LCD test for an AMOLED panel? No wonder your results don't make sense at all", "time": "8th November 2016, 05:16 PM", "postID": "post69522105", "replies": [{"text": "Your judgement is misguided. The blacks test on the link I provided was not designed for any specific display technology.  It says LCD test because it was posted online before AMOLED existed. It shows how the TV salesman trend of pumping up contrast, vividness, and saturation creates deficiencies in picture accuracy. \n\nhttps://community.zteusa.com/thread/12745\n\r\nOn ZTE community there are several members who observed the same. It's especially noticeable to professionals in film, TV, and photography who are used to having colour/tone accurate displays.", "time": "8th November 2016, 06:47 PM", "postID": "post69523495", "replies": []}]}]}, {"text": "If you put brightness to the max, you will see all the squares. With default brightness, near to the minimum, I lose 4-5 boxes (the first row).\r\nThat test is brightness dependent.\r\nAh, and I did it without the ambient being dark.", "time": "8th November 2016, 09:04 PM", "postID": "post69525363", "replies": [{"text": "For my Axon 7 I don't get the same results:  on 100% brightness I still don't see the six boxes in a dark environment. Changing the brightness on this phone has no effect on contrast or gamma.", "time": "8th November 2016, 10:08 PM", "postID": "post69526192", "replies": []}]}]}, {"title": "Color saturation & accuracy", "rating": 4.5, "links": ["https://forum.xda-developers.com/axon-7/review/color-saturation-accuracy-t3430738"], "threads": [{"text": "Per my other thread, there is a slight blue-shift when the display is viewed off-axis.\n\nhttp://forum.xda-developers.com/axon...e-off-t3443529", "time": "20th August 2016, 09:38 PM", "postID": "post68282726", "replies": []}, {"text": "Color accuracy will soon be fixed va CM custom rom. Greyscales are already excellent but color space is too saturated (identical not matter which color mode is being used, only intermediary saturations change).", "time": "6th December 2016, 09:13 AM", "postID": "post69952530", "replies": []}]}, {"title": "Clarity/resolution", "rating": 5.0, "links": ["https://forum.xda-developers.com/axon-7/review/clarity-resolution-t3430739"], "threads": []}, {"title": "Minimum brightness", "rating": 5.0, "links": ["https://forum.xda-developers.com/axon-7/review/minimum-brightness-t3430740"], "threads": [{"text": "I use CF.lumen in combination with Pixel Filter for nighttime reading. This makes the display as dim as I want, and thanks to the AMOLED screen, it actually emits less light as you go dimmer, while the same Apps on an LCD screen will just put more blankets over the backlight that's still blasting right in your face.\n\r\nSince you can achieve pitch black with CF.lumen alone, Pixel Filter might not be needed. I just use it to save some extra juice by shutting off half of the display entirely.\n\n\r\nIt would be nice if the regular brightness slider would go a bit dimmer, but the scheduling options of CF.lumen make it very bearable", "time": "7th March 2017, 09:25 AM", "postID": "post71318465", "replies": []}]}, {"title": "Call quality", "rating": 3.5, "links": ["https://forum.xda-developers.com/axon-7/review/call-quality-t3430741", "https://forum.xda-developers.com/axon-7/review/call-quality-t3430741/page2", "https://forum.xda-developers.com/axon-7/review/call-quality-t3430741/page3"], "threads": [{"text": "Please let us know if calls are clear and how speakerphone sounds and thanks.", "time": "7th August 2016, 08:12 PM", "postID": "post68084944", "replies": []}, {"text": "Call quality is perfectly fine. Good volume too. \n\nSpeakerphone is among the best I've ever used on a smartphone. Good volume and doesn't have that raspy, tinny characteristic that plagues many smartphones.", "time": "7th August 2016, 11:25 PM", "postID": "post68086977", "replies": []}, {"text": "On tmobile it is used volte and hd voice. Tested by calling note 5 and nexus 6p.", "time": "9th August 2016, 09:53 PM", "postID": "post68116291", "replies": [{"text": "I use TMobile also. How is your signal strength compared to other phones and thanks.", "time": "9th August 2016, 10:22 PM", "postID": "post68116621", "replies": [{"text": "It is seem fine.  Compared to my wife Note 5", "time": "9th August 2016, 10:27 PM", "postID": "post68116676", "replies": []}]}]}, {"text": "T-Mobile user here.  My previous phones all got full service at home, this one - on a brand new nano sim mind you, gets one bar and -116dBm and 24asu.  Calls sound poor.  Called T-Mobile and they said their system wasn't detecting the phone as an LTE device - but (Settings > About Phone > Status > SIM Status) shows LTE Cellular Network Type!\n\r\nI've tried with VOLTE both enabled and disabled and received the same signal strength.\n\r\nWhen I disable WiFi , my data shows 4G LTE but that doesn't change the signal strength for voice.  (Settings > About Phone > Status > SIM Status)\n\r\nT-Mobile was opening a trouble ticket to check the local tower I am connecting to but I suspect this is a phone radio or firmware issue and not SIM/Carrier related.\n\r\nAnyone else found setting changes to make optimal signal strength?", "time": "11th August 2016, 10:40 PM", "postID": "post68146934", "replies": [{"text": "I'm also on T-Mobile and have noticed some issues with signal strength and other radio related problems. I'm actually returning the phone to Newegg today because of the issues I describe below. I definitely think it's software related. The signal strength is mostly fine but it does seem too low in places compared to what my Nexus 6 had. \n\r\nThe major problem I'm having is with incoming calls either not ringing and going straight to \"missed\" or auto answering without ringing. It's happened at least 4 times where I see a missed call notification despite no ringing or vibrating and I never have my phone on silent. Just straight to missed call. \n\r\nOn several other occasions a call will come through and be answered automatically while in my pocket. It's the strangest thing I've encountered with a phone. The call just comes in without any warning or input on my behalf and I can hear the caller talking before I take the phone out of my pocket. There is an auto answer feature in the settings but it's been disabled. Even if that feature was on it should ring at least once.\n\r\nI love the phone but these two issues are massive deal breakers. I need to be able to receive calls properly for business and don't want to wait around for a fix or void my warranty trying a new ROM when development picks up.", "time": "13th August 2016, 04:31 PM", "postID": "post68171264", "replies": [{"text": "I've used this at home on TMO in Seattle for about a week and did not have the same issues. I also have active AT&T SIM and have not had problems. Other phones I carry with me are Nexus 6, Huawei Ascend Mate 2, LG G4, and RedMi Note 2. Compared to these other devices I did not notice a stark difference with signal strength. \n\r\nRegarding the \"not detected as LTE\" on TMO that sounds fishy to me. I'd suggest trying something, go into phone information menu from dialer *#*#4636#*#* and set network to LTE Only. Bounce the radio from the same menu (not required but a good idea). Then check if you're on LTE, if the phone is set to LTE Only and you have signal you're on LTE but to make it easier Google Play has a ton of apps to check this like G-NetTrack Lite or Network Cell Info Lite both will tell you specifically if you're on LTE and show eNB, etc. \n\nIf you do set phone to LTE Only you must go back into Settings --> Dual SIM settings --> Network Mode and set back to LTE/WCDMA/GSM \n\r\nYou'll notice this menu in Network Mode does not have options for \"LTE only\" or \"WCDMA (UMTS \"4G\" HSPA+) only\" which is why the going into the Phone Information menu is required for this. \n\r\nRight now I am out on business travel and one thing I can say is that the dual SIM is pretty good roaming. I got myself into a bad situation as I set my phone to LTE only for testing a few things and did not switch back. The carrier I am roaming on does not have VoLTE so I broke my voice for a about a day and did not notice until I tried to make an outbound call and it failed. \n\r\nRegarding call quality I've been using it abroad for about a week making voice calls on WCDMA/UMTS networks (no VoLTE here) with local SIMs and it's been just fine. No signal issues.", "time": "17th August 2016, 08:24 AM", "postID": "post68225762", "replies": [{"text": "mdkathon,  Thank you for the detailed reply!  Please note below the results:\n\nSo I followed your instruction to no additional positive result.  Using the two apps you recommended as well as the LTE Discovery app here is what I see:\n\nWhen I first enable the radio (whether LTE only or LTE/GSM/WCDMA) it comes up on LTE Band 12 and I have excellent signal (about 4 bars) with < -80 db and then about 30 seconds later it will fall over to LTE band 4 and the signal drops to > -110 or worse and I go to 1-2 bars of signal.  I have no idea why the LTE band changes on it's own.  Maybe I can force it to stay on Band 12 somehow?\n\nI looked up the TMobile frequencies and they are here:  Frequencies: Band 2 (1900 MHz), Band 4 (1700/2100 MHz), Band 12 (700 MHz)\nThe ZTE LTE Band support list is here:  LTE: B2/B4/B5/B12/B13/B17/B7/B3/B1/B20/B29/B30/B25/B26/B41\n\nSeems like I should be good.  I don't know why a good Band 12 signal would fall back to Band 4 though.  Can anyone explain that?\n\nI also noticed in the Testing menu (*#*#4636#*#*) the ability to select from the band menu:  USA Band, Band Mode 6 or Band Mode 7.  I haven't made any changes there since I cannot tell what the current selection is, nor what the difference between the 3 choices would be.  *Edit:  This is for GSM/UMTS so I'm not sure if it has any effect*\n\nOf those three LTE analysis apps I am not sure what any of the data is telling me (eNB etc) so if there is a primer for those I have not yet looked for it.", "time": "18th August 2016, 07:28 PM", "postID": "post68251175", "replies": [{"text": "Hi - I'm not a cellular engineer so I could be wrong, but I believe T-Mobile's network management itself is the variable in determining which LTE frequency your phone will use. So, even though you have a stronger band 12 signal available, the network will often push you to band 2 or 4 if it can do so as these frequencies yield better throughput in general and will free up spectrum on band 12, which is usually a bit more scarce (low band airwaves are typically more congested, so higher band airwaves like band 2 and 4 are preferred for network management purposes).\n\r\nThe only way to limit your phone to band 12 that I know of is hack into the non-volatile memory via the diagnostic mode and QXDM and manually enable/disable LTE bands 2 and/or 4...but that's probably more trouble than it's worth, especially if you don't want to permanently remove these bands. Plus, diagnostic mode can be super hard to get into on some devices and there are some protections which make it hard to make changes stick permanently, depending on the device.\n\r\nAlso, I should mention that Verizon and AT&T do the exact same thing as T-Mobile in my experience - for instance, band 13 for Verizon seems to only be used when band 4 or 2 are super low strength or completely unavailable. I often find my Verizon SIM sitting at around -115 dBm or so on band 4 and sometimes see it dip into the -120-ish area before switching to band 13.", "time": "22nd August 2016, 10:16 AM", "postID": "post68303493", "replies": []}]}]}]}]}, {"text": "I am on TMobile also and want to order this phone but reports of poor signal strength and wifi connection have got me hesitating.  Please keep your feedback coming and thanks.", "time": "13th August 2016, 04:18 PM", "postID": "post68171093", "replies": []}, {"text": "Has anybody tried the SIGNAL BOOST feature? Is it any good or just a gimmick?", "time": "19th August 2016, 03:46 PM", "postID": "post68263378", "replies": [{"text": "What signal boost feature?", "time": "23rd August 2016, 10:30 PM", "postID": "post68332079", "replies": [{"text": "See here, right above the \"Performance\" chapter:\n\r\ndevicespecifications.com/en/editor-review/f9c817\n\r\nThought if this can have something to do with the SD 820's TruSignal feature...?", "time": "25th August 2016, 08:34 PM", "postID": "post68366145", "replies": [{"text": "Odd, they removed the menu from the A2017U.", "time": "25th August 2016, 09:29 PM", "postID": "post68366997", "replies": []}]}]}]}, {"text": "Constantly told that It sounds muffled out, I can hardly hear as well... great via bluetooth but that's not always available. .. don't know any solutions right now other than maybe return the device..;.WIND Mobile.. Canada here. Never had any problems with the LG G4", "time": "23rd August 2016, 04:56 PM", "postID": "post68326840", "replies": []}, {"text": "As I mentioned in the cell strength review, this phone seems to have a small issue with reception. It is getting worse reception of 5-10db than an old s4, when everything is the same. There is a thread on reddit that has more info about this.", "time": "25th August 2016, 10:56 PM", "postID": "post68368122", "replies": [{"text": "I compared my A2017G to my older phone using the \"Mobil Signal\" app from the play store.\n\nMy old phone has one of the best receptions signals compared to other OEM. I even confirmed that with two CM devs that have like 15+ devices around and they confirmed that the phone has the best reception signal off all.\n\nI setup the Mobil Signal app and changed the widget to show \"percentages\" instead of dbm.\nDbm's don't tell me much.\n\nI hit refresh every time I had the chance too on both devices on different locations. Both Sim's are from the same provider both support the same bands.\n\nThe Axon 7 _always_ came 5% lower in signal strength than did my old phone. Telling by this results I think the A2017G has no issues in signal strength overall. As I compared it to a phone which is known to have an exception good reception.\n\nI think it is on par with other OEM's.", "time": "29th September 2016, 10:01 AM", "postID": "post68907897", "replies": [{"text": "Thanks for that and thanks for taking the trouble to download an app but what you've done there is just another variation on \"my phone is ok so yours must be too\".\n\nPeople, including me, are reporting that they are unable to get a signal in places they could with their previous phone and that data on their Axon 7 is unusable at times when phones held by people accompanying them are usable.\n\nBut you have an app and thanks to the app that you downloaded you were able to announce that \"the A2017G has no issues in signal strength overall\" and you it is \"on a par with other OEM's.\" \n\nAgain, thanks for your input.", "time": "29th September 2016, 10:47 AM", "postID": "post68908322", "replies": [{"text": "Well i did it for myself in the first place. Coming from my old phone which I ported to CyanogenMod and build a custom kernel for it such as optimizing the phone to the edge. It actually runs smoother than my Axon-7. I passed it on to my wife now but will keep maintaining it.\n\nI plan to return the A2017G as the baseband/firmware doesn't support VoLTE and probably never will. I already ordered the A2017U and will test/compare again.\n\nMight even compare it to a A2017G. Keep in mind I'm in Europe our LTE bands are compatible but US providers have different regulations to specific bands. Especially the ones that regulate them self to adjust for weather radar and other radars.\n\nIf the world had listened to Tesla 100 years ago we wouldn't have these problems today.", "time": "29th September 2016, 10:56 AM", "postID": "post68908423", "replies": []}]}]}]}, {"text": "Not sure if this specifically for our US chums. But I have to say I am disappointed with my EU version. The call quality is bad. Not so much about network in terms of stuttering/cutting conversations but in terms of the sound quality. There is a clearly audible background buzz and I can only liken the sound to a low quality audio file. By that I mean you can hear it but the 'noise' and subtle distortion is not what I expect. Imagine having an MP3 at 128KB and one at 320KB - I expect the latter and feel like it's the former.\n\r\nI am wondering if it is software or hardware. \n\r\nI'm reluctant to send back as I don't want to end up with a 'refurb' packaged and sent as a new one.", "time": "28th September 2016, 02:03 PM", "postID": "post68895904", "replies": []}, {"text": "I'm on A2017G B03. Anyone else experiencing the person on the other end only hearing you after you turn on and off speakers when calling someone? \nAny solution or faulty device? Should I return?", "time": "17th October 2016, 03:38 PM", "postID": "post69173080", "replies": []}, {"text": "ZTE A2017U_7193\r\nPoor reception on Verizon  and Att \r\nAtt Moto X pure -95 Axon 7 -107\r\nVerizon Moto X pure -99 Axon 7 -120\r\nNever drop calls on Motorola axon 7 worst reception of any phone I ever had", "time": "16th February 2017, 06:02 PM", "postID": "post71059338", "replies": []}, {"text": "No problem with call quality here.  My signal is exactly the same as my 6p staying at -95 at the house.", "time": "16th February 2017, 06:51 PM", "postID": "post71059930", "replies": []}]}, {"title": "WiFi strength, range, and throughput", "rating": 3.5, "links": ["https://forum.xda-developers.com/axon-7/review/wifi-strength-range-throughput-t3430742", "https://forum.xda-developers.com/axon-7/review/wifi-strength-range-throughput-t3430742/page2", "https://forum.xda-developers.com/axon-7/review/wifi-strength-range-throughput-t3430742/page3", "https://forum.xda-developers.com/axon-7/review/wifi-strength-range-throughput-t3430742/page5"], "threads": [{"text": "Both the Wifi, and cell signals are weaker than the Nexus 6P and the Samsung S7 Edge by a fair margin. With the Wifi, this is most notable when you're on a level of a house other than the level of the router. The Wifi cuts out periodically, and its signal strength is about 1/3rd of the other two phones in the same location.\n\nIt's cell signal on T-Mobile is also significantly weaker than the signal with the same sim card in the same location on the 6P and S7 Edge. Difference is -114db (Axon) vs. -101db (Nexus).", "time": "3rd August 2016, 06:25 AM", "postID": "post68020979", "replies": [{"text": "Well crap, I'm planning on buying one of these on tmobile and I live in an already mediocre signal area. I get about -122 to at best -106 at home though I just use wifi. Have you noticed any real world issues with the speed? Is -114 the best it gets in a max signal area?", "time": "4th August 2016, 01:56 PM", "postID": "post68040163", "replies": [{"text": "I would think that in a max area, with light usage from other phones that you would have no problem with higher numbers. Depending on your service provider and tower. T mobile should be fair but I would suggest Verizon if you do not live in T mobiles 4G service areas as Verizon has more coverage area.", "time": "30th May 2017, 12:04 AM", "postID": "post72479495", "replies": [{"text": "It ended up just being that I had this metal parking roof right in front of my apartment. It blocked my signal quite a bit along with OTA TV signal. It got much, much better after I moved. TMobile can be very fast indeed. Now I get up to -73 db (remember lower/more negative is better for signal strength)\nIt's faster than my medium tier cable modem!", "time": "30th May 2017, 01:02 AM", "postID": "post72479843", "replies": []}]}]}, {"text": "My axon 7 does a really great job at both wifi and cell signal much better than my 6p sorry to say because I love my 6p before I got the axon 7 , I am with att at the moment, camera wise the 6p still better", "time": "7th October 2016, 05:09 AM", "postID": "post69015922", "replies": []}]}, {"text": "I am on Tmobile as well which makes this disappointing. A few of the other issues noted didn't really sway me but this could be a dealbreaker for me.  As I have a S7 and am happy with it, short of small(ish) display, I cannot deal with poor signal on either cell or WiFi where as now it's pretty fantastic. I have 2 weeks to decide as Newegg still claims to be shipping the gray model then. Thanks for sharing.", "time": "4th August 2016, 03:04 PM", "postID": "post68041037", "replies": []}, {"text": "Ahhhhhhhh. I still haven't received my phone but between this and camera issues I'm feeling very concerned about my purchase.", "time": "4th August 2016, 04:04 PM", "postID": "post68041878", "replies": []}, {"text": "Axon 7 has weak Wi-Fi performance. 5ghz\nfluctuates like a bouncing ball. Really hope it's not a bad antenna design with this phone.\n\nAnyone else tested wifi ?\n\nThe guy from the zte webinar didn't even know it's AC capable phone.  This doesn't inspire confidence.", "time": "4th August 2016, 09:20 PM", "postID": "post68045901", "replies": []}, {"text": "My WiFi was running around 60mb on a 100mb link.\n\nPLUS, I am only 3 feet from the router, nothing in between them.", "time": "4th August 2016, 10:15 PM", "postID": "post68046494", "replies": [{"text": "That's good but not much of a test for a Wi-Fi device. \r\nYou need to move at least 20 feet from the router. \r\nAll devices get good Wi-Fi performance if your a few feet from the router. \n\r\nI have tested 50 dollar phones that get better Wi-Fi performance than this $400 phone.\n\n---------- Post added at 10:39 PM ---------- Previous post was at 10:27 PM ----------\n\n\n\r\nActually I'm testing this phone in the same area as several older and newer devices with no dead spots. \r\nThe axon 7 is quite weak by comparison. No other device tested  fluctuates signal strength  when holding device still. \r\nVery strange occurrence.\n\r\nCould be a bad antenna design or maybe a few bad units.  Hope it's a firmware fix!", "time": "4th August 2016, 10:39 PM", "postID": "post68046630", "replies": []}]}, {"text": "Yep, same here. In the same places I used to get no service with 2014 devices (like the s4 era stuff) I get no service with the Axon 7. Most of my previous devices (s7e, n6p, 5x, n6, blah blah blah) all retained at least a weak signal in those areas. Wifi seems actually better than my S7 Edge Exynos though.", "time": "4th August 2016, 10:18 PM", "postID": "post68046526", "replies": []}, {"text": "It sounds badly. Radio volume can be pop up in the software but to tell true it does not help too much in practice without a good antenna.  Also battery drain will be increased dramatically.  It is hard to imagine such software bug which causes weak signal strength in both wifi and LTE signal cases. So it could be antenna issue most likely and if antenna design is bad that's it. Move on!\n\nIt would be good to read opposite experiences which can keep the hope.", "time": "5th August 2016, 07:48 AM", "postID": "post68050900", "replies": []}, {"text": "It must be the  lower end QCA6164. Max I can connect with axon 7 is 433Mbps. That is if I stand 1 to 3 feet from the router. More of a problem is the poor weak signal as you move away from router. Then connection is down to 190Mbps after 10 feet to 20 feet.\r\nMust be a bad antenna system in this phone.\n\r\nMost important part of a mobile device is connectivity. This phone is clearly weaker LTE and Wi-Fi than other phones.\n\r\nNot everything that shines is gold", "time": "5th August 2016, 03:47 PM", "postID": "post68056098", "replies": []}, {"text": "In my daily use, I don't notice any difference in wifi strength or speed vs my Nexus 6P or my Moto X Pure. In my back room, I still get as good or better speeds on speedtest.net using the app to test. I know this doesn't rate the db, but I notice no real difference. \n\nIt also stays connected about 70 yards up the street, about on par with my last few phones.", "time": "5th August 2016, 03:49 PM", "postID": "post68056122", "replies": [{"text": "Do you mind telling what type of router you're Using? Qualcomm chipset routers work best with\nThis phone.  Mine is a Netgear r7000 and it's not  using Qualcomm chipset.\n\n---------- Post added at 03:58 PM ---------- Previous post was at 03:58 PM ----------\n\n\n\r\nDo you mind telling what type of router you're Using? Qualcomm chipset routers work best with\r\nThis phone.  Mine is a Netgear r7000 and it's not  using Qualcomm chipset.", "time": "5th August 2016, 03:58 PM", "postID": "post68056249", "replies": [{"text": "Netgear r6250", "time": "5th August 2016, 04:12 PM", "postID": "post68056420", "replies": []}]}, {"text": "How is your LTE reception/speed versus 6P?", "time": "5th August 2016, 04:42 PM", "postID": "post68056844", "replies": [{"text": "Once again, I don't have actual db numbers, but my \"bars\" show lower but my connection is just as good and fast, or even slightly better in certain areas. \n\r\nAt my work, I had 4-5 bars of LTE on my 6P.... On the Axon 7, I have 2-3. But, the LTE speeds on the Axon 7 are on par to what the 6P was, and actually slightly better. \n\r\nAt home, I had 1-2 bars on my 6P - It's the same on the Axon 7, but when I go to the back of the house I would drop signal on almost all phones (except my Moto X Pure), but the Axon 7 will still let me carry on a conversation and not cut out. \n\r\nSo, I don't know what the actual numbers are, but I know I get signal where I didn't before and it's typically on par with, or better than my 6P.", "time": "5th August 2016, 04:51 PM", "postID": "post68056982", "replies": [{"text": "Thank you.\n\r\nOther accounts on the ZTE forums are saying that is substantially worse than 6P or even the mediocre Oneplus One. This gives me hope at least.", "time": "5th August 2016, 04:56 PM", "postID": "post68057042", "replies": []}]}]}]}, {"text": "Haven't tested the data connection  thoroughly enough to OPIN on that.", "time": "11th August 2016, 01:42 AM", "postID": "post68133482", "replies": []}, {"text": "What is a recommended test for wifi and LTE data speeds? - speedtest.net app?", "time": "11th August 2016, 08:45 PM", "postID": "post68145611", "replies": [{"text": "That is a good app for the wan but, what about a lan testing app. Anybody know of an Android app for wifi testing the local area network?", "time": "11th August 2016, 09:01 PM", "postID": "post68145812", "replies": []}]}, {"text": "Do we know the maximum speed that connects at an ac1900 router? I have the oneplus 2 now and it connects at 433Mbps \n\nΣτάλθηκε από το ONE A2003 μου χρησιμοποιώντας Tapatalk", "time": "26th August 2016, 03:27 PM", "postID": "post68378791", "replies": [{"text": "I returned mine but I was the first to do WiFi tests 4 weeks ago. Axon 7 only connects at 433Mbps due to the lower Qualcomm WiFi version in the soc.\n\nAll the best.", "time": "26th August 2016, 05:02 PM", "postID": "post68380367", "replies": []}]}, {"text": "That's not true. I have an Axon 7 and it connects Up to 866mbps\n\nEnviado desde mi ZTE A2017G mediante Tapatalk", "time": "27th August 2016, 07:24 PM", "postID": "post68398890", "replies": []}, {"text": "I was using the USA variant. It will not connect at higher than 433Mbps using a r7000 router. All my other similar mobile devices can connect at 866Mbps.\n Aida64 reported the battery in the Axon 7 being 3100mah but zte says it's 3250mah. Maybe Aida is not reporting accurately Or maybe Zte is not truthful.", "time": "27th August 2016, 07:49 PM", "postID": "post68399274", "replies": [{"text": "My aida64 is reporting 433 on a US model, with an r8000 router. So I am having the same issue.", "time": "28th August 2016, 11:33 PM", "postID": "post68418386", "replies": []}]}, {"text": "There are two Qualcomm VIVE chipset that can be paired with the 820 -- https://www.qualcomm.com/products/vive/chipsets -- scroll down to the chipsets for devices. One tops out at 433 and the other tops out at 866. It going to depend on which version of the chip they used. My guess for a \"budget flagship\", they used the lower of the two chipsets. The best bet would probably be to pull info from the kernel or from something like lspci.", "time": "30th August 2016, 06:21 AM", "postID": "post68438781", "replies": [{"text": "Good find, weird that they seemingly chose the better wifi/bt module for the global/eu version but gave the U.S. the worse of the two. Wonder if it was due to issues with the U.S. network bands? Apparently the OP3 also uses the same QCA6164A 433Mbps chip.  Next up is to determine where the cellular issues are coming from ~.~", "time": "30th August 2016, 11:20 PM", "postID": "post68451957", "replies": []}, {"text": "Per kernel source, only QCA6174 is mentioned so it might be a flag that sets the limit peak speed. Since kernel was B18, it is the US version one. There are multiple version of the firmware files thouhg\n\nCode: \ndefine QCA6174_VENDOR_ID\t(0x168C)\r\n#define QCA6174_DEVICE_ID\t(0x003E)\r\n#define BEELINER_DEVICE_ID      (0x0040)\r\n#define QCA6174_REV_ID_OFFSET\t(0x08)\r\n#define QCA6174_FW_1_1\t(0x11)\r\n#define QCA6174_FW_1_3\t(0x13)\r\n#define QCA6174_FW_2_0\t(0x20)\r\n#define QCA6174_FW_3_0\t(0x30)\r\n#define QCA6174_FW_3_2\t(0x32)\r\n#define BEELINER_FW\t(0x00)\r\n#define AR6320_REV1_VERSION             0x5000000\r\n#define AR6320_REV1_1_VERSION           0x5000001\r\n#define AR6320_REV1_3_VERSION           0x5000003\r\n#define AR6320_REV2_1_VERSION           0x5010000\r\n#define AR6320_REV3_VERSION             0x5020000\r\n#define AR6320_REV3_2_VERSION           0x5030000\r\n#define AR900B_DEV_VERSION              0x1000000\r\n\r\nstatic struct cnss_fw_files FW_FILES_QCA6174_FW_1_1 = {\r\n\"qwlan11.bin\", \"bdwlan11.bin\", \"otp11.bin\", \"utf11.bin\",\r\n\"utfbd11.bin\", \"epping11.bin\", \"evicted11.bin\"};\r\nstatic struct cnss_fw_files FW_FILES_QCA6174_FW_2_0 = {\r\n\"qwlan20.bin\", \"bdwlan20.bin\", \"otp20.bin\", \"utf20.bin\",\r\n\"utfbd20.bin\", \"epping20.bin\", \"evicted20.bin\"};\r\nstatic struct cnss_fw_files FW_FILES_QCA6174_FW_1_3 = {\r\n\"qwlan13.bin\", \"bdwlan13.bin\", \"otp13.bin\", \"utf13.bin\",\r\n\"utfbd13.bin\", \"epping13.bin\", \"evicted13.bin\"};\r\nstatic struct cnss_fw_files FW_FILES_QCA6174_FW_3_0 = {\r\n\"qwlan30.bin\", \"bdwlan30.bin\", \"otp30.bin\", \"utf30.bin\",\r\n\"utfbd30.bin\", \"epping30.bin\", \"evicted30.bin\"};\r\nstatic struct cnss_fw_files FW_FILES_DEFAULT = {\r\n\"qwlan.bin\", \"bdwlan.bin\", \"otp.bin\", \"utf.bin\",\r\n\"utfbd.bin\", \"epping.bin\", \"evicted.bin\"};\r\n\r\n#define QCA6180_VENDOR_ID\t(0x168C)\r\n#define QCA6180_DEVICE_ID\t(0x0041)\r\n#define QCA6180_REV_ID_OFFSET\t(0x08)\n6164 is not in the source code at all\r\nThere are also def's for QCA6180, but no info on it on the net, and it's only few entries.", "time": "30th August 2016, 11:30 PM", "postID": "post68452046", "replies": [{"text": "Can someone who is rooted run dmesg in a terminal and post output, it should show us the chip and possibly even the firmware. It would be good to get both U and G versions", "time": "31st August 2016, 06:33 AM", "postID": "post68455688", "replies": [{"text": "Where in the kernel dump did you find that?\n\r\nAlso, since they are basically the same HW but different specs, I wonder if they could be running essentially the same FW/API and then the final speed is just limited by the chip itself. Kind of like how Intel and GPU makers bin less performant chips as a lower model. Maybe some part of the radio is slightly busted so they become the 6164A version but with the same firmware. It definitely an odd situation.", "time": "31st August 2016, 08:02 AM", "postID": "post68456499", "replies": [{"text": "The file is here drivers\\net\\wireless\\cnss. If it's limited it will probably be in the radio firmware and there are apparently 5 FW versions.", "time": "31st August 2016, 08:42 PM", "postID": "post68466846", "replies": []}]}]}]}]}, {"text": "The wifi range is pretty anus IMO", "time": "4th October 2016, 07:55 PM", "postID": "post68982013", "replies": []}, {"text": "I have no complaint with the wifi, though the 2G reception is bad sometimes.(not sure why)", "time": "5th October 2016, 03:11 PM", "postID": "post68992868", "replies": []}, {"text": "Why my WiFi icon flicking constantly to 4g when it's connected with router any idea?", "time": "5th October 2016, 04:07 PM", "postID": "post68993593", "replies": []}, {"text": "To add wi-fi performance on this isn't great. My N6p is way better.  When u set up WhatsApp and restore my data on the 6p it's done within seconds.  It took minutes and painful minutes on the axon 7.  Disappointing", "time": "6th October 2016, 05:45 PM", "postID": "post69009749", "replies": []}, {"text": "I have got the german model A2017G and can say that my wifi Signal ist better then with my moto x play. Absolutly no Problems with Signal here... \n\nGesendet von meinem ZTE A2017G mit Tapatalk", "time": "11th October 2016, 10:51 AM", "postID": "post69074759", "replies": []}]}, {"title": "Cellular strength and throughput", "rating": 3.0, "links": ["https://forum.xda-developers.com/axon-7/review/cellular-strength-throughput-t3430743", "https://forum.xda-developers.com/axon-7/review/cellular-strength-throughput-t3430743/page2", "https://forum.xda-developers.com/axon-7/review/cellular-strength-throughput-t3430743/page3", "https://forum.xda-developers.com/axon-7/review/cellular-strength-throughput-t3430743/page11"], "threads": [{"text": "I was on my way up northern Michigan and my wife drove for a bit and I compared the axon to her Moto G (2016) and it they both had to about the same signal. Both had issues shedding weaker towers. Now that we are up at the cabin both phones have very similar signal. So I think the axon is at least as good as a Moto G (2016).", "time": "21st August 2016, 03:21 PM", "postID": "post68291988", "replies": [{"text": "On what network?", "time": "22nd August 2016, 06:13 AM", "postID": "post68301416", "replies": [{"text": "cricket (att)", "time": "22nd August 2016, 06:38 AM", "postID": "post68301613", "replies": []}]}]}, {"text": "Now that I am back at a keyboard I can expand a bit. I was testing via running speed tests. When I first started the Moto G was destroying the Axon. I started getting a sunken feeling, but then I noticed the Axon shifted off a tower only getting HSPA (\"4G\") to one using LTE so I reran a few speed tests and the Axon trounced the Moto G, as it was still stuck on the under performing tower. So that's when I thought maybe a rural roadtrip, with an iffy signal to begin with, wasn't the best way to test this. Once we arrived at the cabin we both had between 1 and 2 bars of HSPA connection that would only work in specific corners of the cabin effectively. Seemingly the same. \n\nI know this isn't an empirical test. I wasn't comparing the actual db numbers or anything. But to my eyes, Axon is about on the same level as the Moto G (2016). I don't know how good the Moto G actually is but I remember reading it had good signal when I was originally reading reviews for it.\n\nOnce again this was all tested on the Cricket (via AT&T) network.", "time": "23rd August 2016, 05:37 PM", "postID": "post68327530", "replies": []}, {"text": "Up in Canada on Rogers and am having severely low signal rate. Cannot find service in any basement ive been in throughout the city. Signal of around -120dBm inside buildings. The signal seems very erratic and jumps from 96-143dBm extremely quick. I seem to think there may be a modem problem with this network. If anyone else is on Rogers please chime in on your findings.", "time": "24th August 2016, 08:34 PM", "postID": "post68348311", "replies": []}, {"text": "The signal strength is worse than my s4, I checked the db and it is 5-10db worse, but occasionally will jump to being on par to the s4. Tested on tmo lte, neither phone was being held. Not sure how the rating is 4.5/5 as a reddit post agrees that there is some issue.", "time": "25th August 2016, 10:45 PM", "postID": "post68367976", "replies": []}, {"text": "The signal quality is definitely not stable, had a few minor call drops if I am not in certain parts of my house and inside stores which can be tough on signals but it's nowhere near as strong as my other test phones such as the S5, Note 4, and S6 Edge+.  I was dropping calls earlier this week and switched back to Note 4 and I was able to talk everywhere w/o dropped calls.  This is on Tmobile and signal is decent in my area.   Then on WIFI strength, the Note 4 beats it by 20-30% throughput.  That's a 2014 device.\n\nMy problem with all these Chinese brand phones is they have great specs but software is lacking.    Looks like I maybe back to my workhorse Note 4.", "time": "1st September 2016, 09:36 PM", "postID": "post68483303", "replies": [{"text": "Yeah.. My note 4 has the best signal of any device I've ever used.. I've never had complete signal loss with my Axon.. But I pretty frequently have weak signal(2/5) in places my note 4 had solid (4/5) bars..", "time": "17th September 2016, 04:17 AM", "postID": "post68725593", "replies": []}]}, {"text": "So I used this phone to drive Uber in Los Angeles all last night and had some pretty major problems.\n\nGPS Signal would randomly shift positions so Google Maps would keep rerouting during trips. This didn't always happen, but happened enough to be annoying.\n\nI'm pretty sure I lost a bunch of trip requests because they just never got through to my phone.\nThis is either because the OS wasn't allowing the notifications to come through correctly, or because of the network performance.\nInterestingly I was streaming podcasts the entire time which came through fine for the most part, but they would cut out every once in a while if I ended up in areas with 1bar (which happened often last night).\n\nThis is a pretty major problem for me, I don't know if something like Cyanogenmod will fix me not receiving requests, but the cellular and GPS performance are very clearly performing poorly.\n\nEdit:\nCellular performance is now much better after the update.\nI would say it's on par with average smartphones (I still lose reception where most people do), and it no longer just drops and stays of signal for no good reason.\nGPS performance is OK, it tends to shift around while I'm driving a bit (thinking I'm on the street next to me).", "time": "3rd September 2016, 09:46 PM", "postID": "post68515253", "replies": []}, {"text": "Has anyone been able to confirm that this is due to a bad physical design of the antenna and not a software issue?\n\r\n I was ready to buy this device until I saw these reports of bad signal strength", "time": "7th September 2016, 01:10 AM", "postID": "post68564243", "replies": []}, {"text": "Hi guys,\r\nCan any European users comment on radio signal performance? Could the issue be limited to the US version?", "time": "11th September 2016, 11:38 AM", "postID": "post68633126", "replies": [{"text": "To asnwer my own post, it seems some amazon.de customers are returning the phone due to very poor reception.\n\nI was soooo looking forward to buying this phone and am shocked that ZTE would put it on the market with such a problem. Time will tell if it is hardware related (which it probably is), but most likely my money will go to another brand. I sooo wanted good sound \n\nEDIT: please, any feedback from European customers?", "time": "13th September 2016, 06:52 AM", "postID": "post68661943", "replies": []}]}, {"text": "There are some reviews about the cellular strength on a german forum (android-hilfe.de/thema/empfang-des-axon.792336/) but without any comparison to other phones.", "time": "13th September 2016, 10:25 AM", "postID": "post68664188", "replies": []}, {"text": "The Pocket Now review of the Axon 7 mentions potential radio issues and compares it to other phones.\nAxon 7 Signal Strength\r\nIt doesn't look good.\n\r\nI wonder if the new \"Mini\" version of the phone has the same issue and if not, perhaps they corrected a hardware flaw.\n\r\nThere is a new software update for the Axon 7 coming soon. I hope it addresses the signal strength issue, but I wouldn't hold my breath. We may have to just wait for the Axon 8.", "time": "13th September 2016, 04:40 PM", "postID": "post68669372", "replies": [{"text": "When new Axon 7 update coming? any link for that please", "time": "13th September 2016, 09:54 PM", "postID": "post68674193", "replies": []}]}, {"text": "Note 3\nCellular: -93 dBm\nWifi 5ghz: - 46 dBm\n\nAxon 7\nCellular: -118 dBm\nWifi 5ghz: -59 dBm\n\nCan't perform an LTE speedtest on the Axon 7.  It won't hold a connection long enough.  Web pages constantly fail to load.\n\nSignal strength is significantly worse than my 3 year old Note 3.  So much so the phone is unusable at home.", "time": "15th September 2016, 09:26 PM", "postID": "post68706953", "replies": []}, {"text": "I commented elsewhere on this as I'm mainly sending the phone back because of the very poor camera and the disappointing audio. \nThe radio however is the worst I've had since 3G was launched. I've been all over Brussels today and barely seen a 4G signal. I'd forgotten 3G existed until today. I managed to get the Axon to connect to 4G by toggling the mobile data on and off but it quickly went back to 3G.\nMy bedroom is in the basement but thanks to a nearby base station I get four bars 4G on my Honor 7. The Axon get one-two bars on 3G. \nI'm bailing out now. I'm not waiting for a software update to fix the radio and I'm not sure the camera *can* be fixed, it's that bad.\nThe lovely screen apart, the A7 is a downgrade from the much cheaper Honor. Shame.\n\nGrey Axon 7 purchased from Amazon Germany.", "time": "15th September 2016, 11:22 PM", "postID": "post68708127", "replies": []}, {"text": "LTE: Nexus 5X:  -105 dB,  Axon 7:   -113 dB\n\r\nForcing 3G on both phones:  Both about -95 dB.", "time": "16th September 2016, 02:30 PM", "postID": "post68716459", "replies": []}, {"text": "European version\nIndoors in a café. Both of our phones are on the same network using the same base station. The Nexus 5x shows -106dBm on LTE while the Axon 7 shows -111 dBm on HSPA and is unable to load a page.\nA bad camera, broken audio and a weak radio now seem a heavy price to pay for a nice screen and a top of the line chip.... it was too good to be true.", "time": "16th September 2016, 07:08 PM", "postID": "post68720575", "replies": []}, {"text": "When I was walking home from campus today, I had 4G with a maximum of 2 bars missing (one missing most of the time, sometimes full bars) 90% of the 3km trip. Don't have any other LTE phones to compare it to, so take that with a grain of salt.", "time": "16th September 2016, 08:47 PM", "postID": "post68721877", "replies": []}, {"text": "It's funny that everybody has issues with service, but I think it's one of the best phones I've had in a good while for reception. I get LTE in areas my iPhone 6s+ would constantly switch between LTE and no data. Had a note 7 for a bit and it couldn't even get a signal.", "time": "17th September 2016, 02:22 AM", "postID": "post68724833", "replies": []}, {"text": "Switched from a OnePlus One (T-Mobile California). Both phones were a little below average to average in terms of connectivity. Tested an iPhone 5s with the same sim and got an extra bar or two. For reference I have two Axon 7s and both report the same signal strength. It's not a deal breaker as it will still connect to 4g but if you desire amazing cell connectivity I'd probably look at another phone. For me it's not an issue though.", "time": "17th September 2016, 07:51 PM", "postID": "post68735826", "replies": []}, {"text": "My axon 7 EU version will never contact to 4g on three it connects to 4g on Vodafone fine but my note 5 uses threes 4g fine using the same sim thinking about returning it shame as it's the perfect phone I want but if I can't get good phone signal pointless phone.", "time": "18th September 2016, 01:05 PM", "postID": "post68745303", "replies": [{"text": "It would be better to check the actual signal strength (i.e. the number id db) instead of just the number of bars. It appears that some phones display the signal differently in terms of number of bars.", "time": "18th September 2016, 01:33 PM", "postID": "post68745668", "replies": [{"text": "I did note 5 in exact same place on a table is 83db had to force 3g only to compare are axon never uses 4g but 3g on axon exact same spot is 97db jumping to 111db all over the place.\n\n\nVodafone though is on 4g 104db and axon 101db why does this phone work on there but on three is so different between phones.", "time": "18th September 2016, 02:14 PM", "postID": "post68746191", "replies": []}]}]}, {"text": "I was a bit nervous when I ordered A7 reading few (many) complaints about Wi-Fi and lte capability. It was so unbelievable that ZTE could release phone with such problem. Anyway I ordered it from Amazon and I got it yesterday. (A2017G/B03)\n\nOf course I would have liked to check it immediately.  Recently we have used Samsung Galaxy Note 3 and S4. Actually we are satisfied with both phones very much so far. We haven't had any signal or Wi-Fi issue for years. So I compared A7 to them. We were in a place where gsm/3G/4G signal strength was very poor. Practically it meant zero inside the building and very poor in outside. My first experience was that I got signal inside sometimes with A7 but apart from this gsm and data capability was the same around the house. It is poor of course. \n\nLater at home I did some measurement by using Network Signal Info. I put phones next to each other. Both got SIM from same provider (Vodafone) and they connected to same tower (LTE). Signal strength was between 70 and 80 dBm during the test and from time to time I exchanged phones in position. I did test horizontal position as well as vertical position. Well I would say that A7 and Note 3 performed on very same level. May be Axon was better with 1 or 2 and rarely 3 dB more times than vice-verse but it was hard to diagnose. Also the position was very important. Phone which was in a particular position performed better almost always. I repeat the test with S4 too. May be it is better than other two but I have to emphasize that differences were very-very tiny. Rather I would say that 3 phones have same signal receiver capability. \n\nWi-fi. I can say same. ZTE has same signal strength and data transfer rate as Note 3 but I have to emphasize here as well that many-many things can impact the result included the position of the tester near to the phones. \nI copied files from to PC via Wi-fi and Total Commander showed same rate as in case of Note and S4 earlier.\n Finally. My opinion is that ZTE is not worse than the average at all. What is more it performs very well even if some phones are better.  I think it can do what Snapdragon makes available.", "time": "18th September 2016, 06:53 PM", "postID": "post68750138", "replies": [{"text": "I've had much the same experience. The Axon 7 isn't 'oustanding' but it's definitely not bad in terms of cell reception. I would say that if you require a phone that is very dependent on having the best cell connection possible then the phone probably isn't for you but it's no worse than the average phone. Definitely not a deal breaker.", "time": "18th September 2016, 09:00 PM", "postID": "post68751847", "replies": [{"text": "For me signal strength is a deal breaker..\nOnce I have lg g2, good smartphone,l long las battery but not as good as s3 in strength signal.\nSame goes with Sony z3+ vs note 4, note 4 win it all.. \nToo bad signal strength is not strongpoint for this marvelous spec smartphone", "time": "19th September 2016, 04:01 PM", "postID": "post68762871", "replies": []}]}]}, {"text": "I'm afraid this is also a deal breaker for me i use mobile data a lot as my area has crap broadband speed and the fact axon 7 never uses 4g ruins the whole phone my note 5 has no issues using 4g about 70mb/s.\n\nWill have to look at the note 7 dual sim.", "time": "19th September 2016, 09:14 PM", "postID": "post68767376", "replies": []}, {"text": "For those with the the recent A2017U update installed (B27), care to chime in on the signal strengths compared to before?", "time": "19th September 2016, 11:05 PM", "postID": "post68768625", "replies": []}, {"text": "Does the latest update gave better signaL RECEPTION comparing to before ?", "time": "30th December 2017, 10:57 AM", "postID": "post75012499", "replies": []}]}, {"title": "Speakerphone (loudness, clarity)", "rating": 4.5, "links": ["https://forum.xda-developers.com/axon-7/review/speakerphone-loudness-clarity-t3430744"], "threads": [{"text": "The front facing dual speakerphones are amazing. They can be very loud, more than any other phone I've encountered, and it's a great quality (for a phone and even more). But, I found that the atmos equalizer actually makes the sound quieter and less clear. Ironic.", "time": "14th October 2017, 04:58 PM", "postID": "post74155690", "replies": []}, {"text": "How is viper4android on the axon 7. Does it make it better", "time": "15th October 2017, 08:38 PM", "postID": "post74170898", "replies": []}, {"text": "It would make the internal speakers and bluetooth better but probably break support on the DAC for the 3.5mm jack.", "time": "16th October 2017, 02:24 AM", "postID": "post74173245", "replies": []}, {"text": "I'm really shocked by this, as my Axon 7 is one of the worst speakerphones I've ever used. people sound fine to me, but almost without fail, people I call have difficulty hearing me. Doesn't matter if they are on the same carrier, a different one, or even a landline.", "time": "17th October 2017, 06:45 PM", "postID": "post74194941", "replies": []}, {"text": "celticchrys, have you tried to walk around other place, I guess it's the place that block your signal. Or you can reset your phone.", "time": "18th October 2017, 04:18 PM", "postID": "post74206262", "replies": [{"text": "It seems to happen whether I'm at home, work, or in the car. It happens on stock and on Lineage OS. Therefore, I've always assumed low quality microphone. It happened on my first Axon 7 (a gold one), and also on the current one (a grey one), which was a warranty replacement device, when the first one got broken.", "time": "20th October 2017, 02:44 PM", "postID": "post74230789", "replies": []}]}, {"text": "Maybe because the speakers are good, you could be too far from the mic?\n\r\nI don't find it that loud on speakerphone but on GPS it's quite loud. The sound quality is good.", "time": "18th October 2017, 08:50 PM", "postID": "post74209627", "replies": []}, {"text": "Sound on GPS is good, seems GPS lady is murmuring sweet nothings in my ear 😋", "time": "12th November 2017, 08:12 AM", "postID": "post74486590", "replies": []}]}]