[{"title": "How to disable notification text (preview) in status bar?", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x/moto-x-qa/-t3329241"], "threads": [{"text": "Found a way. NotifyClean can do this.\nRoot required. Can disable on a per app basis.", "time": "5th March 2016, 12:49 PM", "postID": "post65665754", "replies": []}]}, {"title": "Moto X Indian Thread [Pricing, Availability, Reviews, Support and More]", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x/general/-t2662264", "https://forum.xda-developers.com/moto-x/general/-t2662264/page2", "https://forum.xda-developers.com/moto-x/general/-t2662264/page3", "https://forum.xda-developers.com/moto-x/general/-t2662264/page29"], "threads": [{"text": "Im using a dev ed moto x 32gb and im very happy with it.  Touchless controls are amazing so with active notifications. Sold my N5 and got this badboy.", "time": "26th February 2014, 05:57 PM", "postID": "post50653459", "replies": []}]}, {"title": "Moto X Extended Battery with microSD slot for review", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x/accessories/-t2969999", "https://forum.xda-developers.com/moto-x/accessories/-t2969999/page2", "https://forum.xda-developers.com/moto-x/accessories/-t2969999/page3", "https://forum.xda-developers.com/moto-x/accessories/-t2969999/page6"], "threads": [{"text": "Doubt it'll be me, but I'd love to test it out. Getting tired of using my OTG cable and external battery charger, hah.", "time": "11th December 2014, 08:08 PM", "postID": "post57430992", "replies": []}, {"text": "Loved.. Always wanted a reason to upgrade my phone (battery life).. That's gonna solve the issue.. I have question it's made by you/your Company or its third party \n\nI don't care if it's huge guess what when I go to work I don't have take charger with me", "time": "13th December 2014, 09:33 AM", "postID": "post57466249", "replies": []}, {"text": "I'll volunteer for testing.  Size looks like an interesting factor to talk about, considering all the rage about thin phones recently.", "time": "15th December 2014, 04:27 AM", "postID": "post57507865", "replies": []}, {"text": "Hope i can help, that's really useful for me for calling clients in the law firm", "time": "16th December 2014, 12:59 PM", "postID": "post57539349", "replies": []}, {"text": "Looking forward to testing and writing a review about this product!", "time": "16th December 2014, 05:01 PM", "postID": "post57544360", "replies": []}, {"text": "I need this for travelling", "time": "17th December 2014, 11:00 PM", "postID": "post57575960", "replies": []}, {"text": "I'd love to try this!", "time": "21st December 2014, 04:11 PM", "postID": "post57655462", "replies": []}]}, {"title": "[Q] Android L Developer Preview on Moto X via Safestrap", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x/moto-x-qa/-t2915096"], "threads": [{"text": "You'd likely brick your device.   Right dead.   If it even flashed.   \n\nNever flash anything made for another device... Ever.    😉", "time": "24th October 2014, 01:09 AM", "postID": "post56235347", "replies": []}, {"text": "I guess I don't really understand how safestrap works. I thought it's like chroot and it's 'safe' to try different rom)", "time": "24th October 2014, 01:51 AM", "postID": "post56235936", "replies": [{"text": "Safestrap is essentially just a workaround for phones with unlockable bootloaders. It provides the means to install custom ROMs in a secondary 'slot', though they still rely heavily on the main stock ROM; hence why @KJ says that the ROMs have to be made for your device and confirmed to work with safestrap. It also means no custom kernels or anything like that. Unfortunately it isn't like chroot, and treating it as such would be catastrophic. I'm antsy to get my hands on Android 5.0 as well, we just have to be patient. I think it'll come quickly enough for the X.", "time": "24th October 2014, 05:30 AM", "postID": "post56238737", "replies": []}]}, {"text": "No.   You can only flash roms made for your device,  or absolutely confirmed working on your device other roms... Which is very rare.", "time": "24th October 2014, 04:42 AM", "postID": "post56238121", "replies": []}]}, {"title": "moto x still a good phone? review", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x/general/-t2892349"], "threads": []}, {"title": "Great review! Best android ever!", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x/general/-t2872568"], "threads": [{"text": "One of the few articles from the Verge I could actually agree with.", "time": "10th September 2014, 02:19 AM", "postID": "post55350016", "replies": []}, {"text": "Lol, a review huh? I guess as soon as a phone is announced, from now on it will come with a preview.", "time": "10th September 2014, 03:26 AM", "postID": "post55350785", "replies": []}, {"text": "Please search before posting. This was already posted in the New Moto X 2014 Megathread.", "time": "10th September 2014, 07:03 AM", "postID": "post55353030", "replies": []}]}, {"title": "Play store apps reviews not sorting", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x/moto-x-qa/-t2846497"], "threads": [{"text": "Weird", "time": "13th August 2014, 07:30 PM", "postID": "post54803987", "replies": []}]}, {"title": "[VIDEO REVIEW] Pressy The Almighty Button", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x/accessories/-t2814361"], "threads": [{"text": "Interesting", "time": "13th July 2014, 05:30 AM", "postID": "post54110304", "replies": []}, {"text": "How much does it cost? Also can I take a picture with the screen off?", "time": "14th July 2014, 08:25 AM", "postID": "post54133389", "replies": [{"text": "yes it can, I got it for $10 on kickstarter...but I think it's ~$25ish now, pricey but works pretty well.", "time": "14th July 2014, 09:35 AM", "postID": "post54134208", "replies": []}]}, {"text": "These things are pretty dang cool. However $25 seems like a bit much for this. You got a good deal by backing it!", "time": "14th July 2014, 07:19 PM", "postID": "post54144770", "replies": []}, {"text": "I dunno. Yeah it looks cool. But I use my headphone jack alot for, you know, headphones. So half the time I'd have this tiny little thing that I'd have to put in my pocket or my sock or something and try real hard not to loose it, but I'd eventually loose it anyway, because it's so small. And it's $25.", "time": "17th July 2014, 06:43 PM", "postID": "post54217980", "replies": [{"text": "It has a little headphone holder, holds the Pressy and your headphones! It's a neat little gadget, I use my Studio Wireless headphones though. So that's a non-issue for me.", "time": "17th July 2014, 06:48 PM", "postID": "post54218091", "replies": []}]}]}, {"title": "Android L Preview - AOSP Sources Released!", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x/general/-t2802035"], "threads": []}, {"title": "Trident Aegis Case Review w/pics", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x/accessories/-t2749633"], "threads": [{"text": "Thanks for the pics that's not as bulky as I thought. Trident makes good cases, I have the Kraken for outdoor activities.", "time": "13th May 2014, 04:49 PM", "postID": "post52627255", "replies": []}, {"text": "It is a shame that it does not have the M dimple.", "time": "13th May 2014, 09:46 PM", "postID": "post52634250", "replies": []}, {"text": "I thought the same, but I actually don't miss it too much. It does have a rubber strip where the trident logo is which actually does much in the way of keeping the phone grounded on a table. I can now swipe text without it swinging about. \n\nAlthough that may be due to the extra weight!", "time": "14th May 2014, 12:10 AM", "postID": "post52636837", "replies": []}, {"text": "How does the edge of the case feel against your ear? I had the Otterbox on my D4 for about 3 phone calls before taking it off due to the hard edge of the case.", "time": "14th May 2014, 05:11 PM", "postID": "post52653218", "replies": []}, {"text": "Hmm can't say it feels especially different, it's not hard plastic resting right against your ear as the layer of rubber is just beneath it", "time": "15th May 2014, 02:24 AM", "postID": "post52663940", "replies": []}, {"text": "Nice review, not too bulky", "time": "15th May 2014, 09:47 AM", "postID": "post52669716", "replies": []}, {"text": "I've had this case for a couple of months and like it a lot. My only issue is it is a bit of a pain to put on/take off, so I use my Incipio Dual Pro more regularly. Not quite as much protection, but close.\n\nNote that I only use a case when I am out and know that it might get knocked about. If you keep a case on it regularly this would obviously not be an issue.", "time": "16th May 2014, 04:17 PM", "postID": "post52702576", "replies": []}, {"text": "I love the recent kraken ams case, very tough, not like the old plastic version", "time": "18th May 2014, 01:03 PM", "postID": "post52744234", "replies": []}, {"text": "Not Bad ....", "time": "19th May 2014, 07:06 AM", "postID": "post52762631", "replies": []}]}, {"title": "Supcase review", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x/accessories/-t2594997", "https://forum.xda-developers.com/moto-x/accessories/-t2594997/page2"], "threads": [{"text": "got mine about a week and and i love mine but i prefer my Air jacket more. (Just because it doesn't hide my motomaker back). one thing i had against it is that it fit crazy tight and i almost felt like i was breaking my phone when trying to remove it. it also made my buttons a bit more sensitive than i would have liked, but not to much that it would randomly turn on.", "time": "4th January 2014, 07:24 AM", "postID": "post49105275", "replies": []}, {"text": "Yeah.. I agree its super tight coming off. Have to go slow taking it off that's for sure.", "time": "4th January 2014, 06:59 PM", "postID": "post49120658", "replies": []}, {"text": "Thanks for the review: I was considering the Supcase. While you did point out the minimal face-protection: I found that the size of the protection around the front-sides is exactly what I was looking for as I am currently working near minerals quite often so having a bit of breathing space is ideal.", "time": "1st March 2014, 08:45 PM", "postID": "post50738968", "replies": []}, {"text": "I've been using the Supcase for nearly 2 months now and I've got the say for the price you can't beat it. The clear back option is great and I like it since it keeps the dimple intact!\r\nErgonomics for the win!", "time": "6th March 2014, 03:25 AM", "postID": "post50855690", "replies": []}, {"text": "I must be the only person here or on amazon who did not like the supcase.   It had a great fit but I just didn't like the hard plastic shell and sharp edges.  I only used a few times then put on ebay.  For a thin casr I much prefer my tpu case that was $12 cheaper.", "time": "6th March 2014, 05:30 AM", "postID": "post50857531", "replies": []}, {"text": "My SUPCASE Clear/Black came in and I'm loving it. The only problem I have right now(which is ironic) is that it's actually too-loose around the power/volume keys which makes it hard pressing down on the keys.", "time": "6th March 2014, 03:50 PM", "postID": "post50868893", "replies": []}, {"text": "Great review. The case looks breautiful. I just ordered one on amazon for $16.\n\nHas anyone used this case with Shure SE215 headphones? I am concerned that the earphone jack won't fit through the case as the opening isn't particularly wide. Would hate to have to return the case if my earphones don't fit.", "time": "3rd May 2014, 01:05 AM", "postID": "post52374831", "replies": []}]}, {"title": "iSmooth Moto X HD screen protectors review", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x/accessories/-t2685103"], "threads": [{"text": "thanks for the review, care to post a close up photo of the protector on the phone?\ntexture is important...", "time": "18th March 2014, 12:59 PM", "postID": "post51178505", "replies": [{"text": "Here you go. Hope it helps", "time": "19th March 2014, 03:06 AM", "postID": "post51196538", "replies": []}]}, {"text": "Does it change the colors of the device? I had a protector for my Samsung galaxy so advance, it really washed out the colours for some reason.", "time": "31st March 2014, 10:23 AM", "postID": "post51521473", "replies": [{"text": "No. Not at all. These are some of the clearest I've seen. Colors transmit perfectly", "time": "31st March 2014, 10:25 AM", "postID": "post51521503", "replies": [{"text": "OK.... Just gotta see whether it is available in India? Thanks mate\n\n\n\n---------- Post added at 02:58 PM ---------- Previous post was at 02:57 PM ----------\n\nWhat about the case? Do you have one?", "time": "31st March 2014, 10:28 AM", "postID": "post51521526", "replies": []}]}]}]}, {"title": "[Q]  Have gallery increase compression for previews", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x/moto-x-qa/-t2647124"], "threads": []}, {"title": "Review - Dock and Power Battery", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x/accessories/-t2546281", "https://forum.xda-developers.com/moto-x/accessories/-t2546281/page2"], "threads": [{"text": "Ive been trying to pick up a dock, they have been out of stock all week. Sucks\n\r\nNice review", "time": "28th November 2013, 01:51 AM", "postID": "post47919945", "replies": [{"text": "I'm looking to sell my dock.", "time": "4th December 2013, 08:54 AM", "postID": "post48123734", "replies": [{"text": "The Moto X one? Why/How much?", "time": "7th December 2013, 07:52 PM", "postID": "post48241904", "replies": []}]}, {"text": "I'm looking to sell my dock.", "time": "4th December 2013, 08:54 AM", "postID": "post48123734", "replies": []}]}, {"text": "Envy. In my country Motorola doesn't sell accessories and it's impossible to find them.", "time": "28th November 2013, 02:12 AM", "postID": "post47920376", "replies": []}, {"text": "I'm liking the dock, but i don't find a need for a power battery\n\nOff-Topic: Hey what case is that?", "time": "28th November 2013, 05:25 AM", "postID": "post47924216", "replies": []}, {"text": "It's a cheap bumper case I got off Amazon,  let me know if you want the link. \n\nAgree with you on the battery but i had a $50 coupon i had to use on their store so that plus the discount made me buy those.", "time": "28th November 2013, 07:40 AM", "postID": "post47926653", "replies": [{"text": "Yeah if you don't mind that'd be awesome \n\nAnd I gotcha. I probably would've done the same", "time": "28th November 2013, 10:02 PM", "postID": "post47947881", "replies": []}]}, {"text": "I have a Pebble watch added as a trusted device. Unfortunately, the phone relocks when docked. Major buzzkill of an amazing feature.", "time": "1st December 2013, 09:13 PM", "postID": "post48040211", "replies": []}, {"text": "Are you saying the only reason you got the battery pack was because of the coupon you had? Just curious because I was thinking about getting one of those Anker ones. They seem to do more for the price. \n\r\nBut don't blame you if you basically got that battery pack for free.", "time": "7th December 2013, 09:54 PM", "postID": "post48245165", "replies": []}, {"text": "On the dock, how much friction is required for insertion / removal of the phone on the USB connector?", "time": "7th December 2013, 10:10 PM", "postID": "post48245568", "replies": []}, {"text": "Ive been trying to pick up a dock, they have been out of stock all week. Sucks\n\r\nNice review", "time": "28th November 2013, 01:51 AM", "postID": "post47919945", "replies": []}, {"text": "It's a cheap bumper case I got off Amazon,  let me know if you want the link. \n\nAgree with you on the battery but i had a $50 coupon i had to use on their store so that plus the discount made me buy those.", "time": "28th November 2013, 07:40 AM", "postID": "post47926653", "replies": []}]}, {"title": "Moto X Review (coming from Galaxy S2) IMAGE HEAVY", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x/general/-t2550110", "https://forum.xda-developers.com/moto-x/general/-t2550110/page2", "https://forum.xda-developers.com/moto-x/general/-t2550110/page3"], "threads": [{"text": "thank you for your review. could you comment on the bass audio output of this phone? (through headphones)", "time": "30th November 2013, 11:48 PM", "postID": "post48010414", "replies": [{"text": "Absolutely. \n\r\nIn comparison to the Galaxy S2, low bass is slightly \"warmer\" and noticeably less muddy. Whether it's because of a better DAC or more amplification I can't say for certain. I could probably make a recording of the outputs with my PC if you're interested - you won't hear exactly what it sounds like because it will have been processed but you might be able to hear relative differences.", "time": "1st December 2013, 12:18 AM", "postID": "post48011002", "replies": []}]}, {"text": "Interesting that you say you can easily get 5 days idle on your S2, and the battery stats seem under 0.5% per hour. I've never owned an Android phone that could do that... actually, my iPhone couldn't either but that was a few generations ago. iPhone 3G, 3GS, Droid X, Galaxy Nexus, Galaxy S3, and now my Droid X.\n\nDo you have email sync? Other apps syncing/polling? I mean, I don't have a whole lot but Facebook/Google+ sync, Gmail, Weather bug updates hourly... all of that adds up to about 1% or so per hour in ideal circumstances, so 3 days is about all I'll ever get - and that has always been consistent, I've never owned a phone I could get much under 1% per hour if I have normal polling/syncing stuff running.\n\nNot doubting, just interested.", "time": "1st December 2013, 12:11 AM", "postID": "post48010858", "replies": [{"text": "Exchange kills my battery but I have GMail / Calendar / Contacts / Google Keep / Google Voice / Hangouts / Chrome / Drive / Currents Sync on. In things like Words With Friends I disable notifications when the option is present. Beautiful Widgets Weather updates are set to 2.5 hours. I don't have a Facebook app installed, and I close Skype and sign out when I'm not using it. Market is set to not auto-update apps, location reporting is disabled (so you can't track your path around town but it gets rid of most GPS wakelocks), and in apps that have an option of not using data unless on WiFi I enable that, and set WiFi to turn off while the device is sleeping (WiFi -> Advanced). \n\r\nFunctionally, there is very little lost from these settings. \n\r\nI've recently been playing with Greenify, but it seems unnecessary with the above settings.", "time": "1st December 2013, 12:29 AM", "postID": "post48011214", "replies": [{"text": "Look into getting Better Battery Stats.  You can get a free copy here on XDA.  I used it to figure a strange wake lock issue I was having only when connected to a specific wifi router. Based on your high Android OS number I would guess you might have a similar issue.  I kept seeing my phone be idle for 7 hours but somehow the CPU total would be over 4 hours and the awake time being almost 1.5 hours.  I am trying to figure out what the setting is on my router that causes the issue but so far no luck.", "time": "1st December 2013, 03:40 AM", "postID": "post48014976", "replies": [{"text": "I have it but I haven't made sense of it yet. The two largest wakelocks I've seen has been qcom_rx_wakelock with more than an hour in a 14 hour period and a count of 6,678, and nlpcollectorwakelock. I don't know what's calling on the GPS yet so my temporary fix for that is to turn off GPS when I'm not using it. There are some minor wakelocks under \"Partial\" - MMApiWebService.lastChance, MMApiWebService, AcquireWakeLockAction, NotifDataListener - but these are not nearly as bad as the qcom and nlp wakelocks. Without rooting I am unable to view Alarms, and the only reference that works is since \"Unplugged\". So, every time I have wanted to transfer data to or from my phone I've reset BBS and haven't yet had a good record. I'll definitely be looking into it over the next few days.", "time": "1st December 2013, 04:59 AM", "postID": "post48016446", "replies": [{"text": "Yeah I can't say some of the things on there made much sense to me either but I've at least been able to use it to try and figure out that the drain issues are only happening on specific wifi connections. I wish I had another KitKat device to test to see if it's a Moto X issue or a KitKat issue.", "time": "1st December 2013, 05:11 AM", "postID": "post48016660", "replies": []}]}, {"text": "I have it but I haven't made sense of it yet. The two largest wakelocks I've seen has been qcom_rx_wakelock with more than an hour in a 14 hour period and a count of 6,678, and nlpcollectorwakelock. I don't know what's calling on the GPS yet so my temporary fix for that is to turn off GPS when I'm not using it. There are some minor wakelocks under \"Partial\" - MMApiWebService.lastChance, MMApiWebService, AcquireWakeLockAction, NotifDataListener - but these are not nearly as bad as the qcom and nlp wakelocks. Without rooting I am unable to view Alarms, and the only reference that works is since \"Unplugged\". So, every time I have wanted to transfer data to or from my phone I've reset BBS and haven't yet had a good record. I'll definitely be looking into it over the next few days.", "time": "1st December 2013, 04:59 AM", "postID": "post48016446", "replies": []}]}, {"text": "Look into getting Better Battery Stats.  You can get a free copy here on XDA.  I used it to figure a strange wake lock issue I was having only when connected to a specific wifi router. Based on your high Android OS number I would guess you might have a similar issue.  I kept seeing my phone be idle for 7 hours but somehow the CPU total would be over 4 hours and the awake time being almost 1.5 hours.  I am trying to figure out what the setting is on my router that causes the issue but so far no luck.", "time": "1st December 2013, 03:40 AM", "postID": "post48014976", "replies": []}]}, {"text": "Exchange kills my battery but I have GMail / Calendar / Contacts / Google Keep / Google Voice / Hangouts / Chrome / Drive / Currents Sync on. In things like Words With Friends I disable notifications when the option is present. Beautiful Widgets Weather updates are set to 2.5 hours. I don't have a Facebook app installed, and I close Skype and sign out when I'm not using it. Market is set to not auto-update apps, location reporting is disabled (so you can't track your path around town but it gets rid of most GPS wakelocks), and in apps that have an option of not using data unless on WiFi I enable that, and set WiFi to turn off while the device is sleeping (WiFi -> Advanced). \n\r\nFunctionally, there is very little lost from these settings. \n\r\nI've recently been playing with Greenify, but it seems unnecessary with the above settings.", "time": "1st December 2013, 12:29 AM", "postID": "post48011214", "replies": []}]}, {"text": "The processor arrangement doesn't have anything to do with GPS. You kept wondering if it did... It doesn't. GPS is separate from the low power chips. The 8 \"cores\" are used as such:\n- 2 for applications \n- 1 low power audio processing (Touchless Controls) \n- 4 GPU cores\n- 1 context aware core (no clue what that means)", "time": "1st December 2013, 07:49 AM", "postID": "post48019493", "replies": [{"text": "The context aware core I believe controls the sensors used as part of the Active Display. Which would explain why the Moto X does this so much better then on other phones with 3rd party apps.", "time": "1st December 2013, 12:57 PM", "postID": "post48025541", "replies": []}, {"text": "Ah, thank you. I poked around in some other reviews and found this, which agrees:\n\n\n\r\nFor some reason I suspected that the GPS hardware well under this too.\n\n____________\n\nI set the phone back to stock and let it sleep overnight, and here are my BBS results from that:\n\n\n\n\n\n\nCalcualtes to roughly 1.33% per hour idle vs <0.5% per hour I was getting before - which isn't going to prevent me from getting through a day, but completely unnecessary. Interestingly the qcom_rx_wakelock wasn't responsible for a large percentage of the wakeups last night, though its count was extremely high.. One thing I can think of that is different is that I'm on my 5GHz WiFi network now, though I'm definitely not ready to point fingers.\n\nI'm going to go through and disable the following, one by one, and see how my device sleeps overnight with each gone:\n\nActivity Recognition (RW specific)\nAssist\nLocation Reporting\nHelp Improve Motorola Products + Moto Care\n\nAnd if I still have odd wakelocks, GPS after that.", "time": "1st December 2013, 01:21 PM", "postID": "post48026106", "replies": []}]}, {"text": "thank you for your review. could you comment on the bass audio output of this phone? (through headphones)", "time": "30th November 2013, 11:48 PM", "postID": "post48010414", "replies": []}, {"text": "Interesting that you say you can easily get 5 days idle on your S2, and the battery stats seem under 0.5% per hour. I've never owned an Android phone that could do that... actually, my iPhone couldn't either but that was a few generations ago. iPhone 3G, 3GS, Droid X, Galaxy Nexus, Galaxy S3, and now my Droid X.\n\nDo you have email sync? Other apps syncing/polling? I mean, I don't have a whole lot but Facebook/Google+ sync, Gmail, Weather bug updates hourly... all of that adds up to about 1% or so per hour in ideal circumstances, so 3 days is about all I'll ever get - and that has always been consistent, I've never owned a phone I could get much under 1% per hour if I have normal polling/syncing stuff running.\n\nNot doubting, just interested.", "time": "1st December 2013, 12:11 AM", "postID": "post48010858", "replies": []}, {"text": "The processor arrangement doesn't have anything to do with GPS. You kept wondering if it did... It doesn't. GPS is separate from the low power chips. The 8 \"cores\" are used as such:\n- 2 for applications \n- 1 low power audio processing (Touchless Controls) \n- 4 GPU cores\n- 1 context aware core (no clue what that means)", "time": "1st December 2013, 07:49 AM", "postID": "post48019493", "replies": []}]}, {"title": "[Q] about the wall paper in the Verge's review", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x/moto-x-qa/-t2520659"], "threads": []}, {"title": "Moto X Controller and Game Review", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x/general/-t2500238"], "threads": [{"text": "For me I only want to play old school games using emulators by Robert Broglia (Snes9x, GBA.emu, NES.emu, GBC.emu), which controller would you suggest to use with the MotoX for these?", "time": "27th October 2013, 10:15 AM", "postID": "post46849349", "replies": []}]}, {"title": "CaseMate Naked Tough Review", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x/accessories/-t2418488"], "threads": [{"text": "I bought the same case and it does have a film on the back, but that's just a temporary protective film for the case. Just peel it off.", "time": "24th August 2013, 05:02 PM", "postID": "post44942900", "replies": [{"text": "LOL.. \n\r\nI'll be grabbing mine today since the AT&T site shows my local stores have stuff in stock now.", "time": "24th August 2013, 05:24 PM", "postID": "post44943605", "replies": []}, {"text": "This is why the world is in complete turmoil. Thanks Keinx for bringing this to the attention of the OP. Measure twice, cut once is a good rule for everything, including forums.", "time": "24th August 2013, 06:30 PM", "postID": "post44945371", "replies": []}]}, {"text": "Yep, yep yep ohgodwhy, the body armor is on the case. He charged me for two, he put the front protector on the front, rear protector on the back, opened another and put the front protector on the case. Disregard the case notice, but fair warning against AT&T touching your phone at all.\nEDIT for clarity: I stopped by to return the case and the guy said he was sorry he \"removed the backing, so [I] put another on\" and offered to give me my money back for the second skin.", "time": "24th August 2013, 11:56 PM", "postID": "post44953226", "replies": []}, {"text": "Just got this case straight from AT&T (they've got the exclusive clear/clear version, whereas elsewhere on the web, including case-mates's site, you can get the clear/black version).  I like it alot - even better than the Hyperion TPU case I had been using.  The plastic is very smooth (means it might slide about on an equally smooth surface), and the rubber bumper provides a nice bit of extra protection - good for someone like me who puts the phone in a generic vehicle dock and doesn't want to see the side of the device getting scratched up.", "time": "8th October 2013, 06:11 PM", "postID": "post46290952", "replies": []}, {"text": "Really loving this case.  I have the Verizon developer edition and the black/clear case combo look so much better than the clear version in my opinion.\n\r\nThe black bumper keeps the front looking neat and the back can still be shown off and looks nice with the black bumper.", "time": "13th October 2013, 08:36 PM", "postID": "post46440464", "replies": []}, {"text": "I got the clear/clear from AT&T and placed an order on the clear/black. I think it will flow with the phone much better. \nSeems very slippery. \n\nAlso noticed that the USB cutout, the back edge, isn't rounded so when you're holding it there with your finger it can get a little uncomfortable.", "time": "19th October 2013, 02:05 PM", "postID": "post46617830", "replies": []}]}, {"title": "Anyone interested in reviewing cases for Moto X", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x/moto-x-qa/-t2444611"], "threads": []}, {"title": "Quick Half-Ass Review..........", "rating": 0, "links": ["https://forum.xda-developers.com/moto-x/moto-x-qa/-t2422498"], "threads": [{"text": "Too.many.phones", "time": "27th August 2013, 09:22 PM", "postID": "post45046884", "replies": []}]}]