[{"title": "Overall love", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-3t/review/overall-love-t3510992", "https://forum.xda-developers.com/oneplus-3t/review/overall-love-t3510992/page2", "https://forum.xda-developers.com/oneplus-3t/review/overall-love-t3510992/page3", "https://forum.xda-developers.com/oneplus-3t/review/overall-love-t3510992/page9"], "threads": [{"text": "Surprisingly I don't see a category for DAC or headphone output. I'm going to comment on that here. The audio output is amazing, using my old galaxy in my car through the auxiliary cable there was a lot of noise. So much so that one could hear it right through the music. Now this kind of use is probably the most telling one out there since the cable connection is likely high resistance. Not only is it cleaner but it is noticeably louder. If you take the audio output seriously, this is a great phone for you.", "time": "4th December 2016, 02:21 PM", "postID": "post69924597", "replies": [{"text": "I find the headphones output volume to be lower than my Galaxy S4 was. Really wish it could go louder.", "time": "5th December 2016, 09:27 AM", "postID": "post69936141", "replies": []}]}, {"text": "By far one of the best Android devices out there. Spot on.\n\nRunning stock rom with kernal \"see below\" using root, V4A. Battery life is absolutely spot on, 5 hours screen on time with 48% battery left.", "time": "4th December 2016, 08:03 PM", "postID": "post69929145", "replies": []}, {"text": "How is the screen response on your phones?\nAre you guys noticing screen latency lag or is it fast like iPhone, Pixel or s7?", "time": "5th December 2016, 01:22 AM", "postID": "post69932097", "replies": []}, {"text": "There is no phone I would rather have", "time": "2nd January 2017, 02:10 AM", "postID": "post70353204", "replies": []}, {"text": "Great Phone \r\nNot much more to say", "time": "2nd January 2017, 07:09 PM", "postID": "post70363587", "replies": []}, {"text": "Nexus Reborn", "time": "14th January 2017, 01:06 PM", "postID": "post70548278", "replies": []}, {"text": "Love this phone! Battery life is great even if it wasnt Dash Charge is extremely useful. Best phone I've owned", "time": "14th January 2017, 07:46 PM", "postID": "post70553842", "replies": []}, {"text": "Great phone, great performance, great build let down by its low res display and camera.", "time": "14th January 2017, 09:08 PM", "postID": "post70554713", "replies": []}, {"text": "Phone has a lot of good stuff built in, but i also wish for a more open and flexible design when it comes to OOS, i dont understand why they dont give us an option to Change the Notification Slider to \"Sound On - Vibration Mode - Sound and Vibration Off\" would make much more sense in my eyes, also dont understand why we dont have more accent colors to go with, its very limiting.\r\nAlso a Noise Suppression disable Option would be pretty awesome as a lot of ppl are complaining about Bad Sound in VoIP Calls and Recording.\n\r\nBut in the end i would give it a 98/100 as everything else is Awesome!", "time": "16th January 2017, 10:13 AM", "postID": "post70575358", "replies": []}, {"text": "Great phone! Got it with MM and a day later the N update came in. I thought it was fast but after a factory reset it is even faster. And by that I don't mean Benchmarks but real world. You almost won't see apps installing after they are downloaded from Play Store. It's virtually instant. Used CM 13 on an LG G2 before which also was great. The features I miss most on OOS is scheduled DnD and System profiles from CM. Therefor I'm waiting for the Nougat kernel to be released and LineageOS for the OP3T becoming more stable.", "time": "16th January 2017, 10:59 AM", "postID": "post70575828", "replies": []}, {"text": "Good experience overall", "time": "18th January 2017, 08:59 AM", "postID": "post70606909", "replies": []}, {"text": "I mostly love this phone. Battery, speed, and display are all great. My only two complaints:The vibrator is terrible. It manages to be both really loud and really weak at the same time. I ended up buying a smartwatch just so I wouldn't miss notifications all the time.\nThe slight curve in the screen glass makes it almost impossible to have a good screen protector. To my knowledge, there's still none that offer both full coverage and impact protection without obscuring part of the screen or letting dust underneath them.", "time": "18th January 2017, 07:35 PM", "postID": "post70616213", "replies": [{"text": "I couldn't agree more about this phone. I've had HTC M9,  and  the Note5. I personally feel that this phone blows them out of the water. My favorite thing about this phone is the battery and DASH charging.  I feel that OnePlus DASH charge is the true meaning of fast charge. Samsung and others should take notes..\n\n---------- Post added at 07:27 PM ---------- Previous post was at 07:22 PM ----------\n\n\n\nhttp://www.poeticcases.com/revolution-67\n\r\nI'm sure you've seem this case before, but I am currently using it and love it! Good protection for the price including a built in screen protector this still allows you to still utilize all screen real estate.", "time": "21st January 2017, 12:27 AM", "postID": "post70650517", "replies": [{"text": "Yeah, I've seen it, but it isn't sealed so it will let dust under the screen, and I imagine it's not as good impact protection as a TGSP would be.", "time": "21st January 2017, 12:41 AM", "postID": "post70650659", "replies": []}]}]}, {"text": "If camera gets improved will change to 5 😊", "time": "19th January 2017, 05:14 AM", "postID": "post70621584", "replies": []}, {"text": "I really recommend this device. Works awesome!", "time": "15th February 2017, 02:27 PM", "postID": "post71042051", "replies": []}, {"text": "Thanks good info", "time": "18th February 2017, 09:48 PM", "postID": "post71089714", "replies": []}, {"text": "Very good phone...\nJust one question ... During calling how can I adjust the volume from the call..?\nHaving the  phone on the earpiece and try to increase the volume with the keys but nothing changed...", "time": "20th February 2017, 04:26 PM", "postID": "post71114039", "replies": []}, {"text": "Best phone I've ever owned", "time": "20th February 2017, 10:57 PM", "postID": "post71119080", "replies": []}, {"text": "love this beast!!!", "time": "21st February 2017, 11:08 AM", "postID": "post71125136", "replies": []}, {"text": "Best phone i ever had.", "time": "21st February 2017, 12:18 PM", "postID": "post71125927", "replies": []}, {"text": "Fantastic piece of Technology", "time": "22nd February 2017, 10:20 PM", "postID": "post71148361", "replies": []}, {"text": "Love this phone! Just got it today and holy smokes, great phone especially coming from the Nexus 4. Loved that phone since it came out but it finally died. I hope to use this for many years to come!", "time": "23rd February 2017, 02:30 AM", "postID": "post71150318", "replies": []}, {"text": "By far the best phone I've ever had. Here's why:\r\n- Love the design!\r\n- Love the weight (lean and mean, yet solid and doesn't feel cheap)\r\n- Awesome temperature management (doesn't get hot, ever!)\r\n- Love the screen, bright and sharp AF\r\n- Love the sound (don't get me started!)\r\n- Love the hardware buttons: volume, power and slider, just solid man! \n\r\nI've had Samsung devices my whole life, but I can assure you that era has come to an end! OnePlus, to me, feels much better in every possible way!\n\r\nThe only downside is the lack of xposed, but that's because I'm to cheezy to downgrade to MM.\n\r\nCheers!", "time": "23rd February 2017, 12:22 PM", "postID": "post71155312", "replies": []}, {"text": "I really love this great piece of hardware.\nFor me it is the best smartphone out there at the moment\n\nWas it worth to switch from my OPO to the OP3T? not really. \nBecause the OPO still is a great phone for the typical usage. \n\nBut I knew this before and bought it just to buy me a new gadget.\n\n\nCant wait for the next OP device - hopefully waterproofed.", "time": "23rd February 2017, 02:07 PM", "postID": "post71156573", "replies": []}, {"text": "I used to love and adore android, however since owning an iPhone 6s plus via work - I cannot enjoy this device!\r\nThe apps - No where near as fine tuned as my ios counterpart\r\nSpeed - The system overall, works fast and looks consistent\r\napp store - this day and age , there are so many god awful apps on both stores, however ios seems to do a better job of hiding the worse apps and showing you the AAA apps.\n\r\nI really want to fall back in love with android - I'm just finding it impossible", "time": "25th February 2017, 09:20 PM", "postID": "post71189789", "replies": []}, {"text": "After nearly a year, I have to say that I'm in the middle. I do not love or hate the device. It does it's job, albeit with some hick-ups.", "time": "23rd October 2017, 11:08 AM", "postID": "post74263137", "replies": []}, {"text": "I'm in love with this phone, confirmed.\nAnd it updates like crazy, even now.\n\nI was so impressed with everything that after sitting on the fence and considering the Mate 10, I ordered a 5T. Red.\n\nOnePlus rocks.", "time": "16th January 2018, 05:11 PM", "postID": "post75222181", "replies": []}]}, {"title": "Community development strength", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-3t/review/community-development-strength-t3510993", "https://forum.xda-developers.com/oneplus-3t/review/community-development-strength-t3510993/page2"], "threads": [{"text": "Its top!\nYou have an really truly unbrickable phone (msm download tool is available), sources released by OnePlus, MultiRom, and some amount of custom kernels/roms.\nAlso you can probably change your bootloader splash screen.", "time": "13th December 2016, 05:10 PM", "postID": "post70071868", "replies": []}, {"text": "The dev szene is just starting, but more and more roms are coming. Dev support seems to get really great, unified roms with oneplus 3.", "time": "14th December 2016, 10:23 AM", "postID": "post70082880", "replies": []}, {"text": "Seeing as it's now easy to develop for both the 3 and 3T at the same time... I'd say it's going to expand pretty rapidly", "time": "14th December 2016, 04:09 PM", "postID": "post70087675", "replies": []}, {"text": "So coustom ROMs for both OnePlus 3 and 3t gets unified?? That's great news", "time": "20th December 2016, 05:41 PM", "postID": "post70180475", "replies": [{"text": "Why wouldn't they be unified? There's very little difference between the two. This is the exact reason unified rom development is even a thing.", "time": "23rd January 2017, 04:10 PM", "postID": "post70690744", "replies": [{"text": "this has been mentioned before multiple times by the mods. There are still differences. I see two seperate forums as a benefit for both devices.", "time": "23rd January 2017, 09:55 PM", "postID": "post70695960", "replies": []}]}]}, {"text": "I'm currently waiting for my OP3T , coming from a long line of android devices, then i briefly recently hopped over to iphone 6s+, and contemplated ending my life by beating the phone over and over on my skull over 6 months before i reactivated my nexus 6p . I'm excited about 6gb of RAM and SD821!", "time": "17th February 2017, 01:36 AM", "postID": "post71063584", "replies": []}, {"text": "its nice to see this android device.", "time": "1st March 2017, 06:15 AM", "postID": "post71235258", "replies": []}, {"text": "I think now that AOSPA is out for the 3 and 3t, it cannot be beat.", "time": "14th June 2017, 06:16 PM", "postID": "post72672371", "replies": []}, {"text": "No words for this part though, the community is great and is working on keeping the phone well in the update loop.", "time": "23rd October 2017, 11:08 AM", "postID": "post74263144", "replies": []}]}, {"title": "Overall speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/oneplus-3t/review/overall-speed-t3510994", "https://forum.xda-developers.com/oneplus-3t/review/overall-speed-t3510994/page2", "https://forum.xda-developers.com/oneplus-3t/review/overall-speed-t3510994/page3", "https://forum.xda-developers.com/oneplus-3t/review/overall-speed-t3510994/page5"], "threads": [{"text": "This phone is super fast. My first OnePlus. They fingerprint is so much faster than my s7. I just touch it and it unlocks. My brother in law who has a nexus 6p is very jealous", "time": "3rd December 2016, 05:24 AM", "postID": "post69905203", "replies": [{"text": "I was wondering, since I didn't find anything about it on Google, if the phone automatically wakes when you press the fingerprint scanner. Do you have to turn the phone on with the power button before you can unlock it with the fingerprint, or does it automaticcaly turn on and unlock when you tap the sensor?", "time": "10th December 2016, 08:58 PM", "postID": "post70026804", "replies": [{"text": "As soon as you touch it it unlocks. Within milliseconds.", "time": "10th December 2016, 09:47 PM", "postID": "post70027318", "replies": []}]}]}, {"text": "it's insanely fast.  \nim still amazed", "time": "3rd December 2016, 03:05 PM", "postID": "post69910762", "replies": []}, {"text": "How is the screen latency touch response compared to the s7 edge or iPhone 6s?", "time": "4th December 2016, 12:27 AM", "postID": "post69916985", "replies": []}, {"text": "Yes, it does !", "time": "10th December 2016, 09:28 PM", "postID": "post70027115", "replies": []}, {"text": "today i did a nandroid backup via twrp.\nsize: 9,1GB\n\nthe backup took exactly 180sec. pretty fast.", "time": "10th December 2016, 10:17 PM", "postID": "post70027620", "replies": [{"text": "Did you use compression and encryption in TWRP? My 10 G backup went down to 5.x with compression. Encryption didn't take significantly longer.", "time": "10th December 2016, 11:21 PM", "postID": "post70028237", "replies": [{"text": "did without compression.\nwill try with it next time.\nis compression faster due to size or slower cause of compressing the stuff?", "time": "10th December 2016, 11:41 PM", "postID": "post70028416", "replies": []}]}]}, {"text": "the fastest phone I have ever used! \n\r\n*the stock wake gestures + nova launcher gestures", "time": "10th December 2016, 11:40 PM", "postID": "post70028402", "replies": []}, {"text": "Very fast, Ran Antutu and get the highest score for all the andriod phone. But still cannot beat Iphone 7!!!!", "time": "21st December 2016, 12:58 AM", "postID": "post70185173", "replies": [{"text": "Mine only scores about 7000 less than the Iphone 7. For a 439$ phone, I call that impressive", "time": "23rd December 2016, 10:43 PM", "postID": "post70227947", "replies": []}]}, {"text": "I'm itching to buy this phone! However, can this handle Dawn of Titans, CSR2, Mobile Legends: Bang Bang and Vainglory with ease? I mean no lags/delay, no frame drops?", "time": "21st December 2016, 05:30 PM", "postID": "post70195593", "replies": [{"text": "This phone is the highest spec'd android phone on the planet. If this one can't handle those games, then none will. Make sense?", "time": "1st January 2017, 03:25 AM", "postID": "post70341144", "replies": []}]}, {"text": "It has the latest quad-core Kryo processor, of course it will be very fast.", "time": "23rd December 2016, 11:07 PM", "postID": "post70228145", "replies": []}, {"text": "I'm getting so close to beating the IP7 lol, imagine what this thing can do while overclocked, I'm running OOS 4 so I'll have to wait for those sources to be released before I can OC it", "time": "25th December 2016, 04:44 PM", "postID": "post70250354", "replies": []}, {"text": "Hahahaha", "time": "25th December 2016, 08:55 PM", "postID": "post70253090", "replies": []}, {"text": "Can somebody check the performance of  One Plus 3T in UXbench  app that is available on playstore for free with no ads and is developed by me? \nIf you like please post your results inside the app or post them here. I would like to see how One Plus 3T compares with other top devices (according to my app).\nFor now the fastest (my app results) are Huawei Mate 9, Huawei P9 ,Xiaomi Mi5s and S7 Edge Exynos as you can see in the compare tab inside app. \nI woul appreciate if someone try the app and let us know the device performance in terms of cpu and io performance. \nPesonally i expect a score over 170000. \nPlease note that scores shown in the comparison area inside the app are the best runs per device until now. I have seen differences in devices with the same SoC because of different software. \nAlso note that the app tests only CPU , RAM and IO performance.\nThe test is quick to complete it takes about 1-2 minutes.", "time": "3rd January 2017, 12:58 PM", "postID": "post70373667", "replies": []}, {"text": "Well, what can I say. The phone is blazing fast. Compared to it my opo feels laggy af.", "time": "22nd January 2017, 07:54 PM", "postID": "post70677865", "replies": []}, {"text": "Is very fast, best phone ever!", "time": "22nd January 2017, 08:06 PM", "postID": "post70678035", "replies": []}, {"text": "I come from an LG G4 (had to replace logic board twice!) and a Note 4, I'm absolutely pleased by the speed of this beauty! Best phone I ever had so far!\r\nPrice:qualuty ratio is amazing!", "time": "23rd January 2017, 11:19 PM", "postID": "post70696845", "replies": []}, {"text": "So so fast! Only just upgraded from the OnePlus One because the 2 had bad reviews and I loved the One anyways. Apps have crashed a couple of times in the few days I've had it but I can't fault the processing power.", "time": "1st March 2017, 02:55 AM", "postID": "post71233873", "replies": []}, {"text": "this phone is smoother then butter. never had a phone this fast before.", "time": "2nd March 2017, 06:24 PM", "postID": "post71256820", "replies": []}, {"text": "Thats my second oneplus. First was the one. Still good phone. But the 3t is awesome. The perfect one for flashaholics", "time": "6th March 2017, 10:27 PM", "postID": "post71313320", "replies": []}, {"text": "I am so happy with this phone", "time": "7th March 2017, 04:22 PM", "postID": "post71323269", "replies": []}, {"text": "Hi,\n\r\nCan someone please shed some light on the touch latency issue. Is it noticeable? Thinking of upgrading from my moto g 1st gen", "time": "7th March 2017, 05:21 PM", "postID": "post71324050", "replies": [{"text": "I dont think there is a touch latency \"issue\" . i came from an iPhone 7 Plus and S7 Edge, and the screen its the same as those. not sure how many people actually have that latency issue.\n\r\nAs for the speed of the phone, i have had every smart phone from the very first ones back in the sony ericsson P1 and hTC diamond days to the iPhone 7 and Galaxy S7 phones of today. and I can confidently say not a single one of them (including iPhone 7) can hold a candle to the smoothness, speed and pure responsiveness of my OnePlus 3T, absolutely amazed. I really didnt think this would be possible on android. I bought the OP3T as a placeholder until the S8 comes out, but now im not sure if im going to get the S8!", "time": "7th March 2017, 08:53 PM", "postID": "post71326807", "replies": []}]}, {"text": "I just got this. I was torn between the Oneplus 5 and this. its definitely fast. I don't think im missing ou that much on the Oneplus 5 getting this.", "time": "7th August 2017, 06:01 PM", "postID": "post73320133", "replies": []}, {"text": "Can be sluggish sometimes, especially when multiple apps are running in the background.", "time": "23rd October 2017, 11:09 AM", "postID": "post74263151", "replies": []}]}, {"title": "App launch speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/oneplus-3t/review/app-launch-speed-t3510995"], "threads": [{"text": "I've never had such a great experience using apps with large additional content (>500mb), the performance is very good", "time": "13th January 2017, 10:33 AM", "postID": "post70532103", "replies": []}, {"text": "Great experience, every app launch in extremely fast time", "time": "18th January 2017, 08:53 AM", "postID": "post70606843", "replies": []}, {"text": "Couldn't be any faster!", "time": "23rd January 2017, 11:19 PM", "postID": "post70696849", "replies": []}, {"text": "fastest phone i have ever seen", "time": "24th January 2017, 09:59 PM", "postID": "post70712771", "replies": []}, {"text": "with speed quality is also good of pics and selfie.", "time": "1st March 2017, 06:17 AM", "postID": "post71235270", "replies": []}]}, {"title": "Multitasking/RAM", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-3t/review/multitasking-ram-t3510996", "https://forum.xda-developers.com/oneplus-3t/review/multitasking-ram-t3510996/page2"], "threads": [{"text": "just perfect. Switching between apps is absolutely seamless.", "time": "23rd January 2017, 11:20 PM", "postID": "post70696853", "replies": []}, {"text": "This phone is smooth as hell when it comes to multitasking mate", "time": "24th January 2017, 12:51 AM", "postID": "post70697579", "replies": []}, {"text": "Best multitasking phone on the market. You forget about the ability to clear apps from memory because you never need to do that.", "time": "24th January 2017, 02:51 PM", "postID": "post70706158", "replies": []}, {"text": "Closes apps in background (like PoGo, Firefox) by itself, don't know why I bought 6 GB?!? Thread: https://forum.xda-developers.com/one...ougat-t3540286", "time": "9th April 2017, 09:31 AM", "postID": "post71787124", "replies": [{"text": "I wonder why you bought or keeping this phone...Looks like you are having a bad experience by checking other threads as well", "time": "9th April 2017, 09:35 AM", "postID": "post71787172", "replies": [{"text": "Thats somehow the wrong question . The question should be, why this device with 6 GB is closing apps by itself? I think the discord app (chat application) is affected by this issue too, so I miss some (important) notifications.\n\r\nAnd yes, I started comparing devices (by their technical data) more than half a year ago, when the battery of my HTC One m7 got really bad, and finally the best tradeoff did seem to me to be the Oneplus. So some of the not-so-good things I have been aware of, but others came unexpected. And I'm not the one, who sends things back he just bought, despite the time for sending back the device is over.", "time": "9th April 2017, 09:58 AM", "postID": "post71787389", "replies": [{"text": "You can edit build prop and change background apps no to 60 or whatever suits you.\nIt's 32 by default", "time": "14th April 2017, 11:26 AM", "postID": "post71855932", "replies": []}]}]}]}, {"text": "This phone is smooth.. in my case there are 18 apps in background without reload", "time": "10th April 2017, 11:47 AM", "postID": "post71801610", "replies": []}, {"text": "Multitasking works very smooth. I can have like 15 apps open (some which are heavy games) and can switch back to them, without reloading. I also like the option to lock apps in the recent screen, so you don't accidentally close apps you need.", "time": "10th April 2017, 06:54 PM", "postID": "post71806658", "replies": []}, {"text": "6 gigs of RAM is enough multitasking is a piece of cake", "time": "13th April 2017, 10:54 AM", "postID": "post71841651", "replies": []}, {"text": "Ram stuffs aren't subject that requires attention, it's always smooth and reactive, even if the apps aren't backgrounding they open so fast I don't care about.", "time": "15th April 2017, 05:54 PM", "postID": "post71873803", "replies": []}]}, {"title": "Scrolling smoothness", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-3t/review/scrolling-smoothness-t3510997", "https://forum.xda-developers.com/oneplus-3t/review/scrolling-smoothness-t3510997/page2"], "threads": [{"text": "Oxygen 3.5 has very laggy scroling but it is fixed in OOS4. 5/5", "time": "2nd January 2017, 04:48 PM", "postID": "post70361681", "replies": []}, {"text": "smoothness is way better on OOS4.", "time": "2nd January 2017, 09:33 PM", "postID": "post70365357", "replies": []}, {"text": "Still less smooth than Nexus 6p, but not that much terrible.\nOS 4.0.1", "time": "15th January 2017, 06:05 AM", "postID": "post70558839", "replies": [{"text": "I've had Nexus 6P for almost a year and OP3T is a lot smoother in basically every task imaginable.", "time": "8th March 2017, 11:55 PM", "postID": "post71343109", "replies": []}]}, {"text": "Perfect!", "time": "23rd January 2017, 11:20 PM", "postID": "post70696856", "replies": []}, {"text": "sometimes screen don't move as we want because of touch pad its nice to get a good quality of touch pad.", "time": "1st March 2017, 06:19 AM", "postID": "post71235291", "replies": []}, {"text": "smoothest phone i'v ever used, even the fb app is smooth", "time": "1st March 2017, 05:51 PM", "postID": "post71242687", "replies": []}, {"text": "Smooth and Fast. Awesome", "time": "8th March 2017, 01:03 PM", "postID": "post71335423", "replies": []}, {"text": "Very smooth not lag or jitter that I've noticed at all.", "time": "5th April 2017, 08:02 AM", "postID": "post71732988", "replies": []}, {"text": "It also depends on the browser. UC Browser for instance has the smoothest scrolling I've seen. UC Browser is also very fast.", "time": "6th April 2017, 05:47 AM", "postID": "post71745893", "replies": []}, {"text": "Never experienced any laggy smoothing on any device ive used that isnt a samsung. Gotta say its smooth :3", "time": "7th April 2017, 06:04 AM", "postID": "post71759934", "replies": []}, {"text": "Overall I am very satisfied with the OP 3T scrolling, best I have ever had except maybe the iphone (my other previous phones have been Note 4, iPhone 5, HTC One X, Samsung Captivate plus currently my work phone is an iphone 6).\n\r\nMy gripe is more with developers not exactly the phone or maybe its with Android.  The thing is that for instance Google Earth scrolling and moving around smoothness in the OP3T is crap compared with what you get in an iphone. In this case I am pretty sure it is Googles fault.  I thought that android phones could not have the scrolling smoothness, speed and slowing down effects as the iphone and that it was a coding limitation. However, take a look at for instance Ringdroid for Android. The level of scrolling smoothness is amazing, this proves to me that it is possible to have scrolling quality better than on an iphone yet flagship apps like Facebook or Twitter do not have it. Its kinda frustrating....", "time": "28th April 2017, 04:40 AM", "postID": "post72064196", "replies": []}, {"text": "For the best scrolling smoothness, you will have to switch to AOSPA ROM. Much better than stock OOS and any other ROM I've tried.", "time": "14th June 2017, 09:32 PM", "postID": "post72674523", "replies": [{"text": "Sultanxda's Lineage OS 14.1 with F2FS file system than AOSPA even more smooth.", "time": "15th June 2017, 04:55 AM", "postID": "post72677550", "replies": []}]}]}, {"title": "Heat", "rating": 4.0, "links": ["https://forum.xda-developers.com/oneplus-3t/review/heat-t3510998", "https://forum.xda-developers.com/oneplus-3t/review/heat-t3510998/page2", "https://forum.xda-developers.com/oneplus-3t/review/heat-t3510998/page3"], "threads": [{"text": "Got the phone today, and it feels very cold to the touch. Most of the heat It gained was from my own hands... though it is winter. I then put a silicon transparent case, and after setting everything up I did some google cardboard vr for around 30 minutes and felt a light warmth through the case... barely noticeable.", "time": "6th December 2016, 11:40 PM", "postID": "post69964258", "replies": []}, {"text": "Mine is getting pretty warm after rooting, making a nandroid backup, and flashing xposed. Not quite uncomfortable, but very noticeable.", "time": "7th December 2016, 05:21 AM", "postID": "post69967326", "replies": []}, {"text": "My phone has only heated up a couple of times, and that was when I really used it, games and such.. Otherwise it's really \"dead\" to the touch.", "time": "18th December 2016, 02:15 AM", "postID": "post70140348", "replies": []}, {"text": "If you want to heat it up, use some benchmarks, or if you want to be more productive, use mapillary outside and photomap your area around.", "time": "18th December 2016, 11:58 AM", "postID": "post70145383", "replies": []}, {"text": "Yes.. it's getting heated very often even I use for 5mins.. I got phone today only(23-12-2016). Please suggest a solution.", "time": "23rd December 2016, 05:52 PM", "postID": "post70224919", "replies": [{"text": "For me its exact the same thing...", "time": "26th December 2016, 05:07 PM", "postID": "post70263643", "replies": []}]}, {"text": "Of course its gonna heat up if your cpu and gpu are working at max speed all the time.. its normal\nFirst day when I flashed custom rom, installed all apps, rooted, twrp and all that it was hot to the touch because the reason above but now when I use it in a normal way its actually cold to the touch most of the times and I love that", "time": "26th December 2016, 06:23 PM", "postID": "post70264655", "replies": []}, {"text": "I rooted mine and installed a rom really got hot then I changed to a different rom and it is very cool now.", "time": "27th December 2016, 09:32 PM", "postID": "post70280767", "replies": []}, {"text": "OnePlus 3T is a really cool device. I suggest users to buy it. It has very cool features like Fingerprint access,  Camera etc. \nBut if anyone gets Official TWRP for Android 7.0 for OnePlus 3T,  Please tell me*", "time": "28th December 2016, 03:23 AM", "postID": "post70283872", "replies": []}, {"text": "Never felt any kind of heat through the case (Orzly 2-part case).\n\nNever been an issue.", "time": "28th December 2016, 06:31 PM", "postID": "post70293694", "replies": []}, {"text": "i have noticed it's evenly warm when it shouldn't be. try enabling \"Auto close high power usage apps\" battery options.\nthe description makes me laugh. engrish.\n\n\"When it runs,  the system auto clean up background power-hungry apps , prevent phone from getting hot.\"", "time": "31st December 2016, 01:24 PM", "postID": "post70332722", "replies": []}, {"text": "It doesn't warm up much, if at all, for me, but I am using a rom that underclocks the CPU which could be the primary reason for this.", "time": "31st December 2016, 04:17 PM", "postID": "post70335057", "replies": []}, {"text": "On 3.5.4 I would have occasional heating after a phone call. Battery stats would show that the phone was using the CPU for extended periods after the call had ended. Usually a deep clean of the ram would solve it. Sometimes it didn't solve and then a reboot would solve the problem. Phone was completely stock.\n\nIt was comparatively very cool throughout with the CPU temps being in the mid 20s or low 30s even during charging at 3.4A with the dash charger!", "time": "1st January 2017, 06:28 AM", "postID": "post70342169", "replies": []}, {"text": "Got my phone few days ago its heating when i am playing  clash of clans but otherwise no issues in normal mode.", "time": "1st January 2017, 01:29 PM", "postID": "post70345505", "replies": []}, {"text": "Nvm", "time": "4th January 2017, 02:39 PM", "postID": "post70390064", "replies": []}, {"text": "The phone stays cool to the touch even under heavy gaming. (Max 35C on cpu)", "time": "22nd January 2017, 07:46 PM", "postID": "post70677760", "replies": []}, {"text": "Heating hasn't been an issue so far. Had an app causing constant 70% CPU usage and the device was just slightly warm", "time": "23rd January 2017, 11:21 PM", "postID": "post70696863", "replies": []}, {"text": "my phone getting hot sometimes idk why", "time": "24th January 2017, 09:53 PM", "postID": "post70712693", "replies": []}, {"text": "Any manufacter could make a super cool phone by just setting an agressive thermal profile. Oneplus 3/3T doesnt throttle at all, not with gaming. The phone gets warm, but you have to consider that it's using his full potencial. I prefer a hot phone (not the case) than a cool phone with half of the power the soc offers.", "time": "13th February 2017, 04:57 AM", "postID": "post71006473", "replies": []}, {"text": "Stays cool all the time for me. Honestly amazes me most phones I've had heat up in few minutes.", "time": "5th April 2017, 07:50 AM", "postID": "post71732873", "replies": []}, {"text": "The Midnight Black 3T almost gets too hot to hold when in sunlight for too long. One thing that concerns me is the heat when charging - Dash charging is awesome but if I charge it on my bed the phone gets really hot, which I'm hoping is just because it's summer time and quite hot in general during the night. \n\r\nThe heating isn't great, it gets hot in non-gaming tasks occasionally and even just being in my pocket. But I expect these to not be issues in the winter.", "time": "28th June 2017, 08:38 PM", "postID": "post72839652", "replies": []}, {"text": "Mine gets hot on 4G connection, on Wifi it stays cool.", "time": "29th June 2017, 05:51 PM", "postID": "post72850142", "replies": []}, {"text": "I was streaming some music last night and noticed my phone got very warm.. never did that before. Also getting a little warm while charging which I thought the new charging system was designed to keep the heat in the charging brick. Could have gotten a bad rom flash or something. Going to return to complete stock later today, see if the heat remains. I've had this phone for a while now and this is the first time I've noticed it getting warm no matter what I was doing.. Seems really random which tells me it's likely something gone wrong during a flash or something.", "time": "3rd July 2017, 02:43 PM", "postID": "post72892875", "replies": []}, {"text": "It sometimes warm on games and 4G. But no issues on working, only screen's up side is warm. I have it in my \"book\" case. Also if room's temperature is high, phone gets hot. Otherwise i like my new smartphone", "time": "4th July 2017, 10:31 PM", "postID": "post72909271", "replies": []}, {"text": "When i charging, 4G on and viewing video, it is heating", "time": "8th July 2017, 09:42 PM", "postID": "post72956359", "replies": []}, {"text": "phone getting hot is normal. the phone is made of metal so the heat gets spreaded and the phone is getting the heat out through the metal.\nit is better than phone made of plastic.\n\nif you wanna charge it and use it and you feel the phone is getting hot... there is nothing we can do.. maybe remove the case for a while.", "time": "9th July 2017, 12:02 PM", "postID": "post72961916", "replies": []}, {"text": "Mine goes upto like 45° when on heavy gaming....light use and it gets upto 40 and while not in use around 36... I think its normal for me...idk what do u guys think?", "time": "28th July 2017, 11:44 AM", "postID": "post73203035", "replies": []}, {"text": "if you see the teardown you will see that the oneplus 3/3t is well built and the heat spread is very good.\n\r\nthe issue with the heat is not the phone heat but the battery heat.\n\r\ndon't get the battery heated to 40 deg...", "time": "30th July 2017, 01:40 PM", "postID": "post73226475", "replies": []}]}, {"title": "Low light", "rating": 3.5, "links": ["https://forum.xda-developers.com/oneplus-3t/review/low-light-t3510999", "https://forum.xda-developers.com/oneplus-3t/review/low-light-t3510999/page2", "https://forum.xda-developers.com/oneplus-3t/review/low-light-t3510999/page3"], "threads": [{"text": "Blurry images, all the time,  totally unacceptable. Using OS 3.2.8", "time": "7th December 2016, 10:46 PM", "postID": "post69980430", "replies": [{"text": "Definitely agree with this. Huge downgrade and easily the thing I miss the most from the 6P.", "time": "24th December 2016, 03:51 PM", "postID": "post70236763", "replies": []}]}, {"text": "Rated 4, you need to know how to take the best shot. Not exactly the point and shoot but otherwise with manual controls it's really good.", "time": "20th December 2016, 08:20 PM", "postID": "post70182605", "replies": []}, {"text": "Ok here's mine taken in low light", "time": "5th January 2017, 01:35 PM", "postID": "post70405445", "replies": [{"text": "Holy moly\nManual mode?", "time": "5th January 2017, 08:32 PM", "postID": "post70411704", "replies": [{"text": "auto, HQ mode, as you can see both shots are handheld as per my shadow on the lower right of the 1st picture.\n\nHQ modes gives cleaner output than manual except if ISO is 100 but we need tripod for that because we need also longer exposure which I believed OIS can't handle longer than 1/3s due to handshakes", "time": "7th January 2017, 08:42 AM", "postID": "post70434296", "replies": []}]}, {"text": "That must be manual mode because whenever i get the phone out to take a quivk picture theres always a bot of noise in the image its not really clear at all", "time": "6th January 2017, 12:05 AM", "postID": "post70413996", "replies": []}]}, {"text": "Another night shot test after installing the new Oxygen OS 4.0.3 with improved camera in low light.", "time": "14th February 2017, 03:14 PM", "postID": "post71028227", "replies": []}, {"text": "Hello guys,\n\nAm planning to buy 3T. Can you rate this model on overall basis ? Also, does anybody know about 4T or 5T release date ?", "time": "27th February 2017, 03:29 AM", "postID": "post71205784", "replies": [{"text": "5 may launch at the end of April or may.\nNews is sceptical though.", "time": "27th February 2017, 05:12 AM", "postID": "post71206480", "replies": []}]}, {"text": "Hi there,\n\r\nI've some problems with my camera, when i take a shot the picture isn't very clear.\r\nDo someone have an idea, what i can do?\n\r\nSorry i can't upload an Image/Link =(\n\r\nThanks! =)", "time": "27th February 2017, 07:32 AM", "postID": "post71207520", "replies": [{"text": "Try manual mode.\nIn low light use hq mode for better pictures.\nAnd look on the lens if it's dirty.", "time": "27th February 2017, 08:39 AM", "postID": "post71208079", "replies": [{"text": "Thanks, HQ is working for me.", "time": "7th April 2017, 02:45 PM", "postID": "post71764774", "replies": []}]}]}, {"text": "Here are some pics i took", "time": "27th February 2017, 03:06 PM", "postID": "post71212257", "replies": []}, {"text": "I donn't know what to expect nowadays, but it's definately bad.", "time": "9th April 2017, 09:29 AM", "postID": "post71787104", "replies": []}, {"text": "Here's some lowlight shots, I don't take many pictures coz photography is my least priority right now, I bought 3T for its performance hehe!", "time": "9th April 2017, 11:11 AM", "postID": "post71788043", "replies": []}, {"text": "Taken last week 9 o'clock p.m. \n\r\nZoooooooommmmmmm!!!!", "time": "17th April 2017, 06:00 AM", "postID": "post71893225", "replies": []}, {"text": "The camera could use an upgrade in software. Blurry and noisy images in low light. But no issues in manual mode.", "time": "19th June 2017, 06:52 AM", "postID": "post72724414", "replies": []}, {"text": "I think its unfair to call the camera bad on the basis of comparisons with Samsung S8 or the Iphone 7. Those phones are like the industry benchmarks when it comes to cameras and as you can imagine come at a premium price. Let's face it, if you wanted the best camera implementations, you would have gone that direction. But then people choose the OPO3T because of the outstanding value and I would say an above average camera. It does not take images which are going to pop-out or let you re-consider the DSLR. But then that's the point, you can still afford a DSLR after buying the OPO3T.", "time": "27th June 2017, 07:28 AM", "postID": "post72819179", "replies": []}, {"text": "Really makes a difference; Google's photo processing with HDR+ is what makes the Google Pixel's camera superior. Using HDR+ on my 3T really takes photography to the next level.\n\nhttps://www.xda-developers.com/googl...ra-hdr-ported/", "time": "18th September 2017, 04:30 AM", "postID": "post73833699", "replies": []}, {"text": "OnePlus Never really hid the fact their cameras are not the best in low light, It's still an amazing device. \n\nManual Mode is actually pretty cool to play with, and with patience and a few adjustments, it gets decent shots but not amazing looking ones like The Galaxy Phones and iPhones", "time": "22nd September 2017, 04:43 PM", "postID": "post73891897", "replies": []}, {"text": "super mode", "time": "25th September 2017, 08:59 AM", "postID": "post73923445", "replies": []}]}, {"title": "Photo quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/oneplus-3t/review/photo-quality-t3511000", "https://forum.xda-developers.com/oneplus-3t/review/photo-quality-t3511000/page2", "https://forum.xda-developers.com/oneplus-3t/review/photo-quality-t3511000/page3", "https://forum.xda-developers.com/oneplus-3t/review/photo-quality-t3511000/page21"], "threads": [{"text": "Great photos", "time": "3rd December 2016, 01:54 PM", "postID": "post69909827", "replies": []}, {"text": "Enviado desde mi ONEPLUS A3003 mediante Tapatalk", "time": "3rd December 2016, 04:49 PM", "postID": "post69912067", "replies": []}, {"text": "I would like to share this", "time": "3rd December 2016, 09:06 PM", "postID": "post69915298", "replies": []}, {"text": "Some photos from dark Finnish winter. \"ok\" photo quality.", "time": "4th December 2016, 08:06 AM", "postID": "post69920348", "replies": [{"text": "Use HQ mode for low light still shots, I find this helps a lot with noise and overexposure, HDRa for all others. Also if you are interested you can shoot raw and develop them with snapspeed. The photo on the left I took was a raw image developed by snapspeed. Pure raw lack any post processing so look awful but allow might greater image tuning due to not being compromised to jpeg.", "time": "4th December 2016, 08:36 AM", "postID": "post69920616", "replies": []}]}, {"text": "Camera is very acceptable (not that of My S7 Edge) however it is to my liking....", "time": "4th December 2016, 10:44 AM", "postID": "post69921966", "replies": []}, {"text": "Decent quality for a phone, low light need improvement", "time": "4th December 2016, 04:11 PM", "postID": "post69926053", "replies": []}, {"text": "Like this camera, Dont take to many pictures, just messing around with it!", "time": "4th December 2016, 05:43 PM", "postID": "post69927311", "replies": []}, {"text": "Not bad, all shots in auto HQ\n\n\n\n---------- Post added at 05:19 PM ---------- Previous post was at 05:07 PM ----------\n\nFew more on Auto HQ", "time": "4th December 2016, 10:19 PM", "postID": "post69930552", "replies": []}, {"text": "What is better,  hq or hdr?", "time": "5th December 2016, 04:06 PM", "postID": "post69941255", "replies": []}, {"text": "Outdoors are fine. 2 stars because as soon as you are shooting moving subjects, even tiny moves, the pictures become unusable, blurry mess", "time": "7th December 2016, 10:48 PM", "postID": "post69980447", "replies": [{"text": "Agreed. Photo quality of moving objects is horrible (probably the biggest flaw of OnePlus 3T) and indoors (regular everyday lighting you have in indoors) is quite ****ty. Most of the pictures come out quite blurry. Outdoors is fine!\nI actually have discovered that in order to get better indoors pictures you have to set Flash to always ON as it really helps to improve image quality, especially regarding the sharpness, blur and better detail overall.", "time": "8th December 2016, 02:08 PM", "postID": "post69989712", "replies": [{"text": "I know, but using flash when there's plenty light and any other phone I tried has no difficulties...", "time": "8th December 2016, 08:47 PM", "postID": "post69995997", "replies": []}, {"text": "That concerns me... With kids (and dogs) I rarely have a still target ðŸ˜¯", "time": "9th December 2016, 11:26 AM", "postID": "post70004188", "replies": [{"text": "Turn off HDR and HQ (which increases the shutter speed to pick up more light) also manual controls are there to help.", "time": "9th December 2016, 12:00 PM", "postID": "post70004598", "replies": [{"text": "While that may help, often times with kids there's no time to play with settings... Just point and shoot.", "time": "9th December 2016, 12:02 PM", "postID": "post70004620", "replies": [{"text": "Good point. I mainly need phone camera to take pictures of my kid and I can say that it's pretty much impossible to get good/decent quality indoor pictures while taking a picture of a kid (HQ, HDR modes), except if you set the flash to always ON, where even moving objects come out are pretty good. \n\r\nIf with all my previous phones (no particular order, but phones with which I had no issues taking fast quality pics of my kid -> Iphone 7, xiaomi mi5, galaxy s6, nexus 5x, xperia Z3, xperia Z3 compact) I had no issues getting a decent quality picture of a moving object, with 1+3T its either impossible or very hard to do. It's a fact. Camera is average at most.", "time": "9th December 2016, 12:40 PM", "postID": "post70005078", "replies": [{"text": "Appreciate the honesty... That being said I think I may cancel my order and grab an international S7 (SM930F) - It's $500 on Amazon ATM so very similar pricing.", "time": "9th December 2016, 12:44 PM", "postID": "post70005124", "replies": [{"text": "Well it depends how high camera is in your hierarchy of needs when choosing a phone. For me its -> \n1. Price/Performance;\n2. Screen to body ratio;\n3. Camera.  \n\nMy previous phone (iphone 7) sucked at 1st and 2nd, but was awesome at 3rd. No stress at all -> just click and you got a great picture. Not the case wth 1+3T. You have to work for good picture while indoors or outside in low light situations, and especially with moving objects. \nActually before 1+3T galaxy S7 (looks awesome, premium HW, great screen to body ratio, capacitive buttons, top of the line camera) was one of my choices after I decided to replace my iphone 7 (4,7\" screen is just too small..claustrophobic feeling.otherwise it was a great device and IOS has grown a lot, especially how well apps are improved with swipe left/right function (kind of copying back button), but I just could not go for since I never liked lagwiz (touchwiz). No matter the hardware, lagwiz (touchwiz) lags and you can't do anything about it. \n\nOn the other hand 1+3T in all other areas is one of the best phones ever owned. Few reasons which IMO make it one of the best phones ever: \n1.\tBattery life is the best I've ever had and even with stock ROM and kernel and no sacrifices like auto-sync off and so on..its simply great out of the box;\n2.\tGreat screen to body ratio;\n3.\tCapacitive buttons which are fully customizable;  \n4.\tVery light and comfortable for 5.5\" inch phone;\n5.\tGood looking design and impressive build quality;\n6.\tPremium feel *\n\n*something that is missing in other Chinese brands like Xiaomi for example � mi5 looks great but once you take it in your hand you understand why the price is as it is -  cheap plastic with no wooow to it.", "time": "9th December 2016, 01:34 PM", "postID": "post70005805", "replies": []}]}]}]}]}]}]}]}, {"text": "This was taken with no light besides a TV and within Google Allo with no filters or enhancements.\nPoint being is the low light is pretty darn good.", "time": "10th December 2016, 05:43 AM", "postID": "post70016518", "replies": []}, {"text": "Enviado desde mi ONEPLUS A3003 mediante Tapatalk", "time": "11th December 2016, 05:54 AM", "postID": "post70031277", "replies": []}, {"text": "the photo quality is really good as compared to one plus 3", "time": "13th December 2016, 07:00 PM", "postID": "post70073582", "replies": []}, {"text": "i think am gonna but one plus 3T too", "time": "15th December 2016, 07:35 PM", "postID": "post70106959", "replies": []}, {"text": "There is a modified Google camera that HDR+ works with OP3T. I've just installed and take 2 or 3 photos in low light. It is amazing! The pictures where much bright than stock oos camera. Just try it. If I can I will upload some samples later. \n\nhttps://www.google.com/amp/s/www.xda...dr-ported/amp/", "time": "12th August 2017, 12:11 PM", "postID": "post73374295", "replies": [{"text": "Good news !\nDid you try to get a photo of motion?\n\nΣτάλθηκε από το ONEPLUS A3003 μου χρησιμοποιώντας Tapatalk", "time": "12th August 2017, 12:14 PM", "postID": "post73374326", "replies": [{"text": "It is something I wanted to do. But I didn't found a good scenario for comparison yet.", "time": "12th August 2017, 12:25 PM", "postID": "post73374417", "replies": []}]}]}, {"text": "Here are a few samples for comparison in low light", "time": "12th August 2017, 12:31 PM", "postID": "post73374474", "replies": []}, {"text": "Here is in low light. Can you guess which one is the modified Google camera and which is the stock oos (with HQ on)?", "time": "13th August 2017, 09:41 PM", "postID": "post73391480", "replies": []}]}, {"title": "Video quality", "rating": 3.5, "links": ["https://forum.xda-developers.com/oneplus-3t/review/video-quality-t3511001", "https://forum.xda-developers.com/oneplus-3t/review/video-quality-t3511001/page2"], "threads": [{"text": "You'll have a hard time finding a phone which can create 1080 60 fps video as smooth and stable as this. The 4k, however, suffers from some sort of low light artifacts when panning. That isn't a problem for me because I much prefer the smoothness of 60 fps over the quality of 4k. As for the slomo, it's Aight. Nothing to write home about.", "time": "4th December 2016, 03:45 AM", "postID": "post69918382", "replies": []}, {"text": "Video quality is OK ..But sound recording on video is horrendous....", "time": "1st January 2017, 06:15 AM", "postID": "post70342075", "replies": []}, {"text": "is there anyway we can record videos on 24fps? coz I cant in open camera and we dont have framerate settings in our stock camera app.", "time": "6th January 2017, 01:02 PM", "postID": "post70421207", "replies": []}, {"text": "According to this article, the video encoding profile and bitrate was improved in OOS 3.2.2...\r\nI just got my OnePlus 3T, with stock OOS 3.5.3 and when I view back the videos I record with it, their property show that they were recorded with Baseline profile and with 42Mbit... \r\nAnybody have more info about this?", "time": "13th January 2017, 10:23 PM", "postID": "post70540969", "replies": [{"text": "Well, I figured it out myself... They changed the encoding profile for the 4K videos only...", "time": "14th January 2017, 09:51 PM", "postID": "post70555157", "replies": []}]}, {"text": "I really like this phone and looking for review so that I will purchase it...Thanks for all of you reviews..", "time": "21st July 2017, 07:24 AM", "postID": "post73111181", "replies": []}, {"text": "so i recorded and edited this video at 1080p 120fps on PA cam what do u think guys", "time": "28th July 2017, 08:03 PM", "postID": "post73208246", "replies": [{"text": "PA cam?", "time": "5th August 2017, 11:54 PM", "postID": "post73301179", "replies": []}]}, {"text": "Paranoid android", "time": "6th August 2017, 08:57 AM", "postID": "post73303924", "replies": []}]}, {"title": "Selfie quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-3t/review/selfie-quality-t3511002", "https://forum.xda-developers.com/oneplus-3t/review/selfie-quality-t3511002/page2"], "threads": [{"text": "If light is very good, acceptable selfies. Indoors, even with good light, usually very blurry shots", "time": "7th December 2016, 10:49 PM", "postID": "post69980463", "replies": []}, {"text": "Indoors, nothing but TV for light and taken straight from Allo", "time": "10th December 2016, 07:45 AM", "postID": "post70017489", "replies": []}, {"text": "At low light in front of my monitor:", "time": "10th December 2016, 10:11 PM", "postID": "post70027571", "replies": []}, {"text": "beautify mode of the cam/app is the best, makes my ugly face so sweet ! \n\n \n\nfor real, its pretty decent (the front cam).", "time": "10th December 2016, 10:15 PM", "postID": "post70027609", "replies": []}, {"text": "With 16mp front camera the photos look crisp and sharp. Nothing bad to say about it.", "time": "22nd January 2017, 07:59 PM", "postID": "post70677931", "replies": []}, {"text": "Seems fine with or without beauty mode it's almost same for me", "time": "25th January 2017, 03:42 PM", "postID": "post70723972", "replies": []}, {"text": "absolutely amazing with the 16m front camera", "time": "29th January 2017, 06:00 AM", "postID": "post70779703", "replies": []}, {"text": "Studio Lighting, Edited. \n\n\r\nWalmart Lighting, Edited.\n\n\r\nStudio Lighting, NO EDIT.\n\n\r\nCar Lighting, NO EDIT.", "time": "10th March 2017, 08:41 AM", "postID": "post71362970", "replies": []}, {"text": "I recently went on a trip with a selfie stick...front facing camera turned out to be pretty bad...they all turned out kind of like this one:\nhttps://goo.gl/photos/cpev9cRgS4TEnhQs8\n\nSome look better than others, but everything looks soft and out of focus...is this normal?", "time": "25th April 2017, 10:26 PM", "postID": "post72031238", "replies": [{"text": "The front facing camera has fixed focus, made so that the subject is in focus when the phone is at arms length. this photo looks like it was taken with a selfie stick so you were not in focus.", "time": "26th April 2017, 12:10 AM", "postID": "post72032202", "replies": []}]}, {"text": "The front camera is really good. Clean and bright selfies. Love it.", "time": "19th June 2017, 06:54 AM", "postID": "post72724423", "replies": []}, {"text": "Amazing, outstanding camera quality...", "time": "28th June 2017, 05:49 PM", "postID": "post72837708", "replies": []}, {"text": "Such a awesome phone. It have best camera that is very useful for taking high resolution selfies.", "time": "5th July 2017, 02:07 PM", "postID": "post72915791", "replies": []}, {"text": "low light sux\r\nWell lit ok", "time": "18th October 2017, 08:07 PM", "postID": "post74209101", "replies": []}, {"text": "How to develop camera driver? What are the things one should know for device driver development?", "time": "22nd October 2017, 10:57 AM", "postID": "post74251293", "replies": []}]}, {"title": "Time to take picture (camera launch speed)", "rating": 4.0, "links": ["https://forum.xda-developers.com/oneplus-3t/review/time-to-picture-camera-launch-speed-t3511003"], "threads": []}, {"title": "Software (ease of use, features, etc)", "rating": 3.5, "links": ["https://forum.xda-developers.com/oneplus-3t/review/software-ease-features-t3511004"], "threads": [{"text": "How OnePlus company really care about their devices software? \nthey put awesome hardware together but can you really feel it significantly? \nIf there is 6GB RAM is system able to use it? \n\nand how they address software issue and bugs? speed of update, security patches & etc?\nThanks I need this info cause i m considering to buy it", "time": "7th February 2017, 03:08 PM", "postID": "post70920596", "replies": [{"text": "Yes u can utilise every bit of the ram.\nSoftware updates are quite fast.\nIf u opt for beta updates they are once a month or twice a month.\nBugs get sorted out if reported through proper channel", "time": "7th February 2017, 04:55 PM", "postID": "post70922321", "replies": []}]}, {"text": "Please somebody port nubia camera for one plus 3t", "time": "13th March 2017, 02:03 PM", "postID": "post71409513", "replies": []}, {"text": "As someone who has completely skipped android M, i dont think there are any major changes the ui, at least on stock oxygen os. The only noticable thing was Doze and app management.\r\nUI is as nice as ever, material design and all, and frankly saying, nougat wasnt as huge an update as i had expected", "time": "13th March 2017, 05:51 PM", "postID": "post71412686", "replies": []}]}, {"title": "Charging speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/oneplus-3t/review/charging-speed-t3511005", "https://forum.xda-developers.com/oneplus-3t/review/charging-speed-t3511005/page2", "https://forum.xda-developers.com/oneplus-3t/review/charging-speed-t3511005/page3", "https://forum.xda-developers.com/oneplus-3t/review/charging-speed-t3511005/page5"], "threads": [{"text": "Love DASH!  I quit charging at night because while using WAZE on way into work, I'm at 100% in no time anyway....", "time": "2nd December 2016, 03:55 AM", "postID": "post69889420", "replies": [{"text": "Same here. This is the 1st phone that I do not charge over night.", "time": "2nd December 2016, 08:19 PM", "postID": "post69900768", "replies": []}]}, {"text": "DASH charger is indeed brilliant", "time": "17th December 2016, 09:28 PM", "postID": "post70138065", "replies": []}, {"text": "Love the dash charging too.  Such a big improvement for me.  Plug it in,  do some things,  return and have a phone with at least 70 percent.  Hell yeah. Good if you need to leave but dont have much time for charging.  Even 10 minutes give you an enormous boost. Never want to miss that  ^^\n\n\nbtw where can i rate this thread from the xda  app??", "time": "1st January 2017, 01:35 PM", "postID": "post70345551", "replies": []}, {"text": "i know its a silly Q but if i use a regular USB C cable , will the charge speeds be v slow or just a small % down", "time": "2nd January 2017, 09:10 PM", "postID": "post70365095", "replies": [{"text": "Because of the fact that the adapter is the one that gives you much or less ampere i would say it does not depend on the cable. I.e. when i plug in the usb c cable from 1+ into my tablet adapter that has 2.5 Ampere Output im not on dash charging.  It charges normal.  The 1+ Adapter does have an output of 4 Ampere,  so it gives you the Dash Charging. \nSo i would say the cable from 1+ IS a normal Usb c cable.  (anyone proves me wrong??) \nGreetings", "time": "17th January 2017, 10:37 AM", "postID": "post70591098", "replies": []}]}, {"text": "This dash charge is a real thing! 2-3 minutes gives you about 8-10%", "time": "15th January 2017, 06:08 AM", "postID": "post70558866", "replies": []}, {"text": "DASH is the best charging experience of all times\nThe cable and brick are dope too indeed\n\nEDIT\nExactly 1 hour 20 minutes from 0 to 100%, proved with a stopwatch", "time": "16th January 2017, 11:54 PM", "postID": "post70585439", "replies": []}, {"text": "Dash charge is great. Charge up my phone super fast. Love it.", "time": "18th January 2017, 12:22 AM", "postID": "post70602396", "replies": []}, {"text": "DASH is definitely great in comparison to QC 2.0 and 3.0. I'm just concerned about battery durability since the battery is not easily removable.", "time": "18th January 2017, 04:35 PM", "postID": "post70613322", "replies": []}, {"text": "On the ampere app the max input current I noticed was at 3510mA, which is pretty insane. \nAll in all, awesome technology.", "time": "18th January 2017, 04:44 PM", "postID": "post70613473", "replies": []}, {"text": "Now i consider buying this one hahaha", "time": "21st January 2017, 04:28 AM", "postID": "post70652376", "replies": []}, {"text": "Dash charging is genius. Letting my phone charge after work right now. Picked it up and it was stone cold. Love that. Left it on for onky 20 minutes and i got my 40% juice back easily. Its just great. I love this phone wholeheartedly.", "time": "21st January 2017, 07:38 AM", "postID": "post70653872", "replies": []}, {"text": "The speed my phone charges at is insane. 30 min and I have at least 60% more battery.", "time": "22nd January 2017, 07:47 PM", "postID": "post70677778", "replies": []}, {"text": "Dash charging works great and overall charging speed is fine.", "time": "23rd January 2017, 11:22 PM", "postID": "post70696872", "replies": []}, {"text": "As per ampere it charges at around 3500 mAh. I remember my OPO used to charge at around 1100. That is almost 3 times faster than OPO. I've never seen any phone charging up this fast !! Such a fast charging, runs for 8.5 hours SOT, superfast and all at this price. Amazing.", "time": "24th January 2017, 11:01 AM", "postID": "post70703055", "replies": []}, {"text": "No doubt about it.. King of speed Charge", "time": "11th February 2017, 03:17 AM", "postID": "post70976769", "replies": []}, {"text": "I don't think there is a challenge to dash charge about speed", "time": "11th February 2017, 08:11 PM", "postID": "post70987759", "replies": []}, {"text": "when it comes to this no other phone until today can beat this phone\r\nPS: i suspect Samsung to do better with the S8", "time": "11th February 2017, 09:08 PM", "postID": "post70988346", "replies": []}, {"text": "I use AccuBatttery.. and seeing 3566mA while charging is insane and surreal experience. When i use original usbC cable with non dash Car charger, it gives me 1200-1300mA. I can say this is the first phone that i never have to worry about out of juice.", "time": "11th February 2017, 11:54 PM", "postID": "post70989802", "replies": []}, {"text": "The DASH charger is amazing however the charging speeds via my laptop are awesome as well! My 3T is able to pull about 1,5 amps from my laptops quick charge port while my Oneplus One was only able to pull 0,5 amps.", "time": "12th February 2017, 01:12 PM", "postID": "post70996517", "replies": []}, {"text": "The DASH charging is amazing, but if you want to buy an additional charger that has DASH feature, you have to buy the stock charger from OnePlus or OPPO, and the specific Type-C cable (not just any cable). OPPO charger is slightly cheaper, but I kinda prefer QC3.0 over DASH because I could just use other cables. Hope there's an alternative, because I already have 2 QC3.0 chargers and I don't want to spend more on a new DASH =\\", "time": "13th February 2017, 12:37 AM", "postID": "post71004708", "replies": [{"text": "De gustibus. \nI prefer dash because the phone doesn't become a over and all the hot causing by the charging is all focused in the charger", "time": "13th February 2017, 12:50 PM", "postID": "post71010704", "replies": []}]}, {"text": "Charger works absolutely insane! I'm on OOS 4.0.3 now and battery life is also much better than Zuk z1 which is my previous device with much higher capacity.", "time": "15th February 2017, 02:22 PM", "postID": "post71041988", "replies": []}, {"text": "Dash Charge is amazing, it changed my phone management since I can have it almost completely charged in less than a hour!", "time": "19th April 2017, 12:57 PM", "postID": "post71928361", "replies": []}, {"text": "Fastest in the world", "time": "18th October 2017, 08:08 PM", "postID": "post74209118", "replies": []}]}, {"title": "Screen on time", "rating": 4.0, "links": ["https://forum.xda-developers.com/oneplus-3t/review/screen-time-t3511006", "https://forum.xda-developers.com/oneplus-3t/review/screen-time-t3511006/page2", "https://forum.xda-developers.com/oneplus-3t/review/screen-time-t3511006/page3", "https://forum.xda-developers.com/oneplus-3t/review/screen-time-t3511006/page43"], "threads": [{"text": "I've only had it for a week, and I could probably push for 6 hours of SoT. Right now I'm sitting at 37% battery, 3 hours 39 min SoT with fairly average use at work--mostly texting, browsing, etc.", "time": "4th December 2016, 04:57 AM", "postID": "post69918945", "replies": []}, {"text": "Normal use during weekend.", "time": "5th December 2016, 01:34 PM", "postID": "post69939012", "replies": [{"text": "Počkej, jak jsi to udělal 😯", "time": "18th December 2016, 12:38 PM", "postID": "post70145799", "replies": []}]}, {"text": "impressive!", "time": "11th December 2016, 04:07 PM", "postID": "post70038156", "replies": []}, {"text": "Incredibly bad battery life for me. I have almost 3 hours with 32% left.   That is atrocious. I get 8 hours on my 7 plus", "time": "15th December 2016, 04:16 PM", "postID": "post70104111", "replies": []}, {"text": "I'm very happy with the battery life of my OnePlus 3T! I get an average of 5h30 SoT with a night battery drain around 3-4%. Stock OxygenOS, stock kernel.\r\nFor my use: Social apps, web, little game, texting...\r\nNeed more time to master the battery, I have 13% of battery drain when screen off during almost 24 hours. I think I can reduce this!", "time": "17th December 2016, 07:11 PM", "postID": "post70136633", "replies": []}, {"text": "I usually got 6hrs on SoT. Just flashed to RR Nougat.. Curious of the performance there.", "time": "18th December 2016, 02:10 AM", "postID": "post70140317", "replies": []}, {"text": "I was at home the whole time, browsing instagram all day, never leaving the phone alone for more than 15mins😁😁😍.. I'm so impressed with the battery life.\r\nJio 4g whole day ON, no wifi, Auto brightness 30%, Stock 3.5.3 .\n\r\nI'll not be surprised if custom kernels can push op3T to 9 to 10hours SOT", "time": "18th December 2016, 06:36 PM", "postID": "post70150330", "replies": []}, {"text": "How you all getting SOT more than 6hrs....mine just 3 to 4 hrs.... I m moderate user", "time": "20th December 2016, 01:43 PM", "postID": "post70177101", "replies": []}, {"text": "I've been getting around 6 hours of SoT consistently with my usage being watching YouTube videos, browsing, few minutes of gaming(not more than 20-30min), few photos here and there all this with dual Sims, 4G data, no Wi-Fi.\nI am seriously impressed with the battery life, its waaaayyy better than what I got from my previous phone the Xperia Z2.\nThe charging is soooooo quick as well. I'd usually sit for 10-20min near a charging port giving me more than 50% of battery, that is AWESOME!", "time": "20th December 2016, 01:46 PM", "postID": "post70177138", "replies": []}, {"text": "This is one of the better ones, even after using the phone constantly as I've does with a new phone!", "time": "20th December 2016, 09:18 PM", "postID": "post70183275", "replies": []}, {"text": "bought 3t yesterday, here is my first cycle \nit can easily pushed till 7hr 30min", "time": "22nd December 2016, 10:55 PM", "postID": "post70214553", "replies": []}, {"text": "Don't know why have so poor battery life. Any idea? Newest build - 3.5.4. 161213. Whole time without wi-fi. Mostly 4G. This shouldn't be normal... Just installed GSam. Maybe it will help.", "time": "23rd December 2016, 12:07 PM", "postID": "post70220839", "replies": [{"text": "3.5.4 has battery life issues. I recommend you downgrade to 3.5.3", "time": "25th December 2016, 03:51 PM", "postID": "post70249746", "replies": [{"text": "Its mostly on Mobile data, while on wifi im getting 6+ hours SOT on 3.5.4\n\n---------- Post added at 07:11 AM ---------- Previous post was at 07:09 AM ----------\n\nHas anyone tried the unofficial OOS 4 Nougat on 3T. How is the battery life in that compared to OOS 3.5.x\r\nThanks", "time": "26th December 2016, 06:11 AM", "postID": "post70257087", "replies": []}]}]}, {"text": "No need. Problem disappeared by itself. Right now I have 6,5h sot with 12h out of charger and still 16% battery. But still hope next build will increase battery performance.", "time": "25th December 2016, 08:07 PM", "postID": "post70252612", "replies": []}, {"text": "Received the phone yesterday morning, haven't charged since. Battery is absolutely incredible.", "time": "26th December 2016, 01:13 PM", "postID": "post70260702", "replies": []}, {"text": "Hi there,\n\nI m getting only 5 to 5.30 hrs on normal usage.. how most of users able to get 7 to 8 hrs. Is something wrong with my phone should I return my phone. I am on 3.5.3 version. I got my phone on 19th December", "time": "26th December 2016, 05:37 PM", "postID": "post70264043", "replies": []}, {"text": "Yeah you should return it. You should be making 15h sot. /s", "time": "30th December 2016, 10:40 AM", "postID": "post70316828", "replies": []}, {"text": "Hi there. \r\nI'm getting around 6 to 7:30 hours SOT with the Oxygen OS 4. Previously I was getting maximum 5 hours SOT with the 3.5.3 update. \nhttps://drive.google.com/file/d/0B3L...w?usp=drivesdk", "time": "31st December 2016, 06:43 AM", "postID": "post70328807", "replies": []}, {"text": "Pretty decent.", "time": "31st December 2016, 11:24 PM", "postID": "post70339521", "replies": []}, {"text": "I have been using the OP3T for a week now. \n\r\nSOT on Oxygen OS 3.5.4 was horrible, maybe 6 hours (With google services and brightness on <10%).\r\nI switched to RessurectionRemix after 2 days https://forum.xda-developers.com/one...mix-n-t3524715\n\r\nSOT is still horrible, I unplug at 9AM and it barely makes it till 7PM and I don't really use it during the day, I just look at it for maybe 5 minutes at a time. (with google services, brightness <10% and underclocked cpu).", "time": "4th January 2017, 02:54 PM", "postID": "post70390327", "replies": []}, {"text": "if you have 6h SOT and this is bad i do not get it. If you do not use your phone during the day and have 6 SOT something is wrong... I am using pretty heavy a Chrome and messanger, couple of phone calls and sms, some youtube and I am having around 6h but I charge it day before I go to sleep and during the night it is unplugged. Coming back home I have still 20%", "time": "4th January 2017, 05:49 PM", "postID": "post70393027", "replies": [{"text": "Sorry, I should clarify this.\r\nI unplug at 9AM at 100%. By noon it drops to 72% without touching it. And by 5PM it's down to ~20% and all I do is check facebook messenger or email. So not realy using it, yet the battery goes down badly. It's more 6 hours of device on time, not sot, real sot is probably 1 or 2 hours based on how it drops without using.", "time": "4th January 2017, 08:53 PM", "postID": "post70395597", "replies": []}]}, {"text": "", "time": "5th January 2017, 02:53 AM", "postID": "post70399042", "replies": []}, {"text": "my op3t has a high power consumption while surfing via Google Chrome and 4G. i barely get 3 hours SOT.", "time": "5th January 2017, 07:10 AM", "postID": "post70401145", "replies": []}, {"text": "yes surfing on chrome for me and watching 9gag has most battery drain for me too. I have no idea how he got 8h  but probably just youtube?", "time": "5th January 2017, 02:33 PM", "postID": "post70406356", "replies": []}, {"text": "Stock Oxygen OS 4.0, not rooted.", "time": "7th January 2017, 09:49 PM", "postID": "post70445071", "replies": []}, {"text": "Battery life after Nougat Update\n\r\nScreen on time: 8 hours\r\nBattery life from 100%: 1 day and 3 hours\r\nActivities: text, calls, and more on browsing via wifi and chrome browser.", "time": "8th January 2017, 04:16 AM", "postID": "post70448324", "replies": []}]}, {"title": "Standby drain", "rating": 3.5, "links": ["https://forum.xda-developers.com/oneplus-3t/review/standby-drain-t3511007", "https://forum.xda-developers.com/oneplus-3t/review/standby-drain-t3511007/page2", "https://forum.xda-developers.com/oneplus-3t/review/standby-drain-t3511007/page3", "https://forum.xda-developers.com/oneplus-3t/review/standby-drain-t3511007/page9"], "threads": [{"text": "I think MM is good in general, but so far so good.  I only lose 1 to 3% overnight.", "time": "2nd December 2016, 03:57 AM", "postID": "post69889439", "replies": []}, {"text": "I have plenty of battery drain overnight, mostly the Android system, Android OS and Google services.", "time": "2nd December 2016, 04:27 AM", "postID": "post69889684", "replies": []}, {"text": "I've had the phone for 2 days now and overnight battery drain is around 5%, but the real problem is that Android System takes up around 30% of my battery.", "time": "2nd December 2016, 05:48 AM", "postID": "post69890302", "replies": []}, {"text": "in 8h night (standby) i get 1-2% drain.\nwifi, sync enabled. \n\nif you get major drain, then its something on your setup causing it. \nits always like that. (except something is broken on hardware side)", "time": "2nd December 2016, 06:42 AM", "postID": "post69890773", "replies": []}, {"text": "OxygenOS 3.5.1. - 1-2% battery drain;\nOxygenOS 3.5.3. - 0% battery drain (in one scenario phone was left to sleep@100% (took off the charger and it drained 0% in 4 hour sleep period and in the other scenario the phone was left @53% to sleep and it drained 0% in 8 hour sleep period)  \n\nmore info can be found here -> http://forum.xda-developers.com/onep...00mah-t3505786", "time": "2nd December 2016, 08:23 AM", "postID": "post69891673", "replies": []}, {"text": "My experience is that the phone is better than average for sleep drain, just ~1-2 % with stock kernel. With Tyranus kernel v12 by @mdalexca, I'm not seeing any drain overnight at all. Battery life on medium usage looks to be a few days at least. (Yeah, I'm a light user aside from my first week with a new phone where I nearly wear it out ;;))", "time": "2nd December 2016, 01:58 PM", "postID": "post69895494", "replies": []}, {"text": "I saw 2% drop over night. I slept almost 8 hours so not bad right?!", "time": "6th December 2016, 06:16 PM", "postID": "post69960122", "replies": []}, {"text": "Using Nova Launcher ...experiencing battery drain 3~4% overnight (5-7 hours) with WiFi off. But during the day, WiFi on, not even touching phone and it goes down 10% in an hour and a half. Battery reports Android System as the culprit. Any suggestions guys?", "time": "7th December 2016, 06:08 AM", "postID": "post69967726", "replies": [{"text": "Turn off Android System.\n\r\nSorry, couldn't resist.", "time": "7th December 2016, 03:17 PM", "postID": "post69974256", "replies": []}]}, {"text": "I got pretty good standby last night. Some nights don't give me near as good standby, so it's quite inconsistent.", "time": "7th December 2016, 03:48 PM", "postID": "post69974777", "replies": []}, {"text": "I got someone here with one plus 3 non t version (I got t, same problem like you) and is just flashed Chinese version of one plus 3 on his phone and zero drain but bare in mind the Chinese version doesn't got Google services at all , no play store and stuff , is saying is got more juice now , but I am just thinking you will need to install Google services for YouTube and stuff . Hmmm just saying Google battery hog .\nFor now I am waiting for developers to receive their phone . I just can't wait for many custom ROMs", "time": "7th December 2016, 08:51 PM", "postID": "post69979091", "replies": []}, {"text": "using stock Oxygen with BT/Wifi on, 2 push accounts with 4-5% drain overnight", "time": "8th December 2016, 08:37 AM", "postID": "post69985617", "replies": []}, {"text": "I have the MBA bug.  I see a lot of people avoid it by staying on WiFi but I can't. Result is rapid battery drain. \n\nI'm still getting reasonable battery though if I remember to toggle airplane mode. Device sleeps well enough.  Almost perfect awake to screen on ratio.", "time": "8th December 2016, 06:18 PM", "postID": "post69993928", "replies": []}, {"text": "Seems my 3t is different. Getting decent standby drain. \n\nWysłane z mojego SM-T815 przy użyciu Tapatalka", "time": "13th December 2016, 07:35 PM", "postID": "post70074097", "replies": []}, {"text": "I get horrible standby time just driving in Chicago without using maps or anything screen asleep it drains a lot.", "time": "15th December 2016, 07:20 PM", "postID": "post70106745", "replies": [{"text": "Doesn't sound normal to me.. I'm getting usually around 0,50%/h standby drain. I'm guessing it might be some app which keeps draining your battery.", "time": "15th December 2016, 08:40 PM", "postID": "post70107836", "replies": []}]}, {"text": "One thing I loved the most with my oneplus 3t  is Zero drain overnight.... Love it", "time": "19th December 2016, 03:56 AM", "postID": "post70155671", "replies": []}, {"text": "FYI I noticed that the battery drop during standby is if the device is on LTE and not WiFi. I switched over the device to WiFi and the battery drop is minimal during standby.", "time": "19th December 2016, 04:36 AM", "postID": "post70155963", "replies": [{"text": "I've noticed the same as well on 3.5.4. I can't say the same for 3.5.3 since the received the ota update shortly after getting the phone. Really weird that the drain is only during data connection only. Also, in battery stats it shows that Android OS had the CPU running for close to 4 hours or more in a single charge cycle.", "time": "23rd December 2016, 06:43 PM", "postID": "post70225511", "replies": []}]}, {"text": "i think some apps like facebook acts like a vamps! hahaha", "time": "19th December 2016, 07:39 PM", "postID": "post70166445", "replies": []}, {"text": "I have around 3-5% of battery drain when idle at night with one plus one, anything less than this would be nice.", "time": "23rd December 2016, 10:56 PM", "postID": "post70228046", "replies": []}, {"text": "Türk yokmu amk", "time": "24th December 2016, 05:50 AM", "postID": "post70230924", "replies": []}, {"text": "no, it is pure stock with custom kernel. I just switched to Oreo, in Nougat it was much better with battery and I never used any greenify, naptime etc.", "time": "15th February 2018, 12:37 PM", "postID": "post75576439", "replies": []}, {"text": "20% battery drain overnight. Never rooted my oneplus 3T. Its running on 5.0.2(Android 8.0).", "time": "15th February 2018, 11:43 PM", "postID": "post75583161", "replies": []}, {"text": "Last night 0% drain\nStock 5.0.1\nBoeffla kernel", "time": "16th February 2018, 08:03 AM", "postID": "post75586293", "replies": []}, {"text": "I don't know how you do it. I have always some awake in the graph. Also I noticed when I turn off internet - wifi and mobile I get also very small drop over night.", "time": "17th February 2018, 01:01 PM", "postID": "post75600363", "replies": []}]}, {"title": "Heavy use endurance", "rating": 4.0, "links": ["https://forum.xda-developers.com/oneplus-3t/review/heavy-endurance-t3511008", "https://forum.xda-developers.com/oneplus-3t/review/heavy-endurance-t3511008/page2"], "threads": [{"text": "One thing I noticed about the phone is that the 6gb of free ram that is bragged is really more like 4.9 gb after a reboot and 4gb after about an hour even without using the phone and I can't seem to find any apps that are eating up the ram. can someone explain why this is the case? It doesn't seem to hinder the performance at all but I haven't tried a speed test so I'm not certain.", "time": "15th January 2017, 03:01 AM", "postID": "post70557683", "replies": [{"text": "system and kernel will use ram too (possible caching), and most likely wont show up. thats normal.", "time": "15th January 2017, 03:37 PM", "postID": "post70564681", "replies": []}, {"text": ".. lol\n\r\nYour phone ram is supposed to be used, its how android works, you will NEVER ever have phone with 0% of ram used and if it doesnt hinder the performance stop complaining about it", "time": "15th January 2017, 05:30 PM", "postID": "post70566265", "replies": [{"text": "Wow complaining about having 4gb of FREE RAM.. Mine  has a total of 3gb and you have more free then mine total. You will never use that much up and run out. If your at that much free ram out of a total 6gb then I'd say it's running great. Mine usually sits at half 1.5 or a little more free but having that much RAM you'll always be sitting at more then half free cause you'd have to be eating up more then 3gb to get to half and I've never seen a phone use more then 3gb even multi tasking. Your always going to use some, kernel, apps,etc so sitting at 4gb free is great", "time": "12th February 2017, 09:24 PM", "postID": "post71003074", "replies": []}]}, {"text": "that's normal, imagine phones with 3gb of ram only having 900mb free after an hour of use with no apps open.", "time": "17th February 2017, 01:44 AM", "postID": "post71063642", "replies": []}]}, {"text": "oneplus 3t is great in battery life ...i am getting 6hours sot and in that i uses snapchat  and instagram a lot....for me its best battery life phone", "time": "15th January 2017, 04:45 PM", "postID": "post70565626", "replies": []}, {"text": "Under heavy daily usage I get almost a full day. Thats a lot for me. All day whatsapp, calls, spotify, bt headphones, fitbit with notifications, countless hours of facebook etc.", "time": "13th February 2017, 09:28 PM", "postID": "post71018160", "replies": []}, {"text": "I'm not a heavy user. But normally (without gaming), starting from 9.30 am, I put it charging at 2 am (after a day combining 70 % under 4g+ and 30% wifi, all account I have with push sync but sure I'm also working so there's a period of 8-9 hours where I use it only to quick write some whatsapp or checking notifications but after work I usually watch anime or TV series saved from Netflix) and I reach always 4-4.30 hours of screen with 20-25% still remaining. I'm really satisfied, it's a very good smartphone. And if I miss some juice, well....dash charge is the candy", "time": "15th February 2017, 06:51 PM", "postID": "post71045643", "replies": [{"text": "Until the op3t, i had Nexus 6p. This op3t has some good battery. I allways use 100% brightness, 3 emails, 4g combining with wifi, a lot of clash royale and clash clans, WhatsApp, some YouTube ir Spotify and allways 4h SOT or more. Im impressed", "time": "16th February 2017, 08:29 AM", "postID": "post71052830", "replies": []}]}, {"text": "I have two Google accounts, Facebook (with Messenger) and WhatsApp, automatic Sync always on: the battery life is not so positive as I wish it would be given the \"low\" resolution of the display and other battery saving settings switched on! Google Play Services and Android System eat a lot of battery all the time!!!", "time": "19th April 2017, 01:00 PM", "postID": "post71928400", "replies": []}, {"text": "i cant get more then 10hours in full charge. my average is removing from charge around 6:30AM and on 3PM, its my last 5% and back to the cord. how the hell you guys can have almost entire day!? this is insane for me.", "time": "22nd May 2017, 05:47 PM", "postID": "post72391219", "replies": []}, {"text": "Im on my default settings out of the box with developer option doze mode enable, automatic backup is enable, autosync on, with fb mssenger, whatsapp, skype installed. My battery would last me around 16hrs of heavy usage w/ 7hrs SOT,,,, with casual use my battery would last 21hrs tops with 5hrs sot. Overnight drain of 9% in wifi and 6% in mobile data.", "time": "23rd May 2017, 01:52 PM", "postID": "post72400952", "replies": []}, {"text": "I tried gaming in full resolution in my oneplus 3T (my game is Mobius Final Fantasy) and I got over 6 hours game time before I hit below 10% battery. That's crazy.", "time": "31st May 2017, 05:14 PM", "postID": "post72498029", "replies": []}, {"text": "can someone explain if i am getting a good battery life?", "time": "6th June 2017, 06:28 AM", "postID": "post72565082", "replies": [{"text": "Holy cow yes.", "time": "7th June 2017, 04:23 PM", "postID": "post72583731", "replies": []}, {"text": "Thats really just showing your idle time is really good - no drain in idle is good but depends really what SOT your getting when you start using it", "time": "9th June 2017, 12:05 AM", "postID": "post72601410", "replies": []}]}]}, {"title": "Light use endurance", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-3t/review/light-endurance-t3511009"], "threads": [{"text": "drops 3-4% overnight with 2 days of light use", "time": "17th December 2016, 09:29 PM", "postID": "post70138070", "replies": []}, {"text": "Drops 0-1% overnight in airplane mode and 30-35% (depends on the quality of LTE signal) with light use from 09:00 AM to 11:00 PM: a few calls and whatsapp messages, emails from 3 different accounts, a couple of pics taken with the camera, some browsing just to check stuff on Google, a peek to Google Maps every once in a while to check how is the traffic, LTE data, wifi always on, BT always on and connected to my car when driving. I find the battery performance of this phone quite stellar honestly, in both light and intensive usage scenario.", "time": "17th December 2016, 10:25 PM", "postID": "post70138618", "replies": []}, {"text": "No facebook, no gaming. Just whatsapp, some maps, and chrome.\r\n4.0.3", "time": "2nd March 2017, 08:09 PM", "postID": "post71258022", "replies": []}]}, {"title": "\"Look\" of the device (aesthetics)", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-3t/review/look-device-aesthetics-t3511010"], "threads": [{"text": "This is the most beautiful device I've ever had. I think it falls shortly just against the S8!", "time": "19th April 2017, 01:05 PM", "postID": "post71928471", "replies": []}, {"text": "I've got the midnight black version. Definitely a beauty but not a total standout.", "time": "19th April 2017, 01:32 PM", "postID": "post71928862", "replies": []}, {"text": "Love the overall design of the phone which seems to have been inspired by HTC M9 and 10 with some from iPhone. Best design IMO of any OnePlus phone. Looks great in gunmetal without being flashy.", "time": "1st September 2017, 06:08 AM", "postID": "post73619062", "replies": []}, {"text": "One thing I hate about this phone is that it is so beautiful, but I can't find a good solid case in which it looks good. I have the Spigen NeoHybrid case and it looks very bulky. The phone without the case is amazing", "time": "6th September 2017, 03:46 PM", "postID": "post73688923", "replies": []}]}, {"title": "Quality feel (use of materials)", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-3t/review/quality-feel-materials-t3511011", "https://forum.xda-developers.com/oneplus-3t/review/quality-feel-materials-t3511011/page2"], "threads": [{"text": "That sweet and gentle aluminum feel... 🤤🤤🤤\n\nThe quality feel is as good as any >700€ phone IMO.", "time": "19th February 2017, 12:25 PM", "postID": "post71096662", "replies": []}, {"text": "The only negative point (in most aluminium/metal smartphones used to be) is buttons rocker (volume and power). I talked with the official chat and they answered me is normal. But with 2 years guarantee don't worry me.", "time": "20th April 2017, 05:07 PM", "postID": "post71949230", "replies": []}, {"text": "Not sure where to post this... How is the GPS on this phone?", "time": "22nd April 2017, 01:44 AM", "postID": "post71971302", "replies": [{"text": "The buttons on my 3 felt more sturdy than the black 3T. I wonder if it is because of the paint. Not sure. Either way, it is built extraordinarily well and easily exceeds most other phones in terms of quality.\n\n---------- Post added at 12:15 AM ---------- Previous post was at 12:14 AM ----------\n\n\n\r\nIt's great, no issues. Works like any other phone would", "time": "3rd May 2017, 06:15 AM", "postID": "post72140408", "replies": []}]}, {"text": "My previoue Moto X pure had better material quality...\n\nOp3t good also but i don't like aluminium material ...so i use spigen case new hybrid and its ok now", "time": "26th April 2017, 06:08 AM", "postID": "post72034863", "replies": []}, {"text": "A couple of problems, but not deal-breakers:\n1. Weak vibration feedback\n2. Speaker a little weak, easily gets overdriven, could break if always used in full  volume", "time": "3rd May 2017, 07:01 AM", "postID": "post72140798", "replies": []}, {"text": "Highest quality ever experienced, nothing more to say", "time": "4th May 2017, 05:48 PM", "postID": "post72162369", "replies": []}, {"text": "The power button and volume rocker are little clumsly and loose , i hate that but i love the tactile feedback they give upon pressing.\r\nOverall good built quality", "time": "8th May 2017, 04:08 PM", "postID": "post72214125", "replies": []}, {"text": "My black 3T has small dents/scratches running across the top of it, the paint is chipping off on the top edge a bit. I've taken good care of the phone, it looks like something might have been trying to eat it... Lol...\n\nOtherwise, great feeling phone.", "time": "8th July 2017, 04:52 AM", "postID": "post72947551", "replies": []}, {"text": "No issues with build quality. My gunmetal 3T feels like a premium device that would usually cost $650+. I like how they used sapphire glass for camera lens cover and ceramic for FPS. Definitely feels higher quality than my Nexus 6P.", "time": "1st September 2017, 05:59 AM", "postID": "post73619007", "replies": []}, {"text": "My screen went blank within a month of normal usage and I really doubt about the quality of components used as it is also a known issue with oneplus 3T.", "time": "20th November 2017, 08:39 AM", "postID": "post74573938", "replies": []}, {"text": "I love the build of the OP3T, the smooth and solid feel in the hand is superb , the buttons offer the most tactile feel i've ever had. the only gripe i have is the antenna bands get dirty over time when used with a TPU case and the steel rim near the camera loses paint", "time": "27th November 2017, 02:33 PM", "postID": "post74655239", "replies": []}, {"text": "my 3T slided off my pocket while riding my scooter ~30mph, no cover/bumper/anything\r\nRescued and - with surprise and relief - realized was still pretty much intact! The only \"major\" damage was to the rear camera glass, which has a vertical crack: this sort of refrains a bit the light when i take pictures, but is still usable.", "time": "29th November 2017, 07:40 AM", "postID": "post74675717", "replies": []}, {"text": "It's just a great feel in the hand  No homo", "time": "21st December 2017, 04:05 AM", "postID": "post74914405", "replies": []}, {"text": "Just got the 5T Red annnd.... The 3T build is far more solid. All the edges are machined and the metal feels heavier.\n\nThe 5T feels like Tin in comparison.\n\nJust saying.", "time": "19th January 2018, 03:51 PM", "postID": "post75258629", "replies": []}]}, {"title": "Ergonomics (in-hand feel)", "rating": 4.0, "links": ["https://forum.xda-developers.com/oneplus-3t/review/ergonomics-hand-feel-t3511012", "https://forum.xda-developers.com/oneplus-3t/review/ergonomics-hand-feel-t3511012/page2"], "threads": [{"text": "It´s a little bit slippery.", "time": "5th December 2016, 07:05 PM", "postID": "post69944047", "replies": []}, {"text": "To slippery.. Unusable \"without a Case/TPU\"", "time": "5th December 2016, 09:10 PM", "postID": "post69945762", "replies": []}, {"text": "Agree.  OnePlus 3T/3 is way too slippery to use without a case, especially in situations where you have to use it in one hand.  Thankfully there's great cases by OP themselves. I absolutely love the original Karbon Case for OP3T/OP3. It has great grip, looks and it provides \"ok\"  protection for back, camera and even front (it has lips on the corner that allow you to put the phone face down without scratching the screen).", "time": "5th December 2016, 09:41 PM", "postID": "post69946169", "replies": []}, {"text": "It feels just like a LG G5 with the metallic backing and similar color.\n\nI also bought a TUDIA Slim-Fit HEAVY DUTY ~~ and my gripes with the case is that the backing is rounded hard plastic and it makes the phone slippery as well and is prone to spinning and sliding. \nhttps://www.amazon.ca/gp/product/B01...?ie=UTF8&psc=1", "time": "6th December 2016, 03:14 PM", "postID": "post69957325", "replies": []}, {"text": "I m using it since 6 months....and it feels too slippery without any cover...but the build quality is better than samsung", "time": "6th December 2016, 05:37 PM", "postID": "post69959553", "replies": []}, {"text": "This phone is a tad large for my tastes, but i came from an HTC One m7 which in my opinion was the perfect size", "time": "2nd January 2017, 02:14 AM", "postID": "post70353240", "replies": [{"text": "Same consideration here, especially when adding a much needed case for protection. I'm coming from an Xperia SP (4.7\" screen) which, considering the bezels, is basically like a contemporary 5\" device in terms of overall size and I think that's the perfect size that also makes it easy to use the phone with one hand. Maybe 5.2\" would still be OK with such thin bezels, but 5.5\" is, as I feared, a bit too much and for me it's not really about the width of the device, but more about its height. Anyway I do enjoy the screen size more now that it's easy to increase the screen density with the Nougat update", "time": "2nd January 2017, 07:39 AM", "postID": "post70355586", "replies": []}, {"text": "Funny, I had the m7 before and had the exact same thought. I miss being able to walk down the street and message with one hand comfortably.", "time": "4th January 2017, 12:30 AM", "postID": "post70382223", "replies": []}]}, {"text": "Slippery but feels great in the hand.\r\nFeels better in the hand then Samsung and most iPhones.\r\nDoesn't feel heavy but feels and looks premium.", "time": "3rd January 2017, 12:06 PM", "postID": "post70373075", "replies": []}, {"text": "Approximately 1/20 of a millimeter thicker than the iPhone 7. Is it better to be thinner, or to feel thinner?\n\nThat being said, it feels about a third thinner due to the curved and beveled edges built into it, which the iPhone design team seems to never have thought about. Better grip compared to the iPhone when holding it by the edges, easier to feel the edge and how good of a grip one has.", "time": "3rd January 2017, 10:55 PM", "postID": "post70381282", "replies": []}, {"text": "It feels awesome and the build quality is just on-spot.\nBut to me it's a little too large (coming from a hammerhead Nexus 5) which might resolve once I get used to the size.\nReports of it being slippery without a case are definitely true for me as well.", "time": "4th January 2017, 02:11 AM", "postID": "post70383038", "replies": []}, {"text": "It's slippery indeed, but I bought it with the Sandstone Case and now it's grippy as hell.", "time": "19th February 2017, 12:23 PM", "postID": "post71096646", "replies": []}, {"text": "Yes I do find it slippery as well kinda scary as I would hate to drop it. But with the oneplus sandstone case it's prefect.", "time": "5th April 2017, 07:54 AM", "postID": "post71732910", "replies": []}, {"text": "Lots of unused space on top and an bottom (but most other devices aren't better).", "time": "9th April 2017, 09:26 AM", "postID": "post71787064", "replies": []}]}, {"title": "OEM skin/software", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-3t/review/oem-skin-software-t3511013", "https://forum.xda-developers.com/oneplus-3t/review/oem-skin-software-t3511013/page2"], "threads": [{"text": "I prefer to root my devices but OOS is very clean from bloatware.", "time": "5th December 2016, 07:05 PM", "postID": "post69944054", "replies": []}, {"text": "feels very solid, keeps good in hand but require some kind of skin as it is but sliipy but not as htc 10 or iphone 7", "time": "17th December 2016, 09:30 PM", "postID": "post70138083", "replies": []}, {"text": "Not to excited on oos but that's not why I got this phone. I got out for custom ROMs and I love rr on this phone makes it a masterpiece in my opinion.", "time": "5th April 2017, 07:57 AM", "postID": "post71732940", "replies": []}, {"text": "Please check the default productivity apps for me:\n- email (imap client)\n- calendar / planner\n- note taking app\n\nI'm using Samsung s7 on Nougat patch and would like to have a few opinion on the difference of experience.\n\nI'm planning to switch primarily for experience of stock android (google pixel is too expensive) and for software updates as Samsung tend to do a poor job on this one. I want to have the latest version of Android.\n\nThanks", "time": "21st April 2017, 11:19 AM", "postID": "post71960460", "replies": [{"text": "I use Gmail for 2 Gmail accounts and 2 Yahoo accounts.\n\r\nThe stock calendar is Google calendar.\n\r\nThere is a memo widget in the swipe right screen on the stock launcher and all tiles are customizable.  It's very handy.\n\r\nThe stock latest nougat version is super lean and nearly stock Android, no real bloatware.  It's very fast and fluid, I think you will like it.  The notification slider is very handy too, something that you didn't know you want until you have it.\n\r\nThe only thing I would like on the phone would be dual front facing speakers, other than that it's perfect for my liking.  The slightly curved glass on edges feels great in hand but tempered glass screen protectors are a PITA to find one (only real one that covers whole screen and actually adheres to screen is the official curved tempered glass screen protector).\n\r\nKeep in mind too the screen is only 1080p, it is a Samsung amoled panel, but you are losing some pixel density from the S7.  But it is as good as a 1080p screen gets, and saves power.", "time": "21st April 2017, 01:20 PM", "postID": "post71961887", "replies": []}]}, {"text": "What about its stock email client? I use Samsung's default email client for around 7 mailboxes via IMAP and it works very nicely as subtle details like gestures for drag to move contacts from TO to CC is very useful for me, as well as built in text formatting. Handling attachments is very easy as well.", "time": "21st April 2017, 01:34 PM", "postID": "post71962058", "replies": [{"text": "I don't recall if I uninstalled it or it didn't have one, all I have is Gmail on mine.  Hopefully someone else can comment.\n\r\nI went through first thing and removed or disabled all the apps I don't use. Sry.", "time": "21st April 2017, 01:45 PM", "postID": "post71962199", "replies": []}]}, {"text": "Come to think of it, I can download 3rd party apps anyways, glad that I'm seeing I'm making the right choice. I'm hoping to get this phone instead of Oneplus 5 due to budget constraints. Thanks for your input.", "time": "21st April 2017, 01:47 PM", "postID": "post71962245", "replies": [{"text": "No problem.  You might be able to find an email app that is based off the Samsung stock app.", "time": "21st April 2017, 01:49 PM", "postID": "post71962260", "replies": []}]}, {"text": "How is oneplus dealing with software updates? Are they better than samsung?", "time": "21st April 2017, 01:50 PM", "postID": "post71962283", "replies": [{"text": "They seem to be very good.  Check out the general forum. It was one of the first phones with nougat 7.0, it's on 7.1.1 now, and even have a beta program for newest versions.  There was an update within the last few days also.\n\nNow whether it will keep up after the new OnePlus phone comes out is in question.\n\nThe custom ROM scene will probably keep it updated for years to come though.  Even the OnePlus one has perfect custom ROMs on the latest Android and are updates all the time.  But you have to be willing to flash a recovery and ROM.", "time": "21st April 2017, 01:58 PM", "postID": "post71962399", "replies": []}]}, {"text": "Got it, thanks!", "time": "21st April 2017, 02:31 PM", "postID": "post71962870", "replies": []}, {"text": "I'd say my expectations has been concurred. The Oneplus latest phone is both amazing in screen quality and performance. It makes and overall remarkable speed and quality and not to mention its camera. I bet the new Oneplus has some even better specs to bring os.", "time": "22nd April 2017, 11:29 AM", "postID": "post71976307", "replies": []}, {"text": "It's too early saying that OnePlus is good with Updates. OnePlus 2 it's abandoned, OP1 was a total failure (due to CM) and never got updated with OOS. OPX? They forgot about it (neither security patches). What i think? It's the best smartphone for price/specs. Yeah it's supported right now but when the new OP will come out our 3T will die. Hopefully Modding is our solution", "time": "23rd April 2017, 10:14 AM", "postID": "post71990526", "replies": [{"text": "One plus one was debacle due to cm thingy, and op2 had it'd own problems of SOC and all. Op3 came out to be perfect, and that's why they are going overboard for the updates for this phone.\nAnd this will be supported for quite some time.", "time": "26th April 2017, 05:23 AM", "postID": "post72034518", "replies": []}]}, {"text": "The OnePlus One has 7.1.1 roms that are perfect (ala RR and others), so I would guess devs will keep us up to date for some time.  Unlocking bootloader and flashing are easy on OnePlus phones.", "time": "24th April 2017, 05:39 AM", "postID": "post72002919", "replies": []}, {"text": "https://source.android.com/security/bulletin/2017-05-01\n\nMy OP3T is very late on security patches, which is quite surprising and disappointing.", "time": "1st June 2017, 12:10 AM", "postID": "post72502121", "replies": [{"text": "May security patch is already there and you are saying op is late on security patches.\nMaybe expecting too much, are we?", "time": "5th June 2017, 07:24 PM", "postID": "post72560426", "replies": []}]}]}, {"title": "Outdoor visibility (max brightness)", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-3t/review/outdoor-visibility-max-brightness-t3511014"], "threads": [{"text": "This screen is bright!", "time": "5th December 2016, 07:06 PM", "postID": "post69944064", "replies": []}, {"text": "Yeah I would agree. The screen is way too bright. \n\nI would hope that the android 7 update will bring a better brightness slider so that we can have a more varying degrees of blindness...err brightness.", "time": "6th December 2016, 02:58 PM", "postID": "post69957086", "replies": []}, {"text": "Outdoor visibility is very good. I am surprised!", "time": "15th January 2017, 06:07 AM", "postID": "post70558858", "replies": []}, {"text": "Outdoor visibility is the biggest downside of the OP3T's display.", "time": "19th April 2017, 01:06 PM", "postID": "post71928481", "replies": []}, {"text": "The visibility is very good but in maximum brightness and very sunny day LG G4 or Samsung Galaxy has better visibility.", "time": "20th April 2017, 04:49 PM", "postID": "post71948957", "replies": []}, {"text": "Outdoor visibility is usually fine but I use high brightness mode when needed in direct sunlight.", "time": "30th August 2017, 06:10 PM", "postID": "post73600184", "replies": []}, {"text": "Max brightness is definitely good enough, I never really had any issue in using the screen, even in conditions of direct strong sunlight\r\nSometimes I just find the automatic brightness sensor not super-reactive to adjust it accordingly", "time": "29th November 2017, 07:48 AM", "postID": "post74675768", "replies": []}]}, {"title": "Contrast (true blacks)", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-3t/review/contrast-true-blacks-t3511015"], "threads": [{"text": "it has an amoled display o.o so real blacks.", "time": "10th March 2017, 08:59 AM", "postID": "post71363153", "replies": []}, {"text": "The blacks are as good as any AMOLED display, that is, pitch black. It is virtually indistinguishable from the top and bottom bezels of my gunmetal OP3T", "time": "26th March 2017, 05:12 PM", "postID": "post71597313", "replies": []}, {"text": "Just to expand slightly, an AMOLED display means that each pixel only produces light while it's activated. There is no full-screen backlight like you'd see on a typical LCD screen, so if a pixel is not given a signal to illuminate a specific color, it just remains off, so you get the best blacks you can find. So the contrast ratio is basically 1:infinite. This is, in my opinion, the best screen technology for a cell phone. The reason it's not more prevalent on TVs and monitors is because of (a) the cost, but more importantly (b) burn in. Static images will cause permanent (or semi-permanent) shadow images. You can easily see this if you find a retail store with a display model OLED TV. Cell phones displays are, for most people, more often off than on, and the image is frequently changing while they are on, so it's not really a concern there. Hope this helps!", "time": "30th March 2017, 01:17 AM", "postID": "post71644008", "replies": []}, {"text": "Look sick when you have dark theme on apps and substratum", "time": "31st March 2017, 12:13 PM", "postID": "post71663854", "replies": []}]}, {"title": "Color saturation & accuracy", "rating": 3.5, "links": ["https://forum.xda-developers.com/oneplus-3t/review/color-saturation-accuracy-t3511016", "https://forum.xda-developers.com/oneplus-3t/review/color-saturation-accuracy-t3511016/page2", "https://forum.xda-developers.com/oneplus-3t/review/color-saturation-accuracy-t3511016/page3"], "threads": [{"text": "s-RGB mode is great, except for the white balance, it's a tad too warm/yellow.", "time": "18th January 2017, 02:02 PM", "postID": "post70610748", "replies": [{"text": "sRGB is supposed to be like that, though. I also find the warmer screen easier on the eyes in bed.\n\n\r\nProblem with that is really each screen is different, whereas the sRGB calibration is the same for every display, as far as I know.", "time": "20th January 2017, 10:51 AM", "postID": "post70640415", "replies": []}]}, {"text": "Want to share my screen settings, I personally love AMOLED colors but I hate yellowish tint, so I tuned it up a bit to get cold white:\r\n1. Install Kernel Adiutor.\r\n2. Go to Screen section.\r\n3. Red 205, Green 225, Blue 256 (default).\r\n4. Save.\n\r\nThat's it. Keep in mind that this is completely personal choice.", "time": "19th January 2017, 07:47 PM", "postID": "post70631847", "replies": []}, {"text": "I only use the sRGB mode as i hate oversaturated colours and always prefer colour accuracy in all circumstances. As mentioned above the colour temp is a bit off, but overall the sRGB mode is the lesser of all evils. Is it just me or do the colours pop a little more in sRGB since the Nougat update? Before the update i felt the colours were a little under-saturated but i'm happy with it now.\n\r\nHow people can live with the disgusting neon AMOLED colour space is beyond me.", "time": "20th January 2017, 10:10 PM", "postID": "post70649342", "replies": []}, {"text": "Screen is a downgrade. Very strong yellowish tint. Not happy at all.", "time": "29th January 2017, 09:01 AM", "postID": "post70781297", "replies": []}, {"text": "I use Official RR and there is option for screen color in %. What to do for it ? How to Calibrate it ? Thanks in andvance.", "time": "31st January 2017, 04:11 PM", "postID": "post70817035", "replies": [{"text": "custom kernel", "time": "3rd February 2017, 09:33 AM", "postID": "post70858190", "replies": [{"text": "Thanks.\n\r\nBut Which kernel btw ? Official RR comes with custom kernel build in. So which one is supported ?", "time": "3rd February 2017, 12:44 PM", "postID": "post70860221", "replies": []}]}]}, {"text": "yes screen color saturation is a failure when we recognize it and also we saw some yellowish", "time": "7th February 2017, 11:28 AM", "postID": "post70917756", "replies": []}, {"text": "SRGB is a bit yellow anyway.", "time": "9th February 2017, 03:59 PM", "postID": "post70953856", "replies": []}, {"text": "Would it be weird to say I like the saturation of the default colors", "time": "26th February 2017, 01:09 AM", "postID": "post71191544", "replies": []}, {"text": "Me too. I like stock. One day when i will root the device maybe i will change but i like very much default colours", "time": "26th February 2017, 09:36 AM", "postID": "post71195061", "replies": []}, {"text": "One of the best 1080p AMOLED displays that I've used. Of course, it isn't as impressive as the QHD Samsung panels though not really far off. The whites on my display seem good to my eyes. I can easily notice the yellowish warm whites on AMOLED screens but I don't seem to notice anything like that on my unit. My unit luckily has good whites (not too warm/cold) and no pink or green tint. \nThough I've been an AMOLED fan for years, this my first phone with an AMOLED display. The colors do seem a bit too saturated at times but it is a gorgeous display. The sRGB mode is nice for when you need color accuracy but it is just too washed out for my taste. \nOnly real \"defect\" in this display is the purple ghosting effect which can be observed while scrolling grey elements on black backgrounds in low brightness but this issue is inherent to AMOLED and I've seen it on all AMOLED devices I've laid my eyes on.", "time": "26th March 2017, 04:29 PM", "postID": "post71596753", "replies": []}, {"text": "Can the color be optimized to look accurate like an ips display with elemental or franco kernel ?", "time": "11th April 2017, 08:24 AM", "postID": "post71813180", "replies": [{"text": "Both kernels supports color control and works the same so either can produce accurate colors, you just need to know the proper color values settings", "time": "11th April 2017, 10:58 AM", "postID": "post71814648", "replies": []}]}, {"text": "here's the best profile by far:\r\nsaturation intensity = 33\r\nscreen value = 127\r\nscreen contrast = 121\n\r\nlet me know if it's good.", "time": "13th April 2017, 10:53 AM", "postID": "post71841635", "replies": [{"text": "This is old, but what do you mean by \"best\"? Looking for most accurate--for purpose of graphic design/photography. Would you say yours is?", "time": "22nd February 2018, 06:34 AM", "postID": "post75653540", "replies": []}]}, {"text": "How to do that on default os?", "time": "11th January 2018, 05:04 PM", "postID": "post75162378", "replies": [{"text": "you need bootloadr unlocked and root and a custom kernel like franco blu spark or boeffla for that. stock kernel does not support that", "time": "12th January 2018, 09:57 AM", "postID": "post75170056", "replies": []}]}]}, {"title": "Clarity/resolution", "rating": 4.0, "links": ["https://forum.xda-developers.com/oneplus-3t/review/clarity-resolution-t3511017", "https://forum.xda-developers.com/oneplus-3t/review/clarity-resolution-t3511017/page2", "https://forum.xda-developers.com/oneplus-3t/review/clarity-resolution-t3511017/page3"], "threads": [{"text": "How do you find the sRGB-mode? I dont like it at all. The colours are not colourful any more in that mode. I find custom mode full warm the best though...\nWhat about you?", "time": "7th December 2016, 09:54 PM", "postID": "post69979842", "replies": [{"text": "Same, custom mode with full warm is my fav so far. Whites in other modes looks little blueish to me.", "time": "8th December 2016, 12:10 AM", "postID": "post69981186", "replies": []}]}, {"text": "At first I thought S-RGB mode to be very bland in comparison with the default's vibrant colours. But after trying out the S-RGB for a day straight I don't want the default anymore xD \nEverything seems much more realistic, accurate, not overly saturated, and even soothing/calmer with S-RGB. Default now gives off a wacky vibe, like I'm high or something :P\n\nEdit: Tried custom full warm like the posts above, but I don't like it during the day. At night it is good, but still prefer the S-RGB for most of the day.", "time": "8th December 2016, 05:48 AM", "postID": "post69984034", "replies": []}, {"text": "I really dislike the screen of the OP3T and I'm probably going to return mine because of it.\n\nUnfortauntely I can't post an image comparison I made but you can probably see it for yourself: get some app with sharp edges in the UI and black on white text (Now for reddit, for example), you'll notice a bit of color fringing around the text, typically some green above and purple below the characters' lines. This makes text look somewhat out of focus and uncomfortable to read.\n\nIt really sucks compared to my Nexus 5's IPS screen, sure more vibrant colors but what use is that if it can't display text in a readable form?\n\nToo bad, I really like the rest of the phone. Now I'll have to go back and look for another affordable dual sim high-spec phone.\n\n(This is my second OP3T after I returned the first one believing this was a manufacturing defect, after some looking around it seems to be a result of the screen being a PenTile AMOLED display at a too low resolution for the size)", "time": "8th December 2016, 10:04 PM", "postID": "post69996982", "replies": [{"text": "I'm calling BS on this one. Smells like a troll...", "time": "25th December 2016, 09:30 AM", "postID": "post70245886", "replies": []}]}, {"text": "i now have a huawei p9 with 1080p ips lcd and 5,2\".  i like the uniformity and the \"sharp edges\" (no pentile matrix) of the display.\nanyone in the same boat and did a \"downgrade\" to the OP3T amoled screen?\ni`m a little bit afraid of uneven gray level (yellow on one side) and fuzzy fonts which are not so comfortable readable as on a lcd display.", "time": "16th December 2016, 05:31 PM", "postID": "post70121043", "replies": []}, {"text": "l like the phone specs but worried about the low resolution screen - anyone have this and the s7 edge and can compare the screens ?", "time": "20th December 2016, 02:18 AM", "postID": "post70170468", "replies": []}, {"text": "sRGB mode is really great in my opinion --> the calibration in this mode is great, so you can be sure, that everything on the web and in apps looks as the creator intended, as sRGB is for the time being the \"standard\" color profile.\nI have no problem with the pentile matrix and 1080p resolution --> while I can notice a difference in sharpness compared to the OPO with its 1080p IPS display, the display of the OP3T is all around great. I would put the sharpness of the OP3T around the sharpness of the iPhone7 (non plus) with its 326ppi.", "time": "20th December 2016, 07:27 AM", "postID": "post70172934", "replies": []}, {"text": "The sRGB mode on the OP3 is way better.. The OP3T sRGB mode is definitely pretty washed out with a lot more yellow tint..  \n        I'm sure one plus can tweak that.. Nothing inherently wrong with the screen coz I think they're the same..", "time": "20th December 2016, 09:37 AM", "postID": "post70174197", "replies": []}, {"text": "I just got OnePlus 3t for a week. The screen sharpness look okay to me, I have s6 and s7 edge to compare and I can't see any pixel in these phone except both samsungs look sharper. The only complaint here is that the screen panel doesn't look very black when see in daylight and not as vivid/warm, compare to my iPhone 6s. But custom setting to nearly full warm help a lot.\nI use to be afraid of the pentile 1080p too, but now I can say it look very great.", "time": "25th December 2016, 10:56 AM", "postID": "post70246687", "replies": []}, {"text": "I'm disappointed in the clarity of the screen, it looks quite pixelated and grainy to me. I can't understand why OP didn't go for a QHD in the 3T", "time": "7th January 2017, 04:31 AM", "postID": "post70432350", "replies": []}, {"text": "I preffer 1920x1080 in my 3T, the screen has a lot of quality in my opinion, I don't want anymore.", "time": "7th January 2017, 10:02 PM", "postID": "post70445201", "replies": []}, {"text": "I don't like the screen at all, it just isn't as sharp as other phones compared to today's standards its not great. Im quite let down by it.", "time": "7th January 2017, 10:57 PM", "postID": "post70445721", "replies": [{"text": "LeL", "time": "7th January 2017, 11:05 PM", "postID": "post70445778", "replies": []}]}, {"text": "It's decent in my opinion\r\nI came from Galaxy S6 and its (well, let's face it) outstanding quad HD display and actually the downgrade in resolution is in fact noticeable for me. Not a big deal though, it may be just me being crazy about some minor details", "time": "7th January 2017, 11:31 PM", "postID": "post70446046", "replies": [{"text": "Agreed, I'm used to using 2k screen phones and I'm perhaps being a bit OCD about it. The 3T screen isn't bad by any means, I can just see the difference from my old 2k phones which is annoying me. I'm also noticing the PWM on the screen and that's something I've not noticed in phones since I had my old Note 4.", "time": "7th January 2017, 11:50 PM", "postID": "post70446228", "replies": [{"text": "Exactly, I totally agree with you", "time": "8th January 2017, 10:29 AM", "postID": "post70451589", "replies": []}]}]}, {"text": "Such an amazing phone but the 1080 pentile is ugly, you're only getting an effective resolution of around 900p because of it. I feel the phone is spoiled a lot because of this.\nsRGB mode is a must also on this panel.", "time": "12th January 2017, 05:11 PM", "postID": "post70521887", "replies": []}, {"text": "Coming from a Moto X Pure, which has a 1440p display, I can definitely tell the difference, especially when I resize my desktop icons using Nova Launcher, with the display set to small on Nougat. This phone however is blazing fast compared to the Pure, so I'll be getting used to the display and set my icons to a somewhat smaller size (120% instead of 130%.)\n\nI have no reason to root this thing either, except for a custom kernel with KCAL support and using Kernel Adiutor-Mod. None of the sRGB settings are good enough for me. I need Samsung-like bleeding color settings.\n\nEDIT: Solved the blurry icons with Nova by disabling the \"Normalize icon size\" option.", "time": "13th January 2017, 01:56 AM", "postID": "post70527753", "replies": []}, {"text": "Got a Mate 9...Have the OP3t on order...One of them is going back in a week.  After reading this thread, I have an idea which one", "time": "29th January 2017, 03:14 AM", "postID": "post70778586", "replies": []}, {"text": "I've got to say, the screen looks decent but it is very far to be pleasant, at least for my eyes, the colors are not crisp and brilliant like others, my last mobile was a s7 Edge and the coloes looked great! a bit too radiant but really good.\nI wish, I could adjust the screen colors, not just the temperature....", "time": "31st January 2017, 03:23 PM", "postID": "post70816334", "replies": [{"text": "I think franco kernel has the setting to adjust display saturation, but not sure the one for the oneplus 3t does though. It might be something you might want to look into if you already have it (or another custom kernel).", "time": "31st January 2017, 09:07 PM", "postID": "post70821457", "replies": []}]}, {"text": "Heh. I'm custom full cold....!", "time": "26th February 2017, 11:56 PM", "postID": "post71204430", "replies": []}, {"text": "Obviously pentile matrix. Not as clear as my previous device.", "time": "9th April 2017, 09:24 AM", "postID": "post71787049", "replies": []}]}, {"title": "Minimum brightness", "rating": 3.5, "links": ["https://forum.xda-developers.com/oneplus-3t/review/minimum-brightness-t3511018", "https://forum.xda-developers.com/oneplus-3t/review/minimum-brightness-t3511018/page2"], "threads": [{"text": "i feel that they need to dim it more,  it's still annoying", "time": "2nd December 2016, 12:52 AM", "postID": "post69888113", "replies": []}, {"text": "One thing I noticed is that the phone offers EXTREME fine tune-ing of the lower brightness end.....when I adjust the adaptive brightness, if I click and drag the setting towards the bottom end, there is tons of adjustability available to the user to find exactly how much brightness you want.  Having said that, the lowest settings appears quite dim to me (but not 'dangerously' dim)", "time": "2nd December 2016, 03:53 AM", "postID": "post69889408", "replies": []}, {"text": "The lowest setting for me seems to be extremely bright still, for night usage at least. Every other phone I've used has been able to get far more dim. \n\nAnyone know of any way to lower it further actually?", "time": "2nd December 2016, 12:40 PM", "postID": "post69894395", "replies": [{"text": "root it and with the help of xposed (or without) you can edit the parameters to make it even dimmer.", "time": "2nd December 2016, 01:36 PM", "postID": "post69895191", "replies": [{"text": "What do I edit? I'm rooted with Xposed.", "time": "2nd December 2016, 01:41 PM", "postID": "post69895262", "replies": [{"text": "check this out.\nhttp://forum.xda-developers.com/show....php?t=2367412", "time": "2nd December 2016, 01:59 PM", "postID": "post69895500", "replies": []}]}]}]}, {"text": "OnePlus 3T is just an amazing phone, I loved it", "time": "2nd December 2016, 06:41 PM", "postID": "post69899601", "replies": []}, {"text": "Got the device for a few weeks and there are already burn ins on the left side", "time": "5th March 2017, 09:48 PM", "postID": "post71298837", "replies": []}, {"text": "If you don't want the hassle of rooting and running xposed you could just install an app from play store, I use lower brightness by Nu-Kob, nothing fancy but it does the job", "time": "5th March 2017, 11:03 PM", "postID": "post71299537", "replies": []}, {"text": "I'm using rr with magisk (if any of that even matters when it comes to brightness). When the lights are off and I have the brightness all the way up I can barely look at it. But when I turn the brightness all the way down with the lights off it is perfect and I can see everything very clearly and my girlfriend or has an s6 and she is always jealous that when she turns her brightness down it's still blinding. So I think it's great.", "time": "5th April 2017, 08:13 AM", "postID": "post71733063", "replies": []}, {"text": "Try Velis Auto Brightness https://play.google.com/store/apps/d...ightness&hl=en\nno ads and it works great, tons of parameter to adjust as well.", "time": "5th April 2017, 04:53 PM", "postID": "post71738964", "replies": []}, {"text": "At night, the brightness is way too much. Observing the display, f.e. playing PoGo in a park at night, you almost get night blind. If you switch automatic brightness off, there is one more step down, but this one is way too dark and without any contrast. Compared to my previous device, it's really bad. I hope, it gets fixed, if possible by the hardware at all.", "time": "9th April 2017, 09:23 AM", "postID": "post71787036", "replies": []}, {"text": "I also think that the minimum brightness is not dim enough.\n\r\nI rectify this using an app called Twilight - no root required - which allows to dim + apply red filter", "time": "29th November 2017, 07:43 AM", "postID": "post74675738", "replies": []}, {"text": "It's usually okay for me, however I use Dimly if I need to go even lower.", "time": "10th December 2017, 02:42 PM", "postID": "post74798884", "replies": []}]}, {"title": "Call quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-3t/review/call-quality-t3511019", "https://forum.xda-developers.com/oneplus-3t/review/call-quality-t3511019/page2", "https://forum.xda-developers.com/oneplus-3t/review/call-quality-t3511019/page3"], "threads": [{"text": "Sound is distorted.... from most callers.. but not from all of them.. (to loud??)", "time": "4th January 2017, 12:04 PM", "postID": "post70388342", "replies": []}, {"text": "I too found call quality lacking.", "time": "5th January 2017, 10:00 AM", "postID": "post70402784", "replies": []}, {"text": "I don't have issues with calls at all. Same quality as I had on Note 5, Nexus 6p and iPhone e 7plus", "time": "15th January 2017, 06:03 AM", "postID": "post70558827", "replies": []}, {"text": "Phone Quality is good, but when it comes to Whatsapp Calls or Skype its pretty bad compared to my really old iPhone 5s, people do complain a lot and ask me to use a headset cause if put on Speaker they cant hear me very well.", "time": "16th January 2017, 10:06 AM", "postID": "post70575286", "replies": []}, {"text": "Call quality is decent imo, microphone's sensitivity could be a bit better. Yesterday while driving I received a call so I had to use loud speaker mode. The phone was lying on the passenger's seat and the person I talked with could hardly hear me", "time": "16th January 2017, 11:56 PM", "postID": "post70585455", "replies": []}, {"text": "Call quality issue was fixed for me on 4.0.2!!! now is perfect !!!!!!!!!!!!!\n\r\n****** (five stars now) .. but changing vote not allowed .. REALY !?!", "time": "18th January 2017, 08:49 AM", "postID": "post70606790", "replies": []}, {"text": "Sounds like crap...", "time": "21st January 2017, 04:35 AM", "postID": "post70652432", "replies": []}, {"text": "Both myself and my friend have the 3T, we both complain about the quality and we both cant hear each other.", "time": "21st January 2017, 11:26 AM", "postID": "post70656156", "replies": []}, {"text": "It's very decent IMO.", "time": "21st January 2017, 06:11 PM", "postID": "post70661614", "replies": []}, {"text": "Running two SIMS - AT&T and T-Mobile in Dallas.  Call quality is really inconsistent.  I get lots of people complaining about me breaking up.  Never had this problem with my LG G4 on either network.  Would love OnePlus to enhance their radio or at least allow some tuning of the radio.\n\r\nSo far,  \"thumbs down\" on the call quality.", "time": "8th February 2017, 05:09 PM", "postID": "post70939109", "replies": []}, {"text": "I have been using iPhones for years before switching to the OP3T now. Although I'm happy with the decision overall, call quality definitely is a step down from the iPhone, particularly in terms of clarity.\n\r\nNot too bad though, so it's still ok.", "time": "8th February 2017, 11:03 PM", "postID": "post70943761", "replies": []}, {"text": "Yep, same here unfortunately. I have serious issues when calling via hangout. My girlfriend complains about not hearing me as well as about seeing bad video quality. Never ever had such problems with my nexus 6p or my iPhone 6s plus... \n\nActually this is kind of frustrating... \n\nGesendet von meinem Nexus 6P mit Tapatalk", "time": "1st March 2017, 08:05 AM", "postID": "post71236117", "replies": []}, {"text": "i thought it was pretty good. better then my note 4", "time": "9th March 2017, 03:20 AM", "postID": "post71344691", "replies": []}, {"text": "Anyone moved to one plus 3T from S7 edge or lg g5?\nHow good is the call quality compared to them? Voice clarity and volume. \nThank you", "time": "2nd April 2017, 07:05 AM", "postID": "post71689203", "replies": []}, {"text": "It's better from s7 edge more clean.", "time": "2nd April 2017, 07:14 AM", "postID": "post71689252", "replies": [{"text": "You mean the S7 edge is better. The sound is louder in the S7 edge, one thing i really noticed. And the screen colours...", "time": "4th April 2017, 05:41 PM", "postID": "post71725270", "replies": []}]}, {"text": "No i mean the call quality in op3t its better.", "time": "4th April 2017, 07:05 PM", "postID": "post71726461", "replies": [{"text": "Nope, not in my opinion! Or my s7 edge was very good or the OP3T i have now is really bad. I can listen well but the sound was better in the S7.", "time": "4th April 2017, 08:31 PM", "postID": "post71727508", "replies": []}]}, {"text": "Sounds great no issues on either end.", "time": "5th April 2017, 07:43 AM", "postID": "post71732817", "replies": []}]}, {"title": "WiFi strength, range, and throughput", "rating": 3.5, "links": ["https://forum.xda-developers.com/oneplus-3t/review/wifi-strength-range-throughput-t3511020", "https://forum.xda-developers.com/oneplus-3t/review/wifi-strength-range-throughput-t3511020/page2"], "threads": [{"text": "5 stars on 5ghz band. 2,4 is a bit worse but the OP3 had that too in the beginning.", "time": "5th December 2016, 07:07 PM", "postID": "post69944078", "replies": []}, {"text": "Its a bit strange. I'm connected with 5Ghz and just have 150Mbit/s. My Moto X has 300Mbit/s with 5Ghz. Both are connected to the Wi-Fi at once. Router ist AVM FritzBox 7390.\nAny Idea why?", "time": "7th December 2016, 09:51 PM", "postID": "post69979813", "replies": [{"text": "hey guys,\r\nI just noticed that OnePlus 3T doesn't actually support mimo wifi connectivity which is supposedly meant to increase the speed!\r\nI have this mojo airtight c 75 wireless AP which has 3x3 MIMO and can support speeds up to 1.2gbps..\r\ninterestingly when I connect oneplus 3T on 5ghz it can only connect to 200mbps connection speed while I also have s7 edge which connects to 400mbps and gives double the speed than 3T in speed test!...why is this?when both s7 edge and 3T have MIMO and snapdragon processors\n\n---------- Post added at 10:07 PM ---------- Previous post was at 10:06 PM ----------\n\n\n\r\nhey guys,\r\nI just noticed that OnePlus 3T doesn't actually support mimo wifi connectivity which is supposedly meant to increase the speed!\r\nI have this mojo airtight c 75 wireless AP which has 3x3 MIMO and can support speeds up to 1.2gbps..\r\ninterestingly when I connect oneplus 3T on 5ghz it can only connect to 200mbps connection speed while I also have s7 edge which connects to 400mbps and gives double the speed than 3T in speed test!...why is this?when both s7 edge and 3T have MIMO and snapdragon processors", "time": "8th January 2017, 10:07 PM", "postID": "post70461486", "replies": [{"text": "Yeah, Mimo is not available on OP3T. You can enable channel bonding for 2.4ghz. I did that and the speed doubled when i am in the same room with the router. In order for this to be effective, you have to set the 2.4ghz band to 40mhz. It won't work otherwise. More information here.\nhttps://forum.xda-developers.com/one...nding-t3531301\n\r\nAnyway, the wifi signal on this phone is definitely weaker than nexus 5x or nexus 7 2013. I compared them side by side.", "time": "9th January 2017, 05:39 AM", "postID": "post70465366", "replies": []}]}]}, {"text": "Same here. Moto X Pure got connected at 866 Mbps. OP3T at only 300.\nI guess it doesn't have mimo antennas.", "time": "5th January 2017, 02:03 PM", "postID": "post70405871", "replies": []}, {"text": "433mbps seems to be the maximum connection speed achievable by this phone, giving me around 190/240mbps out of my 250/250mbps connection (using Ubiquiti AC Pro APs).", "time": "9th January 2017, 06:03 AM", "postID": "post70465565", "replies": [{"text": "Any of you guys on T-Mobile network? Please tell me how network is for you guys? My 6p has great network but am planning on getting 3T this week. Thanks", "time": "9th January 2017, 08:01 PM", "postID": "post70475890", "replies": []}]}, {"text": "I just got the Le Eco Pro 3 and it connects at 866MHZ on Wifi, funny my 3 yr old Note 4 also connects at that speed.\n\r\nVery disappointed that I get only 433MHZ on the OP3T.", "time": "9th January 2017, 09:41 PM", "postID": "post70477194", "replies": []}, {"text": "I still don't get why is it so hard to integrate Mimo in AD 2017.", "time": "11th January 2017, 07:31 AM", "postID": "post70499089", "replies": []}, {"text": "I've got a 200mbps internet package. On desktop with LAN getting 160mbps, on my OPO getting 100-110 mbps, on my OP3T getting 35-40 mbps ... wtf\n\nOP3t is chinese version flashed with oxygenos4.0.1 while OPO on slimsaber marshmellow. Is something wrong with the phone or is this normal for oxygenos4.0.1?", "time": "15th January 2017, 04:16 AM", "postID": "post70558182", "replies": []}, {"text": "5 stars all the way. I am on 5ghz so I cant speak about other freq but compared to my opo I have much better reception.", "time": "22nd January 2017, 07:53 PM", "postID": "post70677842", "replies": []}, {"text": "When I first got the phone, Wifi was pretty poor. Frequently disconnects and even when it was connected, it never got past ~40 mbps and the signal quality was really poor despite being only ~10m away from the router with one wall in between. For some reason, without me doing anything, the wifi suddenly improved two weeks after I received the phone (prior to any updates or mods). Still frequently disconnected, but was able to transfer at an excess of 200 mbps, which far outpaced all my other devices. The signal also markedly improved..  Now with OOS 4.0.3, they have added the option to prevent IPV6, which completely fixed the frequent disconnects. I'm guessing that my router is a little outdated and that it's IPV6 provisioning was flakey. Now, the phone's Wifi is perfect.", "time": "11th February 2017, 06:58 AM", "postID": "post70978352", "replies": []}, {"text": "I just got the op3t A3010.\r\nUpdated to Nougat and tested wifi speed.\r\nI'm only getting 25mbps which is a quarter of what we have.\r\nI'm connected to 5.0ghz wifi. Other devices are getting faster speed.\r\nHelp please?", "time": "20th February 2017, 06:52 AM", "postID": "post71107744", "replies": [{"text": "https://forum.xda-developers.com/one...-3-3t-t3559486", "time": "20th February 2017, 09:07 PM", "postID": "post71117855", "replies": []}]}, {"text": "I get about 250 on 5ghz connection haven't really checked 2.4ghz as I don't use it much and the range is great. I noticed it stays connected when I get about 20 feet from the house even.", "time": "5th April 2017, 08:01 AM", "postID": "post71732974", "replies": []}]}, {"title": "Cellular strength and throughput", "rating": 4.0, "links": ["https://forum.xda-developers.com/oneplus-3t/review/cellular-strength-throughput-t3511021", "https://forum.xda-developers.com/oneplus-3t/review/cellular-strength-throughput-t3511021/page2", "https://forum.xda-developers.com/oneplus-3t/review/cellular-strength-throughput-t3511021/page3"], "threads": [{"text": "Returning mine because of lte T-Mobile network issues", "time": "2nd December 2016, 12:31 AM", "postID": "post69887949", "replies": []}, {"text": "I've gotten better signal with my 3T than any other phone on T-Mobile. Now get service in areas where I never have in the past. Don't seem to have the issues that others are talking about, but enough people are reporting them it seems to at least consider that.", "time": "2nd December 2016, 12:42 PM", "postID": "post69894415", "replies": []}, {"text": "On Cricket which is AT&T. Limited to 8mb download. And yet I got 10mb once. I check oil wells, and drive all over. There are places where you just know that you are going to loose your signal. How ever I have not had even 1 dropped call since purchasing the 3t. I usually change phones every couple of weeks. But I think I may just keep this one.", "time": "2nd December 2016, 08:16 PM", "postID": "post69900729", "replies": []}, {"text": "T-Mobile is very hit or miss with the 4G+ issue--sometimes it gives me great speeds, others it's awful. However they have already addressed that it will be taken care of in a patch, so I'll give more insight when that rolls out.", "time": "2nd December 2016, 09:36 PM", "postID": "post69901609", "replies": [{"text": "whats the patch and what did they fix? I noticed that sometimes my call drops randomly on T-Mobile.", "time": "2nd December 2016, 11:28 PM", "postID": "post69902626", "replies": [{"text": "There's a post on the Oneplus forums in the bugs section, as well as a link in the Q&A section here referencing the bug and support. Don't think the patch is fully out yet, only to a select few.", "time": "3rd December 2016, 01:53 AM", "postID": "post69903676", "replies": []}]}]}, {"text": "Thanks!", "time": "3rd December 2016, 02:28 AM", "postID": "post69903946", "replies": []}, {"text": "OP3T on AT&T\n\nTook this speed test indoors. If I did some speed tests out and about I'm sure I could get way better. But no issues or complaints with data speed for me.", "time": "5th December 2016, 09:06 AM", "postID": "post69935898", "replies": []}, {"text": "Hey There,\n\n     I was wondering if someone had an update regarding the T-Mobile experience with the new Oxygen 4.x.. I am waiting for delivery of the phone and wished I had checked here first before ordering....", "time": "17th January 2017, 08:41 PM", "postID": "post70600082", "replies": [{"text": "I'm on T-Mobile in NY and currently on 4.0 with no issues", "time": "21st January 2017, 01:49 AM", "postID": "post70651170", "replies": []}]}, {"text": "The cellular experience is pretty mediocre on this device.  When comparing other flagships, this device gets up to -12 dBm weaker signal on RSRP for LTE and also has worse SNR ratio thus resulting in slower speeds.  Unless you're right next to a tower with a strong signal, other flagships outclass the OP3T in this area by a noticeable margin.", "time": "22nd January 2017, 05:25 AM", "postID": "post70667843", "replies": []}, {"text": "Using t mobile get great speeds for streaming almost never buffers (unless I've used all my data) downloads are fast and I love the lte aggregation to get faster speeds.", "time": "5th April 2017, 08:06 AM", "postID": "post71733015", "replies": []}, {"text": "I'm in upstate NY on at&t and get alot better reception than my lg g3 did and surprisingly slightly better than my gs7", "time": "9th April 2017, 02:51 PM", "postID": "post71790308", "replies": []}, {"text": "Haven't had any issues here with signal strength. Though often it felt like it would take to long to switch down to 3G when the LTE got weak, resulting in 10 to 20 seconds with no throughput whatsoever. But that seems to be fixed on tge latest firmware. \n\nOtherwise I've been able to get some nice speeds with CA. \nIndoors in my apartment:\nhttp://www.speedtest.net/android/2634362920.png\n(other phones get about the same)", "time": "9th April 2017, 11:51 PM", "postID": "post71796369", "replies": []}, {"text": "one question though, i just had a speedtest between the stock s7 and stock Op3T i was wondering why there's a big discrepancy between the two in terms of download speed where both of them had a full bar of signal. any thoughts about this?", "time": "15th April 2017, 03:39 PM", "postID": "post71872105", "replies": [{"text": "S7 has Cat9 450/50 Mbps and 3CA while OnePlus 3T is having Cat6 300/50 Mbps 2CA", "time": "15th April 2017, 05:51 PM", "postID": "post71873771", "replies": [{"text": "yeah! but should it be op3t should somehow reach atleast 10-15mb rather than 4mb of LTE?  because s7 has an average of 25MB\n\nand btw theyre both on the same ISP and same APN settings", "time": "16th April 2017, 01:46 AM", "postID": "post71878151", "replies": [{"text": "i guess those two might be connecting to different frequency bands during your testing. for me my s7 edge and 3t give almost same speeds around 20mbps when on band 40 ( India )", "time": "16th April 2017, 06:57 AM", "postID": "post71880122", "replies": [{"text": "hmm.. how would i know if my op3t is connecting on the frequency band same as my s7? (excuse me for being a noob )\n\nor do we have to unlock some sort of frequency band to make it the same as the s7 has.", "time": "16th April 2017, 08:18 AM", "postID": "post71880736", "replies": []}]}]}]}]}, {"text": "I get better TMobile signal and speed indoors with the 3t than the opo and le s3 (also band 12)..  So far signal seems better overall than any other device I have had so far.  Liking it.\n\nWNY", "time": "16th April 2017, 01:09 AM", "postID": "post71877961", "replies": []}, {"text": "signal strength is fantastic op3t stays connected to mobile network where no other phone I have owned ever has even when it drops it reconnects without any trouble all by itself.,the lg g5 it replaced needed a restart to reconnect to the network. using ee and three if it matters.", "time": "18th April 2017, 02:56 PM", "postID": "post71913685", "replies": []}, {"text": "Sadly these screenshots sum up my experience.\n\nOnePlus 3T:\nhttps://i.imgur.com/WWJs5gx.png\n\nMoto G4:\nhttps://i.imgur.com/DWymvnF.png\n\nNote that the below tests were done around 4AM, on the same carrier, in the same location, and on the same speedtest server. The fact a $190 phone gets almost 2x the LTE speed compared to the OnePlus 3T really disappoints me, especially as the Moto G4 does not have Carrier Aggregation.", "time": "18th April 2017, 03:11 PM", "postID": "post71913900", "replies": []}, {"text": "i am now getting around 25mb of download speed outdoors (in selected areas only) but still getting 4G instead of 4G+ im using a3010 variant OB5 firmware", "time": "26th April 2017, 06:46 AM", "postID": "post72035185", "replies": []}]}, {"title": "Speakerphone (loudness, clarity)", "rating": 3.5, "links": ["https://forum.xda-developers.com/oneplus-3t/review/speakerphone-loudness-clarity-t3511022", "https://forum.xda-developers.com/oneplus-3t/review/speakerphone-loudness-clarity-t3511022/page2", "https://forum.xda-developers.com/oneplus-3t/review/speakerphone-loudness-clarity-t3511022/page3"], "threads": [{"text": "Average.  I find it lacking in vehicle at speed.  I would think that in the year 2016 (almost 2017) that high volume would be an option on all devices", "time": "2nd December 2016, 04:00 AM", "postID": "post69889461", "replies": []}, {"text": "Same like iPhone , I got iPhone 6s plus and sound the same but one plus 3 you can go further +20 % but it will distort the sound , if you wish to sound like iPhone 6s plus go on oneplus 3t to 80-85% and it will be equal .", "time": "2nd December 2016, 07:34 PM", "postID": "post69900228", "replies": []}, {"text": "Anyone knows how does it compares with LG G5 speaker?\n\nEnviado de meu LG-H850 usando Tapatalk", "time": "3rd December 2016, 12:44 PM", "postID": "post69909111", "replies": []}, {"text": "My speaker can go very very loud. I was surprised since I come from a phone with dual front-facing speakers (MotoG2) and expected the sound on the 3T to be quieter with the bottom facing solo speaker.", "time": "6th December 2016, 11:32 PM", "postID": "post69964158", "replies": []}, {"text": "Anyone used a Oneplus 2 and can compare the speaker with that? I found the speaker on oneplus 2 fairly low. Thanks", "time": "26th December 2016, 12:32 AM", "postID": "post70254896", "replies": []}, {"text": "IMO the oneplus 2 was louder", "time": "30th December 2016, 08:58 PM", "postID": "post70323908", "replies": []}, {"text": "Didn't use the OP2 but I did put the OPO side by side to both the original 3 and the 3T and the 3/3T were appreciably louder and without distortion (the two's speakers were identical).\r\nI cannot possibly imagine wanting it to be any louder than that.\n\r\nClarity and audio fidelity, it's ok, not bad by any stretch of the word but certainly not exceptional.\n\r\nWorks great for hearing it ring and for the notifications and it's perfectly fine for playing games on the phone but it wouldn't be my preferred choice for listening to music.\r\nIMHO the OPO's two speakers worked better for that, even if they were monaural.", "time": "30th December 2016, 09:56 PM", "postID": "post70324596", "replies": []}, {"text": "Sound is louder than on Nexus 6P but is a little bit shallow. Overall not bad at all. I think it is even better than my note 7", "time": "15th January 2017, 06:06 AM", "postID": "post70558848", "replies": []}, {"text": "I have a strong noise at low volume!", "time": "29th January 2017, 08:05 PM", "postID": "post70789648", "replies": []}, {"text": "Im kind of disappointed with the speaker.\n\nNot that i expected much, im just using it to watch videos sometimes.\n\nBut its much worse then the speaker on my OPO, meaning that the OPO was much clearer and sounded more powerful with the same loudness.\n\nIm tweaking the speakers usually with viper", "time": "29th January 2017, 09:45 PM", "postID": "post70790796", "replies": []}, {"text": "I saw video compare speaker a while back on youtube. The result was the G5 / Op3/t/Nexus6P/Htc10 (clear but not loud)/Samsung 7/edge.\nI think it was youtube by Jerome Otega you can check it out.\n\nI have G4 it's quite good sound with loudness and LeEco Pro3 have top and bottom speaker so it's like front facing speaker but volume a little low.\nMaybe you can try app from playstore \"Volume booster GOODDEV\" try tweak 30-40% or 50 if it's not distort. This make my LePro3 louder to my satisfaction.", "time": "30th January 2017, 07:45 AM", "postID": "post70795403", "replies": []}, {"text": "Stock speaker is pretty weak. I compare it to my Sony Z3 wich has stereo speakers. Sonys speakers was pretty good but lacked in loudness. OP3T it is loud enough but quality is very weak in higher volume. I also use Viper to improve quality. With Viper enabled speaker quality is ok.", "time": "1st February 2017, 09:15 AM", "postID": "post70827979", "replies": []}, {"text": "It's loud but still somewhat tinny. However you can fix it by flashing A.R.I.S.E. Deuteronomy with Viper. The file replaces the audio driver with another; even without tinkering in Viper, the speaker gets one notch louder (quite literally one volume click louder) and the overall sound quality becomes fuller. This is what the phone's speaker should have been from the inception, so it's a 4 star for having me tinker around (fine by me but the review is on the stock phone, not after mods).", "time": "5th February 2017, 06:22 PM", "postID": "post70893123", "replies": [{"text": "so, what is the best sound mod for op3t?\n\r\nviper or viper+dolby atmos or any other mod?\n\n---------- Post added at 11:04 PM ---------- Previous post was at 10:58 PM ----------\n\n\n\r\ncould you share that mods links, thanks.", "time": "7th February 2017, 08:04 PM", "postID": "post70925060", "replies": [{"text": "https://forum.xda-developers.com/and...79709/page2115\n\nDownload link for deuteronomy is in the OP\n\n*Obligatory backup first before flashing*", "time": "7th February 2017, 10:49 PM", "postID": "post70926997", "replies": []}]}]}, {"text": "yes I strongly agree with above comment and yes speaker have loud noise", "time": "7th February 2017, 11:25 AM", "postID": "post70917717", "replies": []}, {"text": "I came from Z2 and the quality is same or bit better and the loudness is way better.", "time": "7th February 2017, 08:22 PM", "postID": "post70925388", "replies": []}, {"text": "Loud Noise Problem still with 4.0.3.", "time": "9th February 2017, 04:51 PM", "postID": "post70954652", "replies": []}, {"text": "Compared to my previous device, HTC One m7, the sound from the speaker is terribly bad, maybe louder, but terribly bad.", "time": "9th April 2017, 09:19 AM", "postID": "post71787002", "replies": []}, {"text": "How do I activate the speaker phone on my Oneplus5?", "time": "9th September 2017, 12:59 AM", "postID": "post73721861", "replies": []}, {"text": "I have been having several issues and OnePlus service centre is incompetent.One of the major  one is I can't dial anyone.When I do, there's no noise,not even a dial tone. ALSO people can't call me ....they hear no ring, there's silence!! So thanks to OnePlus I am off all calls! OnePlus has sent me to the service centre several times n each time when I again complain of the same,they ask me to go back to the service centre again as if I have nothing better to do in life!The person following my case keeps pressurising me to go to the service centre again n again n again! Its a new phone and any other company would have changed it without me having to pursue it SO much!!!", "time": "26th September 2017, 04:42 AM", "postID": "post73934458", "replies": []}]}]