[{"title": "Overall love", "rating": 4.5, "links": ["https://forum.xda-developers.com/mate-10/review/overall-love-t3687788", "https://forum.xda-developers.com/mate-10/review/overall-love-t3687788/page2", "https://forum.xda-developers.com/mate-10/review/overall-love-t3687788/page3", "https://forum.xda-developers.com/mate-10/review/overall-love-t3687788/page4"], "threads": [{"text": "Mini review\n\nCamera: poor. Nearly every photo looks like an oil painting\nScreen: lovely\nSpeakers: great but a tad boomy\nBattery: on average I'm getting 6 hours after each charge which is great compared to my 3 on the Nexus 6p\nSpeed: no issues at all\n\n---------- Post added at 09:46 AM ---------- Previous post was at 09:44 AM ----------\n\nForgot to mention that the charging speed is incredibly quick", "time": "23rd December 2017, 07:46 AM", "postID": "post74936316", "replies": []}, {"text": "Camera: love it, in pro mode you can do whatever you want tho, and also shoots in RAW\nScreen: good colors but i hate pentile grid, and usable for vr but 1080p or FHD+ is not enough\nSpeakers: good stereo effect when is on orizontal, but losses fidelity at max volumes\nBattery: very good, similar to my old Mi MIX (4400mah)\nSpeed: Fast AF  for real\nStorage and Memory: not \"PRO\".....   \n6GB ram is good but other flagships have 8GB, \n128GB storage is good too, but again, my old Mi MIX have 256GB.\nDesign: love it\nUSB-C: FULL support, you can plug whatever you want there, docs, hdmi, another phone, pendrives, mini fan, other charger, mouse, keyboard,name it.  ( my Mi MIX dont support hdmi over USB-C for example)", "time": "25th December 2017, 12:14 AM", "postID": "post74952595", "replies": []}, {"text": "Honestly I absolutely love this phone. I've got a Mate 10 pro BLA-L29 international on T-mobile.\n\nPros:\nBattery. Check my post in the battery thread, fantastic. 8.5-9+ hours SOT with light-moderate usage, 6.5+ on the conservative side for heavy usage. \n\nScreen is really pretty. Honestly the 18:9 OLED  1080p screen is super nice regardless of the normal mate 10 having a QHD panel. I'd say it is a very well built screen\n\nQuick. The kirin 970 has been fast and haven't had any glitches or even odd stutters\n\nHaving oreo is great, and MIUI has been pretty swell in my experience. I've seen a lot of hate on it so I was a bit nervous, but honestly it just gives you a lot of different options in the settings I feel like. Personally as someone that likes to tinker with their device but doesnt feel like rooting, I like being able to tweak every aspect of the phone to the extent of the vast number settings.\n\nCons \nReally the only one I can think of currently is software stuff. I hate not being able to expand notifications from the lockscreen and idk why it doesn't let you do that. Idk if it'd an oreo thing or a MIUI thing but I hope it gets fixed in an update because I'd hope that wasn't intentional.\n\nWill add more as I think of them \n\n\nThings I don't have enough credibility to critique :\nCamera. I don't take a ton of photos apart from things like snapchat or the occasional normal photo of my pets, but in my usage the cameras have been great. I'm not going to say I'm am avid photographer though so I won't pretend I know more than I do with how good it is for someone more into professional photography", "time": "28th December 2017, 08:07 AM", "postID": "post74987692", "replies": []}, {"text": "Coming from note 8. Actually usinf both as daily drivers and Huawei really have a loooong way to go\nI am not talking cameras or battery but user experience, smoothness and UI. It's like comparing an iPhone with a 2015 Android phone \nHope this device is getting better with updates", "time": "30th December 2017, 07:01 AM", "postID": "post75010779", "replies": [{"text": "I don't know if it is a fair comparison : Note 8 is a much more expensive phone.", "time": "30th December 2017, 12:58 PM", "postID": "post75013530", "replies": []}, {"text": "I donat know-how you can say that... I hade a note 8 and in my opinion my the mate 10 pro is much better in so manny ways.", "time": "2nd January 2018, 12:59 AM", "postID": "post75042496", "replies": []}]}, {"text": "Best phone ever! (but then again: I say that about every new phone I get )\n\nSkickat från min BLA-L29 via Tapatalk", "time": "2nd January 2018, 03:33 PM", "postID": "post75049276", "replies": []}, {"text": "It is a pretty good phone, overall thumbs up", "time": "2nd January 2018, 06:15 PM", "postID": "post75051185", "replies": []}, {"text": "This phone is fantastic.\n\r\nI have the mate 10 non pro. I'm getting 8-9 hours SOT, very speedy, love the size and feel.\n\r\nit's truly a homerun. Sound out of the 3.5mm headphone jack is GREAT.", "time": "3rd January 2018, 11:53 PM", "postID": "post75067386", "replies": []}, {"text": "I just ordered the 10 (non pro)..  It'll arrive in a couple weeks.  I'm upgrading from my Oneplus One..  I'm so excited..", "time": "7th January 2018, 01:30 PM", "postID": "post75111771", "replies": []}, {"text": "i thought this thread was for mate 10 and not the mate 10 pro?", "time": "8th January 2018, 09:55 PM", "postID": "post75129192", "replies": [{"text": "Its for both mate", "time": "9th January 2018, 08:17 AM", "postID": "post75133144", "replies": []}]}, {"text": "I have had my mate 10 for over a month now and to be honest I think my mate 9 is a better phone, I really don't think the front fingerprint sensor is anywhere near as good as the mate 9 rear one and the phone is just not as smooth to operate with  random delays in apps opening or freezing.", "time": "13th January 2018, 10:31 PM", "postID": "post75188633", "replies": []}, {"text": "Mate 10 pro has the best battery you can get right now in my opinion. The camera can take good photos. It is very fast and has plenty of ram.  On the other hand it has bad video, bad audio and old fashioned ui.", "time": "16th January 2018, 09:08 AM", "postID": "post75217176", "replies": []}, {"text": "Just tried the Emui desktop by connecting my M10PRO to a TV with a USBC-HDMI cable. It works quite well. \nNice to be able to watch Netflix on a hotel room TV directly from the phone. \n\nWill try other out more apps/stuff on the desktop interface to see if it's useful for more than media.", "time": "30th January 2018, 05:19 PM", "postID": "post75386820", "replies": []}, {"text": "I hope that Huawei will develop a system similar or similar to Knox ™ or Secure folder, since the Mate series is a direct competition to the Galaxy Note, which are 100% focused on work and also have a user focus with BYOD", "time": "3rd February 2018, 09:17 PM", "postID": "post75436929", "replies": []}, {"text": "Just got the Mate 10 Pro the day it hit Best Buy, a few day ago. Haven't bothered rooting yet because truthfully it doesn't need it.Im impressed with the overall quality.Extremely fast and stable. High 212k Antutu score. Thumbs up on this one.", "time": "26th February 2018, 06:15 PM", "postID": "post75704723", "replies": []}, {"text": "mate 10 , very good camera , good battery , nice design  , incredible fingerprint , very good price", "time": "27th February 2018, 03:16 PM", "postID": "post75714774", "replies": []}, {"text": "Maybe 10 pro. Love this phone. Too the screen protector off though as it makes it a much nicer experience without it. Can't really fault it. Running pixel 2 launcher and outs great.", "time": "1st March 2018, 01:52 AM", "postID": "post75731254", "replies": []}, {"text": "Agreed", "time": "1st March 2018, 07:06 AM", "postID": "post75733005", "replies": []}, {"text": "Delete pls, wrong thread", "time": "1st March 2018, 04:30 PM", "postID": "post75737708", "replies": []}, {"text": "Got my Pro 10 nearly 2 weeks ago and enjoying it, battery is brilliant especially as have it running BT all day as linked to my Watch 2 - camera is really good and love the fact the emui themes can skin nearly everything.\n\nOnly downside I've seen on the phone is when using 3rd party launchers, you can use the built-in huawei widgets and the fact it rebranded itself as being purchased through 3 mobile when it bought sim-free unlocked. This is like buying an iphone from an operator and it locks to the first sim inserted.\n\nOverall very happy with the phone", "time": "2nd March 2018, 02:22 PM", "postID": "post75747338", "replies": []}, {"text": "Coming from iPhone 6s definitely love my Mate 10 Pro now. Awesome batt life with 7-8 SOT easily and the endless customisation. It is a combination of my mobile, street camera and gopro. All in one body", "time": "5th March 2018, 06:27 AM", "postID": "post75776835", "replies": []}, {"text": "Ok, here i go...\n\r\nI had an S8 (exynos) then a Oneplus 5T (8gb Ram) i sold my OP5T because i needed money....\n\r\nThen i save and got the normal Huawei Mate 10 4Gb RAM ,was an option for the price.\n\r\nPrevious i saw the entire Huawei presentation of the Mate 10 and 10 pro, due to their effort to introduce flagships to America (im from Mexico) and push them with lot of enthusiasm well i'll gavi them a chance...\n\r\nNormal Mate 10 4Gb of RAM single SIM ... (rebranding and make double sim is posible, but this is my stock review)\n\r\nScreen is ok, coming from an S8 nothing is better... is almost as good as the 5t's screen just the oled thing, well no burning screen issues anymore...\n\r\nCamera, ok, it's like an HTC M8 improved, not as good like the S8\n\r\nBattery is so dissapointed, having 4000mah compared to the 5t and s8 looks like 2900 , i want to use 2k screen all time to taste the flagship level of the Mate but it can't handle the battery, it can't last the full day intensive use... the 5t was a dream, smart resolution is \"meh\" its almost 1080 all the time it lowers when battery is low and 2k ativates when content available... yeah \"smart\"....\n\r\nPerformance, i could say is a draw with the S8, but the 5t wipes the floor with the Mate 10\n\r\nUI, coming from an Exynos S8 (almost no bloat) and the 5t.... Emui is a crap UI, just try to drag an icon on the desktop with your finger and move it around, it can't follow your finger, the stock icons are like a kick in the balls... the S8 Touchwiz is miles polished than EMUI.\r\nScreen DPI is another kick in my balls , a hard kick, like a football kick... the best combo is small screen + normal icons, note that the notification icons stay the same huge size... Why you wan't a 6\" screen with gigantic UI .... \n\r\nSound, its ok... better than the S8, not louder as the single speaker of the 5T\n\r\nOverall... i should wait, save money and get an Iphone 8 or a Lava Red OP5T\n\r\nDont get it, i regret my purchase...\r\nEven 3rd party launcher don't run flawless, no double tap to wake the screen or to lock it ...\n\r\nI read the developers post from XDA even unlocking bootloader is a pain in the ass, no official TWRP, yeah there is a way and a few roms , but is not that simple (you will need a windows 7 pc in order to install the drivers)...that's the tip of the iceberg...\n\r\nSorry for my poor english", "time": "9th March 2018, 08:19 PM", "postID": "post75831871", "replies": []}, {"text": "A week with the phone and im very pleased, i had a OP One and a shitty LG G5, there was no single day i was has happy with my lg g5 that with the OP one but now with the mate 10 im happy again and love the phone.\nNo problems with Nova launcher fluid and no battery drain, i manage to get 7 hours on screen with 40 hours on, without battery savings,i had to use 2 battery to reach the same with the LG!\nPhotos are good and the speakers are a lot better than the lg ones the things i miss is the wide angle camera and double tap to wake", "time": "21st March 2018, 10:52 AM", "postID": "post75964652", "replies": []}, {"text": "Battery on pro is amazing but I'm disappointed with fluidity of the system. It's simply below par even compared with 2015.flagships. Cmon Huawei....", "time": "21st March 2018, 01:53 PM", "postID": "post75966348", "replies": []}, {"text": "Best phone ever! (but then again: I say that about every new phone I get", "time": "24th March 2018, 02:59 PM", "postID": "post76001215", "replies": []}, {"text": "If I'd give a valuation  probably I'll  write 8 in 1-10 system. I'm a bit  disappointed in camera.", "time": "29th March 2018, 09:41 AM", "postID": "post76054690", "replies": []}, {"text": "After five years with a Galaxy Note 3, and just unimpressed by any of the current Samsung options, I have taken delivery of a Huawei Mate 10 Pro.\r\nReally like it so far, but of course there are some things I want to tweak. \n\nBig positives:I am already impressed with the battery and the speed of charging it with “supercharge”\nThe screen is very nice\nEverything is very snappy. It's a quick and smooth experience using this phone for anything.\nFingerprint scanner… I always thought this was a bit of an over-the-top inclusion on phones but I love it now that I’ve tried it. And on this phone, recognition is instant. Personally, the back-panel location is also optimal. I have set up both my index fingers and I am already used to using this feature and can't understand how I put up with entering a pattern or PIN for so long.\n\nThings I was worried about that are okay:EMUI seems okay to me, not sure why people hate it.\nBloat and customising and branding from my carrier is really unobtrusive. Kudos to Optus for this, they used to really suck.\nWiFi… I read that some people find wifi lousy on this phone. Totally fine and quick for me, perhaps because my previous phone was so old anything would look better.\nBluetooth audio – seems totally fine. For me, this pretty much just means Spotify. Works fine so far.\n\nWhat I’ve done to get it working and looking the way I want:\nFirst, fixed ads. Man it is incredible how much ads ruin the internet. I don’t know how anyone can stand using a mobile device without ad-blocking. DO THIS. \nhttps://forum.xda-developers.com/mat...-spam-t3740126\r\n nb Spotify and FB Messenger don’t work properly with the hosts file in that thread; I had to grab a different hosts file.\nInstalled an OLD version of ES File Explorer and blocked updating on it. I need to have a useable file system just as a matter of principle.\nInstalled chrome beta and disabled notifications from it, so I stop getting that “close all incognito tabs” notification. No, it’s not porn… incognito’s the only way I know to stop some news sites I read from counting how many articles I’ve viewed that month and then hitting me with a “pay up” overlay.\nChopped up my micro sim card so I could get a mobile connection (thanks for supplying one Optus).\nAfter some playing around with EMUI, I am using Nova Launcher instead. I couldn’t get EMUI to look the way I wanted it to – it’s not so much functionality as being able to customise. I have the desktop grid set to 10x6 and the app draw to 11x7, which for me looks spot on at 500dpi. Using Nova means the EMUI widgets, eg weather widget, don’t work. I am using Chronus for these widgets. I already had the paid versions of both Nova and Chronus.\nSwitch on the navigation dock and hide the navbar\nEnabled developer options and set DPI to 500.\n\n\nSome things to be aware of (culled out of various threads):Huawei uses fairly aggressive battery management which shuts down apps you do in fact want to keep running such as Virtual Hosts (for ad blocking - see above), and anything that runs a widget that should keep updating.\n\r\nTo keep an app running you have to (I think!) change settings in both “Apps” and “special access”, that is:Settings – Apps & Notifications – Apps – [name of the app] – Battery – Launch, then set to “manage manually” and turn on auto launch, secondary launch, and run in background.\nUnder “special access” (no idea how to get there, I just search settings), allow “ignore battery optimisation”.\n\n\nThings I still want to sort out (I will try to edit this post when I find solutions):Media volume through the speakers and headphones is a bit quiet. Bluetooth audio is fine though. Not that critical and for me, a problem with just about every device out there. Time for a Bluetooth headset?\nThe phone comes with Swiftkey installed. I am not sure yet but it feels like swiftkey freezes briefly every now and again. I will play around with keyboards to check.\nMake the change to DPI persistent. Maybe this can be done with ADB? I have not tried yet.\nIt would be great if the fingerprint scanner could be given more uses. For example it would make a great “home” button. It can be made to work by sliding to show the notification panel or to browse photos. That’s cool, probably not what I would have picked for functions though.\nNo sound on some videos through speakers, but sound through headphones. Clearly a software problem.\n\r\nAt this stage I am not rooting. I will at least wait until I’m satisfied I don’t have any hardware issues requiring warranty. It doesn’t look like there is anything I need to root for now though. \n\nOverall:\n\r\nOverall I am really, really happy with this phone. I tried to make myself want a Galaxy S9 or a Note 8, but I just can't take to the look of them. The Mate 10 Pro is very, very close to ticking all my boxes. It doesn't trip any deal-breakers for me and I am really picky about getting things to work the way I'd like them to. I would like to be able to customise a little more and if I could have root and xposed etc without blowing my warranty I would, but there would only be minimal reason to do this.", "time": "30th March 2018, 07:45 PM", "postID": "post76070783", "replies": []}, {"text": "Overall i love my huawei mate 10 pro im very satisfied overall in performance battery life, and so on! After it was announced last year it was love at first sight!", "time": "1st April 2018, 01:11 PM", "postID": "post76087428", "replies": []}, {"text": "Had mine about a month having tried the Note 8, S8+ and iPhone 7 previously.\n\nGood points:\nCamera once you worked out when to activate HDR mode and manual modes at the right times it was very good and I could edit RAW from manual mode to enhance them further.\nI dont take selfies so I dont care about that side but I took a portrait of my eldest son and it worked very well providing great edge detection and a nice bokeh.\nI would say the camera is close to the Note 8 albeit slightly more interesting to use\nBattery life is amazing and it charges really quick on the super charger, the best I have experienced as yet.\nScreen is great and you can always see it in any lighting conditions\nSize and weight is ideal for the screen size, never felt heavy like the Note 8 and easy to hold in one hand\nPerformance was as quick as I would expect although interestingly Nova launcher provided lower benchmark performance compared to the stock home launcher\nI didnt mind EMUI I dont see any problem with it at all\n\nBad PointsBluetooth audio through headphones sounded heavily compressed even at 320k and using USB C cable with wired headphones didnt really improve it.  The S8+ was better but neither come close to the Note 8 or iPhone 7 for headphone audio quality.\nShiny back was a nightmare to keep clean so you really have to use a case all the time which covers up the nice looks\nNotifications on lock screen were random depending on the lock screen type and sometimes when locked you couldnt operate the music player or third party apps like Deezer\n\r\nOverall it is a very interesting phone with lots of great features and if it wasnt for the headphone audio I probably would have kept it, but even my old iPhone 5C sounds better wired or bluethooth.", "time": "3rd April 2018, 01:22 AM", "postID": "post76104025", "replies": []}]}, {"title": "Community development strength", "rating": 1.5, "links": ["https://forum.xda-developers.com/mate-10/review/community-development-strength-t3687789"], "threads": []}, {"title": "Overall speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/mate-10/review/overall-speed-t3687790", "https://forum.xda-developers.com/mate-10/review/overall-speed-t3687790/page2"], "threads": [{"text": "Its fast, but mate 9 pro feels smoother.", "time": "9th December 2017, 04:05 PM", "postID": "post74789020", "replies": []}, {"text": "Is it me or i feel like the mate 8 with custom Rom was a bit faster and less lag than the mate 10 4gb ram ??", "time": "19th January 2018, 02:45 AM", "postID": "post75252142", "replies": [{"text": "Ofc customrom is better when its a slim one. thats one thing you cant compare dude!\n\nMate10pro is faster then my mate 8.", "time": "19th January 2018, 08:17 AM", "postID": "post75254323", "replies": []}]}, {"text": "So Oreo is not the best version for the mate", "time": "19th January 2018, 10:45 AM", "postID": "post75255473", "replies": []}, {"text": "Personalmente es mi primer 4GB RAM y 64GB ROM, realmente lo encuentro muy rápido en todos los aspectos.", "time": "3rd February 2018, 09:18 PM", "postID": "post75436940", "replies": []}, {"text": "Faaassssttt.... High 212k Antutu", "time": "26th February 2018, 06:15 PM", "postID": "post75704727", "replies": []}, {"text": "Always go to developer option and adjust all animation to 0.5x, then comment back here.", "time": "26th February 2018, 08:10 PM", "postID": "post75705992", "replies": []}, {"text": "performance from 6 gb ram is not up to my expectation", "time": "28th February 2018, 04:55 AM", "postID": "post75720950", "replies": []}, {"text": "Lag in games, I already formatted, updated or rebrand: nothing to do.  I'm starting to regret this purchase.", "time": "5th March 2018, 09:58 PM", "postID": "post75785547", "replies": []}, {"text": "Ok. Here is what i noticed so far. Phone was factory and cache reseted with some trash apps removed. Only added nova launcher,  Facebook lite messenger, viber and discord+ few games witch doesnt work in background. Iv been using phone few days. Its BLA-L29 8.0.0.129(C432).  Nova launcher working great, system menu and overall ui working great, apps open fast with no choppy animations, stock gallery micro stuttering when scrolling fulscren photos, market lags alot, few games lag, few works great. Rest of system is working great and battery life is great. If you ask me il rather get 1hr off battery life witch is around 8h sot for little more smooth operation in said apps. Tested all with both resolutions and its the same so it must be some wierd throttling or something.", "time": "19th March 2018, 01:00 AM", "postID": "post75937318", "replies": []}, {"text": "Same here, some parts of UI lagging....maybe updates work things trough", "time": "20th March 2018, 11:22 AM", "postID": "post75953065", "replies": []}, {"text": "I had my mate 10 pro for a month now, lag is very less to nothing, its super snapy, this phone is blazing fast!", "time": "1st April 2018, 01:15 PM", "postID": "post76087445", "replies": []}, {"text": "i notice frame drops while gaming (only play sonic forces though) other than that it is very fast, no real lag. i realise that sometimes animations seem to lag but it is just the animation, the phone itself and the action i am performing is very fast. (unlike samsung where i experienced not only animations lagging but also the apps/actions i was performing were delayed or i needed to hit an icon twice)\n\ni think huawei needs to come up with a brand new UI.\n\nthey have a ton of good features but everything reminds me of older times. also they used to push themself into the markets by copying rivals especially Apple. I think this is what a lot of chinese companies are doing and it is fine but in recent years huawei has become a major player themselves, now they have to prove that they can do it themselves, can do it better", "time": "1st April 2018, 03:38 PM", "postID": "post76088621", "replies": []}, {"text": "I heard it takes week or two for AI to arrange things and it's true. Phone is lot smoother now tho there are areas where it still lags....like default email client when opening new email. But nothing major any more.\n\nI play only some 2D game(Vikings war of clans) and coming from SD821 phone I'm delighted with performance in it(lots of calculations).", "time": "1st April 2018, 04:23 PM", "postID": "post76089046", "replies": []}, {"text": "most annoying thing is hill climb 2 stutter. but i have a feeling that crap drops frames on all phones", "time": "1st April 2018, 07:02 PM", "postID": "post76090544", "replies": []}]}, {"title": "App launch speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/mate-10/review/app-launch-speed-t3687791"], "threads": []}, {"title": "Multitasking/RAM", "rating": 3.5, "links": ["https://forum.xda-developers.com/mate-10/review/multitasking-ram-t3687792", "https://forum.xda-developers.com/mate-10/review/multitasking-ram-t3687792/page2"], "threads": [{"text": "RAM management is a nightmare and much worse than with the Mate 9 where I had zero problems with Adguard and Garmin Connect. With the Mate 10 Pro bot apps are kicked out of memory all the time and make my Fenix 5 pretty much useless, same for my lifetime Adguard license.\n\n1 star only for me.", "time": "22nd December 2017, 03:19 PM", "postID": "post74930139", "replies": [{"text": "with 6 GB of ram the multitasking is so bad still on Mate?  Do you have tried to see if in battery menu there are options for this problem?", "time": "11th January 2018, 04:18 PM", "postID": "post75161886", "replies": []}, {"text": "I just bought 5t and mate 10, it is not Mate 10 problems it is OrEO, on 5t it does the same BS. It's just 5t has 8gb ram and my Mate 10 has only 6gb. I found a way so OrEO will not close app on the back ground, go to settings, battery, launch and turn off all the app you want to run on the background. That is the only way. I bought the 5t because of this app management on the Mate 10, only to found out it is OrEO is the problem. So returning 5t now.", "time": "24th February 2018, 06:31 PM", "postID": "post75681439", "replies": [{"text": "Oreo may have it's own issues but Huawei introduced a new dimension by aggressively keeping their 6GB's as empty as possible. Many apps are flagged, by the Huawei (Emui) memory management, as 'power intensive' and the Chinese phone manufacturers don't like that. Luckily you can do something about it. Under settings -> special access -> ignore battery optimization you can allow apps to be ignored which keeps some of them in memory but others not. Adguard for example is not running nicely anymore and the Adguard devs are trying to solve this for months now. No luck so far.\n\r\nSo this is NOT an android problem but Huawei's. And they should do something about it...", "time": "25th February 2018, 12:25 PM", "postID": "post75688793", "replies": [{"text": "Oh nice to know this, OMG huawei has so much settings in it.", "time": "25th February 2018, 04:34 PM", "postID": "post75691309", "replies": []}]}]}]}, {"text": "No problem here for multitasking.", "time": "12th January 2018, 08:56 AM", "postID": "post75169558", "replies": []}, {"text": "Got a similar issue... after 1 day the ram usage keeps going up (android system) causing the software to stutter when multitasking. No idea why :/", "time": "16th February 2018, 03:28 PM", "postID": "post75590506", "replies": [{"text": "+1 in BLA-L29 c432 with firmware 129 \n\nEnviado desde mi BLA-L29 mediante Tapatalk", "time": "16th February 2018, 09:12 PM", "postID": "post75593835", "replies": [{"text": "Same firmware here.", "time": "16th February 2018, 09:20 PM", "postID": "post75593903", "replies": []}]}]}, {"text": "Looks like I'm affected by the same problem, see my post: https://forum.xda-developers.com/mat...-till-t3754069. Any solution yet?", "time": "23rd February 2018, 07:41 PM", "postID": "post75671341", "replies": []}, {"text": "6 gb ram in mate 10 pro is still not up to my expectation. i think mate 10 pro can't even survive if i use app twin", "time": "28th February 2018, 04:53 AM", "postID": "post75720937", "replies": []}]}, {"title": "Scrolling smoothness", "rating": 4.5, "links": ["https://forum.xda-developers.com/mate-10/review/scrolling-smoothness-t3687793"], "threads": [{"text": "Mate 10 pro is a little choppy while scrolling in certain apps and sites.\nI hope this gets ironed down in future software releases.\nDefinitely I didn't have this problem with mi mix 2 that was silky smooth.\nEmui feels a bit heavy\n\nΣτάλθηκε από το BLA-L29 μου χρησιμοποιώντας Tapatalk", "time": "20th February 2018, 10:57 PM", "postID": "post75640244", "replies": []}, {"text": "Hate it\r\nNote 8 and OnePlus 5 is way, way ,WAY smoother and better user experience", "time": "21st February 2018, 04:26 AM", "postID": "post75642064", "replies": []}, {"text": "Strange, I haven't witnessed any choppiness at all.", "time": "23rd February 2018, 09:37 AM", "postID": "post75665540", "replies": []}, {"text": "Mate 10 (non-pro) smooth as silk. No lag or choppiness at all.", "time": "23rd February 2018, 10:09 PM", "postID": "post75672523", "replies": []}, {"text": "I experience the same choppiness sadly.", "time": "24th February 2018, 08:40 AM", "postID": "post75676037", "replies": []}, {"text": "I just got the phone yesterday, I thought the choppiness was because the phone was installing and going through setup but today it still is choppy in places. \n\nI immediately put it back in the box. The UI is a mess too. I learnt my lesson not to use a device other than a pixel or OnePlus", "time": "24th February 2018, 11:59 PM", "postID": "post75683839", "replies": []}, {"text": "Cant be better. im shocked that people feel chopiness. dont know why. even in real heavy use it was smooth as silk for me.", "time": "08 April 2018, 10:13 AM", "postID": "post76162889", "replies": []}, {"text": "It was choppy and laggy out of the box. Takes a week or two for AI to arrange things, in 90% of scenarios works as smooth as any Pixel then. Sometimes, in cases of weak signal and max screen brightness....cpu governor throttles Kirin in order to reduce battery consumption, then u can encounter some lag and choppyness described at beginning of this post. \n\nThese r my findings after 3 weeks with mate 10 pro.", "time": "08 April 2018, 01:05 PM", "postID": "post76164248", "replies": []}]}, {"title": "Heat", "rating": 4.5, "links": ["https://forum.xda-developers.com/mate-10/review/heat-t3687794"], "threads": [{"text": "It's just slightly warm even when gaming and charging at 30C room temperature.", "time": "1st December 2017, 05:31 PM", "postID": "post74703162", "replies": []}, {"text": "very very cool", "time": "3rd February 2018, 09:19 PM", "postID": "post75436946", "replies": []}, {"text": "I was amazed how this phone handles games and other demanding tasks, It gets hardly any hot. Only long camera shooting warms it up. I'm used to phones that get hot during GPS, LTE connectivity, camera shooting, games ...", "time": "4th February 2018, 10:25 AM", "postID": "post75441852", "replies": []}, {"text": "The OnePlus One my son uses can melt steel...\nI should give him this phone ans stress test it.", "time": "4th February 2018, 04:29 PM", "postID": "post75445493", "replies": []}, {"text": "Though I'm not a crazy gamer, I do have a dig at Kingdom Rush and Defense Zone for extended plays when trying to kill time, and the Mate 10 barely gets luke-warm.\n\r\nCompare this to my recently-retired LG G4 which got quite hot, or my worst (heat-wise) 'phone ever, the HTC One X (that thing felt like it was going to melt just by using Google Maps for a few minutes!).\n\r\nEvidently when it comes to chipsets generating heat, Kirin is better than Qualcom is better than nVidia. Don't know where Mediatek slots into this as I've never played with one for long enough to tell.", "time": "7th February 2018, 11:04 AM", "postID": "post75477038", "replies": []}]}, {"title": "Low light", "rating": 4.0, "links": ["https://forum.xda-developers.com/mate-10/review/low-light-t3687795", "https://forum.xda-developers.com/mate-10/review/low-light-t3687795/page2"], "threads": [{"text": "Indoor Manchester Arndale today, Mate 10 Pro", "time": "16th November 2017, 11:34 PM", "postID": "post74539581", "replies": []}, {"text": "Direct from Camera, Huawei Mate 10 Black", "time": "19th November 2017, 04:06 PM", "postID": "post74567147", "replies": []}, {"text": "Testing night shots", "time": "26th November 2017, 11:33 AM", "postID": "post74641524", "replies": []}, {"text": "Here's one.", "time": "27th November 2017, 03:27 PM", "postID": "post74655832", "replies": []}, {"text": "", "time": "6th December 2017, 05:07 PM", "postID": "post74757188", "replies": []}, {"text": "Augsburg, Germany", "time": "11th December 2017, 12:55 AM", "postID": "post74804451", "replies": []}, {"text": "I am not that pro at making (night) shots, but the mate 10 pro.\r\nI am happy with the results.", "time": "11th December 2017, 09:12 AM", "postID": "post74807525", "replies": []}, {"text": "still weak in low light condition\n\n---------- Post added at 05:00 AM ---------- Previous post was at 04:56 AM ----------\n\nin low light condition, my 2015 s7 edge is even better than my mate 10 pro", "time": "28th February 2018, 05:00 AM", "postID": "post75720954", "replies": [{"text": "My mate 10 is better than my 2017 note 8\r\nYou are looking at the pics on the small screens. That's why more light for u looks better. Zoom in or transfer to computer and check the noise reduction and sharpness... Mate 10 is better", "time": "2nd March 2018, 02:12 PM", "postID": "post75747229", "replies": []}, {"text": "lol it sounds like you are having issues. mate 10 cam is much better than s7 cam, objectively. s7 is nowhere close to mate 10.", "time": "5th March 2018, 02:53 PM", "postID": "post75781103", "replies": []}]}, {"text": "I just started an youtube channel focused on camera test and reviews, and my first upload is a low light test between my 2 phones: Galaxy S9 and Mate 10 Pro. I will sell one of the phones to keep new ones comming for new reviews. So wich one would you choose? (daylight review comming soon)\n\nhttps://www.youtube.com/watch?v=S6QlGoBpCzI&t=16s", "time": "2nd April 2018, 03:24 PM", "postID": "post76098728", "replies": []}]}, {"title": "Photo quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/mate-10/review/photo-quality-t3687796", "https://forum.xda-developers.com/mate-10/review/photo-quality-t3687796/page2", "https://forum.xda-developers.com/mate-10/review/photo-quality-t3687796/page3", "https://forum.xda-developers.com/mate-10/review/photo-quality-t3687796/page12"], "threads": [{"text": "Here are my first batch of photos taken with the Mate 10 Pro.\n\nhttps://jmcomms.com/2017/10/17/huawe...images-part-1/", "time": "18th October 2017, 01:46 AM", "postID": "post74198587", "replies": []}, {"text": "Superb work", "time": "18th October 2017, 03:55 PM", "postID": "post74205977", "replies": []}, {"text": "dayum, it really looks like a step up from the Mate 9. Just read the in-depth DxOMark review, any chance we can see some extreme low light shots that would require flash?", "time": "20th October 2017, 04:23 PM", "postID": "post74231886", "replies": []}, {"text": "Did some comparisons:\nHuawei Mate 10 Pro vs. Mate 9 - https://touchit.sk/fototest-huawei-m...-mate-9/139031\nMate 10 Pro vs. Galaxy Note8 vs. iPhone 8 Plus - https://touchit.sk/fototest-dualnych...-v-noci/138438\n\nSorry it is in Slovak language, but I hope you can get the point from pictures themselves", "time": "24th October 2017, 09:42 PM", "postID": "post74282594", "replies": []}, {"text": "This is great. Which do you think was better", "time": "28th October 2017, 07:30 PM", "postID": "post74328780", "replies": []}, {"text": "Here is another gallery with shots from BMW Welt and BMW Museum - https://photos.app.goo.gl/CClLDNmkeyXnf2a93", "time": "30th October 2017, 11:35 AM", "postID": "post74345417", "replies": []}, {"text": "A Look at Huawei Mate 10's AI-Assisted Low Light Photography\nhttps://fstoppers.com/originals/look...ography-201821", "time": "2nd November 2017, 11:42 AM", "postID": "post74379286", "replies": []}, {"text": "Huawei Mate 10 Pro vs Google Pixel 2 XL https://wylsa.com/google-pixel-2-xl-vs-mate-10/", "time": "11th November 2017, 06:39 PM", "postID": "post74481598", "replies": [{"text": "Mate 10 wins on all pics!? Have I got them the wrong way round? Mate 10 on left?", "time": "12th November 2017, 12:30 PM", "postID": "post74488613", "replies": [{"text": "Yes, you're right -  Mate 10 Pro on the left side.\r\nFor me Mate 10 Pro is better on three photos, except the photo with \"Danger\"", "time": "12th November 2017, 12:37 PM", "postID": "post74488661", "replies": []}]}]}, {"text": "Well got it delivered today (10 Pro) so tested out the camera\n\n\n\n\n\n\n\n\n\n\n\nI was a little surprised to find the RGB camera isn't 12mb like advertised too, it's 11.8", "time": "16th November 2017, 11:00 PM", "postID": "post74539372", "replies": []}, {"text": "", "time": "20th November 2017, 06:19 PM", "postID": "post74579341", "replies": []}, {"text": "Comparison between P10+ & Mate10 at ISO1000. Mate10 noise reduction is too strong until lost of colors & some details has been smoothen. P10+ handle it much better & more natural. Hope Huawei will improve in this area.", "time": "23rd November 2017, 10:09 AM", "postID": "post74608526", "replies": []}, {"text": "I am also dissapointed by mate 10 photo quality. In daylight its worse than my old galaxy s4!\r\nNoise reduction is too strong, sharpening is just way too strong and contrast is too strong. Pictures look completely artificial. \r\nJPG are almost useless on 4K good screen.\r\nOn the other side - raw files are great.", "time": "25th November 2017, 09:20 AM", "postID": "post74629264", "replies": []}, {"text": "My Mate 10 arrived yesterday, sampled out the camera this morning. I'm so impressed with the entire Phone so far, but the camera is really something.\n\r\nThe forum has reduced the quality of these quite a bit.", "time": "25th November 2017, 02:14 PM", "postID": "post74631650", "replies": []}, {"text": "Is possible some of our camera are defective? I haven't been impressed at all with it. Especially in low light the pictures look a bit rubbish. The u11 and original pixel xl looked a lot better", "time": "25th November 2017, 04:06 PM", "postID": "post74632886", "replies": [{"text": "I agree. I've been comparing the Note 8 and M10 Pro... and when i send them to people to tell me what they think, most of them come back to me by telling me the N8 is much better. I am using the Zero camera mod on the N8, and it seems that it really makes the pictures better. Honestly i was expecting much better. \n\r\nDid you try the M10 on \"moving subjects\"? like babies, dogs, cars... for me it just has a hard time focusing. Of course, this on auto mode... on pro, and when you take still pictures it looks really nice. I also realised that the  color isn't very warm, tends to go on the blue cold then warm.", "time": "26th November 2017, 11:50 AM", "postID": "post74641673", "replies": [{"text": "I haven't really taken loads of pics outside mainly low light... But what I have taken is a bit washed out and haven't been impressed.\nI think the hardware is as good as the other flagships and I heard you can get better pictures in pro mode. The software side obviously isn't doing a very good job and needs updating", "time": "26th November 2017, 12:12 PM", "postID": "post74641843", "replies": []}]}]}, {"text": "I think the camera is pretty good. Miles better than the Mate 8 that i had. Can't expect too much from a tiny sensor but it's good enough for web use.", "time": "27th November 2017, 06:14 AM", "postID": "post74650974", "replies": []}, {"text": "I'm also disappointed by the camera quality,to much aggressive noise reduction make the photos like plastic.", "time": "30th November 2017, 03:48 PM", "postID": "post74691161", "replies": [{"text": "Gotta agree, but then again this camera has a lot of potential..\n\nI don't know how to exactly value Mate 10 camera, but in short - it tries to hard to make this perfect clean picture with no noise and in a lot cases overall image quality suffers and it does look artificial/unnatural, but then again it can take you by surprise   and take an insanely great picture.\n\nI am comparing mate 10 camera to my previous phone cameras  which I considered good (iPhone 7 plus,  S6, S7 edge), and I must say I like it more than I dislike it. \n\nLike for example -> my favorite was ip7+. Very constant performance where you get these great looking pictures with this Apple yellowish filter, but it will never surprise - like you have this certain peak and that's it..\n\nNot sure I described my findings accurately but to summarise the idea - Mate 10 is not constant in its performance (its AUTO mode has a lot off issues, which can be related to software being tuned so that all noise is reduced no matter at what cost (over-sharpening, over-exposed, contrast too strong) as IP7+ for example, but then again its best picture that will come out will be much better than the one taken by iPhone 7 plus\n\nI hope I made myself clear and my findings are understood  \n\np.s. like if I would take 10 shots with Ip7+, 8 would come out great, 2 will be material for delete. If I take 10 shots with mate 10, 5 are great, 1-2 are over-the-top great, 3 are trash..\n\np.s.pII. one thing I do dislike is the color temperature regarding skin tones, especially for front/selfie camera. Unless you take a picture in ideal lighting conditions all faces look too pale/white and I would love to have some of that Apple yellowish filter in regard of people faces.", "time": "30th November 2017, 04:40 PM", "postID": "post74691746", "replies": [{"text": "Everything you said is true, hope about a software fix.", "time": "30th November 2017, 07:00 PM", "postID": "post74693092", "replies": []}]}]}, {"text": "I'm loving it so far but worried about how small the images are in size", "time": "1st December 2017, 11:44 AM", "postID": "post74699785", "replies": []}, {"text": "Auto mode is eh, manual and raw editing is fantastic. File size is oddly small when using the 12mp setting, jumps up quite a bit when you switch to 20.", "time": "1st December 2017, 09:11 PM", "postID": "post74705056", "replies": [{"text": "Yes, I've noticed that the 12mp file size is really small too and worried that the JPEG compression setting is set way to high. Nothing much that we can do about it other than to shoot in RAW then do the conversion ourselves.\n\r\nAre there any downsides of shooting with 20mp setting? Has anyone compared the photo quality between 12mp and 20mp? Thanks!", "time": "12th December 2017, 05:09 AM", "postID": "post74817729", "replies": [{"text": "https://photos.app.goo.gl/RBwEBb7EjSeI7uxB3\n\nhttps://photos.app.goo.gl/untoTXTIACBpP2zB2https://photos.app.goo.gl/untoTXTIACBpP2zB2\n\r\nVery quick comparison. First one is 20MP, second is 12MP. Tried not to move between taking them.\n\r\nThe only downside I have found to shooting 20MP colour is the inability to zoom. I've not checked out the photos on my computer but on the phone screen I'm not sure there's a whole lot of difference.", "time": "14th December 2017, 12:11 AM", "postID": "post74839260", "replies": []}]}]}, {"text": "I have M10Pro. Quality in low light is not good. It's oil drawing. Very often when I use B/W photo, picture not sharp. Bad focus. I hadn't these problems with my M9.", "time": "2nd December 2017, 01:08 PM", "postID": "post74710924", "replies": []}, {"text": "Well I'm getting to like it", "time": "3rd December 2017, 11:39 AM", "postID": "post74720881", "replies": []}, {"text": "Some pics I made with the M10pro.\nhttps://imgur.com/a/KksWc", "time": "11th December 2017, 01:07 PM", "postID": "post74809494", "replies": []}, {"text": "use raw and edit later 😂", "time": "29th March 2018, 08:09 AM", "postID": "post76054013", "replies": []}, {"text": "I'm so happy when I take photos in raw but in auto there are problems about colors. It's a nice camera but it has got several limits. The front camera is modest.", "time": "29th March 2018, 09:31 AM", "postID": "post76054620", "replies": []}, {"text": "I just started an youtube channel focused on camera test and reviews, and my first upload is a low light test between my 2 phones: Galaxy S9 and Mate 10 Pro. I will sell one of the phones to keep new ones comming for new reviews. So wich one would you choose? (daylight review comming soon)\n\nhttps://www.youtube.com/watch?v=S6QlGoBpCzI&t=16s", "time": "2nd April 2018, 03:24 PM", "postID": "post76098723", "replies": []}, {"text": "and this is my daylight camera test:\n\nhttps://youtu.be/41guxYgASpY", "time": "3rd April 2018, 11:09 AM", "postID": "post76107746", "replies": []}, {"text": "Heathrow terminal 5. Auto with vivid colours\n\nSkickat från min BLA-L29 via Tapatalk", "time": "3rd April 2018, 06:00 PM", "postID": "post76111818", "replies": []}, {"text": "I really wanna buy this 10pro but i have some concerns about low light performance and 'ai' speed. I have lg g4 and i like this phone camera, that's why i choose 10pro to buy but does it worth to upgrade? And second question : does ai slows the camera? Should i wait for  it to detect the scene or can i take a photo even if it doesn't detect? \nTy in advance and good day", "time": "08 April 2018, 01:07 PM", "postID": "post76164258", "replies": []}, {"text": "The mate 10 pro is my first dual lens phone, and my first with AI, and to be honest I get more bad photos with this than I have my last two phones.\n\nI was expecting this camera to be the absolute best, but it isn't. \n\nSometimes the shots are very good, but fairly regularly outdoor shots get massively underexposed, sometimes making faces undistinguishable. It seems to be worse on sunny / bright days, even when making effort to press the face on screen first to readjust the brightness and being sure to be in the opposite direction to the sun. The faces still come out as dark blobs. \n\nWhen the software gets it right it's good. But there's still a way to go and the camera isn't as awesome as all the reviews would suggest in my experience.", "time": "08 April 2018, 01:57 PM", "postID": "post76164672", "replies": []}]}, {"title": "Video quality", "rating": 3.0, "links": ["https://forum.xda-developers.com/mate-10/review/video-quality-t3687797"], "threads": [{"text": "1080p 60fps looks really bad, not sure why.\n\n1080p 30fps looks better, but sometimes there is blurriness.", "time": "4th December 2017, 04:11 PM", "postID": "post74734237", "replies": []}, {"text": "There's focus hunting in 60fps but if you set to AF-S it's ok. Better to use 30fps for extra stabilization though.", "time": "11th December 2017, 06:44 AM", "postID": "post74806465", "replies": []}, {"text": "Unfortunately video is bad if not awful...\nJust my opinion after two weeks of testing it. \nIt's the first time that i am so disappointed from a flagship.", "time": "16th January 2018, 08:58 AM", "postID": "post75217089", "replies": []}]}, {"title": "Selfie quality", "rating": 3.5, "links": ["https://forum.xda-developers.com/mate-10/review/selfie-quality-t3687798"], "threads": []}, {"title": "Time to take picture (camera launch speed)", "rating": 4.0, "links": ["https://forum.xda-developers.com/mate-10/review/time-to-picture-camera-launch-speed-t3687799"], "threads": [{"text": "Is it fast?", "time": "19th November 2017, 01:10 AM", "postID": "post74560558", "replies": []}, {"text": "There is a hotkey from standby, by pressing volume down button twice fast, the camera launches and takes a shot. By taking a shot it is also written time in which the camera launched and took a shot. For me it had shown 0,8-0,7 sec in this way of shooting.", "time": "23rd November 2017, 01:26 PM", "postID": "post74610122", "replies": []}]}, {"title": "Software (ease of use, features, etc)", "rating": 4.0, "links": ["https://forum.xda-developers.com/mate-10/review/software-ease-features-t3687800"], "threads": []}, {"title": "Charging speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/mate-10/review/charging-speed-t3687801", "https://forum.xda-developers.com/mate-10/review/charging-speed-t3687801/page2"], "threads": [{"text": "This was 24-100% in 70 minutes. If this is not fast i don't know what is.", "time": "27th November 2017, 03:11 PM", "postID": "post74655661", "replies": []}, {"text": "I got 5% to 100% in 1 hour when phone is turned off.", "time": "30th November 2017, 11:01 AM", "postID": "post74688497", "replies": []}, {"text": "Really fast, from 5 to 100% in 1 hour for a battery that lasts 1.5 days with normal usage.", "time": "30th November 2017, 02:41 PM", "postID": "post74690446", "replies": []}, {"text": "0 to 90 in less that 1 Hr and full charge in ~ 70 min", "time": "27th February 2018, 03:19 PM", "postID": "post75714810", "replies": []}, {"text": "my mate 10 pro can last about 8 hours of usage", "time": "28th February 2018, 04:56 AM", "postID": "post75720956", "replies": []}, {"text": "Mate 10 is fastest  charge speed so far I have been use", "time": "28th February 2018, 01:47 PM", "postID": "post75725069", "replies": [{"text": "How fast?", "time": "8th March 2018, 05:47 PM", "postID": "post75818639", "replies": [{"text": "426km/h", "time": "13th March 2018, 07:00 PM", "postID": "post75877698", "replies": [{"text": "Haha", "time": "14th March 2018, 02:01 AM", "postID": "post75881173", "replies": []}]}]}]}, {"text": "that animation is just for startup of supercharge. switch to magazine style unlock and check if there is supercharging text above clock on lockscreen. it usualy charges fast till about 80-90% and then slows. anyway if your phone is charged from 5-100 in about 1hr 20mins its ok. you can always order voltage and current meter for usbc and check.", "time": "3rd April 2018, 05:15 PM", "postID": "post76111325", "replies": [{"text": "i checked the lockscreen as u suggested. If shows just \"charging\" not supercharging like usual.\r\ni havent used any other charger or cable.. should i ignore this or should i take it for service?", "time": "4th April 2018, 08:36 AM", "postID": "post76117989", "replies": []}]}, {"text": "If u charge 0-100% in 80min he could write Santa Clause charging for all I care \n\nBut rarely use Supercharger....i never manage to empty battery before sleeping so I connect it to regular QC3.0 charger which charges slower, 2A tops....", "time": "4th April 2018, 12:56 PM", "postID": "post76120036", "replies": []}]}, {"title": "Screen on time", "rating": 4.5, "links": ["https://forum.xda-developers.com/mate-10/review/screen-time-t3687802", "https://forum.xda-developers.com/mate-10/review/screen-time-t3687802/page2", "https://forum.xda-developers.com/mate-10/review/screen-time-t3687802/page3", "https://forum.xda-developers.com/mate-10/review/screen-time-t3687802/page8"], "threads": [{"text": "Just got mine a couple of days ago and wanted to test the battery out.\n\nI had 100% at 7.36am and then went out. I did some normal chrome browsing during that time. I also did the first big update. The translator one that was about 300meg. I downloaded around 500 songs to Spotify.\n\nI got home around 4pm and this is where I really used it almost non stop until 8.34pm.\n\nI watched some YouTube, a 45 min Netflix episode, a ton of web browsing, checking out all the phone settings, Facebook, and about 90 min of gaming (tower defence, top down 2D scrolling shooters).\n\nI stopped at 8.34pm at 5% left. Phone has been on battery for around 13 hours.\n\nScreen on time during the above time reported at 6 hours and 20 minutes.\n\nI was pleased with that though doesn't hit much of the hype I've read lately.\n\nComing from a Nexus 6P, which my only complaint was battery life (3.5 your SOT on average) I'm happy and really my wish was to have a phone that I could use heavily all day without needing to recharge either at home or out with a power bank.\n\nIt's still early stages and I will keep monitoring.\n\nI forgot to add this was at 1080p resolution.", "time": "3rd November 2017, 03:21 AM", "postID": "post74388242", "replies": []}, {"text": "Sad that Moto Z Play beat this 4000mah on my Mate 10, I did lyft for 8hrs no turning off screen non stop playing Spotify and YouTube red on the background and using lyft app and Google map on the Z play and  after 8hrs I still have 15% left on 40%screen brightness.  The mate 10 only last 6hrs and 10%left.  So lesson is don't buy Z Play then buy another more expensive phone. Bought mine $703 on ebay and I am using AT&T and I get same speed as iPhone 7 plus with regards to data speeds. I have a S8 too which I sold because of screen burn in, but the Mate 10 is a beast. It beats my S8 speed with regard to experience using the phone. And IPS is really the way to go if you use the phone how I use it everyday 8-16hrs of screen on time.", "time": "4th November 2017, 04:29 PM", "postID": "post74404756", "replies": []}, {"text": "So after a few days use and after a 100% charge I get this estimated use. Hmmmn", "time": "5th November 2017, 01:14 PM", "postID": "post74413819", "replies": [{"text": "Were you using the phone heavily during those days?", "time": "6th November 2017, 03:14 AM", "postID": "post74420426", "replies": [{"text": "Yes.\n\nSo far I get an average of 6.5 - 7hrs of SOT with average of 18-22 hours battery. Is that good?", "time": "8th November 2017, 02:13 PM", "postID": "post74447734", "replies": [{"text": "IMO, it's very good considering the screen size \n\nDid you try comparing SOT with QHD vs FHD resolutions? I understand that SOT won't really improve if you go for lower resolution..\n\n\r\nbut its still interesting to see the results. If its like 0.5-1h of SOT to a SOT result which on QHD is 6-7 hours, I would never go for lower resolution..", "time": "8th November 2017, 02:34 PM", "postID": "post74447990", "replies": [{"text": "I didn't try the higher resolution yet as 1080 for me is absolutely fine looking to my eyes. I came from a nexus 6p which was poor on SOT which I attributed to partly to the resolution.\n\r\nStill it will be worth to try it at some point to see the difference.\n\r\nMy worst result with battery was today. 4.5 screen time but I did the most gaming and had hours of messenger chats with a 40 minutes voice chat thrown in.", "time": "8th November 2017, 03:23 PM", "postID": "post74448613", "replies": []}]}]}]}]}, {"text": "i want to share my mate 10 battery with app ( gsam batterry   )\r\ni used whatsapp , instagram , twiteer . youtube , snap chat , phone calls lte , the screen is wqhd 2560x1440 all the time , screen bright is manual on 50 % level brightness \n\r\nthis what i got 13h 49 mint  \n\r\nsee attachment", "time": "10th November 2017, 08:17 PM", "postID": "post74472596", "replies": []}, {"text": "SOT: \n\nNow after 10 days, mine is usually around 5-7 hours, if I just surf internet, Youtube, using FB, IG, RSS reader and camera (usually without flash). I'm mostly on WiFi using also only 1 SIM at a time (the other switched off). \n\nIf using games, this drops to 4-5 hours max. Seems the GPU is burning through battery like butter, the phone is also getting somewhat warmer.", "time": "21st November 2017, 05:50 AM", "postID": "post74584061", "replies": [{"text": "Please can the posters just say if it is the Mate 10 or Mate 10 pro, that they have ? thanks", "time": "22nd November 2017, 01:17 AM", "postID": "post74594058", "replies": []}]}, {"text": "Regular Mate 10", "time": "22nd November 2017, 01:26 AM", "postID": "post74594120", "replies": []}, {"text": "This is what I got so far. \n\r\n8hrs 50mins 23s\n\r\n* Max resolution set - WQHD - disabled Smart resolution toggle\r\n* Social media, surfing, on WIFI like permanently all throughout the day\r\n* Minimal youtube, no gaming (since I'm at work)\r\n* first couple of days I was able to get around 7hrs SoT average\n\nhttps://imgur.com/a/zAXPx\r\n[can't get the image to work - attaching link]", "time": "22nd November 2017, 03:03 AM", "postID": "post74594665", "replies": [{"text": "what update were you on ? 115 gave me a very good battery, but with 119 update i m loosing battery a lot faster ! \n\r\nAlso, i m using only Full HD mode... but now i toggled smart resolution toggle, tho i m not sure how it really works.", "time": "26th November 2017, 06:38 PM", "postID": "post74646023", "replies": []}]}, {"text": "You guys know this is a waste of time without giving which model as the Pro in theory should have a better SOT with lower res and OLED", "time": "22nd November 2017, 01:25 PM", "postID": "post74599087", "replies": []}, {"text": "Mate 10 with AT&T Sim and always on Wi-Fi. This is what I get. Most of the time is on Twitter, Chrome, 30 minutes on sling TV today.", "time": "23rd November 2017, 02:15 AM", "postID": "post74605677", "replies": []}, {"text": "Seriously??? 🤣", "time": "23rd November 2017, 03:01 AM", "postID": "post74605896", "replies": []}, {"text": "Not bad at all, gps on, Bluetooth on for miband 2, mostly wlan connection. Definately more sot than my s7 edge", "time": "23rd November 2017, 09:10 AM", "postID": "post74608098", "replies": []}, {"text": "[QUOTE=Shady282;74646023]what update were you on ? 115 gave me a very good battery, but with 119 update i m loosing battery a lot faster ! \n\r\nAlso, i m using only Full HD mode... but now i toggled smart resolution toggle, tho i m not sure how it really works.[/QUOTE\n\r\n...still on 115.… the smart resolution changes the reso automatically depending on the app requirements (from my understanding) ... haven't received the 119 but will definitely check as soon as I get it.. 😇", "time": "27th November 2017, 08:12 PM", "postID": "post74658845", "replies": []}, {"text": "Mate 10, FHD, Auto Brightness\n\nhttps://imgur.com/a/nPUWx\n\nI'm definitely impressed with this phone's battery life", "time": "4th December 2017, 02:56 AM", "postID": "post74728572", "replies": []}, {"text": "My bad....using the regular Mate 10...\n\nwas able to update to 119 I think a week before... I tested on max resolution with Smart resolution set to ON.  \n\nMy observation:  1 hour SoT every 10% of battery spent\n\n* WIFI switched ON \n* typical usage: facebook (main and 3rd party app - simple for facebook), Instagram, youtube, browsing, downloads via playstore...\n\nI still get an average of 8+ hours of screen on time. Of course less when I play games - average of 4-6hours. Coming from Mate 9, I still find this above average for my usage. I have almost the same SoT average with my Mate 9 - probably just a difference of +45mins on the Mate 9.", "time": "8th December 2017, 04:18 AM", "postID": "post74772952", "replies": [{"text": "I agree with this for the first 20%-30% of battery. After that, I tend to get less than an hour for every 10%. See attached.", "time": "9th December 2017, 10:25 PM", "postID": "post74792395", "replies": []}, {"text": "Do you ever notice the quality drop with Smart resolution on? \n\nI haven't noticed the drop, so either my eyes are terrible or it's not working? Lol", "time": "12th December 2017, 05:23 PM", "postID": "post74824287", "replies": [{"text": "I probably notice it but can't say when I notice it. HAHA! \n\r\nI stopped using the smart resolution mode - left it at WQHD -  I think 2 days ago since there's a very minimal difference in battery consumption with my usual usage. If I just set wifi on permanently until my next charge and regular use (social media, chatting, browsing, a little mix of everything else), I can still get an average of \u009d±8 hours.", "time": "13th December 2017, 05:32 AM", "postID": "post74829659", "replies": []}]}]}, {"text": "I'm getting 4 hours pretty consistently in a day with my battery usually finishing the day with 30%-50% depending on how much music I'm streaming with my Bluetooth headphones. The attached was with about an hour or so of music. I'm not a mobile gamer but take many photos and videos of my little one throughout the day.\r\nI always have Bluetooth, WiFi and NFC enabled too.\n\r\nIf I try to get through a second day without charging I usually will get 6 hours screen on. I can get 8 hours in a day or I'm browsing non-stop though.\n\r\nI will say that battery life has far exceed my expectation especially coming from my LG G6 where I was getting 3.5 hours most days.", "time": "9th December 2017, 10:18 PM", "postID": "post74792345", "replies": [{"text": "I have just looked, and after 4h12m SOT I'm at 62% battery. This Mate 10 Pro is much better than my Xperia Z5, which would have been around 15% by now.", "time": "10th December 2017, 08:22 PM", "postID": "post74802411", "replies": []}]}, {"text": "", "time": "10th December 2017, 07:48 AM", "postID": "post74795496", "replies": []}, {"text": "Mate 10 pro: BLA-L29 8.0.0.115 (C636)\n\r\nThis is the first charge cycle I've had. No SIM card in it currently as I need to switch from Verizon to Tmobile first.\n\r\nMy question with these screenshots is whether or not this is good SOT for the Pro? It is extremely impressive coming from a galaxy s6 edge, but I have definitely seen much higher numbers from power users so I wasn't sure if this was any good. \n\r\nCell standby is by far the biggest drain here, but I don't even have a SIM card in it? Is it normal for this much battery drain due to cell standby when I don't even have service attached to it yet? I lost about 6-7% both nights with WiFi on, no airplane mode, no bluetooth or location. Could this drain be because it is scanning for reception even though there is no SIM, so it keeps trying to poll for service but can't get any? \n\r\nThanks in advance!", "time": "10th December 2017, 09:50 PM", "postID": "post74803199", "replies": []}, {"text": "your mobile signal is bad,  that's why you have a higher drain. the SOT is great given the aforementioned issue.\n\r\nedit: try go to here: settings --> Mobile network --> Advanced  || and disable the \"mobile data always on\" - this setting doens't keep the mobile data on while the phone is on wifi and when it's sleeps.", "time": "12th December 2017, 07:04 AM", "postID": "post74818489", "replies": []}, {"text": "LTE only light usege FB chat some chrome browsing...amazing,coming from Le Pro 3 which also has huge battery but Mate 10 Pro is the best \n\nBla-l29 115(432)", "time": "13th December 2017, 03:39 PM", "postID": "post74834869", "replies": []}, {"text": "I am really confused how SOT is an indication of good or bad battery. I can get a 8-9h SOT if I use my phone all day with light use (using the photo gallery as material for my work) or have only 2h SOT in the weekend because I d'ont use it at all and it shuts down 40h after charge.\n\r\nOne thing I noticed is that even after some calibration (doing 100->5% and full charge several time in a row) the phone show 100% for a very long time even when using it, and it's really slow to reach 90%. Then it's quicker with  a 2%/hour until 15% then the fall is really quick. It's really observable when I do not use it at all. I'll try to do a screenshot next time.", "time": "22nd February 2018, 05:00 PM", "postID": "post75658850", "replies": [{"text": "that's normal. OEMs tend to do it to prevent users to charge it to often when it just lost some percents, charging is not so healthy when the battery is full or almost full, same as emtying it completely.", "time": "22nd February 2018, 07:28 PM", "postID": "post75660286", "replies": []}]}, {"text": "Ok, so, give them false information rather than knowledge... it's like a highway to idiocracy.\n\nHere are a screen for a light usage (I forgot to screen the app usage, somewhat like 39% idle, 15% screen,10% other, 35% app). See the selected hour (it's the same for the rest of the graph), no app usage, but stil something like -2%/hour (calculated with the period from 50% to 11%) with screen off the most part on the time. Is it ok given the wifi, bluetooth always on, some background app like weatherbug and outlook, or you guys have something really better and I should try a factory reset?", "time": "23rd February 2018, 08:19 AM", "postID": "post75664980", "replies": []}, {"text": "Hi, I resolved my battery drain mainly by cutting off the google service in background. Even if it actually works in background...\nWell, with a proper management of the app authorizations, I get something like that:\n\n\n\nWithout taking care of saving battery, so, all connectivity on except for NFC I never use.\nPretty good battery life!\n\nI have something like 9h OST when I do not play game and just read comics over the day 😁", "time": "08 April 2018, 01:54 PM", "postID": "post76164657", "replies": []}]}, {"title": "Standby drain", "rating": 4.5, "links": ["https://forum.xda-developers.com/mate-10/review/standby-drain-t3687803", "https://forum.xda-developers.com/mate-10/review/standby-drain-t3687803/page2", "https://forum.xda-developers.com/mate-10/review/standby-drain-t3687803/page3", "https://forum.xda-developers.com/mate-10/review/standby-drain-t3687803/page8"], "threads": [{"text": "the best that I got with the mate 10 pro EU was 1% lost in 9h15m. this was a couple of days ago. I will try to recreate the scenario and I will post a screenshot.", "time": "12th December 2017, 07:02 AM", "postID": "post74818465", "replies": [{"text": "can you explain how\n\n---------- Post added at 12:08 PM ---------- Previous post was at 12:08 PM ----------\n\n\n\r\nBLA-29 or 09?", "time": "19th December 2017, 01:08 AM", "postID": "post74891587", "replies": []}]}, {"text": "4-5% for me here 8hours standby.", "time": "13th December 2017, 09:11 AM", "postID": "post74831216", "replies": [{"text": "Same here", "time": "13th December 2017, 10:34 AM", "postID": "post74831872", "replies": []}]}, {"text": "Flightmode? Wifi on? GPS on? Charge-Level of the Battery?\n\r\nMine loses 5-7% in 8h in Flightmode, without Wifi and GPS on when in the 70% Level. Maybe it would lose only 1% when fully charged because the battery gauge stays at 100% for the first few % of drain (~ 100mv on mine).", "time": "14th December 2017, 03:44 PM", "postID": "post74846067", "replies": [{"text": "2% in airplane mode without Wifi and gps\n4-5 % in ultra battery saving", "time": "14th December 2017, 03:51 PM", "postID": "post74846147", "replies": []}]}, {"text": "8 hrs ~2-3%\n\nOn: GPS, WIFI (+connected), BT, Sync, Eye comfort, DND\nConstantly running: Plus Messenger, WhatsApp, Nine (email), Aquamail (email), 3G watchdog, Discord, n26 (banking), sleep as android [no sleep tracking]", "time": "15th December 2017, 01:57 PM", "postID": "post74855738", "replies": []}, {"text": "0% Loss this Night...  Charged to 50%.", "time": "15th December 2017, 06:17 PM", "postID": "post74858173", "replies": [{"text": "Tonight 1% loss in airplane mode. This phone is insane 🤗", "time": "16th December 2017, 07:20 AM", "postID": "post74862898", "replies": []}]}, {"text": "10% drain last night for my mate 10. Definitely not right.", "time": "16th December 2017, 12:38 PM", "postID": "post74865039", "replies": []}, {"text": "Can everyone here note whether or not they've rooted their phones or not. I'm trying to determine whether the AI is assisting people with their amazing standby times/battery life because when you root, supposedly the AI doesn't work properly any longer", "time": "20th December 2017, 05:55 AM", "postID": "post74904220", "replies": []}, {"text": "I'm rootless. Phone is sleeping better than me.", "time": "20th December 2017, 07:49 AM", "postID": "post74904990", "replies": []}, {"text": "Mate 10 PRO\n\r\n I have lost ~0.4%/h with dual sim cards from the same carrier.\r\n Official rom, no root\r\n WIFI ON, MOBILE DATA ON, LOCATION ON (high accuracy), LOCATION HISTORY ON. all apps in the background were closed/cleared.\n\r\n It was 95% after 11 hours, the screenshot shows 94% because I have forgot to take the screenshot and I have used a bit the phone.", "time": "21st December 2017, 08:11 AM", "postID": "post74915820", "replies": [{"text": "Yes that's really impressive and similar to what I'm getting. What other users have reported (and also in my experience) is that the battery meter takes a much longer time to drop from 100% to 95% compared to maybe 80% to 75%. You can try repeating your experiment above but start when the phone is 80% or 70% and see if you still get the same rate of discharge. I'm curious to know your experience. Cheers!", "time": "21st December 2017, 09:08 AM", "postID": "post74916250", "replies": [{"text": "I will try that also but next experiment is to activate the data saver from: settings --> Wireless & Networks --> Mobile data --> Data Saver change from OFF to ON.. I want to see if this helps a bit...\n\nedit: to see if it helps even if the WIFI is always ON", "time": "21st December 2017, 10:03 AM", "postID": "post74916634", "replies": []}]}]}, {"text": "Guys, give the phone some time to improve performance and reduce battery drain. \n\nThe NPU runs when the phone is in standby so, on the first days it's normal if the battery drains faster. If you are changing phone settings all the time, the NPU unit will try to optimize it again.\n\nAlso, the latest firmware from HUAWEI improved a lot the battery.", "time": "21st December 2017, 11:06 AM", "postID": "post74917114", "replies": []}, {"text": "Mine lost 1% last night. All on as usual. I guess if you remember to closely all apps that help... \n\nSkickat från min BLA-L29 via Tapatalk", "time": "28th December 2017, 08:09 AM", "postID": "post74987707", "replies": []}, {"text": "Full charge last night. Turn-on ultra power save. Woke up with 85%..somethings definitely not right.", "time": "28th December 2017, 11:26 PM", "postID": "post74996416", "replies": [{"text": "What is your phone model,  brand and software version? After updating to the latest firmware I recommend that you do a factory reset and install all the apps manually (do not restore backups).", "time": "29th December 2017, 06:51 AM", "postID": "post74999017", "replies": []}]}, {"text": "For the best standby drain disable Google services. With Google services enabled I get 1-1.5%/hour, but when disabled it drops to 0.3%/hour or better.", "time": "1st January 2018, 04:37 AM", "postID": "post75032948", "replies": []}, {"text": "Actually while sleep the battery almost stay the same", "time": "1st January 2018, 09:20 PM", "postID": "post75040948", "replies": [{"text": "But did your battery start sleeping at 100% or at a lower percentage, for e.g. 80%? I find that during sleep when the battery is fully charged at 100%, after a night's sleep, the battery hardly changes. but i lose about 5% over 8 hours if the battery is not full. Wifi on, mobile network connected (not on airplane mode), location high accuracy, wifi scanning on, location history on. BLA-L29 8.0.0.118 (C636)", "time": "2nd January 2018, 01:40 AM", "postID": "post75042737", "replies": [{"text": "I never tried if the battery is not fully charged honestly", "time": "3rd January 2018, 08:18 PM", "postID": "post75065520", "replies": []}]}]}, {"text": "10-15% drain during night (8 hours of sleep from 95% to 80% in the morning, something is not right!!", "time": "3rd January 2018, 06:29 AM", "postID": "post75057007", "replies": [{"text": "I experience the same thing, I'm not sure is it because of the new update I seems to discover my phone are using more battery than usual. I then charged my phone to 100% and went to sleep with:\r\nWiFi on, mobile data on, location off, nfc off, bt off, and after I woke up the battery has been drained to 7x%!!\r\nCurrent version: BLA-L29 8.0.0.126 (C636)", "time": "10th January 2018, 12:17 AM", "postID": "post75142582", "replies": []}]}, {"text": "For me phone are using more battery after updates than before. I will think about factory reset.", "time": "10th January 2018, 07:14 AM", "postID": "post75145009", "replies": []}, {"text": "Tonight i woke up and it used 10%. Yesterday it was 3%.i trust this dude who says my phone needs some time because of ki.\n\nSo i will give my phone 2 weeks \nBc even 10% in the night is okey cause this beauty has fastcharge x3", "time": "18th January 2018, 05:27 AM", "postID": "post75240457", "replies": []}, {"text": "dont know if you will believe me, but my battery didnt go down at all in 5hrs sleep. but then again i disabled or uninstalled few apps and services from system that i dont need\nlike health app, play music, tallback, weather app main+its widget and service(i use nova launcher so its no use for me), drive, duo, default email(i use gmail app), all facebook related stuff and helpers(for me its more convinient to just make facebook shortcut to desktop in chrome), google app(i hate that crap). my ui background is left white. network, gps and wifi and sync are on all the time.", "time": "26th March 2018, 12:00 PM", "postID": "post76021372", "replies": []}, {"text": "Version B137 on C432 (BLA-L29) sucks. \r\nBefore, I had 0-1% drain, over night, now 4-5 %. Battery is going down quickly during usage very fast.", "time": "31st March 2018, 10:42 AM", "postID": "post76076029", "replies": []}, {"text": "Hello, I ordered this phone to replace my Note 4 and while it's being shipped I started reading this forum. Some of the stand-by drains sound very bad. My note 4 can go 10 hours and only lose 0-1%. Have people tried apps like \"forcedoze\" to force the phone to properly sleep when not used?", "time": "1st April 2018, 12:15 PM", "postID": "post76086935", "replies": []}, {"text": "Down to an average 0.6%/h with some authorization management.\n\n\n\r\nSo if it's at 100% with the fake sensor it still stay at 100%over night. But it's more like a real 1 to 2% for a 8h night.\r\nIt has a 93% of deep sleep when screen off. Good for me.", "time": "08 April 2018, 02:11 PM", "postID": "post76164794", "replies": []}]}, {"title": "Heavy use endurance", "rating": 3.0, "links": ["https://forum.xda-developers.com/mate-10/review/heavy-endurance-t3687804"], "threads": [{"text": "Heavy bussines use... Social Networks, Streaming, GPS, Wifi and Bluetooth on all day... first two or three days almos 10 hours... just to get to the and fo working days... I was a litlle dissapointet... (Mate 9 Pro  last me about 15 hours aprox or more).... But after a week it can give me about 14-15 hours asswell.... Maybe AI????", "time": "6th December 2017, 02:17 PM", "postID": "post74755401", "replies": [{"text": "To be honest, Mate 10 Pro is the best phone I've had by far and the proof is that I charge it once a day with heavy usage and it lasts for the whole day, not to mention it's all done while using 4G and no Wi-Fi usage!", "time": "18th January 2018, 05:44 PM", "postID": "post75247752", "replies": []}]}, {"text": "My mate 10 wifi/4g/gps on... Heavy use 2 days... Don't need  to use my laptop anymore. Great phone 📱", "time": "18th January 2018, 08:11 PM", "postID": "post75249444", "replies": []}, {"text": "i was on journey with gps on and wifi on, screen hardly went off. phone survived for just 7 to 8 hours. till it went from 100% to 7%. note that power saving was disabled. It was the heaviest power consumption i did. other wise my phone survives for 24 hours easily in daily use.", "time": "08 April 2018, 09:52 AM", "postID": "post76162744", "replies": []}]}, {"title": "Light use endurance", "rating": 4.0, "links": ["https://forum.xda-developers.com/mate-10/review/light-endurance-t3687805"], "threads": [{"text": "easily exceeds 24 hours on light use. even when using wifi here and there. and a bit of games.", "time": "08 April 2018, 10:05 AM", "postID": "post76162837", "replies": []}]}, {"title": "\"Look\" of the device (aesthetics)", "rating": 5.0, "links": ["https://forum.xda-developers.com/mate-10/review/look-device-aesthetics-t3687806", "https://forum.xda-developers.com/mate-10/review/look-device-aesthetics-t3687806/page2"], "threads": [{"text": "Looks best in black IMO.", "time": "27th November 2017, 03:42 PM", "postID": "post74655972", "replies": []}, {"text": "most elegant in black. professional and sexy !", "time": "27th November 2017, 06:17 PM", "postID": "post74657662", "replies": []}, {"text": "Mocha Brown is classy especially if you go with the glitter themed icons and the chess wallpaper.", "time": "30th November 2017, 10:48 AM", "postID": "post74688391", "replies": []}, {"text": "Really beautiful phone. Made me jump to Android. The stripe is a really nice looking thing.\r\nHowever I would have loved a moca version with front black, I had to take the black one, that is great, for this reason.", "time": "31st January 2018, 09:04 AM", "postID": "post75394083", "replies": []}, {"text": "i personally feels that oneplus 2 is better", "time": "28th February 2018, 04:57 AM", "postID": "post75720960", "replies": []}, {"text": "Do you guys use a case? Isn't it defeating the purpose of the design? And yet it is so fragile..", "time": "5th March 2018, 06:32 AM", "postID": "post75776867", "replies": [{"text": "I really don't like to use a case on my phones and never had before, because part of the price is the aesthetic design.\r\nThe mate 10 is really beautiful, but doesn't feel good in the hand because of the glass material. It's slipery, a fingerprint trap, sweating, did I say really slipery? A 10%angle in hand and it slide slowly!\r\nDue to this, I use case, really thin case, not to protect but to have a better feel in hand, without give up the look too much.\r\nI can recommend the Cafele ultra thin PP case (the 0.4mm one) or the cafele hard PC case (bulkier but better looking camera edge). The 0.6 thin PP one is not really good looking.\n\r\nIt's a shame that this eye candy phone is so nice only when you don't touch it.", "time": "5th March 2018, 09:47 AM", "postID": "post75778352", "replies": [{"text": "Oh I'm using Cafele ultra think 0.4mm. it feels naked and nice in hand. But it's a shame that it covers the beautiful design. Nonetheless it does give me greater peace of mind.", "time": "5th March 2018, 11:57 AM", "postID": "post75779361", "replies": []}]}, {"text": "I'm using a skin from dbrand.com on mine, it makes the phone less slippery!", "time": "5th March 2018, 10:17 AM", "postID": "post75778583", "replies": []}]}, {"text": "What I like about the case more than just protecting the beauty underneath is the fact that it's hiding it and after a few months or a year I'm going to take it of and everyone is going to think I have a new phone looking so sexy and more powerful.", "time": "5th March 2018, 12:27 PM", "postID": "post75779634", "replies": []}]}, {"title": "Quality feel (use of materials)", "rating": 4.0, "links": ["https://forum.xda-developers.com/mate-10/review/quality-feel-materials-t3687807"], "threads": [{"text": "Glass feels premium but fragile, slippery, fingerprint magnet and bad conductor of heat compared to metal. Well, people will use a case anyway.", "time": "27th November 2017, 03:45 PM", "postID": "post74655999", "replies": []}, {"text": "Feels premium, i love the design, very chic and elegant. the black color is really nice fits well.\nYes, the glass is fingerprint magnet.. but anyways i use a case. but sometimes i use it without case just to feel it. the finger print and low bezels is really the best in the market... because it is really small bezel and u dn't need a navigation bar to take part of the screen. so comparing it to other devices it was better. so far didn't notice defects.", "time": "27th November 2017, 06:13 PM", "postID": "post74657613", "replies": []}, {"text": "Overall it looks great but the paint used on the metal sides isn't great quality. I've NEVER used the phone without the provided case. I took it out to have a look at it for the first time in ages the other day and noticed the phone has scratches all the way down the sides. My assumption is that this is from dust in my pocket getting between the best and the metal frame. First time I've seen this with a phone though.", "time": "21st January 2018, 09:49 PM", "postID": "post75286381", "replies": []}, {"text": "almost scratch free. really slippery without case. I use a soft leather case to maintain grip. or it would keep on falling", "time": "08 April 2018, 10:10 AM", "postID": "post76162869", "replies": []}]}, {"title": "Ergonomics (in-hand feel)", "rating": 4.5, "links": ["https://forum.xda-developers.com/mate-10/review/ergonomics-hand-feel-t3687808"], "threads": [{"text": "Definitely much better handling due to the minimal bezel. It's almost 1 cm shorter than my previous Mate 8!", "time": "27th November 2017, 03:47 PM", "postID": "post74656023", "replies": []}, {"text": "My hands are small and i was afraid of big phones... but this one is really good in hand and handling it.", "time": "27th November 2017, 06:16 PM", "postID": "post74657647", "replies": []}, {"text": "Has good weight distribution at the bottom so that it will not tip over when used with one hand.", "time": "30th November 2017, 10:56 AM", "postID": "post74688462", "replies": []}, {"text": "The glass back make my hand sweat and is a fingerprint trap. The phone is really slippery, I'll have to use a case even if I do not like to do that.\r\nI have big hand and I find it harder to use the mate 10 pro with one hand than a classic 5.7\" at the 16:9 ratio, because for the same surface (or mostly) the top of the screen is more distant (+1cm) from the bottom that sit in my palm (with big hand the width is not so important). I would have taken the mate 10 non-pro if it had the amoled screen for this screen ratio reason.\r\nBut well, it looks good.\r\nHeating, well, non-heating, is good so far after hours of game.\r\nButtons are well placed.", "time": "31st January 2018, 08:57 AM", "postID": "post75394015", "replies": []}]}, {"title": "OEM skin/software", "rating": 3.5, "links": ["https://forum.xda-developers.com/mate-10/review/oem-skin-software-t3687809"], "threads": [{"text": "The extra features are great. But the looks, could be better. Fix the notifications DPI please!", "time": "27th November 2017, 03:49 PM", "postID": "post74656051", "replies": []}, {"text": "It is nice ! but yes the notification DPI needs really to be decreased ! it is so big.", "time": "27th November 2017, 06:15 PM", "postID": "post74657636", "replies": []}, {"text": "Nice display but yes, notification DPI neeeeeeds to be decreased. My grandma could read my notifications without her glasses on. Texts are so big and inconsistent across apps and notifications.  Also decrease lockscreen DPI spotify next button overlaps with album artwork.", "time": "11th December 2017, 10:13 AM", "postID": "post74807985", "replies": [{"text": "On my C432 (Europe) Mate 10 Pro, B127A update corrects this annoying bug i had since B115.", "time": "20th December 2017, 09:12 AM", "postID": "post74905585", "replies": [{"text": "My mate 10 is still stuck at 119. Lol.", "time": "20th December 2017, 09:23 AM", "postID": "post74905676", "replies": []}]}]}, {"text": "I actually like EMUI. Skins are something I love about Android and I enjoy seeing each manufacturer's take on how things should be.\n\nEMUI is much, much better than LG's and HTC's skin. Especially HTC. Their skin has barely changed since the one series.", "time": "14th December 2017, 12:23 AM", "postID": "post74839321", "replies": []}]}, {"title": "Outdoor visibility (max brightness)", "rating": 4.5, "links": ["https://forum.xda-developers.com/mate-10/review/outdoor-visibility-max-brightness-t3687810"], "threads": [{"text": "should have an option for 2k display", "time": "28th February 2018, 04:57 AM", "postID": "post75720961", "replies": []}, {"text": "now that its becoming spring in europe i realise this display does not get very bright", "time": "29th March 2018, 01:20 PM", "postID": "post76056479", "replies": [{"text": "I live in Gran Canaria(which is a sunny place next to the Sahara desert) and I can see my Mate 10 (non-pro) very good, I see it better than I saw my old P9 and better than I see my girlfriends Galaxy S8 in full sunlight.", "time": "30th March 2018, 11:31 AM", "postID": "post76066183", "replies": []}]}]}, {"title": "Contrast (true blacks)", "rating": 4.5, "links": ["https://forum.xda-developers.com/mate-10/review/contrast-true-blacks-t3687811"], "threads": [{"text": "It's great for an LCD but obviously can't beat OLED's black.", "time": "1st December 2017, 05:32 PM", "postID": "post74703173", "replies": []}]}, {"title": "Color saturation & accuracy", "rating": 3.5, "links": ["https://forum.xda-developers.com/mate-10/review/color-saturation-accuracy-t3687812", "https://forum.xda-developers.com/mate-10/review/color-saturation-accuracy-t3687812/page2"], "threads": [{"text": "Coming from iPhone 7+, it's inferior. Does not support wide colour gamut DCI-P3.", "time": "3rd December 2017, 03:30 AM", "postID": "post74717670", "replies": []}, {"text": "I have 3 phones right now. An S7 edge as my daily driver. A P10 plus, and the mate 10 pro.\n\r\nThe P10 has a somewhat inferior display than the other two, but it can reach very high brightness and color saturation levels (but not so accurate colors...). The mate 10 pro produces dimmer image even at max brightness, and struggles to generate a well saturated image. At least it has a kind of better color accuracy than the p10 in my opinion. Sharpness is not a problem. Overall: It is good enough.\r\nSadly, I can't say it has any better display, or near as good as the s7. S7 edge still a strong performer when it comes to display quality. (brightness and colors)", "time": "4th December 2017, 05:50 AM", "postID": "post74729419", "replies": []}, {"text": "Perfectly happy with the brightness on my Mate 10 because i haven't come across need to use max brightness in real usage and the auto brightness works fine (with minor instances of getting auto dimmed more than required). However need to note that a when viewing the display at angle it gets dimmer.  \n\r\nNothing to complain about regards to visibility under sunlight as well. In my view what matters at the end is if the user has a problem with brightness with respect to the persons real life usage rather than comparison with others phones.\n\r\nIn terms of color saturation, one should know even before buying the Mate 10 that the IPS display don't compare with oled on saturation. I put my Mate 10 in vivid mode and im happy with it, even when using side by side by older generation oled screen P9 plus. I also had hands on side by side with the Mate 10 pro at the store and obviously Mate 10 pro oled is more saturated but i was not in any sense been blown away by it or wanting it. Likely that the QHD display + big screen of Mate 10 has spoilt me that im feeling the Mate 10 pro display to be washed out, yellowish and less immersive. But then it would be the same case that when using the Mate 10 pro as stand alone for some time you adapt and don't find those issues a problem anymore.", "time": "4th December 2017, 11:44 AM", "postID": "post74731718", "replies": [{"text": "Yeah, you are right. I am mostly okay with the mate 10 pro. Overall I am very impressed with the quality of the product.", "time": "4th December 2017, 07:53 PM", "postID": "post74736490", "replies": [{"text": "One little flaw to mention. I have some clouding. At moderate to low brightness level, grey color is the worst. (screen shot was taken by another phone, so in real life it isn't that bad)\r\nThe problem is less prominent at higher brightness levels.\r\nAnyone else have the same issue?", "time": "9th December 2017, 03:30 PM", "postID": "post74788620", "replies": []}, {"text": "hello to all..meme probe on my mate 10 pro (FRANCE) .. clouding on background ..gris .. blue and other  I do not know what to do\n\n---------- Post added at 02:11 AM ---------- Previous post was at 02:03 AM ----------\n\n\n\n\r\n343/5000\r\nhow do you go?,? .. if you only use the mate 10 pro for some time you forget these probemes ... it means that we have to forget that the mate 10 pro has serious worries and that we must not regret our purchase .... would you buy a new car with scratches on the bodywork ... too strong .... or I did not understand your answer\n\n---------- Post added at 01:19 AM ---------- Previous post was at 01:11 AM ----------\n\n\n\r\nyes same problem on mate 10 pro FRANCE ... REGRETE ALMOST MY PURCHASE", "time": "11th December 2017, 12:19 AM", "postID": "post74804137", "replies": [{"text": "The lack of really vivid colors, and the somewhat dimmer display is not that big problem. You can get used to it.\r\nThe clouding is a bigger issue, but it is almost invisible on medium to high brightness levels on my unit. It looks this bad only on low/the lowest brightness levels. (I rarely use it on min setting.) Samsung phones have better displays, I am sure, but I can live with this. (usually by manually set a bit higher brightness level) But it is my opinion.", "time": "11th December 2017, 08:35 AM", "postID": "post74807253", "replies": []}]}]}]}, {"text": "I've got the same green tint on lower brightness (30% and lower)\nDid any of you guys exchange it and got a better screen with no green tint on grey screens?", "time": "15th January 2018, 02:53 PM", "postID": "post75207645", "replies": []}, {"text": "No issues at all with my Mate 10 Pro. I just love it! No clouding! Colors are real lifelike. Don't like Samsungs candy displays", "time": "15th January 2018, 11:52 PM", "postID": "post75213421", "replies": []}, {"text": "I got my replacement device today and it also had that clouding issue! Really pisses me off because one of my main use cases on my mobile devices is reading pocket articles in dark mode. This is where I could see the yellow clouding very clearly. The replacement also had a defective fingerprint scanner (did not work at all not even during setup).\n\nNow I'm waiting for my third device, if that one still has clouding (even if it is slightly) then I'm going to switch to the XL2. At least it doesn't have clouding. \n\nThis is meant to be huaweis high end device, such issues are nogos for me. Even my much cheaper but beloved Moto Z Play doesn't have this issue.", "time": "6th February 2018, 01:02 PM", "postID": "post75466295", "replies": []}, {"text": "I don't understand why people are looking for flaws. I understand that you don't wanna pay so much money and then have any but imo it's something that's there but that I won't notice. What I don't notice is close to non existent to me.\n\nI had a S8+ before and had it for a week still after I bought the Huawei mate 10 pro. Since I am curious I kept testing the screen by watching the same videos on max brightness etc.\n\nYes the Samsung is slightly better especially red and blue (funnily I think the greens are more vibrant on the Huawei) and it gets brighter but for me it wasn't a big surprise.\n\nThe phone gets a dark black and decent grey when in normal usage on normal brightness. I don't notice my screen being washed out unless I look for it (manually turn brightness down and open chrome). \n\nI never tumbled across this in normal usage so I don't give a f. \nIf you only use it phone in the dark on low brightness... Well then you should maybe consider selling it.", "time": "7th February 2018, 07:45 AM", "postID": "post75475453", "replies": [{"text": "Im also not searching for flaws that don't affect me. But the low brightness thing does affect me in a major way as Pocket in dark mode looks totally ****ed up. Huge yellowish tint. \n\nAnd I'm using pocket daily. Also this kind of clouding is not acceptable, if much cheaper devices manage to provide better displays. It's a matter of quality control which Huawei can change in an instance if they want to.\n\nIf the third device has the same issue I'm going to sell it or exchange.", "time": "7th February 2018, 12:02 PM", "postID": "post75477611", "replies": []}]}, {"text": "just checked my mate 10 pro for this issues since im very alergic to this kind of issues...and must say that i have none of them.. I ran color display app and display is perfect in every brightnes and color..back when i had galaxy s7 i remember that it had those gray stripes(lines) when u put brightnes to low value but on high values it cant be seen anymore...so i think those clouding issues are real and device should be sent back to waranty...let me tell u something i had 4 different xperia flagships and all of them got a white dots or anomalies after one year of usage (bad display construction?) so i always claimed waranty for that....since i pay 700*eur for a top end device it has to work like one and as long it has waranty ill claim it as mutch as i can.dont be fooled by todays manufacturer cuz they dont care about us.", "time": "11th February 2018, 02:59 PM", "postID": "post75527084", "replies": []}, {"text": "I contacted Huawei about this, the guy in the live chat was very helpful. He said he never heard of that problem before (I believe him) and offered me to send pictures of the screen to a support email address... Never heard from them again. Thanks", "time": "12th February 2018, 03:16 PM", "postID": "post75540379", "replies": [{"text": "Why would you even do that if your device hasn't got the issue?", "time": "17th February 2018, 08:04 PM", "postID": "post75604733", "replies": [{"text": "I have that issue, I just don't really care... But they told me I could get a replacement device. Having that confirmed I can wait for a year and ask for a replacement device. Fresh battery.", "time": "18th February 2018, 03:55 PM", "postID": "post75613403", "replies": []}]}]}]}, {"title": "Clarity/resolution", "rating": 5.0, "links": ["https://forum.xda-developers.com/mate-10/review/clarity-resolution-t3687813"], "threads": [{"text": "Of course it's crispy at 2K. Good for VR too. But FHD is enough for daily use.", "time": "27th November 2017, 03:40 PM", "postID": "post74655948", "replies": []}, {"text": "It is really nice, colors, in full hd. and u can use smart resolution to manage resolution and save battery !", "time": "27th November 2017, 06:19 PM", "postID": "post74657683", "replies": []}, {"text": "I went to the shop yesterday and helped them turn on vvivid display for Mate 10 after seeing how unattractive the default display is beside the Amoled Mate Pro.", "time": "30th November 2017, 10:54 AM", "postID": "post74688446", "replies": []}, {"text": "Yesterday it was sunny day. I test display and it's not good. Bad reading on sunny day. Bright was on 100% but display was so dark. Mate 10Pro.", "time": "2nd December 2017, 01:12 PM", "postID": "post74710958", "replies": [{"text": "Auto brightness or manual ?", "time": "2nd December 2017, 06:25 PM", "postID": "post74714038", "replies": []}]}, {"text": "Auto bright. Manual I tried too but same effect. My old M9 was usable in sunny day without problem.", "time": "3rd December 2017, 08:24 AM", "postID": "post74719366", "replies": []}, {"text": "FHD for the win!", "time": "11th December 2017, 10:15 AM", "postID": "post74808002", "replies": []}, {"text": "I actually like that the display is 1080P. I never use VR as it gives me motion sickness and I I'm unable to visually discern individual pixels so anything higher than 1080P is just wasting battery life and making the SoC/GPU work harder.\n\nI've found it perfectly fine in direct sunlight. Compared to my LG G6, it's a far superior display. I'm not sure that it's as good as the U11 but it's miles ahead of the Moto Z.", "time": "14th December 2017, 12:20 AM", "postID": "post74839305", "replies": []}]}, {"title": "Minimum brightness", "rating": 5.0, "links": ["https://forum.xda-developers.com/mate-10/review/minimum-brightness-t3687814"], "threads": [{"text": "A nice topic , thanks", "time": "17th October 2017, 10:30 AM", "postID": "post74189279", "replies": []}, {"text": "I use extra app on Mate 10 Pro, called Night Owl, and use it with 50 % dimming. This feels better when I read or do something in the night. Also use built in Comfort mode for eyes. \r\nIf the Night Owl app is turned on during day, it is somewhat quite on the edge of hard to navigate to get turn that off. So maybe Huawei setting is good for safety reasons. But for reading in deep night I prefer additional app.", "time": "16th November 2017, 11:13 AM", "postID": "post74532953", "replies": []}, {"text": "Dim enough to be used in the cinema!", "time": "27th November 2017, 03:30 PM", "postID": "post74655858", "replies": []}]}, {"title": "Call quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/mate-10/review/call-quality-t3687815"], "threads": [{"text": "When VoLTE on both call members used, quality is best what I listened. Very clear sound.", "time": "3rd December 2017, 08:27 AM", "postID": "post74719386", "replies": []}, {"text": "poor wifi", "time": "27th January 2018, 07:16 PM", "postID": "post75353615", "replies": []}, {"text": "The best part of half of the people I speak with regularly have commented about voice quality since I switched from an LG G4, even though they didn't know I'd changed 'phones. Most asked if I'd changed mobile carriers, one saying they thought I was in a studio because they couldn't hear the usual whir of server fans in the background. Certainly can't complain about the voice quality (and noise suppression)!", "time": "28th January 2018, 09:44 AM", "postID": "post75359037", "replies": []}, {"text": "On 3G and 4G quality is amazing.\n\nSpecially the person on the other side of the line has no trouble at all hearing me even though I'm in a noisy and windy place.", "time": "28th January 2018, 05:28 PM", "postID": "post75363358", "replies": []}, {"text": "so far so good", "time": "28th February 2018, 04:57 AM", "postID": "post75720962", "replies": []}, {"text": "hurts ears at full volume! Brilliant reception too.!", "time": "08 April 2018, 09:59 AM", "postID": "post76162791", "replies": []}]}, {"title": "WiFi strength, range, and throughput", "rating": 4.5, "links": ["https://forum.xda-developers.com/mate-10/review/wifi-strength-range-throughput-t3687816", "https://forum.xda-developers.com/mate-10/review/wifi-strength-range-throughput-t3687816/page2"], "threads": [{"text": "I have had issues with my BLA L29 with wifi. Not very consistent in downloads, as some times i need to reconnect to the wifi to have my full download speed. Otherwise, on noremla carrier 4g very good reception overall.", "time": "18th November 2017, 02:57 PM", "postID": "post74555647", "replies": [{"text": "me too,\r\nyou have been able to solve it?\n\r\nIt's a great phone but this is a big bug that I hope will resolve.\n\r\nI work a lot with a nas and the huawei leaves a lot to be desired.\n\r\nmy wife's s8 goes a thousand times better than mate 10", "time": "27th January 2018, 07:15 PM", "postID": "post75353605", "replies": [{"text": "No. I sent it back and back to HTC U11+. which has better camera and stable Wi-Fi.", "time": "27th January 2018, 07:41 PM", "postID": "post75353809", "replies": [{"text": "How is the battery of HTC U11 Plus compared to Mate 10? Is it better?", "time": "3rd February 2018, 09:32 AM", "postID": "post75430269", "replies": [{"text": "Not quite as good. But still very good.", "time": "3rd February 2018, 02:36 PM", "postID": "post75433051", "replies": []}]}]}]}]}, {"text": "The only gripe is no AC MIMO. Otherwise, it's perfectly fine.", "time": "27th November 2017, 03:37 PM", "postID": "post74655924", "replies": []}, {"text": "WiFi is the one issue for me. I have other android phones side by side trying to get the same content on the same WiFi network and the Huawei struggles and does not load or does so slowly. I think there is a fundamental issue with the connectivity of this phone.", "time": "28th November 2017, 08:30 PM", "postID": "post74671340", "replies": []}, {"text": "the Wifi throttle the DL speed badly when 5g is enabled \n\nmy ISP allows almost 1gb connection over 5ghz wifi signal however all my mate 10 pro can do is 380mbps DL and 450mbps UP , on the other hand my wife's Galaxy s8 can do 600mbps over 5ghz wifi signal !!!", "time": "27th January 2018, 08:10 PM", "postID": "post75354061", "replies": [{"text": "I hope it's firmware thing\n\nEnviado desde mi BLA-L29 mediante Tapatalk", "time": "27th January 2018, 08:49 PM", "postID": "post75354379", "replies": []}]}, {"text": "I find WiFi poor with this phone. Shame, I love it so much.", "time": "29th January 2018, 03:02 AM", "postID": "post75367588", "replies": []}]}, {"title": "Cellular strength and throughput", "rating": 4.5, "links": ["https://forum.xda-developers.com/mate-10/review/cellular-strength-throughput-t3687817", "https://forum.xda-developers.com/mate-10/review/cellular-strength-throughput-t3687817/page2"], "threads": [{"text": "Can anyone with the smartphone tell how is it?\n\nThis is very important for me, since I usually go to areas with low coverage.\n\nMy actual smartphone, a LG V20, is not very good in this.", "time": "3rd November 2017, 07:48 PM", "postID": "post74396247", "replies": [{"text": "I have only had mine on Cellular today, but tested data rate on speedtest app at work. A good signal (4G+, where my OPO 3 only got 4G) and 66 Mb/s down and 55 Mb/s, up which is better than my 4G internet modem at home. So good data connection with good signal!\n\r\n When I get to try it in more rural areas, I'll return and report the experience. I have a feeling that it will perform at least decent.", "time": "13th November 2017, 07:48 PM", "postID": "post74504076", "replies": []}]}, {"text": "enhance LTE connection/DL speed with these tips\n\n\r\nsettings>wireless&networks>mobile network>access point name>click on the ( i ) icon next to your data package which should be named either internet or data >bearer>untick unspecified and tick LTE >ok>click the apply icon on the top right\n\n\r\nnow you should take more advantage of your LTE cell speed , here's mine", "time": "28th December 2017, 12:41 AM", "postID": "post74985104", "replies": []}, {"text": "On T-mobile with my Mate 10 Pro L-29 international version.\n\r\nAbsolutely loving this thing so far", "time": "28th December 2017, 07:35 AM", "postID": "post74987474", "replies": [{"text": "Good to hear, are you getting VoLTE as well on TMobile?", "time": "24th January 2018, 09:45 PM", "postID": "post75321626", "replies": []}]}, {"text": "Can anyone tell me that this phone support dual 4g or not? Thanks", "time": "21st January 2018, 09:41 AM", "postID": "post75279042", "replies": [{"text": "If by dual 4G you mean carrier aggregation then the answer is yes it does as it has one of the most advanced modems in the market CAT18.", "time": "23rd January 2018, 08:46 AM", "postID": "post75302286", "replies": [{"text": "It's mean I can use this phone with 2 SIM and all running 4G. Other phone just one can run 4G, other must 2G.?", "time": "24th January 2018, 04:18 AM", "postID": "post75312623", "replies": [{"text": "Dual 4G And dual VoLTE is supported. \n\nAnyone know of there is a hidden menu to see the carrier configuration? I wanna see to what bands my phone is connected and what's the configuration, T-Mobile has starting rolling 4CA in the Netherlands.\n\n\nThis is on 3CA", "time": "25th January 2018, 02:27 PM", "postID": "post75328697", "replies": []}]}]}]}, {"text": "Solid on TMO", "time": "1st February 2018, 02:53 PM", "postID": "post75409637", "replies": []}]}, {"title": "Speakerphone (loudness, clarity)", "rating": 5.0, "links": ["https://forum.xda-developers.com/mate-10/review/speakerphone-loudness-clarity-t3687818"], "threads": [{"text": "If anyone finds out too, how to turn On both speaker all the time, it seems top speaker only works when you are playing in landscape mode or else only bottom speaker works? Sigh", "time": "4th November 2017, 04:35 PM", "postID": "post74404807", "replies": [{"text": "There is a setting: \"Settings\" -> \"Sound\"->\"Stereo+\"\n\r\nIn youtube app, it sounds like there might be a tiny bit more sound coming out from the speaker if you sett that setting to Off.\r\nBut it is not a lot and not sure if will make a huge difference. The top speaker is not a full speaker and only play higher frequencies. But give it a try!", "time": "13th November 2017, 07:59 PM", "postID": "post74504202", "replies": []}]}, {"text": "I think Huawei did a good job with the stereo separation. It really does sound great. Quite loud and clear too.", "time": "27th November 2017, 03:32 PM", "postID": "post74655886", "replies": []}, {"text": "First sorry for my english.\n\nSpeakers in mate 10 pro are quite good for me, mate 9 sound louder and less distort in max volume but mate 10 pro sounds clear, stereo effect is really great (don't set volume to max) \n\nSo if you put the volume two or three points below the max in a quiet room, you'll get a clear and stereo sound, very enjoyable, maybe this speaker is better for movies than music, but is ok", "time": "23rd January 2018, 10:05 AM", "postID": "post75302926", "replies": []}, {"text": "Tried, well i do noticed the diff. Thanks! Sounds better when set at 80%. Distorted when gg full 100%", "time": "4th February 2018, 03:51 AM", "postID": "post75439260", "replies": []}, {"text": "mate 10 pro speaker phone isn't loud enough", "time": "28th February 2018, 05:54 AM", "postID": "post75721303", "replies": []}]}]