[{"title": "Overall love", "rating": 5.0, "links": ["https://forum.xda-developers.com/s7-edge/review/overall-love-t3330777", "https://forum.xda-developers.com/s7-edge/review/overall-love-t3330777/page2", "https://forum.xda-developers.com/s7-edge/review/overall-love-t3330777/page3", "https://forum.xda-developers.com/s7-edge/review/overall-love-t3330777/page17"], "threads": [{"text": "besides color, i think everything else is what i looked for in a phone.", "time": "9th March 2016, 05:03 PM", "postID": "post65742011", "replies": []}, {"text": "I love it!!", "time": "10th March 2016, 11:57 AM", "postID": "post65756508", "replies": []}, {"text": "Compared to my S6 Edge+ I am just not feeling it", "time": "10th March 2016, 06:06 PM", "postID": "post65762697", "replies": []}, {"text": "Came from S6E+ - everything is better (especially microsd and camera focus)", "time": "10th March 2016, 06:18 PM", "postID": "post65762905", "replies": []}, {"text": "I really like the feel and look of this device. Reminds me of the days when the first iPhone 4 came out (yeah that feeling)", "time": "10th March 2016, 07:26 PM", "postID": "post65764098", "replies": []}, {"text": "First phone in ages that got me realy exited, and after a week of usage,, still amazed! \n\r\nLOVE IT !", "time": "10th March 2016, 11:18 PM", "postID": "post65767614", "replies": []}, {"text": "I hate to say it but I'm actually not that much in love with the s7 edge. Coming from a note 5 I can't tell the upgrade. Maybe I'm just a note fanboy but something seems to be missing for me.", "time": "11th March 2016, 12:53 AM", "postID": "post65768643", "replies": [{"text": "Is it the S-Pen, maybe? :P", "time": "11th March 2016, 04:57 AM", "postID": "post65771044", "replies": []}, {"text": "My wife just got note 5 and I got the 7 edge plus. I find the former factor a little more hand friendly. She wishes her phone had the curved screen. To me, you get better looking phone minus stylus with newest processor.", "time": "14th March 2016, 05:22 AM", "postID": "post65826633", "replies": []}]}, {"text": "Coming from a Note 4, this thing feels great (but Note 4 was nice).  This is an upgrade in everyway, except for no S pen, which i did not use too much.  This phone should last me a while, lovin it.", "time": "11th March 2016, 02:03 AM", "postID": "post65769361", "replies": []}, {"text": "I am loving it. In fact I haven't felt this way about an Anrdroid Phone since the HTC EVO 4G back in 2010.", "time": "11th March 2016, 12:27 PM", "postID": "post65776333", "replies": []}, {"text": "have the stealth black 935F version, really nice! the only thing I would change is the Samsung logo under the grill.", "time": "11th March 2016, 12:29 PM", "postID": "post65776364", "replies": []}, {"text": "of course you will really love it!  its a $870 phone", "time": "11th March 2016, 02:10 PM", "postID": "post65778027", "replies": []}, {"text": "The only thing impressive about this phone is the battery life. Not feeling the love.", "time": "11th March 2016, 02:37 PM", "postID": "post65778535", "replies": []}, {"text": "Coming from a Nexus 6p,it is a good phone. I would actually change and go with the regular s7 but I don't want to give up the 600mah in battery life. This battery is bigger than the 6p but it seems to last longer than the 6p.", "time": "11th March 2016, 06:23 PM", "postID": "post65782404", "replies": []}, {"text": "I don't love it yet, but there's a definite attraction that could develop into something over time. Then of course after a while the excitement will fade and everything will just seem stale and mundane. Maybe I should get another phone to see on the side to keep things fresh.", "time": "13th March 2016, 07:57 PM", "postID": "post65819694", "replies": [{"text": "This is always my fear.  I already have a iPhone 6S as my daily driver that gives me no problems and a Nexus 6 that I rarely use because the 6S is so much faster.  I'm afraid that if I get the S7 and compare it to the 6S speed wise I'm just going to be disappointed with the purchase.  To be honest I've played with the S7 like 4 times at different stores and every time my 6S feels faster but I miss Android and the S7 Edge looks so much better.  Just today I almost walked out the door with a S7 Edge at Target only because I was told that I could stack a $100 upgrade giftcard with the $100 preorder giftcard and Gear VR.  I guess they figured out that you can't stack the giftcards so I walked out the store empty handled.  $200 in Target giftcards and Gear VR would have sealed the deal.  \r\nSo now I wait to see the G5 (I want the IR blaster, on screen buttons) is any good but it all depends on price.  Then  you have the HTC 10 but I'm not holding my breath.  If those disappoint it looks like iPhone 7 and maybe a Nexus towards year end.  The current Nexus 6P is dropping now but I already have a Nexus 6.", "time": "14th March 2016, 03:17 AM", "postID": "post65825561", "replies": []}]}, {"text": "I may be writing this prematurely, as mine is on order and should be here early next week. But I've been using the S6 for the past year, and the S7 edge seems to solve the few problems I had with the S6. I've read all the reviews I could find, and my needs for a larger battery and the SD card make this phone almost perfect.", "time": "13th March 2016, 11:40 PM", "postID": "post65823192", "replies": []}, {"text": "Getting mine on the 18th,kinda feel excited seeing more positive. Yay.. hope i wouldn't get the lemon though.. lol", "time": "14th March 2016, 12:02 AM", "postID": "post65823464", "replies": []}, {"text": "I LOVE THIS PHONE.  Even TouchWiz, I can't believe it. I actually love TW now. \n\nComing from the Note 4, the width of this Galaxy S7 Edge is near perfect. Still features a big beautiful display but it doesn't feel like you're palming a small tablet. On top of that it's a beautifully crafted device. Easy to pickup and a joy to hold in your hand. Not to mention it's fast. Everything is fast. Opening the camera is fast. Multitasking. No lag. The app drawer snaps open. The camera hardware / camera app and fingerprint scanner also score high marks in my book. Camera pro shooting mode is the camera app I've hoped Samsung would have given us for some time. I suppose better late than never. Fingerprint scanner is every bit as nice as Apple's. I hated having to swipe down on the button and I ruined my first prints because I still thought that was how it was done. I realized you just set your finger down and it reads it. Done. Whether it's to unlock the phone, input a password or use Samsung Pay it's easy the way it should be. Special shoutout to the guys who brought back the S5's expandable MicroSD and waterproof exterior design. Aside from root, this beast covers all my bases. \n\nRe: Battery, I've spent the whole weekend fiddling with it and syncing all my data so I'm not even thinking about battery life, screen on time, etc. At the end of the week I'll have a better idea of how the battery fares. For now, way too early to call.", "time": "14th March 2016, 03:37 AM", "postID": "post65825720", "replies": []}, {"text": "I really do hope that theyd incorporate an s pen along for the s series. Make it smaller or thinner to differentiate it with the note series as long as there is an s pen for the s series. \n\nEven the cheap tab A gets an s pen.", "time": "14th March 2016, 12:44 PM", "postID": "post65831285", "replies": []}, {"text": "This thing is beautiful. I just made love to it, the headphone port is the perfect size for me.", "time": "14th March 2016, 02:15 PM", "postID": "post65832536", "replies": []}, {"text": "No complaints here. I'm glad I went with the edge seeing as this is my first edge screen phone. I like how thin the phone is. I love the gold platinum color and that is why I chose a Spigen Ultra Hybrid crystal clear case so that I can keep the phone shiny and nice looking. The phone looks great and performs great. Once my Gear VR arrives it will be a win win for me.", "time": "14th March 2016, 02:49 PM", "postID": "post65833097", "replies": []}, {"text": "My first edge phone and it feels amazing. Extremely smooth and long lasting battery ( hopefully it keeps this state for a long time )", "time": "14th March 2016, 06:56 PM", "postID": "post65837224", "replies": []}, {"text": "I'm coming from a long line of iPhones and... most recently, a Windows 10 - Nokia Lumia 1520. I hadn't really messed with Android since my old, 1st gen Nexus tablet. This phone has definitely convinced me of the viability of Android as a mature, full-blown mobile OS. It is much more polished and refined than Windows 10 mobile - which in turn was 100% better than the garbage Windows 8 OS that the phone originally shipped with.  I absolutely love this phone and will likely stay with Android.", "time": "14th March 2016, 10:33 PM", "postID": "post65841107", "replies": []}, {"text": "I'm getting the BOGO from TMO tomorrow. It's on backorder, but I'm excited to switch from my LG G4 nonetheless. I've read a ton of reviews, and despite no root, I'm thinking it's almost perfect. \n\nUpdate: My husband is ordering the BOGO as we speak. It comes with the VR package too, once you send it in to Samsung. I'm so excited! They are so clean looking! Uh oh... they're on backorder. The site says 7 to 10 days.", "time": "15th March 2016, 04:43 AM", "postID": "post65845311", "replies": []}, {"text": "The look and the camera. The camera is amazing. Love the RAW function", "time": "15th March 2016, 10:47 AM", "postID": "post65848915", "replies": []}, {"text": "Love it!", "time": "15th March 2016, 02:07 PM", "postID": "post65851665", "replies": []}, {"text": "Just got it last night, upgraded from Note 4 - the fluidity of it blows my Note 4 away, which lagged a bit, especially opening the camera and switching to and from camera and gallery. I've gone from the S3 to Note 4 and now to this and am happier each time with the trimmed down TouchWhiz and less bloat. I do have two questions though:\n\r\nI was under the impression you could have just the \"edge\" always one with time/date, etc. although I don't see this as an option, only the \"always on display\" which is the whole screen. Am I missing something?\n\r\nWhen I open a game, CoC for instance, my screen goes to like full on torch mode - ultra saturated, and looks pretty bad. I have the screen set to Basic but for some reason it changes when I open CoC.\n\r\nLoving the phone so far, hopefully the battery impresses.", "time": "15th March 2016, 03:33 PM", "postID": "post65853103", "replies": []}, {"text": "its i the best phone now.", "time": "16th March 2016, 05:58 AM", "postID": "post65865238", "replies": []}, {"text": "Excellent phone. Excellent performance and features, great looks and amazing battery life.  Good development scene for my version 935F only increases this overall impression. To top it all off, it's quite water resistant. No regrets. 9.5/10\n\nvery few and minor cons:\n-physical home button rather than pressure sensor home button in theory can wear out. Just my obsessive compulsive nature lol.\n- curved edge made it annoying to find a screen protector that doesn't get lifted off by case.", "time": "8th March 2018, 07:37 AM", "postID": "post75813060", "replies": []}]}, {"title": "Community development strength", "rating": 3.0, "links": ["https://forum.xda-developers.com/s7-edge/review/community-development-strength-t3330778", "https://forum.xda-developers.com/s7-edge/review/community-development-strength-t3330778/page2", "https://forum.xda-developers.com/s7-edge/review/community-development-strength-t3330778/page3", "https://forum.xda-developers.com/s7-edge/review/community-development-strength-t3330778/page4"], "threads": [{"text": "It's a bit too early for this IMO.", "time": "10th March 2016, 11:57 AM", "postID": "post65756524", "replies": []}, {"text": "While its still took early since most people still havnt gotten their devices and devs usually don't have the money to throw at upgrading phones right when they come out, I hope that we will have a few solid devs here and create amazing ROMs. Not to mention the cm and aosp support we should see with the 820 varient.", "time": "10th March 2016, 05:06 PM", "postID": "post65761634", "replies": []}, {"text": "Isn't the bootloader locked on all USA carriers? I know my Verizon one is. We'll be lucky to even get root.", "time": "10th March 2016, 05:26 PM", "postID": "post65762010", "replies": []}, {"text": "Do you think we'll get xtrestolite for the s7?", "time": "10th March 2016, 11:26 PM", "postID": "post65767698", "replies": []}, {"text": "Locked bootloader.", "time": "16th March 2016, 12:04 AM", "postID": "post65861723", "replies": []}, {"text": "Samsung is starting to think they're Apple.", "time": "16th March 2016, 02:29 PM", "postID": "post65871298", "replies": []}, {"text": "I feel like I'm wishing for the impossible to get root within 6 months on Verizon's S7e.", "time": "2nd April 2016, 03:30 AM", "postID": "post66154080", "replies": []}, {"text": "Personally I just bought the Samsung Galaxy S7 Edge G935F (International Unlocked) version. I'm hoping development of roms picks up soon but until then at least I have root and the ability to make changes.", "time": "2nd April 2016, 10:55 PM", "postID": "post66165701", "replies": [{"text": "I agree with you MorningStarGG. I hope that company will think about it.\r\nThanks.", "time": "17th April 2016, 12:14 PM", "postID": "post66406710", "replies": []}]}, {"text": "There are some great roms out for the g935F imo. Renovate and kryxxos both have very active forums and are making good progress. I'd say the development for the European variant has a pretty solid community so early on", "time": "3rd April 2016, 10:10 PM", "postID": "post66180180", "replies": []}, {"text": "I am happy to use it as is from factory. No need for root or roms here.", "time": "5th April 2016, 11:10 PM", "postID": "post66213855", "replies": [{"text": "There is always a need for root. Removal of bloatware, ability to link apps2SD, etc. It may be (and is) incredibly functional at stock state, but I'm dying for root access.", "time": "5th April 2016, 11:54 PM", "postID": "post66214280", "replies": [{"text": "That is why i said here, not there.", "time": "6th April 2016, 12:54 AM", "postID": "post66214773", "replies": []}]}, {"text": "Me too, for now it is very speed & smooth, may be after release of Android N, I may reconsider my decision. For now I am ☺", "time": "6th April 2016, 01:17 PM", "postID": "post66221993", "replies": [{"text": "Coming from a Nexus 6 used with stock/unrooted.  i don't know why if it is a lollipop or marshmallow thing but rooted devices don't run as stable as they used to run like they did until kitkat. S7 Edge provides everything i need out of the package, i can disable whatever bloatware i don't need. So, i don't really see myself rooting for the sake of having root.", "time": "6th April 2016, 05:07 PM", "postID": "post66225562", "replies": [{"text": "Samsung slow in updates, they still haven't updated MM to  S6 , just started in some countries. But, I think they will do the same with Android N to S7, So if you want to taste early Android N, you need to have CM.", "time": "6th April 2016, 05:48 PM", "postID": "post66226208", "replies": []}]}]}]}, {"text": "Too early for this thread me thinks\n\nTakes time for devs to bring us great things\n\nIn the meantime though I've been able to make quite a killer rom myself based on the latest G935FXXU1APCI TUR release and modded in xposed, root, removed knox and added in wifi-calling that I can use on UK EE", "time": "6th April 2016, 11:18 PM", "postID": "post66230731", "replies": []}, {"text": "So... are owners of the Snapdragon version voting and commenting in this thread? If yes, that won't really be fair since the SD version is locked down.", "time": "7th April 2016, 12:52 AM", "postID": "post66231596", "replies": []}, {"text": "Tripping Knox is something I want to stay away from.", "time": "7th September 2017, 11:07 AM", "postID": "post73699678", "replies": [{"text": "Unlocking a bootloader will most definitely trip knox, unfortunately. I have high hopes we will get the bootloader unlock by the end of this year.", "time": "8th September 2017, 08:51 PM", "postID": "post73720019", "replies": [{"text": "God, I hope you're right. This device has sucked much of my love for Android out of me. I feel like I'm on an iPhone. I don't think I'd root without twrp. I wouldn't want to be away from my pc and not be able to flash a backup if my phone wigs out.", "time": "13th September 2017, 10:28 PM", "postID": "post73782476", "replies": []}]}]}, {"text": "which variant has best development can anyone tell me?", "time": "7th October 2017, 06:21 PM", "postID": "post74071243", "replies": [{"text": "G935F (Exynos) for sure. Plenty of ROMS, plenty of kernel. IMO, Tkkg1994, Superman ROM and associated kernels make it all worth it, not to mention all the other ROMs and kernels available.", "time": "8th October 2017, 09:42 PM", "postID": "post74085726", "replies": [{"text": "Thanks mate, my note 4 died(custom rom+kernel with my settings in few hours probably killed it) so I am planning to buy another device. as a user of s7, will you suggest it or any other device in similar price point. I will buy a used/refurb phone. So any other device you think is going to be better than it? Like v20, g5, note 5, or you will stick to s7? any of mentioned device have better rear camera or s7 is best?", "time": "10th October 2017, 01:40 PM", "postID": "post74105695", "replies": [{"text": "Sounds like you OC'ed heaps? Rather than overclocking, if you want more performance ,I'd personally change how aggressive my governor scaling is - much safer. Out of all the ones you listed, I'd go S7 or S7 edge as the battery life is the best if nothing else. I'm also a bit of a Samsung fanboy haha. Now, I got my edge because there was this ridiculous deal where it was cheaper than the S7. But the edge does not really have much benefit over the normal S7 besides battery life (the edge function can easily be gained through custom rom). I'd save money and get the cheaper one. \n\nWith those you listed though, they're all reasonably similar in specs so you can't really go wrong  I guess. Maybe check community development strength for those if that matters to you as well. I also think I read somewhere about build quality issues with LG?\n\nEdit - also I found it annoying to find a case and screen protector for S7 edge, so that may make a difference? I can recommend a combo that has worked well for me if you decide to get it though.", "time": "10th October 2017, 09:25 PM", "postID": "post74110794", "replies": [{"text": "I only disabled 3 cores out of 8 by an app \"synapse\" on a new ROM to save battery, woke up with dead note 4.\r\nI think display size of s7 edge is one big advantage over s7, would prefer 5.5\" and it looks more beautiful. That's why I prefer edge, don't need edge functionalities though. One thing I am noticing on s7 in reviews that it some times oversaturates photos, is it fixable? Lets say by ROM or app(except RAW mode)?", "time": "11th October 2017, 11:25 AM", "postID": "post74116673", "replies": [{"text": "That doesnt sound like it would make your phone wake up dead? Is it hardbricked or just softbricked? That being said synapase is unstable AF, I got so many FCs from dumb things like reducing my max clock speed. Edge is more beautiful for sure  .  I like the way that it takes photos haha and I'm pretty adept at photoshopping so I've never looked into it.", "time": "11th October 2017, 11:56 AM", "postID": "post74116930", "replies": []}]}]}, {"text": "Have you considered a S6 or S6+. How about a Note5.. As far as I can tell, they are still with unlocked boot loaders and still have plenty of development.", "time": "10th October 2017, 11:52 PM", "postID": "post74111966", "replies": [{"text": "I need good development and specs with camera! I don't like that fact that they removed sd slot on s6 and it is not even water resistant. And they are getting older and I think probably no android 8 for them as Samsung likes to do it. Custom ROMs will have it but they will be buggy for sure. I didn't knew that note5 don't have sd slot until now. Not expected, I don't understand why they removed them on those phones when they are added now. But thank god they have 3.5mm jack.\n\n---------- Post added at 04:19 PM ---------- Previous post was at 04:12 PM ----------\n\n\n\r\nNope I checked everything to see if its hardbricked but phone doesn't shows anywhere on PC, some repair shops used their own devices to check but its hardware dead, maybe just a coincidence that it died due its time when I changed software settings. Sent to few repair shops, need new mobo. I left it and now looking for new phone. Never gonna use synapase.\r\nBtw I am very familiar with PS too, but problem is the time consumed for multiple pics! But anyways thanks mate, I have exams going on, I will buy in next month I guess, will let you know what I get", "time": "11th October 2017, 12:19 PM", "postID": "post74117089", "replies": [{"text": "Biggest reason why I did not by either phone was the missing SD slot. But since these newer phones in the US are being locked down, I might consider in the future buying a older phone just because I can at least install custom roms.. Hell I have already downloaded roms just in case I end up picking up one.. MY S3 I have had for  yrs just went south, usb port is dead won't charge..", "time": "11th October 2017, 06:26 PM", "postID": "post74121212", "replies": [{"text": "We have many US phones (refurbished) for sell in Pakistan. They are generally cheap than global variants but I don't buy them because US carriers are too aggressive locking them up! And this is exactly the case for S7 Edge. Btw that's the same problem with my brothers S4, he charges battery externally. Use the benefit of removable battery mate  I had S3 for long time, great phone indeed. Used Liquid smooth ROM mostly with Boeffla kernel.\n\n---------- Post added at 11:48 PM ---------- Previous post was at 11:44 PM ----------\n\nIf I don't find G935F for good price, I will go with G6. Hope its good decision.", "time": "11th October 2017, 07:48 PM", "postID": "post74122076", "replies": []}]}]}]}]}]}]}, {"text": "Well so long as the US carriers are locking our devices down.. Maybe next we should think about purchasing a international variant that works with our chosen network.", "time": "8th October 2017, 10:03 PM", "postID": "post74085951", "replies": []}, {"text": "I had my Samsung Galaxy S7 edge Duos, G935FD for a year and a half and must brag about it a little even though it is considered an old model. Very heavy use and finally it's time to replace the battery but it was amazing until recently and I also found out after buying this particular version that it's actually the best one on the market. Very happy with it still and will definitely keep it after buying S9 on eBay as usual since I want unlocked international version 😊", "time": "22nd February 2018, 10:31 PM", "postID": "post75661683", "replies": []}]}, {"title": "Overall speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/s7-edge/review/overall-speed-t3330779", "https://forum.xda-developers.com/s7-edge/review/overall-speed-t3330779/page2", "https://forum.xda-developers.com/s7-edge/review/overall-speed-t3330779/page3", "https://forum.xda-developers.com/s7-edge/review/overall-speed-t3330779/page12"], "threads": [{"text": "No issue whatsoever with performance. Not one sign of lag or stutter yet.", "time": "8th March 2016, 08:07 PM", "postID": "post65726598", "replies": []}, {"text": "fastest smartphone i've used....", "time": "9th March 2016, 05:03 PM", "postID": "post65742015", "replies": []}, {"text": "Yeah super fast coming from note 4 which I was happy with. Super duper fast", "time": "9th March 2016, 07:51 PM", "postID": "post65745002", "replies": []}, {"text": "Works great for my daily things, and even the few games I play.\nSize and spec of the s7 edge makes it my daily device and it works perfectly so far.\nComing from ip6s+, but also had before that N6p,N5 and s6 edge. So I compare it to good devices and not some low end device..\n\nSkickat från min SM-G935F via Tapatalk", "time": "10th March 2016, 06:38 PM", "postID": "post65763240", "replies": [{"text": "I have been watching a lot of reviews of Galaxy s7 edge on youtube and I found there Direct call option in Advanced features but when I went to the mobile store I tried to find out direct call option on s7 edge inside Advanced features but it was not there. There is no direct call option. what is the matter and why its different. any idea?\n\n---------- Post added at 05:21 PM ---------- Previous post was at 05:20 PM ----------\n\n\n\r\nI have been watching a lot of reviews of Galaxy s7 edge on youtube and I found there Direct call option in Advanced features but when I went to the mobile store I tried to find out direct call option on s7 edge inside Advanced features but it was not there. There is no direct call option. what is the matter and why its different. any idea?\n\n---------- Post added at 05:21 PM ---------- Previous post was at 05:21 PM ----------\n\n\n\r\nI have been watching a lot of reviews of Galaxy s7 edge on youtube and I found there Direct call option in Advanced features but when I went to the mobile store I tried to find out direct call option on s7 edge inside Advanced features but it was not there. There is no direct call option. what is the matter and why its different. any idea?", "time": "31st March 2016, 04:21 PM", "postID": "post66129075", "replies": [{"text": "don't know why you posted the same response to three different quotes. you could have just listed the quotes, and then written your response once.  anyway, the answer is CARRIERS!!!! different carriers delete different features and functions as they either conflict with the carriers software, or the carrier just doesn't want you to use it. at&t is famous for this. so is verizon and sprint.  but all american carriers are guilty to some degree, which is why I ALWAYS BUY THE INTERNATIONAL UNLOCKED VERSION OF ANY PHONE I PURCHASE. THERE IS NONE OF THAT INVOLVED WITH THE INTERNATIONAL VERSION.\n\non another note, any of your guys whining about lag, are your own worst enemy. this phone does NOT lag. if yours is lagging, then you are doing something wrong, or you have a dud, as previously mentioned. this phone is brilliantly fast, and smooth. look back on the things you have done, or are doing to find your solution.", "time": "31st March 2016, 07:07 PM", "postID": "post66131763", "replies": []}]}]}, {"text": "its fast, dunno how good it is compared with other newer phones, but everything runs smooth, games are awesome!", "time": "10th March 2016, 11:33 PM", "postID": "post65767778", "replies": []}, {"text": "Setting everything was super fast, did a reboot and charging up to take a break, coming from a Note 4, which was reasonably fast, but this thing has zero lag so far.", "time": "11th March 2016, 02:09 AM", "postID": "post65769441", "replies": []}, {"text": "this is a great phone, you can get the performance that you want and easily to use", "time": "14th March 2016, 02:32 AM", "postID": "post65825096", "replies": []}, {"text": "Snappiness of this phone has put my Note 4 to shame, particularly with switching to and from camera to gallery.", "time": "15th March 2016, 06:47 PM", "postID": "post65856388", "replies": []}, {"text": "The sd card max transfer speeds are not up to par for 2016. Everything else is great.", "time": "16th March 2016, 12:06 AM", "postID": "post65861740", "replies": []}, {"text": "Galaxy S7 edge is really fast, I do all multi tasking stuff like running multiple apps, playing game, downloading and auto updates parallely and its still runs with full speed. like all other samsung mobiles S7 edge runs with high speed.", "time": "21st March 2016, 01:51 PM", "postID": "post65960840", "replies": []}, {"text": "No lag for me yet.", "time": "21st March 2016, 05:05 PM", "postID": "post65964164", "replies": []}, {"text": "I can easily get mine to freeze up or lag.", "time": "22nd March 2016, 04:36 PM", "postID": "post65980028", "replies": [{"text": "Same here. There is microlag when scrolling all throughout Touchwiz. For the most part its smooth and seamless but for everyone saying they haven't seen lag, you probably have. \n\r\nThere is just a strong chance that it wasn't sustained lag which makes it easy to be dismissive of it. \n\r\nIt is especially noticeable when coming from the N6P (chalking this up to stock android not being bloated)", "time": "22nd March 2016, 08:07 PM", "postID": "post65983473", "replies": [{"text": "Agreed, I have seen micro lag, but nothing to irritating. It got much better when I disabled everything (everything that is dis-ableable anyhow) from Samsung and Verizon as always. Also as always once its rooted we can disable the rest and ti will fly. Its a shame that we have to do that, but it is what it is. I would do anything for an S7 Edge with stock Android... Better yet, a Nexus Edge", "time": "22nd March 2016, 10:29 PM", "postID": "post65985585", "replies": []}]}]}, {"text": "Hi, and what about the most performance demanding games? I use these expensive phones as portable consoles and if I invest 800€ into phone, which is price of computer, I expect every single game on google play smooth at 50 fps.  But on some ytb videos I have seen some microshutter and fps drops for example in Dead trigger 2, Asphalt 8 or GTA san andreas. Dont know which version it was, but I prefer adreno 530 gpu which is not on market in my country :/ . I actually dont care very much about fast app launching/loadings or appdrawer, but for me most important is FPS when game is already loaded.  Or can I lower res to 1080p to eliminate any FPS issue? Did anyone compared gaming exynos vs snapdragon? (not benchmarks, real gaming FPS) .\nPS: Please keep hate and comments like phone is not for gaming away, Im listening it all the time. But i am heavy gamer at any platform and if I wanted phone for calls and sms I could stick with my old nokia 3310. But thanks for any possible useful info from owners of this phone", "time": "23rd March 2016, 01:44 AM", "postID": "post65987939", "replies": []}, {"text": "Only time I had lag was with Chrome. I'm using the Samsung browser now and it's fast. The update seems like it made my phone fast not that it was slow. I'm happy. Oh I'm using Nova so that probably helps.", "time": "23rd March 2016, 01:56 PM", "postID": "post65995363", "replies": []}, {"text": "most of it is fast except slight lag once in awhile. fps is slower compare to my oneplus 2", "time": "23rd March 2016, 04:39 PM", "postID": "post65998155", "replies": []}, {"text": "some games are laggier than on my Sony Z3, sometimes the transitions lag as well", "time": "24th March 2016, 06:05 PM", "postID": "post66016872", "replies": []}, {"text": "Great speed", "time": "24th March 2016, 07:29 PM", "postID": "post66018125", "replies": []}, {"text": "Sluggish. Actually slower than my S5.\n\r\nCamera performance very fast but the rest of the UI is sluggish.", "time": "27th March 2016, 01:39 AM", "postID": "post66055066", "replies": [{"text": "then you've done something wrong with it, because i also had a s5 lte-a g906s, and it was way faster than the normal s5, and this phone blows that phone away with speed. so you might want to do a full reset if your s7e is slower than your s5, because it has major problems.", "time": "28th March 2016, 02:08 AM", "postID": "post66070500", "replies": []}, {"text": "Agreed. You should try a factory reset because my s7 is infinitely faster than my s5 and s5 active that i still use as podcast/YouTube players. Keep in mind that my s7 is loaded to the brim with all my apps while the s5's have maybe 5 apps installed from the play store on them. \n\r\nIf the reset doesn't work then I'd look into getting a replacement because you might have gotten a dud.", "time": "31st March 2016, 05:38 PM", "postID": "post66130342", "replies": []}]}, {"text": "start to lag more from time to time", "time": "28th March 2016, 02:44 PM", "postID": "post66077636", "replies": []}, {"text": "Anyone notice unlocking and locking lag? \n\nI have no SD card. One simcard\n\nModel: G935FD", "time": "28th March 2016, 05:42 PM", "postID": "post66080288", "replies": []}, {"text": "Great job Exynos", "time": "29th March 2016, 02:49 PM", "postID": "post66094641", "replies": []}, {"text": "Fast in most areas, but inconsistent gaming performance. I uploaded a video showing these issues with even the simplest games like Miitomo: \n\n\n\n---------- Post added at 03:05 PM ---------- Previous post was at 03:05 PM ----------\n\nGaming performance leaves a lot to be desired.", "time": "1st April 2016, 09:05 PM", "postID": "post66150463", "replies": []}, {"text": "ye.,thanks for the post. s7 is really powerful", "time": "5th April 2016, 10:13 AM", "postID": "post66203188", "replies": []}, {"text": "s7 is really fast phone", "time": "5th April 2016, 06:18 PM", "postID": "post66209978", "replies": []}]}, {"title": "App launch speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/s7-edge/review/app-launch-speed-t3330780", "https://forum.xda-developers.com/s7-edge/review/app-launch-speed-t3330780/page2"], "threads": [{"text": "maybe apps aren't optimized yet for the new chipset and new version of android... there are lags for some apps...", "time": "9th March 2016, 05:04 PM", "postID": "post65742022", "replies": []}, {"text": "I agree, there are lags on some apps.  I am experiencing major lag on Dolphin Browser.", "time": "9th March 2016, 06:27 PM", "postID": "post65743488", "replies": []}, {"text": "It's fast, but touchwiz is heavy!", "time": "10th March 2016, 07:27 PM", "postID": "post65764111", "replies": []}, {"text": "it's really fast device", "time": "16th March 2016, 04:35 PM", "postID": "post65873596", "replies": []}, {"text": "Really smooth.", "time": "16th March 2016, 08:36 PM", "postID": "post65878179", "replies": []}, {"text": "App launching isn't amazing but it works just fine.", "time": "21st March 2016, 05:05 PM", "postID": "post65964174", "replies": []}, {"text": "Slick performance", "time": "27th March 2016, 01:21 PM", "postID": "post66061349", "replies": [{"text": "what is ur phone", "time": "4th April 2016, 04:40 AM", "postID": "post66183438", "replies": []}]}, {"text": "It's maybe apps aren't optimized yet for the new version of android but launching just fine to me. Really all are smooth.", "time": "17th April 2016, 12:31 PM", "postID": "post66406880", "replies": []}, {"text": "Use a different launcher like nova and the phone is very fast.", "time": "14th August 2016, 06:34 PM", "postID": "post68186600", "replies": []}, {"text": "S7 Edge Blue Coral\n\r\nThe device is zippy and fast when opening and closing apps.\n\r\nIt just works. I am comparing this to my experiences with the Snapdragon 820 Note 7 which had laggy responses when launching and closing apps.\n\r\nThe Exynos Chip is fantastic", "time": "19th January 2017, 06:59 PM", "postID": "post70631197", "replies": []}, {"text": "Up to an iPhone level. But some cases, specially gaming, it can be slow.", "time": "2nd May 2017, 02:08 PM", "postID": "post72130563", "replies": []}, {"text": "I have been facing lags while opening Snapchat and sometime Facebook, Snapchat lag is noticeable, at first s7 edge had no lag but its noticable after almost an year of use... Its an snapdragon variant..", "time": "9th May 2017, 10:59 AM", "postID": "post72224356", "replies": []}, {"text": "Really fast device, but it sucks in gaming, because the games aren't optimised for its Vulcan API, and for the device also.. But who needs games? when telephone is for calling, texting?", "time": "17th May 2017, 04:55 PM", "postID": "post72328826", "replies": []}]}, {"title": "Multitasking/RAM", "rating": 4.0, "links": ["https://forum.xda-developers.com/s7-edge/review/multitasking-ram-t3330781", "https://forum.xda-developers.com/s7-edge/review/multitasking-ram-t3330781/page2", "https://forum.xda-developers.com/s7-edge/review/multitasking-ram-t3330781/page3", "https://forum.xda-developers.com/s7-edge/review/multitasking-ram-t3330781/page6"], "threads": [{"text": "Should give 5-stars, but ram management is still f*ckd. Considering that my old N3 with 1gb less ram could hold more apps in ram than my new shiny S7E", "time": "8th March 2016, 11:23 AM", "postID": "post65718102", "replies": []}, {"text": "We closed my thread... http://forum.xda-developers.com/s7-e...t3329973/page5\n\nCheck this out : https://youtu.be/MQ8pTGCcW7A?t=155\nEven light apps can't keep in background.", "time": "8th March 2016, 12:48 PM", "postID": "post65719214", "replies": []}, {"text": "So if I installed a different ROM, would the RAM issue still there?", "time": "8th March 2016, 08:13 PM", "postID": "post65726700", "replies": []}, {"text": "No. You need root and a few lines in the build prop to fix it", "time": "9th March 2016, 12:24 PM", "postID": "post65737245", "replies": [{"text": "Would you mind telling what lines need to be added?", "time": "21st March 2016, 06:14 PM", "postID": "post65965136", "replies": []}]}, {"text": "Cmon guys its samsung we are talking about, they will probably fix it in future updates.", "time": "9th March 2016, 12:51 PM", "postID": "post65737606", "replies": [{"text": "I didn't know they fixed the problem with the S6 from last year...", "time": "9th March 2016, 03:20 PM", "postID": "post65740084", "replies": []}]}, {"text": "there is a HUGE improvement over the S6... full stars", "time": "9th March 2016, 05:04 PM", "postID": "post65742029", "replies": []}, {"text": "5 easy.. 18 apps is my record waaaay more than I need!", "time": "9th March 2016, 09:35 PM", "postID": "post65746769", "replies": []}, {"text": "I have 18 apps in memory, 4 of which are chrome tabs and none are games. I was just looking up verizons customer service number in the Google app. I switched to the dialer and typed in as much as I could remember. Then I switched back to the Google app, and it lost my search results. Typed in verizon customer service again and got the rest of the number. Switched back to the dialer and it cleared the numbers I've typed in. Pathetic. I was getting the customer service number because my unit was scratched out of the box and wanted to exchange it, now I think I'll just return it. My MXPE, which costs half of what this phone does, never had this issue.\nEdit: chrome also stutters but I think this might be due to all the ads running. I've always used Ada way before.", "time": "9th March 2016, 10:02 PM", "postID": "post65747189", "replies": [{"text": "You have S820 or Exynos ?", "time": "9th March 2016, 11:10 PM", "postID": "post65748092", "replies": [{"text": "SD820, on verizon.\n\nAlso now with 21 apps, everytime I try switching to a chrome tab it refreshes the page.", "time": "9th March 2016, 11:12 PM", "postID": "post65748120", "replies": []}]}]}, {"text": "With exynos i never had this issue like you.\nI can open easly 10-15 apps and when i switch to copy a number, I tried because of your story, I never had to reload anything, first try I could read multiple times the number and switch to another app an back.\nThis could be a SD820 issue and not a S7e overall problem.", "time": "10th March 2016, 07:55 AM", "postID": "post65753368", "replies": [{"text": "same here, have the Exynos.. have no problems with RAM what so ever, it holds 18+ apps in RAM", "time": "10th March 2016, 08:52 AM", "postID": "post65754084", "replies": []}]}, {"text": "exynos here... the same as the above... no problem at all", "time": "10th March 2016, 09:32 AM", "postID": "post65754581", "replies": []}, {"text": "Well. Comparing my sgs7e to sgs6 i had previously it is a big improvment. What was annoying in s6 was that it couldnt hold the chrome tab, switching between tabs was always refreshing them. Now the content stays. Oh and i am on Exynos (UK Virgin Mobile)", "time": "14th March 2016, 07:58 PM", "postID": "post65838415", "replies": []}, {"text": "Happy to hear that the RAM management is fixed from the S6 to the S7. Going to have to wait a long time before I'm upgrading past the S6, but I digress. I am still on 5.1.1 with AT&T-- never going with a carrier brand phone again. The bloat really tears up my phone. Rookie mistake.", "time": "16th March 2016, 03:38 AM", "postID": "post65863926", "replies": []}, {"text": "4GB of RAM & only less than 1.8GB to use", "time": "4th April 2016, 04:45 PM", "postID": "post66191614", "replies": []}, {"text": "Please see the YouTube video you can know about RAM. You can know RAM management good or bad? The address is below:\nhttps://youtu.be/sssTg8cwYE4", "time": "17th April 2016, 12:43 PM", "postID": "post66407026", "replies": []}, {"text": "I have read that S7 Exynos performs better in terms of apps in RAM compared to SD version. Any more reviews from Exynos people?", "time": "26th April 2016, 10:39 AM", "postID": "post66552286", "replies": []}, {"text": "Got the Exynos version and i'm happy with the ram management, haven't had any issues with apps reloading and the transitions are always smooth, no animation lag or anything", "time": "26th April 2016, 11:38 AM", "postID": "post66552973", "replies": []}, {"text": "I have 2 phones atm, iphone 6s (no plus) and this s7 edge exynos version with last ADP1 firmware. I must admit that now the iphone 6s has a better ram management.\nIt's NOT a ram amount problem, the iphones 6s use ALL 2GB, instead galaxy is too much conservative.\n\nWith same open apps: play store, stock browser, gmail, setting, signal app and tapatalk. \nIF i (with these apps opened in background) use browser for 10 minutes (NOT immediately) for example, i will see tapatalk (or signal, or gmail, depends on the moment) closed and refreshed, NOT on iphone with all ram saturated. Never.\n\nThis is really annoying for me because i love to have all in background using always the iphone 6s. \nIt's NOT a ram amount problem because with those apps opened i have 1.3-1.4 GB free and galaxy ram management tends to close the app after some times, in my case tapatalk i.e (not immediately)., instead use all ram, with 1.4GB free.\nThis is simply Ridiculous.\n\nHope with next updates this Ridiculous ram management will be better or i will be forced to use only iphone, again.", "time": "2nd May 2016, 10:31 PM", "postID": "post66665773", "replies": []}, {"text": "On Exynos here in NZ, no issues at all with RAM. the S6 Edge wasn't great for sure, the Note 5 was pretty good overall, but the S7E seems to be sorted.", "time": "4th May 2016, 12:47 AM", "postID": "post66683482", "replies": []}, {"text": "It's perfect for my Exynos version, I can use as many apps as I want in background, switch from an app to an other without any bug, It's really impressive ! \nI always have between 1.5 & 2 GB available RAM. It's the best multitasking I've ever seen", "time": "4th May 2016, 08:47 AM", "postID": "post66687508", "replies": []}, {"text": "Multitasking is too much conservative. I have alwsys at least 1.2 GB free when i.e. tapatalk reloads.\nWhy all that ram free? It has not sense. 😑", "time": "4th May 2016, 11:29 PM", "postID": "post66699255", "replies": []}, {"text": "I tested it out on my S7 Edge Blue Coral (Exynos Variant)\n\r\nAll my apps stayed in the background process from what I saw.\n\r\nI usually keep a few games (Asphalt 8, Tsum Tsum, and FFIX etc) in the background along with the usual slew of apps such as: messages, Kakaotalk, samsung browser, and a few more other apps.\n\r\nI have a habit of hitting the multitask button and just swapping from game to browser to kakaotalk to text on a consistent basis throughout the day.\n\r\nI have not seen anything re load unless it was designed to do so ( IDLE games normally reset as they have to update). \n\r\nMy Browser keeps all pages (snapdragon always reloaded them on my Note 7)\n\r\nAsphalt 8 just stayed on the whole time\n\r\nOverall, there is a lot less of waiting around for apps to reload on the Exynos variants compared to what I felt on my beloved Note 7 (Snapdragon 820)", "time": "19th January 2017, 07:06 PM", "postID": "post70631307", "replies": []}, {"text": "On nougat , ram management is really bad , always app reload in background", "time": "29th May 2017, 07:14 AM", "postID": "post72469621", "replies": []}, {"text": "nougat with stock rom, every app fine.", "time": "6th June 2017, 07:16 PM", "postID": "post72572729", "replies": []}]}, {"title": "Scrolling smoothness", "rating": 4.0, "links": ["https://forum.xda-developers.com/s7-edge/review/scrolling-smoothness-t3330782", "https://forum.xda-developers.com/s7-edge/review/scrolling-smoothness-t3330782/page2", "https://forum.xda-developers.com/s7-edge/review/scrolling-smoothness-t3330782/page3", "https://forum.xda-developers.com/s7-edge/review/scrolling-smoothness-t3330782/page4"], "threads": [{"text": "In chrome it's terrible. I'm not sure if it's due to the ads, since I have previously used Adaway. Scrolling is choppy with lots of frame drops. Web pages will stop loading at 90% and not let me interact with links. Often get a blank screen for 15secs while a page loads. I haven't had a browsing experience this bad since my Optimus V on sprint 3g. Looks like I'll be eating a $35 restock fee. I would've liked to try the Samsung browser but verizon has removed it.\n\nEdit: a reboot resolved the loading issues for now, but scrolling is still choppy. Extremely choppy if you scroll while ads are still loading.", "time": "9th March 2016, 10:28 PM", "postID": "post65747559", "replies": [{"text": "Same, I'm on T-mobile and tried the stock browser as well with the same result.", "time": "10th March 2016, 12:37 AM", "postID": "post65749068", "replies": [{"text": "Ugh, I was hoping sideloading the Samsung browser would've resolved the issue. I guess not.", "time": "10th March 2016, 12:47 AM", "postID": "post65749177", "replies": [{"text": "The stock browser actually very smooth. About same as my iPhone 6s Plus. Here is my test https://youtu.be/hq4exPxLSrY", "time": "10th March 2016, 06:47 PM", "postID": "post65763387", "replies": []}]}]}]}, {"text": "I've always used chrome beta on my devices but this time, I gave the stock browser a shot. It's amazing and absolutely smooth. The browser is so well optimized for this phone that it blows chrome out of the water.", "time": "10th March 2016, 02:22 AM", "postID": "post65750100", "replies": []}, {"text": "Lightning+ browser is smooth as butter and consumes minimal battery with amoled display mode and inverted grayscale rendering.", "time": "10th March 2016, 04:05 AM", "postID": "post65751095", "replies": [{"text": "What's lightning please ? and about inverted grayscale, i guess you have to be rooted right ?", "time": "5th July 2016, 01:07 PM", "postID": "post67612885", "replies": [{"text": "It's a browser. And no root needed.", "time": "13th July 2016, 08:04 PM", "postID": "post67731901", "replies": []}]}]}, {"text": "When it works it feels smooth and fast. There is an issue with scrolling, the screen is over sensitive and you do face a lot of accidental key presses. This has been reported by a fair number of people.", "time": "10th March 2016, 06:10 PM", "postID": "post65762768", "replies": []}, {"text": "Chrome's latest update to  V.49 fixed the scrolling lag for me entirely.", "time": "10th March 2016, 07:51 PM", "postID": "post65764547", "replies": []}, {"text": "The default browser is remarkably smooth, Chrome on the other hand is kind of hit or miss. It's smooth for pages you frequent often though.\n\n\nEdit: just loaded up Firefox with uBlock and it blows both stock and chrome out of the water. Definitely the most smooth experience. It's really only lacking a nice material theme/status bar.", "time": "12th March 2016, 04:56 PM", "postID": "post65799328", "replies": [{"text": "Truer words have never been spoken. I hate using Chrome on my phone. If I had to guess, I'd say it isn't properly optimized on Exynos-powered devices. I experience less lag on my HTC One M8. The experience is definitely worse on my Shield Tablet, which is why it is currently sitting in my drawer collecting dust.\r\nThe stock browser on the other hand has never forced me to unknowingly tap an ugly ad when trying to scroll down a page that was still loading. I have just upgraded my device to Nougat but haven't used the device yet to see if the situation has improved.", "time": "21st January 2017, 08:42 AM", "postID": "post70654460", "replies": []}]}, {"text": "stock browser has an ad block that you can download through the samsung store. That's what I'm using for my daily browsing and using chrome only for sites I need to get to that are bookmarked, like bills and school sites that are not ad infested.", "time": "16th March 2016, 03:22 PM", "postID": "post65872258", "replies": []}, {"text": "Butter smooth.", "time": "21st March 2016, 05:06 PM", "postID": "post65964183", "replies": []}, {"text": "I really do not recommend Chrome unless you use a Nexus device, stock browsers almost always perform better performance and efficiency wise. I just use stock, use it lacks some features and it doesn't even sync my bookmarks but it's not like I browse my daily readings on the phone, so it doesn't matter for me. When I browse the links almost always come from somewhere else so I don't need my favorites.", "time": "22nd March 2016, 06:05 AM", "postID": "post65972806", "replies": [{"text": "You can actually sync  bookmarks between pc on chrome and samsung stock browser on your phone. You juste have to install the samsung sync chrome extension, link to your samsung account and activate internet sync under samsung account on the phone. It doesn't work as good as chrome native syncing, but it works quite well (after it's finished syncing, of course).\r\nI recently switched to stock browser and i'm happy with it, ad blocker, finger print security, smoothness, and it seems to be al lot more battery-friendly than chrome", "time": "4th July 2016, 03:00 PM", "postID": "post67600334", "replies": []}]}, {"text": "scrolling smoothness on Skype is terrible. Even after loading Skype so that all the contacts are loaded, scroling through my chats is very laggy. However, the app itself is not.", "time": "31st March 2016, 05:56 AM", "postID": "post66122106", "replies": [{"text": "No it is not terrible. I can say it is fu... smooth!!!", "time": "31st March 2016, 03:59 PM", "postID": "post66128723", "replies": []}]}, {"text": "I have no issues with scrolling.  But my wife won't trade phones with me.  So I'm stuck with the S6.", "time": "11th April 2016, 11:34 PM", "postID": "post66314140", "replies": []}, {"text": "Stock browser is great, no issues there. Some apps still exhibit some slightly imperfect scrolling behaviour (e.g. Facebook is not perfect, but much better than my Note 5 ever was). With GPU profiling on, it's easy to see that there are still frame drops (on the SD820 version at least).", "time": "12th April 2016, 01:02 AM", "postID": "post66315003", "replies": []}, {"text": "After reading this thread i decided to give the stock brower another chance.  Soon as i got my phone 2 wks i switched to chrome.  Been using chrome for a while.  I must say its faster at times.  I did notice the lag on chrome just now.  So im going to try the stock one again.", "time": "12th April 2016, 04:31 AM", "postID": "post66316811", "replies": []}, {"text": "I'm random use the phone. Not only scrolling I've no issue about any smoothness. All are OK! It's very well for use.", "time": "17th April 2016, 12:55 PM", "postID": "post66407178", "replies": []}, {"text": "I've got any scrolling issue. IMO it's the best till now for smooth", "time": "11th May 2016, 10:12 PM", "postID": "post66808642", "replies": []}, {"text": "We'll never get a consensus on this. Its as much about browser performance as it is about personal preference  \n\r\nUnless you do a side by side with the exact web page loading (and all other things being exactly equal) ... Comparisons are pointless IMHO.", "time": "4th July 2016, 03:16 PM", "postID": "post67600518", "replies": []}, {"text": "For Me Latest Stock Rom, The Scrolling Is Smooth For All But Contacts When You Have A Lot I.E 200.", "time": "5th July 2016, 01:14 PM", "postID": "post67612961", "replies": []}, {"text": "I don't know about scrolling, but the extra sensitive screen makes it impossible to view web pages or simply use the phone. The accidental clicks and press of the navigation button make it a pain to use the phone. I need to be extra careful as not press a link or the buttons by mistake.", "time": "12th July 2016, 02:52 PM", "postID": "post67712370", "replies": [{"text": "Are you on a older firmware? I remember first getting this device and the accidental selection of links drove me crazy. Especially when just scrolling up or down and a \"selectable\" button was under my finger; it would select it. \nIt got fixed two updates in (I thing PC8) and now it never accidentally selects things. T-Mobile rooted tekhd v2", "time": "14th July 2016, 06:37 AM", "postID": "post67737199", "replies": [{"text": "I am on APF2 and i am still struggling. I am not sure if this is how android is supposed to work. I am coming from iOS and maybe thats why i am having the difficulty adjusting to it. But it truly is a pain, esp the navigation button. They should have been a little insensitive to pressure.", "time": "14th July 2016, 06:58 AM", "postID": "post67737362", "replies": []}]}]}, {"text": "Stock browser is the absolute best....fast and reliable......all features are useful.. ....especially fingerprint saves and security is a major key for me.", "time": "15th July 2016, 01:02 AM", "postID": "post67749628", "replies": []}, {"text": "Me too. Stock broswer is the best.", "time": "14th August 2016, 06:33 PM", "postID": "post68186590", "replies": []}, {"text": "but what about the sync with chrome. Some of us need history sync, page left on PC can be open with phone, bookmarks sync. The plugin for chrome is just useless! it makes massive mess with bookmarks sync between pc and mobile.", "time": "14th August 2016, 10:19 PM", "postID": "post68189283", "replies": []}, {"text": "Any one have the same choppy scrolling as I have in the recent app drawer.\nFor me, if I scroll, it jumps from app to app instead of smooth scrolling. Wondering if that's a feature or me messing up with some xposed modules.\nSo basically: Your recent app scrolling\nJumpy or smooth ?", "time": "17th August 2016, 07:42 PM", "postID": "post68234485", "replies": [{"text": "no. i've got 38 apps running in the background in the recent app drawer, and it slides from start to finish like butter, in either direction. but again, i have the exynos variant, which has much better memory management, and power management than the snapdragon820.", "time": "20th December 2016, 07:38 AM", "postID": "post70173044", "replies": []}, {"text": "Yes, this is a feature in many launchers. You can see as you scroll and as it shows letters, it will select the app starting by that letter. Even though I don't have this, I remember that I had it somewhere.", "time": "20th December 2016, 06:32 PM", "postID": "post70181188", "replies": []}]}, {"text": "Smooth for me", "time": "17th August 2016, 08:29 PM", "postID": "post68235242", "replies": [{"text": "Thanks.\r\nYeah, little more research and would not have had to ask this question. Oops.\r\nSo the problem was (probably) the animation speeds in developer settings. Had them on 0, but now back to 0.5 and a reboot fixed it", "time": "17th August 2016, 08:43 PM", "postID": "post68235445", "replies": []}]}, {"text": "Using stock ROM and scrolling isn't as smooth as you'd hope. It also has the tendency to lag. Not deal breakers for me but it's noticeable.", "time": "13th January 2017, 03:55 AM", "postID": "post70528699", "replies": []}, {"text": "Scrolling in the UI is really smooth without any lags or glitches.\n\r\nEven using Samsung's Internet Browser I found the scrolling very smooth on the sites I use.", "time": "19th January 2017, 07:12 PM", "postID": "post70631379", "replies": []}, {"text": "I have got choppy scrolling with frame drop.brand new device.update didn't solve problem.going to send it back under warrenty.hardware or software problem?", "time": "15th October 2017, 06:33 PM", "postID": "post74169436", "replies": []}]}, {"title": "Heat", "rating": 4.0, "links": ["https://forum.xda-developers.com/s7-edge/review/heat-t3330783", "https://forum.xda-developers.com/s7-edge/review/heat-t3330783/page2", "https://forum.xda-developers.com/s7-edge/review/heat-t3330783/page3", "https://forum.xda-developers.com/s7-edge/review/heat-t3330783/page17"], "threads": [{"text": "COOLEST phone iv'e ever used, even the most demanding games I toss at it, it doesn't go beyond warm.\n\r\nthe warmest time is when its charging!", "time": "9th March 2016, 05:05 PM", "postID": "post65742037", "replies": []}, {"text": "So far I have read that the Exynos version runs cool and SD820 (some samples) were heating up under heavy use.", "time": "9th March 2016, 05:33 PM", "postID": "post65742584", "replies": [{"text": "Do you have a link you can share? Cuz if anything I've heard that it's the Exynos 8890 is the hot chip.\n\nhttp://www.techtimes.com/articles/13...stem-works.htm\n\n\"For the first time Samsung has established within the smartphone heat-conducting copper tube for cooling. The new chip Exynos 8890 is not only powerful, but also hot!\"", "time": "9th March 2016, 08:29 PM", "postID": "post65745690", "replies": []}]}, {"text": "i got the exynos version and it does get warmed up while gaming .. it doesn't get uncomfortably warm .. but with that heat pipe i assumed there wouldnt be any heating issues.\r\nWhat temp. would be considered as abnormal ?\r\nand also which app can i download to find out the temp...... if any", "time": "9th March 2016, 08:24 PM", "postID": "post65745598", "replies": [{"text": "Tools? Your hand or an external thermostat or an IR camera\r\nInternal temp tells you nothing! Well almost", "time": "22nd March 2016, 08:25 PM", "postID": "post65983723", "replies": []}]}, {"text": "Mine has stayed cold (yes, cold) the whole time apart from when I use the Gear VR.", "time": "10th March 2016, 12:00 PM", "postID": "post65756549", "replies": [{"text": "When using the VR mine for really WARM but not as hot as my s5 can get, sometimes with general use. \n\nFunny thing is that with previous phones, heat seemed to = battery drain, however so far battery seems fantastic for me even when got after using the VR.", "time": "10th March 2016, 02:07 PM", "postID": "post65758433", "replies": []}, {"text": "Same here. As in REALY cold to the touch at times, other than when charging.", "time": "16th March 2016, 03:25 PM", "postID": "post65872294", "replies": []}, {"text": "Can i have your system version (all the informations like PDA...) please ?", "time": "21st October 2017, 05:55 AM", "postID": "post74238254", "replies": []}]}, {"text": "Mine is constantly warm around the camera area.", "time": "10th March 2016, 05:48 PM", "postID": "post65762386", "replies": []}, {"text": "Mine only got hot during initial setup. I haven't ran any games or benchmarks. It's warmer than my MXPE is but I think that's mostly because the MXPE has a bigger, thicker body which dissipates the heat.", "time": "10th March 2016, 05:57 PM", "postID": "post65762528", "replies": []}, {"text": "Mine warmed up while downloading a ton of movies to the SD card.  Ran under some cold water and it was fine from there. lol", "time": "10th March 2016, 06:23 PM", "postID": "post65762975", "replies": []}, {"text": "Mine ran slightly warm when downloading 20 app's at once, and I wouldn't be noticable if I didn't look for it heh. \n\nNo issues with my SD820 heating up. No issues while gaming either.", "time": "10th March 2016, 06:32 PM", "postID": "post65763126", "replies": []}, {"text": "Runs slightly cooler than Darth Vader's portable life support suit, though not as many flashing lights. You really have to look on the screen when your own eyes.", "time": "13th March 2016, 12:39 AM", "postID": "post65805606", "replies": []}, {"text": "I've been getting around 80-85f with chrome browsing low brightness but goes up to 95 to 100f with pandora and higher brightness. Does get warm but not too hot.", "time": "13th March 2016, 12:49 AM", "postID": "post65805720", "replies": []}, {"text": "The first and second day my device was prone to getting warm and got pretty hot during VR use. Today for some reason it remains cool to the touch even after about playing an hour of a 3D game and I used the Gear VR for about 30 minutes and it only got warm. I'm not sure what changed but the difference is really noticeable.", "time": "13th March 2016, 06:56 AM", "postID": "post65808657", "replies": []}, {"text": "Exynos variant here, been playing Angry Birds 2 for like 15-20mins and the phone was getting quite warm close to camera area. Is that throttling?", "time": "13th March 2016, 11:48 AM", "postID": "post65811850", "replies": []}, {"text": "its getting hot while watching youtube continuosly", "time": "14th March 2016, 01:14 PM", "postID": "post65831708", "replies": []}, {"text": "I got the s7 edge when it officially releases. First 2 days, lte enabled and default settings. It's get little warm that you can notice it. If I were to rate it 1-10 on warn department, I would say 3, 10 being really warm, borderline hot like HTC m9. 3rd and 4th day, 4G only and default settings. It doesn't get warm at all. Relatively cool. Tested it on my way to work. An hour trip. Playing Clash Royale 5-6 matches, watching YouTube, browsing reddit using reddit sync pro and moderate chrome browsing. Plus, it's only drain 7%.\n\nTldr Samsung S7 edge is a keeper. Gorgeous design, longer battery life, SD card and quite honestly, I really love the AOD. Wished there were more options and 3rd party notifications.", "time": "14th March 2016, 07:59 PM", "postID": "post65838433", "replies": []}, {"text": "anyone actually tested the temp using a temp gun? Otherwise, its all just speculation. I'll see if I can find mine to test while playing games or streaming video.", "time": "16th March 2016, 03:20 PM", "postID": "post65872209", "replies": []}, {"text": "Speedy and almost impossible to heat up even after long hours of gaming.", "time": "17th March 2016, 05:20 AM", "postID": "post65884287", "replies": []}, {"text": "Exynos here in Australia. Device from Optus. Definitely gets quite warm to scorching hot - particularly when using Chrome!! Planning to ask for replacement.", "time": "18th March 2016, 12:35 AM", "postID": "post65900548", "replies": []}, {"text": "How can you tell which chipset you have?", "time": "18th March 2016, 03:55 PM", "postID": "post65911057", "replies": []}, {"text": "If in the Americas... SD820 in the EU Exynos 8890 @jfkerekes", "time": "18th March 2016, 04:18 PM", "postID": "post65911467", "replies": []}, {"text": "What heat?  \n\nSeriously,  I've only noticed any heat while using this phone while it's fast charging.", "time": "20th March 2016, 11:22 PM", "postID": "post65952024", "replies": []}, {"text": "I love this phone, I hated phones that heat up since day one. I remember my note 1 used to get seriously hot over nothing. As soon as I bought a hot phone, I would sell it immediately.\r\nThere's something strange about the inconsistency of mobile CPU manufacturing. The fact that if you have two phones of the same model, one might get blisteringly hot, the other wont even break a sweat under heavy load.\n\r\nEarlier this year I had a 6S, it got mega hot and I had no idea why, 14nm process, nothing too strenuous. I returned it and got the same phone again, nothing. Phone was cool as ice.\r\nI really cant explain it. \n\r\nMy S7 edge is cool too, it raises to slightly above my relative hand temperature when gaming. Which is really good IMO, Samsung have really restored my faith in their brand with this phone.", "time": "21st March 2016, 10:05 AM", "postID": "post65957941", "replies": []}, {"text": "My phone didn't even get hot during initial setup.", "time": "21st March 2016, 05:07 PM", "postID": "post65964197", "replies": []}, {"text": "SD820 here. Only gets warm when I'm in a low signal area using the **** out of chrome. Other than that, stays nice and cool all day even though I'm constantly using the camera.", "time": "22nd March 2016, 03:44 AM", "postID": "post65971694", "replies": []}, {"text": "The snapdragon variant gets really warm. If you have a case on your phone, you will not notice at all. However if you don't have a case, even slight usage will be noticed. I am disappointed that so many phones with the Snapdragon gets warm/hot each year, but they continuously state how powerful the chip is. Of course it is powerful, but please reduce the power a tad if it will keep the device cooler for normal usage such as browsing the internet, texting, & even setting up the device for the first time.", "time": "22nd March 2016, 03:33 PM", "postID": "post65978943", "replies": []}, {"text": "my s7 edge exynos is the coolest phone i used even in game :]\ns6 and z5 heat like crazy", "time": "23rd March 2016, 03:53 AM", "postID": "post65989155", "replies": []}, {"text": "mine (exynos) is warm when in use but slightly cooler than my snapdragon 810 phones", "time": "28th March 2016, 02:43 AM", "postID": "post66070744", "replies": []}, {"text": "Thanks again,  I think I will stop thinking about it so much", "time": "9th April 2017, 06:47 PM", "postID": "post71793202", "replies": []}, {"text": "It depends on the ambient temperature of the room too. The place where I live has a room temp of 40 Degrees Celsius. Even if I use the phone for casual browsing and few calls, therm0 reaches 68 C. Imagine what the temps will look like when I play a game !😂. It might throttle down.", "time": "11th April 2017, 10:17 AM", "postID": "post71814240", "replies": []}, {"text": "Isn't that kind of high temperature dangerous?  We're entering summer and here the normal weather temperature is going to about 35c, how does the phone handle that kind of heat?", "time": "12th April 2017, 06:28 PM", "postID": "post71833303", "replies": [{"text": "Normal heat will make the phone slower but won't do any damage. Once it gets too hot, the phone will throttle to prevent it from reaching dangerous temperatures.", "time": "13th April 2017, 02:35 AM", "postID": "post71837804", "replies": []}]}, {"text": "When I record a video, the maximum this phone can go without turning the flash off is 10 minutes. Any idea how to solve this?", "time": "15th April 2017, 07:20 AM", "postID": "post71867085", "replies": []}, {"text": "It is my third unit, first two they overheated whenever I use 3G or 4G or play some games. This one, no never had an issue with overheating.", "time": "2nd May 2017, 02:09 PM", "postID": "post72130576", "replies": []}, {"text": "well my snapdragon s7 edge heats up on extended snapchat use, idk why does that happen.. not playing heavy games on it... Any possible solutions? is there something to worry about? is nougat update responsible ?", "time": "9th May 2017, 12:37 PM", "postID": "post72225337", "replies": []}, {"text": "Definitely dependent on weather, have only had mine for winter and spring now. CPU and battery normally round the same temp. Summer coming.  90% of the time below 30C- average I'd say abuot 26-28C. Always below 35C for normal activities. Got 40-50C when flashing ROM. Other than feeling occasionally warm, asymptomatic. \n\r\nMuch cooler than the old S5 - in winter, CPU averaging mid 30s and being about as high as 50 on normal use. Battery manages to keep quite cool comparatively, rarely every going above 40. Flashing ~70-80 . Surprisingly quite asymptomatic (other than the fever), given the temperatures though.", "time": "21st October 2017, 01:09 PM", "postID": "post74241384", "replies": []}]}, {"title": "Low light", "rating": 4.5, "links": ["https://forum.xda-developers.com/s7-edge/review/low-light-t3330784", "https://forum.xda-developers.com/s7-edge/review/low-light-t3330784/page2", "https://forum.xda-developers.com/s7-edge/review/low-light-t3330784/page3", "https://forum.xda-developers.com/s7-edge/review/low-light-t3330784/page9"], "threads": [{"text": "Best low light phone cam ever", "time": "8th March 2016, 11:24 AM", "postID": "post65718113", "replies": [{"text": "...that means you haven't seen Nexus 6P low light performance.", "time": "8th March 2016, 03:37 PM", "postID": "post65721957", "replies": [{"text": "I have. S7 beats it.", "time": "8th March 2016, 04:39 PM", "postID": "post65723000", "replies": []}]}]}, {"text": "I'm looking for a comparison S7 vs LG G4, especially in low light...", "time": "8th March 2016, 01:03 PM", "postID": "post65719440", "replies": []}, {"text": "They must be pretty dang close in comparison. Would probably be specific to the situation. Here are the specs:\nNexus 6P: f2.0 aperture and 1.55 μm pixel size. Not a great f stop, but that's some big pixels.\n\nS7 Edge: f1.7 aperture and 1.4 μm pixel size. Awesome aperture, especially for getting that background blurred out, but the pixel size isn't quite as big.", "time": "8th March 2016, 09:14 PM", "postID": "post65727665", "replies": []}, {"text": "Comparison with a G4 (to see individual images, right click on each image and open in new tab for full original uploaded on imgur)\n\nhttps://cdn.knightlab.com/libs/juxta...4-0e7075bba956\n\nI can publish more of these of some of you want", "time": "8th March 2016, 10:32 PM", "postID": "post65728771", "replies": [{"text": "Yes more of it please, night and low light. But original size...", "time": "8th March 2016, 11:33 PM", "postID": "post65729512", "replies": [{"text": "They are original size (the comparison tool resisez itself to adjust to your screen, but you can open each individual image with a right click + open in new tab as they were uploaded on imgur)\n\n---------- Post added at 01:38 AM ---------- Previous post was at 01:36 AM ----------\n\nHere you go, more comparisons G4 vs S7 Edge (for original image try right click + open image in new tab and it should lead you to the imgur URL)\n\nhttps://cdn.knightlab.com/libs/juxta...4-0e7075bba956\n\nhttps://cdn.knightlab.com/libs/juxta...4-0e7075bba956\n\nhttps://cdn.knightlab.com/libs/juxta...4-0e7075bba956", "time": "8th March 2016, 11:38 PM", "postID": "post65729536", "replies": [{"text": "Dude what? G4 is doing better then s7?!? How on earth", "time": "7th October 2017, 06:13 PM", "postID": "post74071162", "replies": []}]}]}]}, {"text": "I think objectively s7 picks up more detail in highlights where g4 seems to be doing slightly better with shadows. I also think that g4 is better with contrast (because s7 is overly contrasty), but s7 takes the prize because it doesn't have such prominent lens flare, which got very bad in one of the shots.", "time": "8th March 2016, 11:43 PM", "postID": "post65729610", "replies": []}, {"text": "http://i.imgur.com/MU54jwz.jpg\n\nYour G4 looks like it has the flare problem ?\nI really like the spectrum color, it's the only one that don't turn yellowish in low light.", "time": "8th March 2016, 11:50 PM", "postID": "post65729688", "replies": []}, {"text": "I really think the G4 is better in low light than S7. Except for the flare (it could have been that the lens was smudgy a bit, who knows), the G4 took better, more detailed and overall less noisy pictures. But, more importantly, it was closer to the real lighting in those scenes. The S7 would go all nuts with yellow-orangeish tints... When I took the photos, looking at them on the phones, I saw very little differences, but when I looked at them on a 27 inch monitor I saw where and how the G4 stood out.", "time": "8th March 2016, 11:59 PM", "postID": "post65729791", "replies": [{"text": "Hi @VictorC,\n\r\nThis is another Victor, from Bucharest as well! Thanks a lot for your comparison shots. I would like, provided you have the spare time, to meet and go together with a 3 smartphones comparison. I own a Nexus 6p and I am willing to bet will wipe the floor with S7 in low light (and not only). We can talk on private about this initiative.", "time": "9th March 2016, 07:51 AM", "postID": "post65734019", "replies": []}]}, {"text": "You definitely has lens flare problem. Check thiss thread : http://forum.xda-developers.com/veri...temps-t3186732\nTry to clean your lens\n\nboth pic from LG G4 :", "time": "9th March 2016, 12:20 AM", "postID": "post65729964", "replies": []}, {"text": "Damn after seeing the G4 up against the S7 camera.... I'm fairly disappointed.", "time": "9th March 2016, 03:10 AM", "postID": "post65731464", "replies": []}, {"text": "Here is another one in low light indoors:\n\nhttps://cdn.knightlab.com/libs/juxta...4-0e7075bba956\n\nAnd some daytime shots (sorry if they are out of place here):\n\nhttps://cdn.knightlab.com/libs/juxta...4-0e7075bba956\n\nhttps://cdn.knightlab.com/libs/juxta...4-0e7075bba956\n\nhttps://cdn.knightlab.com/libs/juxta...4-0e7075bba956\n\nBy no means do I think the S7 Edge camera is bad (far from it actually), it's just that I think it's too aggressive and, in low light, it has some trouble with finding the right white balance. Still, these things could be corrected via updates.", "time": "9th March 2016, 10:01 AM", "postID": "post65735378", "replies": []}, {"text": "You have a Sony or Isocell sensor ?", "time": "9th March 2016, 01:11 PM", "postID": "post65737909", "replies": []}, {"text": "Isocell", "time": "9th March 2016, 01:24 PM", "postID": "post65738101", "replies": [{"text": "Well that explains it.", "time": "9th March 2016, 01:32 PM", "postID": "post65738214", "replies": []}]}, {"text": "Actually it does not. I have yet to see a comparison between shots taken with S7/S7E with Isocell and Sony sensors", "time": "9th March 2016, 01:56 PM", "postID": "post65738599", "replies": [{"text": "There's a reason why all review units have the Sony sensor.", "time": "9th March 2016, 02:06 PM", "postID": "post65738750", "replies": [{"text": "Ahem...  Mine is a review unit. That's what I'm doing with it", "time": "9th March 2016, 02:07 PM", "postID": "post65738788", "replies": [{"text": "Hahahaha sure random internet person, I believe you.", "time": "9th March 2016, 02:10 PM", "postID": "post65738823", "replies": []}]}]}]}, {"text": "Here are imgur albums with photos from my previous reviews: http://victorcozmei.imgur.com/\n\nAnd my reviews get published here (romanian): http://economie.hotnews.ro/gadget\n\nNot that I need to make you believe I do reviews, but I think it's better if people don't start thinking there is a conspiracy out there )", "time": "9th March 2016, 02:16 PM", "postID": "post65738910", "replies": []}, {"text": "Lol nice! I didn't know Romania had the internet.\nIf Samsung tries to bait and switch me with an in-house sensor, then I'll return it immediately. I don't know how they got away with it last year.", "time": "9th March 2016, 02:26 PM", "postID": "post65739109", "replies": [{"text": "Actually, it has THE Internet  -> http://berniespeedtest.com/", "time": "9th March 2016, 02:57 PM", "postID": "post65739652", "replies": [{"text": "That site's hilarious! It reported my 60mbps+ LTE as 8.75mbps lol!\nThere goes it's credibility!", "time": "9th March 2016, 03:09 PM", "postID": "post65739885", "replies": []}]}]}, {"text": "It's not fair for the LG G4, you know now you got a problem with it...\nBut I still want to see a Sony Sensor.", "time": "9th March 2016, 03:23 PM", "postID": "post65740114", "replies": [{"text": "Ok, going back on topic I tested the S7E and the G4 in a more controled setting and tried a flash showdown aswel. Theese teste were in very low light to extremely low light (the photos are brighter than my eyes could actually see) and, while both phones did quite good given the circumstances, I say the S7E won this round. The real world test in low light, however, as with my previous photos posted here, not so much...\n\nFirst photo G4, second photo S7E. Very low light, a far away desk lamp on the left side and a window crack next to a curtain behind me:\n\n\n\n\n\nFirst photo is the G4, second is the S7E. This, to my eyes, was very-very dark. I could barely see enough to frame the picture. Here the S7E actually delivered a photo that not just captures shapes, but colors too. The G4, while it did capture shapes, it failed to produce much more than that... \n\n\n\n\n\nFlash test - First photo is the G4, second is the S7E. The S7E wins again and it's easy to see why.\n\n\n\n\n\n---------- Post added at 05:38 PM ---------- Previous post was at 05:37 PM ----------\n\n\n\r\nNo problem with the G4, get over that. It very likely had smudges on the lens hence the flares in some earlier photos.", "time": "9th March 2016, 03:38 PM", "postID": "post65740384", "replies": [{"text": "Yes I meant the smudges in the first pics taken outdoor at night. There's no that kind of flare, and obviously in very dark the S7 do better, it's like the Ultrapixel it forces to capture some light and pics taken with flash are better with S7.", "time": "9th March 2016, 03:47 PM", "postID": "post65740571", "replies": []}]}]}, {"text": "A few other low light shots (all auto with touch to focus before shot):", "time": "9th March 2016, 08:39 PM", "postID": "post65745879", "replies": []}, {"text": "This was the actual room (was offices) where the Titanic was registered in", "time": "25th January 2017, 10:58 AM", "postID": "post70720042", "replies": []}, {"text": "Thread cleaned.\n\nAll though we welcome heated debate and disagreements personal insults will not be tolerated. Play nicely please\n\n\nRegards\n\nSawdoctor", "time": "25th January 2017, 05:44 PM", "postID": "post70725859", "replies": []}, {"text": "Good overall. Poor low light performance compared to my Nexus 6P which was far superior. Still, can be fixed using Pro Mode and Manual settings.", "time": "13th February 2017, 12:09 PM", "postID": "post71010228", "replies": []}]}, {"title": "Photo quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/s7-edge/review/photo-quality-t3330785", "https://forum.xda-developers.com/s7-edge/review/photo-quality-t3330785/page2", "https://forum.xda-developers.com/s7-edge/review/photo-quality-t3330785/page3", "https://forum.xda-developers.com/s7-edge/review/photo-quality-t3330785/page26"], "threads": [{"text": "Here are some some daytime shots comparisons with an Lg G4. Just move the slider to view one photo or the other...\n\nhttps://cdn.knightlab.com/libs/juxta...4-0e7075bba956\n\nhttps://cdn.knightlab.com/libs/juxta...4-0e7075bba956\n\nhttps://cdn.knightlab.com/libs/juxta...4-0e7075bba956\n\n\nP.S. Sorry if they are out of place here. If so, admins feel free to delete this post.", "time": "9th March 2016, 10:32 AM", "postID": "post65735790", "replies": []}, {"text": "the s7 seems to capture more detail and better color reproduction. pics on g4 seem very smooth, lacking detail.", "time": "10th March 2016, 10:24 PM", "postID": "post65766917", "replies": [{"text": "Actually, if you look at the first comparison, I do think the S7 Edge camera is too aggressive with contrast and sharpening (and it is less saturated than Samsung has accustomed us) - try right-click and open image in new tab too see the full resolution pics. The G4 got colors and setting more true too real life in that one, but still, those shortcomings from the S7E are not deal breakers and could be easily addressed with camera updates.", "time": "10th March 2016, 10:28 PM", "postID": "post65766973", "replies": [{"text": "When looking at  full screen colours on the cars are better on the g4 for picture number 1. However, I really feel the contrast and white balance are better on the s7. Case in the point the cloud overcast is not visible on the g4. The picture seems  a bit hazy.\n\r\nOr maybe its just me.", "time": "10th March 2016, 10:46 PM", "postID": "post65767221", "replies": [{"text": "Good point. On the other hand, in the same picture the S7E missed the different colour of the sky/clouds at the end of the alleyway, trough the branches. The next comparison shows similar stuff - in the one with the statue - the G4 captures more of the color in the sky (actually closer to what it was in reality). While in the third one both are similar sky-wise.", "time": "10th March 2016, 10:54 PM", "postID": "post65767332", "replies": []}]}]}]}, {"text": "Wow! The Edge does so much better! Way to much brightness and less detail on the G4.\n\nThere is a bit too much sharpening on the third comparison on the Edge side, but it still looks better than the G4 that is kind of blurry.", "time": "10th March 2016, 10:35 PM", "postID": "post65767070", "replies": []}, {"text": "Hi guys\n\nfinally got my S7 Edge last night. My main usage is photo. I did some tests against my Note 4. The S7 definitely shows much less details when you download pics to a computer! I did take photos of all kind and this morning under a nice sun, it is more evident. Branches on trees don't show much detail and look all blured when you zoom. I did see that last night when taking pictures of documentation with both phones. Text when zoomed at 100 per cent looked like a pixel jam on some pages with the S7 under artificial light when Note 4 camera showed tac sharp text.\n\nHowever in poor light, the S7 is tremendous! But usually I sleep at night and that kind of photos is about 15 per cent of them all...\n\nSo I am a little disapointed in that regard with the S7. Videos are great, but photos lack of details. I don-t understand why Samsung has choosen to reduce the number of pixel in place of opting for a\n\n---------- Post added at 09:49 AM ---------- Previous post was at 09:44 AM ----------\n\nHi guys\n\nfinally got my S7 Edge last night. My main usage is photo. I did some tests against my Note 4. The S7 definitely shows much less details when you download pics to a computer! I did take photos of all kind and this morning under a nice sun, it is more evident. Branches on trees don't show much detail and look all blured when you zoom. I did see that last night when taking pictures of documentation with both phones. Text when zoomed at 100 per cent looked like a pixel jam on some pages with the S7 under artificial light when Note 4 camera showed tac sharp text.\n\nHowever in poor light, the S7 is tremendous! But usually I sleep at night and that kind of photos is about 15 per cent of them all...   \n\nSo I am a little disapointed in that regard with the S7. Videos are great, but photos lack of details. I don-t understand why Samsung has choosen to reduce the number of pixel in place of opting for a bigger sensor like Panasonic did with the CM1. I would have loved to see a CM2! Their 20MPx was producing better results than most dedicated cameras!\n \n(just realized that the site does not show original pîcs... so you cannot zoom...)\nAnyway out of some software bugs with the S7 (Samsung mail crashed in loops and Play Store kept saying data in background need to be activated when they were already... each time solved by a restart, the S7 is a nice piece of technology.\n\n\nPhil", "time": "11th March 2016, 08:49 AM", "postID": "post65773363", "replies": [{"text": "Why are you zooming in on all your pictures? I'm not going to blow them up past 8x10, and pictures are very sharp at 12mp, which is higher than 4k resolution.", "time": "16th March 2016, 03:49 PM", "postID": "post65872709", "replies": [{"text": "Just storing all my pics on my PC and they just show by default at 100%, so difference in quality compared to Note4 and S5 was very noticeable. Thay said if you are happy with looking at the pics in a smaller format, that's all count!   \n\r\nI was just making a point on saying Yes the camera is better in low light but No it is not as good as previous Galaxy in term of capturing details. Again, the only solution will have been to increase the size of the sensor, but that is another story and since they want to maximize benefit, will be for the next generation of Galaxy.", "time": "16th March 2016, 03:56 PM", "postID": "post65872862", "replies": []}]}]}, {"text": "Took a picture of our new Pup, first picture using the the S7 edge.\nImpressed with how awesome it came out, just used a tool to blur the background around him.", "time": "12th March 2016, 08:00 PM", "postID": "post65802247", "replies": []}, {"text": "It's confirmed that samsung uses 2 camera sensors ( again ) .. if anyone can post comparisons of two sensors (sony vs. samsung) is greatly appreciated.", "time": "13th March 2016, 01:22 AM", "postID": "post65806049", "replies": [{"text": "i saw an article in GSM arena wherein they compared the Sony and Samsung Sensors and theres no much difference.. they are both good in different aspects", "time": "14th March 2016, 03:09 PM", "postID": "post65833376", "replies": []}]}, {"text": "Those of us coming from less than spectacular cameras, such as me (HTC one m8), I'm finding the camera incredibly awesome. I got this phone mainly for the camera. The focus is super quick, the color reproduction is very good and I do enjoy the pro more the Galaxy S7 offers.", "time": "13th March 2016, 04:18 AM", "postID": "post65807129", "replies": []}, {"text": "Were this pictures taken with manual or auto mode on G4, since my son had a G4 and it's auto mode really sucks.", "time": "13th March 2016, 05:38 AM", "postID": "post65807903", "replies": []}, {"text": "Getting excited .. wish it's  18th now that I can take my hands on this beast..", "time": "13th March 2016, 06:00 AM", "postID": "post65808138", "replies": []}, {"text": "Loss of detail in normal/good light conditions vs Note 4 / S5", "time": "13th March 2016, 10:27 AM", "postID": "post65810837", "replies": []}, {"text": "S7 camera looks a bit over sharpened for my taste at the same time there is more details in every picture (shooting raw will be a solution for this).\nColors looks better and more realistic on the S7 (not knowing how the original scene looks), but the first shot is a bit too much contrast.\n\nOverall the S7 is the better camera in this shootout.", "time": "13th March 2016, 12:05 PM", "postID": "post65812092", "replies": []}, {"text": "Anyone else have issues with the front facing camera not focusing? \r\nHere are two pictures as examples, one with the front facing and the other with the rear camera", "time": "14th March 2016, 06:49 PM", "postID": "post65837105", "replies": []}, {"text": "This shooter is top notch. Love the Pro mode. That's the killer app I've been waiting for from Samsung or Android. The manual controls are easy to toggle and the snappy hardware enhances the experience.", "time": "15th March 2016, 01:00 AM", "postID": "post65843107", "replies": []}, {"text": "Please Samsung, ease down on the artificial image sharpening: youtube.com/watch?v=OR5UziCqXew", "time": "15th March 2016, 01:41 AM", "postID": "post65843560", "replies": []}, {"text": "Have anyone tried 10 sek shutter by hand? Is it possible to hold it still enough?", "time": "15th March 2016, 10:29 AM", "postID": "post65848685", "replies": []}, {"text": "10 seconds is too long, you're bound to move a little tiny bit. This was 4 and I used the steering wheel to assist me.", "time": "15th March 2016, 12:55 PM", "postID": "post65850620", "replies": []}, {"text": "I find the quality absolutely horrendous! It's smudgy. Terrible lack of detail. Other 3rd party camera apps take even worse photos. Glad I kept my Sony Z2\n\nSerious regret!", "time": "15th March 2016, 01:50 PM", "postID": "post65851416", "replies": [{"text": "As a owner of the both the S7 edge and Xperia Z2. I can say that the camera quality of the S7 edge is definitely a step up from the Xperia Z2.", "time": "16th March 2016, 08:38 AM", "postID": "post65866736", "replies": []}]}, {"text": "Lol at Z2\n\n---------- Post added at 02:20 PM ---------- Previous post was at 02:00 PM ----------\n\nhttps://www.dropbox.com/sc/gtbsajooz...ECek2QUI5IAkHa\n\r\nHere is a quick dropbox link to a few random photos, obviously gotta download first to see full resolution but the Infiniti pic had no useable lighting and the headlights being on shouldve messed with the shot quite a bit but it came out great.\r\nThe sky photo had light from the sun glaring straight at the lens but still preserved detail and color in the clouds yet you can still see the car and everything else just fine.\r\nSelective focus shot of a friend, you can even see some grey hair coming in lol.\r\nThe top shot of my car was after the sun set past the buildings.", "time": "15th March 2016, 02:20 PM", "postID": "post65851563", "replies": []}, {"text": "yeah it is more advanced and professional now, you can take a photo in bus or train in good quality", "time": "15th March 2016, 07:22 PM", "postID": "post65857060", "replies": []}, {"text": "I took these pictures of the aurora borealis today, slightly visible to the human eye. I'm impressed that a mobile phone can capture the night sky like this.\n\n10 sek. shutter and ISO 800.", "time": "16th March 2016, 12:00 AM", "postID": "post65861668", "replies": []}, {"text": "I'm starting to really like it.", "time": "16th March 2016, 10:05 AM", "postID": "post65867695", "replies": []}, {"text": "I did encounter an issue taking pictures. Over the weekend during my kids' talent show I took a number of pictures. They quality of them was spectacular. The problem I experienced is that one by one they started to essentially become unenviable with a blank photo and explanation point. Out of the 30 or so pictures I took only one was usable. All of the photos were saved on the internal RAM. Hopefully it was a fluke................", "time": "16th March 2016, 03:23 PM", "postID": "post65872261", "replies": []}, {"text": "For very good pictures I have to use the Pro mode because on Auto it tends to overexpose too much.", "time": "17th March 2016, 10:57 PM", "postID": "post65899382", "replies": []}, {"text": "", "time": "27th December 2017, 01:43 PM", "postID": "post74979101", "replies": []}, {"text": "I do think that 2015 smartphones had better cameras overall. Lg G4 rest in peace. The pic taken with pro mode raw( s7 edge exynos), edited snapseed. Maximum photo quality from my capabilities.\n\r\nPhoto 1 smudged camera sensor\r\nPhoto 2 Clear camera sensor\n\r\nI think there is a difference", "time": "30th December 2017, 11:20 PM", "postID": "post75019912", "replies": [{"text": "That is a difficult scene for any camera to do well, and I'd say your S7 did a pretty decent job overall.", "time": "23rd January 2018, 05:25 PM", "postID": "post75307629", "replies": []}]}, {"text": "Delete", "time": "20th January 2018, 12:40 PM", "postID": "post75268916", "replies": []}, {"text": "", "time": "23rd January 2018, 03:02 PM", "postID": "post75305874", "replies": []}]}, {"title": "Video quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/s7-edge/review/video-quality-t3330786", "https://forum.xda-developers.com/s7-edge/review/video-quality-t3330786/page2", "https://forum.xda-developers.com/s7-edge/review/video-quality-t3330786/page3"], "threads": [{"text": "Really it's video quality in better.", "time": "14th March 2016, 12:27 PM", "postID": "post65831048", "replies": []}, {"text": "Filmed this today.", "time": "29th March 2016, 04:18 AM", "postID": "post66087937", "replies": []}, {"text": "No comment about video quality. It's really best video quality to me. Really I like it.", "time": "17th April 2016, 02:20 PM", "postID": "post66408328", "replies": []}, {"text": "Filmed this to test the video the other day and not noticed much difference to the S6 camera\n\n\n\nhttps://youtu.be/fbpEwiPe_Hk", "time": "17th April 2016, 02:33 PM", "postID": "post66408511", "replies": []}, {"text": "ofc there is much diffrent thats why we got it in the first place :P", "time": "23rd April 2016, 12:07 PM", "postID": "post66507217", "replies": []}, {"text": "https://youtu.be/al9i0VnV0M4", "time": "30th April 2016, 12:02 AM", "postID": "post66611703", "replies": []}, {"text": "Best video quality on a smartphone thus far.  Hence why i switched back to android...", "time": "30th April 2016, 06:34 PM", "postID": "post66622350", "replies": []}, {"text": "Pretty", "time": "11th May 2016, 06:46 AM", "postID": "post66796795", "replies": []}, {"text": "https://youtu.be/20cVCmQIc_I\n\n2 slomo tests i did. Pretty nice if you ask me.", "time": "23rd May 2016, 09:17 PM", "postID": "post66993737", "replies": []}, {"text": "Here is a 240fps Slow Motion Sample of my Samsung Galaxy S7 edge G935f with Sony IMX260 Sensor. I just love the Camera. S6 edge plus had a horrible slow motion quality.\n\nhttps://youtu.be/Z4555d2qyMs", "time": "28th May 2016, 12:53 PM", "postID": "post67063347", "replies": [{"text": "Will definately try this and compare to others.", "time": "29th May 2016, 07:43 AM", "postID": "post67074062", "replies": []}]}, {"text": "I can do a comparison between s7 edge and s6 edge plus if you guys want.", "time": "29th May 2016, 12:07 PM", "postID": "post67076796", "replies": []}, {"text": "https://youtu.be/jIyB2EZCX2s\n\r\nIncludes slow motion footage", "time": "17th July 2016, 12:41 PM", "postID": "post67782751", "replies": []}, {"text": "Hi. I recorded this video at 1080p and I'm not satisfied of this result. It's like mud. I am looking at videos was taken with s7 edge and they are very different than my s7 edge. \n\nhttp://i.imgur.com/v9N8R19.png", "time": "17th July 2016, 03:04 PM", "postID": "post67784384", "replies": []}, {"text": "That's not a video", "time": "17th July 2016, 03:36 PM", "postID": "post67784780", "replies": []}, {"text": "From Worsley Woods yesterday, I've found zooming in can be a bit shaky\n\n\n\nhttps://www.youtube.com/watch?v=B5DWPsb1Pnk", "time": "20th July 2016, 01:11 PM", "postID": "post67827307", "replies": []}, {"text": "^^ nice. take my example video's there myself sometimes when checkin out then video quality...", "time": "27th August 2016, 03:05 PM", "postID": "post68395048", "replies": []}, {"text": "if you have root set more quality of record video \n\n\n1080p - 17mbps > 30mbps\n1080p60 - 28mbps > 50mbps\n1440p - 25mbps > 44mbps\n720p - 12mbps > 20mbps\n4K - 48mbps > 64mbps\nSlow Motion 240fps - 72mbps > 120mbps\n\nJPG quality - 96 > 100\nJPG burst quality - 92 > 100\n\nhttp://forum.xda-developers.com/s7-e...rates-t3439870", "time": "27th August 2016, 03:28 PM", "postID": "post68395349", "replies": []}, {"text": "hi . my Camera is  strange whenn shooting videos in low light . like  the objects appear to be double at some point . I'm using 1080p60", "time": "8th October 2016, 12:04 PM", "postID": "post69032243", "replies": []}, {"text": "https://www.youtube.com/watch?v=SjFj_5pHDJE?autoplay=0&origin=https://forum.xda-developers.com\"\r\n  frameborder=\"0\">\nhttps://www.youtube.com/watch?v=SjFj_5pHDJE", "time": "25th February 2017, 12:18 PM", "postID": "post71183391", "replies": []}, {"text": "https://youtu.be/EH5HzlMSWzk\n\r\nadded sound with samsung video editor", "time": "4th August 2017, 03:37 PM", "postID": "post73286368", "replies": []}, {"text": "Top video quality. 4k equivalent display.", "time": "31st August 2017, 06:27 AM", "postID": "post73606156", "replies": []}]}, {"title": "Selfie quality", "rating": 3.5, "links": ["https://forum.xda-developers.com/s7-edge/review/selfie-quality-t3330787", "https://forum.xda-developers.com/s7-edge/review/selfie-quality-t3330787/page2", "https://forum.xda-developers.com/s7-edge/review/selfie-quality-t3330787/page3", "https://forum.xda-developers.com/s7-edge/review/selfie-quality-t3330787/page5"], "threads": [{"text": "I don't take selfies often, but I guess it is as good it can be", "time": "8th March 2016, 11:25 AM", "postID": "post65718138", "replies": []}, {"text": "go on lets see your faces!", "time": "8th March 2016, 01:23 PM", "postID": "post65719774", "replies": []}, {"text": "Now, that's just the right thread for me! Being  part of the narcissistic generation—an in-born trait of my gen— I can and have a right to shine here! Yay! \n\nThe picture quality is 7 out of 10. That's a good rating! There are flaws, no insult intended. I know I can't expect Samsung to take the front seat and destroy its competitors with a 20MP front camera. They've done this starting the smartphone era and have since been in line with others. Still, a guy can dream! \n\nIn my honest narcissistic opinion, the LG scores higher in that department with an 8.5 out of 10. \n\nKeep in mind that in my rating a 10 is not possible anyways and that's because front cameras are an insult to self-centered people like me. Too weak, hiding my beautiful skin.", "time": "8th March 2016, 04:50 PM", "postID": "post65723192", "replies": []}, {"text": "As much as I love this phone and the rear camera, I honestly think that the front facing camera is very lacking. My iPhone 6s captures much more detail in my face. The Galaxy S7e seems to have a blur toward everything (yes, the smoothing features are off).", "time": "8th March 2016, 08:22 PM", "postID": "post65726860", "replies": []}, {"text": "Maybe this is just the company's way of slowly removing selfies from existence.", "time": "9th March 2016, 03:23 AM", "postID": "post65731613", "replies": []}, {"text": "Hardware or software issue? Still to smooth with a thirdparty camera app?\n\nSkickat från min SM-G935F via Tapatalk", "time": "9th March 2016, 10:17 AM", "postID": "post65735582", "replies": []}, {"text": "Not gonna lie, the front camera is like taking a picture through a potato.\n\nEdit: I tried a non-stock camera and it's actually a really good camera, so it's definitely software related. So WTF Samsung?", "time": "12th March 2016, 07:41 PM", "postID": "post65801959", "replies": [{"text": "Can u tell me the another camera app?", "time": "11th January 2018, 05:35 PM", "postID": "post75162776", "replies": []}]}, {"text": "Mine is defective so it never actually focuses on my face or anything for that matter, I compared with an S6 I have and the difference is huge, the S6 focused very well. \nThey use the same exact front camera so I'd venture to say its software related and will be addressed by Samsung. \nMy replacement will be here soon though which makes me happy.", "time": "12th March 2016, 11:49 PM", "postID": "post65805099", "replies": []}, {"text": "the quality is amazing.\n\r\n maybe there is a better camera app then stock?", "time": "12th March 2016, 11:54 PM", "postID": "post65805145", "replies": [{"text": "There are multiple availanble in the play store but most of them just add new features, the quality is the same overall", "time": "29th July 2016, 11:20 AM", "postID": "post67953255", "replies": []}]}, {"text": "Haven't really used it but if it's anything like the s6 one it's great.", "time": "13th March 2016, 12:34 AM", "postID": "post65805554", "replies": []}, {"text": "better than S6 cam,  more wider and i like the flash feature in front.", "time": "14th March 2016, 01:15 PM", "postID": "post65831720", "replies": []}, {"text": "Very bad: it lacks details, too smooth (and yeah, I've disabled beauty face), not possible to tweak the brightness... Even the iPhone 6 1.2Mpix front facing camera is way better.", "time": "17th March 2016, 11:06 PM", "postID": "post65899514", "replies": []}, {"text": "is this hardware or software. .my selfie are too smooth even i turn the beauty off. .is this defective or just normal?", "time": "19th March 2016, 06:09 AM", "postID": "post65921737", "replies": []}, {"text": "My S7 are to smooth as well (All filter turned off)\nCompared to my S6 it's night and day diffense i favor of the s6.\n\nAll s7:s i have seen have had this issue so i think it's the beauty filter that somehow is not turning itself off.\nAlso the s6 seems to apply a sharpning mask to compensate the lower resolution.", "time": "19th March 2016, 09:34 AM", "postID": "post65923539", "replies": []}, {"text": "Rear camera is awesome even can beat Apple but selfies are not so good", "time": "19th March 2016, 11:26 AM", "postID": "post65924762", "replies": []}, {"text": "I have an exynos s7 edge and I agree that the front-facing camera sucks balls. Even with beauty mode turned all the way down my face looks airbrushed.. Really annoying!!", "time": "29th March 2016, 11:52 AM", "postID": "post66092180", "replies": []}, {"text": "I sold my S7 because a) battery life not what expecting b) software wasn't to my taste and C) THE WORST SELFIE CAMERA I HAVE EVER USED", "time": "30th March 2016, 09:07 AM", "postID": "post66107239", "replies": []}, {"text": "Apple is stil king of the selfie... Selfie pics on S7 don't really turn out to well in lowlow light... Still much better coming from my s5 that one was awful!", "time": "7th April 2016, 09:05 PM", "postID": "post66245541", "replies": []}, {"text": "I don't take selfies often. But I know that both sides camera regulations is same. So image quality will be good.", "time": "17th April 2016, 02:27 PM", "postID": "post66408413", "replies": []}, {"text": "ITS THE SOFTWARE DUMMIES!!!!! GET A NEW SELFIE APP AND YOU'LL SEE THE DIFFERENCE. THEY WILL FIX IT SOON. DONT WORRY. JEEEEZ", "time": "21st April 2016, 09:13 PM", "postID": "post66483054", "replies": []}, {"text": "Well.. i have the G4 and S7e..\nThe G4 takes better selfies. Faaar far better than s7e..\nIn s7e my face seems distorted and it seriously looks weird.\nI double checked. I have a normal face...\nI think", "time": "21st April 2016, 11:17 PM", "postID": "post66484578", "replies": []}, {"text": "Compared to the g4 and g5 the s7e selfie cam is crap.\nIt seems to have a fixed focus. there is some sort of face detection, but i guess it's only used for exposure measurement. i double checked it by installing the google camera app on the s7e and g5. g5 has touch to focus. s7 doesn't. hope this is fixable via firmware-update.", "time": "24th April 2016, 10:35 PM", "postID": "post66530695", "replies": [{"text": "It isn't I own a s6 s7 and g4, s6 has the same problems", "time": "30th April 2016, 07:18 AM", "postID": "post66614636", "replies": []}]}, {"text": "Not using this function", "time": "11th May 2016, 06:47 AM", "postID": "post66796802", "replies": [{"text": "So why writting in this section??", "time": "1st August 2016, 07:13 PM", "postID": "post67999356", "replies": []}]}, {"text": "The front cam software is waaaay too artificial, even with all the filters turned off, i'd look as natural as a mannequin.\n\nPeople are meant to have some degree of flaws, i do hope they fix the software to make it more natural, or at least remove most of the processing an make that optional.\n\nAdding the option to change the lighting focus, like the iPhone, rather than making tap the screen as another way to take a shot would definitely remove the only advantage i noticed from the iPhone selfie modes (that 5MP is definitely not used right).\n\nWhat is a good selfie-cam app recommended by the people here?", "time": "2nd July 2016, 05:12 PM", "postID": "post67575399", "replies": []}, {"text": "Getting an odd blueish haze on edges of low light/warm light selfies other images are perfect and all filters are off any reason for this?", "time": "4th July 2016, 09:44 AM", "postID": "post67596913", "replies": []}, {"text": "Worst selfie cam I have ever seen in recent years!\n\nMy LG G2 took better selfies, the note 3, the note 4. Also the xiaomi mi note (which has one of the best selfie cams).\n\nThis selfie cam is horrendous! I just can't take a good shot with it! It doesn't focus and most of the time it focuses on the background although my face is just dead center! It's stupid!", "time": "29th July 2016, 09:09 AM", "postID": "post67952080", "replies": []}, {"text": "I love my front camera, takes great photos, I can't complain at all.", "time": "1st August 2016, 08:11 PM", "postID": "post68000200", "replies": []}, {"text": "Mine is blurry. I heard beacouse of the lenses that has focus set to infinity , the camera will focus on the background instead on u`r face. So that`s why the face is blurry ( not focused ). I have this problem too , but i heard some of S7 don`t have this problem. Also the rear camera is a bit strange... maybe beacouse of the 4:3 format , i don`t know , but i think S6 performed better on both FFC-Rear camera. The only thing i can see is the S7 is performing better on low light.", "time": "27th November 2016, 09:23 PM", "postID": "post69822548", "replies": [{"text": "I can't agree more. It focuses to infinity.", "time": "30th November 2016, 04:58 PM", "postID": "post69866413", "replies": [{"text": "How can I upload pictures here so that everyone can see the quality of this front camera.", "time": "12th October 2017, 01:37 PM", "postID": "post74130245", "replies": []}]}]}, {"text": "A bit of a step down from my previous Mate 8, but general quality is good even though there is room for more, which isn't really difficult for samsung to do. What makes me go nuts is the automatic pre fixed beauty mode that makes my skin look like silk, even with all features off  !  \nWould prefer more of a realistic look with the option of smoothing skin - by choice! - instead of this beauty crap.", "time": "29th November 2016, 02:48 AM", "postID": "post69841806", "replies": []}, {"text": "Selfie pictures are awful, background is in focus (ok), but the face is overprocessed (too much denoise and edge sharpening), so in result they look unnatural/plastic/blurry, whatever you call it... disappointed.", "time": "15th January 2018, 11:35 AM", "postID": "post75205522", "replies": []}]}, {"title": "Time to take picture (camera launch speed)", "rating": 4.5, "links": ["https://forum.xda-developers.com/s7-edge/review/time-to-picture-camera-launch-speed-t3330788"], "threads": [{"text": "The camera launch speed on this device is incredibly fast!\n\nTip:\n-Double-clicking the home button launches the camera.\n-Clicking the home button powers on the screen.\n-Finger print reader in the home button unlocks the device.\n\nCombined, if you double-click from screen-off it will go directly to the camera (and unlock the device by reading your finger) in about 1 second.", "time": "9th March 2016, 03:44 PM", "postID": "post65740507", "replies": [{"text": "Thanks jnake. I agree with you. It's real fact. Just I want to say that the s7 edge just looks sharper and better.", "time": "17th April 2016, 02:33 PM", "postID": "post66408512", "replies": []}]}, {"text": "Very fast", "time": "2nd May 2016, 06:03 PM", "postID": "post66661666", "replies": []}, {"text": "Fast", "time": "11th May 2016, 06:46 AM", "postID": "post66796793", "replies": []}, {"text": "Double tap on the home button and it launches instantly. Maybe the best camera on a smartphone today?", "time": "13th January 2017, 03:41 AM", "postID": "post70528573", "replies": []}]}, {"title": "Software (ease of use, features, etc)", "rating": 4.5, "links": ["https://forum.xda-developers.com/s7-edge/review/software-ease-features-t3330789"], "threads": [{"text": "This and the lack of foreseeable root are really the only two negatives regarding this device. Google's apps are just superior at every corner. \n\nMessenger is more sleek than Messages\nChrome is now as smooth as Internet, but scrolls faster, accesses all my stored passwords, can share history with my computer.\nGoogle's keyboard doesn't shove my friends emails into regular typing like Samsung's. \nGmail is much more appealing than Email. \nContacts and Phone - does anyone know how to get Google's variants working on a Verizon S7e?\n\nLove the phone, but am loving it so much more with each Google app I add to replace one from Samsung.", "time": "2nd April 2016, 03:44 AM", "postID": "post66154137", "replies": []}, {"text": "Software features of Samsung Galaxy S7 Edge are very neat. TouchWiz is overall very much improved and device has a great build quality. Multi Tasking Features are amazing, pop-up view windows, and single hand usage tweak by Samsung itself is responsive.\n\nhttps://www.youtube.com/watch?v=K42A_PQLzHc", "time": "7th April 2016, 03:52 PM", "postID": "post66240675", "replies": []}, {"text": "Waiting for tasting AOSP but it will kill many features", "time": "13th May 2016, 03:19 PM", "postID": "post66834635", "replies": []}, {"text": "I'm about to return the phone due to software. TouchWiz is hell. I come from a Motorola and a Sony phone,  those phones offered experiences close to stock Android with some added features. \n\r\nUsing this phone is incredibly complicated. The settings section is a mess and it crashes when you try to change the do not disturb options. The soft keys are just wrong. I have half of my ram consumed by Samsung apps and duplicate apps for everything. \n\r\nThe phone is just sad, this is not an android phone.  I'll give it a shot for the weekend, otherwise I'm going to swap this for the HTC 10.\n\r\nNow that I expressed my rage, could someone advice me on making this phone bearable?", "time": "3rd June 2016, 02:15 PM", "postID": "post67152235", "replies": [{"text": "I too come from a Sony device, and I love the S7 Edge. Sony software is very stable, and \"minimalistic\" compared to Samsung, LG and Huawei's customization, but damn it, I'm not hating it. I owned the first Galaxy Note. Yeah, you want some buggy and laggy TouchWiz crap? Take a good look at how things used to be, and then come back to the S7 and tell what you think. \n\r\nThe problem isn't that today's TouchWiz is bad, because it's not even close to being bad. It's just you that can't adapt to TouchWiz, so you curse at it and make sure to tell us what you think. TouchWiz isn't close to being \"stock Android\", and it's your own fault if you even thought that to begin with, but it's smooth, quick and there aren't any huge bugs (that I'm aware of). The camera software is awesome, the battery is awesome, the display is awesome, the design is awesome, but I guess you don't like the looks of the \"notification center\" and the Settings-app? You can theme those, and I recommend you install the \"Material Design\" theme from the theme store. It's free. You can also remove the annoying \"Quick connect\" thingy in the notifications by tapping \"edit\" and then disable it there (at the bottom). Then install Nova Launcher or Google Now Launcher. \n\r\nThe real issue here though is that you think there are too many options. Think about it. I get it. I really do, but this is such a first world problem that I can't even... \n\r\nBut alright, I've already mentioned the themes and stuff, so give me/us some more details on exactly what's annoying you, and we'll see if it's easily changeable.", "time": "3rd June 2016, 07:31 PM", "postID": "post67156665", "replies": []}]}, {"text": "I luv it samsung s7 egde", "time": "24th June 2016, 07:16 PM", "postID": "post67468116", "replies": []}, {"text": "Came from a HTC m8, and I do like the phone. As much as I use to rag on my girlfriend about her wanting samsung...they did right by me on it with waterproof alone. I did want the 10 though but this phone is keeping me content", "time": "25th June 2016, 04:54 AM", "postID": "post67472932", "replies": []}]}, {"title": "Charging speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/s7-edge/review/charging-speed-t3330790", "https://forum.xda-developers.com/s7-edge/review/charging-speed-t3330790/page2", "https://forum.xda-developers.com/s7-edge/review/charging-speed-t3330790/page3", "https://forum.xda-developers.com/s7-edge/review/charging-speed-t3330790/page12"], "threads": [{"text": "In 30 minutes of charge (with the Fast Adaptive Charger in the box) I got from 8% to 37% (from there to 100% it would have taken me another hour and 9 minutes according to the phone).\n\nKind of slow, to be honest. I know it's a bigger battery, but still... \n\n(I also tried a Motorola QuickCharger 2.0 and it recognized it as a fast charger, but the results were the same)", "time": "9th March 2016, 11:03 AM", "postID": "post65736152", "replies": []}, {"text": "Yeah not that quick tbh", "time": "9th March 2016, 11:10 AM", "postID": "post65736251", "replies": []}, {"text": "Nothing wrong with that. 37% can get you 3 hours of constant use..", "time": "9th March 2016, 12:21 PM", "postID": "post65737199", "replies": []}, {"text": "My fast charger isn't quite right I suppose. Di I need to turn something on. This is with the charger right out of the box. \n\nUsing a charger from my S5 way only a little more than an hour.", "time": "9th March 2016, 02:51 PM", "postID": "post65739538", "replies": []}, {"text": "I'm having charging issues with my S7 Edge. I received it last night and did a micro USB data transfer from my Galaxy Note 5. It took a couple of hours but the GN5 went from 75% battery to 71%. My S7E went from 57% to 27% and it was charging wirelessly. I've got it plugged into my laptop to charge right now and the device is draining while I'm using it. Any advice on what might be going wrong? I don't think it's the cable. I've got a fast charger but the outlet at my desk at work is behind me so I can't check my phone while it's plugged in.", "time": "9th March 2016, 03:46 PM", "postID": "post65740551", "replies": []}, {"text": "So I just tried the Fast Charging again -> 1 hour (60 minutes) = +67% (from 4% to 71%)\n\nSamsung Galaxy S7 Edge with it's original Adaptive Fast Charger from the box.", "time": "9th March 2016, 08:33 PM", "postID": "post65745776", "replies": []}, {"text": "Yeah it charges pretty slow, I wonder if samsung can enable quick charge 3.0", "time": "10th March 2016, 06:49 AM", "postID": "post65752627", "replies": []}, {"text": "Are you guys for real.\nIPhone 6plus has a 2950mah and takes about 4 hours to charge. S7 edge has 3600mah and takes around 1 hour and 57 mind to fully charge.", "time": "10th March 2016, 08:24 AM", "postID": "post65753731", "replies": []}, {"text": "Charger is pretty fast for the size of the battery, but my issue is that my battery is draining fast while in use.  Thought Android \"M\" had this Doze Mode,\nwell even when not in use, it still sucks down battery like a long distance runner in a heat wave.  basically to make your battery last you can make a call or 2.  someone invent a SMART BATTERY.  or a phone that runs on gravity", "time": "10th March 2016, 03:49 PM", "postID": "post65760205", "replies": []}, {"text": "I have the samsung fast wireless charger and it doesn't charge fast. If I plug in the cable it says fast charging. If I put on the fast charger is just says charging. I did some research and they said in the battery settings there was a way to enable fast charging for cable and wireless charging... I only found it for the cable... Thoughts or ideas?", "time": "10th March 2016, 04:37 PM", "postID": "post65761128", "replies": []}, {"text": "About 100 mins from 0 to 100 with included charger. Disappointed because it doesn't have QC3.0 when even a $400 midrange phone (the A9) will have it soon. I'll be even more disappointed if other sd820 phones have qc3.0.", "time": "10th March 2016, 05:53 PM", "postID": "post65762473", "replies": []}, {"text": "So i tried charging today with my Motorola Turbo Charger (Quick Charge 2.0) and in 30 minutes it went from 9% to 43%, that means +34%. \n\r\nCuriously, with the Samsung Fast Adaptive Charger from the box in 30 minutes of charge I got a 29% (from 8% to 37%). \n\r\nI have the S7 Edge Exynos version.", "time": "10th March 2016, 09:05 PM", "postID": "post65765751", "replies": []}, {"text": "can anyone try using iClever BoostCube 24W Quick Charge 3.0 to charge, its a 24w beast\n\nhttp://www.amazon.com/iClever-BoostC.../dp/B019GQ6S2C", "time": "11th March 2016, 05:14 AM", "postID": "post65771191", "replies": []}, {"text": "for me, 130 min from 5% to 100% with wireless fast charger (10W)....", "time": "11th March 2016, 09:46 AM", "postID": "post65774092", "replies": []}, {"text": "On my 10w wireless charger I'm taking about 2H: 30m.. thats with the Samsung fast charger.. I have a 18w qc 2.0 that I should get today and will see if I can get a little better", "time": "11th March 2016, 05:35 PM", "postID": "post65781632", "replies": []}, {"text": "I just did a side by side charge between my S5 and new S7 Edge on their stock chargers.\n\r\nS5 started at 23%\r\nS7E started at 26%\n\r\n1hr 15min later...\n\r\nS5 ended at 97%\r\nS7E ended at 100% \n\r\nSo these two phones have identical charge times. Both phones had all apps closed.", "time": "14th March 2016, 06:24 AM", "postID": "post65827162", "replies": [{"text": "S5 has a 2800mha battery s7 edge has a 3600mha battery.", "time": "14th March 2016, 09:36 AM", "postID": "post65829020", "replies": [{"text": "As above s7E has an extra 800mah, should of tested from 0-100 butbut either way the s7E charged more battery In the same about of time.", "time": "14th March 2016, 11:03 AM", "postID": "post65829975", "replies": []}]}]}, {"text": "Maybe I'm just a noob at the fast charging thing but this phone charges pretty fast to me. Coming from the LG G3 and have a battery extender of 9000 mlh. I like this battery charge !", "time": "14th March 2016, 01:03 PM", "postID": "post65831546", "replies": []}, {"text": "I felt like it charged pretty slow. Hope they can improve this.", "time": "15th March 2016, 02:49 PM", "postID": "post65852311", "replies": []}, {"text": "The charging is very fast for me. About an hour and ten minutes for a full charge. I'm using my aukey quick charger that I used on my lg g4.", "time": "17th March 2016, 12:17 PM", "postID": "post65888826", "replies": []}, {"text": "I took a nap yesterday, woke up and my phone was fully charged. It is insane how quickly a 3600maH battery charges on this phone..", "time": "18th March 2016, 06:07 PM", "postID": "post65913414", "replies": []}, {"text": "Guys, do you think have diference on battery drain if we charge it by fast charge or by normal charge?", "time": "20th March 2016, 01:43 PM", "postID": "post65943287", "replies": [{"text": "Guys what you have to say about this?", "time": "23rd March 2016, 02:27 AM", "postID": "post65988347", "replies": []}]}, {"text": "Charging is pretty fast, even when regular(non fast) charging.", "time": "20th March 2016, 11:24 PM", "postID": "post65952051", "replies": []}, {"text": "Recharging a high-capacity battery to 100% in just over an hour is a pretty amazing feat. When it's 3-4pm and you forgot to charge your phone the night before, you can plug in for an 30 min and get half the battery back in 20-30min. In another half hour+ you're at 100% again. For me it has been extremely fast.", "time": "21st March 2016, 02:44 AM", "postID": "post65954210", "replies": []}, {"text": "1hr 57mins from 1% to 100% standard charge rate more than happy with that, stock  charger.", "time": "21st March 2016, 05:57 AM", "postID": "post65955730", "replies": []}, {"text": "For something that is supposed to be a fast charge it's pretty slow", "time": "21st March 2016, 07:11 PM", "postID": "post65965935", "replies": []}, {"text": "I dont have personal experience of using  this phone but my friend is using it . As we have discussion about this , the battery size is big and charger quick for the size of the battery . To get the best result just turn off  internet connection to get fast result", "time": "23rd March 2016, 05:48 AM", "postID": "post65990148", "replies": []}, {"text": "I got a 18w charger thinking it will improve my fast charging speed on my fast wireless Choetech pad but it didn't. It seems like just using the cable that came with the phone is the fastest. I hate cables though. Oh well no big deal for me since I have 3 wireless chargers. \n\nThis is a good thread about S7 Edge charging times.\nhttp://forum.xda-developers.com/gala...c-2-0-t3330415", "time": "23rd March 2016, 01:49 PM", "postID": "post65995270", "replies": []}, {"text": "Not sure if someone has asked this yet, but I have had both the International Exynos and T-Mobile Snapdragon variants of the GS7 edge and noticed that the micro USB cable for the Exynos version is slighter thicker (thicker gauge) than the Snapdragon version. I purchased the Snapdragon version off of eBay so there's a possibility that the seller switched cables. Can anyone confirm this for me? I also wonder if the difference in thickness changes the charging speed.\n\r\nIn addition, I've found the battery life of the Exynos variant to be much better than the Snapdragon variant.  Too bad I dropped my Exynos phone and cracked the screen....", "time": "16th August 2017, 02:18 AM", "postID": "post73416815", "replies": []}, {"text": "Charging is fast like hell. You cant imagine how fast it charges with a fast charger.", "time": "31st August 2017, 06:26 AM", "postID": "post73606151", "replies": []}, {"text": "Yo people. I got the same problem as others, that my device charges very slow.\r\nThe problem persists since a few days. The device needs 3-4 hours to charge to 100%. \r\nSamsung continues to disappoint me. First the samsung lag, then the dramatically decreasing battery life and now this. Haven't had such problems with my htc one.", "time": "2nd December 2017, 03:05 PM", "postID": "post74711966", "replies": []}]}, {"title": "Screen on time", "rating": 4.5, "links": ["https://forum.xda-developers.com/s7-edge/review/screen-time-t3330791", "https://forum.xda-developers.com/s7-edge/review/screen-time-t3330791/page2", "https://forum.xda-developers.com/s7-edge/review/screen-time-t3330791/page3", "https://forum.xda-developers.com/s7-edge/review/screen-time-t3330791/page114"], "threads": [{"text": "exynos variant here\r\ncharged 100 % in the morning .. 25 % at 12 am .. 4 hours screen on time\r\ni used very little gaming and a bit of gear vr to try it \n\r\nbut with such a huge battery .. im not impressed.", "time": "9th March 2016, 08:32 PM", "postID": "post65745746", "replies": [{"text": "Got the same variant and was pretty impressed. Yesterday I had it 20 hours running until 2 percent. Sounds not much but I had 7 hours screen on time. Think this is pretty good imo.", "time": "12th March 2016, 06:19 PM", "postID": "post65800682", "replies": [{"text": "today's story is 10 am to 12 45 am\r\n100% to 20% with only 3 hours screen on time\r\nWifi or Data ( 3g/2g autoconnect) used\r\nonly messaging , a little bit of the camera and 5 mins of clash of clans used .\n\r\nis this normal .. or should i contact samsung ?", "time": "12th March 2016, 08:48 PM", "postID": "post65802917", "replies": [{"text": "This sounds not normal. It seems you got some apps running in the background and eating your battery. What apps are on your list at the top in settings?", "time": "13th March 2016, 03:39 AM", "postID": "post65806750", "replies": [{"text": "This is todays .. hope it helps you to help me", "time": "13th March 2016, 09:37 PM", "postID": "post65821367", "replies": [{"text": "Its most likely the Facebook app.", "time": "13th March 2016, 11:37 PM", "postID": "post65823151", "replies": [{"text": "I'll disable it and report back... Hopefully it helps", "time": "14th March 2016, 04:25 AM", "postID": "post65826146", "replies": []}]}]}]}, {"text": "No LTE? Are you in bad signal area? Weak signal is killer of batteries.", "time": "14th March 2016, 05:19 AM", "postID": "post65826605", "replies": [{"text": "I don't find LTE is needed but I'm in a pretty good signal area most times. \r\nYou think I should go to a Samsung service center ?", "time": "14th March 2016, 05:44 AM", "postID": "post65826840", "replies": [{"text": "Do a factory reset and clear cache from recovery a couple of times, i would recommend a reflash. I'm a sec at best buy.", "time": "14th March 2016, 09:29 AM", "postID": "post65828937", "replies": [{"text": "Did a factory reset .. cleared cache 3 times.\r\nand even stopped using the facebook app... and just 3 hours of screen on time.", "time": "15th March 2016, 08:30 PM", "postID": "post65858311", "replies": [{"text": "Same here", "time": "15th March 2016, 08:41 PM", "postID": "post65858514", "replies": []}]}]}]}]}]}]}]}, {"text": "6h 3min SOT over 1day and 16h use. @11% left, Heavy use, Exynos", "time": "11th March 2016, 12:25 PM", "postID": "post65776291", "replies": []}, {"text": "So this was yesterday once i got home. Mainly browsing the web, reddiit, gaming som light games. Still 40% left! I'm just AMAZED by my battery, especially coming from a G3. I'm using the Exynos variant", "time": "12th March 2016, 11:01 PM", "postID": "post65804535", "replies": []}, {"text": "Exynos", "time": "13th March 2016, 12:15 PM", "postID": "post65812237", "replies": []}, {"text": "Take a look at this...", "time": "14th March 2016, 12:02 AM", "postID": "post65823463", "replies": []}, {"text": "just amazing sot (s7 edge, international variant)", "time": "14th March 2016, 12:37 AM", "postID": "post65823864", "replies": []}, {"text": "...", "time": "14th March 2016, 12:40 AM", "postID": "post65823887", "replies": []}, {"text": "I doubt a different device will be any different. Unless the phone is acting up, chances are it's an app or setting causing the trouble. Screen brightness, under location settings, make sure scan BTW and WiFi are turned off, those have been big ones for me in the past. Right now I'm testing adguard which runs VPN on your phone to block ads and it's hitting my battery pretty hard, but with fast charging and big battery, I'm living with it for now.\n\n---------- Post added at 02:42 AM ---------- Previous post was at 02:41 AM ----------\n\nAlso, you might want to set data settings to default and let the phone pick the strongest signal.", "time": "14th March 2016, 08:42 AM", "postID": "post65828430", "replies": []}, {"text": "I've a UK version and I've been not really happy with battery life.\r\nFirst thing, I disables AOD,but that didn't change anything.\r\nI did a factory reset and I did set it up as fresh new without any App and/or Account.\r\nSo the phone has Wifi+LTE on and after 21h18m I've 36% left with 1h25m SoT done with Web Browsing.\r\nThe settings are standard, no sync, no AOD, Edge night mode.\r\nShould I return the phone?\n\r\nThanks for advice", "time": "14th March 2016, 09:32 AM", "postID": "post65828977", "replies": []}, {"text": "very impressed with the battery life, took it off charge yesterday around 9pm, been on all day on 4g, great 7 hours screen on time , this with auto brightness, 4 emails syncing", "time": "14th March 2016, 12:23 PM", "postID": "post65831001", "replies": []}, {"text": "Very disappointed, I am really thinking about returning the device to Samsung, these are my results:\nBattery Usage", "time": "14th March 2016, 01:12 PM", "postID": "post65831681", "replies": []}, {"text": "I'll let the pics speak for themselves.", "time": "15th March 2016, 05:02 PM", "postID": "post65854677", "replies": [{"text": "What do you suggest me to do? Replace or Return it?", "time": "15th March 2016, 06:06 PM", "postID": "post65855733", "replies": []}]}, {"text": "Android system and OS are on the top of the list for me with 24 and 18 precent and my display is third  at 16 percent for battery usage.", "time": "15th March 2016, 10:42 PM", "postID": "post65860539", "replies": []}, {"text": "Not one of you mentioned what are the settings for brightness? Auto or what? My S7 edge is excellent as well, roughly 7.5 h SOT.\n\n---------- Post added at 11:02 PM ---------- Previous post was at 11:00 PM ----------\n\nYou can install GSAM Battery and see what drains your battery the most.", "time": "15th March 2016, 11:02 PM", "postID": "post65860814", "replies": [{"text": "Auto here.\nI also did a last test, no SIM card, airplane mode, only WIFI on, it loses 2.3% battery/h in standby and screen off (just 3 mins SoT to check GSAM app).", "time": "15th March 2016, 11:03 PM", "postID": "post65860863", "replies": [{"text": "That's bad. Did you try wiping and reinstalling the complete phone? But choose not to restore your apps from Google Playstore, and then see what happens", "time": "15th March 2016, 11:05 PM", "postID": "post65860899", "replies": [{"text": "That's exaclty what I did, the phone has no app installed (outside GSAM), I did 2 Factory Resets and 2 Cache Wipes. I also reflashed the same ROM with Odin.", "time": "15th March 2016, 11:08 PM", "postID": "post65860938", "replies": [{"text": "On what carrier are u? Maybe you should try a rom from a different carrier?", "time": "15th March 2016, 11:09 PM", "postID": "post65860959", "replies": []}]}]}]}]}, {"text": "I've had my S7 Edge Exynos for 15 months now and noticed a very big drop of in battery life in the last 6 weeks and had 2 updates on that time at least. \n\r\nIn normal mode, I get 7 hours sot and with some battery saving like full hd, 10% less brightness and reduced CPU, I get 8.5 hours average. Best was 10 hours with those battery saving settings at the end of September. \n\r\nNow recently after these last couple of updates I am getting 4-4.5 instead of 8 and some days 3.5. I'm pissed off big time. My main concern about my phone is good battery life and now it's gone to trash so suddenly.  Now yeah, you will get some slight degradation over time, but this is just BS from Samsung and their updates.\n\r\nNow out of desperation, I factory reset the phone after backing up my stuff on the smart switch program on my pc. This restoration did work, but there was a major error. After you enter your Gmail login it usually restores your apps and data nicely for you, but my phone did nothing, instead stalling on a solid white screen. Took 6 hours restoring all my passwords and stuff because of this error.\n\r\nSince reset, there has only been a tiny increase, not worth the hassle.  I'd take it to my Samsung repair centre, but they sneakily only cover battery issues for 1 year and the rest of the phone for 2 years. With batteries being non removable now too, that's a sly stunt to pull on their loyal customers.\n\r\nHas anyone put an older Samsung firmware on with Odin and got back their battery mojo?  That's my last resort before dumping this phone for something else and it will be a while before I get Samsung again.", "time": "23rd February 2018, 04:48 AM", "postID": "post75663695", "replies": [{"text": "Mine is S7 Edge Snapdragon with 2 hours SOT after 13 months", "time": "23rd February 2018, 04:51 AM", "postID": "post75663710", "replies": []}, {"text": "Did exactly that recently what you are asking for, nothing has changed at all.", "time": "23rd February 2018, 10:32 PM", "postID": "post75672683", "replies": []}, {"text": "Mine is only 10 months. Are you using custom rom and kernel? \r\nI always underclock to a conservative 2ghz, undervolt and all that tweaks to maximise juice, max 7 hours SOT. Until recently I switch to stock oreo beta rom. Still acceptable imho. Maybe I will face those issue that all of you are having some months later.", "time": "28th February 2018, 12:30 PM", "postID": "post75724356", "replies": []}]}, {"text": "https://www.androidpolice.com/2017/0...he-galaxy-s7s/\n\nI saw this article about the battery. Samsung claims that the S7's battery will retain 80% of its capacity after 2 years use and the S8 has improved on this to only degrade to 95% in the same time.\n\nUsing accubattery today, it says my 15 month old S7 Edge has 65% capacity. Based on that 2.33% degrading per month, I should have only 56% left after 2 years use. A far cry from 80%.  FML", "time": "23rd February 2018, 11:40 PM", "postID": "post75673078", "replies": [{"text": "The capacity of my now 23 month old device is 2,333 mAh according to AccuBattery.  \r\nThis means a capacity of 65% and a degrade of 1.5% per month. Better stats than yours but anyway horrible.\r\nThis leads me to not recommend a samsung device to anyone. The nearly 4 year old htc one my father uses has a better battery performance.", "time": "2nd March 2018, 08:59 AM", "postID": "post75744501", "replies": []}]}, {"text": "Hi ... I want to share with you the best combination I've ever used [Batman ROM v1.5.0 + BatStock Kernel v1.4.5] ... I tried may many ROMs and Kernels, but that combination was the best ... I advise u to use it. I applied FHD Resolution + 40% Brightness all the time.", "time": "28th February 2018, 01:01 PM", "postID": "post75724641", "replies": [{"text": "You can have that airplane mode and cheat yourself while the majority of users switch on their data for real usage.", "time": "28th February 2018, 02:12 PM", "postID": "post75725304", "replies": []}]}, {"text": "Samsung sucks, touchwiz is laggy, edge design keep misclicking. standby is ****. I have z3 with better life [kitkat].only nice thing is amoled screen. \nWill switch to lg v30.", "time": "16th March 2018, 01:51 AM", "postID": "post75904609", "replies": []}]}, {"title": "Standby drain", "rating": 3.5, "links": ["https://forum.xda-developers.com/s7-edge/review/standby-drain-t3330792", "https://forum.xda-developers.com/s7-edge/review/standby-drain-t3330792/page2", "https://forum.xda-developers.com/s7-edge/review/standby-drain-t3330792/page3", "https://forum.xda-developers.com/s7-edge/review/standby-drain-t3330792/page48"], "threads": [{"text": "sleeps like a baby, 0% drain on 8h sleep.", "time": "11th March 2016, 12:26 PM", "postID": "post65776326", "replies": [{"text": "Which model and processor do u have? Snapdragon 820 or?", "time": "29th March 2016, 12:07 AM", "postID": "post66085781", "replies": [{"text": "He has a S7 edge with the Exynos. (I looked at his posts)", "time": "29th March 2016, 12:51 AM", "postID": "post66086207", "replies": []}]}]}, {"text": "10% drain for 8 hours (but I had my  enabled the \"Always On Display\" to Show the Time)", "time": "11th March 2016, 12:31 PM", "postID": "post65776403", "replies": []}, {"text": "2-3% overnight for me. AOD off.", "time": "11th March 2016, 02:11 PM", "postID": "post65778051", "replies": []}, {"text": "I had been having an issue where mine was never entering deep sleep. I tracked it to two things. Google voice recognition on every screen and auto backup. Once I turned those off, the battery drain seems much improved, although I only made those changes this afternoon.\n\nIf you're having issues you might try to identify the wakelock via ADB. Run the below code in a loop and see what pops up. It worked for me.\n\n\r\nThat being said, I sure miss having root to run BetterBattery Stats. . . . Sigh. . . .", "time": "11th March 2016, 08:49 PM", "postID": "post65784799", "replies": [{"text": "Maybe I have the same issue. How could you turn the Google voice recognition and the auto backup off?\nTy", "time": "12th March 2016, 07:33 AM", "postID": "post65791527", "replies": []}, {"text": "Where can i turn those 2 features off? thank you", "time": "12th March 2016, 02:51 PM", "postID": "post65797358", "replies": [{"text": "You will find voice recognition in the Google app under settings/voice/OK Google. The second one is in settings/backup and reset under samsung account.", "time": "12th March 2016, 04:02 PM", "postID": "post65798374", "replies": []}]}, {"text": "Any updates? did you try with AOD off? I think that was my issue, with AOD on, the phone never dozed...with it off, its sleeping like a baby! finally this crying baby is sleeping!!!", "time": "16th March 2016, 12:34 AM", "postID": "post65862080", "replies": []}, {"text": "Thanks for the ADB command.  I'm showing \"AlpmModeManager\" as a \"Doze_Wake_Lock\" (I modified the grep string a bit because partial wasn't giving any hits)...  Any idea what that is?", "time": "16th March 2016, 01:51 AM", "postID": "post65862904", "replies": []}]}, {"text": "sorry for the stupid question: does S7 Edge enter deep sleep automatically?\n\r\nI am having a serious battery drain issue in standby. I did just turn off my google voice recognition on every screen (thanks czucker) so I'll see what happens. Im kinda upset with the performance though. I picked up the phone on Tuesday from my local sprint store (pre-ordered and it came in early) so maybe the phone is still learning my usage patterns but still the standby battery drain is concerning...", "time": "11th March 2016, 10:12 PM", "postID": "post65785997", "replies": [{"text": "I fixed standby drain by turning off NFC and set OneDrive to only upload when charging. Donno if thats your problem, but its my best tips since it worked for me", "time": "12th March 2016, 01:01 PM", "postID": "post65795836", "replies": [{"text": "Thank you! After a few days usage, still not getting good battery life,  usage time is around 11-12 hrs, the battery drain appears to be android system. I've turned off almost all apps from notifications and auto updates. Reading other posts the exynos version is getting great life.  The 820 and Android system aren't playing nice...", "time": "13th March 2016, 11:09 PM", "postID": "post65822754", "replies": []}]}]}, {"text": "So I've had this phone for about a week, I kept hoping that the battery drain will get betters, specifically \"Android System.\" Android System uses about 30-35% followed by screen (which is normal) followed by Android is at 16%. When the screen is off it drains almost as much batter as when the screen is on  so if someone can please help me with the battery drain I'd really apriciate it.", "time": "12th March 2016, 05:01 PM", "postID": "post65799424", "replies": []}, {"text": "In my first full day with the S7 Edge I was not super impressed with the battery.  From 7am to 9pm, from a full charge I ended the day around 10% with very minimal. Maybe the large screen takes up more juice than I thought---I was expecting the larger battery to last me quite a bit longer. Coming from the HTC M9 and that battery ended my day around 30%.", "time": "13th March 2016, 02:48 PM", "postID": "post65814445", "replies": []}, {"text": "I fully charged the phone 100%  before bed. Next morning, 8 hours later battery down to 12 % with android and screen sharing the usage. Next day I resetted the phone to uninstall all my apps and tried again - still almost same result. Is there anything I can do to investigate this? I have turned off Google Voice and Automatic Backups already - the huge battery is performing worse than the htc one m7 i replaced \n\nAny suggestions?\n\nEdit: Should have mentioned - the phone gets untouchable by morning! hot as anything - i guess i should be contacting Samsung", "time": "14th March 2016, 12:25 AM", "postID": "post65823736", "replies": [{"text": "No suggestion. It is best to contact Samsung, as this behavior is not normal. These phones are made to be used, and not for us to turn off almost everything just to get through a day.", "time": "14th March 2016, 11:30 AM", "postID": "post65830314", "replies": []}]}, {"text": "Guess when I tuned off the AOD xD \n\n\n\r\nJust had to try tu turn it on to see how much drain I got, and it was ALOT! turn this (and NFC) off guys, and ur drains will be gone! =D", "time": "16th March 2016, 09:22 AM", "postID": "post65867235", "replies": []}, {"text": "Guys if you have Quick Tools enabled as one of the Edge tools, try disabling it. This is what I just noticed:", "time": "16th March 2016, 10:51 PM", "postID": "post65880327", "replies": [{"text": "All apps that are part of android system report this percentage.", "time": "16th March 2016, 11:14 PM", "postID": "post65880629", "replies": []}]}, {"text": "Had an issue with the \"Pocket\" app. This awful crap drained almost 10% of my battery and I did not even used it (I did not setup the app and did not opened it.. not even once..). All good after I uninstalled it.", "time": "17th March 2016, 12:23 AM", "postID": "post65881500", "replies": []}, {"text": "My phone seems to like to hang at 307 MHz instead of going into deep sleep most of the time. I'm getting really bad standby time. It's almost like there is no difference bewteen standby and screen on", "time": "17th March 2016, 05:24 AM", "postID": "post65884315", "replies": []}, {"text": "When put on airplane mode, it will drain 1% overnight. Flawless. However, during the day it will drain about 1% per hour.", "time": "18th March 2016, 06:09 PM", "postID": "post65913443", "replies": []}, {"text": "I'm not having much luck.... Today's phones should have this mysterious battery drain thing fixed. I unplugged thhone from charger at 12:04 with 100%. It's been an hour and I'm now at 95%. I specifically didn't touch the phone to have doze activate. \n\n5% an hour seems awfully alot. Curious what the culprit is. The phone has gone to doze in the past so I'm not sure what the issue is. Phone appears to be in doze because I sent an email to my work and Gmail and didn't get a notification on phone...\n\nYou'd think NFC and aod wouldn't make much or a difference", "time": "20th March 2016, 06:06 AM", "postID": "post65938725", "replies": []}, {"text": "I also confirm that AOD turned off makes a huge difference, at least on my device. I wonder how Nokia could implement theirs without having drains and sh.t.", "time": "20th March 2016, 08:31 AM", "postID": "post65939844", "replies": []}, {"text": "Here are my results overnight. Don't think this is very impressive", "time": "20th March 2016, 02:45 PM", "postID": "post65944190", "replies": []}, {"text": "Can someone help me with this?\n\n\n\n\n\nInviato dal mio SM-G935F utilizzando Tapatalk", "time": "25th March 2016, 01:27 PM", "postID": "post66029576", "replies": []}, {"text": "My battery life is not that impressive either so far...\n\nRanges from 2 1/2 to 4 hours SoT depending on what I am doing.\n\nI lose anywhere between 5% to 13 % overnight.\n\nUsing Gear VR, my phone heats up within 30 minutes and a message pops up asking me to let it cool down before I continue using it.\n\nA bit disappointed but I am going to conduct more tests and try different settings to understand the issue better.\n\nI was expecting much better battery life than this considering the praise the battery has been getting in reviews and the generous 3600 mAh battery included.", "time": "26th March 2016, 05:14 AM", "postID": "post66041070", "replies": []}, {"text": "I have the Exynos version..and getting great battery life and standby now that Ive cut off the \"google voice search from any screen\". Plus cutting off AOD..that was killing my battery life when i first got the phone.", "time": "29th March 2016, 09:57 AM", "postID": "post66090897", "replies": []}, {"text": "Which rom you are using for s7e", "time": "13th February 2018, 03:22 PM", "postID": "post75553840", "replies": []}]}, {"title": "Heavy use endurance", "rating": 4.5, "links": ["https://forum.xda-developers.com/s7-edge/review/heavy-endurance-t3330793", "https://forum.xda-developers.com/s7-edge/review/heavy-endurance-t3330793/page2", "https://forum.xda-developers.com/s7-edge/review/heavy-endurance-t3330793/page3", "https://forum.xda-developers.com/s7-edge/review/heavy-endurance-t3330793/page4"], "threads": [{"text": "I easily get 6-7 SOT", "time": "10th March 2016, 07:28 PM", "postID": "post65764145", "replies": []}, {"text": "Currently at 20hrs off the charger, 6hrs SOT and 35% left. I'd imagine in a continuous use case I could get 12hrs.", "time": "10th March 2016, 08:06 PM", "postID": "post65764781", "replies": []}, {"text": "11 hours off charger,  4.5 hours screen on\nNot impressed", "time": "11th March 2016, 03:42 AM", "postID": "post65770358", "replies": [{"text": "Wait, you're not? That's amazing. Especially if you're coming from G920/5. >_>", "time": "11th March 2016, 04:58 AM", "postID": "post65771064", "replies": [{"text": "I had a note 4. Lasted me all day with ~15% by end of day\nHad iphone 6s+ same\nSo far s7 edge is needing a cord before end of my day. Haven't needed one since my s4", "time": "11th March 2016, 10:23 PM", "postID": "post65786132", "replies": []}]}, {"text": "Look at your signal strength.. How do you expect the radio not drain the battery if thats normal with your operator or location? Thats a good battery life assuming the radio is causing some extra battery drain.", "time": "18th March 2016, 08:43 PM", "postID": "post65916015", "replies": []}]}, {"text": "I'm impressed so far on first charge I got 16 hours with 5 hours screen on time. That is about 1 1/2 hours of games,  some Facebook,  intent browsing,  and airwatch.  With the v10 I would have burned thru 2 battery's and then some to accomplish this.", "time": "11th March 2016, 05:46 AM", "postID": "post65771492", "replies": []}, {"text": "wow without mobile data my phone (note 4) barely lasts 4h! thats amazing  No idea how much it lasts with hspa+ :| and it will last like 1.5h in gaming, anyone can try to play games :? I just played for a few minutes and monitored my percentage and estimated it!", "time": "11th March 2016, 11:25 AM", "postID": "post65775409", "replies": []}, {"text": "eh. about 8 hours with a lot of snap chatting which really drains battery fast. Also was bunch of downloads, a benchmark run and few other things since I got the phone. My note edge would have lasted 4-5 hours if I was lucky.", "time": "12th March 2016, 08:24 AM", "postID": "post65792114", "replies": [{"text": "That is a great result! I can't stand the 2600 Amh juicy of S6 anymore.\n\r\nAnyone test the lasting hours with heavy use of Gear VR?", "time": "16th May 2016, 07:41 AM", "postID": "post66872795", "replies": [{"text": "Dont expect miracles. Vr is very intensive i think maybe 2 hours. Maybe less.", "time": "29th May 2016, 07:49 AM", "postID": "post67074123", "replies": []}]}]}, {"text": "7-9 hours under heavy use... meaning screen on, running multiple apps, games, and/or movies, etc. It's certainly not an endless power source but if you're a light user, can easily squeeze a day+ out of this.", "time": "13th March 2016, 08:51 AM", "postID": "post65809811", "replies": []}, {"text": "I end the day of heavy use with around 30% battery (6 am- 5pm). In about 15 minutes I can be back to 55%. No problems for power users.", "time": "18th March 2016, 06:13 PM", "postID": "post65913498", "replies": []}, {"text": "11hrs SOT over 30hrs is what I'd consider heavy usage. Pretty good.", "time": "18th March 2016, 08:46 PM", "postID": "post65916066", "replies": [{"text": "I'm going to call BS on this one unless you are using superduperultrapowersavingmode and you are on exynose.\n\n---------- Post added at 01:56 PM ---------- Previous post was at 01:54 PM ----------\n\nI typically get about 16 hours with 6 to 7 hours SOT. The same as my S6 edge plus.", "time": "18th March 2016, 08:56 PM", "postID": "post65916188", "replies": [{"text": "Lol no power saving. Just a black theme, bloat disabled, and amoled themed ad blocking browser. I keep sync off when I'm on 4g too.", "time": "18th March 2016, 09:07 PM", "postID": "post65916350", "replies": [{"text": "What all did you disable?", "time": "18th March 2016, 11:45 PM", "postID": "post65918337", "replies": [{"text": "This stuff", "time": "19th March 2016, 12:44 AM", "postID": "post65918962", "replies": []}, {"text": "What theme do you use\n\n\n\n---------- Post added at 12:19 AM ---------- Previous post was at 12:17 AM ----------\n\n\n\r\nWhat black theme do you use please", "time": "19th April 2016, 01:19 AM", "postID": "post66434049", "replies": [{"text": "[MINU] Black Edition", "time": "20th April 2016, 08:06 PM", "postID": "post66465815", "replies": []}]}]}]}]}]}, {"text": "THANKS", "time": "14th April 2016, 09:44 AM", "postID": "post66355132", "replies": []}, {"text": "45h duration, 6.5h SoT and 30% left.\nWifi/LTE/GPS allways on, 1,5h of navigation, reddit, 9Gag, Browser, whatsapp, youtube, feedly. Very impressive to me.", "time": "14th April 2016, 02:06 PM", "postID": "post66358269", "replies": []}, {"text": "I'm very impressed that one can play candy crush for 22 hours - str8 !!!", "time": "19th April 2016, 03:14 AM", "postID": "post66435054", "replies": []}, {"text": "@ kittiyut\n\nwhich settings are you using?", "time": "21st April 2016, 08:22 AM", "postID": "post66472624", "replies": []}, {"text": "Hello, if you want to see Samsung Galaxy S7 Edge real battery test, you can check my video, I hope you will like it \nhttps://www.youtube.com/watch?v=hC75ixL_K-I", "time": "25th April 2016, 06:29 PM", "postID": "post66542856", "replies": []}, {"text": "I've been making it to the end of the day with apt 20% battery left, and I'm quite the heavy use throughout the work day.   So,  about 11 to 12 hours.", "time": "26th April 2016, 03:55 PM", "postID": "post66556642", "replies": []}, {"text": "Maybe I'm doing something wrong then xD I can get about 5-6 hours of SOT over 24 hours. No compromises except for a darker theme. That's it! I leave everything on as I want. Maybe I'll disable some stuff in the future.", "time": "30th April 2016, 04:17 PM", "postID": "post66620456", "replies": []}, {"text": "It has  been 2nd day of edge. No whatsapp, no hike or no Messengers except hangouts. Mixed use with WiFi and 3g. Push email configured for Gmail. 3 other email accounts configured with 30-60 minutes email check.  Obviously I will get at least 45 minutes of more screen on time. Mostly using apps like mx player FB twitter twitch YouTube etc", "time": "30th April 2016, 06:17 PM", "postID": "post66622143", "replies": []}, {"text": "Best I've got was 30 hours on a single charge", "time": "9th June 2016, 09:15 AM", "postID": "post67238056", "replies": []}, {"text": "Well I haven't used the Gear VR with the s7 yet. \nBut I do play vainglory a lot, with the s6 edge, it was absolutely killing my battery. With reduced brightness maximum I was able to get was like 2,5h DOT playing it.\n\nI didn't drain the s7 edge with the game yet, but the drain while playing vainglory is a lot smaller.\nAlmost 2 hours vainglory, plus an additional hour of screen on time due to browsing and stuff and I'm still at 55 percent battery. \n\nSo to me, the s7 seems to handle the battery drain under heavy usage a lot better.\n\nGesendet von meinem SM-G935F mit Tapatalk", "time": "9th June 2016, 09:58 AM", "postID": "post67238484", "replies": []}, {"text": "Heavy use you considerate..... most of the day runing on 4g emails, fb, whatsapp, clas of clans, some times spotify with bluetooth... and when im out of house i switch off wifi gps just turned on when its required  and i got 4 hours of sot with 4% left... its enough for a full dsy but I'm still impressed how some guys reach that 7-9 sot and 2 days with out charging", "time": "13th October 2016, 12:35 AM", "postID": "post69102818", "replies": [{"text": "im getting 10-12 hours with heavy use. hangouts video calling and whatsapp chatting.\n\n---------- Post added at 02:20 PM ---------- Previous post was at 02:18 PM ----------\n\n\n\r\ni'm reading those comments and thinking to myself \"BS\". i have a buddy here at work that has the same though. he plays boom beach and browses the web all day at work and he says his phone lasts 1.5-2 days.", "time": "14th October 2016, 09:20 PM", "postID": "post69132633", "replies": [{"text": "Sounds good... does hes running on original rom or custom? i already set some apps combo to put deep sleep the phone and now its working much better!  i got 2 hours of SOT and 75%  battery left....", "time": "14th October 2016, 09:59 PM", "postID": "post69133090", "replies": [{"text": "he's using the original rom and he doesn't know anything about phones actually. what that means though is that a lot of the apps he has on his phone aren't actually getting used, so they've never actually been started for the first time.", "time": "17th October 2016, 02:06 AM", "postID": "post69165078", "replies": []}]}]}]}, {"text": "How do you people manage that? I get like 2 hours SOT Tops.... I have snapchat but literally never use it, and Facebook and Messenger too.... music streaming now and then but I am not an intensive user of anything", "time": "17th April 2017, 02:34 PM", "postID": "post71898097", "replies": [{"text": "factory  reset ur phone and only install app that u need  i get about 10 hts of screen on time", "time": "11th May 2017, 07:37 AM", "postID": "post72249458", "replies": []}]}, {"text": "I get about 2 and half hours with snapdragon \nis it me or the processor...Ive never seen 4hours+ before on this phone", "time": "13th May 2017, 03:03 AM", "postID": "post72273242", "replies": []}, {"text": "Same here. Never seen more then 4 hours. \nHow all those people manage to get those SOT? \nI'm very supprised!!", "time": "8th February 2018, 11:42 AM", "postID": "post75489515", "replies": [{"text": "Don't use fast charge,and replace ur battery.", "time": "9th February 2018, 01:56 PM", "postID": "post75502505", "replies": []}]}]}, {"title": "Light use endurance", "rating": 4.5, "links": ["https://forum.xda-developers.com/s7-edge/review/light-endurance-t3330794", "https://forum.xda-developers.com/s7-edge/review/light-endurance-t3330794/page2", "https://forum.xda-developers.com/s7-edge/review/light-endurance-t3330794/page3"], "threads": [{"text": "With light use, there is barely any battery drain. You will end the day at around 60%.", "time": "18th March 2016, 06:14 PM", "postID": "post65913521", "replies": [{"text": "I've had a light day today (with some browsing, chatting and redditing), and I have 80% left at 1:47 (AM) (2 hours 30 min SOT and around 15 hours up-time), so I don't think I even have to charge it tonight  The battery is ridiculously good (Exynos).", "time": "7th April 2016, 12:49 AM", "postID": "post66231579", "replies": []}]}, {"text": "I do couple hours of waze an some gaming throughout the day, with the usual texting, facebook, internet, etc. My SOT has averaged anywhere from 5 hours to 6 hours and 42 minutes (best so far) with 5% to spare.", "time": "18th March 2016, 06:47 PM", "postID": "post65914067", "replies": []}, {"text": "8.5hrs SOT in 60hrs total runtime with 5% left. G935V.", "time": "18th March 2016, 07:44 PM", "postID": "post65915060", "replies": [{"text": "and what's the screen brightness? auto or 20% or something else?", "time": "21st April 2016, 06:56 AM", "postID": "post66471821", "replies": [{"text": "About 40% except when in direct sunlight, then it's 100%", "time": "21st April 2016, 09:32 AM", "postID": "post66473357", "replies": [{"text": "It's impressive!", "time": "21st April 2016, 12:33 PM", "postID": "post66475335", "replies": []}]}]}, {"text": "Omg! How did you manage to get that? I could get 7 hours with 7% juice left. What was your screen resolution?", "time": "10th February 2017, 06:57 PM", "postID": "post70972143", "replies": [{"text": "That does not matter. What matters is on what software he is. Someone on Marsh Mallow can get 8-10 SOT over 2 full days. Someone on Nougat can get 3-4 SOT with luck, in 1 day.", "time": "10th February 2017, 08:59 PM", "postID": "post70973722", "replies": []}]}]}, {"text": "today im working from home so ive been doing some casual web browsing and app store browsing for a bit, on wifi the whole time, no tethering or anything. phone has been unplugged since about 9AM and it is now 3:30 and im at 84% battery.", "time": "18th March 2016, 08:24 PM", "postID": "post65915705", "replies": []}, {"text": "Definitely enough for one day use", "time": "7th April 2016, 11:30 AM", "postID": "post66237056", "replies": []}, {"text": "So I unplugged mine Wednesday morning and it's currently Friday 02:52 (AM), and I still have 27% left. I'm not even trying here. I've been playing some games (for a short period of time), browsing the web and Reddit, used FB Messenger a lot, and listened to music for countless hours. Current SOT is at 6 h 24 min.\n\nI have the Exynos version - of course. Stock and unrooted. I have only disabled some stock apps.\n\nUpdate: It's now 04:40 (AM), and I'm throwing in the towel. SOT is now 7 h 40 min, with an up-time of 1 day 18 hr. I have 16% battery left. You win, Samsung. You win.", "time": "8th April 2016, 01:55 AM", "postID": "post66248553", "replies": [{"text": "Could You write which apps are disabled ?", "time": "16th April 2016, 11:41 AM", "postID": "post66390462", "replies": [{"text": "I have the unlocked version, so I don't have carrier bloat. I have deactivated:\n\r\n- Chrome (I use the Samsung browser)\r\n- Excel\r\n- Facebook \r\n- Google Play Movies\r\n- Google Play Music\r\n- Hangouts\r\n- Instagram\r\n- Notes\r\n- OneDrive\r\n- OneNote\r\n- PowerPoint\r\n- S Voice App\r\n- Skype\r\n- WhatsApp\r\n- Word\n\r\nThese are the apps I currently have installed (excluding stock Samsung apps)\n\r\n- Google Drive\r\n- Dots (game)\r\n- Feedly\r\n- Google Photos\r\n- Gmail\r\n- Google Keep\r\n- Google Maps\r\n- Medium\r\n- Facebook Messenger\r\n- Netflix\r\n- Phonograph\r\n- Pocket\r\n- Pushbullet\r\n- Shuttle+\r\n- Slide for Reddit\r\n- Snapseed\r\n- Solid Explorer\r\n- SPV\r\n- Tholotis\r\n- TVShow Time\r\n- Weather Timeline\r\n- Zolt", "time": "18th April 2016, 01:03 AM", "postID": "post66416653", "replies": []}]}, {"text": "Thank you. \r\nThere are very few of them. I attached my pack in xml. My battery is better than without disabling apps , but maybe I turned off too many of them? I need to check that.", "time": "18th April 2016, 10:03 AM", "postID": "post66421410", "replies": [{"text": "Yeah, a lot of people are reporting worse battery life after disabling a lot of stuff, and my advice to you would be to not disable a lot of services. Very few apps are standalone apps without any dependencies etc. so you'll probably mess something up by \"removing\" a key piece of software (the app itself), while the services will keep \"pinging\" for the app even though it's not there. This causes battery drain even though the app isn't active, the rest of the \"machinery\" is, if you get what I'm trying to say. \n\nI experienced this myself when I disabled S Health. I got noticeable worse battery life when I disabled it, and I understood why when I re-enabled it. S Health is active 24/7 as a service, and it's actually counting your steps in the background, which I didn't know until I started getting notifications congratulating me by beating my personal record and so on. I checked the settings, and sure enough, it's enabled by default to do that, so I have disabled auto-logging now, but this just shows how disabling one thing can cause small things like this to get messed up, resulting in CPU time and battery life lost. \n\nThis is especially true for Samsung apps, which are deeply integrated into the framework, so there are a bunch of things that work together, and those things won't stop looking for that missing app when you've disabled one. \n\nIt's not like \"Oh, Tim (S Health) isn't responding, so we'll just stop calling him\". Nope, they'll try again and again and again until \"he\" responds, and this is going to affect battery life. So my advice is to not disable all the Samsung apps. I have most of them enabled, but I use Nova Launcher, so I've hidden them from the app drawer, and my battery is, as you can see, awesome. The pre-installed Google apps are different though, since they're more modular, and thus much easier to remove without messing with anything else, like it's easier to remove the wheel (Google) of a car than a part of the suspension system (Samsung). \n\nSo I would re-enable most of the Samsung apps again and just see what happens. Then disable one by one and if you notice anything funky, then re-enable it and go to the next one", "time": "18th April 2016, 02:58 PM", "postID": "post66425134", "replies": [{"text": "Thanks for your detailed explanation.\r\nBut - in general - a lot of people recommends debloating for battery saving..\r\nCan you advice any source for your thesis?\r\nDebloating was my first step battery saving procedure so far.\r\nThanks", "time": "7th March 2017, 12:54 AM", "postID": "post71314506", "replies": []}]}]}]}, {"text": "I haven't used it much today ( 1 hour 15mins screen time) 15 hours on battery, but Bluetooth on and in a 1 bar poor signal area. This seems really good to me compared to my LG g4", "time": "18th April 2016, 07:30 PM", "postID": "post66429609", "replies": []}, {"text": "Oh yes! I totally forgot about that. Thanks!", "time": "11th February 2017, 03:16 AM", "postID": "post70976762", "replies": []}, {"text": "I usually get between 7.5 and 9 hours SOT over 2 days, depending on what I'm doing. Fairly heavy user but not a gamer.\n\nThat's on MM. I am in absolutely no rush to switch to Nougat and shall monitor user reports carefully  😆", "time": "12th February 2017, 08:42 AM", "postID": "post70993609", "replies": []}]}, {"title": "\"Look\" of the device (aesthetics)", "rating": 5.0, "links": ["https://forum.xda-developers.com/s7-edge/review/look-device-aesthetics-t3330795", "https://forum.xda-developers.com/s7-edge/review/look-device-aesthetics-t3330795/page2", "https://forum.xda-developers.com/s7-edge/review/look-device-aesthetics-t3330795/page3", "https://forum.xda-developers.com/s7-edge/review/look-device-aesthetics-t3330795/page4"], "threads": [{"text": "Best design yet", "time": "10th March 2016, 07:28 PM", "postID": "post65764148", "replies": []}, {"text": "Looks nice, but slick materials and no sharp edges make it almost impossible to use with a single hand and not drop it.", "time": "10th March 2016, 08:12 PM", "postID": "post65764882", "replies": []}, {"text": "do we need to talk about its aesthetic? lol", "time": "17th March 2016, 05:25 AM", "postID": "post65884331", "replies": []}, {"text": "They completely ruined the design with the Samsung logo on the front.", "time": "17th March 2016, 09:55 AM", "postID": "post65886987", "replies": [{"text": "Agreed but so does most phones =( Though i read s7 edgein some Asia markets doesnt come with logo in front.", "time": "18th March 2016, 05:45 AM", "postID": "post65903449", "replies": []}]}, {"text": "I love it. Simply love it. \nThe beautiful high-end design, looks just stunning. \nI dont get what you say about the logo, and for the one complaining about that it cant be used with one hand, is wrong. \nI got a very small hand, but i have no problems at all using it with one hand. There even is a feature to one hand. \nAnd the camera, uff, that auto focus is insanely fast and just takes beautiful Pictures in the dark. Never seen anything like it. \n10/10, really love it.", "time": "17th March 2016, 11:19 AM", "postID": "post65888017", "replies": []}, {"text": "When you look at it, it looks great, but the actual ergonomy is quite bad. No grip at all, very slippery. If the side metal frame had some kind of etching on them, the grip would have been considerably improved and the looks would have been preserved.", "time": "18th March 2016, 11:24 AM", "postID": "post65906941", "replies": []}, {"text": "When I leave my phone with AoD, as people pass by they will literally just say \"Woah.\" It's truly a beautifully designed phone.", "time": "18th March 2016, 06:15 PM", "postID": "post65913534", "replies": [{"text": "Same here!", "time": "24th March 2016, 08:56 PM", "postID": "post66019545", "replies": []}]}, {"text": "hard to choose between black or gold as there is no silver in europe atm.", "time": "23rd March 2016, 06:09 PM", "postID": "post65999544", "replies": [{"text": "Same, I'd have chosen black anyway though. Silver just looks cheap. I've noticed that the black really is black with S7 though unlike the S6 which looked blue-ey under light. Best looking phone available for me.", "time": "27th March 2016, 07:04 PM", "postID": "post66066048", "replies": []}]}, {"text": "Looks great, but between the glass back, slippery surface, and fingerprint magnet surface this is the first phone I've used a case on. But I got a nice, clear TPU case so the style shows through, it adds little bulk, and makes the phone easier to hold.  I do wonder, though, when manufacturers will wise up to the fact the we actually need to hold these devices in our hands, and they should be easy to grip, not hard.\n\nMaybe it's a conspiracy between the manufacturers of phones and the manufacturers of cases.", "time": "23rd March 2016, 07:08 PM", "postID": "post66000431", "replies": []}, {"text": "I love the design. That's what attracted me the most the S7 Edge. I really wanted the black 1 at first, but they were out of the stock. I ended up with the silver one, I could not be any happier I love the color now I feel like the silver surfer with it", "time": "26th March 2016, 05:32 PM", "postID": "post66049278", "replies": []}, {"text": "It is a wonder of a phone: original, avant-garde and yet classic. It is a stunner looking piece of human engineering and so perfect in everyday use. 12/10. It is worth every extra penny to get hold of the good looks.", "time": "26th March 2016, 08:29 PM", "postID": "post66051698", "replies": []}, {"text": "*Beyonce Voice* FLAWLESS", "time": "22nd April 2016, 04:50 AM", "postID": "post66487221", "replies": []}, {"text": "Great looking phone. Feels great in the hand even tho its a bit slippery.\r\nButtons position nicely. Good that the power button is a bit lower then the vol down.\r\nCamera and heart sensor are place good. Had problems with the note edge. Camera lense would get dirty or reader wouldnt read.\r\nNice faded app and back button.  I have the black oxny so its nice to not have white buttons at the bottom.\r\nTrim around the phone looks greaf and gives it a more metal look.\r\nPorts at the bottom of then phone all look great and gives the phone a premium feel.\r\nOverall samsung nailed it.", "time": "23rd April 2016, 12:29 AM", "postID": "post66501409", "replies": []}, {"text": "For God's sakes, it's a phone. And I am an adult. I couldn't care less what it looks like, I care how it works. Leave the nonsense to the iPhone fanboys, they can spend days discussing how the antenna lines affect the look.", "time": "23rd April 2016, 02:36 AM", "postID": "post66502381", "replies": []}, {"text": "One of the best desighns ive seen", "time": "23rd April 2016, 11:07 AM", "postID": "post66506505", "replies": []}, {"text": "best looking phone thus far!", "time": "7th May 2016, 09:00 AM", "postID": "post66735874", "replies": []}, {"text": "The side bezel hurting my hand.", "time": "11th May 2016, 08:41 AM", "postID": "post66797896", "replies": [{"text": "i have the silver and it is the sexiest phone i have ever owned!\n\n---------- Post added at 01:15 AM ---------- Previous post was at 01:14 AM ----------\n\n\n\r\nyou've never held a s6 edge have u?", "time": "29th July 2016, 02:15 AM", "postID": "post67949031", "replies": []}]}, {"text": "A great look. But I am permanently touching the edges while typing and touching.", "time": "23rd July 2016, 06:55 PM", "postID": "post67873384", "replies": [{"text": "not if you put a slim case on it. i use the spigen neo hybrid, and i never touch the edges. it is a beautiful case which has the same lines at the phone, and it protects the device well.  but as for your specific problem, it stops you from accidentally touching the sides of the screen. so you might want to give this a go.", "time": "24th August 2016, 06:57 AM", "postID": "post68337069", "replies": []}]}, {"text": "Practical? Honestly ... no.\n\nBeautiful? Stunning.", "time": "24th July 2016, 09:24 AM", "postID": "post67880241", "replies": []}, {"text": "I can't believe you like it. Why the whole front is just not one piece black like an iphone or nokia instead of 2 colours...\nThe huge 'samsung' sticker on the top!!! Lack of aesthetics.\nIt's comparable with 'gold' power switches fitted in some UK houses mainly inhabited by east Asian population. Lovely hardware but disgusting 'look'", "time": "24th July 2016, 11:36 PM", "postID": "post67889551", "replies": [{"text": "Glad you like it", "time": "25th July 2016, 08:27 AM", "postID": "post67893248", "replies": []}]}, {"text": "One of the most beautiful smartphone ever created? Absolutely. Is it in any way practical, or does the edge deliver some form of incredible functionality? Absolutely not. It got the looks, and that's pretty much it. It is, on the other hand, very comfortable in the hand, and I've noticed that I'm often just holding it in my hand even though I'm not currently using it. Other people have also commented on how nice it feels in the hand.\n\nTL;DR: Form over function, and that's okay.", "time": "25th July 2016, 08:24 PM", "postID": "post67901156", "replies": [{"text": "I got a silver one 32gig decent i guess", "time": "26th July 2016, 01:38 PM", "postID": "post67910487", "replies": []}]}, {"text": "Probably the gorgeous looking device of any I've seen and definitely the best I've ever owned myself.", "time": "23rd August 2016, 10:17 PM", "postID": "post68331909", "replies": []}, {"text": "The phone itself is amazing, but having had the Galaxy Note Edge, the edge screen on this phone is utterly useless and I often don't use it all simply because I have to swipe to access it. \n\r\nIf I have to swipe then I might as well hit home, and launch the app from the home screen.. \n\r\nThe edge screen always seems to have to load, and personally maybe it'd be snappier of the edge tab was bigger and was always loaded in memory. \n\r\nWish there was a case to show off the beautiful back side of this phone that wasn't clear as I use a metal plate with my magnetic car dock.", "time": "31st August 2016, 12:04 PM", "postID": "post68459083", "replies": []}, {"text": "Wonderful", "time": "16th April 2017, 06:20 AM", "postID": "post71879868", "replies": []}, {"text": "Today i bought Black Pearl edition, ****ing amazing colour  :", "time": "30th May 2017, 10:47 PM", "postID": "post72489612", "replies": []}, {"text": "I did not want black, as I think it looks dirty easy, but ended up getting black even though I told them No black, that's what I got, so not too thrilled with that haha. The back gets too many finger prints, but it does look nice when cleaned! I hate the edges though, as when I try and listen to songs on YouTube when I'm at the gym, every time I put the phone back in my pocket the material of my pocket touches the edge and changes it. It looks nice, but really it's just an annoying feature!  (I never had such issues on a flat screen phone)", "time": "11th June 2017, 04:32 AM", "postID": "post72626630", "replies": []}, {"text": "The look and feel of the device is awesome. The edges just melt into its metal body. It feels awesome but the sides are sharp.", "time": "30th September 2017, 08:56 PM", "postID": "post73990352", "replies": []}, {"text": "I question the actual function of the curved screen, a swipe from the side of a flat screen to reveal apps etc. would be just as good for me (I think of it as a nice looking pie control). The curved edge however does look fantastic. Excellent look without the case ( I have black) . I'm paranoid so I got a case. I got the unicorn beetle pro case (also black) and it still looks fantastic with the phone. Throw a black theme into the mix and it looks sensational.  Very happy.", "time": "1st October 2017, 12:48 PM", "postID": "post73996559", "replies": []}, {"text": "I have the s7 edge Injustice Edition, it's is it's own animal! Beautiful design, tons of mem, I don't think there is a phone that can beat it!", "time": "7th October 2017, 04:09 AM", "postID": "post74063796", "replies": [{"text": "I feel like that button color doesn't matches very good. or maybe front cam is not good.\n\n---------- Post added at 10:10 PM ---------- Previous post was at 10:08 PM ----------\n\nI am looking forward to buy this device, but which color looks the best?", "time": "7th October 2017, 06:10 PM", "postID": "post74071114", "replies": []}]}]}, {"title": "Quality feel (use of materials)", "rating": 4.0, "links": ["https://forum.xda-developers.com/s7-edge/review/quality-feel-materials-t3330796", "https://forum.xda-developers.com/s7-edge/review/quality-feel-materials-t3330796/page2", "https://forum.xda-developers.com/s7-edge/review/quality-feel-materials-t3330796/page3"], "threads": [{"text": "I like the overall feel of the device, the housing is solid and slim; biggest gripe is that my gorilla glass 4 has a cut on the screen after 1 day of use. Not sure how this happened but almost certain it shouldn't have occured.", "time": "10th March 2016, 02:49 PM", "postID": "post65759120", "replies": [{"text": "I've heard that GG4 was made to be more shatter resistant at the expense of hardness   not sure how true this isbthough. But you're not the only one who got scratches on their s7. Some reviewers also say they had gotten scratches with the s7 during normal use while having none on their other devices.", "time": "10th March 2016, 05:03 PM", "postID": "post65761588", "replies": []}]}, {"text": "Definitely the most expensive feeling phone that I've ever owned. It is also the most delicate and fragile feeling one.", "time": "10th March 2016, 06:09 PM", "postID": "post65762752", "replies": [{"text": "You have to be joking. The S6 had a prem feel. the S7 feels cheap and the design is lacking!", "time": "15th March 2016, 05:30 AM", "postID": "post65845706", "replies": [{"text": "No, you're joking right. Design is almost identical to s6 same design with some refinements. They use the same material being glass and metal, so how you're saying s6 feels premium and the s7 doesn't makes 0% sense.", "time": "15th March 2016, 08:52 AM", "postID": "post65847621", "replies": []}, {"text": "I didn't own an s6, so...", "time": "15th March 2016, 10:57 AM", "postID": "post65849051", "replies": []}]}]}, {"text": "It seem my unit has a problem on the back glass next to the camera. There is a gap between the glass and the frame and if you press it there it makes a loud pop sound, making it feel pretty low quality. Also the edges make it quite difficult to use the phone lying down, holding it above your head. In general almost all of the front side has some touch sensitive areas, so the phone is quite difficult to pick up without pressing something (with an open app for example).", "time": "12th March 2016, 05:01 PM", "postID": "post65799426", "replies": []}, {"text": "http://*******/1YJsZd", "time": "16th March 2016, 05:44 PM", "postID": "post65874847", "replies": []}, {"text": "The build quality is top notch. No, no, it really is quality. It is heavy enough that it feels like an expensive device, but not heavy enough that it becomes a workout after holding it too long.", "time": "18th March 2016, 06:23 PM", "postID": "post65913666", "replies": [{"text": "+1 here.. more premium looking than my old s6", "time": "19th March 2016, 01:05 AM", "postID": "post65919154", "replies": []}]}, {"text": "Hde some issues with mine that is more down to quality controll (lots of unity that was shipped out quick to meet demands).\nFirst one hade issues with home button.\nSecond one volume down did not work.\nThird one very tine hairline scratch i top coner on the rear camera lens (not sure if i can this one exhanged as it's very hard to spot if you dont know it's there)\n\nAlso, plastic home button? This could as well be harden glass to minimize scratches.\n\nBut all i all the phone i well built and feels good in the hand. A screen protector and case it's still sadly needed though as we know from before that gorilla glass 4 is more drop safe than scratch safe compared to gorilla glass 3.\nYou can't have both scratch safe and drop safe glass yet sadly", "time": "19th March 2016, 09:45 AM", "postID": "post65923663", "replies": []}, {"text": "Overall Design is good. The first thing that is UNIMPRESSIVE is the Sim Card Tray is made of plastic! Would Samsung ever come out of this plastic trend completely? I know we cannot live without plastic. still, the sim tray should have been metal. Also, it becomes sticky after holding for some time. So wipe and wipe again again to keep the look Premium. \n\r\nA 5* for rest of the design.", "time": "20th March 2016, 08:14 AM", "postID": "post65939706", "replies": []}, {"text": "I dislike the glass on the back of the phone it makes the phone feel fragile", "time": "21st March 2016, 07:13 PM", "postID": "post65965950", "replies": []}, {"text": "Quality feel does not mean much if you drop the phone from your pocket and it breaks.\n\r\nHow does a company who supposed does drop test call a phone that breaks on first drop a premium quality phone.\n\r\nIf one is able to find and read the S7 Edge warranty, it does not cover \"accidents, water, dirt, or any other damage\".  Imagine that.  The \"gorilla glass\" and IP68 means nothing.\n\r\nI'm really sorry that I want from an iPhone to a Samsung S7 edge.  I had expected more for how much I paid for a \"premium\" phone.", "time": "21st March 2016, 08:42 PM", "postID": "post65967201", "replies": [{"text": "I don't really know the details for the warranty but saying that a phone isn't premium because it may break on the first drop is like saying that a Ferrari isn't premium because it may scratch/get dents in its first accident. Just saying maybe if you own a Ferrari or an expensive phone just be a little more careful.", "time": "22nd March 2016, 09:48 AM", "postID": "post65974635", "replies": [{"text": "To be clear, I was really looking forward to the S7 edge.  Maybe it is just expectations for mobile phones.  I'll let others wordsmith \"premium\".  For me, premium is paid for appearance and performance.  I'm expecting scratches and dents.  But cracked at 2 feet?\n\r\nEveryone product category has a level of expected performance, durability (and in cases of cars, Safety) for that specific category.\n\r\nUsing the analogy of a Ferrari is a bit of a stretch and false analogy.  Nonetheless, to use your analogy, For a Ferrari, you expect power/speed, quality materials, sexy appearance,  and if you hit something going 25 mph, you survive. The last part, you expect of any motor vehicle.  It's a pretty low bar.   If I drove it 200 mph, I would have NO expectation of surviving.  There are certain things you expect from a car (let alone a premium car).\n\r\nFor a premium phone, you expect power/speed, quality, some sex appeal, and if you drop 2 feet, it doesn't crack.  The last part, you expect of any mobile phone.  It's a pretty low bar.  If I dropped 20 feet, I would have no expectation of it surviving.  Mobile phones are built with the expectation of a typical life of a mobile phone.  Yes, that includes drops.  And I'm pretty sure all mobile phone manufactures do drop test and built to it.\n\r\nA friend responded that she dropped her S7 edge around 10 times with no issue.  Yes, that is what I would expect!  (ignore that that 10 drops in 2 weeks would be considered pretty clumsy by any standard).  I don't necessary understand why others have lower expectations of a mobile phone.\n\r\nAnother way to think about it is to compare to how competitors treat \"premium\".  Remember iphone 6 bend-gate?   I never thought of putting a phone in my back pocket, but peoples expectation is that a phone is mobile and doesn't bend.  Frankly I was surprised Apple made folks whole.   The difference?  A premium service for a premium product.  I'm not saying Apple is perfect.  IMHO, it is better than Samsung in their approach.\n\r\nI just did a search on google, and discover review sites warning that the S7 edge is much easier to crack.  Wish I knew that before hand.  It was my mistake to assume S7 edge would be similar quality as S6 edge +.  How many here have seen drop test of S6 on youtube?  Amazing.\n\r\nReally sad given that S7 edge has so much potential.  Now, I have to look at a $800 Samsung \"premium\" everyday.  I think others are more forgiving then me with this experience.  I've not given up on Android.  Just Samsung \"premium\".\n\r\nmy 2 cents.", "time": "22nd March 2016, 03:46 PM", "postID": "post65979182", "replies": [{"text": "There's a lot more to consider. They made millions of those phones and can't expect them to have the exact same build (while yes, they are all very close). Also, the drop has to be taken into consideration. If your friend drops hers 10 times on carpet or from like 1 feet, sure it won't get damaged. If you drop it from 2 feet on concrete, now that's a different story. The angle to which it drops and lend also makes a big difference. The device isn't it's strongest on every angle and some will definitely break it easily (take an egg for example, which is hard to break at the top and bottom but sides are flimsy). \n\r\nAnyway, just this to say that while I agree it shouldn't break so easily. It can and will happen depending on quite a few facts, whether it is a \"premium\" device or not. \n\r\nAs a side note, Apple sell \"premium\" devices as well for the same price which also break and crack, comparing them is pointless without all the facts They'd have to be put through the exact same drop (angle, speed, material on which they drop) and even then, they'd both have angles at which they resist/survive better and worse since they're built differently.", "time": "22nd March 2016, 04:24 PM", "postID": "post65979815", "replies": []}]}]}]}, {"text": "Coming from a Meizu MX5 this phone feels fantastic! Part of me does miss the solid feeling of aluminium and I kind of agree with alwayslearning, it does feel a little fragile. Mines in a Spigen clear case at the moment but that detracts from its style so I've got a ultimateshield on the way instead!\n\r\nCertainly looks more stylish than an iPhone but perhaps not as robust?", "time": "22nd March 2016, 10:29 AM", "postID": "post65975027", "replies": []}, {"text": "I just received mine today... and so far i like it a lot. I personally think the quality is up there. The form factor is really good and is to me hits the magic spot between size and usability.  I'm coming from a Note 5 and i really apreciate how compact this feels in the hand.\nIs it perfect? No, but then nothing ever is.  I am very happy with it so far.  I'm ok with the glass back.. had it on the Note 5 and im really pretty careful with my tech.\nAnyway, ive only been able to play with it for a couple of hours so far and i hope my opinion of it doesnt change.  At this very moment I love it.", "time": "22nd March 2016, 01:01 PM", "postID": "post65976818", "replies": []}, {"text": "Phone feels awesome but since the edges are aluminum i got a minor scuff.  Donf know how it happened😠", "time": "3rd April 2016, 07:11 AM", "postID": "post66169336", "replies": []}, {"text": "Like others,  I think the home button feels kind of cheap. But the rest is great. I love this phone naked ( the led notification, AOD etc)  , but I have already micro scratches visible under strong light also scratches on my flashlight , even though I'm using Led case. And after so many posts about cracked phone or the cost to repair it... I'm just afraid to enjoy it that way.", "time": "3rd April 2016, 07:53 AM", "postID": "post66169674", "replies": []}, {"text": "Mine dropped for the first time on the floor, only needed about 80cm to get broken  \r\nFront is broken and missing some glass, has a big white line at the bottom and all colors overall have more white color & sometimes my screen goes blank (grey) and i can't see anything anymore and i just noticed the back also has 2 lines broken in the glass.\r\nit looked like it would easely break, i guess i was right", "time": "26th September 2016, 03:18 PM", "postID": "post68867195", "replies": []}, {"text": "Back glass scratches in few hours of usage. Just enough to put the phone on not absolutely clean desk and you will have scratches everywhere on back glass after some hours / days od usage.", "time": "22nd October 2016, 10:26 PM", "postID": "post69258920", "replies": []}, {"text": "Just returned it for an exchange after 1 week... Home button was clicking like crazy... When you press it it's ok, but after releasing it you get a strange loud sound, more like it getting stuck or being defected. Tested few phones in shops and all of them had a better home button with no sound after releasing it... If phones that are abused 24/7 for like 6month + is better then a brand new S7E then F Sammy... all this exchange will take 2 weeks, if ofc they approve it... if they don't it might be the last Samsung phone of mine.", "time": "24th October 2016, 02:25 PM", "postID": "post69283715", "replies": []}, {"text": "Case only when I'm out and about. No case at office or home. It's the perfect combination . \nPhone is hands down the most classy built phone I have ever used. Feels so good in the hand. It's a pleasure to just pick up and use. Really amazing design engineering from Samsung. \n\nFeels so small and thin for a 5.5 inch display. No other phone stands a chance from a hardware stand point.", "time": "30th December 2016, 05:12 PM", "postID": "post70321421", "replies": []}, {"text": "man.. some times i kiss this piece of art..i love this phone .. specially the silver reflection i get under the light . well made", "time": "30th December 2016, 07:05 PM", "postID": "post70322737", "replies": [{"text": "Hahaha, it's a phone worthy of hugs and kisses for sure.", "time": "30th December 2016, 07:23 PM", "postID": "post70322908", "replies": []}]}, {"text": "Excellent build quality imo. I didn't use a case for the first month and the home button is scratched up (as is the screen) but that's to be expected with shiny things I suppose. Ever since Samsung ditched the plastic poor build quality isn't an accusation I think you can level at them.", "time": "4th January 2017, 11:53 PM", "postID": "post70397636", "replies": []}]}, {"title": "Ergonomics (in-hand feel)", "rating": 3.5, "links": ["https://forum.xda-developers.com/s7-edge/review/ergonomics-hand-feel-t3330797", "https://forum.xda-developers.com/s7-edge/review/ergonomics-hand-feel-t3330797/page2", "https://forum.xda-developers.com/s7-edge/review/ergonomics-hand-feel-t3330797/page3", "https://forum.xda-developers.com/s7-edge/review/ergonomics-hand-feel-t3330797/page4"], "threads": [{"text": "Only 3 stars from me for the way it stays in hand. Curved edges both sides make the phones edges sharp hence difficult to get a proper grip. Also double sided glass makes it slippery.", "time": "14th March 2016, 08:06 PM", "postID": "post65838570", "replies": []}, {"text": "Wish the back of the device was as round as the edges on the front. Similar to the normal S7.  That's a joy to have in your hands.", "time": "14th March 2016, 09:54 PM", "postID": "post65840462", "replies": []}, {"text": "This phone just fits perfectly in your palm. The curved back makes a world of difference. However, it is slippery. I would love to keep this device naked, but it just doesn't seem like the best idea. Because of its glass back, it also is a fingerprint magnet.", "time": "18th March 2016, 06:24 PM", "postID": "post65913707", "replies": []}, {"text": "I find myself opening apps I didn't mean to open lol\n\nFantastic phone otherwise..", "time": "18th March 2016, 09:34 PM", "postID": "post65916731", "replies": []}, {"text": "Feels pretty good, but I feel the S7 is better. S7E is kinda difficult to hold comfortably cause you don't want to touch the edge screen. Only reason I'm sticking with the edge is the battery.", "time": "19th March 2016, 04:29 AM", "postID": "post65920974", "replies": []}, {"text": "Coming down from the Note 4 to the S7 Edge, the size here is a huge improvement in terms of ergonomics. You need giant hands to comfortably palm a Note. This feels just right. It rests on my palm and my fingers don't have to strain to secure the device. The glass does feel slippery but it's a beautiful piece of hardware. I was sure I wanted to go back to a regular 5.1\" Galaxy S7 but the feel of this device won me over.", "time": "19th March 2016, 05:34 AM", "postID": "post65921493", "replies": []}, {"text": "Ergonomics are bad. Its impossible to properly operate with one hand without touching the edge. Bad design; form over function. When holding it in landscape mode, your right thumb becomes  useless because youll hit the multitask button with your palm  before touching the left side of the screen.\r\nBtw my hands are large, but skinny.", "time": "19th March 2016, 12:51 PM", "postID": "post65925847", "replies": [{"text": "I agree. this phone drives me crazy. I always hit the nearest icon with the palm of my hand while im typing (in swype keyboard) .  wether its delete, happy faces, or enter. It absolutely drives me nuts. Im getting a different phone if I cant find a solution. i was thinking about taping the edges or something.", "time": "18th March 2017, 08:30 PM", "postID": "post71486680", "replies": []}]}, {"text": "I'm not overly impressed on this front. I've had mine for a little over a week and I'm already getting used to it though, soon I'm sure I won't notice it at all. It is VERY slippery though.", "time": "27th March 2016, 07:09 PM", "postID": "post66066123", "replies": []}, {"text": "I don't like using cases and after trying out my girlfriends S7 Edge without a case for a couple hours its way to slippery compared to my Nexus 6P. Anybody use it without a case and have luck? I haven't dropped a phone in 2 years and feel I would with this phone lol.", "time": "8th April 2016, 02:30 PM", "postID": "post66256298", "replies": []}, {"text": "It's just a hair too wide.  Had to return the first case I got as the covers for the buttons made it too wide, and go with the Samsung slim protective cover.  Even still, it's just a fraction too wide for my hands, tho I'm getting a bit used to it - I'm still getting the wrong inputs sometimes trying to swype/type one-handed.", "time": "9th April 2016, 12:06 AM", "postID": "post66264582", "replies": []}, {"text": "Most expensive-feeling smartphone I've ever held (incl. iPhones), and the ergonomics are pretty good, but it doesn't feel perfect. I guess it comes down to the size of your hands, but I have rather big palms, so it could've been a little more rounded on the back. Still, it feels comfortable to hold it, and I don't really have any complaints.", "time": "9th April 2016, 12:46 AM", "postID": "post66264986", "replies": []}, {"text": "I love the on-hand feel. I have smallish to medium hands...and could quite easily use it one handed...BUT the edge palm rejection just isn't sufficient. I and forever making accidental touches. It almost seems like those light edge touches confuse the phone...and random links/apps get selected in the general area. \n\nComing from a 6P, this is far easier to use...but contemplating the s7 rather than the edge.", "time": "9th April 2016, 01:46 AM", "postID": "post66265454", "replies": []}, {"text": "I always use cases on my phones and on 6p, the Spigen Neo Hybrid made the phone huge, on S7 Edge it's perfect. When I had my LG G3, I felt that a 5.5 inch screen it's the best and I feel that again. Even S6 Edge+ seemed a little too big. And the edges help the phone to appear slimmer in hand.", "time": "9th April 2016, 08:48 AM", "postID": "post66268625", "replies": []}, {"text": "Naked s7 edge feels good in hand.  But in led case_ awful.  That's why I took it out from it.  I enjoy phone more this way.", "time": "9th April 2016, 11:40 AM", "postID": "post66270437", "replies": [{"text": "Since the screen is so big and tall, hows the one handed used? (Not the software one handed mode). I rarely used the one handed software on my note 3 because it just felt weird. But I'm curious how easy it is to handle the phone in one handed. Personally I would have preferred this phone to have like a 5.2inch screen but that's just me.", "time": "23rd April 2016, 07:23 PM", "postID": "post66512980", "replies": []}]}, {"text": "Now the Edge  has curves in all the right places lol great in hand feel (Would  of liked more pronounced curves) but it's by far better than the S6 Edge....overall I'm not Complaining", "time": "10th April 2016, 01:07 AM", "postID": "post66281024", "replies": []}, {"text": "Well, I personally can't operate the phone with one hand. It's too big for me. Its a little bit problematic, but the screen and phone overall is worth it.", "time": "23rd April 2016, 07:28 PM", "postID": "post66513051", "replies": []}, {"text": "Had to get a case for it. Picking it up from a flat surface without a case is not very comfortable, its just to slippery and I know it wouldn't be long before the dreaded drop to the floor. \r\nThere isn't enough to hold on to  when lifting it off of a flat surface, which for me makes it a lot more difficult than picking up pretty much any flat screen phone.\n\r\nTook a bit getting use to the edge screen without getting false touches from hitting the edge of the screen, but the case pretty much solved that also.  \n\r\nSo over all I'd say in hand feel without a case is poor enough that I would of passed on this phone, but with a case, almost as good as any of my previous flat screen phones.", "time": "24th April 2016, 12:43 AM", "postID": "post66516390", "replies": []}, {"text": "It's just bad, the Edges don't provide functionality that would justify this bad handling.", "time": "8th May 2016, 02:38 PM", "postID": "post66753554", "replies": []}, {"text": "I've had the Edge for 9 months, and the \"edge\" part proved to be an annoying gimmick. It does make the phone look sleek, but every time I hand it to someone else to look at a picture, they end up accidentally touching something near the edge, most often the app switch button.\n\nAlso, when I take photos with one hand, my palm can touch the screen focus there; tapping the photo button won't register.\n\nBottom line - I would not buy an Edge again, but the regular version of the phone.", "time": "3rd January 2017, 05:44 PM", "postID": "post70377563", "replies": []}, {"text": "Have to say I agree with dandv and perpatoura. I bought the Edge because I figured more expensive has to be better right? Wrong. It was an interesting gimmick for a couple weeks but I'm so over it 5 months in. Ultimately I just don't think the functionality of any phone could justify needing the 'edge'. So no, the ergonomics are not good!", "time": "4th January 2017, 11:28 PM", "postID": "post70397400", "replies": []}, {"text": "I bought the S7 Edge because of the bigger battery and screen. But i never use the edge features but really like the design. I don't use a case but just a Dbrand skin on the back. With case the phone does not handle well in the hand.", "time": "9th January 2017, 01:42 PM", "postID": "post70470336", "replies": []}, {"text": "Agree that its a bit uncomfortable hold.  Iphone 6 plus was better to hold naked for me.  I love the edge design n thats why i chose it.  On the fence of running it naked cause it gdts a lil unconfortable and constantly tske off my tough armor spogen case.  The the amount of times i drop it im glad i have the case on.  I would definatley drop it without a case.\n\n---------- Post added at 08:50 AM ---------- Previous post was at 08:49 AM ----------\n\nI wonder how the note 7 felt naked?  Considering waiting for the next note instead of the S8.  We'll see.", "time": "9th January 2017, 04:50 PM", "postID": "post70473191", "replies": []}, {"text": "S7edge feels really good in palm but typing makes me trouble sometimes cause of touching the edge. Generally I would say 9/10", "time": "10th January 2017, 11:13 AM", "postID": "post70484695", "replies": []}, {"text": "I don't care if this phone has edge screen or not. I chose this over S7 because of the bigger battery for all-day usage. Edge screen looks so cool but it's very expensive if screen's broken so I'm very very afraid. Unfortunately edge screen has less options for screen protectors.", "time": "16th January 2017, 12:36 PM", "postID": "post70576881", "replies": []}, {"text": "The phone overall feels great, but it needs a case or at least a skin because the phone is very slippery. I normally opt for a case that has some texture for grip.  I just ordered a Speck Grip case so I'll let you guys know how it's like.", "time": "19th January 2017, 05:26 PM", "postID": "post70629869", "replies": []}, {"text": "3 Stars. \n\nIt´s slippery on the hand.\nToo much glass feeling in my opinion.\nWould be better if the back was of aluminum, as the iPhone, it would be heavier, but I could take that.", "time": "10th March 2017, 09:33 PM", "postID": "post71372609", "replies": []}, {"text": "I think its very nice in hand, im using a crystal clear TPU skin on the back also.", "time": "16th March 2017, 06:09 PM", "postID": "post71457463", "replies": []}, {"text": "For me it's unusable without a case.Before I bought one I could barely watch a video without accidentally touching the screen 30 times.", "time": "17th March 2017, 12:51 AM", "postID": "post71461861", "replies": []}, {"text": "Same here always use the clear view cover. Last night thought no and gave up does not feel nice and keep touching the edge accidently.\n\nAnd they reckon the S8 will have more Edge", "time": "17th March 2017, 06:28 PM", "postID": "post71471652", "replies": []}, {"text": "Very pretty, and convenient to hold. And putting the fingerprint sensor on the front means that the back can have its internal QI charge pad even though I like the convenience of a rear sensor.. Switched all the edge stuff off, it's messy, but the phone still looks uniquely good because of the way the image curls round the edges. I always use my phones with a thin hard plastic transparent back case and the one I got is pretty good for a couple of dollars, though I'd like it to go a little bit more round the corners for drop protection. I've replaced Samsung's attempt at a launcher with Apex and Hololocker. Having watched the S8 rumours, I think the S7 Edge is a keeper. Though I would like to root it. Amusingly, following the nougat OTA update, my banking app has decided the phone is already rooted, which it isn't....", "time": "18th March 2017, 05:50 PM", "postID": "post71484788", "replies": []}, {"text": "It's a big phone, and combined with a slippery back it is comfortable hold, but really annoying to use without a case. Unless you use the one-handed mode (something I highly recommend) the heel of your hand will keep hitting things while your thumb is reaching for something else.", "time": "28th March 2017, 01:50 PM", "postID": "post71621927", "replies": []}, {"text": "I can concur with others on only getting the edge variant for the larger screen and battery. Had the S7/S7 edge been the same size like the S6/S6 edge were, I'd have gone for the more traditional variant.\n\r\nThat said, I never use a phone naked. They always go in Otterbox Defenders as soon as I can get one (usually the same day). This time I had to wait a bit for the case, so I used it on its own, and it was mildly scary. Not as bad as my wife's iPhone 6S plus sans case, but close. That black glass backing is nice looking, and really makes it stand out, but it feels like one screw-up away from disaster.\n\r\nIt's also just slightly too wide for comfortable single-hand usage. The call accept button, for instance, is just a hair out of my thumb's reach, so I enabled the hardware button to answer calls in the accessibility menu.", "time": "28th March 2017, 10:07 PM", "postID": "post71628202", "replies": []}, {"text": "Ergonomics are really bad in my opinion, every time i use my phone w/o cover (i have the original samsung leather cover that increase grip a little bit) i always press the edge screen.\r\nFor those who wants to increase in-hand feel and ergonomics, my advice is to put a cover on it", "time": "30th March 2017, 02:46 PM", "postID": "post71651239", "replies": []}, {"text": "Bought the phone on black Friday.\nI had to choose between this one and Xz1 compact. Unfortunately after reading so bad reviews on xz1 I decided to go with this 1 but it would have been so nicer ergonomics in the other 1.\nI'm still afraid the day from when I'll drop it on concret.", "time": "16th January 2018, 02:38 AM", "postID": "post75214471", "replies": []}]}, {"title": "OEM skin/software", "rating": 4.0, "links": ["https://forum.xda-developers.com/s7-edge/review/oem-skin-software-t3330798", "https://forum.xda-developers.com/s7-edge/review/oem-skin-software-t3330798/page2"], "threads": [{"text": "Icons are a bit boring, side panels need more work and you cannot create your own themes.", "time": "10th March 2016, 06:17 PM", "postID": "post65762881", "replies": [{"text": "Samsung theme editor...", "time": "30th October 2016, 09:49 PM", "postID": "post69382698", "replies": [{"text": "My post was back in March, I bought a Note 7  but after the recall I am now back with the S7 Edge and it's much better now, especially with theming \r\n.", "time": "1st November 2016, 07:14 PM", "postID": "post69413565", "replies": []}]}]}, {"text": "I'm a Nova user but so far I'm on board for TouchWiz. I applied some basic themes (Vanilla, Android 6.0) and those assuaged any issues I had with the skin/icons. I also realized you still keep Samsung Pay and Edge panels even using another launcher so for me that's another nod to TW/Samsung for not hiding killer features while using another launcher. The Settings UI is much better and easier to digest. All the gimmicky \"s\" modes are gone or buried away from the Quick Settings. So I could roll either way. Overall I'd give this high marks knowing if I get bored I can always go back Nova.", "time": "14th March 2016, 03:47 AM", "postID": "post65825811", "replies": []}, {"text": "Tolerable after disabling bloat.", "time": "14th March 2016, 04:07 AM", "postID": "post65826000", "replies": []}, {"text": "touchwiz is better, but still not as good as nova. putting nova prime on it, and a new darker theme, this thing is slick. i love it. but i absolutely HATE the new, so called security feature, that makes you put in your password after a reboot, instead of just allowing you to use fingerprints. i mean, that's why we setup fingerprints, and i'm yet to understand how typing in your password in front of strangers is more secure than just using your fingerprint?", "time": "28th March 2016, 02:15 AM", "postID": "post66070532", "replies": [{"text": "That's an Android thing now not a Samsung or TW thing. It does that on both my S7E and Nexus 6P.", "time": "31st October 2016, 07:54 AM", "postID": "post69387826", "replies": []}]}, {"text": "ive never disliked tw and don't understand why prefer opted for vanilla android, i mean N is only now bringing features that samsung phones have had for literally, years.", "time": "28th March 2016, 06:57 PM", "postID": "post66081482", "replies": []}, {"text": "design is mediocre\n\r\nnot much change from samsung n8010 ui\n\r\nas soon as root possible without losing any abilities/priviledges including google pay, samsung pay & my knox", "time": "13th April 2016, 07:14 AM", "postID": "post66336236", "replies": []}, {"text": "Its a lil boring but better than ios. Looking forward to N.", "time": "28th August 2016, 06:39 PM", "postID": "post68414712", "replies": []}, {"text": "The only bad thing with this year's Samsung skin is that we will recieve android 7 later. But we already have android n features like split screen view,clear all...touchwiz is full of features and that's why i like it. I don't care if i will have a 5k boost in score on antutu if i only have my phone to call and message people. Touchwiz is awesome.  \nAgain,the only bad thing is that the devs need a lot of time to skin newer versions of android", "time": "28th August 2016, 09:33 PM", "postID": "post68417064", "replies": []}, {"text": "I'm surprised this hasn't been mentioned yet, but the emojis for the S7E are IMO hideous (not stock Android) and impossible to change without rooting and voiding your warranty.\n\r\nI can't link to them, but you can easily find them yourself and see if they fit your style.", "time": "11th October 2016, 08:42 AM", "postID": "post69073398", "replies": []}, {"text": "I use Nova Prime and bought a custom TW theme from the theme store to give me the look I want in SystemUI,  Phone, Messages, and such. I use a Cobalt Icon set, and custom wallpapers. It's very tolerable with this setup.", "time": "11th October 2016, 05:54 PM", "postID": "post69080988", "replies": []}, {"text": "The camera features are very difficult to access, thanks to the tiny buttons which fail to register everytime unless you are a sharp 'shooter' with your thumb. I wish they increase the size of in-camera buttons such as that of Large Eyes, Manual Focus arrows, etc. What do you all think of this?", "time": "19th February 2017, 03:11 AM", "postID": "post71092196", "replies": []}]}, {"title": "Outdoor visibility (max brightness)", "rating": 5.0, "links": ["https://forum.xda-developers.com/s7-edge/review/outdoor-visibility-max-brightness-t3330799", "https://forum.xda-developers.com/s7-edge/review/outdoor-visibility-max-brightness-t3330799/page2"], "threads": [{"text": "Very low brightness on the lowest setting, and insanely bright on max. Colors look great, response is excellent.", "time": "10th March 2016, 08:13 PM", "postID": "post65764893", "replies": []}, {"text": "I've had with the S6 that I'll only get full brightness when it's directly in the sun. Indoors it doesn't matter but outdoors facing against the sun it sucks, is that gone with the s7?", "time": "10th March 2016, 08:34 PM", "postID": "post65765266", "replies": []}, {"text": "so much better than the s5 that i had before, now i can se the screen even in sunlight.. guess i have to wait untill summer to know for real.. but looks great so far!", "time": "10th March 2016, 11:21 PM", "postID": "post65767660", "replies": []}, {"text": "My s6e+ screen got brighter than my s7e.... Is it just me or what", "time": "12th March 2016, 02:50 AM", "postID": "post65788874", "replies": []}, {"text": "EXCELLENT", "time": "15th March 2016, 01:41 PM", "postID": "post65851289", "replies": []}, {"text": "Looks good outdoors currently passes halfway mark on brightness maybe 65-70", "time": "16th April 2016, 09:42 PM", "postID": "post66398750", "replies": []}, {"text": "The Note 4 I had before was much brighter outdoors than the S7 Edge...", "time": "16th April 2016, 10:37 PM", "postID": "post66399392", "replies": []}, {"text": "Did you have auto brightness on \nI have noticed my Note is brighter at max brightness but with auto brightness on s7 edge passes it", "time": "16th April 2016, 11:56 PM", "postID": "post66400205", "replies": []}, {"text": "Super amoled display. It's give you same brightness in the sun. There are no phone that you can give same brightness in the sun. So, outdoor visibility is best from any other android phone. Don't think about outdoor visibility. I check it. Really amazing!", "time": "17th April 2016, 02:44 PM", "postID": "post66408648", "replies": []}, {"text": "Hello everyone! I want to introduce you my real life outdoor video of Screen sunlight visibility comparision between, Samsung Galaxy S7 Edge and other Galaxies.\nI hope you will like it and it will help you! \nLink for the video:\nhttps://www.youtube.com/watch?v=4x9cYNii3Pc", "time": "17th April 2016, 08:15 PM", "postID": "post66413570", "replies": []}, {"text": "I'll give it 10 out of 10. That's because the marvelous Friedrich420 at Echoerom has given us the awesome outdoor mod in V5. See picture attached. Now I can't go without it", "time": "18th April 2016, 02:16 AM", "postID": "post66417242", "replies": []}, {"text": "I had my note 5 and S7 edge outside today in the naked sun, both set to auto brightness.  I couldn't tell the difference with or without sunglasses. Bother beautiful and clearly visible with sunglasses.  My iphone toting daughter lost her mind. LOL  HAHAHA", "time": "18th April 2016, 05:39 AM", "postID": "post66418830", "replies": []}, {"text": "did any of you notice a pink hue when viewed in direct sunlight? sections of the screen covered by shade will appear white without the pink hue.", "time": "20th April 2016, 07:19 PM", "postID": "post66465063", "replies": []}, {"text": "My S5 is brighter than my S7E at all level outdoor.", "time": "22nd April 2016, 05:15 PM", "postID": "post66496182", "replies": []}, {"text": "better than the 6s for sure!", "time": "7th May 2016, 09:01 AM", "postID": "post66735878", "replies": []}, {"text": "It's ok. my note 4 is brighter btw.\nI don't know why people like AMOLED. They're absolutely awful.", "time": "17th December 2016, 08:27 PM", "postID": "post70137498", "replies": []}, {"text": "Superb", "time": "16th April 2017, 06:21 AM", "postID": "post71879871", "replies": []}]}, {"title": "Contrast (true blacks)", "rating": 5.0, "links": ["https://forum.xda-developers.com/s7-edge/review/contrast-true-blacks-t3330800"], "threads": [{"text": "It is as dark as it gets. By far the best display on the market.", "time": "18th March 2016, 06:25 PM", "postID": "post65913724", "replies": []}, {"text": "Not sure what the purpose of this thread is, as the blacks on the s7 are true black. It's AMOLED so the \"black pixels\" are literally black  because there's no light coming from them.", "time": "18th March 2016, 10:35 PM", "postID": "post65917555", "replies": [{"text": "Vantablack wants a word with you, lol. The screen could actually get even blacker/darker.", "time": "8th April 2016, 02:11 AM", "postID": "post66248677", "replies": [{"text": "The photo of it is terrible. The black around on the screen is more truer than the item itself lol", "time": "7th December 2016, 09:46 PM", "postID": "post69979762", "replies": []}]}]}, {"text": "im a true black.", "time": "8th April 2016, 05:43 PM", "postID": "post66259246", "replies": []}, {"text": "Its not as black as it is on s5 or note 4 especially text", "time": "6th December 2016, 09:40 PM", "postID": "post69962908", "replies": []}, {"text": "Superb", "time": "16th April 2017, 06:21 AM", "postID": "post71879873", "replies": []}]}, {"title": "Color saturation & accuracy", "rating": 4.5, "links": ["https://forum.xda-developers.com/s7-edge/review/color-saturation-accuracy-t3330801", "https://forum.xda-developers.com/s7-edge/review/color-saturation-accuracy-t3330801/page2", "https://forum.xda-developers.com/s7-edge/review/color-saturation-accuracy-t3330801/page3"], "threads": [{"text": "Screen and color's are great! Only whites aren't really white, they are yellowish.", "time": "12th March 2016, 05:47 PM", "postID": "post65800200", "replies": [{"text": "My G935F too. It has a little bit yellowish display. I hope Samsung to fix this issue soon", "time": "23rd March 2016, 04:02 PM", "postID": "post65997506", "replies": []}]}, {"text": "It's an amoled screen, don't think there's much they can do. There's pros and cons to amoled screens just like there's to LCD screens", "time": "26th March 2016, 05:36 PM", "postID": "post66049316", "replies": []}, {"text": "Whites are a bit yellowish. Looks weird and terrible compared to the screen on my One Plus One which shows true whites and highly accurate colors. Guess will have to live with it since this isn't device specific at my location.", "time": "29th March 2016, 06:54 AM", "postID": "post66089197", "replies": []}, {"text": "very nice screen and color. white is great color.", "time": "29th March 2016, 08:47 AM", "postID": "post66090220", "replies": []}, {"text": "On adaptive mode the whites are pretty white (maybe on the bluish side) but the colors are too vibrant. I'm on photo mode and the whites are very warm. Im seeing a brownish orange tint to the whites.", "time": "29th March 2016, 10:14 AM", "postID": "post66091071", "replies": [{"text": "Exactly and I don't mind my whites being a bit bluish, like my laundry.", "time": "15th June 2016, 03:27 AM", "postID": "post67322539", "replies": []}]}, {"text": "well", "time": "14th June 2016, 11:41 AM", "postID": "post67311232", "replies": []}, {"text": "On a Basic mode, the white are warmer (I dont really mind that since it soft on the eyes) than the other modes but the color accuracy are so accurate!", "time": "15th June 2016, 05:30 AM", "postID": "post67323420", "replies": []}, {"text": "With screen mode set to Amoled Photo it's very accurate.\n(I'm a professional photographer so am comparing the colour and white balance representation to my calibrated monitor).", "time": "15th June 2016, 06:58 AM", "postID": "post67324107", "replies": [{"text": "I think 'photo mode' complies with the sRGB spectrum which still oversaturates colours compared to RGB. - If you do photo work and need pin point accuracy with this mode it is about as good as it gets.\n\r\nFor normal use however the 'Basic' mode has been tuned to almost 100% accuracy.\n\r\nI agree that whites, especially at lower brightness levels, have a yellowish tint to them.\n\r\nUnfortunately Samsung, in their pursuit for 'technical perfection' (total colour accuracy ... which this model comes closer to than any other phone screen on the market at present) have not included any other white balance adjustment, just the four presets. Not good.\n\r\nEven my Elephone P9000, a superb phone for the money, has much more elaborate controls in form of Mira Vision/Mediatek which lets me adjust many parameters, including white balance, which are unaccessible in my S7E.\n\r\nI have read that in the current beta version of Android N there is indeed built-in white balance adjustments which would go a long way to eleviate this issue. Whether this will make it to Android N final version is an altogether different question. \n\r\nFurthermore, even if it does, Samsung are not exactly the quickest adopters of Android upgrades so it could be some time until we see this on an S7/Edge.\n\r\nRooting seems to be the only option to get white balance adjustment.\n\r\nSamsung, if you read this, please include colour sliders/white balance adjustment with your next upgrade. - Many, many thanks.\n\r\nIn most other aspects, this phone is superb.", "time": "17th June 2016, 01:33 PM", "postID": "post67360151", "replies": []}]}, {"text": "I understand why some people may want white balance adjustment, but understand that the white point in basic mode is what true white is supposed to be. Bluish whites that many people prefer are color inaccurate. Giving a way to adjust white balance within the modes makes sense, but I certainly wouldn't want the bluish whites that are found within Adaptive Display and AMOLED Cinema to make their way over to AMOLED Photo and Basic modes, because then the insane possible color accuracy of these screens is out the window.", "time": "17th June 2016, 03:37 PM", "postID": "post67361875", "replies": []}, {"text": "Cinema and Adaptive are bluish colors, which is better for me since i don't like the yellowish colors of Photo and Basic.", "time": "18th June 2016, 09:56 AM", "postID": "post67372874", "replies": []}, {"text": "How uniform are whites?", "time": "17th July 2016, 02:46 PM", "postID": "post67784173", "replies": [{"text": "I can only speak for my phone but screen uniformity is perfect.\n\r\nUse LightManager from the app store if whites are to warm.", "time": "17th July 2016, 04:03 PM", "postID": "post67785108", "replies": [{"text": "Thank! Which color did you buy?", "time": "17th July 2016, 05:30 PM", "postID": "post67786299", "replies": [{"text": "Platinum Gold  \n\nLuvely ...", "time": "17th July 2016, 05:53 PM", "postID": "post67786586", "replies": []}]}]}]}, {"text": "Do you guys put much faith in Display Mate's website?\n\nFor what it's worth, I prefer AMOLED Photo mode because Basic just felt a little too drab when I tried it for a few days, and Adaptive is obviously way too saturated.", "time": "18th July 2016, 09:32 PM", "postID": "post67803610", "replies": []}, {"text": "Not good.\r\nThat combined with the terrible ghosting on dark. colors males this display a nightmare", "time": "21st December 2016, 08:54 PM", "postID": "post70198230", "replies": []}, {"text": "I don't know if this is the right thread for my question, but does anyone's display have a pinkish tint when looking at it from about 60 degrees angle? \nWhen looking straight at it, the whites are okay.\nI bought the s7 edge 2 days ago and this is my only \"issue\". Had an s7 flat till then and it wasnt as pink as this one when tilted. So I'm wondering if that is more common for edge panel?", "time": "9th March 2017, 12:34 PM", "postID": "post71349936", "replies": []}, {"text": "Excellent", "time": "16th April 2017, 06:21 AM", "postID": "post71879874", "replies": []}]}, {"title": "Clarity/resolution", "rating": 4.5, "links": ["https://forum.xda-developers.com/s7-edge/review/clarity-resolution-t3330802", "https://forum.xda-developers.com/s7-edge/review/clarity-resolution-t3330802/page2", "https://forum.xda-developers.com/s7-edge/review/clarity-resolution-t3330802/page3"], "threads": [{"text": "done", "time": "14th June 2016, 11:42 AM", "postID": "post67311244", "replies": []}, {"text": "Even at QHD I can see the weird rainbow-sh look in the display. AMOLEDs with pentile pattern look worse than something like IPS at the same resolution.", "time": "21st December 2016, 08:52 PM", "postID": "post70198213", "replies": []}, {"text": "Im not sure if it's because of the curves or the QHD but the screen looks AMAZING. Great contrast between whites and blacks and so crisp for web browsing.", "time": "7th February 2017, 02:39 AM", "postID": "post70912784", "replies": []}, {"text": "Definitely one of the best screens available in smartphones. WOW effect is still present for me.", "time": "7th February 2017, 05:23 PM", "postID": "post70922728", "replies": []}, {"text": "I think the edges ruin the screen for me. If the S7 had been larger I wouldn't have gotten the edge. \n\nI say this as a previous Note 7 owner. The Note 7 edge wasn't so steep and didn't blur out text/pictures that go over the edge anywhere near as bad. \n\nI will gladly buy an S8 edge outright if it holds the design of the Note 7's edge.", "time": "8th February 2017, 01:53 AM", "postID": "post70928566", "replies": []}, {"text": "Believe that IPS screens have more definition. \n\nNot a bad screen, but if I compare my iPhone 6s Plus between this S7 Edge, iPhone looks more clear.", "time": "10th March 2017, 09:39 PM", "postID": "post71372682", "replies": [{"text": "I personally don't think the clarity is any better, but the colors are far more realistic which may be what causes that thought. While the S7E is better than previous samsung phones I've had, their colors are insanely over saturated. That just is a samsung thing in general. Their TVs are the same way. Most of the stock adjustments are horrible and I could never own one without it needing calibrated.", "time": "11th March 2017, 09:21 PM", "postID": "post71387138", "replies": [{"text": "There are several options in settings > display > screen mode to adjust colors.", "time": "14th March 2017, 01:17 AM", "postID": "post71418028", "replies": [{"text": "Yeah, it doesn't come close regardless of those settings to the more realistic IPS display. I do blame Samsung, I think the displays are capable of realistic colors, but samsung is at fault for their love of over saturation. \n\n\n\r\nDo you have the phone set to WQHD? I was comparing mine to my dads Iphone 6S Plus last night and couldn't tell a difference minus the heavy color saturation. I started using some B&W images to compare to try and remove the color problem. Tried to pick some pictures that were more on the W end than the B end to keep it relatively fair. Used some rather large pictures, larger than either display can show, which also plays a role in which compresses better. WQHD is 2560X1440 and the 6S Plus is 1920X1080. I did not compare two 1080P images and so the Iphone may win here. I can't say for sure. \n\r\nNow if you were to ask me to compare my old Note 3/4 to the Iphone 6 Plus at the time, I would 100% agree with you.", "time": "15th March 2017, 10:03 PM", "postID": "post71446122", "replies": [{"text": "This article seems to say otherwise. http://www.displaymate.com/Galaxy_S7_ShootOut_1.htm", "time": "15th March 2017, 10:15 PM", "postID": "post71446259", "replies": [{"text": "says exactly what I am saying...\n\r\nScreens fine, but over saturated to hell and back. Yes it has a color management to help, but it can't fix horribly handled saturation by Samsung. \n\r\n\"As expected the Galaxy S7 OLED spectra are relatively narrow with deep notches between the primaries, which results in highly saturated colors that are adjusted with display Color Management to improve image color accuracy\"", "time": "20th March 2017, 09:32 PM", "postID": "post71515653", "replies": [{"text": "According to the article from DisplayMate, the the average color error (from sRGB) of the S7 Edge is 1.5 JNCD and broke the previous record for color accuracy. I see no evidence that Samsung was unable to properly calibrate the S7 Edge display in Color Management, as it had the least average color error for smartphone displays at the time of review.", "time": "20th March 2017, 10:18 PM", "postID": "post71516184", "replies": [{"text": "I once bought a Pioneer Kuro 50\" Plasma TV. It was, at the time, heralded as the most accurate set available. Display Mate and others did their tests etc and several AV mags used the TV as a reference. It cost me £2700.\n\r\nI sold it at a £900 loss 6 months later. \n\r\nNever got on with it and honestly never understood what all the buzz was about. Whilst blacks were deep whites looked ... not white. Worse, in scenes with a lot of white content the brightness dimmed further. The thing also buzzed in tune with brightness levels.\n\r\nThe test reports didn't or hardly did touch on these well known problems often discussed on owner forums.\n\r\nMoral ... don't believe everything you read.\n\r\nI also feel that for me a good LCD still has the upper hand in naturalness picture wise overall compared to Amoled which, in comparison, seems over saturated.  (I use basic mode and an app called Screen balance)\n\r\nOther than that, I think the S7E is a good device and I probably will use it another year.\n\r\nMy next phone will likely have an LCD display though unless Samsung change their Amoleds in some ways (or introduce more versatile screen adjustments)\n\r\nSaturation levels may well also depend on the resolution\r\nIf every pixel is used you likely get more Saturation.  In Nougat you can lower resolution to HD. I haven't updated yet as I want more S7e user feedback on A7 (I have exceptional battery life on MM and no issues). \n\r\nI would be interested to hear if anyone noticed less Saturation with reduced resolution, ideally backed up by measurements.", "time": "25th March 2017, 09:24 AM", "postID": "post71579736", "replies": []}, {"text": "Most can't.  Don't worry \n\r\nMarketing gimmick until headsets become more useful (which they are not at present).\n\r\nMost (Almost all) content is not QHD. It means it has to be up-converted and this process itself will have a detrimental effect on quality.\n\r\nThey would be better off using gapless display technology which does wonders for perceived clarity but the curved displays preclude that for the moment. It's that gap between the amoled panel and top glass that is another problem.\n\r\nLike I said, I find the iphone 7's display superior in most respects. Still love the 7E though.", "time": "30th March 2017, 07:59 AM", "postID": "post71646835", "replies": []}]}]}]}, {"text": "Yes, on WQHD, on 1080p doesn't have any chance to fight.\n\r\nI am not sure what it is, just feeling more satisfied with 6s Plus. I have played with Settings on screen for S7E, but it's not close. It may be that I've used my 6s plus for a year and I'm new with the S7E, got used to ips. \n\r\nAnyhow, I feel same as you with saturation. Samsung could do it better.", "time": "15th March 2017, 11:57 PM", "postID": "post71447250", "replies": []}]}]}, {"text": "I do know about saturation on AmoLed screens. I´m actually comparing both phones right now, and looking closely to them, I can swear iPhone has more like definition, despite of resolution on S7E. \n\r\nYou are right about TVs, their colors are too much strong for me, thats why I prefer LG, curved screens are insane.", "time": "14th March 2017, 10:30 PM", "postID": "post71431877", "replies": []}]}]}, {"text": "I used to own an Iphone 6s and the difference in screen quality is huge.I love my s7 edge!", "time": "18th March 2017, 02:33 AM", "postID": "post71476206", "replies": []}, {"text": "I really like my S7e in every way but an Iphone 7 plus display looks better to me. \n\r\nDoesn't really bother me though.", "time": "18th March 2017, 09:10 AM", "postID": "post71478802", "replies": []}, {"text": "kinda disappointed with whiteness of the screen\r\nmy opx and oppo f1 s have much whiter screen.this one is yellowish. any tweaks suggested?", "time": "24th March 2017, 03:37 PM", "postID": "post71569950", "replies": []}, {"text": "I can't see the differents between FHD and 2k with my eyes", "time": "29th March 2017, 03:25 PM", "postID": "post71637524", "replies": []}, {"text": "I really like the s7 edge display, especially the high contrast and the edges make me feel like there's no \"Limits\" haha a really nice experience. \r\nSadly i can't notice any differences between FHD and QHD, i do not know why", "time": "30th March 2017, 02:35 PM", "postID": "post71651076", "replies": []}, {"text": "Outstanding", "time": "16th April 2017, 06:22 AM", "postID": "post71879879", "replies": []}]}, {"title": "Minimum brightness", "rating": 4.5, "links": ["https://forum.xda-developers.com/s7-edge/review/minimum-brightness-t3330803", "https://forum.xda-developers.com/s7-edge/review/minimum-brightness-t3330803/page2", "https://forum.xda-developers.com/s7-edge/review/minimum-brightness-t3330803/page3"], "threads": [{"text": "I don't have on auto brightness or any power saving features on yet my display brightness seems to have a mind of its own. I can be in a dimly lit room and have to put my brightness slider past the halfway mark just to get decent brightness and the always on display will be so dim it's barely visible. Other times I could be in a well lit store or outside and the display will be very bright even with the slider nearly all the way down.  It also seems the always on display may get brighter the longer it's on but it starts out very dim even if my brightness is cranked up. I really don't know what to make of it. Sometimes the display brightness seems way worst then my nexus 6p (not saying 6p has bad brightness just using as a reference cause most reviewers claim the brightness on note5/s7 is a bit brighter.) Other times the quality seems better then my friend's note 5.", "time": "7th March 2016, 11:29 PM", "postID": "post65710956", "replies": []}, {"text": "Adaptive brightness? Sure sounds like it.", "time": "7th March 2016, 11:51 PM", "postID": "post65711184", "replies": []}, {"text": "I am disappointed it does not go low enough like all android phones tablets etc. I read books in the Kindle app in bed and my iPhone or I pad can go very low brightness but all the android gadgets I have cannot they are always too bright and annoy her. I thought this could be the one but I guess not", "time": "8th March 2016, 09:59 PM", "postID": "post65728319", "replies": [{"text": "Install LUX Auto brightness app and it should solve your problem, in fact you can set it so dim that you can hardly read it.", "time": "9th March 2016, 12:26 AM", "postID": "post65730029", "replies": [{"text": "Great suggestion works like a charm", "time": "16th June 2017, 10:50 PM", "postID": "post72699806", "replies": []}]}]}, {"text": "I find the always on display to bright. Is there a way to dim it a bit?", "time": "12th March 2016, 07:47 AM", "postID": "post65791693", "replies": [{"text": "I totally agree with that, when you cover the sensor the brightness is way better.\nIt should be part of the environment, now it's more like \"HEY LOOK AT THE TIME\" kinda distracting", "time": "12th March 2016, 05:54 PM", "postID": "post65800305", "replies": [{"text": "Yeah haha. The funny thing is that the \"night clock\" is perfectly dimmed. Wished that there was a setting for the AOD (always on display) to have manual brightness controll. And of course app notifications. Which the edge display can show, but the AOD can not. Strange decision of our Sammy friends.", "time": "12th March 2016, 09:12 PM", "postID": "post65803196", "replies": [{"text": "Exactly, that would be perfect, I tried using AOD at work today and it's so distracting that it's actually worthless now. I also tried the night clock at work and it looks great, it doesn't bother me at all and it's very handy. Hope samsung will update AOD because it can be very useful.\n\nBut in my opinion the overall (auto) brightness is too bright, when I dim my screen it automatically brighten the display up to what it thinks it is the right brightness compared to the environment . With my previous phone (LG G2) it changed the auto brightness to the user preference.\nYou can fix this issue, set brightness 100% and reboot.", "time": "14th March 2016, 03:32 PM", "postID": "post65833730", "replies": []}]}]}]}, {"text": "Hi guys, I noticed right now that if I switch from an high luminosity environment to a very dark one, automatic brightness remains the same and I have to uncheck and check again the \"auto\" option on notification bar. Other times, in same conditions, it adapt the brightness after some times instead of immediately. Dose have my phone problems?", "time": "12th April 2016, 09:12 AM", "postID": "post66319410", "replies": [{"text": "This is to prevent the display continue changing brightness, it does change but it has a delay so your screen isn't flickering bright, dark, bright, dark. \n\n---------- Post added at 09:37 PM ---------- Previous post was at 09:35 PM ----------\n\n\n\r\nThis has been fixed with the update that came out this week #yay! It's now changing automatically, not as distracting anymore", "time": "21st April 2016, 08:37 PM", "postID": "post66482499", "replies": [{"text": "I noted that when I turn on the screen I a low light environment, it has a fade before the screen completely turn on, like a fade effect. I did some tries and this happen only in low light condition. Is this normal? \n\n\n\n\r\nYes, but if I put the phone orizonthal (for instance I put I on the table) the brightness change immediately. Why is that? \n\nSended from my Samsung Galaxy S7 Edge Gold Platinum", "time": "22nd April 2016, 10:50 PM", "postID": "post66500530", "replies": [{"text": "Does someone know something about that? \n\nSended from my Samsung Galaxy S7 Edge Gold Platinum", "time": "26th April 2016, 04:42 AM", "postID": "post66549080", "replies": []}]}]}, {"text": "Hi.. I have the same problem! Every time I switch form a environment with more or less luminosity I have to unchek and check again the \"auto\" option on a notification bar.. Do you founded out any solution?", "time": "18th April 2017, 07:40 PM", "postID": "post71917970", "replies": [{"text": "Do you have MM or Nougat? I noticed the same in MM but it works significantly better in Nougat.", "time": "18th April 2017, 10:36 PM", "postID": "post71920140", "replies": [{"text": "I am still using MM. I 'm waiting the update by OTA, but now I am thinking seriously  update them by Odin.", "time": "19th April 2017, 02:39 PM", "postID": "post71929893", "replies": []}]}]}]}, {"text": "its too bright :/", "time": "23rd April 2016, 10:58 AM", "postID": "post66506407", "replies": []}, {"text": "Anyone use Night Mode app?  Can configure it to be like ios night mode.", "time": "26th April 2016, 07:49 AM", "postID": "post66550587", "replies": [{"text": "What does it exactly? \n\nSended from my Samsung Galaxy S7 Edge Gold Platinum", "time": "26th April 2016, 12:55 PM", "postID": "post66553900", "replies": []}]}, {"text": "Very good", "time": "16th April 2017, 06:22 AM", "postID": "post71879884", "replies": []}, {"text": "The problems some of you have ... seriously?  😆", "time": "19th April 2017, 07:20 AM", "postID": "post71924697", "replies": []}, {"text": "Im having an issue about Always On Display. Normally AOD's brightness is automatically changing but when im under the sun AOD's brightness is not rising all the way up and im hardly seeing it. is that a problem or totally normal?", "time": "15th July 2017, 09:51 PM", "postID": "post73043441", "replies": []}]}, {"title": "Call quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/s7-edge/review/call-quality-t3330804", "https://forum.xda-developers.com/s7-edge/review/call-quality-t3330804/page2"], "threads": [{"text": "The build in speaker is pretty bad.", "time": "16th March 2016, 06:15 PM", "postID": "post65875450", "replies": []}, {"text": "I am afraid to report that my S7 edge microphone is cutting out during calls, and that it sometimes simply drops calls. I have an Exynos version on Swisscom, and I will unfortunately return the phone within the two week-return period .\r\nAm I the only one affected by this issue?", "time": "18th March 2016, 01:16 PM", "postID": "post65908459", "replies": []}, {"text": "My speaker start making noise within the call and almost muted. Also when I talk longer somehow something switching- I can hear it and then adding like a 'echo '. Difficult to explain. \nand the quality is way worst than iPhone 6+", "time": "18th March 2016, 03:32 PM", "postID": "post65910651", "replies": []}, {"text": "My earphone started making popping - clicking like sounds when the other person is speaking.  It is kinda irritating.  Any body else has the same?", "time": "10th April 2016, 03:32 PM", "postID": "post66289656", "replies": [{"text": "Check speaker with *#0*# code", "time": "10th April 2016, 07:25 PM", "postID": "post66293417", "replies": []}]}, {"text": "Same problem here. Speaker sounds ok on all three frequencies.\nThe problem is only there when I am talking to someone via gsm network. Not on viber or listening to music. Please note that I have used same gsm network  number on other phone and it works well.", "time": "10th April 2016, 09:08 PM", "postID": "post66294935", "replies": [{"text": "+1", "time": "2nd February 2017, 11:14 AM", "postID": "post70844306", "replies": []}]}, {"text": "The only problem i have with the s7 edge calling speaker is the *BEEP* sound when calling someone. It sounds distorted. \r\nMaybe it's my carrier. \n\r\nAnyone else?", "time": "11th April 2016, 10:17 AM", "postID": "post66302470", "replies": [{"text": "This can be turned off in call settings.\r\nCall connection and ending tones\n\n---------- Post added at 04:25 AM ---------- Previous post was at 03:46 AM ----------\n\nCall quality also depends on carrier, network etc. HD Voice, Wifi Call or voLTE.\nAlso different carriers have different quality in their systems.\nFrom my point of view the call quality is amazing with both 4G Voice/voLTE and HD voice.\nOn my carrier voLTE requires both caller and receiver to be on same network, if I call people on other operators I ''just get'' HD Voice.\nI have not tried the speaker without root and Viper4Android. But with V4A the speaker sounds good, high and clear!\nThis said if there are alot of background noice on receivers end, I find HD Voice to be better than voLTE. \nIn quiet surroundings I find vOLTE superior again.", "time": "10th January 2017, 03:25 AM", "postID": "post70479973", "replies": []}]}, {"text": "During my test of low frequencies, the clear sound was only in 300. The other two - 100 and 200 was kind of noisy, messy comparing to the 300\n\nIs it normal or there is something wrong with my phone?", "time": "11th April 2016, 01:54 PM", "postID": "post66305256", "replies": [{"text": "+1\n\r\nSeem kind of distortion, something like buzz kinda sound in low frequency.", "time": "1st August 2016, 07:17 AM", "postID": "post67990931", "replies": []}]}, {"text": "4.5/5", "time": "2nd May 2016, 12:12 AM", "postID": "post66646528", "replies": []}, {"text": "My earphone started making popping ....", "time": "1st August 2016, 09:05 AM", "postID": "post67991865", "replies": []}, {"text": "For me it is a bit quiet at times. \n\r\nAnd also i just got it from repair because if i pressed fhe phone too hard onto my ear it started makinh wierd noises,  like cracking. And somtimes it made it louder. Sometimes totally muted it. Now that its back its okay but still i think it could be a bit louder", "time": "9th January 2017, 05:06 PM", "postID": "post70473469", "replies": []}, {"text": "It's  not the phone .\r\nIts Sprint's shifty CDMA network.\r\nI've  had the same phone on t-mobile with lte calling and it sounds amazing.", "time": "8th February 2017, 06:21 PM", "postID": "post70940201", "replies": []}, {"text": "same issue facing on gsm network during call on custom roms nougat  only \n\non official nougat rom voice super clear  \n\non gsm call distortion in calls", "time": "27th November 2017, 05:06 PM", "postID": "post74656890", "replies": []}]}, {"title": "WiFi strength, range, and throughput", "rating": 4.0, "links": ["https://forum.xda-developers.com/s7-edge/review/wifi-strength-range-throughput-t3330805", "https://forum.xda-developers.com/s7-edge/review/wifi-strength-range-throughput-t3330805/page2"], "threads": [{"text": "I like the fact that it has a fast power up time, It used to take ages to turn on and connect, on my exynos GS5", "time": "11th March 2016, 03:15 AM", "postID": "post65770109", "replies": []}, {"text": "Three quick responses:\n\r\n1) Range and Throughput are pretty phenomenal. Just checked my connection and I'm connected at 650mb and am a good 70 feet from the router (at least).\r\n2) Battery drain is nearly non existent with Wifi on. I remove my phone from the charging pad at night when it reaches 100% and in the morning it's sitting at 98%. This is about 8 hours off of the charger still connected to Wifi (set to always remain connected).\r\n3) You shouldn't poop in the bedroom.", "time": "7th April 2016, 09:51 PM", "postID": "post66246197", "replies": [{"text": "2% in 8 hours is phenomenal. Do you have the G935F ?", "time": "7th April 2016, 10:12 PM", "postID": "post66246501", "replies": []}, {"text": "1) 4g 150mbps down and up. Wifi 250mbps down 100mbps up. Range is good as expected.\n\n2)  Battery drain is higher than my 2yr old HTC m8. 8hours sleep, s7e drains at least 5%. HTC = 1%. Am I missing something?\n\n3) High battery drain when using hotspot. Much higher than my old HTC m8", "time": "10th April 2016, 08:46 AM", "postID": "post66284713", "replies": []}]}, {"text": "wifi on all night i lose between 0 and 2% over 9 hours sleep", "time": "11th April 2016, 10:58 AM", "postID": "post66302953", "replies": []}, {"text": "this phone is great i used it at work now for a week and each night i use the wifi share setting to boost my wificonnnection  and so i can connect to my chromecast and watch movies and it easyly goes for like 10 hours and still have 40-50% battery left so this is great", "time": "12th April 2016, 07:28 AM", "postID": "post66318356", "replies": []}, {"text": "so far no issues.", "time": "7th May 2016, 09:02 AM", "postID": "post66735885", "replies": []}, {"text": "that,s good", "time": "14th June 2016, 11:46 AM", "postID": "post67311281", "replies": []}, {"text": "my previous phone, a Note 3 and my phone from work, a S5 Mini, both have better reception at home then the S7 edge", "time": "15th June 2016, 10:22 AM", "postID": "post67326065", "replies": []}, {"text": "I am fortunate enough to have gigabit internet in the home.  Recently it was installed, and the most shocking thing was how poor almost all of our devices performed.  The MacBooks were averaging 250 Mbps on AC, and 700-900mbps with ethernet (depending on model).. \n\nHowever, my S7e stole the show, and consistently hits 350+mbps on AC, and 150+ on t-mobile LTE.  (All devices max out the 108ish mbps upload speed).  I will also add that the bluetooth range and power is tremendous.  It works from everywhere in the house, and doesn't cut the sound when you walk in the signal path (something I've experienced with macbooks).", "time": "16th June 2016, 07:28 PM", "postID": "post67349610", "replies": []}, {"text": "I get nearly 300 mbps via 4g and max my 100 mbps connection on wifi via my r7000", "time": "18th June 2016, 10:24 AM", "postID": "post67373158", "replies": []}]}, {"title": "Cellular strength and throughput", "rating": 4.5, "links": ["https://forum.xda-developers.com/s7-edge/review/cellular-strength-throughput-t3330806", "https://forum.xda-developers.com/s7-edge/review/cellular-strength-throughput-t3330806/page2", "https://forum.xda-developers.com/s7-edge/review/cellular-strength-throughput-t3330806/page3"], "threads": [{"text": "I'll let you know how the Verizon one is for sure. Currently my Galaxy S6 Edge gets horrible service at work. If I am even able to get 1 single bar of LTE with the S7 Edge then it is definitely an improvement.", "time": "7th March 2016, 09:17 PM", "postID": "post65709097", "replies": []}, {"text": "Hi.  Thanks for you report.  \nPlease can you make à complete review and comparaison of signal in différent conditions (low signal, high signal,  work, home,...) with s6 and s7. \nWhat about stability of signal.\n And if you can put screen. Thanks\nThanks a lot", "time": "7th March 2016, 10:33 PM", "postID": "post65710217", "replies": []}, {"text": "It's clearly better than any LG (G2, G3, G4, V10) I've owned. I'm pleasantly surprised. The V10 was supposed to have TruSignal, it was marketed as the first phone to use it, but I had horrible reception all over. I get excellent signal with the Samsung and this is the first one I've ever owned after swearing to never buy one lol.", "time": "8th March 2016, 12:44 AM", "postID": "post65711726", "replies": [{"text": "I'm on the same boat. I jump every 9 months between LG and Nexus. Always hating on Samsung and swear never to buy one but oh well.  This is my first Samsung S7 Edge just waiting for the mailman to deliver. Hope the jump is worth it. 👍", "time": "8th March 2016, 08:10 PM", "postID": "post65726648", "replies": [{"text": "I'm impressed. Nothing like I thought it would be. It's a great phone.", "time": "8th March 2016, 08:11 PM", "postID": "post65726673", "replies": [{"text": "Really nice glad to read that from a LG fellow. Can't wait to get my hands on that S7 Edge.", "time": "8th March 2016, 08:16 PM", "postID": "post65726752", "replies": []}]}, {"text": "Which version do you have snapdragon or exynos?", "time": "9th March 2016, 06:48 AM", "postID": "post65733461", "replies": [{"text": "I don't have it yet but I'm in Puerto Rico which is part of USA and I'm in the T-Mobile carrier so I guess it'll be Snapdragon. Unless there's a possibility to get the Exynos version?", "time": "9th March 2016, 10:42 AM", "postID": "post65735895", "replies": []}]}]}]}, {"text": "I have been using my phone for like 24 hours... I have to state the devices lte is way better then my note 5 WiFi calling has been beefed up as well it's solid crystal clear no issues what so ever the s7 edge was well worth the trade in.", "time": "9th March 2016, 04:58 AM", "postID": "post65732421", "replies": []}, {"text": "I have the Verizon S7 Edge and so far (24 hours), the cell service is great.", "time": "9th March 2016, 08:01 PM", "postID": "post65745158", "replies": []}, {"text": "very disappoint . Had iPhone 6S and Galaxy A5 before.  and there is no improve over them.\n\r\nExynos version", "time": "12th March 2016, 12:49 PM", "postID": "post65795629", "replies": []}, {"text": "hmm compared to my old nexus 5 ... i think the s7 edge is not as good as the n5 \nhope there is more improvement in the future", "time": "15th April 2016, 09:35 AM", "postID": "post66372403", "replies": []}, {"text": "I'm not as happy with the service rev compared to the v10. I've had Samsung since the s3 getting a new one every year and having the note edge with no development I went with the v10, which didn't. So I came back and I think the note 4 had better service than the s7 edge and the v10, which I thought was much better than the s7", "time": "15th April 2016, 11:32 PM", "postID": "post66384099", "replies": []}, {"text": "I love  my T-Mobile connection, is way faster in México, in T-mobile at California is around 5Mbps to 75Mbps download and 5Mbps to 35Mbps Upload.\n\nBut as you see, speed is way better in México and Unlimited", "time": "11th June 2016, 02:44 AM", "postID": "post67264930", "replies": []}, {"text": "I have Exynos version and using on USA T-Mobile network,my signal not as good as mate 8 the one before I used.", "time": "8th July 2016, 12:40 AM", "postID": "post67649528", "replies": []}, {"text": "The signal is awful at least half that of the cheapest phone you could find on the market on the same network. The S7 is practically a polished turd, useless, unless you happen to be in an area with a very strong signal. There is no fix for this issue because the phone has been poorly designed. \n\nAs soon as I can I plan to sell this and upgrade to a OP3... at least it works and a fraction of the price.....", "time": "26th August 2016, 08:10 PM", "postID": "post68383407", "replies": []}, {"text": "I have the Exynos G935F and my signal seems to have improved quite a bit from the Sony Xperia Z5 I was using before.", "time": "3rd November 2016, 01:46 PM", "postID": "post69441371", "replies": []}, {"text": "I've got the SM-G935U and I'm on T-Mobile in the Bay Area. I like the phone a lot but the signal strength in both my office in SF and my home in San Mateo ... kinda sucks. I had the Note 7 for a very short time and it was amazing. The Note 7 was my first Samsung in a while so it's just the S7E and Note 7 I can talk about ... but comparing the S7E to my Nexus 6P (6, 5, 4), iPhone 6, and a few others here and there .. the S7E doesn't stack up at all. Not sure why .. I was thinking it was T-Mobile's fault but in down town San Mateo about 8/10ths of a mile from me there is a HUGE LTE tower and I've had a mega connection when down there and the S7E doesn't perform near the others. *shrug* It is what it is. We'll see how the S8 does in a few months.", "time": "4th November 2016, 02:15 AM", "postID": "post69450974", "replies": []}, {"text": "I find there's very little difference really between every other phone I've owned, with the exception that now the S7 can pick up the supposed 'Super 4G' that my S4 couldn't. That said, it doesn't even remotely improve my life.\n\nSignal is fine it seems.", "time": "4th November 2016, 12:10 PM", "postID": "post69456041", "replies": []}, {"text": "Well....i have to say that LTE signal sucks. big time. I'm in Vodafone Iceland, and in my work, where on Nexus 6 and LG G4 i had full signal, could watch Netflix without any lags....let say my S7 Edge have speed like dial up modem....i wait to open simple text website like forever, and mostly have message that site don't respond too long, so i have to reload. All my phones was rooted, with custom roms, Xposed and so on, so on..but only Samsung is so, so bad with signal, that i'm actually completely cured from wanting another . If only my Nexus 6 had better camera and brighter screen, that would be just perfect.", "time": "13th November 2016, 08:41 PM", "postID": "post69604952", "replies": []}, {"text": "I have the Exynos version on T-Mobile and I get awesome reception everywhere, better than the LG G4 I had prior.", "time": "17th November 2016, 06:31 PM", "postID": "post69669933", "replies": []}, {"text": "I have the Snapdragon version, USA, Verizon. Signal strength is very important to me, and it is excellent! I tested it today in an area we have to use a cell phone booster in our RV to create a hotspot. Some phones, like my Nexus 6P, don't work well at all in those fringe areas, even with a booster. But the S7E worked great. In areas with better signals that don't need boosting, it works at least as well as any phone we've had. Very happy with it, and it's a big part of the reason I went back to Samsung from Nexus.", "time": "20th November 2016, 01:54 AM", "postID": "post69704650", "replies": []}]}, {"title": "Speakerphone (loudness, clarity)", "rating": 3.5, "links": ["https://forum.xda-developers.com/s7-edge/review/speakerphone-loudness-clarity-t3330807", "https://forum.xda-developers.com/s7-edge/review/speakerphone-loudness-clarity-t3330807/page2", "https://forum.xda-developers.com/s7-edge/review/speakerphone-loudness-clarity-t3330807/page3", "https://forum.xda-developers.com/s7-edge/review/speakerphone-loudness-clarity-t3330807/page5"], "threads": [{"text": "Comparing it to my edge+, less loud, less clear.\nWaiting for root to change the mixer_gains file\nIt's a solid 7.5", "time": "7th March 2016, 08:39 PM", "postID": "post65708453", "replies": []}, {"text": "The speaker is crap", "time": "7th March 2016, 11:02 PM", "postID": "post65710625", "replies": [{"text": "​Perhaps because of the water proof properties of the phone?", "time": "8th March 2016, 05:34 AM", "postID": "post65714272", "replies": [{"text": "Not necessarily..\n\nThe Xperia Z line of phones were water resistant, and they had speakers that were fine. Granted, they were low in volume (max volume wasn't very high really..), but they sounded very nice.", "time": "9th March 2016, 03:43 AM", "postID": "post65731775", "replies": []}]}, {"text": "I agree, not good. Not so loud", "time": "29th April 2016, 01:02 PM", "postID": "post66602988", "replies": []}]}, {"text": "I'd say that the volume is fine but it's not the best quality. I'm quite fussy with speakers as I listen to many podcasts via the speaker. I'm reasonably happy. Better than Z5, worse than 6P.", "time": "9th March 2016, 07:16 AM", "postID": "post65733707", "replies": []}, {"text": "hows it compared to s6 edge??", "time": "15th March 2016, 09:06 AM", "postID": "post65847762", "replies": [{"text": "s6 edge perform much better both with quality and volume section", "time": "19th March 2016, 11:27 AM", "postID": "post65924772", "replies": []}, {"text": "Am using the s7 edge exynos and comparing to my s6 edge plus...They both are loud\r\nIn terms of clarity however, the s6 edge beats the s7 edge. I think this is due to the water resistant material used in the s7 edge", "time": "20th March 2016, 05:18 PM", "postID": "post65946593", "replies": []}]}, {"text": "Judging coming from an S6 edge to S7 edge. \n\nHeadphones, the S6 edge was louder and clearer.  \nSpeaker, S6 edge is much better.  Luckily I barely use the speaker.  \nBluetooth, loudness and quality is the same.\n\nI haven't tried Adapt Sound yet on the S7 edge, as I did with the S6 edge.  Maybe that would make a difference once I do.", "time": "20th March 2016, 11:19 PM", "postID": "post65951998", "replies": []}, {"text": "When play music or video in high volume , Speaker was distortion.", "time": "22nd March 2016, 04:26 PM", "postID": "post65979864", "replies": []}, {"text": "Quite weak: low sound level and avergage souynd quality.", "time": "26th March 2016, 06:48 PM", "postID": "post66050324", "replies": []}, {"text": "Few day back I am getting a small buz noise can any one had idea about that", "time": "1st April 2016, 07:30 AM", "postID": "post66139358", "replies": []}, {"text": "Night and day coming from an m9. Samsung needs to step up their game.", "time": "2nd April 2016, 08:36 AM", "postID": "post66155492", "replies": []}, {"text": "The quality of the speaker is not the best , but it's OK. I got used to it, and I like how level of loudness - S7 Edge is louder than my previous phone - Sony Xperia Z2.", "time": "2nd April 2016, 11:45 AM", "postID": "post66156615", "replies": []}, {"text": "Loud Speaker is a bit disappointing. Even the volume is 100%, the sound is bit low. Hopefully an updated ROM will help to resolve the issue. Nevertheless, this is a great, superb phone.", "time": "10th April 2016, 10:24 AM", "postID": "post66285775", "replies": []}, {"text": "Mine's loud, and the quality is fine (for a phone). I haven't noticed any distortions or anything, so I'm starting to wonder what the hell you people are doing with your phones. I can hear it when it's ringing and I have no issues with clarity or volume when I watch videos. \n\nI have the Exynos version (gold), built on March 15th (in Vietnam).", "time": "11th April 2016, 01:36 AM", "postID": "post66297869", "replies": []}, {"text": "+ 1  Mine is also very loud. I have had many phones HTC 7, 8 LG 2,3,4 Galaxy S3,S5,S6 Note 3 and 5. This may not be as clean as the HTC's but it is louder. I'd say its a toss up in loudness vs the LG's. LG G4 may have been a tad louder. What separates this phone from the rest (other than note 5) is the volume booster option when using speakerphone (very handy for the work I do). Very happy with volume and quality of sound. Probably hands down best phone I have ever owned and can't believe I am saying that without root. If the screen were flat it would be the perfect phone for me, but its close enough.\n\nI have the gold verizon version SD820 built in Korea", "time": "19th April 2016, 11:51 AM", "postID": "post66440193", "replies": []}, {"text": "[Exynos] I think the headphone quality is quite good (barely, if even, noticeable change from s6 edge), speaker is not as good Im afraid, probably has to do with the waterproof mesh inside.", "time": "19th April 2016, 04:23 PM", "postID": "post66444322", "replies": []}, {"text": "It's a phone speaker, and it's good for what it is. People are claiming it's bad, but I don't know what they're using it for, audiophile engineering maybe? \nIf you want proper sound get a pair of decent headphones. Make no mistake tho, the speaker on this is more then decent in terms of loudness and \"clarity\".", "time": "20th April 2016, 01:26 AM", "postID": "post66452228", "replies": []}, {"text": "Speaker is pretty bad compared to my previous phones, probably due to the waterproofing", "time": "20th April 2016, 08:25 PM", "postID": "post66466066", "replies": []}, {"text": "Not as good as my HTC M8, but it does get loud. a strong 3 to a light 4 for a phone speaker.", "time": "22nd April 2016, 04:53 PM", "postID": "post66495824", "replies": [{"text": "How good was the M8 on that scale? I'm about to make the same switch and I'm worried about the speaker downgrade\n\nPS: Have you tried the Sound Mod: http://forum.xda-developers.com/s7-e...od-v4-t3340601", "time": "29th April 2016, 08:59 PM", "postID": "post66609800", "replies": [{"text": "I did. The speaker gets louder and the clarity is good. Through headphones the sound is louder then before.", "time": "29th April 2016, 09:26 PM", "postID": "post66610156", "replies": []}]}]}, {"text": "I'm perfectly fine with the speaker on this, it's just a phone speaker after all, you don't record in a studio with it. If you want good sound get a decent pair of headphones.", "time": "29th April 2016, 10:54 PM", "postID": "post66611084", "replies": []}, {"text": "Coming form a Sony phone, I have to say\n\r\nSUCKS SO, SO HARD\n\r\nAnd even sony doesn't have the best speakers, but well, talking about GS7e I have to say 1. position is bad, almost always I take the phone on landscape put a finger or my hand on the speaker, and is so easy to block completly the sound xD (and is worst because apart from that u have to be careful to not \"miss-touch\" the edge borders xD), then 2. the sound quality is bad, u no need to put max volume to get distortion and 3. volume is so low,  I could say \"sony also have waterproff phones and doesn't sound so low\", but  remember samsung used a different technology for waterproof, so maybe is the reason....\n\r\nAll that being critic, but in dialy usage... I can hear all notifications and phone calls, also sound decent in games... so maybe for a high-end phone could be better but well, u can't always get all u want (?)", "time": "30th April 2016, 12:23 AM", "postID": "post66611852", "replies": []}, {"text": "I came from a rooted S5 using the viper4android driver and I don't think the sound is bad at all. It's more than adequate for a phone IMHO. Love the earbuds as well.", "time": "30th April 2016, 08:48 PM", "postID": "post66623992", "replies": []}, {"text": "The spekers is not the best", "time": "2nd May 2016, 06:10 PM", "postID": "post66661785", "replies": []}, {"text": "i'm not experiencing in issue with the speaker like many have mentioned. The quality is pretty neat.", "time": "7th May 2016, 09:03 AM", "postID": "post66735893", "replies": []}, {"text": "I'm seriously thinking about selling the phone again, I simply cannot endure that a 700 euro phone has lower quality speakers as previous generations. I'm coming from the LG G4 and can say that the S7 is losing here. Btw I like also the camera better on the G4...", "time": "8th May 2016, 02:11 AM", "postID": "post66746840", "replies": []}, {"text": "coming from the lg g4 i must say quality of speaker for an expensive phone $700 converted was disappointing..mostly used my phone watching at home with only one lcd tv used by other member of the family i always watch series on phone and lg g4 is more above quality being single speaker than s7 edge rather tin like sound", "time": "28th January 2017, 12:45 PM", "postID": "post70769097", "replies": []}, {"text": "Speaker sound is dough due to water proof , I buy an opened s7 edge it's speaker were almost higher and clearer but it wasn't water proof once dipped in water it damaged like a Nokia 3310", "time": "10th June 2017, 11:15 AM", "postID": "post72618178", "replies": []}]}]