[{"title": "Overall love", "rating": 5.0, "links": ["https://forum.xda-developers.com/oneplus-3/review/overall-love-t3400044", "https://forum.xda-developers.com/oneplus-3/review/overall-love-t3400044/page2", "https://forum.xda-developers.com/oneplus-3/review/overall-love-t3400044/page3", "https://forum.xda-developers.com/oneplus-3/review/overall-love-t3400044/page13"], "threads": [{"text": "Looks and feels just right. Has all the essential ingredients of a very good device - nice display, Camera and fast!", "time": "18th June 2016, 06:56 AM", "postID": "post67371152", "replies": []}, {"text": "I named mine cold Betty. She's cold to the touch, but her love is so warm.", "time": "18th June 2016, 07:26 AM", "postID": "post67371421", "replies": []}, {"text": "I like so much OnePlus 3 and it really gives me awesome feel, and I fall in true love with it. When I am take it in my hand I am just fits in perfectly in my palms.\r\nI have so many gorgeous protective cases.\r\nOnePlus 3 like to me on first sight for so much but beautiful stuff.\r\nIt is a pity that the rear camera of OnePlus is protruding, though it uses 16MP lens IMX298 from Sony.\r\nOnePlus 3 smartphone supports dual sim card dual standby.\r\nOnePlus also gifts me one more VR Headset. Before announcing OnePlus 3 smartphone And this VR Headset is not made by OnePlus either, instead by AntVR.\r\nAnd have very good  battery and features fast charging technology.", "time": "18th June 2016, 07:00 PM", "postID": "post67379304", "replies": []}, {"text": "Its a good phone for a reasonable price but not a flagship killer for an amazing price.", "time": "19th June 2016, 07:06 AM", "postID": "post67385353", "replies": []}, {"text": "Isn`t a good phone all we need realy, most extra features on the `flagships` are useless to me anyway", "time": "19th June 2016, 07:13 AM", "postID": "post67385405", "replies": []}, {"text": "Beautiful phone with a crystal clear display and a powerhouse of its own class", "time": "19th June 2016, 08:45 AM", "postID": "post67386120", "replies": []}, {"text": "Gotta grab one soon! what about the software updates? it'll be same as like the OP2??", "time": "21st June 2016, 12:18 PM", "postID": "post67418499", "replies": []}, {"text": "Love the phone so far. Extremely fast, very responsive fingerprint scanner and beautiful, vibrant screen.", "time": "22nd June 2016, 12:44 AM", "postID": "post67428048", "replies": []}, {"text": "Great phone so far. \n\nThe LG G4 on the other hand was frustrating as a device if not for the awful software experience that I couldn't even fix even if I wanted to. Never again doing anything but OnePlus or Nexus. G4 was a huge mistake.", "time": "22nd June 2016, 02:37 AM", "postID": "post67428767", "replies": []}, {"text": "Current 6p and HTC 10 user here and I can't even begin to say how impressed I am with this OP3. Grant it I've only had it half a day, so far I'm completely blown away!! Almost 3 hours sot right now and battery at 50% 😃I love everything about it. Only mediocre thing is the external speakers. Amazing camera, beautiful screen, perfect size, feels greet in the hand, shoot it even looks great! Oh and the finger print reader is way faster than both the 10 and 6p. But the thing that impressed me the most is the skin. I'm still bone stock and I never leave phones stock.. it just has all the things Google SHOULD have in stock MM.. no bloatware either.. just an impressive handset and all for 400$ bucks! Here's some photos and screen shots! https://goo.gl/photos/RgwFUT3Rwhyt6XJL6", "time": "22nd June 2016, 03:34 AM", "postID": "post67429215", "replies": []}, {"text": "Nexus 6P, 5x, Note4, LG G4, S6 Edge, OP2 owner here.  \n\r\nOnePlus 3 is very much what Nexus 6P should be.  It's lighter and faster than 6P and easier to grip and easier to use.  \n\r\nThe 6P has the better display and better all around camera but the OP3 has everything most power user would ask for.\n\r\nTap to wake, Dark mode, and customizeable buttons are great to have.  Hated how stock Android doesn't have these simple features.", "time": "22nd June 2016, 07:08 PM", "postID": "post67439455", "replies": [{"text": "Owned almost everything  thanks for comparing with the 6P. Hope OP3 will satisfy me when I receive and start using it.", "time": "23rd June 2016, 10:31 AM", "postID": "post67447927", "replies": []}]}, {"text": "Come from oneplus one, buy it to replace my 6p\r\nusing it since last night, overall it's worth buy. Excellenct build quality. loud speaker ( not good as dual-front facing stereo speakers like m8 and 6p, but it's loud and clear. ) good camera ( 6p>op3>note 5 ) ,crazy fast charge, feel rock solid in hand. battery seems ok with 5h SOT on lastest oxygen 3.1.3 \r\nI think it's a bang for just 400$", "time": "23rd June 2016, 02:57 PM", "postID": "post67450806", "replies": []}, {"text": "I totally loved my OPO, but now this piece of awesomeness OP3 is my new favorite", "time": "24th June 2016, 01:22 AM", "postID": "post67457956", "replies": []}, {"text": "Love it", "time": "24th June 2016, 10:37 AM", "postID": "post67462026", "replies": []}, {"text": "Loving my device. Sold my S7 Edge in platinum today.  My one plus came in today. That should say a lot. This thing is a beast.", "time": "24th June 2016, 10:58 AM", "postID": "post67462260", "replies": []}, {"text": "As a previous owner of the oneplus 1 and then the oneplus 2,  I can say that oneplus has out done themselves.  I got my 3 in yesterday.  Couple of quick points:\n\r\n1. I waited for 6 weeks after initial launch date to just get an invite for the oneplus one (June 2014).  It took the company 4 more weeks to get it to me after ordering and paying for it. Customer service sucked,  invite system sucked, logistics and management sucked... Just about everything with the company SUCKED. \r\nBut the phone was awesome.\r\nThe specs and price couldn't be matched. That was the first phone I can honestly say I have ever fallen in love with. No screen issues or any of the other crap a lot of people were complaining about. Just pure love for the device,  borderline hatred for the company though.  \n\r\n2. The oneplus 2 comes out last summer,  again, with an invite system but I get lucky and receive one for being an early forum user within 2 weeks of official launch. It took them 6 weeks to get the phone to me. Was excited when I first got it,  and then my optimism quickly turned to disappointment. The oneplus 2 was not nearly worth the upgrade. I should have kept my oneplus one in hindsight. Total buyer's remorse and top of that,  the company still didn't have their shlt together. Again, customer service still sucking hard, untimely bug fixes for the OS, lags and heating problems with the phone, I could go on and on... Horrible experience all the way around. Hated that damn phone. \n\r\n3. One more shot oneplus. Buying my 3rd phone from them in less years.  3 total phone purchases in less than 2 years. And only had the oneplus 2 since late September 2015, though it was ordered and processed the 2nd week of August. \r\nWith much apprehension, I placed my order for the 3,  Monday afternoon,  June 20, to be shipped to Atlanta, GA. I was distraught when my DHL shipping email was received telling me that the phone was in Hong Kong going through customs Tuesday morning. *sigh*, here we go again, I thought, but figured 'at least I didn't have to wait on an invite'. The phone was delivered yesterday afternoon. Less than 72 hours after placing my order,  I got my phone in hand. Paid no shipping, no tax.  \n\r\nTotally different buying experience. Blown away. I feel like a parent must feel when they realize their baby is grown up. Almost brings a tear to my eye. \r\nMoved all my crap over from the 2 and have been using the hell out of this thing and I can once again,  honestly,  say that I have fallen in love with my phone. It's my second love,  the first being the oneplus one and now the 3. I have no qualms what so ever with this purchase. Awesome device.  Just awesome, everything is as it should be. I have no plans to replace Oxygen or run a custom kernel.  Though I have rooted it for using certain apps I can't live without. Adaway anyone?  \n\r\nI don't usually give any credence to these phone benchmark scores or ranks...  but out of curiosity, I ran an antutu test and have attached the results. keep in mind, I'm totally stock. Rom, kernel, kernel settings like governor and thermal driver settings are all factory.  I just don't see a need anymore, and that's a good thing. \n\r\nAlso,  screens showing battery consumption so far. I use high accuracy location to share my whereabouts in real time with my family, that includes WiFi scanning enabled. Bluetooth is always on and connected to my Moto 360 2nd Gen watch, adaptive brightness enabled, vibration on touch and notification on, single Sim (t-mobile).  \n\r\nAnyways, that's my initial rant on things. Been around awhile, at least in oneplus years and right now I am happy as can be. This phone is a monster. Beautiful,  sleek and cool on the outside,  but down right vicious on the inside. \n\r\nDon't be worried if your on the fence about getting one, it may not be 100% to 100% of everyone, but what is? You won't be disappointed. \n\r\nPeace out my brothers from other mothers.", "time": "24th June 2016, 02:17 PM", "postID": "post67464398", "replies": []}, {"text": "Onelove", "time": "25th June 2016, 03:00 PM", "postID": "post67478232", "replies": []}, {"text": "He lived up to our expectations as a great device, leaving his successor with big shoes to fill.So far the was exactly that. Its beautiful screen coupled with its new oxygen operating system and the old familiar", "time": "27th June 2016, 03:52 PM", "postID": "post67504411", "replies": []}, {"text": "wow, some even prefering it over the 6p!\n\nwell, i watched some reviews of the op3, it is so blazing fast.\n\nhow is the ram management for you op3 owners? and how is the display pentile pixel thingie?\nsome reported problems about ram management/pentile pixel issue, and OP replied quick that they will come with a new software update and fix those 2 issues.\n\nwould you op3 who owned a 6p really advise the op3 over a 6p?\n\n(i am saving up for a 6p currently..) i could easily buy a MotoXPure as it is very cheap at 300$ , but it reminds me alot of my current phone lol.. so i rather want something more innovated.", "time": "29th June 2016, 12:43 AM", "postID": "post67525260", "replies": []}, {"text": "While I like the device a lot I kinda miss the form factor and size of my nexus 5x. The s820 still has some stutter here and there that bothers me. Wish qualcomm could make a chip like the exynos cpus. Other than that ill hold onto it for awhile. At least until the next nexus comes.", "time": "29th June 2016, 12:56 AM", "postID": "post67525344", "replies": [{"text": "That won't be problem of qualcomm but oxygen os . Nexus will also have same processor but difference will be huge in case of software.  Though oxygen os seems better for customization but this is not mature.", "time": "29th June 2016, 06:27 AM", "postID": "post67527682", "replies": []}]}, {"text": "Love my OP3 I have been a fan and following the company since the OPO launch and decided after 4 years with my note2 still not breaking that it was time to jump ship from Samsung and go after the newest flagship killer \n\r\nAll in all the phone is perfect for me personally", "time": "29th June 2016, 05:00 PM", "postID": "post67534538", "replies": []}, {"text": "I have yet to find a phone I just love....until the OnePlus 3. I have gone through iPhone 6s and plus (great phones but tired of apple), galaxy s7 and s7 edge (loved the display...that's about it), HTC 10 (liked the expandable storage but not the price tag), OnePlus 2 (really liked it but really needed NFC as I used that regularly). \n\nThe OnePlus 3 hits everything that I love. Sure the screen is not as nice as the s7 but I can live with out that...it's also $300 less! Everything else in my opinion works better, no lag or stutter, super fast, premium build and just beautiful to look at, fast charge thru dash charge (wish it would have been quick charge 2 or 3 as I already have spare chargers), 6 GB of RAM which is more future resistant...not future proof because something better is always around the corner, 64 GB internal is plenty for me, pretty good camera (better lowlight would be preferred but I'm satisfied at this price) and a super fast fingerprint sensor! A 5.5inch 1080p 401ppi screen is perfect in my opinion for both battery consumption and average user. It looks good to me. Oxygen OS which is near stock Android but has some useful additions!\n\nOverall i think I found the sweet spot (at least for now). I may pick up a Nexus if HTC makes it this year and the soecs are good at the price point.", "time": "2nd July 2016, 01:12 PM", "postID": "post67572582", "replies": []}, {"text": "I absolutely love the OP3. I came from the Nexus 6p and my god, it's definitely worth the upgrade. Granted the 6p has a higher resolution display but if you were to put these devices side by side, you won't notice the difference. OP3 has gorgeous build quality. Awesome camera. Blazing fast. All this for £309....bargain!", "time": "3rd July 2016, 07:59 PM", "postID": "post67589837", "replies": []}, {"text": "Waiting (and loving) my first Oneplus, the Oneplus3. I came from a Note 4 \n\nEnviado desde mi SM-N910F mediante Tapatalk", "time": "3rd July 2016, 08:15 PM", "postID": "post67590017", "replies": []}, {"text": "I've not loved a phone since my HTC Desire HD.  Until this one!", "time": "4th July 2016, 08:15 PM", "postID": "post67604404", "replies": []}, {"text": "I have just made a small review on this\n\r\nPlease search on Youtube\n\r\nOne Plus 3 Tips & Tricks in Bangla\n\n\r\nHope you would love it. Cheers", "time": "23rd February 2017, 03:53 AM", "postID": "post71150852", "replies": []}, {"text": "I don't know post, nougat update im not really into it anymore. I mean no VoLte during calls after this many updates to 7.0 then 7.1.1 just sucks. \nOh well better trade it while the iron is  hot.", "time": "13th March 2017, 04:58 PM", "postID": "post71411910", "replies": []}, {"text": "I feel in some ways, it's not even the specs about this phone. What makes this phone great is the experience for those of us who love modding. Extremely fast phone, plenty of RAM, and good battery life. What makes it even better is the developer community. It's huge, and we have some of the best devs on the forum for our device. Highly recommended phone.", "time": "23rd March 2017, 09:23 PM", "postID": "post71560226", "replies": []}, {"text": "Nice shape design , great camera , and the fastest fingerprint module.", "time": "27th March 2017, 06:09 PM", "postID": "post71611392", "replies": []}, {"text": "Best phone i ever used.", "time": "28th March 2017, 03:56 AM", "postID": "post71616714", "replies": []}, {"text": "Absolutely no complaints about this phone. It is a solid performer and the camera produces beautiful outdoor shots.", "time": "10th July 2017, 12:01 PM", "postID": "post72973520", "replies": []}, {"text": "Smooth even after 18 months of vigorous operations", "time": "3rd February 2018, 07:24 PM", "postID": "post75435896", "replies": []}, {"text": "What a reply..!! that's true", "time": "11th February 2018, 09:58 AM", "postID": "post75524009", "replies": []}, {"text": "I just can't replace this phone. \n\r\nWith Gcam the camera is better than a lot of stock flagships like the HTC 10, Sony phones, OP5/5T\r\nIt has a very good AMOLED panel for true blacks and always on display.\r\nIt has capacitive buttons so you don't lose any screen estate like you do with the Pixels or Sony phones. And hence 18:9 \"bezel-less\" is unnecessary.\r\nIt has one of the best custom ROM communities.\r\nIt has a headphone jack, notification slider and a front facing fingerprint scanner.\r\nIt has 6 GB RAM for peace of mind and has been fluid since day one. It's noticeably smoother and has much less app reloading than the XZ Premium I tried using for a month.", "time": "22nd February 2018, 12:50 AM", "postID": "post75651761", "replies": []}]}, {"title": "Community development strength", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-3/review/community-development-strength-t3400045", "https://forum.xda-developers.com/oneplus-3/review/community-development-strength-t3400045/page2", "https://forum.xda-developers.com/oneplus-3/review/community-development-strength-t3400045/page3"], "threads": [{"text": "I heard OnePlus released the source for the 3. If its true, the 3 would survive for as long as OnePlus 1", "time": "24th June 2016, 03:28 AM", "postID": "post67458764", "replies": []}, {"text": "Oneplus released the sources while presenting the OP3. The warranty covers software changes made by the user. This device is all about editing every possible part. Community development strength = 200%", "time": "24th June 2016, 08:31 AM", "postID": "post67460982", "replies": []}, {"text": "id say the development here soo far is better than the nexus devices.", "time": "24th June 2016, 10:26 AM", "postID": "post67461942", "replies": []}, {"text": "The community here is amazing!!", "time": "24th June 2016, 02:30 PM", "postID": "post67464559", "replies": []}, {"text": "It's a bit early to say, but it looks good.", "time": "25th July 2016, 08:34 PM", "postID": "post67901271", "replies": []}, {"text": "Official CM in just days. Lot's of roms already with good support.", "time": "30th July 2016, 01:47 PM", "postID": "post67968279", "replies": []}, {"text": "Definitely very alive. I was in the G4 community before; development was a ghost town.\n\nPlus with Dash Charging kernel sources just having been released, there's literally not a single feature we'll be missing out on by during custom ROMs, unlike most phones.", "time": "30th July 2016, 09:09 PM", "postID": "post67973158", "replies": []}, {"text": "I've heard the non OOS based ROMs have issues with the camera, is this true?\n\nDash charge is finally out so this is one of the main things holding me back at this point", "time": "31st July 2016, 12:20 AM", "postID": "post67974747", "replies": [{"text": "Yes so CM-based ROMs lack the OOS post-processing for photos in camera.", "time": "31st July 2016, 12:27 AM", "postID": "post67974796", "replies": [{"text": "That's unfortunate. Is there a way to export the OOS camera into a cm based ROM?", "time": "31st July 2016, 02:36 AM", "postID": "post67975654", "replies": []}]}]}, {"text": "Dev support for one plus is excellent", "time": "31st July 2016, 03:24 AM", "postID": "post67975993", "replies": []}, {"text": "This is what's pushing me toward buying a OP3 over the ZTE Axon 7.  The ZTE may have better specs in some areas (ex. full USB 3.0 speeds, more frequency bands, expandable memory, sharper screen), but I've been reading that developer support for ZTE isn't good, at least for their other phones.  And it's not like I'm going to really come close to filling up 64GB of space to begin with........just have to nudge the wife into signing off on the expense", "time": "1st August 2016, 03:08 PM", "postID": "post67995895", "replies": [{"text": "OP is without a doubt a better choice if ROM development is important to you. That's why I'm here; I had both the Nexus 4 and 5 - I wanted to stay with the Nexus line, but the 6P had already been out for a while and I didn't want to wait for the next Nexus device. There have admittedly been a few kinks (I'm still battling random reboots), but overall, I think it was a good choice.", "time": "2nd August 2016, 12:14 AM", "postID": "post68002814", "replies": [{"text": "You're mirroring my situation almost exactly: I've had the Nexus 5 for about 2 1/2 years now or so, looking to upgrade, but the N6P is closing in on a year old, the new Nexus models are likely to be much more expensive than the N5 was, and I want something I can tinker with but won't be obsolete in 6 months or ignored by the dev community. Thanks for being an inadvertent guinea pig", "time": "2nd August 2016, 01:19 AM", "postID": "post68003321", "replies": [{"text": "Hahaha no problem.", "time": "2nd August 2016, 08:50 PM", "postID": "post68015955", "replies": []}]}]}]}, {"text": "One thing I'd be happy if it did come would be Multi Rom that be awesome to have on the one plus 3 So we can have more than one rom to boot back an forth instead of reflashing", "time": "1st August 2016, 03:38 PM", "postID": "post67996325", "replies": [{"text": "You are on XDA, so go and Flash it by yourself \nMultirom Thread", "time": "1st August 2016, 07:11 PM", "postID": "post67999329", "replies": [{"text": "Thank u now I'm definitely interested and am buying this phone have a v10 from T-Mobile but development is hard for it the devs are doing all they can with AOSP for the v10 but ima upgrade to the OnePlus 3 since it has taken my complet attention", "time": "2nd August 2016, 04:16 AM", "postID": "post68004573", "replies": []}]}]}, {"text": "The communiti on OnePlus One was great, and so many great ROM-s out there, some had better camera, some better batery, some had this some had that, but on op3, I really have no need to 'touch' anything, great camera, battery life is ok for me, multitasking great, and maybe I'm getting too old for experimenting", "time": "2nd August 2016, 09:19 PM", "postID": "post68016340", "replies": []}, {"text": "I just flashed the google nexus launcher on my +3, and it works great! If you want to download it, just look up Qbking on youtube. He has a video about it, and the download link.", "time": "3rd August 2016, 01:32 AM", "postID": "post68018749", "replies": []}, {"text": "The community here at XDA was one of the major reasons for me buying the OP3. Now that OnePlus has released the sources for Dash as well, custom ROMs are going to feel complete. Flash away!", "time": "3rd August 2016, 08:22 AM", "postID": "post68022038", "replies": []}, {"text": "Just want the oos camera to be ported to cm .Then it will be heaven .Until then have to stick with oos", "time": "3rd August 2016, 01:57 PM", "postID": "post68025678", "replies": []}, {"text": "It's okay but a lot of copyroms, all CM based. I love Substratum more then cmte, well then the op3 is a bad device to buy  but let's be patient first.", "time": "16th August 2016, 10:06 PM", "postID": "post68220264", "replies": []}, {"text": "I think that it is way too early to judge on development.  This device will be very well supported by devs.  Especially once 1+ gets past its initial surge of shipments.  Right now they are on backorder afik.", "time": "18th August 2016, 12:18 AM", "postID": "post68238038", "replies": []}, {"text": "I have a Nexus 4 and is looking for a replacement. Community support is one of the factors I'm considering and I find the community of OP very interesting. With the efforts of OP in building and strengthening their OS with the help of the community, I am very solid on having the OP3 as my next smartphone. Good day!", "time": "25th August 2016, 03:43 AM", "postID": "post68352898", "replies": []}, {"text": "This is the first device I've had since the OG evo on sprint back in like 2010 that I didn't want to flash like crazy right out of the box. That being said, freedomOS is a grand because it's stock oos and has all the extra little things I enjoy having like debloat and viper and AdAway. All I needed to do was put my custom fonts (Prelude from the WebOS days) with Unicode 9 emojis and custom UI sounds and I was good to go", "time": "25th August 2016, 05:40 AM", "postID": "post68353873", "replies": [{"text": "I remember the good old days of the OG EVO 4G!  Man, they shoe-horned a Jelly Bean build onto that thing, it was ridiculously supported by the developer community.  There're only a couple small things missing from the stock OS that I really like (center clock, text-only battery indicator, DPI size), but that's what Freedom OS/Xposed - GravityBox are for.  Toss in root for AdAway and TiBu, and it's golden.  The developer strength was what convinced me to go for the OP3 instead of the Axon 7, and I'm so glad I did; the development for the Axon 7 is pitiful thanks to ZTE.", "time": "30th August 2016, 06:44 PM", "postID": "post68448233", "replies": []}]}, {"text": "regular monthly/bi-monthly updates even after launch of 3 flagships. Truly  commendable.", "time": "3rd February 2018, 07:31 PM", "postID": "post75435961", "replies": []}]}, {"title": "Overall speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/oneplus-3/review/overall-speed-t3400046", "https://forum.xda-developers.com/oneplus-3/review/overall-speed-t3400046/page2", "https://forum.xda-developers.com/oneplus-3/review/overall-speed-t3400046/page3", "https://forum.xda-developers.com/oneplus-3/review/overall-speed-t3400046/page7"], "threads": [{"text": "Everything opening fast and snappy, even from the cache. No issues with ram management in my case. Could be 3.1.2 fixed this issues for the most part.", "time": "18th June 2016, 11:49 AM", "postID": "post67373958", "replies": []}, {"text": "Ummmmm...yeah. This phone is insanely fast!! My note 4 received 66~k reading. Lol.", "time": "18th June 2016, 04:58 PM", "postID": "post67377725", "replies": []}, {"text": "Compared to the LG G4 I used before this is amazingly fast. Don't know if it's cos of the processor or the ram.", "time": "19th June 2016, 07:56 AM", "postID": "post67385715", "replies": []}, {"text": "Blazingly Fast phone at an affordable price", "time": "19th June 2016, 08:42 AM", "postID": "post67386089", "replies": []}, {"text": "Yes, it's fast. Very pleased with its day to day use. I scored 144k on antutu.", "time": "19th June 2016, 11:56 AM", "postID": "post67387928", "replies": [{"text": "Is it faster than the Nexus 6P? I just had to get rid of my 6P and the OP3 seems like a good upgrade", "time": "20th June 2016, 08:03 PM", "postID": "post67409268", "replies": [{"text": "Yah, it is a little bit better performer.  Overall I'm still uncertain if it's really much of an upgrade though. I haven't used it on a cell service yet nor have modded it yet.  Each device is solid and I don't think you can go wrong with either.", "time": "20th June 2016, 09:48 PM", "postID": "post67410591", "replies": []}]}]}, {"text": "Coming from 1+1, 1+x, moto x pure to 3.  Definitely feels primo. Love the upgrade.", "time": "20th June 2016, 11:31 PM", "postID": "post67411744", "replies": []}, {"text": "Just got the phone today and have been playing with it the past couple hours. In some ways not a big upgrade from my Moto X Pure, but as far as speed it's an absolute joy to use. Everything is extremely snappy and smooth.", "time": "22nd June 2016, 12:41 AM", "postID": "post67428024", "replies": []}, {"text": "Coming from a 4 years old SGS 3  and it is incredibly fast. But i guess that feeling is normal coming from that old phone.", "time": "22nd June 2016, 08:45 AM", "postID": "post67431862", "replies": []}, {"text": "This phone is a straight up BEAST!", "time": "29th June 2016, 05:03 PM", "postID": "post67534576", "replies": []}, {"text": "Have been using the device since the 17th. I have only rebooted it a couple times while I was doing rooting/moding/bootloader unlock because it was required to do so.  I have yet to notice a single dropped frame during any sort of task. I have had 0 crashes. My only issue has ram management, but that was quickly fixed with the ram fix for root users; now I can literally have all my installed apps opened and cached in memory. This phone flies.", "time": "29th June 2016, 07:49 PM", "postID": "post67536816", "replies": []}, {"text": "Indeed fast. Love the swiftness.", "time": "30th June 2016, 09:10 PM", "postID": "post67551429", "replies": []}, {"text": "Oneplus 3 is extremely fast and smooth like nexus on steroid. Even though the display is 1080p but it was a super AMOLED screen from Samsung and it look excellent for white color calibration. I even think the white color on one plus 3 look more like it was calibrate on galaxy s6 than nexus 6p. Nexus 6p white color calibration i did not like due to it contain yellow tin look on the display and not white white like Samsung galaxy or iPhone.", "time": "1st July 2016, 06:30 PM", "postID": "post67563472", "replies": []}, {"text": "Way faster than my 2015 Moto X Pure.  Obviously not the RAM difference as the OP3 isn't using all of it's RAM, aside from reviewer releases, this is perhaps a bit lacking for some.  The 820 is a BEAST!  I always wondered why in the recent past they(QC)  decided to use the whole ARM Big/Little setup...  This quad core is, at least seems to be, much faster than previous generation octacores.  Not only in benchmarks but also everyday use. Granted I'm coming from a hexacore, an 808 I believe. \n\nJust goes to show that often times these spec wars are kinda of joke.  Why would an android handset need more than 4 cores? Seriously. Give me 2 - 4 that are fast and energy efficient.  As much as many here hate Apple I have to throw them some props for their A9.  Dual core with only 2Gb of RAM?  Driving that display too?  All the while scoring really well on performance and battery benchmarks! That is some really great software optimization and hardware engineering. \n\nI may be kind of the odd guy out here but I really enjoy the latest iOS experience, its such a well integrated platform. I haven't owned an iPhone since the 4 or 4s(I think) but they have come a long way since then.  Of course I always Jailbroke them whenever possible.  The whole Phandroid/iSheep phenomenon is so odd to me.  They're both excellent platforms with their own limitations,  advantages and quirks. That groups of people literally come out and strongly bash and insult each other over their choice of a mobile phone is so crazy to me.  I mean seriously people, you're gonna be Apple or Google's troll/\"PR\" person? How about everyone just uses what they like to use without this \"mine is better than yours\" mentality. Who are these people trying to convince? Themselves? \n\nHaving said that I've always wondered if I should just pony up a bit more cash for the flagship Nexus device.  I've always been curious if it received the close attention to optimization of the software to the particular hardware it was running on.  That's what has always made me, at the least, respect the iPhone. If it's done right there isn't all that much better than a thoroughly integrated software/hardware package! \n\nSorry for yet another rant but I just couldn't help myself....", "time": "2nd July 2016, 01:03 AM", "postID": "post67567292", "replies": []}, {"text": "The snapdragon 820 is far better than the 810. All the 810 do is throttle. This quad core destroy the 810. Just cause it's octa don't mean anything.", "time": "2nd July 2016, 08:16 PM", "postID": "post67577454", "replies": []}, {"text": "I can't speak highly enough of the OnePlus3. It's smooth. It just flies between apps and any other phone could only, at most, equal it really. Go with your heart", "time": "3rd July 2016, 12:56 AM", "postID": "post67579790", "replies": []}, {"text": "I feel it's faster than my s7e in every day use", "time": "3rd July 2016, 05:24 AM", "postID": "post67581296", "replies": []}, {"text": "Very good performance overall. Feel faster than my iPHone.", "time": "7th July 2016, 04:23 AM", "postID": "post67637106", "replies": []}, {"text": "Any experience with lspeed? \n\nGesendet von meinem SGP511 mit Tapatalk", "time": "7th July 2016, 06:39 PM", "postID": "post67645644", "replies": []}, {"text": "Stupidly fast... makes me wonder how fast (if anything) phones will be in 2-3 years time. Compared with my iPhone 6 Plus which I've just switched from, all apps load from cold start at least 5x faster. Snapchat opens approx 7x faster, which is key for me. Haven't yet found a normal app (not a game) which takes longer than a second to open.", "time": "12th July 2016, 04:24 PM", "postID": "post67713730", "replies": []}, {"text": "My OP3 stutters a lot in the Oxygen OS UI. Like A LOT.\nPlus Google keyboard lags and is slow", "time": "15th July 2016, 06:35 AM", "postID": "post67752122", "replies": []}, {"text": "Never lags, never stutters, just flies", "time": "15th July 2016, 12:15 PM", "postID": "post67755430", "replies": []}, {"text": "facing lot of stuttering (not a lag) in opera mini and setting UI but in other apps its buttery smooth.\n\nwhen I increased min frequency,for both cluster, i found the stuttering I'm facing in  above said app goes away", "time": "15th July 2016, 01:37 PM", "postID": "post67756349", "replies": []}, {"text": "No lag or stutter for me.. snappy all the way. Very impressive performance.", "time": "19th July 2016, 06:39 AM", "postID": "post67808155", "replies": []}, {"text": "Yep no lags no stutter no nonsense. On Stock Rom, but rooted. This thing flies like nobody's business.", "time": "19th July 2016, 10:37 AM", "postID": "post67810485", "replies": []}, {"text": "Incredibly fast ! No lags, everything is smooth, just awesome.", "time": "23rd July 2016, 11:13 PM", "postID": "post67875974", "replies": []}, {"text": "Anyone running a LOT of apps, 200 + or so?\n\r\nI run a lot of apps, and my phones always suffer for memory. My paste experience has been that most folks posting the freaking fast speeds have a small number of apps running.", "time": "13th August 2016, 02:25 AM", "postID": "post68163872", "replies": []}, {"text": "Faster than the Pixel and S7 Edge in speed tests, what more can you say.", "time": "20th February 2017, 07:06 AM", "postID": "post71107834", "replies": []}, {"text": "The phone is really fast everything is so responsive", "time": "12th June 2017, 06:05 PM", "postID": "post72645940", "replies": []}, {"text": "Really can't complain about the speed. I'm an occasional gamer (nothing intensive) but mainly I am concerned with day-to-day use and this phone has *never* lagged once on me. I can't imagine how it could be any better?", "time": "10th July 2017, 12:03 PM", "postID": "post72973529", "replies": []}]}, {"title": "App launch speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/oneplus-3/review/app-launch-speed-t3400047"], "threads": [{"text": "fast , but some apps not well ( maybe the problem at the apps , isnot phone )", "time": "27th March 2017, 06:13 PM", "postID": "post71611439", "replies": []}, {"text": "Is the fastest phone I ever seen, and i'm coming from a 6p, not the slowest on the earth...", "time": "28th March 2017, 12:20 PM", "postID": "post71620893", "replies": []}]}, {"title": "Multitasking/RAM", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-3/review/multitasking-ram-t3400048", "https://forum.xda-developers.com/oneplus-3/review/multitasking-ram-t3400048/page2", "https://forum.xda-developers.com/oneplus-3/review/multitasking-ram-t3400048/page3"], "threads": [{"text": "Incredible after applaying the memory fix by settig the app limit to 42", "time": "20th June 2016, 10:23 AM", "postID": "post67401571", "replies": [{"text": "Any idea on how this affects battery life?", "time": "20th June 2016, 10:28 AM", "postID": "post67401634", "replies": [{"text": "So I also switched my background processes to 42, and I ended up dialing it back to 32, because I do think it affects battery life a bit. To be honest, at 42, I was using 5GB of RAM at a time, which was amazing (SO MANY apps in RAM), but honestly, while it's fun, it's not really helpful in day to day use. But the default setting of 20 is too low.", "time": "20th June 2016, 02:29 PM", "postID": "post67404484", "replies": []}, {"text": "Batterylife might be effected, but its perfectly fine for me. Im getting around 4h of SOT with brightness at 100% (adaptive) Wifi and Bluetooth turned on, connectet to my huawei watch and using it quite a lot. And there was literally no app cleared from ram. I will test it again with the value set to 36 though!\n\nIts such a great experience to have a phone which doesn't have to start up an App twice.", "time": "20th June 2016, 09:16 PM", "postID": "post67410205", "replies": []}, {"text": "Go on Youtube and search vor \"OnePlus 3 - How to Root\". The Channel is called C4ETech. The Guy in the video gives you perfect instructions.\nIn the video description you will also find all the downloads you will need!\n\n---------- Post added at 09:14 AM ---------- Previous post was at 09:10 AM ----------\n\n\n\n\r\nYou can not do this without root!!! All you can do wihtout root, is to pull the build.prop via adb (adb pull /system/build.prop <your desired location>), but you cannnot push it back to your phone, because you need access to your phones root directory which is read only out of the box.\n\n---------- Post added at 09:20 AM ---------- Previous post was at 09:14 AM ----------\n\nThe simplest way to apply the memory fix is the following:\n\n-Go on Youtube. Search for \"OnePlus 3 - How to Root\". The Channel is called C4ETech. The Guy in the video gives you perfect instructions. Its really easy, you will find all the downloads in the videos description.\n-then download the build prop editor app from the play store and look for the right value (ro.sys.fw.gb_apps_limit=20) and change it.", "time": "21st June 2016, 08:20 AM", "postID": "post67415814", "replies": [{"text": "Thanks for your reply..but in the xda article on how to fix it , it says:\n\nhttp://www.xda-developers.com/how-to...pps-in-memory/\n\r\n\"There are many ways to edit the build.prop, including pulling it through ADB without root or using root apps specifically designed for build.prop editing. I personally used Root Explorer this time around, but all methods should work.\"\n\r\nThe word ADB is linked to a quora page where the methods are mentioned, but I have not been able to get it to work:\nhttps://www.quora.com/How-do-I-edit-...out-Rooting-it\n\r\nSo there is no way to do without root as the article refers? \n\r\nIncase of root ( I am worried about security), if there is a way to unroot it (will have to find it),  the OTA update might change it back to 20, so do we have to keep the root on?\n\r\nSo will be really thankful if someone can give the exact ADB commands. Thanks for your help.", "time": "21st June 2016, 08:24 AM", "postID": "post67415963", "replies": []}]}]}, {"text": "By stating a memory fix you are referring to rooting the phone prior to adjusting the value, correct?", "time": "21st June 2016, 04:30 AM", "postID": "post67413969", "replies": []}]}, {"text": "Sounds great... but for me stock settings only end up getting about 2h of SOT wich seems to be not that much... Seems like Android System drains a lot...", "time": "20th June 2016, 09:56 PM", "postID": "post67410689", "replies": []}, {"text": "By default limit is low but i think for day to day usage it is fine\nI able to use only 3 to 4 apps daily for multi tasking and it is fine and giving me good battery experience.", "time": "21st June 2016, 03:00 AM", "postID": "post67413349", "replies": []}, {"text": "Can someone post on how to do this without root - please give the adb commands. I know that a quora post was provided to do without root using adb etc but was not able to do this..\nI  was able to do the screen display density to 400 without root using adb commands (density) but was not able to do this. I will be very thankful if someone can do this.", "time": "21st June 2016, 06:51 AM", "postID": "post67415034", "replies": []}, {"text": "There is no Utility for the op3. And it already is very simple", "time": "21st June 2016, 11:53 AM", "postID": "post67418225", "replies": []}, {"text": "That's actully true! Haven't thought about that. You can Mount/remount by using a custom Recovery. But still I would recommend rooting, since it doesn't even Void your warranty", "time": "21st June 2016, 10:51 PM", "postID": "post67427007", "replies": []}, {"text": "Dunno guys,i just got my phone yesterday,barely installed anything,like 3 apps running in the background and my Nonstop Knight game reloads in 7/10 tries.", "time": "29th June 2016, 12:14 PM", "postID": "post67530741", "replies": []}, {"text": "With OOS 3.2 the RAM can (well, could) be used to its fullest. I simply could not throw enough at it to fill up. Five big, full 3D games, 20+ Chrome tabs, all my apps (30ish) open and still 1Gb remaining whilst load-less app-switching", "time": "6th July 2016, 02:23 PM", "postID": "post67628285", "replies": []}, {"text": "The multitasking on this device is awesome! Good job OnePlus", "time": "6th July 2016, 05:44 PM", "postID": "post67630843", "replies": []}, {"text": "If this phone had 4GB of RAM, I think it wouldn't have changed anything.", "time": "23rd July 2016, 11:50 PM", "postID": "post67876284", "replies": [{"text": "I remember my old Nexus 4, with 2GB ir RAM. It was a great amount of RAM back then for a phone and in kitkat I never seen it beyond the 50% usage. On official lollipop or marshmallow (CM13) it use more than 50% of RAM but not totally, it would be too much for the Snapdragon 4 Pro.\r\nMaybe 6GB is not necessary but some other SD820 phone have 3GB and not necessarily cheaper than the OP3.\n\r\nQui peut le plus, peut le moins. I don't know how to translate it.", "time": "25th July 2016, 10:28 AM", "postID": "post67894253", "replies": []}]}, {"text": "Interesting interview of the co-founder of OnePlus about RAM usage : https://www.youtube.com/watch?v=HZT19zmxNcQ&t=576", "time": "25th July 2016, 08:43 PM", "postID": "post67901372", "replies": []}]}, {"title": "Scrolling smoothness", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-3/review/scrolling-smoothness-t3400049", "https://forum.xda-developers.com/oneplus-3/review/scrolling-smoothness-t3400049/page2"], "threads": [{"text": "Butter smooth to say the least! I never really experience any stutter.", "time": "30th July 2016, 01:51 PM", "postID": "post67968312", "replies": []}, {"text": "The only place I've experienced stutter is in Google Inbox, when opening a message; from my understanding that's more Google's fault.", "time": "30th July 2016, 09:02 PM", "postID": "post67973084", "replies": []}, {"text": "", "time": "1st August 2016, 04:52 AM", "postID": "post67989894", "replies": []}, {"text": "Got scrolling lag rarely only when browsing, not in any other app. This is browsers fault, so i don't count it as a minus.", "time": "5th September 2016, 10:40 PM", "postID": "post68546699", "replies": [{"text": "I have this problem too, but it's really noticeable in Google Play store, like little jumps/stutters when i scroll keeping my finger on the screen, touching it (like moving the screen up or down, in \"medium\" speed)\n\r\nCould you please check if this happens to you too? i'm worried i might have some touch issue", "time": "21st December 2016, 01:05 AM", "postID": "post70185241", "replies": [{"text": "Those are what we called bad optimized apps.", "time": "21st December 2016, 07:04 AM", "postID": "post70188048", "replies": [{"text": "Thanks! is it normal if it happens in almost all the apps? like the Gallery app (oneplus stock one), as i said, you notice it if you hold your finger on the screen while scrolling, and don't release it", "time": "22nd December 2016, 07:02 PM", "postID": "post70212016", "replies": [{"text": "I don't think that's normal. I only experience lag on Google Chrome all other apps are butter smooth, not noticing any lag on Gallery app.", "time": "23rd December 2016, 08:16 PM", "postID": "post70226454", "replies": []}]}, {"text": "Thanks guys, i made this video to show the problem, could you please check it and let me know if my \"stutter/lag\" is normal? i would really really appreciate it:\n\n\n\nThank you!", "time": "24th December 2016, 08:37 PM", "postID": "post70240210", "replies": []}]}]}]}, {"text": "Never an issue with scrolling, whether running a stock/ rooted stock/ or a custom rom. Simply amazing.", "time": "24th October 2016, 07:05 PM", "postID": "post69288154", "replies": []}, {"text": "Same here, probably play store issue. Choppy af.", "time": "24th December 2016, 08:50 PM", "postID": "post70240361", "replies": [{"text": "Thank you! yeah in Play store and Chrome it's quite noticeable, in other apps it's just a bit\n\r\nI'm wondering if the touch latency issue of OP3/T might be related, i know it's not the same thing, not the direct cause, but it might have something to do with it\n\r\nThanks again", "time": "24th December 2016, 08:56 PM", "postID": "post70240441", "replies": [{"text": "Yeah thats touch latency, you adress this issue on oneplus forum., Wait for any update......", "time": "4th February 2017, 09:17 AM", "postID": "post70872774", "replies": []}]}]}, {"text": "I got the same and noticed when i open the top menu in e.g. play store with two fingers and then scroll again it is smooth until i close the app again. It has something to do with a failure in vsync. But i didn't found a solution.", "time": "3rd February 2017, 03:50 PM", "postID": "post70863048", "replies": []}, {"text": "Facing scrolling issues on my one plus phone 3T. Ver laggy. Had bought it in Feb starting.", "time": "15th February 2017, 05:53 AM", "postID": "post71036844", "replies": []}]}, {"title": "Heat", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-3/review/heat-t3400050", "https://forum.xda-developers.com/oneplus-3/review/heat-t3400050/page2", "https://forum.xda-developers.com/oneplus-3/review/heat-t3400050/page3", "https://forum.xda-developers.com/oneplus-3/review/heat-t3400050/page11"], "threads": [{"text": "This phone does incredibly well with heat. Whereas other S820 devices I've used like the S7, G5, and 10 get noticeable, and uncomfortably hot after watching 10 minutes of video, the 1+3 gets barely warm. It's really really really good with heat!", "time": "20th June 2016, 02:32 PM", "postID": "post67404540", "replies": [{"text": "but my phone got warmer today when it was in pocket and i was not using it while I was in underground railway with mobile data and location turned on.  Is my device should be reported to 1+3 care or to be exchanged!!", "time": "20th June 2016, 03:57 PM", "postID": "post67405718", "replies": []}, {"text": "Does your phone warm while charging it? Mine does, but I see some people saying it stays cold during charging. \n\r\nAnd after some use of camera it does get hot on top of the screen and back. Is that normal? \n\r\nAnd one game I tried, it got very warm, same with some minutes of camera. Same for you?", "time": "20th June 2016, 04:13 PM", "postID": "post67405945", "replies": [{"text": "I don't own an OP3 yet (damn you shipping time  ), but\n\nI can tell you that those scenarios are perfectly normal, every phone heats up a lot when using camera, charging & gaming.\n\nthe people who said their phone stayed cool while charging probably werent quick charging with the dash charger", "time": "20th June 2016, 05:48 PM", "postID": "post67407296", "replies": [{"text": "It's a lot lot better than my 6P did. But I just wanted to be sure. \n\r\nLet me know after you get the phone please.", "time": "20th June 2016, 05:52 PM", "postID": "post67407337", "replies": [{"text": "It's going to take a loooong time unfortunately haha, they say it will arrive approx. 3rd July", "time": "20th June 2016, 05:55 PM", "postID": "post67407387", "replies": []}]}]}]}]}, {"text": "I have updated my phone to Oxygen 3.1.2. I have been experiencing heating issue around the camera area.\n\nTemperature reading screenshots from CPU-Z have been attached.", "time": "20th June 2016, 06:24 PM", "postID": "post67407790", "replies": []}, {"text": "My phone gets very hot if I use it while charging. Like to around 46-47C. Is this normal? \nVery hot.", "time": "23rd June 2016, 11:58 AM", "postID": "post67448817", "replies": [{"text": "Around 45 it is normal i suppose.", "time": "23rd June 2016, 01:24 PM", "postID": "post67449756", "replies": []}]}, {"text": "I haven't felt mine hot at all. Even while quick charging on the dash charger. OnePlus finally got it right. \n\nSent From My OnePlus 3", "time": "24th June 2016, 06:39 PM", "postID": "post67467656", "replies": []}, {"text": "I am getting similar effects, becomes hot at times when I'm walking around with it in my pocket. The power consumption also seems to be worse when I carry it in my pocket.\r\nI have a theory about it being because the fingerprint scanner is being triggered, but I haven't done any kind of testing yet, so please keep in mind it is only a theory.", "time": "24th June 2016, 10:30 PM", "postID": "post67470180", "replies": [{"text": "Yeah.. that's an issue that's been hoggin OP2 and now OP3. I think OP Devs will include a fix to check proximity sensor before unlock or have a 'pocket mode', perhaps.\n\r\nFor the time being, keep the phone in your pocket such that the screen faces outside.", "time": "25th June 2016, 01:08 PM", "postID": "post67477070", "replies": []}]}, {"text": "It could be my imagination but I remember this phone running much cooler. It could be because it's getting warmer outside, and I bought the phone in the mid of winter. Doesn't get nearly as hot as my 6p or my note 4, but it does get a little warm by the earpiece.", "time": "23rd March 2017, 09:25 PM", "postID": "post71560254", "replies": []}, {"text": "This phone is really good with heat because it throttles the cpu down at a lower temp to avoid getting that hot it takes ages to cooldown (Like my xperia m4 is terrible for heat and even if i switch it off it takes ages to cooldown) so if a phone doesnt get very hot in the first place it wont stay hot at all", "time": "4th April 2017, 02:34 PM", "postID": "post71722538", "replies": []}, {"text": "Hi, oneplus3 is my first android phone actually my previous mobile is blackberry z10 which is horrible experience battery wise but is wise it is the best. But anyway I come to he fact after using this oneplus3 I really proud to I made a good choice because when I watching any TV channel via jiotv application for almost complete one hour I lost only 8% battery only. According to my novice user standard it is better and great to have by the way I am not used boardband available in my home, I used jio 4g service to watch. Seriously this is my best experience in mobile internet wise and battery discharge wise. I am really thanking oneplus3 company to manufactured this mobile.", "time": "5th April 2017, 02:34 PM", "postID": "post71737006", "replies": []}, {"text": "Heat distribution is really good due to the back being made of metal", "time": "12th June 2017, 06:06 PM", "postID": "post72645956", "replies": []}]}, {"title": "Low light", "rating": 3.5, "links": ["https://forum.xda-developers.com/oneplus-3/review/low-light-t3400051", "https://forum.xda-developers.com/oneplus-3/review/low-light-t3400051/page2", "https://forum.xda-developers.com/oneplus-3/review/low-light-t3400051/page3", "https://forum.xda-developers.com/oneplus-3/review/low-light-t3400051/page5"], "threads": [{"text": "sucks on this department when compared to those of samsung, iphone or nexus 6p, but is alright... average at best.", "time": "30th June 2016, 06:35 PM", "postID": "post67549561", "replies": []}, {"text": "did well at low light\ntook in my trip, 6p.m with auto, no flash and auto hdr", "time": "5th July 2016, 05:05 AM", "postID": "post67608769", "replies": []}, {"text": "Low light video (fireworks)", "time": "5th July 2016, 05:22 PM", "postID": "post67616192", "replies": []}, {"text": "even my old xperia Z3, with all the bad feedback that the camera had, takes better photos in low light conditions.", "time": "15th July 2016, 04:33 PM", "postID": "post67758571", "replies": []}, {"text": "I'm noticing a pink cast on the corners (worse on the lower right) when trying to take low-light indoors shots.\nThere's an example which shows what I'm talking about (I made an extreme exposure on purpose in order to make the cast stand out, but you can clearly see it during live preview before taking the shot).\n\nIs my unit defective? Please tell me I'm not the only one", "time": "22nd August 2016, 07:30 PM", "postID": "post68311115", "replies": [{"text": "Pretty sure I have that too. Only visible when using extreme exposure.", "time": "22nd August 2016, 08:07 PM", "postID": "post68311819", "replies": []}, {"text": "This should be high iso values. Next time try change to manual mode and put iso manually.", "time": "23rd August 2016, 03:48 PM", "postID": "post68325658", "replies": []}]}, {"text": "I know what I'm saying - leave the iso as it is (auto) and play with the shutter speed - between 1/250 and higher the pink cast should be at its peak (given the situation you're indoors).", "time": "23rd August 2016, 03:57 PM", "postID": "post68325798", "replies": []}, {"text": "Check this out. Photo was taken around 10PM at a camping night. I'm happy about it's camera performance. But lowlight crowded scenes could get blurry. I would rate lowlight camera performance for OnePlus3  8/10 if he S7edge gets 10/10. \r\nNeither too good nor too bad.", "time": "11th October 2016, 12:40 PM", "postID": "post69076010", "replies": []}, {"text": "I think this camera is pretty good in low light. I got some nice (for phone camera) shots using manual settings. First one is taken at midnight, no lights but the moon. Second one from fishing pier, I couldn't even see houses on the beach with my eyes, but sensor actually caught it. Third one is full moon and bioluminescent ocean. \r\nThese are all taken without any artificial light. I think this camera has potential.", "time": "15th November 2016, 05:47 AM", "postID": "post69626942", "replies": []}, {"text": "Manual mode, iso 400, 0.5-1 s shutter speed.. No edit.. Just stock camera..", "time": "15th November 2016, 11:17 AM", "postID": "post69630196", "replies": []}, {"text": "IMHO low light photos are amazingly good. Much, much better than my old OP2. Here is an example. Deep night with medium city lights. \n\nAuto mode with HQ", "time": "17th November 2016, 07:56 AM", "postID": "post69661588", "replies": []}, {"text": "can anyone here perhaps explain in simple terms how to use manual mode, in particular ISO?\n\r\nI use manual mode sometimes but the only thing I change is exposure time in order to get more light into photos in low light scenarios, but I see others modifying ISO as well and I'm not sure why or why not to do that", "time": "17th November 2016, 02:43 PM", "postID": "post69666486", "replies": [{"text": "Do not worry about iso if you are not shooting a quick object. Like moving thing. Just adjust shutter speed and let the camera adjust other settings. Find out maximum exposure time you can get without a tripod. Play with E. Time to get the best out of night photos. Increase iso incase of you want to capture quick shot. It would be grainy, but less motion blur.", "time": "18th November 2016, 12:52 AM", "postID": "post69674312", "replies": []}]}, {"text": "The higher the iso, the lighter the picture. \nBut at the same time a higher iso means more noise.\nIf possible without shaking the phone it is always better to shoot at the lowest iso\nand use a longer shutter speed.", "time": "17th November 2016, 04:29 PM", "postID": "post69668068", "replies": []}, {"text": "Usually blurry mess, totally unacceptable. Sure manual settings + tripod, you can make artistic shots, but in day to day use, this camera (or the algorhytms behind) is total rubbish", "time": "7th December 2016, 10:55 PM", "postID": "post69980529", "replies": []}, {"text": "its (much) worse than my previous Nexus 5x.\n\nPeople here using manual settings are just kidding us.\n  I appreciate a good manual mode but auto performance is what i want and 1+3 fails miserably here. Night shots are terrible, my 5x (same sensor with Nexus 6p) beats it by a large margin.", "time": "27th December 2016, 11:32 PM", "postID": "post70282025", "replies": []}, {"text": "Well. It's definitely better than the iPhone 7 and 6S camera that's for sure. I was shocked to see how poor it's low light performance was.", "time": "4th January 2017, 08:17 AM", "postID": "post70385829", "replies": [{"text": "Huh? I'm sitting here with both. In my den with only a lamp. The 6s is way better low light than OP3. OP3 is dark, green tinted, and trying to denoise too much. 6s is actually decent all around, not even struggling.", "time": "17th January 2017, 05:36 AM", "postID": "post70588019", "replies": []}]}, {"text": "manual mode works well on oneplus 3...........you just need to keep it on timer", "time": "5th January 2017, 07:22 AM", "postID": "post70401246", "replies": []}, {"text": "Im on the latest ressurection remix 2/1/2017 unofficial test rom and im very happy with the picture quality.", "time": "5th February 2017, 11:44 AM", "postID": "post70887998", "replies": []}, {"text": "i did a comparison to SGS7Edge in different low light situations!\n\r\nAfter all it's absolutely dependent on the situation of light.\r\ntungsten light landscape are way better on the oneplus i therm of sharpness, noise and colors\r\nnight shots are better on the samsung, especially when there is a movin object ==> OP is always blurry, that sucks", "time": "9th February 2017, 09:40 AM", "postID": "post70948899", "replies": []}, {"text": "Manual Mode ISO 100, 10 secs shutter, Infinite Focus.\r\nSome tweaks in Exposure,Brightness,Colors and Noise Reduction via PS.\n\r\nThis is probably one of my best phone for replacing DSLR to edit images. Sorry if bad shots !", "time": "27th February 2017, 11:45 PM", "postID": "post71218460", "replies": []}, {"text": "it seems that OP has put OIS on OP3 and realized camera can now handle 1/25 or even 1/17s exposures when shooting from hand. it gives nice boost in pic quality reducing noise, as ISO can be kept lower while shooting indoors and/or in evenings.\n\r\nbut, OIS helps with camera/phone/hand shake only.\r\nit doesn't help with kids running around and even doesn't help with them posing for a photo without being completely frozen in place.\n\r\nreal life result of OP optimization is great, clear and noiseless background of the picture, and almost always blurry characters in it.\n\r\nI would really like to have a lower ISO and longer exposure times for some scenery mode. HQ mode could be used also.\r\non the other hand, normal Auto mode should be able to catch every-day non-completely-static events, while keeping exposure close to 1/60 or shorter. switching to Manual and fixing exposure each time you want to make some quick photo is just no go!", "time": "8th March 2017, 01:32 PM", "postID": "post71335770", "replies": [{"text": "This guy gets it. This camera is great for me to capture landscape and still items. If i want to capture a moving object i know auto mode is gonna screw me a big time. So i always set desired sutter speed manually. I know most of you don't use manual mode. But i love it.", "time": "8th March 2017, 02:14 PM", "postID": "post71336322", "replies": []}]}, {"text": "On low light the camera is quite bad.\r\nWhen I choose HQ/HDR the flash is not active.\r\nOnly when both are off the flash can be used....\r\nI'd rater use my g2 camera", "time": "27th March 2017, 09:09 PM", "postID": "post71613702", "replies": []}, {"text": "Oporto Hard Rock", "time": "19th April 2017, 08:45 PM", "postID": "post71935498", "replies": []}]}, {"title": "Photo quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/oneplus-3/review/photo-quality-t3400052", "https://forum.xda-developers.com/oneplus-3/review/photo-quality-t3400052/page2", "https://forum.xda-developers.com/oneplus-3/review/photo-quality-t3400052/page3", "https://forum.xda-developers.com/oneplus-3/review/photo-quality-t3400052/page42"], "threads": [{"text": "So far medium to high brightness takes excellent photos. I am finding HD much more appealing than HDR in most situations. In low light HD or manual mode must be used to get an acceptable photo. HD works very well in a single 13w(cfl) light illuminates room (low bedroom light level). \n\nSoft fine grain present in photo, but it is not distracting and plenty of detail left.", "time": "18th June 2016, 03:34 AM", "postID": "post67369784", "replies": []}, {"text": "So I opened the hidden service menu *#808# and went through al the test and when I came at the \"optical image stabilizer\" it says failed...anyone else has this? Could it be software disabled or is my camera faulty?\n\r\nhere is a picture for comparison", "time": "19th June 2016, 12:13 AM", "postID": "post67382635", "replies": [{"text": "this phone has super hd camera the best thing i like on it", "time": "20th June 2016, 05:44 AM", "postID": "post67398974", "replies": []}]}, {"text": "nice but doesnt quite compare with nexus 6 p", "time": "19th June 2016, 12:20 PM", "postID": "post67388195", "replies": []}, {"text": "I dont use the camera much but i do know it seems better than my wifes s6.", "time": "20th June 2016, 12:26 AM", "postID": "post67396816", "replies": []}, {"text": "Camera seems to be very compareable to my 6S Plus. In low light the iPhone does a slightly better job, in good lighting the 1+3.\nThe stabilisation for video is much better in the iPhone.", "time": "20th June 2016, 06:42 AM", "postID": "post67399410", "replies": []}, {"text": "I got my 3 Saturday morning these photos were taken in the afternoon all default settings", "time": "20th June 2016, 01:09 PM", "postID": "post67403472", "replies": []}, {"text": "https://goo.gl/photos/eq6HSWoTwRVLCykY7", "time": "20th June 2016, 02:01 PM", "postID": "post67404096", "replies": []}, {"text": "Important tip for making the most out of the 1+3 camera...if you want to take a good macro, you cannot rely on automatic mode. Switch to manual focus, dial it all the way down, and you'll get insane macros like this:", "time": "20th June 2016, 02:28 PM", "postID": "post67404467", "replies": []}, {"text": "Here's a few shots I took a couple of days ago.", "time": "20th June 2016, 10:13 PM", "postID": "post67410883", "replies": [{"text": "That pavement picture is my new wallpaper xD", "time": "24th June 2016, 03:31 AM", "postID": "post67458784", "replies": []}]}, {"text": "I have both the 6p and the HTC 10 and while the 10 sucks and the 6p is hard to beat I am pleasantly surprised with the op3. It's really good actually. https://goo.gl/photos/RgwFUT3Rwhyt6XJL6", "time": "24th June 2016, 03:59 AM", "postID": "post67459000", "replies": []}, {"text": "I am using Camera FV-5 and Cinema FV-5. So far no problems with them. Also to my eyes they seem to have better image quality.", "time": "24th June 2016, 05:28 AM", "postID": "post67459627", "replies": []}, {"text": "I am uploading 2 photos: Direct jpg from camera app, another is edit of the same image in snapseed app(edited jgp, not raw file). \r\nI am happy with the camera quality", "time": "24th June 2016, 06:10 PM", "postID": "post67467271", "replies": []}, {"text": "When looking at photos other people have taken with the OP3 it often looks like they have a watercolour filter on them when you zoom in due to the image processing, but some other images don't. Is anyone who has the device able to explain this?\nThanks", "time": "24th June 2016, 07:00 PM", "postID": "post67467927", "replies": []}, {"text": "my pics", "time": "29th June 2016, 04:03 PM", "postID": "post67533707", "replies": []}, {"text": "After testing the OP3 and my 6P, the SD820 could be a beast, but man the pics on the 6P are much much better, specially in a  low light environment AKA where most pictures happen AKA in your house.   I cant say i am dissapointed, its pics are good in daytime and average in low light for a \"$400 phone\".  But not sure I am going to keep it.   So if you are planning on dumping your Galaxy, 6P or iphone for this phone, you might want to wait for another one if the camera is that important to you.  \n\nHope this helps someone.", "time": "30th June 2016, 06:39 PM", "postID": "post67549625", "replies": []}, {"text": "What does the HD option make?\n\nTapnięte z OnePlus 3", "time": "30th June 2016, 09:23 PM", "postID": "post67551589", "replies": []}, {"text": "Here's my take on the camera and photo quality.\nOp3 trends to take detail rich sharp images, but the camera post processing is not overdone as in Xperia/TouchWiz cameras. So it's a bit less saturated, a tad softer, and generally a stop underexposed sometimes. \n\nI was able to get details out of shadows if needed in post processing (Snapseed)\n\nSome images I liked so far, taken on Op3\n\nNote: that steps picture I used a filter, rest of them I used some basic ambience and detail boost on Snapseed. I have not seen any artifacts or loss of quality/detail.", "time": "1st July 2016, 02:43 AM", "postID": "post67554280", "replies": []}, {"text": "Here are my pics, i added the ones from the 6p for comparison. \n\nhttps://goo.gl/photos/jt2ST6ZdReH92xfX6", "time": "1st July 2016, 02:44 PM", "postID": "post67560626", "replies": [{"text": "Ok, i don't know which are made with op3 instead 6p,the only 4 i'm sure is in the bathroom.. It's seems pretty similar to me, seem noise while zoom.. The lastest you do in manual? It's seems much bright than the others. @ least the others photos seems to me exactly the same resolution (@ max zoom).. Rly, probably i'm not an expert (without probably xD), but can't find consistent difference in your shot.. Thank you to the pictures in comparison! I believe a lot more in people instead the reviewers", "time": "1st July 2016, 03:26 PM", "postID": "post67561124", "replies": [{"text": "One i took from the 6P in regular mode, for the other HDR+ was turned on, which is the default.  It gives you a way better picture.  Same as the night shot to the speed sign.  One with the 6p normal, another with HDR+ and then with the OP3.  \n\r\nEDIT: in the bathroom I took a manual shot with the OP3!!! thats why you see it with more light!\n\r\nIMO, there are more details with the 6P, despite the fact that it has less MP.  That is for day and night time pictures.  But make no mistake, the OP3 is not a let down.  If you guys want, I can take few more pics, i also have the iphone i6 plus (not the S, my wife has the S plus but she is not here).", "time": "1st July 2016, 03:34 PM", "postID": "post67561229", "replies": [{"text": "Yeah, i was really afraid of the camera about this phone (coming from htc m8, and opo), and it takes really good pics for what i need, sure oneplus could spend something more for a bigger size pixels, it would been a really flagship killer xD", "time": "1st July 2016, 03:43 PM", "postID": "post67561348", "replies": []}]}]}]}, {"text": "While I'm still trying to get used to how the OP3 takes photos, I'm loving the results so far! \n\nNot all of these were from the stock camera app, but I'm glad we have options 😀\n\nTaken at Canada's Wonderland on July 1st, 2016.", "time": "2nd July 2016, 04:51 AM", "postID": "post67568612", "replies": []}, {"text": "Are you guys shooting 4:3 or 16:9? I noticed that the app opens with 4:3 as standard, but it's a native 16:9 sensor i think?", "time": "2nd July 2016, 10:33 AM", "postID": "post67571087", "replies": [{"text": "If you want 16mp shoot at 4:3. I believe 16:9 will drop it down to 12mp.", "time": "2nd July 2016, 02:57 PM", "postID": "post67573766", "replies": []}]}, {"text": "^^^The answer i was looking for!", "time": "2nd July 2016, 05:29 PM", "postID": "post67575581", "replies": []}]}, {"title": "Video quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/oneplus-3/review/video-quality-t3400053", "https://forum.xda-developers.com/oneplus-3/review/video-quality-t3400053/page2", "https://forum.xda-developers.com/oneplus-3/review/video-quality-t3400053/page3"], "threads": [{"text": "Video quality is okay, nothing great. The stabilization could be better. I also don't like that there is no 1080p/60 option.", "time": "20th June 2016, 02:30 PM", "postID": "post67404497", "replies": [{"text": "You got any sample? And i think none of the latest flagships support 1080p60fps, dont know why", "time": "20th June 2016, 05:19 PM", "postID": "post67406882", "replies": []}]}, {"text": "Techradar said you can record 1080p 60fps with other camera app, like open camera. \n\nAnyone can test it?\n\nThanks", "time": "22nd June 2016, 08:06 AM", "postID": "post67431498", "replies": [{"text": "I gave open camera a shot and set it to 60fps, it doesn't actually do it, sadly enough. I've tried it both at the default bitrate (~20) and forced it to 5 mbit, both on the old api and the new camera2 api, nothing.\n\nI'm not entirely certain what OP's reasoning behind no 60fps recording is anyway, I hope they'll add it in an update since AFAIK there's no hardware limitations which wouldn't allow it.", "time": "22nd June 2016, 08:46 AM", "postID": "post67431874", "replies": [{"text": "Htc 10, lg g5, htc 10, nexus 6p, xiaomi mi 5, none of these offer 60fps. Actually i think of all recent flagships only s7 is capable, i dont know reasons behind this decision of oems", "time": "22nd June 2016, 10:09 AM", "postID": "post67432651", "replies": []}]}]}, {"text": "I have an old hardware Zuk Z1 (snapdragon 801, same hardware as oneplus one) and it CAN record great quality 1080p 60fps.\n\nWith my Zuk I have low cost phone with great battery, very good responsive, customizable software, and a video resolution I CAN'T GET WITH NEW 2016 FLAGSHIPS. \n\nincomprehensible. \n\nSpecially because that is the only reason I don't renew my phone. \n\n\nBut I would be happy to buy oneplus 3 of they add full HD 60fps non slowmotion video recording. \n\nHope they add it.", "time": "22nd June 2016, 10:55 AM", "postID": "post67433128", "replies": []}, {"text": "Anyone can test Video Recording in a really Loud environment?\nLike for example a Rave or Concert?\nSince the OPO, OP2 and the OPX all had serious issues with audio clipping on such occasions im very curious if OnePlus finally fixed this issue in theyre newest phone", "time": "22nd June 2016, 10:55 AM", "postID": "post67433131", "replies": [{"text": "Interested too", "time": "22nd June 2016, 10:56 AM", "postID": "post67433139", "replies": []}, {"text": "I'll be at the AirbeatOne festival soon , and record some videos, will report back then", "time": "22nd June 2016, 11:41 AM", "postID": "post67433619", "replies": []}]}, {"text": "I can record 1080p60 on blisspop \n\nDemo: https://www.dropbox.com/s/gcn2lg9kni...32718.mp4?dl=0", "time": "25th June 2016, 09:42 PM", "postID": "post67482545", "replies": []}, {"text": "what iv understood that someone said, that these mobile phone processors cant go constant 60fps video like gopro can. I had it on oneplus1 with Sultan-ROM and fps seemed to fluctuate somehwere between 59fps and 60fps (bsplayer with the i in the upper  right corner, it had FPS counter) and i think i saw some small stuttering sometimes.. it looked almost like it were running too fast, hard to compare(and i dont have gopro) but it would be really cool to have it do like gopro but its probably gonna need own chip to make video.. (im not an expert on this matter, just what iv noticed) in the end i just recorded 4k so my daughter can enjoy 4k videos when he's all grown up. 4k downscaled into 1080p is _REALLY_ sharp compared to normal 1080p mode where native 1080p almost looked like youtube quality at 1080p and 4k downscaled to 1080p looked like ripped BR-movie with 11Gb/2hrs .. really crisp.\n\n-- Waiting for my 1+3, estimated delivery date => monday 18th of july", "time": "13th July 2016, 07:27 AM", "postID": "post67722824", "replies": []}, {"text": "Is the video recording quality/audio when recording fixed after the 3.2.2 update? Planning on buying this phone over the upcoming note7/s7 edge. I like the touchwiz interface but not the Samsung bloatware apps like their keyboard/gear manager etc.. \n\r\nI shoot alot of 1080p video I don't think I will ever shoot videos at 4K \r\nFor 1080p is the OP3 video quality good enough? \n\r\nThanks guys", "time": "30th July 2016, 05:39 PM", "postID": "post67970911", "replies": []}, {"text": "I must say that on OOS 3.2.4 with the XDA noise cancellation fix, there is not really anything to complain about when recording 4k video.\n\nThe video is neither shaky nor choppy, and the audio quality is just fine.\nPanning free-handedly is smooth.\nI don't know how some people manage to get such bad results...", "time": "28th August 2016, 07:38 PM", "postID": "post68415605", "replies": []}, {"text": "For me it cannot clear anymore, cause when I use it to listen to a music, it just like someone shout near me", "time": "29th August 2016, 04:15 AM", "postID": "post68420668", "replies": []}, {"text": "Here's a video recording a Street Band here in brazil. This camera is awesome!\n\nhttps://www.youtube.com/watch?v=KM9NYkMeUpY", "time": "29th August 2016, 05:55 PM", "postID": "post68430526", "replies": []}, {"text": "I'm impressed by the sharpness and focus and its way better than the LG G2 I've just came from. \n\r\nStabilization on the other hand is awful. Is this a software or hardware issue? Has anyone tested any other video apps and solved this issue?", "time": "17th October 2016, 12:08 PM", "postID": "post69170326", "replies": []}, {"text": "i shot this video during my winter holidays, i think quality has improved a lot from the beginning\nhttps://youtu.be/VdxoLXDqeEM\nhttps://youtu.be/VdxoLXDqeEM?autoplay=0&origin=https://forum.xda-developers.com\"\r\n  frameborder=\"0\">", "time": "24th January 2017, 01:01 AM", "postID": "post70697638", "replies": []}]}, {"title": "Selfie quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/oneplus-3/review/selfie-quality-t3400054", "https://forum.xda-developers.com/oneplus-3/review/selfie-quality-t3400054/page2", "https://forum.xda-developers.com/oneplus-3/review/selfie-quality-t3400054/page3"], "threads": [{"text": "Every. single. ****ing. pore.", "time": "15th September 2016, 01:57 AM", "postID": "post68693140", "replies": [{"text": "Bahahahaha nailed it!", "time": "15th September 2016, 09:08 AM", "postID": "post68696904", "replies": []}]}, {"text": "Camera quality is great on any OxygenOS ROM. Front selfie cam also is very clear and well designed. Love it so far after a month or so of usage.", "time": "15th September 2016, 07:36 AM", "postID": "post68695948", "replies": [{"text": "I agree but i think that for a flagship is a shame the absence of front flash...Nowadays all phones have it!", "time": "15th September 2016, 11:22 AM", "postID": "post68698336", "replies": [{"text": "Uh ... very few 'flagship' phones have a front flash, even today.  I'd have preferred a dual tone REAR flash ... but meh, it still works.", "time": "15th September 2016, 10:38 PM", "postID": "post68707770", "replies": [{"text": "For me the lack of dual tone flash isnt a big deal, as I rarely use the flash even in low light conditions.\n\r\nThey should have done the front flash the same way as Snapchat did it, making the screen go bright white while taking the picture.", "time": "17th September 2016, 05:38 PM", "postID": "post68733970", "replies": [{"text": "I agree.  It's a simple software trick, and LG used it on the G4 as well.", "time": "17th September 2016, 07:23 PM", "postID": "post68735464", "replies": []}]}]}]}]}, {"text": "I'll admit it, the dog is really tough to get in a photo without blur.  He doesn't sit still much.  But I like this one.", "time": "17th September 2016, 04:51 AM", "postID": "post68725840", "replies": []}, {"text": "I've found the selfie quality to be really good.", "time": "23rd September 2016, 12:22 PM", "postID": "post68822682", "replies": []}, {"text": "you really have to keep it steady otherwise it'll not be a nice picture. because you see every little movement later on. \n\nVerstuurd vanaf mijn ONEPLUS A3003 met Tapatalk", "time": "24th September 2016, 02:25 PM", "postID": "post68838883", "replies": []}, {"text": "Guys I get really noisy selfies at even moderate indoor lighting.. Shooting upto 1500 to 5000iso..any problem with my device??? \nAlso the general selfie quality is lesser than my g4 in good lighting too the background subjects r blurry.. I'm on 3.2.6 is it a firmware issue", "time": "27th September 2016, 10:57 AM", "postID": "post68879007", "replies": []}, {"text": "Whenever i try to take group selfies,  the front subject(person holding the phone) comes out sharp and others at the back are blurred out. Why??  Are you guys facing the same problem?  Please help", "time": "24th October 2016, 09:02 PM", "postID": "post69289885", "replies": [{"text": "Word. I'm facing the same issue. Any fix for this?", "time": "23rd November 2016, 05:58 AM", "postID": "post69751054", "replies": []}, {"text": "Most frontfacing cameras simply don't have any refocusing at all. Even more expensive flagships. In fact, I can't name any smartphone which has a focus-assisted frontfacing camera. \n\r\nThe hardware simply does not support it. \n\r\nIt is called fixed-focus. \n\r\nThere is a given distance to the sensor which is always in focus. If you are too close or too far away from the camera it gets blurry. \r\nThere is nothing you can do about it.\n\n\r\nWhat you can try to improve it a little is another camera app for selfies, like Google Camera. \r\nIt is known that the OnePlus camera app often applies too much postprocessing which could result in more blurred pictures. \r\nAnother app could produce a little bit sharper, but more noisy results.\n\r\nThis is the last working version on the OnePlus 3 http://www.apkmirror.com/apk/google-...-apk-download/", "time": "23rd November 2016, 12:21 PM", "postID": "post69754792", "replies": []}]}, {"text": "Selfie quality is 0/5\nTotal noisy, grainy pictures.", "time": "25th October 2016, 10:58 AM", "postID": "post69297893", "replies": [{"text": "Haha I take that as a joke", "time": "27th October 2016, 04:38 AM", "postID": "post69327173", "replies": [{"text": "What? Its not a joke. Just go through threads over here/OnePlus forums about camera quality.\n\r\nhere is one: https://forums.oneplus.net/threads/o...-3-2-7.470510/\r\nAnd that is for rear cam too. Selfie cam is the worst.", "time": "28th October 2016, 10:58 AM", "postID": "post69346260", "replies": []}]}]}, {"text": "I don't know about the issues you all are facing, but for me my OP3 has one the best front facing cameras. Whenever we are out in a group, they always borrow my phone. 17.3 GB out of the 54GB is all selfies. \n\n---------- Post added at 10:08 AM ---------- Previous post was at 10:01 AM ----------\n\n\nExcuse the torn bed sheets xD", "time": "29th October 2016, 05:38 AM", "postID": "post69357211", "replies": []}, {"text": "It doesnt matter. But no, the quality shouldnt be influenced by that, though.", "time": "29th October 2016, 09:57 AM", "postID": "post69359413", "replies": []}, {"text": "Selfie cam is great ,  i just want to ask is their  flash in front cam .( MInd if i am wrong )", "time": "5th December 2016, 11:58 AM", "postID": "post69937716", "replies": [{"text": "No hardware and no software flash (bright display).", "time": "5th December 2016, 02:12 PM", "postID": "post69939574", "replies": []}]}]}, {"title": "Time to take picture (camera launch speed)", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-3/review/time-to-picture-camera-launch-speed-t3400055"], "threads": [{"text": "Unbelievably fast.  Double tap to open camera when it's sleeping, and it's almost instant.", "time": "17th June 2016, 06:44 PM", "postID": "post67364551", "replies": []}, {"text": "3.2.1 seems to have slowed the camera down a bit. Anyone else notice that the capture time has gone up?", "time": "8th July 2016, 11:45 PM", "postID": "post67663062", "replies": [{"text": "ya bit for capture time, for start up i haven't use it much when i was on 3.1.3", "time": "9th July 2016, 02:40 AM", "postID": "post67664336", "replies": []}]}, {"text": "Simply fast.", "time": "9th July 2016, 04:27 PM", "postID": "post67671513", "replies": []}, {"text": "Very fast !", "time": "25th July 2016, 08:50 PM", "postID": "post67901465", "replies": []}, {"text": "Circle gesture to turn on. 'Nuff said..", "time": "15th September 2016, 01:58 AM", "postID": "post68693143", "replies": []}, {"text": "This is the fastest camera to launch I think I've ever seen in person.  I mean, it's not quite dSLR power on and shoot fast ... but ... damn.  Between the circle gesture, double tap power button, and double tap fingerprint sensor to launch, this thing is ready to rock faster than you can get it out of your pocket.  Very impressive.  And it takes a pretty good photo too!  Yes, there ARE better cameras out there in phones - but not at this price.", "time": "16th September 2016, 04:37 PM", "postID": "post68718382", "replies": []}, {"text": "With the circle gesture on the screen in standby mode, this is the fastest camera launch on a smartphone. Never miss a moment again due to late camera start. Superb!", "time": "7th October 2016, 03:21 AM", "postID": "post69015161", "replies": []}]}, {"title": "Software (ease of use, features, etc)", "rating": 4.0, "links": ["https://forum.xda-developers.com/oneplus-3/review/software-ease-features-t3400056"], "threads": [{"text": "The touch screen is not overly sensitive like Samsung phones, so it's quite easy to use without messing up and the choice of swiftkeys over stock Google keyboard is a nice feature.  I don't think this phone is meant for people who want an easy to use uncluttered phone.  There are a number of customizations that could make it confusing for novices.  The easiest phones for non-tech people to use are HTC and Motorola phones.", "time": "22nd June 2016, 09:46 PM", "postID": "post67441425", "replies": []}, {"text": "There're only a couple of things missing from stock that I really want in a ROM/OS - center clock, text-only battery.  I can use Firefox with uBlock Origin to get rid of ads, but as far as stock OS/ROMs go, it's pretty darn good right out of the box.", "time": "30th August 2016, 06:48 PM", "postID": "post68448304", "replies": [{"text": "absolutely agree with you on the stock roms. i also got my dad and any some other relatives motorola phones for the same reason. they are good phones and offer great value for their price. the out of box experience with stock android is extremely great and simple for their needs. works smoothly and they rarely have any issue. the battery percentage is something that has baffled me for years now. i simply dont understand why google has not introduced something as basic as this.", "time": "1st September 2016, 05:32 AM", "postID": "post68471625", "replies": [{"text": "Why stock Android isn't more feature-rich is beyond me, as well.  AOSP should be more like Resurrection Remix, old-school Paranoid Android/PAC Rom, etc.  Heck, even more 'middle-of-the-road' ROMs like Cyanogenmod, in terms of available options.  Give us all the options, let us pick and choose what we want or don't want to use.  Those ROMs still run plenty fast, so it's not like they're bogged down just because of various settings and choices.", "time": "1st September 2016, 06:01 PM", "postID": "post68480253", "replies": [{"text": "Ya stock is perfectly capabale and devices even the low end can run. I recently installed cm13 nightly on a colleague's 1st gen moto e and its running perfectly and very smooth. Atleast as smooth as it can be on such an old phone.  I get that they are not going to give features of rr,  which is extremely feauture rich but they can definitely do more than their current offering.", "time": "2nd September 2016, 03:41 AM", "postID": "post68486518", "replies": []}]}]}, {"text": "Right. Then it would not be necessary to install gravity box just to get the center clock. The text battery I could do without. OK with gravity box there is another nice feature, namely give the two mobile connection items two different colours.", "time": "7th October 2016, 03:29 AM", "postID": "post69015235", "replies": []}]}, {"text": "Why would granny use advanced features if she is looking for simple camera :v\nits pretty easy. just tap the silver button and bam.", "time": "7th October 2016, 02:40 PM", "postID": "post69020889", "replies": []}, {"text": "U wanna give an OP3 to ur granny?", "time": "20th December 2016, 08:25 AM", "postID": "post70173492", "replies": []}]}, {"title": "Charging speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/oneplus-3/review/charging-speed-t3400057", "https://forum.xda-developers.com/oneplus-3/review/charging-speed-t3400057/page2", "https://forum.xda-developers.com/oneplus-3/review/charging-speed-t3400057/page3", "https://forum.xda-developers.com/oneplus-3/review/charging-speed-t3400057/page15"], "threads": [{"text": "92% in 42mins and 100% in 57mins...from a test ive seen.. Amazingly good.. Wow", "time": "16th June 2016, 10:34 PM", "postID": "post67351900", "replies": []}, {"text": "Absolutely fast. Never expected phone to charge at this crazy speed.", "time": "17th June 2016, 02:38 AM", "postID": "post67354068", "replies": []}, {"text": "Mine went from 12% to 100% in 58 minutes. Pretty bloody good given I'm used to having to charge overnight.", "time": "17th June 2016, 11:44 AM", "postID": "post67358799", "replies": []}, {"text": "Charging is really quick and the device did not get hot. 50-100% in around 40mins", "time": "17th June 2016, 05:19 PM", "postID": "post67363306", "replies": []}, {"text": "Device didn't get hot. The last few %s seem to take the longest", "time": "17th June 2016, 06:17 PM", "postID": "post67364176", "replies": []}, {"text": "Charging from 25% to 85% took about 14 minutes.  It's insane how quick it is, you plug it in and a minute later it's 3% to 4% higher.", "time": "17th June 2016, 06:23 PM", "postID": "post67364257", "replies": [{"text": "stop! just stop!\n\r\nmine just got from 0% to 66% in 31 minutes", "time": "17th June 2016, 09:54 PM", "postID": "post67366946", "replies": [{"text": "Yeah it takes longer from zero percent, but charging between about 25 and 80 is really fast, try it", "time": "17th June 2016, 10:33 PM", "postID": "post67367333", "replies": [{"text": "will see tomorrow...today (right now) i got to 100% from zero in 71 minutes", "time": "17th June 2016, 10:35 PM", "postID": "post67367355", "replies": []}]}]}]}, {"text": "That's right, it's the same with any quickcharge device. The lower and upper percentile always charge way slower. The stated 14 mins COULD be right, therefore.", "time": "18th June 2016, 12:05 AM", "postID": "post67368251", "replies": []}, {"text": "try different charger / cable combinations with this app https://play.google.com/store/apps/d...mbosdev.ampere\n1600 ish mA is quickcharge 2", "time": "18th June 2016, 03:04 AM", "postID": "post67369574", "replies": []}, {"text": "My charged from 0 to 100 % in 65 minutes.\nAmpere stats in 0% is 3650mah max and gets lower to 500mah when battery around 90%\nVery happy 😊", "time": "18th June 2016, 04:26 AM", "postID": "post67370128", "replies": []}, {"text": "9%->100% it took 1.15 min 1st charge", "time": "18th June 2016, 05:11 AM", "postID": "post67370416", "replies": []}, {"text": "It is very quick, but i have to say my Oppo Find 7A does not take much longer. Quickcharge has been around for 2 years now almost. Oppo = Oneplus by the way.", "time": "18th June 2016, 05:52 AM", "postID": "post67370666", "replies": []}, {"text": "Cross-posted at https://forums.oneplus.net/threads/d...ssions.450958/ \n\r\nThis my first time doing this, and it will need more data and experiences from others, but here are my first impressions and results. I'll post the time and percentage of battery as it was charging, using the cable and wall plug provided. This all happened in the UK, fwiw:\n\r\n20:07 - 7%\r\n20:30 - 54%\r\n20:51 - 90%\r\n20:59 - 95%\r\n21:06 - 97%\r\n21:14 - 99%\r\n21:21 - 100%\n\r\nFor me, it appears that using the Dash Charger is stunningly fast during the first 0% to 60% - approximately 30mins, as per the OP3 claim.\r\nHowever, past this, the charger seems agonisingly slow.\r\nIt took 8minutes to from 90% to 95%, which is slow.\r\nIt took 7minutes to go from 95% to 97%, which is just nuts.\r\nIt took 7minutes to go from 99% to 100%, which may have just been me not watching properly", "time": "18th June 2016, 08:52 AM", "postID": "post67372217", "replies": [{"text": "Last charging is slow due to safety margins implementation in the software", "time": "18th June 2016, 02:40 PM", "postID": "post67375950", "replies": []}]}, {"text": "Waiting for my OP3 to arrive...\nIn the meantime - what happens if you connect a different phone to OP3 Dash charger+cable combo?", "time": "18th June 2016, 05:20 PM", "postID": "post67378000", "replies": [{"text": "Good question!  Look forward to trying it with my girlfriend's Nexus 5X when I get mine on Monday.", "time": "18th June 2016, 07:27 PM", "postID": "post67379664", "replies": []}]}, {"text": "Charging Speed (Day 1 - 1st Charge Cycle) {Wi-Fi active}\n\n01% - 65% ~ 30 minutes                        (Battery Temperature 38°C)*\n65% - 83% ~ 40 minutes                       (Battery Temperature 36°C)\n83% - 88% ~ 45 minutes                       (Battery Temperature 34°C)\n88% - 91% ~ 50 minutes                        (Battery Temperature 33°C)\n91% - 94% ~ 55 minutes                        (Battery Temperature 33°C)\n94% - 96% ~ 60 minutes                       (Battery Temperature 32°C)\n96% - 97% ~ 65 minutes                       (Battery Temperature 32°C)\n97% - 99% ~ 70 minutes                       (Battery Temperature 31°C)\n99% - 100% ~ 73 minutes                       (Battery Temperature 31°C)\n\n* Used CPU-X app to check Battery Temperature", "time": "18th June 2016, 08:05 PM", "postID": "post67380185", "replies": []}, {"text": "to charge from 0% (after automatic shutdown) to 100% my OP3 needs 1h 4min, that`s impressive", "time": "19th June 2016, 07:27 AM", "postID": "post67385512", "replies": [{"text": "Same here dude \nDash charging works wonder", "time": "19th June 2016, 08:43 AM", "postID": "post67386098", "replies": []}]}, {"text": "from 40% to 71% in 14 minutes..and when we look at the numbers from all others in this thread no one else got the 60% (from 25 to 85) in 14 minutes that  GokulVSD stated", "time": "19th June 2016, 12:37 PM", "postID": "post67388366", "replies": []}, {"text": "I currently have the LG G5 and I'm extremely disappointed with it, also even though it has Quick Charge 3.0 it charges a lot slower than my old Moto X Style, very disappointed. I should be receiving my OPO 3 tomorrow and I'm excited! I'll update you guys\n\n\nLittle disappointed that it isn't quickcharge compliant though as I don't want to buy a new car charger, but hopefully it'll still charge fast", "time": "19th June 2016, 11:09 PM", "postID": "post67396218", "replies": []}, {"text": "Hi,\n\nCan anybody test charging with normal charger, and check electric current with application Ampere ?\n\nThanks", "time": "20th June 2016, 07:30 AM", "postID": "post67399820", "replies": [{"text": "Full 2A. Tested with Samsung Battery Pack which supports up to 2A.", "time": "20th June 2016, 01:15 PM", "postID": "post67403530", "replies": []}]}, {"text": "any info on how quickly 1+3 would charge on regular (NON-dash) 5V/2A charger?\r\nwould it use full 2A, 1A, or USB port default 500mA?", "time": "20th June 2016, 08:17 AM", "postID": "post67400276", "replies": []}, {"text": "If anyone is interested, you can try this app Electron to get the average, instantaneous, minimum and maximum charging and discharging speeds, as well as a live current graph: http://forum.xda-developers.com/andr...peeds-t3400978", "time": "20th June 2016, 11:24 AM", "postID": "post67402208", "replies": []}, {"text": "Too fast than others but battery drain little fast", "time": "20th June 2016, 12:46 PM", "postID": "post67403207", "replies": []}, {"text": "In China,Some people in WeiBo  said that OP3 can't has a full charge. Because when we have a 100% of the battery actually it's just charge to 98%(no trickle charge). That is why we think the charging speed is amazing.", "time": "21st June 2016, 05:56 PM", "postID": "post67423220", "replies": []}, {"text": "I recently acquired an Oppo 5V5A, 25W charger. Using the OnePlus Dash Cable, I was able to get much faster charging speeds. \n\nPreviously with OnePlus 20W charger, I could only hit 63% in 30 minutes, I think most of us do. \n\nWith Oppo 25W, I could get 72% in 30 minutes, 81% in 35 minutes and 87% in 40 minutes. After that, it drops and reaches 100% in 67 minutes. \n\nI am very impressed.", "time": "9th October 2017, 02:25 PM", "postID": "post74093548", "replies": []}, {"text": "Tested charging again today. With OnePlus Fast charger and cable. Phone off. \nFrom 0 % to 100 % in 74 minutes. \nOnePlus 3 with Oos ob26 Oreo.", "time": "29th October 2017, 07:19 AM", "postID": "post74333132", "replies": [{"text": "That is about the same charging speed with the screen on, isn't it?", "time": "29th October 2017, 03:40 PM", "postID": "post74337205", "replies": []}]}, {"text": "With the phone on i think time will be loooongeer.", "time": "30th October 2017, 02:49 PM", "postID": "post74347152", "replies": []}, {"text": "I just did another charging test with my Oppo 25W/5V/5A charger. This time with my OnePlus 3 drained all the way down to 0%, until it shut off on its own. And I charged while the phone is completely off. And these are the results. \n\n10 mins - 24%\n20 mins - 49%\n30 mins - 74%\n40 mins - 89%\n50 mins - 95%\nAnd finally, at 59 minutes, it reached 100%.\n\nTook a photo of the charger. I am very happy with my purchase.", "time": "10th November 2017, 06:34 PM", "postID": "post74471674", "replies": []}, {"text": "5 to 100 percent in 58 min\n\nRR Nougat", "time": "14th November 2017, 06:31 PM", "postID": "post74514650", "replies": []}, {"text": "Boy, this charges real fast, does OP5 offer significantly faster charge times?", "time": "15th November 2017, 01:12 PM", "postID": "post74522665", "replies": [{"text": "The OnePlus 5 comes with the same 5V/4A charger. It is marginally slower only because of the larger battery.\n\nBut battery performance should be better because of the power efficient Snapdragon 835.", "time": "15th November 2017, 06:01 PM", "postID": "post74525660", "replies": []}]}, {"text": "ever since i bought this phone, i never tried overnight charging, cause this phone can charge in less than an hour, i can just leave it charging in the morning when im preparing", "time": "23rd November 2017, 05:04 AM", "postID": "post74606496", "replies": []}]}, {"title": "Screen on time", "rating": 4.0, "links": ["https://forum.xda-developers.com/oneplus-3/review/screen-time-t3400058", "https://forum.xda-developers.com/oneplus-3/review/screen-time-t3400058/page2", "https://forum.xda-developers.com/oneplus-3/review/screen-time-t3400058/page3", "https://forum.xda-developers.com/oneplus-3/review/screen-time-t3400058/page87"], "threads": [{"text": "Getting sot only around 3.5hrs.. Battery is average", "time": "17th June 2016, 04:20 AM", "postID": "post67354776", "replies": [{"text": "Usage? Mobile data or wifi?", "time": "17th June 2016, 06:51 AM", "postID": "post67355918", "replies": [{"text": "Mobile data 3g", "time": "17th June 2016, 11:56 AM", "postID": "post67358949", "replies": []}]}]}, {"text": "Unboxed it charged it till 99 and started using it. Still on 11% with <5 hours of SOT. Installed apps, using fb and normal browsing. I dont have any complaints with battery", "time": "17th June 2016, 08:37 AM", "postID": "post67356938", "replies": [{"text": "Sounds great so far, knowing that the battery normally becomes better after 2-3 days of charging I hope that we will reach even better SOTs", "time": "17th June 2016, 08:41 AM", "postID": "post67356968", "replies": []}]}, {"text": "I hpe for at least 4-5 sot with wifi and normal usage and  3.5 hrs for mobile data.", "time": "17th June 2016, 08:54 AM", "postID": "post67357077", "replies": []}, {"text": "SOT really depends on usage, and whilst I was one like many here that is obsessed with SOT, I've started to just use phones without really worrying about it. Plus Dash charge is a great addition (aside from having to carry the charger with you).", "time": "17th June 2016, 01:19 PM", "postID": "post67359963", "replies": []}, {"text": "Used a few apps, specially Snapchat and Whatsapp. Got a screen on time of 3.5 hrs on 4G. Decent yeah. OPO had a tad bit better.", "time": "17th June 2016, 02:31 PM", "postID": "post67360925", "replies": [{"text": "I think it is good. So with wifi around 4,5 hrs sot with this usage.", "time": "17th June 2016, 02:37 PM", "postID": "post67361014", "replies": []}]}, {"text": "Getting 4.5 SOT after 1st day of use. \nBattery currently at 11%.\nDash charger charges the battery really fast to. \nNo complaints and oxygen os is updated to latest", "time": "17th June 2016, 04:52 PM", "postID": "post67362911", "replies": []}, {"text": "I bought it on the launch day and conducted the test the next day after a full cycle. At precisely 5 pm I unplugged the device, at 100%, Connected to wifi with brightness at 25%, with auto brightness off. The phone was at 3% the next day at 4 pm. I got about 5 hours and 15 minutes of screen on time, moderately heavy usage, the phone only lost 6% overnight. Made 15 minutes worth of phone calls, light gaming, lots of browsing and video watching. And some apps with location as well. My previous phone was a oneplus one and for my usage, it seems to be giving me better battery life.", "time": "17th June 2016, 06:28 PM", "postID": "post67364344", "replies": []}, {"text": "Web browsing, transferred around 60 apps from old phone, Whatsapp, an hour and a half of music streaming along with writing using the mobile office app. 70:30 WiFi:3G usage. Battery @9% currently.", "time": "17th June 2016, 08:43 PM", "postID": "post67366094", "replies": [{"text": "I'm soo ****ing tempted to send my nexus 5x back and get the op3. 400 bucks is a steal with those specs. Also your SOT looks good. Are you using a dark theme and a dark wallpaper or not? From what I've read it comes prerooted?", "time": "17th June 2016, 09:50 PM", "postID": "post67366913", "replies": [{"text": "Nope. Actually refrained from using the dark theme to see how well the battery does. And my wallpaper is the default never settle wallpaper. And no, it doesn't come pre-rooted.", "time": "17th June 2016, 09:53 PM", "postID": "post67366941", "replies": [{"text": "Thanks for the info. Rooting that thing shouldn't be too hard anyway. Wonder how much battery you can sqeeze out with a dark theme / wallpaper? Haven't used an oled screen in years, though. Even more tempted now.", "time": "17th June 2016, 11:00 PM", "postID": "post67367632", "replies": []}]}]}]}, {"text": "Time on: 7h 2m 41s\nComputer power use: 534 mAh\nI'll PM the Droplr link for the battery stats and SoT screens  \n\nI've using the following:\nDark Mode active throughout\nNight Mode active throughout  [ I REALLY REALLY LOVED IT, so I keep it on all the time.]\nApps used - Gmail, Excel, Word, Dropbox, Apple Music, Pocketcasts, Fenix, Messenger and Whatsapp.\nData usage is split over LTE and WiFi. \nBattery was at 5% as I post this\n\nIf there is any other stat you'd like to see let me know", "time": "18th June 2016, 07:13 AM", "postID": "post67371316", "replies": []}, {"text": "I'm getting exactly 5 hrs of sit for the last 2 charge cycles. Completely on wifi. No sim cards for now and moderate usage with low to no gaming.", "time": "18th June 2016, 07:44 AM", "postID": "post67371569", "replies": []}, {"text": "Getting 5 hours and 7 minutes SOT after 1st day of use. \nBattery currently at 17%.", "time": "18th June 2016, 10:43 AM", "postID": "post67373340", "replies": []}, {"text": "I'm coming from an LG G4, with horrible battery life. I'm very impressed with battery life from op3 so far. \n\nFirst cycle, 2 Google accounts in sync, Mi Band connected and since it's the 2nd day with this phone I play around with it the whole time 😄", "time": "18th June 2016, 10:46 AM", "postID": "post67373365", "replies": [{"text": "Sorry to hijack the thread, but I've never had luck with 2 accounts. Sure, I can add them etc, but if the 1st account is my actual account and I buy an app on that, when I add the second account, that app then thinks it's not been paid for and the ads or whatever come back. Do you have that issue at all?\n\r\nBought the OP3 in the virtual lounge to replace my OPO... can't wait for it to arrive!", "time": "18th June 2016, 12:28 PM", "postID": "post67374379", "replies": [{"text": "Never had a problem like this \nI always keep both accounts in sync and don't remove one. \n\nWhen I setup my phone, I first add my private Google account. My apps are bought with this one. \nSecond one is for business and I add it, when phone ist set up", "time": "18th June 2016, 12:50 PM", "postID": "post67374623", "replies": []}]}]}, {"text": "After first time charging i have 4 hrs SOT with 25%left, off the charger for 23 hours. So pretty descent in my book \n\n-WTH did the word charger turned into a link to Amazon? After clicking it once it dissapears again!!", "time": "18th June 2016, 11:53 AM", "postID": "post67373994", "replies": []}, {"text": "Guys, anyone got the OP3 can compare with Z3 , OP1 or S7 , or something like good battery stats to show differences? Thanks!", "time": "18th June 2016, 03:18 PM", "postID": "post67376437", "replies": []}, {"text": "Ok so it seems battery life should be about the same as the opo which is a good sign. And this numbers are with stock rom/kernel.\n\nMine is due for 1st July", "time": "18th June 2016, 05:20 PM", "postID": "post67377998", "replies": []}, {"text": "Holding up pretty well so far on the second charge:", "time": "18th June 2016, 10:25 PM", "postID": "post67381731", "replies": []}, {"text": "Very happy with the SOT", "time": "19th June 2016, 03:09 AM", "postID": "post67383772", "replies": []}, {"text": "And that's it for the second charge:\n\n\n\n\n\n8h47m SOT over a time period of a bit over 25 hours. I'm genuinely surprised.", "time": "19th June 2016, 10:00 AM", "postID": "post67386826", "replies": []}, {"text": "oficial stock OOS 5.0 and android Oreo 8.0.0 SOT 4-5h", "time": "21st November 2017, 10:09 PM", "postID": "post74592877", "replies": []}, {"text": "my battery is draining fast now on OOS4.5.1 idk if it's software problem or just battery problem :/", "time": "23rd November 2017, 05:00 AM", "postID": "post74606472", "replies": []}, {"text": "Open Beta 30 \r\nSOT 4:46\r\n33% battery remaining op3 full stock great update.", "time": "17th January 2018, 07:04 AM", "postID": "post75228540", "replies": []}, {"text": "OP 3T with RR Zenity (7.1.2) \r\nAverage 07:38 SOT (10:03 max)\r\nAverage 01:08:03 Battery life (9:54 active) \r\nAll stats recorded since 16.11.2017 \n\r\nI'm using Black wherever I can with Substratum Themes and Greenify. Zenity has an EAS Kernel and the performance is super fluid. \n\r\nCan't post proof because I don't have 10 posts as it seems.", "time": "17th January 2018, 09:48 PM", "postID": "post75237555", "replies": [{"text": "do you have idle drain on zenith RR ?\r\nif yes, how did you fix it ?", "time": "19th January 2018, 08:55 PM", "postID": "post75262096", "replies": [{"text": "I don't experience any idle drain currently. I use a magisk module to remove the Google Play Services from the Whitelist for Doze though. It's most of the time the biggest idle drainer...", "time": "22nd January 2018, 03:50 PM", "postID": "post75294401", "replies": []}]}]}, {"text": "My OP3 from launch only gets ~4 hours SOT these days. I sent it in for some service and turns out a battery replacement is $11 + Labor (~$55 total) in case anyone was interested in it.\n\nEnded up not getting it replaced since I'll probably replace the phone soonish.", "time": "22nd January 2018, 05:54 PM", "postID": "post75295729", "replies": [{"text": "You can do it for $15-17 yourself (baterry + some tools), there is a very helpfull and simple video instruction how to take the back and battery off in 2-3 minutes...", "time": "22nd February 2018, 01:02 PM", "postID": "post75656610", "replies": [{"text": "The problem is where to find OEM battery...", "time": "19th March 2018, 06:06 PM", "postID": "post75945422", "replies": []}]}]}, {"text": "I'm also noticing a severe degradation in battery performance. Barely able to get a full day, even only on standby. I think it's an issue with the stock rom though as if you leave it long enough that it goes into a deep sleep it lasts much longer", "time": "3rd April 2018, 09:40 PM", "postID": "post76113927", "replies": []}]}, {"title": "Standby drain", "rating": 3.5, "links": ["https://forum.xda-developers.com/oneplus-3/review/standby-drain-t3400059", "https://forum.xda-developers.com/oneplus-3/review/standby-drain-t3400059/page2", "https://forum.xda-developers.com/oneplus-3/review/standby-drain-t3400059/page3", "https://forum.xda-developers.com/oneplus-3/review/standby-drain-t3400059/page25"], "threads": [{"text": "2% drain overnight from 93 to 91%. Wifi/Sync on", "time": "17th June 2016, 02:39 AM", "postID": "post67354083", "replies": [{"text": "about the same, very minimal drain, if any.", "time": "19th June 2016, 01:42 PM", "postID": "post67389107", "replies": []}]}, {"text": "How much sot do u guys get?", "time": "17th June 2016, 04:18 AM", "postID": "post67354769", "replies": []}, {"text": "3 hours.", "time": "17th June 2016, 05:30 AM", "postID": "post67355252", "replies": [{"text": "Usage?", "time": "17th June 2016, 06:50 AM", "postID": "post67355910", "replies": [{"text": "SOT", "time": "17th June 2016, 07:20 AM", "postID": "post67356186", "replies": []}]}]}, {"text": "Got more standby drain this night. Around 10-15%.", "time": "17th June 2016, 05:17 PM", "postID": "post67363281", "replies": []}, {"text": "Lost 2% (88-86) overnight", "time": "19th June 2016, 01:27 PM", "postID": "post67388921", "replies": []}, {"text": "I'm having the Android System drain. Phone is continuously awake. I just cannot figure out what's causing it. Tried everything from factory reset to discharging the battery completely. The CPU just doesn't sleep.\n\nAny suggestion?", "time": "19th June 2016, 06:42 PM", "postID": "post67393027", "replies": []}, {"text": "Losing about 8% over night \n\nWiFi/Sync/Bluetooth On (connected to my smartwatch)", "time": "19th June 2016, 08:03 PM", "postID": "post67394096", "replies": []}, {"text": "I lose 2-3% over night.", "time": "20th June 2016, 11:11 AM", "postID": "post67402080", "replies": []}, {"text": "Battery life is poor over here lol", "time": "20th June 2016, 11:15 AM", "postID": "post67402123", "replies": []}, {"text": "Deleted...", "time": "21st June 2016, 04:58 AM", "postID": "post67414179", "replies": []}, {"text": "i lost about 3% in 6hrs", "time": "21st June 2016, 05:26 AM", "postID": "post67414371", "replies": []}, {"text": "I see 5-6% drain overnight(6-7 hours). Wifi/mobile data/bluetooth/location off and only the network signal is ON. Sync and backup are disabled on my phone.\nFor first 2 days it was 10% overnight, for one night it was merely 2% and now its constantly 5-6%. Not that its huge but I would have preferred a 1-3% range here especially when all my network activity (except mobile signals which are required for a mobile phone to be relevant) is off.", "time": "21st June 2016, 08:50 AM", "postID": "post67416239", "replies": []}, {"text": "Got my device yesterday only...around 9o clock charged 100% ..now it's 2.28 pm and battery is 68% ...usage: music games social site notifications etc.... so 32% drain in 5.5hrs ..plz guys advice by seeing this on the battery performance....", "time": "21st June 2016, 09:59 AM", "postID": "post67416956", "replies": [{"text": "Post screenshots of your battery stats and graph.", "time": "21st June 2016, 11:02 AM", "postID": "post67417629", "replies": []}]}, {"text": "My first night with the device and I had 2% drain over 6 hours.", "time": "21st June 2016, 01:57 PM", "postID": "post67419699", "replies": []}, {"text": "Okh I will post screenshots ..but but where to get graphs...one more thing after playing games for say 15 mins or say\nPlaying music..device gets heated up...badly...kindly suggest some solutions..coz itz not expected...also battery draining a bit too much I thnk", "time": "21st June 2016, 03:57 PM", "postID": "post67421477", "replies": []}, {"text": "Also having massive drain by Android System and Google Play Services.\n\r\nIt keeps getting hot in pocket and burning through battery. Sometimes when I take it out the screen is on.\nGestures are all off\nSmart unlock is off\nInactivity display and knock to turn on are off\n\r\nNot touching fingerprint sensor (even when touching it with leg it should just vibrate and not turn on screen).\r\nWhen looking into the battery, it's Android System and Google Play services. As well, WiFi is constantly on and the phone active way more than it should.\n\r\nDoes anyone else have it or is there a fix? This is seriously annoying  especially since Android System and Google Play can be anything. I noticed it ONLY happens when the phone is NOT on WiFi...\n\r\nCan't attach images as my account is too new..\n\r\nimgur.com/a/NFP2N", "time": "21st June 2016, 08:53 PM", "postID": "post67425564", "replies": []}, {"text": "Hope u have enabled the dark mode since it have done ...I'm seeing that my battery drain is somewhat limited...but again the real test will be when I'm in office n on 4g ....den let's see how's is the battery is will post pics of it", "time": "21st June 2016, 08:58 PM", "postID": "post67425632", "replies": []}, {"text": "50%...pretty moderate use, some gaming (candy crush, lol). Been unplugged for 17 hours! Also, even with moderate use, most of the day with a weak network signal. That is very good! I do have greenify fully configured, which does make a world of difference. Even as a brand new battery/phone, this is crazy sweet battery life. \n\n*Notice the screen on and awake times....that is the power of Doze, with the helping of Greenify! Very nice job of marshmallow keeping apps in a true hibernation state.", "time": "22nd June 2016, 05:54 AM", "postID": "post67430331", "replies": []}, {"text": "I am getting almost zero drain overnight. Great phone so far.", "time": "27th June 2016, 12:07 AM", "postID": "post67496621", "replies": []}, {"text": "I always have a battery drain of 8-10% overnight. To much!", "time": "27th June 2016, 12:38 AM", "postID": "post67496841", "replies": []}, {"text": "I have some drain sometimes from Cell data when signal is weak. T-Mobile USA does not have the best signal but hopefully this will be improved with software in future. SO far very happy with the phone. As for phone getting hot I had problems with fingerprint sensor touching being activated in my pocket touching my skin (i dont have torn pockets but it reacts even then). I just flipped the phone so that screen will wont face my leg and problem sorted.", "time": "27th June 2016, 01:49 AM", "postID": "post67497289", "replies": []}, {"text": "my phone drains 15-25% of battery overnight for no matter. I'm completely stocked and updated at the moment (5 June 2017). Isn't doze mode should be able to save battery when I sleep. I don't have many apps which are NOT in \"optimized\" state for battery usage in settings, even my truecaller is set-as optimized, only two exceptions are 'Download Manager' & 'Google Play Services'. These 2 apps are there by default and cannot be \"optimized\"", "time": "5th June 2017, 01:21 PM", "postID": "post72556321", "replies": []}, {"text": "Got 1-2 % drain overnight ( ~8 hours) with a clean installed crDroidAndroid 7.1.2_v3.3.", "time": "5th June 2017, 03:34 PM", "postID": "post72557769", "replies": []}, {"text": "Ik got from 97 to 47% in 7 hours.", "time": "6th June 2017, 02:04 PM", "postID": "post72568954", "replies": []}]}, {"title": "Heavy use endurance", "rating": 3.5, "links": ["https://forum.xda-developers.com/oneplus-3/review/heavy-endurance-t3400060"], "threads": [{"text": "poor  very poor...", "time": "15th July 2016, 04:36 PM", "postID": "post67758610", "replies": []}, {"text": "At Home.\r\nPlayed Videos HD for about 4 hours straight with sound mods such as V4A and brightness set to 75%. Wifi On and bluetooth on with GPS (high accuracy) and SIM On.\r\nPlayed heavy games such as Implosion for 20 mins and medium games .\r\nWas Browsing in between on Chrome Dev for like 45 mins and streamed Youtube in between for about 30 mins HD.\r\nLast of All SOT at 5 hours 55 mins.\r\nI am happy..!\n\r\nOneplus 3 on OOS 3.2.1 systemless root and xposed with Divine Beats sound mod.", "time": "16th July 2016, 03:26 PM", "postID": "post67771076", "replies": []}, {"text": "Pretty good, not incerdible. Between 4h and 5h and heavy usage (Pokémon GO lol)", "time": "25th July 2016, 08:56 PM", "postID": "post67901539", "replies": []}, {"text": "More than acceptable. I'm not a gamer but watch a lot of videos and have never had that annoying feeling where you look up and it's at 8%. Standby time is more important to me and that's excellent too.", "time": "14th November 2016, 09:50 PM", "postID": "post69622441", "replies": []}]}, {"title": "Light use endurance", "rating": 4.0, "links": ["https://forum.xda-developers.com/oneplus-3/review/light-endurance-t3400061"], "threads": [{"text": "I've had the phone a couple of weeks now and I'm just hitting the 72 hour mark since my last charge with 10% remaining. \n\r\nI've had Bluetooth audio on for 2 hours and have an SOT of 1 hour over the course of a weekend. As I'm using 2 sim cards and have poor signal in my flat, I'm really happy with the light endurance. \n\r\nIf I want more, I can install Greenify and aim to beat my LG G2's record of 103h with 2h SOT. I don't think I will go down that road as I love leaving all my apps open in RAM to have 0 launch time.", "time": "31st October 2016, 12:06 PM", "postID": "post69390350", "replies": []}, {"text": "Just got nearly 4 days of battery. \n\r\nOnly 1.5h of SOT but as a light user, I'm not complaining.", "time": "4th November 2016, 11:56 AM", "postID": "post69455846", "replies": []}, {"text": "Over 5 hours of sot not bad", "time": "12th June 2017, 06:07 PM", "postID": "post72645965", "replies": []}]}, {"title": "\"Look\" of the device (aesthetics)", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-3/review/look-device-aesthetics-t3400062", "https://forum.xda-developers.com/oneplus-3/review/look-device-aesthetics-t3400062/page2"], "threads": [{"text": "just got mine, its beautiful. great feel and a mix of a galaxy and htc.", "time": "17th June 2016, 08:02 PM", "postID": "post67365574", "replies": []}, {"text": "Phone looks as premium as any other phone. Very quality look all around. It is surprisingly skinny, which I like a lot, and does resemble an HTC 10 or G5. Still, an amazing build. I will have a case on it, so it's really no big deal what it looks like. Lol", "time": "18th June 2016, 12:21 AM", "postID": "post67368382", "replies": []}, {"text": "I like it a lot. Feels like an iPhone 6S plus an HTC had an affair and this is the bastard child lol. Love it.\n\nSent From My OnePlus 3", "time": "24th June 2016, 06:41 PM", "postID": "post67467687", "replies": [{"text": "very well said it!!", "time": "27th August 2016, 01:09 AM", "postID": "post68386790", "replies": []}]}, {"text": "Premium design and quality, bad protruding camera.", "time": "9th July 2016, 04:29 PM", "postID": "post67671527", "replies": []}, {"text": "I definitely agree - the phone does have very premium looks. Of course, somebody could say that the current Galaxy models are easily a class above this phone in looks. But, in and of itself, the OP3 is quite satisfying to look at. And, compared to others in its price range, it definitely holds it own. Overall, I would definitely give this a thumbs up in the looks department.", "time": "22nd August 2016, 07:24 AM", "postID": "post68301956", "replies": [{"text": "Metal>glass. It may not be as premium as the s7 edge, but it definitely is more premium than the standard s7 in looks", "time": "25th August 2016, 06:56 PM", "postID": "post68364628", "replies": []}]}, {"text": "All metal body, nice finish. Only qualms are the camera bump. Also because it is so thin and sleek it is quite slippery leading to usage of a case (sigh). But the phone looks very premium. I just don't get to show it lol", "time": "26th August 2016, 01:57 PM", "postID": "post68377412", "replies": []}, {"text": "the phone is extremely pleasing and premium to hold and look at. the only issue i personally feel is slippery ness of the device but i feel the same about pretty much every metal body phones. It's extremely well crafted as well. just love the plain beauty of this device.", "time": "27th August 2016, 07:02 AM", "postID": "post68389650", "replies": []}, {"text": "Beautiful, but 'tis a slippery beast.", "time": "15th September 2016, 01:51 AM", "postID": "post68693099", "replies": []}, {"text": "Oneplus 3 is love 😍❤", "time": "17th September 2016, 08:04 AM", "postID": "post68727220", "replies": []}, {"text": "Its definitely premium looking phone. For some reason I like the antenna bands wich most people seem to dislike. At least with the iPhone. They make the back a bit less boring looking. Although wish they had proper styleswap covers like in OPO and OP2. \n\r\nI kind of dislike how the camera is big and bulky and has kind of a contrast against the thin metal body of the phone. In my opinion it doesnt fit that well. It isnt a deal breaker for me of course, I can always put a case.", "time": "17th September 2016, 05:19 PM", "postID": "post68733690", "replies": []}, {"text": "+ All elements (speakers, buttons, SIM tray, microphone, etc) are in line\n+ Good home button shape\n+ Good detailing on the alert slider\n+ Simple black bezel, not like those old tacky Samsung phones\n+ Subtle chamfers\n\n- Corners rounded with horizontal bias. WHY?\n- The squircle camera shape\n- The antenna lines are asymmetrical: not the same distance from the top/bottom of the phone\n- The middle antenna line is thinner than the other two\n- Both antenna lines are too close to the top/bottom of the phone \n- The top and bottom bezels are not the same length\n\nOverall, the OP3 is the most generic looking phone of 2016: pseudo-premium aluminium build, imperfect design and nothing crazy. It seems like OnePlus tried to make the phone look different by changing small things like the corner rounding and the slant of the top and bottom sides but to me it just makes the phone look worse. It doesn't look as matured, sophisticated or refined as the Note7, 10 or XZ but it's not an visual disaster like the G5 or the old Galaxy S3.", "time": "29th October 2016, 11:21 PM", "postID": "post69368773", "replies": [{"text": "I agree with some of what you said. I recently purchased the gold (white face) OnePlus 3, and it's really a thing to look at. Really nice looking phone, with some inspiration from Apple and Samsung, as well as HTC. The phone's design is nothing extra special I agree, but I wouldn't call it generic.  That's being a tad picky. Every company has their style and OnePlus' is quite subtle. The reviews on xda forums are what I looked at as a customer before I purchased this phone. To anyone out there contemplating buying this phone, you won't be disappointed in the design. It's good. Durable and strong. The camera bump on the back protrudes a bit and the sides are kind of sharp (like the galaxy s6 edge), but I use a case so it's not bothersome at all ( I even remove the case sometimes to get a feel of that sexy beast directly in my hand).", "time": "30th October 2016, 04:12 AM", "postID": "post69371038", "replies": []}]}, {"text": "I wanted HTC 10, but i got OnePlus 3 for 300 euro, almost new.\nMetal case it's very nice, good build. I like the most, the square corners. For example HTC 10 it's very rounded on corners .\nI like the phone because it's slim. It's a little big for pocket, but with 5,5\" screen, that's it. Weight it's normal for a big phone with a metal case.\nIt is a Premium phone with Good Price!\nI'm very pleased about it.", "time": "30th October 2016, 06:39 AM", "postID": "post69372110", "replies": []}, {"text": "I love the looks so much. The back kind of reminds me of the iPhone 6 / 6S. Build quality is really surprising too considering the price imo.", "time": "14th November 2016, 09:59 PM", "postID": "post69622588", "replies": []}, {"text": "Love the sleek body. \nI get annoyed when someone hands me over a Samsung or Moto\n\nBut the camera bump is a bit of a problem too.", "time": "5th February 2017, 11:31 AM", "postID": "post70887857", "replies": []}, {"text": "with the oneplus cover sandstone it looks awesome because the bump on the camera is annoying without it", "time": "12th February 2017, 07:46 PM", "postID": "post71001849", "replies": []}]}, {"title": "Quality feel (use of materials)", "rating": 5.0, "links": ["https://forum.xda-developers.com/oneplus-3/review/quality-feel-materials-t3400063", "https://forum.xda-developers.com/oneplus-3/review/quality-feel-materials-t3400063/page2", "https://forum.xda-developers.com/oneplus-3/review/quality-feel-materials-t3400063/page3"], "threads": [{"text": "Stress test videos are out.\n\nhttps://youtu.be/8PZ8W_g6Vvk\n\n#shameonhuawei", "time": "21st June 2016, 03:36 AM", "postID": "post67413617", "replies": []}, {"text": "thanks for the video", "time": "21st June 2016, 05:37 AM", "postID": "post67414445", "replies": []}, {"text": "very good result!\n\ncongratulations on this, OnePlus!", "time": "21st June 2016, 08:29 AM", "postID": "post67416012", "replies": []}, {"text": "I think I prefered the sandstone black, but getting a dBrand skin now so :P", "time": "29th June 2016, 06:27 PM", "postID": "post67535636", "replies": []}, {"text": "Love the look and feel of this phone. The build quality is top notch and right up there with the bigger companies handsets. Got the rosewood/Kevlar case for it as well which imo makes the phone feel way better in hand, more grip and slightly thicker sides make it easy to handle I find.", "time": "29th June 2016, 06:57 PM", "postID": "post67536090", "replies": []}, {"text": "Only had this phone a week and there are sooo many hairline and mega scratches on my screen. I decided that this would be my first no screen protector phone and I really regret it. I baby my phone so much but i guess the GG4 isn't that scratch resistant.", "time": "10th July 2016, 03:10 AM", "postID": "post67677580", "replies": []}, {"text": "I dropped mine today. Face down onto concrete.\n\nNot a mark on it!! The Black Apricot cover had a few marks on it on the corners but it did its job and because of the wood grain finish it's only noticeable under close examination.\n\nHave ordered a new case though and my old one is on eBay UK. 99p reserve if you want to search for a bargain  \n\nMods. Delete the link if this is against the rules? http://www.ebay.co.uk/itm/252462114972", "time": "15th July 2016, 02:18 PM", "postID": "post67756851", "replies": []}, {"text": "I think the quality is very good.  It feels like an expensive phone. \n\nGesendet von meinem ONEPLUS A3003 mit Tapatalk", "time": "3rd August 2016, 09:50 PM", "postID": "post68031767", "replies": []}, {"text": "Honestly, one of the most underrated features is the ceramic home/fingerprint reader.\n\nMy friend's much more expensive S7 has a plastic button that already has scratches on it and feels very cheap vs ceramic.", "time": "4th August 2016, 12:57 AM", "postID": "post68033545", "replies": []}, {"text": "The build quality of the screen is poor, very poor.\r\n2 days ago my OP3 slipped from my pocket when I was sitting in my car when opening the door. It felt on the asphalt from not more then 60cm / 23,5 inch on its back, and the display was totally cracked over the hole surface. My other phones like Sony Experia ZL, HTC One M8, Samsung S6 Edge have felt very often on the floor and never had any problems. Except for my Galaxy S6 Edge, that felt from the 1st floor, hitting multiple steps to end on the tiled floor .  But even then the damage was a lot less then what I experienced on my OP3. It had just some cracks on the side.\n\r\nThe damage I got on the OP3 after such a little hit is inacceptable for Gorilla Glass 4. Or there is an error in the production process that causes the glass not to be as strong as it should be, or it isn't Gorilla Glass 4.\r\nMy Samsung S6 Edge has also Gorilla Glass 4 and the kind of damage and cracks are not the same structure as the one on the OP3.\n\r\nPS. I will try to upload later today an image of the broken OP3 display.", "time": "18th August 2016, 12:43 PM", "postID": "post68245193", "replies": []}, {"text": "I just got this phone today. I am really loving the look and feel of this phone. It is quite slim and lightweight, which makes it feel quite delicate but in a good way (not in the fragile sense).", "time": "19th August 2016, 10:05 AM", "postID": "post68259346", "replies": []}, {"text": "A faulty (batch of) screen(s) could be possible since multiple persons are complaining that there screen has broken to easily.\nBut in that case OnePlus should do something for its customers. Because now I lost all confidence in the build quality of the display.", "time": "19th August 2016, 11:23 AM", "postID": "post68260111", "replies": [{"text": "If that's really what you're bitching about, you should take it up with OnePlus or Samsung as Samsung makes almost all AMOLED displays on the market.", "time": "19th August 2016, 02:01 PM", "postID": "post68261884", "replies": [{"text": "Look this is a topic about the build quality of the OP3.  If you like it or not,  but my experience is that the display is to fragile for Gorilla Glass 4,  and I'm not alone to experience this. \n\nIt's not my job to take it up with Samsung or even Corning.  That's the role of OnePlus. \n\nAnd yes I will open a support ticket.  But we all know this will probably have no impact. \nSo some or maybe all OP3, have a fragile display. \n\nVerstuurd vanaf mijn ONEPLUS A3003 met Tapatalk", "time": "19th August 2016, 02:17 PM", "postID": "post68262113", "replies": [{"text": "*drops phone no case* complains online about how bad the quality is. Much logic.", "time": "19th August 2016, 02:19 PM", "postID": "post68262150", "replies": [{"text": "Look man laugh as much as you want.  I had a lot of phones and none were fragile.  They even didn't have Gorilla Glass 4. For me the endurance of this screen is ****. And yes I have the right \nTo write down my experience and my feelings about it.  You can call it complaining online.  If that makes you happy. \nWe will see the day your screen breaks after a hit from 1feet high. \n\nI have tested the display of my S6 edge by hitting it multiple time on the corner of the table.  I needed 11 attempts to Crack the display that already had some damage on the side.  And the force I needed to break it was enormous \n\nVerstuurd vanaf mijn ONEPLUS A3003 met Tapatalk", "time": "19th August 2016, 02:26 PM", "postID": "post68262229", "replies": []}]}]}]}]}, {"text": "damm you sure are careless for dropping phones so many times", "time": "19th August 2016, 05:45 PM", "postID": "post68265258", "replies": []}, {"text": "I like the cold feeling the metal brings in the morning", "time": "12th June 2017, 06:04 PM", "postID": "post72645925", "replies": []}, {"text": "Asuhar", "time": "27th January 2018, 08:10 AM", "postID": "post75347779", "replies": []}]}, {"title": "Ergonomics (in-hand feel)", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-3/review/ergonomics-hand-feel-t3400064", "https://forum.xda-developers.com/oneplus-3/review/ergonomics-hand-feel-t3400064/page2"], "threads": [{"text": "It's a little bigger than I expected.It's thin and feels good both in hand and  in my pocket.", "time": "17th June 2016, 02:33 AM", "postID": "post67354023", "replies": []}, {"text": "is it slippery without any case?", "time": "17th June 2016, 09:31 AM", "postID": "post67357426", "replies": [{"text": "Definitely. I've had a couple of scary moments already where it almost slipped out. But you get used to it.", "time": "17th June 2016, 11:41 AM", "postID": "post67358768", "replies": []}]}, {"text": "so, I'll have to order some dbrand for it, at least... thx.", "time": "17th June 2016, 11:44 AM", "postID": "post67358808", "replies": []}, {"text": "good size and good weight, it feels good in the hand, just that the screen is very close to the edge, I still have not used.\n\r\na word on the power button, too sensitive for my taste", "time": "26th June 2016, 06:50 PM", "postID": "post67493400", "replies": []}, {"text": "i agree its light and thin, but it is slippery and i have also had a few scares too, i am going to get a dbrand skin and hopefully that will help", "time": "26th June 2016, 06:56 PM", "postID": "post67493492", "replies": []}, {"text": "Too big and slippery, but feels great. I'm gonna buy a case though", "time": "25th July 2016, 09:00 PM", "postID": "post67901583", "replies": []}, {"text": "It is relatively comfortable with 2 hands. But one hand operation is a little tricky. Especially when pressing the hardware buttons.", "time": "29th July 2016, 09:09 AM", "postID": "post67952072", "replies": []}, {"text": "that's what she said", "time": "29th July 2016, 10:25 AM", "postID": "post67952759", "replies": []}, {"text": "it feels comfortable...a bit slippery, but i use this:\nhttp://de.aliexpress.com/item/10pcs-...08.0.68.oJxzZY\nit's fine for me", "time": "29th July 2016, 11:12 AM", "postID": "post67953188", "replies": []}, {"text": "feels good in hand but its definitely slippery at times.", "time": "29th July 2016, 05:25 PM", "postID": "post67957548", "replies": []}, {"text": "A little bit slippery but I use always a case to protect the phone and so it is OK for me. \n\nGesendet von meinem ONEPLUS A3003 mit Tapatalk", "time": "3rd August 2016, 09:46 PM", "postID": "post68031708", "replies": []}, {"text": "Overall, it feels quite good in your hand - quite lightweight and comfortable. In regular use though, you may find it somewhat slippery. Also, using the phone may require both hands at times. Single hand use is difficult some of the time. It reminded me a little bit of the LG G3 in terms of the feel and usage - though I had a leather back on my G3 (so it wasn't slippery at all).", "time": "22nd August 2016, 07:58 AM", "postID": "post68302216", "replies": []}, {"text": "I would've liked a slightly rounded back better, less slippery.", "time": "15th September 2016, 01:51 AM", "postID": "post68693095", "replies": []}]}, {"title": "OEM skin/software", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-3/review/oem-skin-software-t3400065"], "threads": [{"text": "I keep telling people that the only thing better than stock Android is OxygenOS. It has a small handful of helpful features, like button customization and dark mode, to make using the phone more pleasureable than even a Nexus.", "time": "20th June 2016, 02:31 PM", "postID": "post67404527", "replies": []}, {"text": "For me stock Android is the worst. Zero personalization. Oxygen OS has some tweaks but this is still not enough. I've flashed Ressurection Remix on the first day", "time": "13th July 2016, 06:03 PM", "postID": "post67730208", "replies": []}, {"text": "More customisation than stock Android, but less than CM. Love Oxygen OS !", "time": "25th July 2016, 09:01 PM", "postID": "post67901601", "replies": []}, {"text": "It's truly the bee's knees.  Wholeheartedly agree with @svetius.  Much better to use than a Nexus.  Love the gestures and button customization.", "time": "3rd August 2016, 09:01 PM", "postID": "post68031213", "replies": []}, {"text": "I'm really happy about software, I would like a screenshot gesture like my previous zenfone 2 ... that's it", "time": "4th August 2016, 10:48 PM", "postID": "post68046846", "replies": []}]}, {"title": "Outdoor visibility (max brightness)", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-3/review/outdoor-visibility-max-brightness-t3400066", "https://forum.xda-developers.com/oneplus-3/review/outdoor-visibility-max-brightness-t3400066/page2"], "threads": [{"text": "Any comments on how is the screen brightness for outdoor? I'm using Droid Turbo right now and I must say that it is really bad in screen brightness, so I guess OP3 would be an upgrade for me in this department. lol...", "time": "28th June 2016, 04:28 AM", "postID": "post67512105", "replies": []}, {"text": "Oneplus 3 has just an average outdoor visibility. Compared to Oneplus 2, I'd say, about 30% dimmer.", "time": "28th June 2016, 04:58 AM", "postID": "post67512316", "replies": []}, {"text": "I've tried many devices, had iPhone 6s and 6s plus, Nexus 5x and 6p, Samsung Galaxy s7 Edge and s7 and HTC 10. I'm not a fanboy of one over the other.\n\nI have always really been attracted to OnePlus for their vision and direction. Loved the OPO, like the OP2 but really wanted NFC as I use apple pay and Android pay frequently and was thrilled to see the announcement of the OP3.\n\nWith all that said, my take on the display. OnePlus 3s display is pretty good and while it is dimmer than the Galaxy s7 and even the HTC 10 (at least in direct sunlight), there isnt a phone I have used that is excellent under direct sunlight. Would I like it a little brighter, sure but under normal usage, I'd say it's on par with definitely my iPhone 6s and my Nexus 5x. The others with their qhd displays are a bit more brighter and vibrant but battery usage was significantly worse for me than the OP3 and for that I am thrilled as this provides really good screen on time.", "time": "2nd July 2016, 01:01 PM", "postID": "post67572465", "replies": [{"text": "http://forum.xda-developers.com/onep...t3411633/page1\nFollow this thread hope it helps you.", "time": "6th July 2016, 11:30 PM", "postID": "post67634908", "replies": []}]}, {"text": "Is it just me, or does the brightness level barely change while in the 20-100% zone and drops dramatically when sliding down from like 5% to 0? Seems like 80% of the brightness level hides in the first millimeters of the slider.", "time": "12th July 2016, 03:09 PM", "postID": "post67712610", "replies": []}, {"text": "Outdoor visibility is on acceptable level.", "time": "13th July 2016, 06:17 PM", "postID": "post67730377", "replies": []}, {"text": "No visibility problem in sunlight.", "time": "23rd July 2016, 11:49 PM", "postID": "post67876271", "replies": []}, {"text": "I made a bicycle tour this week, and I could read the display OK in bright sunlight. Of course when snapping photos one can't discern details or whether it's really in focus etc., but that's not necessary! All photos ended up perfectly OK and in focus.", "time": "24th July 2016, 09:27 AM", "postID": "post67880268", "replies": []}, {"text": "https://www.youtube.com/watch?v=Ch__nNH6ny0\n\nPlaying a lot of PoGo these days and switched from a Oneplus One. Its a huge improvement over the One and has an excellent screen reading in direct sunlight compared to other devices I had.", "time": "24th July 2016, 10:30 AM", "postID": "post67880824", "replies": [{"text": "Nice video thanks for sharing.", "time": "25th July 2016, 09:04 PM", "postID": "post67901622", "replies": []}]}, {"text": "Visibility is good compared to the OnePlusOne. But the visibility is decreasing because the number of visible scratches on the Display is increasing every week. I do not know why this happens, none of my earlier smartphones had scratches (most of them were Nexus devices), but the OnePlus three has many.", "time": "21st December 2016, 04:02 PM", "postID": "post70194294", "replies": []}]}, {"title": "Contrast (true blacks)", "rating": 4.0, "links": ["https://forum.xda-developers.com/oneplus-3/review/contrast-true-blacks-t3400067"], "threads": [{"text": "Love the black on AMOLED displays. Every pixel has its own backlight, so when it display black, the backlight is basically off, which result in a true black and very high contrast.", "time": "25th July 2016, 09:08 PM", "postID": "post67901672", "replies": []}, {"text": "Amoleds have true black. Pixels don't turn on if the 'colour' displayed is true black.\n\nAny deviations are down to screen filters and glass used. \n\nIf a display has a gap between glass and amoled top layer some 'ghosting' can potentially occur if bright scenes mix with dark ones. This could have the effect of making certain parts of a screen appear slightly grey.", "time": "26th July 2016, 08:23 AM", "postID": "post67907156", "replies": []}]}, {"title": "Color saturation & accuracy", "rating": 3.5, "links": ["https://forum.xda-developers.com/oneplus-3/review/color-saturation-accuracy-t3400068", "https://forum.xda-developers.com/oneplus-3/review/color-saturation-accuracy-t3400068/page2", "https://forum.xda-developers.com/oneplus-3/review/color-saturation-accuracy-t3400068/page3", "https://forum.xda-developers.com/oneplus-3/review/color-saturation-accuracy-t3400068/page9"], "threads": [{"text": "having come from xiaomi mi3 , i am a bit disappointed. find the colour bit oversaturated. can i change any settings?", "time": "17th June 2016, 05:46 PM", "postID": "post67363717", "replies": [{"text": "You can change the white balance, but that's about it. You should be happy because most other amoled screens are painfully oversaturated. I feel this is just the right amount.", "time": "17th June 2016, 06:30 PM", "postID": "post67364368", "replies": [{"text": "I agree. Most AMOLED screens, like Sammy's, are way too rich in color. This is the first display I've seen to hit it just on the mark. I prefer a little washed out/natural display, in terms of color balance. This phone has an excellent color pallete.", "time": "18th June 2016, 04:10 PM", "postID": "post67377085", "replies": [{"text": "[/COLOR]\n\r\nYes, it's the best amoled!\n\n(personal opinion)", "time": "20th June 2016, 07:08 PM", "postID": "post67408413", "replies": [{"text": "Anandtech said this phone has the worst display they've ever reviewed.", "time": "20th June 2016, 08:53 PM", "postID": "post67409921", "replies": [{"text": "(personal opinion)", "time": "20th June 2016, 09:44 PM", "postID": "post67410530", "replies": [{"text": "Your personal opinion is invalid. The colours are as wrong as they can be.", "time": "20th June 2016, 10:07 PM", "postID": "post67410823", "replies": []}, {"text": "No. As per measurement.", "time": "20th June 2016, 10:49 PM", "postID": "post67411295", "replies": []}]}]}]}]}]}]}, {"text": "I dont know but does it look accuracy as LCD?I mean all amoled screen are pinky", "time": "18th June 2016, 04:01 PM", "postID": "post67376966", "replies": []}, {"text": "This phone was way way better whites than the Note 4 and 6P I had before. \n\nHowever at low brightness Greys appear greenish. Very noticeable.", "time": "20th June 2016, 04:18 PM", "postID": "post67406010", "replies": []}, {"text": "Unfortunately my Oneplus 3 has an unevenness in color display!\n\nIn the upper part of the screen, the colors become a bit more reddish, while in the lower part the tint becomes a bit more greenish.\nThis especially can be seen when turning brightness down.\nOnce seen, this can't be unseen and makes me very much think of returning the unit!\n\nIs there anything else who has different hues in different parts of the screen?", "time": "21st June 2016, 07:05 AM", "postID": "post67415156", "replies": []}, {"text": "I don't like the blueish colours, oversaturation and small text rendering on my OP3.\r\nEven colour temperature setting can't fully fix the blueish colours", "time": "21st June 2016, 08:57 AM", "postID": "post67416314", "replies": []}, {"text": "Not sure why a lot of people are having issues with their contrast and saturation. My display is perfect. Blues are completely accurate, as well as every other color. This is hands down the best display I have seen. I love it. Blows Sammy's over exuberant color pallet away. This is all I did to adjust the display...", "time": "22nd June 2016, 02:22 AM", "postID": "post67428663", "replies": []}, {"text": "I had the Nexus 6P and that AMOLED is probably the best calibrated display and much sharper than OP3.  I don't think it's a huge deal breaker here since the phone is so much faster, easier to hold and use.  I really wanted to like the 6P but it just didn't have enough customizations even though custom roms are plenty.", "time": "22nd June 2016, 09:43 PM", "postID": "post67441383", "replies": []}, {"text": "I love the display. Its so much better than on the 1+1. Those blacks and colors.", "time": "22nd June 2016, 10:13 PM", "postID": "post67441728", "replies": []}, {"text": "I'm a very picky user for most everything on my phone. I have extreme ocd. I believe everyone's screen is different. My display in my OP3 is better than my S6 and my S4 as well as my honor 5x and Nexus 6p. It may also be preference because as I do love amoleds, this one is a bit duller than usual samoleds but more accurate. I have no color transitions no color issues at all. I have my white balance bar about 88% up to max. Personally, to me its looking excellent. Everyone's screen must differ.", "time": "23rd June 2016, 12:31 AM", "postID": "post67443016", "replies": []}, {"text": "When in landscape orientation, text looks a little blurry and not like how a 1080p panel should be. \nMy DPI is set to 420. \n\nShould I get a replacement? Considering I also have the problem of green hue on greys at low brightness.?", "time": "23rd June 2016, 01:59 PM", "postID": "post67450152", "replies": []}, {"text": "I read there is an update to fix color rendition, has anyone tried it? Any major difference? Im a photographer, I carefully calibrated my screens to render accurately, if the phone colors are way off that will be a huge disadvantage...", "time": "26th June 2016, 07:20 AM", "postID": "post67486380", "replies": []}, {"text": "To me the OP3 has, like the reviewer on anandtech said, the worst display, ive ever seen...", "time": "26th June 2016, 10:00 AM", "postID": "post67487662", "replies": [{"text": "Wow. Are you color sensitive or something? Don't understand your reasoning honestly", "time": "27th June 2016, 12:30 AM", "postID": "post67496792", "replies": [{"text": "Well, im coming from a perfectly sRGB calibrated qHD IPS-Panel and went to a poorly calibrated hd samoled panel... I knew it was worse, but didnt expect that much of a difference", "time": "27th June 2016, 06:28 AM", "postID": "post67499060", "replies": [{"text": "Which phone? And ips, really? I understand that amoled, especially Samsung amoled, are definitely different. But this phone has the most accurate pallet IMO.", "time": "27th June 2016, 06:32 AM", "postID": "post67499089", "replies": []}]}]}]}, {"text": "The panel is just fine! It's the calibration that is messed up! And these things can't be a \"my opinion\" thing. In any case, after the new update, I know that sRGB is included but is there a technical measurement redone result by Anand or anyone else? Would love to look at it.", "time": "27th June 2016, 09:03 PM", "postID": "post67508429", "replies": [{"text": "Yes! And it is very positive.\n\nhttp://www.anandtech.com/show/10445/...-the-oneplus-3", "time": "1st July 2016, 09:36 AM", "postID": "post67557431", "replies": []}]}, {"text": "Coming from a nexus 5x the colors look good to me.", "time": "28th June 2016, 12:56 AM", "postID": "post67510650", "replies": []}, {"text": "The colors are, yes, highly oversaturated. But there's a fix around the corner using the sRGB mode, if you like more normal colors.", "time": "28th June 2016, 05:01 AM", "postID": "post67512339", "replies": []}, {"text": "Did anyone try out the sRGB mode in the newest Update? How is the calibration?", "time": "29th June 2016, 10:43 AM", "postID": "post67529875", "replies": []}, {"text": "I tried to calibrate my display today with X-rite iDisplay Pro and HCFR. I managed to hit 6500K color temperature with even RGB levels. I used Kernel Adiutor to adjust RGB levels. Here are my settings: Red = 87, Green = 157, Blue = 256. I used 50% brightness level during calibration.\n\nEdit. Disregard these settings. I had two different softwares controlling the rgb values. No wonder the value for red was so low. I could not believe it. After one reboot I got the colors those settings represent and they are of course way too blue as I expected with these values.", "time": "29th January 2017, 08:04 PM", "postID": "post70789633", "replies": []}]}, {"title": "Clarity/resolution", "rating": 4.5, "links": ["https://forum.xda-developers.com/oneplus-3/review/clarity-resolution-t3400069", "https://forum.xda-developers.com/oneplus-3/review/clarity-resolution-t3400069/page2", "https://forum.xda-developers.com/oneplus-3/review/clarity-resolution-t3400069/page3", "https://forum.xda-developers.com/oneplus-3/review/clarity-resolution-t3400069/page5"], "threads": [{"text": "The display is definitely better than what weve had on the previous OnePlus phones. I did find the color saturation a bit weird coming from the LCD of the OnePlus One to the OAMOLED of the OP3, but it's a pretty beautiful display to look at.", "time": "17th June 2016, 11:45 AM", "postID": "post67358820", "replies": []}, {"text": "I haven't been able to compare with another AMOLED screen, but compared to my LG G3 at full brightness, the OnePlus 3 screen colours doesn't seem as vibrant as an AMOLED screen should be. One other thing is that I've been so used to QHD on the G3, I can really notice the drop back to HD. Nonetheless, the OnePlus 3 is bang for buck no matter which way you look at it.", "time": "17th June 2016, 01:23 PM", "postID": "post67360022", "replies": [{"text": "You notice because it has PenTile  arrangement, not because it's FHD.", "time": "20th June 2016, 10:37 PM", "postID": "post67411160", "replies": []}]}, {"text": "I just have one word. Gorgeous.", "time": "17th June 2016, 02:32 PM", "postID": "post67360933", "replies": []}, {"text": "The display is sharp enough, bright enough and the color saturation is good. And definetly better than previous OP screens", "time": "17th June 2016, 05:15 PM", "postID": "post67363258", "replies": []}, {"text": "I've gotten used to it now, the screen is still quite amazing on the OP3. Tbh, I've always found it funny how phone manufacturers are sucked into the res race given some of the drawbacks of pushing a larger amount of pixels.", "time": "22nd June 2016, 08:03 AM", "postID": "post67431472", "replies": []}, {"text": "I'm moving from my Moto X (2014) to OP3, and trust me the white balance is WAY off towards the blue end. I read a review which did display tests on both the AMOLEDs of X and OP3, and apart from the white balance, OP3 has a slightly better screen and/or screen calibration than the X (which is 2 years old). \nOverall I still find it blue after I switch from the X, but it's a beautiful screen nonetheless.", "time": "22nd June 2016, 02:33 PM", "postID": "post67435682", "replies": [{"text": "Just got mine, haven't even turned it on yet, but AFAIK (from reviews) white balance is adjustable in the settings. Play around with the slider if it looks too blueish to you.", "time": "22nd June 2016, 03:22 PM", "postID": "post67436363", "replies": [{"text": "Yep, thanks! Did that but forgot to mention. Though be careful when you change the slider, there's no reset option in case you want it as it came (not a biggie but a reset option would've been helpful).", "time": "22nd June 2016, 03:25 PM", "postID": "post67436398", "replies": []}]}]}, {"text": "Text on my phone looks blurry and more like a 720p screen, particularly visible in landscape. \nI've applied for a replacement. Let me see how that turns out to be.", "time": "23rd June 2016, 06:23 PM", "postID": "post67453696", "replies": []}, {"text": "I was very worried about the display when I have heard many saying that it is not sharp due to the pentile arrangement.\nJust got mine few hours ago, and here is my personal opinion:\nThe display looked sharp and crisp, the pentile matrix is hardly visible unless you look at the screen very closely, but under normal usage distance, the display is excellent.\nIt is true that true resolution on any pentile display is less than the ideal, and this artcile explains it: https://medium.com/@suyashsrijan/108...2ee#.w8v3hh7vz\nAccording to it, the effective resolution becomes 326ppi rather than 401ppi.\nFYI, resolution of iphone 6s is also 326ppi.", "time": "24th June 2016, 06:25 PM", "postID": "post67467478", "replies": []}, {"text": "To me the screen of OP3 is way better than the OP2. Everything just looks nice. My OP2 was calibrated with kcal and OP3 has similar calibration. Only the dark grey is a little on the blue/green side.", "time": "25th June 2016, 07:42 AM", "postID": "post67474051", "replies": []}, {"text": "Disappointed with pixelation caused by the PenTile matrix. Sure, the display is great (much more vibrant and brighter than my outgoing iPhone 6 Plus) but with my perfect near vision small text and edges of icons etc all appear slightly jagged. From a normal distance it's not too bothersome but I can always see it. The 1080p RGB matrix panel on the iPhone appears instantly sharper in comparison but I still wouldn't say its a match as the colour, contrast and brightness are all far better on the OP3.", "time": "12th July 2016, 04:28 PM", "postID": "post67713794", "replies": []}, {"text": "Resolution is too low for VR, but for everyday tasks is perfect.", "time": "13th July 2016, 06:19 PM", "postID": "post67730400", "replies": []}, {"text": "I am hesitating to buy a 1+3 device mainly for the mixed comments about screen/display quality.\nCan any owner of 1+3 post some pictures of any classical webpage (bbc, cnn, xda, ...) magnified gradually, up to the maximum (125%, 150%, ..., 300%, ..)?\nThanks", "time": "14th July 2016, 09:32 PM", "postID": "post67747793", "replies": []}, {"text": "Ive been using the G3, and i dont care what anyone says, there is a huge difference between 1080 and 1440. The text looks smudged. However I cant stream Youtube nor Anime at 720p or higher anywas so it wont matter for me.\r\nStill on the fence of buying it.", "time": "20th July 2016, 09:50 AM", "postID": "post67825248", "replies": [{"text": "If you don't like it's most visible part, then why consider buying it?", "time": "20th July 2016, 02:27 PM", "postID": "post67828225", "replies": [{"text": "Because it kicked the bucket 2 weeks ago. And nothing else really appeals to me on the market", "time": "20th July 2016, 02:44 PM", "postID": "post67828455", "replies": []}]}]}, {"text": "The screen thing is very overblown, if you ask me.  Is it as sharp as a 2k?  No.  If you stick it in a Cardboard viewer, or under a magnifying glass, you'll be less than satisfied.  But this screen is still VERY good.  I came from an LG G4 with a 2k display, and this display is nicer to look at, regardless of resolution or sub-pixel arrangement.  Don't let the spec sheet paper warriors, who rant about how inferior and crap it is without ever having owned or used one make your decisions for you.  \n\nIf you want the best display on the market, double down your cash and get a Galaxy S7.  If you want a phone that will outperform it in almost every other way though (excluding camera), the OP3 really is a tough one to beat.  (And if you're more into audio than photography, the Axon 7 is solid with amazing sound and a 2k AMOLED display that will be Daydream ready when the launch Nougat on it ... eventually.)", "time": "17th September 2016, 04:58 AM", "postID": "post68725873", "replies": []}, {"text": "Nothing to complain about the screen..", "time": "17th September 2016, 10:55 PM", "postID": "post68737865", "replies": []}, {"text": "Maybe this could help : https://youtu.be/qxF9wLH5NKI?t=2m44s", "time": "18th September 2016, 02:37 PM", "postID": "post68746476", "replies": []}, {"text": "I hope someone would be able to answer this question, I really like all the specs of the Oneplus 3 especially for the price, I am currently using the 2013 LG Nexus 5. Does the Oneplus 3 have a better screen? Is it the same? Or will I get a worse experience?\nThanks in advance", "time": "19th September 2016, 06:36 PM", "postID": "post68765104", "replies": [{"text": "The display is terrible, text doesn't appear sharp, it has cyan and magenta fringing if you look closely enough.\n\n---------- Post added at 09:56 AM ---------- Previous post was at 09:54 AM ----------\n\n\n\r\nIf you value good battery life and a good screen, don't buy it. The standby drain and SOT are terrible, the screen is also terrible, if you look closely enough you can see pixels and cyan/magenta fringing around text.\n\n---------- Post added at 10:00 AM ---------- Previous post was at 09:56 AM ----------\n\nThe screen isn't too noticeable if you keep the text small and don't look at your phone from closer than half foot, however the battery will not last beyond half the day with a WiFi/3G connection and regularly using messaging apps \nBattery drain with gaming is shocking, I compared it and my iPhone 6 running Pokemon go after a full charge, after 10 minutes the iPhone had dropped 1% and the OP3 6%\n\n---------- Post added at 10:03 AM ---------- Previous post was at 10:00 AM ----------\n\nAll the reviews make the phone sound great but if I had to choose again I wouldn't buy this phone, I'd advise something with a bigger battery and a better screen. As for the 6GB RAM and Snapdragon processor, I haven't seen much evidence of those either, I've already had several glitches and crashes and I bought this phone a week ago!!!", "time": "21st September 2016, 10:03 AM", "postID": "post68790074", "replies": [{"text": "Lol, you're so full of BS, totally, stop misleading people with lies, Standy drain?\n\nI get 0/1% drain from all night with Wifi and data ON, SoT is also just fine, i keep getting around 5h with heavy use, less if install a new rom and install all apps again\n\nthe screen is just fine and i'll just pretend i didn't read that random magenta stuff around the text lmao, My gf has a S7 and if i put both side to side you really won't tell the op3 screen sucks, sure the S7 is better, but the difference is negligible unless you will VR , Unless ofc, you're going to use your phone 5cm away from your eyes to watch the pixels, which you can't anyways since everything will be blur\n\nYou are either buthurt and don't even own the op3 or you just have a bad unit / firmware and don't care to look into it, Have a good day", "time": "21st September 2016, 11:35 AM", "postID": "post68791140", "replies": []}]}]}, {"text": "Typically, optometrists follow a '1, 2, 10' rule when prescribing vision correction — assuming a working distance of about one foot for cell phones, two feet for desktop computers, and ten feet for television viewing.\n\nSo if OnePlus 3 display is sharp at 1 foot distance (around 30cm) it is as sharp as it have to be.", "time": "21st September 2016, 10:05 AM", "postID": "post68790212", "replies": []}, {"text": "Good", "time": "12th October 2016, 10:24 AM", "postID": "post69091657", "replies": []}, {"text": "Guyz my op3 is 3 months old and I have a weired issue like box like thing is appearing over dark areas whenever a bright light interferes in display when playing dark shade videos like game of thrones.... Pls help me solve this.....It is like a noise that keeps appearing in display wherever the dark area comes..", "time": "17th December 2016, 02:57 PM", "postID": "post70133543", "replies": []}, {"text": "DISCLAIMER: This is my personal opinion. You are entitled to your own. \r\nTo be quite honest I actually hated it at first. I came from a Nexus 5X which had a pretty crisp display even at 1080p. I think my main gripe would be the arrangement of the pixels. The pentile layout isn't my favourite, and I think it makes the display look a little softer than it should be.", "time": "14th February 2017, 03:13 PM", "postID": "post71028202", "replies": [{"text": "I agree while i do really like the OP3 Ive gone back to my nexus 5x just because i like the small size. The slightly crisper display is just a bonus.", "time": "14th February 2017, 03:49 PM", "postID": "post71028746", "replies": []}]}]}, {"title": "Minimum brightness", "rating": 3.5, "links": ["https://forum.xda-developers.com/oneplus-3/review/minimum-brightness-t3400070", "https://forum.xda-developers.com/oneplus-3/review/minimum-brightness-t3400070/page2", "https://forum.xda-developers.com/oneplus-3/review/minimum-brightness-t3400070/page3", "https://forum.xda-developers.com/oneplus-3/review/minimum-brightness-t3400070/page4"], "threads": [{"text": "The screen can go pretty dark. However for me the contrast suffers a lot when on the lowest two settings! Gaming videos on youtube get really hard to watch because everything is just dark. \n\r\nThe colors also shift with lower brightness. Especially the grays turn really blue. My swiftkey gray theme looks like I have a blue theme when the screen is dimmed.", "time": "21st June 2016, 09:24 PM", "postID": "post67425997", "replies": []}, {"text": "Having a night mode shortcut on the notification tray, it's easy to use this device for reading in bed. Also the display will get dark enough for those kind of things.", "time": "22nd June 2016, 05:57 AM", "postID": "post67430357", "replies": [{"text": "It's not getting that dark... even in night mode. It's way too bright for me!", "time": "8th July 2016, 04:14 PM", "postID": "post67657924", "replies": []}]}, {"text": "I think it not that easy to set. If you set it to minimum you barely see anything and like 1 mm on screen above minimum it's extremely bright compared to min. Personally I think the auto-adjustment feels kinda buggy, too.", "time": "4th July 2016, 10:07 PM", "postID": "post67605663", "replies": []}, {"text": "Auto brightness is very painful on op3, we need some small app or mod to fix this one up", "time": "8th July 2016, 12:41 PM", "postID": "post67655458", "replies": [{"text": "Yeah, it's awful!  It seems like it never does what I want it to do.  It isn't bright enough in indoor environments that have adequate lighting.  And in dark environments, it is extremely dim and also randomly has random fits where it goes to maximum brightness for a few seconds and then goes back extremely dim again.\n\r\nI hate it, and have it turned off unfortunately.  Would like to see it corrected in an OTA from OnePlus.", "time": "8th July 2016, 04:56 PM", "postID": "post67658415", "replies": []}]}, {"text": "About 4 nits according to a video on YouTube", "time": "8th July 2016, 08:15 PM", "postID": "post67660914", "replies": []}, {"text": "I random fits are very hurtful to eyes...  any one using any good apps to control the auto brightness?", "time": "9th July 2016, 05:19 AM", "postID": "post67665470", "replies": [{"text": "disable adaptive brightness?", "time": "9th July 2016, 03:37 PM", "postID": "post67670957", "replies": []}]}, {"text": "I tried the best auto brightness in sultan opo's build. Just use the brightness bar to customize the brightness in auto function. Hope someone can port it into our op3 , more specifically oxygenos", "time": "12th July 2016, 01:52 AM", "postID": "post67704771", "replies": []}, {"text": "I was driving while using google maps as navigation it was a very sunny/bright day and i couldnot see much on the screen so i just disabled auto brightness some how the screen got so dim i could not see any thing at all.I had to stop on emergency lane of high way and struggle to see any thing at all because it was so dim i couldnt do any thing at all by chance i got to the auto birghtness again and put it in auto mode again.Damn this birghtness thing of op3 is seriously killing me!", "time": "12th July 2016, 12:46 PM", "postID": "post67710687", "replies": []}, {"text": "This yet another auto brightness is working great https://play.google.com/store/apps/d...biz.gyrus.yaab", "time": "13th July 2016, 04:15 PM", "postID": "post67728703", "replies": []}, {"text": "I like the minimum brightness, it's like having included a screen filter (that often distorts colors, but that is what all do). If you don't like this you can easily set the brightness bar at 60-70%, which won't be too bright (compared to other screens (Samsung S3))", "time": "30th July 2016, 09:33 PM", "postID": "post67973402", "replies": []}, {"text": "The minimum brightness is quite bright, such that it hurts my eyes to look at my phone when just woke up even with night mode still on and minimum brightness. \n\nLux dash has fixed this issue for me", "time": "31st July 2016, 12:17 AM", "postID": "post67974734", "replies": []}, {"text": "The display seems really good however once in a while my display dims as if adaptive brightness is on yet I have it disabled. I touch the screen and it brightens back up. My timeouts are set to several minutes.", "time": "10th August 2016, 09:08 AM", "postID": "post68121954", "replies": []}, {"text": "Has anyone got a solution for this? I received my OP3 yesterday and this adaptive brightness is a complete mess. Hows the situation with custom CM roms? Maybe is because of defective light sensors or connectors? My previous LG G3 on Android 6.0 had a flawless auto brightness control. So I think it's not a Android 6.0 bug...", "time": "15th August 2016, 07:11 AM", "postID": "post68193308", "replies": []}, {"text": "Who actually makes this display? \n\nThe Mrs's LG G Flex 2 also suffers with poor black levels which is odd for an OLED.", "time": "29th September 2016, 04:20 PM", "postID": "post68912312", "replies": [{"text": "Samsung.", "time": "29th September 2016, 04:29 PM", "postID": "post68912434", "replies": [{"text": "Thanks biglilsteve\n\nI would said it was LG if you didn't reply.", "time": "29th September 2016, 04:33 PM", "postID": "post68912493", "replies": []}]}]}, {"text": "if you have root, you can use CF.lumen with darkening filters in sundown/night mode to help this.\nalso the 3.2.6 update improved adaptive brightness performance noticeably", "time": "30th September 2016, 07:18 PM", "postID": "post68928186", "replies": [{"text": "It certainly did. Thank goodness.", "time": "30th September 2016, 07:58 PM", "postID": "post68928659", "replies": []}]}, {"text": "Auto brightness ****ing fixed in 3.2.7", "time": "4th October 2016, 09:38 AM", "postID": "post68975017", "replies": []}, {"text": "I know the OTA update has since fixed the auto-brightness issue, but the backlight on the capacitive keys still only stay on for seconds. Has a mod (root/xposed/etc) been created to address this at all? I'd love for them to remain ON as long as the screen is on", "time": "24th October 2016, 07:23 PM", "postID": "post69288426", "replies": [{"text": "GravityBox", "time": "29th October 2016, 12:15 PM", "postID": "post69360743", "replies": []}]}, {"text": "Mine it's set to aboput 10%.", "time": "31st October 2016, 06:08 PM", "postID": "post69395792", "replies": []}]}, {"title": "Call quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/oneplus-3/review/call-quality-t3400071", "https://forum.xda-developers.com/oneplus-3/review/call-quality-t3400071/page2", "https://forum.xda-developers.com/oneplus-3/review/call-quality-t3400071/page3"], "threads": [{"text": "can anyone comment on the call quality and reception?", "time": "21st June 2016, 01:40 AM", "postID": "post67412791", "replies": [{"text": "Reception is really good but call volume isn't as loud as I would have hoped through earphones.  It's not horrible, just not fantastic.  Person on the other end was mentioning the call having pops in the audio.  This was consistent over a two and a half mile walk plus standing in one location for a bit.  Call didn't drop throughout the hour I was on the phone testing it so that's good.  Some spots I could see might have a problem and have had dropped calls on various phones in the past but the OP3 kept strong.  As for the popping noise, I took out the sim and did a test call with the 6s+ and was told it was a lot cleaner, louder, with no popping noises.  On my side I couldn't hear any static or popping.  I'm on AT&T / Denver CO.\n\r\nSo for my rating it would be a 4 out of 5.  Speaker is good but with earphones the volume could stand to be 20% louder.", "time": "21st June 2016, 02:13 AM", "postID": "post67413033", "replies": []}]}, {"text": "Call quality is good and a lot of it depends on your carrier.", "time": "21st June 2016, 02:53 AM", "postID": "post67413303", "replies": []}, {"text": "3.1.4 beta firmware changelog :\n\r\n-TP Firmware upgrade\r\n----Audio Optimization----\r\n-RAM Management Optimization\r\n-General Optimization on app launch speed\r\n-Avoid overheat in some cases\r\n-Cardboard display touch improvements\n\r\nmaybe in call audio optimized", "time": "23rd June 2016, 02:03 PM", "postID": "post67450190", "replies": []}, {"text": "Hi, appreciate some comments on whether the dual SIMs support LTE+LTE or is it LTE+3G or worst LTE+2G if use concurrently?\n\nLet's say I have SIM 1 that I'm gonna use for 4G data only (all internet connections) while SIM 2 just for voice calls, is this possible? I meant using both concurrently rather than switching one at a time.\n\nMany thanks.", "time": "28th June 2016, 03:14 AM", "postID": "post67511574", "replies": []}, {"text": "Cant even use my s6 work phone for calls in the shop 90% after we installed a metal roof the signal is that bad.\n\nSo far the OP3 is running laps on the samsung and is able to take any call and keep it", "time": "29th June 2016, 09:40 PM", "postID": "post67538122", "replies": []}, {"text": "Having random/sporadic issues making and receiving calls.  When making a call, sometimes I don't hear the phone ringing at the other end and the OP3 phone screen will move from \"Dialing\" to \"Call Ended\".  I've also had more than 1 instance of someone trying to call me on the OP3 and there is no ring or indication of a call (or even missed call!).  \n\nCalled OnePlus tech support today and I was told that they have received this complaint from others.  They suggested that I wipe data/cache and see what happens.  I did that plus reflashed radio software.  We'll see what happens from now.", "time": "7th July 2016, 05:24 AM", "postID": "post67637521", "replies": []}, {"text": "keep dropping ...", "time": "16th July 2016, 09:20 PM", "postID": "post67775214", "replies": []}, {"text": "Reception was so bad for me I had to get rid of the phone.", "time": "17th July 2016, 10:07 PM", "postID": "post67789636", "replies": []}, {"text": "Reception is also bad for me. The 4G is great but GSM is ugly and I got cut during calls...", "time": "29th July 2016, 02:14 PM", "postID": "post67955164", "replies": []}, {"text": "Noise cancellation doesn't work on one plus 3 so dont expect best calling but still better than competitors.", "time": "29th July 2016, 06:47 PM", "postID": "post67958602", "replies": []}, {"text": "Reception has nothing to do with noise cancellation. With the last update 3.2.2 oos reception is even worst...", "time": "2nd August 2016, 01:04 PM", "postID": "post68009411", "replies": [{"text": "Agreed.  Since 3.2.2 I have noticed this as well.", "time": "2nd August 2016, 08:03 PM", "postID": "post68015339", "replies": []}]}, {"text": "The call quality issues started after 3.2.2 upgrade. Have replaced the phone with new one plus 3, I still face the same issue.\r\nPlanning to schedule a call back with One plus 3 for tech support troubleshooting.", "time": "8th August 2016, 09:44 AM", "postID": "post68091578", "replies": []}, {"text": "I have read somewhere that the reception was better with the 3.1.2. has anybody succeed to extract the radio from the 3.1.2 ? I search but didn't found any radio.img into the zip...", "time": "9th August 2016, 06:35 PM", "postID": "post68113826", "replies": []}, {"text": "I use to call in speaker mode so this is why recently I've noticed the poor quality in the call\r\nI hardly listen to the person is calling me, there's no problem with them hearing me\r\nI'm stock 3.2.2 btw", "time": "12th August 2016, 03:25 PM", "postID": "post68156107", "replies": []}, {"text": "Having the same issue with bad call quality with the phone.", "time": "31st August 2016, 01:09 PM", "postID": "post68459926", "replies": []}, {"text": "Personally , I have no problem with the calls", "time": "5th September 2016, 08:25 PM", "postID": "post68544937", "replies": []}, {"text": "reception is about average and the sound quality of the call is extremely bad, the volume is so slow you can barely hear anything, this phone is a fraud and I wouldn't recommend it to anyone.", "time": "11th April 2017, 04:21 PM", "postID": "post71818301", "replies": []}, {"text": "It really depends on the network as well. My OPO 3 is good on some networks but gives a lot of echoes in some networks.", "time": "12th April 2017, 07:42 PM", "postID": "post71834218", "replies": []}, {"text": "I'm having a lot of problem with call quality. Often people complain the can not hear me, hearing echoes or muffled voice. \r\nSwitching loudspeaker on/off immediately solve the issue, so it is not related to network carrier.\r\nIt's probably a software issue linked to noise cancellation. I've tried every trick, hack, mod I've found on the forums, wiped out everything and restored a factory image.... nothing helped so far.", "time": "24th April 2017, 11:47 AM", "postID": "post72006419", "replies": [{"text": "I second this. Hope OnePlus fixes this soon.", "time": "10th June 2017, 12:12 PM", "postID": "post72618661", "replies": []}]}]}, {"title": "WiFi strength, range, and throughput", "rating": 3.0, "links": ["https://forum.xda-developers.com/oneplus-3/review/wifi-strength-range-throughput-t3400072", "https://forum.xda-developers.com/oneplus-3/review/wifi-strength-range-throughput-t3400072/page2", "https://forum.xda-developers.com/oneplus-3/review/wifi-strength-range-throughput-t3400072/page3", "https://forum.xda-developers.com/oneplus-3/review/wifi-strength-range-throughput-t3400072/page13"], "threads": [{"text": "wifi is bad. check wifi anlyzer put hand between router and phone camera and watch how it gets lower and lower as time passes. really sad", "time": "26th June 2016, 12:23 AM", "postID": "post67483811", "replies": []}, {"text": "As i can see in YouTube wifi speed can't reach any further than 70MB/s. Why? Software? Or wifi chip sucks?", "time": "26th June 2016, 02:05 AM", "postID": "post67484449", "replies": []}, {"text": "Using 5ghz I'm getting nearly 200Mbps download on my OP3.  Haven't tested 2.4ghz yet.", "time": "26th June 2016, 03:50 AM", "postID": "post67485107", "replies": [{"text": "Wich oxygen version?", "time": "26th June 2016, 01:52 PM", "postID": "post67489800", "replies": [{"text": "3.1.3.\n\nHere's a test I just ran...Netflix is streaming on two screens right now, so it's a touch lower than usual.", "time": "26th June 2016, 04:17 PM", "postID": "post67491446", "replies": []}]}]}, {"text": "Here are the WiFi Analyser screenshots with and without hands over back cam. I was sitting very close to the router (~1m).", "time": "26th June 2016, 04:39 AM", "postID": "post67485397", "replies": []}, {"text": "came across this on YouTube \n\nhttps://www.youtube.com/watch?v=cQW1SaUzecQ\n\nCan anyone confirm this? Thanks.", "time": "26th June 2016, 06:45 AM", "postID": "post67486140", "replies": [{"text": "I just tried it out, the WiFi signal was getting worse but not as worse as in his video. Still somehow ****ty.", "time": "26th June 2016, 07:05 AM", "postID": "post67486263", "replies": []}]}, {"text": "Didn't the iPhone have a similar problem? People's hands were shorting out the antennas causing dropped calls, etc. \n\nA simple case should fix the problem (really, why wouldn't you use a case anyways?). And if you don't want the bulk or whatever you can try one of those full body screen protectors, should solve the problem of shorting the antennas AND provide scuff protection.", "time": "26th June 2016, 07:15 AM", "postID": "post67486353", "replies": []}, {"text": "My router is downstairs and I am upstairs. OOS 3.1.3. 5ghz.", "time": "26th June 2016, 06:29 PM", "postID": "post67493131", "replies": []}, {"text": "Absolutely terrible...Always drops out", "time": "29th June 2016, 06:27 PM", "postID": "post67535649", "replies": []}, {"text": "Wifi is doing pretty okay here on 5Ghz, its dropping sometimes though.", "time": "29th June 2016, 10:24 PM", "postID": "post67538563", "replies": []}, {"text": "On my previous Nexus 5X I've had much better Wi-Fi reception.", "time": "13th July 2016, 06:15 PM", "postID": "post67730352", "replies": []}, {"text": "OP3 gets about -8 or -10 more on Wifi Analyzer compared to my OPO when held side by side, definitely a bit worse.", "time": "13th July 2016, 11:51 PM", "postID": "post67734422", "replies": []}, {"text": "Yeah. I noticed that OP3 under wifi doesn't work really well. Infact with just 1 wall in middle of me and router the signals drops from 20mbps to 6mbps.\nBad, really bad!", "time": "14th July 2016, 08:51 AM", "postID": "post67738365", "replies": []}, {"text": "Nowhere near as good as my OnePlus One, disappointingly", "time": "14th July 2016, 02:04 PM", "postID": "post67741840", "replies": []}, {"text": "Yes, if one wants to point out THE one weak point of the phone, it's not the display, it's not video recording - it's clearly the weak WiFi.", "time": "14th July 2016, 03:13 PM", "postID": "post67742705", "replies": []}, {"text": "Honestly I feel as if my wifi speeds have been stronger than my note 4. 5ghz is nice and speedy", "time": "16th July 2016, 03:56 AM", "postID": "post67765025", "replies": []}, {"text": "My OnePlus 3 is also giving the signal strength problem, sometimes it shows only 1 bar within 2-5 meteres from the router.", "time": "16th July 2016, 08:39 AM", "postID": "post67767128", "replies": []}, {"text": "It seems battery life is also be hurt by this, GSMArena numbers show an abnormally low number for web browsing when compared to video playback times, etc.  \n\nI'm currently on the fence about buying this phone just because of this. I use a phone the most for web browsing, social media etc over wifi. I'm assuming from the date of comments the recent update hasn't addressed this issue?  Any one knows if it's a software thing or poor hardware?", "time": "16th July 2016, 03:31 PM", "postID": "post67771128", "replies": []}, {"text": "Geez, sounds like OnePlus didn't do a very good job on the WiFi.", "time": "17th July 2016, 12:36 AM", "postID": "post67776962", "replies": [{"text": "I promise you it really isn't that bad. I have been using it for over 2 weeks now and the wifi has been quick and reliable. Both on 5ghz and 2.4ghz. I'm in a 1100sq ft house, but I get reception a ways away from the house.", "time": "17th July 2016, 04:10 AM", "postID": "post67778390", "replies": []}]}, {"text": "There's very different numbers and experiences for some of you guys. How do you know it's a flaw of this phone and not just a problem with your unit? I'm asking because if you do know how to tell that apart, you might still be able to simply return it and get another one? (I think there's a period of \"no questions asked\"  when returning a phone to Oneplus?)", "time": "17th July 2016, 12:37 PM", "postID": "post67782704", "replies": []}, {"text": "No problem here.  Seems to go the same distance as my last phones(mate 8, Nexus 6p, note 5).  Speed is on par also.", "time": "17th July 2016, 02:25 PM", "postID": "post67783922", "replies": []}, {"text": "The few times I've tested with speedtest.net's app, and I have been close to maxing my 250/250 connection.\n\nTbh, I think everyone else is having problems because of other things.", "time": "17th July 2016, 07:53 PM", "postID": "post67788068", "replies": []}, {"text": "I'm having huge problems with WiFi drop outs. Compared to my OPO and HTC M8 it sucks!\n\nSitting near my TV where the signal is so-so, but it worked with my previous phone only drops out with my  new OP3! Seriously... it sucks. Hopefully they can fix it with an update.", "time": "18th July 2016, 10:04 AM", "postID": "post67795324", "replies": [{"text": "wifi dropouts are ruining the experience for me. i have tried everything from wiping cache partition, factory reset, flashing 3.1.2 and then updating to 3.2.1, flashing 3.2.1 directly to no avail. this is the worst performing wifi device i have ever purchased.", "time": "18th July 2016, 02:30 PM", "postID": "post67798211", "replies": []}]}, {"text": "It is very interesting so far i found many problems with many phones while connected to wifi it never shows speed according to this one plus 3 have 6 gb ram when i am using multiple apps with wifi and playing online games it showing huge difference from ordinary phones", "time": "18th July 2016, 11:04 AM", "postID": "post67795939", "replies": []}, {"text": "Wifi range is bad my old Yureka was way better in terms of range..", "time": "18th July 2016, 03:37 PM", "postID": "post67799074", "replies": []}, {"text": "I think the issue with WiFi could be with some units only. I returned mine because I had that issue. They have mailed me a replacement unit, which is arriving today. Hopefully, this one will not have this problem. Will update the group after trying.", "time": "18th July 2016, 09:50 PM", "postID": "post67803830", "replies": []}, {"text": "which is the wifi chipset used in oneplus 3? is it 802.11ad suported as mentioned in qualcom website?", "time": "23rd October 2016, 08:06 PM", "postID": "post69272727", "replies": []}, {"text": "Just an FYI for people here that 5GHz channel does not work well through solid objects/walls. 2.4GHz is still best if you have multiple objects in the way between your phone and router.\n\r\nAlso, unless you really need massive throughput, set your router to 20MHz bandwidth. Some devices will not take 40MHz well.\n\r\nI am using a Huawei B315s and a TP-Link AC750 and I have no problems regardless of which device I connect to and I am usually a few walls between whichever device I am connected to.", "time": "24th October 2016, 12:50 PM", "postID": "post69282293", "replies": []}, {"text": "Would like to see higher download.  Can hit 500+ on my note 4.  For comparison, here is 5ghz and 2.4 GHz.  The 5 is the higher upload speed.  About 35 ft and 2 interior walls in the way.", "time": "13th December 2016, 02:17 AM", "postID": "post70061682", "replies": []}, {"text": "My router has 2 signal, 1 2.4GHz and 1 5GHz\r\nWhen I am at in a further room from the one I put my router, even the Wifi signal is around 3/5 - 4/5 ,it will just abandon the wifi and switch to mobile data and immediately connect to another signal when there is any dip in the signal strength.\n\r\nAs it keep disconnect and switching from difference wifi signal and mobile data, it disconnect any continuous download. Long website will just cannot load the bottom part, Youtube videos will stuck at buffering, Facebook timeline will be cut.\n\r\nPlease someone from OnePlus team try to fix this. As this has never happened on my OPO and other devices like Nexus 4 or Nexus 7", "time": "13th December 2016, 04:01 AM", "postID": "post70062461", "replies": []}, {"text": "I also had similar issues before never getting the speed over 70s on wi-fi but when i changed from 2.4 to 5ghz it solved my issue now i get full speed", "time": "13th December 2016, 01:23 PM", "postID": "post70068227", "replies": []}, {"text": "one of the best ways to test your wifi signal is, believe it or not, to play CLASH ROYALE, its crazy internet dependent. If the signal drops a little, you lose the game!\n\r\nso...what I did, at home (in Canada)  Im on Bell wifi network is I went in my router settings, found my phone (double check the MAC address) and changed the connection to  FIXED, from the default DYNAMIC....\n\r\nhaven't had any issues! problem solved....  did this with ALL my connected devices!... BEST solution for me so far", "time": "13th December 2016, 04:35 PM", "postID": "post70071329", "replies": []}]}, {"title": "Cellular strength and throughput", "rating": 4.0, "links": ["https://forum.xda-developers.com/oneplus-3/review/cellular-strength-throughput-t3400073", "https://forum.xda-developers.com/oneplus-3/review/cellular-strength-throughput-t3400073/page2"], "threads": [{"text": "Hi, appreciate some comments on whether the dual SIMs support LTE+LTE or is it LTE+3G or worst LTE+2G if use concurrently?\n\r\nLet's say I have SIM 1 that I'm gonna use for 4G data only (all internet connections) while SIM 2 just for voice calls, is this possible? I meant using both concurrently rather than switching one at a time.\n\r\nMany thanks.", "time": "28th June 2016, 03:17 AM", "postID": "post67511597", "replies": []}, {"text": "It does support 4G+4G, but I've noticed that 4G is connected only on one sim, which you set as your main data sim, while the other depends on a lower network.", "time": "28th June 2016, 05:00 AM", "postID": "post67512329", "replies": []}, {"text": "Hello, Wanted to know if OP3 support \"VOLTE\"  ? \nAny inputs would be appreciated.", "time": "29th June 2016, 01:29 PM", "postID": "post67531581", "replies": [{"text": "From what I have read online yes it does but double check to make sure.", "time": "29th June 2016, 04:56 PM", "postID": "post67534474", "replies": []}, {"text": "Yes it does if you have it enabled and your sim/carrier support it.", "time": "30th June 2016, 06:59 PM", "postID": "post67549873", "replies": []}]}, {"text": "These are the speeds I am getting over lte in india. Service provider is airtel and the region is gurgaon. I am running stock oxygen os 3.1.2 rooted and with the build.prop fix.", "time": "30th June 2016, 03:00 AM", "postID": "post67540696", "replies": []}, {"text": "Stock 3.1.2 AT&T", "time": "30th June 2016, 03:25 AM", "postID": "post67540898", "replies": []}, {"text": "Hi Just call One Plus Support (India).. They mentioned that their hardware is compatible but then there is an OS upgrade which would be needed to use VoLTE directly instead of an application interface. I have also send a mail to support for getting a conformation , Would update with the inputs in-turn,", "time": "30th June 2016, 07:16 PM", "postID": "post67550089", "replies": []}, {"text": "The 4g speeds are half of that on my old nexus 5 with the exact same sim card, sitting in the same place in my house, testing from the same server on speedtest.net", "time": "18th September 2017, 09:15 PM", "postID": "post73843569", "replies": []}, {"text": "I got this while sat in a park in Taichung, Taiwan.  Bought the SIM with credit for ~£12 at Taipei airport on landing.  Unlimited data for 10 days.  It worked not only on the metro underground in Taipei and on the THSR (bullet train) at 300kph but also in a hotel room that was below ground in Taipei.\n\nI suggest that any throughput issues anyone might have with 1+3 is carrier related", "time": "21st October 2017, 11:01 AM", "postID": "post74240385", "replies": []}]}, {"title": "Speakerphone (loudness, clarity)", "rating": 3.5, "links": ["https://forum.xda-developers.com/oneplus-3/review/speakerphone-loudness-clarity-t3400074", "https://forum.xda-developers.com/oneplus-3/review/speakerphone-loudness-clarity-t3400074/page2", "https://forum.xda-developers.com/oneplus-3/review/speakerphone-loudness-clarity-t3400074/page3"], "threads": [{"text": "hello guys..i know this off topic..but can anyone compare the vabiration of this op3 to any samsung device..\nis the strength is the same or lower.\nis the type of vibration is the same ...by the type i mean somthing u can feel it specially when u write with the keybord", "time": "30th June 2016, 05:37 AM", "postID": "post67541781", "replies": [{"text": "All off-topic.  This thread is about speakerphone for calls.", "time": "27th July 2016, 05:20 PM", "postID": "post67928660", "replies": []}]}, {"text": "If you are coming from a 6P, you will be greatly disappointed with the OP3 speakers, and maybe most phones that do not have front facing/dual speakers.   OP3 are fairly weak, but gets the job done as long as there arent much background noise, otherwise you might have a hard time listening to whatever you are playing.", "time": "30th June 2016, 06:33 PM", "postID": "post67549542", "replies": []}, {"text": "How is it? Is it loud? Is it crispy?", "time": "26th July 2016, 08:29 PM", "postID": "post67916003", "replies": []}, {"text": "since this thread is about speakerPHONE, I'll comment. From a volume perspective it isn't quite as loud as my Nexus 6. However the N6 speakerphone sounds like garbage...tinny and raspy. The OP3 sounds much more refined and voices are overall much easier to understand.", "time": "27th July 2016, 01:14 PM", "postID": "post67925285", "replies": []}, {"text": "I found the speakers very weak in max sound and to loud in min sound. For example, in my previous smartphone, i could see a video with min sound in a room without other noises  and others just listen a bit. Now, all can hear very well even in min sound. And if others are sleeping, is boring. With max sound in Street, with normal city noises, is very difficult to hear", "time": "27th July 2016, 04:36 PM", "postID": "post67928062", "replies": []}, {"text": "I find that the speaker for calls is on the low side imo. I have placed a couple calls on speaker while at home where its pretty quiet, and had to turn the speaker all the way up for it to be \"loud enough\". If I were out in public or somewhere where there was more ambient noise, I feel like I'd have trouble making out the conversation.", "time": "27th July 2016, 06:15 PM", "postID": "post67929424", "replies": []}, {"text": "The speakers are OK but I hope next phone stereo or on an other place. \n\nGesendet von meinem ONEPLUS A3003 mit Tapatalk", "time": "3rd August 2016, 09:48 PM", "postID": "post68031725", "replies": []}, {"text": "Just got my Oneplus 3 Soft Gold. The down-firing speaker isn't as loud as my G4 but the sound is clearer and it doesn't distort. It gets the job done for me as I don't use them so much. I mustly consume media through earphones and there it is very nice and loud.", "time": "14th August 2016, 12:58 AM", "postID": "post68176887", "replies": []}, {"text": "Hi,\n\r\nI have used Redmi Note 4G and 3 in past and have recently got this OnePlus 3. While watching Youtube and other videos I have found that the loudness and clarity are definitely better in this phone.\r\nBut it more than twice costly as well. \n\r\nNot sure about the other brands though.", "time": "14th August 2016, 09:34 AM", "postID": "post68180823", "replies": []}, {"text": "Speakerphone works perfectly; absolutely no complaints on that count. In normal conditions, can carry on your conversation or even con-call (2 to 3 people in the room/office, speakerphone on) quite comfortably. You do not need to lean in to the phone to hear what is said at the other end. The speakerphone is indeed quite satisfactory.", "time": "22nd August 2016, 08:05 AM", "postID": "post68302286", "replies": []}, {"text": "Hi..I am also struggling with low sound volume through the earpiece during calls. Is it possible to increase it beyond what is possible through volume up/down buttons?", "time": "10th October 2016, 11:21 AM", "postID": "post69059231", "replies": []}, {"text": "Quality and loudness it´s preety god, but the ubication is horrible. It would be great to have front speaker like Moto G4. But in general is really good (compared with iPhone 6s and S7)", "time": "23rd January 2017, 04:47 PM", "postID": "post70691413", "replies": []}, {"text": "Have you guys tried any sound mods? I've used divinebeats on MM/3.X.X and CM13/14 and it made the speaker go nuts in a wonderful way. I can't get it to work on N/4.X.X and haven't tried lineage yet.\n\r\nThere's also this in francos kernel updater app:", "time": "29th January 2017, 07:12 AM", "postID": "post70780311", "replies": []}, {"text": "Speaker is decent not great but decent and its loud enough", "time": "12th June 2017, 06:08 PM", "postID": "post72645984", "replies": []}, {"text": "Can not change anything in the root directory for example in the \"ROOT / System / ETC / mixer_paths_tasha.xml\" to increase the sound?", "time": "3rd July 2017, 09:29 PM", "postID": "post72897048", "replies": [{"text": "How to increase the volume of the Speaker \",\" amendments the values in the Mixer_paths file located in the system/etc path, and then the volume responds to the following lines \",\"<ctl name=\"RX0 Digital Volume\" value=\"84\" /> <ctl name=\"RX1 Digital Volume\" value=\"84\" /> <ctl name=\"RX2 Digital Volume\" value=\"84\" /> <ctl name=\"RX3 Digital Volume\" value=\"84\" /> <ctl name=\"RX4 Digital Volume\" value=\"84\" /> <ctl name=\"RX5 Digital Volume\" value=\"84\" /> <ctl name=\"RX6 Digital Volume\"\",\" where the speaker rx0 volume, \"RX1-2 left right headphones\", \"RX3-4 left right headphones of Hi-res\", \"RX5 second multimedia speaker (stereo) We don't have it!\", \"rx6 the main multimedia (we need it.)\"", "time": "6th August 2017, 11:54 PM", "postID": "post73311697", "replies": []}]}, {"text": "Guys the solution is the simplest one\n\n i cleaned the earpiece's grill (after you remove your earpiece there will be probably a black layer of Speaker Cloth remove that too and then you will see the grill ) , it had a thick layer of dust in it , i used some alcohol an old toothbrush a little force at the grill and after i removed all the dust i putted the old earpiece and the cloth back in  I reassembled the phone and volume was like new ....", "time": "6th August 2017, 06:47 PM", "postID": "post73309246", "replies": []}]}]