[{"title": "Overall love", "rating": 5.0, "links": ["https://forum.xda-developers.com/pixel/review/overall-love-t3484803", "https://forum.xda-developers.com/pixel/review/overall-love-t3484803/page2", "https://forum.xda-developers.com/pixel/review/overall-love-t3484803/page3"], "threads": [{"text": "Only had the phone 3 days, but it has the most cohesive feel of all the Android devices I've owned, not as featureless as my Nexus 7, not over the top like my older HTC/Samsung devices. Switched to Nova Launcher, then switched back to Pixel launcher because it felt a better fit.", "time": "28th October 2016, 12:24 AM", "postID": "post69341488", "replies": []}, {"text": "I love it. But I'm having some buyer's remorse. I still give it an 8 out of 10. A 10 would have been better than my previous in most categories, even if marginally. \n\nThe Pixel is more expensive than my 6P. It's subjectively uglier than my gold finish all metal 6P. It has no front firing dual speakers. It's speakers aren't as good as the 6P's. It has no 64gb option as my 6P did. And I know people may slate me for this, the 6P had a better camera. By a big margin. \n\nSo why the high rating? Well, the Pixel feels better in the hand. This is primarily due to the size. The build seems more solid and more dense. The software feels more natural, although this is hard to quantify. The Pixel doesn't exhibit any throttling that my 6P did, which is a huge improvement. It just seems a more polished finish.\n\nIt has excellent EIS and I think the 6P should have been given this as it's just software magic, AFAIK. But it is what it is. \n\nNo nightmares in the battery department. Quite stable in fact. My 6P was starting to drain quicker than I liked. \n\nDid I say it's the only viable smaller handset with top end hardware? I find it so liberating to be using a smaller powerhouse again. \n\nMost of all, it's just very reliable and dependable.", "time": "29th October 2016, 08:32 PM", "postID": "post69366974", "replies": [{"text": "Im sorry but the 6P does not have a better camera.  Coming from a 6P as well i agree with some of your viewpoints but the camera isn't a valid arguement.  While the 6P camera is good its not at the level of the pixel.", "time": "4th November 2016, 02:51 PM", "postID": "post69458240", "replies": []}]}, {"text": "I actually very much love this phone, I was expecting a lot to be hype, yet battery is good, cameras awesome see attached pics, and overall it's probably the best phone I owned in awhile, I was using an iPhone 5s, missed mu Android,. Operating system is fast and responsive and split screen multitasking is great especially with YouTube and  chrome open", "time": "2nd November 2016, 07:33 PM", "postID": "post69430412", "replies": []}, {"text": "I've used android phones, I've used iPhones. If this is what Google has to offer with its first Pixel phone I'm excited for Pixel 2 already.  The camera rocks, love the quality of photos, the UI is intuitive and fast. Opening apps feels instant for me at least no delay. Have yet to see the device slow down. Almost elliminates the need to shy away from stock one can be hopeful that Verizon doesn't end up blocking depixel8 otherwise I may end up unlocking the bootloader if I see they do.", "time": "2nd December 2016, 03:06 AM", "postID": "post69889039", "replies": []}, {"text": "I use an Android and iPhone handset concurrently for work-related reasons. The Pixel is great, and compares very favorably with the iPhone. \n\nBattery: I used to run all intensive apps like Waze and streaming audio through the iPhone, now I don't fear running them on the Android. \nApp switching: You know when you're chatting with someone and you look something up to further your discussion along? The Overview button double-tap for switching back and forth is so great. \nFingerprint reader: Is faster than the iPhone 6. \n\nYou can probably get a nearly identical experience with a Xiaomi or Oneplus phone without spending $650+. I remember even seeing one of the new Xiaomi flagships featuring the same camera sensor. But I hoped that the Pixel being was it is, it'll be a more bug-free experience.", "time": "5th December 2016, 08:37 PM", "postID": "post69945325", "replies": []}, {"text": "I bought this phone expecting to not like it and sell it in a few weeks. It doesn't have an sd card slot or a removable battery. That's a pretty big deal to me. But I got the 128gb and started allowing Google to back up my pics. I can go 16 hours on the battery with 4 hours SOT. That's exponentially better than my MXP or pretty much any other phone I've used. I have grandfathered unlimited on Verizon so my choices are slim if I want root. Everything about this phone works very well. It's super quick and feels good in the hand. Overall, I'm extremely pleased with it.", "time": "6th December 2016, 03:56 AM", "postID": "post69949493", "replies": [{"text": "My MXP screen cracked and I'm due for an upgrade. Were you disappointed by the downsized screen between the two? Would you still recommend it in April 2017?", "time": "6th April 2017, 12:31 AM", "postID": "post71743910", "replies": [{"text": "Yes I still have it and love it. Although, I have had my eye on the Moto G5. I bought my mom a G4 for cheap and it was very comparable to the MXP so the G5 should be a nice upgrade from the MXP. \n\nIf you're going to pay full price for a Pixel you may want to hold off for a Pixel 2 and grab a G5 in the mean time to hold you over.", "time": "6th April 2017, 01:31 AM", "postID": "post71744316", "replies": []}]}]}, {"text": "I adore this phone. By far my favorite phone I've owned (S3,  EVO 4G, EVO 4G LTE, HTC M8, Galaxy Note 5, Samsung Fireball, LG V20, LG V10). The experience has been unparalleled for me.", "time": "12th January 2017, 03:23 AM", "postID": "post70512731", "replies": []}, {"text": "It's a great phone, but not worth the price tag that comes with it.", "time": "31st January 2017, 12:07 AM", "postID": "post70807461", "replies": []}, {"text": "I would consider this to be the \"photographer's phone.\" It has a great camera and amazing EIS. As well as unlimited original photo hosting on Google Photos.\n\nDid I mention it has UNLIMITED, ORIGINAL photo hosting on Google Photos?\n\nDon't get me wrong, there could be better cameras out there, but you just can't beat that perk of having a Pixel.", "time": "3rd February 2017, 02:22 PM", "postID": "post70861616", "replies": []}, {"text": "As a long time samsung owner, this device is a breath of fresh air.  If it were more water resistant, and had wireless charging, it'd be a perfect 10.", "time": "22nd February 2017, 03:36 PM", "postID": "post71143430", "replies": []}, {"text": "what overall love for Power Users?\ni searched little bit and it seems ok but i want to ask from real life power users?\nease of rooting and number of custom roms & mods", "time": "28th February 2017, 02:55 AM", "postID": "post71219737", "replies": [{"text": "Power user here. Previously owned a Galaxy Note 5 and 7. I got the 128GB because I like to store lots of high-quality music files and 4K film. The auto backup photo/video feature is tremendous. \n\nIf you're on a normal Pixel (non-Verizon), rooting is a joke. Very simple. Custom ROMs are awesome - PureNexus is amazing and so are OctOS and RR. Not a ton of options but they've got everything you need. Dirty Unicorns is available too (no Slim ROM, sadly).\n\n\n\n\r\nRoot your phone and you can get those things you desire. \n\nActually, with Tasker, you could probably make the twist camera thing fairly easily. Probably don't need root for that, either.", "time": "5th March 2017, 01:25 AM", "postID": "post71287199", "replies": [{"text": "Thanks for the tip, I'll have to look into Tasker.", "time": "6th March 2017, 02:03 PM", "postID": "post71306940", "replies": []}]}]}, {"text": "So I got my Pixel right before Christmas and switched from VZW to Project Fi at the same time.  Mostly love the phone (and the service) and my minor complaints are all due to me being so used to my old Moto X '14.  I really liked some of the Moto \"tweaks\" such as the twist camera and flashlight \"chop\".  The camera on the Pixel is great but I really miss being able to take a picture by just touching the screen.  Like I said, most of my complaints are really minor and consist of small missing software features.  My only major complaint would be the sound of the speakers, they are too quiet which I really don't understand because when you strap the Pixel into a Daydream headset the sound is suddenly great.  Battery life is fantastic.  As for rooting/romming I'm still in the honeymoon phase where I haven't felt the need for either.", "time": "28th February 2017, 02:20 PM", "postID": "post71225819", "replies": [{"text": "There's an app for the twist camera. Made by the same guy who made ForceDoze.", "time": "21st March 2017, 04:42 PM", "postID": "post71526633", "replies": []}]}, {"text": "Upgraded to a 128gb unit in December from a HTC ONE M8 and love almost everything about it.\nSeriously, the difference in cameras is just amazing. I've got a big family and we all use different phones, and going from one of the worst cameras to the best camera is absolutely incredible. It runs fast, I can play PSP games on it. The rapid charge? 15% to full in an hour?! seriously, just amazed.\nI have 2 complaints, the speaker is just terrible in comparison to the M8 (best sounding phone I've ever used) and how I hold my phone in my right hand with my pinky on the bottom to keep it from slipping it just mutes it. Second complaint is location services just kill my battery. When my M8 was new, I once got 3 days on a full charge, with the Pixel I'm resembling those iPhone wallhuggers everyone likes to joke about.", "time": "21st March 2017, 05:33 AM", "postID": "post71519658", "replies": [{"text": "Battery life is much better than comparable Androids devices. I've never had such great battery life, honestly. Interestingly, I had an M8 for a year and did NOT get close to 3 days (not even 2). Coming from an LG V20, V10, Note 5 and Note 7 (and watching my wife's S7), this battery life is tremendous. I literally don't ever pay attention to battery anymore. I go to bed with 30-50% usually. I just charge overnight (why not?) to be safe.\n\nBut yes, the sound of M8 was unparalleled. Why they quit on that feature I'll never understand.", "time": "22nd March 2017, 02:03 AM", "postID": "post71533027", "replies": [{"text": "I'm making it though the day now (16-18 hours) and getting a 10% charge left over.\r\nWayyyy too many apps now want your location 24/7, finding the ones using location services and living without them fixed the wall hugging.\r\nAlso, not using it as much once the \"new phone smell\" wore off and I started normal use was a big help extending battery life.", "time": "9th May 2017, 10:40 AM", "postID": "post72224194", "replies": []}]}]}, {"text": "Overall I am pretty happy with the Pixel. I don't like large phones so i am glad Google offered a smaller version. I used to have the Nexus 5x (still do)  but the Pixel has been lag free. Anyone who has been using Google's devices long enough knows the thing starts to lag and the only thing to get rid of it is to totally format every so often. This has been running great so far so I am happy.\n\nOne thing I hope Google does not do is eventually become like Samsung or Apple where they totally lock down the device. The price point was already bad enough, but if the attempt to become mainstream to the point where the phone cannot be customized I will be very unhappy.\n\nIf they want to sell their product as \"Pure Android\", that should include customization outside of their OWN OS. Locking things down is no better than Apple or Samsung.", "time": "22nd March 2017, 02:40 AM", "postID": "post71533290", "replies": []}, {"text": "took a pic yesterday of Detroit from Belle Isle and posted it to reddit. Today i get an email from a local news site asking to use the pic on their fb page.  that's how awesome this camera is.   i'm starting to understand how powerful hdr is.  pixel feels like the future.  the chin is for ease of holding while watching videos. \n\nhttps://www.reddit.com/r/Detroit/com...4fu5c/detroit/", "time": "11th April 2017, 01:04 AM", "postID": "post71810210", "replies": []}, {"text": "Just traded my Iphone 7 plus 128GB for a new Pixel XL 128gb Very Silver. It is the best android phone I ever had (had the Nexus 6P, S7 Edge, G5, P9, HTC10, V10, Sony XZ, Oneplus 3), but i still think it is overpriced...\r\n          The build quality and design are not best in class, huawei, samsung, oneplus and sony make better built phones. It's not that Google Pixel is not well built, but the design is ugly as f__k, bezels are too big by any standards, screen is very good but poorly calibrated even in RGB mode, speaker is bearly above average, the aluminium used is not as high quality as the one in Iphone or Huawei, it has a white cloth covering the earpiece that gets dirty easy, has no IP67/68 rating, the back glass scrathes easily. I don't care about wireless charging. There are few pro's still, i love the buttons click and fingerprint sensor placement.\r\n          The display is very good, not the brightest or the most accurate (samsung is still king here), very good sunlight legibility and low power consumption.\r\nIt charges very fast, on point with s7 edge adaptive fast charge, but slower than OP3 with dash charge. Battery life is perfect, better than anything i ever had, even my Iphone 7 plus that wast the best before Pixel. \r\n          Perfect stand by times, very low power consumption for screen (i keep my screen very bright), doze is magic, as i get all notifications quick but with low power consumptions for apps.\r\n          The software is great, a little boring, but hey, better than iOS. No customisations comparing to a samsung or lg, but it's ok. Speed on the other hand... magic! Everything is instant, veeeeeeery fluid animations, no hangs, no force close, no nothing. It's iOS level of optimisation, years ahead any samsung or lg... \r\n          The camera is best i ever had. The most important aspect of a mobile phone for me is it's camera (back and selfie), and google pixel absolutly destroys every phone out there in dynamic range and is better than most in low light. Detail is superb, colours are very good, sometimes a bit saturated, had no trouble with lens flare (i think they fixed it). Focus speed and acuracy is just perfect. Video quality is there with the big boys (s7 and iphone 7). Selfie camera the best also, slightly ahead of sony xperia xz. Overall, best camera package on any smartphone to date (always keep HDR+ on), i think it will be better than s8 and g6, i allready know is better than Huawei P10.\r\n          What this phone has done better than all others, at least for me, is call quality and signal reception, my mother lives in an area where there are big signal issues with any carrier, and when i go visit her, Pixel XL is the only phone i had so far with almost full signal. (best until pixel were iphone and samsung).\r\n          So, long story short, i love my pixel xl, it is the best phone i ever had, on par with 2017 flagships so far (LG G6 ans Galaxy S8). It has it's cons: design, bezels and speaker, but those left aside, i think i will keep it until Pixel 2 or Iphone 8. The only phone that could mess up my plans is Galaxy S8 with that display... P.S. sorry for my flawed english, i am from Romania.", "time": "21st April 2017, 07:51 AM", "postID": "post71958304", "replies": [{"text": "Your English was on point. No need to apologise. Thanks for the great review. I have the regular Pixel myself and I love it. I'm looking forward to the Pixel 2. Thinking about going the XL route though.", "time": "25th July 2017, 02:07 AM", "postID": "post73156594", "replies": []}]}, {"text": "i like ulimited cloud google photos 😘😘😘", "time": "8th June 2017, 07:14 AM", "postID": "post72591469", "replies": []}, {"text": "I will be buying a new phone this fall. I used to have an iPhone 6s+ that was waterlogged and replaced it with a moto g4+. I like Android better but the wonkey updates make me crazy. I love the iPhone because of how smooth the updates usually were.  I have factory upgrade on g4 but it just isn't smooth and good anymore. Bootloop etc.  When the pixel updates, is it smooth and mostly problem free like the iPhone?", "time": "14th July 2017, 07:52 PM", "postID": "post73030606", "replies": [{"text": "Yes, it's incredibly simple. Newest versions of Android make it seamless so you don't even have to wait. It is installing it behind the scenes from what I understand and then when you reboot, it's magically done. Pretty fantastic.", "time": "16th July 2017, 05:45 AM", "postID": "post73046134", "replies": []}]}]}, {"title": "Community development strength", "rating": 3.5, "links": ["https://forum.xda-developers.com/pixel/review/community-development-strength-t3484804"], "threads": [{"text": "Now that people have sort of figured out the goofy partitions of the Pixel, things are getting good. The PureNexus ROM is amazing, the few kernels we have are tremendous, and generally I'm content with it for the age of the device (and Nougat).", "time": "12th January 2017, 03:28 AM", "postID": "post70512772", "replies": []}, {"text": "Its a flagship of Android so it will be used as a standard for development in alot of cases. That alone is worth praise to its longevity. It will likely be supported for years to come.", "time": "15th August 2017, 03:46 AM", "postID": "post73405535", "replies": []}]}, {"title": "Overall speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/pixel/review/overall-speed-t3484805", "https://forum.xda-developers.com/pixel/review/overall-speed-t3484805/page2", "https://forum.xda-developers.com/pixel/review/overall-speed-t3484805/page3"], "threads": [{"text": "Voice response sucks compared to nexus 6p. I can't just say, \"ok google blah blah\". I have to say, \"ok google\", wait a few seconds\" then \"blah blah\". For being one of the prominent features of this high dollar flagship, waiting those seconds is painful and unnecessary---since my nexus works perfectly.", "time": "24th October 2016, 12:02 AM", "postID": "post69275335", "replies": []}, {"text": "I don't find myself having to wait much at all, unless the screen's off when I issue the \"OK Google\" command. Much quicker to respond to voice commands than the HTC One M9. \n\nVoice commands aside, it's much more smooth and enjoyable than the M9, although I'm sure that has a lot to do with running stock Android vs SenseUI.", "time": "24th October 2016, 03:05 AM", "postID": "post69276789", "replies": [{"text": "It's mostly when the phone is off that the performance of assistant sucks for me. I hate having to introduce a pause between OK google and the actual command. By the time my pixel is \"ready\" for the command, my nexus 7, pixel C and nexus 6p are already searching for the request. While those other devices listen without the need for pause, the pixel phone requires the pause---or only catches the tail end of the request. Very annoying. I expected this phone to perform optimally in all cases given it prices and \"pixel\" branding. The tablet and laptop (pixel 2015) are so much nicer.", "time": "24th October 2016, 03:03 PM", "postID": "post69284298", "replies": [{"text": "It may get faster as it learns your voice. There is some sort of voice recognition algorithm running in the background. The more you use it, the better it understands your voice.\n\nThe only time I experience lag is when I have music playing from the bottom loudspeaker.  I may have to say \"OK, Google\" a couple of times for it to listen to me. The mic and speaker are right next to each other on the bottom of the device.", "time": "26th October 2016, 04:47 AM", "postID": "post69310816", "replies": []}]}]}, {"text": "It's the fastest Android phone I ever used, most recent I used was Note 7 and Nexus 6P. Even after installing Facebook and Messenger, it didn't effect performance a single bit.\n\nI also am consistently astonished at how fast the Assistant is at waking and responding to me. I had to actually train myself not to pause between saying \"OK Google\" and issuing the command.", "time": "24th October 2016, 03:44 AM", "postID": "post69277126", "replies": []}, {"text": "Things are fast. Assistant responds to me way faster than on my Nexus 5. It also better lets me pause briefly which helps when voice inputting a 5 digit number followed by a 3 digit number (transit schedule SMS service).\n\nMultitasking is very fast. Boot time is faster than any phone I've had. Wifi and network speeds are suitable.", "time": "24th October 2016, 06:55 AM", "postID": "post69278675", "replies": []}, {"text": "This thing is lightning quick! only slow down i see are the 3rd party apps that are not optimised for 7.1 yet", "time": "26th October 2016, 02:37 PM", "postID": "post69317146", "replies": []}, {"text": "day to day use is quick.. but loading Games sucks!! it's far behind S7 as well as OP3. weird!", "time": "31st October 2016, 09:49 AM", "postID": "post69388919", "replies": []}, {"text": "Has anyone else had noticeable speed drops using T-Mobile? Not sure if it's the phone or the service. I sold my old phone and can't test it out. I used to get 10+ Mbps in the Dallas with a OnePlus 3 but the Pixel has been running about 2 Mbps or less most of the time.", "time": "31st October 2016, 07:26 PM", "postID": "post69396988", "replies": []}, {"text": "Anyone coming from the HTC one m8 or the HTC 10 that can speak about performance difference? \n\nCheers", "time": "14th November 2016, 09:23 PM", "postID": "post69622066", "replies": [{"text": "Coming from m8. The pixel is way faster + camera opens almost instantly. The only issue I have with my 3 weeks old pixel is battery life is super. Considering I hate big phones I would rather remain with the pixel. The pixel just works !!!", "time": "15th June 2017, 10:35 AM", "postID": "post72680294", "replies": []}]}, {"text": "Neither of those but S6 and 6P. The Pixel is in a whole different league.", "time": "15th November 2016, 03:26 AM", "postID": "post69625660", "replies": []}, {"text": "The pixel is blazing fast. pretty much. Nothing slows this thing down.", "time": "16th November 2016, 12:50 AM", "postID": "post69641366", "replies": []}, {"text": "I have t-mobile and I hit 40 down in a lower signal area. that being said when I first got the phone and I was installing apps, I hit the install button, blink and it would change to \"open\" in the play store. stoooopid quick", "time": "16th November 2016, 07:22 PM", "postID": "post69654054", "replies": []}, {"text": "one of the fastest and smoothest ive had.  hate to say it but my old honor 8 seemed to perform better as far as fluidity.", "time": "7th December 2016, 12:56 AM", "postID": "post69964941", "replies": []}, {"text": "Never had a phone for fast in my life. Significantly faster than LG V20, Note 5, Note 7, S7. It's just ridiculous, honestly.", "time": "12th January 2017, 03:21 AM", "postID": "post70512720", "replies": []}, {"text": "Usually when I get a new phone, by 3 weeks I've loaded it down with apps and it already feels slow. But the pixel is still hitting strong, still impressed", "time": "12th January 2017, 04:57 AM", "postID": "post70513412", "replies": []}, {"text": "coming from iphone 6s - s7 - pixel. i always wanted to have a iphone with android OS, Finally im seeing that in pixel. Its butter smooth & no matter what app i open! it opens instantly. in <3", "time": "19th January 2017, 06:12 AM", "postID": "post70621983", "replies": []}, {"text": "I get the occasional lag, but overall this phone is really fast and performs very well.", "time": "31st January 2017, 12:08 AM", "postID": "post70807465", "replies": []}, {"text": "I have my pixel since a week and still, I can't believe what I'm seeing  I had the 6P and that was already fast, but this little thing is something completely different. I never experienced something like this with any phone before. I press, and it happened. Open apps that took 2-3 seconds on the 6P in a blink of an eye. Scroll through huge, still loading webpage in chrome, no problem, not even a small lag, nothing.\r\nThis thing was damn expensive, but I must say it was worth every dime I payed. Different league camera, display is beautiful, nice build quality, screen on times around 6-7 hours with my usage??!?!  just love it! I love to pick it up and use it!", "time": "2nd February 2017, 02:41 PM", "postID": "post70846884", "replies": []}, {"text": "Pixel is awesome.. I just feel like when I type I touch wrong letters more than I do in others phone..  don't know why o.O", "time": "9th February 2017, 04:19 AM", "postID": "post70946211", "replies": []}, {"text": "Performance has been excellent. I'm even on the Android O developer preview, and I haven't had any slow downs.", "time": "25th July 2017, 02:09 AM", "postID": "post73156604", "replies": []}, {"text": "Performance has been phenomenal. I cannot fault it. I've used alot of devices running Android in the past and this is by far the best.", "time": "15th August 2017, 03:09 AM", "postID": "post73405328", "replies": []}]}, {"title": "App launch speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/pixel/review/app-launch-speed-t3484806"], "threads": [{"text": "The double tap recents is INSANELY fast - noticeably moreso than the LG V20, which also ran Nougat with the same hardware, basically. \n\nOverall apps open at blistering speeds.", "time": "12th January 2017, 03:29 AM", "postID": "post70512779", "replies": []}]}, {"title": "Multitasking/RAM", "rating": 5.0, "links": ["https://forum.xda-developers.com/pixel/review/multitasking-ram-t3484807"], "threads": [{"text": "Just got a 5\" pixel, I'll share my 2 cents. Not much to say, this phone runs like a champ. I was used to 2 gigs of RAM and I can say that Oreo 8.1 on this phone is a completely different experience compared to the  custom ROM of the same OS version on my previous Moto X 2014.\nApps just stay there in your recents and never bail unexpectedly. Launches and switches are super fast and smooth.", "time": "31st January 2018, 08:50 PM", "postID": "post75401299", "replies": []}]}, {"title": "Scrolling smoothness", "rating": 5.0, "links": ["https://forum.xda-developers.com/pixel/review/scrolling-smoothness-t3484808"], "threads": [{"text": "First time I've ever owned an Android phone as smooth as an iPhone. That says it all.", "time": "12th January 2017, 03:30 AM", "postID": "post70512785", "replies": []}]}, {"title": "Heat", "rating": 4.0, "links": ["https://forum.xda-developers.com/pixel/review/heat-t3484809"], "threads": [{"text": "I have felt heat on my ear during a phone call when Facebook Messenger is receiving messages (once off) - but doesn't get as warm as my Galaxy S6 in general use", "time": "28th October 2016, 12:26 AM", "postID": "post69341513", "replies": []}, {"text": "I've felt heat using GPS navigation through Sygic and Here maps. Otherwise it's cool as a cucumber.\n\nSo it's an 8. A 10 is obviously when it doesn't heat up under any stressing.", "time": "29th October 2016, 08:16 PM", "postID": "post69366809", "replies": []}, {"text": "3-4 try using this thing and charging maybe be able to fry a egg on it", "time": "31st October 2016, 02:59 AM", "postID": "post69385611", "replies": [{"text": "This statement cracked me up lols.", "time": "16th September 2017, 10:56 AM", "postID": "post73812479", "replies": []}]}, {"text": "When I just browse the internet it feels hot.", "time": "26th June 2017, 03:54 PM", "postID": "post72811812", "replies": [{"text": "Same, phone gets hot very quick in the summer (about 30°C outside Temp)...", "time": "28th June 2017, 04:22 PM", "postID": "post72836727", "replies": []}]}, {"text": "Surprisingly cool on my end. It is also Winter down here in Aus so that could count for it however even if warm and host conditions here, it has maintained a cool temperature for me.", "time": "15th August 2017, 03:47 AM", "postID": "post73405544", "replies": []}]}, {"title": "Low light", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel/review/low-light-t3484810"], "threads": [{"text": "Latest update has left my phone with HORRIBLE banding issues in lower light.", "time": "25th December 2016, 07:18 AM", "postID": "post70244800", "replies": []}]}, {"title": "Photo quality", "rating": 5.0, "links": ["https://forum.xda-developers.com/pixel/review/photo-quality-t3484811", "https://forum.xda-developers.com/pixel/review/photo-quality-t3484811/page2", "https://forum.xda-developers.com/pixel/review/photo-quality-t3484811/page3", "https://forum.xda-developers.com/pixel/review/photo-quality-t3484811/page7"], "threads": [{"text": "I'm personally really liking the camera. Camera is always my top priority and I've gone through five phones in the past year trying to find the complete package. I'm coming directly from a S7. While I wish the main camera has a few more trucks up its sleeve it is quick and I love how it animates and names collages etc from the app instead of having to upload the photos to google photos and do the processing there.\n\nI'll be putting up random shots over the next few days in my Google Photos folder: https://goo.gl/photos/vYAoiyxMw5VGSGPHA     I tried attaching many of the shots but XDA yells at me for going over the size limit!", "time": "21st October 2016, 04:30 PM", "postID": "post69238807", "replies": []}, {"text": "It's good. On par with my s7 edge other than maybe having better dynamic range.", "time": "22nd October 2016, 02:07 AM", "postID": "post69245701", "replies": []}, {"text": "I'm really torn between my S7 and my Pixel for image quality tbh, I did quite a few comparisons on a blog this afternoon, results are here\n\nhttps://carljones.wordpress.com/2016...l-vs-galaxys7/\n\r\nAttached a few thumbnail images, full-size ones on blog post.\n\r\nIn some instances I prefer the pixel, in others the galaxy, I wish the built-in camera app on pixel had a pro/manual mode.", "time": "22nd October 2016, 05:41 PM", "postID": "post69255315", "replies": [{"text": "Thanks for the comparisons. Do you have a favorite yet? I'm torn between the Pixel and S7, too (plan to buy one of them). \n\r\nMy biggest problem with the S7 images I've seen is the same problem that I hate on my current Sony -- oversharpening artifacts on most high-contrast edges and aggressive, detail-destroying noise reduction in lower-light images. Sure, low noise and sharp edges make a photo look nice and punchy on a 5\" phone screen, but zoom in even a little or view on a monitor and they can look horrendous IMO. Yes the S7 can capture RAW, but not in auto mode.\n\r\nThe Pixel seems to avoid both those problems to some degree and to my (photographer's) eye they just look more natural and more like something approaching the output from a dedicated camera (although obviously there's no way phone-camera output can really compare to a DSLR). My opinion is that you can always sharpen and punch up the vibrancy of an image, but you cannot un-sharpen or punch-down an image. Ultimately, I'd rather have the control.", "time": "14th November 2016, 05:43 PM", "postID": "post69618836", "replies": []}]}, {"text": "The low light performance is night and day (if you'll pardon the pun) coming from a Moto X 2014. Fast and sharp, which comes in handy when trying to grab shots of my hamster. Resolution not original but this is in VERY low light.", "time": "22nd October 2016, 11:12 PM", "postID": "post69259372", "replies": []}, {"text": "I have had the S7 Edge, S7, Note 7 and now the Pixel. Had the S6 Edge before that as well as an Honor 8 with its dual camera. Basically, I too have tried nearly every phone that's been out this year looking for the best camera as that's the most important thing to me too. \n\r\nI never quite liked the S7 camera despite the reviews and ratings. What the reviews don't tell you is that the f 1.7 aperture means a very very narrow 'field of focus'.  i.e., large parts of the same photo will be blurry / out of focus. I am not talking about depth of field, I am well aware of what that is and the implication of the f 1.7. Depth of field applies to macro shots. What I am talking about is different parts of photos being out of focus even for landscape shots or general everyday shots where the entire photo is expected to be in focus. \n\r\nI got around this with my S7 era cameras by using pro mode and multi-AF with matrix metering. But pro mode cannot be set as default, so you had to launch the app and manually switch to pro mode each time. \n\r\nAnyway, I like the Pixel camera a lot. I think an f 2.0 is a good spec for a camera phone. Anything higher than that comes with too many compromises. There has been a lot of advancement in 2016 in smartphone camers, but they are all around the 12 mp resolution. I'd like to see the same advancements (PDAF, LAF, dual pixel etc.) be made with higher resolution. You can only get so much detail from a 12 mp sensor...", "time": "23rd October 2016, 08:37 PM", "postID": "post69273137", "replies": []}, {"text": "Come on guys dont be cheap, lets see it!", "time": "24th October 2016, 03:35 PM", "postID": "post69284773", "replies": []}, {"text": "[COLOR=\"Silver\"]", "time": "24th October 2016, 06:38 PM", "postID": "post69287686", "replies": []}, {"text": "", "time": "25th October 2016, 03:15 AM", "postID": "post69293626", "replies": []}, {"text": "Snapped these last night downtown.", "time": "25th October 2016, 12:58 PM", "postID": "post69299259", "replies": []}, {"text": "Sorry, wrong forum/post.", "time": "26th October 2016, 12:30 AM", "postID": "post69308716", "replies": []}, {"text": "Took these just for the ****s of it", "time": "28th October 2016, 06:02 AM", "postID": "post69344161", "replies": []}, {"text": "I've been mostly pleased with the Pixel's camera.  It's very *good*.  But after a week using it alongside my S7 and iPhone 7, I'd still rather have either of those in my pocket as my day to day shooter.  The Pixel tends to take dimmer/darker shots because it's trying so hard to balance out dynamic range.  This can make for some really great shots, but it can also really underexpose if there's a focal point (like, I don't know, a person?) in the shot you're taking.  The Pixel also struggles with auto-focus, or its auto-focus simply isn't very intelligent.  \n\nExample, kids within a couple of feet of me... 5 shots with the Pixel, each one of them came out underexposed and with their faces blurry, even when I tried to get it to re-focus.  My iPhone 7 got them in one shot and properly exposed their faces.  In those shots, the Pixel's shots looked great in the background of the photo, but the focus of the pictures were not well-handled.  The iPhone 7's shot overexposed the background a bit, but it nailed the focus of the pictures the first time.  \n\nIt's a very good camera, but I think it's still a step below the top flagships from Samsung and Apple right now, when taking into account all aspects of the cameras.", "time": "29th October 2016, 05:45 AM", "postID": "post69357311", "replies": []}, {"text": "Examples?", "time": "29th October 2016, 07:09 AM", "postID": "post69357966", "replies": []}, {"text": "Okay so I'm gonna put it out there. I found my Nexus 6P camera perform better than the Pixel. In fact, I'm gonna say that in some low light conditions, my wife's iPhone 6 Plus performed better, which hasn't been true for me in the last 2 years.\n\nRegarding autofocus in VIDEO, it absolutely nails it and I could not get it to fault. I was able to get it very close to the subject too. I find in shooting PICTURES only, the autofocus is not as reliable. Besides, the HDRa is actually not as good as HDR+. I thought they made HDR ALWAYS ON but it seems this isn't the case. I also found the frame rate switching to be a pain in video. You have to back out of the viewfinder to settings of the app and choose the resolution for the right FPS options to show. \n\nI will share some comparisons with the Pixel v the 6Plus later tonight.", "time": "29th October 2016, 08:46 PM", "postID": "post69367155", "replies": []}, {"text": "Has anyone had issues with bad stitching for panorama shots? Everyone I've taken has had some pretty bad misalignment. I understand you want to keep the phone in relatively the same spot the whole time and that the closer things are the harder it is to get it right, but even my co workers S5 takes better panorama shots than this...\n\nEdit: I should also note I'm using the stock Google camera panorama option and set the quality to \"high\". App looks like it's up to date.\n\n*Attached a sample image*", "time": "1st November 2016, 06:18 PM", "postID": "post69412608", "replies": [{"text": "yes, but this is not new to the pixel.  my nexus 5X (and i understand the 6P, and even previous nexus/google phones) had the same issue.  no matter how well i align, it seems to always stitch poorly.  What's odd is that if you use the Photosphere mode to take the same \"panoramic\" shot, the stitching is vastly improved.  I'm still very surprised this doesn't surface in the reviews.  maybe no one takes panoramas anymore?  maybe you and I are just really bad at it?!", "time": "2nd November 2016, 12:20 PM", "postID": "post69423925", "replies": [{"text": "Ah, ok, I'll give photosphere a shot. Yea I'm surprised I haven't seen more people complain about it. Or maybe it really is just us 😆", "time": "2nd November 2016, 12:29 PM", "postID": "post69424015", "replies": [{"text": "agreed.  even trying/having luck with photosphere isn't the solution, this should just work.  I was definitely disappointed after my initial use of the camera being so positive, then a few days later realizing the basic panorama stitching was still crappy.  good thing is these things are typically almost completely software related, bad thing is there's strangely no push for google to improve it.", "time": "2nd November 2016, 12:32 PM", "postID": "post69424058", "replies": []}]}]}, {"text": "Yes I have this issue too ☹️", "time": "3rd November 2016, 06:36 PM", "postID": "post69445829", "replies": []}]}, {"text": "Camera is superb - a real step up from my Z5C.\n\nhttps://goo.gl/photos/NLgX9Pez2MCs49q48\n\nI also have the problem with panoramas - out of 5 panorama shots I've taken, only one has been stitched together properly!", "time": "8th November 2016, 06:30 PM", "postID": "post69523254", "replies": []}, {"text": "Interested to hear more about comparisons with the S7. Coming from a Z3c I know either will be a step up, but having played with the S7 camera I really like the output and simplicity yet power of its manual UI (I'm always messing with EC in shots)", "time": "12th November 2016, 12:14 AM", "postID": "post69576547", "replies": []}, {"text": "Found this on FaceBook, some nice photos.\n\nhttps://www.facebook.com/Google-Pixe...2454066221519/", "time": "13th November 2016, 05:24 PM", "postID": "post69602342", "replies": []}, {"text": "I just took a quick snap out of the car this morning. The image is not edited and used HDR automatic.", "time": "24th November 2016, 08:25 AM", "postID": "post69767802", "replies": []}, {"text": "Pretty impressed", "time": "24th November 2016, 03:47 PM", "postID": "post69772817", "replies": []}, {"text": "I'm not liking the camera as much as my Nexus 6,i have snakes and am always taking pictures but the pixel always seems to focus on the stuff in the shot I'm not fussed about ,I'm sure after more playing about I'll get used to it but at the moment kinda disappointed", "time": "25th November 2016, 02:10 PM", "postID": "post69785929", "replies": [{"text": "This has been my experience as well, though not compared to a N6 - but compared to a S7 and iPhone SE, and briefly with an iPhone 7.  \n\r\nThe Pixel simply has trouble with autofocus in certain scenarios.... and we're not talking overly difficult scenarios either (I've had three different ones to test as well). It was briefly mentioned in multiple reviews, and I see it time and again in threads like these, but it's just glossed over because... Pixel!!  But I see so many photos that look like that snake photo - at a quick glance it might look nice, but if you look at it for more than a second you'll see the snake's head / face are not in focus at all. \n\r\nThe Pixel's software trickery gives it the ability to make some photos look pretty incredible. But I have quite a few shots (mostly indoor in medium to decent light) where it's trying so hard to make the whole photo look good, it misses the fact (even if I tap to focus) that my kids' faces are in the shot. That never happens on the SE or S7.    \n\r\nAlso, maybe my habits are unique, but I almost always look at the photo right after I take it to see how it turned out. So the HDR+ processing slow down is still a nuisance, even if it lets make take a few shots quickly. \n\r\nIt just feels like Google is forcing the hardware to do so much trickery with its software that it fails hard from time to time. It's a good camera, but I'm surprised time and again at the high praise it gets. It's not THAT good, and misses on the basics in many instances.\n\r\nSorry, that turned into a mini-rant because I like the Pixel overall, and I'm disappointed at issues like this (and Bluetooth issues with my car) that have me missing my other phones...", "time": "3rd December 2016, 01:30 PM", "postID": "post69909566", "replies": []}]}, {"text": "Lens blur feature is pretty sweet", "time": "26th November 2016, 09:09 PM", "postID": "post69806687", "replies": []}, {"text": "", "time": "29th November 2016, 09:37 AM", "postID": "post69845204", "replies": []}, {"text": "when I try to get close to get a nice clear headshot it focuses on my hand or whatever the snake is on still not getting as good shots as my Nexus 6", "time": "3rd December 2016, 10:56 AM", "postID": "post69908033", "replies": []}, {"text": "Love this phone,its even better than my s7", "time": "30th January 2018, 05:08 AM", "postID": "post75380100", "replies": [{"text": "It was always better than the s7!!!", "time": "10th March 2018, 10:54 AM", "postID": "post75837328", "replies": [{"text": "But not when it comes to manual mode", "time": "11th March 2018, 05:53 PM", "postID": "post75852701", "replies": [{"text": "Hello everyone", "time": "15th March 2018, 05:53 PM", "postID": "post75900634", "replies": []}]}]}]}]}, {"title": "Video quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel/review/video-quality-t3484812"], "threads": [{"text": "So I give videos an 8 out of 10.\n\nThe EIS works brilliantly. Very steady recording. The 60 fps 1080p is uber smooth. \n\nJust very disappointed how the camera app doesn't give a simple frame rate switching button to toggle through all the FPS options instead of requiring you to back out into the settings of the app to switch resolution and then return to change FPS. VERY FRUSTRATING.", "time": "30th October 2016, 02:43 PM", "postID": "post69376899", "replies": []}, {"text": "Video quality is absolutely perfect. I have an SGS7, iPhone 7, and this. Even though this doesn't have ois it still beats the s7 and iphone hands down. The slow motion is 100% seamless.", "time": "31st October 2016, 01:59 PM", "postID": "post69391813", "replies": []}, {"text": "Sometimes when I take a video it will be grainy.  I think it has to do with the lighting but I shot a video for YouTube a couple days ago and it was pretty bad.  Kind of want to reshoot it but I am also pretty lazy.", "time": "9th December 2017, 12:42 AM", "postID": "post74782500", "replies": []}]}, {"title": "Selfie quality", "rating": 5.0, "links": ["https://forum.xda-developers.com/pixel/review/selfie-quality-t3484813"], "threads": [{"text": "Front facing camera seems every bit as good as the rear. Works great in low light as well.", "time": "31st October 2016, 02:01 PM", "postID": "post69391854", "replies": [{"text": "can you please share the example photos in low light situations taken on front facing camera", "time": "6th November 2017, 09:45 PM", "postID": "post74429512", "replies": []}]}, {"text": "how good is camera after oreo update? Does it uses AI power like pixel 2 does?", "time": "12th November 2017, 05:54 AM", "postID": "post74485756", "replies": []}]}, {"title": "Time to take picture (camera launch speed)", "rating": 5.0, "links": ["https://forum.xda-developers.com/pixel/review/time-to-picture-camera-launch-speed-t3484814"], "threads": []}, {"title": "Software (ease of use, features, etc)", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel/review/software-ease-features-t3484815", "https://forum.xda-developers.com/pixel/review/software-ease-features-t3484815/page2"], "threads": [{"text": "To sum up , This is a no compromise camera!", "time": "26th October 2016, 03:59 PM", "postID": "post69318318", "replies": []}, {"text": "Coming from a Moto X '14 which had outstanding camera software I'm disappointed with the Pixel. You could do almost everything one handed on the MX14 from zooming in/out to taking a picture by touching the screen.  Just yesterday I realized that I can't draw on pixel photos either.  Hoping they add some usability features because the hardware is great.", "time": "30th December 2016, 01:45 PM", "postID": "post70318883", "replies": []}, {"text": "The pics looks nice and crisp to me after I take them, low light detection still sucks like most other cameras. Colors are decent and hold up when I display them on a 4k monitor. I must say I like the speed, when I want to capture a moment it takes the pic right away. When I get close to an object it actually focuses where my buddy's Nexus 6 had issues with that. It seems like an improvement but there is still some features they can add. One handed operation would be nice.", "time": "3rd January 2017, 01:12 PM", "postID": "post70373855", "replies": []}, {"text": "When on home screen, Google assistant always detect \"ok Google\" even though I have turned it off in settings... Serious privacy concern!!... Does this really hear me fart!\n\nAny solutions? \n\nEven, I can see that the phone is never in sleep state and is always awake..\n\nAny help?", "time": "4th January 2017, 04:17 PM", "postID": "post70391662", "replies": []}, {"text": "I just got Google pixel yesterday.\nI am trying to play 4k video on YouTube but for some reason there is no 4k option in quality.\n\nwhat am I missing ?", "time": "10th March 2017, 09:58 PM", "postID": "post71372876", "replies": [{"text": "not all videos on YouTube have 4k resolution", "time": "16th March 2017, 07:22 AM", "postID": "post71450438", "replies": [{"text": "I tried videos that are 4k but pixel doesn't​ show 4k option.", "time": "16th March 2017, 01:02 PM", "postID": "post71453455", "replies": [{"text": "The pixel is not physically capable of displaying 4K video, so that's probably why you don't get that option.", "time": "17th March 2017, 12:51 AM", "postID": "post71461859", "replies": [{"text": "iPhone 7 has only 720p display.  It can still play 4k video.\nGoogle just have to enable the 4k option for 1080p androids.", "time": "17th March 2017, 02:30 PM", "postID": "post71468609", "replies": [{"text": "Is there any benefit to playing 4K video on a lower resolution display? Maybe you could perceive a difference in 4K video on a 1080p 20\" or larger screen, but I don't that's the case on a phone. Just seems like a waste of bandwidth at that point for google and the end user.", "time": "17th March 2017, 10:34 PM", "postID": "post71474463", "replies": []}, {"text": "no it can not. it can play downscaled video to 720p but you would get no benefit over watching the original 720p video.\n\r\napple will sell you a 5 gallon bucket that holds 20 gallons too.", "time": "20th March 2017, 11:09 PM", "postID": "post71516780", "replies": []}]}]}]}]}]}, {"text": "pixel is fullHD bro, but it can capture 4k video", "time": "16th March 2017, 03:29 AM", "postID": "post71448867", "replies": []}, {"text": "I have a nexus 5x. I didn't realize that there are differences now. Before to just flash twrp su then you are done. I read there are 2 slot sorts something so twrp needs am IMG and zip.", "time": "18th March 2017, 09:20 PM", "postID": "post71487178", "replies": []}]}, {"title": "Charging speed", "rating": 4.0, "links": ["https://forum.xda-developers.com/pixel/review/charging-speed-t3484816"], "threads": [{"text": "Charging speed is amazing. Honestly the quickest charge out of any piece of technology I have ever used. The battery life you get from the amount of time you take to charge is absolutely phenomenal.", "time": "15th August 2017, 03:49 AM", "postID": "post73405563", "replies": [{"text": "I'm not using the OEM Google Pixel charger and just using a Samsung Fast Charger, and when connected the Pixel indicates \"slow charge\".", "time": "31st October 2017, 02:04 PM", "postID": "post74357846", "replies": []}]}]}, {"title": "Screen on time", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel/review/screen-time-t3484817", "https://forum.xda-developers.com/pixel/review/screen-time-t3484817/page2", "https://forum.xda-developers.com/pixel/review/screen-time-t3484817/page3", "https://forum.xda-developers.com/pixel/review/screen-time-t3484817/page10"], "threads": [{"text": "I will post later today after I fully charge. But I lost about 10% during initial setup and downloading apps. Less than 10 minutes SOT, hardly a fair reflection of endurance yet though.\n\n\nSo far:\n\n\n\n\n\nLooks like about 5hrs is what it will trend down to. Which... Is OK.", "time": "21st October 2016, 05:12 PM", "postID": "post69239510", "replies": []}, {"text": "Is this XL or the smaller version?", "time": "21st October 2016, 08:02 PM", "postID": "post69241972", "replies": [{"text": "Small one.", "time": "21st October 2016, 08:03 PM", "postID": "post69241988", "replies": []}]}, {"text": "https://goo.gl/photos/tUby63bQYQuVAr1Y9 much better then 5 hours screen time on way", "time": "22nd October 2016, 02:24 AM", "postID": "post69245824", "replies": [{"text": "How did you set your phone up?", "time": "22nd October 2016, 02:25 AM", "postID": "post69245837", "replies": []}]}, {"text": "Nothing special at all. No battery saving modes. I do like to have wifi and Bluetooth calling turned off. Do u know how to enable battery percentage in battery bar as u see?\n\n---------- Post added at 02:33 AM ---------- Previous post was at 02:32 AM ----------\n\nWifi and bluetooth scanning what I meant", "time": "22nd October 2016, 02:33 AM", "postID": "post69245889", "replies": [{"text": "I'm no where near what your getting. I'm at 50℅ with 2.5hrs sot.", "time": "22nd October 2016, 02:43 AM", "postID": "post69245977", "replies": []}, {"text": "1. Pull down the notification shade.\r\n2. Press and hold the cog. It should start spinning (probably hold for 5 sec?)\r\n3. It should take you to the System UI Tuner - select status bar\r\n4. Scroll towards the bottom and find Battery and change it to Always show percentage", "time": "16th November 2016, 11:00 PM", "postID": "post69656820", "replies": []}]}, {"text": "First full day for me. It's about what I would expect to be honest. Everything is on except for drive backup and wifi, Bluetooth, nearby scanning.", "time": "22nd October 2016, 04:58 AM", "postID": "post69246909", "replies": []}, {"text": "The Pixel (non XL) hasn't been looking great for me. Here's my second and third days with the phone (i.e. the days after the one I spent installing everything and playing a lot with the \r\ncamera).\r\nFirst Full Day\n\n\r\nSecond Full Day", "time": "22nd October 2016, 08:37 AM", "postID": "post69248547", "replies": []}, {"text": "Jasestu, \n\nI think your 2nd day results are pretty good. 3.5 hours of SOT and 22% battery left means you should be able to get at least 4.5 hours or more for a 2770 mah battery. That's in par with my S7.", "time": "22nd October 2016, 01:55 PM", "postID": "post69251981", "replies": [{"text": "OK, so it's probably a case of needed to recalibrate myself after the Z3 Compact - I get twitchy if the phone ever got as low as 35% by the end of a day....", "time": "22nd October 2016, 08:13 PM", "postID": "post69257467", "replies": [{"text": "Curious to hear more about your impressions of battery life (and other aspects) of the Pixel vs the Z3c. \n\r\nI have a dying Z3c and am considering the Pixel and S7 (since the Sony Xc is so uninspiring), but the two things that worry me about both are battery life and whether I'll get used to the larger size. The Z3c has spoiled me in terms of battery life... 6-7 hours of SoT over 2-3 days between charging is typical for me.", "time": "11th November 2016, 11:56 PM", "postID": "post69576412", "replies": []}]}]}, {"text": "This is from yesterday, my first full day with the phone after getting it Thursday.  About a half hour of a graphic heavy game, over an hour of YouTube, some Netflix casting.  Navigation was on for maybe 20 minutes, Bluetooth was on  all day, streaming gpm and podcasts.  Screen brightness was 50% most of the day.  Power saving mode was on from 15% until I plugged in at 4% and took these screenshots.", "time": "22nd October 2016, 05:15 PM", "postID": "post69254918", "replies": []}, {"text": "And here's today's stats.", "time": "22nd October 2016, 09:09 PM", "postID": "post69258116", "replies": []}, {"text": "Not gonna get too ahead of myself but it does appear that battery life is improving as the days go by and the OS settles. I'm hoping to consistently get 4+ hours SOT. That would be an improvement over my 6P (3–4 hours SOT since Nougat) and I'd be content with that.", "time": "22nd October 2016, 10:55 PM", "postID": "post69259242", "replies": []}, {"text": "Today is my first full day with the phone (basically all setup completed yesterday eve), and I'm currently at 4+hr SOT with 31% battery left. I spent about an hour (edit:*talking*) on the phone, listened to a bit if music, wandered around this AM taking photos, and spent a ton of time if Facebook and Reddit.  This is WAY better than my 5x, which was struggling to hit 2.5 hrs on a full days' use. Things to consider: it's Saturday and I'm not getting work emails all day, but also I typically expect worse battery life early on as OS is settling in.  So far, this is more than u was expecting and is a great early indicator. Even if I only get 4-5hr SOT long term, is still be quite happy with that. Trending for 5-6 is just stellar!", "time": "22nd October 2016, 11:15 PM", "postID": "post69259394", "replies": []}, {"text": "https://goo.gl/photos/ZEifip3kRHXXuVDK7 wow this battery life is crushing what I got even on my note 7. 89% left just went over 1 hour SOT. Well on way to 5-6 hours or more easy. The sleep mode is insane overnight", "time": "23rd October 2016, 12:17 AM", "postID": "post69259877", "replies": [{"text": "What's your usage like? And have you been on  LTE the entire time?", "time": "23rd October 2016, 06:23 AM", "postID": "post69262687", "replies": []}]}, {"text": "Not bad I'd say", "time": "31st October 2016, 03:12 AM", "postID": "post69385689", "replies": []}, {"text": "First day usage. I'd say it's pretty decent\n\r\nedit: Didn't realize my image didn't insert in initial post", "time": "10th November 2016, 08:21 PM", "postID": "post69557622", "replies": []}, {"text": "By 2pm yesterday I had 1.5 hours of screen on time and 30% battery left.  Something is killing mine quick.  What's the best way outside of the default battery app?  It didn't show anything being too crazy (the screen was still the top battery item).", "time": "12th November 2016, 03:11 PM", "postID": "post69584906", "replies": []}, {"text": "I have both the Google Pixel 128gb and S7 for Verizon. I really like the pixel. I feel the finger print scanner on the back is just right. For me I'm torn on the camera. The pixel has a great camera. I go on a lot of vacations and I love the S7 for pool photos. I know it's been said but of the pixel had a water resistant rating like the S7, I would sell my S7. For that one reason and I'm thinking of selling /returning the pixel. \n\nBattery life for me has been phenomenal especially if I take it off the charger at night and go through the next day.", "time": "12th November 2016, 11:25 PM", "postID": "post69591168", "replies": [{"text": "Pixel is apparently not only splashproof but waterproof as well. Check out this video of it submerged under water for 1 hour: https://www.youtube.com/watch?v=YojQneS6Yts", "time": "15th November 2016, 12:15 PM", "postID": "post69630871", "replies": []}]}, {"text": "u guys all have yr phone rooted?\nor thatz the sot of an unrooted device?", "time": "15th November 2016, 11:45 AM", "postID": "post69630535", "replies": []}, {"text": "Does my battery sucks ?\r\nI charged it just before going to bed.\r\nGot the entire day with some screen / chat / video, some LTE but mainly wifi (Location = high accuracy, Bluetooth always on for my watch)\r\nSo here I land, 18h later\n\r\nI feel like my S7 edge is way better, I prefered to get home with 40% battery than having this 20% ****nitz", "time": "15th November 2016, 07:51 PM", "postID": "post69637894", "replies": [{"text": "18 hours with 3.5 hours of SOT and 25% left isn't bad. That means you might be able to hit 5hrs SOT and a full day. That's good! Not the best but much better than average.\n\n---------- Post added at 03:10 AM ---------- Previous post was at 03:07 AM ----------\n\n\n\r\nThat doesn't mean it's waterproof. That means the phone is pretty resilient but nobody has a clue if there is any damage. Speaker may be warped now or the phone may die in a month. Just because it still works doesn't mean the phone is waterproof. That's like saying if you shoot me in the arm and I'm still alive that I'm bulletproof. That's insane! Don't jump to such a silly conclusion.", "time": "16th November 2016, 02:10 AM", "postID": "post69642023", "replies": []}]}, {"text": "Battery life is great for me. So far anyway. Last night I had 23 hrs on the battery, 6 hrs and 15 minutes of on screen time and the battery was at 19%. I didn't really play any games other than a few games of solitaire. Mostly just messing around with the phone. Changing settings, browsing the web, Facebook, downloaded a few apps, a few texts here and there and watched a couple YouTube videos. That type of thing.  However, it remains to be seen if it continues. I don't have an awful lot of apps installed on it yet. Guessing the battery will go faster as I install more apps. Time will tell I guess.", "time": "23rd November 2016, 04:50 PM", "postID": "post69758693", "replies": []}, {"text": "I have Pixel 32GB version. It js getting very warm even on very little use.  Also I think bttery is draining faster.  PFA images.", "time": "29th November 2016, 09:54 AM", "postID": "post69845406", "replies": []}, {"text": "Incase anyone else is wondering, I just switched from the regular Pixel to the Pixel XL and the battery life immensely improved.\n\nPixel: 4-6 hrs OST\nPixel XL: 7-8.5 hrs OST", "time": "30th November 2016, 10:32 AM", "postID": "post69861396", "replies": []}, {"text": "My screen on time since last charge says 5 hrs 45 min but I've only been using it for about 20 minutes? It's been in my bag for over 5 hours and my battery is under 50% now!", "time": "3rd March 2018, 05:56 AM", "postID": "post75754419", "replies": []}, {"text": "My Sot", "time": "3rd March 2018, 09:42 AM", "postID": "post75756038", "replies": [{"text": "u think it is bad or just ok?", "time": "8th March 2018, 03:13 AM", "postID": "post75811386", "replies": [{"text": "AFAICT,his SOT is average (?)\n\r\ncomparing SOT is hard though. people have different usage and habits. different workloads are going to affect power consumption in different ways..... so there's no proper comparison here....\n\r\nmyself, I usually get between 6-7hrs SOT. which I think is pretty good, but I base saying that by comparing using stock kernel VS. my own kernel (which is a fair comparison, since usage/habits are still the same..)... \n\r\non stock kernel I get roughly 5hrs... so getting the extra 1-2hrs on my own kernel, which is pretty decent for me.", "time": "9th March 2018, 12:49 AM", "postID": "post75821986", "replies": []}]}]}]}, {"title": "Standby drain", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel/review/standby-drain-t3484818", "https://forum.xda-developers.com/pixel/review/standby-drain-t3484818/page2", "https://forum.xda-developers.com/pixel/review/standby-drain-t3484818/page3"], "threads": [{"text": "First night dropped 12% in 6 hours. Not impressed. But I gotta break in that battery.", "time": "24th October 2016, 04:50 AM", "postID": "post69277649", "replies": []}, {"text": "I've been losing around 3 % to standby drain over my typical heavy 9 hour sleep (Rx induced)!\n\nI've had mine since last Tuesday.\n\n5\" Pixel version.\n\nBattery doesn't seem to go down unless I really get on device for a couple minutes.\n\nWheee!", "time": "24th October 2016, 06:46 AM", "postID": "post69278598", "replies": []}, {"text": "Last night my pixel went down 2% over about 7.5 hrs so the standby time is pretty good.", "time": "24th October 2016, 05:51 PM", "postID": "post69286983", "replies": []}, {"text": "My Pixel actually dozed for it's first night. We'll have to see if it keeps going. My N5x gave up dozing a long time ago.", "time": "25th October 2016, 06:31 AM", "postID": "post69295241", "replies": []}, {"text": "The doze mode has been great for me so far.  Standby time is better than any other android phone I've used.", "time": "26th October 2016, 06:22 PM", "postID": "post69320572", "replies": []}, {"text": "From my other reply:\n\nBattery has been pretty good for me so far.  Seems to be settling in with optimization after a few days.  Dropped 0% overnight last night which is awesome.  \n\nGSAM Monitor is saying my average is 19 hrs on, 4.5 hours of screen on time usage, 1-2 hours of screen off usage like phone calls, music. \n\nEDIT:  I also have pretty crappy signal at work.", "time": "27th October 2016, 12:55 AM", "postID": "post69325352", "replies": []}, {"text": "Stand by time hasn't been a real problem for awhile. My Nexus 5 on KitKat and Lollipop(both before Doze) and only a 2,300mAh would only drop 2-3% over 8 hours. It's usage time that really matters.", "time": "27th October 2016, 08:25 AM", "postID": "post69329088", "replies": []}, {"text": "Mine dropped about 10% the first night (Mon 24th), but I do live in an area that has poor reception. Have to place phone next to window just to get text and calls. If I go outside I may get LTE at 1 or 2 bars. Overall though battery hasn't been an issue and I love the rapid charging.", "time": "27th October 2016, 01:32 PM", "postID": "post69332455", "replies": []}, {"text": "Am I the only person that turns their phone off at night?!", "time": "27th October 2016, 03:07 PM", "postID": "post69333831", "replies": [{"text": "Good lord man!\n\nMy phone is my alarm clock, so I couldn't do that if I wanted to.", "time": "27th October 2016, 04:49 PM", "postID": "post69335459", "replies": [{"text": "I'm \"blessed\" with an extremely good body clock, which means I wake up at 6.30 every day without any alarm... Even at the weekends", "time": "27th October 2016, 05:15 PM", "postID": "post69335846", "replies": []}]}, {"text": "Yes ! Now a days u are lmao", "time": "31st October 2016, 03:08 AM", "postID": "post69385671", "replies": []}]}, {"text": "doesn't the alarm still go off when it's turned off? my galaxy note 4 does that", "time": "1st November 2016, 05:16 PM", "postID": "post69411626", "replies": []}, {"text": "Probably.", "time": "1st November 2016, 06:08 PM", "postID": "post69412467", "replies": []}, {"text": "Using Accubattery to measure screen off battery drain I am typically between 75-85ma. Has anyone else measured their standby power consumption, curious what other values are as this seems high to me.\n\nEdit: more info\n\nTested it overnight with and without bluetooth on, got it down to 40ma without bluetooth, averaged 70ma with bluetooth on overnight. Also got to test a Note 4 under the same conditions though without a SIM card. The Note 4 was using 11ma without bluetooth and 18ma with bluetooth on. Both phones connected to the same WIFI the whole time. May have to do a full reset on the Pixel as the standby power consumption is definitely out of hand.", "time": "2nd November 2016, 11:55 PM", "postID": "post69433783", "replies": [{"text": "While I still think the Samsung will have slightly better standby drain, this isn't a good test. You cannot compare a phone with a cell signal to one without. The biggest battery drain on a phone is typically cell signal.\n\r\nIf you pulled the sim card out of the pixel and let the phones sit side by side overnight, that would be something.", "time": "4th November 2016, 11:19 AM", "postID": "post69455409", "replies": [{"text": "I agree, this test is not a great comparison. The Note 4 did still have cell signal as they do connect to service without a sim card, but likely it is not the same as having proper service (LTE). I was trying to get the lowest draw possible on the Pixel and managed to average 29ma in airplane mode. This is the lowest I have got yet with the device which although is decently low draw is still abysmal considering that it had no apps running and no radios active. What is even more interesting to me is that google claims that the phone has 456 hours of standby time which suggests radios active (at least cell), unless my math is wrong this works out to a standby drain of 6ma which at least on my phone seems to be completely unattainable even with radios off. \n\r\nI have looked around the forums but haven't seen anyone else posting power consumption information with the regular or XL pixel so I have no idea if this is unique to my phone or just standard with the Pixel. I haven't yet factory reset the phone but that would have been next, except that I am exchanging the device due to an unrelated issue. I guess I will see how the next one stacks up in this regard.", "time": "4th November 2016, 04:37 PM", "postID": "post69459915", "replies": []}]}]}, {"text": "My Google Pixel currently drains an excessive amount of battery even on standby, however thanks to quick charging its up and ready in 15 minutes. OS seems to be heavy usage of battery at the moment.", "time": "3rd November 2016, 11:04 PM", "postID": "post69449247", "replies": []}, {"text": "Thought I would post an update on my findings. After getting a new device and still having issues I have an answer and partial solution to my terrible standby drain. The culprit in my case is LTE. I am on FIDO in Canada which does use Band 4 though I am not certain if that is being used in my area. Anyways if I set my preferred network type to 3g my standby drain improves dramatically as the device idles around 10-15ma in my pocket and overnight is more like 6ma which is phenomenal. As soon as I set my network back to LTE my standby drain is 70-90ma and at best 40ma overnight if I'm lucky. My cell service for 3g and LTE are both good (green in battery stats). I know LTE requires more power however I would expect that power requirement to drop significantly when connected to WIFI networks which in my case doesnt seem to matter at all. At least now my battery life is awesome as others have reported. However connecting to 3g when away from home is a bummer and it's not really practical to manually change my preferred network every time I leave or enter a WIFI area. Looking at a way to automate this switch but on Android 5+ it seems that changing these settings via app are very locked down. I would also like to point out that my previous phones never seemed to suffer from this issue which only further makes me suspect that there is an unresolved underlying issue here (maybe related to the Band 4 issues being reported?). It sure is nice to open my battery stats window now and see some horizontal line segments instead of the linear march towards zero.", "time": "16th November 2016, 08:33 PM", "postID": "post69654981", "replies": []}, {"text": "Problem solved! seems that the Feb security update has resolved the issue. Device now idles at 15mah instead of 45mah on LTE. Hopefully this isnt just a fluke.", "time": "8th February 2017, 06:48 PM", "postID": "post70940575", "replies": []}, {"text": "I might see what AccuBattery reports on my phone. Wakelock Detector indicates my phone is only awake about 1% of the time, which is similar to my previous Android 4.1.2 phone. Although the Pixel has a much larger battery, none of the settings I've tried have been able to make this phone have a standby drain at all similar to the previous phone. The battery information from Android constantly reports Google Services (or Google Play Services) using around 200mAh each day. Unless I have the screen on for hours during a day, Google Services is almost always reported as the top drain on my phone when it's sitting in standby, seemingly regardless of which settings I have tried turning off.", "time": "8th February 2017, 09:49 PM", "postID": "post70942941", "replies": []}]}, {"title": "Heavy use endurance", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel/review/heavy-endurance-t3484819", "https://forum.xda-developers.com/pixel/review/heavy-endurance-t3484819/page2"], "threads": [{"text": "The battery is not that good for my experience... About 30 min using Spotify uses about 7% of battery, when regularly it doesn't took that much on my other phone that I own (Samsung J7) I know the battery is bigger for comparison, but also I've tested on a Nexus 5, and the battery have a better management on other devices than this one, when you start to use the phone on regular apps (FB, TW, IG, WA, TG, SC, etc.) you will notice a clear drain on your battery, everything is going down, in about 15 - 20 min of continuous usage it will drain about 10% - 15% of your battery, for my previous experiences on other devices this is not even close, especially when is a brand new phone (2 days old).  \n\nIOT, the standby battery usage is pretty awesome.\n\nP.S. I will post some screenshots later.", "time": "17th December 2016, 06:48 AM", "postID": "post70128548", "replies": []}, {"text": "my experience is, like every other phone, daily charging is necessary. however I dont notice any more drain than any other phone ive had in the past.\nI get a full solid day on my battery, and i use it heavily every day.\nI havent installed alot of apps(which some tend to kill your battery quicker).\nid give it a high rating.\npeace\nbyte", "time": "17th December 2016, 05:45 PM", "postID": "post70135629", "replies": []}, {"text": "Not a heavy user...on Wifi and Cell (Project Fi). Been on for 8 hours.. @ 64%..... 13 hrs left.\r\nSOT: 1:47:12\r\nScreen: 7%\r\nAndroid Sys: 7%\r\nAndroid OS: 5%", "time": "19th December 2016, 08:55 PM", "postID": "post70167457", "replies": []}, {"text": "5in Pixel, T-mobile in S Florida, good reception. Not a heavy app or social media user but have never had to worry about getting through the day. I usually have about 40% when I get home from work (heavy call and text use) and I see the warning to charge right before I plug it in for the night. Default brightness, wifi, bt, gps always on. Android auto destroys the battery because it loves to keep the screen on.", "time": "27th December 2016, 01:58 PM", "postID": "post70274809", "replies": []}, {"text": "I will buy it", "time": "30th December 2016, 11:35 AM", "postID": "post70317404", "replies": []}, {"text": "Battery is mediocre at best. They should of went with a 3000mah.", "time": "3rd January 2017, 12:00 AM", "postID": "post70366861", "replies": []}, {"text": "Unfortunately I agree its mediocre at best.  I miss my Sony Z3C which would last 2 days with the same usage as my Pixel.  Pixel at 34% coming off charger 8 hr 30 minutes ago.  Although 3 hr 30 minute screen on time,46 minutes on phone, Google app used for 2 h 17min and 6% yikes.", "time": "26th May 2017, 08:31 PM", "postID": "post72441907", "replies": [{"text": "Agreed, exact same situation and experience (concurrent Z3C user), except I'm probably getting even less screen time with the Pixel than you. These oversized \"flagship\" phones seriously need a boost in the battery department.", "time": "31st May 2017, 11:31 PM", "postID": "post72501828", "replies": []}]}, {"text": "compared to the galaxy s6 i had before it is amazing. and charges fast fast fast", "time": "29th May 2017, 06:05 AM", "postID": "post72469153", "replies": []}, {"text": "Battery is not very good i am a power user at 100 percent i start my day at 6 am at the battery dies by 3 pm. i am rocking Android o beta now\r\nI happy with quick charge hope it can get me throw a full day on the stable android o version.", "time": "2nd June 2017, 01:42 PM", "postID": "post72521263", "replies": []}]}, {"title": "Light use endurance", "rating": 5.0, "links": ["https://forum.xda-developers.com/pixel/review/light-endurance-t3484820"], "threads": [{"text": "This phone really excels in this. With heavy usage, it's a good battery. With light usage, it's otherworldly. The doze feature is no joke!", "time": "12th January 2017, 03:31 AM", "postID": "post70512801", "replies": []}, {"text": "I can only agree with the above. I get 1 or 2 %  drain overnight with everything on. I stopped charging my phone overnight.", "time": "18th January 2017, 07:51 PM", "postID": "post70616438", "replies": []}, {"text": "Yea I can easily go 2 days b/w charges with even above average use.", "time": "21st January 2017, 02:25 AM", "postID": "post70651463", "replies": []}, {"text": "Yup, without gaming and light use, i can easily get over 24 hours.\nAnd just like the post above me, i also stopped charging overnight", "time": "21st January 2017, 07:17 AM", "postID": "post70653680", "replies": []}]}, {"title": "\"Look\" of the device (aesthetics)", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel/review/look-device-aesthetics-t3484821", "https://forum.xda-developers.com/pixel/review/look-device-aesthetics-t3484821/page2", "https://forum.xda-developers.com/pixel/review/look-device-aesthetics-t3484821/page3", "https://forum.xda-developers.com/pixel/review/look-device-aesthetics-t3484821/page4"], "threads": [{"text": "Overall 4.5 stars, the white face of the phone looks a little yellowish to me.  Although I love the blue back (despite the glass being an odd choice), the yellowish white front makes me wish I'd ordered a black version.\n\r\nEDIT: And whoever was in charge of the notification LED should be fired.  Just all-around terrible and a complete misstep considering the size of this Pixel's bottom bezel/chin, where it should've been placed instead of the tiny corner of the earhole speaker.", "time": "24th October 2016, 07:05 PM", "postID": "post69288143", "replies": [{"text": "Yeah, I remember reading a review where the guy said there was no LED notification. But then I saw a video where a guy pointed it out.......and how f*cking small it is!!! My S6 LED will light up the room. The one on this phone looks wimpy. But i'll have mine in my hand tomorrow so maybe it won't be as bad as it looked on the video? (don't ruin my dreams, lol)\n\r\nAs far as looks are concerned, I don't care what a phone looks like. I'm just gonna throw a case on it anyway, lol. All I care about is the software and internal hardware. The outside of the phone means nothing to me. I would rock the world's ugliest phone if it had great hardware and software. I don't care if the phone is beautiful or ugly or looks like an iPhone. None of that matters to me. It's what's inside that counts :P", "time": "24th October 2016, 10:24 PM", "postID": "post69290985", "replies": []}, {"text": "I think it is an ugly rip off of the iPhone. The iPhone being a very attractive design anyway, means the Pixel isn't doing too bad. The two tone back is gross. What idiot designed the back? The front is very attractive, but the glass doesn't round off as smoothly as the iPhone's does, or that on the S7 or honor 8. \n\nThe size is brilliant and I wish it were even smaller. \n\n\n\n---------- Post added at 08:06 PM ---------- Previous post was at 08:04 PM ----------\n\n\n\r\nI quite like the notification. I have to say, EVERYTHING I disliked on seeing online, has instantly grown on me. Just a solid total package device.", "time": "29th October 2016, 08:06 PM", "postID": "post69366642", "replies": []}]}, {"text": ":\\ Meh", "time": "26th October 2016, 04:01 PM", "postID": "post69318346", "replies": []}, {"text": "It is a bit too close to the iPhone. Basically can't tell the difference between the two if looking at the front (especially from a distance). That being said, I love the look of it.", "time": "26th October 2016, 10:24 PM", "postID": "post69323817", "replies": [{"text": "YES! Google has put out iPhone-looking phones before, like the Gphone:\n\n\n\r\nWere these re-branded HTC Desires? Similar, but not close.\n\r\nMy good friend's daughter had one, I loved the keyboard that slid out. I had heard it was kind of inconvenient because of no OSK. I had used a Palm Treo for about 3 years, then I was given an original iPhone 2g, I have to admit I was hooked on the Treo's physical keyboard and \"Blackberry\" look.  I knew where all the buttons were and I never had to look at it to type. I really missed this with iPhones and newer Androidevices. I guess all new phones owe some kind of design to iPhones, but I like that some makes try to veer away from that with wrap-around screens, and the huge rectangular all-screen ZTE ZMAX.  If the Note 7 had been less, well inflammatory...\n\r\nHas anyone seen the 6 X-Files episodes from earlier this year, they were using a few propotypes, there was one episode where a woman pulls out what looks like an iPhone, but it's an android OS. I think it was the \"bandaid-nose man\" ep, a woman takes a call on what looks like a Pixel phone, but it had an iOS statusbar. Then she plays \"Downtown\" on it while getting crammed into a trash compactor. But the front face was more like the Pixel. They may have been using an i6-style clone or a regular branded Goophone.\n\r\nThis video was floating around the end of 2015, showing a modular idea, but it was never to be made.\n\nhttps://www.youtube.com/watch?v=PnaBvyB_Uhg\n\r\nBut this page shows a side-view of the Pixel phone, it's less like the iPhone 6x models and more like the iPad Mini design, with that beveled slant, my ipad Mini does that, my 6s does not:\n\n\n\r\nThe i6 doesn't have that, the screen is placed right on top of the case:\n\n\n\r\nI think I like the Pixel's design in this respect, much better.", "time": "14th November 2016, 11:17 PM", "postID": "post69623423", "replies": [{"text": "That phone with the physical keyboard was the T-Mobile G1, made by HTC. This was the first Android device *ever*. Initially there was no OSK but that came pretty soonish. When it came out, it was the only touchscreen smartphone in existence that supported widgets and had robust notifications. It was pretty cool at the time. I think it was also the only 3g touchscreen smartphone at the time as well.", "time": "16th November 2016, 02:15 AM", "postID": "post69642089", "replies": []}]}]}, {"text": "Parfait ou presque de loin le meilleur Google depuis mon Google One !", "time": "27th October 2016, 08:05 PM", "postID": "post69338433", "replies": []}, {"text": "Understated, but gorgeous. I thought it may be too boring at first, but it's really growing on me.", "time": "28th October 2016, 12:27 AM", "postID": "post69341524", "replies": []}, {"text": "Yeah Google Pixel design is innovative in today's smartphones, and the finish seems tougher than regular unibody design. But personally I feel weird to the design, it looks unfinished.", "time": "10th November 2016, 10:27 AM", "postID": "post69549310", "replies": []}, {"text": "I've read a few reviews on this phone now and it seems to have a lot of very cool features and the idea of getting preferential software updates is a bonus.......and the pictures look crisp and high quality.....but i'm not sure if its really going to be worth the money (^_^)", "time": "10th November 2016, 04:31 PM", "postID": "post69554222", "replies": []}, {"text": "I'm really wanting to get the Pixel...its one of the nicest Android phones out...the design is great in my opinion. just can't seem to get off my iPhone. \r\nany note worthy accessories that come with this phone?", "time": "11th November 2016, 10:20 PM", "postID": "post69575445", "replies": [{"text": "Well the only thing that looks like it would be really cool to me is the VR headset they will be releasing at a later time. With the high definition provided by the Pixel it looks to be one of the better phones for VR. For me though the promise of preferential android updates way ahead of anyone else is a selling point 🤔", "time": "11th November 2016, 10:26 PM", "postID": "post69575524", "replies": []}]}, {"text": "I just got my pixel yesterday and my initial impression was that it looked like an iphone. I was a bit peeved because I ordered the silver phone, and the front and half the back is white. but I decided I didn't care because I was putting it in a case anyway so....What's up with the back half of the phone anyway why couldn't they keep it all metal? maybe RFID reader wouldn't work under metal?", "time": "16th November 2016, 07:15 PM", "postID": "post69653936", "replies": [{"text": "I think that's another \"iPhone emulation\" thing because the iPhone slate gray models have the black face and the silver and rose gold etc. models have the white face. Previous to that with the iPhone 4s for example, maybe iPhone 5 as well they had either black or white in which case the front and the back were white or black and no other colors.\n\nStarting with the 5S Apple started doing this thing where you could get silver gold and a couple of other variations in color, rather than just black or white. And then of course starting with the 6 you had four different colors I believe, three of them having the white touch screen. And then the whole 5C issue, the plastic iPhone I've never really seen anybody using those but I think those had several different colors too, and the whole device was that color.  But that whole thing about the front of the device being white or black depending, that's completely an iPhone thing, I don't know why google would want to do that but I kind of like it and I like the way the pixel phones look, it's kind of like a duotone thing.\n\nIt would be nice if you could order the pixel phones in other customized colors I don't know if they will do that though.\n\n\n\n\n---------- Post added at 08:17 PM ---------- Previous post was at 08:07 PM ----------\n\n\n\n\n\nYeah I remember it because iPhones were brand-new and then suddenly this G phone thing came out and Steve Jobs was pissed, and went ballistic. I had never seen a real iPhone at the time, then my friends daughter whipped out the phone like is in the image and I thought wow, I actually would have bought something like that had either money at the time. But then my brother bought an iPhone and he gave me his old Treo 650, which was a great phone until my cat pawed it, and somehow broke the H key on the keyboard. That was when my brother had finally bought an iPhone 4 and gave me his original, that's when I got hooked on not just iPhones but all smart phones. That was just about six years ago and things have changed so much. My first ever cell phone was a little piece of **** Siemens phone, I didn't even use it that much except that I had a phone when I was out. Eventually Cingular gave me a better fliptop Motorola phone, and then they gave me one with the camera and it even. Actually I dug those phones because they had a little music box built-in and you could create all these weird drumbeats and you could slide sounds around and make a little songs it was great. All I remember is between 2002 and 2008 or so, there wasn't really that much change with the cell phone market except with a few of the high-end phones like the Treo, and not very many people but those because they were really expensive at the time. But then when the iPhone came out and then the androids, there has been a an explosion of smart phones the likes of which will probably never end. And these things aren't phones anymore my iPhones and my androids are part of my home network and I can hook into it even when I'm not at home.\n\nThat's why security is a pretty big issue with me too.\n\nSorry for the tome!", "time": "16th November 2016, 08:17 PM", "postID": "post69654668", "replies": []}]}, {"text": "I actually purchased the phone largely in part due to its aesthetics. I actually enjoy the design of the phone: the chamfered edges, the two-tone back, and the clean front. I'd probably give it a 4.5 out of 5. There are things I wish I could change, but they're so minor, that they border on nitpicking. I wish the proximity sensors were aligned to the right of the speaker to give the front a better sense of balance. I wish the phone didn't taper downwards and was instead uniform. And I wish the glass panel on the back was made with a tougher material. It makes me a bit nervous how easy it seems to scratch according to other reviews (I've decided to put a naked skin on the glass panel of mine). Aside from that, I actually like the fact that it looks like an iPhone? I know people find that alarming, but I think older iPhones had some of the cleanest industrial designs, though I've since lost interest in the design ever since the inception of a camera hump. Oh, and this is a weird one, but I hate 2.5d screens. Those curved edges really make it difficult to add a screen protector, and I personally don't think the curve contributes very much to the overall feel of the device.", "time": "16th November 2016, 08:22 PM", "postID": "post69654848", "replies": []}, {"text": "Chamfered Edges, that's what I was trying to think of, I love that!", "time": "24th November 2016, 12:34 AM", "postID": "post69764091", "replies": []}, {"text": "Very Smart", "time": "29th November 2016, 10:44 AM", "postID": "post69845954", "replies": []}, {"text": "I have the little pixel and it reminds me so much of a metal version of the Nexus 5.  Love it!  It's sexy,  but terrified of scratching it.", "time": "2nd December 2016, 12:15 AM", "postID": "post69887842", "replies": [{"text": "Yup, the material is easy to get scratches", "time": "7th December 2016, 06:50 AM", "postID": "post69968122", "replies": []}]}, {"text": "That 2.5d screen really screwed up alot of sp and manufacturers. \nHonestly I didn't even know it had this curve, didn't notice it in reviews, didn't see anything when physically checking. Until I asked for a sp to be applied did I then learned from the seller about the curve. Wtf? \nNow I have 2 bubbly halo sides while not being fully covered.", "time": "2nd December 2016, 03:54 PM", "postID": "post69897262", "replies": []}, {"text": "just got mine today, financing through verizon but using on my at&t. couldn't get the XL as they are backordered through mid january .  got the 32gb white and its a very nice device. also just ordered a spiegen case to protect that slippery back.", "time": "4th December 2016, 11:03 PM", "postID": "post69931091", "replies": []}, {"text": "Too much wasted space and too much like and iPhone.  I didn't order one until kind of late(for me anyway), but order one I did.  I prefer the looks of my Nexus 5 to the Pixel, the rubberized back, wireless charging(are you listening Google). But the LG V20(sprint) has a locked down bootloader as does the S7 Edge, so I got a Pixel by default.  What I really really want is a Xiaomi Mi Mix, but nooo.", "time": "7th December 2016, 10:58 PM", "postID": "post69980560", "replies": []}, {"text": "Better phone than my Nexus 6, better screen, better size in the hand, but not a better shape in the hand or better looking overall.  Comparing the Pixel to an original Moto X (4.9\" if I remember correctly)  The shape and hand feel are better on the X (and the X is much shorter).  On phone design, Google did a better job the first time they were designing phones.  On the insides, Pixel does it all better and is a keeper for a 5\" phone.", "time": "13th December 2016, 12:37 AM", "postID": "post70060789", "replies": []}, {"text": "I really like the size. I think it's just the perfect size for me.\nI used to hate the two-tone back, it thought it looked stupid. But now it's grown on me. lol", "time": "13th December 2016, 01:31 AM", "postID": "post70061254", "replies": [{"text": "I use a case to cover ít back. It look terible", "time": "14th December 2016, 06:20 AM", "postID": "post70080608", "replies": []}]}, {"text": "Guys, it's GOOGLE they have worked hard on creating the phone and needless to say i have heard a lot of positive reviews of the phone. If you talk about the looks then its 5.5 inches which would be a problem while handling the phone, you need to buy a wallet case for your google pixel so that you can be sure that it is safe from getting damaged.", "time": "26th December 2016, 06:54 AM", "postID": "post70257389", "replies": []}, {"text": "Ordered mine  today, Paid extra for the unlocked version. There will be tons of development for a long time to go.", "time": "5th January 2017, 09:09 AM", "postID": "post70402203", "replies": []}, {"text": "Officially they say they're only supporting it for 3 years", "time": "5th January 2017, 12:21 PM", "postID": "post70404426", "replies": []}, {"text": "I really like the two-tone back, actually. The phone looks way better in person than it did when I first saw photos online. However, it has taken time to get to this point of me liking the look - it was not immediate. I'm wondering if the software makes the hardware look even better by being so amazing... Not much different that a girl who looks better due to a great personality.", "time": "12th January 2017, 03:16 AM", "postID": "post70512701", "replies": []}]}, {"title": "Quality feel (use of materials)", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel/review/quality-feel-materials-t3484822", "https://forum.xda-developers.com/pixel/review/quality-feel-materials-t3484822/page2"], "threads": [{"text": "Premium, good weight in the hand, no mismatched edges to catch. Love the texture difference between the volume rocker and power button.", "time": "28th October 2016, 12:28 AM", "postID": "post69341538", "replies": []}, {"text": "I would say it feels like top quality materials. One may feel that to touch, it resembles the back of the second generation iPhone. \n\nIt feels full/dense and no creaking comes from it as it doesn't flex. \n\nThe weight is just perfect t for the size. I am thrilled by it.", "time": "29th October 2016, 08:00 PM", "postID": "post69366591", "replies": []}, {"text": "My only issue with the feel is how slippery it is I can barely hang out to it", "time": "31st October 2016, 03:01 AM", "postID": "post69385617", "replies": []}, {"text": "The phone feels great overall. Can be a bit slippery, but after using a nexus 6, not hard to manage.\n\nThe rear glass on the other hand is scratched quite a bit after about a week of use and has a small crack near the corner opposite the flash. The phone has not been dropped or used in any harsh elements. Debating sending it back and ordering another as a small crack usually turns into a big one eventually.", "time": "22nd November 2016, 07:06 PM", "postID": "post69744638", "replies": []}, {"text": "This thing is really well built. I have the black pixel and all I have is a screen protector on it. I've dropped and banged this thing against other solid things quite a few times already and this thing doesn't have a scratch on it. I'm actually really shocked.", "time": "23rd November 2016, 04:07 AM", "postID": "post69750223", "replies": []}, {"text": "I find this phone to be solid. The build quality is very good. I had the Samsung S7 prior to this and I felt I could never carry that phone without a case. This phone I feel I can get away without a case but it is slippery so I have it in a case but I may just get a skin in the future.", "time": "24th November 2016, 04:17 PM", "postID": "post69773279", "replies": []}, {"text": "it is a useless phone. The materials used were good but that is about it. When it comes to hiring engineers they have a interesting/challenging interview process and when it comes to their products it is like their engineers just sit and fart. What a shame on this pixel phone. But really impressive hardware which has nothing to do with google (it is qualcomm's 820 reference design).\n\n1. The center of gravity is on the upper half of the phone where it has a natural tendency to flip outside the hand\nSomething like a buttered toast always falls face down. I am not sure why the phone manufacturers do not make it a point to have the center of gravity to the lower-middle side of the phone.\n2. There is a lot of bezel. The amount of bezel at the bottom looks ugly\n3. The cables that come with the phone are c-type on both ends. They should have been USB on one side and c-type on the other. If that was the case I could have simply used the USB wall sockets I have installed in the house already\n4. The adapter  takes only c-type.\n5. And the phone is very slippery. Try holding it with dry hands and in cold weather. Guaranteed for a drop.\n6. They couldn't have made an L-shaped adapter? The adapter when plugged into the wall occupies more space horizontally. So, if the wall plug is behind a night stand or a bed or furniture, forget about plugging it there. The furniture needs to be moved just because of this one adapter.\n\nGood:\n1. Only the software and hardware specs are good. But do most of the phones these days come with the same specs", "time": "28th November 2016, 04:55 AM", "postID": "post69826316", "replies": []}, {"text": "The front is glass, with a lot of space above and below the screen. The spec sheet lists 2.5D Corning Gorilla Glass 4, but curvature at the edges is extremely slight. The back and sides are a single metal frame except for a large patch of glass on the upper third of the rear.", "time": "29th November 2016, 09:44 AM", "postID": "post69845291", "replies": []}, {"text": "Very, very premium feel. I love the cold metal feel on the back and the texture on the power button, in particular.", "time": "12th January 2017, 03:23 AM", "postID": "post70512739", "replies": []}, {"text": "10 out of 10. Most premium feeling phone I've had.", "time": "25th July 2017, 02:22 AM", "postID": "post73156673", "replies": []}, {"text": "Amazing feel in the hands. Little cold if you pick it up after leaving it on a table for a while because of the materials used, but a cool phone is better than one that overheats.", "time": "15th August 2017, 03:43 AM", "postID": "post73405520", "replies": []}]}, {"title": "Ergonomics (in-hand feel)", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel/review/ergonomics-hand-feel-t3484823", "https://forum.xda-developers.com/pixel/review/ergonomics-hand-feel-t3484823/page2"], "threads": [{"text": "Really feels great. The small form factor is the new black. Perfect size to wait balance. The added girth of the phone actually helps the palm WRAP the mobile better. The trick of cold but smooth metal is very reassuring.", "time": "30th October 2016, 01:31 AM", "postID": "post69369804", "replies": [{"text": "Thanks for your sharing!!", "time": "8th November 2016, 09:23 AM", "postID": "post69516287", "replies": []}]}, {"text": "It feels like a high quality device but it is slippery. Sometimes feels is if it's going to jump out of my hands! I think it's a little too big for its screen size--bezels are a little too large.", "time": "31st October 2016, 09:37 PM", "postID": "post69398792", "replies": []}, {"text": "I like the size. I wanted the XL but got the 5\" because of price and I'm glad I did. Seems like a perfect fit. In photos the device always looks really thick, but it does not feel thick.", "time": "1st November 2016, 12:42 AM", "postID": "post69400836", "replies": []}, {"text": "I have the 5\" Pixel and find it great with no case (naked joke incoming).  I wish I didnt feel it needed a case.  The metal would survive some roughness but I dont think the glass would. \n\nI'm coming from a Sony Z3 Compact and don't find it out of proportion or too big.  It's an adjustment but love the extra screen size.  Miss my 2 day battery tbh and my waterproofing.", "time": "3rd November 2016, 03:13 PM", "postID": "post69442636", "replies": []}, {"text": "Great.\n\nMillion times better than the HTC 10 which I also have \n\nNot too heavy, tall or wide.", "time": "3rd November 2016, 03:53 PM", "postID": "post69443233", "replies": []}, {"text": "My Pixel is replacing my Moto X (2013 -- the orginial) and while I'd like to say this phone feels as good or better to hold and use than my Moto X so I can add that to the list of justifications for spending so much money on this phone, I can't. This phone is a little awkward to use with one hand. I'm right handed which makes anything in the upper left and lower left corners of the screen on the Pixel difficult to reach without juggling the phone around a little. Because the phone is so slick I start getting nervous about possibly dropping the phone while trying to juggle it around one handed. I know the answer is to use two hands, but I've never had a phone that I needed two hands to use so to that end I'm going through a bit of a transition period. Also, the phone feels a little weird to hold whether I'm using it as a phone (like making a phone call and holding it to my ear as if it were a real telephone!) or just picking it up from the table and carrying it out to the car. To be fair, I did keep my last phone for over 3 years so it may just take a while for me to get used to this one, but ironically I can't help feeling that if the phone was just a little thicker it may be a little more comfortable to hold. Maybe when my case arrives the phone will feel better to me. \n\r\nOn a positive note, the finger print sensor is perfectly located (for me) and super easy to use! I took the time to set up my fingerprint by trying to make sure I got as much of it scanned as I could and that seems to have paid off because it's no trouble at all to use the fingerprint scanner to unlock my phone especially one handed!\n\r\nI ordered my phone directly through Google (recieved it a little over 2 weeks ago). I also switched my phone service to Google's Project Fi at that time", "time": "11th November 2016, 03:39 PM", "postID": "post69570072", "replies": []}, {"text": "U just cant compare orihinal motox which must be the smallest 4.7\" phone ever made and easy to hold. Everything bigger then moto would feel the same. I had a same feeling wjen I went on a 5.5\" phone, felt like im holding a tablet. After 2-3 weeks was great and bemefits of smaller phone and minimal compared to everything that a big screen brings with it", "time": "19th November 2016, 08:07 PM", "postID": "post69701519", "replies": []}, {"text": "Coming from a 5x I was a bit surprised at the weight - it's heavier then I expected.  I have 5\" pixel and its a good size. Not sure if they just wanted to keep the phone proportionate but if they shank down the chin it would be a little easier for one handed use. All in all, it's got a premium feel and fits nicely in the hand. IMO, it definitely needs a case. I wouldn't want to drop this thing without one.", "time": "21st November 2016, 10:07 PM", "postID": "post69731513", "replies": []}, {"text": "love the phone", "time": "22nd November 2016, 07:30 AM", "postID": "post69736165", "replies": []}, {"text": "I wanted to get the XL but due to backordering, got this one.  So far, I'm happy I did because it fits so perfectly in my hand. I'm used to large phones so this was a big deal switching to 5\". No regrets - the ergonomics are amazing.", "time": "12th January 2017, 03:25 AM", "postID": "post70512750", "replies": []}, {"text": "can someone tell me about his/her experience of phone with different thickness from top to bottom?", "time": "4th March 2017, 02:55 AM", "postID": "post71274805", "replies": [{"text": "Sure. I've never noticed once. Extremely trivial. And this is coming from a fairly OCD individual.", "time": "5th March 2017, 01:18 AM", "postID": "post71287155", "replies": []}]}]}, {"title": "OEM skin/software", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel/review/oem-skin-software-t3484824"], "threads": [{"text": "Pixel Launcher is possibly the best launcher for this phone at the moment. It may not have the configurability of Nova, but it's a perfect fit for the phone.", "time": "28th October 2016, 12:29 AM", "postID": "post69341557", "replies": []}]}, {"title": "Outdoor visibility (max brightness)", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel/review/outdoor-visibility-max-brightness-t3484825"], "threads": [{"text": "This is a Lovely display !!!", "time": "26th October 2016, 04:01 PM", "postID": "post69318353", "replies": []}, {"text": "So far I've noticed it's significantly better than my 6P in broad daylight.", "time": "28th October 2016, 12:11 AM", "postID": "post69341354", "replies": []}, {"text": "Correct. It is brighter than my 6P in direct sunlight. Not by a huge margin but by enough.", "time": "29th October 2016, 08:49 PM", "postID": "post69367200", "replies": []}]}, {"title": "Contrast (true blacks)", "rating": 5.0, "links": ["https://forum.xda-developers.com/pixel/review/contrast-true-blacks-t3484826"], "threads": [{"text": "AMOLED panel - there is nothing else to say.", "time": "28th October 2016, 12:31 AM", "postID": "post69341571", "replies": []}]}, {"title": "Color saturation & accuracy", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel/review/color-saturation-accuracy-t3484827"], "threads": [{"text": "I enabled sRGB mode from developer options, nice amount of punch without being overblown.", "time": "28th October 2016, 12:31 AM", "postID": "post69341570", "replies": []}, {"text": "The white balance is still off. Very annoying, to say the least. Samsung seems to have nailed this on their flagships. Otherwise, I love the saturated colours of amoled. Will never go back.", "time": "29th October 2016, 03:56 AM", "postID": "post69356500", "replies": []}]}, {"title": "Clarity/resolution", "rating": 5.0, "links": ["https://forum.xda-developers.com/pixel/review/clarity-resolution-t3484828"], "threads": [{"text": "The screen looks higher res. than it actually is - awesome display panel.", "time": "28th October 2016, 12:30 AM", "postID": "post69341565", "replies": []}, {"text": "Yes. I can't say I notice the difference between the very crisp Nexus 6P display and this Pixel's display. That's a very good thing considering that the 6P is a 1440p display.", "time": "29th October 2016, 03:58 AM", "postID": "post69356519", "replies": []}, {"text": "The screen is sharp, and saturated. Touching the screen feels like holding a chick's hand.", "time": "10th November 2016, 10:24 AM", "postID": "post69549275", "replies": []}, {"text": "I have to agree with the others. I was reluctantly hoping the screen would be good but it is absolutely gorgeous to the point where I would NOT want a higher resolution (for battery/performance reasons). If you're majorly into VR then you might disagree with me but I don't think anybody is going to have a question with the screen quality without the magnification VR systems use.\n\nNote: the colors are a little oversaturated with a cool tint but you can very easily enable sRGB mode and it fixes that VERY well. I go back and forth between the two settings. I enjoy the oversaturated colors for typical use but I switch to sRGB when I'm doing web development so I can see the truer colors.", "time": "13th November 2016, 04:21 PM", "postID": "post69601465", "replies": []}, {"text": "I cannot tell the difference between this and the LG V20 (quad HD) side-by-side (in terms of clarity - the LCD vs. AMOLED is incredibly apparent). Love the screen so far!", "time": "12th January 2017, 03:26 AM", "postID": "post70512761", "replies": []}, {"text": "wait seriously? the v20 looks like 500x better than this screen. this one is terrible compared to the v20.", "time": "24th September 2017, 11:35 PM", "postID": "post73919800", "replies": []}]}, {"title": "Minimum brightness", "rating": 5.0, "links": ["https://forum.xda-developers.com/pixel/review/minimum-brightness-t3484829"], "threads": [{"text": "The lowest dim setting is perfect and not to hard in the eyes....and doesn't wake up my wife!", "time": "25th October 2016, 01:13 AM", "postID": "post69292626", "replies": []}]}, {"title": "Call quality", "rating": 5.0, "links": ["https://forum.xda-developers.com/pixel/review/call-quality-t3484830"], "threads": [{"text": "Best call quality I have had on any phone.", "time": "26th October 2016, 12:52 AM", "postID": "post69308900", "replies": []}, {"text": "Agreed.  VoLTE is life changing when talking to someone else using the technology.  Even my wife noticed.", "time": "26th October 2016, 01:42 AM", "postID": "post69309286", "replies": []}, {"text": "Wonder if the cloth ear piece speaker grill has anything to do with this? The call quality has been very good for me. On other phones the earpiece can sound hollow or distant. The Pixel sounds more like talking to someone across a boardroom.", "time": "26th October 2016, 03:51 AM", "postID": "post69310381", "replies": []}, {"text": "Yes. Best call quality I've had on any phone.", "time": "30th October 2016, 02:39 PM", "postID": "post69376844", "replies": []}, {"text": "Just got off my first conference call on this phone. The other party (using a Polycom-type setup to broadcast multiple people in a room) said that my call quality was the best they have heard from a mobile phone.", "time": "18th November 2016, 05:13 PM", "postID": "post69684774", "replies": []}]}, {"title": "WiFi strength, range, and throughput", "rating": 4.0, "links": ["https://forum.xda-developers.com/pixel/review/wifi-strength-range-throughput-t3484831", "https://forum.xda-developers.com/pixel/review/wifi-strength-range-throughput-t3484831/page2"], "threads": [{"text": "Haven't done any real speed tests of the wifi on my Pixel, but I came here to ask who dumps in their bedroom? Not judging...just eww...", "time": "22nd October 2016, 06:25 PM", "postID": "post69255951", "replies": [{"text": "I'm with you there. Mine hasn't even arrived. But I don't dump in my bedroom with my 5X.... Why would I dump in there cause I have a pixel? Lol!", "time": "23rd October 2016, 06:11 AM", "postID": "post69262602", "replies": []}]}, {"text": "No issues with WiFi range that I've found.", "time": "28th October 2016, 12:34 AM", "postID": "post69341603", "replies": []}, {"text": "By far the worst WiFi experience I've had on any smartphone to date. Be it at home, work, friend's house, or any other place with WiFi, my Google Pixel phone's internet connection keeps going dead even though the phone says it's still connected. This problem manifests itself in downloads that never finish and get stuck indefinitely until I have to manually turn off WiFi, let the download happen over LTE. This happens with video downloads (In web browser, on Youtube app, Facebook app, etc.), with app downloads/updates from the Play Store, and other downloads.\n\r\nIt's a frustrating frequently recurring problem that happens on a daily basis, and I haven't found a solution to it yet.", "time": "26th February 2017, 01:52 PM", "postID": "post71197553", "replies": [{"text": "Try to turn of LTE data while using WiFi , that fixed it for me, I noticed the issue early days I got the pixel since then I just turn of LTE data and it works normally.", "time": "26th February 2017, 08:45 PM", "postID": "post71202752", "replies": [{"text": "Thanks, will try that and see how it works, though it's a bummer as I'm actually getting real good speeds on just LTE and I'm contemplating just using that and keeping WiFi off.", "time": "27th February 2017, 07:20 PM", "postID": "post71215635", "replies": []}, {"text": "Isn't LTE turned off automatically when connected to WIFI? How do you switch it off? \r\nWhat I see on my Pixel WIFI is that it always needs a second or two to start  receiving data. Where my Laptop immediately starts downloading data when clicking on a e.g. link, my Pixel always needs a short time.", "time": "2nd March 2017, 10:17 AM", "postID": "post71251131", "replies": [{"text": "It should be, but what I actually noticed is once WiFi gets weak signal it switches to LTE for better connection, that's my experience with so now I just keep LTE turned off while using WiFi and the other way around when using LTE", "time": "2nd March 2017, 11:08 AM", "postID": "post71251663", "replies": []}]}]}]}, {"text": "No problems here. You guys might have a problem on your hands. Defective units?", "time": "3rd March 2017, 02:57 AM", "postID": "post71261423", "replies": []}, {"text": "I have excellent throughout and signal strength on my Pixel with my 802.11 AC router. Absolutely no problems in all areas in and around outside near my house.", "time": "27th March 2017, 03:16 AM", "postID": "post71603017", "replies": []}, {"text": "Is there a way to speed up wifi polling? Say I turn off wifi and then turn it back on. The time it takes to find and reconnect to my wifi network takes a while. Is there a way to speed that up?", "time": "10th April 2017, 02:43 PM", "postID": "post71803567", "replies": []}, {"text": "Wifi range is pretty bad compared my 2 year old OP2", "time": "26th April 2017, 06:46 AM", "postID": "post72035193", "replies": [{"text": "Do you guys talking about the connectivity issues think it's due to the build materials? I notice WiFi on my 5x seems to hold signal better , though I can get ac on my pixel(wifi speed is greatly different but only because of ability to connect to a. Signal on 5x seems to hold longer and farther.)", "time": "8th March 2018, 09:12 PM", "postID": "post75820599", "replies": []}]}, {"text": "My wife's pixel started ignoring or 5ghz wifi and then the bluetooth crapped out and then the 2.4ghz wifi started dropping at about 10 ft from the router... I just did a RMA with Verizon and got a Google version as a referb... other than that signals are on par with any other phone I have besides motorola, they have the best connection in my opinion", "time": "28th April 2017, 12:54 AM", "postID": "post72062543", "replies": []}, {"text": "wifi sucks on this phone compared to my v20.", "time": "24th September 2017, 11:35 PM", "postID": "post73919793", "replies": []}, {"text": "Meeeh I see I'm not the only one who has problems with wifi >.<", "time": "9th October 2017, 12:09 PM", "postID": "post74092130", "replies": []}]}, {"title": "Cellular strength and throughput", "rating": 4.0, "links": ["https://forum.xda-developers.com/pixel/review/cellular-strength-throughput-t3484832", "https://forum.xda-developers.com/pixel/review/cellular-strength-throughput-t3484832/page2"], "threads": [{"text": "I have been having awful 4g signal strength, throughput is fine, but suffers greatly when the signal drops out every 30-60 seconds. I might have a faulty device, not sure. Currently testing side by side with an identical device.\n\nEdit: Pixel on Verizon, purchased through Google Store.", "time": "22nd October 2016, 09:03 PM", "postID": "post69258054", "replies": []}, {"text": "I give it much higher rating over my Nexus 5 as comparison.\n\nFor instance, in a regional \"subway tunnel\" with a roof opening to the air over it, I have more consistent signal. So far, the signal drops less than it used to in those dropout areas.\n\nData transmission is faster too. In general sites load well.", "time": "22nd October 2016, 11:50 PM", "postID": "post69259653", "replies": []}, {"text": "When sitting right next to my Galaxy S6, the signal strength of the Pixel seems to be consistently 1 bar lower than what the S6 is showing.  I know that is relative terms, but in terms of absolutes, as it sits right this minute, the Pixel is fluctuating between -85 dbm and -117dbm, whereas the S6 is at a very solid -72-77dbm, when connected to a Verizon Microcell across the room (~20 ft) from me.\n\r\nThis shows that the Pixel indeed has lower signal strength.", "time": "23rd October 2016, 11:07 AM", "postID": "post69265341", "replies": []}, {"text": "I average 80 - 160 Mbps on Verizon. Any slowness I have is directly related to the carriers business, aggregation, etc. and not the phone. Im totally happy with it.", "time": "24th October 2016, 05:13 AM", "postID": "post69277854", "replies": []}, {"text": "I know they're not exactly related, but one of the main reasons I bought a pixel (besides just wanting one) is because my Nexus 6p seems to have horrendous cell and gps signal strength. How consistant is the signal? Does it disconnect from either and if it does, how frequent is it? I'm picking up my shiny new pixel phone today, and I guess I'll find out soon enough, I just wanted to see how your guys' experiences have been so far.", "time": "24th October 2016, 04:05 PM", "postID": "post69285240", "replies": []}, {"text": "same here!", "time": "24th October 2016, 04:50 PM", "postID": "post69285941", "replies": []}, {"text": "I noticed terrible service with the 6p as well, so far the pixel seems better. The GPS is much better as well. \n\nSpeed seems ok, havent noticed any real lag yet, I have had mine for about a week, somehow got mine a few days early (shipping error?)\n\nBased on speedtest.net tests, WiFi appears to be much slower than the 6p, coming in at 17 Mbps where my 6p sitting in the same spot on the same network was at 26-30 Mbps", "time": "25th October 2016, 12:15 PM", "postID": "post69298715", "replies": []}, {"text": "Regular black Pixel 128GB ordered through the Google store. Signal strength at home isn't quite as good as my Moto X Pure. Not a big surprise, because if nothing else, Moto has the reception game down pat. Will have a better Idea tomorrow because I just received the phone today and have been nowhere else but home.\n\nOn a side note, this phone just feels a lot nicer than my X. It's all of the little things that add up to make it a very nice experience.", "time": "26th October 2016, 01:22 AM", "postID": "post69309132", "replies": []}, {"text": "I live in a poor signal area, and Telstra (Australia) LTE signal strength is higher than my Galaxy S6", "time": "28th October 2016, 12:36 AM", "postID": "post69341621", "replies": []}, {"text": "I was a bit reluctant to get the pixel because my carrier didn't enable VoLTE and Wifi calling on it. I noticed that even though it goes down to 3G for phone calls, it goes back to LTE right after I hang up which it pretty bad ass!", "time": "29th October 2016, 01:06 PM", "postID": "post69361258", "replies": []}, {"text": "With my 5X I was getting dropouts and dropped calls at work which is a metal clean room inside a metal factory building.  I could barely maintain 3G, most of the times on 1x.  Every so often I would get lucky and be able to stream a youtube video.  Speed was less than 1mbs, usually 0.2-0.5.  With the Pixel I see LTE and have used it for a few phone calls expecting it to drop or not be heard on the phone but I had no problems.  I don't use LTE for voice calls.  Data speeds are now about 2-3 mbps.  20 mb app took about 10 seconds to download.  That would have taken several minutes with the 5X.  So in my experience much better signal using Verizon UDP.", "time": "29th October 2016, 01:40 PM", "postID": "post69361671", "replies": []}, {"text": "Out side the house didn't notice any issues but at my house **** reception which is normal so I had a service extender that my galaxy 5 used just fine my pixel don't like it thought . But now that I can use wifi calling with this phone don't matter", "time": "31st October 2016, 03:03 AM", "postID": "post69385637", "replies": []}, {"text": "So far it seems to be about on par with my Nexus 6 which had better signal than any other phone I've used. My 5x would drop to 3g in certain spots in my house and was a pain tethering occasionally. The pixel has been great.\n\nGoogle store pixel on vzw", "time": "22nd November 2016, 07:02 PM", "postID": "post69744580", "replies": []}]}, {"title": "Speakerphone (loudness, clarity)", "rating": 3.0, "links": ["https://forum.xda-developers.com/pixel/review/speakerphone-loudness-clarity-t3484833", "https://forum.xda-developers.com/pixel/review/speakerphone-loudness-clarity-t3484833/page2", "https://forum.xda-developers.com/pixel/review/speakerphone-loudness-clarity-t3484833/page3", "https://forum.xda-developers.com/pixel/review/speakerphone-loudness-clarity-t3484833/page4"], "threads": [{"text": "Very average for me. Not as loud as I would have hoped.", "time": "21st October 2016, 05:34 PM", "postID": "post69239855", "replies": []}, {"text": "Still waiting for mine to come in (should be in Tuesday). Will compare it to my S6 and see what happens.", "time": "22nd October 2016, 01:39 AM", "postID": "post69245489", "replies": []}, {"text": "Average at best. My friend and I were playing Battlefield 1 last night and talking on speaker phone, he also has the Pixel, at times we could not hear each other very well. I actually think the speaker on the 5X was better....", "time": "22nd October 2016, 04:54 PM", "postID": "post69254604", "replies": [{"text": "It's not the loudest I've heard but boy, compared to the 5X the 5X is a joke (I have both phones).\n\r\nSound is louder, deeper and more clear. Comparing to the 5X it's in a completely different level...", "time": "24th October 2016, 02:24 PM", "postID": "post69283694", "replies": []}]}, {"text": "I would have to agree that the speaker is average at best when it comes to call quality.  My Galaxy S6 was louder.  Though audio playback for non-calls seems to be a fair amount better than my S6.", "time": "23rd October 2016, 08:28 AM", "postID": "post69263659", "replies": []}, {"text": "Anyone having issues turning their speaker all the way up and when watching video get like a popping sound?", "time": "23rd October 2016, 11:28 PM", "postID": "post69275032", "replies": [{"text": "Yes, totally. If you've heard a blown speaker, it kind of sounds like that at the higher levels. \n\r\nCan other people either confirm out deny this? I'm wondering if this is a \"feature\" or a defect.\n\r\nThanks.", "time": "28th October 2016, 04:11 AM", "postID": "post69343351", "replies": []}]}, {"text": "Used to have hands free conversations while driving with the phone in a cradle... but with the Pixel I can barely hear someone even with the volume at maximum. Not brilliant.", "time": "26th October 2016, 12:51 AM", "postID": "post69308890", "replies": []}, {"text": "Better quality and clarity from the single speaker than I expected.", "time": "28th October 2016, 12:35 AM", "postID": "post69341609", "replies": []}, {"text": "I chat with support and they told me that it is an audio issue with the videos since the issue wasn't consistent. They said to factory reset my phone. I did that, played the same vdieo over and over and the issue is no longer there.", "time": "28th October 2016, 04:14 AM", "postID": "post69343378", "replies": [{"text": "I only noticed it when I was using the speakerphone during a call. I had to factory reset it later for a different reason so I'll check on it tomorrow but it still sounds tinny as Hell. And I'm coming from a Droid Turbo 1st generation.", "time": "28th October 2016, 04:40 AM", "postID": "post69343572", "replies": []}]}, {"text": "Very average speaker! Waiting for Root so we can do some audio modifications and make it atleast decent quality.", "time": "28th October 2016, 10:40 AM", "postID": "post69346096", "replies": []}, {"text": "Yeah it isn't as loud as my Nexus 6P, nor is it front facing. Or a dual setup. But it isn't as bad as I'd feared. Still plenty loud and crisp.", "time": "29th October 2016, 08:49 PM", "postID": "post69367191", "replies": [{"text": "I wanna eat my words and some humble pie too. The speakers are almost as loud as the 6P if not equally loud. The 6p has better dynamic range but I felt that in some tracks, the Pixel was crisper. It's really a toss up. \n\nAdd they're not front firing, I have no issue calling up assistant for time or weather when I'm in bed. Yes, I'm that guy who always places phones face down. The audio just pumps out the grill without any muffling whatsoever.", "time": "3rd November 2016, 07:31 PM", "postID": "post69446574", "replies": []}]}, {"text": "I haven't had enough time to test but mine seem to sound fine for what they are. Definitely not loud enough, but quality is on par to all the phones ive used minus an htc m9.\n\nI actually prefer bottom speakers or speakers on the back for my particular use. I use my phones primarily for Google maps in my semi.  I've used the sony z3 compact, htc m9, moto x, moto x 2nd gen, iphone 5s/6(s)/7., and oneplus 3\nThe best phone for audio i can actually hear while driving has been the 1st gen moto x. Sony,htc, snd 2nd gen moto x with front firing speakers are the worst. Iphone 6s better, iphone 7 best for iphones. One plus 3 probably in at #2 but they are not the best quality (more on the tinny side w/ lack of mid-low range).\n\nI will have to compare the pixel next week.", "time": "5th November 2016, 03:27 AM", "postID": "post69466768", "replies": []}, {"text": "Are there any mods yet for this? I would like my speakers to be loud as well coming from S7 Edge boy this speaker needs help! Anyone?", "time": "6th November 2016, 05:34 PM", "postID": "post69491145", "replies": [{"text": "That's certainly odd. I did an EDM/Dubstep, standard voice, rock, and opera music test on the Pixel and Pixel XL compared to my Droid Turbo 2 and the iPhone 7 and 7+. This is what I came to:\r\n-Pixel and Pixel XL are quite loud for a single/mono speaker setup, about equal in loudness to my Droid Turbo 2. All were quieter than the iPhone 7 and 7+, which is expected given their stereo/dual speaker setup.\r\n-The iPhones possess a thin, metallic, tinny sound from both speakers, with a miniscule amount of bass or depth to the sound. The mids and highs were somewhat ear-piercing and overly sharp, and were overall not managed well. However, this is better than the S7 Edge from what I can tell, which sounded muffled, quiet, and tinny to me, when I watched a video on a Verizon display unit. However, I will have to do another test to truly give comparative results.\r\n-The Pixels were quieter than the iPhones off the bat, which is to be expected, since they have mono speaker setups. But, the sound out of both of them was exactly as loud as my Turbo 2, and the Pixel's speakers have an impressive amount of depth. Bass was definitely present here, moreso than the Turbo 2, and the sound was not thin by any means. The mids and highs were present and did not sound tinny or not properly recognized by the speaker. However, the treble lacked the \"wow\" factor in comparison of the Turbo 2, whose treble was more crystalline and more alive, as well. Not that the Pixels sounded dead by any means, because their treble was also well represented and sound, at that high of frequencies, was not distorted, like it was a little bit with the iPhones, playing high-frequency sound (treble) in the soundtracks I used, but the highs and treble were more enhanced. So, it seems like the Pixel is better suited for bass and lower frequency sounds, whereas my Turbo 2 is better suited for treble and higher frequency sounds.\r\n-In conclusion, the iPhones are OK in loudness for a dual-speaker setup, though their sound is thin, metallic and tinny, offering little to no depth of sound, especially compared to the Pixels, and not representing higher frequency sounds or voices properly, often falling apart in the treble compared to my Turbo 2. The Pixels are quieter than the iPhones, but offer the most depth of sound and bass of the three, and tie with the Turbo 2 for the least distortion of sound. Thehigher frequency sounds and the treble are present and well-represented with little distortion, but my Turbo 2 has a more crystalline, more alive upper register than the Pixel and especially the iPhone 7.\n\n---------- Post added at 08:50 AM ---------- Previous post was at 08:46 AM ----------\n\nBTW in loudness, all three of the aforementioned smartphones are a joke compared to my 6P. In quality, however, the Pixel and my Turbo 2 come close to my 6P. The iPhone 7 gets decimated by my 6P though.", "time": "7th November 2016, 07:50 AM", "postID": "post69498883", "replies": []}]}, {"text": "Low and bad quality", "time": "25th November 2016, 01:25 PM", "postID": "post69785401", "replies": []}, {"text": "In call volume is definitely lower than my old Zuk Z2. Now I have to crank up the volume to max and still have a hard time in noisy locations. The speaker quality is acceptable. But I expected loud speakers when we are paying top dollar. \n\nOverall, Pixel gives off an average phone vibe with overpriced price.", "time": "1st December 2016, 05:24 AM", "postID": "post69874298", "replies": []}, {"text": "with viper its louder and clearer.", "time": "7th December 2016, 12:54 AM", "postID": "post69964916", "replies": []}, {"text": "quality not bad, loudness sucks! i hardly hear it outside. that's why i'm thinking of selling this phone. first time a nexus phone disappointed me this way.\r\nwas using ip7 and it was way louder.", "time": "14th December 2016, 03:41 PM", "postID": "post70087242", "replies": [{"text": "For me quality is just fine, loudness right where I want it and I can hear it perfectly well outside. Good idea for you though, sell it and reactivate your ip7 sitting on your desk.\n\n---------- Post added at 09:21 AM ---------- Previous post was at 09:20 AM ----------\n\n\n\r\nI use is on speakerphone with no issues in the car. Perhaps your muffler needs replacing?", "time": "15th December 2016, 04:21 PM", "postID": "post70104167", "replies": []}]}, {"text": "I agree, completely unusable to do phonecalls over a speakerphone in a car. Lile, come on. My previous Note5 had a bad sounding speaker as well, but at least it was WAAAY louder.", "time": "15th December 2016, 06:48 AM", "postID": "post70097200", "replies": []}, {"text": "Look, same car, same location, Audi A6,. And on a highway on higher speeds I cant understand whats coming out of the speaker, with Note5, SAME CONDITIONS, no issue with understanding wjats coming ojtofthe speaker. It just lacks loudness. \nNot to.mention that microphone does shotty job as well,as people cant understand me saying theres backvround noise,where as Note5 never had that issue.", "time": "15th December 2016, 04:31 PM", "postID": "post70104333", "replies": [{"text": "Yeah, the speaker is pretty bad on the Pixel . So much for putting in a nice speaker on a fairly large multimedia smartphone. Stingy people at HTC. Who ever was in charge of QC at Google was probably too busy with other bugs to see this issue.", "time": "24th December 2016, 04:33 PM", "postID": "post70237295", "replies": []}]}, {"text": "With an Audi A6 don't you have a BT connection for your phone? Why would you use the speakerphone with such a high performance vehicle? Just curious.", "time": "15th December 2016, 05:59 PM", "postID": "post70105615", "replies": []}, {"text": "Its an older Audi \n\nThe point is it sounds week compared to note5, which by default has a bad speaker", "time": "16th December 2016, 02:58 AM", "postID": "post70111575", "replies": [{"text": "Well I guess you're out of luck. Time to sell it.", "time": "16th December 2016, 03:22 AM", "postID": "post70111760", "replies": []}]}, {"text": "Bud, u r little bit annoying, ha.", "time": "16th December 2016, 04:42 AM", "postID": "post70112455", "replies": []}, {"text": "Having come to my Google Pixel from an HTC One M8, it's safe to say the Pixel's speaker is less than satisfying. Speaker is just not loud enough sometimes.", "time": "26th February 2017, 01:54 PM", "postID": "post71197573", "replies": []}, {"text": "I used HTC one M9 then Samsung Galaxy S6 edge and now Pixel. Pixel as compared to the previous two is very disappointing. The voice is clear but very low.", "time": "26th February 2017, 10:45 PM", "postID": "post71203856", "replies": []}]}]