[{"title": "Overall love", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-g5/review/overall-love-t3361308", "https://forum.xda-developers.com/lg-g5/review/overall-love-t3361308/page2", "https://forum.xda-developers.com/lg-g5/review/overall-love-t3361308/page3", "https://forum.xda-developers.com/lg-g5/review/overall-love-t3361308/page9"], "threads": [{"text": "Well, I hate this phone.  Mine couldn't survive a 12\" drop onto a parking lot without severely shattering the display.", "time": "21st April 2016, 04:50 AM", "postID": "post66470686", "replies": [{"text": "Maybe it committed suicide as it no longer loved you.\n\r\nYou should have tried relationship counselling, but now it is too late.", "time": "21st April 2016, 11:32 AM", "postID": "post66474671", "replies": []}]}, {"text": "Unrootable means un usable in my eyes. Plus the battery lasts about 6 hours.", "time": "29th April 2016, 10:46 PM", "postID": "post66611005", "replies": []}, {"text": "Not sure why you can't use it without root, I am. And my battery last all day with 4G.", "time": "30th April 2016, 12:12 AM", "postID": "post66611780", "replies": []}, {"text": "Absolutely love this phone, and yes, I do sleep next to it . Everyone will have their own opinions, mine personally is this is a great phone. Love the camera, battery time is great (although having 2 batteries help), and finally a usable phone outdoors without having to really focus on the screen(very bright screen is what I mean). I would really love to have root, but I have patience, this nonsense of \"no root no phone\" kind of irks me but when you're spoiled you're spoiled.", "time": "30th April 2016, 06:51 AM", "postID": "post66614431", "replies": [{"text": "Got a G5 (on AT&T) yesterday as a gift from my work and am coming from a Moto G with custom ROM's galore. The only thing I really miss is forward and back arrows in the nav bar for typing and Chrome Pie. Why pie controls aren't native to Chrome and requires root access is absolutely stupid.  \nEvery other root function I used on my Moto G was to make up for the limitations of the device. No need now. Holy crap this thing is fast as hell and thanks to doze, standby is crazy. The SD 820 is an absolute beast of an SOC. And this is only my first full day on it.  Going on a hike later today and can't wait to use the camera on this thing. So far I am very impressed with this phone.", "time": "30th April 2016, 08:40 PM", "postID": "post66623908", "replies": []}]}, {"text": "Upgraded a number of family phones to the LG G5.  I'm a bit old school and prefer simple flip phones. We would probably still be using Samsung Rugby flip phones if they worked with our carrier. \n\nIf you're in the market for a high end phone that's more than shiny, with lots of usable practical features and actually includes the latest available technology, consider the LG G5. We think it definitely has more hits than misses.\n\n1. The 3 Cameras, make the phone one of the best camera substitute\n2. Modern CPU (Qualcomm 820, currently top of the line) helps performance, battery efficiency, spectrum / wireless performance.\n3. 4GB RAM useful for multitasking and running large demanding software\n4. 32GB internal built in storage\n5. Expandable storage with Micro SD (sorry Apple)\n6. Miracast, industry standard screen sharing\n7. IR Blaster\n8. USB-C, the modern USB port the industry actually agrees and moving towards\n(including devices from Apple, Google, Microsoft, LG, etc).\n9. User removable / replaceable battery\n10. Modular, and easy repair-ability\n11. FM capable - enabled depending on carrier\n12. A major phone brand / model thus more available accessories\n13. Price point - best value for high end / flagship phone\n\nCons - what's missing that other devices may offer\n1. Water / Dust proof - a nicety, and can be added to the LG G5 via certain cases.\n2. Premium Metal / Glass feel - subjective. The LG G5 is all aluminum but covered in a primer paint. Besides, most folks I know use a phone case.\n\nWe have a number of mobile lines / phones within our family. Our last few phones have been Samsung, from Samsung flip phones to Android devices Galaxy T989D/S2X, Note 2, Note 3, Note 4. When we were up for replacements, we going to go with Samsung Galaxy Note 4, but it was no longer available, replaced by the Note 5. The Note 5 was more expensive than the Note 4. It was hard to justify paying more for a successor that included less than its predecessor - no Micro SD, no IR, no removable battery. Note 5 excluded usable practical features for a shiny exterior, and wasn't even water proof. We heard new phones were coming March / April 2016 so we waited and eventually decided on the LG G5.  We believe it to be the best value, and offered the opportunity to award a vendor trying to innovate.\n\nUltimately it's just a phone, but at least it has the more important convergence features covered, mainly solid phone features, and solid camera.\n\n** Unrelated, but its thanks to XDA community and other enthusiasts who help keep golden oldies such as the T989/S2X and Note 2 phones kicking.  There's several Marshmallow ports for T989 and Note 2", "time": "30th April 2016, 04:45 PM", "postID": "post66620876", "replies": []}, {"text": "Just received my EU h850 in the mail on Wed, already unlocked and rooted. No build quality issues at all.\nDon't know why some are having battery issues. I easily get 24hrs of use with 5+hrs sot\nThat's with gaming,youtube,  browsing,and Bluetooth\nThe screen uses much less battery than my Sprint g3...and even with custom everything on my g3 this phone performs sooo much better in everyway.\nI think carrier branded g5 have a lot of bloat killing battery\nHaven't heard a bad thing about unbranded h850 yet", "time": "1st May 2016, 02:24 AM", "postID": "post66626739", "replies": []}, {"text": "Got mine from O2 in the UK and love my G5... O2 have put no bloatware on it at all and it therefore has good battery life.  I have a G4 and the G5 flies compares to it (I loved the G4 too even though it had it's issues!).  The only negative point is that getting a good tempered glass screen protector is going to be a nightmare as the screen is clearly quite flexible (hence the corner buckles etc) and so getting one to fit perfectly is going to be a challenge.  Having said that, this is a very new phone, and all new3 models have odd issues (software/hardware), so if it becomes a problem then I'll RMA it to O2 or LG and get it swapped.", "time": "3rd May 2016, 12:04 PM", "postID": "post66673036", "replies": []}, {"text": "Hate some of the software tweaks, but this is a damn fine phone.", "time": "7th May 2016, 04:15 AM", "postID": "post66733629", "replies": []}, {"text": "All in all, this is a pretty good phone. I'm really liking the wide angle lens and the fingerprint sensor. (This is my first phone with a fingerprint sensor)", "time": "2nd June 2016, 07:33 PM", "postID": "post67141383", "replies": []}, {"text": "For the ATT G5 is there a way to save pictures/files/videos directly to the memory card or does that require root?", "time": "4th June 2016, 04:00 AM", "postID": "post67161260", "replies": []}, {"text": "Love it. I'm not crazy about the design but a 2.5$ case makes it look badass. \nCamera is outstanding, battery life is good (30 hours with 4 hours SOT , brightness is set to Auto, BT and NFC off).\nThe phone works fast and doesn't overheat. \nI'm happy", "time": "6th June 2016, 11:49 AM", "postID": "post67193223", "replies": []}, {"text": "Loving my G5 had it a few months now, bought the Spigen Rugged Armor case really nice, snug fit. Great camera, battery life & blazing fast, great screen, fingerprint scanner works amazing its really responsive, i was pretty surprised actually at how well the fingerprint scanner works .... Don't care for root to be honest, only thing i really liked about being able to root my old G2 was having AdAway installed. USB-Type-C is a god send especially in dim light.", "time": "7th June 2016, 12:06 AM", "postID": "post67202190", "replies": []}, {"text": "From South Africa here. I have the H850 G5 as well, and no bloatware whatsoever. Battery lasts me a full day under moderate to heavy use (That does not include the camera). The auto-brightness is on point (but gets a little too low in a dark room to make watching videos or gaming comfortable). Battery charges fully in 28min from 1% whilst turned on. It's blazing fast. I have games in the background that I get back to hours later, and the memory never fails. Best phone I've ever owned.", "time": "8th June 2016, 11:18 AM", "postID": "post67223610", "replies": []}, {"text": "I like almost everything about this phone minus the flimsy quality of the lcd quoting/Glass as its getting scratched very very easily, same is the case with back camera glass/visor.\n\nUnfortunately, i wasn't using any screen protector earlier and i'd tried to clean the screen with a very soft microfiber cloth but to my surprise even that cloth had left some tiny hairline scratches. I couldn't believe my eyes at first but this was the fact sadly \n\nI am not sure now if i can get rid of these scratches as i really love neat and clean phones.", "time": "9th June 2016, 11:13 PM", "postID": "post67248742", "replies": []}, {"text": "I upgraded from an S3 that had been in service since it's release and had never failed me.  It just became a bit dated and the battery was due for replacement. I caught the G5 for $1 at Best Buy so I said what the hell. My first unit didn't last 12 hours before dying.  However the replacement is on it's 4th charge/discharge cycle and is seamless. I hope that the first unit was just a fluke because this thing hums.  I hadn't even tested any other phones since owning the S3 so the speed and fluidity of the G5 blows me away. I cannot wait for rooting capability to customize it even though the factory setup isn't bad and not as restrictive as others I have dealt with in the past.  I am giving it 3 stars for now due to the DOA unit I first received though. \n\r\nJD", "time": "12th June 2016, 06:27 PM", "postID": "post67287447", "replies": [{"text": "Same here... Had s3 since it's release and I was pretty satisfied with it. Phone served it's time and I got new LG G5... I was bit sceptical at first but I gotta say I am pretty satisfied with G5, everything is snappy and fast. Battery life is great, at the end of the day I have 25-30% left. Only thing I am disappointed is it's build. I like the metal build but it doesn't have \"the feel\" of it, I don't know how to describe it. Anyway... I hope G5 will serve me as s3 and hopefully better.", "time": "12th June 2016, 11:58 PM", "postID": "post67291117", "replies": []}]}, {"text": "I owned an LG G2 since launch; it was the best smartphone I ever had. It was also the first smartphone I ever broke - shattered the screen after only a year. I ended up buying the Motorola Nexus 6, which turned out to be a huge disappointment tbh. The G5 though, so far, has been fantastic!\n\nI love the camera! The Nexus 6 had the most basic, boring and slowest camera I have ever experienced on a smartphone. The wide angle camera is amazing and I love the full manual mode! Battery life has been great too, which was my biggest issue with the Nexus 6 - it couldn't even make through my work day without needing to be charged in the afternoon (it charged fast, but come on). I've been averaging 12-14 hours on my G5 with 3-5 hours SOT, auto brightness, NFC and Bluetooth (I have a smartwatch), WiFi while at work and at home, LTE everywhere else. The screen is BRIGHT! I have no problem walking to work and using my phone while wearing sunglasses! I could never do that with my Nexus 6. This is my first phone with a fingerprint scanner and I am really impressed at how responsive it is. Honestly I think the speakers/max volume is quite loud - something I was a little worried about since the Nexus 6 had the speakers on the front of the device, but after using the G5 for a week this is no longer a worry.\n\nI received an update when I first bought it but I have not received the app drawer update for some reason. Not a big deal, but odd I think. I can't wait until we get some custom ROMs for this device so I can flash a stock/non-carrier branded image to this device and get rid of all that crap bloatware! My only complaint so far is the bloatware AT&T stuck on it, but that's to be expected with a carrier branded device.", "time": "15th June 2016, 04:46 PM", "postID": "post67331006", "replies": []}, {"text": "I love my G5!", "time": "7th July 2016, 01:30 PM", "postID": "post67641832", "replies": []}, {"text": "Barely functional, much slower than my G4. Phone always claims it has a full signal but nothing loads. The camera on snapchat fades to black every half a second. Nothing really works.", "time": "16th July 2016, 04:27 PM", "postID": "post67771845", "replies": []}, {"text": "After a couple of months with the G5 I finally found how to express my feelings toward it: I don't care about it.\n\nI don't hate it (it does a good job, it is fast enough, it has enough storage, the battery barely lasts long enough but charges quickly, it's not way too big, ....) but there really is nothing about it that I love.\n\n- The camera doesn't disappoint, but the aspect ratio limits me as a photographer. The second camera is a gimmick that is useless in daily operation.\n- The overall design is boring.\n- The haptics of the phone doesn't matter because I have to use a TPU cover to keep the curved glass on the top from chipping again on slightest impact.\n- The stock LG apps (Music, contacts, launcher, camera, etc.) don't even play in the same ballpark as the ones from Google or Sony (the predecessor was a Xperia Z2)\n- The update frequency is not what I expected from a flagship phone. (I only do OTAs and as of today July 18th 2016 the patchlevel is from April 1st 2016).\n- I have the camera-grip but it doesn't provide any real benefit for the awkward bulkyness it adds to the phone. So I think the module concept will go down memory lane as a \"nice try\".\n- GPS reception is definitively worse than I'm used coming from the Sony Xperia Z2\n\nI could continue this list of \"boooooring\" for a while.\n\nIf you ask me \"Why did you buy it in the first place?\" the answer is simple: At that time it was the only non-Samsung flagship on the market that had an up-to-date chipset.", "time": "18th July 2016, 10:52 AM", "postID": "post67795836", "replies": []}, {"text": "After owning mine for several days, my opinion is that it's a very nice phone. Definitely a worthy replacement of the G3 anyway. Everything is an improvement except perhaps the minor decrease in battery capacity, the painted back (would rather have faux metal like the G3 or just the aluminum by itself), and currently the inability to root (H820 model). I would rate it 4 out of 5.", "time": "19th July 2016, 07:12 PM", "postID": "post67817163", "replies": []}, {"text": "poor dual sim management not poor extremely poor. camera is not even close to huawei p9. huawei p9 camera is far better than g5. build quality is just like cheap Chinese fone. that what i think after using it couple of days. huawei p9 is win win in all.", "time": "20th July 2016, 07:23 PM", "postID": "post67832408", "replies": []}, {"text": "I like this phone mostly for the wide angle camera, great for street pics and the system is fluid even in stock rom... what i don't like too much is the poor battery time, at most can reach 3h SOT and barely 24h of mild use. Also the GPS started to fail badly and it was useless, but i fixed 2 weeks ago and now is working great and accurate.", "time": "4th October 2017, 09:53 PM", "postID": "post74037911", "replies": []}, {"text": "The screen isn't the biggest and or brightest however; I use it on a day to day basis for my work (construction foreman). With an otter box, I don't worry too much about breakage. It's fast enough, small enough and takes amazing job-site photos. It is also ridiculously easy and cheap to self repair! The main reasons why I still don't feel too bad about not upgrading: modularity, cheap/easy repairs, cameras and most importantly... The audio quality! I use a pair of 50mm driver, turtle beaches coupled with the bass booster/equalizer pro app and I absolutely love it. Maybe if the G7 has an OLED display; then I will upgrade. Until then, I have plenty of other rooted devices to perform my dirtier deeds lol. Cheers fellas!", "time": "7th October 2017, 12:06 PM", "postID": "post74067190", "replies": []}, {"text": "Had a G3 for a while until the GPS, wifi and SD card all failed\nUsed a Galaxy S5 for a while, but not enough built in storage\n\nFigured I'd go back to an LG and got the G5.\nWide angle camera - good\ninternal storage - good\nbig enough, fast enough\nGPS - absolutely sucks!!! Why can't they fix this? I'm ready to smash it and buy another phone because of it.", "time": "10th November 2017, 01:57 PM", "postID": "post74468935", "replies": []}, {"text": "I tried hard to love this phone but it will never be the same kind of relationship I had with my Galaxy S3. I have the H831, it can't be rooted so no more playing with custom ROM for me. I had so much fun trying CyanogenMOD on my S3. I was even able to install Marshmallow  even if Samsung didn't support this version of Android on it. The LG G5 has all the processing power of a 2016 flagship, it's as powerful as a Galaxy S7 but it caused me too much troubles. Also, I once a had Moto X Play, it wasn't nearly as powerful as the LG G5 but, at least it included useful features. Moto Voice is pure genius. I'm puzzled by the fact that even the new Google Assistant can't reproduce the features included in this app. I was able to get all my SMS on my car speakers with text-to-speech from Moto Voice.", "time": "1st December 2017, 12:24 AM", "postID": "post74695654", "replies": []}, {"text": "Overall, I am pretty happy.... now, when you talk about this GPS... that makes me furious. Missing turns and getting lost is not something I like.", "time": "8th February 2018, 07:58 PM", "postID": "post75494712", "replies": []}, {"text": "crap GPS, charging port problems, fast charge stopped working. 2 of them bricked out of nowhere, one bootlooped. all the screens looked terrible. all bled light. all with terrible battery life.\n\nI liked the G5 for maybe six months despite its terrible screen, battery life, bad \"auto\" mode on pics but then I went through 3 in a row while they were being babied... I'm done. I have a V30+ now and after having to put together a 4th G5 with parts from the previous 3 and STILL have charging issues?! Done. \n\nWorst part is that it seems to be a software issue. Here I am FOUR UPDATES LATER (since it started acting dumb) and it's still not fixed. SMDH\n\nGoing back to Samsung next time. My wife's Note 8 is badass. I love this V30+ but after being so inconvenienced by so many bricked and bootlooped phones (ALL STOCK FIRMWARE, NEVER ROOTED AT ALL) and Sprint or LG not doing crap to help me (except try to outrageously charge me to fix a phone that was still being leased to them) HAHAHA... I'm truly done. Samsung ftw", "time": "25th March 2018, 10:28 AM", "postID": "post76009525", "replies": []}]}, {"title": "Community development strength", "rating": 3.0, "links": ["https://forum.xda-developers.com/lg-g5/review/community-development-strength-t3361309", "https://forum.xda-developers.com/lg-g5/review/community-development-strength-t3361309/page2", "https://forum.xda-developers.com/lg-g5/review/community-development-strength-t3361309/page3", "https://forum.xda-developers.com/lg-g5/review/community-development-strength-t3361309/page4"], "threads": [{"text": "3/10 \nAll Kernels and Roms are pointless.  \nRoot is being with held by those who have found a way to bypass boot lock &  2 part boot.  \nSo, poor overall experience.  \nHonestly miss my S5 because the subforum was much friendly and helpful", "time": "19th April 2016, 06:33 AM", "postID": "post66436849", "replies": []}, {"text": "I voted 3 for this because of the current root situation.  If root is attained, this will go up.", "time": "19th April 2016, 05:38 PM", "postID": "post66445692", "replies": []}, {"text": "LG has officially opened up the bootloader for the European G5 H850 variant.\nThat's root and TWRP without any hacks needed! \nMore info here - http://forum.xda-developers.com/lg-g...oader-t3363040\n\nPlus the T-Mobile G5 H830 has been spotted with root and TWRP as well - https://www.youtube.com/watch?v=Zlieyd9CP7Q\n\nOther variants may never get unlocked but that's promising for at least two G5 variants. \nIt's your choice to buy a bootloader locked device or not!", "time": "21st April 2016, 07:35 AM", "postID": "post66472199", "replies": [{"text": "I agree with @autoprime. \n\nAnd personally, I'm sick and tired of people begging. Especially those with less than 10 posts, are brand new users to XDA, and who have not contributed anything to the Android community ever. The Devs are NOT obligated by any means to share what they have achieved. If any of you bought this device simply because you wanted root, instead of buying the phone for its functionality, form, etc., then you are a fool. BE PATIENT! If it happens, it happens. Don't expect anything.\n\nRated 5 stars, because I got the phone for the phone, not for root. And I think it's a great device!", "time": "21st April 2016, 01:14 PM", "postID": "post66475872", "replies": [{"text": "Huh. I remember seeing lots of excited, puppylike requests for root development, but often with offers to contribute financially. I agree though that begging, esp. from junior members, isn't helpful.", "time": "21st April 2016, 08:04 PM", "postID": "post66482077", "replies": []}]}]}, {"text": "5 Stars all the way baby!!!! \nThis phone is great. No lag, no hassles....... I only have experienced 1 issue but I'm sure its a simple bug. The LG Keyboard crashes but reboots itself . \n\nI believe that this phone is so great that all we have to do is be patient and we will be able to have root and unlock Bootloader along with great kernels ROMs and all the trimmings.  It's only a matter of time.", "time": "21st April 2016, 10:16 PM", "postID": "post66483926", "replies": []}, {"text": "i threw a 4.. wanted to throw a 2 actually.\ni think there is some work to do in order to get internal storage decryption working in twrp.\nhopefully some day we find a way to unlock this device without touching the fuse. to me it looks like its a bad idea to unlock my g5 for now.\ni wonder if we should wait with installing updates untill someone comes up with some brilliant reverse engineering skills.\ni wonder if such people would even care about the g5.\n\nto me this is a pretty decent phone. i'm happy with its performance so far.\nunless we are enforced to wait for upcoming android versions for more than 4 months after nexus devices got it i'll most likely keep it untouched.\ni miss certain apps though.. titanium backup, xposed, … great stuff. at least i could manually type the secrets from my previous google authenticator backup in.\nyou can simply open the sqlite db from /data and grab the plain text secrets ouf of there.", "time": "22nd April 2016, 03:01 PM", "postID": "post66494100", "replies": []}, {"text": "Voted 2. The development SHOULD NOT focus only on the European (H850) variant. That is just completely UNFAIR. I have the Asian (H860N - dual sim) variant and devs and LG as well should give love to all G5 users with different variants.", "time": "25th April 2016, 11:52 AM", "postID": "post66537268", "replies": []}, {"text": "It started off with lots of enthusiasm and the Team CodeFire YouTube video with TWRP definitely inspired confidence, but things are cooling down now unfortunately. I'll say a 3/5 because we know that TWRP and root CAN be obtained. But every week that passes with everything quiet makes the phone a less and less inviting development target.", "time": "25th April 2016, 02:53 PM", "postID": "post66539645", "replies": []}, {"text": "Storage issues with app obb movement. Lg has blocked marshmallow adaptive storage like samsung. Not good move \n\n\n\n---------- Post added at 07:49 PM ---------- Previous post was at 07:45 PM ----------\n\nIts the manufacturer who is limited the storage cant understand why anyways this issue is a bad move hope the htc is a better move going that way already as i am a poweruser and need all the storage i cam get.", "time": "25th April 2016, 07:49 PM", "postID": "post66543973", "replies": []}, {"text": "My note 3 is far more efficient to my needs than any flagship device due to the fact I have total control of what goes on in my device. I currently have the LG G5 as a paper weight. In my opinion all smartphones need root access. Who wants a new computer without admin rights. Its ridiculous  already. Don't let these big companies like verizon make you feel like this is how its suppose to be. So far they are winning the in terms of control, like Apple. This will be  more common as times passes. Its up to the code breakers to bring the balance back to the force. Who wants a device where uncle sam can track your every move eventually. Root must be obtained not for the individual, but for the sake of digital freedom. Its more serious than people tend to realize!", "time": "1st June 2016, 11:48 AM", "postID": "post67119905", "replies": []}, {"text": "@galr \nWill try and post results", "time": "1st June 2016, 08:49 PM", "postID": "post67127270", "replies": [{"text": "Honor the brave soldier. \n\r\nThanks!", "time": "1st June 2016, 08:50 PM", "postID": "post67127284", "replies": [{"text": "Been using it for a few days. \r\nSome notes:\nBattery seems to be discharging faster (maybe something with some of my apps being moved to the SD Card?)\nApps cannot be migrated - around 70% it fails\nFormatting the card back to portable storage WILL NOT move the apps back to internal first!\n\r\nOther than these, I found no problems. LG must have started modding the adoptable storage system, and then decided to scrap it - it work completely differently on e.g. CM13.", "time": "2nd June 2016, 06:50 AM", "postID": "post67132135", "replies": [{"text": "Thanks. I guess I'm going to skip AS for now.", "time": "2nd June 2016, 07:18 AM", "postID": "post67132356", "replies": []}]}]}]}, {"text": "Sorry for the poor image quality. \nAnyone know of a workaround?", "time": "2nd June 2016, 12:49 AM", "postID": "post67129684", "replies": []}, {"text": "Common people.  Calm down.  This is not a dog's fight,  or a battle of sarcasm.  In fact, i dont even know why they created this thread. Im sure everybody checks the lg g5 section at least 1 or 2 times a day or about 5 times a week at least.  We can all see whether developments are moving on or stuck at some point.  Stop blaming developers or the device, and also stop blaming people for asking the same questions over and over about whether the rom is still ongoing or stopped. Learn patience as well as solidarity  toward developers and end users. Respect each other and stop the bad mouthing or in this case bad words. Inknow this device can get better if developers manage to finish the cm development for it, and after that many other roms based on cm. But i dont blame them if they get stuck at some point.  In fact, it is awesome that they managed to get root for h830 and h850,  even if many said that for the h830 the root wouldn't  be able to be achieved.  And for the h850 which showed a more free path to achieve root.  If you want to blame someone,  blame the carriers you are currently using.  Also,  i havent seen any Cm development  on the s7 or s7 edge,  yes, they have made some stock roms but it isnt cm based.  So.... Dont say that other phones  have gone ahead of this one if they havent done a cm based rom.  Because stock rom is based on stock.  And why would we want to use a stock rom if the interface and almost everything  remains the same?  Then for that it is better to make a patch and not a rom.  Unless it is like alliancerom which has a lot of customatization even if is stock.  So, please calm down.  Lets act as people and not as something which i dont even have a name for.  If you are tired  of waiting for cm development,  then change your device for one more to your liking.  No one is forcing you to keep  that device. And if developments  seems to move at a faster pace than for instance the galaxy s7 after some time,  then just change the device again. \n\nAfter all not everybody has the same level of patience so,  why not change the phone?  Im currently talking from a samsung galaxy s5 which i want to change because  of the amoled screen and also some other things i hate. However,  im waiting very patiently for lg g5 cm development,  even if my galaxy s5 gps is not working,  my amoled screen has burn in image,  my screen kind of flickers if i press a little harder and wont turn on until i press really hard.  And the s5 keeps devaluing for everyday.  This is patience.", "time": "2nd June 2016, 07:22 PM", "postID": "post67141221", "replies": []}, {"text": "Hopefully this will help.\r\nJust added an unnofficial device request for our H830. Please jump in comment to let them know you have the phone and you want development done on it. Development is caused by strength in numbers first.\n\nhttps://forum.cyanogenmod.org/topic/...le-lg-g5-h830/\n\r\nI also reached out to resurrection remix, liquid smooth and many other dev teams on Google+.  You all should do the same.", "time": "3rd June 2016, 01:07 AM", "postID": "post67144780", "replies": [{"text": "Heyyyyyy. I never thought about it. I mean creating a thread in CM website might be a better way than trying to bother developers in here with many repetitions. GREAT IDEA! I will promote this.", "time": "3rd June 2016, 02:05 AM", "postID": "post67145195", "replies": [{"text": "Why do you prefer CM? On my G2 I really wanted to like CM (tried also 13) but I always kept coming back to LG stock (stock based ROM). Everything makes more sense on the LG software. I get it..CM is clean and fast but fast is not really an issue now and clean I can get with debloated ROM.  I guess some prefer X and some Y..", "time": "5th June 2016, 07:22 AM", "postID": "post67176456", "replies": [{"text": "Dont get me wrong hahaha. I like stock roms but stock roms cannot be customized as much as on CM. And it is not that i like CM, I like roms based on CM. Roms like AICP, RR, Blisspop. I know speed is not an issue with this phone, it hardly could be. However, because speed is not an issue anymore since they have created phones with 3Gb of ram and up , and the processor of Snapdragon 820 now, well, it make sense to prioritize other things now such as looking, functionalities, etc... if someone were to create a rom such as Alliancerom for LG G5 i would definitely stick to stock rom, and probably have a 2nd rom installed in the same External sd card. ( that of course if dual boot is achieved). But i doubt that someone will create a rom such as alliancerom since it is mostly TW based with Samsung as main device.  So, to be honest i dont like the UI or how the settings looks like on the LG G5. A rom highly customizable such as Alliancerom allows to change almost everything including the looking of the settings. But, at least with CM and the themes, personification can vary. and sometimes there are extra functionalities that otherwise you wouldnt find in stock roms.", "time": "5th June 2016, 07:36 AM", "postID": "post67176552", "replies": [{"text": "Fair enough", "time": "5th June 2016, 07:38 AM", "postID": "post67176570", "replies": []}]}]}]}]}, {"text": "So I'm leaving for 3 weeks,  are there any various tests that i can run? \n\n\n\n---------- Post added at 06:55 PM ---------- Previous post was at 06:49 PM ----------\n\nLike I'll have intermittent Internet, more so wondering if there are any adb or the likewise", "time": "5th June 2016, 07:55 PM", "postID": "post67184875", "replies": [{"text": "with test are you refering to roms, root, mods and such thing? If you are using ah H820 i doubt it for now. however, maybe when you come back from those 3 weeks. The AT&T section for LG G5 on XDA seems pretty inactive to me, compared to the h850 and Tmobile section, even sprint section seems more active though. But.... Let's see what comes from now on", "time": "6th June 2016, 12:13 AM", "postID": "post67187671", "replies": []}]}, {"text": "Just figured I'd offer,  and yea there's not much from us AT&T folks other than begging for root.  Lol\n\n\n\n---------- Post added at 04:04 AM ---------- Previous post was at 04:03 AM ----------\n\nWhich,  is such a pain esp since I have 0 coding knowledge", "time": "6th June 2016, 05:04 AM", "postID": "post67189712", "replies": []}, {"text": "Giving a solid 2. Just got my G5 today and it feels like development has already come to an end. I do hope someone figures it out, but I guess I'm not holding my breath.\n\nI'd love to learn how people get in there and start learning how to unlock/root things, but I have no idea where to start.", "time": "31st July 2016, 01:45 AM", "postID": "post67975313", "replies": []}, {"text": "The community is great but rooting on the T-Mo variant seems to be getting more difficult with each update.", "time": "8th May 2017, 06:40 PM", "postID": "post72216152", "replies": [{"text": "I gave it a 2.  For a flagship device it leaves several things to be desired.\r\n1.  the phone is actually a little laggy.  Blame it on the bloat if you want, but daily use should be more snappy.\r\n2.  I have had to take it apart to fix the pins on the GPS\r\n3.  The battery can't make it through a full day.\r\n4.  Bootloader lock and no root.  Yes, this is valid.  Especially when it is unlocked for european version and some domestic.  LG can support the users that support the phone.", "time": "24th May 2017, 07:34 PM", "postID": "post72416926", "replies": []}]}, {"text": "i can not judge about development strength due to lack of root/bootloader unlock  for my device H850 AME .\r\nbut i saw that unlocked devices has alot of options/tweaks/roms/kernels and good supported in XDA ..", "time": "2nd June 2017, 06:33 PM", "postID": "post72524657", "replies": []}, {"text": "Powerful but chronic problems", "time": "8th October 2017, 01:05 PM", "postID": "post74079589", "replies": []}, {"text": "Any root for lg g5 at&t?", "time": "9th November 2017, 06:00 PM", "postID": "post74461065", "replies": []}]}, {"title": "Overall speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/lg-g5/review/overall-speed-t3361310", "https://forum.xda-developers.com/lg-g5/review/overall-speed-t3361310/page2"], "threads": [{"text": "Blazing fast", "time": "3rd May 2016, 10:44 AM", "postID": "post66672188", "replies": []}, {"text": "Fastest phone I've ever had, my internet speed has almost quadrupled. Smooth fast phone for sure.", "time": "3rd May 2016, 08:22 PM", "postID": "post66680348", "replies": []}, {"text": "I went from my G2 to this G5 and my internet hotspotting is silky smooth now. I went from playing R6 Siege with spotty 150ms latency to smooth 90ms latency.", "time": "4th May 2016, 05:24 PM", "postID": "post66694107", "replies": []}, {"text": "Swithed yesterday from my G3 to the G5. This thing is so ******* fast, just ridiculous", "time": "4th May 2016, 06:08 PM", "postID": "post66694767", "replies": []}, {"text": "G5 presents a very good performance mainly because the LG overlay.", "time": "16th July 2016, 02:35 PM", "postID": "post67770480", "replies": []}, {"text": "After a few months, mine has gotten insanely slow. Not much is installed on it either.", "time": "16th July 2016, 04:26 PM", "postID": "post67771835", "replies": [{"text": "me too :|", "time": "25th August 2016, 12:22 AM", "postID": "post68351170", "replies": []}, {"text": "I believe the slow down you are experiencing can be attributed to your launcher. If you use Nova launcher rather than the default LG Home, your device should never slow down - even with many apps installed.  I would suggest changing it and then report back your results.", "time": "25th August 2016, 01:45 AM", "postID": "post68351891", "replies": []}]}, {"text": "It's blazing fast!", "time": "23rd August 2016, 05:37 AM", "postID": "post68318292", "replies": []}, {"text": "The device is very fast. Probably has the processing power of some full size computers.", "time": "5th November 2016, 06:36 PM", "postID": "post69476304", "replies": []}, {"text": "I've had my G5 for a while now and the speed is still superb!", "time": "8th May 2017, 06:47 PM", "postID": "post72216249", "replies": []}, {"text": "It's funny, people are so retarded. Everyone bashes on LG as in being a bad brand all the time everywhere. Meanwhile they build the most technologically advanced screens on the planet. The phones are of very high quality. I have the G5 for a year now, still as good as the day I bought it. I own a ultra wide monitor from LG who for the price crushes competitors. But yeah keep bashing because it's keeping prices low and gives faster pricedrops.", "time": "9th May 2017, 08:05 AM", "postID": "post72222811", "replies": [{"text": "I agree LG makes a great product, had three LG phones so far, all worked great, sold two of them so far still working great. Just wish the H831 had root capability but it doesn't so no big deal.", "time": "4th June 2017, 05:39 PM", "postID": "post72547375", "replies": []}, {"text": "Although I don't agree with the bashing, you can't deny the problems with the G3, G4, G5 and V10.\r\nmany G3 just died for no reason..G4 and V10 fried after a year or so. G5 has awful GPS design and very common image retention on the screen.   G2, G6 and V20 are the best in my opinion.   I had G4 that died, and I have a G5 right now with image retention and GPS that I  fixed about 5 times already.  Image retention and crappy GPS are very common issues with the G5, whether you have these issues or not.\n\r\nThe main reason I keep it is the camera.", "time": "11th July 2017, 08:51 AM", "postID": "post72984189", "replies": []}]}, {"text": "It's faster than my core2duo laptop.  I abuse my phone all day at work and this thing has been a monster.  Battery life is awesome when the screen brightness is less than 50 percent too.", "time": "17th June 2017, 12:38 AM", "postID": "post72700515", "replies": []}, {"text": "Super fast with Lineage OS! (h850)\n\nBenchmarked with PcMark Work 2.0\n3719 with battery optimization & balanced perf. profile\n6214 in performance mode", "time": "8th July 2017, 04:54 PM", "postID": "post72953637", "replies": []}, {"text": "The phone is very fast but I'm really disappointed about gaming part, framerate drops in big games with max settings, I was expecting better from a S820 device. \n\r\nI'm thinking moving to LineageOS when 15.0 will be released.", "time": "26th July 2017, 01:05 AM", "postID": "post73173501", "replies": []}]}, {"title": "App launch speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-g5/review/app-launch-speed-t3361311"], "threads": [{"text": "Super fast, faster than any phone out there. Especially with CyanogenMOD 13 installed.", "time": "29th September 2016, 09:20 PM", "postID": "post68916189", "replies": []}, {"text": "very quick", "time": "5th November 2016, 06:39 PM", "postID": "post69476350", "replies": []}]}, {"title": "Multitasking/RAM", "rating": 5.0, "links": ["https://forum.xda-developers.com/lg-g5/review/multitasking-ram-t3361312"], "threads": [{"text": "https://www.youtube.com/watch?v=A1UZEzMCgUI\n\nwithout screen recording i could switch between 4 games without noticing any kind of swapping.\nthe 4 gigs of ram sure speak for itself.", "time": "22nd April 2016, 03:24 PM", "postID": "post66494450", "replies": []}, {"text": "Multi Tasking is awesome. The only area where I hate this phone is Battery and its really bad.", "time": "14th February 2017, 12:46 PM", "postID": "post71026118", "replies": []}, {"text": "My only problem is that apps don't stay in memory as long as I like. So, they refresh often.", "time": "8th February 2018, 07:59 PM", "postID": "post75494723", "replies": []}]}, {"title": "Scrolling smoothness", "rating": 5.0, "links": ["https://forum.xda-developers.com/lg-g5/review/scrolling-smoothness-t3361313", "https://forum.xda-developers.com/lg-g5/review/scrolling-smoothness-t3361313/page2"], "threads": [{"text": "veeeery smooth", "time": "23rd May 2016, 02:20 PM", "postID": "post66987536", "replies": []}, {"text": "Buttery smooth except for those random mobile sites like XDA that have scroll lag on every mobile phone I've tried.", "time": "24th May 2016, 07:10 PM", "postID": "post67007959", "replies": []}, {"text": "Smooth.", "time": "24th May 2016, 10:02 PM", "postID": "post67010185", "replies": []}, {"text": "Any chance you could send over the link for that article?  But seriously, it's so so smooth. I honestly don't think it's lagged once.", "time": "25th May 2016, 03:45 AM", "postID": "post67012977", "replies": []}, {"text": "Mine is \"stuttering\" while scrolling, everywhere. It's not a real stuttering but an illusion and connected with the display I think. It has a ghost effect while scrolling. You can easily notice it in the Android settings or while scrolling an app drawer. I think the display can't do 60Hz or has really bad respond timings.  It's one of the worst looking for moving objects Ive seen on all my devices. Force GPU Rendering btw does nothing positive nor negative on this device.", "time": "2nd November 2016, 02:38 AM", "postID": "post69418809", "replies": []}, {"text": "my scrolling is generally fine. Unless I have many apps open", "time": "5th November 2016, 06:34 PM", "postID": "post69476269", "replies": []}, {"text": "Settings/Developer Options/ Tick on \"Force GPU Rendering\" this should make Android phone smoother/snappier!,\r\nIf root available try L Speed/Entropy/fstrim apps found on Play Store. LG V20 & LG G5 are snappy beasts and most anticipated of 2016. Also well optimised with Snapdragon 820 and is better than Samsung!", "time": "5th November 2016, 07:16 PM", "postID": "post69476782", "replies": []}, {"text": "Maybe just read two posts... two damn post above what I wrote @Ali Mirza. \"Force GPU Rendering\" does nothing. Also the screen seems really bad and has terrible response timings. Worse is scrolling with black font on white the font becomes red while scrolling because of the ghost effect.", "time": "6th November 2016, 02:42 AM", "postID": "post69481736", "replies": [{"text": "No one will help you if you talk like that. Be respectfull. He's trying to help you.", "time": "6th November 2016, 02:40 PM", "postID": "post69488644", "replies": []}]}, {"text": "I have an LG G5 with t-Mobile, and by doing my usual tweaks (changing some settings, deleting or deactivating some apps) I have had a great scrolling experience. 9 out of 10 imho.", "time": "8th November 2016, 03:00 PM", "postID": "post69520238", "replies": [{"text": "And those changes are... what? I wonder if it's maybe caused by the damn Google app I installed later, because it uses an always on overlay over the whole screen, for that screen / search / capture you can't deactivate. I think I had great smoothness too out of the box but then it get worse suddenly, and I don't have any special apps installed.", "time": "10th November 2016, 01:29 AM", "postID": "post69544463", "replies": [{"text": "For future reference, I had been plagued by this issue as well ever since getting this phone.  For me, fast scrolling was just fine--it was only evident when doing slower scrolling, like scrolling slowly through the application drawer.  The display would hitch repeatedly, as if the graphics buffer could just not keep up.\n\r\nFor me, disabling the developer option \"force GPU rendering\" has removed the problem for me.  I swear I tried with and without this option before but it's working well for me, so now I have one less irritation with this piece of hardware.", "time": "26th December 2017, 04:48 PM", "postID": "post74969343", "replies": []}]}]}, {"text": "Just upgraded from a Nexus 5X, much smoother, no comparison. N5X is ok but it has a micro hangs and stutters all the time.", "time": "8th November 2016, 05:53 PM", "postID": "post69522647", "replies": []}, {"text": "Android destiny long time used scrollıng bad", "time": "8th October 2017, 01:06 PM", "postID": "post74079601", "replies": []}]}, {"title": "Heat", "rating": 4.0, "links": ["https://forum.xda-developers.com/lg-g5/review/heat-t3361314", "https://forum.xda-developers.com/lg-g5/review/heat-t3361314/page2", "https://forum.xda-developers.com/lg-g5/review/heat-t3361314/page3", "https://forum.xda-developers.com/lg-g5/review/heat-t3361314/page5"], "threads": [{"text": "i think the G5 heats a little bit too much\ntoday i was simply downloading Hearthstone (800MB approx) and in standby it heated too much", "time": "19th April 2016, 08:41 PM", "postID": "post66448766", "replies": []}, {"text": "i think its quite excellent actually.\ni could not notice any throttling during gaming etc. well maybe thats just because even the gpu is idling at <15% during asphalt 8 play", "time": "22nd April 2016, 03:22 PM", "postID": "post66494431", "replies": []}, {"text": "I had zero issues with thus device heating up until last night... I was at the movies with the fam.. In the theater I only had 1x for data and the phone got hot while searching for a better data connection.  Cooled right down after leaving the theater.", "time": "2nd May 2016, 01:44 AM", "postID": "post66647092", "replies": []}, {"text": "Coming from an htc m7, so a huge step anyway... Phone is top!", "time": "28th May 2016, 06:55 PM", "postID": "post67067787", "replies": []}, {"text": "This was one of the first things I noticed because I used the gps probably 45 mins after taking it out of the box. I watch YouTube vids for around an hour a day and after a while it does become noticeable but I have to be honest; it really doesn't bother me all that much.", "time": "29th May 2016, 07:03 PM", "postID": "post67081937", "replies": []}, {"text": "Can feel warm and a little uncomfortable in warmer weathers (20-30 Celsius).", "time": "30th May 2016, 02:44 PM", "postID": "post67092724", "replies": []}, {"text": "Mine heats up a lot. I'm a little concerned honestly.", "time": "15th June 2016, 05:38 PM", "postID": "post67331709", "replies": []}, {"text": "I don't experience anything unusual.", "time": "15th June 2016, 10:11 PM", "postID": "post67335520", "replies": []}, {"text": "heres the deal boys...\n\nYes this phone gets hot when its used hard.....if your not incurring reboots while running it hard , then you'll probably be good\nAfter a month buying this , I started getting reboots ....hot and cold\nThe first time I sent it in , they said to leave sim and battery at home...\nI got it back and started the usual 30 or more updates from App Store and phone got real hot and started rebooting again every minute\neven when it was cool...it rebooted but at a longer interval...\nThey told me to send battery in too on second go around...\nJust got it back , it had a system update to do and then the 30+ app updates....this phone was getting a workout...\nI did the App updates right after the system update with the optimization ....\n\nI'm 20 apps into it...the battery cooled down and the apps are still going...\n\nlooks like they have a battery issue with these phones. If I don't report back , then all is good...\n\nmike", "time": "15th June 2016, 11:01 PM", "postID": "post67336094", "replies": [{"text": "No, it doesn't mean that LG has an issue with the batteries. It only means that YOU had issue with YOUR battery.\r\nI'm glad your phone is OK and it was just the battery.", "time": "16th June 2016, 12:06 PM", "postID": "post67343079", "replies": []}]}, {"text": "Only got mine yesterday, but I've used it a lot in that short time and it get nowhere near as hot my previous 2 phone a Nexus 4 and G3 it gets warm but not what I would call hot compared to them 2 anyway, at its worst mostly watching videos it can get a quite warm, but gaming it barely gets warm, I'm loving it so far but time will tell I guess but so far so good.", "time": "18th June 2016, 04:19 PM", "postID": "post67377218", "replies": []}, {"text": "Mine heats up too, specially while using Snapchat or YouTube. Haven't played Asphalt or other graphic-intensive games, so I can't comment whether my device has the same issue with them or not.", "time": "19th June 2016, 11:59 AM", "postID": "post67387956", "replies": []}, {"text": "Mine stays quite cool during heavy usage, it does get realy hot while charging though. I expect this is the same with others?", "time": "19th June 2016, 06:17 PM", "postID": "post67392697", "replies": []}, {"text": "Coming from the Samsung Galaxy Note series (Note 1 - Note 5), the LG G5 gets pretty hot even when idling.... My solution? Waiting for the Note 7 to be released and then goodbye LG!", "time": "20th June 2016, 09:02 PM", "postID": "post67410033", "replies": [{"text": "Check what's running in the background. Mine is very cool (H850).", "time": "29th June 2016, 10:19 AM", "postID": "post67529621", "replies": []}]}, {"text": "Better than the V10. My old V10 overheated while I was using Skype to the point it shut itself off. Had no problems with the G5.", "time": "1st July 2016, 12:51 PM", "postID": "post67559355", "replies": [{"text": "heat was worse with the v10 running snapchat... but have you tried running pokemon go on the g5? I've never had a phone get this hot besides my galaxy s4 and that thing sucked", "time": "6th July 2016, 11:46 PM", "postID": "post67635041", "replies": [{"text": "I'm so excited for some Pokémon Go! ... But I assume with high precision GPS, screen, camera, connection, my phone's going to get spicy hot. It warms up easily, otherwise, but it gets hot to the touch sometimes while charging.", "time": "7th July 2016, 04:24 PM", "postID": "post67643947", "replies": [{"text": "I wish I could play it , I keep getting \"GPS location not found\" :'( .", "time": "8th July 2016, 03:56 AM", "postID": "post67650873", "replies": []}]}]}]}, {"text": "i juat got mine. I'm charging it right now and downloading all the previous apps via wifi. It feels quite hot now. I'm coming from a G4 ans Nexus 4", "time": "8th July 2016, 11:25 AM", "postID": "post67654643", "replies": []}, {"text": "Since i activated 2D Gpu acceleration in developer options, i have an ice block. It barely gets warmer than my skin. During charging it gets warm, but not hot.", "time": "9th July 2016, 12:00 AM", "postID": "post67663205", "replies": [{"text": "I'm often having it thermal throttle actually, but one thing needs to be said: it's really hot outside. \nUsed it as a constantly on Gps under the sun (40C, on a motorcycle)  in a biiig rubber cover and once the job was done, it was throttled back to stone age. I actually took the batttery out for a while because i got scared it wouldn't revert to being snappy as supposed. \nOf course this is an extreme use scenario: phone did not switch off by itself, and kept working: it just took 5 seconds to get from normal camera to fishe....i mean wide lens \n\n\n\r\nNice, might try that. I imagine battery time gets better too or?", "time": "2nd August 2016, 09:16 PM", "postID": "post68016292", "replies": []}]}, {"text": "[QUOTE=brancangekibe;68016292\r\nNice, might try that. I imagine battery time gets better too or?[/QUOTE]\n\r\nAt the moment it's pretty much optimized for battery lifetime but i'm really pleased with the 2800mah battery. I've barely touched it yesterday since i'm having a men flue (a real one, i'm almost seeing the light...) therefore the results are not too representative but the average given is accurate. It's keeping its breath longer than with the cpu doing all the work, thats for sure. A wild guess... 20%... \n\r\nKind regrets", "time": "3rd August 2016, 05:28 AM", "postID": "post68020552", "replies": [{"text": "Thanks for the info, i activated it immediately! Hope you get better soon! Man flues are the worse", "time": "3rd August 2016, 06:08 PM", "postID": "post68029047", "replies": []}]}, {"text": "I just picked up a G5 on Monday after my Nexus 4 finally bit the dust. The N4 got super super hot after the screen was on for a while, to the point where it seriously lagged out and I had to put it down for a bit and cool off. Doing the same things with the G5 and it is barely noticeable. It's gets a little warm, but not screaming hot like the N4 did. I'm happy with it.", "time": "3rd August 2016, 11:20 PM", "postID": "post68032703", "replies": []}, {"text": "My G5 doen't heat. I played Asphalt 8 about 5 hours!", "time": "7th August 2016, 03:19 PM", "postID": "post68081428", "replies": []}, {"text": "It doesnt get hot , its really comfortable to play but i give -1 on this one because its from throttling caused during the game , Antutu benchmark is also the prouf , 2nd 3d test (Garden) is lower than any other phone with snap 820. I would trade some extra heat for more stable performance!", "time": "25th August 2016, 04:02 PM", "postID": "post68361547", "replies": []}, {"text": "Love the G5. Mine doesn't get that hot. Just the normal hot temp. Love the camera, the performance, the spare battery with battery kit, also a spare of antenna modules (LG Camplus).", "time": "20th October 2016, 03:39 AM", "postID": "post69213896", "replies": []}, {"text": "Mine stays cool until i use mobile data or GPS. Charging makes it a little warm but nothing overly bad", "time": "4th April 2017, 09:56 PM", "postID": "post71728592", "replies": []}, {"text": "Wifi for prolonged use is the only thing that really gets the heat up on my G5. And then it's only sometimes. \n\nI disabled most of the bloatware that came with the phone. That stuff is always active so killing a lot of that helped.", "time": "19th July 2017, 04:16 PM", "postID": "post73089883", "replies": []}, {"text": "Bought my h860  a month ago, (Taiwan version i think), didn't upgrade the Android at all, still at 6.0.1, original v10a, been playing need for speed no limit and injustice 2 for hours while on battery, not getting too hot, quite pleased. Rebooted twice when i tried to start a game on emulator (dolphin) and when i played ppsspp for more than 2 hours, constantly loading saved games in Burnout Legends. How do you turn off mitigations, i don't have it in the Developer Options.", "time": "28th July 2017, 03:14 PM", "postID": "post73205162", "replies": []}, {"text": "Not much of a problem, really. Sometimes, but only with heavy game use.", "time": "8th February 2018, 08:00 PM", "postID": "post75494733", "replies": []}]}, {"title": "Low light", "rating": 4.0, "links": ["https://forum.xda-developers.com/lg-g5/review/low-light-t3361315", "https://forum.xda-developers.com/lg-g5/review/low-light-t3361315/page2"], "threads": [{"text": "In low light the phone is a bit too dim with auto settings.  Similar to the G3.", "time": "19th April 2016, 05:42 PM", "postID": "post66445757", "replies": []}, {"text": "Missed a chance for a great camera to be amazing!\r\nIta reliable, fairly stable and of good quality.", "time": "20th April 2016, 09:04 AM", "postID": "post66456341", "replies": []}, {"text": "Hum maybe we can take pics and post them here but only low light pics", "time": "23rd May 2016, 11:41 PM", "postID": "post66995343", "replies": [{"text": "I think this link has better quality:\nhttps://drive.google.com/open?id=0B-...B2R3lkc2thdEFB\n\nHi, just sharing as someone asked. It wasn't meant to be a nice image, just a low light example. There are a lot of details and I think it did a good job. Photo is handheld, no flash, auto, main camera. \nNote: the acene is actually a bit darker than represented in the photo.", "time": "26th May 2016, 08:44 PM", "postID": "post67040445", "replies": []}]}, {"text": "Was at the Primal Fear show last night at the mod club in Toronto Canada and zoomed  in pics all look like garbage... . Worse than my old HTC one m8.  The videos fared a bit better once I got the focus to work, but still aren't perfect, the sound didn't turn out great,  must have been way too loud for the phone in its life proof case.", "time": "2nd June 2016, 07:59 PM", "postID": "post67141699", "replies": [{"text": "Make sure you lens is clean. I keep a cleaning cloth with me all the time. It really makes a HUGE difference.", "time": "8th June 2016, 02:04 PM", "postID": "post67225504", "replies": [{"text": "My phone should be pristine in its life proof case. . Does having the camera accessory make a difference?", "time": "8th June 2016, 02:51 PM", "postID": "post67226164", "replies": []}]}]}, {"text": "The low light performance is alright on Auto mode but if you know how to take picture on Manual mode then it's a lot better especially with a tiny touch of Snapseed for sharing. :P", "time": "29th October 2016, 02:39 PM", "postID": "post69362346", "replies": []}, {"text": "I had to change the camera because the OEM camera began to malfunction with it's zooming.  I think it's ok now as the replacement was supposed to be OEM.", "time": "8th May 2017, 06:53 PM", "postID": "post72216327", "replies": []}, {"text": "Need normal lighting for photos only and autofocus want quickly", "time": "17th May 2017, 12:30 PM", "postID": "post72325745", "replies": []}, {"text": "Lotta noise in low light-very disappointing, but yes, has good details and yes, clean the camera glass often, it really makes a difference.", "time": "28th July 2017, 03:27 PM", "postID": "post73205305", "replies": []}]}, {"title": "Photo quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-g5/review/photo-quality-t3361316", "https://forum.xda-developers.com/lg-g5/review/photo-quality-t3361316/page2", "https://forum.xda-developers.com/lg-g5/review/photo-quality-t3361316/page3", "https://forum.xda-developers.com/lg-g5/review/photo-quality-t3361316/page5"], "threads": [{"text": "G3 was better!", "time": "11th June 2016, 04:59 PM", "postID": "post67272758", "replies": [{"text": "No way bro \r\nMy v10 has fantastic camera", "time": "12th June 2016, 01:58 AM", "postID": "post67278079", "replies": [{"text": "This thread is about the G5's camera, so that's irrelevant... Unless, of course, they use the same camera and I didn't know?\n\r\nBut I still agree with you. I don't see how that's possible that the G3 has a better camera.", "time": "7th July 2016, 11:09 PM", "postID": "post67648723", "replies": [{"text": "yea they have the same sensor\nand i had g3 it has bad  cam beside my lg v10", "time": "8th July 2016, 02:55 AM", "postID": "post67650450", "replies": []}]}]}]}, {"text": "I came from the S7 and before that the iPhone 6s Plus. I can't take decent photos with the G5 to save my life. It's frustrating.", "time": "11th July 2016, 09:54 PM", "postID": "post67702649", "replies": []}, {"text": "What?? Is it true that G5 has worst camera ? Phonearena says it has best camera when compared with S7 and 6s plus.", "time": "13th July 2016, 04:48 AM", "postID": "post67721622", "replies": [{"text": "If you put it in manual mode and mess with it a bit it'll take great pics. Auto mode sucks. For me at least. And yes, I've made sure the lens is clean and all that.", "time": "13th July 2016, 02:26 PM", "postID": "post67727099", "replies": [{"text": "I understand. But it is hard to take all the pics in manual mode. I have G3 now and planning to by G5 in a couple of months and it seems i have to rethink about G5.", "time": "14th July 2016, 06:07 AM", "postID": "post67736996", "replies": []}]}]}, {"text": "Yeah, this phone takes great manual photos, but that's about it. The anti-shake was way better in the G4 over the G5- does the G5 no longer have the laser focus? It was incredible how good the pictures were with the flash off on the G4; in my experience, most phones (including Samsung) take shaky photos with flash off, and are able to focus much better with flash on.\n\nAlso, like in all LG phones, panorama is completely useless. They should just get rid of the feature altogether. It doesn't matter how slow or steady I move, everything always comes out jagged. Very annoying.", "time": "14th July 2016, 11:12 PM", "postID": "post67748866", "replies": []}, {"text": "yeah, I feel the same, my dads G3 camera is awesome... but even under the the G5s latest v10d, the images were clearer and OIS was more stable on the G4 in AUTO mode.  I do use Manual mode alot, but sometimes its nice just to pull out your phone and snap a quick situation or a few quick images.   \n\r\nIntrestingly,  I find sometimes in \"Auto\" mode, switiching \"OIS\" OFF (toggle \"OIS\" and \"steady cam\" mode in camera settings), takes better Macro shots, which says to me.. that in its current state, the G5 camera needs work.\n\r\nHowever, the G5 camera is a really great camera and a really great device all round, its just a shame reviewers seem to go more for how it looks rather than its innovations", "time": "17th July 2016, 06:12 PM", "postID": "post67786828", "replies": []}, {"text": "Mine are crisper and more detailed with g4,  specially the front canera. Could be this due to an high compression? Maybe there's a trick to loer jpeg compression!", "time": "21st July 2016, 08:34 PM", "postID": "post67847634", "replies": []}, {"text": "G3 was far better..!", "time": "24th July 2016, 07:59 PM", "postID": "post67887334", "replies": [{"text": "Nonsense.", "time": "24th July 2016, 09:19 PM", "postID": "post67888227", "replies": []}]}, {"text": "LOL! The worst camera comparison in history. I am not saying G5 is the best but it is certainly not what the website said it was. \n\nHey look! Comments section was closed. Go figures. \n\nAnyway, the last close up shot was the worst! No reputable review site would use close up image more than 100%. These are camera sensor made for phones, they are not meant to be zoom beyond 100%.", "time": "25th July 2016, 10:19 AM", "postID": "post67894160", "replies": []}, {"text": "I Love this phone's Cameras: my pics  are coming out better, sharper and better balanced  than any other phone i have had my hands on this months and that includes: 6s, 6s+, G4, and S7. Of course this is subjective but i really LOVE the camera. (Auto mode is meh tough when compared to 6s', need to be objective there. I was taking a pic today: my girlfriend's face with a stongly lighted background _door in the sun_ and even if messing wigh manual mode gave me the best pic, auto mode  just wasn't keeping it up with my gf's 6s which gave out a decent picture immediately.)\nGotta be honest. (Of course i didn't tell her )", "time": "2nd August 2016, 09:12 PM", "postID": "post68016239", "replies": []}, {"text": "I'm somehow disappointed. The camera oversharpens the pictures most of the time. But the wide-angle camera always oversharpens them. I wonder if it could be fixed with a newer software? Also the pictures get blurry at the slightest movement. But it's still a good camera.\r\n4/5", "time": "28th August 2016, 11:11 PM", "postID": "post68418141", "replies": []}, {"text": "very high", "time": "5th November 2016, 06:40 PM", "postID": "post69476356", "replies": []}, {"text": "Camera is very good especially in Manual mode but one thing I found out about the Auto mode that HDR tends to blur details a lot more when zoomig in than taking picture with HDR option turned Off. Hope they improve the camera on Nougat update.", "time": "14th November 2016, 09:11 PM", "postID": "post69621906", "replies": []}, {"text": "I'm also pretty disappointed with the quality of the G5 pictures in auto mode. Not that they're bad or anything, but I find myself having to take multiple pictures to get acceptable results, particularly in poor lighting. Never had that issue with my G4.", "time": "22nd November 2016, 11:34 PM", "postID": "post69747969", "replies": []}, {"text": "Weird.\n\nI've just got back from Iceland, and can say that this phone out performed itself. Nothing better than that second wide angle lense on some of the white, barren landscape. Some of my photos looked absolutely incredible!\n\nI even managed a few shaky images of the northern lights (didn't bring my tripod that night!).\n\nLove this phone!", "time": "23rd November 2016, 06:08 PM", "postID": "post69759757", "replies": []}, {"text": "https://youtu.be/vOKGo5K6CWY", "time": "2nd December 2016, 01:06 PM", "postID": "post69894759", "replies": []}, {"text": "I've used the LG G5 for about a month and I'm disappointed.  Most new (2016) smartphones take nice outdoor pictures of things that don't move much.  Go inside and try to photograph your kid dribbling up/down the court with this phone and you'll be frustrated.  Indoor pics with any kind of movement is a guaranteed blurry picture.  I've turned OIS off and tried the same thing today at my son's birthday party (indoors at the skate rink), poor focus and slow shots.\nI've had the S7 and it takes much better pictures of things in motion (has a fast focus/sports mode)... This phone is going bye bye soon because of this one issue.", "time": "5th December 2016, 05:39 AM", "postID": "post69934071", "replies": [{"text": "I knew the S7 was better in low light with moving objects when I got the G5. I do tink the G5 camera is much more capable camera than the sammy's. But I did tell anyone who asked me, if you are going to shoot photos of children/pets indoors, get the S7.   I just hated that the S7 can only do 10 seconds long exposure, just 800 ISO, no wide angle (or any secondary lens) and 4:3 ratio which leaves me with just 9MP if I want to use  16:9 (and I always do).  Try using manual mode (higher ISO) or use a flash.", "time": "6th December 2016, 10:05 AM", "postID": "post69953084", "replies": []}]}, {"text": "", "time": "6th December 2016, 07:27 PM", "postID": "post69961129", "replies": []}, {"text": "It's nothing exciting but the ultra wide angle is neat...so as long as you want to fix the distortion in Lightroom or another software.   Then again iI shoot real estate with Canon 5D MKIII so I'm not expecting anything but mediocre results with any smartphones...", "time": "14th December 2016, 02:54 PM", "postID": "post70086544", "replies": [{"text": "The camera is pretty great if you just manual mode. Regarding the wide angle lens. After 1.5 years I can tell you that this is the best feature on LG phones. The wide angle is the reason I won't buy a different brand right now. I don't mind the distortion at all, an 11mm lens will have distortion, it's part of having ultra wide angle. I actually find it contributing to the wide angle effect.", "time": "2nd August 2017, 02:53 PM", "postID": "post73262351", "replies": [{"text": "I tried with RAW mode and it's not terrible.  But I agree the wide angle lens even with distortion is great for photos you normally cannot capture without having to use the panorama (which I don't care for in general).  Quick and easy!", "time": "2nd August 2017, 03:02 PM", "postID": "post73262450", "replies": []}]}]}, {"text": "I have my h860 for a month and the camera is somewhat disappointing in Auto mode and Panorama is buggy as hell. Not too impressed.", "time": "28th July 2017, 03:30 PM", "postID": "post73205336", "replies": []}, {"text": "I think G5 Has a Very good camera As compared to LG V10\r\nWhat's your opinion Buddies?", "time": "1st November 2017, 02:44 AM", "postID": "post74364610", "replies": []}, {"text": "i am very happy with the camera , the speed is a little slower than some, ( on first shot )  but when a moment is taken to frame shot and improve lighting or adjust iso in manual settings , the camera takes excellent pics . i use both wide angle sensor and regular  , and cant say ive owned a better phone camera .  I have installed  Google Camera HDR+ (V4.0) ported for lg g6 , ripped from pixel , it offers some inhanced HDR , but is slower and images a little undersized , when compared to oem app . But the hdr really adds flair to the dogs hair .  Native Video is very good as well . 4k fiiles are huge .  Using Google Camera HDR+ (V4.0) the camera will only do 1080p but that video is nice as well. Having used this phone for almost a year i can say its nearly my fav.  very few limitations really botehr me.  Only my friends S8 compares in quality  video and stills , but i paid 120 , he paid 600+ , so my phone is much better .... i cannot see myself settling for a phone in the future that has anything but the best or near best camera .  I also own a sony A6000 for family photo and holidays , but having this phone in my pocket has really saved the day .  ok enough rambling", "time": "10th November 2017, 02:06 AM", "postID": "post74464402", "replies": []}, {"text": "Hi, I just upgraded from a G4, fab camera. I don't find the G5 to be quite as good, or should I say I just have some issues with it that might be solvable. I usually take landscape photo's when out and about and I find in bright light there seems to be an orange push to white sunlight. Also in dark settings I find a lot of glare, beams of light coming from street lights for example. Often is can be cause by an dirty lens but I find even when I clean it thoroughly I still get this effect to some extent. Anyone experiencing the same issues?", "time": "10th January 2018, 10:18 PM", "postID": "post75153665", "replies": []}, {"text": "I just recently switched from Samsung Galaxy S6 Edge to an LG G5 because I broke it and the only phone I could afford and found a really great deal, LG G5 already Unlocked barely with a SUPCASE and screen protector which was a great deal for 190$. \n\nThe cameras is as good and maybe even a bit better because of the wide screen angle dual camera. \nBut damn the LG cameras software sucks and pretty much all other apps and other cameras you can download on it sucks... \n\nI miss the Samsung default camera app... \n\nThe best apps are the to take photos is the Candy Camera app and a mod or port of the google camera... but still doesn't pleasant to use as Samsung cameras app.\n\nCandy Camera : For filter and photo editor (It's the best)\nhttps://play.google.com/store/apps/d...pulumera&hl=en\n\nI just posted the Port/Mod in the LG G5 section.\n[APP][PORT][Repost] Google Camera port for LG G5 Normal & Wide Angle (by cstark27)\nhttps://forum.xda-developers.com/lg-...oogle-t3751224\n\nother good apps are Z Camera, B612, Camera 360, Cameringo, Open Camera, Camera ZOOM...", "time": "21st February 2018, 02:18 PM", "postID": "post75646508", "replies": []}, {"text": "Gcam and Gcam Wide.", "time": "1st March 2018, 11:27 AM", "postID": "post75734831", "replies": []}]}, {"title": "Video quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-g5/review/video-quality-t3361317", "https://forum.xda-developers.com/lg-g5/review/video-quality-t3361317/page2"], "threads": [{"text": "Videos are a bit...meh. The lack of 60 fps and \"manual video\" in general is, frankly, sad. The turnaround was using v10's camera app ported to the G4 (but works on G5) : 60 fps FullHd (but no OIS and no wide lens atm)", "time": "2nd August 2016, 09:38 PM", "postID": "post68016575", "replies": []}, {"text": "I recorded some waterfalls and other natural objects and I was very much impressed with it.  It is the best video I have seen recorded  on a cell phone.  The live action of my boys baseball games is equally impressive.  Maybe my eyes aren't that sensitive.  \n\nJD", "time": "5th August 2016, 07:37 AM", "postID": "post68050801", "replies": []}, {"text": "All my respect for this company and for its phones. G5 IS THE BEST", "time": "7th August 2016, 02:19 PM", "postID": "post68080757", "replies": []}, {"text": "I do love the quality of the video and really enjoy the time-lapse feature!", "time": "2nd September 2016, 10:07 AM", "postID": "post68490087", "replies": []}, {"text": "I recorded some videos from cars competition using different modes (4K, wide camera, HD with slow motion)\r\nSlow motion.\n\r\n4k \n\r\nWide camera\n\r\nYou can see all videos on my youtube channel", "time": "13th September 2016, 10:53 AM", "postID": "post68664517", "replies": []}, {"text": "Can someone help me on how to use the timelapse videos ? I tried with the timelapse button but nothing change when watching the video.", "time": "13th September 2016, 02:48 PM", "postID": "post68667537", "replies": []}, {"text": "I fell in love with the time lapse mode...\nhttps://youtu.be/6YGnQqQpjkM", "time": "23rd October 2016, 05:54 PM", "postID": "post69270726", "replies": []}, {"text": "You can do manual video using the V10 apk camera app for non rooted", "time": "24th October 2016, 03:08 PM", "postID": "post69284365", "replies": []}, {"text": "The photos this beast takes are superb but videos are kinda \"meh\" but I think it's because of that \"steady\" feature as it kinda \"warps\" the video so just OIS is better if you have steady hands.  Also thank god for V10 Camera Apk for 1080p 60 FPS video recording...60 fps is sooo beautiful! \n\nhttps://www.youtube.com/watch?v=MsMGEg44tPE", "time": "29th October 2016, 02:09 PM", "postID": "post69361999", "replies": []}, {"text": "While i was driving i saw the mount shaking too much and i thought the result video was going to be really shaky....i couldn't be more wrong OIS did a great job and the video turned out perfect", "time": "30th October 2016, 03:58 PM", "postID": "post69377930", "replies": []}, {"text": "I'm so glad to see this post and find out about the v10 camera port", "time": "2nd November 2016, 08:02 PM", "postID": "post69430869", "replies": []}]}, {"title": "Selfie quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/lg-g5/review/selfie-quality-t3361318", "https://forum.xda-developers.com/lg-g5/review/selfie-quality-t3361318/page2"], "threads": [{"text": "Would've been 5 stars if the front camera wasn't prone to suddenly getting really grainy, really dark, or really bright. Will update if the 10d update fixed that.", "time": "7th July 2016, 04:45 PM", "postID": "post67644236", "replies": []}, {"text": "hello im new here. i dont know if you guys notice front selfie camera. at night while taking pictures, the camera lags, making picture quality blurry. i also notice if i smile while snapping the pic, in the outcome pic, im already not smiling and my eyes half closed, its funny. weird. heres another one. you save the pictures on SD card, there would be no lag/delay in camera , while if you change setting and change to storage to device, then take 2-3 pics then delete those pics, you will see a black screen for like 3 seconds before returning to the camera screen itself. please anybody...if theres anyone working for LG here, please fix. i have done the hard reset as the agent told me. but to no avail. i think this one needs another update , i love this phone but it needs camera bug updates because it gets so annoying already. given that the lg g5 has the 8mp front camera, this is weird.\n\r\ni have the verizon one.", "time": "11th August 2016, 07:57 PM", "postID": "post68145050", "replies": []}, {"text": "Hi, sorry, may i ask bout LG Stylus 2, i want to search about mirroring like samsung but i can not to find it. did you know how to solve it.\n\r\nthanks", "time": "12th August 2016, 08:11 AM", "postID": "post68151475", "replies": []}, {"text": "Front camera always looking a bit too smooth, like the beauty filter is active, but its deactivated.", "time": "30th October 2016, 04:14 PM", "postID": "post69378176", "replies": []}, {"text": "Yeah, exactly.... When you are a girl that's probably good thing, but for man is freaking anoying with this filter, it looks really weird.... Any solution to this?", "time": "1st November 2016, 10:38 AM", "postID": "post69405805", "replies": []}, {"text": "My front camera on my lg g5 is distorted, its blurred in the top and bottom of screen. I dont know why. Anyone experience this?", "time": "3rd November 2016, 09:35 AM", "postID": "post69438565", "replies": []}, {"text": "The front facing camera is great. I am very impressed.", "time": "5th November 2016, 01:22 PM", "postID": "post69471811", "replies": []}, {"text": "Can't say the front facing camera is very good. Better than alot of other phones but its grainy smooth and loses so much detail.", "time": "3rd January 2017, 11:44 AM", "postID": "post70372794", "replies": []}, {"text": "Front camera on my G5 sucks totally. The highlights always get a pink tint and the camera doesn't feel like something that should be present in a flagship device. I have the OnePlus 3 too, which performs much better than my G5. Even the rear camera isn't as good as it should've been. I use the Indian variant H860 with the lastest software available for it ~ V10m", "time": "17th January 2017, 07:41 AM", "postID": "post70589113", "replies": []}, {"text": "this one is better than s7 edge?", "time": "12th August 2017, 06:38 PM", "postID": "post73378135", "replies": []}]}, {"title": "Time to take picture (camera launch speed)", "rating": 5.0, "links": ["https://forum.xda-developers.com/lg-g5/review/time-to-picture-camera-launch-speed-t3361319"], "threads": [{"text": "you can set it so it will open the camera while being in deep sleep by just pressing volume down twice.\neven further you can set it so it takes a photo right away when doing this.\nthis takes less than 3 seconds", "time": "22nd April 2016, 03:33 PM", "postID": "post66494595", "replies": []}, {"text": "With the above mentioned trick (double press volume down with screen is off) it take about 2.5 seconds (intended the range between button press and photo being taken)", "time": "6th January 2017, 08:29 PM", "postID": "post70427804", "replies": []}]}, {"title": "Software (ease of use, features, etc)", "rating": 4.0, "links": ["https://forum.xda-developers.com/lg-g5/review/software-ease-features-t3361320"], "threads": [{"text": "lg camera app doesn't have background blur effect!!", "time": "26th September 2017, 05:05 AM", "postID": "post73934633", "replies": [{"text": "Please stop spamming all around the forum...please.. You DONT have blur effect on stock camera and you weren't supposed to!", "time": "26th September 2017, 02:24 PM", "postID": "post73939296", "replies": []}]}]}, {"title": "Charging speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/lg-g5/review/charging-speed-t3361321", "https://forum.xda-developers.com/lg-g5/review/charging-speed-t3361321/page2", "https://forum.xda-developers.com/lg-g5/review/charging-speed-t3361321/page3", "https://forum.xda-developers.com/lg-g5/review/charging-speed-t3361321/page5"], "threads": [{"text": "This is the first phone I have had that would actually increase the charge significantly while navigating using google maps in the daylight.  And it increases pretty fast.", "time": "19th April 2016, 05:45 PM", "postID": "post66445826", "replies": []}, {"text": "My Anker QuickCharge 3.0 charger got my G5 from 0 to 100% in ~75 minutes while on. The same charger port got my spare battery in the cradle fro 0 to 100% in ~3 hours (it only pulled 5V).\n\nAfter lunch today, I plugged it into a USB 3.0 port on my Lenovo T430, and it got from 60 to 100% in under 30 minutes while pulling over 1.2 amps (way above spec).\n\nI'm happily impressed!", "time": "20th April 2016, 12:17 AM", "postID": "post66451641", "replies": []}, {"text": "Could be better? Not close to the G4", "time": "20th April 2016, 09:05 AM", "postID": "post66456350", "replies": [{"text": "That's simply not possible unless you are using a non QC 3.0 charger or bad lead.", "time": "20th April 2016, 01:28 PM", "postID": "post66459529", "replies": [{"text": "Well i aint going to get in to an argument but 30+ hours on my G4 and 20+ hours on my G5? I think i might have a point?", "time": "20th April 2016, 03:40 PM", "postID": "post66461571", "replies": [{"text": "This thread is about charging speed, not battery life.", "time": "20th April 2016, 03:43 PM", "postID": "post66461628", "replies": []}, {"text": "Remember the G4 had a bigger battery so its only obvious the G4 last longer. But luckily we can buy multiple extra batteries", "time": "21st April 2016, 04:19 PM", "postID": "post66478628", "replies": []}]}]}]}, {"text": "I'm loving the charging speed. It's like night and day compared to the M9 I used to own.", "time": "20th April 2016, 05:55 PM", "postID": "post66463746", "replies": []}, {"text": "Doesn't seem much faster than speed charge 2.0 at all to me", "time": "21st April 2016, 04:37 AM", "postID": "post66470603", "replies": [{"text": "As has been discussed elsewhere, QC 3.0 doesn't boost speed much if at all over 2.0. Instead it provides a continuous range of charging voltages (or amps? or whatever) so that it can charge at just the right rate. This should heat the battery less and (in theory, no idea how true/noticeable this will be after a year of use) wear down the battery less because of it.", "time": "21st April 2016, 08:01 PM", "postID": "post66482034", "replies": []}]}, {"text": "just throwing this in.\r\nacording to Benson Leung LG G5 is not usb type c compliant when it comes to charging.\r\nhas anyone here tried charging the G5 using a true usb type c fast charger? i wonder what the outcome might be.\r\ni'll be sad if i have to buy separate chargers just for this phone. (in case i get any true usb type c devices in future i mean)\nhttp://www.xda-developers.com/be-war...pec-compliant/", "time": "22nd April 2016, 04:04 PM", "postID": "post66495077", "replies": [{"text": "Charged fine with my 6P charger. About 2A so not full whack, but no issues.", "time": "22nd April 2016, 05:02 PM", "postID": "post66495955", "replies": [{"text": "are you using a cable that contains a 56K resistor?", "time": "22nd April 2016, 05:11 PM", "postID": "post66496119", "replies": [{"text": "No idea. It's the 1 that came with the 6P so I would expect so.", "time": "22nd April 2016, 05:19 PM", "postID": "post66496230", "replies": []}]}]}, {"text": "Qualcomm's Quick Charge goes outside the USB-C spec in order to be able to charge compatible Quick Charge devices faster (higher voltages when possible).\n\nDose this meet the USB-C spec, no... Would I be concerned about it, Not if I'm using a reputable QC charger and USB-C cable.\n\nHappy fast charging....", "time": "22nd April 2016, 07:29 PM", "postID": "post66498139", "replies": []}]}, {"text": "I'll be commenting on these cables and QC3.0 charging on my battery charging thread once I have more data.  I have 2 QC3.0 USB wall chargers that I'm collecting data on now.  These both have USB-A ports, so they need cable adapters.\n\nBut yes, early SPOILER @GottZ: The USB-C compliant cables (USB-A to USB-C) with the resistor limit the benefit of QC3 over QC2.  But @stuart0001 does have a point with charging with the screen on.", "time": "23rd April 2016, 11:36 PM", "postID": "post66515850", "replies": [{"text": "I look forward to your findings. \n\nAfter further experimentation, QC 2.0 will hit 1A with screen on when below 32deg. So I've found when screen on:\n\nQC 2.0 \n<32 = 1A\n32-35 = 0.6A\n35-42 = 0.3A\n>42 =? (I haven't tested yet) \n\nQC 3.0 maintains 1A, certainly upto 42. Again, I've not tested higher than that. \n\nThis is all with the cable that came with the phone.", "time": "24th April 2016, 12:41 AM", "postID": "post66516372", "replies": [{"text": "when talking about QC 2/3 you should also mention volt or just combine volts and amps to watts\n\njust talking about amps is like saying A: has 2 inches Ampere and B: has 3 inches Ampere", "time": "24th April 2016, 09:02 AM", "postID": "post66520229", "replies": [{"text": "In theory yes. But ultimately, your real world charge speed will be reflected by the amperage reported on the phone, which is where my stats come from. \n\nFor the record, QC 3 has been 6-6.5 V & QC 2.0 9V (measured with a USB meter)\n\nEdit: Having a think I'm still confused. I'm using 3C toolbox to report mA but as you say it's only part of the equation. However, in relative terms when looking to compare charging speeds, it does seem a reasonable way to report & does tally with %/hr rates. In other words, if it's reporting half mA it's also % increasing half the speed. \n\nSo what would knowing voltage help in terms of knowing your charge speed. The 3C reporting seems sufficient for that alone I think. \n\nMaybe for this exercise it'll be better to report %/hr, which is probably where the 3C stats come from anyway. \n\nUltimately, QC 3.0 is quicker charging at higher temps, even when screen off I'm finding too. Below 32deg, they are the same rate.", "time": "24th April 2016, 09:27 AM", "postID": "post66520497", "replies": []}]}]}]}, {"text": "Type C can not be beat.  This thing charges insanely fast.  I can charge it for 30 minutes and leave for class knowing it will last me until I get back home.  Plus with the spare battery you can literally abuse and power use to your hearts content", "time": "26th April 2016, 05:46 AM", "postID": "post66549516", "replies": [{"text": "This is my first phone with quick charging and my first with a replaceable battery  since the GS3 (waiting on the free battery and cradle to come in the mail) and I couldn't agree more. I'm actually going to have to try to run out of battery before the end of my day now.", "time": "1st May 2016, 04:06 PM", "postID": "post66640953", "replies": []}]}, {"text": "I have done some testing on charging speeds. Screen off. \n\nQC 3.0 - Tronsmart 18W up to 12V\n3-80% - 00:50:33\n3-100% - 01:23:06\n80-100% - 00:32:33\nLast 20% as much as first 55%\n\n2-80% -  00:44:44\n2-100% -  01:17:22\n80-100% -  00:32:38\nLast 20% as much as first 65%\n------------------------------------------------------------\nLG Stock - Fast-Charger\n0-80% -  00:45:01\n0-100% - 01:18:57\nLast 20% - 00:33:56\nLast 20% as long as first 65%\n\n2-80% - 00:46:12\n2-100% - 01:20:08\nLast 20% - 0:33:56\nLast 20% as much as first 63%", "time": "27th April 2016, 10:39 PM", "postID": "post66579035", "replies": []}, {"text": "Instead of charging over night, I can just plug in the phone when my alarm rings, once I'm ready to leave, it is charged. Awesome!", "time": "2nd May 2016, 04:49 PM", "postID": "post66660481", "replies": []}, {"text": "I've updated my thread with lots of QC3.0 data, also comparing it with QC2.0 data.\n\nhttp://forum.xda-developers.com/show...18&postcount=7", "time": "2nd May 2016, 09:03 PM", "postID": "post66664553", "replies": []}, {"text": "Fast charge, great battery life that can always be replaced", "time": "3rd May 2016, 10:45 AM", "postID": "post66672198", "replies": []}, {"text": "the G4 was better", "time": "7th May 2016, 09:19 AM", "postID": "post66736024", "replies": [{"text": "I don't see how that's possible. Please elaborate.", "time": "8th May 2016, 07:59 PM", "postID": "post66758037", "replies": []}]}, {"text": "Fastest charging speed of any phone I've ever used.", "time": "9th May 2016, 03:16 AM", "postID": "post66762049", "replies": []}, {"text": "Wel, on Lineage you need 10 hours to full charge", "time": "16th September 2017, 09:40 AM", "postID": "post73811826", "replies": []}]}, {"title": "Screen on time", "rating": 3.5, "links": ["https://forum.xda-developers.com/lg-g5/review/screen-time-t3361322", "https://forum.xda-developers.com/lg-g5/review/screen-time-t3361322/page2", "https://forum.xda-developers.com/lg-g5/review/screen-time-t3361322/page3", "https://forum.xda-developers.com/lg-g5/review/screen-time-t3361322/page14"], "threads": [{"text": "I have the H860N (dual sim) on build v10c. Take note I am only using SIM1 as the second slot is used by my 64GB microSD (it's a hybrid slot).\n1st test\n\nUsage:\nWiFi only\n2G Mobile network only\nA lot of YouTube watching, some photo shooting, social networking in Facebook/Twitter/Instagram, some casual gaming (One More Dash, Stacks, Piano Tiles 2, etc.) and a lot of browsing as well.\n\n\n\n2nd test\n\nUsage:\nWiFi and Data (4G) - 50/50\nA lot of social networking during data usage. A bit of listening to music, photo shooting, web browsing and YouTube streaming during WiFi usage. Some casual games as well.\nPower saver triggered on 15%\n\n\n\nMy rating: 4/5 - Need bigger battery module", "time": "27th April 2016, 03:09 AM", "postID": "post66565023", "replies": []}, {"text": "Can you go into detail?", "time": "30th April 2016, 04:45 AM", "postID": "post66613530", "replies": []}, {"text": "1 week with g5 ordered from Clove...unlocked, stock rooted, with Xposedv83 \n\r\nVery little modification, using greenify and amplify\r\nBeen on 4g almost the entire day", "time": "3rd May 2016, 10:39 AM", "postID": "post66672127", "replies": [{"text": "how did you root the lg g5 i thought there was no root yet", "time": "6th May 2016, 11:31 PM", "postID": "post66731339", "replies": [{"text": "There is LG's official bootloader unlock program for the unbranded EU H850.once u do that(only for h850) there is TWRP built for it too", "time": "7th May 2016, 12:06 AM", "postID": "post66731657", "replies": []}]}]}, {"text": "Don't really know how you guys can get that kind of a screen on times..??\nI barely get 1,5h sot..", "time": "6th May 2016, 10:34 PM", "postID": "post66730787", "replies": []}, {"text": "Bit over a week with the phone.\r\nH850 stock rooted v10c. Xposed v83\r\nUsed greenify and amplify;disabled and removed some stock apps, AOD and daydream off.\r\nLet phone top up for 1hr after reaching 100%full charge\r\nBest battery life I've had on a phone with no kernel manipulation yet...\r\nI reached 7hrs SOT with like 5hrs YouTube and 20hrs on battery...but this was the 2nd day and I thought it was a fluke.this last cycle was post worthy these pictures were taken evening of 5/4 after almost 36hrs on battery. I've gamed,browsed,used camera,streamed HD video and been on mobile data for most of it...that's balanced but heavy use.\n\r\nMy only gripe is that Wi-Fi does seem to drain me more than mobile data(no tests yet to back that up) still coming from g3 this is incredible! \n\r\nWho cares if the s7 gets better battery life this has a smaller battery that does better than other's in the g-series, and it's replaceable(unlike comparable devices) giving the device more longevity. \r\nThis battery life reminds me of my g2.", "time": "7th May 2016, 08:24 AM", "postID": "post66735539", "replies": [{"text": "what apps did you disable/remove i struggle to get 3 hours screen on time and this phone is starting to really annoy me thanks in advance", "time": "9th May 2016, 08:53 AM", "postID": "post66764830", "replies": []}]}, {"text": "Well, compared to the Galaxy S7 i own, the SOT honestly sucks. I barely get more then 3,5 hours with Medium usage. Removed most of the bloadware, disabled background data usage on most Apps and still i can't see alot improvement.", "time": "9th May 2016, 05:12 PM", "postID": "post66771100", "replies": []}, {"text": "The most I ever got was 6 hours and 30 mins with 19 percent left. No Wi-Fi with LTE on, Bluetooth off and the screen no more than 35%brightness . I used to have the note 4 att version and only got 4.5 with every single bloat app disable. I have cm brower ,cm launcher no facebook just messanger and Google app running. I'm sure you guys won't believe it but I really get amazing battery life with this phone. I'm at 41 % with 3 hours and 30 mins and 11 hours 20 mins since I lasted plug it. I have the t mobile version and here are the apps I have disable.", "time": "9th May 2016, 09:49 PM", "postID": "post66775279", "replies": []}, {"text": "Here are some screenshots", "time": "9th May 2016, 09:55 PM", "postID": "post66775352", "replies": []}, {"text": "I really can't complaint with a mix of Wifi and LTE. It's not as insane as my S7 exynos but it last me through the day and I have the spare battery. I have not charged my phone in a couple of days now. Also standby time is the best I have ever seen on a smartphone.", "time": "12th May 2016, 09:17 PM", "postID": "post66824015", "replies": []}, {"text": "WTH, the max SOT i manage to get is like 2hrs!\n\nCurrently battery at 32% after taking off charge 11 hrs ago.. SOT is 1hr 11m\n\nAndroid OS is showing as using 19% battery.\n\nI think it's time for a factory reset...", "time": "15th May 2016, 10:21 PM", "postID": "post66868507", "replies": []}, {"text": "I think that will be my next purchase", "time": "16th May 2016, 10:04 PM", "postID": "post66884023", "replies": []}, {"text": "Sorry wrong thread,  post removed.", "time": "19th May 2016, 08:14 AM", "postID": "post66921292", "replies": []}, {"text": "Some say that its 6 hours, some say its 3. Thats a huge gap and i dont know who to believe, but 3 hours seems more legit considering that battery size.", "time": "22nd June 2016, 01:54 PM", "postID": "post67435183", "replies": []}, {"text": "Yeah i don't know how they're getting 5-6HRs SOT that's just crazy! Considering the Battery Capacity only 2800mah", "time": "22nd June 2016, 04:26 PM", "postID": "post67437233", "replies": [{"text": "Then what'll you call me?????????\nMore than 7 hours is definitely possible.", "time": "22nd June 2016, 07:47 PM", "postID": "post67439951", "replies": [{"text": "That's just crazy!", "time": "22nd June 2016, 07:51 PM", "postID": "post67440016", "replies": []}]}]}, {"text": "I usually get about 4.5 hours SOT.", "time": "24th June 2016, 04:22 AM", "postID": "post67459157", "replies": []}, {"text": "I think the SOT is pretty bad...", "time": "25th June 2016, 03:55 AM", "postID": "post67472503", "replies": [{"text": "Ehhhh bad? U have a carrier branded phone? They are the ones to blame.\r\nI posted screenshots on another forum of just under 50hrs on a single charge with just under 6hrs sot... With heavy use including GPS,camera, and many other battery consumptive behaviors...\n\r\nThese screenshots are from last night and show 43.5hrs on single charge with a respectable 7hr 30min SOT!!! That's camera use, YouTube, heavy browsing, and even an hour of gaming.\r\nEither root and debloat have added hours to my battery life, or I just got an exceptional unit. But either way it makes me laugh to read these reviews for other phones like the One Plus 3, that are using the same chipset, a 1080p screen,6gb ddr4 RAM, and a built in 3000mah battery; and yet the Android Authority review reported 3.5 hrs SOT with single digits left on your battery by the end of the day.\r\nSame chipset, better specs in two areas, the biggest battery offender would be the screen and tho it is bigger it's lower resolution and has 440ppi vs our 554ppi as such it should use less power.\r\nTo me that points to poor software optimization, say what u want about build quality or the way the g5 was marketed, but u can't argue that LG has excelled with an amazing and beautiful UI and excellent software/firmware optimization on the g5!\r\nI can't believe how little development there is for such a good phone as the g5! Tho I will say that what is available to flash more than satisfies my day to day needs, and with UX5.0 I don't even have much of a desire to leave stock(with the exception of a Dirty Unicorns or XenonHD build for the H850) as the UI is quite pleasant on the eyes and I'm loathe to give up camera quality for an AOSP based ROM....\r\nEhhhh sorry for the rant...\r\nHere are the screenshots I came here to share", "time": "3rd July 2016, 10:53 PM", "postID": "post67591819", "replies": [{"text": "Oh wow! Those are really impressive numbers. My phone isn't carrier - branded. It's a plain H860. \n\nI agree on the simplistic beauty of the user interface. The only reason why I still want to root is Xposed and to be able to change the font system - wide, without the need to install launcher. I do have a few LG apps installed, but I rarely use them and they don't show up on the list of battery leeches either. \n\nI'm very happy with the device, but I hope a root is to be released soon...", "time": "3rd July 2016, 11:13 PM", "postID": "post67591999", "replies": [{"text": "Dual or single sim?\r\nHate to be negative, but if recent LG history has taught us anything, it won't happen... Hopefully you'll at least get root if not TWRP.\r\nI do believe there is NO such thing as an \"unlockable\" bootloader... But it might not happen while u own the phone\r\nIf I were u, I'd unload that H860 on swappa while the resale value is still within a reasonable range to what u paid... Then I'd buy an H850 from Clove Electronics in the UK b4 prices go up for international orders due to lack of standing trade agreements with other countries.\n\r\nBut if root is a necessity, I'd urge u to sell your phone and buy a variant with an existing root method; and out of the two with root, the only one that makes sense to buy is the unbranded EU Open variant, the H850.\r\nAnd only the H850 EU Open variant; NOT H850k or H850TR only the H850 EU Open, not the Vodafone or EE branded H850!\r\nONLY THE UNBRANDED EU OPEN H850!\r\n... SORRY FOR YELLING\r\nBut do make sure that the H850 supports your carriers LTE bands b4 buying; and if the H850 doesn't then the H830(T-Mobile) definitely won't either... In which case u can either switch mobile providers, or keep your current device and pray to the root gods, fervently, for a solution", "time": "4th July 2016, 12:19 AM", "postID": "post67592543", "replies": [{"text": "Dual sim... This is my first ever LG phone, and I had no idea that dial sim phones do not get proper support... I had an HTC and a couple of Samsung phones before, and didn't have to worry at all about root, as it was always available. Despite the smaller screen, poorer battery life and a lesser attractive exterior, I chose the G5 over the S7 Edge, solely for the dual camera setup it boasts... \n\nLooks like selling the phone is the best solution right now...", "time": "4th July 2016, 12:35 AM", "postID": "post67592680", "replies": []}]}]}, {"text": "I have stock non rooted EU H850 non branded with latest 10c firmware and I'm not happy at all about battery life. It lasts under 20 hours with barely 2 hours SOT. I'm not even using the phone much. Based on the battery stats the four most consuming apps are Google services 20%, screen 15%, phone idle 13% and Spotify 13%. I have disabled bloat apps but it doesn't seem to help much.  Any tips what can be done?", "time": "4th July 2016, 09:55 AM", "postID": "post67596999", "replies": [{"text": "Your best bet is to root the device. Install the stock debloated FluenceHD ROM and/or patch located in the development section for our device. Install xposed and get greenify, and amplify... Also install naptime(tho that only requires root) all these apps can be found in playstore and will save u an amazing amount of battery life.", "time": "5th July 2016, 06:51 AM", "postID": "post67609475", "replies": []}]}]}]}, {"text": "Here are some apps which are blacklisted\r\nHope I can make it last longer. I appreciate any help.", "time": "19th July 2017, 07:23 PM", "postID": "post73092329", "replies": []}, {"text": "3 hours of sot only no matter the use is intense or light", "time": "14th August 2017, 07:59 PM", "postID": "post73402142", "replies": []}, {"text": "I think that's cool score.", "time": "28th October 2017, 11:50 PM", "postID": "post74330716", "replies": []}]}, {"title": "Standby drain", "rating": 4.0, "links": ["https://forum.xda-developers.com/lg-g5/review/standby-drain-t3361323", "https://forum.xda-developers.com/lg-g5/review/standby-drain-t3361323/page2", "https://forum.xda-developers.com/lg-g5/review/standby-drain-t3361323/page3", "https://forum.xda-developers.com/lg-g5/review/standby-drain-t3361323/page16"], "threads": [{"text": "If I lose signal for a long period of time I will take a battery hit.  Otherwise, no problem.", "time": "19th April 2016, 05:47 PM", "postID": "post66445862", "replies": []}, {"text": "Sometimes, over the course of an hr, it won't even lose a percent! Amazing, even compared to the Note 3, which was awesome battery-wise!", "time": "19th April 2016, 10:14 PM", "postID": "post66450225", "replies": [{"text": "my H860's standby drain is abysmal.. It drops 15+% overnight (about 6-7hrs). How are you getting such a good standby time? I disabled Facebook (which was installed as a system app for some reason) but even then the best I got was 9% overnight..", "time": "24th April 2016, 04:32 PM", "postID": "post66525820", "replies": [{"text": "No idea!!! I'll keep an eye on drain again...but I gotta say, I found it to be great! I'm almost always on Wifi, not sure if that has anything to do with it.", "time": "25th April 2016, 03:19 AM", "postID": "post66532879", "replies": []}]}]}, {"text": "Same problem here. Battery drain while phone is idle is absolutely horrid. Can't for the life of me figure it out. Under settings in battery usage, the only 2 things I show with significant battery drain is screen on and phone idle.", "time": "24th April 2016, 08:11 PM", "postID": "post66528948", "replies": []}, {"text": "Bad signal (1 bar or less) can severely affect idle battery drain. The always on display does take some battery. Try turning it off to see if it makes a difference.", "time": "24th April 2016, 09:35 PM", "postID": "post66530018", "replies": []}, {"text": "Yeah where we live is great signaland one of the first things I did was turn off the always on feature. I still have the drain.", "time": "25th April 2016, 02:23 AM", "postID": "post66532516", "replies": []}, {"text": "I too have the worst battery life I've ever had on a brand new device. I don't know what else to do  but sell the phone.", "time": "26th April 2016, 01:24 AM", "postID": "post66547709", "replies": []}, {"text": "I sure wish we could figure this out", "time": "26th April 2016, 01:49 AM", "postID": "post66547869", "replies": [{"text": "Was doing some digging on this exact issue. I was getting a ridiculous battery drain from phone idle, which I didn't have for the first week of owning the phone. For the life of me I could not figure out what I changed, but I think I may have found a solution. I have the AT&T H820 and it turns out other devices of the AT&T variant (galaxy s6) had terrible battery drain with Enhanced LTE selected. I have just disabled it and will report back in a day or two to report the results.", "time": "26th April 2016, 04:45 PM", "postID": "post66557443", "replies": []}]}, {"text": "I have TMobile varient. Yesterday, I tried selecting 'Restrict background data' option (Settings > Mobile Data > Top right menu and select 'restrict background data' checkbox). So far its been better than yesterday.", "time": "26th April 2016, 06:17 PM", "postID": "post66559024", "replies": []}, {"text": "I use Shutapp to end running apps and turn the phone over so the light sensor is covered and the always on display shuts off.  Battery seems on par with my G3 which is the same size battery.", "time": "27th April 2016, 02:27 PM", "postID": "post66571837", "replies": []}, {"text": "I have no stand by drain on my AT&T version. I have aod off and this is on my nightstand. So Wi-Fi enabled. Location and Bluetooth off. I charge to 100% then restart the phone and then unplug for the rest of the night. I will wake up anywhere from 6 to 10 hours later. Weekdays and weekends vary. But I will always wake up at either 99% or 100%  my stand by works flawlessly. Just my process.", "time": "27th April 2016, 05:13 PM", "postID": "post66574351", "replies": []}, {"text": "my colleague has this and his battery drains while on stand by. not the best!", "time": "7th May 2016, 08:50 AM", "postID": "post66735754", "replies": []}, {"text": "In the second and third days that I had this phone it seemed to lose 1 % per hour which I feel is pretty good considering I had always listening for \"ok google\" and the fingerprint scanner on. I have no sim in the device yet. The first night it went from 80 to 2% on standby though that could have been just because it was the first night. I don't have always on display on.", "time": "8th May 2016, 11:04 PM", "postID": "post66760218", "replies": []}, {"text": "I have an international version (H860) on AT&T network for about a week now. AOD is off, Wi-Fi is on, GPS is on Battery Saving mode. Every night, the drain is about 20%. Battery usage shows Android OS and Phone Idle being the top 2 uses. I reset the phone once already. The phone is set up the same as my G4, same set of apps. The G4 has only about 1% drain overnight. Can this be a defective unit?", "time": "16th June 2016, 02:57 PM", "postID": "post67345440", "replies": [{"text": "First try to put it on airplane mode overnight. Check if the drain stops.", "time": "17th June 2016, 10:36 AM", "postID": "post67358039", "replies": []}]}, {"text": "I have a strange problem, if I unlock the phone from charger then my phone doesn' t go in deep sleep anymore. If I reboot then deep sleep works again until I plug to my charger", "time": "17th June 2016, 10:38 PM", "postID": "post67367391", "replies": [{"text": "Same here. Used to happen sometimes to my g4 as well. A friend's Samsung s7 has the same problem .\n\nΣτάλθηκε από το LG-H850 μου χρησιμοποιώντας Tapatalk", "time": "20th June 2016, 04:57 PM", "postID": "post67406544", "replies": [{"text": "I found that Waze is the problem", "time": "20th June 2016, 11:33 PM", "postID": "post67411758", "replies": []}]}]}, {"text": "My battery is great while on standby. By the time I'm in bed, the battery would be like 40% so I choose not to charge. When I wake up, my battery is around 38% =). I also have a backup battery (yay promo!) so I keep that with me at all times, just in case.", "time": "18th June 2016, 05:32 AM", "postID": "post67370535", "replies": []}, {"text": "My battery life was excellent on my first full charge.  48 hour total and 4 hours of screen on time.  By my third charge I was down to 18 hours and barely getting 4 hours of battery.  Very disappointing.", "time": "18th June 2016, 05:39 AM", "postID": "post67370588", "replies": [{"text": "It's not the battery, it's apps.", "time": "18th June 2016, 12:16 PM", "postID": "post67374235", "replies": [{"text": "I turned off the hd voice / advanced calling as an earlier poster suggested.  Charged to 100%. In 8.5 idle hours it used 1%.", "time": "18th June 2016, 07:04 PM", "postID": "post67379356", "replies": [{"text": "By disabling Advanced calling, I got 4 hours and 40 minutes of screen time on almost 35 hours of battery.  Nothing else was changed or disabled.\n\nI'm going to enable it today and measure what I get.", "time": "19th June 2016, 09:06 PM", "postID": "post67394884", "replies": []}]}]}]}, {"text": "Hi\nI have the same issue with my LG G5, i'm loosing % way too fast and seems that Android OS and Phone Idle are eating most of the battery.\nHere is a capture -> https://drive.google.com/open?id=0B0...WlFQWIzeWRFRFE", "time": "8th August 2017, 08:55 AM", "postID": "post73325952", "replies": []}, {"text": "Hey guys.. try this for battery.. noticed this feature was on, on my phone. turned off and battery improved..\n\r\nGo to settings, display, more. turn of screen saver..\n\r\nJust leave alwayson on with clock and that should improve your battery.. seems screen saver drains the battery", "time": "10th August 2017, 02:54 AM", "postID": "post73347131", "replies": []}, {"text": "Don't forget to turn off background location scanning. That's a battery killer and Google LOVES to turn it on discretely, especially when you use Google Maps. \n\r\nWhat happens is that even with your location and wifi turned off, Google turns the wifi on and runs it in the background. It then uses the wifi to get a general location of the device. \n\r\nIt's shady as all hell and Google does NOT well advertise that they do this. \n\r\nIt's tracking you and it's using your battery to do it. \n\r\nTo turn this off go to Settings -> Location -> 3 dots in the upper right hand corner -> Scanning -> switch wifi and bluetooth to OFF", "time": "10th August 2017, 02:14 PM", "postID": "post73352250", "replies": []}, {"text": "I had massive and unusual battery drain issues like described in this thread. After much reading and detective work, I’ll describe my situation and what worked for me.\n    Bought unlocked LG G5 RS988 to replace my LG G4\n    The phone arrived with Android 6 installed. Immediately upgraded to the latest Android 7 security patch\n    Transferred my apps and settings over from my LG G4 to the G5 using LG Backup to wirelessly transfer between the 2 phones\n    After G5 was set up the battery life (in Doze while not using the phone) was great. It might drop 2 – 3% overnight on Wi-Fi\n    After a few days the battery would drop between 5-12% per hour while in doze. There were no rogue apps running in the background. The main culprit was Android OS and Phone Idle…\n    Rooted the phone and tried every battery saving setting I could find and used Greenify and CPU throttling as well. This resulted in no improvement.\n    I had a second RS988 I could test (long story). Followed the same steps as listed in 1-4 but again after a day or so the battery life would crap out.\n    Took the rooted phone and downgraded to Android 6. Reinstalled each app from the Google Play Store (did not use the LG backup as in #3 above). Made recommended battery settings changes in the Android OS and installed Greenify. Did not make any other changes (e.g. CPU throttling)\n    Now after 2 weeks overnight my battery drops between 1 – 3 % per night. This is the performance I expected.\n\nIn a nutshell – not using a LG backup file and installing everything fresh solved my battery issues.\n\nI’m going to wait another week and then reinstall Android 7 to see if that makes a difference. I will update this post with my results.\n\nUpdate\nAfter a few weeks on Marshmallow software version RS98811d and getting good / expected battery life, I decided to upgrade to RS98821d (Android 7 with latest security update).  The battery drain I originally described returned even after a complete wipe and reinstall of all my apps.   Kept the configuration for about a week hoping for an improvement in battery life but there was none.\n\nWent back to RS98811d  and have no plans on upgrading to |Android 7 again with this phone.  The smart lock suggestion in the post immediately below did nothing for me.", "time": "16th August 2017, 12:58 AM", "postID": "post73416402", "replies": []}, {"text": "I have the LG G5 H860 with android 7.0\nHad the same issue of battery drain\n\nWhat fixed it for me was that i disabled google smart lock\n\nGo to settings ---> fingerprint & security ------> trusted agent\nThen disable smart lock\n\nI got this info from LG G4 thread", "time": "22nd August 2017, 06:02 AM", "postID": "post73491196", "replies": [{"text": "It works for my G5,after truying all other disables mention in here this is the only solution that works for battery drain...", "time": "22nd August 2017, 10:04 AM", "postID": "post73493130", "replies": []}]}, {"text": "Hi there \nsomebody please tell what it standby drain LG G5 7.0 Nougat ? \ni am on MM having no problem with battery life but i want to upgrade it\nplease reply", "time": "24th August 2017, 10:14 AM", "postID": "post73520879", "replies": []}, {"text": "This turned out GREAT with three things: 1, installed NetGuard to block apps from sending data, 2, ignored battery optimizations only for required apps like email, and finally 3, enabled battery saver and ignored apps that I require.", "time": "8th February 2018, 08:04 PM", "postID": "post75494772", "replies": []}, {"text": "I use WakeBlock with my rooted RS988 and in 8 hours I get about 1% battery drain.", "time": "9th February 2018, 11:48 AM", "postID": "post75501198", "replies": []}]}, {"title": "Heavy use endurance", "rating": 3.5, "links": ["https://forum.xda-developers.com/lg-g5/review/heavy-endurance-t3361324"], "threads": [{"text": "5 HR SoT, LTE, Loc. Off, 40-70% Brightness, Music all day.\n\nThis thing performs really well compared to last-gens. (Note 4)", "time": "30th May 2016, 02:45 PM", "postID": "post67092738", "replies": [{"text": "Yeah but the battery get's really hot when charging while using . Don't want a bomb going of on my eear", "time": "7th May 2017, 02:25 AM", "postID": "post72193709", "replies": [{"text": "ive noticed this too\n\r\nbut at least it throttles properly.  it might get hot and charge slower, and work slower, but it wont cook itself to a bootloop like the g4 would.", "time": "8th August 2017, 02:27 PM", "postID": "post73329100", "replies": []}]}]}, {"text": "Played NFS No Limits for 6 and a half hours straight, wasn't very hot. Great battery life imho, sleeps like a baby, i lose 1-2% over night. Mine is h860, 6.0.1 v10a. Should i upgrade it to Android 7 because I've read that many people have a huge battery drain on Nougat?", "time": "29th July 2017, 07:18 AM", "postID": "post73212543", "replies": [{"text": "Did you root and unlocked your h860?", "time": "12th August 2017, 06:17 AM", "postID": "post73371684", "replies": [{"text": "Nope, h860 can't be rooted because the bootloader is locked, unlike h850", "time": "12th August 2017, 08:29 AM", "postID": "post73372550", "replies": []}]}]}, {"text": "3 hours of Clash of Clans and the battery goes from 100 to dead.. Any other activity only 6 hours.. Nougat 7.0 Fulmics rom  H830", "time": "14th August 2017, 07:54 PM", "postID": "post73402093", "replies": []}]}, {"title": "Light use endurance", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-g5/review/light-endurance-t3361325"], "threads": [{"text": "With light use (web browsing, texting, Gmail), my G5 lasts longer than a full day.", "time": "9th May 2016, 03:18 AM", "postID": "post66762069", "replies": []}, {"text": "Sitting on my bedside overnight, it loses 10-15% battery life, assuming I don't sleep through the alarm...", "time": "8th July 2016, 12:08 AM", "postID": "post67649260", "replies": [{"text": "Yep, same here.\n\nI get about 3 hours 3 min Screen On Time on average, making about 3.5 hours every now and then. Idk, it's not bad with the removable battery, it works for me, but I feel like battery life should have improved since the G2 even", "time": "6th August 2016, 07:27 PM", "postID": "post68071768", "replies": []}]}, {"text": "Today i got yelled on a lot, and i'm still at 30% (almost bedtime, 10:30 pm here)\nSad but true!", "time": "2nd August 2016, 09:29 PM", "postID": "post68016454", "replies": []}, {"text": "If you're just browsing the web or checking emails the battery can easily last a day.", "time": "4th April 2017, 10:00 PM", "postID": "post71728633", "replies": []}, {"text": "I have had the phone for 4 months now and the battery life has indeed gotten worst. I get 3 hours screen on time max and have to charge it everyday. This is on light use.", "time": "5th April 2017, 08:53 PM", "postID": "post71741915", "replies": []}]}, {"title": "\"Look\" of the device (aesthetics)", "rating": 4.0, "links": ["https://forum.xda-developers.com/lg-g5/review/look-device-aesthetics-t3361326", "https://forum.xda-developers.com/lg-g5/review/look-device-aesthetics-t3361326/page2"], "threads": [{"text": "Not bad concept at all", "time": "20th April 2016, 09:05 AM", "postID": "post66456356", "replies": []}, {"text": "Kind of awkward looking, but have to case it up anyway", "time": "3rd May 2016, 10:46 AM", "postID": "post66672211", "replies": []}, {"text": "not the best but it's been a while I haven't wanted a case to change the look of it.", "time": "4th May 2016, 04:22 PM", "postID": "post66693134", "replies": []}, {"text": "What's driving me nuts about the hate of this device is how many think the G5 sucks solely based on looks. Has the mobile tech sphere really become this superficial and shallow? It's a phone (not a purse) that has its form follow its function. I'll take practicality over useless 'good looks' any day.", "time": "5th May 2016, 12:45 PM", "postID": "post66706345", "replies": [{"text": "Yeah. It is unbelievable how people choose looking over effectiveness and functionality. LOL If no one likes the G5 im open to receive all your phones. Just send me a message and i will give the address hahaha. And my phone will arrive soon, but by seeing the reviews on youtube it seems to me like a very interesting design though.  Not too sophisticated but also not too Simplistic. It looks smooth.", "time": "6th May 2016, 03:53 AM", "postID": "post66717537", "replies": []}]}, {"text": "If you slap a bulky Otterbox case on your phone, why would \"looks\" ever really matter? lol with that said, I like the look of the G5. The metallic body isn't HTC awesome, but it's far from ugly.", "time": "9th May 2016, 03:47 AM", "postID": "post66762308", "replies": []}, {"text": "I think it looks great/fine. I have a clear case (Poetic Affinity) to show off the phone a bit more, and a kickstand non-clear case (Spigen Thin Armor) for when I don't care as much. Honestly I'm starting to prefer the Poetic just because I like looking at the phone itself.\n\nThat said, I've found that I stop caring about looks about a week after I get it. Maybe that's just me.", "time": "11th May 2016, 03:42 PM", "postID": "post66803051", "replies": []}, {"text": "I actually really like the lok of the g5.. I do always run a case though. I have my silver g5 in a spigen neo hybrid case I really dig the appearance with the case even more then the phone alone.", "time": "21st May 2016, 02:03 AM", "postID": "post66950668", "replies": []}, {"text": "Okay the phone is understated, but its ergonomically great. It doesn't scream for attention like S7 nor is it super thin and slippery like iPhone. Since i don't like using cases, this phone is perfect for me. \nThough I have to admit, when you buy a premium segment phone, looks do matter. And LG tbh does disappoint there. Its just an average looking phone. Nothing to go ga-ga over , but nothing to hate nonetheless. Its simply a boring looking phone.", "time": "22nd May 2016, 09:21 AM", "postID": "post66968835", "replies": []}, {"text": "It looks good ;D\r\nGonna be my next phone after the Galaxy S6", "time": "22nd May 2016, 06:30 PM", "postID": "post66975504", "replies": []}, {"text": "Dunno...it's like a renewed copy of the Lg G2...is not that bad...i like it.", "time": "23rd May 2016, 01:48 PM", "postID": "post66987115", "replies": []}, {"text": "Well you can't deny it's a huge improvement from the G4 and its horribly shaped back. I do wish the whole front panel was glass though. After the 6P I think it's the best looking droid so all in all, can't complain.", "time": "29th May 2016, 06:37 PM", "postID": "post67081577", "replies": []}, {"text": "I don't see why people think its ugly.....to each his own.", "time": "16th August 2016, 01:06 AM", "postID": "post68206021", "replies": []}, {"text": "I think it's not that pretty... The back is ugly with the camera bump (camera bumps should just not happen, put bigger battery to fill the gap). I hate the curved glass. I hate any curved glass on a phone, it makes it impossible to put a simple tempered glass protector which I think is a must.\n\nBut.... the phone is great. Not my choice for design but it's a solid performer! From performance to sound and camera. Everything is rocking solid.  I like it a lot!", "time": "16th August 2016, 12:46 PM", "postID": "post68212063", "replies": []}]}, {"title": "Quality feel (use of materials)", "rating": 3.5, "links": ["https://forum.xda-developers.com/lg-g5/review/quality-feel-materials-t3361327"], "threads": [{"text": "Doesn't feel bad in anyway , but i got disappointed from the metal feeling, not even close to Htc or Sony Z1-3 series its just like plastic , i needed to google it to find out that is really metal as they said, in quality i got a problem with my up microphone that got inside on the right side , i could get it back using my thumb and nail but still right side is a bit more inside and seems easy to get in again. So i am giving it 3 stars in quality both feeling and i would give it 4 if i hadnt the speaker small issue , i was expecting more than that but its still good phone!", "time": "27th August 2016, 01:08 AM", "postID": "post68386780", "replies": []}, {"text": "9 months in and the lg use of subpar components comes through. Bootloops as soon as it gets hot....and it will get hot pretty quick if in a pocket and outside. Works great ...probably in a fridge now. Had to deal with GPS issues too...worse GPS signal phone ever. Quality has gone down the drain with lg since the g3. Not taking a chance on the g6.\nSo sad...really wanted to love this phone. But come on not even a year.....!!!!\nI thought give them a chance since they did replace the wife's g4 but now I regret it. Can't wait for the wife's g5 to self destroy itself just like mine.", "time": "13th August 2017, 09:28 AM", "postID": "post73384286", "replies": []}, {"text": "Im not sure why LG phones get so hot compared to other manufacturers, but other than that, no big issues.", "time": "14th August 2017, 01:14 PM", "postID": "post73397600", "replies": []}]}, {"title": "Ergonomics (in-hand feel)", "rating": 4.0, "links": ["https://forum.xda-developers.com/lg-g5/review/ergonomics-hand-feel-t3361328", "https://forum.xda-developers.com/lg-g5/review/ergonomics-hand-feel-t3361328/page2"], "threads": [{"text": "I sometimes hit the volume buttons when I don't mean to.  Probably because I am used to having them on the back instead of the side.", "time": "19th April 2016, 05:49 PM", "postID": "post66445892", "replies": [{"text": "I think the volume on the side is better than the back one for the following reason. When you are in sitting in a table studying and hearing music, if you want to increase or decrease the volume, you dont have to pick up the phone just because the buttons are in the back. Also, when you are driving if you are using a gps, it is more useful to have them on the side if you are constantly increasing and decreasing the volume. (Just an opinion)", "time": "6th May 2016, 03:56 AM", "postID": "post66717569", "replies": [{"text": "I like buttons on back way better.  You can always adjust volume on screen for the rare times you have it flat on a table, and to be honest you really can't use side buttons 1 handed without picking it up, or bracing it against something, or covering screen with hand anyways.", "time": "7th May 2016, 01:31 AM", "postID": "post66732362", "replies": [{"text": "There you go lol. That's why there are a wide variety of colors. (Figurativerly speaking though) This one just happened to be black instead of blue (Again, figuratively speaking). But you can adjust the volume with one hand without the need of the other or picking up the device. Or am i just happen to be so skilled to do it? hahaha", "time": "7th May 2016, 01:45 AM", "postID": "post66732475", "replies": []}]}, {"text": "Totally agree. About the only time I'd prefer them on the back is when I'm holding it in both hands. I generally find myself holding it in my right hand only though and it feels great, I can reach almost all of the screen without overreaching even with my bumper on. I prefer the S7 edge in this respect but the G5 still scores highly.", "time": "4th June 2016, 02:35 PM", "postID": "post67167017", "replies": []}]}, {"text": "I'm not fond of the side volume buttons.. But regarding the awful implementation of these keys on the G5, it is totally solved by a case.", "time": "4th June 2016, 10:11 PM", "postID": "post67172579", "replies": []}]}, {"text": "Coupled with a Goospery TPU case...it's the PERFECT size, and protected decently! I'd choose this size phone over my Note 3!!!", "time": "19th April 2016, 10:11 PM", "postID": "post66450186", "replies": []}, {"text": "I would prefer the volume rocker to be on the right hand side of the phone, or even better, at the back. Besides that, it fits like a glove", "time": "8th June 2016, 11:19 AM", "postID": "post67223627", "replies": [{"text": "I agree. While I would have preferred the volume buttons were on the right side, overall, it's a very comfortable phone. Especially considering how wide it is.\n\r\nThe only other issue that I have with it is that I really like and am getting so used to the power button being on the back of the phone. Whenever I have to use my wife's phone, I start fishing in the back of the phone with my finger standing there confused wondering why I can't find the power button on her S6. lol\n\r\n#sprintemployee", "time": "8th June 2016, 07:19 PM", "postID": "post67230077", "replies": []}]}, {"text": "My thoughts on the G5:\n\r\nIt's top heavy because of the light plastic at the bottom.  I feel like its going to fall out of my hand at the top because the weight is not equally distributed.  It feels nice in the hand outside of that.  \n\r\nThe volume rocker is all wrong.  They need to put it back on the rear of the phone.  Coming from the G2 and G3, I hate having the volume rocker on the left side as I keep pressing the power button trying to change the volume.  It also makes taking a screenshot really awkward and hard to do.  At the very least put it on the right side of the phone.    The only benefit I see to having it on the left side of the phone is that you can still use your thumb to take a photo yourself or a group using the rear camera.  However; this could easily be accomplished on the right side of the phone with your index finger.  \n\r\nThe headphone port needs to be moved back to the bottom of phone.  Not a fan of it at the top.  \n\r\nThe slight curve at the top of the phone is a neat touch; however my tempered glass screen protector has not showed up to see how well that will fit.  \n\r\nI haven't noticed the lip where the bottom connects to the phone's body as mentioned in a lot of the reviews.  \n\r\nLg needs to start supplying 6' charging cords.  The G5 cable is even smaller than the G2 - G4's cables.\n\r\nSide note: Stupid Verizon removed the Smart Settings / My Place from their version and I wish they would leave the LG browser and Smartworld app installed.", "time": "11th June 2016, 01:37 AM", "postID": "post67264515", "replies": []}]}, {"title": "OEM skin/software", "rating": 3.5, "links": ["https://forum.xda-developers.com/lg-g5/review/oem-skin-software-t3361329"], "threads": [{"text": "By removing the \"app\" button, LG made an Android phone feel like an iPhone. This problem can easily be remedied in a number of ways, but it may be a hassle for people who don't know what a \"launcher\" is.", "time": "9th May 2016, 03:26 AM", "postID": "post66762143", "replies": []}, {"text": "Obviously prefer stock, but non replaceable battery on Nexus devices does not do the job for me.", "time": "7th July 2016, 01:34 PM", "postID": "post67641868", "replies": [{"text": "Actually I'm not fond of the stock feel. With that in mind, I don't like the white background in the G5 settings.. I wish I could change it.  Maybe some xposed module.\r\nI'm using Nova Launcher Prime.", "time": "7th July 2016, 03:23 PM", "postID": "post67643170", "replies": []}]}, {"text": "@op, You Might really want to add a Poll to OP instead of Rating the Thread. That Stars Rating is intended for completely different purpose.", "time": "7th July 2016, 09:37 PM", "postID": "post67647694", "replies": []}]}, {"title": "Outdoor visibility (max brightness)", "rating": 4.0, "links": ["https://forum.xda-developers.com/lg-g5/review/outdoor-visibility-max-brightness-t3361330", "https://forum.xda-developers.com/lg-g5/review/outdoor-visibility-max-brightness-t3361330/page2", "https://forum.xda-developers.com/lg-g5/review/outdoor-visibility-max-brightness-t3361330/page3", "https://forum.xda-developers.com/lg-g5/review/outdoor-visibility-max-brightness-t3361330/page5"], "threads": [{"text": "With no sunglasses in bright daylight I can see the screen without issue.  Sometimes I have to remove my sunglasses to see the screen well.  No problem with sunglasses in the car so far.", "time": "19th April 2016, 05:51 PM", "postID": "post66445925", "replies": [{"text": "Exactly this.", "time": "19th April 2016, 09:45 PM", "postID": "post66449803", "replies": []}]}, {"text": "I have great outdoor visibility. In direct sunlight I see the display boost up to compensate for the environment.  I was worried about this at first but works great.  As far as sunglasses every phone I have ever had always has issues with visibility.", "time": "19th April 2016, 07:53 PM", "postID": "post66447949", "replies": []}, {"text": "Could do better in bright situations", "time": "20th April 2016, 09:06 AM", "postID": "post66456365", "replies": []}, {"text": "Best there is on an extra sunny day. Very impressive in this category.", "time": "9th May 2016, 03:28 AM", "postID": "post66762161", "replies": []}, {"text": "If your having trouble seeing outdoors make sure you have auto checked and crank the brightness up. For some reason if you don't have auto checked it does not get as bright as it can. Lg might call this a feature I call it a bug", "time": "11th May 2016, 05:04 AM", "postID": "post66795900", "replies": []}, {"text": "For gods sake, i gave up trying to get this stuff to work correctly, the only thing helped was updating to V10c.\nBefore it turned on the Outside thingy, and turned it off again within 2 seconds.", "time": "15th May 2016, 09:40 PM", "postID": "post66868055", "replies": []}, {"text": "I have no problems seeing it on max brightness on a sunny day through my sunglasses. There is another brightness level beyond 100% that kicks in when it's in direct sun, but I believe this is only achievable (for now) by using the \"auto\" brightness", "time": "19th May 2016, 05:48 PM", "postID": "post66928702", "replies": []}, {"text": "I barely can see to be honest, no screen can beat the AMOLED on outdoor visibility.", "time": "19th May 2016, 06:54 PM", "postID": "post66929795", "replies": []}, {"text": "my experience so far:\n\nbought one (gold), in outdoor under direct sunlight, the screen was unreadable, from time to time the \"super brightness\" kicked in for about 1-2 seconds, than gone off again\n\ntought it was defective, got a new one (silver)\n\nsame exact problem\n\nmy friend bought one: same exact problem\n\nasked on twitter, found one owner, same exact problem\n\n\nnow... i really, really hope is a software thing, a bug, something like that, because when this super brightness turns on the screen is gorgeous under direct sunlight, but the problems is that it doesn't kick in when it have to, and even shoot photos with a sunny day is simply impossibile\n\nthe phone was on v10a when i bought it, i'm on V10c now and the problem is still here....", "time": "20th May 2016, 04:09 PM", "postID": "post66943613", "replies": []}, {"text": "Wow! After reading this forum I discovered the super-brightness thing.  This is great!\nWorks fine for me but I can test some more. I just set it to Auto and it kicked under direct light from a torch. \n\nI'm on V10c-EUR-XX", "time": "30th May 2016, 01:46 PM", "postID": "post67092019", "replies": [{"text": "how can activate this for read well with many sun outdoor? thanks", "time": "5th July 2016, 04:41 PM", "postID": "post67615605", "replies": []}]}, {"text": "Even at max brightness it can be hard to see in direct sunlight.", "time": "30th June 2016, 09:29 PM", "postID": "post67551663", "replies": [{"text": "You must set the brightness to \"Auto\" in order for the brightness sunlight boost to kick in.  Setting the brightness to maximum will also block the boost.", "time": "3rd July 2016, 02:38 PM", "postID": "post67585923", "replies": []}]}, {"text": "I live on an island and have been going to the beach a lot lately. Can confirm that screen visibility is very good, even with sunglasses on. My wife's G4 is not that bright though but cannot really find any faults with my G5.", "time": "7th July 2016, 01:29 PM", "postID": "post67641826", "replies": []}, {"text": "Almost useless in sunlight. Other than that its a great display, Super AMOLED is obviously better though.", "time": "10th July 2016, 03:31 PM", "postID": "post67683797", "replies": [{"text": "Set the brightness to \"AUTO\" to get the brightness boost under sunlight.", "time": "11th July 2016, 12:06 PM", "postID": "post67695512", "replies": []}]}, {"text": "Please delete this mistake post.", "time": "11th July 2016, 09:33 PM", "postID": "post67702414", "replies": []}, {"text": "Lg g5 has very poor display indoor and outdoor. My old galaxy s5 is more bright and crisp at 50% brightness as compare to 70% brightness of LG G5. LG G5 maxium brightness is like 60 percent brightness of S5..not good for surfing and reading web pages", "time": "16th July 2016, 08:53 AM", "postID": "post67767245", "replies": []}, {"text": "Hey , brightness of the screen is a problem of smartphone or software ? Sorry for my English", "time": "21st July 2016, 10:25 AM", "postID": "post67840494", "replies": []}, {"text": "This is a phone problem. Someone tell that with Last 10e firmware it's better but not solved. Brightness, specially of alwaus on screen, in sunlight is very bsd. Defect hard!", "time": "21st July 2016, 12:03 PM", "postID": "post67841460", "replies": []}, {"text": "I do not mean that the problem is with the screen in the sun . Only that the maximum brightness is weak . One can hope that future updates will improve anything ?", "time": "21st July 2016, 03:57 PM", "postID": "post67844272", "replies": []}, {"text": "maximum brightness is weak IS A LIE !!! under sunlight is the problem. the phone is like others for brightness", "time": "21st July 2016, 04:56 PM", "postID": "post67844979", "replies": []}, {"text": "Screen G5 is set to maximum brightness , the Xperia next approx. 75 % .", "time": "21st July 2016, 09:10 PM", "postID": "post67848052", "replies": [{"text": "Thermal throbbing my friend, thermal throbbing.\n\r\nG5 is quite battery savy when it comes to brightness. if the phone gets too hot, the MAX brightness is lowered.\r\nAfter a benchmark, it's obvious that the screen brightness will go down on it's own.\n\r\nTry this: Take your  cold G5, put on max brightness with auto and go in harsh sunlight, point the light sensor directly. you will see the screen brightness suddenly jumped higher, but not for long, as the phone gets warm fast in sunlight + with this screen brightness.", "time": "27th July 2016, 08:20 AM", "postID": "post67922311", "replies": []}]}, {"text": "Lg g5 is a phone, not a lamp!!!! Lg g5 has a brightness like a phone. I suggest not find pics but go to a shop and buy the phone you like more. The problem of lg g5 is brightness under sunlight!!!! Under sunlight!!!!", "time": "21st July 2016, 09:28 PM", "postID": "post67848254", "replies": []}, {"text": "i have the G5 also, tried everything, but it seems that the burst not kicks in here .....\n\nI still love this phone, it's fu**** amazing fast and makes lovely pictures .....", "time": "25th July 2016, 05:38 PM", "postID": "post67899169", "replies": []}, {"text": "The screen is good, but has terrible response time. When you scroll, everything gets blurry. Even my old Samsung Galaxy S3 has better response timings.", "time": "17th November 2016, 03:43 PM", "postID": "post69667380", "replies": []}, {"text": "please i don't understand... if i have the phone without root can't have a good visibility of always on screen under sunlight???? have i to root for a good visibility like indoor? can anyone tell me surely? thanks", "time": "17th November 2016, 04:23 PM", "postID": "post69667992", "replies": []}, {"text": "I have a G4 and just got the G5. Prepping the G4 so I can return it to Tmo.\n\r\nThat said, I notice with my Revo glasses (green lenses) that the display goes darker, even with auto off and the same brightness on both. The G4 I can see just as well, but with the G5, its noticeable.", "time": "1st December 2016, 07:36 PM", "postID": "post69884708", "replies": []}, {"text": "please, since with auto brightness in sunlight the always on display is almost off and with max brightness setting display he battery sucks, is there a way for setting always on display at max brightness and auto brightness display automatic, even in service menu?????", "time": "19th December 2016, 05:26 AM", "postID": "post70156387", "replies": []}, {"text": "The screen in the daylight is a little hard to see so raising brightness is the only option... or moving the screen around to an angle where I can kinda see the screen", "time": "8th May 2017, 06:49 PM", "postID": "post72216267", "replies": []}]}, {"title": "Contrast (true blacks)", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-g5/review/contrast-true-blacks-t3361331", "https://forum.xda-developers.com/lg-g5/review/contrast-true-blacks-t3361331/page2"], "threads": [{"text": "will never be as good as oled but surprisingly does a pretty good job", "time": "22nd April 2016, 03:31 PM", "postID": "post66494553", "replies": []}, {"text": "Well it gets the job done could be better", "time": "23rd April 2016, 05:16 PM", "postID": "post66511290", "replies": []}, {"text": "Compared to my G3 its miles better. and compared to that over saturated piece of garbage i would say job well done LG.", "time": "24th April 2016, 01:09 AM", "postID": "post66516592", "replies": []}, {"text": "May not compete with the S7 OLED in terms of black levels but I'm pretty certain the colours are more natural and realistic.", "time": "24th April 2016, 09:36 PM", "postID": "post66530035", "replies": []}, {"text": "The colors are more natural and the contrast (black levels) is just too damn good compared to my G3. Well done LG!", "time": "25th April 2016, 11:48 AM", "postID": "post66537216", "replies": [{"text": "Do you find the G5's screen cooler?\n\r\nI tried a side by side comparison with my G3 at full brightness, the G3 screen has a red tint to the white, while the G5 has a turquoise tint... I wonder which one is actually closer to real colours", "time": "26th April 2016, 12:26 PM", "postID": "post66553557", "replies": [{"text": "Honestly, to my eyes, the screen is on the neutral side. Not cool, not warm. Pretty good imo.", "time": "26th April 2016, 02:52 PM", "postID": "post66555617", "replies": [{"text": "Thanks! I guess colour accuracy is very subjective when it is not on paper \n\r\nI found the white a bit more white at full brightness, but a bit bluish at lower brightness, if only we could correct it! haha, Lg has this strange tendency to make cooler displays since the G4 (the V10 has it too) They go around 7800-8000k instead of the ideal 6700k", "time": "26th April 2016, 04:08 PM", "postID": "post66556846", "replies": []}]}]}]}, {"text": "All I can really say is the black is pretty good for a non amoled screen, if you want to compare it a amoled screen, may be in a few years time, at present nothing comes close to amoled.", "time": "26th April 2016, 03:05 PM", "postID": "post66555842", "replies": []}, {"text": "If i let a brigth image for ~10 minutes the pixels stuck in this image for ~30 minutes and for that time i can see in grey that image.", "time": "9th July 2016, 03:52 PM", "postID": "post67671132", "replies": []}, {"text": "Guys, do you have screen bleed on black with your G5s?", "time": "23rd September 2016, 07:49 PM", "postID": "post68828913", "replies": [{"text": "I had that and got it exchanged", "time": "24th September 2016, 12:13 AM", "postID": "post68831616", "replies": []}]}]}, {"title": "Color saturation & accuracy", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-g5/review/color-saturation-accuracy-t3361332"], "threads": [{"text": "It's a beautiful IPS display. The colors are vivid and not over-saturated.", "time": "9th May 2016, 03:39 AM", "postID": "post66762244", "replies": []}, {"text": "I really feel the saturation is quite lacking. The colors seem to punch where they are needed with certain UI elements but then lacking elsewhere such as flesh tones in videos.  Fortunately there is an easy fix for this and it is to incorporate the screen color mod into a kernel. Unfortunately there really is no active kernel development for the G5. I guess we will just have to wait and hope things pick up.", "time": "31st July 2016, 09:15 AM", "postID": "post67978556", "replies": []}, {"text": "Colors are decent but yeah, a bit undersaturated, almost blue-ish in some cases. I was surprised to see there is no display color adjustment...it's a real pity because camera(s) takes such beautiful pics, but you really appreciate them when you watch them on a calibrated display!", "time": "2nd August 2016, 08:54 PM", "postID": "post68016013", "replies": [{"text": "There is: Settings>General>Accessibility>Vision>Screen Color Adjustment", "time": "6th December 2016, 05:15 AM", "postID": "post69950180", "replies": [{"text": "+1 with the Screen color Adjustment, this could adjust the saturation a bit though making it look a bit darker but more detailed.\n\r\nOutcome photos won't change though.", "time": "14th December 2016, 02:50 AM", "postID": "post70078738", "replies": []}]}]}, {"text": "very under saturated", "time": "4th December 2016, 04:44 PM", "postID": "post69926512", "replies": []}, {"text": "Now that my tempered glass protector broke, I can judge the naked screen again. I think it's just \"fine.\" I feel like it needs a bit more saturation like what the users said above. Still love my phone though <3", "time": "5th December 2016, 03:19 PM", "postID": "post69940507", "replies": []}, {"text": "I think it's very close.  Apple Iphones are nasty and look artificial to me.\n\nMy buddies HTC M9 is very similar too.\n\nIt's all on the coding too, some video encoders mess with coloring.  Youtube is horrible", "time": "6th December 2016, 02:08 AM", "postID": "post69948638", "replies": []}]}, {"title": "Clarity/resolution", "rating": 5.0, "links": ["https://forum.xda-developers.com/lg-g5/review/clarity-resolution-t3361333"], "threads": [{"text": "since its an IPS display without shared sub pixels for multiple pixels resolution wise, this is a true 3 x 2K\nin terms of 3d gaming the device will sadly only render at 768p and in rare cases in full resolution.\nthis is not bad at all since the density will still keep it small. though you will see pixels in that case.", "time": "22nd April 2016, 03:37 PM", "postID": "post66494653", "replies": []}, {"text": "Thats how it is beacuse its ips technology", "time": "23rd April 2016, 05:11 PM", "postID": "post66511218", "replies": []}, {"text": "To be perfectly honest, I can't tell the difference between 4k displays and 1080p displays on a sub 6-inch phone. With that said, this phone's display is super crisp", "time": "9th May 2016, 03:35 AM", "postID": "post66762221", "replies": []}]}, {"title": "Minimum brightness", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-g5/review/minimum-brightness-t3361334"], "threads": []}, {"title": "Call quality", "rating": 5.0, "links": ["https://forum.xda-developers.com/lg-g5/review/call-quality-t3361335", "https://forum.xda-developers.com/lg-g5/review/call-quality-t3361335/page2"], "threads": [{"text": "The call Quality is excellent. I'm coming from a background of a Samsung Galaxy S4 and Sony Xperia Z3 an Alcatel Idol One Touch 3 and a number of other phones. The speaker phone quality is awesome and the earpiece quality is very good as well and no one has to ever say they cannot hear me. I'm very pleased with my purchase beyond the shadow of a doubt.", "time": "19th April 2016, 03:16 PM", "postID": "post66443136", "replies": []}, {"text": "Fairly good and reliable signal", "time": "20th April 2016, 09:06 AM", "postID": "post66456372", "replies": [{"text": "good job", "time": "22nd April 2016, 05:03 AM", "postID": "post66487321", "replies": []}]}, {"text": "I know it's not unique to the G5 but the HD voice calls on Verizon are pretty good.  I just wish it wasn't solely a Verizon thing.", "time": "21st April 2016, 03:07 AM", "postID": "post66469929", "replies": [{"text": "it isn't.", "time": "22nd April 2016, 02:37 PM", "postID": "post66493722", "replies": []}]}, {"text": "On the off-brand T-Mobile aka MetroPCS with the EU H850...best speeds I've had on a phone but I was with Sprint for so long that barely counts...", "time": "3rd May 2016, 10:48 AM", "postID": "post66672241", "replies": []}, {"text": "European H850 here and it has hd voice too...  sounds pretty good", "time": "4th May 2016, 08:43 PM", "postID": "post66697121", "replies": []}, {"text": "Poor but I think its a defective device. I have a G4 on the same network and it is flawless.", "time": "5th May 2016, 03:07 PM", "postID": "post66708245", "replies": []}, {"text": "The best I've experienced as you'd expect, it's difficult to make. Judgement though given I switched networks with my latest contract. There are probably too many variables to give a concrete answer but calls are always crisp with 2+ signal. 4.5/5 for me.", "time": "3rd June 2016, 01:40 AM", "postID": "post67145010", "replies": []}, {"text": "Id give it a 4/5. Using HD voice apps to get its full potential, it is crystal clear", "time": "8th June 2016, 11:12 AM", "postID": "post67223534", "replies": []}, {"text": "Nice call quality. But, when it's really really windy (and only then), my moto x force does the noise filtering job much much better tough.", "time": "2nd August 2016, 09:27 PM", "postID": "post68016434", "replies": []}]}, {"title": "WiFi strength, range, and throughput", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-g5/review/wifi-strength-range-throughput-t3361336"], "threads": [{"text": "My only gripe with the WiFi has naught to do with these metrics. It has to do with connecting to authenticated networks (coffee shops, work, \"open a browser to login\" types.). I HATE how it will choose to just not connect instead of waiting for you to authenticate. Haven't phones been able to be connected to WiFi and cellular data since Lollipop or so? Why just not connect instead of holding until you auth the network? Argh. Anyway! Great, otherwise!", "time": "7th July 2016, 11:14 PM", "postID": "post67648766", "replies": []}, {"text": "My phone drops wireless in my room constantly, no other device does. 2nd phone, definitely a design issue", "time": "30th March 2018, 09:39 PM", "postID": "post76071680", "replies": []}]}, {"title": "Cellular strength and throughput", "rating": 4.0, "links": ["https://forum.xda-developers.com/lg-g5/review/cellular-strength-throughput-t3361337"], "threads": [{"text": "I watched everything from adult \"instructional\" videos to telecommunications instructional videos without any hint of poor performance. No issues as seen by me. This is an excellent phone.", "time": "19th April 2016, 03:18 PM", "postID": "post66443166", "replies": []}, {"text": "well.. this would require measuring the g5 in comparison with all other phones with similar LTE capabilities.\r\nso far i'm more than happy. sadly this phone has higher bandwidth in terms of internet than my home connection D:", "time": "19th April 2016, 05:27 PM", "postID": "post66445506", "replies": []}, {"text": "for the carrier aggregation, the LG G5  is 2CA or 3CA ?\nBecause Snapdragon 820 is 3CA :\nDownlink Features\n3x20 MHz carrier aggregation\n256-QAM", "time": "2nd May 2016, 11:05 AM", "postID": "post66656093", "replies": []}, {"text": "Horrible reception", "time": "8th October 2016, 08:38 AM", "postID": "post69030518", "replies": []}, {"text": "No cat 12 support... Poor performance compared to the Note 7", "time": "9th October 2016, 05:58 AM", "postID": "post69042078", "replies": []}, {"text": "Fine with me. Great reception. Auto detect is fast. Switching is fast. No problem with me.", "time": "9th October 2016, 07:44 AM", "postID": "post69042802", "replies": []}, {"text": "download and upload speeds are half as fast as iphone right next to it on T-mobile network when done speed tests", "time": "31st July 2017, 02:36 PM", "postID": "post73238294", "replies": []}, {"text": "H860 has a problem regarding reception, switching  SIM 1 to LTE reduces signal strength of SIM 2 which is on 2G. Bad receptions as compared to LG G4.", "time": "1st August 2017, 07:45 AM", "postID": "post73246627", "replies": []}, {"text": "H850 tested on LTE 4G+, 5Ghz and 2.4Ghz wifi about 15 meter (3 walls) from router.\n\nOverall, excellent reception on LTE and above average wifi reception and speed.\n\nCompared to:\nHonor 7: Much better wifi reception.\nHonor 8: About same wifi reception (both excellent) and somewhat better LTE speed in same room.\nSony Xperia XZ: Sony wifi is not even in same class. Completely refused to find 5Ghz while only 11mbps on 2.4Ghz, while G5 had 65mbps on 2.4G and 150mbps (2/5 bars) on 5Ghz. LTE reception about the same.", "time": "4th August 2017, 11:32 AM", "postID": "post73283906", "replies": []}]}, {"title": "Speakerphone (loudness, clarity)", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-g5/review/speakerphone-loudness-clarity-t3361338", "https://forum.xda-developers.com/lg-g5/review/speakerphone-loudness-clarity-t3361338/page2", "https://forum.xda-developers.com/lg-g5/review/speakerphone-loudness-clarity-t3361338/page3"], "threads": [{"text": "The speakers are incredible! Surprised by how small and still powerful a speaker could be. At first look you are hoing to think \"they probably suck!\" but very soon you find out they are very bassy and clear", "time": "18th April 2016, 09:46 PM", "postID": "post66431840", "replies": []}, {"text": "Much better than the Sony Z3 and surprisingly loud and clear.", "time": "18th April 2016, 10:02 PM", "postID": "post66432067", "replies": [{"text": "I came from the Z3 too! the G5's single speakers beats the Z3's front-facing ones anyday", "time": "19th April 2016, 01:10 PM", "postID": "post66441229", "replies": [{"text": "OMG its so night and day. I used to have to embarrassingly ask people to speak up because my phone has volume issues. The G5 speakerphone and earpiece volume is refreshing. LOL", "time": "19th April 2016, 02:39 PM", "postID": "post66442496", "replies": []}]}]}, {"text": "i'm glad they did not hop onto the water proof hype train.\neven though you will hear some noise when you listen to stuff on max volume this speaker is performing insanely well.\n\nsadly in gaming i tend to close the holes with my hand. i guess there will be upcoming modules that will boost the speaker even further.. keep in mind the speaker is part of the modules.", "time": "22nd April 2016, 03:41 PM", "postID": "post66494726", "replies": []}, {"text": "Very happy with the speaker as well. I'm surprised by how rich the sound is. This definitely isn't your average phone speaker.", "time": "22nd April 2016, 11:15 PM", "postID": "post66500780", "replies": []}, {"text": "Very happy with the speaker and speakerphone.", "time": "23rd April 2016, 03:41 AM", "postID": "post66502838", "replies": []}, {"text": "It vibrated in louder settings and made it feel very cheap  I'm disappointed with LG with this! The whole chin chamber rattled. Volume and sound though was very good.", "time": "25th April 2016, 10:19 PM", "postID": "post66546092", "replies": []}, {"text": "Its pretty good but at loud volume it does vibrate,", "time": "4th May 2016, 08:42 PM", "postID": "post66697108", "replies": []}, {"text": "Love the phone, but it vibrates at high volume. It's a bit like holding a jar full of angry wasps.\nHowever I've now put the phone in a bumper case,  and it's much much better..", "time": "5th May 2016, 09:22 AM", "postID": "post66704179", "replies": []}, {"text": "I didn't think my G5 would have such a great speaker, but man I was pleasantly surprised. The speaker is both loud AND clear.", "time": "9th May 2016, 03:42 AM", "postID": "post66762267", "replies": []}, {"text": "Agreed, really loud and nice.", "time": "12th May 2016, 09:10 PM", "postID": "post66823902", "replies": []}, {"text": "i come from z5c and i miss its sound. maybe less strong but my g5 above half volume bar does vibrate and thus generating a loud noise. maybe a fault with my magic slot?", "time": "14th May 2016, 10:51 PM", "postID": "post66854568", "replies": []}, {"text": "The the quality rocks compared to my S7. Don't expect wonders but i was really surprised. \nEven better with Viper4Android.", "time": "15th May 2016, 09:43 PM", "postID": "post66868087", "replies": []}, {"text": "When using youtube, anything below 50% is hardly audible. Is it just me or others are also experiencing such problem?", "time": "3rd September 2016, 02:55 PM", "postID": "post68509823", "replies": [{"text": "Yeah i think thats true . But the phone gets really loud from step to step in the last volume steps . Loud enough . I compared it to my old Note 4 with Volume boost and it was noticable louder . So i am really satisfied .", "time": "15th October 2016, 01:28 PM", "postID": "post69141181", "replies": []}]}, {"text": "One of the best single speakers in a phone.", "time": "16th October 2016, 11:57 PM", "postID": "post69164153", "replies": []}, {"text": "Is it significantly louder than the Galaxy S7? How's it compare to the LG G4?  \n\nI went from an LG G4 (which has an amazing speaker) to the Galaxy S7 and everything about the phone has been a disappointment. I'm returning it and gonna get the LG G5. Does it have any bootloop issues?  That's why I'm in this situation of choosing a new phone in the first place, and why I didn't go to straight to the G5.  I dare say the G4 was better than this S7 (before it bootlooped...). Didn't realize Samsung took out the IR sensor or had such a **** speaker.  Also didn't realize just how dependent I have become on having a removable battery.  Speaker is important because I watch Netflix and Amazon Prime in bed with my fan on.", "time": "20th February 2017, 02:35 AM", "postID": "post71105926", "replies": []}, {"text": "I barely use my loudspeaker but it already sounds blown out at 75% not happy at all.", "time": "21st February 2017, 01:18 AM", "postID": "post71120205", "replies": []}, {"text": "i just love the speaker of lg g5....its super amazing...better than Moto mod jbl", "time": "27th February 2017, 03:23 PM", "postID": "post71212501", "replies": []}, {"text": "I was surprised by the deepness of the standard speaker.", "time": "27th February 2017, 10:04 PM", "postID": "post71217511", "replies": []}, {"text": "sound in lg g5 is great, you can buy 32bit sound module also, after root and modify sound config in etc you can have stereo sound, up speaker is right channel, down speaker is left, it's good for gaming, you can also install arise sound mod if you have root ^^", "time": "5th March 2017, 12:28 PM", "postID": "post71292065", "replies": []}, {"text": "My almost 3 year old Note 4 speaker better than my current ATT LG G5", "time": "12th March 2017, 05:09 PM", "postID": "post71397441", "replies": []}]}]