[{"title": "Overall love", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s8+/review/overall-love-t3645713", "https://forum.xda-developers.com/galaxy-s8+/review/overall-love-t3645713/page2", "https://forum.xda-developers.com/galaxy-s8+/review/overall-love-t3645713/page3", "https://forum.xda-developers.com/galaxy-s8+/review/overall-love-t3645713/page4"], "threads": [{"text": "Best phone I've ever owned!", "time": "28th July 2017, 05:51 PM", "postID": "post73206871", "replies": []}, {"text": "Massive, gorgeous display. Faster than my nemesis' I7. Still need tweaks for battery life, but  the trade off in performance and consumer joy is worth it.", "time": "6th August 2017, 08:23 PM", "postID": "post73310183", "replies": []}, {"text": "The S8+ is the best phone I ever had so far, and the battery life is excellent.  \n\nI only have two minor issues with my S8+.\n\n1) The speaker is too easy to mistakenly cover while gaming or watch video. \n\n2) Sometimes on the Camera, there is a slight delay between the time you press the record button and when it starts recording, ONLY when you have it set to 4K UHD recording.\n\nOther than that, everything else is flawless for me.", "time": "7th August 2017, 08:00 AM", "postID": "post73314511", "replies": [{"text": "kjon", "time": "20th October 2017, 11:18 AM", "postID": "post74228649", "replies": []}]}, {"text": "I had the Verizon Galaxy S8 from the day it was released. I really like that phone. I just purchased a refurbished Unlocked S8+ from Bestbuy for $500 because I wanted to see the difference in size and battery life. I'm so happy I took a shot on the bigger brother of the galaxies. \n\nBattery life is better than expected and the overall size is not that different to hold. However when looking at the screen real estate the S8+ is huge and that's what I love about it. With this version I know the drawback may be reasonably timed updates, but if I decide to leave Verizon with all the T-Mobile changes, I can do it an not have to invest in a phone.", "time": "7th August 2017, 09:58 PM", "postID": "post73322340", "replies": []}, {"text": "I wanna to buy this mobile, Am so interested in this mobile to buy.", "time": "10th August 2017, 04:20 PM", "postID": "post73353574", "replies": []}, {"text": "Gotta say, coming from mostly Note devices, this has to be the best phone I've ever used and owned.  It's only been a couple of weeks but it's already left a big impression on me.  Not only that, this is the fist phone that I've used in its stock state.  No root (of course our SD doesn't have it yet, anyway) but I'm not really missing it or my S-Pen.  Most of the functions my S-Pen were able to perform I can do on this phone which was a pleasant surprise.  I still miss interacting with the display with the pen, though.  I may move onto the Note 8 at the end of the year but right now I'm very happy with this S8 Plus.", "time": "11th August 2017, 05:33 PM", "postID": "post73366139", "replies": []}, {"text": "So a quick info on my background. I have owned many Smartphones in the last 5 years, form pretty much all major brands(Samsung, Apple, Sony, Motorola). I also consider myself a Poweruser.\r\nSo this is my third Galaxy device and the first I was very happy with the S8+ for the first few weeks but I stumbled upping more and more negatives about the phone.\r\n1. After a few hours of uptime it will start to stutter when typing fast or switching between apps.\r\n2. The over the top animations get annoying, but if you turn them off it feels weed and even slower.\r\n3. Battery life seems good when watching videos that are supported by the hardware decoder but most hdr stuff is not no I could not even watch The Revenant on one charge and during that the device got very warm and I encountered a few dropped frames.\r\n4. Idle battery life is very bad (loosing 30% during the night about 7-8h) but this applies pretty much to all Android phone.\r\nOverall it's still an amazing phone but as everything it has its downsides.", "time": "16th August 2017, 05:41 PM", "postID": "post73424886", "replies": [{"text": "Nice , you are right ,", "time": "20th August 2017, 08:39 AM", "postID": "post73466913", "replies": []}, {"text": "do you have always on display turned on or off?", "time": "18th November 2017, 10:05 PM", "postID": "post74559479", "replies": []}]}, {"text": "I have never used a cell phone with the features which I am using in Samsung S8", "time": "17th August 2017, 01:21 PM", "postID": "post73434370", "replies": []}, {"text": "One last quick update.\n\r\nBeen reading through all the posts and replies on the latest root updates for the Snapdragon variants and after about a month now on this completely stock S8+ I can't see any practical reasons to go through the grind that is today's root method.  It certainly isn't like it used to be as a long-time Samsung rooting fiend and now it just seems far more trouble than it's worth.  This out of the box state is simply outstanding.  Obviously, your experiences may vary but based on my user habits, and I run the hell outta my daily driver, it's been performing brilliantly with no issues.  BixBye let's me remap that idiotic button without root so I'm good on that end which was the only real reason I was even contemplated rooting when it  became available for this version.\n\r\nI truly believe at this stage in Android and Samsung's combined software and hardware development on the S8+ things have finally matured enough where I'm not feeling that burning desire to root.  Sure, there's a couple of apps here and there that I will miss having but I still have that Exynos Note 5 to kick around.  \n\r\nFantastic phone.  I will be considering getting the Note 8 but only because of that S-Pen.  This S8+ is an amazing daily driver if and when I do make the switch.", "time": "23rd August 2017, 08:34 AM", "postID": "post73506625", "replies": []}, {"text": "The best phone on the market to date! Not only does the phone have excellent performance, but it's just a beautifully crafted device. I'd say the phone itself is..... art.", "time": "3rd September 2017, 02:38 PM", "postID": "post73648302", "replies": []}, {"text": "perfect phone for me, i jumped from note 4 to this.", "time": "11th September 2017, 03:06 AM", "postID": "post73746735", "replies": [{"text": "i'm on the note 4 just and was wondering about screen width,do you lose much on the s8+ compared to note 4?", "time": "13th September 2017, 08:07 PM", "postID": "post73781219", "replies": []}]}, {"text": "There are a lot of \"best phone I've ever owned\" on here. I hate to be that girl, but... I agree.  I love the features at the software level such as being able to make all apps full screen. I also love the phone in general from a design perspective. The display and battery are both amazing.", "time": "17th September 2017, 03:42 AM", "postID": "post73821388", "replies": []}, {"text": "Great buy and experience, even in stock state", "time": "25th September 2017, 07:14 PM", "postID": "post73930253", "replies": []}, {"text": "The S8+ is the best phone", "time": "25th September 2017, 09:41 PM", "postID": "post73931796", "replies": []}, {"text": "You must buy the s8+ if yo dont use too much the pencil.\nI got to not use it but i miss it", "time": "26th September 2017, 05:58 PM", "postID": "post73942089", "replies": []}, {"text": "It's an awful phone. Unfortunately. The four things that save the situation are the following. \n\n1. The screen is simply beautiful. \n2. The camera is wonderful\n3. I didn't pay it \n4. The Google pixel 2 XL will be ridiculously expensive here in Greece. \n\nThe bad things are:\n\n1. Huge battery drain. I had the last Nexus that was awful and I found it's brother. Some times I have to charge it twice a day. I use Android since 2010 and I don't make experiments. I use the same applications for years so I have a very solid knowledge of what to expect. \n2. Lag. I don't know why but I have. I use the unbranded Greek version. I always install the new versions with Odin. With full format. I do the same with the Nexus and and my iPhone. In the latter two everything works so smoothly and I usually don't make the upgrades in time since I am bored for the setup. But now no no no. I have done 3 formats. One the day I bought it to unbrand it, the second in August when the latest version appeard and another one last Monday. The same. Unacceptable lag. Not that it's like a 3 year phone but it shouldn't happen.", "time": "14th October 2017, 08:28 PM", "postID": "post74158065", "replies": [{"text": "i think you got a bad phone or need to go thru all the settings and start turning rarely used apps working in the background off as well as most notifications. check the battery settings and optimizations etc etc", "time": "19th October 2017, 08:46 PM", "postID": "post74222632", "replies": []}]}, {"text": "Definetly one of the best devices Samsung had made. A true upgrade in all areas from the S7. Improvements in efficiency as well as the addition of Bixby and \"infinity\" put the S8+ it a clear cut above the V20, G6, and Moto G5.", "time": "19th October 2017, 10:20 AM", "postID": "post74215641", "replies": []}, {"text": "But I never have done that. That's why I am mad. For example now after 14 hours I have 42% battery and 1:30h SOT. And I didn't use it much today. And I haven't installed nothing extra like Weather apps or GPS tracking. I will wait for Oreo because the phone is awesome in hardware. The screen is amazing and I spend a lot of time with the phone because I sent a lot of mails. And every time I'm stunned.", "time": "19th October 2017, 09:12 PM", "postID": "post74222919", "replies": []}, {"text": "Good", "time": "21st October 2017, 08:02 AM", "postID": "post74239023", "replies": []}, {"text": "What makes the Galaxy S8 so special is this: A tall, narrow shape that fits snugly in my palm and curved sides that scream \"classy.\" And the screen? 5.8 inches of colorful gorgeousness with a display that stretches from edge to edge with just a whisper of a bezel. For its looks alone, Samsung's flashiest phone lands at the top of the class. Trust me, when you see the S8 and larger, pricier S8 Plus, you're gonna want to put your hands all over them.\n\n---------- Post added at 09:41 AM ---------- Previous post was at 09:39 AM ----------\n\ni had this phone for around 3 months now, the \"Jelly Effect\" is present but i really don't notice it all the time, or i can say i don't care about it, at first i thought it was some feature in the phone until i saw some people complaining about it. \r\nit's really not annoying at all, perhaps you can say it's not noticeable when you get used to it, not like what they say in the reviews.", "time": "23rd October 2017, 09:41 AM", "postID": "post74262374", "replies": []}, {"text": "I finally got me a used mint condition S8+ for 300 with some extras just to try it out. First time owning a phone I did not plan to root. \n\nBut no need for root using My Backup Pro, BK Disabler, Adguard, and FDroid I can pretty much still backup everything, Kill and freeze all bloat and unwanted junk they put on these phones and adblock still works with adguard or FDroids DNS66.\n\nPretty good phone so far. I just wish they offered a Flat screen version. There is not reason to have this curved screen I don't see any benefit to it at all. it just makes it harder to get a good case and screen protector... It's a gimmick.\n\nI would have never paid more than 300 for this phone anymore would be a ripoff. Almost waited until I could get one for 200.", "time": "2nd November 2017, 01:22 PM", "postID": "post74380235", "replies": []}, {"text": "THIS is the worst phone ever. Typing/texting sucks, no matter how big or small the keyboard. Sdcard slot is the biggest issue, turns on and off constantly. Nothing works correctly most the time, calling,texting,apps, just overall functionality of the device. Phone is really nice and that's about it. Customizations with substratum is horrible. 1 month with this phone and I wanna smash it on my head, wait I already did that surprisingly didn't crack break or bend. OVERALL IMPRESSIONS: phone isn't worth the $900 I paid for it. Nice to look at and horrible to play with.( Samsung really needs to up their game cause if you all notice, their devices ha e gone to crap for a while now, their just getting rich off of people with their hype). Do not buy unless you like fidgeting with phones and don't need to make calls or take of business with this phone. My rating: ⭐ out of 5 and that's for the look of the phone. Who cares what processor or camera this phone has, don't mean anything if it doesn't work correctly.", "time": "5th November 2017, 12:44 PM", "postID": "post74413573", "replies": [{"text": "Sounds like you got a dud. My 64GB SD Card works perfectly. I have all photos and videos saved directly to the card and have never had a problem. Nothing wrong with voice and text either, although I use Google Hangouts mostly.", "time": "6th November 2017, 12:59 AM", "postID": "post74419693", "replies": [{"text": "im  assuming that i do have a dud also. but, what i noticed is that when i return to root, it does it. when i stay on stock and format the sdcard it works perfectly fine throughout the usage. also, i wanted to point out something very odd, i use the sdcard for music in my car and it doesnt skip or stop the music over bluetooth, it only does it when its plugged into a computer and when im trying to transfer files with a file manager. thats odd to  me", "time": "6th November 2017, 11:50 AM", "postID": "post74423551", "replies": []}]}]}, {"text": "This has become the first phone in my 9 years of smart phone ownership that I have broken the screen.", "time": "14th November 2017, 04:47 PM", "postID": "post74513567", "replies": []}, {"text": "1st phone or android device that I have not rooted  Best phone ever!", "time": "14th November 2017, 09:29 PM", "postID": "post74516363", "replies": []}, {"text": "Love this phone! I came from a Oneplus 3T to the S8+ and I don't regret it at all. The 3T is an awesome, very fast and customizable theme. I just needed sth new and fell in love with the huge Display of the S8+. I had owned an S7 flat before the 3T but due to touchwiz it felt and was never as smooth and fast as the 3T. This has changed at least a Little bit. The S8 runs smoother than the S7 and I like the customization options. With the device barely 2 minutes in my hand I installed Batman ROM and love it! Superb battery life, very smooth and fast (still not as smooth as a Oneplus btw).", "time": "17th November 2017, 09:02 AM", "postID": "post74542642", "replies": []}, {"text": "Agree best phone I've ever owned. Last samsung was the s5 and I didn't particularly enjoy it. But this beast is amazeballs!", "time": "4th December 2017, 02:47 PM", "postID": "post74733355", "replies": [{"text": "I had the s6 before this this is alot better and before my s6 I had my dad's s5", "time": "9th December 2017, 03:57 AM", "postID": "post74783530", "replies": []}]}, {"text": "I've owned an S8+ since the day it came how, and have ended up having it replaced once.\n\nWhile it was pretty awesome on launch day, it has since deteriorated as terribly as most Samsung phones do after 6 months or so - the animations seemingly are just not even designed to be as smooth or fluid as stock android - frames constantly drop, lags happen regularly, and most obnoxiously for me, the more use the phone gets, the longer it'll take to open apps.\n\nWhereas the Pixel will open an app as soon as you tap it, there will be a noticeable delay on my S8+ between when I tap it, and when it opens. This can vary depending on the app, and if it's still in memory and whatnot, but it's pretty consistent and pronounced.\n\nI've also experienced the lag and input delay with the keyboard randomly and seemingly without any obvious reason. Sometimes it's after heavy use, sometimes it's after just a few minutes of use.\n\nIn some cases and at certain times, I've actually found budget phones like the Moto G5 Plus to run faster and more reliably than the S8+, which is pretty ridiculous when you think about the difference in price points.\n\nWith Samsungs, it just seems like absolutely everything is great on the hardware side, but the software is just an utter mess - it's like nothing is optimized, no thought is giving to long-term sustainability, and the minute the phone is out of the box, the software experience starts to deteriorate rapidly. I honestly started considering switching  to an iPhone just because I was THAT annoyed by the lag before I decided to just explore other options among android phones. I honestly don't quite understand how so many phone reviewers and users can look past this many software shortcomings.", "time": "10th January 2018, 02:08 AM", "postID": "post75143212", "replies": [{"text": "Yep. This is it. This was my point since I bought this phone. It's all because the software isn't optimized enough. My old phone, with custom rom based on oreo have better prefomance than my sg8 +. I hope one day will be better. The hope die last, right? ☺", "time": "14th January 2018, 08:19 PM", "postID": "post75199200", "replies": []}]}]}, {"title": "Community development strength", "rating": 3.5, "links": ["https://forum.xda-developers.com/galaxy-s8+/review/community-development-strength-t3645714"], "threads": []}, {"title": "Overall speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s8+/review/overall-speed-t3645715", "https://forum.xda-developers.com/galaxy-s8+/review/overall-speed-t3645715/page2", "https://forum.xda-developers.com/galaxy-s8+/review/overall-speed-t3645715/page3", "https://forum.xda-developers.com/galaxy-s8+/review/overall-speed-t3645715/page4"], "threads": [{"text": "Yes it really fast and reliable, I am using and I advice others to use it. thanks", "time": "29th July 2017, 01:27 PM", "postID": "post73215312", "replies": []}, {"text": "T-Mobile is fast in Orlando on the S8+.", "time": "15th August 2017, 10:54 PM", "postID": "post73415705", "replies": [{"text": "Cool , how did you do that ?", "time": "29th November 2017, 01:49 AM", "postID": "post74673590", "replies": [{"text": "There is LTE+ there (as well in my area in NY) and it's blazing fast.", "time": "29th November 2017, 06:03 AM", "postID": "post74675075", "replies": []}]}]}, {"text": "In my opinion, the S8 is hindered by typical Samsung jitter, transitions and animations stutter all over the place, its really jarring, and its making me reconsider upgrading to the Note 8.", "time": "16th August 2017, 10:04 AM", "postID": "post73419850", "replies": [{"text": "Just go to settings...  About phone...  Tap build number 7 times in a row until you see \"you are now a developer \" and push the back button,  enable developer options and scroll down to window animation etc..  And set them all to scale 0.5 X and whalla ... Problem solved...\n\n---------- Post added at 05:30 AM ---------- Previous post was at 05:20 AM ----------\n\n\n\r\nI believe they are referring to the processor, animation,  etc of the phone.  But I MYSELF like your info...  I have a question...  What type of connection is that you are utilizing there,  and whom would it be provided by?  I'm wondering if that is utilizing the gigabyte modem in the device (assuming you are using the s8+.. And assuming anything is even offering connections at that speed yet)  or if that's just your wifi, or 4glte ... It absolutely amazes me that CRAPPLE didn't even include the new gigabyte modem in its iPhone X models...  (I'm still wondering how I slept thru the iPhone 9.. Lol but not really as Iphone has always bored me to sleep)  and seeing as how its crapples flagship device for a good while...  It will be stuck with 4g LTE LONG after all other carriers and devices (Android, etc.)  has moved on to gigabyte speeds..  Haha\n\n---------- Post added at 05:44 AM ---------- Previous post was at 05:30 AM ----------\n\n\n\n\r\n Umm...  Myself...  I'd wonder if something malicious or something in that nature hadn't found its way onto  your device..  I know that may seem hard to believe,  but that's what it sounds like..  As the iPad Pro 10.5 (Crapple) doesn't even make a blip on the radar when compared to the power and other specs of the s8+. Actually NOTHING in the mobile field does either..  The s8+ is the absolute top of the food chain by leaps and bounds..  And will remain so for quite a while. I've not had ANY problems like that with mine. And I...  Like you.. could make a processor climb out the phone and be like...  \"dude...  Really???\"  lol I'm not sure how you charge yours..  I went with the quick charge wireless dot.  And just some info for you on apple and ANYTHING to do with it,  NONE of their devices have the new gigabyte modem nor antenna used to access it. Not even the iPhone X...  And the X is it until well AFTER gigabyte speeds will be available..  It's slated to start soon on most carriers..  Just some info...  Let me know what ya figure out, and which processor ya have in it brother.  Thanks\n\n---------- Post added at 06:03 AM ---------- Previous post was at 05:44 AM ----------\n\n\n\n\n\n\n\r\nI'm not seeing what it is y'all are doing with y'alls devices that could be causing ANY of what you and the guy above you are describing...  Not even close..  It sounds like either BOTH of y'all have either defective batteries...  Or (and I know it may be hard to phantom brother) something malicious on y'alls device...  Cause I have had NOTHING even remotely close to ANY of that...  And I've had and compared EVERYTHING out there before and some after, I got my s8+... And not a single one even comes close...  G6, nexus,  pixel2, and I could go on and on and on....  I root, and do CR installs,  roms, etc.  For a little extra cash...  The s8+ is a BEAST among lambs....  If I was y'all I'd do a back up...  Wipe...  Clean...  And reset...  Then once you enable dev options turn all scales down to 0.5x and it's super fast then...  Now I did buy the unlocked version..  So no bloat, except for Samsung's junk,  but you know how to handle that..  As I know you do,  or ya wouldnt be on here... Also I chose to use the wireless dot charger with mine and I don't use fast charge unless I just HAVE to..  Not sure what's going on with y'alls brother..  But just give a root,  slim down..  And you know where to go from there and should be problem solved...  But let me know what ya figure out if ya have time and all...  And which processor ya have and all..  Good luck..  Hate to hear it's doing yall like that.  It's one of the most amazing things I've ever layed hands on....", "time": "18th January 2018, 06:03 AM", "postID": "post75240402", "replies": []}]}, {"text": "I have been using my Gs8+ for 3 months now and for the first 2 months I was very happy with performance but now I am experiencing hickups. The device gets warm to the touch, a reboot seems to fix the problems for a few hours. Now that I have also bought the new iPad Pro 10.5 it seems like a pile of **** like I'm using a 3 year old phone. I am thinking of resetting it and if it happens again i'l try a custom ROM. But I can still recommend this phone because I think it's partly because I expect to much as a poweruser.", "time": "16th August 2017, 05:26 PM", "postID": "post73424706", "replies": [{"text": "Coming from an S7 , It is probably that your battery is causing this. The more you discharge your phone to 0-10% battery the faster your battery is going to die. You will see that your phone heats up faster/performance slower and charge much slower than before. My S7 is great after 1 year of usage , what i do is turn of fastcharge (fastcharge charges faster at an increased temperature but the s8 is probably more effecient at it ), charge at 50% or try to.", "time": "2nd September 2017, 10:06 PM", "postID": "post73640606", "replies": []}]}, {"text": "Better than the rest!", "time": "24th August 2017, 11:15 AM", "postID": "post73521471", "replies": []}, {"text": "Im coming over from a Pixel XL, and I think the phone itself may be a bit slower than the Pixel XL was. Although negligible, I can tell a difference.   I also noticed that it was clunky of 5ghz wifi, but worked fine over 2.6ghz.  Not sure whats up with that, but downloading apps and navigating in chrome was very slow over the 5ghz.", "time": "25th August 2017, 02:26 PM", "postID": "post73536093", "replies": []}, {"text": "It is way too laggy, period. Lags all over the place. I'm getting mine rooted.\n\r\nWhich rom is best nowadays?\n\r\nI used to be a real poweruser years ago when CyanogenMod was the **** but I'm uninformed the past 5 years so I need some guidance", "time": "7th September 2017, 03:25 PM", "postID": "post73702580", "replies": []}, {"text": "Smooth", "time": "8th September 2017, 09:21 AM", "postID": "post73712290", "replies": []}, {"text": "If u are experiencing lag I highly recommend u go to bootup mode and clear the cache on your phone.  Do it 3 times just to be safe.  Especially after an update. Totally gets rid of the stuttering.  Also disabling any app that's using the acessabilty service speeds up any Android also.", "time": "9th September 2017, 06:31 AM", "postID": "post73723761", "replies": []}, {"text": "I just ran a geek-bench on my s8+ and I am rooted on Verizon. Single core score 1853 and multi is 6261", "time": "11th September 2017, 02:42 AM", "postID": "post73746609", "replies": []}, {"text": "thanks, it really fast", "time": "18th September 2017, 07:37 PM", "postID": "post73842394", "replies": []}, {"text": "I'm running Batman ROM and have a geekbench 4 single core score of 2027 and Multi 6751. The device is even faster with a custom ROM.", "time": "17th November 2017, 09:36 AM", "postID": "post74542875", "replies": []}, {"text": "I honestly don't quite understand how this phone can get such positive reviews of its speed and UI experience.\n\r\nI've used or at least tested A LOT of phones this year, and the S8+ has probably been the slowest, most janky experience I've had on a phone - even when compared to budget devices like the Moto G5 Plus.\n\r\nApp launching, multitasking, scrolling smoothness, and excess heat have all been inferior to every other current gen phone I've used.\n\r\nIMO, it could only be measured a success when compared to multiple-years old phones.", "time": "12th December 2017, 05:12 PM", "postID": "post74824140", "replies": []}, {"text": "I totally agree with CConn882,\r\nMy S8+ take 3-4 seconds to launch camera. Multi tasking is horrible too. I'll try out to clear the cache several times, but I think that will not help a lot. Only the fact there's no other device with that great screen holds me to the Galaxy S8+. I would love to use AOSP with all Samsung specific apps. (camera, video re-sizing, etc.)\n\r\nGreetings Newtoir", "time": "14th December 2017, 10:44 AM", "postID": "post74843273", "replies": []}, {"text": "does it lag over time?", "time": "15th December 2017, 09:53 AM", "postID": "post74853716", "replies": [{"text": "No, I think it's TouchWiz specific. Camera starts slow, but swoping between apps is okay. Sometimes the lockscreen stucks too. But now I'm on Oreo beta and it seem's to get better. I have an unlocked European version (Germany)", "time": "1st January 2018, 07:08 PM", "postID": "post75039703", "replies": [{"text": "You flashed Oreo beta or participated? \n\nI envy you mate ,", "time": "1st January 2018, 11:34 PM", "postID": "post75041969", "replies": [{"text": "The beta for Oreo was released by Samsung in Germany about 3 weeks ago, so I participated.\n\r\nBut Prime Video doesn't work anymore and the device is not longer certified by Google (Play Store),  but I'm glad to be on Oreo.", "time": "3rd January 2018, 03:49 PM", "postID": "post75062400", "replies": [{"text": "Hm works for me with renovate Oreo beta 4 rooted. Don't know what's the big difference.", "time": "3rd January 2018, 03:53 PM", "postID": "post75062447", "replies": []}]}]}]}]}, {"text": "This phone is horribly slow. Multitasking is sh*t and app opening animations are slow and laggy. Some apps takes seconds to open. My phone is original and bought from carrier. No junk apps installed. And it kind of a su*ks to keep an eye of what is installed in such an expensive device. Cleaning cache and junk does nothing and it starts lagging again in few hours.", "time": "28th December 2017, 05:28 PM", "postID": "post74993407", "replies": [{"text": "Maybe your phone have some problem. \nAt least you turn animation to 0.5??", "time": "29th December 2017, 04:05 PM", "postID": "post75004020", "replies": []}, {"text": "Had S8+ for 7 months. It is the same as all the rest of Samsung devices are: Full of bloatware, when putting 30 + applications on device it begans to lag, slow opening ...especially noticeable in Acad360 and other app like that...", "time": "22nd February 2018, 01:06 PM", "postID": "post75656640", "replies": []}]}, {"text": "The phone overall works well however I have used over 40gb of it's memory and I am starting to feel that sometimes it goes slow. Comparing my phone to my friends that has literally the same one but less things on it.  His works so much faster. Mine turns really slow when I've started charging it too and after I've just unplugged it.  Overall it's a decent speed", "time": "1st January 2018, 12:51 PM", "postID": "post75035956", "replies": []}, {"text": "It's android 7.0 that makes the device kinda slow and laggy sometimes. When I flashed a 7.1 ROM from note 8 the device felt instantly faster and snappier. No lags at all and apps opened away quicker. And same with oreo beta. Way faster than 7.0. So just wait for the official beta release and you will have a new device", "time": "2nd January 2018, 09:06 AM", "postID": "post75045419", "replies": []}, {"text": "Mine is pretty quick i gotta say", "time": "24th February 2018, 10:41 PM", "postID": "post75683335", "replies": []}]}, {"title": "App launch speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s8+/review/app-launch-speed-t3645716"], "threads": [{"text": "Wow, cool gan, what makes samsung galaxy S8 can be like that, whether from sparepart kah or from oprasionalnya system.\n\r\nthank you,\r\npolarin.co.id", "time": "16th November 2017, 07:55 AM", "postID": "post74531476", "replies": [{"text": "Yes , Samsung has always been my favorite", "time": "3rd December 2017, 04:01 AM", "postID": "post74717812", "replies": [{"text": "How u do that I want also", "time": "3rd December 2017, 12:39 PM", "postID": "post74721432", "replies": []}]}]}, {"text": "Hi, I'm debating on getting the S8. Can anyone compare it to the iPhone X?", "time": "15th December 2017, 09:46 AM", "postID": "post74853656", "replies": []}]}, {"title": "Multitasking/RAM", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s8+/review/multitasking-ram-t3645717"], "threads": []}, {"title": "Scrolling smoothness", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s8+/review/scrolling-smoothness-t3645718"], "threads": []}, {"title": "Heat", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s8+/review/heat-t3645719"], "threads": []}, {"title": "Low light", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s8+/review/low-light-t3645720"], "threads": [{"text": "In pro mode!!", "time": "29th July 2017, 04:42 AM", "postID": "post73211665", "replies": []}, {"text": "in pro mode when known to take a proper shot\ns8 is the king", "time": "16th August 2017, 04:36 AM", "postID": "post73417624", "replies": []}, {"text": "wow", "time": "28th August 2017, 02:44 AM", "postID": "post73566505", "replies": []}]}, {"title": "Photo quality", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s8+/review/photo-quality-t3645721"], "threads": [{"text": "I have some awesome landscape pictures..taken with the phone. But i dont know how to add here..", "time": "21st August 2017, 11:19 AM", "postID": "post73480422", "replies": []}, {"text": "Here some macro", "time": "4th October 2017, 07:59 AM", "postID": "post74029663", "replies": []}, {"text": "have a look", "time": "11th October 2017, 12:52 PM", "postID": "post74117507", "replies": []}, {"text": "I have some issues with auto-focus, is this due to the latest update?", "time": "11th October 2017, 02:54 PM", "postID": "post74118775", "replies": []}]}, {"title": "Video quality", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s8+/review/video-quality-t3645722"], "threads": [{"text": "I'm a casual camera user. This cam does more than I'll ever need it to do. Love filming at 60fps. The cam does leave something to be desired when compared to the duel wielded back facing cameras and the 7 Plus and others..", "time": "19th October 2017, 10:23 AM", "postID": "post74215676", "replies": []}]}, {"title": "Selfie quality", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s8+/review/selfie-quality-t3645723"], "threads": [{"text": "i must say that Samsung galaxy s8 is one of the best phone Samsung has made/ talking about its selfie quality ,it is awesome and i realy love it. the pixels are good and the quality of the image is awesome.", "time": "12th August 2017, 09:59 AM", "postID": "post73373239", "replies": [{"text": "same here!!!", "time": "13th August 2017, 03:10 AM", "postID": "post73381783", "replies": []}]}, {"text": "Should you be fond of selfie - go for it", "time": "24th August 2017, 01:57 PM", "postID": "post73522951", "replies": []}, {"text": "I dont take a lot of them, but I have noticed that the front camera is very clear and takes great photos.", "time": "25th August 2017, 02:24 PM", "postID": "post73536066", "replies": []}]}, {"title": "Time to take picture (camera launch speed)", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s8+/review/time-to-picture-camera-launch-speed-t3645724"], "threads": []}, {"title": "Software (ease of use, features, etc)", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s8+/review/software-ease-features-t3645725"], "threads": []}, {"title": "Charging speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s8+/review/charging-speed-t3645726", "https://forum.xda-developers.com/galaxy-s8+/review/charging-speed-t3645726/page2", "https://forum.xda-developers.com/galaxy-s8+/review/charging-speed-t3645726/page3"], "threads": [{"text": "Best battery life I've ever had!!!", "time": "28th July 2017, 05:51 PM", "postID": "post73206881", "replies": [{"text": "No doubt.Battery life is very important subject if you use your phone along time during that time you need battery.Samsung s8 is best .", "time": "22nd January 2018, 11:22 PM", "postID": "post75298719", "replies": []}]}, {"text": "so nice", "time": "17th August 2017, 09:35 PM", "postID": "post73439736", "replies": []}, {"text": "I must say, while battery life is exceptional, the charge time is not up to part with my S6. I forget what the maH was on the S6, but the S8+ doesn't charge as fast.", "time": "3rd September 2017, 02:40 PM", "postID": "post73648323", "replies": []}, {"text": "Mine is good", "time": "8th September 2017, 09:20 AM", "postID": "post73712286", "replies": []}, {"text": "Why doesn't it support Quick Charge 4.0?", "time": "10th September 2017, 05:45 AM", "postID": "post73735566", "replies": []}, {"text": "Charging speed on my s8+ is very fast. I don't mind that they didn't use fast charge 4.0 or 3.0 or 10.0, that's their choice and all I can do is look at the actual charging speed and not on the technology behind it and in my opinion it is very fast.", "time": "10th September 2017, 11:37 AM", "postID": "post73738383", "replies": []}, {"text": "Compared to my Moto z force it's nowhere near as good. In half an hour the s8+ would be at around 40 while the z force is at around 60. What do you expect though from a 5amp charger. Just wish Samsung could've integrated the fast charge that the z force has.", "time": "12th September 2017, 01:05 AM", "postID": "post73758381", "replies": []}, {"text": "its fast charge for the size of the battery", "time": "14th September 2017, 03:05 AM", "postID": "post73784168", "replies": []}, {"text": "app \"Ampere\" from PlayStore tells me fast charging feeds it more than 1200mAh consistently \n\nbattery lasts more than a day\n\nhappy with the Plus", "time": "25th September 2017, 12:22 AM", "postID": "post73920079", "replies": [{"text": "Don't depend that app just read the manual and observe your phone.", "time": "28th September 2017, 04:08 AM", "postID": "post73959311", "replies": []}]}, {"text": "Nothing compares to the Mate 9 and it's Super Charging. 0 to 90 in less than an hour 👍", "time": "25th September 2017, 08:34 AM", "postID": "post73923269", "replies": []}, {"text": "You are right, that's an amazing feat for a piece of hardware\nWe are behind... a bit with our 8s", "time": "25th September 2017, 11:06 AM", "postID": "post73924582", "replies": []}, {"text": "Best battery life", "time": "27th September 2017, 07:28 PM", "postID": "post73955511", "replies": []}, {"text": "Can you recommend an alternative?", "time": "28th September 2017, 09:47 AM", "postID": "post73961708", "replies": []}, {"text": "Yesterday I charged my s8+ with the original fast charger and the original cable and it took 1 hour and 34 mins to charge from 1% to 100% and today I tried charging with the original charger of my s5 and it took 1 hour and 48 mins from 1% to 100%.\nThis is it? Only about 15 mins difference? 1 hour and 34 mins is quick but the difference between fast charging and regular charging with a normal charger isn't big at all.", "time": "28th September 2017, 10:14 PM", "postID": "post73968886", "replies": [{"text": "Just a quick question. Did you happen to have the screen on or turning it on frequently while charging? \n\r\nThe S8 only \"actually\" quick charges when the screen is off. It says it's Fast charging\" while plugged in to a compatible fast charger, but only charges at the 4.8 Volts and around 1.5 amps when the screen is turned on. When the screen turns off, it jumps to the 8 Volts and 1.8-2.0 amps.\n\r\nseems silly I know, but there must be a reason behind it. Maybe potential overheating if being used too heavily (gaming, movies, etc) while trying to fast charge at the same time. But I would have never thought that until I plugged in a voltage and amp meter inline with the charger to see what was actually flowing through.", "time": "21st November 2017, 01:35 PM", "postID": "post74587534", "replies": []}]}, {"text": "AQI7 update had really made things fabulous.\nBetter standby and faster wireless charging compared to earlier ones. \nAnd QC 3.0 charger charged my S8+ from 12-100 in 1hr 30min", "time": "2nd October 2017, 12:06 PM", "postID": "post74007704", "replies": []}, {"text": "Sammy Finally switched to USB C!! Battery charges considerably faster than the S7 when using  an aftermarket 2.4 amp charger.", "time": "19th October 2017, 10:31 AM", "postID": "post74215743", "replies": []}, {"text": "SOmetimes it might be the phone of the century", "time": "7th November 2017, 10:22 AM", "postID": "post74434247", "replies": []}, {"text": "my old oneplus 3 had longer battery life and faster charging speed than galaxy s8+. I have currently stock rom and don't know if there is any other custom rom with better battery life though.", "time": "18th November 2017, 11:34 PM", "postID": "post74560056", "replies": []}, {"text": "Working good.", "time": "28th November 2017, 09:23 AM", "postID": "post74664537", "replies": []}, {"text": "0-100 takes about 1h 40 mins. Ehh pretty disappointing considering the competition has much better faster charging. OnePlus' Dash Charge for example.", "time": "19th January 2018, 02:03 AM", "postID": "post75251893", "replies": []}, {"text": "NIce!!!!!!", "time": "31st January 2018, 04:45 PM", "postID": "post75398683", "replies": []}, {"text": "ty for this", "time": "1st February 2018, 12:36 AM", "postID": "post75402925", "replies": []}, {"text": "Tbh it is pretty good not bad at all", "time": "24th February 2018, 10:51 PM", "postID": "post75683402", "replies": []}, {"text": "What's your charging current with QI fast charge? Mine is pretty low about 700ma.", "time": "25th February 2018, 04:42 PM", "postID": "post75691390", "replies": []}]}, {"title": "Screen on time", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s8+/review/screen-time-t3645727", "https://forum.xda-developers.com/galaxy-s8+/review/screen-time-t3645727/page2", "https://forum.xda-developers.com/galaxy-s8+/review/screen-time-t3645727/page3", "https://forum.xda-developers.com/galaxy-s8+/review/screen-time-t3645727/page12"], "threads": [{"text": "Renovate rom and notorius kernel", "time": "29th July 2017, 09:27 AM", "postID": "post73213429", "replies": [{"text": "How do you consume battery whilst on dex ?? mine charges the phone whilst I'm using it.", "time": "1st August 2017, 05:55 AM", "postID": "post73245921", "replies": [{"text": "I'm not using dex. It's android system i think, gsam is showing wrong.", "time": "1st August 2017, 11:00 AM", "postID": "post73248162", "replies": []}]}]}, {"text": "Amazing battery life on the s8+", "time": "4th August 2017, 02:42 PM", "postID": "post73285731", "replies": []}, {"text": "Battery life has been a bit inconsistent. Usually I get around 4 or 5 hours screen on time, though honestly my habit with all my phone Shas been to charge them whenever possible. If I'm driving, I set it on the mount and plug it in. If I'm at home or work and not using it, I plug it in (or in this case set it on the wireless charger). But I was fairly unimpressed with the S8+ battery life. \n\r\nYesterday and today, I turned on the medium battery power setting. It seems to have increased my screen on time dramatically, but I'm also at home and on wifi. \n\r\nMedium decreases screen brightness by 10%, sets resolution to FHD+, underclocks by 30%, and turns off the AOD. Of these, the only thing I miss is the AOD, but it also seems to make the most difference in battery life. \n\r\nEither way, my battery life today is much better. So far I've had almost five and a half hours of screen on time and 54%  battery remaining. That's all surfing the internet, posting here, texting my wife, taking a few photos, and a little Facebook. I'd say that is fairly impressive.\n\r\nI'll see how the battery holds out Monday when I'm away from wifi, driving through varying cell tower coverage areas. I'll also check how it is if I turn the AOD back on. I do like the AOD.", "time": "6th August 2017, 03:21 AM", "postID": "post73302082", "replies": [{"text": "Do you notice any decreases in performances with the underclocking? Or are things still fairly snappy?", "time": "9th August 2017, 02:13 AM", "postID": "post73335169", "replies": [{"text": "I don't notice any performance issues at all with it underclocked. But I don't do any gaming either, so that may be an issue for others.", "time": "9th August 2017, 07:19 AM", "postID": "post73336839", "replies": []}]}]}, {"text": "Really good for a stock rom", "time": "6th August 2017, 03:32 AM", "postID": "post73302138", "replies": []}, {"text": "Bat Rom & Noto.\r\nCould of got to 10hrs but was playing with themes which require reboots.", "time": "6th August 2017, 11:31 AM", "postID": "post73305121", "replies": []}, {"text": "This is mine on stock full resolution with aod turned on Amazing battery best in the business!!", "time": "18th August 2017, 10:56 AM", "postID": "post73444937", "replies": [{"text": "How? what apps are you using and other stuff?", "time": "20th August 2017, 07:26 AM", "postID": "post73466335", "replies": [{"text": "Use Facebook,Instagram,Snapchat,YouTube,Twitter,WhatsA  pp   and maybe a few games too id say medium to heavy usage and I got easily 10 hours sot each day!", "time": "21st August 2017, 03:35 PM", "postID": "post73483048", "replies": [{"text": "On wifi or LTE because it seems impossible to reach those numbers for me.", "time": "21st August 2017, 05:14 PM", "postID": "post73484305", "replies": [{"text": "A mix between both but that was mostly on 4g\n\n---------- Post added at 08:06 AM ---------- Previous post was at 08:04 AM ----------\n\nAlso mines the exynos version as I am in the UK exynos have really good battery management in these devices", "time": "22nd August 2017, 09:06 AM", "postID": "post73492603", "replies": [{"text": "My is also exynos but i never get to numbers like these can you post screenshot from app usage screen?", "time": "22nd August 2017, 10:00 AM", "postID": "post73493073", "replies": []}]}]}]}]}]}, {"text": "wooow love", "time": "19th August 2017, 05:20 PM", "postID": "post73460156", "replies": [{"text": "I think you've loaded your phone in between. Your screen used 2200 of 3000 mah. That means 800mah for cpu, gpu etc. Impossible in my opinion. The only possibility is that you tweaked your phone.\n\nEdit: Sorry I used the wrong quote.", "time": "22nd August 2017, 02:47 PM", "postID": "post73496485", "replies": [{"text": "Tweaked my phone? My phone is stock from when i first got it  i wouldn't risk rooting this and losing beneficial features like Samsung pay and others I paid too much to mess around with it believe me or not thats totally your opinion", "time": "22nd August 2017, 03:10 PM", "postID": "post73496790", "replies": []}]}]}, {"text": "I didn't want to attac you, but it is quite difficult to believe that you got 12h sot with only one charge. It would be nice to see a screenshot of your full battery stats with the diagram. Then I'll revoke what I've said.", "time": "22nd August 2017, 03:16 PM", "postID": "post73496869", "replies": [{"text": "I shouldn't need to explain or prove myself to you I don't know you I posted my battery life and get called a liar what is this world coming to? I think it's jealousy", "time": "22nd August 2017, 03:18 PM", "postID": "post73496902", "replies": []}]}, {"text": "Today my battery life is on 5h 30m with 40% left that's with heavy usage all day so yeah with medium to heavy usage I can get easily 10 to 11 hours sot exynos version is superior to the snapdragon in my opinion", "time": "22nd August 2017, 03:16 PM", "postID": "post73496881", "replies": [{"text": "Strange i get nowhere close to your times...any idea what is wrong?", "time": "22nd August 2017, 06:11 PM", "postID": "post73499371", "replies": [{"text": "I'm not sure mate all I know is I do a factory reset after each major update and when I got my phone I did a factory reset from recovery the day I got it and ever since I have just left everything stock put resolution up to the max setting and that's it aod is on and everything else just put the resolution to max", "time": "22nd August 2017, 06:22 PM", "postID": "post73499517", "replies": []}]}]}, {"text": "The only thing I want is to see this curve, thats all. And again, I can't imagine a sot of 12 hours, because all the others have around 6h. Sry that I called you a liar. I should have used other words.", "time": "22nd August 2017, 04:42 PM", "postID": "post73498106", "replies": [{"text": "Look mines stock pal and look at this I'm still on 22% with 7h I'm no liar mate at all this is with heavy usage all day\n\nSorry I just took a screen shot of the graph hence the battery percentage change and also this is from one full charge", "time": "22nd August 2017, 06:19 PM", "postID": "post73499481", "replies": []}]}, {"text": "I got 10h+ SOT in 3 days without charging. SoLdieR9312 debloated Oreo custom ROM.", "time": "14th February 2018, 05:26 PM", "postID": "post75567902", "replies": [{"text": "Snapdragon ?", "time": "9th March 2018, 07:16 PM", "postID": "post75831296", "replies": []}]}, {"text": "Mine is pretty much as everyone i think snapdragon does better", "time": "24th February 2018, 10:44 PM", "postID": "post75683359", "replies": []}, {"text": "These crazy number made me wondering:\nMost of you dont't use your phone for calls anyway?\nYou are watching cell tower right through your window?\nSamsung would be very glad to hear from you since other people got 5-6 hours max of SOT...", "time": "27th February 2018, 04:54 PM", "postID": "post75715782", "replies": []}, {"text": "Just got Snapdragon G9550 (used) 4 days ago. It's so freaking amazing, even though I bought a used phone, it still manages to get almost 8 hours of SOT. With WQHD+, wifi all the time, no battery saving mode, about 3x Whatsapp video calls, lots of youtube, final fantasy XV pocket edition. The data connection mostly turned off. I get really bad data network coverage here in my room, but it stays in 4G mode. I guess even if I turn the data off, it'll still drain more battery since the phone is struggling to get 4G. Got 1-2 signal bars, 3 bars at most. It's been very consistent since 4 days ago. I love this phone hardware, not much on the software", "time": "3rd March 2018, 05:14 AM", "postID": "post75754193", "replies": []}, {"text": "Got almost 9 hours. Stock ROM, Oreo. Wi-Fi and 4G turned on all the time. Last 5% with the battery saving mode on.", "time": "6th March 2018, 12:47 PM", "postID": "post75791822", "replies": []}, {"text": "Exynos.", "time": "9th March 2018, 07:36 PM", "postID": "post75831489", "replies": [{"text": "Thanks", "time": "9th March 2018, 09:27 PM", "postID": "post75832380", "replies": []}]}]}, {"title": "Standby drain", "rating": 3.5, "links": ["https://forum.xda-developers.com/galaxy-s8+/review/standby-drain-t3645728", "https://forum.xda-developers.com/galaxy-s8+/review/standby-drain-t3645728/page2", "https://forum.xda-developers.com/galaxy-s8+/review/standby-drain-t3645728/page3"], "threads": [{"text": "Not that much", "time": "8th September 2017, 09:21 AM", "postID": "post73712298", "replies": []}, {"text": "I think it's a lot ! I've seen many baterry usage screenshots and I was impressed. But mine is some kind of joke. I can't even use my mobile phone often at work because it's dead from 8 to 16, with all options turned off - aod, sync, gps etc. Also with baterry saving mode. Please guys, there must be a way to fix that.", "time": "8th September 2017, 11:01 AM", "postID": "post73713203", "replies": []}, {"text": "Unfortunately it did not work. I've tried everyrhing..", "time": "10th September 2017, 12:08 PM", "postID": "post73738700", "replies": []}, {"text": "with only wifi and sync on, battery drains 3% from 11PM to 6AM", "time": "13th September 2017, 08:05 AM", "postID": "post73773655", "replies": [{"text": "Program Tasker to switch off all internet access, auto sync and wifi and Bluetooth. Once switched on, the phone will regain all functions. In a 12 hour shift, with occasional use, I lose about 20% of battery power.", "time": "15th October 2017, 12:21 AM", "postID": "post74159921", "replies": []}]}, {"text": "4G on\nWi-Fi on\nSync on\nOver night From 12 to 8am is 2-3% \nNot more.", "time": "13th September 2017, 08:20 AM", "postID": "post73773794", "replies": [{"text": "how much would it be with AOD on ?", "time": "23rd September 2017, 04:37 AM", "postID": "post73897470", "replies": []}]}, {"text": "there's a hundred settings for better battery life, putting apps to sleep, app background data, app data while data saving, notifications, permissions, etc etc etc....", "time": "14th September 2017, 03:03 AM", "postID": "post73784156", "replies": []}, {"text": "Change network mode to 2G only. You will see standby consumption go from 1-1.5% per hr to .3-.5% per hour guaranteed. Obviously more drain if using always on display and/or other heavy features. Works perfect for me as my s8 is my secondary phone and don't need 4g.\n\nps. sot currently was like 6 mintues so didnt post screenshot of that, although im able to get around 5-7hrs sot with about 24hrs total use time. Also rom is renovate ice note 8 port ver .1 all stock settings otherwise. Also i got pretty much the same battery runtimes with stock or custom roms. Same usage with lte/3g/2g setting enabled got me nearly 5/6 hrs sot with around 16hrs total usage but really standby was affected by this setting change.", "time": "21st September 2017, 07:05 PM", "postID": "post73881090", "replies": []}, {"text": "Snapdragon S8+ rooted.\n\nNot touching the phone, I lose about 10% per hour. A thirty minute drive to work, with Pandora the only app in use, it runs through somewhere between 15-20%. I've tried everything, including telling its mother and using the kitchen sink, but nothing helps. One day we weren't busy at work, and I forgot my charger at home. By 11am I was at 9% (that's after leaving the house at 7:30am) and had to make a run to Walmart for a charger. On a normal day, I have to charge it 2-3 times. On an extreme use day, I have a constant tether.", "time": "24th September 2017, 05:56 PM", "postID": "post73916435", "replies": [{"text": "If this true, I may give up to purchase one.  I don't like to bring a power sink. And there is not always have a store that I can charge my device.", "time": "12th October 2017, 07:20 AM", "postID": "post74126908", "replies": [{"text": "That's been my, my son's, and several other people's (in the root threads) experience. There are a whole slew of people that have great battery life with root, but mine is abhorrent.  I actually went back to stock, and have been astounded how much longer the battery lasts compared to having it rooted.", "time": "14th October 2017, 02:18 AM", "postID": "post74148420", "replies": []}]}]}, {"text": "Not that much", "time": "30th September 2017, 07:49 PM", "postID": "post73989728", "replies": []}, {"text": "I lose 3% or so over 8 hours of sleep. Make sure you go through your battery management and options to end draining apps when left in the background.\n\nStock US unlocked S8+", "time": "3rd October 2017, 08:23 AM", "postID": "post74017675", "replies": []}, {"text": "I'm going to leave my S8+ (unlocked) history so that others can relate and solve as i did:\nBought mine with a German ROM (DBT), and as soon i as connected it to Wi-Fi it got updated to QH3 (latest).\nNotice immediately a \"Android System\" drain that would take over almost 50% of phone sleep time. After some days decided to a \"Reset / Factory default\" but same story, drain ...\nSolution ?  Flash different region software (PHN - Netherlands - G955FXXU1AQI7 )\nNow it sleeps like a baby and \"Android System\" remains very low.", "time": "4th October 2017, 08:21 AM", "postID": "post74029846", "replies": []}, {"text": "Imm experiencing huge battery drainage since the new firmware update......no clue why\n\nOh and my phone is warm in idle and becomes quite hot when doing low intensity tasks such as loading this site", "time": "5th October 2017, 11:15 AM", "postID": "post74043177", "replies": []}, {"text": "This is best phone I every wanted. Galaxy S8 is best device in its own. No one can beat it.", "time": "16th October 2017, 01:47 PM", "postID": "post74178609", "replies": [{"text": "the s8+ unlocked beats it\n\n---------- Post added at 01:48 AM ---------- Previous post was at 01:38 AM ----------\n\n\n\r\ni'd take the phone back and get a new one. otherwise\r\nmake sure facebook app is disabled (if you don't use it) supposedly the biggest drain of any app\r\ndid you add any apps that may be draining the battery? many apps do\n\r\ni have every app to sleep except gmail and ad-clear\r\nin settings press/hold the battery icon until the menu comes up. you should solve most your issues there, also go to device maintenance\r\nmost apps 'allow background data' =off\r\nmost apps 'allow app while data saver on' =off\r\nand most notifications =off\r\nbixby totally off and button disabled\r\ni get average use 24-36 hrs battery life per charge s8+\r\novernight uses 2% average", "time": "18th October 2017, 01:48 AM", "postID": "post74198538", "replies": []}]}, {"text": "Just last night, I charged fully to 100%, and went to sleep. Woke up to 42% remaining!! 58% overnight?? That's not right. AOD is off, only wifi & sync on, signal is strong. I've now gone through and killed as much bloat as I can without rooting. It's funny because during the day it drains as expected with normal workday use.", "time": "16th October 2017, 09:51 PM", "postID": "post74184053", "replies": []}]}, {"title": "Heavy use endurance", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s8+/review/heavy-endurance-t3645729"], "threads": []}, {"title": "Light use endurance", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s8+/review/light-endurance-t3645730"], "threads": [{"text": "Holds up pretty well. Light use (Whatsapp, Chrome, Wi-fi and Economy mode) will probably render me two days with no charge.", "time": "12th December 2017, 06:46 PM", "postID": "post74825165", "replies": []}]}, {"title": "\"Look\" of the device (aesthetics)", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s8+/review/look-device-aesthetics-t3645731"], "threads": [{"text": "I've stated this in another thread: the Samsung Galaxy S8+ is a beautiful piece of art. It has the curves of a woman, the sleek black slickness of a Mustang, and awesome cpu muscle!", "time": "3rd September 2017, 02:42 PM", "postID": "post73648358", "replies": [{"text": "More like AMG muscle.  Not the kind of CPU that runs people over.", "time": "4th September 2017, 10:25 AM", "postID": "post73658210", "replies": []}]}, {"text": "Yeah", "time": "8th September 2017, 09:20 AM", "postID": "post73712282", "replies": []}, {"text": "I've had non-phone-fan people compliment me on how good looking it is.  And I agree, but the real appeal to me is the feel.  It feels fantastic in the hand.  Smooth and great curves.  I have probably 20 cases I've bought and I just can't bring myself to use them.", "time": "11th September 2017, 02:13 PM", "postID": "post73751946", "replies": []}]}, {"title": "Quality feel (use of materials)", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s8+/review/quality-feel-materials-t3645732"], "threads": []}, {"title": "Ergonomics (in-hand feel)", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s8+/review/ergonomics-hand-feel-t3645733"], "threads": []}, {"title": "OEM skin/software", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s8+/review/oem-skin-software-t3645734"], "threads": []}, {"title": "Outdoor visibility (max brightness)", "rating": 4.0, "links": ["https://forum.xda-developers.com/galaxy-s8+/review/outdoor-visibility-max-brightness-t3645735"], "threads": []}, {"title": "Contrast (true blacks)", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s8+/review/contrast-true-blacks-t3645736"], "threads": [{"text": "I love watching movies on this phone. The screen is absolutely beautiful.", "time": "24th August 2017, 05:11 PM", "postID": "post73525349", "replies": []}, {"text": "I have yet to watch a movie or netflix yet...but now Im going to have to!   I know colors and blacks in photos really pop...soo...off to the movies!", "time": "25th August 2017, 02:29 PM", "postID": "post73536134", "replies": []}]}, {"title": "Color saturation & accuracy", "rating": 4.0, "links": ["https://forum.xda-developers.com/galaxy-s8+/review/color-saturation-accuracy-t3645737"], "threads": [{"text": "Screen burn-in !!!", "time": "8th February 2018, 05:50 AM", "postID": "post75486713", "replies": []}, {"text": "Good quality display but over saturated images", "time": "22nd February 2018, 01:11 PM", "postID": "post75656694", "replies": []}, {"text": "Yea?", "time": "24th February 2018, 10:37 PM", "postID": "post75683317", "replies": []}, {"text": "Uneven red tone, even with the patches.", "time": "28th February 2018, 07:36 PM", "postID": "post75728605", "replies": []}]}, {"title": "Clarity/resolution", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s8+/review/clarity-resolution-t3645738"], "threads": []}, {"title": "Minimum brightness", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s8+/review/minimum-brightness-t3645739"], "threads": [{"text": "There's an app called screen filter in the play store it should do the trick", "time": "28th July 2017, 06:02 AM", "postID": "post73200281", "replies": []}, {"text": "Hi\nUsed intégrate blue filter", "time": "1st November 2017, 05:54 AM", "postID": "post74365578", "replies": []}]}, {"title": "Call quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s8+/review/call-quality-t3645740"], "threads": []}, {"title": "WiFi strength, range, and throughput", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s8+/review/wifi-strength-range-throughput-t3645741"], "threads": [{"text": "I find that there is no buffering, good wifi signal all over my house. Home router is a big part of that.", "time": "26th July 2017, 04:13 PM", "postID": "post73181098", "replies": []}, {"text": "This is the worst part of the phone byfar. Wifi extend much further than it did on my Nexus 6 but it extends it so far that my connection could be at 50k and remain connected.  This causes the connection to appear stalled but really it is just buffering. \n\nI have turned on WiFi switching and then advanced WiFi switching but both options are subpar.  They almost never like the strength of my wifi signal.", "time": "1st October 2017, 06:29 PM", "postID": "post74000065", "replies": []}, {"text": "good wifi signal all over my house", "time": "2nd October 2017, 08:32 PM", "postID": "post74013109", "replies": []}, {"text": "im at the edge of the garden, some 100m away and still getting good WiFi netflix without buffering on an older linksys E3200", "time": "3rd October 2017, 01:10 AM", "postID": "post74015159", "replies": []}, {"text": "i get enough lag that playing online MOBA's on wifi is awful.", "time": "3rd October 2017, 05:46 PM", "postID": "post74023362", "replies": [{"text": "That might be because of your network? I'm playing Arena of Valor another MOBA and I have no lag at all with a constant 60fps gameplay", "time": "3rd October 2017, 10:47 PM", "postID": "post74026340", "replies": []}]}]}, {"title": "Cellular strength and throughput", "rating": 4.0, "links": ["https://forum.xda-developers.com/galaxy-s8+/review/cellular-strength-throughput-t3645742", "https://forum.xda-developers.com/galaxy-s8+/review/cellular-strength-throughput-t3645742/page2"], "threads": [{"text": "I get a low 4g signal at work whereas on my s7 edge I didn't get anything", "time": "26th July 2017, 10:22 AM", "postID": "post73177323", "replies": []}, {"text": "Mine is a lot better than any phone I've had before.   Usually at home on all my other phones I have 1-2 bars and on the S8+ I have at least 4 bars.", "time": "26th July 2017, 12:55 PM", "postID": "post73178897", "replies": []}, {"text": "Bars are no indication of true signal strength. My S8+ doesn't get nearly as strong of a signal as my Pixel XL. I drop signal a lot more often now. I was rather disappointed with the performance of the cell radio actually.", "time": "26th July 2017, 01:58 PM", "postID": "post73179558", "replies": []}, {"text": "For me, the signal is about the same at home. But at work, the S8+ performs much better than the Note5 that I had... Must be an extra band or something. The Note5 would hang on to an unusable LTE signal or drop to 3G/1x inside my job. The S8+ stays on on LTE with a usable signal.", "time": "26th July 2017, 03:28 PM", "postID": "post73180583", "replies": []}, {"text": "It's worst Then S8 as I used that before shifting to S8 plus. But download speed is great.", "time": "26th July 2017, 07:15 PM", "postID": "post73183219", "replies": []}, {"text": "My S7 was better.  The S7 ised a new duel antenna tech, I am not sure the S8 used it or not.", "time": "26th July 2017, 08:18 PM", "postID": "post73183895", "replies": []}, {"text": "My AT&T Note 4 and my new S8+ get about the same signal, which is really disappointing", "time": "27th July 2017, 01:28 AM", "postID": "post73186269", "replies": []}, {"text": "I generally see around 5-8dbm better then I did with my pixel xl at home..notice the s8+ does drop signal little easier tho then my pixel in fringe areas", "time": "27th July 2017, 04:46 AM", "postID": "post73187339", "replies": []}, {"text": "Tested right outside my house.  Never had these speeds on my Note 5.", "time": "23rd August 2017, 09:56 AM", "postID": "post73507419", "replies": []}, {"text": "Comming from a S6, the signals and speeds are far better, also my s6 was missing a few bands so never ever got speeds like this on my Jio 4G Network in India", "time": "23rd August 2017, 11:19 AM", "postID": "post73508272", "replies": []}, {"text": "At work on LTE Im getting 31 Mbps down and 6 Mbps up.  Not bad!  Faster than our company wifi!", "time": "25th August 2017, 02:33 PM", "postID": "post73536178", "replies": [{"text": "I used to get 54Mbps which WAS faster than the company wifi. Then we bumped up to 500Mb.", "time": "25th August 2017, 07:45 PM", "postID": "post73539875", "replies": []}]}]}, {"title": "Speakerphone (loudness, clarity)", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s8+/review/speakerphone-loudness-clarity-t3645743", "https://forum.xda-developers.com/galaxy-s8+/review/speakerphone-loudness-clarity-t3645743/page2"], "threads": [{"text": "Much better than tbe S7E.", "time": "27th July 2017, 07:56 AM", "postID": "post73188613", "replies": []}, {"text": "See gsmarena review on loudspeaker", "time": "7th October 2017, 09:28 AM", "postID": "post74065894", "replies": []}, {"text": "The sound seems perfect", "time": "16th December 2017, 07:21 PM", "postID": "post74868656", "replies": []}, {"text": "It's the best and clearest speakerphone I have used. I even use it in my car in preference over the factory hands-free.", "time": "4th January 2018, 01:12 AM", "postID": "post75067954", "replies": []}, {"text": "Played music using my S8 Active (assuming they are alike) next to iPhone X, the loud speaker of the iPhone X was way better.", "time": "11th January 2018, 02:54 AM", "postID": "post75155382", "replies": []}, {"text": "Can't say is perfect. As ex user, of htc phones with boomsound, this speaker sounds like a joke to me, sorry but I had to say it. I also read that, the speaker is shitty and will continue to be with the next flagships because it's hard to make good speaker with water resistance. So we have to deal with it. Also depends how you hold the phone, for example when I play games I don't have any sound because of the way I hold the phone hand is always on the speaker and I can't hear a single sound.", "time": "14th January 2018, 08:14 PM", "postID": "post75199149", "replies": []}, {"text": "My iPhone 6 had better sound. S8 sounds small and tinny. \n\r\nTry these settings and tell me if you like them more. Volume is decreased but sound quality is miles better in my opinion.", "time": "26th January 2018, 11:39 AM", "postID": "post75338748", "replies": []}, {"text": "any idea what is the RMS rating of the speakers? will the S9 be better?", "time": "28th January 2018, 07:18 AM", "postID": "post75358006", "replies": []}, {"text": "i don't think its very loud at all", "time": "29th January 2018, 09:24 PM", "postID": "post75377206", "replies": []}, {"text": "Hey guys! Does anybody get any crackles or rattling at max volume when listening to a podcast or when using the speaker during a call?", "time": "31st January 2018, 11:18 AM", "postID": "post75395279", "replies": [{"text": "Yes i have same issue my laud speaker sounds crackle when i listen to ws vns, or watching youtube videos were people are talking.", "time": "12th March 2018, 03:06 AM", "postID": "post75857314", "replies": []}]}, {"text": "awesome work", "time": "1st February 2018, 12:51 AM", "postID": "post75403019", "replies": []}, {"text": "My experience with the speaker is different contrary to what most people on YouTube says. My S8+ sounds pretty audible even in relatively crowded places, sometimes I even had to lower the volume. Clarity is acceptable too. But it's not the best speaker by any means, just isn't as bad as what people says. Mine's Exynos variant.", "time": "2nd February 2018, 12:13 PM", "postID": "post75420253", "replies": []}, {"text": "Hii", "time": "4th February 2018, 06:00 AM", "postID": "post75440030", "replies": []}, {"text": "Thanks!", "time": "5th February 2018, 02:51 PM", "postID": "post75455681", "replies": []}, {"text": "My speaker seems clear but I do prefer the stereo speakers on s9", "time": "24th February 2018, 10:50 PM", "postID": "post75683398", "replies": []}]}]