[{"title": "Overall love", "rating": 5.0, "links": ["https://forum.xda-developers.com/nexus-6p/review/overall-love-t3239495", "https://forum.xda-developers.com/nexus-6p/review/overall-love-t3239495/page2", "https://forum.xda-developers.com/nexus-6p/review/overall-love-t3239495/page3", "https://forum.xda-developers.com/nexus-6p/review/overall-love-t3239495/page33"], "threads": [{"text": "This is the best Android phone I've ever used.", "time": "5th November 2015, 05:18 PM", "postID": "post63673309", "replies": []}, {"text": "Yeah, it's pretty close to the best Android phone I've ever used. It is the full package: battery life, performance, camera, software. Only problem I'm finding is that after a week of use, I'm running into bugs with the camera, Bluetooth, and calls. I'm sure these will be fixed in an upcoming software update.", "time": "6th November 2015, 01:58 PM", "postID": "post63688018", "replies": []}, {"text": "Best phone I've owned.  I just enjoy picking it up and using it.", "time": "6th November 2015, 02:20 PM", "postID": "post63688346", "replies": []}, {"text": "IMO its a 9 out of 10. Camera has been great for me, battery life fits my daily usage perfectly (never been in power saving mode) and I only charge over night. Bright screen with no color issues to my eyes, fast performance with all the apps and games I use.  \n\nMost of my problems are simply due to me not adjusting to the placement of things on the phone yet. I have a tendency to power the phone off when trying to adjust the volume, and lowering the volume when playing certain games. \n\nThe only true \"issue\" I am having is the phone has powered off and rebooted on me 3 times since I got it. I don't know if it is going to be an issue, but it is annoying when it happens in the middle of a task I am trying to complete.", "time": "6th November 2015, 04:44 PM", "postID": "post63690594", "replies": []}, {"text": "Best phone i have owned and have not rooted it yet even", "time": "7th November 2015, 12:20 AM", "postID": "post63697027", "replies": []}, {"text": "Best phone I have ever used", "time": "9th November 2015, 02:52 PM", "postID": "post63738744", "replies": []}, {"text": "I consider it more of a desktop phone.  I now really use it for so much more than a phone.  And the battery life over my Nexus 5 is not even comparable.", "time": "9th November 2015, 07:23 PM", "postID": "post63741905", "replies": []}, {"text": "Easily the best phone I've ever used. A week in and not a single issue yet.", "time": "9th November 2015, 07:49 PM", "postID": "post63742295", "replies": []}, {"text": "Best phone to date! Extremely satisfied.", "time": "10th November 2015, 12:22 AM", "postID": "post63745725", "replies": []}, {"text": "Fantastic phone.  My first Stock Android experience.  I actually like it as-is (coming from a Note II with Nova Launcher).", "time": "10th November 2015, 06:56 PM", "postID": "post63758594", "replies": []}, {"text": "Nexus 6p owner coming from Nexus 5, Nexus 4, Galaxy Nexus, yadeya...\n\nThe good:\nHardware: Really nice, premium build. If I'm being honest, I find it a touch slippy in the hand and I'm quite worried about dropping the damn thing, but I'm hoping a case will make this better...once it arrives!\nPerformance: Excellent. Zero lag, zero slow down.\nBattery: Coming from the Nexus 5, it's really good. This was actually my primary reason for buying this over the Nexus 5x - bigger phone == more room for battery, and so far this shows. Today has been a light-use day, to be fair, but still sat at 76% at 8pm is just awesome. My Nexus 5 wouldn't do that well even if I didn't use it all day...in flight mode...switched off. Exceptionally happy here.\nStability: Have had the phone for 7 days, uptime: 7 days. Nuff said.\nCamera: Too early to say, but I don't think it's quite as great as everyone says it is. There's still no way in the app to do manual control (e.g. shutter priority for capturing pictures of fast moving objects) so the results still look, well, like they've been taken with a phone. That's not to say it's bad - it's certainly better than the Nexus 5, which was leagues better than the Nexus 4 - it's just...average. Give us some manual control, Google! Lens Blur still takes great shots and it's very responsive, so I would give it a B at the moment, with scope for more in future.\n\nThe only elephant in the room is the size. OK, so this isn't the phone's fault and I knew what I was getting, but don't kid yourself that it's anything other than a big phone. I picked up my old N5 the other day and, frankly, it still feels the \"right\" size for a phone. Oh well, I guess we'll have to see how things go here...\n\nOver all, it's a great phone", "time": "10th November 2015, 08:12 PM", "postID": "post63759770", "replies": []}, {"text": "I ordered the phone yesterday and got it about 3pm today. I set it up, played with it for about an hour and thought \" this isn't so special\". I threw it back in the box and decided I wasn't decided on keeping it. I left it at my mom's house, went home and played around on my Note 5 for 10 mins and ran back to the Nexus. \nThe title was supposed to say unboxed not unbound", "time": "11th November 2015, 01:30 AM", "postID": "post63763651", "replies": []}, {"text": "Easily the best Android phone I've ever used. The combination of battery life, performance, screen quality, build quality, Camera, quick charge, Verizon compatibility, stock Android, hackability, Marshmallow features, speakers, quick fingerprint sensor, first-to-get-updates and just a general smooth experience, make this phone a TOTAL WIN. \n\nOnly wish it had SD card expansion! That's like the only thing, to me, it's missing. \n\nI am REALLY LOVING this phone experience! It's FANTASTIC. Instant recommendation to friends.", "time": "11th November 2015, 01:43 PM", "postID": "post63771074", "replies": []}, {"text": "Loved my nexus 5, but the 6p is awesome, just got to resist the urge to unlock and flash !", "time": "12th November 2015, 05:50 PM", "postID": "post63792264", "replies": []}, {"text": "I've been with the Nexus line since the Nexus S and only strayed once last year buying a Moto X 2014. A week later I returned it and got the Nexus 6 instead. The 6P is the Heir Apparent of the Nexus project. I love it. \n\nIt took me three tries to get here though. #1 a few cosmetic defects out of the box. #2 perfect but then i bought the folio case and it got stuck on the phone. #3 perfect again. Happy camper...", "time": "12th November 2015, 09:07 PM", "postID": "post63795313", "replies": []}, {"text": "One or two teething problems but the best phone I have ever had, great to have an all aluminium phone too instead of Samsung plastic. 10/10", "time": "12th November 2015, 11:08 PM", "postID": "post63796953", "replies": []}, {"text": "I'm actually coming from the Nexus 6 and had no real intentions to upgrade, but..things.  It sort of feels small to me, which is odd to say.  It doesn't have any downsides that I can see yet, outside of me having to buy a couple extra cords for work, etc.  On the other hand you don't need to charge it much.  It has the best panel I've ever owned, a factor which actually had me thinking about buying a Note 5 earlier before I remembered I was on Verizon and used Touchwiz before.  Somehow they got a comparable screen on a Nexus phone which I consider to be no small thing.  Great phone, well done Google.", "time": "13th November 2015, 12:51 AM", "postID": "post63797998", "replies": []}, {"text": "in love with the phone. very happy with the purchase and it has everything I need. Now all i need to do is find a wife and I am set.", "time": "13th November 2015, 04:39 AM", "postID": "post63800172", "replies": []}, {"text": "Haven't found anything not to love yet.", "time": "13th November 2015, 06:26 PM", "postID": "post63809852", "replies": []}, {"text": "Really loving this phone!", "time": "13th November 2015, 08:33 PM", "postID": "post63811534", "replies": []}, {"text": "Best Android phone to date.", "time": "15th November 2015, 03:15 AM", "postID": "post63830141", "replies": []}, {"text": "Loving this phone! My first pure Android phone, amazing camera, and amazing value.", "time": "16th November 2015, 03:52 PM", "postID": "post63855859", "replies": []}, {"text": "It is a touch too big...but other than that, the user experience is among the best I have ever had", "time": "16th November 2015, 07:21 PM", "postID": "post63859259", "replies": []}, {"text": "I have loved everything so far especially the fingerprint scanner which is very snappy, but I just discovered that they are using different specifications from the Nexus 6 (where I came from) for the headphone jack that means all of my current buds cannot control playback.  I'm hoping a software update will fix that, but if not I'm going to have to start using different headphones and that sucks.", "time": "16th November 2015, 09:27 PM", "postID": "post63861186", "replies": []}, {"text": "The hardware is great for the most part. I'm taking a star away because the noise cancelling mic makes speakerphone unusable, and the fact that the thing is so HUGE.", "time": "16th November 2015, 09:54 PM", "postID": "post63861556", "replies": []}, {"text": "best phone I have ever had.", "time": "18th November 2015, 08:49 PM", "postID": "post63895923", "replies": []}, {"text": "Best of the best!", "time": "19th November 2015, 05:58 AM", "postID": "post63901596", "replies": []}, {"text": "Love it so far. I'm coming from a 1st gen Moto G (and a Nexus 4 prior to that) so as you can imagine it's a quantum leap upward.\n\nFor the first time ever I feel no desire to unlock and root. With the Moto I lasted half a day.", "time": "19th November 2015, 05:05 PM", "postID": "post63909327", "replies": []}, {"text": "it's the best phone i've ever used", "time": "24th November 2015, 02:53 AM", "postID": "post63980092", "replies": []}, {"text": "I currently own a Note 4. Would any of you say this is with upgrading to considering my phone isn't even a year old? I'm running Resurrection Remix", "time": "24th November 2015, 04:34 AM", "postID": "post63980961", "replies": []}, {"text": "Works like a charm even after two years. It's a much cheaper pixel, minus probably the camera!", "time": "11th November 2017, 07:42 AM", "postID": "post74476222", "replies": []}, {"text": "Mine was less than two years old and my battery started to shut off around 50 percent so I replaced it and dinged up my back cover because its in there good I would say be prepared to change the battery on this phone its unavoidable but it does fix it.", "time": "30th November 2017, 03:34 AM", "postID": "post74685651", "replies": [{"text": "School me  Is the \"blod\" caused by battery issues? \r\nI don't feel like spending $800 for a new phone and would rather get a \"pre owned\"  6P - change battery & do what ever else may be necessary right away and roll on", "time": "2nd December 2017, 11:16 AM", "postID": "post74710061", "replies": [{"text": "No, replacing the battery will only fix early shutdown/ degraded battery issues.  6Ps with BLOD have been recovered but it requires using just 4 cores which obviously limits performance.", "time": "2nd December 2017, 05:07 PM", "postID": "post74713270", "replies": []}]}]}, {"text": "someone said pone heat?i want to buy this so", "time": "18th January 2018, 04:22 PM", "postID": "post75246741", "replies": [{"text": "Is this a question?  This is a thread to review how much you like the device. Questions should be asked in the Q and A section.", "time": "18th January 2018, 04:29 PM", "postID": "post75246815", "replies": []}]}, {"text": "I did some quick research and took a dive in with a second hand 64Gb model.  Found out about the bootloop of death and poor battery later.  Still work with my Nexus 7 2012 3G and N7 2013 LTE.  They're still serviceable \nwith custom ROM's.  Took a trial with a Blu Studio G Plus and got it rooted with one of the \"commercial\" mods I think King Root or something like that.   Am afraid to do a custom ROM as no one can find stock ROMS that are \neasily accessible for BLU stuff I can trust.  It was a $49.00 phone so no big deal.  Still works.  The Nexus stuff is straight forward to root and that's why I went with the 6P.  Don't know if I would have bought it if I was aware \nabout the \"issues\" that that's o.k.\n\nWell after upgrading adb on my Linux laptop (the old Ubuntu stock adb didn't have fastboot) , I got the boatloader unlocked and rooted..  Then stuck the 8.1.0 OPM 5.17-xxxx latest in and it works fine. Rooted with Magisk. Well that was simple.  Am doing a battery run and seeing how it performs.  I haven't had any issues yet and do like it.  Am prepared to deal with the bootloop but I guess the new stock ROM probably has that addressed.  It's nice and I take pride in seeing how well some of the old hardware performs with updated ROMs.  Sheesh the N7 2012 3G is a little slow at loading up XSDL/GnuRoot and the linux program Xastir but once it gets going, it's pretty decent.  The N7 2013's do a bit better with speed even though they are old.\n\nOnce I do some run tests I'll determine whether or not the battery needs a changeout.  Am like others that I don't want to lay out big $$$$$$ that the purveyors of this \"heroin-ware\" engineer to be disposable once something gives out.\n(ie. an involved battery swap out on the 6P)  I've swapped batteries out on my other Nexus tablets with little difficulty but the 6p is a little more involved.  I'll probably get new case hardware in the event I ding it up bad.)  Kurt", "time": "1st February 2018, 02:09 AM", "postID": "post75403468", "replies": []}]}, {"title": "Community development strength", "rating": 4.5, "links": ["https://forum.xda-developers.com/nexus-6p/review/community-development-strength-t3239496", "https://forum.xda-developers.com/nexus-6p/review/community-development-strength-t3239496/page2", "https://forum.xda-developers.com/nexus-6p/review/community-development-strength-t3239496/page3"], "threads": [{"text": "Just starting with little choice but still about a week into the release so not bad so far. Can't wait for another month or so", "time": "7th November 2015, 12:21 AM", "postID": "post63697040", "replies": []}, {"text": "Quicker than almost any other!", "time": "13th November 2015, 08:34 PM", "postID": "post63811543", "replies": [{"text": "Thank you for your comment on the Nexus 6P. We are happy to hear that you consider the Nexus 6P quick! (SP)", "time": "13th October 2016, 10:00 PM", "postID": "post69117678", "replies": []}]}, {"text": "Well, this is a Nexus device, need i say more?", "time": "13th November 2015, 08:37 PM", "postID": "post63811584", "replies": []}, {"text": "There are starting to be more and more, but even at the start we had two or three of the communities best. Very very nice.", "time": "18th November 2015, 08:58 PM", "postID": "post63896067", "replies": [{"text": "This.", "time": "25th November 2015, 09:52 PM", "postID": "post64010009", "replies": []}]}, {"text": "I had an LG G2 and was fully functional. I bought this Nexus 6P and the glassholes put me back into beta status by blocking HDMI-out. Try to go to a friend's house and watch a movie with them that you have on your phone. A complete ****e shyter move on the part of Google. Much more than \"a little bit ****y.\" This has nothing to do with Chromecast. The phone needs to be sold with a Justin Beiber sticker on it, because it is made for pubescent girls (hang in there girls, it has got to get better).", "time": "25th November 2015, 06:38 PM", "postID": "post64007307", "replies": []}, {"text": "Ok", "time": "4th January 2016, 11:10 AM", "postID": "post64634431", "replies": []}, {"text": "It's not that \"healthy\" for the following reason:\na. the device is just almost 4 months old\nb. not all dev's afford the device (but the price is better thank other)\nc. too many optimization and changes needed for some ROMs", "time": "4th January 2016, 10:43 PM", "postID": "post64644512", "replies": [{"text": "That's right to have better view in this subject we should wait a little bit.", "time": "5th January 2016, 01:41 PM", "postID": "post64653709", "replies": []}]}, {"text": "It's amazing compared to samsung devices etc", "time": "5th January 2016, 05:03 PM", "postID": "post64657038", "replies": []}, {"text": "I don't know about you guys but I'm VERY pleased with the performance of stock 6.0.1 and stock kernal. For tweaks and mods, Xposed is utilized. Haven't though about flashing a different ROM since I got the phone two weeks ago. I'm sure that'll change here shortly though lol", "time": "8th January 2016, 10:09 PM", "postID": "post64711818", "replies": [{"text": "Lol on my first day with this phone ive tried every rom haha. I'm back to stock with custom kernel.it flies", "time": "9th January 2016, 08:52 AM", "postID": "post64716991", "replies": []}]}, {"text": "I'm using Cataclysm with Franco kernel, but thought of going stock + franco + Xposed to give me some of the things Cataclysm has. \n\nNot sure.....", "time": "10th January 2016, 09:01 AM", "postID": "post64732394", "replies": []}, {"text": "its starting to blossom tho its too early to tell", "time": "14th February 2016, 01:34 PM", "postID": "post65320201", "replies": []}, {"text": "Thx to all developers, I tried the stock firmware for about a week, then I tried PureNexus with ElementalX kernel, really amazing.", "time": "10th July 2016, 05:49 PM", "postID": "post67685493", "replies": []}, {"text": "Loving every minute with this device.", "time": "14th August 2016, 11:17 AM", "postID": "post68181702", "replies": [{"text": "me too, best Android phone I've had", "time": "18th August 2016, 10:14 PM", "postID": "post68253379", "replies": []}]}, {"text": "That was actually the main criteria that made me buy this device, which didn't have the best perf/price ratio.\nAnd now I'm not seeing so much skilled devs or ROM for the device so that's actually scaring me a bit. Could be due to holidays or because N was released but not all of its sour ce code.\nFor all the rest (incl. stock ROM..) I'm very pleased.", "time": "30th August 2016, 06:30 PM", "postID": "post68448027", "replies": [{"text": "What ? there are tonnes of well known dev's supporting the 6P, the thing is people just don't crack flash as much as they used to and with the decline of CM and Paranoid and the rise of Xposed there is little reason to flash or build fully tricked out roms.", "time": "5th September 2016, 09:13 AM", "postID": "post68535759", "replies": [{"text": "Nevermind, he's french, always complaining, that's what french people do ! :P (Humour hein)", "time": "5th September 2016, 03:05 PM", "postID": "post68540003", "replies": []}]}]}, {"text": "This is one of the best phones I have ever owned.  I am definitely a power user and my only real complaint is the lower battery life than I would like.  Then again the only phone to ever satisfy me was a droid turbo with a 2 day battery life.  So all things considered this is a wonderful choice for a power user.  \r\nThe community is wonderful, definitely one of the best.  But I do miss the days of my Galaxy Nexus when I had access to multiple different OS's like putting Ubuntu, Palm, Ubuntu Touch, and stuff like that.  It was never functional but the community had a lot of options even if you just wanted to try them for a day.  By contrast most of the great stuff here is Stock or based on Stock.  And thats wonderful don't get me wrong, they do great work I just miss the flashoholic rush I used to get.\n\r\ntl;dr Great phone for power user.  Highly rated community.  Maybe consider waiting to at least see what the next Nexus (Pixel) phone will be like first, allegedly releasing on October 5th.", "time": "6th September 2016, 11:30 PM", "postID": "post68563411", "replies": []}, {"text": "Devs please keep making 6P a great phone! Don't forget us like Google did", "time": "15th October 2016, 12:52 AM", "postID": "post69134586", "replies": []}]}, {"title": "Overall speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/nexus-6p/review/overall-speed-t3239497", "https://forum.xda-developers.com/nexus-6p/review/overall-speed-t3239497/page2", "https://forum.xda-developers.com/nexus-6p/review/overall-speed-t3239497/page3", "https://forum.xda-developers.com/nexus-6p/review/overall-speed-t3239497/page6"], "threads": [{"text": "Nice info , it used for me .", "time": "13th November 2015, 05:25 PM", "postID": "post63808997", "replies": [{"text": "I don't get it", "time": "13th November 2015, 05:27 PM", "postID": "post63809036", "replies": []}, {"text": "What do you mean - Justin Bieber", "time": "15th November 2015, 05:23 AM", "postID": "post63831322", "replies": []}, {"text": "WHAT !?! - Lil John", "time": "22nd November 2015, 08:44 AM", "postID": "post63950020", "replies": []}]}, {"text": "I don't get it either, but I will say this phone is one of the fastest I've ever used in day to day usage.  I came from a Galaxy S6 128gb and this device is a constant smooth experience.  Jank and constant app reloads is what killed the S6 for me.\n\nHangouts is responsive and smooth... I think that says it all.", "time": "13th November 2015, 07:25 PM", "postID": "post63810622", "replies": []}, {"text": "Faster than the OnePlus2, which has the same processor and more RAM... Not near as laggy.", "time": "13th November 2015, 08:35 PM", "postID": "post63811553", "replies": []}, {"text": "No lags, no hiccups, just pure unadulterated speed.", "time": "15th November 2015, 03:15 AM", "postID": "post63830146", "replies": []}, {"text": "fast for me. faster than the tears when watchin a nicholas sparks movie.", "time": "15th November 2015, 06:06 AM", "postID": "post63831691", "replies": []}, {"text": "This phone flies. \n\r\nGranted im coming from a galaxy S3, but still, this phone is awesome", "time": "15th November 2015, 10:57 PM", "postID": "post63844672", "replies": []}, {"text": "Yeah I've had absolutely 0 times where this phone has hung/frozen/janked/Etc. \n\nThink that's all I need to say really. Also, multitasking works great and apps don't constantly have to refresh. Benchmarks are completely pointless and it amazes me that people still think they're important on smartphones. Especially when the Samsung phones all blow this out the water with their crazy antutu scores, yet people still claim this phone is faster and less often freezes up or hangs.", "time": "16th November 2015, 01:24 AM", "postID": "post63846207", "replies": []}, {"text": "It is very fast, it does clock down when hot, but that is a good thing.", "time": "18th November 2015, 08:49 PM", "postID": "post63895933", "replies": []}, {"text": "In normal usage the heat is low and the phone flies but even only somewhat intensive games definitely heat up the phone faster and the framerate suffers.", "time": "19th November 2015, 02:32 AM", "postID": "post63899724", "replies": []}, {"text": "the phone feels fast as hell after it boots up, but after awhile when you start opening up a bunch of stuff and its still in ur task manager.. things start slowing down a lot", "time": "19th November 2015, 02:54 AM", "postID": "post63899874", "replies": []}, {"text": "The phone is fast, but it is not without some issues.\nIn particular, I have some bluetooth issues - the phone randomly disconnects from my car's BT, and only a reboot would fix it.\nI used Nexus 5, Moto X 2nd gen, and Moto X Pure previously in the same car, and had no issues.\nHoping it is software related, and the \"fix\" is on the way.\nBTW, tried two Nexus 6P's and the same results with BT", "time": "23rd November 2015, 04:23 PM", "postID": "post63972340", "replies": []}, {"text": "My first Nexus phone and I might never switch from the Nexus line going forward. I've had it for almost a month now (received mine Oct 27th) and I still haven't had one hiccup or stutter. This phone is a champ and prob the most consistent performing phone I've had to date..", "time": "23rd November 2015, 04:35 PM", "postID": "post63972561", "replies": []}, {"text": "can't get any faster currently", "time": "24th November 2015, 02:54 AM", "postID": "post63980098", "replies": [{"text": "Yes it can", "time": "26th November 2015, 05:02 AM", "postID": "post64013956", "replies": []}]}, {"text": "Nothing to add, fastest device I had so far. Very snappy, no lags.", "time": "24th November 2015, 09:12 PM", "postID": "post63993162", "replies": []}, {"text": "Boot and shutdown is a little slower than others, say GS6, but everything else is perfect. Doesnt skip a beat.\n\nFirst phone that didnt stutter when you swipe left to Google now in the launcher (just checked it out before I switched to Nova, lol).", "time": "24th November 2015, 09:18 PM", "postID": "post63993268", "replies": []}, {"text": "fast enough for me", "time": "25th November 2015, 03:29 AM", "postID": "post63997048", "replies": []}, {"text": "The phone has bee super snappy for the most part.  I can't believe how much better it is when compared to my Galaxy S6 Edge.  However, I do find some oddities when using the power-save mode.  hen in power-save mode (that is when my battery hits 10%) if I open a new link in Chrome the page renders, but I am unable to scroll for up to 10 seconds.  Also, the phone app gets funky in power-save.", "time": "25th November 2015, 05:49 PM", "postID": "post64006552", "replies": []}, {"text": "This is the fastest phone I have ever owned. Coming from a GS5 it is screaming fast. \nAll phones seem fast at first, then start crawling for some unknown reason. Random lagging, etc.\n\nThis phone has been consistently fast and I love it.", "time": "25th November 2015, 05:56 PM", "postID": "post64006665", "replies": []}, {"text": "The phone is blazing fast. It hands down one of the most powerful phones in the market right now. No lag with heavy gaming with GTA and Asphalt 8 even with lots of apps open. Obviously if you have a ridiculous amount of apps open the phone will slow down a little but as long as you close apps you aren't using its all good. As a daily driver, this phone is blazing fast.", "time": "26th November 2015, 06:59 PM", "postID": "post64023337", "replies": []}, {"text": "Nice info , it used for me .", "time": "27th November 2015, 08:35 AM", "postID": "post64030720", "replies": [{"text": "What do you mean - Justin Bieber", "time": "28th November 2015, 10:44 PM", "postID": "post64055084", "replies": []}]}, {"text": "Looking forward to getting this phone after using my iPhone 5S which gets frame drops pulling down the search bar on the homescreen.", "time": "29th November 2015, 05:50 AM", "postID": "post64058730", "replies": []}, {"text": "Probably the speediest phone I've ever used, so far at least", "time": "2nd December 2015, 03:16 PM", "postID": "post64113167", "replies": []}, {"text": "I think its one of the best smartphone which comes up with Android operating system and free from any issues like heat, switch off and hanging etc.", "time": "4th December 2015, 10:05 AM", "postID": "post64142038", "replies": []}, {"text": "Mines coming today! Can't freaking wait. Loved my nexus 6 but cracked screen.", "time": "4th December 2015, 12:48 PM", "postID": "post64143894", "replies": []}, {"text": "Thanks for the info!", "time": "17th December 2015, 02:18 PM", "postID": "post64359789", "replies": []}, {"text": "Running stock android and the phone does not lag or stutter, multitasking is good and performance is stable", "time": "30th June 2016, 01:15 PM", "postID": "post67545806", "replies": []}, {"text": "I've switched my S6 for a 6P and even though the phone is a bit too big for my hands, the smoothness of the 6P beats the s#@t out of a S6. \nThe 6p is at least super responsive and the finger print scanner is way faster and more accurate then the S6.", "time": "2nd July 2016, 07:02 PM", "postID": "post67576649", "replies": []}, {"text": "it just buttery smooth... I love it", "time": "20th July 2016, 05:02 PM", "postID": "post67830348", "replies": []}, {"text": "Literally zero stalls yet (6 months use)", "time": "18th August 2016, 10:10 PM", "postID": "post68253327", "replies": [{"text": "Possibly I have a lemon then?\n\r\nI get frequent stalls - not just the desktop stuttering between pages but actual apps locking. In the last two weeks I have had the phone reboot twice - just using it normally, the phone locked with screen on and no buttons swiping did anything then it rebooted. Once in youtube and another time reading a website. I often have trouble loading the camera, it takes ages or just doesnt load at all and ends up at the desktop again. I have the 64gb version and its still got over 17gb free so space shouldnt be an issue. I dont see this phone being buttery smooth at all. I see it lag, stutter and fail to load apps often. It also has frequent miss-touch results where I hit a key on the keyboard or the dock and it displays the wrong letter or a letter that is the long press version of it even after I barely touch the screen in a quick tap. \n\r\nI have not done a complete reset since getting official nougat but I also dont see why I should have to do that either. Android is more than mature enough as an OS to not require the user to do factory resets on updates or at least google should do them as part of the update if its required. \n\r\nAnyway - just wanted to ask if anyone else has seen the phone have stutter / camera / app mistouch issues?\n\n---------- Post added at 08:03 AM ---------- Previous post was at 08:01 AM ----------\n\nmostly its fine - but camera app frequently has issues loading and the phone can have very laggy periods as well. I wouldnt call this buttery smooth - but this could be an issue with my unit.", "time": "4th January 2017, 07:03 AM", "postID": "post70385173", "replies": []}]}]}, {"title": "App launch speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/nexus-6p/review/app-launch-speed-t3239498", "https://forum.xda-developers.com/nexus-6p/review/app-launch-speed-t3239498/page2"], "threads": [{"text": "Not as fast here versus the Note5, but very top notch. Apps launch super quick", "time": "3rd November 2015, 01:06 AM", "postID": "post63625339", "replies": []}, {"text": "Seems on-par or better than other flagship devices.", "time": "13th November 2015, 08:36 PM", "postID": "post63811568", "replies": []}, {"text": "For me apps are launching very quickly. So I would say app launch speed is excellent.", "time": "18th November 2015, 06:16 PM", "postID": "post63893660", "replies": []}, {"text": "top notch speed here. I noticed the camera is way faster on custom builds.", "time": "18th November 2015, 07:59 PM", "postID": "post63895175", "replies": []}, {"text": "top notch speed as well. all good", "time": "19th November 2015, 03:20 PM", "postID": "post63907767", "replies": []}, {"text": "Yeah it has a top notch speed, seems a pretty good phone.", "time": "14th December 2015, 10:33 AM", "postID": "post64306290", "replies": []}, {"text": "Even Google Hangouts launches quickly", "time": "14th December 2015, 12:14 PM", "postID": "post64307443", "replies": []}, {"text": "wow looks great speedy phone \nmy mate 8 is extreamly fast but no custom  roms haha \nshould i replace with nexus 6p?", "time": "10th February 2016, 02:23 AM", "postID": "post65243241", "replies": [{"text": "Actually I am interested in Mate8 because of its biiiiiiiger screen and best Soc at this moment, but I really care about the stock Android haha so little bit confuse, now holding N6 and feeling pretty good...", "time": "12th February 2016, 04:52 AM", "postID": "post65280977", "replies": []}]}, {"text": "BUTTER", "time": "1st April 2016, 02:02 PM", "postID": "post66143926", "replies": []}, {"text": "I just unlock Dev options and turn down the animation speeds as much as you want for a snappier response time.", "time": "30th August 2016, 04:12 PM", "postID": "post68445834", "replies": []}, {"text": "I wish that game developers would optimize games for Android like they do for iOS.  Take Angry Birds 2 and Deer Hunter 2016 for instance, those 2 games open lightning fast on iOS, but on the 6p, there's a noticeable delay when it's loading for the first time.", "time": "27th October 2016, 01:47 PM", "postID": "post69332678", "replies": []}, {"text": "Upgrading to 7.x Android N will make a difference. The Just-In-Time compiler optimises app code and minimises delay. \n\nApps are claimed to install / load 75% faster.", "time": "29th October 2016, 11:07 AM", "postID": "post69360077", "replies": [{"text": "I'm already running Nougat and the iPhone still smokes the 6p and the Pixel at opening games.", "time": "29th October 2016, 04:07 PM", "postID": "post69363435", "replies": [{"text": "We're not having the iPhone or the iOS ecosystem in subject here.", "time": "29th October 2016, 05:43 PM", "postID": "post69364768", "replies": []}]}]}, {"text": "Extremely satisfied with the app launch speed of my 6P. Apps launch very quickly and in app performance is top notch. Phone restarts offer significant boost in performance if you haven't restarted it for a month or 2. It's still not noticeable in daily use.", "time": "12th May 2017, 11:01 AM", "postID": "post72264236", "replies": []}]}, {"title": "Multitasking/RAM", "rating": 5.0, "links": ["https://forum.xda-developers.com/nexus-6p/review/multitasking-ram-t3239499", "https://forum.xda-developers.com/nexus-6p/review/multitasking-ram-t3239499/page2"], "threads": [{"text": "Does a really nice job at holding apps in RAM. Like if I open Recents right now, I can go back like 9 apps before they have to reload.", "time": "3rd November 2015, 01:09 AM", "postID": "post63625365", "replies": []}, {"text": "Some apps not optimized for 6.0 have froze, although, I have yet to have a crash notification.", "time": "18th November 2015, 12:29 AM", "postID": "post63881369", "replies": [{"text": "Newbie question here.. where is \"recents\" located as all of my open apps are under the  square icon and they scroll but I do not see recents ?", "time": "19th November 2015, 04:48 PM", "postID": "post63909088", "replies": [{"text": "that is the recents menu...", "time": "20th November 2015, 01:57 AM", "postID": "post63915696", "replies": []}]}, {"text": "Messenger, the Google SMS app, crashes out on me with a \"Messenger Cannot Start\" error from multitask view. Kinda bonkers that Google has not yet optimized their own app.", "time": "20th November 2015, 05:29 AM", "postID": "post63917396", "replies": []}]}, {"text": "resuming apps from multitasking screen is good and doesn't take too long to resume recently closed apps. However if you go back to the start of app stack and try to resume any app that you closed out a few hours ago, it starts over. So RAM handling is in action here. But for a quick back and forth jumping between recently closed apps, Nexus 6p is doing a great job and there is no slight jitter or lag in resuming apps.", "time": "18th November 2015, 06:19 PM", "postID": "post63893697", "replies": []}, {"text": "What's everyone's average Android OS memory usage?  I'm seeing on average over 1 day Android OS is  taking up 728 MB.  Next up is FB at 132 MB... is this a memory leak or is this normal for the 6P?", "time": "19th November 2015, 07:21 PM", "postID": "post63911280", "replies": [{"text": "This is normal, the OS will take as much memory as possible for things like caching etc. No point having all that memory not to use it.\n\n2.2 GB roughly after a few days, seems to hover there.", "time": "20th November 2015, 02:49 PM", "postID": "post63923166", "replies": []}]}, {"text": "Very fast memory ram. Apps launch in a while", "time": "7th December 2015, 10:49 AM", "postID": "post64186490", "replies": []}, {"text": "Best multitasking speed I've had on a phone so far", "time": "4th January 2016, 08:18 PM", "postID": "post64642432", "replies": []}, {"text": "nice", "time": "6th February 2016, 02:30 PM", "postID": "post65180735", "replies": []}, {"text": "can someone please provide a screenshot for ram usage", "time": "10th February 2016, 10:47 AM", "postID": "post65248057", "replies": []}, {"text": "I don't need dual-window so the multi-tasking and RAM management is great for how I use my phone.", "time": "6th March 2016, 07:27 PM", "postID": "post65688470", "replies": []}, {"text": "Apps stay in memory for a long time unless explicitly closed. This is nice as the apps launch nice and fast", "time": "18th August 2016, 10:44 PM", "postID": "post68253746", "replies": []}]}, {"title": "Scrolling smoothness", "rating": 5.0, "links": ["https://forum.xda-developers.com/nexus-6p/review/scrolling-smoothness-t3239500", "https://forum.xda-developers.com/nexus-6p/review/scrolling-smoothness-t3239500/page2", "https://forum.xda-developers.com/nexus-6p/review/scrolling-smoothness-t3239500/page3"], "threads": [{"text": "Butter. Just butter. Maybe melted butter.", "time": "3rd November 2015, 01:09 AM", "postID": "post63625376", "replies": []}, {"text": "Very smooth scrolling.", "time": "6th November 2015, 05:26 PM", "postID": "post63691286", "replies": []}, {"text": "Extremely smooth especially compared to the old Note 4 I used", "time": "7th November 2015, 12:23 AM", "postID": "post63697057", "replies": []}, {"text": "It took three years but now Project Butter is here. This thing is smooth. Usually with AMOLED screens there's some ghosting and trailing of text when scrolling on a black background. It looks pretty choppy and I find this super annoying about the Note 4. The 6P doesn't have this problem. Scrolling looks buttery smooth even on an AMOLED black background.  \n\n\nI'll never leave Nexus with its, now, flagship competing camera.", "time": "7th November 2015, 10:08 AM", "postID": "post63701754", "replies": []}, {"text": "Smoothest phone I've used to date.", "time": "13th November 2015, 08:35 PM", "postID": "post63811560", "replies": []}, {"text": "just one word: Excellent", "time": "18th November 2015, 06:15 PM", "postID": "post63893647", "replies": []}, {"text": "Never had a phone as smooth as this", "time": "19th November 2015, 01:53 AM", "postID": "post63899387", "replies": []}, {"text": "I compared it side by side to a Samsung Galaxy 6 and the 6P was noticeably slower to me than the Galaxy 6.", "time": "26th November 2015, 06:53 AM", "postID": "post64014882", "replies": [{"text": "Time to go to the eye doctor.", "time": "15th May 2016, 07:42 PM", "postID": "post66866608", "replies": []}]}, {"text": "Way smoother than I am at kissing girls, hence the article reading", "time": "14th December 2015, 09:53 PM", "postID": "post64316377", "replies": []}, {"text": "Smoothest scrolling I've seen on an Android phone so far", "time": "4th January 2016, 08:18 PM", "postID": "post64642438", "replies": []}, {"text": "Very smooth scrolling! Definitely outclasses the Zenfone 2 which I had attributed to having some of the smoothest scrolling I'd seen on an Android device beforehand.", "time": "9th January 2016, 08:38 AM", "postID": "post64716859", "replies": []}, {"text": "superrr butery smoooth!", "time": "11th January 2016, 02:09 AM", "postID": "post64745407", "replies": []}, {"text": "Awesome, the smooth is beyond godness", "time": "11th January 2016, 04:48 AM", "postID": "post64746681", "replies": []}, {"text": "This telephone is really really smooth. The best on in my opinion, about that.", "time": "13th January 2016, 11:10 AM", "postID": "post64784517", "replies": []}, {"text": "Just a little smoother than my Nexus 4 that it replaced... Awesome... I am amazed that my Z3 compact behaves as if it has terrets in comparison to both (which is 2 years newer than my nexus 4).", "time": "13th January 2016, 10:30 PM", "postID": "post64794229", "replies": []}, {"text": "It's okay.", "time": "19th January 2016, 12:40 AM", "postID": "post64873652", "replies": []}, {"text": "Smoothest device I've used so far, only catch is when entering developer settings - can take a second or two to respond. Other than that, everything is awesome.", "time": "19th January 2016, 08:14 PM", "postID": "post64887066", "replies": []}, {"text": "Hmm glad to see such good feedback on the scrolling smoothness. I bought a note 5 and was very disappointed. So glad to see positive reviews.", "time": "12th February 2016, 08:21 PM", "postID": "post65293130", "replies": [{"text": "Any problem about note 5 smoothness? I had a note 4 and it was smooth, but not as Nexus 6p. I've never seen a smoother phone than 6p. It's extremely smooth.\n\nEnviado de meu Nexus 6P usando Tapatalk", "time": "18th April 2016, 04:55 PM", "postID": "post66427151", "replies": []}]}, {"text": "This phone is lag free, scrolling is awesome.", "time": "20th July 2016, 08:24 PM", "postID": "post67833203", "replies": []}, {"text": "The only problem that I faced is open android authority website using chrome... very bad experience.", "time": "24th July 2016, 01:08 PM", "postID": "post67882296", "replies": []}, {"text": "Not as smooth and responsive as OnePlus 1 running CyanogenOS 13.1. (and N6P has worse battery life too)\r\nIf it not because of IMX377 & HDR+, I would not swap.", "time": "28th July 2016, 11:25 PM", "postID": "post67947711", "replies": []}, {"text": "Coming from a Galaxy Note 3 with cm12.1 rom, I didn't expect such an amazing scrolling phone, really amazing.", "time": "29th July 2016, 06:44 PM", "postID": "post67958566", "replies": []}, {"text": "Definitely smoother than my Xperia Z and my friends Iphone 6, if that counts \n\nScrolling depends on the app though. Well, the homogeneity of the content. If it's a mix of content it'll just lag sometimes as it lazyloads/streams from your flow. That particular item is all about server bandwidth to your ISP.\n\nBut I wish Google would hw accelerate scrolling and put in motion blur cos you do it all day long on mobile, it's all you do really. Would be a killer feature for the one who does it first \n\nEdit: That, or black frame insertion on twice Hz display are the two options that reduce blurriness of what you scroll by. But as I said, the magic of smoothness of a random online feed is all about caches, intelligent preload, server farms. The OS itself can scroll a screen smoothly in software without effort.", "time": "5th August 2016, 11:00 PM", "postID": "post68061180", "replies": []}, {"text": "It is very smooth, no lag during the animations", "time": "7th August 2016, 03:36 AM", "postID": "post68075522", "replies": []}, {"text": "very smooth once the its loaded. I find the list of apps takes a bit to open but once its open it scrolls very smoothly. Longer web pages scroll nicely too, but I have noticed that it does depend a little on your internet speed. Generally its very good, occasional stutters on the desktop.", "time": "5th January 2017, 03:27 AM", "postID": "post70399336", "replies": []}, {"text": "It's funny.  This is really the ONLY reason I prefer Nexus over Samsung.  I don't really mind Touchwiz, and I like Samsung hardware.  But I can't STAND the choppy scrolling on the Samsung phones.  It drives me up the wall.  Why haven't they figured this out yet?", "time": "8th January 2017, 03:37 PM", "postID": "post70455851", "replies": []}]}, {"title": "Heat", "rating": 4.0, "links": ["https://forum.xda-developers.com/nexus-6p/review/heat-t3239501", "https://forum.xda-developers.com/nexus-6p/review/heat-t3239501/page2", "https://forum.xda-developers.com/nexus-6p/review/heat-t3239501/page3", "https://forum.xda-developers.com/nexus-6p/review/heat-t3239501/page11"], "threads": [{"text": "I think the large size of the 6P helps to dissipate heat. Seldom does the phone warm up except when doing a lot of video, and even then it's warm, not hot.", "time": "6th November 2015, 01:59 PM", "postID": "post63688035", "replies": []}, {"text": "Actually doesn't get that hot.  only twice it got warm. initial set up and once in my car on a warmer than average day.", "time": "6th November 2015, 02:21 PM", "postID": "post63688365", "replies": []}, {"text": "Find it no better or worse than other phones i have owned", "time": "7th November 2015, 12:23 AM", "postID": "post63697064", "replies": []}, {"text": "Have not noticed any overheating in the least bit.", "time": "16th November 2015, 09:54 PM", "postID": "post63861563", "replies": []}, {"text": "It can get warm but hardly hot like Samsung phones.", "time": "18th November 2015, 12:28 AM", "postID": "post63881349", "replies": [{"text": "i had the note 4 was overheating so much that i cant hold it", "time": "30th November 2015, 11:57 PM", "postID": "post64087607", "replies": []}]}, {"text": "I haven't been able to get my phone to top 38C.  The only way it hit that was after about half hour of continued gaming use, which I don't think is hot.", "time": "18th November 2015, 12:56 PM", "postID": "post63888611", "replies": []}, {"text": "I don't have any real world temperature readings but it seems to get uncomfortably warm to hold against your ear when you are on a call for a long time. Plus playing games or watching videos ramps up the temperature quickly.", "time": "18th November 2015, 06:07 PM", "postID": "post63893494", "replies": []}, {"text": "In normal usage the heat is low and the phone flies but even only somewhat intensive games definitely heat up the phone faster and the framerate suffers.", "time": "19th November 2015, 02:31 AM", "postID": "post63899721", "replies": []}, {"text": "Phone does warm up on not so intensive tasks. A bright screen would do this. It's definitely not what I'd describe as 'hot' ala my Z3. However... I believe the phone throttles the performance quite a lot when it gets warm.", "time": "19th November 2015, 04:52 AM", "postID": "post63901030", "replies": []}, {"text": "Exactly the same than other phones i have owned", "time": "24th November 2015, 03:37 PM", "postID": "post63988026", "replies": []}, {"text": "interesting how people have diferent opinions. \n\nthis phone gets HOT, not if its sitting on the table and if ur facebooking, but use the camera for 10-15min straight, or navigation in a car, or skype, it gets hot that I cant put it on my face afterwards. \nBut same **** happens with Note5 as well, they are just very powerfull devices. \n\nBut saying it doesnt get hot is a straight forward LIE.", "time": "24th November 2015, 03:56 PM", "postID": "post63988327", "replies": []}, {"text": "The 6P only got quite hot during initial setup.", "time": "24th November 2015, 09:11 PM", "postID": "post63993144", "replies": []}, {"text": "similar heat with other s810 machine for mine", "time": "25th November 2015, 04:04 AM", "postID": "post63997357", "replies": [{"text": "Or any other... My gs1 used to get really hot.... So did my g2x which was the first dual core phone.... I have yet to see this phone get as hot to the touch as those", "time": "25th November 2015, 05:17 PM", "postID": "post64006072", "replies": []}]}, {"text": "It does get a tad warm, but nothing compared to my S4 which was literally hot", "time": "1st December 2015, 04:35 PM", "postID": "post64097760", "replies": []}, {"text": "It's normal.", "time": "7th December 2015, 12:00 PM", "postID": "post64187317", "replies": []}, {"text": "The nexus 6p has surprised me. My initial thoughts when i first setup my device was this device gets hot. It's almost been almost a month and I've got to say this device is just like any other device. I still believe the nexus 6p does a better job of heat dissipation than other smartphones", "time": "7th December 2015, 02:44 PM", "postID": "post64189297", "replies": []}, {"text": "My 6P never really goes over 40 degrees Celsius.", "time": "7th December 2015, 07:01 PM", "postID": "post64193507", "replies": []}, {"text": "Same. Never above 40, I've had it for a couple of weeks now and it does get a bit warmer than it used to but they all do with age. Certainly better than my S6. Especially with warmer weather (Its summer here currently), even extended browsing heats it up. And stock Android is just so smooth and light, even if it does get underclocked you will never notice it unless you play a game. \n\nA good trick (if you can afford to) is to lower the brightness. Either way, the device is impressive- I thought the 810 would cook it.", "time": "9th December 2015, 09:13 AM", "postID": "post64222048", "replies": []}, {"text": "Yes mine just gets warm not hot... After playing Asphalt 8 or vidz for an hour+.", "time": "9th December 2015, 06:50 PM", "postID": "post64230545", "replies": []}, {"text": "It actually got pretty hot when I did my initial installation (unlocking, waiting for app to load and rooting).  That settles down after ward.", "time": "11th December 2015, 06:06 PM", "postID": "post64264821", "replies": []}, {"text": "Just a warning, I used the Nexus 6P in a viewmaster VR headset for about 15 minutes and it was extremely hot when I took it out. Just something to be mindful about, as this thing can get uncomfortably hot running graphic intensive apps", "time": "11th December 2015, 09:08 PM", "postID": "post64267316", "replies": []}, {"text": "Mine gets warm but only with heavy usage.", "time": "19th December 2015, 09:19 AM", "postID": "post64387983", "replies": []}, {"text": "There's a reason why most people say that their phones don't get overly hot, especially when it's not rooted, custom kernel, etc., and the reason is because of thermal throttling. If your phone temp gets to say 42C, it takes a number of cores offline and reduce the clock speed. Hit 45C, it shuts down another core and reduce more clock speed, so on and so forth.\n\nSo, does the Nexus 6P generate a lot of heat? Most definitely.", "time": "30th December 2015, 04:37 PM", "postID": "post64563355", "replies": []}, {"text": "I'm on day 2 with my 6p, stock with no root (yet.) Only time my phone got noticeably warm was during the initial setup and downloading/installing a bunch of apps from the play store.", "time": "2nd January 2016, 12:23 AM", "postID": "post64598041", "replies": []}, {"text": "It definitely gets warm and sometimes fairly quickly when using the camera for awhile but it never lasts too long. I'll put it down for a couple minutes and back to normal", "time": "2nd January 2016, 09:55 AM", "postID": "post64602508", "replies": []}, {"text": "My device ist quite cool and doesn´t heat up. My Nexus 5 ( 2013 ) used to be a heater and even with a modified cooling system, it´s still quite hot in comparison. The Nexus 6P has a better thermal design and the Aluminum Case seems to help a lot.", "time": "2nd January 2016, 12:46 PM", "postID": "post64604193", "replies": []}, {"text": "mine heat up to 43c is it overheating?", "time": "3rd January 2016, 09:16 AM", "postID": "post64617164", "replies": []}, {"text": "The thermal compound Huawei used was junk. That contributed to the overheating and resulting blod. After years of use that thermal compound is definitely not transferring heat well at all. If you're comfortable removing the main board and shield to replace it you would see much less thermal throttling and extend the life of the phone. There's a thread about replacing it on here. As time goes on and the compound dries out more and more, replacing it becomes a really good idea.", "time": "1st March 2018, 12:25 AM", "postID": "post75730840", "replies": []}]}, {"title": "Low light", "rating": 4.5, "links": ["https://forum.xda-developers.com/nexus-6p/review/low-light-t3239502", "https://forum.xda-developers.com/nexus-6p/review/low-light-t3239502/page2", "https://forum.xda-developers.com/nexus-6p/review/low-light-t3239502/page3", "https://forum.xda-developers.com/nexus-6p/review/low-light-t3239502/page5"], "threads": [{"text": "Almost can't tell the difference when using the flash or not (in a good way). Surprisingly impressed!", "time": "13th November 2015, 08:37 PM", "postID": "post63811585", "replies": []}, {"text": "Comparable to my iPhone 6 Plus. Colors are more saturated like a Samsung but overall great camera.", "time": "15th November 2015, 03:16 AM", "postID": "post63830161", "replies": [{"text": "I beg to differ. I have just sold my iPhone 6s Plus (for a 6P) since the picture quality for low light it's a HUGE mess. The lack of details, smearing and poor noise reduction is maddening!", "time": "13th January 2016, 09:01 AM", "postID": "post64783224", "replies": [{"text": "Agree with that. Iphone 6S is not very good with low light condition.", "time": "13th January 2016, 11:12 AM", "postID": "post64784541", "replies": []}]}]}, {"text": "I had a birthday party I went to today and it was in a low light situation. The HDR+ photos came out very good to me.", "time": "15th November 2015, 06:24 AM", "postID": "post63831852", "replies": []}, {"text": "Where my Note 4 camera failed to perform in very low light conditions, the nexus 6p impressed!", "time": "16th November 2015, 03:43 AM", "postID": "post63847493", "replies": []}, {"text": "Compared to my HTC M8, which took okay lowlight pictures, the 6P blows it out of the water. And with more detail obviously!", "time": "17th November 2015, 01:38 AM", "postID": "post63864163", "replies": []}, {"text": "Amazing what the larger pixals do. Took a picture in some pretty low light. And the image processing combined with the larger pixals. Made the picture not only brighter but crisper.", "time": "17th November 2015, 01:54 AM", "postID": "post63864333", "replies": []}, {"text": "Great camera! Still not quite as good as this year's Samsungs but overall very nice", "time": "17th November 2015, 01:56 AM", "postID": "post63864357", "replies": []}, {"text": "In low light conditions, I paired it against Oneplus One and LG G2 (with Xcamera). Even though the resulting images came out with pretty much the same brightness level of images, Nexus 6P however produced greater details as compared to other photos from other phones. So I would say camera on Nexus 6p is good.", "time": "18th November 2015, 06:10 PM", "postID": "post63893540", "replies": []}, {"text": "works very well", "time": "18th November 2015, 08:50 PM", "postID": "post63895941", "replies": []}, {"text": "https://www.flickr.com/gp/132923107@N08/f979N0\n\nlow light shots are amazing on this camera. Look at this one I took the other night. You can see so much details, amazing for a smartphone.", "time": "4th December 2015, 04:08 PM", "postID": "post64146720", "replies": []}, {"text": "Great low light performance, no flash just HDR and captured clouds almost clearer than my eye could! I do like this camera....", "time": "4th December 2015, 06:49 PM", "postID": "post64148861", "replies": [{"text": "kinda looks like you're watching someone from the bushes lol", "time": "6th December 2015, 07:35 AM", "postID": "post64170745", "replies": []}]}, {"text": "", "time": "4th December 2015, 07:25 PM", "postID": "post64149433", "replies": []}, {"text": "This camera is crazy good, it saw more than I could in the dark haha", "time": "5th December 2015, 06:39 PM", "postID": "post64163501", "replies": []}, {"text": "I also used to have an m8 and I thought that camera took the best low light photos of all time....until this phone. The low light resolution is amazing!", "time": "18th December 2015, 06:42 AM", "postID": "post64371099", "replies": []}, {"text": "Absolutely LOVE this camera.", "time": "23rd December 2015, 09:01 PM", "postID": "post64459307", "replies": []}, {"text": "overall quality is much better than note5 or iphone 6 in low light condition", "time": "24th December 2015, 09:29 PM", "postID": "post64475894", "replies": []}, {"text": "", "time": "25th December 2015, 06:41 AM", "postID": "post64480090", "replies": []}, {"text": "Noise clearly visible, even at reduced resolution (the forum automatically resized the JPG file to 3 megapixels). But HDR is pretty good. Also good job on the white balance: getting the bright red light imaged correctly is probably a major challenge for many cameras. Comes out very true-to-life on this shot.", "time": "28th December 2015, 11:32 AM", "postID": "post64525907", "replies": []}, {"text": "i think these are pretty good..i have noticed that ISO increasing too high almost 1200-1400 but pics still seem pretty clear.I think bigger pixels really work great..", "time": "30th December 2015, 06:12 PM", "postID": "post64564948", "replies": []}, {"text": "Compared to s6 edge the 6p holds up very good in low light situations, a bit more noise in darker areas though.", "time": "30th December 2015, 11:43 PM", "postID": "post64569411", "replies": []}, {"text": "Snappy Camera, but lack OIS.", "time": "1st January 2016, 05:06 PM", "postID": "post64593015", "replies": []}, {"text": "Took this picture of my office in the pitch black, as I was walking past.  Shot in the hand, no particular care taken.  Really pleased with the Nexus 6P's quality of output:", "time": "5th January 2016, 08:14 PM", "postID": "post64660060", "replies": []}, {"text": "Does anyone notice that low light WITHOUT HDR+ is actually meh? In Anandtech's 5X review, you can see the non-HDR images being worse than the iPhone 6S. However HDR+ does an INSANE job of noise cleanup. I don't even think the iPhone's HDR does much noise cleanup, but Google's HDR+ uses a lot of CPU power for cleanup.", "time": "6th January 2016, 07:32 PM", "postID": "post64677258", "replies": []}, {"text": "Workes good, but I wonder whether I can adjust the definition? it's low light so looks somber.", "time": "7th January 2016, 06:08 AM", "postID": "post64683907", "replies": []}, {"text": "I find the LG G4 is a bit better in low light, but the Nexus 6P is still a good low-light shooter", "time": "11th January 2016, 07:43 AM", "postID": "post64748156", "replies": []}, {"text": "This camera never fails to impress me! No flash, and if you zoom in on the moon you can even see the dark side of it  (view image with full screen brightness)", "time": "14th January 2016, 07:39 PM", "postID": "post64808104", "replies": []}, {"text": "Hdr+ is pro\nWith and without diferences", "time": "21st May 2016, 08:52 PM", "postID": "post66962795", "replies": []}]}, {"title": "Photo quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/nexus-6p/review/photo-quality-t3239503", "https://forum.xda-developers.com/nexus-6p/review/photo-quality-t3239503/page2", "https://forum.xda-developers.com/nexus-6p/review/photo-quality-t3239503/page3", "https://forum.xda-developers.com/nexus-6p/review/photo-quality-t3239503/page18"], "threads": [{"text": "One of the best mobile cameras. Color saturation, ease of focusing, and HDR is all excellent.", "time": "3rd November 2015, 01:29 AM", "postID": "post63625589", "replies": []}, {"text": "Surprisingly very good! The Moto X Pure was good, but this has crisper images. The OnePlus2 was OK, but the images were \"smudgy\" in the background.", "time": "13th November 2015, 08:38 PM", "postID": "post63811601", "replies": []}, {"text": "The nexus 6p takes great pictures. I love it and the double power button push to open camera really does work and its quick.", "time": "13th November 2015, 09:28 PM", "postID": "post63812207", "replies": []}, {"text": "Great so far, nice upgrade from the stock S5 camera. Low light images look better and apps like ProShot giving us manual controls can be quite handy.", "time": "13th November 2015, 10:41 PM", "postID": "post63813017", "replies": []}, {"text": "The video is very crisp too!", "time": "14th November 2015, 05:10 AM", "postID": "post63816148", "replies": []}, {"text": "To be honest it's not bad at all. It's up there for sure but for sure not no1. Happy with mine", "time": "14th November 2015, 12:06 PM", "postID": "post63819444", "replies": []}, {"text": "I guess since I came back to the Nexus line from the S6, I have to say I'm disappointed.  My expectations weren't too high though, so I'm not overly disappointed.  I got used to, and liked the S6's 16X9 pics.  I like how they filled up the S6's display.  I'm trying to get used to the N6P's 4X3 pics.  I can positively say that low-light pics are nowhere near as good as Google would have one believe they'd be.  Period. As long as the lighting is good, the pics will be as well.\n\nOf course, a lesser camera is still worth coming back to the Nexus.  So overall I'm happy.", "time": "14th November 2015, 03:21 PM", "postID": "post63821823", "replies": [{"text": "I have to agree with you. I had the S6 and I loved the form factor and the camera. I hated the S6 because my wife would always use my phone for photos. She actually used more of my photo storage than I did. I thought the 6p camera was suppose to be on party with the S6 . I have to say some photos of the photos are good but with the S6 I never had a bad photo. \n\nI just hated that the S6 updates would take forever. I know that with Verizon, Marshmallow will not be available until March/April 2016. I went with the 6p cause I could keep Verizon and will always get timely updates. Also I didn't want to have to worry about rooting a phone for it to be functional.", "time": "21st November 2015, 01:15 AM", "postID": "post63931084", "replies": []}, {"text": "#this\n\r\nI'm gonna get the 6P tomorrow as I just got sick of the S6 and its security/bloat. I'll miss the camera for sure. Hopefully we'll get the 16:9 native through a future software update.", "time": "22nd November 2015, 12:47 PM", "postID": "post63952564", "replies": [{"text": "I'm would not say that I'm made with my decision to get the 6p. Just a little jealous because the S6 had a great camera and size. Everything else is wrong with the phone.", "time": "22nd November 2015, 07:12 PM", "postID": "post63958280", "replies": [{"text": "Got the 6P today, yes I know there is a 16:9 ratio but it goes down to 8.3 megapixels. Either way, the images are still good enough to view on a computer and very comparable to the S6. Just took a few quick shots via touch focus. I've attached both 4:3 and 16:9, as well as a quick shot off my Galaxy S6 as well for comparison (last pic with warmer tones).", "time": "23rd November 2015, 03:36 AM", "postID": "post63963899", "replies": []}]}, {"text": "Don't you know that you can switch to 16:9 in the camera setting ? (but of course , you will lose some megapixels)", "time": "23rd November 2015, 02:29 AM", "postID": "post63963302", "replies": []}]}, {"text": "I'm with you on this.  I cam from a note 3 and I've been disappointed by the quality of the camera.  Trying to take pictures of my 19 month old son more often than not results in blurry images", "time": "6th December 2015, 06:33 PM", "postID": "post64176159", "replies": [{"text": "True. I tried turning off HDR+ for fast moving subjects. But switching between modes for point and shooting is a pain. My iPhone 6 used to take pictures without fail / blurriness.", "time": "6th December 2015, 08:24 PM", "postID": "post64177450", "replies": []}]}]}, {"text": "I'm blown away by the quality of the camera!", "time": "14th November 2015, 08:29 PM", "postID": "post63825869", "replies": []}, {"text": "Coming from an HTC one m8, the photo quality is amazing on the 6P. I'm not used to the amazing quality but I love it!", "time": "17th November 2015, 05:01 AM", "postID": "post63866313", "replies": []}, {"text": "I would prefer a Lumia, but since there is a lack of apps on Windows Mobile... 6P.", "time": "17th November 2015, 07:36 AM", "postID": "post63867779", "replies": []}, {"text": "Pictures seem very good., but the white balance when using the flash has a slight green tint compared to the 5X. I noticed this last night and was also mentioned in this article: http://pocketnow.com/2015/10/19/goog...5x-vs-6p-video\n\n\"If you’re really looking for a consistent difference here, maybe try to spot the green tint in a few of the 6P’s photos, which for some reason becomes more pronounced when using the flash.\"\n\nI've attached pictures for comparison. First image is with the 6P and the second is with the 5X. Hopefully this will get fixed in a future software update.", "time": "17th November 2015, 05:24 PM", "postID": "post63875450", "replies": []}, {"text": "In my testing I am seeing better indoor photos than outdoors in even lighting. Outdoor photos tend to produce darker images against bright backgrounds (sky). If I move the focus to the subject, it compensates the brightness for the subject but then sky is blown out. This is without using HDR+. With HDR+, photos are evenly lit but still on the darker side. Images,. however, are very sharp and capture excellent details. I have a Note 4 too. I would say that Note 4 has a better camera than Nexus 6P. So in my opinion Nexus 6P is good but not excellent.", "time": "18th November 2015, 06:14 PM", "postID": "post63893620", "replies": []}, {"text": "Coming from a Nexus 6 I'm loving the quality of this camera. However in HDR mode trying to take pictures of my children is pretty difficult. It's quite a bit slower in this mode", "time": "20th November 2015, 07:10 PM", "postID": "post63927100", "replies": []}, {"text": "By far the best camera, I thought the nexus 6 with HDR was good....this is just amazing on the 6P.\n\nHere's a picture I took lastnight.", "time": "23rd November 2015, 02:20 AM", "postID": "post63963214", "replies": [{"text": "the camera is good,", "time": "23rd November 2015, 02:40 AM", "postID": "post63963394", "replies": []}]}, {"text": "The photos come out blurry a lot. I noticed if I zoom in just a little after I take a blurry photo that the blurriness goes away for some reason though.", "time": "23rd November 2015, 02:48 AM", "postID": "post63963477", "replies": []}, {"text": "Heres a couple  took earlier   \n\n---------- Post added at 10:59 PM ---------- Previous post was at 10:56 PM ----------\n\nHere is a couple took tonight", "time": "27th November 2015, 10:59 PM", "postID": "post64040621", "replies": []}, {"text": "I'm impressed too with the Nexus 6P camera, I took some pics in low light and they were so amazing for a moment I felt like pics were taken by DSLR.\nI showed my friend the pic & he was like what DSLR camera did you used lol !!", "time": "28th November 2015, 01:00 AM", "postID": "post64041781", "replies": []}, {"text": "[QUOTE=kifac;63963214]By far the best camera, I thought the nexus 6 with HDR was good....this is just amazing on the 6P.\n\r\nHere's a picture I took lastnight. \n\n\r\nWow", "time": "30th November 2015, 05:56 PM", "postID": "post64083013", "replies": []}, {"text": "Those are some pretty bad quality shots. lol. I wouldn't buy the Nexus 6p for the camera. Maybe for the other great aspects of the phone. It's none the less a decent shooter.", "time": "1st December 2015, 12:52 PM", "postID": "post64094629", "replies": [{"text": "Really, you wouldn't buy it for the shooter?? This has one of the best cameras on a phone, period!\n\nhttps://goo.gl/photos/G8MeczWoghUHBqZXA", "time": "1st December 2015, 05:47 PM", "postID": "post64098811", "replies": []}]}, {"text": "Hi guys\n\r\nNoticed that on the 6p, the pixel were much lower if u choose 16:9\n\r\nWhich do u perfer to shoot with? 4:3 with more pixel, or 16:9 with less pixel?\n\r\nand why you do it?\n\r\nThanks.", "time": "5th December 2015, 12:21 PM", "postID": "post64158668", "replies": []}, {"text": "Google camera version 3.1.021, PureNexus 1121, 6P, of course. Panoramas suck. Panoramas on my old Note 3 were great in that horizons were always straight and horizontal and the image did not have any obvious-looking stitched-together places or double images. The Note 3 camera apparently assembled images continuously as the camera panned across the scene while the Google camera appears to take discrete shots at widely-spaced intervals and then does not do a very good job of assembling them.\n\r\nAm I doing something wrong? Is there a better camera for the 6P in terms of panoramas?", "time": "7th December 2015, 01:40 AM", "postID": "post64181318", "replies": []}, {"text": "Came from a Note 3 - comparatively this Nexus 6P is amazing.\n\n\r\nWife's iPone 7S takes amazing pictures, yet there's always some level of silent awe from her when we take the same photos with our respective cameras   Only time I feel iPhone truly succeeds is with the Portrait mode that uses both lenses and blurs the backdrops.  The closest I get to that effect is using Google's Lens Blur, which is also amazing but doesn't work well with children who refuse to stay still!  iPhone's motion picture stills are also really cool (Google's Motion Stills app needs to be integrated with stock camera imho!)\n\n\r\nI also have a Sony ICLE-QX1 - photos on the 6P are slightly oversaturated but that makes them look nicer.  Quality to the Sony is comparative.\n\r\nLow light photos are hit-n-miss - usually incredible.  MUCH better than the iPhone 7S, and almost as good as the QX1.\n\n\n\n\r\nDare I say it - even the front cam is great!", "time": "18th August 2017, 09:39 AM", "postID": "post73444179", "replies": []}, {"text": "2 years later and the 6P's camera still holds up to the new flagships. \n\nhttps://youtu.be/QwPOpXhkygo", "time": "19th August 2017, 06:11 AM", "postID": "post73454274", "replies": []}, {"text": "I have a Nexus P6 few months that I received from a cousin, who had it around 1-2 years. Following the recent upgrade camera, when accessing via computer, the browser does not display thumbnails of new photos. I can only see those previous ones. In addition, before the videos were among the pictures, but after this upgrade, created a new folder called: camera_session and inside the folder is a folder google.com. Now i have Thumbnails folder but it is empty. I was hoping that the new refresh program would fix the thing, but unfortunately, everything was the same. Occasionally, after persistent opening the browser, appears thumbnail of the first new image, but does not remain at the reopening. Is there a way to solve my problems?", "time": "8th October 2017, 09:19 AM", "postID": "post74077581", "replies": []}, {"text": "What's the camera speed difference between a Nexus 6 and Nexus 6P? Honestly, I think the Nexus 6 takes some pretty good pictures, but it's painfully slow at times (Pure Nexus BTW).  I'm thinking of picking up a 6P to get a fingerprint reader and a faster camera.", "time": "6th November 2017, 01:48 PM", "postID": "post74424608", "replies": []}, {"text": "How is this?", "time": "9th November 2017, 06:43 PM", "postID": "post74461432", "replies": [{"text": "I like it! \n\r\nPicked up a 6P from Swappa. looking forward to the upgrade from my N6.", "time": "10th November 2017, 04:49 PM", "postID": "post74470691", "replies": []}]}, {"text": "January 2018 and this phone'camera is still better than the one found in the S8 and the Op5T by a wide margin. Try and get the same consistency in the other new phones, wether taking photos of stills or portrait of a young kid, hdr+is really so good.", "time": "9th January 2018, 06:08 AM", "postID": "post75132266", "replies": []}, {"text": "Still the best. Im still loving it. We can go compare and compete with any smart phone even in 2k18 ones without Pixel 1 and 2.", "time": "31st January 2018, 03:13 AM", "postID": "post75391573", "replies": [{"text": "I agree with this on quality of a still image. But, I have kids.... this camera is still pretty slow in some cases. Moving shots could be better. For an older device though, it's still one of the better cameras.", "time": "1st February 2018, 03:37 PM", "postID": "post75410210", "replies": []}]}]}, {"title": "Video quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/nexus-6p/review/video-quality-t3239504", "https://forum.xda-developers.com/nexus-6p/review/video-quality-t3239504/page2", "https://forum.xda-developers.com/nexus-6p/review/video-quality-t3239504/page3"], "threads": [{"text": "Crisp, but lack of OIS makes for really choppy videos if you don't have a steady hand. The EIS helps a little but not much", "time": "3rd November 2015, 01:20 AM", "postID": "post63625470", "replies": []}, {"text": "The video image quality is great however, the lack of OIS really shows and audio quality when recording heavy bass is like nails to a chalkboard. Unfortunate for those who came from a Nexus 5 will have to endure another year of static bass audio.", "time": "9th November 2015, 06:19 AM", "postID": "post63732579", "replies": []}, {"text": "The video quality is not bad but i can see same strange lines when i record a video", "time": "11th November 2015, 04:27 PM", "postID": "post63773653", "replies": []}, {"text": "Does anyone's nexus make a noise when focusing almost like a low clicking? You really need to put your ear up to the camera to hear it, mine makes it and if I watch the video playback loud enough I also hear it.", "time": "11th November 2015, 08:28 PM", "postID": "post63777435", "replies": []}, {"text": "Well, video quality isn't so bad honestly.\n\nhttps://youtu.be/UwDMQgeRFeU\n\nThere's a cover of a song, and throughout the entire video - you can hear faint and constant clicking noises. The room where it was recorded is dead silent, so I'm not sure where it's coming from but it's annoying!", "time": "16th November 2015, 10:43 PM", "postID": "post63862162", "replies": [{"text": "sounds good but what is that clicking....are you saying you did this recording and you heard nothing of the sort with your human ear while recording it live?\n\nassuming you have a human ear??", "time": "18th November 2015, 08:07 PM", "postID": "post63895306", "replies": []}, {"text": "Am I correct in saying the audio is mono and cannot be recorded in stereo ? It was the same on the nexus 6 also.", "time": "26th December 2015, 09:27 AM", "postID": "post64495113", "replies": [{"text": "Unfortunately it is mono only again this year ! Who knows why especially with stereo front facing speakers !", "time": "5th January 2016, 09:52 AM", "postID": "post64650856", "replies": []}]}]}, {"text": "Video quality is excellent. However shooting at Higher frame rate (120 or 240) there is some pixelation on the screen even though resulting video doesn't show that. \nThere is one thing, if you are shooting slow motion video and go to review your video and then come back to camera, it defaults back to normal speed back. You have to select slow motion mode again everytime you exit  out of camera viewfinder screen.", "time": "18th November 2015, 06:21 PM", "postID": "post63893743", "replies": []}, {"text": "Did a test side by side next to a Z3 Compact, camera was MUCH better.", "time": "19th November 2015, 03:16 AM", "postID": "post63900094", "replies": []}, {"text": "digital stabilization is terrible, ur better off just turning it off. Its just to wobbly and unnatural. \nand I get a little bit of white noise on recordings, when recording in quiet areaa. \nbut I like the recording more then the Note5 that I have as well, note does shoot birhter videos, but softer and less contrast. Especially in lower light where note produces unrealistic images.", "time": "24th November 2015, 03:44 PM", "postID": "post63988132", "replies": []}, {"text": "Is there any app to view the video frame by frame similar to iPhone?", "time": "24th November 2015, 07:12 PM", "postID": "post63991479", "replies": []}, {"text": "Here's my video footage while driving in daytime.\n\nhttps://www.youtube.com/watch?v=gL_Ue1yCTt8\n\nTL;DW: HD 1080P with EIS (Electronic Image Stabilization) turned on.\nPhone is being held by RAM X-Grip car dash mount.\nI'm travelling from Eltham to Macleod (suburban Melbourne in Australia), a distance of 10km (6 miles).\nI'm doing 60-80 kph (37-50 mph).\nOutside temperature 20C (68F) - Southern hemisphere summer 2015-12-05\nNote: They drive on the left in Australia (like 35% of the world)\n\nEdit: Evening low light driving here\nhttps://www.youtube.com/watch?v=-Bpvb9HypHk", "time": "7th December 2015, 09:07 PM", "postID": "post64195494", "replies": []}, {"text": "may be not, did you check this thing on google?", "time": "8th December 2015, 07:53 AM", "postID": "post64202693", "replies": []}, {"text": "I need to install \"Open camera\" to record video frame by 60fps", "time": "5th January 2016, 06:20 AM", "postID": "post64649041", "replies": [{"text": "Does open camera shoot stable video?", "time": "19th January 2016, 09:55 PM", "postID": "post64888316", "replies": [{"text": "not stable.....\n\r\nfinally, i'm compromised to use the stock camera app forrecord the video with 30fps...", "time": "20th January 2016, 10:21 AM", "postID": "post64895224", "replies": []}]}]}, {"text": "Nice documentation peoples... Thanks to everyone.", "time": "6th January 2016, 02:16 AM", "postID": "post64664389", "replies": []}, {"text": "fablous", "time": "21st January 2016, 10:53 AM", "postID": "post64911242", "replies": []}, {"text": "To be honest it depends on the app. I've recently used qualcomm's Snap camera which was built into the CM13 builds, and it's brilliant. Packed with tonnes of feature settings and seems to have more optimised HDR capture!", "time": "21st January 2016, 11:56 AM", "postID": "post64911925", "replies": []}, {"text": "I carry both a Nexus 6p and iPhone 6S plus.\r\nIve dual cam videos (and phototographed) enough times to know that when it comes to anything related to recording videos or taking pictures i should always use the 6s plus.\n\r\nAlways overall better shots. ois colours and such.\n\r\nEverything else? Mostly i stick to the 6p - My mainline and no1 device.", "time": "30th January 2016, 10:55 PM", "postID": "post65065231", "replies": []}, {"text": "I used my 6P rather than a GoPro to capture a Slow Mo of an exploding laptop.  I'd say I was royally impressed.\n\nhttps://www.youtube.com/watch?v=IK8LFMWlIpU", "time": "9th February 2016, 04:07 PM", "postID": "post65234901", "replies": [{"text": "Can you adjust realtime ISO before or while recording?", "time": "5th April 2016, 11:07 PM", "postID": "post66213826", "replies": []}]}, {"text": "Lack of OIS really hurts in this area. Video is way to shaky. Even with EIS on in 1080p. I actually think it was better before I updated to the new camera app.", "time": "10th May 2016, 01:53 PM", "postID": "post66784906", "replies": []}, {"text": "I took this video at yesterdays Orbital ATK NASA QM-2 test of a solid fuel rocket motor in Promontory Utah. The video is in 4k with no zoom used.\nThe test site is 1.5 miles from our viewing area. It was insane when the shock wave sound hit us 7 seconds after the ignition of the rocket, there is no way you could talk to anyone during the test it was that loud!\n\nhttps://www.youtube.com/watch?v=-LGUQGsXXvo\n\nStats on rocket motor \nEach booster burns about 6 tons per second — generating 20 percent greater average thrust than the space shuttle booster. Each unit produces 3.6 million pounds of maximum thrust — greater than 14 four-engine Boeing 747s at full takeoff power. The booster has a standing height of 177 feet and During operation, the temperature of the booster motor chamber gasses reach 5,600 degrees Fahrenheit, a temperature hot enough to boil steel. The flame exits the motor at Mach 3 and burns for a full 126 seconds.", "time": "30th June 2016, 06:06 AM", "postID": "post67541970", "replies": []}, {"text": "Tonight I set my cellphone up on a tripod sitting on a rock on the side of Skyline drive which is a winding dirt mountain road. This is a two and a half hour time lapse condensed into a one minute video. You can view it on a big screen as the sun goes down you'll notice puffs of dirt clouds as people traverse the road (right side of video)during daylight. Then as sun sets the city's of Woods Cross, West Bountiful and Bountiful Utah light up and come to life. \nBe sure to select the Playback quality of 2160P as this is a 4K video.\nhttps://youtu.be/SaR8dJxUTbQ\n\nThe app Time lapse Pro was used.", "time": "28th August 2016, 08:03 AM", "postID": "post68406316", "replies": []}, {"text": "The absence of image stabilization is a bit of a drawback, however as I record a lot of live bands the ability of the microphone to do audio without being completely horrible (Nexus 5 was horrible recording live bands) is quite welcome.\nHere are a couple videos. The first was shot outside shortly before sunset, the second in a nightclub. The nightclub shot is more shaky (partially because I was juggling a beer along with the 6P)\nhttps://www.youtube.com/watch?v=R0kjbFYGf1g\nhttps://www.youtube.com/watch?v=FD23aPOJpZo\nhttps://www.youtube.com/watch?v=XjgEdorRuaE", "time": "29th September 2016, 08:28 PM", "postID": "post68915577", "replies": []}]}, {"title": "Selfie quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/nexus-6p/review/selfie-quality-t3239505"], "threads": [{"text": "I don't take many selfies, but this camera really shows how ugly i am.\nNo more for me!", "time": "6th November 2015, 11:36 PM", "postID": "post63696593", "replies": []}, {"text": "Snap chat camera could be better though but thats more snapchat software.", "time": "12th December 2015, 06:07 AM", "postID": "post64272080", "replies": [{"text": "I guess if you really needed to Casper is a good at fixing that.\n\r\nFor the vanilla experience, the stock camera app provides pretty good quality. Shame that you can't adjust, the exposure. But for the most part, I find the pictures to be really nice. There isn't much noise, especially when paired with HDR+.", "time": "12th February 2016, 05:46 PM", "postID": "post65290697", "replies": []}]}, {"text": "Amazing selfie quality. The detail is amazing, and the wide angle lens is great for with friends/snapchat", "time": "12th February 2016, 05:25 PM", "postID": "post65290345", "replies": []}, {"text": "The front cam is one of the best (or the best) ive ever seen.\n\nI dont take selfies, but the cam is impressive.", "time": "16th February 2016, 12:05 PM", "postID": "post65352301", "replies": []}, {"text": "...this is a thread?", "time": "16th February 2016, 06:51 PM", "postID": "post65358959", "replies": [{"text": "", "time": "17th September 2016, 02:15 PM", "postID": "post68731206", "replies": []}]}, {"text": "Every time I take a picture with the front camera it has lines going through the picture, any ideas?", "time": "16th September 2016, 05:33 AM", "postID": "post68710888", "replies": []}]}, {"title": "Time to take picture (camera launch speed)", "rating": 4.0, "links": ["https://forum.xda-developers.com/nexus-6p/review/time-to-picture-camera-launch-speed-t3239506", "https://forum.xda-developers.com/nexus-6p/review/time-to-picture-camera-launch-speed-t3239506/page2", "https://forum.xda-developers.com/nexus-6p/review/time-to-picture-camera-launch-speed-t3239506/page3", "https://forum.xda-developers.com/nexus-6p/review/time-to-picture-camera-launch-speed-t3239506/page4"], "threads": [{"text": "Usually really good if you double tap the power button, but the camera app is actually a bit slow.", "time": "3rd November 2015, 01:10 AM", "postID": "post63625387", "replies": []}, {"text": "HDR could be a bit faster.", "time": "6th November 2015, 02:23 PM", "postID": "post63688399", "replies": []}, {"text": "I've noticed sometimes I can double tap the power button and get the camera app up almost instantaneously, focus is instant and everything's great. Other times, it lags just a tad or messes up and shows the lock screen with (I presume the camera running in the background). But overall I'm very happy with it especially coming from the Nexus 5 where it took a good 15-30sec from launch to focus, shoot, and process.", "time": "6th November 2015, 04:40 PM", "postID": "post63690535", "replies": []}, {"text": "It's a billion times faster to launch, focus, take HDR, and process photos than my Nexus6 was.", "time": "6th November 2015, 06:00 PM", "postID": "post63691851", "replies": []}, {"text": "Normal mode is good. HDR mode is still slow.  Iphone still wins in the speed category.\n\nPicture quality is a toss up with the Nexus 6P having more color or pop to the picture, similar to Samsung. Iphone is more subdued colors and possibly more realistic.\n\n6P pictures are so much better than previous Nexus phones. I would guess that some software updates will address the speed.", "time": "7th November 2015, 12:25 AM", "postID": "post63697081", "replies": []}, {"text": "I vote it as Average. Way too often the camera takes a long time to open, and/or the shutter button to be active", "time": "10th November 2015, 05:57 PM", "postID": "post63757633", "replies": []}, {"text": "It's pretty quick and about on par I'd say with my iphone 6plus of hitting the home button and swiping up on the little camera icon on the bottom corner of the screen like how android has.  Seems like the actual photo taking procedure is about on par with my iphone as well.\n\r\nThe only thing I wish I could change (if anyone knows how) is to use a different camera app when I double tap power button or swipe up from the camera icon on the lock screen.  I prefer the proshot app as it seems to just snap faster pics than the stock app and when you're dealing with things like dogs or kids that won't sit still, that's huge.", "time": "10th November 2015, 08:55 PM", "postID": "post63760423", "replies": [{"text": "Oh, that's easy. Go into the details of the Google Camera app (you can get to it from App Info through Nova Launcher or go into Applications and tap on Camera. Then tap on Open by default, and then on Clear Defaults. Next time you double tap the power button, Android will ask you which Camera app you want to use to handle this action by default.", "time": "10th November 2015, 09:07 PM", "postID": "post63760598", "replies": [{"text": "AHHHHHHHHHHHHHHHHHHHH", "time": "10th November 2015, 09:14 PM", "postID": "post63760722", "replies": [{"text": "Thanks for the ProShot recommendation! I love Camera FV-5 but it's slow and kind of ugly, this is clean and quick. I think I found my new favorite camera app!\n\n---------- Post added at 01:30 PM ---------- Previous post was at 01:20 PM ----------\n\n\n\n\n\r\nUnfortunately, it looks like ProShot is missing the proper definitions for Android to see it as a Camera App that can be launched. Time to send some feedback:", "time": "10th November 2015, 09:30 PM", "postID": "post63760817", "replies": []}]}]}]}, {"text": "On par with others, but not any faster. The HTC One M8/M9 and Moto X Pure seemed slightly faster.", "time": "13th November 2015, 08:39 PM", "postID": "post63811620", "replies": []}, {"text": "I agree the double tap power button is pretty great after you get used to it but the camera would delay a bit sometimes( like 1-2sec)\n\nSince putting a custom rom and kernel I get absolutely no lag whatsoever. double click and by the time i have it up in picture taking stance its ready.", "time": "13th November 2015, 09:31 PM", "postID": "post63812240", "replies": []}, {"text": "Anyone else noticed the front facing camera pics are flipped??", "time": "18th November 2015, 08:01 AM", "postID": "post63885534", "replies": [{"text": "You mean when you take the photo the phone automatically flips it? If so, this is normal.", "time": "18th November 2015, 05:38 PM", "postID": "post63892997", "replies": []}]}, {"text": "Camera very often takes upwards of 5 seconds to load.", "time": "21st November 2015, 04:36 AM", "postID": "post63932737", "replies": []}, {"text": "Camera very cool for my", "time": "2nd December 2015, 11:21 AM", "postID": "post64110068", "replies": []}, {"text": "No doubt camera is really cool.", "time": "2nd December 2015, 11:56 AM", "postID": "post64110429", "replies": []}, {"text": "camera definitely better than my iPhone6s Plus but camera software slow especially camera launch speed.it would be if it was more quicker than now", "time": "30th December 2015, 08:41 PM", "postID": "post64567162", "replies": []}, {"text": "The shutter speed is great. I've known cameras to be slow (Samsungs, I'm looking at you) but this camera opens really fast and I'm able to snap a picture in a matter of seconds. <3", "time": "6th March 2016, 07:31 PM", "postID": "post65688532", "replies": []}, {"text": "Guys,\n\r\nI'm thinking of replacing my good old N5 with the 6P and camera (speed, in special) is really important for me. I really like the Nexus series but I've been missing countless oportunities of taking spontaneous photos with my N5, due to it's incredibly slow camera speed. The trauma is so huge that I'm actually considering buying the S7 or G5 instead of the 6P, despite hating those custom OS.\n\r\nHave you had any trouble taking spontaneous pics so far? Is it really fast or should I look elsewhere for my new phone? \n\r\nThanks in advance for any help!", "time": "1st April 2016, 06:52 PM", "postID": "post66148437", "replies": [{"text": "My camera launches in less than a second.\r\nWith HDR+ it takes 3 seconds per picture but without HDR on it it instantaneous. No complaints from my end.\n\r\nMy pictures are always a little shaky off but thats because I shake like a jack hammer.", "time": "3rd April 2016, 06:33 PM", "postID": "post66177228", "replies": [{"text": "Thanks for the reply!\n\r\nSo I guess if I set HDR off I should be fine taking pictures fast with my future N6P then. That's very good to know!", "time": "3rd April 2016, 06:42 PM", "postID": "post66177364", "replies": [{"text": "Yeah I just took those pictures to show you HDR+ on and off. On is with the visible contents outside the window. Off is the picture wheb the glass looks white.", "time": "3rd April 2016, 06:48 PM", "postID": "post66177453", "replies": []}]}]}]}, {"text": "Mine was not faster especially when HDR+ is on, and I still keep exploring the way to improve it. Any ideas?\nBTW, HDR+ processing always takes around 3 to 5 seconds to complete!", "time": "2nd October 2016, 09:27 AM", "postID": "post68947849", "replies": [{"text": "Yes,download trimmer from the playstore. Select all three and run it. Then take a picture.", "time": "2nd October 2016, 08:06 PM", "postID": "post68954980", "replies": [{"text": "I didn't root it yet. Is this required to install trimmer?", "time": "3rd October 2016, 03:07 AM", "postID": "post68958256", "replies": [{"text": "Yes.", "time": "3rd October 2016, 01:14 PM", "postID": "post68963093", "replies": [{"text": "Thanks buddy.\n\n---------- Post added at 03:01 AM ---------- Previous post was at 03:00 AM ----------\n\n\n\r\nVery detailed, appreciate!\n\n---------- Post added at 03:11 AM ---------- Previous post was at 03:01 AM ----------\n\nMy own practice:\n1. install security patches to the latest (Sep, 2016);\n2. disable camera permission to those un-needed apps;\n\nExcept HDR+ handling still takes few seconds, launch and shot work fine.", "time": "4th October 2016, 03:11 AM", "postID": "post68972182", "replies": []}]}, {"text": "Settings, storage, clear cache. Wait for it to update then reboot your phone and take another picture.", "time": "3rd October 2016, 05:36 PM", "postID": "post68966299", "replies": []}]}]}]}, {"text": "I'm not a 6P users yet(it's on the way), but on my N6, the stock google camera was fast to launch, but I found the One+ camera app to be even faster to launch. and shoot with. Some have also said the Moto camera app on N6 was faster, but I never tried it out. Once I get my 6P will be trying out the One+ camera app(which has manual model included) to see how it does on the 6P.", "time": "3rd October 2016, 02:33 AM", "postID": "post68958045", "replies": []}, {"text": "My camera launches in less than half a second, but sometimes getting focus right away is a little sketchy. Autofocus could use some work software side, but other than that photos taken are very snappy! HDR+ usually takes a second or two per picture though.", "time": "3rd October 2016, 07:35 PM", "postID": "post68967911", "replies": []}, {"text": "I got my 6p this week and tried out the one+ camera app. I feel it is minutely faster to start up and shoot; however,  I noticed that with third party apps, that the flash works wrong. Like it will flash then take the pic(images come out like flash was off) vs the camera app, which takes it when it's actually flashing. Has anyone noticed this? Or is there something wrong with my device?", "time": "6th October 2016, 04:28 PM", "postID": "post69008764", "replies": []}, {"text": "I find the camera app to play up the  most on my nexus 6p. Often I start the camera and it wont even startup. Then I have had the phone reboot while in the camera app and crash as well. I wouldnt say its lightening fast either. Its adequate and the photos are pretty decent. But I find the inconsistency of the camera up running or locking up very difficult, makes me a bit cautious about using the camera as its more a pain than it is useful. The camera is used often here for scanning barcodes and paying for items via online payments and its always a bit awkward with this camera.  Trying this now and see if it helps.", "time": "5th January 2017, 03:35 AM", "postID": "post70399409", "replies": []}, {"text": "Using the camera app that comes with cortex ROM zero shutter lag mod), I find startup time to average 0.5 seconds and pictures taken in HDR+ auto to be instantaneous. I can also take multiple HDR shots without any slowdown, so basically the same as the new pixel phones (which this camera app is modeled from)...", "time": "6th January 2017, 05:03 PM", "postID": "post70424887", "replies": []}, {"text": "hdr is very slow", "time": "9th January 2017, 08:49 AM", "postID": "post70467110", "replies": []}]}, {"title": "Software (ease of use, features, etc)", "rating": 4.0, "links": ["https://forum.xda-developers.com/nexus-6p/review/software-ease-features-t3239507"], "threads": [{"text": "App is the better. but not there yet.", "time": "6th November 2015, 02:22 PM", "postID": "post63688380", "replies": []}, {"text": "Basic software, gets the job done. Luckily there's an app store.", "time": "13th November 2015, 08:40 PM", "postID": "post63811624", "replies": [{"text": "Agree. Yes, the Google Camera Apps can take good pictures and videos but the amount of setting options or \"special\" features is very limited. Currently I'm using Camera MX", "time": "24th December 2015, 04:03 PM", "postID": "post64471679", "replies": []}]}, {"text": "Hi, \r\nThe camera lags when I rotate the Camera from landscape to portrait and vice versa. It also lags when I move it around a bit. The lag is just for about a second but it's disconcerting nonetheless. I'm wondering if this is a software or a hardware issue. I've gotten one replaced but the replacement also had the same issue. Anyone else facing this issue?", "time": "28th November 2015, 10:29 AM", "postID": "post64046126", "replies": []}, {"text": "Google Camera", "time": "17th February 2016, 03:29 PM", "postID": "post65373093", "replies": []}, {"text": "I hope in the future it will be improve and more features/settings", "time": "2nd March 2016, 05:50 AM", "postID": "post65611651", "replies": []}, {"text": "I just hope they fix the exposure compensation bug that makes my HDR apps useless.  (https://code.google.com/p/android/is...tail?id=196815)", "time": "3rd May 2016, 05:15 PM", "postID": "post66677358", "replies": []}]}, {"title": "Charging speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/nexus-6p/review/charging-speed-t3239508", "https://forum.xda-developers.com/nexus-6p/review/charging-speed-t3239508/page2", "https://forum.xda-developers.com/nexus-6p/review/charging-speed-t3239508/page3", "https://forum.xda-developers.com/nexus-6p/review/charging-speed-t3239508/page10"], "threads": [{"text": "Charges about 2% per minute from 0-50%, then does about  1% every 2 minutes from 50-100%.", "time": "3rd November 2015, 01:22 AM", "postID": "post63625490", "replies": [{"text": "not making sense. total of 150min (2h30) for charging it?", "time": "7th November 2015, 02:06 AM", "postID": "post63698006", "replies": [{"text": "75 mins with his math. 25 mins to get to 50% then another 50 mins to get to 100%", "time": "9th November 2015, 01:18 AM", "postID": "post63729966", "replies": [{"text": "I was wrong. but you're also wrong.\r\n125min=2h05min\r\n25min for the first 50% and 100min for the rest", "time": "9th November 2015, 01:45 AM", "postID": "post63730199", "replies": []}]}]}]}, {"text": "Fastest charging phone I've ever had.", "time": "3rd November 2015, 02:56 PM", "postID": "post63634195", "replies": []}, {"text": "59% to full charge in about an hour, not bad IMO", "time": "7th November 2015, 12:24 AM", "postID": "post63697072", "replies": []}, {"text": "I had a charge from 7% to 100% in hour and a half.  (Having had the phone for a week, and this round had 50 and a half hours unplugged with around 5+ hours SOT, first day mostly LTE and commute to work, 2nd day home on wifi).", "time": "8th November 2015, 07:14 PM", "postID": "post63725684", "replies": []}, {"text": "I think the OP means 1% every minute from 50 to 100. No way in hell is the phone doing .5% a minute charging on the fast charger.", "time": "9th November 2015, 08:44 PM", "postID": "post63743157", "replies": []}, {"text": "I've went from 0 to 100 in about 1hr 20 mins.....fastest charging I have ever experienced.", "time": "9th November 2015, 09:37 PM", "postID": "post63743855", "replies": [{"text": "Too bad it's only fast charging with the Original stock charger, I hope third party accessories will come out soon!", "time": "9th November 2015, 10:08 PM", "postID": "post63744246", "replies": []}]}, {"text": "I've seen 2740mah on ampere while charging. It charges fast, haven't timed it.", "time": "9th November 2015, 09:40 PM", "postID": "post63743915", "replies": [{"text": "", "time": "9th November 2015, 11:31 PM", "postID": "post63745206", "replies": []}, {"text": "Sorry for the huge pic!", "time": "15th November 2015, 05:31 PM", "postID": "post63839878", "replies": []}]}, {"text": "I actually have some concerns about fast charging and battery degradation.  I'm not a battery expert but I have had a lot of Li-Ion IMR batteries for other electronic devices.  I noticed that rapidly charging those batteries reduces battery life and charge capacity.  Now I know the Nexus 6P has a Li-Poly or Li-Po battery and it has a sightly different composition than an IMR (Magnesium vs. Polymer) but does anyone know how Li-Po batteries handle repeated fast charging?", "time": "13th November 2015, 07:12 PM", "postID": "post63810451", "replies": []}, {"text": "Charges faster than I expected... Even in my car.", "time": "13th November 2015, 08:40 PM", "postID": "post63811637", "replies": [{"text": "What do you use in your car? I can't find a car charger from anywhere but China and it'll take a month to get here.", "time": "13th November 2015, 10:56 PM", "postID": "post63813185", "replies": [{"text": "I'm using the same cig-lighter, double USB Plug I've had for a couple years... But I just found a cable on Amazon that fit and that's what I'm using..... Nothing fancy.\n\r\nWhen I knew I'd eventually get a USB-C phone, I started stocking up on the cables...I'd pick up about one a month. I have about 5 or 6 now, so I'm good at home, on the road, at work, in the wife's car, and have a spare in my laptop bag and an extra one I haven't opened... Plus the stock Nexus 6P charger, so I'm good.", "time": "13th November 2015, 11:24 PM", "postID": "post63813431", "replies": []}]}]}, {"text": "I was personally blown away at how fast it charges. I didn't time it but I was at 12%, plugged in,  did some Web browsing and watched a bunch of you tube videos and I checked and I was at 68%. Call it a half hour 45 MINS. Crazy fast,  makes me not miss my extended batteries bc I know if I'm low I just gotta plug in for an hour and I'll be 100% again", "time": "13th November 2015, 11:07 PM", "postID": "post63813286", "replies": []}, {"text": "I am also amazed with how fast this phone charges. Fastest charging I have ever seen.\n\r\nI am also amazed by how little it will consume over night when you forget to plug in. I forgot to plug it in when it was at 70% and when I woke up 8 hours later it was at 67%.", "time": "14th November 2015, 04:20 AM", "postID": "post63815783", "replies": []}, {"text": "Anyone else notice it gets hot while fast charging??", "time": "15th November 2015, 02:41 AM", "postID": "post63829828", "replies": [{"text": "I have not noticed this. My phone stays cool to the touch but I do have it in a small case.", "time": "15th November 2015, 06:21 AM", "postID": "post63831826", "replies": [{"text": "Annoying!!! I have mine in a case as well. Also the fingerprint scanner plays up a bit while face charging. RMA I guess!", "time": "15th November 2015, 09:47 AM", "postID": "post63833740", "replies": []}]}]}, {"text": "Charges fast.", "time": "15th November 2015, 03:16 AM", "postID": "post63830165", "replies": []}, {"text": "The fast charging is so convenient! Plus I have a RavPower charger that also charges amazingly fast.", "time": "17th November 2015, 05:16 AM", "postID": "post63866448", "replies": []}, {"text": "Charging speed is good with normal cable and excellent with usb-C cable.", "time": "18th November 2015, 06:23 PM", "postID": "post63893770", "replies": []}, {"text": "this seems to throttle on heat as well but is very good over all", "time": "18th November 2015, 08:50 PM", "postID": "post63895948", "replies": []}, {"text": "Seems that not so many of users have used fastcharge devices.. I have used Samsung Galaxy S6&Note4, Nexus 6, LG G4, Sony Xperia Z3, Z3+, Z5, Motorola Moto X Style and now Nexus 6P so this don't give me any \"wow\" feel, it charges slower than example my latest phone Moto X Style. Everyone of those devices and also Nexus 6P is supportin Quallcoms Quick Charge 2.0 which is \"real\" fast charge giving 9 or 12 volt and about 2A of power. Charger which come with Nexus 6P is also some kind of fast charger, but it's give \"normal\" voltage 5V but gives more amperes (3A) and that's why it charging faster than example older devices. Micro-usb can't give that much of power (only more voltages), but USB type C can. Nexus 6P also supports quick charge 2.0 but not with charger which come with Nexus 6P. I also have quick charge 2.0 charger and it charged Nexus 6P (giving 12V and 1.86A) in about 64 minutes.\n\r\nAnd for \"heating\". Ofcourse it will heat when charging. If you are using heavy apps same time it will get hotter more than if you are just leaving it to table. Also faster charging mean more heating.", "time": "18th November 2015, 11:21 PM", "postID": "post63897932", "replies": []}, {"text": "Yup. I've seen 2.857 amps but it gets warm and goes down to 1.8 to 2.2 range and bounces around.  Fact is it's pretty dang fast", "time": "19th November 2015, 12:17 AM", "postID": "post63898471", "replies": []}, {"text": "1 hour and 40 minutes from 0% to 100%. or 1% per minute.", "time": "19th November 2015, 01:05 AM", "postID": "post63898924", "replies": []}, {"text": "1.  It charged from 10% to 100% in exactly 90 minutes, using stock charger.\n2. If you use the phone while charging or the phone was under heavy load therefore already warm just prior to charging, it charges slower than usual so as to not generate additional heat. When cools down, it charges faster.\n3. The software not only slows down the charging but also slows down the processor so it processes HDR images slower for example.\n4. Even still, it NEVER feels 'hot' to the touch, like my Z3 did. Comfortably warm though.", "time": "19th November 2015, 05:04 AM", "postID": "post63901138", "replies": []}, {"text": "6P is at 10%. Plug it in. 10 minutes later, it's already up to 30%. It's amazing how fast the Nexus 6P charges.", "time": "11th December 2016, 07:19 AM", "postID": "post70031960", "replies": []}, {"text": "Im using fast charger, but getting only about 1000ma charging current. It was charging rapidly before.", "time": "22nd December 2016, 08:36 PM", "postID": "post70213086", "replies": [{"text": "Charging speed on the fast charger is fine on my device. It charges very fast up to about 75% then a bit slower to about 93% and the last 7% can take 20 mins or so.  About 1.5hrs and its very close to full (untimed guestimate though) \n\r\nIf this phone didnt have fast charge it would be a pain as it drains pretty darn quick and I can never make a full day with it.", "time": "4th January 2017, 07:09 AM", "postID": "post70385234", "replies": []}]}]}, {"title": "Screen on time", "rating": 4.0, "links": ["https://forum.xda-developers.com/nexus-6p/review/screen-time-t3239509", "https://forum.xda-developers.com/nexus-6p/review/screen-time-t3239509/page2", "https://forum.xda-developers.com/nexus-6p/review/screen-time-t3239509/page3", "https://forum.xda-developers.com/nexus-6p/review/screen-time-t3239509/page53"], "threads": [{"text": "I get about four hours", "time": "3rd November 2015, 01:22 AM", "postID": "post63625497", "replies": []}, {"text": "Yesterday I got around 5 hours with 30% left. Mostly just on forums, Facebook, etc. Nothing too demanding", "time": "6th November 2015, 06:44 PM", "postID": "post63692541", "replies": []}, {"text": "WIth some gaming, music streaming, and about 15 hours of operation time, I get about 4 hours of Screen On Time with maybe 10-20% left.\n\nSame thing as Nexus 6.", "time": "6th November 2015, 06:49 PM", "postID": "post63692610", "replies": []}, {"text": "Usually 2 hours for me.", "time": "6th November 2015, 07:25 PM", "postID": "post63693183", "replies": []}, {"text": "I got 6 hrs yesterday which for me is very good considering I stream video and am on the phone frequently. But normally I get around 5hrs 45 mins.", "time": "6th November 2015, 09:44 PM", "postID": "post63695224", "replies": []}, {"text": "First complete day ended yesterday 27 hours off the charger 5 hour 26 minutes screen on time (Somewhat light user, lots of messing  with the phone installing apps customizing and have gReader pulling down about a 1000 articles a day, reading through all the headlines and diving into about a quarter for more. No calls and light texting maybe 40 messages)", "time": "6th November 2015, 09:50 PM", "postID": "post63695318", "replies": []}, {"text": "This is amusing. I've had the phone for about a week. Not more than 3 hour to 330 on average use. Once I got 4hours+ but that was when I had the phone mainly on WiFi + aeroplane mode since the mobile signal was weak. \n\r\nI have no idea how someone could get 5h30min screen time on this phone. (Maybe with screen just on while doing nothing on the phone?)\n\r\nIt has a huge battery so I'm all for blaming Google the stupidity of a 2K screen wasting power.. When iphones with HD display looks gorgeous too. I've no other reason to think of.. My brightness is usually at 20% or so but even then... Almost same as my nexus 5 ..marginally better. But I was expecting a lot more.", "time": "7th November 2015, 04:01 AM", "postID": "post63698648", "replies": []}, {"text": "I've had the phone since Tuesday and have been getting 4+ SOT consistently.  Still trying to figure out ways to optimize battery life, but overall I'm happy. Way better than my S6.", "time": "7th November 2015, 06:24 AM", "postID": "post63699782", "replies": []}, {"text": "5 hrs SOT with about 1 hour of playing asphalt at 60% brightness, mostly on wifi, google now enabled, brightness range from 20% to 60%., 2 emails synced and refreshes constantly (I get about 40 emails per day).\n\r\nWithout playing Asphalt 6-6.5 hrs SOT.", "time": "7th November 2015, 07:40 AM", "postID": "post63700427", "replies": []}, {"text": "8:55 SOT, wifi only(radios active but Fi service is not activated yet), mostly texting/messing with phone/couple hours of wifi calls, 20-30% brightness on average, very few apps installed.  Battery lasted 16 hours total on that charge(was first full charge since I got phone, ran it down to 5%)", "time": "7th November 2015, 03:51 PM", "postID": "post63706234", "replies": []}, {"text": "When I use it on a mix of Wi-Fi and 3G/4G I get about 4 hours SOT, on Wi-Fi only I get about 6 hours SOT. I always have bluetooth/wear and location on and brightness set at approx 40%. I'm really impressed, especially with doze 😀", "time": "7th November 2015, 05:58 PM", "postID": "post63708128", "replies": []}, {"text": "I was at 6.5 hours with 20% battery left the other night. Probably could have pushed it close to 8.", "time": "7th November 2015, 10:50 PM", "postID": "post63712031", "replies": []}, {"text": "I'm at 25 hours of up time right now since my last charge. 4 hours of screen time exactly with 15% left", "time": "7th November 2015, 10:52 PM", "postID": "post63712060", "replies": [{"text": "rom? kernel?", "time": "8th November 2015, 06:01 PM", "postID": "post63724599", "replies": [{"text": "I'm on stock Rom but I flashed ElementalX kernel\n\nMDB08M image", "time": "8th November 2015, 06:12 PM", "postID": "post63724766", "replies": [{"text": "would you ssay the kernel improved batt? or is it just for root? my nexus comes tomorrow", "time": "8th November 2015, 06:48 PM", "postID": "post63725274", "replies": [{"text": "I honestly couldn't tell you. I flashed immediately lol. Doesn't seem that any battery improvements have been included though. Just an early release kernel that I mainly installed for tweaking colors", "time": "8th November 2015, 07:19 PM", "postID": "post63725754", "replies": [{"text": "thanks for the responses", "time": "9th November 2015, 08:58 AM", "postID": "post63734208", "replies": []}]}]}]}]}]}, {"text": "5h30 here, mostly reddit, messaging, and podcasts", "time": "7th November 2015, 11:38 PM", "postID": "post63712617", "replies": []}, {"text": "4+ hours consistently: browsing, gaming and videos.  Tons of podcast and music streaming.", "time": "8th November 2015, 04:24 AM", "postID": "post63715150", "replies": []}, {"text": "I get about 4 hours with 100% Brightness and Adaptive Brightness turned on.", "time": "9th November 2015, 02:22 AM", "postID": "post63730525", "replies": []}, {"text": "Well..i have been using the 6P for last 3 days but I am struggling with my SOT. I have location on, WiFi on (sometimes on LTE when I am out of home) very basic browsing, messaging and little bit of Gaming. But my SOT is only around ~2-2.5 hours (at best). I am on full stock as of now (bootloader unlocked after first boot tho). And my battery lasts about 14-15 hours only! Not sure where is all the battery drain due to.\n\nOther settings - Google Now enabled; Location High Power; Display ~30% with Adaptive Brightness on..mostly indoors so never on full brightness; Bluetooth On with Android Wear (Moto 360 1st Gen)\n\nAny suggestions? (My next steps would be to head towards Root and most likley elementalX kernel)", "time": "9th November 2015, 06:36 AM", "postID": "post63732746", "replies": [{"text": "Regarding Google Now...do you have \"Always On\" enabled? It seems like that's been causing a significant standby time drain for some people. I haven't a need for it to always be on, so I left that disabled coming from my last phone. \n\nI'm getting battery life on-par with that of my Note 4, at best, so far. Not super impressed, but my expectations may have been set a little too high... I've been getting 3:30 to 4:00 in the few days I've been using it. But for a couple of those days I did spend a majority of the work day streaming Spotify, and then I would be 3:30 at best. \n\nNow I did notice one app reported as sucking quite a lot of battery, so I cut some of its permissions I didn't feel were necessary (location, contacts access, etc.). I'm hoping for better life going forward this week.", "time": "9th November 2015, 01:10 PM", "postID": "post63737148", "replies": []}]}, {"text": "Always on for OK Google detection? Actually haven't set it up at all. Google now is enabled though with high location accuracy. Thinking of turning it off if battery life continues to struggle.\n\nI suspect that in addition to the Google play services my LTE network search may also be a culprit. LTE is new in India and the network is at best pathetic. Yeah it's that bad. So that may be screwing the results as well.", "time": "9th November 2015, 01:16 PM", "postID": "post63737246", "replies": []}, {"text": "I've gotten 4.5 hours SoT on three different occasions. Most of that use was on WiFi but at least two of those days had about an hour of active use on LTE and lots of standby with LTE connected. These days included several YouTube videos as well. Location is set to high accuracy and those uses include some music streaming over Bluetooth while driving. My best SoT was 5 hrs 50 minutes. That was all on WiFi. That day was mostly Google plus, reading articles, and browsing forums on the xda app.", "time": "9th November 2015, 01:28 PM", "postID": "post63737446", "replies": []}, {"text": "You guys must use your phones a lot more than I do. I normally have 60-65% left at the end of a day (17ish hours) with 2 - 2.5 hours SoT. How do you have time to look at you phone 5+ hours a day?!  Get a job, hippies!", "time": "9th November 2015, 02:16 PM", "postID": "post63738183", "replies": []}, {"text": "Three nights in a row, I left it on overnight (Wi-Fi on, BT on, everything syncing) and drained 3% in 9 hours. That's impressive. I average 3-4 hours of screen on time per day with medium to heavy usage and easily make it all day. A few days ago, I did a \"light usage test\" and didn't use it for gaming (still had everything except GPS on and syncing) and I made it 2.5 days (59.5 hours) with 2.5 hours of screen on time. Battery is impressive on this thing. I am rooted stock and have no issues, except when gaming. Mine drains really fast and gets very, very, very hot when gaming for extended times, but when not gaming, it lasts crazy long.", "time": "9th November 2015, 02:20 PM", "postID": "post63738251", "replies": []}, {"text": "4 to 4.5\r\nwas hoping to get 5-6", "time": "9th November 2015, 03:58 PM", "postID": "post63739715", "replies": [{"text": "I'm getting 5.5hrs consistently with the setup that is in my signature.", "time": "9th November 2015, 09:41 PM", "postID": "post63743936", "replies": []}]}, {"text": "on track for about 4 hours 2 days in a row now.", "time": "9th November 2015, 10:32 PM", "postID": "post63744521", "replies": []}, {"text": "Even i also faced the early shutdown issue on my Nexus 6p. Where the battery was old nearly for 3 years now. After the replacement no early shut down issues. The battery life is awesome. The phone is like brand new again. Cheers;", "time": "31st January 2018, 03:12 AM", "postID": "post75391564", "replies": [{"text": "I just replaced mines Friday, I'm getting about 3-4hours sot now... I was forced to change it after I was getting early shut down", "time": "4th February 2018, 10:19 AM", "postID": "post75441801", "replies": [{"text": "Same as mine. I feel super cool.", "time": "4th February 2018, 12:53 PM", "postID": "post75443164", "replies": [{"text": "Feels like a new phone now, I've had this phone going on two years now. With a new battery hopefully it will last me another year or two", "time": "4th February 2018, 12:58 PM", "postID": "post75443208", "replies": []}]}]}]}, {"text": "I am getting about 7h 30min after new battery.\r\nOn first charge i have got 8h 3 min\r\nRunning purenexus. \r\nStraight talk verizon. No wifi.\r\nHeavy usage with maps social aplications about 4hr of talking throught bluetooth headset.\r\nThe battery is new but not oem. From ebay 12$ Accubattery shows 4090mah.", "time": "15th March 2018, 08:53 PM", "postID": "post75902467", "replies": []}]}, {"title": "Standby drain", "rating": 4.5, "links": ["https://forum.xda-developers.com/nexus-6p/review/standby-drain-t3239510", "https://forum.xda-developers.com/nexus-6p/review/standby-drain-t3239510/page2", "https://forum.xda-developers.com/nexus-6p/review/standby-drain-t3239510/page3", "https://forum.xda-developers.com/nexus-6p/review/standby-drain-t3239510/page8"], "threads": [{"text": "Doze rules!", "time": "3rd November 2015, 01:22 AM", "postID": "post63625506", "replies": []}, {"text": "Go to bed with phone at 100% wake up to 98%.  What's not to love.", "time": "6th November 2015, 04:23 PM", "postID": "post63690258", "replies": [{"text": "Exact same results here.", "time": "6th November 2015, 05:43 PM", "postID": "post63691564", "replies": []}]}, {"text": "Pretty good.", "time": "6th November 2015, 05:36 PM", "postID": "post63691444", "replies": []}, {"text": "Same, last night went to bed at 32% and woke up with 30%. It's MUCH IMPROVED from previous versions of Android.", "time": "6th November 2015, 06:00 PM", "postID": "post63691856", "replies": []}, {"text": "Having major issues with Doze, with battery drain of between 15-20% overnight.\n\r\nThere's a thread where these users can weigh in here: http://forum.xda-developers.com/nexu...ected-t3237573", "time": "6th November 2015, 06:21 PM", "postID": "post63692187", "replies": [{"text": "That would be because of an app you have on your phone keeping it awake.", "time": "6th November 2015, 07:26 PM", "postID": "post63693199", "replies": [{"text": "No. Ran standby tests in safe mode and after factory reset and had same results.", "time": "6th November 2015, 07:27 PM", "postID": "post63693219", "replies": [{"text": "Ok, bad phone then. Send it back.", "time": "6th November 2015, 07:28 PM", "postID": "post63693239", "replies": [{"text": "I should get my second replacement soon.\n\r\nJust wanted to show that some users aren't experiencing the same battery life \"Doze\" is supposed to provide.", "time": "6th November 2015, 07:30 PM", "postID": "post63693265", "replies": []}]}]}]}]}, {"text": "Have you turned off Wifi always scanning?", "time": "6th November 2015, 07:50 PM", "postID": "post63693595", "replies": []}, {"text": "From full charge at 9pm i loose 3% when alarm goes off at 5:30 am", "time": "7th November 2015, 12:25 AM", "postID": "post63697086", "replies": []}, {"text": "I've lost anywhere between 1%-5% overnight with doze. Not really sure why the difference either. When I look at the battery chart, it's showing very minimal \"awakes\" each night. Either way, this is much better than prior version of Android where I'd easily lose 7%-10% overnight.\n\nOne of my only gripes with doze is that it kills some helpful apps that haven't been updated yet. Timely, I'm talking about you... No more smart rise until there's an update.", "time": "7th November 2015, 12:31 AM", "postID": "post63697141", "replies": [{"text": "The solution for Timely for now is to not have it optimized for battery.", "time": "8th November 2015, 04:07 AM", "postID": "post63715013", "replies": [{"text": "I tried that one night and it didn't smart rise 30 minutes in advance. Alarm only went off at the time set.", "time": "8th November 2015, 05:39 AM", "postID": "post63715757", "replies": []}]}]}, {"text": "I don't know exact numbers (haven't been checking that hardcore) but the battery graph looks damn near flat while my phone and I are \"dozing.\"", "time": "7th November 2015, 06:33 AM", "postID": "post63699857", "replies": []}, {"text": "Deep Sleep Battery Saver is a really great app to help reduce battery drain. I was struggling with my phone always being awake, even with aggressive doze mode and DSDS helped a lot.\n\r\nIt does require root because you need to make it a system app, though.", "time": "7th November 2015, 05:20 PM", "postID": "post63707543", "replies": []}, {"text": "I'm getting a 5% drain in 2hrs dozing and apparent exchange services is the culprit any ideas? It survived a factory reset, cache wipe etc..", "time": "8th November 2015, 06:00 PM", "postID": "post63724585", "replies": [{"text": "My guess is that the exchange services are treated as priority (just as with SMS and phone calls) and keep the phone from going into doze mode/continually waking it up.\n\r\nI'd suggest using a third-party app for Exchange (such as Outlook or Cloudmagic, which is excellent) and remove the other exchange account. Doze will put those apps into hibernation unless you whitelist them in battery optimization. Give that a shot and see if the issue persists. I'm using Outlook and haven't had any frequent wake-up issues. My phone dozes like a baby.", "time": "1st December 2015, 08:28 PM", "postID": "post64101198", "replies": []}]}, {"text": "my battery life since Nov 3 has been great... last week or two I was getting some nasty awake on my 6P....\nbased on info on another thread, i went ahead and uninstalled GasBuddy and the awake has stopped very considerably! battery has gone back to being good, but i feel i still got one more app lingering... funny is that Wakelock Detector was also hurting me.. maybe the code isnt up to par for 6.0.... but for now, i  guess ill wait for the GasBuddy app to fix whatever they broke", "time": "2nd December 2015, 01:31 PM", "postID": "post64111638", "replies": []}, {"text": "Stock, locked bootloader, charged phone on Saturday morning.  I have 64% left, has been up for 4 days 5h 19 minutes 50 seconds.  Very light usage, mostly stand by with some internet usage and phone calls and texts.", "time": "2nd December 2015, 04:10 PM", "postID": "post64114073", "replies": []}, {"text": "Mine drops 0-2% with 8 hour overnights. Sometimes I go to sleep and wake up with the same percentage", "time": "2nd December 2015, 09:25 PM", "postID": "post64118829", "replies": [{"text": "Ditto, pretty awesome!", "time": "3rd December 2015, 03:20 AM", "postID": "post64122507", "replies": []}, {"text": "That sounds good! Do you turn anything off? Do you use google now and location services?\n\nSkickat från min Nexus 6P via Tapatalk", "time": "3rd December 2015, 10:45 AM", "postID": "post64126529", "replies": [{"text": "Google now is off but location is always on, either battery saving mode or high accuracy mode. Wifi is always on during sleep but wifi and bluetooth scanning are off. I have 3 Google accounts syncing.", "time": "4th December 2015, 01:49 PM", "postID": "post64144712", "replies": []}]}]}, {"text": "for now seems GasBuddy was indeed being the wakelock....", "time": "3rd December 2015, 02:03 PM", "postID": "post64128918", "replies": []}, {"text": "I went to sleep with 100% at around 10pm, woke up around 8am with 99%. I then left it there and checked back at around 4pm and it was at 98%. Doze is doing a phenomenal job!", "time": "3rd December 2015, 06:12 PM", "postID": "post64132587", "replies": []}, {"text": "Someone says an app causes problems and stays awake. That totally is unacceptable! Doze is supposed to freeze the apps that might cause wakelocks how the heck can a random app wake your device? whats the point of doze then?", "time": "4th December 2015, 07:05 AM", "postID": "post64140419", "replies": []}, {"text": "When I'm walking around I get quite a bit of heat in my pocket. I know doze isn't activated when on the move, but I'm getting 2-5% loss per hour screen off.\n\r\nWifi on, high accuracy location, Ok Google on, just bluetooth scanning off.\n\r\nAnyone else with similar problems?", "time": "5th December 2015, 07:59 AM", "postID": "post64156258", "replies": []}, {"text": "Well now since you put it that way..... That IS bad. What are you running? I am on the mokee rom with ElementalX kernel. I was thinking of trying Bliss but I really LOVE the CyanogenMod launcher/app drawer. I'm not in a rush to clean flash a new rom right away. Still recovering from the experience of trying to figure out the boot loop I had after trying the 7.0 beta. Hey, according to the XDA vid, we'd be a lot slower if we were running Nougat.", "time": "15th September 2016, 03:41 AM", "postID": "post68693924", "replies": []}, {"text": "My 6p got screw up since last week! \n\nI went to bed and when I woke up my phone won`t turn on... I`ve waited for like 2 hours charging it, sunddendly it came back to live... \nBut after this episode the battery drain is !@#$#@%@#% AWFUL! 1 hour screen on time = 30% remaining...\n\nI`ve tried factory reseting it, wipe erverything... Flash Pure nexus... Flash Kernels.... \n\nI can`t solve this problem... I`m really pissed of... I don`t know what to do... Accubattery told my 6p has 91% healthy battery...\n\ni`m getting at least 15% drain per hour...", "time": "10th December 2016, 10:11 PM", "postID": "post70027569", "replies": []}]}, {"title": "Heavy use endurance", "rating": 3.5, "links": ["https://forum.xda-developers.com/nexus-6p/review/heavy-endurance-t3239511", "https://forum.xda-developers.com/nexus-6p/review/heavy-endurance-t3239511/page2", "https://forum.xda-developers.com/nexus-6p/review/heavy-endurance-t3239511/page3"], "threads": [{"text": "Lasts a full day of heavy use, but barely. If I am off charger at 7am, by 10pm I have 15-20% left.", "time": "3rd November 2015, 01:23 AM", "postID": "post63625516", "replies": [{"text": "7am - 10pm is FANTASTIC usage! My note 3 could never do that with ANY rom and most modern phones can't, especially with heavy usage. I see users comparing it to the g2 and some older devices and I don't think it a fair comparison. Those older devices have less power hungry components. I'm using a very low spec'd Galaxy Grand Prime and the battery life on it is REALLY good, but that's because of how low spec'd it is. It doesn't even have a 720p screen lol. But the benefits of a 6P are more than just in the battery life dept so I can't complain on that front.", "time": "8th November 2015, 05:05 AM", "postID": "post63715501", "replies": []}]}, {"text": "On my second day of use, the phone died after 14 hours of mixed  to heavy use. Third day is even worse, the phone is draining at about 10% per hour.  The endurance on this thing is a step down from my LG G2, enough that I'm thinking of returning it.", "time": "7th November 2015, 04:53 AM", "postID": "post63699089", "replies": [{"text": "Oh dang... I had the G2 and although it had very good battery life, I never found it satisfactory. I have had the Z3 by Sony since release and I have to say, it's the only phone where I am never worried about battery life. It isn't phenomenally better, no. it is just more than enough to give me great confidence in the stamina of the device. \n\r\nI have the Nexus due in for delivery today so I really hope it doesn't disappoint. Since if it does, I too may return it for the Z5 compact.", "time": "7th November 2015, 07:06 AM", "postID": "post63700136", "replies": []}]}, {"text": "First few discharge cycles were disappointing.  Then I realized that leaving BT on all the time was preventing deep sleep...I am now getting 20+ hours under heavy to moderate use.\n\nDefinitely better than both my OPO and s6 edge", "time": "8th November 2015, 04:50 AM", "postID": "post63715378", "replies": [{"text": "I also leave it on all the time, maybe it is a bug with the 6p and bluetooth?  I've never turned bluetooth on and off with any phone as I use bluetooth audio frequently.  In any event, I'm going to try keeping it turned off for a day or two.", "time": "9th November 2015, 03:29 AM", "postID": "post63731112", "replies": [{"text": "Strange I keepy Bluetooth on 24/7 fory smartwatch and it doesn't bother my battery", "time": "13th October 2016, 05:45 AM", "postID": "post69105301", "replies": []}]}]}, {"text": "Three nights in a row, I left it on overnight (Wi-Fi on, BT on, everything syncing) and drained 3% in 9 hours.  That's impressive.  I average 3-4 hours of screen on time per day with medium to heavy usage and easily make it all day.  A few days ago, I did a \"light usage test\" and didn't use it for gaming (still had everything except GPS on and syncing) and I made it 2.5 days (59.5 hours) with 2.5 hours of screen on time.  Battery is impressive on this thing.  I am rooted stock and have no issues, except when gaming.  Mine drains really fast and gets very, very, very hot when gaming for extended times, but when not gaming, it lasts crazy long.", "time": "9th November 2015, 02:19 PM", "postID": "post63738238", "replies": []}, {"text": "Waze and any music app will absolutely DEMOLISH the battery.   Very disappointed vs my iphone 6+.  Use a car charger!", "time": "9th November 2015, 04:17 PM", "postID": "post63739996", "replies": [{"text": "This is exactly my biggest terror. I have a 6S+ and the battery is AMAZING (yes I had to capitalize it) \n\r\nI miss being on Android and thought about getting a 6P but worried the battery life wont be good enough. \n\n\r\nanyone have any rom/mods that makes the battery life last all day ?", "time": "11th May 2016, 06:42 PM", "postID": "post66805770", "replies": []}, {"text": "This. Google Play Music destroys my battery more than Google Maps or any other app. Even when I am playing local file and not streaming it is horrendous. Google really needs to improve this, it is terrible for an app that is native to the device.\n\n---------- Post added at 04:52 PM ---------- Previous post was at 04:50 PM ----------\n\n\n\r\nThe days I don't use Play Music for more than two hours. I easily get through the day. Otherwise, it is a struggle.", "time": "11th May 2016, 09:52 PM", "postID": "post66808389", "replies": []}, {"text": "I started using Blackplayer instead of Google Music. Wow. What a difference. My battery barely moved. With Google Music it ticked down like the sand in an hour glass. I also love the interface. Definitely sticking with this for local files.", "time": "14th May 2016, 11:27 AM", "postID": "post66846343", "replies": []}]}, {"text": "I am averaging around 2h45m to 3 hours screen on time, with a total run-time of 13-15 hours (7 AM to 10 pm) - 100% to 1% with medium to heavy usage.\n\n> Use gmaps (navigation) for a little over an hour\n> Music via BT for an hour and a half\n> Background location scanning n all day (tinder)\n> Lot of whatsapp messaging\n> Frequent google+, facebook and twitter checking\n> 3 gmail and 3 exchange email accounts on push", "time": "10th November 2015, 04:56 PM", "postID": "post63756599", "replies": [{"text": "In the 2nd and third photo you provided, are you using the Power Nap app?", "time": "13th November 2015, 06:31 PM", "postID": "post63809928", "replies": [{"text": "I'm using Franco's Naptime app. Why do you ask?", "time": "13th November 2015, 06:49 PM", "postID": "post63810052", "replies": [{"text": "Purely curious especially since power nap appears to have died off.", "time": "13th November 2015, 07:34 PM", "postID": "post63810743", "replies": []}]}]}]}, {"text": "Man that is depressing.. I was on my way to bestbuy to buy a nexus 6P but I guess not. Ill stick to my 6S Plus, it literally last ALL DAY, why can't Google get it right. \n\r\nWe shouldnt have to root a device,install roms, ect just to get by a whole day or normal phone usage. Its one of the major reasons why im using an iPhone as my daily.", "time": "11th May 2016, 11:32 PM", "postID": "post66809413", "replies": [{"text": "Just FYI... I ran stock for 3 weeks and got absolutely absurd battery life with pretty moderate to heavy usage. I ride a train to and from work every day for about 45 minutes each way. Listen to music at work, on the way to train, on the way home, while I'm at home both in the morning and after work. In about 20+ days of usage running stock, non-rooted I got 20+ hours with ease. Don't be fooled by what a few people say, however, it also depends on many many variables.", "time": "12th May 2016, 03:25 AM", "postID": "post66811262", "replies": [{"text": "This isn't just a Nexus thing. Every Android phone I've had Google Music drains it like their is no tomorrow.", "time": "12th May 2016, 11:51 AM", "postID": "post66815877", "replies": []}, {"text": "That's true I guess everyone has a different setup.\n\n\n\r\nive owned too many android phones never had google music be a battery drain its always snapchat, facebook,ect that drained the most battery", "time": "12th May 2016, 05:11 PM", "postID": "post66820421", "replies": [{"text": "I've never had Facebook or Snapchat on my phone so I guess that's why that hasn't been an issue for me.", "time": "12th May 2016, 11:06 PM", "postID": "post66825341", "replies": []}]}]}]}, {"text": "My 6P is CAPABLE of good battery life (5 hrs SOT over 24 hours) on the Franco kernel when Google Play Services doesn't decide to keep it awake all the time. But that issue can be solved by force closing GP services when the awake bar on my battery graph becomes solid.\n\nWhat's disappointing though is this phone's stamina when using apps that tax the CPU and GPU. My 6P will sip battery when browsing forums, going on the web, or replying to emails/texts/calls, but graphically intensive stuff will kill the battery a lot more quickly. More so than on my other phones.", "time": "13th May 2016, 05:48 PM", "postID": "post66836718", "replies": []}, {"text": "Using a Black theme with CM13 and better battery life", "time": "6th August 2016, 04:49 PM", "postID": "post68069974", "replies": []}, {"text": "What's the best kernel/flash for better battery life?", "time": "18th August 2016, 10:42 PM", "postID": "post68253720", "replies": []}, {"text": "False, the first posts are lying. I've never been able to get nearly what other people \"claim\" to get. It depends greatly on where you live (your reception) and what exactly you do. I'm sure I can get over a day if I only have the stock apps and hardly turn the screen on. If I use it without checking myself constantly then it will last about 8 hours. Then need to charge.", "time": "25th August 2016, 09:43 PM", "postID": "post68367187", "replies": []}, {"text": "I get around 5 hours screen on time.", "time": "30th August 2016, 03:59 PM", "postID": "post68445651", "replies": [{"text": "As do I", "time": "31st August 2016, 02:45 PM", "postID": "post68461280", "replies": []}]}, {"text": "How are people getting 5+ SOT? I get, at most, 3.5 SOT on a good day.", "time": "12th October 2016, 11:00 PM", "postID": "post69101994", "replies": []}, {"text": "The outboard their UI b b ruybgels of oh and if.k", "time": "21st October 2016, 12:27 AM", "postID": "post69228894", "replies": []}]}, {"title": "Light use endurance", "rating": 4.5, "links": ["https://forum.xda-developers.com/nexus-6p/review/light-endurance-t3239512", "https://forum.xda-developers.com/nexus-6p/review/light-endurance-t3239512/page2"], "threads": [{"text": "Lasts two days with light use.", "time": "3rd November 2015, 01:24 AM", "postID": "post63625528", "replies": []}, {"text": "I'm disappointed from the battery. Of course I knew it but when you have it in your own hands it's twice a disappointment.  I use it for an hour of talk time, two hours of browsing, and a few other tasks mainly file management.  I have both wifi and data open with 5 push emails. Notifications from other apps are disabled. Only emails, sms, viber, whatsapp and FB messenger are allowed.\n\nI have less than 40% battery at the end of the day when on my previous Note 4 I could have easily 60% or more.  I am terrified to start gaming and music listening through my Sony SBH-52 BT headset.", "time": "26th January 2016, 10:15 PM", "postID": "post64998281", "replies": [{"text": "Yes something's wrong on your end. And I remember using both the note 4/5 and you can see the battery melt in front of your eyes. With light use I get easily a day and some. I've never run out of battery with the n6p", "time": "27th January 2016, 02:42 AM", "postID": "post65000807", "replies": []}, {"text": "Not sure that is what I'd call light use, but have you looked at the threads in the other forums here addressing some of the known bad apps, etc? Lots of good advice here on how to make the battery last a lot longer on the 6P. Since they fixed the Naptime app a few days ago for a bug it had with MM, I've finished the last two days over 90%. Few phone calls, few texts, a few web searches. I'm rooted, running the Kylo kernel, greenify'd a few apps. Stock ROM.", "time": "27th January 2016, 03:06 PM", "postID": "post65009009", "replies": []}]}, {"text": "Battery is pretty better than note 4. I have been using note and I can post both devices screenshot about battery backup and sot", "time": "27th January 2016, 05:13 AM", "postID": "post65002062", "replies": []}, {"text": "With light use I have gone 3 days without charging. Just turn off \"Ambient Display\" and other automatic screen on options like that.", "time": "13th February 2016, 06:02 PM", "postID": "post65308388", "replies": []}, {"text": "Doze is amazing. It takes a while to turn on without root or Greenify but light use can make the battery last at least a day if not a day and a half and that is awesome!", "time": "6th March 2016, 07:33 PM", "postID": "post65688584", "replies": []}, {"text": "does ambient light impacts battery life?", "time": "29th July 2016, 09:40 AM", "postID": "post67952362", "replies": [{"text": "not much, but yes", "time": "29th July 2016, 02:46 PM", "postID": "post67955541", "replies": []}]}, {"text": "I've had a 6P for about a 5 days now. \n\r\nI just installed Nougat and can report that Doze really is vastly improved vs. MM. With very light use yesterday while on a five hour drive I was seeing values like 3% per hour while streaming BT audio (no nav, screen off, controlling playback via steering wheel-mounted controls). Going up I didn't use the phone except for checking the weather and saw something like 1.5% per hour.\n\r\nSo far this morning at work, where I usually hardly use the phone at all, I'm seeing something like 1.9% per hour just occasionally turning on the screen to check for texts/e-mails (SoT so far, 4 hours into my day is about 45 minutes). The best my Note 5 EVER did, impersonating a brick on my desk, was maybe 3.5% per hour. At the end of the day, with about 2 1/2 to 3 hours of SoT it would usually have 10%-15% left, so I would say the endurance of the 6P is astounding.\n\r\nI am concerned however about the dramatic effect using the camera has on this. I spent about 15 minutes playing with the camera last night before and 15 minutes after installing Nougat and noted a huge amount heat being generated with the resultant power consumption of over 15% in just those few minutes. I get that the processor is working hard on processing  but this is one area the Note 5 is better. While the 6P is so much more efficient overall than the Note 5 (running MM), I use the camera a lot while traveling and occasionally for work, and I'm worried that it will so dramatically reduce it's endurance that it'll die on me halfway through the day. I'm going to Singapore for a week next for a week and so far I don't think the 6P will be the phone I take only for this reason. I was hoping that with Nougat Google would have improved the efficiency of the camera app/photo processing but that doesn't seem to be the case.\n\r\nI would go so far as to say this may drive me to return it.", "time": "1st August 2016, 05:25 PM", "postID": "post67997828", "replies": []}, {"text": "After few days of light use I can finally share more details. Phone lasts 1 day and 20 hours with the light use. Phone used for 1h05m, screen 1h16m, 44h active phone (where first 8 hours were in very low signal area) with 13h wake time. I have three push accounts active, BT always on, Wifi as never when screen off. I have reached same results on my S7 Edge so it is not that bad as I suspected. Whats is very positively supposing is that while reading battery drops 1% per 9 minutes - not bad, and 1% per 10 minutes while using Spotify over BT headset.", "time": "1st August 2016, 05:39 PM", "postID": "post67998025", "replies": []}, {"text": "Yeah I think about 1.5 days average.", "time": "5th August 2016, 10:52 PM", "postID": "post68061108", "replies": []}]}, {"title": "\"Look\" of the device (aesthetics)", "rating": 4.5, "links": ["https://forum.xda-developers.com/nexus-6p/review/look-device-aesthetics-t3239513", "https://forum.xda-developers.com/nexus-6p/review/look-device-aesthetics-t3239513/page2", "https://forum.xda-developers.com/nexus-6p/review/look-device-aesthetics-t3239513/page3", "https://forum.xda-developers.com/nexus-6p/review/look-device-aesthetics-t3239513/page4"], "threads": [{"text": "Great design!", "time": "6th November 2015, 05:35 PM", "postID": "post63691423", "replies": []}, {"text": "I just received mine last night.  I am coming off of a m7 GPE...  I absolutely love the was the m7 feels.  The 6P is close to that but could use a little refinement where the screen and metal meet.  Aesthetically I love a simple understated phone.  This phone does that for the most part though I wish the periscope were more integrated into the design.", "time": "6th November 2015, 08:03 PM", "postID": "post63693802", "replies": []}, {"text": "Great design! really", "time": "7th November 2015, 03:35 PM", "postID": "post63705982", "replies": []}, {"text": "i really like it. one of the best phone designs to date!", "time": "7th November 2015, 05:04 PM", "postID": "post63707322", "replies": []}, {"text": "I really like it, apparently the Samsung fanboys aren't so keen though.", "time": "7th November 2015, 05:56 PM", "postID": "post63708099", "replies": [{"text": "I am not a fan boy but I still think that after a change from my s6 edge to 6p I am giving up on the looks of the phone.\nHowever there are other factors which make me make the change", "time": "7th November 2015, 06:31 PM", "postID": "post63708570", "replies": []}]}, {"text": "Yes, I know it's not the best looking phone you can buy, but it's not the ugliest either. That being said, I kinda don't want a nexus that looks like aesthetics was the main priority when they designed it. In my eyes the S6 line is a bit too bling.", "time": "7th November 2015, 07:50 PM", "postID": "post63709768", "replies": []}, {"text": "I love the design! It's unique which is what a Nexus should be!", "time": "7th November 2015, 10:35 PM", "postID": "post63711855", "replies": []}, {"text": "Get rid of the plastic bottom. The misfit due to epoxy or whatever distracts from an otherwise beautiful phone.", "time": "15th November 2015, 03:18 AM", "postID": "post63830174", "replies": [{"text": "I agree. The phone is perfect but I dont know what the hell is going on at the bottom on the little mis matched plastic?? Is it for antenna or what?", "time": "15th November 2015, 06:09 AM", "postID": "post63831721", "replies": [{"text": "Yes. Radio signals can't penetrate metal.", "time": "15th November 2015, 10:07 AM", "postID": "post63833960", "replies": [{"text": "Do what ?  where did the info come from because that's not entirely correct.", "time": "17th November 2015, 04:21 AM", "postID": "post63865919", "replies": []}]}]}]}, {"text": "I didn't like the back camera panel bar at first when the 6P was announced but it grew on me. Plus it provides a unique contrast with the Frost color.", "time": "17th November 2015, 04:43 AM", "postID": "post63866136", "replies": []}, {"text": "I couldn't locate the section to ask the question about the option of adding an sd card. But, does anyone know if it's possible?", "time": "18th November 2015, 11:28 PM", "postID": "post63897997", "replies": []}, {"text": "nope. it doesn't come with a slot for sdcard. internal memory is all that is available.", "time": "20th November 2015, 08:59 PM", "postID": "post63928514", "replies": []}, {"text": "First time I held it I was in love within 3 second. \n\r\nPerfect fit in my hand.", "time": "23rd November 2015, 06:52 AM", "postID": "post63965599", "replies": []}, {"text": "I like this phone", "time": "26th November 2015, 04:40 AM", "postID": "post64013770", "replies": []}, {"text": "It looks very nice indeed, now I know why Google put this \"P\" in the name. But I will now have to live in constant fear of dropping this thing.", "time": "26th November 2015, 04:32 PM", "postID": "post64021310", "replies": []}, {"text": "The phone is gorgeous. I love the aluminum finish and the black bar on top grows on you. I got the graphite finish and it looks great. The display is absolutely stunning. I love it. Only thing I'm not too fond of is that plastic bar on the at the bottom of the phone. Its not the same color as the rest of the body. It looks good overall but if you stare at it too long it can get to you. Other than that the phone looks great!", "time": "26th November 2015, 07:07 PM", "postID": "post64023459", "replies": []}, {"text": "Design-wise, it's not exactly a design i would fall in love with, even when looking at it in person, but i'll give points to Huawei for coming up with a unique yet not bad looking design.", "time": "2nd December 2015, 03:20 PM", "postID": "post64113241", "replies": []}, {"text": "very good!", "time": "18th December 2015, 02:57 AM", "postID": "post64369383", "replies": [{"text": "This is my favorite looking nexus to date and I've owned all of them.", "time": "18th December 2015, 06:49 AM", "postID": "post64371152", "replies": []}]}, {"text": "I like the design but since I use a case, I really don´t care too much about it  The Nexus 6P looks awesome with a Spigen Rugged Armor, especially if you have the dark version of the phone.", "time": "18th December 2015, 12:24 PM", "postID": "post64374295", "replies": []}, {"text": "Using my silver 6P naked, I kind of like it... Actually I'm one of the few people who liked the \"periscope\" shape even more in photos than in real life.\nThat said, the phone is quite good looking, though I'd like a more rounded shape on the upper and lower edges, like the N5.", "time": "10th April 2016, 08:20 AM", "postID": "post66284459", "replies": []}, {"text": "I have a case for the 6P. Although I know that it's a very good thing to have a case, I just can't help myself. At any given point, I try to take my case off because it just looks so great", "time": "11th December 2016, 07:26 AM", "postID": "post70032019", "replies": []}, {"text": "The back of the phone with rhinoshield bumper really stands out. Graphite and grey. Beautiful.", "time": "15th December 2016, 01:01 AM", "postID": "post70094331", "replies": []}, {"text": "I really like the design and look, I don't care too much for the Pixel XL with that huge bottom bezel going on. Had my Black 128gb since release, plan on keeping my 6p for a while nothing else interests me at the moment. \n\nI did notice one day, when I took my Spigen case off it has eaten away at the back of the phone and left silver spots made me sad but I'll get over it.", "time": "19th December 2016, 09:04 AM", "postID": "post70158139", "replies": []}, {"text": "Well actually, the same day I got a haircut I got a compliment on both the haircut and my phone. So we go in a 1:1 ratio for now.\r\nI rate myself an 11 out of 9.", "time": "24th December 2016, 01:02 PM", "postID": "post70234685", "replies": []}, {"text": "Love the overall look of the 6p. Been using the black Rhino Shield bumper on my gold 6p. Got a few questions/ positive  comments about the design at a New Years party. It's the build quality that's a bit underwhelming, especially compared to the N6.", "time": "4th January 2017, 08:48 PM", "postID": "post70395537", "replies": []}, {"text": "It looks awesome. I frequently get people asking me what phone I have. People complain about the plastic bottom and I can see why, although it doesn't bother me at all anymore. I only gave it attention one time, which was when I first picked the phone up. I almost immediately got used to it.", "time": "24th January 2017, 07:44 AM", "postID": "post70700918", "replies": []}]}, {"title": "Quality feel (use of materials)", "rating": 4.5, "links": ["https://forum.xda-developers.com/nexus-6p/review/quality-feel-materials-t3239514"], "threads": [{"text": "Feels great, not that  heavy and fits my paw just right.  Don't feel I will drop it due to it being unbalanced or anything like that", "time": "7th November 2015, 12:26 AM", "postID": "post63697100", "replies": []}, {"text": "Perfect weight balance in combination with very smooth and HQ unibody. Feels simply great to me", "time": "24th December 2015, 04:07 PM", "postID": "post64471723", "replies": []}, {"text": "To be honest with you guys., quality is bad (frost white). \nWhere? \n\"Aluminum is \"very soft\" it's mean is cheap. Chrome bezels are scratching without any force.\nDrapped my phone from my hands to the table, somehow the piece of plastic between the screen and the metal bezel got bite off ! (Maybe it just a rare case of situation, but still).\nWe got gorilla glass 4., damn my left upper corner got light scratching on it., I have no idea how guys. And I always super careful with my gadgets.  \nErgonomic is ok, the sharp bezels bothering a hand for a long time of hold. \n\nSo basicly as a person with a big experience who \"constantly\" changing the phones and \"spending a lot of money\", I can say huawei quality from 10 to 1 is  \"7\"  \nCompare to latest premium build devices as a Apple/Samsung/Sony, Huawei is loosing.\n\n(HTC quality ? It was always good ! (good aluminum) but somehow my front bottom speaker grill (m9), got stick off from right corner. So ? Premium aluminum but bad coincidence? Maybe.) \n\nDo I like the generally the phone? -YES it's beautiful design, good hardware.  Do you like a quality? -NO.\nBest Regards", "time": "21st January 2016, 12:49 PM", "postID": "post64912549", "replies": []}, {"text": "Feels nice in the hand. Quality build and I love the texture of the back.", "time": "13th February 2016, 06:03 PM", "postID": "post65308397", "replies": []}, {"text": "Looks premium but feels cheap in the hand.\nLookwise would give it 8 and feels like a 6.5.\nHere I'm comparing 6p to S6, M9, 6S build quality. Now they look and feel premium but all of those phones were far more expensive at time of launch.\n\nNexus just feels as if it will scratch and mark up so easily due to aluminum being so thin, paper thin.\nI'm quite happy with it but that's mainly because of stock android otherwise would not buy it.", "time": "15th February 2016, 09:30 AM", "postID": "post65333222", "replies": []}, {"text": "I think it feels very nice.\n\nMaybe not like an iphone, but it reminds me on a HTC. Only the volume up/down keys are a little bit shappy.\n\nThe rest is really premium!", "time": "16th February 2016, 12:04 PM", "postID": "post65352289", "replies": []}, {"text": "The phone feels very great! However, it feels as if it would take no force at all to bend this thing", "time": "11th December 2016, 07:27 AM", "postID": "post70032026", "replies": []}, {"text": "Beautiful phone but it definitely seems like some corners were cut with the build quality. The aluminum feels subpar, plastic piece on bottom could have been avoided and volume button should be reinforced.", "time": "4th January 2017, 10:07 PM", "postID": "post70396562", "replies": []}]}, {"title": "Ergonomics (in-hand feel)", "rating": 4.0, "links": ["https://forum.xda-developers.com/nexus-6p/review/ergonomics-hand-feel-t3239515", "https://forum.xda-developers.com/nexus-6p/review/ergonomics-hand-feel-t3239515/page2", "https://forum.xda-developers.com/nexus-6p/review/ergonomics-hand-feel-t3239515/page3", "https://forum.xda-developers.com/nexus-6p/review/ergonomics-hand-feel-t3239515/page6"], "threads": [{"text": "I really wanted to like this phone but I'm honestly returning it due to its massive size it's so sad for me because I didn't want to return it.. so snappy... I'm just gonna have to stick with the note 5...anyone😕😕😕 else returning it due to size?", "time": "7th November 2015, 05:24 AM", "postID": "post63699316", "replies": [{"text": "No size issue here coming from an S6 Edge... The note 5 is bulkier.", "time": "7th November 2015, 05:53 AM", "postID": "post63699559", "replies": []}, {"text": "I wasn't sure about the size either.  But after about a month or two with the phone, I really adapted to it.  The hardest thing for me is how to keep it in my pocket.", "time": "16th December 2016, 03:13 PM", "postID": "post70119082", "replies": []}]}, {"text": "After owning and enjoying four Nexus phones (GNex–N6) I switched to the Galaxy S6 because the N6 was just too bulky. After suffering through TouchWiz for a few months I'm back on Team Nexus and I was worried about going back to a \"big\" phone. I'm happy to say that this phone is so much more manageable than the N6 was. Most of the time I can reach my thumbs across to the opposite side of the phone without issue (upper corner opposite side takes some additional effort). Even with a TPU case on it still feels smaller than the N6 did. I'm anxiously awaiting my Spigen Thin Fit case so bring the mass back down a little.", "time": "7th November 2015, 06:29 AM", "postID": "post63699827", "replies": []}, {"text": "My OnePlus one feels so tiny now, and I'm enjoying the feel quite a lot. That being said I've gotten pretty good at the slide technique so my thumb can hit something in the top left corner then reaching back down with my pinky for support. One handed use is a little diminished, but oh so worth it.", "time": "7th November 2015, 06:53 AM", "postID": "post63700030", "replies": []}, {"text": "The phone is a bit too heavy - something one needs to consider if they have a problem with heavier phones. The s6 edge+ for instance feels incredibly light!", "time": "17th November 2015, 11:07 AM", "postID": "post63869860", "replies": []}, {"text": "For me the size is great. I do like the fell with a small case on the phone better tough( easier to grip)", "time": "17th November 2015, 09:25 PM", "postID": "post63879174", "replies": []}, {"text": "Came from a Note 4 to N6P. It feels substantially smaller. The Note 4 was a brick in it's case. I guess I have big hands, as the N6P seems small to me.", "time": "17th November 2015, 11:59 PM", "postID": "post63881058", "replies": [{"text": "Same. It feels nicer in one hand too. The back is gentle with soft slopes that raises to a sharper point, where it meets the glass. That gives you a good grip with even one hand (If you have big hands). The finger print reader is in the best spot for 90% of it's usage time. The Nexus 6P feels quite long when held in landscape mode, but that's nice when watching movies or playing games. Most of the time you will be using both hands while using the device. Even with my large hands it's a tight fit to go end to end. The 6P is very nice to use as a camera with the hardware buttons. The sharp mechanical clicks are nice and pleasing.", "time": "18th November 2015, 12:39 AM", "postID": "post63881458", "replies": []}]}, {"text": "I don't have any complaints with the size, but I never did with my Nexus 6 either.  Both phones are possible for one-handed operation but the Nexus 6P is a little on the top heavy side.  It's this imbalance compared to the Nexus 6 that makes the phone more of a challenge to use one-handed.  The Nexus 6 was very easy to balance on one finger with the dimple.  With the Nexus 6P, you have to hold the phone closer to the top to ensure it doesn't flop out of your hand.  Maybe it's just me but it feels a little awkward by comparison.", "time": "18th November 2015, 12:52 PM", "postID": "post63888565", "replies": []}, {"text": "Edged are a bit \"sharp\" but overall, fits in the hand as any big screened phone would", "time": "21st November 2015, 12:48 AM", "postID": "post63930859", "replies": []}, {"text": "Hello, \nsome of my previous phones (I use a phone ~95% one handed) \ngalaxy s6: too small, but feels nice, \nm9: same as the s6 but \"slippery\", \nNote 4: uncomfortable to hold, for me the most un-ergonomic device I've ever had, \nlg g3: perfect size, awesome ergonomics - mad electronics 😵 \nNow you hopefully have an idea how to rate my post.. \n\nThe 6p is a big guy and I agree with jcsww that it's top is a little overweight but by the fact that the phone is slightly curved at the back (sideways), it feels much more comfortable my hand than the note 4 and provides the same screen size. The edges of the N6P feel a bit sharp, but not too sharp, I get a nice grip (I prefer this kind of feedback more than the slipperiness of the m9). \n\nTo sum up: size and ergonomics of the Nexus are nearly perfect, only to pull down the status bar isn't easy. This last point is more tricky because of the heavy top of the phone. \nWhile typing it's not the biggest deal in the world, placing the index finger in the area of the fingerprint sensor gives a good stability - sadly it seems to be impossible to pull down the quick settings while holding the phone in this position. \nHowever, the nexus is g8. \n\nGesendet von meinem Nexus 6P mit Tapatalk", "time": "28th November 2015, 04:40 AM", "postID": "post64043455", "replies": []}, {"text": "Just the right size. The N6 felt too big in when held in my hands, the 6P just sits right.", "time": "29th November 2015, 12:34 AM", "postID": "post64056081", "replies": []}, {"text": "I see some people saying its too heavy while i'd disagree with this my iPhone 6+ is just smaller but heavier and using it after the Nexus you can notice it the Nexus feels great in hand! If only it had the 6+ battery then it'd be perfect", "time": "29th November 2015, 08:20 PM", "postID": "post64068424", "replies": [{"text": "How much worse for you than the iPhone 6+? That's what I've been using, but I sooooo miss Android, thinking of going with the 6P.", "time": "1st December 2015, 07:21 PM", "postID": "post64100208", "replies": [{"text": "I've stopped using my iPhone completely now and only using my 6P and not regretting it yet. The battery lasts a day whereas the 6+ lasted 2 days before needing a charge but other than that the 6P is great and I'm glad I'm back on android now.", "time": "2nd December 2015, 08:57 AM", "postID": "post64108609", "replies": []}]}]}, {"text": "Excellent build and feel.  Prefer a case on it, as i have for all my phones, just feels slippery to me if it didn't have a case on it.  To me its the right size", "time": "29th November 2015, 08:43 PM", "postID": "post64068750", "replies": []}, {"text": "Coming from a N5 for the past 2 years. The 6P is a lot bigger for sure, but I wouldn't say uncomfortably large. It's amazingly slim for such a large phone though, and even with a Spigen Tough Armor case on it, I'm getting used to the size. Average-sized hands.\n\nAs mentioned previously, the phone feels extremely solid and well-built. I actually like the hefty weight to it too. Actually feels like you have something in your hand.", "time": "30th November 2015, 01:03 AM", "postID": "post64071770", "replies": []}, {"text": "I feel that this is quite uncomfortable to hold. I used to be complaining about the s6 edge because of the edges but have to say that the size of that thing was much much better (for me)", "time": "30th November 2015, 07:23 AM", "postID": "post64075144", "replies": []}, {"text": "Compared to the LG G3, the in-hand feel is worse. The G3 is lightweight and the in-hand feel is pretty good, because of the rounded corners.", "time": "30th November 2015, 09:23 AM", "postID": "post64076336", "replies": []}, {"text": "Very very slippery. But very comfortable later with a Case On.", "time": "30th November 2015, 12:05 PM", "postID": "post64078018", "replies": []}, {"text": "I love the phone but I just wish the back was contoured a bit better, LG nailed ergonomics with the G4 imho.", "time": "1st December 2015, 09:33 PM", "postID": "post64102132", "replies": []}, {"text": "The phone handles well and the placement of the fingerprint reader is fine.  The one big problem is the placement of the on switch next to the volume rocker.  These buttons should be on opposit sides of the phone.", "time": "7th December 2015, 10:07 AM", "postID": "post64186053", "replies": []}, {"text": "this phone has the best ergonomics i have ever tried.", "time": "7th December 2015, 10:40 AM", "postID": "post64186412", "replies": []}, {"text": "Got the phone during the week at work and got annoyed at location of finger print reader because at work my phone sits on my desk. But now on weekend I can appreciate the location because the phone is mostly in and out of my pocket. \n\n\n\n---------- Post added at 12:32 PM ---------- Previous post was at 12:22 PM ----------\n\nI do need a keyboard that's a little narrower. When reaching across with thumb when trying one handed swiping, the base of my right thumb hits the bottom right of the keyboard. \n\n\n\n---------- Post added at 12:33 PM ---------- Previous post was at 12:32 PM ----------\n\nSomething else I noticed with balancing a bigger phone one handed...the screen rotates landscape more often. Once I get a TPU case put on, I'm sure I'll be able to balance it better.", "time": "13th December 2015, 05:33 PM", "postID": "post64295060", "replies": []}, {"text": "I, like many others, have returned to nexus after a fling with the oneplus one. I was pretty worried about the size but I just had to get a 6p!!\nI am already getting used to the size and am so happy with the phone in general, the placement of the finger reader is perfect!! The phone does require shifting around and preferably two hands in my opinion but it sits nicely in the hand.\nIf you like cases be wary or the added size and texture, a chunky, slippery case could see you dropping the device.", "time": "14th December 2015, 10:00 PM", "postID": "post64316471", "replies": [{"text": "I can't imagine handling a device like this with no case protection.", "time": "15th December 2015, 01:10 AM", "postID": "post64318458", "replies": [{"text": "Agreed! I always have cases for my devices. The added bulk is definitely worth it.", "time": "15th December 2015, 06:59 AM", "postID": "post64321520", "replies": []}]}]}, {"text": "I just got my N6p yesterday.  There's alot to like about this phone but coming from a LG G3 and Moto Turbo 2 this phone is big and heavy.  I have till the 22nd of January to decide if its a keeper or not.  I like just about everything about this phone, only other issue i've had has been with the ear piece speaker, I could barely hear the person I was talking to while in the car today.  I'm also using the Spigen Rugged Armor case which barely adds any bulk to it.", "time": "16th December 2015, 11:28 PM", "postID": "post64350767", "replies": []}, {"text": "If anything it's a tad too big.", "time": "18th December 2015, 06:35 PM", "postID": "post64379878", "replies": []}, {"text": "My only annoyance was that I found the power button to be very sensitive and would often press by itself when I walked with the phone in my pocket, causing the screen to wake up and often skipping/pausing/otherwise messing with my music via the lock screen control.\n\nI was using the Huawei case that came free with the phone, which leaves the power and volume buttons uncovered. I just received this Spigen case, which covers the physical buttons making them much harder to activate accidentally: http://www.amazon.com/gp/product/B016CBF3DE\n\nThis resolves my one complaint and I'm now totally happy with the ergonomics - I couldn't go back to a phone without a fingerprint reader.", "time": "19th December 2015, 04:57 AM", "postID": "post64386040", "replies": []}, {"text": "I love this phone! Just got it in the mail on Thursday June 16th. But, I have to say, the bare phone in hand feel is not great. I literally boxed it back up after playing with it that first day, and I'm not using it again until my new case arrives in the mail sometime next week (because it's so easy to drop because it doesn't feel right in the hand). The problem is that it's too thin (and wide, but the width is only a problem because its so thin)! After I get a case on it, I'm sure it's going to be 100% better in hand feel. Maybe everyone doesn't feel this way, maybe its just because I've always had cases on all my phones, I don't know.", "time": "17th June 2016, 05:43 PM", "postID": "post67363679", "replies": []}, {"text": "I've got quite small hands, I have to admit typing one handed on this phone is a bit difficult.", "time": "18th August 2016, 10:35 PM", "postID": "post68253627", "replies": []}, {"text": "The 6P is probably the best phone I've held in my hand (Except for the OnePlus 3, Damn that feels good). It fits perfectly in my palm and I have a very good grip on it.", "time": "11th December 2016, 07:29 AM", "postID": "post70032052", "replies": [{"text": "This phone literally has no grip to it.", "time": "12th December 2016, 09:18 PM", "postID": "post70058704", "replies": [{"text": "Magnetic skin mods", "time": "19th December 2016, 03:47 AM", "postID": "post70155609", "replies": []}]}]}]}, {"title": "OEM skin/software", "rating": 4.5, "links": ["https://forum.xda-developers.com/nexus-6p/review/oem-skin-software-t3239516", "https://forum.xda-developers.com/nexus-6p/review/oem-skin-software-t3239516/page2"], "threads": [{"text": "I did think you hand-wrote all of the prompts!! I feel so cheated now. Anyway, Android 6.0 is boss and king.", "time": "3rd November 2015, 05:29 PM", "postID": "post63636845", "replies": [{"text": "Haha. Well, at some point they were hand-written!", "time": "13th November 2015, 05:29 PM", "postID": "post63809061", "replies": []}]}, {"text": "Coming from a s6, I missed the fluidity of stock Android. The only thing I miss is multi window. I wish Google would implement this on stock Android especially this phone since it has a big screen. Other than this, the software is pretty much what we've all come to expect from stock Android - very fast and a clean look. Touchwiz was just bogging down the s6 too much and I couldn't bare the lag any more. Haven't come across any of that on the 6p yet", "time": "15th November 2015, 09:08 AM", "postID": "post63833369", "replies": [{"text": "Um, I use multi-window no issues. It is part of Android 6.\n\r\nEnable under Developer Optoins. Not all apps are compatible, same as Samsung's stock  implementation.", "time": "15th November 2015, 11:23 PM", "postID": "post63844935", "replies": [{"text": "Where do you see it in stock Android? I just checked developer options and didn't see any such option as multi window. What category is it under?", "time": "15th November 2015, 11:30 PM", "postID": "post63845014", "replies": [{"text": "Pretty sure it's achieved by editing a build.prop thing. Search on it, there's an XDA thread on it. But requires root, obviously. Then the option pops up in developer options.", "time": "17th November 2015, 01:02 AM", "postID": "post63863756", "replies": []}]}]}]}, {"text": "Vanilla Android, can't get any better than that.", "time": "29th November 2015, 12:35 AM", "postID": "post64056086", "replies": []}, {"text": "so nice! very sleek design, feels great in the hand and very thin! feels just a little to slippery making a case a requirement.", "time": "8th December 2015, 06:35 PM", "postID": "post64211843", "replies": []}, {"text": "I love the feeling of the phone, light but a nice solid feeling. I will have to agree with the person above me, it is slippery. I am putting an Armorguard screen protector on and a dbrand skin on the back, to hopefully give it a little more grip. I so far love the placement of the fingerprint scanner, makes unlocking the phone easy for me. Loving stock android, Samsungs crapware was not cup of coffee...", "time": "9th December 2015, 01:30 PM", "postID": "post64225131", "replies": []}, {"text": "This phone lasted me entire day, until a few drops of water hit it and the touchscreen stopped responding.\n\r\nVery bummed out!", "time": "28th March 2016, 03:43 AM", "postID": "post66071224", "replies": []}]}, {"title": "Outdoor visibility (max brightness)", "rating": 4.0, "links": ["https://forum.xda-developers.com/nexus-6p/review/outdoor-visibility-max-brightness-t3239517", "https://forum.xda-developers.com/nexus-6p/review/outdoor-visibility-max-brightness-t3239517/page2", "https://forum.xda-developers.com/nexus-6p/review/outdoor-visibility-max-brightness-t3239517/page3", "https://forum.xda-developers.com/nexus-6p/review/outdoor-visibility-max-brightness-t3239517/page6"], "threads": [{"text": "Gets really bright, not as bright as Note5.", "time": "3rd November 2015, 01:25 AM", "postID": "post63625546", "replies": []}, {"text": "It may not be the very best according to some but I can perfectly see the screen without having to cover the phone from the sun while wearing my polarized sun glasses. This is with adaptive display turned on.", "time": "7th November 2015, 10:18 AM", "postID": "post63701863", "replies": []}, {"text": "No complaints... Better than I expected after reading some reviews", "time": "7th November 2015, 03:09 PM", "postID": "post63705557", "replies": [{"text": "same here! love this phone.", "time": "28th November 2015, 03:13 AM", "postID": "post64042769", "replies": []}]}, {"text": "yes it has a gr8 screen", "time": "7th November 2015, 03:27 PM", "postID": "post63705842", "replies": []}, {"text": "Really struggle compared to previous phones.", "time": "7th November 2015, 08:13 PM", "postID": "post63710070", "replies": []}, {"text": "I have htc m8\n..I see this one better and it's sunny at the moment of writing this. I guess if you're coming from a Samsung s6", "time": "7th November 2015, 08:17 PM", "postID": "post63710132", "replies": [{"text": "Not overly bothered either way, comparison was against an S5 which I thought was marginally better.", "time": "7th November 2015, 09:03 PM", "postID": "post63710773", "replies": []}]}, {"text": "When I got my 6p, my screen was a, sort of, two-tone. A light pink hue in the top left of my screen, that faded diagonally, to a bottom right, bluer hue. I was about to rma, even called Huawei. (Let's hope no one has to go through them) I thought it may be the back light calibration. So I downloaded lux, and voila, my colors were evenly distributed across my screen. And in turn, added a lil brightness outdoors. I turned lux off and my calibration is correct now. My screen, to me, looks a lil richer now and is pretty impressive. I'm coming from the Note 4 too.", "time": "7th November 2015, 10:33 PM", "postID": "post63711830", "replies": []}, {"text": "Better than the N6 when viewing in the sunlight...", "time": "8th November 2015, 02:05 AM", "postID": "post63714014", "replies": []}, {"text": "Nice screen. Still prefer Note 5 screen.", "time": "15th November 2015, 03:18 AM", "postID": "post63830178", "replies": []}, {"text": "it bright enough for me. I can see the screen in full daylight fine.", "time": "15th November 2015, 06:16 AM", "postID": "post63831777", "replies": []}, {"text": "Coming from a Galaxy S4, the 6P gets More brighter, and More dimmer than the S4. Was not expecting this great of a screen after reading all the posts.  Unlike the S4, your eyes wont hurt when you wanna read something in bed with the lights off!", "time": "15th November 2015, 12:27 PM", "postID": "post63835499", "replies": [{"text": "Totally can relate. I came from an S4 and I noticed the brightness difference immediately.", "time": "24th November 2015, 07:57 AM", "postID": "post63982692", "replies": []}]}, {"text": "I know this is the wrong place to ask but does anybody has som feeling how the display is compared to Iphone 6 Plus in brightness outdoors?", "time": "23rd November 2015, 07:45 AM", "postID": "post63966046", "replies": []}, {"text": "I feel like I'm doing something wrong, because my experience has been the complete opposite of what everyone is saying here. The screen is fine indoors or out of direct sunlight, but in direct sunlight it's crazy hard to see.  I have adaptive brightness off, and the brightness setting cranked. Just prior to this phone I'd tried out the Moto X Style, and while every review I read knocked that phone for its display, I feel like outdoor viewing was significantly better, and it didn't have any of the blotchy/uneven/pink hued issues that amoleds apparently have.", "time": "28th November 2015, 07:52 PM", "postID": "post64053124", "replies": []}, {"text": "Outdoor visibility is extremely poor. Worse than my Nexus 5", "time": "30th November 2015, 08:17 AM", "postID": "post64075666", "replies": []}, {"text": "Also really poor sunlight visibility here. RMA?", "time": "4th December 2015, 03:54 AM", "postID": "post64138923", "replies": []}, {"text": "My 6p is bright enough for outside, but I have to be careful not to cover the sensor or the adaptive brightness will dim the screen.", "time": "4th December 2015, 04:47 AM", "postID": "post64139296", "replies": []}, {"text": "No problems with outdoor visibility on max brightness.", "time": "4th December 2015, 03:31 PM", "postID": "post64146198", "replies": []}, {"text": "Compared to my N5, I had to use a bit more brightness. I've since then switched off adaptive - even in direct sunlight with 85-100% brightness you can see the screen just fine. This is with no screen protector, I'll know tomorrow when it comes in though.", "time": "5th December 2015, 05:47 AM", "postID": "post64155204", "replies": []}, {"text": "Great Display Plagued by an annoying Pink Hue Issue on some devices", "time": "1st January 2016, 05:07 PM", "postID": "post64593037", "replies": []}, {"text": "Max brightness work for me", "time": "1st January 2016, 05:42 PM", "postID": "post64593490", "replies": []}, {"text": "using high brightness mode, my 6p has enough brightness even under direct sunlight", "time": "1st January 2016, 10:19 PM", "postID": "post64596922", "replies": []}, {"text": "thx", "time": "6th February 2016, 03:20 PM", "postID": "post65181488", "replies": []}, {"text": "I came from the Note 5 (after Note 4).  I had the Nexus 6 and boy was that horrible.  After testing one of these though, I instantly bought the 128GB version and will never look back @ Samsung.\nThere is no debating that the latest Samsung phones have the BEST displays, but this one is ALMOST as good!  Many times better than the original Nexus 6, and the fact that it's so close to Samsung's screen brightness is amazing. \nAside from a few minor hardware differences... THIS IS PURE GOOGLE.  Who gives a RIP if you can't see the phone QUITE as well in direct sunlight, when you have all of this Nexus goodness.  The modding community is far superior, the speakers BLOW Samsung out of the WATER, the USB-C is awesome, it doesn't have the Samsung bloatware (or the bugs when you remove it)....\nIf Note 5 display was 10/10, this is 9.8/10 from me.", "time": "15th February 2016, 10:41 PM", "postID": "post65344651", "replies": []}, {"text": "I don't have any issues seeing the phone outside with my sunglasses on. I'll admit it is a bit dim but I'm using sunglasses so I expect that.", "time": "6th March 2016, 07:34 PM", "postID": "post65688594", "replies": []}, {"text": "My previous GS6 had brighter screen, but since I'm using custom kernel with HB mode I can't complain to much - although it's still winter in Poland and there's not much sun out there.", "time": "7th March 2016, 09:18 PM", "postID": "post65709102", "replies": []}, {"text": "It isnt the best one i`ve tried, but handle it well", "time": "8th March 2016, 02:22 AM", "postID": "post65712619", "replies": []}, {"text": "I am really surprised at the high rating for this screen in direct sunlight.  I think it is one of the worst I have used since my HTC Inc2. Trying to take pictures on a sunny day is nearly impossible to even see what you are looking at. I do like the screen for indoor and low light very much.", "time": "18th April 2016, 03:42 PM", "postID": "post66425916", "replies": []}, {"text": "It's good enough at max brightness, not much glare so that helps.", "time": "18th August 2016, 10:51 PM", "postID": "post68253829", "replies": []}, {"text": "with Android N, adaptive brightness off, the max brightness is now the high brightness mode !! so we don't need root+custom kernel for this feature", "time": "25th August 2016, 06:04 PM", "postID": "post68363707", "replies": [{"text": "Interesting. I thought my eyes were deceiving when I noticed the screen looked brighter outdoors. Even with Adaptive Brightness on.", "time": "25th August 2016, 09:44 PM", "postID": "post68367201", "replies": []}]}, {"text": "Wondered if that was the case, or whether I'd just become used to it.  It seems fine outdoors now (well, as fine as most smartphones get in daylight, they're never perfect)", "time": "9th October 2016, 12:33 PM", "postID": "post69045617", "replies": []}]}, {"title": "Contrast (true blacks)", "rating": 5.0, "links": ["https://forum.xda-developers.com/nexus-6p/review/contrast-true-blacks-t3239518", "https://forum.xda-developers.com/nexus-6p/review/contrast-true-blacks-t3239518/page2"], "threads": [{"text": "Great contrast thanks to AMOLED", "time": "3rd November 2015, 01:26 AM", "postID": "post63625551", "replies": []}, {"text": "It gets backly black as if the screen was off exactly like other OLED displays I've used(S4, Note 4, S6)", "time": "7th November 2015, 10:15 AM", "postID": "post63701825", "replies": []}, {"text": "AMOLED\n\r\n/thread", "time": "18th August 2016, 10:27 PM", "postID": "post68253540", "replies": []}, {"text": "Actually, in real world usage blacks are pretty poor/washed out, unless you're in a dark room. When the screen is off you can see the surface of the screen is much lighter than, say, Samsung AMOLED phones. It's more like greenish dark grey rather than black so even if the actual pixels are turned off, it doesn't look black. It's even worse than many LCDs. I have no idea how come no one has mentioned this in any reviews, or at least I've never seen it.", "time": "30th August 2016, 07:36 PM", "postID": "post68448992", "replies": [{"text": "ROFL are you hallucinating? My 6P's blacks are pitch black. The way I can tell... The edge of the screen, when black, is equal to the blacks on the top and bottom of the screen.", "time": "31st August 2016, 07:12 PM", "postID": "post68465563", "replies": [{"text": "Except that is not true. Take a look at the screen when it is turned off. The surrounding bezel is truly black but the screen itself is greenish gray, meaning blacks are not getting darker than that. Then look at a Samsung AMOLED phone and you'll see it's the other way around, it's the screen itself that is as black as it gets. Samsung obviously uses different filters/polarizers which result in much better blacks in anything other than total darkness. I just compared my 6P to an old Galaxy S2 and again, the S2 has much deeper blacks thanks to the actual surface being much darker. You only really get true pitch black when you're using the 6P in a dark room. Otherwise blacks are pretty much on par with your average LCD, which is a poor result for an AMOLED screen.", "time": "1st September 2016, 10:47 AM", "postID": "post68474281", "replies": [{"text": "Well, it's true on mine. Maybe your panel is different then mine. I just compared my 6P to my Note 4 and they look the same. Which makes sense since Huawei buys there panels from Samsung so they are the same panels.  Only difference is Samsung panels get a few nits brighter.\n\nGuess we can agree to disagree. Especially since you can get different quality panels from phone to phone. Just like that can happen on Samsung phones.\n\nOh and I forgot, there are no filters to make blacks, black as you don't filter light on Amoled screens. The pixel just doesn't receive power so the pixel is off, not filtered. What you are referring to is an LCD panel, not Amoled", "time": "1st September 2016, 11:46 AM", "postID": "post68474917", "replies": [{"text": "It has nothing to do with pixels being off. Look here https://technology.ihs.com/509943/wh...-use-polarizer\n\r\nRemember the first Nexus, the Nexus One? It also had an amoled screen, with terrible blacks. How was that possible? Because the actual surface of the screen was so reflective, if there was even a little bit of ambient light reaching the screen it would completely wash it out. Whether the actual pixels emitted any light was irrelevant in any other conditions other than complete darkness. \n\r\nThere are no different panels being used on the 6P. Just take the phone out of a dark room and you'll see the screen is clearly not as black as the bezels when it's turned off. I have so far compared it to the following phones: Note 5, S6 edge, S4, S4 mini, S2. All of them have deeper blacks than the 6P due to their surface being darker. It may be a Samsung panel but it's not the same one as used by Samsung on their devices. Even Anandtech have mentioned it uses different lamination which actually provides slightly better viewing angles. What's strange is that the more off angle you go, the lighter the surface appears. Can be seen in this video comparing the 6P to the 5X http://www.youtube.com/watch?v=GXtDCBSKQV8&t=3m44s Obviously it's not as bad when looking head on but it's still pretty poor for an amoled screen.", "time": "1st September 2016, 04:04 PM", "postID": "post68478479", "replies": [{"text": "Hmmm sorry man mine is just black. Agree to disagree. Can't say any better then that. I'm moving on. If your not happy with the phone for that reason, sell it and get a Samsung.", "time": "1st September 2016, 04:23 PM", "postID": "post68478755", "replies": []}]}]}]}, {"text": "That's true. I usually root to get the tinted  navigation bar but this time i didn't root to get that because the blacks are usually same as the bezel of the phone which looks damn good.", "time": "6th September 2016, 08:21 AM", "postID": "post68551349", "replies": []}]}]}, {"text": "Well, it was nice discussing with you but one may as well say \"mine is pink, agree to disagree\". It doesn't really mean anything as far as facts go. \n\r\nI just took out my old Nexus 5 and surprise surprise, it absolutely kills the 6P when it comes to black depth in well lit conditions. The surface of the screen simply reflects way too much light.", "time": "1st September 2016, 04:48 PM", "postID": "post68479150", "replies": [{"text": "I agree with this completely. It's pretty hard not to notice that there is a definite green/brown tint to the display in contrast to the surrounding black bezel when in good ambient light. I came from a Nexus 4 and I was immediately disappointed by this aspect of the 6P display. Since then I have reconciled this disappointment with the fact that the 6P is overall a fantastic phone with substantially better value than other premium phones.\n\r\nI'm not 100% sure that it's much better on Samsung devices because Samsung goes out of its way to mask this issue by making the top and bottom bezels of their phones different (non-black) colors. I'll even go so far as to suggest that the curved display on the Edge was a gimmicky attempt to obscure this issue. This, among others, is an AMOLED problem and why Apple hasn't used them. Still love the 6P, especially now on Nougat.", "time": "5th September 2016, 12:18 AM", "postID": "post68531508", "replies": []}]}, {"text": "Hahaha so many people here producing disinformations...\n\n\nAMOLED, especiall Super, has 0.098% of light coming thru when fully black but on. That's the blackest as it gets. \n\n6P, Note's, S6, S7. have the BEST SCREENS around. And by far.\n\n\nTurn on sRGB mode in developer options if u want, a bit washed, but 100% accurate colors. What u see is what u get on print. But why would u use that, unless you're a professional photographer like me.", "time": "1st September 2016, 06:57 PM", "postID": "post68481121", "replies": [{"text": "Coming through what? Screen surface reflectiveness is what matters the most when it comes to black depth outdoors. LCDs have extremely high MEASURED black levels in comparison to AMOLED but you can't see that outside because of ambient light. Case in point, the 6P looks worse than most good LCDs outside. It's like when people claim plasma TVs have amazing blacks but forget to mention that is only true in low light conditions.", "time": "1st September 2016, 09:50 PM", "postID": "post68483475", "replies": []}]}, {"text": "Jockson I understand and agree with you. The screen on the 6P has a lighter surface color than the black bezels above and below which is noticeable. It isn't a major detractor from the visual quality screen on, but I agree that in a bright setting, blacks don't get to be as black as could be. It isn't bad by any means, but unless you get a completely black unreflective layer it may not be easy to improve (or Samsung is hogging it all to themselves).\n\nEither way, you're right though the quality of the screen is still really good on the 6P so, yea. Still like my 6P, even after using a HTC 10 with it for the past 6 months. Both great, but the 6P has me returning to it more, for now.", "time": "1st September 2016, 10:22 PM", "postID": "post68483861", "replies": []}, {"text": "Finally someone understands what I'm talking about. I don't want to \"sell this phone and buy a Samsung then\". I already had the Note 5 and got rid of it for the 6P. Love this phone, love the screen as well in low light conditions. But this really caught me by surprise. I've switched to a full black theme and outside, it really shows how washed out it really is. On a cloudy day outside, blacks on the Note 5 look almost perfectly black and yet the 6P next to it looks horribly washed out and more like greenish grey. I knew it wouldn't compete with the Note 5 in direct sunlight but it's pretty disappointing that it loses out considerably in medium light conditions as well. And not only to the Note 5 but to the ancient S2 as well. The display surface just doesn't look like any Samsung amoled phone ever which is pretty strange.", "time": "2nd September 2016, 08:56 AM", "postID": "post68489278", "replies": []}, {"text": "You are absolutely right regarding Samsung making their bezels non black. Even on their black phones bezels are often very, very dark grey. But still, their screens do have far less reflective surface. I wasn't really sure myself was it such a big difference until I compared it side by side with the Note 5, S6 edge and S2. The 6P just looks green and very washed out in comparison. \n\r\nPeople often forget it's the perception of contrast that matters, not the absolute measured black level. LCD often gets criticized for poor contrast but visually it has deeper blacks than plasma and CRT do, except in low ambient light. Same story with the 6P. Great blacks when there isn't much light around, otherwise pretty poor and washed out.", "time": "5th September 2016, 05:55 PM", "postID": "post68542706", "replies": [{"text": "Well yes if the screen is off and you're in sunlight, you can see the difference from the bezel. That's normal for every phone. I rarely use my phone in direct sunlight. I'm talking about normal use and when the screen is on, I can not tell the difference if say the status bar is black and the edge/top/bottom of the bezel. So if you're just talking about screen off and in bright light/sunlight.... that's every phone basically. But I don't stare at my phone and worry about how dark the screen is when it's off.", "time": "6th September 2016, 02:38 AM", "postID": "post68548737", "replies": [{"text": "How dark the screen is when it is turned off IS what the blacks actually look like. It can't look any darker than that, the screen doesn't emit the \"black\" color  When there is bright content on the screen it just tricks your eyes/brain into thinking black areas are darker than they really are but in reality, contrast is still pretty poor. \n\r\nI'm not talking about direct sunlight either. Even in medium ambient light blacks wash out considerably. Certainly MUCH more than they do on Samsung AMOLED phones and most LCDs so no, not every phone is the same. The 6P display just isn't very good in this regard.", "time": "6th September 2016, 08:59 PM", "postID": "post68561470", "replies": []}]}]}]}, {"title": "Color saturation & accuracy", "rating": 4.5, "links": ["https://forum.xda-developers.com/nexus-6p/review/color-saturation-accuracy-t3239519", "https://forum.xda-developers.com/nexus-6p/review/color-saturation-accuracy-t3239519/page2", "https://forum.xda-developers.com/nexus-6p/review/color-saturation-accuracy-t3239519/page3"], "threads": [{"text": "dislike the orange color though...too high", "time": "20th November 2015, 10:40 AM", "postID": "post63920108", "replies": []}, {"text": "Damn. I'm colorblind. I guess I'll disregard", "time": "20th November 2015, 03:49 PM", "postID": "post63924048", "replies": []}, {"text": "The contrast is so high (when not in rgb mode) that it's almost unbearable to look at (for fussy people like me).\n\r\nUnfortunately the rgb mode seems to dull things a bit too much...would be nice to have something in between.", "time": "20th November 2015, 05:07 PM", "postID": "post63925270", "replies": []}, {"text": "Similar to the Nexus 6 I felt the display was too warm so I was very happy to install a kernel to make adjustments.", "time": "20th November 2015, 06:49 PM", "postID": "post63926798", "replies": []}, {"text": "With the display set to sRGB mode (developer settings), images compare very closely to my calibrated laptop.  \nsRGB looks very accurate.", "time": "20th November 2015, 07:02 PM", "postID": "post63926993", "replies": [{"text": "I did a re install of the factory image and sRGB got checked during setting things back up on accident and I thought the factory image messed it up lol. Then I read this and turned it off. Much better.", "time": "11th December 2015, 07:18 PM", "postID": "post64265850", "replies": []}]}, {"text": "White is a bit warm/yellowish in comparison to another 6P.", "time": "7th December 2015, 09:07 AM", "postID": "post64185406", "replies": [{"text": "another 32gb Nexus6p or 64gb N6p>??", "time": "28th December 2015, 11:14 AM", "postID": "post64525705", "replies": [{"text": "32GB silver vs 64GB white\n\nGesendet von meinem Nexus 6P mit Tapatalk", "time": "29th December 2015, 06:50 PM", "postID": "post64548376", "replies": []}]}]}, {"text": "By default it's too saturated, like the older Samsung AMOLEDs.  sRGB is a bit too bland and blue but better.\n\r\nOnce I rooted and installed a custom kernel, I specifically reduced only saturation and now the panel is great.", "time": "11th December 2015, 07:27 PM", "postID": "post64265955", "replies": []}, {"text": "I have a Nexus 4 as well.\n\nIn Nexus 4, the white is really white. But in Nexus 6P, the white is yellowish/pinkish(and it is really bothering me). Is it just my display or is it the case with everyone?\n\nP.S. The black is really black though and the other colours seem to be fine.", "time": "28th December 2015, 08:01 AM", "postID": "post64523754", "replies": [{"text": "My Nexus 6p at the yellow screen... it's really bad!", "time": "28th December 2015, 11:39 PM", "postID": "post64535631", "replies": []}]}, {"text": "I just got my 6p - what is the general consensus on using sRGB mode mode? thanks", "time": "29th December 2015, 04:57 PM", "postID": "post64546677", "replies": []}, {"text": "I recently bought Nexus 6P. The color saturation was perfect initially. After I tried the color inversion once, the saturation has got high. I tried fixing it through SRGB but the saturation gets too low. Not able to find a middle ground. Please help. Thanks in advance.", "time": "14th May 2016, 09:35 AM", "postID": "post66845289", "replies": []}, {"text": "the only downside \ndisplay is old amoled \nbad screen\ni had zte z11 max \nit has better screen", "time": "5th October 2016, 02:16 AM", "postID": "post68985632", "replies": [{"text": "With a custom kernel like ElementalX, and with the good adjustments you got one of the best screens.", "time": "5th October 2016, 08:17 AM", "postID": "post68988360", "replies": [{"text": "Can you share your settings?", "time": "5th October 2016, 04:11 PM", "postID": "post68993655", "replies": [{"text": "I use ex kernel manager :\r\nRed : 210\r\nGreen : 222\r\nBlue : 256\r\nSaturation : 42\r\nValue : 136\r\nContrast : 134\r\nTint : 0", "time": "5th October 2016, 06:13 PM", "postID": "post68995322", "replies": [{"text": "Thank you!", "time": "5th October 2016, 08:34 PM", "postID": "post68997283", "replies": [{"text": "You're welcome, in the exkernel manager you'll find some presets, just pick one.\r\nOr check this topic for other presets : http://forum.xda-developers.com/nexu...files-t3251964 \r\nI took mine from @sn0warmy settings.", "time": "5th October 2016, 10:27 PM", "postID": "post68998588", "replies": []}]}]}]}]}]}, {"text": "Yeah the Amoled panel in this phone is not good at all. However it gets tolerable with a custom kernel and color adjustments. This isn't a color accurate screen in any way. My Honor 8 and XA Ultra has way better screens even though they are LCD.", "time": "5th October 2016, 06:52 AM", "postID": "post68987662", "replies": []}]}, {"title": "Clarity/resolution", "rating": 5.0, "links": ["https://forum.xda-developers.com/nexus-6p/review/clarity-resolution-t3239520"], "threads": [{"text": "that QHD display <3_<3 , very vivid colors, yet not over saturated looks great with minimal kcal tuning.", "time": "8th December 2015, 06:36 PM", "postID": "post64211862", "replies": []}]}, {"title": "Minimum brightness", "rating": 5.0, "links": ["https://forum.xda-developers.com/nexus-6p/review/minimum-brightness-t3239521"], "threads": [{"text": "I agree with his opinion", "time": "7th November 2015, 03:40 PM", "postID": "post63706051", "replies": []}, {"text": "In dim brightness,  while reading  a book, when i move the page, the screen starts to Flickr,  its abit annoying but managable,  dont know if its normal or a malfunction", "time": "3rd February 2016, 01:45 PM", "postID": "post65126550", "replies": [{"text": "Same here.. \n\r\nI wonder if this'll be fixed.. \n\r\nGets quite annoying at times..", "time": "16th February 2016, 07:04 PM", "postID": "post65359183", "replies": []}]}]}, {"title": "Call quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/nexus-6p/review/call-quality-t3239522", "https://forum.xda-developers.com/nexus-6p/review/call-quality-t3239522/page2", "https://forum.xda-developers.com/nexus-6p/review/call-quality-t3239522/page3", "https://forum.xda-developers.com/nexus-6p/review/call-quality-t3239522/page6"], "threads": [{"text": "Call quality is just fine. However I have a bug where if I start a call on speaker then switch to handset, the mic is muted. Gah!", "time": "6th November 2015, 02:00 PM", "postID": "post63688042", "replies": []}, {"text": "When you hang up while you were on speaker, do you still here that annoying peep !!!!!!", "time": "7th November 2015, 01:28 PM", "postID": "post63704087", "replies": []}, {"text": "Call quality is excellent but on T-mobile, I randomly lose LTE data and only get it back by rebooting the phone.  Not cool.", "time": "9th November 2015, 04:18 PM", "postID": "post63740016", "replies": []}, {"text": "2 Verizon phones here, many callers complaining of the call sounding \"muffled\" on their end....have found other reports online of the same issue.  Pretty good on my end, but apparently not so great on the receiving end.", "time": "9th November 2015, 07:17 PM", "postID": "post63741829", "replies": [{"text": "I posted a fix for this over on reddit. Apparently what is happening is the noise cancellation is interpreting your voice as noise and is attempting to cancel it resulting in a muffled sound. Turning off in call noise cancellation seems to solve the problem. To do this you need to edit your build.prop.  The easiest way is to download a build.prop editor. Open it up, locate persist.audio.fluence.voicecall, and change it to false. Save and reboot. Should solve the muffled sounding voice problem.", "time": "14th November 2015, 08:03 PM", "postID": "post63825580", "replies": [{"text": "Thanks, I know that's the fix....it just blows that root is required (I could easily do it to mine but my wife has no desire to let me root hers).  After experimenting, the easiest \"fix\" I've found is to just make sure the bottom speaker is more in line with your mouth and that you don't let the phone \"slouch\" more vertically (resulting in the bottom speaker being closer to your shoulder).", "time": "15th November 2015, 12:44 AM", "postID": "post63828796", "replies": []}]}]}, {"text": "Google Fi and have had no issues with call quality. Though today I had issues with my proximity sensor not detecting right during a call.", "time": "9th November 2015, 08:49 PM", "postID": "post63743233", "replies": []}, {"text": "Did the conference call to compare nexus 6 with the 6p. Definitely muffled sound. The other party always complain. So returning this unit, getting another one tomorrow. On t-mobile network.", "time": "11th November 2015, 06:56 AM", "postID": "post63766753", "replies": []}, {"text": "On Verizon, i get a noticable buzz as my contact is talking and my volume is Medium high  or above.  on headset. Has anyone else experienced this?", "time": "11th November 2015, 08:50 AM", "postID": "post63767840", "replies": [{"text": "With HD calls on T-Mobile I hear static behind every sound. Besides that everything is fine and calls sound great", "time": "11th November 2015, 01:45 PM", "postID": "post63771098", "replies": [{"text": "Mine almost sounds like the speaker is blown out during calls but not when music is played or anything. Also, if I connect Bluetooth during calls or a device other than the phone speaker, the static goes away :-/", "time": "11th November 2015, 04:19 PM", "postID": "post63773529", "replies": []}]}]}, {"text": "Sounds like mixed results so far. For those that say it's muffled, what are you comparing the call quality to?", "time": "11th November 2015, 09:38 AM", "postID": "post63768339", "replies": [{"text": "My old HTC one m7 lol. Call quality was brilliant on that. Slightly muffled (for other person) on 6p", "time": "11th November 2015, 11:13 AM", "postID": "post63769251", "replies": []}]}, {"text": "I'm getting a very clean call quality on Google Fi. It's much louder on both ends compared to my old 2013 Moto X on Verizon.", "time": "11th November 2015, 07:32 PM", "postID": "post63776459", "replies": []}, {"text": "As with previous Nexii, the proximity sensor doesn't work properly.  Sometimes when ending a call, I take the phone away from my face and notice the notification shade pulled down, because the proximity sensor didn't activate and turn the screen off soon enough.", "time": "14th November 2015, 03:53 PM", "postID": "post63822350", "replies": []}, {"text": "Also slightly muffled on most calls for verizon.. Only time it's not may be when it's on HD calling with someone who has it..", "time": "14th November 2015, 06:02 PM", "postID": "post63824121", "replies": []}, {"text": "I am on T-mobile in the US... I was getting comments like speak up.. Sound like you are in a tunnel.. It turns out that covering the noise cancelling mic on the back with your shoulder or a pillow etc causes a problem..\n\nIt seems like you have to have root to turn off that feature.\n\nBut most of the time calls are clear...", "time": "17th November 2015, 06:07 PM", "postID": "post63876143", "replies": []}, {"text": "I'm switching from my Nexus 6 and so far my reception is better, and my wife says that she can hear me much better than on my old phone. I am using project Fi", "time": "20th November 2015, 07:14 PM", "postID": "post63927161", "replies": []}, {"text": "If you use Bluetooth or actually hold your phone, then you will be fine. It seems that the problems appear when you try to use the phone without hands by placing it on your shoulder and covering the rear noise cancelling mic.", "time": "23rd November 2015, 01:51 PM", "postID": "post63969920", "replies": []}, {"text": "On verizon had this issue.  Turned off enhanced LTE calling, issue went away.", "time": "24th November 2015, 12:54 AM", "postID": "post63979012", "replies": []}, {"text": "Pretty good. I can hear the other person just fine however a few times I've heard that others can't hear me. On the Nexus 6, I struggled to hear what others were saying at times because the maximum call volume was just not high enough IMO - no such problem on the 6P.", "time": "24th November 2015, 12:58 AM", "postID": "post63979046", "replies": []}, {"text": "muffled on most calls for the other side and always cant hear me.\r\nseems to be the noise cancellation problems, hopes to be solve by update", "time": "24th November 2015, 01:44 AM", "postID": "post63979443", "replies": []}, {"text": "The problem is not everyone will tell you they can't hear you. But if you get someone who's honest they'll tell you it sounds like sh!t. I have the same problem and no matter how I hold the phone they say I sound far away or muffled. Again hopefully it will be resolved.", "time": "27th November 2015, 06:45 PM", "postID": "post64037616", "replies": []}, {"text": "People say it sounds like I am in a tunnel or far away and even cuts in and out. All Google wants to do is replace device but from the sounds of it here that is not going to fix the issue ( that sucks )  \n So I have decided to get a new devise because I have been told through support that some of the earlier devices have had some hardware issues, on that note we will see in a couple days if that is in fact the case or not. I will update after a couple days of use.", "time": "1st December 2015, 05:39 PM", "postID": "post64098673", "replies": [{"text": "It might be worth exchanging the phone. There's a good chance at least some of these issues are related to Huawei's quality control. Many people report great call quality on the 6P.\n\r\nThe 6P seems to be very sensitive to how you position your mouth relative to the bottom speaker cut out, where the main mic is housed. If the mic was misaligned during manufacture it would be easy for this to make it difficult for it to pick up your voice. Mics and earpieces on phones can be very senstive to how they are aligned.\n\r\nThis doesn't address the issue of covering the noise cancelling mic on the back of the phone and how that effects call quality. But a replacement might address some of the issues. Of course, I can't promise that. Enough people have this issue that you could get another handset with problems.\n\r\nYou could also wait a little longer, maybe, until January or February and then do the replacement, with the hope that Huawei will have addressed build quality issues by then. Though that's just guessing that this might happen.", "time": "9th December 2015, 01:29 AM", "postID": "post64217469", "replies": []}]}, {"text": "I also hear when you have your phone plugged in, it sounds messed up .", "time": "4th December 2015, 05:24 PM", "postID": "post64147745", "replies": []}, {"text": "When my phone is plugged in people can't here me, until i pull my cable out. Anyone else having this problem? Sometimes i dont here the ringtone before they answer ..its just silent.", "time": "11th December 2015, 10:00 PM", "postID": "post64267954", "replies": []}, {"text": "I got the phone yesterday, made a few calls on it today.  One person couldn't hear me at first, another person I could barely hear them, I was also in the car.  I just called my mom who's also on Verizon with an iPhone 6, the call was far from \"clean\" I could hear noise in the background.", "time": "16th December 2015, 11:42 PM", "postID": "post64350917", "replies": []}, {"text": "So my girlfriend and i both have nexus 6P's and we both have had issues with the call quality. Some issues im experiencing are muffled voice or the \"tunnel\" effect. Google knows this and androidpolice made an article saying they know this is an issue and could be fixed with an update. If you google Nexus 6P mic androidpolice you can find it. ( i cant post links)", "time": "18th December 2015, 02:13 AM", "postID": "post64369001", "replies": []}, {"text": "I got the 6.0.1 update and that resolved it for me. Callers say I'm clear as day. It's still early. I will be back if things change.", "time": "18th December 2015, 02:47 AM", "postID": "post64369300", "replies": []}, {"text": "Huawei Nexus 6P <Mod Edit - Link Removed> is an amazing mobile phone, with great features. I have been using this mobile, and the call quality is fine and muffled voice when using the phone.", "time": "13th January 2016, 12:31 PM", "postID": "post64785408", "replies": []}, {"text": "Well i'm going to give my 2nd replacement phone a try.  Its been a bout a month since I got my 2nd one so maybe the difference in production time will give me a better egg.  I love this phone and even if this 3rd one doesn't fix my issue i'll keep it.  Turning off Enhanced LTE fixes my issues, maybe I can find a toggle for it.", "time": "20th January 2016, 02:01 AM", "postID": "post64890761", "replies": []}, {"text": "Haven't had any issues with call quality. In fact, the speakers make for a very clear sound. Can't say I've had any complaints in regards to muffling.", "time": "20th January 2016, 08:36 AM", "postID": "post64894152", "replies": []}, {"text": "I've had this phone for a few months now. The call quality over the speakers is trash and unacceptable. People on the other end consistently have difficulty hearing me and there is also an echo. It's very annoying, especially for a work phone. I shouldn't have to root to fix this. Does N address this issue at all? I am hoping there is a software fix and not a hardware problem.", "time": "16th July 2016, 11:15 AM", "postID": "post67768471", "replies": []}, {"text": "I also suffer from the muffled voice sound on handset mode. I have since rooted and disabled audio.fluence and it works fine on handset mode, but actually mess up my speakerphone mode. With the root trick, speakerphone would have a ton of feedback sounds that it is not tolerable. Without the root, 4/5 conversations I have the other party complaining about being hard to hear me.\n\nI've sent the device to Huawei for repair and they obviously did not do anything and just sent the phone back to me...\n\nHas anyone tried the custom ROMs and were they able to fix the muffled sound issue?", "time": "18th August 2016, 04:22 AM", "postID": "post68240176", "replies": [{"text": "I called Google support today and walked them through everything I have tried, they were extremely understanding and were very quick to offer to send me a new phone.  Once I get it I'll try it on both MM and Nougat and then post my results.  It should be here in a week or so.", "time": "30th August 2016, 09:34 PM", "postID": "post68450729", "replies": []}]}]}, {"title": "WiFi strength, range, and throughput", "rating": 4.5, "links": ["https://forum.xda-developers.com/nexus-6p/review/wifi-strength-range-throughput-t3239523", "https://forum.xda-developers.com/nexus-6p/review/wifi-strength-range-throughput-t3239523/page2", "https://forum.xda-developers.com/nexus-6p/review/wifi-strength-range-throughput-t3239523/page3", "https://forum.xda-developers.com/nexus-6p/review/wifi-strength-range-throughput-t3239523/page4"], "threads": [{"text": "WiFi strength is good...nothing spectacular.", "time": "6th November 2015, 02:00 PM", "postID": "post63688048", "replies": [{"text": "Couldn't agree less, the wifi reception on this phone is worlds better than my 2014 Moto X, I'm getting 2-3x the bandwidth at the furthest distances in our house.", "time": "6th November 2015, 09:18 PM", "postID": "post63694877", "replies": []}]}, {"text": "Good wifi.", "time": "6th November 2015, 05:36 PM", "postID": "post63691452", "replies": []}, {"text": "Works pretty good. Pick it up outside in my car from my parking spot. Not strong but still connected.", "time": "6th November 2015, 05:39 PM", "postID": "post63691504", "replies": [{"text": "Wifi is great  here....... @svetius how are you doing Sir.........long time", "time": "6th November 2015, 06:19 PM", "postID": "post63692150", "replies": []}]}, {"text": "I don't know if it's my router (I just bought it 2 days before my phone came in) but my download speed is not very good. I have a 50mbps down and 25mbps up, but when I run speedtest I get anywhere from 1-30 down and always 25-30 up (normal). My upload is always fantastic, but down varies greatly. I don't know if it's the router or if it's my phone. In all situations I am less than 10 feet from my router. \n\nCan anyone run speed test on 2.4ghz and 5ghz bands and inform me if they see odd download speeds? By odd I mean jumping up and down a lot.", "time": "6th November 2015, 08:17 PM", "postID": "post63694014", "replies": [{"text": "On 5Ghz I got 72.2Mb down and 19.6Mb up on a 72/20 connection, so its running it flat out. This was through the speedtest.net app.", "time": "14th November 2015, 06:59 PM", "postID": "post63824859", "replies": []}]}, {"text": "Substantially better range and throughput than my N6.", "time": "6th November 2015, 10:35 PM", "postID": "post63695931", "replies": []}, {"text": "Find my wifi is good.  No better or worse than all my other devices.  Picks up where i expect it to and loose it where i expect it to.  Again speed is on par with my other devices", "time": "7th November 2015, 12:19 AM", "postID": "post63697017", "replies": []}, {"text": "Wifi on 6p is much better - get full 118Mbps download (cable limit) with Nexus 5 typically doing 80Mbps download at same time frame.  Connected to router at 585Mbps but I have seen it a 7xxMbps rate to router but effective internet still cable limited.", "time": "7th November 2015, 10:04 PM", "postID": "post63711530", "replies": [{"text": "I also am getting faster WiFi performance by a good amount WHEN I do .. reason saying that is that the results are very variable. I would like to attach a screen print I saved but do not see how.", "time": "9th November 2015, 09:59 PM", "postID": "post63744144", "replies": []}]}, {"text": "Great throughout with alright range, wifi drops at less range than my Note 3 and S4. This based off two N6P, first device I returned as the auto rotation was broke.", "time": "10th November 2015, 08:16 PM", "postID": "post63759838", "replies": []}, {"text": "My WiFi has been significantly better than my s4 so far with better throughput, latency, stability. My home connection is consistently above 500 Mbps.", "time": "10th November 2015, 11:03 PM", "postID": "post63762191", "replies": []}, {"text": "First image 5ghz, Comcast 105-150mbps depending on time of day. Second image is 2.4ghz", "time": "11th November 2015, 04:42 AM", "postID": "post63765570", "replies": []}, {"text": "WiFi is infinitely better than my previous phones, and 5ghz AC works better than on the iPhone 6s plus in the same spots. Signal strength on 5ghz AC is always 5-10db weaker than 2.4ghz. Plus, I get my full 90mbps everywhere in my house with 5ghz. 2.4 caps around 50-70 because of no free channels. Huawei did something right with the antennae, because I have no issues ever with signal/speed.", "time": "11th November 2015, 01:56 PM", "postID": "post63771265", "replies": []}, {"text": "I'm getting lower pings and faster throughput on my 6P than my iMac 5K!\n\r\nOf course, the position of my iMac may make a difference - but, regardless, that's bloody impressive. Huawei has always been pretty good with antenna design, and the larger size of the 6P presumably also helps?\n\r\nIn a test just now I got 9ms, 7.6 Mbps down, 1.1 Mbps up on my 6P (connection 526Mbps) and on my iMac 19ms, 6.8, 0.8 (connection 527Mbps*).\n\r\n(* bit odd that one is 526 and the other 527 - maybe a rounding issue as I assume they're fixed increments?)", "time": "11th November 2015, 10:16 PM", "postID": "post63778978", "replies": []}, {"text": "I'll second that WiFi speeds are noticeably faster than they were on my N6.\n\r\nI haven't done any actual testing, but the primary thing I've noticed is that transfers to my local server are typically 20-30% faster.", "time": "13th November 2015, 03:46 PM", "postID": "post63807478", "replies": []}, {"text": "The signal on my 6p is significantly better than my Oneplus one. I tested both where wifi signal is lowest and tested both 2.4 and 5ghz bands. Pings are almost identical.\n\n6p \n5  ghz -  64.81 down / 12.19 up\n2.4 ghz - 57.91 down /12.25 up\n\n1+1 \n5 ghz - 30.70 down / 12.22 up\n2.4 ghz - 17.30 / 12.16 up", "time": "14th November 2015, 08:05 PM", "postID": "post63825603", "replies": []}, {"text": "Constantly drops Wifi.  Then often forgets networks and even can't see any while scanning.", "time": "18th December 2015, 06:35 PM", "postID": "post64379876", "replies": []}, {"text": "No issues until now. Wifi is very stable", "time": "19th December 2015, 09:15 AM", "postID": "post64387945", "replies": []}, {"text": "Looks good to me on WiFi", "time": "20th December 2015, 04:57 AM", "postID": "post64400199", "replies": []}, {"text": "Do you take dumps on the bedroom floor? \r\nSufi is great. Specially 5ghz", "time": "20th December 2015, 05:05 AM", "postID": "post64400256", "replies": []}, {"text": "Significantly and consistently better wifi range and throughput than our Note 4 and LG G3.", "time": "21st December 2015, 01:15 AM", "postID": "post64412998", "replies": []}, {"text": "Wifi is good on this, not better than my S6 Edge plus but definitely better than the LG g4 and Xperia Z5 premium", "time": "21st December 2015, 10:41 AM", "postID": "post64417803", "replies": []}, {"text": "Wifi range and strength is excellent for me.", "time": "10th May 2016, 01:54 PM", "postID": "post66784929", "replies": []}, {"text": "I have a 120 down (But I consistently get 145-150) and 10 up where I'm at and my nexus pulls the full 145-150 down and 10 up.  I tested with my desktop connected to 1 Gbps LAN and got the exact same speed, with 1-3 ms less latency. I couldn't be happier with how the Wifi performs on this device.", "time": "12th May 2016, 07:53 PM", "postID": "post66822814", "replies": []}, {"text": "I have 100 download/35 upload.\nSometimes it will not want to connect to 5GHz (normal) and connect to a 2.4GHz connection (80/25) instead.\nI've had some WiFi/battery issues especially when downloading webpages or files.\nWhile connecting to a fast VPN, it becomes pretty slow... (~50/10 fastest)", "time": "14th May 2016, 12:55 AM", "postID": "post66841379", "replies": []}, {"text": "WiFi is great.  Getting 240MBPS down and 10up.", "time": "15th May 2016, 07:08 AM", "postID": "post66858162", "replies": []}, {"text": "Wow. I came from an HTC M8, and frequently switched between 2.4 GHZ and 5 GHZ WiFi bands at home. 2.4 GHZ reaches farther but is slower, while 5 GHZ is faster but doesn't reach as far, so I was switching between them constantly. When I set up my 6P, I chose the 5 GHZ WiFi, just because I was close to the router at the time. It's been a month now, and I haven't even added my 2.4 GHZ network yet. 5 GHZ signal is strong throughout the house, much better than on the M8.", "time": "24th January 2017, 07:46 AM", "postID": "post70700948", "replies": []}, {"text": "Happy wifi happy lifi?", "time": "25th January 2017, 02:10 AM", "postID": "post70715192", "replies": []}, {"text": "I just got my Nexus 6p replaced (shutdown issues).  The replacement phone wifi sucks so bad compared to the one that was sent out.  My old phone gets good signal almost anywhere in the office.   Looks like I'm in for another RMA.  Smh", "time": "26th January 2017, 03:54 AM", "postID": "post70732405", "replies": []}, {"text": "Yesterday had a friend next to me with a Galaxy S7 running Stock. While scanning the area, his device could see one AP. My 6P could see 6 AP. \nThroughput is very good and very stable. \nSo for me, the wireless on 6P is very good.", "time": "28th January 2017, 01:52 PM", "postID": "post70769934", "replies": []}, {"text": "For me, it's been mixed. Before I explain: Most of the time I'm in areas where multiple networks are in range. My ISP also has WiFi spread out, which is good when stationary but not so good when driving and the phone can't hop WAPs fast enough nor does it give up trying...\n\nWhen connected to 5 GHz with a good signal and not many other networks in range: I get great throughput. This means WiFi often works very well at home. But the problems start when there is ambiguity about if the phone should connect to a particular network, or if it should fail over to the mobile network. \nFor example, there are times when it prefers the 2.4 GHz network for no apparent reason, instead of my usual 5 GHz coming off the same router. Other times it will prefer a distant 2.4 GHz network over either WiFi signal at home. I have to switch manually when I notice what is happening. \nSometimes it refuses to connect to the \"Saved\" network, despite showing a strong signal. I have to turn WiFi off and on, and try to connect manually to get back on track. \nIn areas with many networks in range, it won't connect to the preferred saved one if I don't select it and connect manually. If I'm really unlucky the saved network doesn't show on the list until I turn WiFi off and on a couple of times to force the list to refresh.\n\nBut what really bothers me is how Location Services gets less accurate with WiFi on. Waze falls behind if WiFi is enabled while driving. This happens in metro areas with at least a few networks in range. My Galaxy S7 was smarter about if and when to maintain spotty connections. I suspect my problems have more to do with the firmware and/or Android itself. It's become a habit to turn WiFi off and on manually as I go about my day.", "time": "16th February 2017, 06:18 AM", "postID": "post71051665", "replies": [{"text": "", "time": "6th March 2017, 06:34 PM", "postID": "post71310510", "replies": []}]}, {"text": "The 6P has a very good wifi and signal range, I have never had any problems with this device.\r\nIf someone is having issues with the wifi in their homes, they should check the source of their wifi connection.", "time": "25th March 2017, 01:30 PM", "postID": "post71581968", "replies": []}, {"text": "On gigabit wifi it caps out at ~325 down and up. Nothing surprising but interesting.", "time": "14th May 2017, 01:01 AM", "postID": "post72283907", "replies": []}, {"text": "After oreo update it keeps forgetting wifi credentials. Also switching AP's doesn't really work with wifi in general. I'd like to see more development in that sector. Connection lost no big deal if the is restored automatically. wpa connect takes no longer than a second on linux. However even linux has problems if connection is lost. I want this to become more reliable.", "time": "27th October 2017, 01:31 PM", "postID": "post74313351", "replies": []}]}, {"title": "Cellular strength and throughput", "rating": 4.5, "links": ["https://forum.xda-developers.com/nexus-6p/review/cellular-strength-throughput-t3239524", "https://forum.xda-developers.com/nexus-6p/review/cellular-strength-throughput-t3239524/page2", "https://forum.xda-developers.com/nexus-6p/review/cellular-strength-throughput-t3239524/page3", "https://forum.xda-developers.com/nexus-6p/review/cellular-strength-throughput-t3239524/page5"], "threads": [{"text": "Using on AT&T, signal strength is good. And it has band 30 which will be good in the future when they get that rolled out.", "time": "3rd November 2015, 01:27 AM", "postID": "post63625568", "replies": []}, {"text": "Using on Verizon.  With my old Note 3 and also my work iPhone 6 Plus, at work where the signal is terrible, it would switch to 3G periodically.  With the 6p, i haven't had a single instance where it switched to 3G.  Just for kicks, i put in my coworker's T-mobile sim card.  He has iPhone 6 Plus and he gets 1 bar on his iPhone and i saw 3 bars", "time": "6th November 2015, 03:57 PM", "postID": "post63689829", "replies": [{"text": "Yup same here.  this thing gets better signal at work (in a 12 story building) than my Note 4 on VZ.  just to be sure it isn't a software bs thing.  I tested speedtest and it pulls 7-8 mbs vs 1.5-3 mbs before (note4).  So not sure which of the two VZ freq it pulls from normal or XLTE but the radios/antenae seems stronger than the note 4.  in any event, I am quite happy and satisfied with my signal!!  (orange county, calif)", "time": "8th November 2015, 04:41 AM", "postID": "post63715303", "replies": []}, {"text": "Hope this is the case for me too! I have the Nexus 6 and lose LTE occasionally... it irritates me too, because i can toggle Airplane Mode and LTE pops back up. So hopefully this is the case for me as well.", "time": "10th November 2015, 04:14 PM", "postID": "post63755871", "replies": [{"text": "I used to see this with my Nexus 6 and G4 all the time. I had to use LTE Discovery and its Auto Cycle feature to stay on LTE longer at work. With the 6P, if it does drop out of LTE, it recovers a lot quicker than all the other phones.", "time": "10th November 2015, 04:54 PM", "postID": "post63756577", "replies": []}]}]}, {"text": "LTE on T-mobile - good strength compared to my Nexus 5 - can get LTE in some areas where I did not before.  Shows full bars though LTE discovery shows different strength levels on band 4.  Waiting for band 12 support to see full impact and hopefully with carrier aggregation to give better throughput.", "time": "7th November 2015, 10:06 PM", "postID": "post63711564", "replies": []}, {"text": "T-Mobile signal at my desk at work has been inconsistent with my past two phones (Moto X 2014 and G4), but the 6P manages to hold on to LTE more often than the other two did. It also seems to switch back to LTE from HSPA+ quicker.\n\nThe biggest difference is HSPA+ performance. With both the Moto X and G4, HSPA+ performance was always awful, to the point that I just figured T-Mobile's HSPA+ spectrum was too saturated to provide decent results. The 6P manages to get much better data throughput in these conditions, so I am loving that. \n\nLTE performance seems to be on par with the other phones, but with so many changes in the network, I never know if it's the phone or new things going on in the network.", "time": "8th November 2015, 06:39 PM", "postID": "post63725154", "replies": []}, {"text": "I noticed that the signal strength is far superior than what i was getting on my S6 Edge.  The 6P gets signal in places my S6 didn't so im a very! very! happy camper.", "time": "8th November 2015, 08:29 PM", "postID": "post63726862", "replies": []}, {"text": "Cell reception has been pretty bad on mine so far... \n\nCould anyone check if covering the visor area with your hand affects cell signal? (You will inevitably cover part of it when holding the phone horizontally with both hands or just the left hand) On my phone, just loosely covering the visor area with my hand lowers signal by one to two bars, and lowers data transfer rate from ~16MBps to less than 10MBps..", "time": "10th November 2015, 03:53 AM", "postID": "post63747734", "replies": []}, {"text": "Of course it does. Every phone has an area or two that allow you to really hurt the signal by covering them with your hand.", "time": "10th November 2015, 06:19 AM", "postID": "post63748887", "replies": []}, {"text": "WIthout a doubt the cell signal is far superior to that of the Nexus 6 that I replaced.  This was easily seen driving down the road which with the Shamu would have areas that there was no signal at all, yet with the 6P I had at a minimum 2 bars all the way up and down the road.  Even in my house where I had to switch to WiFi calling because of so many trees , I also get a good LTE signal throughout the house.\n\r\nWiFi performance itself is amazing as it is literally faster than my $4k gaming laptop. This is what I got on my 300 connection \n\nhttp://screencast.com/t/dHcAt6FuxN6\n\n\nhttp://screencast.com/t/2Vn4MF5Iw", "time": "10th November 2015, 11:12 AM", "postID": "post63751679", "replies": []}, {"text": "Coming from my Nexus 6, I have much better reception everywhere in the Phoenix Valley", "time": "20th November 2015, 07:17 PM", "postID": "post63927207", "replies": []}, {"text": "I am on AT&T and I am finding myself getting better LTE reception than ever before. My previous phone was an Xperia Z3 and the 6P is definitely superior.", "time": "20th November 2015, 08:42 PM", "postID": "post63928334", "replies": []}, {"text": "Way better signal than the Moto X 2014 or Oneplus One!", "time": "24th November 2015, 09:15 PM", "postID": "post63993214", "replies": []}, {"text": "I'm on Verizon and have not had a chance to test it in my fringe areas. I do have a Wilson signal booster in the house and my Note 4 would typically show a signal strength of -84 to -86db. The Nexus 6P is consistently in the mid -70s. (Lower is better)", "time": "27th November 2015, 11:40 AM", "postID": "post64032390", "replies": []}, {"text": "My cell reception is amazing.. Texts in and out of the depths of where I work.. Voice quality was muffled at times but seems better with root", "time": "27th November 2015, 05:26 PM", "postID": "post64036559", "replies": []}, {"text": "I have a Nexus 6 & ordered a 6P using it on Verizon.  Is the reception about the same?  The 6 was my first moto phone & had much better reception than my LG G2 (previous phone).  Will I lose call quality?", "time": "27th November 2015, 08:10 PM", "postID": "post64038675", "replies": []}, {"text": "On t-mobile for the most part I am getting good signal. But....\nI am noticing that many times I drop my LTE connection and just get HSPA and or 3g....\n\nI am also loosing my LTE signal and a point that the cell site is close by so it is not because of weak signal.\n\nI looked at coverage maps and used an app called LTE discovery I don't see the new T-Mobile bands here in Atlanta yet... Maybe that will help..", "time": "30th November 2015, 05:42 PM", "postID": "post64082818", "replies": []}, {"text": "LTE has been great for me here in Irvine CA, got 84 Mbps download. WiFi speeds are good too, but WiFi range is much worse than my nexus 5. Bluetooth range isbworse too. My n5 keeps my WiFi signal down at my street corner, 6p loses thebwifi half way there. Same with Bluetooth, it loses bt signl half distance that my n5 does.", "time": "1st December 2015, 05:01 AM", "postID": "post64090141", "replies": []}, {"text": "Just a follow up since i have had my 6p for a week or two.  I would say the cell strength on the Nexus 6 is better than the 6P.  I drop in places with the 6p that I didnt with the nexus 6.", "time": "10th December 2015, 10:01 PM", "postID": "post64251410", "replies": []}, {"text": "I'm on Google fi, and came from T-Mobile. Don't see a difference between the two. I'm on T-Mobile most of the time anyways. Might switch back since T-Mobile is unlimited data. Its close on which is better. Anyways cell strength seems decent.", "time": "10th December 2015, 10:23 PM", "postID": "post64251666", "replies": []}, {"text": "Coming from a Nexus 6, I definitely see improved signal strength! At my gf's house I would no LTE with my N6 but get a couple bars with the N6P.  Also, at work signal strength is better and data throughput is noticeably better with the weaker signals.  I'm in a mixed 1700/2100 and 1900 area. Both areas that I notice improved signal strength are in 1700/2100 areas.", "time": "11th December 2015, 01:09 PM", "postID": "post64260509", "replies": []}, {"text": "I've having worse cell connection.  I'm on Verizon and work from home often in my basement.  I used to have an LG G3, then a Droid Turbo 2 and both worked fine in my basement.  Any call I've taken since i had the N6p the person couldn't hear me, said it was \"choppy\" while in my basement.  My wife has the Droid Turbo 2 as well and I compared her signal strength with my N6p and they're the same in the basement -113dMb 27asu but everyone can hear me on the LG G3 or  the Droid Turbo 2.  Any suggestions?", "time": "18th December 2015, 03:03 AM", "postID": "post64369425", "replies": [{"text": "I just contacted google and they're going to replace my phone.  I'm hoping that it was just defective.", "time": "21st December 2015, 04:15 PM", "postID": "post64422329", "replies": []}]}, {"text": "The 6p definitely gets better cellular strength in my office compared to the 6. I have both devices running 6.0 and on T-mobile so I'm assuming it's the antenna on the 6p", "time": "18th December 2015, 06:27 AM", "postID": "post64370989", "replies": []}, {"text": "I get 4 g in places that had zero reception with any other phone.", "time": "21st December 2015, 04:14 PM", "postID": "post64422313", "replies": []}, {"text": "How many people that are having issues are on Verizon?", "time": "22nd December 2015, 12:53 AM", "postID": "post64428991", "replies": [{"text": "Me!", "time": "22nd December 2015, 02:41 AM", "postID": "post64429922", "replies": []}, {"text": "I'm about a day from sending this phone back. Signal strength on Verizon is hot hot garbage. \n\r\n I rolled back to 6.0.1 build MMB29M based on this issue https://code.google.com/p/android/is...tail?id=197102 . Which yes, my phone was in fact having a ton of difficulty switching BACK to LTE from wifi or no connectivity. \n\r\nThis phone however, is trash getting quality LTE service. My OLD Samsung galaxy s4 destroys this phone in every area, tonight, at a pub where I commonly stream watchespn I could barely get my nexus 6p to start the stream, much less connect at all. Mind you this is where I ALWAYS have been able to get my old s4 to stream flawlessly. I fired up my partner's iphone 5 and it streamed watchespn flawlessly. My brand new 6p sitting there looking foolish.", "time": "7th March 2016, 06:44 AM", "postID": "post65695449", "replies": []}]}, {"text": "From a quick glance in this thread, a lot of people experiencing issues might be on Verizon. Wonder if a poll should be started somewhere", "time": "22nd December 2015, 04:12 PM", "postID": "post64438285", "replies": []}, {"text": "Well I think I found out my issue.  After doing a good amount of research last night I found that the \"Enhanced 4G LTE Mode\" under settings/more/cell networks was causing my issue.  Seems it tries to produce HD quality sound over LTE connection and when that connection is weak the connection either drops, sound is choppy, or the person on the other end can't hear you at all.  Turning this off I was able to make calls from my basement and it cleared up the \"tunnel/echo\" sound I was having when making calls not only from my basement but from anywhere.  Now the big problem with turning this off is your no longer able to talk on the phone and use data.  For someone like me this is kind of a deal breaker as I work in IT and i'm on my phone and hot spot quite often.  I'm still hoping that my replacement phone clears up this issue but i'm guessing it won't.  It will be here tomorrow so I'll report back.", "time": "22nd December 2015, 09:46 PM", "postID": "post64442823", "replies": []}, {"text": "I've had my phone for a couple of months now, on Verizon. Compared to my S5, it seemed to get about the same signal strength everywhere. But I have an area I camp at in our RV. Same spot has been assigned to me for years. The coverage there is always very spotty, so we bought a cell phone booster setup from Wilson electronics years ago to enable us to get an okay data connection/hotspot there. This last weekend was the first test of the 6P there, and it was a failure. It would drop the signal often and I could not get any work done. Could make calls and text, but hotspot was kind of cold. \n\nLuckily, I was able to get my wife to bring my S5 down to camp when she came, and I had Verizon switch them for me. Then I was able to get a good, steady connection. While I'm a little disappointed by all of that, it's not a deal breaker for me. Fortunately, I have the S5, which is a perfectly fine smartphone, to fall back on when I do these trips where I need the booster setup to work. And it's a simple matter to switch the phones. \n\nBottom line, there is no question the 6P has a bit weaker signal strength than an S5, at least. Not horribly less, but demonstrably so in very fringe locations.", "time": "8th March 2016, 08:30 PM", "postID": "post65726988", "replies": []}, {"text": "Using Google Project Fi with Nexus 6P, great strength overall!", "time": "12th March 2016, 06:28 PM", "postID": "post65800828", "replies": []}, {"text": "Also on Project Fi and my signal quality has been very good. The handoff between networks is very smooth", "time": "14th March 2016, 02:41 PM", "postID": "post65832958", "replies": []}, {"text": "No problems here. This is the first phone I've had where I could get 2 bars in my basement. I usually get no signal at all.", "time": "10th May 2016, 01:56 PM", "postID": "post66784951", "replies": []}, {"text": "Not too shabby.  Was in Brentwood, CA.", "time": "16th May 2016, 05:45 AM", "postID": "post66871925", "replies": []}, {"text": "I notice that compared to my old Samsung Note 2 on Verizon, it is not able to pick up caller ID in True caller until I hang up or the call is completed. My old Samsung would show the caller name on the first ring. So not as good of a radio as the Samsung.", "time": "2nd October 2016, 02:19 PM", "postID": "post68950717", "replies": []}]}, {"title": "Speakerphone (loudness, clarity)", "rating": 4.5, "links": ["https://forum.xda-developers.com/nexus-6p/review/speakerphone-loudness-clarity-t3239525", "https://forum.xda-developers.com/nexus-6p/review/speakerphone-loudness-clarity-t3239525/page2", "https://forum.xda-developers.com/nexus-6p/review/speakerphone-loudness-clarity-t3239525/page3", "https://forum.xda-developers.com/nexus-6p/review/speakerphone-loudness-clarity-t3239525/page5"], "threads": [{"text": "Crisp, and doesn't distort at max volume.", "time": "3rd November 2015, 01:26 AM", "postID": "post63625556", "replies": []}, {"text": "I'd love to hear more about this from users. Wondering if it can properly drive my ath m50x", "time": "10th November 2015, 02:16 AM", "postID": "post63746805", "replies": [{"text": "Although not really the intended purpose of this thread, It should have no issues driving a pair of m50x's. I don't personally have a pair to test with, but those are generally effortless to drive and the 6p has pretty solid audio across the board in my experience.", "time": "10th November 2015, 07:58 PM", "postID": "post63759570", "replies": [{"text": "The 6p has a terrible headphone jack plain and simple.", "time": "16th November 2015, 10:21 PM", "postID": "post63861895", "replies": []}]}, {"text": "I have both Nexus 6P and ATH-M50x. They are loud at max volume; easy to say they are uncomfortable to listen to at this volume. \n\r\nPS: The ATH-M50X have 38 ohms impedance, an amplifier isn't even required for using these headphones. Once you get past 50 ohms impedance you would want to consider an amp. Adding an amp to your audio will color the sound, the ATH-M50x's are well known for their flat-response I would recommend keeping them that way and modify the sound through an equalizer.", "time": "11th November 2015, 01:53 AM", "postID": "post63763855", "replies": []}]}, {"text": "The incoming sound is great, but I keep hearing that my voice is very distorted on the other end. When I switch back off of speakerphone everything apparently sounds fine. I've heard of other people having the same problem. I'm thinking it's probably the noise cancelling mic being on during a speakerphone call.", "time": "16th November 2015, 10:50 PM", "postID": "post63862253", "replies": []}, {"text": "Phone calls have been subpar so far, bad incoming sound and people struggling to hear me on the other side. Speaker is nice and loud though", "time": "21st November 2015, 12:49 AM", "postID": "post63930870", "replies": []}, {"text": "I have both a Nexus 6 and 6P. The Nexus 6P speakers are good, but the 6 are louder and clearer IMO", "time": "22nd November 2015, 04:33 PM", "postID": "post63955909", "replies": []}, {"text": "earbuds sucks btw", "time": "23rd November 2015, 05:28 PM", "postID": "post63973401", "replies": []}, {"text": "Seems a bit louder than the Moto X 2014, but less balanced. Alltogether great speakers, though.", "time": "24th November 2015, 09:13 PM", "postID": "post63993184", "replies": []}, {"text": "The speakers are LOUD!! Its one of the loudest speakers out there. Its not as good with the bass like HTC's speakers in the M8 and m9 but Hauwei and Google have packed some awesome speakers in this phone", "time": "26th November 2015, 07:03 PM", "postID": "post64023405", "replies": []}, {"text": "mediocre speaker volume however with viper4android it makes it 4.5", "time": "8th December 2015, 06:36 PM", "postID": "post64211873", "replies": []}, {"text": "Kind of quiet.  Good for normal use but wouldn't want to try and hear the speaker in the car.", "time": "16th December 2015, 11:51 PM", "postID": "post64351015", "replies": []}, {"text": "Did you check the equalizer?", "time": "17th December 2015, 05:45 AM", "postID": "post64354033", "replies": [{"text": "No, where's the setting?", "time": "17th December 2015, 02:12 PM", "postID": "post64359706", "replies": []}, {"text": "Where I can find this in the settings", "time": "17th December 2015, 03:39 PM", "postID": "post64361031", "replies": []}]}, {"text": "Coming from HTC M7 with Boomsound, so I'm a bit spoiled regarding good speaker quality. The 6P comes closes to the M7 but boomsound speakers definetly have more bass. But it's OK for me", "time": "24th December 2015, 03:59 PM", "postID": "post64471609", "replies": []}, {"text": "this is my first time with smartphones with stereo speakers. its quality, volume both are amazing", "time": "24th December 2015, 09:26 PM", "postID": "post64475856", "replies": []}, {"text": "Its loud  but with certain voice types i here some sort of distortion or rattle which disappears if I put my finger on the speaker ( not fully covering it )", "time": "8th January 2016, 07:33 AM", "postID": "post64701034", "replies": []}, {"text": "Hi Guys,\n\r\nIs anyone experiencing a problem with the mic on the speakersphone, people aren't able to hear me.\n\r\nThanks.", "time": "25th January 2016, 09:53 AM", "postID": "post64971770", "replies": []}, {"text": "have to buy one.", "time": "14th February 2016, 10:05 PM", "postID": "post65327403", "replies": []}, {"text": "Yes about the mic issue", "time": "28th February 2016, 12:24 AM", "postID": "post65557135", "replies": []}, {"text": "Crisp sound and the speakers are really loud!", "time": "24th March 2016, 09:16 PM", "postID": "post66019843", "replies": []}, {"text": "It gets loud, which I like, but gets a bit distorted at full volume.", "time": "10th May 2016, 01:55 PM", "postID": "post66784939", "replies": []}, {"text": "I really like the stereo speakers, good and loud sound. Watching films or videos and playing games with front speakers is great.", "time": "20th July 2016, 08:28 PM", "postID": "post67833251", "replies": []}, {"text": "very weak vibration: any solution?", "time": "4th August 2016, 04:48 PM", "postID": "post68042491", "replies": []}, {"text": "There will be some distortion at max volume for anything that doesn't have dynamics, as for any speaker element that can't move air substantially, or any sound output where the sound producer left a rough mix or deliberately made it for high end speakers. I haven't had my producer ears on for a good listen yet, but spontaneous reactions from others is that \"that's definitely better than what I have in mine\". Which to a large extent is about wattage, or at least perceived such.", "time": "5th August 2016, 10:37 PM", "postID": "post68060967", "replies": []}, {"text": "coming from HTC, the 6P speakers sound and headphone sound is really tinny and distorted the higher the volume.", "time": "28th September 2016, 03:58 PM", "postID": "post68897596", "replies": []}, {"text": "Any way to adjust/access the speaker sound/volume  settings. I'm getting a high pitch out of top speaker. Could be described as distorted like. \n\nI'm sure it's fixable by editing speaker values. System etc mixer paths RX7 set to 84. Needs be to lowered. \n\nJust flashed from 7.0.0 rooted stock to a custom 7.1 ROM. I didn't have issue until now. (Using custom ROM)\n\nI think Google overcompensated the fix from the Nexus  5 & 6 low volume bug.\n\nAny feedback would appreciated.\n\nEdit: I've read to edit speaker values via system/etc mixer_paths then edit RX7 values right now it's set to 84.\n\nThinking I need to decrease to about 80", "time": "2nd November 2016, 07:50 PM", "postID": "post69430683", "replies": [{"text": "With Viper4Arise or a Custom Kernel like Elemental X Kernel, The volume steps(gravity box) compensate a lot the distortion, but there´s nothing in Nougat for now, only in Marshmallow.", "time": "2nd November 2016, 09:43 PM", "postID": "post69432275", "replies": []}]}, {"text": "The Nexus 6P has one of the best set of speakers on any smartphone in my opinion. The front-facing stereo speakers are really loud, and on the bright side, they barely distort the sound on max volume.", "time": "11th December 2016, 07:24 AM", "postID": "post70032005", "replies": []}, {"text": "I have the Dolby mod installed and the sound is fantastic.  I have to turn it off if I want to play music in the office because it enhances it so much.  The sound quality was already great,  but this makes it so much better.", "time": "12th March 2017, 05:19 PM", "postID": "post71397574", "replies": [{"text": "Can you share the link please", "time": "16th March 2017, 04:45 PM", "postID": "post71456275", "replies": []}]}, {"text": "I'm looking for the original thread where I found the download.  It installs Viper drivers,  Sony beats,  dolby digital,  and a few other things right from an aroma installer.  I have the zip on my phone and laptop.\n\nUpdate: https://forum.xda-developers.com/and...earch-t3379709\n\nOr \n\nhttps://www.androidfilehost.com/?fid=745425885120707111  for direct link to dl.", "time": "18th March 2017, 10:46 PM", "postID": "post71487955", "replies": []}]}]