[{"title": "Overall love", "rating": 4.5, "links": ["https://forum.xda-developers.com/moto-g4-plus/review/overall-love-t3428811", "https://forum.xda-developers.com/moto-g4-plus/review/overall-love-t3428811/page2"], "threads": [{"text": "<3 Awesome", "time": "9th August 2016, 11:40 AM", "postID": "post68108020", "replies": []}, {"text": "I'm all about it. It's by far the best phone I've had and super fun to tinker with.", "time": "9th August 2016, 05:22 PM", "postID": "post68112690", "replies": []}, {"text": "Definitly not a flagship but not bad for a mid range. I rate it up there with my former nexus 5x. Just wish there was roms to flash.", "time": "9th August 2016, 11:23 PM", "postID": "post68117267", "replies": []}, {"text": "Well I have the moto g4 for few days now and its a brilliant phone", "time": "11th August 2016, 04:35 PM", "postID": "post68142295", "replies": []}, {"text": "Great phone @ great price", "time": "11th August 2016, 04:41 PM", "postID": "post68142405", "replies": []}, {"text": "Great phone, everything you need without all the gadgets you don't need/won't use while not sacrificing modern day performance.", "time": "12th August 2016, 01:22 PM", "postID": "post68154558", "replies": []}, {"text": "Best feeling 5.5\" screened device. \n\nOne handed usability is great, shockingly so.", "time": "15th August 2016, 05:08 AM", "postID": "post68192435", "replies": []}, {"text": "It heats up turbo charging. Else i give it 9/10.", "time": "19th August 2016, 04:58 AM", "postID": "post68256945", "replies": []}, {"text": "Heats up a bit in games, though this is due to me purchasing the 2GB RAM option, but other than that, it's awesome!", "time": "24th August 2016, 04:34 AM", "postID": "post68335805", "replies": []}, {"text": "Great budget package with decent camera.. no lags... Great front facing speakers... A bit of overheating issues...", "time": "4th September 2016, 07:45 PM", "postID": "post68528565", "replies": []}, {"text": "I can't believe I got all this for so little money. Previous phones: original galaxy note, LG g2, Xperia z3, LG g4. Considered a galaxy s7 edge now and am more than happy with my decision to go for the moto g4 plus.", "time": "24th September 2016, 11:43 AM", "postID": "post68837080", "replies": []}, {"text": "This week I've gifted this cellphone to my mom, a great upgrade from her old Lenovo A606. She's very happy with it, and me too, it's an awesome phone! Good aesthetics/design, good software, good everything.\nAlso two friends / colleagues have the same phone, both happy.\n\nAs always Motorola giving the best at the best prices.", "time": "13th May 2017, 05:12 AM", "postID": "post72273945", "replies": []}, {"text": "Bought on May 27th ,2016....Still I love my Moto G4 plus...Normally I don't use any phone more than 6 months..I used Nokia 3510 for almost 3 years and Htc desire X for one year in 2013.  But still I love my Moto G4 plus and using..\r\nI wanted to sell this phone in March..But I cannot sell because my mind didn't allow to do so..", "time": "16th May 2017, 07:40 AM", "postID": "post72310769", "replies": []}, {"text": "Moto G4 16gb 2gb ram + Lineage OS 14.1\n\r\nFor an easy phone that is great on the wallet and still has decent performance, this is a killer device.\r\nPerformance is pretty great in my opinion, to save battery I am using the Elemental X kernel and have my CPU undervolted and the big cores max clock at about 1300mhz, truth be told I do not need much power in my phone because I really just use my phone for communication, videos, and audio. I don't really play games on my phone aside from classic Pokemon.\n\r\nRAM in the G4 16gb is a little limited, as 2gb of ram I do start to notice some sluggish performance if I leave too many apps open. I don't use a whole lot of apps at once, so this doesn't bother me and I can just as easily close the apps out.\n\r\nCamera is pretty decent, takes decent shots and videos. That's all I ask for.\n\r\nBattery does get hot quick, have not found anything that can fix this but it's not an issue.\n\r\nThe lack of NFC I was not aware of until after I bought the phone. I was kind of disappointed by that, but really even when I had a phone with NFC, I did not really use it as much as I thought I did. But for buying the phone for under $100, cannot complain about a missing feature I might use once in a blue moon.\n\r\nOverall this phone is a nice phone to get your hands wet in Android development. Easy to unlock, it is not locked to any carrier, supports all the major LTE Bands, great display, overall a very good experience with the phone. \n\r\nIf you do use a lot of apps I do recommend getting a 32gb version at least. I do not use a lot of apps, but the 16gb ROM is used by everything. System, boot, data, apps, it uses it. Thankfully for pictures and some apps that support it(unless you root it) you do have the ability to add an SD card to the device.\n\r\nI would get another Moto phone in the future.", "time": "16th May 2017, 06:50 PM", "postID": "post72317721", "replies": []}]}, {"title": "Community development strength", "rating": 3.0, "links": ["https://forum.xda-developers.com/moto-g4-plus/review/community-development-strength-t3428812", "https://forum.xda-developers.com/moto-g4-plus/review/community-development-strength-t3428812/page2"], "threads": [{"text": "Four stars for: root, twrp, xposed, cm. Lacks a dark theme.", "time": "24th September 2016, 11:45 AM", "postID": "post68837102", "replies": []}, {"text": "2 stars : no more official Roms like other model phones", "time": "6th October 2016, 12:19 PM", "postID": "post69005512", "replies": []}, {"text": "6 ROMs | 3 Kernels | Root | Xposed\n\nThat's quiet okay.\n3.5/5", "time": "9th October 2016, 12:33 PM", "postID": "post69045627", "replies": []}, {"text": "Very bad", "time": "25th October 2016, 11:33 AM", "postID": "post69298230", "replies": []}, {"text": "2 stars  for twrp and some custom Roms \nLack no more Roms \nNo nougat roms\nNo multirom.", "time": "26th October 2016, 09:51 AM", "postID": "post69313587", "replies": []}, {"text": "Hi,\n\nI came in from Nexus 5 and i have to say that G4 is light years behind with development.\nThe worst thing is lack of custom stock roms so you need to flash through fastboot or you need to stick to CM based roms.\nOverall 2/10\n\nAnd hello to Moto community", "time": "28th October 2016, 10:42 PM", "postID": "post69354187", "replies": [{"text": "Agreed x2", "time": "24th November 2016, 02:20 AM", "postID": "post69764834", "replies": []}]}, {"text": "Coming from the Moto G2, there are way too less custom ROM's even after half a year of launch.\n\n2/5.", "time": "16th November 2016, 02:19 AM", "postID": "post69642118", "replies": []}, {"text": "4/5", "time": "18th November 2016, 03:30 AM", "postID": "post69675531", "replies": []}, {"text": "It has seen a gradual increase in Roms. 7/10", "time": "30th November 2016, 12:32 PM", "postID": "post69862719", "replies": []}, {"text": "Yeah, right now dev work isn't bad at all. We have what, like 4 kernels, and ElementalX is super solid as well as LineageOS. We even have an AOSP CAF build. Coming from a Nexus 5 this is extremely solid for a budget Motorola phone.\n\nI guess people got fed up with Lenovo and their ****ty updates lol.", "time": "5th March 2017, 12:27 AM", "postID": "post71286814", "replies": []}, {"text": "Ghost Touch problem is irritating while using, Even i'm in warranty period but i can't solve the issue.", "time": "21st September 2017, 07:34 PM", "postID": "post73881463", "replies": [{"text": "OT here.", "time": "21st September 2017, 07:45 PM", "postID": "post73881603", "replies": []}]}]}, {"title": "Overall speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/moto-g4-plus/review/overall-speed-t3428813", "https://forum.xda-developers.com/moto-g4-plus/review/overall-speed-t3428813/page2"], "threads": [{"text": "Not terrible but it does get laggy at times. Even the 4gb ram model.", "time": "20th August 2016, 06:41 PM", "postID": "post68280655", "replies": [{"text": "when does it lag exactly ?", "time": "21st August 2016, 07:00 PM", "postID": "post68295134", "replies": []}]}, {"text": "I have the 16GB / 2GB RAM, runs fine if not running anything aggressive like games.", "time": "22nd August 2016, 03:11 AM", "postID": "post68300009", "replies": []}, {"text": "I have the Moto G4 (non-plus) 32gb / 2gb ram model and can say that it is quick. Comparing to LG V10, S5 and S6, graphic intensive games are noticeably slower, but everyday use such as web browsing, app switching, email, video are all very quick. (no noticeable difference from the V10 or the S6 but fater than the S5 to me). I came from a S4 running Cyanogen that was quick and can say this phone beats the pants off of it. I don't do a any gaming really on my phone, I can say it play pokemon Go just fine however.", "time": "8th September 2016, 09:41 PM", "postID": "post68594372", "replies": []}, {"text": "I've got the G4 Plus with 64 Gb and 4 Gb RAM. I do have apps that are very slow in loading or sometimes even responding. I will get the Android dialog box asking me to \"wait\" or \"close\" the app. I had tried the classic \"reset\" and clearing, etc. No help. Definitely MUCH slower than my old HTC One M9. I don't do any games on it.", "time": "11th September 2016, 10:10 PM", "postID": "post68641456", "replies": []}, {"text": "I came from a nexus 6 64GB (to xt1625), and considering the difference in price I'm quite happy with it's speed as a daily driver.  I'm not running any games though.", "time": "14th September 2016, 10:18 PM", "postID": "post68691205", "replies": []}, {"text": "The Moto G4 Plus, however, seems different compared to previous Moto Gs. It takes a lot of cues from the Moto G3, but also adds into the mix some new bits. Although the faster hardware does make the Moto G4 Plus run hotter compared to the Moto G3. But that is only in particular cases, such as when you are playing games for over half an hour. And in such cases, almost all phones with similar hardware show similar behaviour.", "time": "15th September 2016, 08:16 AM", "postID": "post68696336", "replies": []}, {"text": "Only lag i've noticed was browsing the ridiculously  ad heavy xda forums.  Adaware took care of that.\nRuns cool, no errors.\nNot a game player.", "time": "27th October 2016, 07:58 PM", "postID": "post69338349", "replies": []}, {"text": "I have the G4 Plus 32gb 2Gb RAM. I woumd say it's OK. For gaming is not very good either, heavy games tend to drop frames very often or straight up lag, in day to day usage it is fast, but it cannot handle a lot of apps open at the same time (I think it's a matter of lack of OS optimization).", "time": "5th January 2017, 09:09 PM", "postID": "post70412168", "replies": []}, {"text": "I own the G4 Plus 2GB model. I would say that performance is decent. It does day-to-day jobs quicly, but not lag-free. \n\nI ran a comparison with the Moto Z Play (SD 625 3GB) a few days ago, and the difference is directly noticable. The X Play runs smooth, the G4 Plus does not. It's not that the G4 Plus stutters all the time, but there is room for improvement.\n\nHowever, if you take the low price point of the G4 Plus into consideration, it does not disappoint.", "time": "10th January 2017, 07:43 AM", "postID": "post70482417", "replies": []}, {"text": "Having 3gb/32gb model\r\nRuns perfectly. Multitasking at it's best.", "time": "28th January 2017, 02:16 PM", "postID": "post70770212", "replies": [{"text": "Same experience here on Marshmallow.  Had it a few months,  always fast,  never had any lag, slowdowns, force closes, etc.      Runs perfect,  couldn't ask for better.    I did upgrade to N and it wasn't quite as smooth.  Went back to Marshmallow and all is perfect again.", "time": "4th March 2017, 03:46 PM", "postID": "post71281616", "replies": []}]}, {"text": "Switching between ongoing Google Maps Navigation, Play Music (or Amazon Music/Spotify) and a Browser is definitely slow and a pain while driving (2GB Model).\nLooking forward to switch to OnePlus's next offering this year because I need more power.", "time": "27th February 2017, 03:30 PM", "postID": "post71212602", "replies": []}]}, {"title": "App launch speed", "rating": 4.0, "links": ["https://forum.xda-developers.com/moto-g4-plus/review/app-launch-speed-t3428814"], "threads": [{"text": "Quick but not as fast as the phones that have higher snapdragon versions.", "time": "25th October 2016, 11:36 AM", "postID": "post69298252", "replies": []}]}, {"title": "Multitasking/RAM", "rating": 4.0, "links": ["https://forum.xda-developers.com/moto-g4-plus/review/multitasking-ram-t3428815"], "threads": []}, {"title": "Scrolling smoothness", "rating": 4.5, "links": ["https://forum.xda-developers.com/moto-g4-plus/review/scrolling-smoothness-t3428816"], "threads": [{"text": "Scrolling has been buttery smooth during my usage of about 1 month. I'm a moderate to heavy user and even with many apps kept in recents you can expect a smooth browsing experience.", "time": "17th September 2016, 03:47 PM", "postID": "post68732436", "replies": []}, {"text": "You can't expect much when you keep many apps keep running", "time": "21st September 2016, 12:05 PM", "postID": "post68791488", "replies": []}]}, {"title": "Heat", "rating": 3.0, "links": ["https://forum.xda-developers.com/moto-g4-plus/review/heat-t3428817", "https://forum.xda-developers.com/moto-g4-plus/review/heat-t3428817/page2"], "threads": [{"text": "It's a bit different. Gaming doesn't heat up the phone as much as video recording especially on 1080p.\nElse it's gr8\n\n---------- Post added at 09:29 AM ---------- Previous post was at 09:10 AM ----------\n\nIt's a bit different. Gaming doesn't heat up the phone as much as video recording especially on 1080p.\nElse it's fine.", "time": "5th August 2016, 09:29 AM", "postID": "post68051580", "replies": []}, {"text": "Does your phone get a little warm when using the turbo charger? also, I am wondering if I should use a regular 1amp charger when I am not in a rush, I guess it prolongs battery life... not sure if using the turbo all the time is good..", "time": "7th August 2016, 12:05 AM", "postID": "post68074207", "replies": [{"text": "Yes, as most of the turbo devices, moto g4 plus too heats up a bit while turbo charging. And since it's a chipset feature, we shouldn't worry. I think it's best to use the charger shipped with the set.", "time": "7th August 2016, 06:18 AM", "postID": "post68076557", "replies": []}]}, {"text": "I'm stock systemless rooted and my device doesn't heat up that much, even with the turbo charger plugged in. I will admit though, using the elementalX kernel made my device REALLY hot when charging!!!!!! The OP of that ElementalX said it's not his kernel but it is, I don't have a problem when I'm not using it. oh well, man.", "time": "7th August 2016, 09:21 PM", "postID": "post68085707", "replies": [{"text": "flar2 is right. Heating issue during turbo charge shouldn't be due to the kernel coz all the voltages are the same as stock. Did u overclock while installing the kernel (in aroma installer)? \nCoz I'm using ElementalX kernel with 1.5 GHz of CPU and there's no difference yet.\nI'll re-install and overclock the CPU to max and see if it heats up more.", "time": "8th August 2016, 04:08 PM", "postID": "post68096074", "replies": []}]}, {"text": "No heat, whatsoever! I dont play games, but I'm a heavy user. The phones is much cooler than any phone I've owned. I didn't take the latest update.", "time": "24th September 2016, 11:47 AM", "postID": "post68837136", "replies": []}, {"text": "My phone Heats up when i use camera... in abt 15 mins of use also it heats up quite a bit... and during turbo charging it also heats up bu not that much... sometimes we can feel the heat of the phone while it in our Jeans pocket also.", "time": "12th October 2016, 11:24 AM", "postID": "post69092260", "replies": [{"text": "Heating while long use of camera and turbo charging is normal. I have seen phones getting hot in pocket for quite some devices... It's because of proximity sensor acting up, but it doesn't drain battery so little bit of heat is fine with me.", "time": "29th October 2016, 10:38 AM", "postID": "post69359819", "replies": []}]}, {"text": "No heating issue here even while charging.", "time": "25th October 2016, 11:32 AM", "postID": "post69298220", "replies": []}, {"text": "I only noticed  little bit warming when charger is connected... as is it supossed to be.", "time": "2nd December 2016, 08:34 AM", "postID": "post69891771", "replies": []}, {"text": "Phone became really hot while playing HEVC x265 video on MX Player. Anyone experienced a similar problem?", "time": "16th February 2017, 07:08 PM", "postID": "post71060140", "replies": []}, {"text": "The phone easily goes around 44 degree Celsius while charging it.", "time": "19th February 2017, 10:52 AM", "postID": "post71095724", "replies": []}, {"text": ".......", "time": "10th March 2017, 04:56 AM", "postID": "post71360875", "replies": []}, {"text": "view this video for heating problem in moto g4 plus\nhttps://youtu.be/B8WEsHHPk3g", "time": "27th March 2017, 10:35 AM", "postID": "post71606184", "replies": []}, {"text": "I played asphalt 8 from the phone on the TV through DLNA, the device warmed up just a little\r\nAsphalt 8 needs to improve on the use of the processor", "time": "6th April 2017, 03:38 AM", "postID": "post71745047", "replies": []}, {"text": "Yep ! There's heating issues with my Moto G4 Plus and it's not gone even after updating to Nougat. Currently I'm in March 2017 security patch and still no reduction in heating. Heating occurs mainly during :\n1. Heavy Gaming (Mainly encountered while playing Asphalt only)\n2. Using rear cam for more than 15 minutes, especially outdoors during bright lighting conditions.\n3.While charging the phone using Turbo Charger.", "time": "28th April 2017, 09:01 PM", "postID": "post72081084", "replies": []}]}, {"title": "Low light", "rating": 4.0, "links": ["https://forum.xda-developers.com/moto-g4-plus/review/low-light-t3428818"], "threads": []}, {"title": "Photo quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/moto-g4-plus/review/photo-quality-t3428819", "https://forum.xda-developers.com/moto-g4-plus/review/photo-quality-t3428819/page2"], "threads": [{"text": "Above average", "time": "25th October 2016, 11:36 AM", "postID": "post69298264", "replies": []}, {"text": "I keep seeing reviews and comments talking about the great quality of this camera (above the average, at the level of high end...), however, my phone does not cope very well with some situations and I do not know why. Is it defective? is it low light? I am going to post some images but right now I am going to describe the behaviour.\n\r\nFor some reason the main camera struggles a lot when taking pictures of thing in movement. I does not expect a shutter speed of 1/1000 but I cannot make my son to be more steady either. The image seems focused except the moving part which is always blurry. This happens in low light but also in conditions which I consider good light (exteriors, rooms with 25W LED + side lamp...)\n\r\nThe front camera IMHO does not deserve any compliment, it struggles a lot to focus, more than half the pictures are blurry and/or out of focus, most of them have a lot of noise like in low light. It is a bit better after turning on the flash in screen but, again, is this normal?\n\r\nI will thank any comment on this.\n\r\nPicture 1_room_with_side_ window_light.jpg: Room with a side window where you do not need to turn the lights on for things like writing or sewing.\r\nPictures 2 and 3 has very good light in my opinion and the camera struggles.\r\n4 and 5 are made with the front camera and both are below the standard IMHO.\n\r\n1of3isgood shows how I needed 3 pictures to take one OK\r\nsunlight shows how the camera struggel even with sunlight in the scene\r\nwhatIexpect are 2 very good photos this is what I expect\n\r\nI have to say, the camera is at least VERY inconsistent on it results. It is capable of a lot but it only demonstrates some times\n\r\nWhat do you think?", "time": "25th October 2016, 01:28 PM", "postID": "post69299640", "replies": [{"text": "You're right.", "time": "27th October 2016, 05:30 AM", "postID": "post69327588", "replies": []}]}, {"text": "I honestly think that the camera on the Moto G could have been much better.  I like the camera APP interface itself, but the photo quality is mediocre. Aside from picture quality, anyone notices their camera lens getting scratched up? Mine is.", "time": "27th October 2016, 12:18 AM", "postID": "post69325035", "replies": []}, {"text": "The photo quality is not as described. Image stabilization seems just not there are or not working properly.\r\nPhoto quality is good only if still photos are taken during day time with more light in. That is all.\r\nBut for the cost of around $200 its a good phone but not a camera phone.", "time": "28th October 2016, 09:55 AM", "postID": "post69345704", "replies": []}, {"text": "How do I access camera debug options?", "time": "31st October 2016, 06:12 PM", "postID": "post69395859", "replies": []}, {"text": "As far as I'm concerned the camera quality is really above average. Your problem seems to find his cause elsewhere.\n\r\nTo keep it simple, your photos may be blurry because of the lack of light indoor. Smartphone are known to have small objective (while real camera have big one) that can't gather a lot of light by themselve. It means that you'll have to sacrifice quality if the environnement is not well lit. In this case, you're phone try to make up for the lack of light by gathering more light before taking the photo which cause a more blurry photo. You can also manually set it to take it faster but you'll have to use a higher iso (which mean more noise).\n\r\nIf you want a good photo you need :\r\n- light (even for a galaxy S7)\r\n- A good objective (also the bigger the better but we're on a smartphone so...)\r\n- A clean objective (I can't stress how this matter ! Even more if we consider that it's really use to put à finger on the objective of the moto g4)\n\r\nHere you go, hope it helped, if you want to test your camera to see if it has some problem you should do it outdoor with the sun at zenith and some cloud to avoid bad shadows and blinding effects.", "time": "9th November 2016, 07:24 AM", "postID": "post69530470", "replies": [{"text": "Thanks for your answer kayet95. The main point is that the camera is not reliable enough and you end up taking 5 pictures each time just to be sure one will be fine. Of course with the lighting you suggest the camera does well, it would be a complete rubbish if not, but take a look at my attachment sunlight. The window was fully open, there where sun coming into the scene and the camera struggled once.\n\r\nI agree the camera is capable of taking great pictures, but it is nor reliable.", "time": "10th November 2016, 03:20 PM", "postID": "post69553125", "replies": []}]}, {"text": "My experience is that the camera in G4Plus is above average for a phone. I think that who expects more is delusional, you need to buy a real camera to take good pictures - in low light or with any level of zoom.", "time": "14th November 2016, 07:29 PM", "postID": "post69620490", "replies": []}, {"text": "just wanting to share a photo taken by my Moto G4 plus . \r\nNo special Arrangement , everything on Auto", "time": "17th November 2016, 06:43 AM", "postID": "post69660908", "replies": []}, {"text": "I love this camera.... Sunny day and auto mode....\n\n\n\n---------- Post added at 10:18 AM ---------- Previous post was at 10:13 AM ----------\n\nAnother one. Raining and almost running by night. Just shot under the rain.... lot of noise but the connditions were really bad!!", "time": "2nd December 2016, 10:18 AM", "postID": "post69892785", "replies": []}, {"text": "Two more photos:\r\nOne tree \n\r\nRoyal Palace, Madrid, Spain", "time": "18th January 2017, 11:30 AM", "postID": "post70608621", "replies": []}, {"text": "the color quality is good, but sometimes i cant take a picture, might be my hand is wet, or the phone lagging", "time": "22nd January 2017, 02:23 AM", "postID": "post70666523", "replies": []}, {"text": "The camera is capable of good pictures, however mine seem inconsistent.  Sometimes take the same shot a couple times to get good one, even in good lighting.   I upgraded from last year's moto g, and consistently got excellent pictures with it.   \n\nOverall I feel the camera on the g4 plus isn't quite as good as last year's moto g. I was really expecting better.", "time": "31st January 2017, 05:00 AM", "postID": "post70809572", "replies": []}, {"text": "hi , i use OpenCamera and it`s much better.", "time": "8th February 2017, 04:39 PM", "postID": "post70938598", "replies": []}]}, {"title": "Video quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/moto-g4-plus/review/video-quality-t3428820"], "threads": []}, {"title": "Selfie quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/moto-g4-plus/review/selfie-quality-t3428821"], "threads": [{"text": "I sorry to say but selfie Quality of my Moto e4 plus is very bad  please can u fix it", "time": "24th September 2017, 02:39 AM", "postID": "post73908650", "replies": [{"text": "Lol it's not something you can fix. It's just the camera's quality that's poor. It's a budget phone, not an S8.", "time": "13th February 2018, 02:58 AM", "postID": "post75547231", "replies": []}]}, {"text": "This is G4 thread, how about posting in the correct thread?", "time": "24th September 2017, 10:15 AM", "postID": "post73911764", "replies": []}, {"text": "daylight, good quality, but when light lacks, quality is really poor, even with artificial ilumination", "time": "4th October 2017, 01:09 AM", "postID": "post74027204", "replies": []}, {"text": "In daylight and natural light selfies are good but in artificial and low lighting pics come out to be grainy. I have been usings this device for 1 year and now in artificial and low lighting pics come out to be a little more grainy than before.", "time": "4th October 2017, 10:56 AM", "postID": "post74031085", "replies": []}]}, {"title": "Time to take picture (camera launch speed)", "rating": 4.5, "links": ["https://forum.xda-developers.com/moto-g4-plus/review/time-to-picture-camera-launch-speed-t3428822"], "threads": []}, {"title": "Software (ease of use, features, etc)", "rating": 4.0, "links": ["https://forum.xda-developers.com/moto-g4-plus/review/software-ease-features-t3428823"], "threads": [{"text": "You have bombed this entire forum with posts....Can a mod take a look at this please?", "time": "29th July 2016, 10:54 PM", "postID": "post67961430", "replies": []}]}, {"title": "Charging speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/moto-g4-plus/review/charging-speed-t3428824", "https://forum.xda-developers.com/moto-g4-plus/review/charging-speed-t3428824/page2", "https://forum.xda-developers.com/moto-g4-plus/review/charging-speed-t3428824/page3"], "threads": [{"text": "I got 8 freaking hours of screen on time over the last two days. Even if it turns out to be 5 or 6 in the long run, the power charging means that I don't expect to run out of battery soon. Best battery performance since LG g2", "time": "24th September 2016, 11:50 AM", "postID": "post68837170", "replies": [{"text": "Whoa! Are you on stock? Rooted? Kernel? Any changes to the kernel???", "time": "26th September 2016, 01:10 AM", "postID": "post68859640", "replies": []}]}, {"text": "6:35 hours of screen-on time over 36 hours. Completely stock, non-root, nothing. Yeah baby!", "time": "30th September 2016, 12:43 PM", "postID": "post68923387", "replies": []}, {"text": "Dunno if this has been asked or mentioned anywhere on XDA but is it cool to use a non Moto fast charger? Last thing I want is this thing exploding next to my head while in bed...\n\nI ask because screw paying through the nose for a branded one when I have a perfectly good leftover fast charge adapter from an old phone that seems to do a fine job charging the G4 quickly.", "time": "30th September 2016, 01:18 PM", "postID": "post68923732", "replies": [{"text": "My Moto G4 came with the Turbo Charger so how are you paying through the nose for a branded one?", "time": "1st October 2016, 10:46 PM", "postID": "post68943434", "replies": [{"text": "There are two G4 models and only one of them comes with a turbo charger. The G4 Plus. I have the base model. So having to buy your own at Lenovo's prices is how you pay through the nose. Ok? Ok.", "time": "2nd October 2016, 01:56 PM", "postID": "post68950507", "replies": [{"text": "Very interesting, especially since I have a basic G4 not a G4 Plus and my phone came with a turbo charger at no extra charge. But to answer your original question I see no reason why any turbo charger would not work. I interchange all of my devices chargers without any negative impact.", "time": "3rd October 2016, 05:00 AM", "postID": "post68959003", "replies": []}]}]}]}, {"text": "I am getting very slow charging speed with turbo charger,  can anybody tell me why?", "time": "24th October 2016, 02:26 PM", "postID": "post69283727", "replies": []}, {"text": "The g4 plus has a rocket charging.", "time": "25th October 2016, 11:34 AM", "postID": "post69298237", "replies": []}, {"text": "Perfect. 5/5", "time": "4th December 2016, 01:33 PM", "postID": "post69923913", "replies": []}, {"text": "i love that i do not need to plug it in for too long to get at least a couple of days of battery life.  Being an avid mobile gamer, i need my phone to be ready all the time for my games among others. I absolutely recommend it!", "time": "8th December 2016, 03:27 PM", "postID": "post69991016", "replies": [{"text": "Do you mean to say you get days of battery life despite playing games regularly? If yes, do share your secret. Mine lasts about a day with heavy usage, and around 36 hours with light to moderate usage.\n\n\n\r\nHave you tried connecting the cable to a USB3.0 port? 3.0 is to 2.0 what the turbo charger is to a regular charger.", "time": "2nd January 2017, 11:20 AM", "postID": "post70357482", "replies": [{"text": "Yup, I tried on both 3.0 and 2.0, but apparently I face the same issue... I guess it's a hardware problem since I also face ghost touches while charging via AC outlet.  Look's like I gotta go to the CC for repair.", "time": "3rd January 2017, 03:01 PM", "postID": "post70375275", "replies": []}]}]}, {"text": "Moto G4 plus is one of the best phones in case of battery backup and charging speed...its great combination...", "time": "10th December 2016, 12:27 PM", "postID": "post70020218", "replies": []}, {"text": "Check your cable, hope its not faulty now.", "time": "17th December 2016, 03:07 PM", "postID": "post70133668", "replies": []}, {"text": "I cannot make a comparison with other quick charging techniques (YouTube will be you're friend, I guess), but I can state that the Moto G4 Plus charges very rapitly with the OEM Turbo Charger that comes with it \n\nA bit off-topic, but combined with the better camera and really excellent fingerprint sensor, I do not see any reason why people would opt for the regular G4 over the G4 Plus. It is worth the extra money.", "time": "26th December 2016, 12:44 PM", "postID": "post70260404", "replies": []}, {"text": "Hi, When charging my phone via turbo charger it charges quite fast as mentioned, however my main problem is when I charge via laptop (USB cable), the charging speed is way too slow... I mean I have tried with different chargers but my phone hardly charges via usb cable (for 5% to 15% in ONE hour compared  to 5% to 60-80% via turbo charger). Anyone else facing the same issue i.e., damn slow charging via usb cable", "time": "29th December 2016, 08:20 AM", "postID": "post70300970", "replies": []}, {"text": "I am using the turbo charger that came with the Moto X Pure and, when connected to the Moto G Plus, it shows TurboPower connected on the screen  (and it does charge super fast).", "time": "2nd January 2017, 12:45 PM", "postID": "post70358366", "replies": []}, {"text": "Sorry for the English, it was translated by Google.\nActually, the load is very fast, but after I did the bootloader skew and installed LineageOS 14.1, this condition no longer exists, until when in Nougat 7.0 (Stock Rom) when I connected the loader the quick load notification appeared, now no more, The developers of LineageOS will solve this ?, despite this I will continue with LineageOS, I liked it very much, to return now does not make sense, because I have already lost the warranty of my Moto G4 Plus XT1640. Any Forum Moderators who read this can tell me if I should open a new topic. A big hug to everyone\n\nDesculpem pelo Ingles, foi traduzido pelo Google.\nRealmente, o carregamento é muito rápido, porém depois que fiz o desblouqueio do bootloader e instalei o LineageOS 14.1 essa condição deixou de existir, até quando no Nougat 7.0 (Stock Rom) quando eu conectava o carregador aparecia a notificação de carregamento rápido, agora não mais, será que os desenvolvedores do LineageOS vão resolver isso?, apesar disso vou continuar com LineageOS, gostei muito, voltar agora não faz sentido, até porque já perdi a garantia do meu Moto G4 Plus XT1640. Algum Moderador do Forum que ler isto pode me dizer se devo abrir um tópico novo. Um forte abraço a todos", "time": "4th March 2017, 04:36 PM", "postID": "post71282239", "replies": []}, {"text": "My Moto G4 charges scarily fast. Like, 15% in 10 minutes. And the battery gets very hot. I don't know what to think of this. My phone never gets hot, even when gaming/taxing the CPU, however, when turbo charging the back will warm up very, very quickly.\n\nApparently TurboCharging also causes these so-called \"Ghost Touches\" which have plagued many phones. \n\nSo, the Turbo Charger is on the side for emergencies/flights/travel. Currently using a standard 2A Fast Charger which works just fine for normal use.", "time": "5th March 2017, 12:36 AM", "postID": "post71286877", "replies": []}, {"text": "It is a great charger..Turbo charger... Battery problems arise when we use phone too much often when charging...Since there comes ghost touches when we use it during charging i can say it is actually a \"Blessing in Disguise\" ...So we are forced to avoid that habit.\nEven though it is some kind of malfunction it does the job..\nNormal charging is comparatively slow but is enough for use in random normal situations..\nOverall i havegood regards for both battery and the charger...", "time": "9th March 2017, 12:48 PM", "postID": "post71350110", "replies": []}, {"text": "G4 plus charger is best charger I think the charging speed is very high .", "time": "28th March 2017, 10:11 AM", "postID": "post71619642", "replies": []}]}, {"title": "Screen on time", "rating": 4.0, "links": ["https://forum.xda-developers.com/moto-g4-plus/review/screen-time-t3428825", "https://forum.xda-developers.com/moto-g4-plus/review/screen-time-t3428825/page2", "https://forum.xda-developers.com/moto-g4-plus/review/screen-time-t3428825/page3", "https://forum.xda-developers.com/moto-g4-plus/review/screen-time-t3428825/page4"], "threads": [{"text": "never took the battery down much past 50% but at the 50% mark I'll usually have about 3 hours of SOT. my moto g³ is pretty much the same. great battery life and SOT on the g⁴plus! especially if you're like me and mostly use IRC and open a few links and youtubes throughout your session. you're going to have PLENTY of SOT", "time": "13th September 2016, 06:50 PM", "postID": "post68671479", "replies": []}, {"text": "Compared to the screen in the G3, it is sharper despite being bigger at 5.5 inches. This is due to the higher resolution of 1080p. The text looks crisp on this phone. But where it truly excels is in showing colours. The contrast and the colour depth on it is brilliant. The brightness is more than adequate, although it is also a very reflective screen and that poses some difficulty during outdoor use. The viewing angles are average -- the screen darkens when viewed at an angle -- and that too affects the outdoor visibility. But I have seen worse. And seen better. The G4 Plus is closer to the best.", "time": "15th September 2016, 08:17 AM", "postID": "post68696354", "replies": []}, {"text": "", "time": "24th September 2016, 11:56 AM", "postID": "post68837238", "replies": []}, {"text": "Im getting insane battery life, waaaah I'm just amazed by the SOT and performance..\r\nFULLY STOCK..NO GREENIFY NOR ROOT NOTHING.......Full stock no tuning nothing..", "time": "13th October 2016, 02:31 PM", "postID": "post69110944", "replies": [{"text": "waw..is wonder", "time": "17th October 2016, 04:44 PM", "postID": "post69174050", "replies": []}]}, {"text": "Mine Screen On Time : 6h 45mins with wifi and 4G always On.second sim also 3G.With moderate use of camera,whatsapp,telegram,facebook,calls.\n\r\nIs it Normal or i have to improve more?", "time": "18th November 2016, 04:29 AM", "postID": "post69676006", "replies": [{"text": "How did you change ur statusbar ?\r\nTheme name pls ??", "time": "25th November 2016, 11:46 AM", "postID": "post69784302", "replies": []}]}, {"text": "i get like 18 hrs workings time g4", "time": "27th November 2016, 05:26 PM", "postID": "post69819385", "replies": []}, {"text": "", "time": "27th November 2016, 05:33 PM", "postID": "post69819497", "replies": []}, {"text": "how much screen on time is got when elemental x kernel is used guys??", "time": "5th February 2017, 09:43 AM", "postID": "post70886693", "replies": []}, {"text": "", "time": "10th February 2017, 08:02 PM", "postID": "post70973029", "replies": [{"text": "On which rom? Stock kernel or custom? Configured?", "time": "12th February 2017, 06:13 PM", "postID": "post71000663", "replies": [{"text": "Pure Bone Stock bro, not rooted, no custom rom, nothing really configured.", "time": "12th February 2017, 07:53 PM", "postID": "post71001928", "replies": [{"text": "Nougat Or MM?\nBuild Number", "time": "12th February 2017, 08:07 PM", "postID": "post71002129", "replies": [{"text": "Nougat\r\nBuild No - NPJ25.93-14", "time": "12th February 2017, 08:10 PM", "postID": "post71002161", "replies": []}]}]}, {"text": "He was just starting at the screen watching videos", "time": "13th February 2017, 01:47 AM", "postID": "post71005210", "replies": []}]}]}, {"text": "[deleted]", "time": "23rd February 2017, 02:28 PM", "postID": "post71156842", "replies": []}, {"text": "I found a nice guide here: https://forum.xda-developers.com/sho....php?t=2601318", "time": "7th April 2017, 11:01 AM", "postID": "post71762324", "replies": []}, {"text": "I'm one of those unlucky guys who get around 4hrs of SOT.", "time": "16th April 2017, 07:57 AM", "postID": "post71880573", "replies": []}, {"text": "Stock rom, March 1 patch.", "time": "16th April 2017, 07:18 PM", "postID": "post71888067", "replies": [{"text": "Staring at screen watching videos will give sot like this!", "time": "17th April 2017, 12:35 PM", "postID": "post71896748", "replies": []}]}, {"text": "SoT varies significantly on this device. Heavy gaming (Clash Royale, even more casual games such as Brick Breaker), will yield 4-4.5 hours SoT over a day.  However, light use such as Reddit, web browsing, Instagram, etc., will easily yield 6-8 hours of SoT depending on brightness and frequency of use", "time": "17th April 2017, 02:44 PM", "postID": "post71898224", "replies": []}, {"text": "Stock rom, 1 March patch.", "time": "20th April 2017, 10:06 PM", "postID": "post71953387", "replies": []}, {"text": "I get 5-6 hours stock + EX Kernel", "time": "30th August 2017, 08:31 AM", "postID": "post73593480", "replies": []}, {"text": "Moto G4 XT1622 Stock 7.0 NPJ25.93-14-8 ElementalX Kernel rooted with Magisk.\n\r\nUsage was mostly surfing and WhatsApp via WLAN & MP3 (no gaming at all).", "time": "17th September 2017, 05:39 PM", "postID": "post73828541", "replies": [{"text": "have you done any configuration in the EX-Kernel App? and used some optimization application like L-Speed, or HEBF?\n\n\n\r\n.", "time": "27th September 2017, 02:36 AM", "postID": "post73946309", "replies": [{"text": "LSpeed battery saving profiles only.", "time": "27th September 2017, 07:30 PM", "postID": "post73955535", "replies": []}]}]}, {"text": "I get about 3.5-4 hrs of sot. Maximum 4.5(when watching YouTube). I don't know why.", "time": "28th September 2017, 10:57 AM", "postID": "post73962236", "replies": []}, {"text": "Mobile standby taking more battery any one please help me?", "time": "16th October 2017, 06:30 AM", "postID": "post74174733", "replies": [{"text": "This is not a Q&A thread, please use this one https://forum.xda-developers.com/mot...endly-t3526598 and read the last pages how to monitor battery drain problems.", "time": "16th October 2017, 09:05 AM", "postID": "post74176005", "replies": []}]}, {"text": "Gets about 4-5 hrs SOT", "time": "11th January 2018, 06:59 AM", "postID": "post75156862", "replies": []}, {"text": "According to GSam Battery Monitor I get 3h35 on average per complete charge :/ 5h max\n\r\nI always have bad cellphone signal though so that might be why.", "time": "1st April 2018, 10:11 AM", "postID": "post76085954", "replies": []}]}, {"title": "Standby drain", "rating": 4.0, "links": ["https://forum.xda-developers.com/moto-g4-plus/review/standby-drain-t3428826", "https://forum.xda-developers.com/moto-g4-plus/review/standby-drain-t3428826/page2"], "threads": [{"text": "Having problem, Battery is draining quickly in 7.0", "time": "22nd April 2017, 02:20 AM", "postID": "post71971550", "replies": []}, {"text": "i used to have a moto g4 plus, I did not find any unusual drain unless i had 4G data or wifi on", "time": "25th April 2017, 12:49 PM", "postID": "post72023300", "replies": []}, {"text": "My moto g4 plus was working fine until a few days back, now the standby drain is terrible even charging my phone takes more than 3-4 hours. \nThe battery status shows that my phone is almost always awake and draining the battery. It works better in safe mode, how do I find what's causing the phone stay awake??", "time": "12th May 2017, 10:17 AM", "postID": "post72263791", "replies": [{"text": "I had the same issue........,but i fixed it(somehow)....................,first of all,doing a factory reset is sure to fix it...........................,also ,the main cause for this is because of the tons of apps and services running in the background......................................,i  f you don't want to reset,try using greenify,,,,,,,,,,,,,,,,,it hibernates apps and prevents them from working when the screen is off..........................greenify works on both rooted and non-rooted devices,although it is much more effective on rooted devices...........i highly recommend it........................good luck....", "time": "12th May 2017, 08:24 PM", "postID": "post72270595", "replies": []}]}, {"text": "My battery was draining pretty fast  so I installed GSAM and found that the app DSub was taking up most of my battery. Never had the issue with the app on previous phones/android versions so I went into settings and found that DLNA was enabled. The description said to disable if it was causing battery drain on Nougat. I turned it if off and now the battery life is MUCH better.", "time": "31st May 2017, 06:55 PM", "postID": "post72499043", "replies": [{"text": "Where in the settings did you find the DLNA option to disable?  Please help.", "time": "7th June 2017, 06:42 AM", "postID": "post72578054", "replies": [{"text": "Sorry for the late reply...in DSUB, go to Settings, Casting, and scroll to the bottom.", "time": "24th June 2017, 01:32 AM", "postID": "post72783286", "replies": []}]}]}, {"text": "Same here. Help. It charges up way too quickly and then loses battery just as quick . Standby shows 19% !!!!", "time": "12th June 2017, 04:52 PM", "postID": "post72644975", "replies": [{"text": "Looks like you're in an area with poor signal strength, and that you use the Turbo Charger for daily use.\n\r\nThat graph looks perfectly normal for those conditions.", "time": "12th June 2017, 07:17 PM", "postID": "post72646762", "replies": []}, {"text": "Anything has to be the top stat, but don't forget that it is only 18% of 6%.", "time": "14th June 2017, 08:55 PM", "postID": "post72674177", "replies": []}]}, {"text": "Good backup", "time": "22nd July 2017, 07:52 AM", "postID": "post73123230", "replies": []}]}, {"title": "Heavy use endurance", "rating": 3.5, "links": ["https://forum.xda-developers.com/moto-g4-plus/review/heavy-endurance-t3428827"], "threads": [{"text": "Here I played Magic Rampage for 1 hour or so, it was over 30%, I'm using Stock ROM, with Magisk (just the Viper4android module) and Xposed (just the Gravity Box module to customize the Nav Bar) and it's a game extremely lightweight, and burst with the battery.", "time": "27th September 2017, 02:30 AM", "postID": "post73946277", "replies": []}, {"text": "same here. Gaming not only cause the phone to heat but loose large amounts of battery too. I love this phone but poor battery is what tempting me to switch to some other.", "time": "1st October 2017, 04:57 AM", "postID": "post73993241", "replies": []}, {"text": "1 hour of pokemon go, and droped 15% of battery...\n\nim always getting 3-4 screen hours in heavy use, so think thats not so bad\n\nstock rom, stock kernel, september security patch", "time": "4th October 2017, 01:07 AM", "postID": "post74027184", "replies": [{"text": "Same stats for me, 3-4 hours screen battery life", "time": "19th October 2017, 05:21 AM", "postID": "post74213242", "replies": []}]}, {"text": "I'm running the latest liquid dark rom and this little g⁴plus scoots. Multi tasks well I stream audio from 8am to 6pm every day. GPS on wifi off,lte on, I come home with 30 % battery left and only a quick charge away from topping it off then it snoozes next to me unplugged as a second alarm clock.  I have a one plus 3t and it would be in battery saver mode well before the end of my day.", "time": "26th October 2017, 04:40 PM", "postID": "post74303473", "replies": []}]}, {"title": "Light use endurance", "rating": 4.5, "links": ["https://forum.xda-developers.com/moto-g4-plus/review/light-endurance-t3428828"], "threads": []}, {"title": "\"Look\" of the device (aesthetics)", "rating": 4.0, "links": ["https://forum.xda-developers.com/moto-g4-plus/review/look-device-aesthetics-t3428829"], "threads": []}, {"title": "Quality feel (use of materials)", "rating": 4.0, "links": ["https://forum.xda-developers.com/moto-g4-plus/review/quality-feel-materials-t3428830"], "threads": []}, {"title": "Ergonomics (in-hand feel)", "rating": 3.5, "links": ["https://forum.xda-developers.com/moto-g4-plus/review/ergonomics-hand-feel-t3428831"], "threads": []}, {"title": "OEM skin/software", "rating": 4.0, "links": ["https://forum.xda-developers.com/moto-g4-plus/review/oem-skin-software-t3428832"], "threads": []}, {"title": "Outdoor visibility (max brightness)", "rating": 4.5, "links": ["https://forum.xda-developers.com/moto-g4-plus/review/outdoor-visibility-max-brightness-t3428833"], "threads": [{"text": "Better than my old Moto G3, I am very happy.", "time": "4th December 2016, 01:34 PM", "postID": "post69923925", "replies": []}, {"text": "Extremely good. Outdoor visibility is as good as indoor", "time": "20th December 2016, 07:49 PM", "postID": "post70182205", "replies": []}, {"text": "Outdoor visibility is good but conditions apply,\nAs turning the brightness to max triggers the notorious \"ghost touch\", can't say about everyone but happens to me, and not always, depends on my luck", "time": "9th June 2017, 09:30 AM", "postID": "post72605088", "replies": [{"text": "this happen  lot with me ..", "time": "22nd September 2017, 11:19 AM", "postID": "post73888326", "replies": []}]}, {"text": "great phone", "time": "19th August 2017, 08:41 AM", "postID": "post73455261", "replies": []}, {"text": "Good brightness, however when its on max or anywhere near max, it starts ghost touching.", "time": "28th August 2017, 11:31 PM", "postID": "post73577514", "replies": []}]}, {"title": "Contrast (true blacks)", "rating": 4.0, "links": ["https://forum.xda-developers.com/moto-g4-plus/review/contrast-true-blacks-t3428834"], "threads": [{"text": "hey guys , i m using moto g4 plus and i observed that white color generated by display is not purely white, its yellowish. i also compared the display with other brands and observed same image on both displays , there is difference in colors of same image obsereved on different brands and also the blue color on moto display found different in shade.. is there any apk for adjusting display settings? coz there was no any advance settings in moto for display..  i used some play store apps and not found usefull..", "time": "24th August 2016, 04:42 PM", "postID": "post68344511", "replies": []}]}, {"title": "Color saturation & accuracy", "rating": 4.0, "links": ["https://forum.xda-developers.com/moto-g4-plus/review/color-saturation-accuracy-t3428835"], "threads": []}, {"title": "Clarity/resolution", "rating": 4.0, "links": ["https://forum.xda-developers.com/moto-g4-plus/review/clarity-resolution-t3428836"], "threads": []}, {"title": "Minimum brightness", "rating": 4.0, "links": ["https://forum.xda-developers.com/moto-g4-plus/review/minimum-brightness-t3428837"], "threads": []}, {"title": "Call quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/moto-g4-plus/review/call-quality-t3428838"], "threads": [{"text": "Call quality is quite terrible compared to other phones I had. WiFi and data is as good as on my high end phones. I haven't use dthe speaker.", "time": "24th September 2016, 11:53 AM", "postID": "post68837195", "replies": []}, {"text": "It's all good here", "time": "10th June 2017, 12:02 PM", "postID": "post72618572", "replies": []}, {"text": "I have't any experience with this phone , but I also see reviews on internet regarding its call quality, camera and others...", "time": "4th July 2017, 01:28 PM", "postID": "post72903863", "replies": []}]}, {"title": "WiFi strength, range, and throughput", "rating": 4.5, "links": ["https://forum.xda-developers.com/moto-g4-plus/review/wifi-strength-range-throughput-t3428839"], "threads": []}, {"title": "Cellular strength and throughput", "rating": 4.0, "links": ["https://forum.xda-developers.com/moto-g4-plus/review/cellular-strength-throughput-t3428840"], "threads": [{"text": "I voted average. It's EXTREMELY slow to reconnect to mobile signals after losing signal for 15 seconds. It took around 2-3 minutes to start searching for signal again. I'm sure it's just a setting but I bet it's hidden away in the service menu. By comparison my LG G3 would reconnect within seconds.", "time": "6th December 2016, 10:21 PM", "postID": "post69963396", "replies": []}, {"text": "For me it is very good, I live in Spain, with Movistar, and I have not had problems with the signal, thanks to the band 800, I have 4G in the room, when other phones did not reach 3G.\nFrom the garage, I live in a six-storey building, nothing comes of coverage, between parking and climbing in the elevator, it takes more than 2 minutes,\nAnd in the elevator itself I have 3G coverage and followed the 4G.\nI have not configured anything, everything related to the network is by default.", "time": "18th December 2016, 03:59 AM", "postID": "post70141130", "replies": []}, {"text": "I live in Northeast PA and use the CDMA option with net10. It uses Verizon's towers. LTE everywhere I have been and I have done a lot of traveling. Speed is decent could be faster. Usually reconnects fine.", "time": "20th December 2016, 02:43 AM", "postID": "post70170631", "replies": []}]}, {"title": "Speakerphone (loudness, clarity)", "rating": 4.0, "links": ["https://forum.xda-developers.com/moto-g4-plus/review/speakerphone-loudness-clarity-t3428841"], "threads": [{"text": "low", "time": "13th August 2016, 07:08 PM", "postID": "post68173361", "replies": []}, {"text": "Im more than happy with the speaker and sound.", "time": "20th August 2016, 06:40 PM", "postID": "post68280640", "replies": []}, {"text": "The speaker is very loud and clear but tends to distort a littel bit when at max volume.", "time": "10th July 2017, 03:24 PM", "postID": "post72975647", "replies": []}, {"text": "Clear but not loud. It has a reason, as it boosts the bass frequency to be able to hear but it reduces the high frequency (treble) at its cost.", "time": "23rd September 2017, 07:32 PM", "postID": "post73905671", "replies": []}, {"text": "exist any way or apk to make a bit more louder ?", "time": "13th February 2018, 03:39 AM", "postID": "post75547498", "replies": []}]}]