[{"title": "Overall love", "rating": 5.0, "links": ["https://forum.xda-developers.com/pixel-2-xl/review/overall-love-t3685533", "https://forum.xda-developers.com/pixel-2-xl/review/overall-love-t3685533/page2", "https://forum.xda-developers.com/pixel-2-xl/review/overall-love-t3685533/page3", "https://forum.xda-developers.com/pixel-2-xl/review/overall-love-t3685533/page4"], "threads": [{"text": "Great upgrade for me coming from Nexus 6P.", "time": "21st October 2017, 12:44 PM", "postID": "post74241173", "replies": []}, {"text": "Coming from Moto X Pure. Totally digging it. Having to get used to thinner phone overall but the speed of this thing is awesome and everything just works", "time": "21st October 2017, 02:56 PM", "postID": "post74242386", "replies": []}, {"text": "fantastic so far!", "time": "22nd October 2017, 06:07 PM", "postID": "post74255580", "replies": []}, {"text": "Best in the West! 🍾🏆🎖️", "time": "22nd October 2017, 06:11 PM", "postID": "post74255610", "replies": []}, {"text": "Come from Pixel XL and minus the headphone jack I love it", "time": "23rd October 2017, 12:31 AM", "postID": "post74259010", "replies": []}, {"text": "wow this thing is fast and I love the camera and stereo speakers!", "time": "26th October 2017, 02:59 AM", "postID": "post74296785", "replies": []}, {"text": "I come from Pixel.  Everything is so much better.  The blue tint doesn't bother me much, either.", "time": "26th October 2017, 05:28 PM", "postID": "post74304064", "replies": []}, {"text": "Coming from a Nexus 6, loved that phone to death. I tried to get a Galaxy s8+ but without root, I couldn't do it. After playing with the pixel 2xl, I'll be returning the s8+. Wasn't worth it. I have no problems with my 2 xl. I don't really care too much about with my screen getting a slight time of blue when seen at off angles (please, it looks great when you are actually LOOKING at the device). It has realistic colors overall too. Nothing with a huge amount of contrast. \n\nI dislike the overall feel of the device, but I always have a case on mine, so no worries there. \n\nIt charged the same as any other device I have and I don't use wireless charging ever, besides, it is usually slower overall than plugging it in. \n\nLiterally no other problems I've noticed with my unit. I plan of keeping it, and when Google decides too send an ota to fix software issues I'll already be on a custom rom and not care anyway. If there is a huge problem and in need of a recall, I'm relatively sure Google will provide proper compensation. I'm not really worried.", "time": "26th October 2017, 09:24 PM", "postID": "post74306612", "replies": []}, {"text": "Coming from a Verizon Samsung Galaxy S5 with a 15 chip (BL unlockable) I'm obviously loving this device.  I installed the Quick Settings app to enable immersive mode \"just in case\" for the nav buttons.  Got mine on 10/23.  Charges fast with the included charger, latest camera app update fixed selfie portrait problems.  No display issues other than the blue off axis tint.  Overall happy.", "time": "27th October 2017, 05:00 AM", "postID": "post74309533", "replies": []}, {"text": "Absolutely loving mine!  The in hand feel is off the charts, a sure handed grip without a case and flat sides that you can actually grip.  The PXL2 is so much more comfortable to use than my Note 8, looks like Swappa will have a new listing.", "time": "28th October 2017, 01:46 AM", "postID": "post74320108", "replies": []}, {"text": "Love mine as well. I don't have much of a blue tint (slightly more than the original Pixel XL). I think the screen is otherwise awesome. I like the coloring and unless you're comparing to a highly-saturated screen, you won't notice. \n\nIt's very fast, has awesome battery life, can't go wrong with Pure Android, and the camera is out-of-this-world. I use Bluetooth headphones, so no worries without a jack (haven't used a headphone jack in over two years). I think this is a very worthy upgrade and people who are canceling or returning because of screen issues, I would say to reconsider and if your screen is truly bad, RMA it versus returning it altogether. I think there was a bad batch.", "time": "28th October 2017, 02:49 AM", "postID": "post74320432", "replies": []}, {"text": "This badboy is sweet!  XL 2 is rocking!", "time": "28th October 2017, 05:00 AM", "postID": "post74321094", "replies": []}, {"text": "On the other thread guys are complaining of poor charging speeds, how Is it for you guys enjoying the phone?", "time": "28th October 2017, 11:26 AM", "postID": "post74323873", "replies": [{"text": "The first night i had it i woke up after having it charging for 6 hours and it was only at 88%. Unplugged it and plugged it back in and it went to 100%\n\r\nUpdated to the 8.1 beta and my charging is all back to normal now", "time": "28th October 2017, 03:53 PM", "postID": "post74326414", "replies": []}]}, {"text": "I love how fast this phone boots up. The display is fine for me too. \nWhat could be the deal breaker is the bluetooth microphone issue. I use my headset daily.", "time": "29th October 2017, 01:13 PM", "postID": "post74335761", "replies": []}, {"text": "Coming from a Nexus 5X, this phone is exactly what I've been wanting. I really would be love the design of the 2 XL in the \"regular\" size but I'll take it. The bigger screen and battery is worth the larger size.", "time": "29th October 2017, 11:39 PM", "postID": "post74341383", "replies": []}, {"text": "I am so blown away by this phone.  Everything, the speed, the screen, the battery....I can't imagine anything better.  \n\nAll I need now is to root.  After going years without ads, it's tough.  I MIGHT stay stock if I can just get used to the ads, but it seems overwhelming.  I would have no problem paying a flat rate for apps and such so that they would be ad-free, but so many do not offer that.  Never realized how bogged down many sites are with ads.", "time": "30th October 2017, 03:32 PM", "postID": "post74347571", "replies": []}, {"text": "I am loving this phone. I went from a Nexus 6P to this phone and I am blown away.", "time": "30th October 2017, 03:43 PM", "postID": "post74347696", "replies": []}, {"text": "I love it so far. The screen is meh, but nowhere near as bad as people say. It's blazing fast and everything works. My only real complaint so far is that fast charging is pretty slow.", "time": "2nd November 2017, 05:36 AM", "postID": "post74376745", "replies": []}, {"text": "Love this phone.  Upgraded from LG G6.  Just took a picture at night and it came out amazing.", "time": "13th November 2017, 07:52 PM", "postID": "post74504126", "replies": []}, {"text": "Still courting my girl... 😍😎", "time": "14th November 2017, 05:52 PM", "postID": "post74514252", "replies": []}, {"text": "When I first got this phone, I was very focused on the flaws that people have said about the device. However after a couple of days of using it, I don't notice them anymore. The blueshift doesn't bother me.  Coming from iOS (been an android since the backflip, but switched to iOS just to see what the fuss is all about) to this made me feel like home again haha. The speed is incomparable. It opens apps almost instantaneously. Going back to the iPhone annoyed me because it became so sluggish after using the Pixel 2 XL. Overall, it's been weeks and still in love with this phone as if I just got it.", "time": "15th November 2017, 05:55 AM", "postID": "post74519552", "replies": []}, {"text": "i had a lot of devices. OnePlus 3, s8+, Original Pixel XL, Note8, and this one is by far the best. I was little bit sceptical about the display and other reported issues, but after a day of use i don't even notice the blue screen anymore. Battery life is amazing (really important to me) and camera is out of this world.", "time": "30th November 2017, 07:37 PM", "postID": "post74693479", "replies": []}, {"text": "This phone is damn near perfect except for the sub par screen quality. If it had a panel that was on an equal playing field as the S8 or iPhone X, then I would have absolutely ZERO negative things to say about this device.", "time": "7th December 2017, 12:39 AM", "postID": "post74760806", "replies": []}, {"text": "Comming from the Galaxy S7 an I love the great performance of the 2 XL as well as the awesome battery life. I also love the clean Android without a crappy user interface. Great to get updates immediately.\n\r\nThe Display is alright but not good enough for the price tag. I love the stock natural colours (not using vivid mode!), the blue shift while tilting the phone isn't bothering me so much since you need to unnaturally tilt it to experience it. The black smear on low brightness is a bit annoying from time to time.", "time": "9th December 2017, 09:30 PM", "postID": "post74792041", "replies": []}, {"text": "Coming from my 3 year old Nexus 6. Not impressed yet. Only had it a week though. Screen seems tiny by comparison. Speed and fluidity comparable as I was running PureNexus on the N6. Haven't had time for pictures yet so we'll see on that spec. To be honest I almost feel like I downgraded. Going to replace my N6 battery soon and do more testing. My battery in the N6 down to @2500 mah. Was getting alot of freezing up and lag, found processor running at 1496 instead of 2649. Even with Franco kernel it would drop power intermittently. Maybe battery maybe hardware.", "time": "11th January 2018, 05:09 PM", "postID": "post75162453", "replies": []}, {"text": "Been on iOS for a while, this is my first android device in a couple of years. This the first android device that I haven't felt the need to root/mod the moment I took it out of the box. I have been using the P2XL as my DD for over a week, and haven't rooted it yet, which is probably a record for me lol. My last android phone was a Nexus 5X, which I actually bought for my girlfriend in an attempt to pull her away from iOS. The Pixel 2 XL reminds me a lot of the Nexus 5X, but vastly improved in (almost) every way.\n\r\nI still can't get over how light it is, especially compared to my iPhone 6S+. My iPhone never let me forget it was in my pocket, it was like a brick. The P2XL is a fraction of the weight.\n\r\nThe fingerprint scanner is fantastic. In over a week's use, the fingerprint scanner has missed only once, and I am constantly unlocking my phone. My last experience with fingerprint scanning was on a Note 4, and was so bad that it turned me off fingerprint scanners. But the P2XL fingerprint scanner just works. Period.\n\r\nThe UI is buttery smooth, no hiccups whatsoever...very iOS-ish in that regard. Of course, Nova Launcher takes it to the next level...\n\r\nThe camera is phenomenal, it blows iPhone out of the water. I often had to adjust my position/angle for the iPhone to get the right exposure, but the P2XL gets it with no special effort. Details are crisp and colors are true. I have not yet taken any videos, so I can't comment on that.\n\r\nI love how the P2XL identifies songs playing in the background. I never thought I'd use that feature so much, and I wouldn't buy a phone just for that reason. But it is definitely a nice little extra.\n\r\nThe front facing speakers are a welcome change. Not HTC BoomSound quality, but definitely a step up from iPhone mono speaker (I got so tired of cupping my hand to hear anything in a room of average ambient noise)\n\r\nMy screen has the blue tint that is more noticeable at angle, but it doesn't bother me. The only time I really notice is when I put the P2XL next to another device. It is definitely not worth swapping or selling the phone.\n\r\nThe P2XL color vividness is fine for me. I've had multiple Samsung phones, so I know what AMOLED colors are like, and I don't really miss that.\n\r\nThe battery is about what I expected ― not GNex awful, but not stellar either. Battery life has never been the best feature of android, even after disabling/optimizing everything that can be, yet still have a useful phone. That is one thing iPhone always seems to have over android.\n\r\nI am still getting used to the volume rocker on the right side, and the \"back\" button on the far left (Seriously? Whoever suggested that must have been a leftie)\n\r\nI got a Spigen thin fit case that I love, but still looking for a good *glass* screen cover. Does anyone have a recommendation?\n\r\nEdit: The Spigen case is good quality, but I am already starting to see lint in the crevice between the case and screen, which is irking my OCD. My iPhone had an aluminum bumper case, and I never cleaned lint from it. Maybe someone will eventually sell a metal bumper case for the P2XL.", "time": "16th January 2018, 04:00 PM", "postID": "post75221332", "replies": [{"text": "Whitedome protector is the only best one\nYou can search about it more and will understand what i am saying\nCheers 🍻", "time": "16th January 2018, 05:57 PM", "postID": "post75222749", "replies": [{"text": "Are you referring to Dome Glass?\r\nI looked at that one, and Fakespot suggests the reviews are genuine. But looks like a pain in the ass to install lol", "time": "16th January 2018, 06:09 PM", "postID": "post75222893", "replies": [{"text": "Yea that's the one\nAnd yes that too lol but only glass protector which has full adhesive though", "time": "16th January 2018, 06:13 PM", "postID": "post75222929", "replies": [{"text": "I am now into my 4th week with the P2XL, and I still think it is the most capable \"Google\" phone ever made. I am still impressed with the camera (both stills and video), battery life, and overall UI fluidity. I am still not rooted, which really surprises me. I found an extremely effective non-root adblocker as well as a simple and free solution for swapping the navigation buttons. I am also impressed with Google Assistant. I didn't think I'd use GA, but I find myself using more and more.\n\r\nSo far, my biggest complaint is the lack of aux input. I got an adapter that works well enough, but it is something else to keep up with. I do wish there were more choices of glass screen protectors. I got the one Google sells on their web store simply because I had credit in my Google wallet. The protector looks and feels much better than the vinyl protector I had been using, but sensitivity is diminished in the corners (especially the bottom right). It also has the rainbow effect in the middle, which is not noticeable with light backgrounds, but annoying with dark backgrounds. The rainbow banding will probably drive me nuts. Next time I will get Dome Glass.", "time": "29th January 2018, 04:20 PM", "postID": "post75374015", "replies": []}]}]}]}]}, {"text": "I've had the phone since early December and have absolutely nothing but great things to say. I came from a Moto G2 that I used for three years. It was rooted and ROM'd which I thought I'd miss doing on the Pixel XL (yes, Verizon version, took advantage of the $300 discount and was added to my girlfriend's service). I've been using AdGuard for Android as an ad blocker and it works wonderfully. I also bought a cheap $10 case from EBay and it adds a lot of protection, may get a better case at some point but don't see any reason right now - https://www.ebay.com/itm/382243533985 The Pixel is smoking fast and have yet to experience even the slightest stutter. Overall, love!", "time": "29th January 2018, 06:55 PM", "postID": "post75375766", "replies": []}, {"text": "I have N6p right now and Pixel 2 XL sounds like a perfect option for a replacement. \r\nAnd it would be perfect, but 2 things... \r\n1) Price. In Poland it costs almost 5k zł which is about 1200 euro. Out of space. \r\n2) No 3,5mm jack... I have no idea why those morons are creating smartphones without this port. It's retarded for me af.", "time": "8th February 2018, 11:19 AM", "postID": "post75489302", "replies": []}, {"text": "I absolutely love my Pixel 2 XL. I got the 128 GB so I would be sure to have plenty of space. I truly love how fast this phone is and I love the pictures it produces. I have not run into any of the issues some have complained about and I feel fortunate for that. I thinking it may be from some of the fixes google put out to help with things, not sure. I definitely give this phone an A+ and will become a long time user as long as they don't do anything to ruin it.", "time": "8th February 2018, 09:04 PM", "postID": "post75495224", "replies": []}]}, {"title": "Community development strength", "rating": 3.5, "links": ["https://forum.xda-developers.com/pixel-2-xl/review/community-development-strength-t3685534"], "threads": []}, {"title": "Overall speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/pixel-2-xl/review/overall-speed-t3685535"], "threads": [{"text": "Blazing fast phone. Scrolling is buttery smooth, with none of the lag from the bad old Samsung Touchwiz days. I am coming from Nexus 6P, which was no slouch, but this one is super fast.", "time": "21st October 2017, 12:46 PM", "postID": "post74241188", "replies": []}, {"text": "We have two Pixel 2's and also my Pixel 2 XL -- these are spectacularly fast and smooth -- lag free.", "time": "28th November 2017, 01:57 AM", "postID": "post74661398", "replies": []}, {"text": "Faster than a speeding bullet 🔫 or greased lightening ⚡", "time": "28th November 2017, 04:09 AM", "postID": "post74662186", "replies": []}, {"text": "Super fast! Love it!", "time": "30th November 2017, 07:00 PM", "postID": "post74693094", "replies": []}, {"text": "Fastest android phone to date i love it,  come from the Nexus 6P and One plus 3T which i still own but the pixel xl 2 is just superior.", "time": "3rd February 2018, 03:25 PM", "postID": "post75433592", "replies": []}, {"text": "Super smooth and fast.. esp with animations set to .5s in developer options!!", "time": "12th March 2018, 04:54 PM", "postID": "post75864107", "replies": []}]}, {"title": "App launch speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/pixel-2-xl/review/app-launch-speed-t3685536"], "threads": []}, {"title": "Multitasking/RAM", "rating": 4.0, "links": ["https://forum.xda-developers.com/pixel-2-xl/review/multitasking-ram-t3685537", "https://forum.xda-developers.com/pixel-2-xl/review/multitasking-ram-t3685537/page2", "https://forum.xda-developers.com/pixel-2-xl/review/multitasking-ram-t3685537/page3", "https://forum.xda-developers.com/pixel-2-xl/review/multitasking-ram-t3685537/page4"], "threads": [{"text": "Gave a 1 star. Apps are reloading way too much imo. Not sure if its due to oreo changes, but dang, i'm rotating between feedly, discord, irccloud, youtube, sync for reddit and it does feel like there is a 50-50 chance of an app refresh. Giving me samsung vibes, which isn't a good thing! \n\nAlso coming from a 8gb ram oneplus 5 (that cost half of my 128gb 2 xl) doesn't help. Quite disappointed", "time": "24th October 2017, 05:21 PM", "postID": "post74279657", "replies": [{"text": "you ...person...need to be running a tablet/desktop for all of this. i run near the same quantity of intensive stuff, and have had no issues.\n\nor run an N9 and feel the despair of @#$@#$poor mem management. (my wife abused (meaning she abuses it) N72013 holds up better than the n9)", "time": "28th October 2017, 07:41 AM", "postID": "post74322026", "replies": []}, {"text": "I've had the same issue. I've had an axon 7 with 4 gb of RAM and it didn't redraw this much.. I love the phone, but there's times the keyboard redraws in the middle of a Swype, or YouTube redraws in the middle of a video. \n\nI'm going to try a reset once the November patch hits", "time": "3rd November 2017, 10:52 PM", "postID": "post74397877", "replies": []}]}, {"text": "Working fine multitasking for me. Feedly, Tapatalk, Hangouts and usual social media. Any reloads are fast and only if it's been maybe 10 or more apps ago since I last launched.", "time": "28th October 2017, 11:09 PM", "postID": "post74330481", "replies": []}, {"text": "I'm in the same boat. All of the stock apps reload way too often. Even with light usage. \n\nAndroid needs to change the way it keeps apps in memory. I can pick up  my work iPhone after a few days and every app is still right where I  left it. It's sad that Android, with much more memory, can't handle that  simple task.", "time": "6th November 2017, 07:20 PM", "postID": "post74428115", "replies": [{"text": "How many apps do you really need to keep in RAM? Mine handles 9-12 just fine. And with your work iPhone, how many apps have been open prior to that app that's been days since last open?", "time": "7th November 2017, 04:12 AM", "postID": "post74431937", "replies": []}, {"text": "I wouldn't consider this an Android problem at all. My OnePlus devices have the exact same attribute as that iPhone does with memory management (just on overload) can have 30 apps open and resume most of them days later. \n\nMy pixel 2, if I put this thing in my pocket with 6 apps open, they redraw when I pull it out of my pocket. \n\nIt would be barrable on a 200$ device. But this thing cost 5x that..", "time": "8th November 2017, 09:24 AM", "postID": "post74445317", "replies": [{"text": "I totally agree with you. My mate 9 Porsche Design is the same. Angry birds and and temple run 2 are still in memory since I played them yesterday", "time": "8th November 2017, 01:56 PM", "postID": "post74447550", "replies": []}, {"text": "I'll call it a Google and Samsung problem then. Because when the dialer, contacts, calculator, etc. have to reload just about every time, there is a problem.", "time": "10th November 2017, 06:02 PM", "postID": "post74471398", "replies": [{"text": "That's part of the reason why I'm rerunning mine.", "time": "10th November 2017, 06:19 PM", "postID": "post74471538", "replies": []}]}, {"text": "Funny thing is that the Pixel 2 XL and the latest iPhones have similar RAM management. \n\nhttps://youtu.be/8RsbzuorKms\nFeel free to skip to the app switching.\n\nAnd the Note 8 does multitasking very well.\n\nhttps://youtu.be/5ZLwWq9Lh3M", "time": "10th November 2017, 06:21 PM", "postID": "post74471556", "replies": [{"text": "The day Samsung does multi tasking better than Google has arrived 😂😂😂😂", "time": "10th November 2017, 06:30 PM", "postID": "post74471643", "replies": []}, {"text": "In my experience, it doesn't.  Maybe it's the 8.1 beta, but it's really bad at keeping small apps in memory.", "time": "20th November 2017, 06:10 PM", "postID": "post74579224", "replies": [{"text": "Same here. On 8.1 and it dumps chrome with 10 tabs if I even load Gmail or Amazon app.", "time": "21st November 2017, 12:29 AM", "postID": "post74582315", "replies": []}]}]}]}]}, {"text": "I agree with the people saying it  has to reload far too frequently. It really doesn't make sense as to why but it seems to have a problem.\n\r\nI am coming from a Note 4 which only had 3GB of RAM and Samsung's rather bloated stuff running on it. It swapped out apps way less often than my 2XL is doing it. So it seems to be doing worse with more memory than my Note had, but besides that I think this phone really needed to have 6GB RAM anyway. I mean the Oneplus 5 and 5T now have 8GB options and it smokes it in multitasking comparisons.", "time": "21st November 2017, 10:58 AM", "postID": "post74586128", "replies": []}, {"text": "Samsung taught everybody how to multitask (yeah, including Google & Apple).", "time": "22nd November 2017, 03:12 AM", "postID": "post74594708", "replies": []}, {"text": "I have iPhone and Google pixel 2 and I had note 8 and one plus and I can tell you 3gb or 4gb that's not enough to have good ram management.\n\nAndroid minimum 6gb of ram and iOS 4fb", "time": "13th December 2017, 12:02 AM", "postID": "post74827818", "replies": []}, {"text": "in lack of a pixel 2 yet, did anyone try the background process limit in dev options, or even the batery optimizations?\nif an app gets killed after screen off its likely to be battery optimized\ncorrect me if i'm wrong.", "time": "15th December 2017, 09:46 PM", "postID": "post74859826", "replies": []}, {"text": "Okay so this seems to have gotten worse now. I was playing a game on my phone and I fat fingered the multitask button twice rapidly so it switched apps on me. It opened Facebook messenger. I IMMEDIATELY hit the multitask button again to go back to my game - it had to reload it again...\n\nI was out of it for literally just seconds. Like I said before, my old Note 4 with a gig less ram than this phone was able to hold that game in memory for a long time. This is awful.", "time": "15th December 2017, 11:37 PM", "postID": "post74860555", "replies": []}, {"text": "But then the OS in that old phone probably didn't have much features or resolution to manage. Also, that same game probably didn't use as high resolution or graphics to run as well.", "time": "20th December 2017, 01:53 PM", "postID": "post74907994", "replies": [{"text": "The note 4 screen is 2560x1440, nearly the same resolution as the pixel 2 xl. It's only higher because of the aspect ratio difference.", "time": "23rd December 2017, 10:31 AM", "postID": "post74937428", "replies": [{"text": "Is the game reloading you described actually reproducible every time? Or was it just that one time?", "time": "23rd December 2017, 12:18 PM", "postID": "post74938131", "replies": [{"text": "It doesn't do the whole \"just 1 screen caused a reload\" every time, but it is reproducible because it has happened multiple times, it wasn't just a one-time thing, and it does reload my game very, very often when previously it usually didn't throughout the day.", "time": "23rd December 2017, 12:34 PM", "postID": "post74938242", "replies": [{"text": "Perviously with your Note 4? And \"throughout the day\" you mean you'll leave the game, go to a few app, then back and have it reloading? If your Note 4 was able to still load the game without it reloading after going through several apps, that's impressive. Don't think my wife's Note 4 was able to multitask like that.", "time": "23rd December 2017, 02:19 PM", "postID": "post74939124", "replies": []}]}]}]}]}, {"text": "It looks like it's pixel issue not Oreo. \nS8 with Oreo beta doesn't reload like pixel and it's crappy beta. \nhttps://youtu.be/nqZKsnzt8XQ", "time": "24th December 2017, 04:38 AM", "postID": "post74944516", "replies": [{"text": "Very interesting. I always thought it was a RAM issue because of 4GB (Cause the Note 8 and OnePlus 5 have more) but guess not.", "time": "24th December 2017, 04:50 AM", "postID": "post74944572", "replies": [{"text": "It's weird Google being the light system it's expected to be the best in multitasking  v.s. bloat-fest on samsung which is expected to reload ...but doesn't even on 7.0 that is s8+ stuck doesn't reload it's not as good as s8 Oreo but it's no where bad as pixel. \n\nMaybe pixel has good battery due this ...shuts off everything not letting it work in background lol.", "time": "24th December 2017, 05:14 AM", "postID": "post74944670", "replies": []}]}]}, {"text": "I do expect that Google resolve this problem because it's ****ing annoying, \n\nThere's so many reloads , everything goes very fast but when we do multitask he reloads everything. \n\nI do expect same changes there on next update.\nOtherwise I'll change to iOS.\n\n4gb that's not enough on 2018 .\nI have 6gb/8gb phones and definitely we can see the difference on multitasking.", "time": "7th January 2018, 02:00 AM", "postID": "post75106720", "replies": [{"text": "You know iOS isn't any better at the moment right? iPhone 8, 8 Plus, and X all have reloading issues compared to the 5T, Razer Phone, and Note 8. Just check the SuperSaf and PhoneBuff videos.", "time": "7th January 2018, 03:47 AM", "postID": "post75107280", "replies": [{"text": "You right, I have iPhone 8 plus and every phone that does a good job on multitasking now have 6gb or 8gb , that's clearly 4gb on Android or 3gb on iOS that's not enough.", "time": "7th January 2018, 11:25 AM", "postID": "post75110527", "replies": []}]}]}, {"text": "Memory management sucks IMO.  I could be in the middle of a game, say Candy Crush. I switch over to send a message in Hangouts for a few minutes, go back to the game and it refreshes and I lose my spot.....very annoying!", "time": "28th February 2018, 02:30 PM", "postID": "post75725469", "replies": []}, {"text": "All complaints are 100% right - never had a phone with so many app reloads !!! This is a shame - my previous U11 almost never had to reload - it is excusable  but now my battery sucks too and I am on the latest march 2018 update - what is wrong with that phone ? People say they can barely hear me unless I kiss the device's lower speaker. Come on! I was not expecting this from a phone in 2018 - sorry but having the best camera on the market does not cut it anymore especially since the Camera Mod has been ported to other cyclops devices.", "time": "11th March 2018, 05:59 PM", "postID": "post75852783", "replies": [{"text": "My Nexus 5X reloaded WAY more often than the Pixel 2 XL. Battery life has been pretty much the same since October and never had issues with the mic whether on phone call or video chats. Also, ports of the Google Camera don't give you 100% Pixel 2XL quality. It helps but definitely not the same. Really, your post is more appropriate in a rant thread since it covers more than RAM management complaining.", "time": "11th March 2018, 08:08 PM", "postID": "post75854232", "replies": []}]}]}, {"title": "Scrolling smoothness", "rating": 5.0, "links": ["https://forum.xda-developers.com/pixel-2-xl/review/scrolling-smoothness-t3685538"], "threads": []}, {"title": "Heat", "rating": 5.0, "links": ["https://forum.xda-developers.com/pixel-2-xl/review/heat-t3685539"], "threads": [{"text": "This is a big improvement I have seen over my Nexus 6P. The ole Snapdragon 810 would get pretty warm in my hands on heavy use. The new one feels cool at all times. This has also helped tremendously in the battery life department too.", "time": "21st October 2017, 12:51 PM", "postID": "post74241233", "replies": []}]}, {"title": "Low light", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel-2-xl/review/low-light-t3685540"], "threads": [{"text": "as I know the first pixel xl has aperture 2.0. the new one has the same or better ?", "time": "21st October 2017, 11:06 PM", "postID": "post74247091", "replies": [{"text": "The older pixel has a 2.0 aperture and the new Pixel 2 has a 1.8 aperture however in the pixel 2 the actual sensor got slightly smaller. It essentially lets in about the same amount of light as the older pixel but the new sensor is optically stabilized and has several other enhancements that make it somewhat better.", "time": "9th January 2018, 10:18 PM", "postID": "post75141729", "replies": []}]}, {"text": "I am noticing a brown tint to pictures taken in low light... Anyone else?", "time": "22nd October 2017, 12:30 PM", "postID": "post74252093", "replies": []}, {"text": "Some quick shot from a walk in the park:", "time": "8th January 2018, 07:38 PM", "postID": "post75127890", "replies": []}, {"text": "Just two shots I made the other morning: https://photos.app.goo.gl/OjgKdsv94COyGOuj2\nI have to say, for a smartphone, these low-light pictures are more than you can ask for.", "time": "19th January 2018, 11:55 AM", "postID": "post75256043", "replies": []}]}, {"title": "Photo quality", "rating": 5.0, "links": ["https://forum.xda-developers.com/pixel-2-xl/review/photo-quality-t3685541", "https://forum.xda-developers.com/pixel-2-xl/review/photo-quality-t3685541/page2", "https://forum.xda-developers.com/pixel-2-xl/review/photo-quality-t3685541/page3", "https://forum.xda-developers.com/pixel-2-xl/review/photo-quality-t3685541/page9"], "threads": [{"text": "Not taken by the \"average consumer\" but I have to admit, these picks are AMAZING!!!  Cant wait to have my 2XL in hand to test it out! https://9to5google.com/2017/10/07/go...mples-gallery/\n\nUpdated link with Full Res Pics\n\nhttps://photos.google.com/share/AF1Q...UwVlg2LUZESDhn", "time": "8th October 2017, 08:26 PM", "postID": "post74084930", "replies": []}, {"text": "Sure, they're nice photos, but if you download them and view them on a PC with a proper monitor you might be disappointed.  They're not sharp or detailed, at least not compared to N6P pictures.", "time": "8th October 2017, 08:45 PM", "postID": "post74085136", "replies": [{"text": "Well of course there will be some twist to the camera. Once we here get them then, that can be discussed but, right now it seems a little early. I also really like pictures from the Nexus 6P the camera on that phone was amazing and can even outperform touted smartphone camera at times.", "time": "8th October 2017, 11:50 PM", "postID": "post74086861", "replies": []}, {"text": "Dunno what you're talking about, my PC is hooked up to my calibrated 50 inch Pioneer Kuro Elite and they look sharp and detailed. They're not from a full frame mirror less or DSLR.", "time": "25th October 2017, 01:01 AM", "postID": "post74284064", "replies": []}]}, {"text": "Are they showing being uploaded a full res?\n\nUpdate:\n\nNot sure which ones you were referring to, but these are the full res pics\n\nhttps://photos.google.com/share/AF1Q...UwVlg2LUZESDhn", "time": "8th October 2017, 08:48 PM", "postID": "post74085163", "replies": []}, {"text": "Yeh, they are not full res and when you reduce image size they will sharpen some, sometimes too much. As a photographer and Photoshop user don't trust or judge anything other than what you capture and display yourself.\nMake sure your monitor is calibrated also.", "time": "9th October 2017, 01:56 AM", "postID": "post74087569", "replies": []}, {"text": "https://www.youtube.com/watch?v=BufkTMy-ZNM\r\nP2XL wins hands down, so excited to receive my pre order!", "time": "22nd October 2017, 04:49 PM", "postID": "post74254658", "replies": []}, {"text": "Look at this photo", "time": "24th October 2017, 09:24 PM", "postID": "post74282420", "replies": [{"text": "Pretty awesome!", "time": "24th October 2017, 09:31 PM", "postID": "post74282496", "replies": []}]}, {"text": "Its great better thab my iphone 8+. Portrait mode is amazing. I jusy wished it didnt have screen and audio issue when record video.", "time": "27th October 2017, 04:00 PM", "postID": "post74315000", "replies": []}, {"text": "Hi guys i need answer from real users of xl2,can not find it on videos,do u have waiting,processing time when shoting in hdr+ on mode? I am using ported g cam app from this phone on U11,and do have that,in that mode can not shot more photos at once,now as i am considering getting this device,i am wondering is it the same?  Thanks..", "time": "1st November 2017, 10:05 AM", "postID": "post74366989", "replies": [{"text": "It's very short. I kept the default HDH+ on option and after taking a pic it's done processing in maybe a second. Haven't done multiple back to back shots though. It's really good at one and done.", "time": "1st November 2017, 01:14 PM", "postID": "post74368366", "replies": [{"text": "Thanks,than it is good,i mean great,was wondering about it...", "time": "1st November 2017, 01:16 PM", "postID": "post74368390", "replies": [{"text": "Yeah coming from a Nexus 5X this is light speed fast.", "time": "1st November 2017, 01:21 PM", "postID": "post74368446", "replies": []}]}]}]}, {"text": "", "time": "2nd November 2017, 01:00 AM", "postID": "post74375117", "replies": []}, {"text": "Jeeze, the XDA app downgrades the quality of the pics uploaded.", "time": "2nd November 2017, 01:20 AM", "postID": "post74375260", "replies": [{"text": "Yeah not worth posting pics unfortunately. Unless you host it somewhere else.", "time": "2nd November 2017, 02:19 AM", "postID": "post74375601", "replies": []}]}, {"text": "Anyone notice strange fluctuations in light when using Slo-Motion at 240fps? I mean it looks like the light is actually rolling ... I can't figure it out!! This is my 2nd XL 2 because of an RMA exchange and I don't remember trying it out on the first phone I had.. I'll try to get a video uploaded to show it..", "time": "2nd November 2017, 02:34 AM", "postID": "post74375683", "replies": [{"text": "That's normal if ur shooting under fluorescent lighting.", "time": "2nd November 2017, 04:17 PM", "postID": "post74382274", "replies": []}]}, {"text": "My first low light pictures in Los Angeles. Had a couple of beers but came out solid for no effort.", "time": "4th November 2017, 07:02 AM", "postID": "post74400505", "replies": [{"text": "WOW!! Love that cloud pic!!", "time": "7th November 2017, 02:26 AM", "postID": "post74431329", "replies": []}]}, {"text": "Some lowlight, HDR, portrait, and standard (non-hdr or portrait) samples. Quite impressed with the quality", "time": "6th November 2017, 12:00 AM", "postID": "post74419398", "replies": []}, {"text": "Not perfect, but pretty d@mn good!  And it should only get better with software updates over time...", "time": "6th November 2017, 12:51 AM", "postID": "post74419647", "replies": []}, {"text": "Kind of disappointed coming from a 6p.. it's fast and all, sure. I'd rather take detail and better low light. This has smearing in details and trouble focusing. Also issues with highlights on both front and rear cameras.", "time": "13th November 2017, 03:45 AM", "postID": "post74496207", "replies": []}, {"text": "Anyone know how to make the phone take a selfie by saying Take a selfie", "time": "15th November 2017, 12:19 AM", "postID": "post74517553", "replies": [{"text": "For whatever reason, it appears to work on the 2nd time asking. First time it just opens the camera. So perhaps it needs it open recently?", "time": "15th November 2017, 02:05 AM", "postID": "post74518175", "replies": []}]}, {"text": "Our famous Durango, CO. train. Taken with the Pixel 2 XL!", "time": "15th November 2017, 08:14 AM", "postID": "post74520446", "replies": []}, {"text": "https://imgur.com/a/R0aE1\n\nWas out walking last night and snapped a couple shots handheld. First picture is unedited straight out of Gcamera, second picture has been edited to my usual style.\n\nSuper impressed by the quality of the jpeg file, I definitely appreciate Google's willingness to sacrifice noise for detail.\n\nI usually shoot in RAW but I don't have it enabled on the Pixel 2 xl yet.\n\nInstagram for more like this", "time": "24th November 2017, 10:51 AM", "postID": "post74619494", "replies": []}, {"text": "", "time": "25th November 2017, 08:31 AM", "postID": "post74628931", "replies": []}, {"text": "portrait mode is just awesome", "time": "25th November 2017, 03:56 PM", "postID": "post74632784", "replies": []}, {"text": "Love this camera", "time": "10th March 2018, 07:42 PM", "postID": "post75842469", "replies": [{"text": "Never seen a rainbow tree before. They seem to bloom earlier! 😁", "time": "10th March 2018, 09:41 PM", "postID": "post75843448", "replies": []}]}]}, {"title": "Video quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/pixel-2-xl/review/video-quality-t3685542", "https://forum.xda-developers.com/pixel-2-xl/review/video-quality-t3685542/page2", "https://forum.xda-developers.com/pixel-2-xl/review/video-quality-t3685542/page3", "https://forum.xda-developers.com/pixel-2-xl/review/video-quality-t3685542/page7"], "threads": [{"text": "Am I the only one worried with video quality of the Pixel 2?\nFrom what I'm seeing on YouTube the last couple of days, stabilization is GREAT but the actual quality is sadly just not good. Especially when panning, it's not as smooth as say the iPhones or Galaxy devices. Tons of artifacts and jitters.\n\nAny chance these aspects can be improved later with software updates? :\\", "time": "18th October 2017, 01:45 PM", "postID": "post74204392", "replies": []}, {"text": "Have any of you read about the Secret Pixel Visual Core Processor that Google said it installed in both the Pixel 2 & XL 2 that they have not activated yet which incorporates HDR+ and machine learning algorithms that can be updated through future updates. It is supposed to be activated with the 8.1 Android update. Apparently it's a stand alone chip from the 835 Snapdragon that has it's own cores & ram dedicated to the camera. It's supposed to be 5 times faster than Qualcomm chip while only using 1/10 of the power. So basically it's supposed to take the camera to the next level while being even more energy efficient.... 🤔  Sounds great to me, can't wait to see this in action!!!!", "time": "18th October 2017, 03:52 PM", "postID": "post74205941", "replies": [{"text": "Yep it will be impressive. \r\nAlso we are able to take hdr+ pictures in 3rd party apps with the activated Pixel Visual Core SoC  \r\nIm really looking forward to get my device and the 8.1 Update haha", "time": "18th October 2017, 04:32 PM", "postID": "post74206447", "replies": []}]}, {"text": "I am particularly interested in low-light videos of both devices and the audio quality. From a few samples i could check on YouTube i suspect problems with the noise suppression at least on the XL. Trying to assemble examples in this thread: https://www.reddit.com/r/GooglePixel...ght_and_audio/\n\nSoo.. get your samples out to the world!", "time": "21st October 2017, 07:36 AM", "postID": "post74238845", "replies": [{"text": "I am extremely happy with the video quality now. I recently made a video. Watch at 4k. Personally I think its pretty amazing for youtube. Hard to tell the difference between this and several thousand dollar 4k cameras.  Audio on the other hand is ABSOLUTE garbage and I cant connect my external mic. \n\nhttps://www.youtube.com/watch?v=SNk1Blop2Sk\n\nHere is a twilight shot\nhttps://www.youtube.com/watch?v=ODRupXk8I5I\n\n---------- Post added at 06:17 PM ---------- Previous post was at 05:56 PM ----------\n\n\n\r\nhere is my sample.. https://www.youtube.com/watch?v=YodS07Naa40\nhttps://www.youtube.com/watch?v=ODRupXk8I5I", "time": "24th October 2017, 06:17 PM", "postID": "post74280101", "replies": [{"text": "Yeh the video is great but your audio is not good. It sounds like too much noise cancelling.", "time": "24th October 2017, 07:40 PM", "postID": "post74281254", "replies": []}, {"text": "The quality is great as long as you're not panning the camera. Once the camera is in motion, it looks very choppy, something's doesn't look as smooth as others such as the V30, iPhone 8 or the Note 8.\n\r\nAlso, in good lighting the quality is great but once the lighting gets even a little bit tricky, the footage gets super noisy :\\", "time": "25th October 2017, 09:02 AM", "postID": "post74287114", "replies": [{"text": "There is a strange and constant grain in all the shots. Its not as noticeable in bright daylight but its still there in the shadows and edges of the sensor. I honestly don't think its related to low light. I've done test in PITCH BLACK and it performs very very well for it being so dark. Its almost like a film grain but its not as strong in the center. It seems to be a problem with all pixels because I have tested 3 and they all do the same thing. It DOES GET BETTER over time though. its so strange. The first few days I had the phone I was very very dissapointed at the grain or noise however after having it for over a week it is going away. I know this is not how cameras work but it seems like the sensor is maybe \"warming up\" or something? I dont know how to explain it. The very first video I took was in bright daylight and the noise was unbearable. Now I can take videos at any time of the day and in my opinion has the best camera for video out there right now. Im not sure what you mean by choppy video. It could be the stabilization. I dont think its as smooth as EIS alone but the combined EIS and OIS together make for a much more clear shot especially in low light.", "time": "25th October 2017, 03:32 PM", "postID": "post74290612", "replies": []}]}]}]}, {"text": "Another bad thing i am noticing is they audio quality when record video.  Its noise cancelling makes audio quality horrible...", "time": "22nd October 2017, 05:39 PM", "postID": "post74255262", "replies": [{"text": "I noticed this too. Wasn't sure if it was my unit or in general, as I've not read any complaints. I posted (https://forum.xda-developers.com/pix...dings-t3693360) a vid I shot w/2XL and a vid from wife's iPhone. \n\r\nI tested another unit in Verizon and same distortion was there. A replacement is coming, but I'm not optimistic.", "time": "24th October 2017, 01:28 PM", "postID": "post74277035", "replies": []}]}, {"text": "recorded video audio quality       To me at least the Pixels sound much better than the iphone", "time": "22nd October 2017, 05:58 PM", "postID": "post74255489", "replies": []}, {"text": "I got around to testing the 2 XL vs the original XL, and for the most part the 2 XL exceeded the original in every way. But the Dual IS, optical and electronic, really messed up when mounted to my car. The original one was buttery smooth.", "time": "22nd October 2017, 06:32 PM", "postID": "post74255831", "replies": [{"text": "I thought the video recording quality wasn't as good as my original Pixel XL when I went into the Verizon store yesterday 10/21/17 but I noticed that when you have the 1080p video option on, when the camera app is launched, before pressing record you have to change the fps from 30 to 60 in the on-screen settings to the left of the video screen. When I did that it basically mirrored my original Pixel XL except the picture quality of the XL 2 is of course naturally better. I'm sure with the update it'll exceed all other competition.\n\r\nMy only question is can the note 8 camera be ported into the XL 2? Because I loved the zoom while viewing a recorded video feature, which neither the XL not XL 2 pixels have.", "time": "22nd October 2017, 08:52 PM", "postID": "post74257360", "replies": [{"text": "I'm sure there is some way to port it over. I'd be surprised if the app hasn't already been extracted.", "time": "22nd October 2017, 09:03 PM", "postID": "post74257465", "replies": []}]}]}, {"text": "Honestly, video means so much to me and so far, what I'm seeing on YouTube looks pretty bad. The stabilization looks promising, but the actual quality is poor. Very noisy, bad frame rate drops and jitters. Still photos might be class leading but video looks worse than my Oneplus 5 at the moment.\n\nI hope they'll be able to improve it significantly", "time": "22nd October 2017, 09:55 PM", "postID": "post74257918", "replies": []}, {"text": "I mean.. just look at it. It's a shame that the Pixel 2 is doing so well in still images but video has been completely neglected. Okay, good stabilization and all, yes. But why have good stab with such quality? what for?\nhttps://www.youtube.com/watch?v=8gbqXSzVDMM", "time": "23rd October 2017, 10:05 AM", "postID": "post74262602", "replies": []}, {"text": "The fact that pixel2 has no the audio issue worries me it can be 2 xl microphone issue. Both should run same sw.", "time": "24th October 2017, 10:50 PM", "postID": "post74283195", "replies": []}, {"text": "Good news is I FINALLY got my Rode microphone working. I have no idea what I did but it works now. I tested it out and the Audio is much better with that tiny rode video micro. Im happy now.", "time": "25th October 2017, 02:37 AM", "postID": "post74284624", "replies": []}, {"text": "My initial thought was the video quality was choppy too, especially when panning.. when I switched it to 60 fps my problems went away. The quality looks similar to my original Pixel. Very smooth, but obviously a little better quality \n\n\n*edit* oh wow.. I just lol'ed at my sig. Looks like I haven't been on XDA in a while", "time": "25th October 2017, 04:38 PM", "postID": "post74291368", "replies": []}, {"text": "the first pixel was great with photo experience but video capturing quality was not so great. what about pixel 2 ? the same situation? can someone share the raw video sample (without editing or compressing) ?", "time": "25th October 2017, 06:06 PM", "postID": "post74292404", "replies": []}, {"text": "Yeah, seems like the chop in panning is present especially when filming in 4K 30 fps, but not only. Hope this could be improved with a software update..", "time": "25th October 2017, 07:26 PM", "postID": "post74293295", "replies": []}, {"text": "Video quality is good but audio quality is really bad with crappy noise cancellation. I am returning this due to that also vibrator feels cheap as well and infamous screen issue. I really wanted to love this phone paying $1k.", "time": "25th October 2017, 08:40 PM", "postID": "post74294069", "replies": [{"text": "Agreed.. the audio quality is horrible for videos.. and the field is view is shorter. When switching from photo to video you can see it appears to be \"zoomed in.\" Seems rather annoying since it's obviously not a dual lens setup, so why the shorter view?\n\r\nI'm considering it sending it back too but I'm not sure what else to get... V30 maybe.", "time": "26th October 2017, 12:22 AM", "postID": "post74295906", "replies": [{"text": "That's the problem. The alternatives aren't as appealing to me as an overall package. Samsung? Great hardware, terrible software. No thanks. LG? V30 seems nice, but that's about it. \r\nThe only option I might consider is the new Oneplus 5T as the performance is right up there with the Pixels, same goes for battery life, screen will probably be better than the 2XL and camera is flagship level but not class leading like the Pixel 2.", "time": "26th October 2017, 03:25 PM", "postID": "post74302560", "replies": [{"text": "I was thinking the same. Get my Pixel 2 XL on November 15th and if it doenst fit my expectations than I will probably go with the upcoming OnePlus 5t.", "time": "26th October 2017, 05:12 PM", "postID": "post74303864", "replies": []}]}]}]}, {"text": "The fact that pixel 2 doesnt seem to be as bad as 2 xl is not a good sign though. 2 xl mic must not be same quality as 2 one. This is more deal breaker for me than screen.", "time": "26th October 2017, 05:48 AM", "postID": "post74297684", "replies": []}, {"text": "I read somewhere on a german forum that this annoying \"light flickering / pulsating\" with artificial LED lights has been resolved with the recent update.\nCan somebody confirm that? Currently I am not at a place where LED lights are being used and its midday here, so I have no chance to test it out right now.", "time": "12th February 2018, 01:05 PM", "postID": "post75538683", "replies": [{"text": "Well I tried it out. It's definitely better. Before I couldn't make a video in the same room with my lamp.\nNow it's totally okay unless you either get too close or tap on the screen to focus.\nSlow motion is still messed up though.", "time": "17th February 2018, 06:42 PM", "postID": "post75603969", "replies": []}]}]}, {"title": "Selfie quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel-2-xl/review/selfie-quality-t3685543", "https://forum.xda-developers.com/pixel-2-xl/review/selfie-quality-t3685543/page2"], "threads": [{"text": "I think it automatically does it. When I played with it at Verizon I took a selfie & it was in portrait style. Try that & see. Hope this helps", "time": "19th October 2017, 04:42 PM", "postID": "post74219779", "replies": []}, {"text": "I think an update came through, because I had a similar problem but now it's working. Try again after checking the Play Store for an update and/or rebooting?", "time": "19th October 2017, 05:22 PM", "postID": "post74220288", "replies": []}, {"text": "Yes, camera definitely needs to be updated in the Store for this.", "time": "19th October 2017, 07:10 PM", "postID": "post74221530", "replies": []}, {"text": "Yeah mine is working now too. Guess something updated overnight.", "time": "19th October 2017, 08:29 PM", "postID": "post74222455", "replies": []}, {"text": "What's a \"Selfie?\"", "time": "20th October 2017, 01:30 AM", "postID": "post74224778", "replies": []}, {"text": "Update helped. Thanks for the heads up, guys! God the cameras are ridiculously fantastic!", "time": "20th October 2017, 03:14 AM", "postID": "post74225378", "replies": []}, {"text": "Sometimes the selfie cam causes the screen to flash white and it's very laggy taking a picture.  What's up with this.  Is this supposed to be a flash or something?", "time": "11th November 2017, 12:29 AM", "postID": "post74474239", "replies": [{"text": "Yeah check the right most option if you have flash set to auto/on.", "time": "11th November 2017, 02:26 AM", "postID": "post74474826", "replies": []}]}]}, {"title": "Time to take picture (camera launch speed)", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel-2-xl/review/time-to-picture-camera-launch-speed-t3685544"], "threads": [{"text": "Delete", "time": "18th October 2017, 10:57 PM", "postID": "post74210848", "replies": []}]}, {"title": "Software (ease of use, features, etc)", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel-2-xl/review/software-ease-features-t3685545"], "threads": []}, {"title": "Charging speed", "rating": 3.5, "links": ["https://forum.xda-developers.com/pixel-2-xl/review/charging-speed-t3685546", "https://forum.xda-developers.com/pixel-2-xl/review/charging-speed-t3685546/page2", "https://forum.xda-developers.com/pixel-2-xl/review/charging-speed-t3685546/page3", "https://forum.xda-developers.com/pixel-2-xl/review/charging-speed-t3685546/page38"], "threads": [{"text": "Charging speed is fine and fast.", "time": "21st October 2017, 12:54 PM", "postID": "post74241252", "replies": []}, {"text": "I'm finding it slow despite the fact it displays fast charging while using official cable and charger. My Note 8 is so much faster.", "time": "21st October 2017, 05:03 PM", "postID": "post74243739", "replies": []}, {"text": "Mine 2 XL was really slow,It took 2h to charge from 30% to 100%. \n\n\nA Youtuber points out the same issue, he got 2h 30m to charge 2 XL from 0% to 100%.", "time": "22nd October 2017, 06:27 PM", "postID": "post74255782", "replies": []}, {"text": "According to what I have seen from YouTube reviewers, charging speed is ridiculous (not in a good way). How can I possibly leave my Oneplus 5 dash charge for this?? Sigh.", "time": "22nd October 2017, 10:05 PM", "postID": "post74257993", "replies": []}, {"text": "For me it charges quite quickly up to 95%, but the last 5% are a drag. And I'm using the cable and charger that came with the phone.\nMy OG XL charged much quicker!", "time": "23rd October 2017, 06:38 AM", "postID": "post74261084", "replies": []}, {"text": "Wow, the bad news is just piling on. I might have to cancel my pre-order.", "time": "23rd October 2017, 12:56 PM", "postID": "post74264127", "replies": []}, {"text": "please calm down a bit. Charging slow the last part after 80% or so is not bad but very good because it saves your battery. There is nothing to prevent this so if OP5 charges the last part faster the battery will wear out  faster.", "time": "23rd October 2017, 01:08 PM", "postID": "post74264258", "replies": [{"text": "Yes, they are supposed to throttle the charging after it hits a certain percentage (sounds like 80 in this case) but once it gets high enough the high amps can damage the battery, possibly overcharge it etc.  2.5 hours from 0%-100% doesn't sound terrible to me but maybe I'm not as picky as most....", "time": "23rd October 2017, 05:20 PM", "postID": "post74267153", "replies": []}]}, {"text": "Did anyone try charging the phone with a Quick Charge 3.0 compatible charger to see if there's any difference?", "time": "23rd October 2017, 06:13 PM", "postID": "post74267754", "replies": [{"text": "You mean to say that although the chip is compat with QC 3  there is no QC 3 charger included with the phone ?", "time": "26th October 2017, 08:42 PM", "postID": "post74306176", "replies": [{"text": "I mean, that too. Lol. \n\r\nBut what I was actually asking is whether someone had the chance to charge the Pixel 2 XL with a Quick Charge 3.0 compatible charger that is NOT the one included in the box? A different Quick Charge 3.0 charger and see if it charges quicker than the original one..", "time": "26th October 2017, 09:49 PM", "postID": "post74306861", "replies": []}]}]}, {"text": "Mine charges between 2500-2800 mAh before the threshold with the screen off, around 1000 mAh with the screen on.", "time": "24th October 2017, 04:39 AM", "postID": "post74272946", "replies": []}, {"text": "When charging at home, it takes 2hrs from 20%-100%.  I just started charging it at work, and it shot up from 20%-85% in 15 mins. Now it's charging slowly going to 100%.", "time": "24th October 2017, 02:38 PM", "postID": "post74277700", "replies": []}, {"text": "What kind of mA are y'all getting? Seems around 2000 at best which is pretty underwhelming. Half that with screen on...\nThis is with the out of box charger. \nI want the good camera but man does op5 do so many things better than this at half the price. 🤔", "time": "25th October 2017, 01:22 AM", "postID": "post74284205", "replies": [{"text": "I feel the same way. OP5T could potentially be better in most segments except for the camera which obviously is the best thing about the Pixel 2.\n\r\nAsking again, did someone try to charge the phone with a Quick Charge 3.0 compatible charger to see if there's any difference?", "time": "25th October 2017, 08:53 AM", "postID": "post74287036", "replies": [{"text": "Dont have my Pixel 2 xl yet but I'm also thinking about getting OP5t instead. \r\nBetter Display, better charging time, overclocked processor, less bezels all in all less issues .. :/ Not sure anymore.", "time": "25th October 2017, 01:22 PM", "postID": "post74289212", "replies": [{"text": "Yep. Not sure anymore is exactly where I'm at unfortunately.\r\nAt this point, I've decided to just wait until December-January to see if anything changes with the quality of the screens/issues with the Pixel 2XL, if it gets better - I'll definitely get it, if not? See what the reviews for the 5T say and get it instead if they'll be positive.\n\r\nI really, really wanted the new Pixels to be a smash hit and was ready to place my pre-order right away, but I'll let time to its thing for now since there's WAY TOO much negative surrounding the 2XL and for a good reason I guess.", "time": "25th October 2017, 02:02 PM", "postID": "post74289628", "replies": []}]}]}]}, {"text": "you are paying the premium for camera these days. op5 pretty much does everything else better imo even with jelly scrolling.", "time": "25th October 2017, 07:33 PM", "postID": "post74293361", "replies": []}, {"text": "Just plugged my phone in now. 74% and it says 52 minutes until charged. :-/", "time": "26th October 2017, 01:26 PM", "postID": "post74301221", "replies": [{"text": "That's straight up slow charging. Poor performance.", "time": "26th October 2017, 01:28 PM", "postID": "post74301252", "replies": []}]}, {"text": "I haven't had any issues with charging speed. It gets up to about 85-90% pretty fast. The Pixel 2 XL certainly does take noticeably longer for that last 10-15% compared to my Nexus 5X but since 10-15% on the Nexus 5X is 270-405mAh whereas the Pixel 2 XL is 352-528mAh for the last 10-15% I was expecting that.", "time": "26th October 2017, 11:57 PM", "postID": "post74307778", "replies": [{"text": "What's the highest mAh you have seen. I haven't seen over 1000 mAh", "time": "27th October 2017, 12:14 AM", "postID": "post74307916", "replies": [{"text": "I didn't think to look. I'll try to remember to take a look at GSam tonight while I'm charging.", "time": "27th October 2017, 01:42 AM", "postID": "post74308408", "replies": [{"text": "It's seems to be getting faster after a couple battery cycles for me. I will keep an eye out too", "time": "27th October 2017, 01:46 AM", "postID": "post74308444", "replies": []}]}]}]}, {"text": "Received mine Oct 19. Have noticed the charging seemed slow. Always hit 100% after leaving it overnight though. Put it on charger at 9PM last night and woke up at 3AM to find it went from ~40% to 64%. To be fair, it's hooked up using my Nexus 6P USB type C fast charger and reads as \"charging rapidly\"", "time": "27th October 2017, 11:12 AM", "postID": "post74312089", "replies": [{"text": "That's ridiculous. My Oneplus 5 would charge fully 3 times from 0 to 100 in this time frame. Sigh..", "time": "27th October 2017, 02:59 PM", "postID": "post74314285", "replies": []}]}, {"text": "Charging on this sucks. It's painfully slow. Maybe I'm just used to Dash Charging on my OnePlus 3T, but this is unacceptable.\n\nI let my phone get down to 13%. It took me well over 24 hours, and over 5.5 hours of screen on time to get there by the way, so that's good. Plugged my phone in using the included power brick and cable. Rapidly charging appears on the lockscreen. When I first plugged it in it said 4 hours until full - which seemed long but I thought perhaps it might need time to get going. Checked it 40 minutes later and I've gotten up to 21% and it's now saying 5 hours until full. So in 40 minutes I've gained 7%, but increased the time it'll take to fully charge by an hour. \n\nThis is stupid. I can't wait that long to charge. I need to be able to plug it in for a bit and gain a good 20-25% in a short time frame. The long lasting battery is nice, but if it means I have to stay plugged in for hours once it needs charging, what's the point? I think I might have to return this.", "time": "27th October 2017, 05:44 PM", "postID": "post74316160", "replies": []}, {"text": "Charging speed with the stock charger seems like it's at a crawl for me.  When I use an aftermarket 15W charger it's very fast.\n\nEdit: For instance.  This morning I was at 32%.  Plugged it into my stock charger and after ~45 minutes, I was now at 46%.  When I got to work I plugged it into my aftermarket 15W charger and I was at 82% in less than 30 minutes.", "time": "27th October 2017, 05:54 PM", "postID": "post74316276", "replies": []}, {"text": "Coming from a Nexus 6 to the 2XL, did my normal \"before work charge\" today.   Nexus 6 - very fast in that time.   2XL, well, not so much.   Both charging accessories from the box.", "time": "27th October 2017, 07:49 PM", "postID": "post74317492", "replies": []}, {"text": "But except for every other phone with fast charging.", "time": "27th October 2017, 09:18 PM", "postID": "post74318366", "replies": []}, {"text": "Got my replacement 2 days ago. Set-up today. Charges normal so far. Screen looks better too. Build date of February 8.", "time": "10th March 2018, 01:17 AM", "postID": "post75833821", "replies": []}, {"text": "Another great charging speed comparison by SuperSaf especially since he takes into account approximate mAh numbers. When you go by that, the Pixel 2 XL isn't really slower than the others as many make it seem to be. It's literally the last 5-10% left that makes it seem super slow.", "time": "10th March 2018, 04:16 PM", "postID": "post75840471", "replies": []}, {"text": "I'm having this 5 hour charge issue as well (even after the march update), but I started using an old moto z play stock charger and the phone now charges in like 1.5 hours.  Crazy.", "time": "12th March 2018, 07:11 PM", "postID": "post75865738", "replies": [{"text": "Impressive. Starting from near 0%?", "time": "13th March 2018, 12:51 AM", "postID": "post75868945", "replies": [{"text": "Yeah, pretty close... like 5+/-%.", "time": "15th March 2018, 09:21 PM", "postID": "post75902707", "replies": []}]}]}, {"text": "I have the RhinoShield Screen Protector installed. The one thing that I don't like about it is that is not Edge to Edge.", "time": "17th March 2018, 05:20 PM", "postID": "post75922556", "replies": [{"text": "Wrong thread?", "time": "Yesterday, 12:04 AM", "postID": "post75926117", "replies": []}]}]}, {"title": "Screen on time", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel-2-xl/review/screen-time-t3685547", "https://forum.xda-developers.com/pixel-2-xl/review/screen-time-t3685547/page2", "https://forum.xda-developers.com/pixel-2-xl/review/screen-time-t3685547/page3", "https://forum.xda-developers.com/pixel-2-xl/review/screen-time-t3685547/page34"], "threads": [{"text": "7 hours", "time": "21st October 2017, 11:08 PM", "postID": "post74247111", "replies": []}, {"text": "", "time": "22nd October 2017, 04:24 AM", "postID": "post74248794", "replies": []}, {"text": "7+ SOT! Pretty crazy...", "time": "22nd October 2017, 07:32 AM", "postID": "post74249808", "replies": []}, {"text": "Here is mine from yesterday... Not really a heavy user.", "time": "22nd October 2017, 12:28 PM", "postID": "post74252068", "replies": []}, {"text": "Just curious - are all of using battery saving location mode?", "time": "22nd October 2017, 02:46 PM", "postID": "post74253365", "replies": [{"text": "Im not", "time": "22nd October 2017, 06:07 PM", "postID": "post74255571", "replies": []}, {"text": "I'm not either. High accuracy mode was on the whole time", "time": "22nd October 2017, 09:33 PM", "postID": "post74257739", "replies": []}]}, {"text": "Full day 6am until 2 am with 4 hours of gaming in there.", "time": "22nd October 2017, 07:40 PM", "postID": "post74256626", "replies": []}, {"text": "Out (on LTE only, no Wifi) and about regular usage (web, news, maps/navigation) - 13%/hour ~7.6 hours SOT\nCamera (because the camera is THAT great) + Google photos editing and uploading - 17-25%/hour ~ 4-6 hours SOT\nAt home on Wifi regular usage- 6-7%/hour ~ 15 hours SOT", "time": "24th October 2017, 04:43 AM", "postID": "post74272970", "replies": []}, {"text": "So was doing some testing for battery life. Used it till it shut off just a few minutes ago. I had taken a screen shot at 1% about 5min before it powered down figuring it was close. I took the phone off the charger yesterday at about 6:30am. I am not sure why wifi shows as 0% but I have been on wifi most of the day. I really liked the old Android battery screens better that showed wifi and cellular signal strength data as well.", "time": "25th October 2017, 06:44 PM", "postID": "post74292831", "replies": []}, {"text": "From my experience the SOT is not even the problem. How is the standby battery consumption? The thing is I get 10 hours SOT on my Moto Z Play if I do a lot. BUT if I use the phone only lightly I'll still don't get more than 2 days battery life even though you would expect much more.", "time": "25th October 2017, 06:56 PM", "postID": "post74292963", "replies": [{"text": "Ambient features, how often your weather / email ect sync, how strong your cell signal is, how often your connected to WiFi instead of 3g/4g, and location services all affect stand by time.", "time": "25th October 2017, 08:35 PM", "postID": "post74294015", "replies": [{"text": "Yeah I know but the thing is: compared to standby times of my iPhone 7 Plus the Pixel XL 1 standby was a joke.\n\nI have installed basically the same apps on both devices. So I just hope that Android will finally catch up with Android 8, because up to now all Google initiatives to have better battery life were pretty bad.\n\nThat's why I would be interested to hear how this is going on the XL2.", "time": "25th October 2017, 08:49 PM", "postID": "post74294167", "replies": []}]}]}, {"text": "This is going for 9+ hours sot!", "time": "27th October 2017, 11:00 PM", "postID": "post74319126", "replies": [{"text": "Mind sharing your settings/apps? I'm at the same percentage as you but barely getting 2hours sot :/ I don't think I have any battery draining apps installed besides instagram and snapchat. Maybe its standby drain? I lost almost 10% overnight (6 hours) and I'm not sure if this is normal.", "time": "27th October 2017, 11:51 PM", "postID": "post74319475", "replies": [{"text": "You also have 10 hours more off the charger. I think that could easily result in the 1 hour difference in screen on time.", "time": "28th October 2017, 12:29 AM", "postID": "post74319689", "replies": [{"text": "True!! I have all the locations and everything on..nothing changed..4 emails sync8ng.. injustice simcity games..fb snapchat insta all installed..been on lte whole time..this phone is a beast..always used htc phones which are not bad..this is first time using google phone..however, eagerly waiti g for htc u11+ announcement..if its tempting i m8ght return pixel and go for htc", "time": "28th October 2017, 12:35 AM", "postID": "post74319732", "replies": []}]}]}]}, {"text": "Why can't I post pics? Says I don't have permission to post.", "time": "27th October 2017, 11:43 PM", "postID": "post74319412", "replies": []}, {"text": "Pretty solid screen on time binge watching stranger things season 2. Honestly I think I could get another hr or more still with 22% left.", "time": "29th October 2017, 02:43 PM", "postID": "post74336639", "replies": []}, {"text": "I'm on the 8.1 beta and I am not sure I've noticed this before. When I restart the phone, the screen on time since last charge in the battery settings resets. Is this normal? I don't remember that happening on previous versions...", "time": "29th October 2017, 03:33 PM", "postID": "post74337142", "replies": []}, {"text": "I think it has always reset when you restart, but I could be wrong.", "time": "29th October 2017, 03:53 PM", "postID": "post74337323", "replies": []}, {"text": "This is a pretty normal work day for me. Battery life this week has been great!", "time": "30th October 2017, 12:50 AM", "postID": "post74341840", "replies": [{"text": "Does Adaptive Brightness have any major impact on battery life?", "time": "30th October 2017, 03:06 PM", "postID": "post74347330", "replies": [{"text": "I don't use adaptive brightness. Only other things I use are my Android Wear watch and Bluetooth headset both connected to Bluetooth all day as well.", "time": "30th October 2017, 03:08 PM", "postID": "post74347356", "replies": []}]}]}, {"text": "No complaints here!", "time": "30th October 2017, 01:32 AM", "postID": "post74342046", "replies": [{"text": "This is crazy! OMG", "time": "30th October 2017, 10:44 AM", "postID": "post74345041", "replies": []}]}, {"text": "Final stats with first full cycle without rebooting. No AOD (don't like it) wifi 90% of the time, lots of XDA browsing, lots of phone calls and texts, some YouTube, and just farting around with settings. Nothing to complain about on my end", "time": "30th October 2017, 03:46 PM", "postID": "post74347735", "replies": []}, {"text": "Over the weekend I had 7 hours of SOT and still had 15% battery left....unheard of for me coming from a Nexus 6p.", "time": "30th October 2017, 04:13 PM", "postID": "post74348069", "replies": []}, {"text": "loving the battery life on this thing", "time": "30th October 2017, 05:07 PM", "postID": "post74348667", "replies": []}, {"text": "How do you guys use your phone? I use Facebook, Facebook Messenger, Snapchat, Instagram, Hangouts, Outlook, Gmail, Slide, take a lot of pictures, and surf the web, and I'm not getting even remotely near what's being reported in this thread.", "time": "30th October 2017, 07:09 PM", "postID": "post74349972", "replies": []}, {"text": "I get between 5-7h SOT.", "time": "17th March 2018, 05:17 PM", "postID": "post75922532", "replies": []}]}, {"title": "Standby drain", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel-2-xl/review/standby-drain-t3685548", "https://forum.xda-developers.com/pixel-2-xl/review/standby-drain-t3685548/page2", "https://forum.xda-developers.com/pixel-2-xl/review/standby-drain-t3685548/page3", "https://forum.xda-developers.com/pixel-2-xl/review/standby-drain-t3685548/page7"], "threads": [{"text": "This phone is incredible coming from the 6P, which chewed batteries up like candy. The original battery lost capacity over a year and a half and then started turning off at 20%. Replaced it with an OEM battery a couple of months ago, and I could feel it slowly degrading too. I was floored when I had the Pixel 2 XL on me the whole day and had over 80% life left after leaving work. Grated I was in meetings, and actually working, so this was not a heavy phone use day, but the 6P would have lost this much in the morning commute to work.", "time": "21st October 2017, 01:17 PM", "postID": "post74241462", "replies": []}, {"text": "Happy to hear the great battery life continues!!!! I currently still have my Pixel XL and should be receiving my XL 2 in about a week. I have enjoyed battery life on the original XL and after having it for over a year my battery functions the same as when purchased. On heavy usage days I can get my phone down to under 10% and still feel comfortable playing a game, checking emails, watching a YouTube video, etc.  I work 10 hour days and have high usage some days so I still carry my charger out of habit but very rarely ever end up using it.", "time": "21st October 2017, 06:29 PM", "postID": "post74244718", "replies": []}, {"text": "My Pixel XL 2 dropped 15% overnight in standby mode.", "time": "23rd October 2017, 01:28 PM", "postID": "post74264445", "replies": [{"text": "Try to disable background activities in those apps that haven't been updated to 8.0", "time": "24th October 2017, 03:28 AM", "postID": "post74272525", "replies": [{"text": "This helped me a lot. I woke up at 3am at 98% and at 2pm was at 90%. This whole time, I checked a few apps, took two pics, and sent a few messages. Otherwise, it's been on standby.", "time": "2nd November 2017, 08:38 PM", "postID": "post74385289", "replies": []}]}, {"text": "Mine is dropping that much if not more overnight also.  Only thing in the battery settings is \"Android OS\"", "time": "24th October 2017, 11:26 AM", "postID": "post74275908", "replies": []}]}, {"text": "Mine drops 2%/hour with really bad cell service, around 0.8%/hour on airplane mode (wifi connected)", "time": "24th October 2017, 04:37 AM", "postID": "post74272938", "replies": []}, {"text": "So I've had weird battery issues so far, this is day 6 with my 2 XL btw.  I think I've started to get a handle on what's going on.\nTo get a baseline starting point I reboot the phone at home, on WiFi.\r\nGreat battery life\nIf I turn WiFi off or move out of WiFI coverage.\r\nGreat battery life\nOnce I turn WiFi back on or move back into WiFi coverage battery life is BAD.\nFinally, rebooting while on WiFi returns to great battery life.\n\r\nHopefully this is something that will be fixed in subsequent updates.", "time": "24th October 2017, 05:53 PM", "postID": "post74280052", "replies": [{"text": "Just a quick update, I'm about half way into my 5th day in Europe and have only charged the phone twice.  Needless to say battery life has been stellar, the phone seems like it's dozing like it's supposed to.  \n\nNow I'm wondering if my issues are somehow related to having a \"non-Verizon\" phone on Verizon in the US.  I'll be back in the US in a few days so I'll see if my battery life goes bad again.", "time": "3rd November 2017, 01:43 PM", "postID": "post74392460", "replies": [{"text": "It's possible but I doubt it. I thought the only difference between the one sold by Verizon is that it comes with their SIM card. Hardware and software is all the same no?\n\n\n\n---------- Post added at 08:58 AM ---------- Previous post was at 08:57 AM ----------\n\n\n\r\nDid another 7 hours standby test with AOD on and lose only 5% so about 0.71%/hour.", "time": "3rd November 2017, 01:58 PM", "postID": "post74392595", "replies": [{"text": "Yeah this is really a leap on my part. Heard from a friend that he knows someone with the same config as mine having similar issues as me. I'm quite sure the hardware is the same however there is a different Verizon system image, only difference may be the inclusion of the Verizon apps, I don't know.\n\r\nThis is just bizarre - it's like my phone prefers to be on the other side of the Atlantic ocean.", "time": "3rd November 2017, 02:54 PM", "postID": "post74393167", "replies": []}]}]}]}, {"text": "Not sure which thread to post this observation but I figured it would apply to standby. The \"Always On\" feature actually does turn off when in a pocket. I've noticed it goes into a lift to wake mode when pulling it out. Go to know it won't accidentally double tap and wake the screen while in a pocket.\n\nOh and in terms of overnight standby time, I'm usually plugged in for sleep tracking but I get 1%/hour which I'm assuming is from the always on display. Will try turning it off one night.", "time": "1st November 2017, 01:42 PM", "postID": "post74368620", "replies": []}, {"text": "So last night night my phone went from 39% to 38% over 7 hours with Always On Display off and wake screen for new notifications off.", "time": "2nd November 2017, 12:26 PM", "postID": "post74379699", "replies": []}, {"text": "Like many here, I too am not \"dozing\" properly. Steps I have taken:\n\nFactory reset phone, but reinstalled all of my normal apps (I never had this issue with my OG Pixel. It ALWAYS dozed properly with the same app setup, 1-3% drain over 7 hours)\nCompletely new phone (not for this issue, screen issues), still not dozing properly\nInstalled GSAM and gave it ADB to unlock more battery stats like many suggest and like usual, it tells me nothing.\nFlipped the phone upside down which turns off always on display. This made the standby drain go from about 12% over 7 hrs to about 6%, which still is not where it should be.\n\nhttps://imgur.com/LHKRtg0\nhttps://imgur.com/rFG8H3U\n\nEDIT: I have NOT turned off always on display, only tried flipping it over to deactivate it for the night.", "time": "2nd November 2017, 12:40 PM", "postID": "post74379832", "replies": [{"text": "Which wallpaper do you have? I have Huawei Mate 9 Pro, so not the same phone as you have. It usually have a great battery life, but after I installed those Pixel 2 live wallpapers my battery life became pretty bad, even while not using it.", "time": "2nd November 2017, 02:53 PM", "postID": "post74381243", "replies": [{"text": "An all black Boba Fett wallpaper from google", "time": "2nd November 2017, 03:02 PM", "postID": "post74381357", "replies": []}, {"text": "Don't think the wallpapers makes a difference. I've been using the Living Universe ones since I got it.", "time": "2nd November 2017, 03:39 PM", "postID": "post74381799", "replies": [{"text": "Went back and read your messages. So with AOD on, you were about 7% battery lost at night and with AOD off, about 1 or 2% battery lost?", "time": "2nd November 2017, 05:29 PM", "postID": "post74383286", "replies": [{"text": "That's correct. The AOD on was tested only twice and AOD off was only tested last night. It really was only 1% last night. I have the  screenshots. I'm usually plugged in for sleep tracking.", "time": "2nd November 2017, 05:34 PM", "postID": "post74383358", "replies": [{"text": "I have been trying to get the word out there that AOD effects Doze in Android but it isnt gaining any traction. I just got down voted on the Pixel subreddit and it lost all traction. Your post is right in line with what I am finding as well.\n\nIt would be nice if there was an option to turn it off during a certain set of hours.", "time": "2nd November 2017, 05:38 PM", "postID": "post74383392", "replies": [{"text": "Of course there's going to be some drain but that's pretty minimal. 1% or less per hour seems reasonable to me. I'm not complaining about it at all.", "time": "2nd November 2017, 05:57 PM", "postID": "post74383588", "replies": []}]}]}]}]}]}]}, {"text": "yesterday, woke up, sat busy at desk, phone at 100% for the new day, 10 idle phone hours later, pick up my phone @99%.\n im seeing people state \"install usual apps\". are these apps in the class of snotty tech companies thinking you want their app running at all times?. im talking about facebook and its contact leeching wakelocks, twitter, linked-in, and a myriad of other apps that can be accessed via the browser on demand. most of the time in the past, i found it was these \"im the king of your phone\" arrogant apps that would kill all idle battery life. this is why i run root, to be able to shut off apps that want this type of control that have no business with wakelock access, because they think i care about a high school friend i dont really talk to, wants me to know about photos they posted of their kid, and i must be notified NOW (even with notifications turned off). if you are having battery life issues, remove apps like this. PERIOD. you cant blame a phone for your use choices. \nthe removal of these types of apps on my N6, lets me get to the end of the day with moderate usage with 35~50% (3yrOld) battery.  the p2lx with about the same usage... 65~75%. go though your list of apps, see what uses the most battery, and decide if its really worth having your resources used up by an app you haven't even used since a reboot.", "time": "4th November 2017, 07:20 PM", "postID": "post74406398", "replies": [{"text": "I don't even think it's necessary to uninstall all those apps with this phone. I have all the typical social media apps (Facebook, Twitter, Google+, Instagram) and got 1% lose over 8 hours idle.", "time": "4th November 2017, 07:39 PM", "postID": "post74406561", "replies": [{"text": "sounds like they got less arrogant with devices finally, only after they uploaded my personal contacts to each of their servers then suggested that A-hole boss to me as a friend, did i realize it was done. \r\n'Fool me once, shame on...shame on you. Fool me — you can't get fooled again.'", "time": "4th November 2017, 08:21 PM", "postID": "post74406953", "replies": []}]}]}, {"text": "Coming from OnePlus 5 the standby on this device is out of this world. I left it alone 18 hours with WiFi on, lost 2%. If I leave my OnePlus 5 on 2 hours it will drain 2%. P2XL. Is fantastic in that regard", "time": "8th November 2017, 09:29 AM", "postID": "post74445356", "replies": []}, {"text": "I went to bed last night with 100% on the phone, disconnected the charger, and when I woke up 6 hrs later, it still read 100%.....it's the first Android phone I've ever owned that did that.", "time": "8th November 2017, 09:02 PM", "postID": "post74451974", "replies": [{"text": "Tried restarting and still showed 100%? When I restarted it went to 96%", "time": "8th November 2017, 09:14 PM", "postID": "post74452070", "replies": [{"text": "I didn't restart mine, I just grabbed it and left to work.  Used it on my commute to work and by the time I got to my office, about an hours commute, it was at 91%.  That's while I was streaming iHeartRadio and browsing FB and IG.  Amazing battery life and idle drain on this phone.", "time": "8th November 2017, 09:17 PM", "postID": "post74452094", "replies": [{"text": "I second this. I am casually getting 30-35 hours with 4-5 SOT. I have an hour or so commute on train twice a day. Bluetooth headphones with lots of Spotify streaming, texting, Snapchat, IG, Twitter.\n\nThe battery life and idle drain are fantastic and I have everything turned on. I'd imagine I could closer to 48 hours with a bit more SOT if I was more anal about my settings and their effect on battery. Sure is nice being able to fire everything up and not have to worry about battery life at all.", "time": "9th November 2017, 04:26 AM", "postID": "post74454693", "replies": []}]}]}]}]}, {"title": "Heavy use endurance", "rating": 5.0, "links": ["https://forum.xda-developers.com/pixel-2-xl/review/heavy-endurance-t3685549", "https://forum.xda-developers.com/pixel-2-xl/review/heavy-endurance-t3685549/page2", "https://forum.xda-developers.com/pixel-2-xl/review/heavy-endurance-t3685549/page3"], "threads": [{"text": "Battery saver.  I only really need it so the weather app works properly.\n\n\n\n---------- Post added at 07:20 PM ---------- Previous post was at 07:15 PM ----------\n\nBut this was using no other battery saving techniques.  With things like greenify with aggressive doze, lowering resolution to 1080p ect I'm sure I could extend this even more if I really wanted.  Not only that but the game I was playing is a 3d MMORPG with graphics set to med/ high.", "time": "20th October 2017, 08:20 PM", "postID": "post74234568", "replies": []}, {"text": "So far I've only had one real heavy usage day.\n\r\nI was on a mix of LTE and wifi, browsed with Chrome, Facebook, texting, 30 minutes of calls, 30 minutes YouTube, 1 hour streaming Google Play Music to Bluetooth headphones, 15 minutes playing Asphalt 8, brightness at 20%, Now Playing on, Google account syncing, Location on high accuracy and battery saving off. At the end of the day I was literally trying to kill the battery but it was getting late and I was tired.\n\r\nUnder the same conditions my Nexus 5X, even when it was brand new, only got like 3 hours screen on time with the same off the charger time.\n\r\nFirst phone I've ever had that I can actually say has great battery life. It more than makes up for the blue tint that I only even see if I'm looking for it.", "time": "3rd November 2017, 02:29 AM", "postID": "post74387929", "replies": []}, {"text": "Been at a conference last few days in a row. Historically I bring a charger with me because usually I'm just sitting there on my phone. \n\nDon't have my actual battery performance but started with 100% out of my car. Purposefully left a charger in the car. \n\nUsed tons of XDA, Facebook, browser text email etc and had 40-60% remaining after about 7 hours onsight each day. \n\nGreat battery for working professionals or any heavy user", "time": "10th November 2017, 11:59 PM", "postID": "post74474086", "replies": []}, {"text": "Much better lasting than i expected. 3500mah compared to the 3000 mah of Nexus 6, and it lasts 2 days easily on light to moderate use.\n\nEDIT: i meant nexus 6", "time": "17th December 2017, 04:21 AM", "postID": "post74871783", "replies": [{"text": "The Nexus 5 didn't have a 3000mAh battery. It had a 2300mA battery.", "time": "18th December 2017, 08:24 AM", "postID": "post74883209", "replies": [{"text": "Oops, i meant Nexus 6, my bad!", "time": "18th December 2017, 09:26 AM", "postID": "post74883579", "replies": [{"text": "The Nexus 6 was 3220.", "time": "18th December 2017, 05:55 PM", "postID": "post74888417", "replies": []}]}, {"text": "Yeah even better! Even with a 3220 battery, it barely lasted for almost a day. Granted it was after 3 years of using the phone, so at the time i bought it, it would have lasted maybe 1.5 days. But when i went 3 days without charging the pixel 2xl, that was something else.", "time": "18th December 2017, 06:01 PM", "postID": "post74888477", "replies": []}]}]}, {"text": "I'm downright impressed with the battery on this phone. I was at the hospital for 3 days with no charger, and it lasted the whole time. Granted, I pretty much don't use any app other than firefox, but at the same time, I never turned on the TV (I honestly don't care for watching TV) and my phone was all I had to entertain myself, so the screen was on a lot.", "time": "18th December 2017, 05:20 PM", "postID": "post74888055", "replies": []}, {"text": "Upgraded from a Nexus 6 as well.  With he same apps installed, and with everything else as similar as possible (i.e. batter saver disabled, location high-accuracy, same google accounts added, etc.), and with hte N6 rooted and running Pixel Launcher and wallpaper app, *and* with the N6 being a 2nd replacement (having replaced my original purchase due to batterygate in Jan 2015, and then having lost the second device in Jan 2016 and relacing it with the last completely new in a box N6 that I found only) and thus around 1.75 years of actual use (versus a true 3 years), I can say that my N6 will die easily in ~4 hours of intensive video game playing (games like PotC: Tides of War and Lineag 2: Evolution) but the Pixel 2 XL has let me play 7+ hours continuously and still had well over 30%.\n\nBeing the holidays, I don't have that much time to dedicate to playing games in one sitting, but I can fire up Lineage 2 and auto hunt for a long time, with the phone sitting off to the side, if anyone requires actual visual proof.\n\nAlso, relate to this, even if I am playing either game and connect to my charger, the phone barely gets warm, whereas my N6 would get almost unbearably hot if I charged and played at the same time.", "time": "18th December 2017, 06:44 PM", "postID": "post74888861", "replies": []}, {"text": "If you aren't fortunate to live on wifi and have bad service, my battery life is dropping. I'm down to 10 hours with 2 hours of SOT. First day was much better. I am using a third party charger. Does that drop battery life?", "time": "20th December 2017, 02:34 AM", "postID": "post74903169", "replies": [{"text": "That's pretty terrible. Never got lower than maybe 4.5 hours SOT and that was out and about at Disney World for 16 hours. Mostly the bad service that's killing your battery because it's searching for stronger signal. Doubtful 3rd party charger would be doing this. Screenshots?", "time": "20th December 2017, 02:49 AM", "postID": "post74903243", "replies": []}, {"text": "Yeah, something is wrong. A few weeks about I had a long day out using mobile data only with signal average to bad browsing, Facebook, texting, 30 minutes of calls, 45 minutes of Google Maps navigation with the screen always on and playing music over Bluetooth to my car for like 2 hours and even like 15 minutes of Asphalt 8 and I ended the day with like 6 hours SOT and 20 hours off the charger and still had like 10% left. That's the absolute WORST I've ever seen. On wifi all the time with good cell signal just browsing and Facebook I've gotten 9 hours SOT over like 40 hours at best. Average with a mix of usage is about 7 hours SOT with about 32 hours off the charger. Individual results will obviously vary but if you are getting a lot less than what I get, which is pretty typical from all the user experience I've read, something is wrong.", "time": "22nd December 2017, 09:35 PM", "postID": "post74933187", "replies": [{"text": "I would like to see screen shot of your usage. Doesn't seem possible", "time": "9th February 2018, 02:11 PM", "postID": "post75502660", "replies": [{"text": "Would've been easier too than typing that all out. LOL", "time": "9th February 2018, 07:49 PM", "postID": "post75506599", "replies": []}, {"text": "What doesn't sound possible? The heavy  usage or the best case?", "time": "10th February 2018, 01:02 AM", "postID": "post75508919", "replies": []}]}]}]}, {"text": "So far today", "time": "20th December 2017, 04:00 PM", "postID": "post74909331", "replies": [{"text": "Screenshots like that's aren't the most helpful. Scroll down and take a screenshot of the app usage too.", "time": "21st December 2017, 03:11 AM", "postID": "post74914092", "replies": []}]}, {"text": "Can anyone tell me what is the screen time you get on a pixel 2 Xl iam getting 4.00 hours with 80% battery used and 20% battery left with full recharge 15:20 hour's ago\nWith talk time of roughly 1:45 minutes used.\nHow i'm /my phone is  doing.\nRead somewhere people are getting 8+hour's of screen time with 10% battery still left.", "time": "3rd February 2018, 07:51 PM", "postID": "post75436167", "replies": [{"text": "You mean this thread on screen on times?\nhttps://forum.xda-developers.com/sho....php?t=3685547\n\nI've hit 8 hours but average 5.5 to 6.5 probably. It's all about what you're reading, watching, and if there's a lot of data usage.", "time": "4th February 2018, 04:55 AM", "postID": "post75439645", "replies": []}]}, {"text": "Mine definitely went the full mile for me to today! Just plugged it in", "time": "11th February 2018, 03:21 AM", "postID": "post75521257", "replies": []}, {"text": "With Bluetooth Audio streaming (4,5 Hours; Downloaded Spotify Playlist) the battery seems to break down quite faster... But still solid and no heating", "time": "16th February 2018, 04:05 PM", "postID": "post75590905", "replies": []}]}, {"title": "Light use endurance", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel-2-xl/review/light-endurance-t3685550"], "threads": [{"text": "Out and about (LTE/cell service only) - 13%/hour\nAt home on Wifi - 6-7%/hour", "time": "24th October 2017, 04:44 AM", "postID": "post74272980", "replies": []}, {"text": "21h with 4h screen on, 40% left", "time": "24th October 2017, 04:30 PM", "postID": "post74279089", "replies": []}, {"text": "With what I would consider light usage (email, web browsing, messaging, lots of YouTube) I have really been impressed with the battery life! Over 8hrs screen on time with my first few cycles so far. Based on this, I'm guessing that even with heavier usage (games, etc.) that I would still be pretty happy with the longevity. With very similar usage I was getting around 4-5hrs SOT on my original Pixel XL and was happy with it. Interested to hear how the battery has been for others as well.", "time": "24th October 2017, 04:42 PM", "postID": "post74279204", "replies": []}, {"text": "I've been very happy. Last night I forgot to charge so I woke up with 48% battery. I plugged in for 25 minutes while getting ready for work. Left the house with 87%. Now, 9 hours later, I have had 2 hours screen on time of mixed wifi/LTE, browsing, email, Facebook, texting, a few pictures and a little YouTube. 20% brightness. Location set to high accuracy, Now Playing turned on, AOD off, Google account sync on. I am at 65%. That's a drain of 22%. Under the same conditions and usage my Nexus 5X would have drained over 40%.\n\n\n\nThis is the first smartphone I've had (I've had a Nexus One, Galaxy SII, Nexus 5, Nexus 5X and now Pixel 2 XL) that I can say that the battery life is GREAT.", "time": "3rd November 2017, 02:20 AM", "postID": "post74387865", "replies": []}, {"text": "", "time": "3rd November 2017, 04:59 AM", "postID": "post74388791", "replies": []}, {"text": "This phone is ridiculous. I haven't charged it since Monday...\n\n\n\nI won't pretend I'm a \"heavy usage\" person with my phone. But I've never been able to get 2 full days of usage from any of my previous phones. Most of them barely lasted 24 hours. This one is going to reach 48+ hours, easy. \n\nI work from home full time so I'm connected to my home wifi almost all the time, which helps. I get out of the house a total of 2-3 hours a day to walk the dog, go to the gym, or meet clients for lunch. So during that time it's on full LTE with no wifi. I tend to use the phone for 2-3 client calls per day (30-60 minutes each while paired with my bluetooth headphones), listening to music at the gym (~60 minutes while paired with my bluetooth headphones), some light usage of social networking apps and Youtube videos throughout the day. \n\nI know battery life consists of a large amount of factors but it's safe to say that with the same usage, this phone outlasts all my previous phones by at least 1.5x. It's fantastic.", "time": "29th November 2017, 10:30 PM", "postID": "post74683907", "replies": []}]}, {"title": "\"Look\" of the device (aesthetics)", "rating": 4.0, "links": ["https://forum.xda-developers.com/pixel-2-xl/review/look-device-aesthetics-t3685551", "https://forum.xda-developers.com/pixel-2-xl/review/look-device-aesthetics-t3685551/page2", "https://forum.xda-developers.com/pixel-2-xl/review/look-device-aesthetics-t3685551/page3"], "threads": [{"text": "I like it. Idk why LG went with the curved glass, but it feels good. The useable screen actually stops where the curve begins. So the curve is just a black bezel. Maybe they're amping up for some sort of Sammy edge in the future? I hope not.\n\n\n\n---------- Post added at 07:20 AM ---------- Previous post was at 07:19 AM ----------\n\nI'd say 7.5 of 10 on the all black", "time": "12th October 2017, 12:20 PM", "postID": "post74129489", "replies": []}, {"text": "I visited Verizon store today and my first impression was pretty good! They only had the black version but it looked nice, better than the original pixel XL. However, there were two things I've noticed. First, the top and bottom bezels aren't symmetrical. Top bezel is definitely larger and it was pretty apparent when using the device. That's personal preference but I didn't like it. Second, are the scratches on the screen. I haven't heard many people mention it but the screen is actually slightly curved like on the Samsung devices but the glass also slopes down on the top and bottom. It's only been on display for a day first but it was already noticably scratched on the bottom bezel, on the \"arch\".", "time": "12th October 2017, 10:27 PM", "postID": "post74135568", "replies": []}, {"text": "I went back to the store to take few pictures to illustrate what I'm talking about + curved screen", "time": "12th October 2017, 10:34 PM", "postID": "post74135621", "replies": [{"text": "Someone had to of dropped that while putting on display. Those look like scratches from some sort of impact and is why I always use a case! ha", "time": "13th October 2017, 02:12 PM", "postID": "post74141929", "replies": [{"text": "Or it could have been an exchange put on display", "time": "22nd October 2017, 04:40 PM", "postID": "post74254566", "replies": [{"text": "An exchange on a phone that hadnt been released yet when I said this?", "time": "22nd October 2017, 04:44 PM", "postID": "post74254591", "replies": []}]}]}]}, {"text": "Dang it folks, test the speaker volume and post!", "time": "13th October 2017, 02:55 PM", "postID": "post74142395", "replies": [{"text": "I played a video on youtube on max volume for few seconds but did not want to be obnoxious in the store hah. Anyways, speakers sounded very loud and clear, much much better than my Note8 (no surprise).\n\n---------- Post added at 06:30 PM ---------- Previous post was at 06:26 PM ----------\n\nAnother thing I forgot to mention is that display is much less vibrant than Note 8. Colors are washed out, especially reds. I will try to take few more pictures later today", "time": "13th October 2017, 07:30 PM", "postID": "post74145291", "replies": []}]}, {"text": "I liked what I saw today, although I think I'd have preferred a single front facing speaker with a shorter device, but I know people are obsessed with front facing stereo speakers for some reason", "time": "13th October 2017, 08:04 PM", "postID": "post74145665", "replies": []}, {"text": "I just want a device with reserve volume not one that I max out for a particular purpose and its not loud enough.\nI did the 5X tweak to make both speakers play back and a volume boost flash that worked very well.\nI want my Waze to at least get my attention while cruising to a good part of a song .", "time": "14th October 2017, 06:03 AM", "postID": "post74149702", "replies": []}, {"text": "I like the app drawer is transparent instead of the bright white that the OG Pixel has. Wish the rest of the system followed suit (settings, contacts, msgs and such). Or at least had options.\n\n\n Sorry. I was speaking of software, you guys are discussing hardware.", "time": "17th October 2017, 02:24 AM", "postID": "post74185853", "replies": []}, {"text": "The screen colors looks like this for a more realistic presentation of color, this can be remedied with color mode like Ex kernel color option to add more saturation.", "time": "17th October 2017, 04:32 AM", "postID": "post74186588", "replies": []}, {"text": "This phone is definitely not a looker. But gonna cover it up anyway and hopefully the bezels wont bother me.", "time": "17th October 2017, 01:45 PM", "postID": "post74191190", "replies": []}, {"text": "I'm not sure really why it matters to a point. It's just going to be in a case anyway.", "time": "17th October 2017, 08:17 PM", "postID": "post74196033", "replies": [{"text": "Well that's true for the back....But the front of the phone still has an aesthetic. There is no doubt there is some unique bezel stuff going on with this phone.", "time": "18th October 2017, 08:45 PM", "postID": "post74209572", "replies": []}]}, {"text": "dang it people (would use harsher language but dont want to deal with a ban or fragile persons) STOP going to verizon and judging their crappy demo locked display version as what the phone is going to be like. as for scratches, well DUH, if you ever worked retail, you would already know humans treat stuff thats not theirs like total $#!t! id bet if i drop my phone on my floor it wont get the same dings and scratches these \"CUSS\"tomers put devices through. dont you dare ask me to drop my phone, im the good \"egg daddy\" with my devices. id drop my wife before my phone (thats why she doesn't do trust falls while im holding electronics.)", "time": "28th October 2017, 07:54 AM", "postID": "post74322121", "replies": []}, {"text": "This may be a good opportunity for Google to make a bold move by recalling as necessary all the units for the Pixel 2 XL and rebuild those displays quickly with full screen all around with no black nudges whatsoever surrounding the speakers or anything else like front camera and sensors on these screens as possible, therefore blending in the full display entirely, and achieving likely the thinnest bezels, to kick Apple iPhone X's behind big time!", "time": "28th October 2017, 07:45 PM", "postID": "post74328923", "replies": [{"text": "Sure, that's a reasonably ridiculous request...", "time": "29th October 2017, 03:15 AM", "postID": "post74331812", "replies": []}]}, {"text": "No! That understandingly what is called a wild bold move, indeed. Google won't go bankrupt after that. To the contrary upon the outcome, their shares will culminate more than ever before. Thus with that 'WBM' potential success, they may just become dramatically the number one seed to beat in the smartphone market, after all.", "time": "29th October 2017, 08:17 AM", "postID": "post74333528", "replies": []}, {"text": "I'm loving everything about the phone, with a single exception.  The camera bump.  It's not enough to turn me away from the device, but if the back would lay completely flat, the phone would be an 11 out of 10.  Still love the design tho, and the speed, and the display (no, that's not a typo).", "time": "3rd November 2017, 07:13 PM", "postID": "post74395911", "replies": [{"text": "Put a case on it...", "time": "3rd November 2017, 08:19 PM", "postID": "post74396579", "replies": [{"text": "I know people like rocking a phone \"naked\" or just a skin on it but I agree, case would fix the bump and protect this $850+ investment. I did.", "time": "3rd November 2017, 10:31 PM", "postID": "post74397710", "replies": []}]}]}, {"text": "I think the front is pretty ugly. I don't like the rounded corners at all.", "time": "8th November 2017, 02:12 PM", "postID": "post74447732", "replies": []}, {"text": "I think the \"rounded corners\" are a gimmick. All they've done is created a \"mask\" with the bezels. On a few apps, the right-most or left-most buttons are cut off where the rounded corners are telling me that it's just a mask and that they didn't actually change the way the screen behaved. If they had, there would be a margin around the screen that the graphics would obey and it would be rounded at the corners.", "time": "8th November 2017, 02:41 PM", "postID": "post74448081", "replies": []}, {"text": "The rounded corners neither add or remove any functionality to me. It does feel nice in the hand than sharp corners though when not using a case.", "time": "8th November 2017, 06:03 PM", "postID": "post74450296", "replies": []}, {"text": "I'm not a fan of glass back plates, so my only issue with the design here is the glass upper third of the back. Otherwise, this phone has awesome looks!", "time": "19th January 2018, 12:08 PM", "postID": "post75256185", "replies": [{"text": "I actually like that back glass. It gives the phone a distinct look. Plus, since most of the back is metal there needs to be a place for the antennas. It could be much worse. It could be like the iPhone 8/8+/X or the Galaxy S8/S8+/Note 8 and have a full glass back.", "time": "19th January 2018, 10:44 PM", "postID": "post75262998", "replies": []}]}]}, {"title": "Quality feel (use of materials)", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel-2-xl/review/quality-feel-materials-t3685552", "https://forum.xda-developers.com/pixel-2-xl/review/quality-feel-materials-t3685552/page2"], "threads": [{"text": "9 of 10\nIt does have a nice premium feel to it.\n\n\n\n---------- Post added at 07:27 AM ---------- Previous post was at 07:21 AM ----------\n\nCome find out yourself, though.\nhttp://www.makersofandroid.com/veriz...2-xl-starting/", "time": "12th October 2017, 12:27 PM", "postID": "post74129506", "replies": []}, {"text": "So I got a chance to visit a Verizon store to test the Pixel 2.\n\nMy overall experiences with the phone for the quick moment is really, really good! The feel of it in your hand was a nice and comfortable for both Pixel 2 and Pixel 2 XL. I really love the black color scheme because the bottom part of the back of the phone has a very nice fabric material. It provided a better grip to the phone compared to my LG V20. They didn't have the Panda color to demo so I can't speak on that model.\n\nAfter I left the store, I felt more confident about my purchases.\n\nFunny story, I placed my pre order on the 4th and the estimated delivery date was October 26th-27th, but after placing another order to include insurance, the delivery date changed to October 23rd-24th.\n\nP.S. I'm from SoCal.", "time": "12th October 2017, 08:39 PM", "postID": "post74134662", "replies": [{"text": "I originally had shipping date of 10/30-31, after reading your post I reordered and now it's 10/25-26, I also went to Verizon and as I walked in they were about to setup the pixel 2 xl, so they let me play with it before they mounted it, I was super impressed! It felt very premium and was alot lighter than I expected, maybe because I'm currently using note 8 which is very heavy. I was worried I wouldn't like the coating on the metal (black version) but it felt nice and grippy in a sense but not cheap like a case. The squeeze function worked perfectly, stereo speakers sounded great and no distortion at loud levels, screen looked great, but I didn't wanna test the grey background banding thing as it wouldn't really matter unless it was the phone I would leave it. The camera was super quick, shutter speed is instant, looked good as far as I could tell, I originally ordered to resell but after seeing in person I am a huge fan. 😁😁😁😁", "time": "12th October 2017, 10:10 PM", "postID": "post74135443", "replies": [{"text": "My exact experiences! In person, this phone is a beast.", "time": "12th October 2017, 11:05 PM", "postID": "post74135839", "replies": []}]}]}, {"text": "Yeh it feels good in hand with a good grip. Buttons are tactile but dont like volume buttons are in ine unit where feels double pressing when you press the middle of it", "time": "13th October 2017, 06:16 PM", "postID": "post74144525", "replies": []}, {"text": "Played with it at Verizon for a bit. It was so much lighter then I expected. Felt good I'm hand even though it had an alarm on it. A guy came in and asked to see a pixel 2 (not xl). And said it was too big for him.... Lol", "time": "15th October 2017, 02:32 AM", "postID": "post74160643", "replies": []}, {"text": "Are the speaker grills made of/covered by fabric, like the Pixel XL, or are they metal or plastic? I'm hoping for the latter.", "time": "17th October 2017, 04:55 AM", "postID": "post74186728", "replies": [{"text": "Got mine yesterday, they aren't fabric. I assume it's metal but could be plastic. Probably metal.", "time": "20th October 2017, 07:06 AM", "postID": "post74226739", "replies": []}]}, {"text": "How are the power buttons? Someone on Google+ said the colored power buttons on the blue phone and the panda felt like plastic and not metal like on the black phones. Anyone know if they are plastic instead of metal?", "time": "18th October 2017, 09:28 AM", "postID": "post74201905", "replies": []}, {"text": "I saw on a destroy the phone video that they are metal. The smaller Pixel 2 didn't fair to well with damage.", "time": "20th October 2017, 02:57 PM", "postID": "post74230910", "replies": []}, {"text": "I've had this phone slightly more than two days. Already shows screen burn-in of the nav bar. VERY disappointing.\n\r\nI have installed the Android 8.1 developer preview, which dims the nav bar after 3 seconds, hopefully this helps.", "time": "29th October 2017, 03:35 PM", "postID": "post74337154", "replies": []}, {"text": "Zero burn it,\nvery slight blue tint at aggressive angles, \nNov update fixed \"washed out\", natural color issue\n\n4 of 5 * since once in a while, the screen doesn't read a definite touch input. I'm not talking about \"maybe I did, maybe I didn't actually touch the screen\"... I'm talking about, I most certainly tapped the screen.\n\nThen, every once in a while, my finger will be hovering over an icon waiting for my brain to make a decision and the screen will register a touch.  Like if I get my finger close to tapping the FaceBook icon, then my brain thinks maybe I don't want to deal with FB right now, and without touching (or touching it so lightly my finger didn't realize it touched the screen) FB opens..\n\nThese things happen so infrequently it is not a deal breaker by any stretch.", "time": "20th November 2017, 03:26 PM", "postID": "post74577451", "replies": []}]}, {"title": "Ergonomics (in-hand feel)", "rating": 4.0, "links": ["https://forum.xda-developers.com/pixel-2-xl/review/ergonomics-hand-feel-t3685553", "https://forum.xda-developers.com/pixel-2-xl/review/ergonomics-hand-feel-t3685553/page2"], "threads": [{"text": "feel like my hams are going to hulk smash these uber thin phones now. its getting so thin, it leaves me feeling like i dont have a grip on it. bit slippery, another week for a case to arrive.", "time": "28th October 2017, 08:02 AM", "postID": "post74322173", "replies": []}, {"text": "idk how to truly feel. Honestly...it is the cheapest flagship feeling phone overall. I have it next to an S8+ and the S8+ just feels so much nicer... as for the ergonomics of the phone...with a normal duty case, it feels like the Nexus 6 I replaced it with. slightly large and I have an average sized hand. Over all, I give it a 2.5/5, but since I cannot give it that, it is a 2/5 for me. Truly...the feel is very just 'bleh' to me.", "time": "28th October 2017, 10:20 AM", "postID": "post74323258", "replies": []}, {"text": "I love the feeling of this phone. I like how hefty it is, doesn't feel like an S8 or V30 that will break on first drop. \n\nThe texture feels awesome, I thought a case was installed already when I pulled out of the box.. 😁", "time": "29th October 2017, 05:13 PM", "postID": "post74338098", "replies": []}, {"text": "I moved from Shamu, I prefer this phone being slightly narrower.  I don't care for the hollow sound when tapping the screen though.  \nLike slamming a car door, it sounds cheap.", "time": "30th October 2017, 01:39 AM", "postID": "post74342076", "replies": []}, {"text": "The phone feels nice overall but 1 thing, which is bothering me significantly.\nWhen I hold the phone in my hand I put my pinkie (little finger) at the bottom for better support so I don't drop it.\n\nThe issue is the charging port (usb c hole) is cut so sharply that it feels like a plastic knife scratching my skin, sure you think it's no biggie but after awhile it becomes very irritating.\nAm I alone on this? Has anyone else noticed?", "time": "5th November 2017, 06:44 PM", "postID": "post74417147", "replies": [{"text": "I keep my pinkies to the sides of the USB port whether one handed or two. I also have a TPU case so even if my finger was in the middle, I don't notice it.", "time": "6th November 2017, 01:01 AM", "postID": "post74419701", "replies": []}]}, {"text": "It's as comfortable as I would expect for a phone as big as it is. Having a really hard time getting used to having to use 2 hands to do almost anything. I was going to get the smaller one but I've already experienced what kind of battery life you get from a 2700mAh battery powering a 1080p screen and I didn't want to go though that again.", "time": "6th November 2017, 01:08 AM", "postID": "post74419726", "replies": []}, {"text": "Does anyone know if the texture of the back on the black version is different from the one on the black+white? It seems the black+white is more smooth and plastic feeling, while the black has a more rubbery/matte texture? Can anyone confirm this?", "time": "6th November 2017, 04:29 AM", "postID": "post74420791", "replies": [{"text": "Yes, I do remember this being mentioned on a youtube video. I cant recall the title though", "time": "6th November 2017, 08:49 PM", "postID": "post74429025", "replies": [{"text": "+1 I think MKDHD. The white is less grippy.", "time": "7th November 2017, 02:01 AM", "postID": "post74431172", "replies": []}, {"text": "I know MKBHD mentioned it but it's not a huge difference in feel.", "time": "7th November 2017, 03:03 AM", "postID": "post74431510", "replies": []}]}]}, {"text": "Downstairs feel as comfortable as it's cousin the V30", "time": "12th March 2018, 04:55 PM", "postID": "post75864125", "replies": []}]}, {"title": "OEM skin/software", "rating": 5.0, "links": ["https://forum.xda-developers.com/pixel-2-xl/review/oem-skin-software-t3685554"], "threads": []}, {"title": "Outdoor visibility (max brightness)", "rating": 3.5, "links": ["https://forum.xda-developers.com/pixel-2-xl/review/outdoor-visibility-max-brightness-t3685555"], "threads": [{"text": "Quite frankly poor overall. Second phone and the display is the best of many I have seen on other 2xls so im lucky", "time": "12th March 2018, 04:56 PM", "postID": "post75864139", "replies": [{"text": "Poor like on a sunny day you can't see what's in the view finder for the camera app? Cause I've never experienced that and I'm with Adaptive Brightness on 35%. It could be brighter but definitely not poor.", "time": "12th March 2018, 06:10 PM", "postID": "post75865031", "replies": []}]}]}, {"title": "Contrast (true blacks)", "rating": 4.0, "links": ["https://forum.xda-developers.com/pixel-2-xl/review/contrast-true-blacks-t3685556"], "threads": [{"text": "Amazing contrast.  Here's my home screen.  I love the ink blacks and icons standing out. \r\nWallpaper - Live Earth - Google wallpaper\r\nWidgets - Weather timeline, Minimalist text - battery\r\nIcons - Ergon", "time": "23rd October 2017, 07:31 PM", "postID": "post74268732", "replies": []}, {"text": "I'm kind of having the inverse experience. Rather than my phone showing a very dark gray in place of black, it is instead showing black where there should be very dark grays including other colors as well. I see people referring to this as \"black crush\".", "time": "24th October 2017, 12:24 AM", "postID": "post74271472", "replies": [{"text": "Mine is the same. Returning it. The 3 display color options solved nothing. Back too good old pixel XL", "time": "25th November 2017, 04:42 AM", "postID": "post74627551", "replies": []}, {"text": "My non xl pixel 2 is aweful. Not so much in pictures but video it's more noticeable. Videos sometimes are unwatchable because the crushing looks terrible at night or in dark rooms. Sometimes I can see it pulsing in the background and whatnot with small movements in the video.", "time": "21st December 2017, 07:28 AM", "postID": "post74915551", "replies": []}]}]}, {"title": "Color saturation & accuracy", "rating": 4.0, "links": ["https://forum.xda-developers.com/pixel-2-xl/review/color-saturation-accuracy-t3685557", "https://forum.xda-developers.com/pixel-2-xl/review/color-saturation-accuracy-t3685557/page2", "https://forum.xda-developers.com/pixel-2-xl/review/color-saturation-accuracy-t3685557/page3", "https://forum.xda-developers.com/pixel-2-xl/review/color-saturation-accuracy-t3685557/page7"], "threads": [{"text": "Checked out the xl2 at verizon. Colors seems having too much black. Still has greenish color shifting in some viewing angle", "time": "13th October 2017, 06:14 PM", "postID": "post74144502", "replies": []}, {"text": "Colors seemed washed out, much less vibrant than Note8. I will try to upload few comparison pictures later today", "time": "13th October 2017, 07:31 PM", "postID": "post74145336", "replies": [{"text": "Yes couldn't agree more, my pixel XL 2 is so washed out I'm tempted to switch back to my note 8!!", "time": "13th October 2017, 09:36 PM", "postID": "post74146565", "replies": [{"text": "Compared to a over saturated Samsung it probably does look washed out, in the picture posted, look at the hearts, the pixel looks red and you can see how oversaturated the Sammy is", "time": "14th October 2017, 01:00 AM", "postID": "post74148015", "replies": [{"text": "Well in contrast, look at the beach on both photos. When I looked at both side by side, Pixel definitely lacked saturation in my opinion. I guess it comes down to personal preference but I never understood why people wouldn't like Samsungs saturation. Makes everything look much nicer, and if one wants to mute colors, there are a bunch of profiles in the settings as well as adjustments for individual colors. When you lack saturated colors like on this Pixel to begin with, you can't just bring more color out that easily.", "time": "14th October 2017, 01:27 AM", "postID": "post74148160", "replies": [{"text": "People tend to get that way these days because of the way televisions are sold with the brightness and color saturation practically maxed out. This results in super unrealistic colors that tend to offset your idea of what \"good\" is while killing off subtle image details in the process. Samsung seems to like to do the same thing with phones, perhaps based on the same mindset that their TV guys use: Make things flashy.\n\r\nIn the showroom it may boost sales, but when I take my TV home, the first thing I do is tone all of that down to make sure the color balance is more realistic. For example, I want grass to look like grass would be colored, not neon-green. sRGB mode on Google's phones is nice because it does that for you, without needing any color filters and test patterns.", "time": "14th October 2017, 08:09 PM", "postID": "post74157895", "replies": [{"text": "YES. So. Many. Times. This. \n\r\nI shake my head when I see people show off their new TV's with sharpness at 100 and vivid color profiles with bright colors and cool temp selected. More power to do what u want with your stuff, but it just looks rediculous.", "time": "14th October 2017, 08:49 PM", "postID": "post74158281", "replies": []}, {"text": "They used to be heavily biased. Just Google iverge", "time": "17th October 2017, 04:28 PM", "postID": "post74193198", "replies": []}]}]}]}]}]}, {"text": "Here are some of the comparison photos", "time": "13th October 2017, 10:46 PM", "postID": "post74147176", "replies": []}, {"text": "The Verizon I went to had it setup with some preloaded messages, didn't actually get to see the OS and working screens. My comparison would be to the numbers the display is measured at, delta E, gamma, etc,... that is the only true measurement of color accuracy.", "time": "14th October 2017, 01:50 AM", "postID": "post74148284", "replies": []}, {"text": "A similar post on Reddit mentioned that the Pixel 2 XL is set to sRGB mode by default, and that there was a toggle to make it more vibrant somewhere in the display settings.  It would be interesting to see the same comparison with that toggle set to \"On\" with the Pixel (assuming that the info is good, and that the toggle exists at all).", "time": "14th October 2017, 02:00 AM", "postID": "post74148324", "replies": [{"text": "That's true, there was a switch \"Vibrant Colors\" under Display settings but it was turned on at the one I checked", "time": "14th October 2017, 02:29 AM", "postID": "post74148476", "replies": []}]}, {"text": "Google devices have been historically very accurate with the screen colors. Going from LG/Samsung will be noticable.", "time": "14th October 2017, 03:09 PM", "postID": "post74154419", "replies": []}, {"text": "As a photographer using calibrated displays and a Photoshop user, don't make up your mind on Webb posts. And I want a natural and sRGB.", "time": "15th October 2017, 06:51 AM", "postID": "post74162207", "replies": []}, {"text": "Love the super saturated colors. This is coming from a normal consumer without any \"expertise\" in anything related to the subject matter. My eyes like it.", "time": "15th October 2017, 10:48 AM", "postID": "post74164277", "replies": []}, {"text": "I despise the over-saturation Sammy does. This is good news to me.", "time": "15th October 2017, 03:26 PM", "postID": "post74167100", "replies": []}, {"text": "This is funny because although I was only able to see the the Pixel 2 screen (non XL) I'm positive both will have great displays. I do like Samsung displays however I hate when the over saturation shows the absolutely wrong color. But not too long ago the Samsung S8 & S8+ displays had a red & purple tint on the white screen. And that was actually a very prevalent issue which was fixed by a software update. After seeing the Pixel 2 display I thought it looked good.", "time": "16th October 2017, 01:57 AM", "postID": "post74173078", "replies": []}, {"text": "I have read that the display on the Pixel 2 XL has a bluish tint when viewed off angle and that the LG V30, which is said to have the same display as the Pixel 2 XL, has screen uniformity issues.\n\nI went to my local Verizon yesterday to play with the phone and see for myself. The bluish tint off angle is absolutely there. It didn't bother me but it might bother some. As far as screen uniformity I didn't see any issues. At least not with the display phone. I tested with light gray and dark gray backgrounds at high and low screen brightness and I used my hands to block out room lighting as best as I could.\n\nColor saturation looked good to me. A bit more saturated than my Nexus 5X I used as a side by side comparison.", "time": "16th October 2017, 07:01 AM", "postID": "post74174982", "replies": []}, {"text": "The verge panned the v30 display in their review today.  This isn't looking good", "time": "16th October 2017, 06:35 PM", "postID": "post74182041", "replies": []}, {"text": "I thought the tech community panned the verge years ago", "time": "16th October 2017, 07:08 PM", "postID": "post74182427", "replies": [{"text": "Ive never heard much bad about verge.  Giz, Engadget, tech crunch, but not the verge", "time": "16th October 2017, 07:10 PM", "postID": "post74182448", "replies": []}]}, {"text": "There's actually not that much wrong with the iVerge as long as you account for their Apple bias.", "time": "16th October 2017, 08:17 PM", "postID": "post74183167", "replies": [{"text": "The only site that I ever noticed a heavy bias on was tech crunch. That seigler guy was ****ing horrible.  Oh, and BGR, but that site is a complete joke", "time": "17th October 2017, 05:41 AM", "postID": "post74187026", "replies": []}]}, {"text": "Comparison shots from AP review  \nhttps://forum.xda-developers.com/sho...&postcount=127", "time": "17th October 2017, 03:06 PM", "postID": "post74192170", "replies": []}, {"text": "Does turning Vivid mode on make any difference? \nIs there any option under developer settings to turn sRGB off like the original pixels (had to be turned on in that)?", "time": "18th October 2017, 06:59 AM", "postID": "post74200669", "replies": []}, {"text": "I am yet to receive my Pixel 2XL, but I can share my experience with sRGB mode my Nexus 6P, and let you do the same test I did. As you know, the 6P ships with sRGB mode off, and hidden behind developer mode by default. When I first turned it on, I was extremely disappointed by the washed out looking colors, and was convinced that the default mode was more accurate. Then I took a screenshot and copied it and a wallpaper I had downloaded to my computer, which is hooked up to a decent LCD panel set in a relatively neutral basic mode.\n\nThen I pulled up the same images on my phone and computer, and held the screens side by side. To my amazement, the sRGB mode which I thought was dull and washed out, was actually very close to the way the images looked on my computer, but with sRGB mode off, the imaged were way oversaturated on the phone and inaccurate. I then pulled up some webpages on my son's iPhone and on the 6P, and the look was close with sRGB on.\n\nMy conclusion is that the sRGB mode is objectively better, but the default mode is subjectively perceived as better in isolation if you are only used to the way it looks and fools the eyes. I have gone back and forth with both modes on my phone over the past 2 years, and each time, the sRGB mode initially looks dull and washed out, but after a day or two my eyes do get used to the more accurate look, and it looks just fine after that. Going the other way however takes much less transition time, and the inaccurate but punchy mode starts to look good very quickly.\n\nI liken this phenomenon to eating some correctly and delicately seasoned food after getting used to eating overly spiced version of the same dish. Initially the overloaded taste buds perceive the delicately seasoned version as bland, but over time the taste buds adjust, and I begin to appreciate the subtle flavors that become more evident in the version as the recipe intended. Going back the other way takes less time in transition, because the punchy, spicy, flavors quickly are evident, although the version I am tasting now is not following the recipe as it should. Just like spiciness, there is a correct standard of color saturation, defined by the sRGB standard. Punchy, oversaturated modes may look good, but they are not showing the subtle gradients in the images, like they should.\n\nI am a bit concerned about blue color shifting being an issue, but if it is only apparent at tilts beyond normal viewing angles, and is due to having a polarizing layer that improves outdoor visibility, I can live with that. I have zero concern about the grain notes by Ars Technica at 0% brightness in a dark room, because every phone screen looks horrible in that setting, and I have never used my phone that way.", "time": "19th October 2017, 03:40 AM", "postID": "post74212610", "replies": []}, {"text": "All the news about \"washed out\" screen excites me so much! First thing I do with the Google phones is turning the sRGB option on. It was quite good on 6p. On the original Pixel xl i had to turn on sRGB and then play with kcal a little to brighten the whites. I like to get it as close as possible to my Dell monitor's colors. Can't look at those oversaturated screens for more than 2 minutes.", "time": "19th October 2017, 05:24 AM", "postID": "post74213272", "replies": []}, {"text": "For everyone who is complaining about the screen, read this:\n\n\"We designed the Pixel display to have a more natural and accurate rendition of colors this year but we know some people prefer more vivid colors so we've added an option to boost colors by 10% for a more saturated display. We're always looking at people's responses to Pixel and we will look at adding more color options through a software update if we see a lot of feedback.\"\n\nThis was a feedback from the google support to customers, who complained about the screen in the 2xl. \nThe main issue are washed out colors and this is imo a software issue, which can be fixed in the future  \nSo dont worry about the screen on this phone.", "time": "19th October 2017, 09:57 AM", "postID": "post74215454", "replies": [{"text": "I don't think that's the main issue. But yes that is the only issue that can be fixed via software.", "time": "19th October 2017, 10:38 AM", "postID": "post74215803", "replies": []}]}, {"text": "Another echo chamber, c'mon guys. It's so obvious the difference here is personal preference on color saturation. The facts are, if you want an extra wide color gamut not of reality and want to see photos that don't look anything like they do but on YOUR phoneand other samsung devices, then Samsung can definitely offer you that. But if you care about viewing what others are gonna see if you say view an image on a laptop or desktop for editing or shared on social media the pixel 2 XL is going to display more accurate colors.  \n\r\nI have an S8+, if you put your s8+ in cinema mode or basic and compare it to the pixel 2 XL your going to see just how similar the screens are at producing quality picture, it's really down to software tweaking and personal preference past that.", "time": "19th October 2017, 12:08 PM", "postID": "post74216595", "replies": []}, {"text": "I don't know if you know I just discovered that HDR videos works on YouTube and that's gorgeous", "time": "6th December 2017, 10:18 PM", "postID": "post74759992", "replies": []}, {"text": "just made the switch to a Pixel 2 XL from last year's Moto Z Force...\n\nI think what most people have to remember is there is a difference between what is accurate, or correct...and what you personally LIKE...its a very similar situation in the home theater world with TV calibration...a TV that is properly calibrated will often at first appear \"washed out\" or that whites look \"yellow.\" Our eyes are naturally drawn to colors that pop, or very deep blacks, but very often the images we think look \"good\" are over extremely oversaturated...with crushed blacks and blown out whites where you actually lose all sorts of detail in shadows or brightness...\n\nwithout seeing any kind of actual data, the default pixel 2 xl colors are probably MUCH closer to real world, accurate colors than Samsung's screens, or the screen on the Moto im coming from...that being said...I run my phone on \"saturated\" because i prefer the look and its something im used to...", "time": "7th December 2017, 02:18 PM", "postID": "post74766469", "replies": [{"text": "I've always hated what a so called \"calibrated\" picture looks like. Especially on TVs. It isn't even about my personal preference as much as it is about simulating what you would see in real life. Let's say you are watching something on TV that is footage of an actual place. The TV should show it as close as possible to what your eyes would see if you were actually at the location of filming. Very often a \"calibrated\" TV does not represent real life. You gave the example of \"yellow\" whites but that \"yellow\" white would only be \"accurate\" if viewing the object/location directly with your own eyes also produced the same yellowish white. In my experience that is not the case. A \"calibrated\" TV usually has a color temperature that is much warmer than would be seen by direct viewing of the same object.", "time": "15th December 2017, 10:50 PM", "postID": "post74860257", "replies": []}]}, {"text": "The saturated mode is over the top and boosted is just a tad to low. Why can't they just give us a slider.", "time": "10th December 2017, 04:57 PM", "postID": "post74800368", "replies": [{"text": "I've been wondering this as well. I didn't even notice a difference with the Boosted setting.", "time": "10th December 2017, 06:28 PM", "postID": "post74801338", "replies": [{"text": "Yeah something between boosted and saturated would've been nice.", "time": "11th December 2017, 12:10 AM", "postID": "post74804186", "replies": []}]}]}, {"text": "I personally like saturated but I can't send the red levels...it's too much and on certain pictures, you lose the details. Also white becomes reddish. \n\nI find myself switching often from Boosted and Saturated. I'm getting more and more used to Boosted mode and when i'm looking at pictures they almost 1:1 with real life. Though,  I wish the menu would run in Saturated mode and have more punchy colors, it would be perfect. It's only in the menu that I find it too washed out.\n\nI hope Google listens and fine tune it's screen properly or give us the ability to modify our colors setting with an advanced mode.", "time": "13th December 2017, 09:19 PM", "postID": "post74838167", "replies": []}, {"text": "Natural all the way for me. I am just glad Pixel 2 XL's AMOLED screen isn't too vibrant. Just wish they have something like Xperia's allowance to manually adjust the RGB channels.", "time": "20th December 2017, 01:47 PM", "postID": "post74907918", "replies": []}]}, {"title": "Clarity/resolution", "rating": 4.0, "links": ["https://forum.xda-developers.com/pixel-2-xl/review/clarity-resolution-t3685558"], "threads": []}, {"title": "Minimum brightness", "rating": 4.0, "links": ["https://forum.xda-developers.com/pixel-2-xl/review/minimum-brightness-t3685559", "https://forum.xda-developers.com/pixel-2-xl/review/minimum-brightness-t3685559/page2"], "threads": [{"text": "I decided to use the phone with Adaptive Brightness on and the brightness level set to 29%. How I got to that was in total darkness I want it to be the lowest possible setting yet I want it to be bright enough during the day and not have to touch anything. So I moved the slider from 1% up until I noticed the screen get brighter at 30%. I also noticed that it's actually lower with these settings then with Adaptive Brightness off and the slider all the way to the left.", "time": "1st November 2017, 01:21 PM", "postID": "post74368437", "replies": [{"text": "Thats basically were ive landed to i also use the automatic night mode set up from dusk to dawn cuz the blue light bothers me at night", "time": "2nd November 2017, 02:21 AM", "postID": "post74375620", "replies": [{"text": "I set up night mode too but specific times. I realized dusk is a little too soon for me.", "time": "2nd November 2017, 02:27 AM", "postID": "post74375649", "replies": []}]}]}, {"text": "the display gets extremely dim, which is nice, except that the colors/blacks are way out of wack when the brightness is in the lower ~20% range.  \n\nanything remotely dark is straight black , pixel off, zero detail.  photos and videos are very hard to view in this lower brightness.  white text on black is okay.", "time": "2nd November 2017, 02:38 AM", "postID": "post74375704", "replies": [{"text": "Yeah the black clipping makes it tough at night. That can be addressed with software no?", "time": "2nd November 2017, 02:40 AM", "postID": "post74375720", "replies": [{"text": "Yes I would think so.  Not sure when they will get around to it though, since there seems to be bigger fires to put out.", "time": "2nd November 2017, 05:19 AM", "postID": "post74376664", "replies": []}]}]}, {"text": "I find the display doesn't get dim at all compared to my Note 5.\nEven at lowest setting, night mode, it's way too bright for night use.\n\nI read my phone in darkness every night when the kids go to bed and I find the brightness too high.", "time": "7th November 2017, 02:04 AM", "postID": "post74431188", "replies": [{"text": "According to Phone Arena it's minimum brightness is 2 nits so that's very low. Are you using Adaptive Brightness I feel it gets lower with it on then off at lowest as I previously posted.", "time": "7th November 2017, 03:01 AM", "postID": "post74431503", "replies": [{"text": "Off. And I tested and with it off it gets even brighter.", "time": "7th November 2017, 03:03 AM", "postID": "post74431513", "replies": [{"text": "You said off twice. Do you mean \"on\" for the second one?", "time": "7th November 2017, 03:05 AM", "postID": "post74431520", "replies": [{"text": "Sorry, when I turn it on, the screen gets brighter. In a pitch black room.", "time": "7th November 2017, 03:06 AM", "postID": "post74431527", "replies": [{"text": "I don't know. I just tested myself and at 29% Adaptive Brightness on still looks darker than at 0% Adaptive Brightness off. Maybe it's your brightness setting? Were you at 0-29% with Adaptive On? It actually remembers separate brightness levels for on and off.", "time": "7th November 2017, 03:09 AM", "postID": "post74431551", "replies": [{"text": "Oh that was it. Adaptive was putting the slider back up.\nNow much darker with adaptive on and 0%!!!\n\nI turned off adaptive brightness as I felt it was \"flickering\" a lot in dim )not black) environment. To the point it was annoying as hell.\n\nI'll have to test that 29% threshold see if that can fix it... Otherwise I'll leave adaptive off and switch on for pitch black reading.", "time": "7th November 2017, 03:14 AM", "postID": "post74431599", "replies": [{"text": "Glad we got it figured out.", "time": "7th November 2017, 03:16 AM", "postID": "post74431609", "replies": []}]}]}]}]}]}]}]}]}, {"title": "Call quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/pixel-2-xl/review/call-quality-t3685560"], "threads": [{"text": "Call quality is not as good as my Samsung S6 Edge that I traded up from. I am pretty disappointed considering the Edge had many issues--despite being an expensive phone--that its call sound quality is way better than the 2 XL.", "time": "21st October 2017, 09:37 PM", "postID": "post74246488", "replies": [{"text": "What cell phone provider are you using?", "time": "31st October 2017, 05:11 AM", "postID": "post74354108", "replies": []}]}, {"text": "I haven't had anyone complain about call Quality. Especially when using HD calling. Overall I think that the call Quality is about on par with my Moto X pure, that I am coming from.", "time": "23rd October 2017, 01:35 AM", "postID": "post74259355", "replies": []}, {"text": "I am really unhappy about phone call quality.   I went from a S7E on Verizon and now on FI.... so maybe due to FI.  I am having issues of people calling me 4-6x and the phone does not ring.  There is terrible reverb on phone calls when someone calls me; but sound is better if I call out.  Others have complained about the phone call quality.  So I am not sure if this is FI or P2XL....  I am seriously thinking of returning to Verizon.... But I would hate to find out the issue is the phone.", "time": "23rd October 2017, 01:44 AM", "postID": "post74259401", "replies": [{"text": "it's mostly FI.  I had FI before and the call quality varied depending on if you connected to Sprint vs Tmbobile towers.", "time": "31st October 2017, 08:19 PM", "postID": "post74361995", "replies": []}]}, {"text": "My call quality is infinitely better than on my s6 edge.", "time": "8th January 2018, 05:23 PM", "postID": "post75126435", "replies": []}, {"text": "I don't have any issues with call quality on VZ.  I also have a network extender, and no problems. I turned on WiFi calling.  I have the Google version of the P2XL.  My calls have been loud and clear.\n\nUpdate: the only annoying thing is that all emails or texts interrupt the call with a beep.", "time": "9th January 2018, 01:23 PM", "postID": "post75135845", "replies": []}]}, {"title": "WiFi strength, range, and throughput", "rating": 3.5, "links": ["https://forum.xda-developers.com/pixel-2-xl/review/wifi-strength-range-throughput-t3685561", "https://forum.xda-developers.com/pixel-2-xl/review/wifi-strength-range-throughput-t3685561/page2", "https://forum.xda-developers.com/pixel-2-xl/review/wifi-strength-range-throughput-t3685561/page3"], "threads": [{"text": "WiFi strength isn't as good on this phone as it is with the original XL.  I have both and notice a big difference.  Not sure what's going on.  I get better performance with WiFi off.  Wth", "time": "26th October 2017, 08:53 PM", "postID": "post74306303", "replies": []}, {"text": "Just got the 2XL and it has way more problems staying connected to my 5GHz network in places that my original XL had no issues.", "time": "27th October 2017, 02:59 AM", "postID": "post74308860", "replies": []}, {"text": "WiFi is worse than the original Pixel. Mine keeps saying signal lost and has to reconnect.", "time": "31st October 2017, 08:48 PM", "postID": "post74362268", "replies": [{"text": "Me too. Worse than my 6p. Pretty disconcerting actually", "time": "31st October 2017, 09:17 PM", "postID": "post74362521", "replies": []}]}, {"text": "Haven't noticed any issues with signal strength. I do have my FiOS router on one end of the house and a 5GHz repeater on the other end. Haven't done speed tests but it was noticably faster restoring apps compared to my Nexus 5X.", "time": "31st October 2017, 09:47 PM", "postID": "post74362772", "replies": []}, {"text": "My cell signal seems similar to other phones but wifi is a bit faster than my s7 edge. Even though the measured speed seems similar to other phones I will say everything seems much much faster. I was installing apps literally almost as fast as I could push the buttons. Setting up this phone and installing all of my apps was significantly faster than any other phone I've used.", "time": "2nd November 2017, 04:08 AM", "postID": "post74376289", "replies": []}, {"text": "5GHz 80MHz has been great so far, 300Mbps easy.", "time": "10th November 2017, 01:02 PM", "postID": "post74468432", "replies": []}, {"text": "Has anybody done any digging on this issue?  Any thoughts on whether it's a hardware or software issue?  I have a 2XL running 8.1 beta, I get constant slow browsing performance on WiFi, apps saying they're having connectivity issues, etc.  Running multiple speed tests on my home connection I get an average of 11 down / 1.5 up.  My girlfriend has a Pixel 2 (non-XL) running 8.0.  She gets 85 down / 10 up on the same network and no performance issues.", "time": "2nd December 2017, 01:23 PM", "postID": "post74711058", "replies": [{"text": "What routers do you guys have? I have a Frontier FiOS Arris one and a TP-link repeater working well with my phone. 50/50 and getting nearly that from both. Directly next to the Arris definitely gets it.", "time": "2nd December 2017, 06:10 PM", "postID": "post74713906", "replies": [{"text": "I have  a  d link running on 2.4ghz", "time": "2nd December 2017, 07:58 PM", "postID": "post74714890", "replies": []}]}]}, {"text": "I feel same\nI have 40 mbps download plan where my  N5 N6p iphone 8 plus and 6 plus on speedtest app pulls 38to 40 mbps my  pixel-2-xl pulls max of 15 mbps\nThis is so weird", "time": "2nd December 2017, 05:21 PM", "postID": "post74713416", "replies": []}, {"text": "I have a Nighthawk R7000P.  The funny thing like I mentioned is my girlfriend on a non-XL Pixel 2 get's 8x better throughput than I do, sitting right next to me.  She doesn't have an app connectivity or lag problems either.", "time": "2nd December 2017, 08:57 PM", "postID": "post74715339", "replies": [{"text": "Your nighthawk might be limiting your bandwidth.", "time": "8th January 2018, 03:57 AM", "postID": "post75119291", "replies": []}]}, {"text": "I have an Asus ac3200 with Xfinity 300/25 and I have no issues at all.", "time": "2nd December 2017, 09:46 PM", "postID": "post74715734", "replies": [{"text": "Man your upload is capped so low compared to your download.", "time": "2nd December 2017, 11:34 PM", "postID": "post74716397", "replies": []}]}, {"text": "I have 40 mbps plan for download but when I test on pixel 2 xl using speedtest app it says max is 15 or 16 mbps but when i try to download something from play store then it is drawing about 3.5 mbps which is what my other devices get\nWhy so?", "time": "8th January 2018, 10:17 AM", "postID": "post75121913", "replies": [{"text": "I have bunch of questions to get more details on your situation. First, how are you estimating your Play Store download speed? You're not mixing up mbps with Mbps right? Also, how far is your router from where you're testing your phone? Are there lots of walls or another floor in the way? Do you have a 2.4 GHz or 5 GHz router?\n\nI have a 50/50 FiOS service and get it fine about 100 feet away from the router because I use 5 GHz, have a range extender, and it helps that my house is 1 floor.", "time": "8th January 2018, 12:16 PM", "postID": "post75123049", "replies": [{"text": "I have a 2.4ghz one and i am sitting on top of it and testing my every other device draws about 38 mbps\nAnd yes I'm not confusing them lol\nIn playstore I see the download progress and see how much it is downloading and can assume about 3mbps+", "time": "8th January 2018, 01:05 PM", "postID": "post75123510", "replies": [{"text": "Wow right next to the router? That's surprising. Have you tried powering off the router for a minute then starting it back up? I know you said other devices draw 38 Mbps but it's worth a try if you didn't.", "time": "8th January 2018, 01:35 PM", "postID": "post75123800", "replies": [{"text": "I did that already lol\nNot sure why it does this and i dont have someone that owns same device to test whether it's my device only\nSo yeah there is that", "time": "8th January 2018, 02:30 PM", "postID": "post75124477", "replies": []}]}]}]}]}, {"text": "Forgot to attach a speed test screenshot.", "time": "8th January 2018, 12:17 PM", "postID": "post75123056", "replies": []}]}, {"title": "Cellular strength and throughput", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel-2-xl/review/cellular-strength-throughput-t3685562", "https://forum.xda-developers.com/pixel-2-xl/review/cellular-strength-throughput-t3685562/page2", "https://forum.xda-developers.com/pixel-2-xl/review/cellular-strength-throughput-t3685562/page3"], "threads": [{"text": "Once device starts shipping and users can test, I'm curious to know if the cellular connectivity issue experienced on pixel xl has been solved on pixel 2 xl or not.", "time": "10th October 2017, 12:54 PM", "postID": "post74105279", "replies": []}, {"text": "Plus one to this. My only real gripe with the current pixel XL. Hopefully the modem or antenna is stronger in the 2.", "time": "11th October 2017, 04:28 PM", "postID": "post74119795", "replies": []}, {"text": "Any updates from people that have their device? Specifically looking to see if there is a signal strength improvement from the original xl?", "time": "21st October 2017, 01:48 AM", "postID": "post74236990", "replies": []}, {"text": "After using this for a day I have some areas that I go through that were very weak with signal and I have Verizon. I just came from my LG G5 that would barely hold up going through these weak areas the pixel XL 2 is much better at holding a signal. I've noticed that where I have one bar with my LG G5 I have two bars with the pixel 2 XL. And in areas where I was losing signal and dropping my call with my G5 it holds onto my call and does not drop my call at all through these weak areas.", "time": "21st October 2017, 11:09 AM", "postID": "post74240446", "replies": []}, {"text": "Sounds promising. Hoping the Pixel 2 improves the Google Fi experience.", "time": "21st October 2017, 06:14 PM", "postID": "post74244552", "replies": []}, {"text": "Looks to be about the same as my 6P and LG G6, getting around 35 down and 10 up at my office. Hardly a scientific answer but it's what I got :P", "time": "21st October 2017, 08:02 PM", "postID": "post74245680", "replies": []}, {"text": "", "time": "21st October 2017, 08:36 PM", "postID": "post74245973", "replies": []}, {"text": "Compared to my Nexus 6 which had pretty good RF performance my Pixel 2 XL is ~2-3 dBm lower on LTE, ~6 dBm lower on wifi.", "time": "22nd October 2017, 03:14 AM", "postID": "post74248404", "replies": []}, {"text": "Not bad", "time": "27th October 2017, 11:02 PM", "postID": "post74319138", "replies": []}, {"text": "Typical for me in downtown Chicago", "time": "29th October 2017, 03:32 PM", "postID": "post74337129", "replies": []}, {"text": "I'd say cell throughput on lte is pretty good!", "time": "7th November 2017, 06:41 PM", "postID": "post74439104", "replies": []}, {"text": "Cell speed and Los Angeles is very good, using T-Mobile, but sometimes it will waste time on B12, which you can disable with a non-SE kernel. That will free up B12 off your 3x CA limit.\n\nAveraging about 80-120Mbps around my neighborhood.\n\nEdit: Tested over 140 yesterday.", "time": "8th November 2017, 11:57 PM", "postID": "post74453218", "replies": []}, {"text": "This is my second one the Google tec talked me into it got it in the mail today. I gotta say the second one was worse Tha the first I'm in a poor signal area and I got limited text and phone but next to no internet. My Moto phones knock the socks off of it. Even my old Nexus 6. I'm on Verizon.", "time": "19th November 2017, 03:32 AM", "postID": "post74561288", "replies": [{"text": "i havent had any issues at all...i use all four carriers...", "time": "20th November 2017, 07:59 PM", "postID": "post74580264", "replies": []}]}, {"text": "160mbps! T mo.\nGetting 60mbps on my 6p was alot.... Then.", "time": "22nd November 2017, 02:42 AM", "postID": "post74594575", "replies": []}, {"text": "How is it at getting a good cellular signal? My OG Pixel is the worst and I don't want to be fooled again.", "time": "22nd November 2017, 03:18 AM", "postID": "post74594746", "replies": []}, {"text": "I received my Pixel 2 XL in the UK earlier this week and I am finding it is quite often losing it's HSDPA connection and falling back to Edge in areas where my trusty Nexus 5 was happily maintaining connection. They are both using the same SIM card on Virgin 3G (although I am waiting for them to switch me other to 4G in a couple of days) which runs off EE.\n\r\nAnyone else experienced similar or know how to resolve.\n\r\nCheers\n\r\nBaz", "time": "24th November 2017, 01:02 PM", "postID": "post74620473", "replies": []}, {"text": "I get horrible signal -111 right under a Verizon tower.....yes I have Verizon lol", "time": "28th November 2017, 05:53 PM", "postID": "post74669651", "replies": []}, {"text": "When you say right under do you mean right under or close, cause you can be to close.", "time": "29th November 2017, 12:29 AM", "postID": "post74673158", "replies": [{"text": "Close like I can see it from my window at work....maybe 300 yards", "time": "29th November 2017, 02:32 AM", "postID": "post74673843", "replies": []}]}, {"text": "Deleted.", "time": "29th November 2017, 01:29 AM", "postID": "post74673469", "replies": []}, {"text": "I haven't done a speed test in a long time. When connected to Sprint's band 41, it's pretty fast! Too bad upload looks capped at around 5-6 Mbps.", "time": "1st December 2017, 02:03 AM", "postID": "post74696112", "replies": []}, {"text": "I'm left with \"No Service\" or very slow data speeds on 3 UK. Camera, battery and good signal strength are the three boxes that need to be ticked for me. Sadly this is going to have to go back in it's box to Google!", "time": "3rd February 2018, 09:11 AM", "postID": "post75430102", "replies": []}, {"text": "On the same location I have at least 20% better signal than I had on Galaxy S8+. Since I am not in urban area I also experience better battery life together with better signal. You know how much the average or low radio signal drains the battery.", "time": "9th February 2018, 02:23 PM", "postID": "post75502781", "replies": []}, {"text": "Kind of weird this is my 3rd Pixel2xl returned the first 2 because of signal issues. Got a super deal on this one couldn't pass it up. Im in a very poor signal area in Wisconsin. This one is one of the best phones I have had signal wise. Anyone else noticed a big difference lately? Towers haven't changed any either it is the phone. Thanks", "time": "19th February 2018, 12:02 AM", "postID": "post75617685", "replies": [{"text": "What's your service provider? And I'm guessing your phone prior to the Pixel 2 XL had good signal? Also, are you going by the number of bars or the actual signal strength in dBm? Not sure if there's still a discrepancy because companies and how they translate dBm to bars.", "time": "19th February 2018, 01:34 AM", "postID": "post75618232", "replies": [{"text": "Thanks for your reply. Service provider Verizon. I've pretty much had most phones that come out. I've had phones since the original Droid\r\n Moto phones always work here and the Note 4 for some reason worked well and of course iPhones also work well just can't deal with them I tried.lol. I use an app Advance Signal to look at strength. Signal bars just don't get it. Like I said I had 2 Pixel2xl,'s before this one. I believe they were both on 8.0 though maybe that is it. Some kind of super Modem on 8.1 what ever just curious what it could be. Thanks again.", "time": "19th February 2018, 02:41 AM", "postID": "post75618624", "replies": [{"text": "I've had the same Pixel 2 XL since October and running on Sprint. Haven't notice any better or worse signal.", "time": "19th February 2018, 05:10 AM", "postID": "post75619433", "replies": [{"text": "Thanks glad there good.", "time": "19th February 2018, 02:32 PM", "postID": "post75623943", "replies": []}]}]}]}]}]}, {"title": "Speakerphone (loudness, clarity)", "rating": 3.5, "links": ["https://forum.xda-developers.com/pixel-2-xl/review/speakerphone-loudness-clarity-t3685563", "https://forum.xda-developers.com/pixel-2-xl/review/speakerphone-loudness-clarity-t3685563/page2", "https://forum.xda-developers.com/pixel-2-xl/review/speakerphone-loudness-clarity-t3685563/page3", "https://forum.xda-developers.com/pixel-2-xl/review/speakerphone-loudness-clarity-t3685563/page8"], "threads": [{"text": "It doesnt seem loud. Comparing my iphone 7+ its lack of bass.", "time": "13th October 2017, 06:17 PM", "postID": "post74144539", "replies": [{"text": "I don't follow. The iPhone lacks bass? Or the Pixel? And how are you reviewing a phone that isn't out yet?", "time": "13th October 2017, 06:33 PM", "postID": "post74144719", "replies": [{"text": "I went to verizon to check out the demo. Pixel lacks bass.", "time": "13th October 2017, 08:54 PM", "postID": "post74146145", "replies": [{"text": "thats pretty disappointing if it lacks bass. sure they're both front firing speakers but if the quality of the audio is subpar whats the point? would rather have less bezel in that case.", "time": "15th October 2017, 08:19 PM", "postID": "post74170680", "replies": []}]}]}]}, {"text": "I went to Verizon today and sampled making sure the settings were maxed out and it contributed to my order cancellation.\\\nWeak, anemic, pitiful is all I can say. \nIt seems the idea of two speakers is all they have going for it.\nI had a bad feeling viewing the release presentation. It sounded canned. Good Luck All.", "time": "15th October 2017, 10:46 PM", "postID": "post74171965", "replies": []}, {"text": "I went by Verizon today and check one out. Listen to music full blast and it was plenty loud for my ears.", "time": "16th October 2017, 12:56 AM", "postID": "post74172723", "replies": []}, {"text": "Went to the Verizon store today to finally check out the XL 2 in person only to find the display model battery dead due to a bad Verizon cable charger not working 😑 I did get to play with the regular Pixel 2 though. I turned the speaker up but it honestly did not seem loud. Actually felt like my Pixel XL speaker was much louder but I did not really test it properly so I'm still patiently waiting for these full reviews. My pre-ordered XL 2 should be here by Oct 30 and I am no doubt still excited about my purchase. Although the battery was dead the XL 2 looked and felt nice in my hand. The Pixel 2 does have some bezels however it's still a great phone! To be honest I love the size of the regular Pixel but like the bigger screen of the XL.", "time": "16th October 2017, 01:48 AM", "postID": "post74173029", "replies": []}, {"text": "I checked one out at a V store this past weekend.  Felt nice in the hand.  Stereo sound was good but the loudness wasn't there.  I mostly need loud in the car when using Google maps and after testing youtube out in the store then going out to the car and blasting the 7+ there was a noticeable difference.  The 7+ is a lot louder.  The front facing stereo speakers were noticeable with left/right sound but for my purposes I need more overall loudness.  I'm afraid I would have the Pixel 2 XL cranked all the way all the time.", "time": "17th October 2017, 03:47 AM", "postID": "post74186365", "replies": []}, {"text": "Well I guess we'll have to wait for ARISE sound mod, hopefully that will fix that", "time": "18th October 2017, 01:56 PM", "postID": "post74204519", "replies": []}, {"text": "Maybe THIS video could be a reference.", "time": "18th October 2017, 08:39 PM", "postID": "post74209496", "replies": [{"text": "iPhone 8 easy win..\n\nFront firing would make sense to be quieter vs bottom firing laying flat on a table.\nThe sound can bounce off a large solid area with bottom firing.\nBut the db range is clearly wider on the iPhone.\n\nWhat people are calling quieter is actually just dull sound.\n\nHe really doesn't know much about audio but the clip helps. Thanks for posting.", "time": "19th October 2017, 12:48 AM", "postID": "post74211574", "replies": []}]}, {"text": "Btekt comparison on youtube\nPixel 2 XL vs iPhone 8 Plus speaker comparison", "time": "19th October 2017, 03:36 AM", "postID": "post74212570", "replies": []}, {"text": "The speakers are a huge plus for me. Not as loud as my 6P, but more clear and bass-y than they were.  Still not perfect, but better than any other phone I've owned so I can't complain.", "time": "19th October 2017, 02:36 PM", "postID": "post74218158", "replies": [{"text": "How's the audio through headphones using stock eq?", "time": "20th October 2017, 12:21 AM", "postID": "post74224443", "replies": [{"text": "Yeah, I would like to know that too, Pixel was OK-ish, not as loud s the Nexus 6", "time": "20th October 2017, 10:55 AM", "postID": "post74228467", "replies": []}]}, {"text": "Any thoughts on the screen quality/burn in reports??", "time": "23rd October 2017, 01:14 PM", "postID": "post74264312", "replies": []}]}, {"text": "Once we get the phone, we can always go in (root) and change the audio level file.", "time": "20th October 2017, 11:27 AM", "postID": "post74228747", "replies": []}, {"text": "Yeah I think it's fine. Once we get root , can use arise to increase speaker vokume", "time": "20th October 2017, 04:42 PM", "postID": "post74232112", "replies": [{"text": "Not going to improve frequency response of the drivers. You'll be stuck with a narrow and unresponsive sound no matter the software.", "time": "23rd October 2017, 01:13 AM", "postID": "post74259239", "replies": [{"text": "Any idea how it compares to the smaller Pixel 2? I'm debating returning the phone due to the screen issues, if I know that the smaller phone would have better audio, that might be the icing on the cake for me...", "time": "23rd October 2017, 01:33 AM", "postID": "post74259344", "replies": []}]}]}, {"text": "It's kinda like taking the average crappy bottom firing speaker and putting it in the front... With an additional one.. Not great. Not that good either. My pixel OG has a better, fuller sounding bottom firing speaker. They should have used two of those on the new pixel.\n\nAn interesting side effect is that you can feel the whole screen vibrating when the speaker is playing. It's too bad they can't use the display as a woofer.", "time": "20th October 2017, 06:46 PM", "postID": "post74233607", "replies": []}, {"text": "Just ok: the iPhone 8 has better sounding stereo speakers. The Pixel 2 XL lack bass.", "time": "22nd October 2017, 11:51 PM", "postID": "post74258769", "replies": []}, {"text": "The top speaker on the Pixel 2 XL is about 10 dB quieter than the bottom one [Video]\nhttps://9to5google.com/2017/10/23/th...tom-one-video/", "time": "23rd October 2017, 07:26 PM", "postID": "post74268657", "replies": []}, {"text": "The speakerphone (for phone calls on speaker) only utilizes the bottom speaker for some reason.\nIt is decently loud and clear, not as loud as the Nexus 6P could get (but the 6P allows the volume to be louder than what the speakers are capable of producing, i.e. the sound would distort).\n\nMy comparison for the speakers are my 6P and the Pixel 1 XL that Google replaced the 6P with. The 6P front facing stereo speaker had more bass, but it had a dip in the mid range (around 400-1000 Hz), and a slight boosts around 2k-4kHz and above with extra accentuated vocal clarity and sibilance. \nThe Pixel 2 XL speakers are actually quite flat across the frequency range. It greatly lacks bass from around 200 Hz and below compared to the 6P and Pixel 1 XL, however, the mid and treble range are quite flat and pleasant sounding. It does not have the dip/scoop in the mid range like the Pixel 1 XL and 6P do.", "time": "24th October 2017, 04:54 AM", "postID": "post74273034", "replies": [{"text": "Noticed this too. I do a lot of conference calls on speaker. A little disappointed that the phone only uses the bottom speaker for conference when it uses both for all else. Hopefully we can modify the phone to use both.", "time": "26th October 2017, 06:09 PM", "postID": "post74304510", "replies": [{"text": "This is the exact thing that 6p does... But noe we have to find issues...", "time": "29th October 2017, 10:13 AM", "postID": "post74334384", "replies": []}]}]}, {"text": "Sound quality is poor.  No bass and doesn't have a good DAC.  Must as well gone with one speaker and less bezels.", "time": "26th October 2017, 05:49 PM", "postID": "post74304285", "replies": []}, {"text": "I agree with the above post about the speakerphone for voice calls.  It's a shame it only fires from the bottom speaker and above 50% or so the speaker sounds a bit tinny.", "time": "29th October 2017, 08:08 AM", "postID": "post74333459", "replies": []}, {"text": "Coming from a Nexus 5X with only one front facing speaker, this is much improved. It's loud enough for me and clear at max volume without distortion. For just private viewing I usually have it several clicks below max. There's enough bass to give the audio a little range but I'm not expecting anything heavy with any phone speaker.", "time": "31st October 2017, 02:08 AM", "postID": "post74353099", "replies": []}, {"text": "Does anyone else have an issue with the bottom speaker rattling at higher volumes for music and sound?", "time": "31st October 2017, 10:53 PM", "postID": "post74363239", "replies": []}]}]