[{"title": "Overall love", "rating": 5.0, "links": ["https://forum.xda-developers.com/htc-10/review/overall-love-t3361276", "https://forum.xda-developers.com/htc-10/review/overall-love-t3361276/page2", "https://forum.xda-developers.com/htc-10/review/overall-love-t3361276/page3", "https://forum.xda-developers.com/htc-10/review/overall-love-t3361276/page5"], "threads": [{"text": "nice.", "time": "26th May 2016, 02:16 PM", "postID": "post67034807", "replies": []}, {"text": "I wouldn't mind if it were a tad larger (I loved the One max and my Moto X Pure) but I do consider this phone to be near perfection.", "time": "26th May 2016, 04:24 PM", "postID": "post67036729", "replies": [{"text": "I don't know how to explain it, I don't necessarily want it to be larger per se, but I maybe they way HTC designed the phone around the screen. My Nextbit Robin is said to have a 5.2\" screen as well, but it's easier to type on my Nextbit Robin than my HTC 10. I think I like the look of the HTC 10 curved/chamfered edges, but I feel like the curviness of the phone makes it harder to type. I don't know if that makes sense, but yeah... Something about it makes it harder or not feel as great in hand to type and what not.\n\n---------- Post added at 09:34 PM ---------- Previous post was at 09:31 PM ----------\n\nI think overall I love the HTC 10 though. I love the HTC Boom Sound and Dolby Audio, USB-C, Qualcomm Quick Charge 3.0 (though I see many phones with this technology get and claim 0-50% in 30 minutes than 0-80% in 35 minutes like Qualcomm originally promised, which honestly is slower than Qualcomm Quick Charge 2.0 which I think claimed 0-60% in 30 minutes), the camera, clean and simple user-experience, micro sd card slot (w/ Adoptable storage), and Wi-Fi calling directly out-the-box.", "time": "29th May 2016, 02:34 AM", "postID": "post67071875", "replies": [{"text": "I find that my 10 charges faster than my QC 2.0 phones with a smaller battery. Have you tried comparing yourself?", "time": "29th May 2016, 02:36 AM", "postID": "post67071899", "replies": []}]}, {"text": "Yes, and no. I charge my Nextbit Robin & HTC 10 everyday, but haven't necessarily paid attention to which one is faster. But from what I can gather, it's not any faster. But I'd have to test it out.\n\r\nHowever, I have paid attention to the speeds from 0% on up, and the HTC 10 does 0-30% in 35 minutes. Though that is what HTC claimed, I was looking forward to Qualcomm Quick Charge 3.0 and Qualcomm's claim of 0-80% in 35 minutes. So to me, it just defeated the whole purpose. @richii0207", "time": "29th May 2016, 09:25 PM", "postID": "post67083730", "replies": [{"text": "Qualcomm never said that the 10 charged that fast, or any phone in particular for that matter. As you can imagine, a phone with 3000mah charges significantly faster than a phone with 5000 mah and a phone that is streaming while charging will charge slower than an idle phone. As Qualcomm and HTCs word for the 10, it charges up to 50% in just 30 minutes.\nHere is the source: www.htc.com", "time": "6th August 2016, 07:12 PM", "postID": "post68071614", "replies": []}]}]}, {"text": "I am extremely happy with the phone. Got it June 30th and still learning. I have been able to get some great pictures and videos of my new puppy. A GSD/Husky.  I use it almost every day for texting.  Didn't do much before, but reasons did not present themselves.  Now it is mostly with my dog walking partners.  I am totally amazed at how long the battery lasts -and- how quick it charges.  This is only my 2nd Smartphone so all I have to compare it to is my almost 5 yr old ReZound.", "time": "30th July 2016, 06:58 PM", "postID": "post67971805", "replies": []}, {"text": "HTC 10? More like HTC 10/10)", "time": "5th August 2016, 05:36 AM", "postID": "post68049895", "replies": []}, {"text": "Best HTC device ever", "time": "15th September 2016, 01:41 AM", "postID": "post68693014", "replies": []}, {"text": "just switched from iphone to htc!", "time": "30th September 2016, 10:27 AM", "postID": "post68922136", "replies": []}, {"text": "In my opinion the HTC 10 is one of the best phone HTC has produced since the One M7, i skipped the One M9, which was terrible, im using HTC phones since the G1(or HTC Dream), i always loved HTC phones, they are just different, something special, like me haha.\r\nI love my HTC 10, especially in that black color, its just perfect. I wouldn't mind if the screen was a tad bigger, like 5.5inch, but its OK as it is.\r\nSo i think that the 10 is really underrated, i think it's because HTC gain a bad reputation since the disappointing M9, and steep prices of their phones, which is true in my opinion, as you can get a flagship phone like OnePlus 3, in half the price. \r\nHTC 10 is the best, love it.", "time": "6th October 2016, 12:15 PM", "postID": "post69005475", "replies": []}, {"text": "I'd write a long reviews but when I hit submit, the lovely xda forum say that need to be logged to submit a reviews, and reset the form. I love you random programmer guy! \n\r\nAnyway, long story short, I love my htc, I resisted a lot of drops, and is working like the first day. I just miss the sony flashtool from my z2, being able to install updates without wipe (since my phones are rooted and android 6 wont install updates on modified system partition's phones).", "time": "20th October 2016, 05:09 AM", "postID": "post69214680", "replies": []}, {"text": "I won't be going back to Samsung any time soon.  For me the 10 is the perfect size and the build quality is excellent. I paid cash up front for a US unlocked directly from HTC US. It came with no bloatware and was easy to root and install a custom rom. Best phone I have ever had.\n\r\nI ran custom roms on Samsung devices for years, but there always seemed to be something that didn't work. I would get a phone call and the screen would go black, or WiFi would keep dropping, it was always something. I haven't had any of those problems with the 10 on Sense-based custom roms.", "time": "24th October 2016, 05:15 PM", "postID": "post69286340", "replies": []}, {"text": "HTC 10 deserves 10 out of 10. I got mine straight from HTC (unlocked) and converted to work on Verizon ( we have some really good devs like Santod, LeeDroid and MANY other who make this a dream device for a flashaholic like me). Camera is good, battery life is very good ( I get about 5 hours of screen on time) sound is very good for sure I can't recall a thing I don't like about this phone to be honest.", "time": "26th October 2016, 07:11 AM", "postID": "post69312105", "replies": []}, {"text": "Screen could have been better as well as internal storage could have been 64Gb default.", "time": "31st October 2016, 10:06 PM", "postID": "post69399157", "replies": []}, {"text": "HTC's own apps ruin this phone.  They substituted their good apps (Gallery and Music) with Google's and left the obscure garbage apps.", "time": "12th November 2016, 11:31 PM", "postID": "post69591221", "replies": []}, {"text": "Thrillingly beautiful, breathtaking performance!! I wouldn't mind buying another HTC 10 if i needed it.", "time": "17th November 2016, 03:06 AM", "postID": "post69659072", "replies": []}, {"text": "The speakers are fantastic, it charges really quickly and it looks amazing. Only slight complaint would be the camera, it's not bad but coming from a Note 7 the difference is noticeable. Overall 9.5/10.", "time": "19th November 2016, 05:01 PM", "postID": "post69699029", "replies": []}, {"text": "It's a great phone and am happy to be back to owning an HTC phone.", "time": "13th December 2016, 10:54 PM", "postID": "post70076619", "replies": []}, {"text": "Picked this up from Besy Buy yesterday because I need a new personal phone and decided a departure from my usual Samsung or Nexus was in order. The all metal body fits beautifully in the hand and Sense UI is fantastic. Still getting to grips with it but so far so good.", "time": "18th January 2017, 08:30 AM", "postID": "post70606547", "replies": []}, {"text": "Beautifull design, high end sturdy build, effortless performance, great battery life, awesome development comunity.... What more could a person ask for? Oh yeah, got 2 of them, just to be on the safe side 😁", "time": "18th January 2017, 11:02 PM", "postID": "post70618667", "replies": []}, {"text": "Awesome phone, the only real downside is the color selection in europe...\r\nHad to get an US unlocked version, just to have the black front with the silver back.\r\nThe black back just scratches too easily, and the white front doesn't make it feel as premium to me as the black one...", "time": "19th January 2017, 11:54 PM", "postID": "post70634581", "replies": []}, {"text": "I now own this phone for two months, and it looks prettier to me every day....awesome phone (and looks much better than this U sh***)", "time": "8th February 2017, 09:29 AM", "postID": "post70932622", "replies": []}, {"text": "I am extremely bias towards htc . In a world flooded by Samsung and I-Phone  obviously the htc 10 stand out !!!\r\nI think htc did not beat the htc One except for screen size. But thanks to xda we can make htc 10 10 times better than the htc One .", "time": "19th February 2017, 06:34 AM", "postID": "post71093463", "replies": []}, {"text": "I just picked up an HTC 10 last Saturday and love it!  Yes, I'm a big HTC fan... first cellphone was an HTC Eris, then a Rezound, then a Thunderbolt, then over to Samsung for a bit (S3 then S5) and then back to HTC with an M8, then a M9, and now... the glorious 10!  I rooted it, s-off, and then the fun REALLY began... it took a few days of tinkering but once again, my phone mirrors to my car stereo so I can use my data to run Netflix, Waze, text or reply to emails (only when stopped/parked!) and of course stream music.  Since there's no wired option that will charge the phone, I'm using a Samsung AllShare wireless dongle to make the connection and ARUnchained Reloaded as well.\n\nSamsung makes good phones, but they are becoming a serious pain to unlock, root, and get it to work the way I want it to... and if I'm dropping that kind of money, it's going to work MY way, not the way some goober programmer at Samsung wants.\n\nBit of advice:  Illumishield screen protectors are crap.  In complete screen coverage = FAIL.\n\nI prefer very slim cases so I bought a Terrapin HTC 10 Cover - Ultra Slim Fit Hybrid - Hard Case Protection - Rubberized Finish - Black to protect the body and especially the camera lens.", "time": "23rd February 2017, 09:07 PM", "postID": "post71162223", "replies": []}, {"text": "Where is the audio love article? Its very important aspect of smartphones, too.", "time": "7th March 2017, 11:54 AM", "postID": "post71319882", "replies": []}, {"text": "I love my HTC One and I love my HTC 10 but I have only one place in my bed", "time": "10th March 2017, 12:26 AM", "postID": "post71358860", "replies": []}, {"text": "After one year debating myself I decided I could not bear my M8 top speaker distorting sound anymore and finally ordered the HTC 10.\nI hope I wont regret it since I still have mixed feeling about buying it since I otherwise just love my M8. Love the camera, the looks and feel, the screen, the headphone sound quality, the smoothness and speed, etc etc. It´s 3 years old so that is impressive, when I had Samsung one year after I just wanted to upgrade. But the crackling sound on the M8 was getting on my nerves, it distorted the sound even in phone calls and my repair shop tried 3 different replacement speakers and could not fix the issue.\nI considered the HTC 11 U but I hate glass phones. \nAny advice regarding USB C cables? Can just I use a cheap USB to USB-C adapter from eBay?\n\nCheers﻿", "time": "20th May 2017, 10:12 AM", "postID": "post72362759", "replies": []}, {"text": "I've started my journey with HTC from Wildfire. Was a little bit disappointed with M9, but 10 is just perfect phone in any detail!", "time": "20th May 2017, 12:16 PM", "postID": "post72363834", "replies": [{"text": "What about the HTC one m8?", "time": "20th May 2017, 07:44 PM", "postID": "post72368749", "replies": []}]}, {"text": "Having had my HTC 10 since it was released (so well over a year), I'm still really pleased with it. \n\r\nMain likes:\r\n- Build quality is excellent and feels solid\r\n- The camera is the best of any smartphone I've had (not that I've owned a Galaxy S8 or an iPhone 7, but I've taken some great pictures with it)\r\n- Wired sound quality is superb. Shame it doesn't cover bluetooth as well, though.\r\n- Fingerprint reader is very snappy\r\n- Sense is pretty stock Android-ish if you use a different launcher, pixel dialer and stock lockscreen, which I prefer\r\n- Battery life is generally pretty good, and fast charge works well\r\n- Expandable storage\r\n- Nice strong vibration. I can't stand phones with a soggy feeling vibration :P\r\n- Some great ROMs!\n\r\nA few downsides:\r\n- Phone speaker definitely not as good as the One M8, but it's fine\r\n- Some updates wouldn't go amiss, HTC, seriously. January security patch? It's now July.\r\n- Touchpal can do one\n\r\nFelt inspired to write this as a crack has recently appeared in the screen (it has had a few drops so not surprising) and I've been thinking about either getting it repaired or replacing with a new phone. Considered a U11 (too expensive), Oneplus 5 (doubt the camera is better than the 10) and the LG G6 (amazing screen and camera, shoddy battery life allegedly), but not sure I'm ready to give the 10 up just yet!", "time": "3rd July 2017, 10:00 PM", "postID": "post72897316", "replies": []}, {"text": "My wife's grandmother watered mine and the capacitive buttons stopped working. \nIt's the second smartphone that gets ruined by water. I hate glass back smartphones but having Waterproof is making me think a little different. \n\nEnviado do meu HTC One_M8 através de Tapatalk", "time": "3rd July 2017, 10:09 PM", "postID": "post72897398", "replies": []}, {"text": "I've been a huge fan of HTC since the original HTC One and have owned basically ALL their flagship phones (including the ill-fated M9+ and the upper midranger One A9).\r\nIn between those times, I have been switching through other brands (Moto X and Z and even Huawei). Heck, I even sold my grey HTC 10 just after a month!\n\r\nJust last month, I stumbled through Lazada Malaysia and got surprised that they were selling the HTC 10 (unlocked) for USD300!!! (crazy Raya month sale). The Galaxy S8 was around USD530 (sale already ended). To cut this short, I bought my second HTC 10 (silver this time around)\n\r\nI still have my other phone (Huawei P10) and will definitely sell this due to the crappy UI. \n\r\nAnyway, here's my ranking of my favorite HTC flagship:\r\nHTC One (M7) - 10/10 -- this is THE perfect 10! fast camera, great in lowlight, wide angle rear AND selfie camera, boomsound. I think this phone was 3 years ahead of its time so reviewers don't get why HTC decided to put these features.\n\r\nHTC 10 - 9/10 -- everything you want on a phone is here. My only gripe is the boomsound. I can't feel the **oomph** you hear on the M7 and M8. Also, IP67 could have been a nice addition (so potential consumers won't complain it doesn't have one!)\n\r\nHTC One M8 - 9/10 -- the dual camera (which again, HTC was ahead of the time AND reviewers were scratching their heads coz of this \"gimmicky\" bokeh images) But since Apple says it's an important feature, reviewers are going ga-ga over the bokeh now. Sheesh.\r\n-- Boomsound! gahhh!!! Nobody can beat the awesome boomsound! The bass is punchy, the speakers are very loud. Just wow!\n\r\nHTC One A9 -- 7/10 --yes, I bought this phone since it looks like an iPhone. There's this side of me who wants to try an iPhone just for the sake of having one and good thing HTC built this. LOL. Camera is just good at best. The ultrapixel selfie camera is great. Speaker is average (no boomsound here). The battery went from OK to MEH after the nougat update.\n\r\nHTC One M9+ -- 7/10 -- so much disappointment mainly because of the main camera. Not sure what HTC was thinking in putting a toshiba sensor on their phone. My first phone to have a fingerprint sensor and yes, the fingerprint recognition is faster the the iPhone 6 and Galaxy S6 (same year it was released).\n\r\nI didn't mention anything about the sound quality when plugged in through the headset jack. It's because ALL of them are really GREAT. I'd say the closest competitor is Moto. They also deliver great audio quality with above average loudness.", "time": "5th July 2017, 07:37 AM", "postID": "post72912499", "replies": []}, {"text": "I've been a fan of this phone ever since it got announced, by that time, i'm still on my previous Samsung N4 (and eventually N5). Long story short, i made the leap and went ahead to purchase the 10 around March this year and never regret the decision I've made. (except a bit disappointed with no other option for colors except gold....meh) \n\r\nOf course, due to the nature of my work in construction, the note series always have been the perfect companion in everyday task, but again i decided to hell with  that and give the 10 a try. \n\r\nPros\r\n+ amazing built quality, it survived leaving a dent at top edge after falling from waist level without a case (obviously!)\r\n+ responsive and quick with everyday task you throw at it, and i game a lot with this phone\r\n+ much less bloatware\r\n+ great stereo speaker setup, compared to my previous phones I've used\r\n+ perfect size, even after snapping a clear case by spigen, the phone is still easy to operate in one hand\n\r\nCons\r\n- when it gets hot, it really does until to the point you snap back the case as it gets uncomfortable to hold when gaming\r\n- camera is no where better than my N5, which is a bit disappointing \n\r\nAfter 3 months using the device, i put on the bamboo skin by dbrand to cover the less appealing gold color, matching with the white front of the phone, absolutely gorgeous. My device is still performing rock solid, and I don't think I'll change anytime soon, even after the U11 announcement. I don't know why I kept hesitating to make the jump again to U11, maybe because I am not a fan of all glass back. \n\r\nThat's pretty much me sharing my thoughts to everyone, thanks for reading!", "time": "6th July 2017, 08:56 AM", "postID": "post72925081", "replies": []}, {"text": "I am a fan of HTC smartphones since my One M7. HTC makes really good phones with a good quality construction. \n\nPROS\n- It feels confortable in the hand.\n- The Hi-Res headphones are amazing, even more with BoomSound and  Dolby.\n- The camera took excellent photos.\n- It has a very clear sound.\n- Great battery life.\n - Great build quality.\n- 2k resolution.\n- Near stock customization.\n\nCONS:\n- It's difficult to see the screen under the sun.", "time": "24th December 2017, 06:17 PM", "postID": "post74950332", "replies": []}, {"text": "What's your take on this?  HTC 10 vs LG G6?", "time": "4th February 2018, 09:32 PM", "postID": "post75448509", "replies": [{"text": "The two phones are incredible. I have an HTC 10 and my friend a G6. We have compared both phones in terms of quality and performance. \n\nReally like the G6 display with HDR support. But nothing so far from the HTC 10 screen, except the 18:9 aspect ratio and a higher brightness level.\n\nSound in the G6 is louder, but sharper on the 10. Very good sound quality in both cases.\n\nThe build quality is what you can expect in a flagship, but I like more the aluminium of the 10 than the glass of the G6, it feels more resistant.\n\nThe G6's camera app is more complete than the 10 one, but photo quality is nearly the same on both devices. But when the G6's wide angle comes to play, it's simply fabulous. \n\nSo, you will hit whatever device you choose, it's more a personal preference. Both are great phones and they aren't to far in terms of hardware.", "time": "7th February 2018, 02:00 AM", "postID": "post75473311", "replies": []}]}, {"text": "i used to love htc...had the desire, the desire hd, the one s, the one x..the m8....then came the m9...everything besides charging and camera was great but overall..the camera was so bad on the fly it just wasnt worth it. inbetween these phones ive owned..a lot of nexus phones and samsungs etc..overall you cannot beat a nexus phone,the galaxy nexus and the n5x were the best phones ive owned. Any cut a long story short,got back one night...my n5x wouldnt charge..needed an emergency phone...got the htc 10 and discovered it was just the charger on the nexus 5x! but i sold the n5x as had it for a long while,\n\r\nill not be selling the htc 10 till she surrenders life as generally overall shes a great phone,she charges quick and the camera is excellent just as the n5x was so no point really", "time": "7th February 2018, 05:56 PM", "postID": "post75481364", "replies": []}]}, {"title": "Community development strength", "rating": 4.5, "links": ["https://forum.xda-developers.com/htc-10/review/community-development-strength-t3361277"], "threads": []}, {"title": "Overall speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/htc-10/review/overall-speed-t3361278", "https://forum.xda-developers.com/htc-10/review/overall-speed-t3361278/page2", "https://forum.xda-developers.com/htc-10/review/overall-speed-t3361278/page3"], "threads": [{"text": "Have you used it as the apps and their data build up? Is the camera still snappy, do the apps still launch quickly?", "time": "5th June 2016, 06:09 AM", "postID": "post67175960", "replies": []}, {"text": "Just slightly faster than my old LG G3 which I still use at home to save the unremovable battery", "time": "23rd June 2016, 06:28 PM", "postID": "post67453767", "replies": []}, {"text": "So much better than my old AT&T Galaxy Note Edge.  Runs cooler also, can actually record in 4K without overheating.", "time": "25th June 2016, 05:39 AM", "postID": "post67473231", "replies": []}, {"text": "It is faster than my 2014 Moto X with a Snapdragon 801 and 2GB of RAM.\n\nHowever there are little things that are actually faster in my old Moto X:\n- The recent apps list takes a while to show in the HTC 10 I have no idea why. Even disabling animations it still takes longer than on my 2yo phone\n\n- The voice recognition sometimes takes longer on the HTC 10!\n\nBut overrall it is faster", "time": "27th June 2016, 07:37 PM", "postID": "post67507387", "replies": []}, {"text": "It is a little more speed than my HTC One A9", "time": "27th June 2016, 09:27 PM", "postID": "post67508716", "replies": []}, {"text": "Nice article!! Thanks for sharing with us", "time": "18th July 2016, 08:59 AM", "postID": "post67794791", "replies": []}, {"text": "sometimes the notification was too full will lead phone a little bit lag ,hope on android n will improve", "time": "22nd July 2016, 03:50 AM", "postID": "post67851348", "replies": []}, {"text": "Much much faster than my old Droid Turbo 2", "time": "30th July 2016, 06:29 AM", "postID": "post67964496", "replies": []}, {"text": "It is the fastest one and it will remain the fastest until the new HTC Nexus gets released", "time": "30th July 2016, 07:46 PM", "postID": "post67972331", "replies": []}, {"text": "It was pretty fast on stock, but after rooting, debloating, its very very fast, awesome in fact", "time": "21st August 2016, 07:05 AM", "postID": "post68287187", "replies": []}, {"text": "Way faster then my g4", "time": "22nd August 2016, 02:53 AM", "postID": "post68299819", "replies": []}, {"text": "The HTC 10 is the faster phone I ever had. It is much faster than my Nexus 6P and has zero lag. I absolutely love it.", "time": "23rd August 2016, 08:19 PM", "postID": "post68330155", "replies": []}, {"text": "just coming from galaxy s6 with a custom rom (like now with leedroid rom), I think the Galaxy s6 is more speedy device for everyday use", "time": "24th August 2016, 12:30 PM", "postID": "post68340649", "replies": []}, {"text": "I'm coming from a Nexus 6P rooted which was blazing quick however this phone as with the M7 and M9 (skipped the M8) and i have to say that the HTC with the newer version of sense (M7 onwards) certainly holds it's own, even at stock it's fast, couple that with a decent custom rom and optimize it, they're probably the most responsive phones i've ever used. \n\nI really haven't had any performance issues to speak of whatsoever with these devices.\n\nThe only time you'll see a slow down is when you open the application manager and attempt to scroll down before it's actually loaded, which is the same on most android devices.\n\nI have my gripes with HTC, mainly the battery and glare on photo's, or the paint on the gun metal one (my one, chips easily) some of the software could be better, like the camera and other stock apps, but overall i think they're moving more in the right direction than any other label.\n\nSamsung seem to think that touchwiz is superb, it's got better but jesus it's a crippling launcher and the whole eco system following it.\n\nI've moved away from HTC too many times, i'll be sticking with them from now on.\n\nI'll bet that the new Nexus is by far and away the quickest device there has been up until now, bare in mind that the last time HTC did a nexus device it was a masterpiece.\n\nLong live HTC  (with better batteries", "time": "26th August 2016, 05:26 PM", "postID": "post68380762", "replies": []}, {"text": "The HTC One series was always fast and for some reason my original HTC M7 was twice as fast as my Samsung Note 2 when it came to LTE signal. I was on AT&T at the time but I like T-Mobiles unlimited everything  plan with 7gigs of tethering a month. When T-Mobile advertised that they doubled their LTE coverage and  made it faster, I can't argue at all. My HTC 10 has only showed the \"4G\" icon once since launch day. Combine blazing fast signal with Sense (or Nova Prime) with a Sense toggle and slow never enters the discussion!", "time": "27th August 2016, 10:40 AM", "postID": "post68391831", "replies": []}, {"text": "Blazing fast and smooth", "time": "15th September 2016, 01:41 AM", "postID": "post68693019", "replies": []}, {"text": "Anyone coming directly from the HTC one m8? How do they compare in terms of speed and smoothness? \n\nCheers", "time": "17th October 2016, 03:47 AM", "postID": "post69165885", "replies": [{"text": "I still have my M8 along with my current 10.  Both are S-Off, rooted, etc and running their respective version of ViperRom.  10 is a lot faster...though I do miss my IR blaster...lol...which is a main reason I keep it (I'll also use it as my GPS/music device in my car mount hotspotted to my 10.\n\r\nFaster not only in look and feel but in benchmarks...and although its an outdated benchmark...quadrant scores on my M8 are always in the 28-32000 range.  10 is always in the 43-46,000 range. I find that simple benchmark usually correlates to how I feel my phone is running at the time.\n\r\nInteresting note though....Xposed KILLS my 10's performance (quadrant scores drop to anywhere between 18,000 when \"sluggish\" to only 30,000 when it seems to be running okay but slower than without it).  to where I had to uninstall it.  It has no effect on my M8 in performance.", "time": "18th October 2016, 01:00 PM", "postID": "post69186995", "replies": [{"text": "So in everyday real world use you notice the speed difference? I ask this because the M8 on Marshmallow is so smooth already, I don't get how it can get even faster.", "time": "18th October 2016, 01:05 PM", "postID": "post69187059", "replies": [{"text": "It definitely scrolls, transitions, initializes/runs more programs faster, etc.  better camera.  Headphone sound is better...debatable if the phone speakers are...I did love the M8 boom sound and until MM had the harmon kardon mod on it.\n\r\nI upgrade every year as work pays for it and we get the subsidized price ($199)...so I can't say whether it's worth the $600 plunge to upgrade from the M8 to 10...at this point you could probably stay happy with the M8 and wait to see what HTC cooks up in March/April with their next flagship.  Worst case scenario you'll get the 10 on a huge discount with the new flagship out.", "time": "19th October 2016, 12:51 PM", "postID": "post69203318", "replies": []}]}]}]}, {"text": "Everything to be expected from a 820 is being met", "time": "31st October 2016, 10:05 PM", "postID": "post69399148", "replies": []}, {"text": "snappy at all times,\r\njust a few \"stopped working\" errors after the Nougat update, and i guess that's because of the lack of compatibility of apps with android nougat", "time": "15th March 2017, 05:03 PM", "postID": "post71442240", "replies": []}]}, {"title": "App launch speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/htc-10/review/app-launch-speed-t3361279"], "threads": [{"text": "Somewhat Slow (still blazing fast and reasonable compared to other flagships.) \r\nAlso it keeps apps in memory way better!", "time": "5th June 2016, 07:37 PM", "postID": "post67184739", "replies": []}, {"text": "F Kim Kardashian.", "time": "5th June 2016, 09:50 PM", "postID": "post67186304", "replies": []}]}, {"title": "Multitasking/RAM", "rating": 5.0, "links": ["https://forum.xda-developers.com/htc-10/review/multitasking-ram-t3361280"], "threads": [{"text": "How's the memory management on the htc 10?\n\nMaybe someone who used also the the s7 (which still has a bad memory management, apps keep being pushed out from memory) can give us more info?\n\nThanks!", "time": "7th June 2016, 12:21 AM", "postID": "post67202303", "replies": []}, {"text": "By Standard settings Boost+ App kills Apps in background to safe memory.\n\nFrom the official 4gb 3.7gb are available.\n\nAndroid OS always uses about 880mb of that.\n\n\nHere are my Apps.\n\n\nAnd Chrome is a goddamn memory Eater. Sorted by Peak.\n\n\n\nSo sometimes Chrome closed certain Tabs (I always have 6-12 Tabs open) to safe memory. Often the Tabs im Streaming Music .... ie Soundcloud or such.\n\n6gb ROM devices do seem like a great idea for heavy Multitaskers.", "time": "12th June 2016, 09:39 AM", "postID": "post67281041", "replies": []}]}, {"title": "Scrolling smoothness", "rating": 4.0, "links": ["https://forum.xda-developers.com/htc-10/review/scrolling-smoothness-t3361281", "https://forum.xda-developers.com/htc-10/review/scrolling-smoothness-t3361281/page2"], "threads": [{"text": "Darn, I hope it'll just get better once HTC starts patching and updating things more. If rumors are true that HTC will probably make a Nexus variant of the 10, you would say we'd see a lot of improvements on the side of the 10, unless they vastly revamp the hardware. post #600 hurrah", "time": "20th May 2016, 02:57 PM", "postID": "post66942479", "replies": []}, {"text": "I'm actually experiencing some stuttering while scrolling on some apps. Google Plus, Facebook and phone settings are the most noticeable", "time": "21st May 2016, 10:23 PM", "postID": "post66963799", "replies": [{"text": "I have no lag whatsoever in my settings app. Don't use facebook or Gplus", "time": "24th May 2016, 06:17 PM", "postID": "post67007153", "replies": [{"text": "I think it was something messed up after playing with several themes for a while. After a memory cleanup and a restart, everything's back to smooth again", "time": "24th May 2016, 06:29 PM", "postID": "post67007316", "replies": [{"text": "Ah that explains it", "time": "24th May 2016, 10:44 PM", "postID": "post67010656", "replies": []}]}]}]}, {"text": "I've noticed this problem too and it's more prominent in some apps than others. It also happens more frequently when the app is still loading content. Is this considered a malfunction of the phone or does it not happen to all HTC 10?", "time": "22nd May 2016, 09:40 AM", "postID": "post66969018", "replies": []}, {"text": "It happens to all Android phones...", "time": "23rd May 2016, 02:52 PM", "postID": "post66987970", "replies": [{"text": "Didn't notice it on my Nexus 5.", "time": "24th May 2016, 11:05 AM", "postID": "post67001235", "replies": []}]}, {"text": "It depends on the app. Other than being app based, I experience nothing different than my SHIELD or iPad", "time": "24th May 2016, 03:16 PM", "postID": "post67004446", "replies": []}, {"text": "I personally don't see any slow downs,  compared to my old phone,  nexus 6P, id say it's on par.  Speed up animations to 0.5. \n\nHTC sense since the m7 has always been snappy though.  I'd have expected no less from the 10 and sense 8.\n\nI suppose if you loaded it with tonnes of widgets and had a few things running it may slow but the 820 isn't a slouch and should cope with pretty much anything", "time": "25th May 2016, 04:35 PM", "postID": "post67021463", "replies": []}, {"text": "mine is always buttery smooth unless I'm using it while its charging. I'm assuming thats a heat caused issue though.", "time": "25th May 2016, 09:25 PM", "postID": "post67025458", "replies": []}, {"text": "I've never encountered any slowdowns.Sense 8 is as snappy as stock Android.", "time": "30th July 2016, 07:50 PM", "postID": "post67972360", "replies": []}, {"text": "Scrolling is always smooth. No matter how many apps are running in the background or how long the pages I am browsing are, it's just amazing.", "time": "9th August 2016, 10:29 AM", "postID": "post68107217", "replies": []}, {"text": "Hi everyone, I had this problem and I was wondering why, suddenly I had a problem with the SD card (Sandisk 128 GB) which I never doubted its performance. So I reformat it on the phone, and the phone became 10 times more responsive, no glitches (unless extremely minor android glitches), and can report that the phone is really a beast. So I highly recommend if you have an SD card, especially old one, to reformat it and give it a try.", "time": "10th August 2016, 08:39 AM", "postID": "post68121668", "replies": []}, {"text": "Smooth as a baby's bottom.", "time": "11th August 2016, 10:11 AM", "postID": "post68137513", "replies": []}, {"text": "WOW,  I have never got a lag on this device and it is no surprise.", "time": "21st April 2017, 11:21 AM", "postID": "post71960492", "replies": []}]}, {"title": "Heat", "rating": 4.0, "links": ["https://forum.xda-developers.com/htc-10/review/heat-t3361282", "https://forum.xda-developers.com/htc-10/review/heat-t3361282/page2"], "threads": [{"text": "I tell you do not use Skype video calling. That will drain your battery really fast and get so hot you can cook food on it", "time": "10th May 2016, 05:35 AM", "postID": "post66779263", "replies": [{"text": "I think that's just what Skype does. I tried this on a Nexus 6p when I had it and man that software is ridiculous.", "time": "20th May 2016, 05:00 PM", "postID": "post66944341", "replies": []}]}, {"text": "Yup Skype is a PoS no matter what platform you use it on. This phone is getting warmer after some continuous usage, nowhere near the M9 though, even after some 20 minutes gaming sessions", "time": "21st May 2016, 10:25 PM", "postID": "post66963822", "replies": []}, {"text": "Get quite hot quite quickly, even in rooms that are not hot, but seems to cool down. Wi-Fi is the culprit I think. I have my radios off (Airplane mode) and put it in battery saver, so I'm not sure why it would be getting so hot.", "time": "29th May 2016, 12:39 AM", "postID": "post67071121", "replies": []}, {"text": "It does get warm especially when it's charging and if you are doing anything extensive like gaming due to the unibody conducting heat but it does cool down fast though.", "time": "29th May 2016, 10:38 AM", "postID": "post67075854", "replies": []}, {"text": "I play the same game very often, and honestly I must say that the phone is not too hot in that specific time.", "time": "29th May 2016, 02:50 PM", "postID": "post67078552", "replies": []}, {"text": "I've had the \"Time Out\" warning a few times. But that's because it's usually been in sun light on a table or on my lap in the car. I haven't noticed extreme heat from just normal use yet. (While charging it can be warm, but this seems to vary based on the type of charger I'm using. My wife's crappy Walgreens charger seems to get the phone hotter than other chargers I've used)", "time": "30th May 2016, 05:20 PM", "postID": "post67094970", "replies": []}, {"text": "When flashing rom and having it up the charger it got so hot it scared me, plugged off charger and cooled down some..", "time": "30th May 2016, 08:09 PM", "postID": "post67097345", "replies": []}, {"text": "What should the temperature be during charging and a screen-on activity like GPS navigation?  I regularly use my 10 in the car, connected to Bluetooth for Spotify streaming and running Google Maps for navigation.  I regularly see temperatures between 105 and 115 degrees, which seems really high.  I blow AC on it to cool it down, but I'm curious if this is safe/normal temps?", "time": "3rd June 2016, 04:05 PM", "postID": "post67153762", "replies": []}, {"text": "One time I just left my phone on my bed, went to the kitchen to talk to my mom for about 15-20 mins. I left the battery around 30%, came back to it on 3% and the phone was hot AF. I had no idea what happened since I didn't leave anything installed, nothing updated, it was just my regular usage and I left it on the home screen; I even cleared recents before going to the kitchen. I had no idea on what happened, rebooted the phone and it cooled down, charged it afterwards.", "time": "3rd June 2016, 08:52 PM", "postID": "post67157618", "replies": []}, {"text": "Much improved from the M9. That phone would regular burn me. This one  only warms up while charging really.", "time": "23rd November 2016, 01:52 PM", "postID": "post69755993", "replies": []}, {"text": "I had it get hot on me once.   I flashed a new rom & it was charging & optimizing apps.   I always do that with case off & it doesnt get as hot", "time": "26th November 2016, 12:33 AM", "postID": "post69793188", "replies": []}]}, {"title": "Low light", "rating": 4.5, "links": ["https://forum.xda-developers.com/htc-10/review/low-light-t3361283"], "threads": [{"text": "Insane quality, superb pro mode. Best noise wipe software, may have more options in camera app.", "time": "10th September 2016, 06:13 PM", "postID": "post68622788", "replies": []}]}, {"title": "Photo quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/htc-10/review/photo-quality-t3361284", "https://forum.xda-developers.com/htc-10/review/photo-quality-t3361284/page2", "https://forum.xda-developers.com/htc-10/review/photo-quality-t3361284/page3", "https://forum.xda-developers.com/htc-10/review/photo-quality-t3361284/page6"], "threads": [{"text": "i want to see photo quality of HTC 10", "time": "4th June 2016, 04:12 AM", "postID": "post67161339", "replies": []}, {"text": "Immediately after pulling the phone out of the box I was getting serious glare from any light source.  Sunlight was washing out all of my photos, and any light-bulb produced very pronounced streaks and flare.  I didn't immediately wipe the lens down as I didn't think it would make much difference (never really had to worry about it on previous phones). \n\r\nI thoroughly wiped the lense down, and saw significant improvement. \n\r\nI have a number of before and after photos, but I can't post to the forum yet as I am new to the community.  I will upload them later, or message me and I will send them to you.", "time": "30th July 2016, 08:51 PM", "postID": "post67972973", "replies": []}, {"text": "I must say I'm quite impressed, especially coming from the atrocious LG G2 camera! Straight out of the camera, no editing...  http://i.imgur.com/uT7Djm6.jpg", "time": "31st July 2016, 11:07 PM", "postID": "post67987523", "replies": []}, {"text": "i think not really sharp", "time": "15th September 2016, 01:41 AM", "postID": "post68693023", "replies": []}, {"text": "I'm no photography expert but from comparing with S7 line and P9 Plus, I think the 10's cam needs improvement. Before taking a pic it really looks nice but after taking the pic it becomes a bit dull. Not really sure how to describe it.", "time": "17th September 2016, 09:47 PM", "postID": "post68737202", "replies": [{"text": "I know what you mean, the picture is very clear when in live view, but after capture and save to JPG it \"compress/process\" too much, make the photo looks something wrong.\r\nif you take photo in raw mode then the DNG will much better.\r\nI agree, Note 7 and S7 is much better as you got a good photo and don't need to do anything, while the HTC 10 need to do some work before can get an on pair result. \r\nSometime my old Nexus 5 will take a better photo then the HTC 10, especially HDR.\n\n---------- Post added at 03:21 AM ---------- Previous post was at 03:18 AM ----------\n\n\n\r\nlook at the sky, the famous HTC 10 white out", "time": "18th September 2016, 08:21 PM", "postID": "post68751332", "replies": []}]}, {"text": "Best in class", "time": "31st October 2016, 10:06 PM", "postID": "post69399167", "replies": []}, {"text": "how can i change to raw mode ??", "time": "6th November 2016, 09:26 AM", "postID": "post69484916", "replies": []}, {"text": "I find the camera lacking against my Nexus 6P, I don't get that good pix with my 10 at all. Often blurry and bad pics indoors without flash on. Otherwize I find that the 10 got better battery life atleast", "time": "14th November 2016, 09:33 PM", "postID": "post69622215", "replies": []}, {"text": "The F1.8 aperture is fast and the OIS works well in low light. And as it's only 12MP taking and storing photos is quick. Overall picture quality is good but not standout.", "time": "20th January 2017, 08:29 AM", "postID": "post70638793", "replies": []}, {"text": "its pretty respectable", "time": "6th February 2017, 09:32 PM", "postID": "post70910173", "replies": []}, {"text": "for me is the best camera https://www.flickr.com/photos/maik_r...57667953569555", "time": "8th February 2017, 03:34 AM", "postID": "post70929446", "replies": []}, {"text": "Slow sutter speed image sucks compare to the s7 edge.\neven though it's support upto 16sec.", "time": "22nd February 2017, 03:34 PM", "postID": "post71143410", "replies": []}, {"text": "@sagor1\n\nI do not think so, htc 10 is better.\n\n\n2017-02-19 02:29 by Maik Reifschneider, auf Flickr", "time": "22nd February 2017, 03:50 PM", "postID": "post71143613", "replies": [{"text": "http://imgur.com/6ofjpd1\r\nHtc 10 8sec shutter speed.\nhttp://imgur.com/sqsxlQd\r\nAgain Htc 10 now with 16sec shutter speed 100iso other thing is set to auto.\nhttp://imgur.com/20U107u\r\nS7 edge shutter speed 10sec iso 50 & other thing set to auto.", "time": "23rd February 2017, 06:43 PM", "postID": "post71160389", "replies": []}]}, {"text": "@sagor1\n\nhtc recognize much more light, the right setting is needed :P\n\n---------- Post added at 19:48 ---------- Previous post was at 19:47 ----------\n\nHTC 10 - Pano\n\n\n2017-02-23 17:37 by Maik Reifschneider, auf Flickr", "time": "23rd February 2017, 06:48 PM", "postID": "post71160439", "replies": [{"text": "everything is set to auto except shutter speed & iso.\r\ns7 edge image looks more pleasant to me.\r\nIt would be better if htc camera can set iso to 50", "time": "24th February 2017, 01:46 PM", "postID": "post71170767", "replies": []}, {"text": "May I ask: Did u edit the images externally? Snapseed, RAW to Photoshop, Lightroom?", "time": "3rd March 2017, 12:49 AM", "postID": "post71260604", "replies": []}]}, {"text": "i have camera mod and can set ISO68 - ISO52939 and shutter speed 1/8000 - 30 minutes.\n\r\ni have more shutter speed steps e.g. 1sec, 1,5sec, 2sec, etc.\n\r\nthe right setting looks the same result", "time": "24th February 2017, 01:51 PM", "postID": "post71170829", "replies": []}, {"text": "@nex0rz\n\nyes, photoshop express (PSX) and other tools.\n\nsingle pic = RAW > PSX > SKRWT\npano         = RAW > PSX > Bimostitch\n\nif you have a pink dot in the right corner, use hsl editor in photo director or photoshop fix (after psx).\n\nsnapseed is not bad, but psx is much better (my opinion).\n\nPhotoshop Express: https://play.google.com/store/apps/d...adobe.psmobile\nPhotoshop Fix: https://play.google.com/store/apps/d...bephotoshopfix\nPhoto Director: https://play.google.com/store/apps/d....photodirector\nBimostitch: https://play.google.com/store/apps/d...ion.Bimostitch\nSKRWT: https://play.google.com/store/apps/d...ed.skrwt.skrwt", "time": "3rd March 2017, 07:52 AM", "postID": "post71263471", "replies": []}, {"text": "I am usimg HDR auto and take burst photos. Anyone know how to combine them to be 1 beautiful photo?", "time": "8th April 2017, 09:30 AM", "postID": "post71774824", "replies": []}, {"text": "@mrsyamsul\n\n\nIMAG0236_SR_TuT by Maik Reifschneider, auf Flickr", "time": "8th April 2017, 09:35 AM", "postID": "post71774872", "replies": [{"text": "Thank you your reply. I assume that from a pc. can advise if can do it immediately after capture from HTC 10 cam", "time": "9th April 2017, 05:16 AM", "postID": "post71785280", "replies": []}]}, {"text": "@mrsyamsul\n\nPhoto mate r3 can stack photos, but PC is much better", "time": "9th April 2017, 10:17 AM", "postID": "post71787582", "replies": []}, {"text": "@drago10029\n\ni do edit all my pics, using Lightroom and Photoshop Express for Android", "time": "29th April 2017, 03:14 AM", "postID": "post72083922", "replies": []}, {"text": "@knobbyhtccruise\n\nmod is brocken since latest updates, no longer working\n\nedit: search in this thread for long exposure: https://forum.xda-developers.com/htc...hread-t3358858", "time": "11th March 2018, 02:03 PM", "postID": "post75850035", "replies": []}]}, {"title": "Video quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/htc-10/review/video-quality-t3361285", "https://forum.xda-developers.com/htc-10/review/video-quality-t3361285/page2"], "threads": [{"text": "We don't have 60fps recording. I hope HTC will include it in future updates...", "time": "15th June 2016, 08:42 AM", "postID": "post67325079", "replies": []}, {"text": "I've tested two HTC 10 - in both cases, videos are choppy, especially during horizontal movement, and high-contrast scenes. I was even sure, that my HTC 10 is broken somehow, but then I get another one, and it works exactly the same. Here you can check it out: https://www.youtube.com/watch?v=-FZSbiOqJEA I'm very disappointed.", "time": "16th June 2016, 11:19 PM", "postID": "post67352351", "replies": [{"text": "yup, same exact issue I am dealing with..very disapppointed", "time": "18th June 2016, 05:02 AM", "postID": "post67370360", "replies": []}, {"text": "this also happens to me but only in full hd mode.4k works fine.", "time": "1st January 2017, 09:17 PM", "postID": "post70350911", "replies": []}]}, {"text": "I have exactly the same choppy video issue and I thought it was because of the 200gb micro SD CARD I formatted as adoptable storage.  I removed the sd card and shot some videos.Same issue. I checked another phone and it had the same issue again. I don't know if there is a work around solution, but I seriously hope its just software and can be fixed in an update.", "time": "29th June 2016, 12:38 AM", "postID": "post67525201", "replies": []}, {"text": "I Love the Soundquality of the Videos! You can go to concerts or Partys first Row and still hear everything on the video.\n\nhttps://youtu.be/G9EPesuG12Q", "time": "11th August 2016, 12:51 PM", "postID": "post68139198", "replies": []}, {"text": "My cam is not choppy. So must been a software update if you all had this problem..\nBut at least it's good now", "time": "11th August 2016, 08:46 PM", "postID": "post68145628", "replies": []}, {"text": "Video on HTC 10 is a disgrace. It has video stabilisation like iPhone 4. It is so bad that I take iPhone 6 whenever I want to make video. Completely unusable option on this phone. My friends S7 Edge videos makes my phone look like junk.", "time": "2nd January 2017, 04:24 PM", "postID": "post70361316", "replies": []}, {"text": "2160p recording has low contrast and a noticeable amount of noise around the edges. I'm happy with it but I've seen better.", "time": "18th January 2017, 09:20 AM", "postID": "post70607141", "replies": []}, {"text": "HTC 10 is very very good in extremely low light, with modded camera library and Freedcam.", "time": "18th January 2017, 04:42 PM", "postID": "post70613432", "replies": []}, {"text": "https://youtu.be/n2xrFRKWB6U \r\nFHD| Hi-Res Audio\n\n\nhttps://youtu.be/n2xrFRKWB6U?autoplay=0&origin=https://forum.xda-developers.com\"\r\n  frameborder=\"0\">", "time": "7th August 2017, 07:17 AM", "postID": "post73314178", "replies": []}]}, {"title": "Selfie quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/htc-10/review/selfie-quality-t3361286", "https://forum.xda-developers.com/htc-10/review/selfie-quality-t3361286/page2"], "threads": [{"text": "Pretty bad", "time": "6th June 2016, 08:08 PM", "postID": "post67199656", "replies": []}, {"text": "I think it is excellent, sharp and clear!", "time": "6th June 2016, 11:52 PM", "postID": "post67202094", "replies": []}, {"text": "yes its bad, coming from a note 5.", "time": "7th June 2016, 06:39 PM", "postID": "post67213886", "replies": []}, {"text": "its really good from m9.  And love how there is a \"flash\" for selfies on the 10.", "time": "7th June 2016, 07:04 PM", "postID": "post67214259", "replies": []}, {"text": "I think is great too, coming from a Galaxy S4", "time": "7th June 2016, 09:44 PM", "postID": "post67216295", "replies": []}, {"text": "I have the m9 and my sister has the 10 and I have to say the m9 is way better in low light and looks better picture wise but in video the 10 is better", "time": "8th June 2016, 02:49 PM", "postID": "post67226135", "replies": []}, {"text": "not use the front camera", "time": "8th June 2016, 05:12 PM", "postID": "post67228150", "replies": []}, {"text": "Does the front camera autofocus?", "time": "23rd June 2016, 02:10 PM", "postID": "post67450270", "replies": [{"text": "I have experienced a lot of issues with my front facing camera in Snapchat regarding focusing", "time": "25th June 2016, 06:41 AM", "postID": "post67473610", "replies": [{"text": "I have noticed this also. This happens because you cant touch to focus in snapchat. The stock camera app can take amazing from facing photos when you can touch to focus. The auto focus doesnt kick in like it probably should =/", "time": "25th June 2016, 12:48 PM", "postID": "post67476860", "replies": []}]}]}, {"text": "I think most of phone now including HTC 10, still have focusing issue in front camera.. hope they fix that", "time": "25th June 2016, 01:43 PM", "postID": "post67477420", "replies": []}, {"text": "not bad, but not LG, Sony or Samsung quality.", "time": "27th June 2016, 04:43 PM", "postID": "post67505055", "replies": []}, {"text": "I have the problem that the front facing cam only delivers sharp pictures while holding the cam no too far away. This even happens with the HTC camera app. When I hold my arm fully streched, the image is never 100% sharp. The view finder shows a sharp picture but the result is blurred. I really start to worry that my front facing lens might be broken. But if this was correct, the preview was also blurred, right?", "time": "6th July 2016, 11:40 AM", "postID": "post67626491", "replies": [{"text": "This was officially fixed with 1.90.x.", "time": "20th August 2016, 07:07 PM", "postID": "post68280977", "replies": []}]}, {"text": "Was fiddling with devcheck, and stumbled onto the tabs for front camera. It seems to me that the front camera is RAW capable. Can anybody confirm or deny this claim? If so, I would love some app recommendations that can squeeze out every ounce of RAW goodness from it. Thank you all in advance!", "time": "4th January 2017, 05:38 PM", "postID": "post70392894", "replies": []}, {"text": "Hello yeah \n\nI come from the m7 and I'm delighted of course  by the quality.\r\nI have a comparison had an s5 and s7 edge in comparison and grade videos made from a clear winner.\n\r\nMy favorite is, although I am also a fan of the s7, the m10.\n\r\nUnfortunately, I was disappointed somewhat in poorer light conditions due to my high expectations.\n\r\nOverall I am but more than happy with the cam", "time": "19th February 2017, 06:47 PM", "postID": "post71101518", "replies": []}, {"text": "Absolutely terrible. So bad, in fact that its' one of the things that I'm jumping ship to another brand next time. They advertised this as having OIS and being special, but the focus range is whack because they went with a Samsung sensor that was having issues and the post processing is WAAAAAAAAAAAAY too aggressive. I find mid range and high end phones from like 3 years ago are better looking because they are actually in focus and don't look strangely digital.", "time": "2nd January 2018, 09:27 PM", "postID": "post75053218", "replies": []}]}, {"title": "Time to take picture (camera launch speed)", "rating": 4.5, "links": ["https://forum.xda-developers.com/htc-10/review/time-to-picture-camera-launch-speed-t3361287"], "threads": []}, {"title": "Software (ease of use, features, etc)", "rating": 4.5, "links": ["https://forum.xda-developers.com/htc-10/review/software-ease-features-t3361288"], "threads": [{"text": "I sometimes have trouble auto-focusing on objects less than 1 foot away.", "time": "26th May 2016, 04:25 PM", "postID": "post67036742", "replies": []}]}, {"title": "Charging speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/htc-10/review/charging-speed-t3361289", "https://forum.xda-developers.com/htc-10/review/charging-speed-t3361289/page2", "https://forum.xda-developers.com/htc-10/review/charging-speed-t3361289/page3", "https://forum.xda-developers.com/htc-10/review/charging-speed-t3361289/page4"], "threads": [{"text": "I don't know but I am not getting so called \"15 minutes to 50%\" charging speed at all with the provided charger and cable, although it's showing \"quick charger is connected\".", "time": "3rd June 2016, 11:50 PM", "postID": "post67159443", "replies": [{"text": "I thought it was 30 minutes for 50% - http://www.htc.com/us/smartphones/htc-10/\n\r\nI don't necessarily get that either per se. I remember getting 50% in 35 minutes tho. http://www.androidcentral.com/qualco...-80-35-minutes\n\r\nI got 44 in 30 minutes. The thing that annoys me is Qualcomm Quick Charge 3.0 is supposed to give you 80% in 35 minutes, but HTC claims to only give you 50%, which is no faster than Qualcomm Quick Charge 2.0, which in reality is even slow than that. Qualcomm Quick Charge 2.0 promised 60% in 30 minutes. So it's like what's the point of having a new technology that isn't better than the previous iteration....", "time": "4th June 2016, 09:34 PM", "postID": "post67172244", "replies": [{"text": "Funny thing is I'm getting less heat and faster total charge time off my QC 2.0 charger. Either of my HTC QC 3.0 chargers are slower and get the phone much hotter (I'm assuming due to the higher fluctuating voltage 3.0 offers).\n\r\nOn 3 charge tests the 2.0 beats the 3.0 charger by a good 10 minutes.", "time": "5th June 2016, 03:13 AM", "postID": "post67174833", "replies": [{"text": "I haven't really had a heat issue while charging. But I'm going to try my Anker Powerport +1 Wall Charge (Qualcomm Quick Charge 2.0, also with Voltageboost and PowerIQ), though I've been using that one to charge my Nextbit Robin. I'll see if that makes a difference. I like that HTC including a Quick Charger, but I don't necessarily think it's the best compared to other competitors.", "time": "5th June 2016, 05:08 AM", "postID": "post67175532", "replies": []}]}, {"text": "Good point....so I'm not alone", "time": "5th June 2016, 11:09 AM", "postID": "post67178534", "replies": []}]}]}, {"text": "deleted...found appropriate thread.", "time": "4th June 2016, 10:06 PM", "postID": "post67172529", "replies": []}, {"text": "My HTC 10 charger stop working.. It doesn't charger my HTC 10 anymore. Anyone else faceing such kind of issue? It suddenly stops working during charging..", "time": "5th June 2016, 11:36 PM", "postID": "post67187355", "replies": [{"text": "Yes I saw that my charger is incapable of charging my device as it is too slow. It  happened for a few minutes. Then I pulled out n in the cable for a few times and it corrected itself don't know how. I am scared. I had great faith on HTC hardwares from my past experience.\n\nEdited: \"charger is not compatible.....\" was a custom kernel issue.", "time": "6th June 2016, 07:04 PM", "postID": "post67198851", "replies": []}]}, {"text": "I get about 38 minutes to full from 20%\nGets a little warm, but not any hotter than when I have snapchat open.", "time": "6th June 2016, 04:26 AM", "postID": "post67189479", "replies": []}, {"text": "Did a test:\r\nQC 3.0 (Charger from the box): +45% in 30 minutes\r\nQC 2.0 (Moto Turbocharger): +37% in 30 minutes", "time": "6th June 2016, 09:07 PM", "postID": "post67200390", "replies": []}, {"text": "hey guys , i bought 10 today \r\ni have a question about charging with power banks , its ok if charging with my Xiaomi Power bank ?", "time": "11th June 2016, 09:17 PM", "postID": "post67275799", "replies": []}, {"text": "I don't see why not. It will charge slower than with a QC 2.0/3.0, but it should work fine. I have a lot of power banks in my backpack and I use them all the time with any phone I have on me...", "time": "12th June 2016, 01:40 AM", "postID": "post67277961", "replies": []}, {"text": "Fast! 2.5A is fast!", "time": "15th September 2016, 01:42 AM", "postID": "post68693027", "replies": []}, {"text": "Mines been plenty quick for me, but its the first phone I've had where I've had the quick charge charger too. I understand the m8 had it though, which was my previous phone.\n\r\nHowever, I'm grateful that it isnt crazy fast. The last thing the world needs is another exploding phone lol", "time": "17th September 2016, 10:54 PM", "postID": "post68737862", "replies": []}, {"text": "my phone stop charging rapidly", "time": "19th September 2016, 06:30 AM", "postID": "post68756535", "replies": [{"text": "If you have a ROM with a custom Kernel, check there first. The fast charge is a setting that can be turned on or off.", "time": "19th September 2016, 02:21 PM", "postID": "post68761385", "replies": []}]}, {"text": "from 0~100%, when using the supply QC 3.0 charger it need about 1h35mins, with my anker 5 port 40w charger, it charger at 5V 2A at begining and slowly down to about 1.4a after 70~80%, around 1a when over 90%, total time need is about 2h.\nI am using a usb voltage meter to check the voltage/amp.", "time": "20th September 2016, 02:43 AM", "postID": "post68770410", "replies": []}, {"text": "Hi, i got a htc m10 from second hand, it came with a original htc charger and cable. But charger output is 1.5amps. And i dont feel like \"super fast\" Thats the real amp for the htc 10 chsrger?", "time": "21st September 2016, 07:27 AM", "postID": "post68788596", "replies": [{"text": "HTC 10 original charger use QC 3.0, which have 3 different stage:\r\n5V/2.5A, 9V/1.7A, 12V/1.25A\r\nthe voltage will be a variable between 5V~12V, amp will  according to those differnet stage, \r\nit will charge from 0~100% in about 1hr 35min\n\r\nThe HTC 10 original charger had quick charge 3.0 logo, and details output info.", "time": "21st September 2016, 07:35 AM", "postID": "post68788663", "replies": []}]}, {"text": "i got a used htc 10 which had 3rd party charger and cable. i used a aukey qc 3.0 charger but it doesn't charge rapidly. will using an original htc cable enable fast charging with aukey's qc 3.0 charger? do i have to get htc's charger too? its quite expensive.", "time": "4th October 2016, 10:37 AM", "postID": "post68975472", "replies": [{"text": "I use the original charger and most of the time in 30 minutes i have 50% of the battery full.", "time": "6th October 2016, 02:21 PM", "postID": "post69007026", "replies": []}]}, {"text": "1 days charge in 30 minutes? Not for me, probably takes around 3 times that. I don't really care though, if I'm running low I give it 10 minutes and get more than enough to get through the day. Stock 3.0 Aukey charger.", "time": "27th January 2017, 07:40 PM", "postID": "post70759970", "replies": []}, {"text": "its just the usual fast chtge speed", "time": "6th February 2017, 09:34 PM", "postID": "post70910191", "replies": []}, {"text": "Is there a message to show status or something like that? I bought a old htc 10 with a nomal slow charge. I've just bought a original HTC (Qualcom 3.0) quick charge last night. But I don't know how to recognize that, my phone is using quick charge or slow charge", "time": "26th February 2018, 02:14 AM", "postID": "post75696047", "replies": [{"text": "Usually you see an message on lock screen \"charging rapidly\"", "time": "26th February 2018, 08:30 PM", "postID": "post75706205", "replies": []}]}, {"text": "Check https://play.google.com/store/apps/d...mbosdev.ampere\nYou should get something around 2000-2800mA with QuickCharge IF you're below 40% Battery and under 37°C Battery Temperature", "time": "26th February 2018, 11:21 PM", "postID": "post75707635", "replies": []}]}, {"title": "Screen on time", "rating": 3.5, "links": ["https://forum.xda-developers.com/htc-10/review/screen-time-t3361290", "https://forum.xda-developers.com/htc-10/review/screen-time-t3361290/page2", "https://forum.xda-developers.com/htc-10/review/screen-time-t3361290/page3", "https://forum.xda-developers.com/htc-10/review/screen-time-t3361290/page22"], "threads": [{"text": "I like this idea and I'm surprised there are no comments yet! Indoors usage I'm getting around 7 hours screen on time if I skip gaming, could get more if I didn't visit my GF place cause the reception it's crap over there, but I'm pretty happy with the current result", "time": "21st May 2016, 10:21 PM", "postID": "post66963767", "replies": []}, {"text": "Wtf! I'm getting under 3 and I'm a light user. I just browse the web, open yahoo mail and do a little raiding in COC and that's it. What is your guys secret?", "time": "23rd May 2016, 07:53 AM", "postID": "post66982847", "replies": [{"text": "Whats your brightness? Are you on data or Wi-Fi? Is this 3 hrs of sot with over a day of usage? Are you listening to music as you use phone? Do you have an Android Wear device? Way too many variables. It is better than your previous device based on your usage.\n\nP.S. it's always best to compare only with yourself using other devices as nobody uses a phone with the same exact settings and each little configuration adds up to such disparity. Ex: Once had my S4 die in less than 3 hours with straight benchmarking and the same device have over 12 hours of sot and like 5 days off the charger.", "time": "24th May 2016, 03:22 PM", "postID": "post67004554", "replies": []}]}, {"text": "Getting constantly around 5 with stock settings, social networks, some gaming and camera.", "time": "23rd May 2016, 02:55 PM", "postID": "post66988017", "replies": []}, {"text": "I get about 4 to 5. But it's also over 24-32 hours total, and a decent amount of music streaming over bluetooth. So if I instead measured over 16 to 18 hours instead, and didn't stream over bluetooth so much, I bet I could 6+.", "time": "23rd May 2016, 03:48 PM", "postID": "post66988815", "replies": []}, {"text": "Mostly around 5 hours SoT.", "time": "23rd May 2016, 03:54 PM", "postID": "post66988903", "replies": []}, {"text": "I have been getting anywhere from 3 to 5 hours with mixed usage. I believe that the phone is still trying to balance though, I have only had it for like 4 days. Hopefully I can get to 5.5-6 after the system gets into a groove", "time": "23rd May 2016, 09:01 PM", "postID": "post66993517", "replies": []}, {"text": "Also there's 2 types of panel, could be useful to include which panel you have as I wonder if that might cause different results. My screen time is pretty rubbish, it's always the highest thing using the battery. I think I get around 3-5 hours using auto screen set with a max around 1/2 which is worse than my old M8 and is really annoying me as I struggle to get through the day.\n\nI've got the Sharp panel.\n\nhttp://forum.xda-developers.com/htc-...riant-t3370972", "time": "25th May 2016, 04:15 PM", "postID": "post67021162", "replies": []}, {"text": "Only problem with comparing SOT is different people have different apps and habits,  it's impossible to categorize everyone into light medium and heavy usage groups.\n\n   Personally I usually get around 3 -  5 hours SOT and I consider myself a light user and I am trying to get the most from my phone.  \n\nItd be good if there was some kind of comparing table where different apps and their footprints were taken into consideration.", "time": "25th May 2016, 04:28 PM", "postID": "post67021365", "replies": []}, {"text": "4 to 5 with middle brightness on automatic stock phone", "time": "25th May 2016, 10:22 PM", "postID": "post67026182", "replies": []}, {"text": "The phone is amazing!!! I'm using debloated stock Verizon firmware ( stock rom as well) rooted. I do use aggressive doze option in greenify app which is the only \" battery saving\" feature I have. \nI use my phone quite a lot for making calls, snapchat and little bit of gaming ( world of tanks blitz for about 30 min, amazing game by the way).  I couldn't be happier with the battery like and overall performance of the phone. HTC has made a good comeback!!!", "time": "8th June 2016, 04:24 AM", "postID": "post67219764", "replies": []}, {"text": "4 middle brightness on automatic", "time": "8th June 2016, 06:17 PM", "postID": "post67229144", "replies": []}, {"text": "Anyone with non-stock ROMs and Kernels getting better?", "time": "8th June 2016, 09:18 PM", "postID": "post67231711", "replies": []}, {"text": "today was my first full day with the 10 and i only got a little less than 2 1/2 hours of SoT (just plugged it in when it hit 10%)\ni was connected to wifi almost all day, and streaming music for about an hour.\n\nalso i noticed that it lost about 10%/hr while just idling. i unplugged at around 9am and it was down to 85% at 1030 with literally zero usage.\n\ndefinitely super disappointed with the battery life so far, but i'm sure it will improve over the next few days.\n\nalso this is the TMO US version.", "time": "9th June 2016, 12:39 AM", "postID": "post67233887", "replies": []}, {"text": "My experience pretty awesome so far", "time": "9th June 2016, 01:39 PM", "postID": "post67240860", "replies": []}, {"text": "Loving the battery on the HTC 10. Coming from a Galaxy S6 that could barely get 2 hours SoT this phone is a treat.", "time": "10th June 2016, 03:20 AM", "postID": "post67250586", "replies": []}, {"text": "As long as you keep wifi off, you can get 6+ hours of medium use across 1-1.5 days out of this phone. I got 4hrs+ SOT over a 4 day period with light usage. Only condition is wifi can't be on. With wifi ON, the phone won't last a day of light/medium use.", "time": "14th June 2016, 09:11 PM", "postID": "post67319063", "replies": [{"text": "Exactly that! And I still have 25% left!!!!!\nBy the way,i use stock Verizon firmware/ from. Rooted.  xposed installed. Running greenify aggressive doze feature.", "time": "15th June 2016, 12:38 AM", "postID": "post67321208", "replies": []}, {"text": "Except you can look at my post right above yours and see that my WiFi was on the entire time. Not all of us are having this WiFi issue", "time": "15th June 2016, 01:16 AM", "postID": "post67321518", "replies": [{"text": "May be you can get even better. Here is the deal: head over to http://forum.xda-developers.com/htc-...ng-to-t3392562 and run those commands for me please.", "time": "15th June 2016, 01:42 AM", "postID": "post67321728", "replies": []}]}]}, {"text": "I've had the US unlocked 10 for a week now, and seeing great battery results even with WiFi enabled. I'm not seeing any kind of WiFi drain at all. Easily hitting 6 hours of screen on time before power save mode comes in at 15%. \n\nA lot of Clash of Clans, Facebook/Messenger, texts, XDA, browsing in Chrome, Xbox One app, YouTube and three email accounts being synced every 30 minutes. Brightness is at default (middle) with auto brightness on. Location set as battery saving the large majority of the time. And some Bluetooth music playback in my car. \n\nI'll post some screenshots shortly, but currently sitting at 74% with just over 2 and half hours of SoT. And, yes, I'm using the device when the screen is on, not just leaving it on while doing nothing.", "time": "15th June 2016, 07:51 AM", "postID": "post67324607", "replies": [{"text": "What firmware are you on getting these fabulous screen on times?", "time": "25th June 2016, 08:50 PM", "postID": "post67482077", "replies": [{"text": "I was on 1.53.617 back when I posted that. I'm on 1.80.617 now and seeing similar results.", "time": "26th June 2016, 01:03 AM", "postID": "post67484050", "replies": []}]}]}, {"text": "Getting about 5 hours. Seems like a ridiculous amount of time to spend on my phone. Wish it lasted 12 hours", "time": "15th June 2016, 09:44 PM", "postID": "post67335223", "replies": []}, {"text": "Settings and apps used as my previous post stated. No WiFi drain at all. Work from home as a freelance web developer.", "time": "16th June 2016, 09:43 PM", "postID": "post67351372", "replies": [{"text": "What display panel do you guys have Tianma?\n\r\nI'm starting to wonder if Sharp is less efficent in comparison.", "time": "28th June 2016, 07:37 PM", "postID": "post67522041", "replies": []}]}, {"text": "14+ hrs usage...5 hrs screen on time at 30%... on WiFi", "time": "18th June 2016, 10:26 PM", "postID": "post67381743", "replies": []}, {"text": "I've been using mine for 10 days now , and my Screen on Time is around 3:30 to 5:30 depending on how much Gaming I do during the Day , and not forget to mention , I'm a pretty heavy user with a lot of Gaming , Taking pics , web browsing , Social networking and listening to music . Good job HTC", "time": "26th June 2016, 01:32 AM", "postID": "post67484239", "replies": []}, {"text": "Light user. \n2 days 7 hours up time,  nearly 8 hours SOT.", "time": "26th June 2016, 06:10 AM", "postID": "post67485927", "replies": [{"text": "That's woderful. I wish i could get the same. \n\r\ncould you share your light usage details please ? ( breifly ofcourse )", "time": "28th June 2016, 06:22 PM", "postID": "post67521114", "replies": []}]}, {"text": "leedroid oreo v5\r\ngreat rom", "time": "11th February 2018, 09:42 AM", "postID": "post75523867", "replies": []}, {"text": "After a while with stock Oreo \r\nIt is really good", "time": "18th February 2018, 06:27 AM", "postID": "post75608462", "replies": [{"text": "Yeah, this is looking good. Almost 5hrs SOT.", "time": "24th February 2018, 09:59 PM", "postID": "post75683067", "replies": []}]}, {"text": "This phone's battery life is one of the worst I have ever experienced in a smartphone. I have to charge it at least 3 times a day.", "time": "15th March 2018, 06:21 PM", "postID": "post75900929", "replies": [{"text": "It depends of the use you do. For example, when I make a normal use of the phone (browsing, whatsapp, xda, listening music...) I can get around 4 hours of SoT, sometimes 5. \n\nFor most users this will be ok. In the days I heavily use the phone I have to charge it two or three times.\n\nIt's not the best battery life phone, but it isn't the worst neither.", "time": "16th March 2018, 12:32 AM", "postID": "post75904105", "replies": []}]}, {"text": "My standby battery drain (plain mode drain arround 10 - 20 percent normally) is also very high on Oreo i think.  This was light use duing last day on latest LeeDroid build.", "time": "2nd April 2018, 05:50 AM", "postID": "post76094415", "replies": []}]}, {"title": "Standby drain", "rating": 4.0, "links": ["https://forum.xda-developers.com/htc-10/review/standby-drain-t3361291", "https://forum.xda-developers.com/htc-10/review/standby-drain-t3361291/page2", "https://forum.xda-developers.com/htc-10/review/standby-drain-t3361291/page3", "https://forum.xda-developers.com/htc-10/review/standby-drain-t3361291/page13"], "threads": [{"text": "I had a fully charged 10 with viper with elemental x kernel off the charger all night. I have lots of syncing accounts and only lost a couple percentages. better than I was thinking it was going to be. I also used it all day long streaming music and other normal usage and around 12am that night still has 30% left. after things settle down battery life gets way better, it seems the first day or 2 after setting everything up its pretty bad.", "time": "25th May 2016, 05:02 PM", "postID": "post67021865", "replies": []}, {"text": "I would say its rather 1% each our per night", "time": "30th May 2016, 11:05 AM", "postID": "post67090239", "replies": []}, {"text": "whatttt, i leave wifi and 4g on and i almost lose 1% battery per hour. why my phone sucks😭😭😭", "time": "31st May 2016, 09:41 AM", "postID": "post67103738", "replies": [{"text": "It won't be 4g and wifi.  It'll be an app or apps.  Anything with a large footprint which can take advantage of wifi will use it.  For example,  email,  Facebook etc.  Anything like that,  wifi alone won't use very much at all.\n\n---------- Post added at 11:13 AM ---------- Previous post was at 11:11 AM ----------\n\nAlso repeated the process last night,  last 1% good times,  wifi and 4g both on and location.", "time": "1st June 2016, 11:13 AM", "postID": "post67119508", "replies": []}]}, {"text": "I had this happening until I disabled Google Now", "time": "31st May 2016, 06:03 PM", "postID": "post67109847", "replies": []}, {"text": "It's pretty confusing. When the phone battery is at higher levels, it drains much faster. For example, I recharged the battery at 7 pm yesterday and used it for 6 hours (here and there and it fot to 15%. Then i slept through the night and only 3 or 4% battery power was used. Wifi was on", "time": "1st June 2016, 08:02 AM", "postID": "post67117638", "replies": []}, {"text": "stock rom, 2%-3% drop.", "time": "2nd June 2016, 09:29 AM", "postID": "post67133595", "replies": []}, {"text": "stock \ndata and wifi is off\n2%", "time": "2nd June 2016, 10:00 AM", "postID": "post67133902", "replies": []}, {"text": "per hour or per what?", "time": "2nd June 2016, 03:22 PM", "postID": "post67137784", "replies": [{"text": "I think they mean overnight", "time": "2nd June 2016, 04:09 PM", "postID": "post67138426", "replies": []}]}, {"text": "0.6%/hr (phone starts at 78%).\n\r\nI just turn off the screen and set the phone down as I sleep.  If the phone had been plugged in then it might only drop 1% in the 6-7 hours I sleep but the gauge isn't accurate from 90-100%", "time": "2nd June 2016, 11:55 PM", "postID": "post67144249", "replies": []}, {"text": "What's your config when you are getting such extremely good values? \n\nWysłane z mojego SM-T815 przy użyciu Tapatalka", "time": "7th June 2016, 04:54 PM", "postID": "post67212360", "replies": []}, {"text": "I seem to be losing 40-50% on standby overnight.  Something is very wrong.  Any suggestions appreciated.  Deep cycling the battery right now.  Venom ROM.", "time": "9th June 2016, 06:27 PM", "postID": "post67245059", "replies": []}, {"text": "Hi, \nLast night my battery went from 69% to 49% over 6 houres.. With everything on. Not bluetooth. \n\nThere where no apps that showed large use, so I was confused. After reading  about wifi drain issues on the 10, I turned on flight mode as I went to work for 8 houres (phone was at home). It lost 3-4%.. That's a huge difference from last night. Also the WiFi bar isn't showing anymore in battery stats. It also seems that it uses less battery when being used.. Before it could drop 1% every 2-3 minute, now it seems better. \n\nSo for me it seems to be some kind of trouble with wifi. Will charge to 100% and check over night only on 4g.\n\nFredrik", "time": "9th June 2016, 09:42 PM", "postID": "post67247713", "replies": [{"text": "Everything on?  So an update could have ran and you wouldn't have known.. A lot of apps take advantage of wifi.. Turn it off. \n\n4g, location on.. 1%  8 hours overnight.", "time": "9th June 2016, 10:37 PM", "postID": "post67248384", "replies": []}]}, {"text": "I was losing very little battery overnight until the last update from Verizon. Now my phone is \"awake\" overnight even when it's not touched and loses battery rapidly. I also has to uninstall apps that previously didn't cause problems, like Netflix and DirecTV, because they were tearing through battery even when not in use. Any thoughts on what the problem could be?", "time": "10th June 2016, 03:02 PM", "postID": "post67257366", "replies": []}, {"text": "Last night I lost 15% in 7 hours.  I think it is time to turn off wi-fi while I sleep so my phone can get some rest as well.\n\r\nAnybody know if 1.55.x improves this?", "time": "10th June 2016, 05:18 PM", "postID": "post67259220", "replies": []}, {"text": "Before sleep. \nTurn off ambient display. \nSwitch off wifi\nSwitch off location. \nSwitch off NFC \nKill all apps. \nAvoid apps that are intrusive,  ie: push notifications constantly,  and take over the notification bar.  Ads etc  \nLower the amount of accounts you have syncing.  \nAvoid mail apps that do what your native email app can do. \nEg: yahoo mail vs mail app.\nSwitch off double tap to wake and all other gestures. \nSwitch off ok Google. \nSwitch off Google location service. \n\nIf rooted. \n---------\n\nTry amplify and greenify. \n\nNot always going to get great results,  some swear by them,  personally I don't use them, I use auto starts,  great app for killing apps start up protocols. \n\nOther than that there isn't a great deal more you can do.", "time": "10th June 2016, 06:03 PM", "postID": "post67259798", "replies": []}, {"text": "Noticed huge battery drain when I'm on 5 Ghz wifi on my home network. I running 2,4 and 5 with the same ssid on the wifi router. I turned off the 5 Ghz on the phone, forcing it to use only 2,4 Ghz. Now the battery use is back to normal compared to my M9 (which is switching between my networks with no abnormal battery drain) Someone with similar problem?", "time": "11th June 2016, 07:47 AM", "postID": "post67266868", "replies": []}, {"text": "Last night I went to bed with 27% battery, woke up with 27% battery.. 😄 \n\nOn 4g, sync and all that enabled. Cleared reasently apps though..", "time": "11th June 2016, 08:46 AM", "postID": "post67267364", "replies": []}, {"text": "Those that are complaining or doing all this stuff to lessen battery drain overnight? What did you do with the charger? Who doesn't charge their phone while you are sleeping?", "time": "11th June 2016, 02:10 PM", "postID": "post67270674", "replies": []}, {"text": "For me seems that HTC mirrorlink process sucks battery dramatically (only when you connect phone to compatible car unit)\n\nWysłane z mojego SM-T815 przy użyciu Tapatalka", "time": "11th June 2016, 04:17 PM", "postID": "post67272241", "replies": []}, {"text": "2 nights ago had wifi on woke up 15% drain. Last night wifi off 2% drain. Wifi is set to never stay awake while screen off", "time": "12th June 2016, 12:40 AM", "postID": "post67277576", "replies": []}, {"text": "I was losing between 20 and 30% overnight (10pm to 6am) previously. I changed settings to turn off wifi during sleep unless plugged in and enabled doze for GMS. Now I'm at about .8%/hr, so quite a bit better.", "time": "26th September 2017, 08:30 PM", "postID": "post73943736", "replies": []}, {"text": "You guys should try a Custom ROM once...\nI'm currently running PureFusionOS.\n\n0.3%/H overnight.", "time": "28th September 2017, 08:57 AM", "postID": "post73961296", "replies": [{"text": "This is probably a dumb question...but is S-OFF absolutely necessary for both Sense and AOSP ROMs? And if not, is it worth the investment (sunshine or xtc2clip)?", "time": "30th September 2017, 05:18 AM", "postID": "post73982506", "replies": [{"text": "No its not neessary. \nYes its worth it if you plan on changing more than just your ROM ie different firmwares, modified firmwares, downgrade RUU ect.", "time": "30th September 2017, 07:39 AM", "postID": "post73983314", "replies": []}]}]}, {"text": "I got my HTC 10 about 7 month ago and I was really happy with it until three or four days ago that I have no idea why my phone started to drain drastically even when I'm not using it at all.\r\nI'm not a heavy user, I have never even installed a game. \r\nI repeat, I was completely satisfied with the battery.\r\nMost of days I used it for 2 days and still having 10 % remaining.\r\nYesterday I reset factory the phone, and just installed less than 10 essential apps and I have restricted their access to network.\r\nLast night I fully charged it and shut everything off. No Wi-F,i no data, no nothing. Even I turned on the power saving mode. When I got up in the morning the battery percentage was 28% while my phone used to use less than 5% during nights.\r\nI checked battery usage details and the results were shocking:\r\nAndroid OS 55%\r\nAndroid system 24%\r\nPhone idle 11%\n\r\nOnly 1 app had used the battery and it was:\r\nTelegram 1%\n\r\nWhat should I do?\r\nThis change hasn't been gradually so I'd say \"okay my phone is used out and old! \"\r\nThis change \"just\" happened. I have no idea why.\r\nPlease someone give me some advice.", "time": "6th October 2017, 09:52 AM", "postID": "post74054397", "replies": []}, {"text": "7 months old, rooted and s-off. Sleeps like a baby...", "time": "20th October 2017, 05:57 AM", "postID": "post74226300", "replies": []}, {"text": "Oreo Standby seems pretty decent...\n\n\nDuration: 93h12m17.152s\n\nCode: \nAggregated Checkin Stats:\nMetric                           | Value                                          \nScreen Off Discharge Rate (%/hr) | 0.55  (Discharged: 51%)                        \nScreen On Discharge Rate (%/hr)  | 35.08  (Discharged: 28%)                       \nScreen On Time                   | 47m53.234s                                     \nScreen Off Uptime                | 1h43m12.078s                                   \nUserspace Wakelock Time          | 45m13.056s                                     \nSync Activity                    | 11m56.387s (328 times)                         \nJobScheduler Activity            | 19m27.995s (2073 times)                        \nApp Wakeup Alarms                | 1127 times                                     \nCPU Usage                        | 1h12m49.974s user time, 1h16m4.677s system time\nKernel Overhead Time             | 57m59.022s                                     \nKernel Wakelocks                 | 1h13m14.358s (168928 times)                    \nWakeup Reasons                   | 24m54.644s (4520 times)                        \nMobile KBs/hr                    | 0.00                                           \nWiFi KBs/hr                      | 0.00                                           \nTotal WiFi Scan Activity         | 3m35.175s (76 times)                           \nTotal WiFi Full Lock Activity    | 6m39.468s                                      \nMobile Active Time               | 1h19m37.584s                                   \nSignal Scanning Time             | 2.332s                                         \nFull Wakelock Time               | 42.132s                                        \nInteractive Time                 | 47m30.645s                                     \nPhone Call Time                  | 0                                              \nDevice Idle Mode Enabled Time    | 70h1m26.992s                                   \nDevice Idling Time               | 70h15m3.376s                                   \nTotal GPS Use                    | 0 (0 times)                                    \nWifi Power Usage                 | 0.00%/hr, 0.00% total                          \nWifi Transfer Time               | 0                                              \nWifi Idle Time                   | 0                                              \nBluetooth Power Usage            | 0.00%/hr, 0.00% total                          \nBluetooth Transfer Time          | 31.806s                                        \nBluetooth Idle Time              | 22.714s                                        \nCamera Use                       | 9.204s (1 times)                               \nFlashlight Time                  | 0 (0 times)                                    \nModem Transfer Time              | 0                                              \nModem Idle Time                  | 0", "time": "29th January 2018, 06:34 PM", "postID": "post75375563", "replies": []}]}, {"title": "Heavy use endurance", "rating": 3.0, "links": ["https://forum.xda-developers.com/htc-10/review/heavy-endurance-t3361292"], "threads": [{"text": "I play World of Tanks Blitz on my amazing HTC 10. I get about 4 + hours of gaming on battery which is outstanding! My HTC m9 would get about 3 hours under the same load of gaming, so would Nexus 6. As a result, phone lasts me all day and that is \"quietly brilliant\".", "time": "8th June 2016, 04:30 AM", "postID": "post67219803", "replies": [{"text": "[QUOTE=firedown_3;71459819]\n\n\nSantod's stock rom.", "time": "16th March 2017, 11:46 PM", "postID": "post71461374", "replies": [{"text": "[QUOTE=firedown_3;71519757]\n\n\nhttps://forum.xda-developers.com/ver...3529732/page29\n\nThis is for Verizon, but i use it on my US Unlocked. \n\nhttps://forum.xda-developers.com/ver...ocked-t3442969\n\nHere is a link to his other rom that I BELIEVE should work with other carriers.", "time": "25th March 2017, 06:03 PM", "postID": "post71585088", "replies": []}]}]}, {"text": "Was playing Dofus 3.30h in an afternoon, was incredible :30% battery left.", "time": "13th February 2017, 08:04 AM", "postID": "post71007886", "replies": []}, {"text": "I went to a zoo today. By car the ride there took about 2 hours whilst using the phone for Navigation. When i arrived at the zoo i was about 80 percent battery. At the zoo i took 622 Pictures. And a small video of a bird. When i went back in the car i had 30 Percent battery left. Then i put it to charge.\n\r\nThat is awesome i think. Especially since i had a person with me that had my old HTC One S with. And the battery of my old device was gone on the half way \n\r\nGreetings.", "time": "15th March 2017, 08:17 PM", "postID": "post71444822", "replies": []}, {"text": "[QUOTE=ivanov13;67219803]I play World of Tanks Blitz on my amazing HTC 10. I get about 4 + hours of gaming on battery which is outstanding! My HTC m9 would get about 3 hours under the same load of gaming, so would Nexus 6. As a result, phone lasts me all day and that is \"quietly brilliant\".\n\r\nHi\r\nWhat rom do you use ?", "time": "16th March 2017, 09:17 PM", "postID": "post71459819", "replies": [{"text": "[QUOTE=ivanov13;71461374]\n\r\nHi\r\nYou can sent for me ? Link santods stock rom \r\nThanks", "time": "21st March 2017, 05:48 AM", "postID": "post71519757", "replies": []}]}]}, {"title": "Light use endurance", "rating": 4.5, "links": ["https://forum.xda-developers.com/htc-10/review/light-endurance-t3361293", "https://forum.xda-developers.com/htc-10/review/light-endurance-t3361293/page2"], "threads": [{"text": "I get extremely good battery with light usage.", "time": "6th June 2016, 05:42 AM", "postID": "post67189961", "replies": []}, {"text": "this is light use?\ni get like 5 days with light use lol", "time": "6th June 2016, 02:54 PM", "postID": "post67195370", "replies": []}, {"text": "On wifi, the battery is in the ruins, no matter you use the phone or not. See: http://forum.xda-developers.com/htc-...ng-to-t3392562\n\r\nWith wifi off and using data only, I am at 81% after 22 hours of light usage with 1hr15min SOT. If I just extrapolate, I end up with about 5 days of 6hrs SOT of light usage off the charger. But that's not going to happen, I will likely end up with 3 days and 3 hrs of SOT on light usage... I will likely end the experiment (of keeping it off the charger) tomorrow after 48 hours off the charger and see how it went. We shall see.", "time": "6th June 2016, 06:07 PM", "postID": "post67198089", "replies": [{"text": "That's been my experience.  This phone just goes and goes and goes with light use.  I've found it quite easy to get 36 hours and still have 30%+ remaining, and I live in an area with poor cell coverage.\n\r\nI concur, if the wifi signal is weak, then the batter will drain rather quickly.", "time": "6th June 2016, 06:31 PM", "postID": "post67198396", "replies": [{"text": "The wifi issue on HTC 10 has got nothing to do with signal strength. Signal strength is fine. It seems to affect certain people or may be most people don't even know it affects them. Have a look at the post I linked to. It has more details and a way to find if you are affected or not.", "time": "6th June 2016, 06:33 PM", "postID": "post67198435", "replies": [{"text": "Hmm.  I considered it to be related to the poor wifi signal in the part of the house where I was sleeping.  The phone lost nearly 20% in 4 hours last night.  Today, at my office, it has lost 4% in 4 hours with strong wifi and cell signals.\n\r\nI don't know too much about adb, but if I can help, let me know.", "time": "6th June 2016, 08:38 PM", "postID": "post67200029", "replies": []}]}]}]}, {"text": "I for one experience better standby on Wifi than on 4G (and I assume that is normal). I did a light-use run and I got a little bit over 40 hrs of use with 2 hrs 45 min screen-on time. It actually lasted me a whole two days as HTC brags about. From this perspective, one of the best phones I ever owned. On wifi, over night, the phone would lose maybe 1%... 2%tops", "time": "6th June 2016, 09:05 PM", "postID": "post67200366", "replies": [{"text": "That's how it should be. A good wifi connection should be eating less battery than LTE.\n\nYou are the guy/gal we are looking for in that other thread.... Can you please post with your output in that other thread? I will likely have some more questions for you as we diagnose this issue on HTC10. It seems to affect quite a few people. So, your help will be greatly appreciated.\n\n---------- Post added at 02:21 PM ---------- Previous post was at 02:10 PM ----------\n\n\n\r\nThat's about the right rate for a strong wifi connection. So, your wifi is working fine as well.", "time": "6th June 2016, 10:21 PM", "postID": "post67201104", "replies": []}]}, {"text": "After 1st charge I got barely 26 hours battery with 20% left. Hope things will improve with next charges \n\nWysłane z mojego SM-T815 przy użyciu Tapatalka", "time": "7th June 2016, 04:51 PM", "postID": "post67212327", "replies": []}, {"text": "Best result so far with light usage: a little bit over 41 hours. That's more than two full work days... In this time I did play a little and had a few serious sessions of browsing, blinkfeeding and Facebook. But almost no camera, YouTube or music. Most of the time on Wifi, the rest on 4G+. Still, 41 hrs with 2 hr:40 min SOT is good enough for me for this type of usage. Best phone so far as endurance is concerned...", "time": "7th June 2016, 11:32 PM", "postID": "post67217522", "replies": []}, {"text": "Here is my \"light\" usage: 2h45m SOT, 54hrs off the charger, 52% used. All the use is over 4G LTE (good 3 bars), no wifi (see my post about wifi drain at: http://forum.xda-developers.com/htc-...ng-to-t3392562). With 48% remaining, I am projected to reach over 90hrs off charger with more than 5hrs of SOT.\n\r\nBrightness at 40% with Auto, which is plenty bright for me indoors AND outdoors with Auto boost. Cores locked at 1Ghz (little ones) and 1.6Ghz (big ones), which is plenty of power for me. Note that Power saver mode locks them all at 1.3Ghz. I am not using the Power saver mode (extreme power save mode is different than this) because it ruins the brightness completely, and 1.3Ghz is too slow.\n\r\nNearly 4 days off charger with 5hrs SOT is totally unbelievable. This is my typical work days where I don't get to play with the phone a whole lot. HTC 10 just rocks!!", "time": "8th June 2016, 02:44 AM", "postID": "post67219020", "replies": [{"text": "After using the phone for over an hour and half for calls today, I am left with 79 hrs off the charger, 4hrs SOT with 10% remaining. Expected to reach 88hrs (or may be even more when EPS kicks in at 5%..), 4h25m SOT. Not quite 4 days off charger but very very close. This is the light use phone to get!!\n\nBTW, during the calls the screen was dimly lit.... It should turn the screen off to save battery during the call. So, technically that hour and half of calls today probably ate more battery than they should have.", "time": "9th June 2016, 02:57 AM", "postID": "post67234866", "replies": []}]}, {"text": "One more light usage screenshot. This time with wifi on most of the time except for when I sleep.  4 days and 1 hrs with 3.5hrs of SOT, with 10% battery still in the tank. HTC 10 is a battery life beast!!", "time": "12th October 2016, 08:04 AM", "postID": "post69090231", "replies": []}, {"text": "Mines pretty bad, light use would be it sitting in my drawer a lot.\n\nMy work iPhone does the same (i don't pay for it, it's just for email, don't judge me)\n\nAnyway, this iPhone 6, nothing special, has three emails running, wifi always on, occasionally make a call, but thats it.\n\nOne charge, 165hrs about 3.5 hours SOT, so yea very little use.\n\nBut i just couldn't do that with the HTC, maybe in airplane mode but for me it dies pretty quick, a day maybe more, but thats it.\n\nReason i mentioned the crapple phone was that i was shocked to see the stamina of it, crazy, but if i was using it normally, it'd be dead in 6 hours lol  i wouldn't swap my htc.", "time": "22nd October 2016, 03:44 AM", "postID": "post69246407", "replies": []}]}, {"title": "\"Look\" of the device (aesthetics)", "rating": 5.0, "links": ["https://forum.xda-developers.com/htc-10/review/look-device-aesthetics-t3361294"], "threads": [{"text": "Too samsung/iphone look alike", "time": "31st October 2016, 10:07 PM", "postID": "post69399174", "replies": [{"text": "I wholeheartedly disagree with this comment.  Everyone is entitled to their own opinion, and that's all I'll say about entitlement.  That said, I truly see an hTC device when I look at the 10.  While it doesn't carry some of the design elements present in previous iterations of their devices, even just glancing at this phone I see hTC.  Sure, from the front many people may see the all glass front and rectang-ovular home key and think Samsung or, in my opinion far from iPhone looking design.  But when you see the front facing camera and the long/wide earpiece it tells a different story.  Then you get to the sides, top, bottom and chamfered and sharp edges of the back you know it isn't apple or sammy.\n\r\nI actually really like the design of the 10 in that it is a solid/rigid design and feel sturdy and has unique elements that speak to hTCs design language, and I appreciate what they've put into it.", "time": "3rd November 2016, 04:11 AM", "postID": "post69435912", "replies": []}]}, {"text": "Got the black one, looks great but I am not sure it will stay that way. I am extra carefull with my phones and this one has two where the bezel meets the back of the phone. Wished I could get the silver/black color combo but it wasn't available in my country.", "time": "1st November 2016, 02:33 AM", "postID": "post69401785", "replies": []}, {"text": "Iphone is distinct with the round home button ... but if you put in real life, on the same table, a white S6/S7 and a white HTC 10, both face up, for an untrained eye will be hard to say which one is which from few meters away and they will most likely be idendified as being both Samsungs. This mean HTC lost its identity. When I had the M7 it was obvious what phone it is from any angle, in any colour. Not anymore. The HTC design personality is heavily diminished in the 10.", "time": "3rd November 2016, 01:05 PM", "postID": "post69440851", "replies": []}]}, {"title": "Quality feel (use of materials)", "rating": 5.0, "links": ["https://forum.xda-developers.com/htc-10/review/quality-feel-materials-t3361295", "https://forum.xda-developers.com/htc-10/review/quality-feel-materials-t3361295/page2", "https://forum.xda-developers.com/htc-10/review/quality-feel-materials-t3361295/page3"], "threads": [{"text": "My home-button/fingerprint sensor seems to be loose, after a while of not touching it the first touch seems to depress it back into place and then its fine for a while.", "time": "13th July 2016, 02:18 AM", "postID": "post67720441", "replies": [{"text": "Same here. I thought it's just me. Feels annoyed at first. I can't stand if something wrong happened with my phone (especially hardware issue). Usually I'm thinking to sell it and buy a new one.\n\nBut for this issue, I think i already get used to it. \n\n*cheers*", "time": "16th July 2016, 12:28 PM", "postID": "post67769114", "replies": []}, {"text": "Hello,\n\r\nI have the same issue. My Home/fingerprint button is loose from the center to the left. \r\nWhen I push it, I sometimes here crunchy noises (rarely when I put my thumb on it which is enough to unlock the phone). \r\nThe home button and the fingerprint sensor are both working fine so I won't send it back for now but this is an annoying detail (I can't stop thinking about this when I look at my phone  ).", "time": "29th July 2016, 07:44 PM", "postID": "post67959268", "replies": [{"text": "it mostly happens to me after being in my pocket, just sitting around my house and it never does it.", "time": "30th July 2016, 08:33 PM", "postID": "post67972811", "replies": []}]}]}, {"text": "Same on the loose home button \n\nBut i guess its not that bad as i forgot about it for the last 2 weeks...", "time": "17th July 2016, 09:06 PM", "postID": "post67788903", "replies": []}, {"text": "Screen defect is horrible, design wise could've been 2mm thinner.", "time": "18th July 2016, 09:19 AM", "postID": "post67794912", "replies": []}, {"text": "What screen defect are you referring to and is this a widespread issue?", "time": "18th July 2016, 10:30 PM", "postID": "post67804287", "replies": []}, {"text": "My vibrator motor became loose one night, i only had it for 20 days tops and never dropped it", "time": "19th July 2016, 10:13 PM", "postID": "post67819413", "replies": []}, {"text": "Just dropped mine from 4 ft face down onto hard kitchen tiles,  not a mark,  phew", "time": "1st August 2016, 06:14 PM", "postID": "post67998527", "replies": []}, {"text": "I generally love this phone. The feel of the case is great and the glass screen is equally smooth. My only complains are:\n\n1. Camera bump. I hate using a case, but I feel like I'm going to scratch / break my camera off because of how it sticks out of the back of the phone.\n2. The sharp edges on the bottom, specifically around the USB port cut into my finger when I hold the phone.\n3. While I think it looks fine on the Carbon Grey, the plastic strip along the top looks bad on the Silver version of the phone.", "time": "3rd August 2016, 04:15 PM", "postID": "post68027549", "replies": []}, {"text": "I don't think I would've ever noticed the looseness of the home button had I not read this thread. I never push on it, just lay my finger over it to unlock or go back home so it never occurred to me to check for movement. My screen is great (may have slightly color issues, but I don't really compare it to other devices so it doesn't bother me). The body of the phone to me also seems to be top notch. No chipping or scratches as of yet...my Nexus 6P chipped and bent rather easily and I tend to take care of my phones.", "time": "3rd August 2016, 04:54 PM", "postID": "post68028043", "replies": []}, {"text": "This guy destroys phones and he said the HTC 10 is a Tank. \n\nhttps://www.youtube.com/watch?v=cQ62ixgzhrI", "time": "9th August 2016, 12:03 PM", "postID": "post68108287", "replies": []}, {"text": "Perfect so far but I am disappointed with the black coating... a small drop and the bright aluminium shines through immediately... Why dont they mix paint with metal and then shape it instead of coloring if after ... its annoying watching those dents that are super visible just because it is painted :/", "time": "9th August 2016, 11:57 PM", "postID": "post68117625", "replies": []}, {"text": "because you can just mix paint in with molten aluminum...", "time": "10th August 2016, 03:33 PM", "postID": "post68126413", "replies": []}, {"text": "I have my 10 since yesterday and I am very happy with the build quality so far. The device has a premium feel to it and it is definitely the best quality smartphone I have ever had (including the iPhone)", "time": "19th August 2016, 09:42 PM", "postID": "post68268582", "replies": []}, {"text": "It feels and looks like an Iphone 3GS to me", "time": "12th September 2016, 07:53 PM", "postID": "post68655815", "replies": []}, {"text": "this feel that every flagship phone should have", "time": "15th September 2016, 01:42 AM", "postID": "post68693030", "replies": []}, {"text": "I have the newly released red one and the power button is a little hard to press, I kinda have to press it with my nail to push it.", "time": "17th September 2016, 03:08 AM", "postID": "post68725165", "replies": []}, {"text": "Bought HTC 10 in May. Loved it but I wanted to try Huawei P9 Plus and their \"Leica Cam\". Like the P9 Plus too but I recently sold it and got me another HTC 10  This phone just feels so premium.", "time": "17th September 2016, 09:43 PM", "postID": "post68737170", "replies": []}, {"text": "Got mine June 30th, 2016.  I came from an HTC ReZound and this phone felt to thin and lite.  So I bought the Verizon case and it is better.  Haven't experienced the Home/Finger scanner problem but it is not a depressible button so it really shouldn't be a problem.", "time": "18th September 2016, 05:19 AM", "postID": "post68740787", "replies": []}]}, {"title": "Ergonomics (in-hand feel)", "rating": 4.0, "links": ["https://forum.xda-developers.com/htc-10/review/ergonomics-hand-feel-t3361296", "https://forum.xda-developers.com/htc-10/review/ergonomics-hand-feel-t3361296/page2"], "threads": [{"text": "Switched from M8 then A9, now 10. M8 is too slippery, A9 has the best feel in hand, light-weighted, round corners, feels good. 10's big chamfer does help, but I still prefer A9's in-hand feel.", "time": "14th June 2016, 09:55 AM", "postID": "post67310256", "replies": []}, {"text": "Looks like they fired all ergonomics/user interface designers. Placement of Power button next to volume buttons is atrocious. Placement of the headphone jack is terrible.", "time": "13th October 2016, 11:12 PM", "postID": "post69118478", "replies": []}, {"text": "I came from iPhone 6 which was disaster to hold in hands without TPU case, HTC 10 worse because it is bigger and from the same material, I must carry it like an egg until my TPU case finally arrives. It slips from dry hands or pocket like it is nothing. I cannot get used to even take it out on the asphalt because I just wait for it to slip from hands. I dont get all that hype with aluminium housing, Sony and also HTC have had great plastic housings, stupid Apple gave them stupid ideas.", "time": "16th October 2016, 06:27 PM", "postID": "post69160347", "replies": []}, {"text": "Isn't the black color less slippery?", "time": "17th October 2016, 03:28 AM", "postID": "post69165741", "replies": [{"text": "it just the same", "time": "20th October 2016, 08:12 PM", "postID": "post69225937", "replies": []}]}, {"text": "My only grape is the headphone jack being on top.   Previously, I had the M8 and it was very slippery.  I don't find that issue with the 10 and i like the weight of the phone.", "time": "17th October 2016, 04:17 PM", "postID": "post69173637", "replies": []}, {"text": "I have white one and it it slippery like hell!", "time": "17th October 2016, 09:53 PM", "postID": "post69178602", "replies": [{"text": "You mean the silver one?", "time": "17th October 2016, 10:41 PM", "postID": "post69179128", "replies": []}]}, {"text": "Yea, the front is white", "time": "17th October 2016, 10:42 PM", "postID": "post69179139", "replies": []}, {"text": "To me my M8 is much easier to secure in-hand than my 10. Even though the M8 is only slightly curved it conforms to your hand better. I really like the ridged power button on the 10. It helps identify itself, and i use it to help stabilize my grip", "time": "20th October 2016, 07:39 AM", "postID": "post69215911", "replies": []}, {"text": "Very slippery w/o a case", "time": "3rd November 2016, 01:09 PM", "postID": "post69440892", "replies": []}, {"text": "Is a bit slippery. First time having alu phone, and wont buy them anymore, these premium materials are totaly useless on daily 'driving' , need to be careful like with egg. After 2weeks bought Spiegen cover, feels confident with phone now.", "time": "6th November 2016, 12:40 PM", "postID": "post69487057", "replies": []}, {"text": "Hard to tell which way is up until you can feel the buttons on the right.", "time": "12th November 2016, 11:33 PM", "postID": "post69591253", "replies": []}, {"text": "could be a bit narrower and slimmer", "time": "8th November 2017, 01:04 PM", "postID": "post74447071", "replies": []}, {"text": "The lower part hurts, as long as it holds. besides it is very comfortable", "time": "11th February 2018, 06:17 PM", "postID": "post75529424", "replies": []}, {"text": "For me the weight, and shape is perfect. It's easy to pick it up from a flat surface, as opposed to for example the S7. The aluminium is slippery, but I use a case anyway.", "time": "22nd March 2018, 12:35 PM", "postID": "post75977151", "replies": []}]}, {"title": "OEM skin/software", "rating": 4.5, "links": ["https://forum.xda-developers.com/htc-10/review/oem-skin-software-t3361297"], "threads": []}, {"title": "Outdoor visibility (max brightness)", "rating": 4.5, "links": ["https://forum.xda-developers.com/htc-10/review/outdoor-visibility-max-brightness-t3361298", "https://forum.xda-developers.com/htc-10/review/outdoor-visibility-max-brightness-t3361298/page2"], "threads": [{"text": "Perfectly fine in 12258 lux of sunlight.", "time": "5th June 2016, 03:19 PM", "postID": "post67181414", "replies": []}, {"text": "Seems reasonable, not as bright as an S7 but it's not an AMOLED.", "time": "5th June 2016, 07:31 PM", "postID": "post67184658", "replies": []}, {"text": "The screen is most definitely very very bright in bright sunlight on \"auto\" setting with slider to the max. I have no issues with the brightness outdoors. Make sure to keep the \"auto\" setting, there is a brightness boost built in with \"auto\". Also, do not use Power Saver feature (I am not taking about the Extreme Power Saver mode). The Power Saver will ruin the brightness in sunlight completely and thoroughly.", "time": "6th June 2016, 06:00 PM", "postID": "post67197976", "replies": [{"text": "Oh, so that's why it looks so strange in direct sun light :P It's not looking nice with the boost, but it's very effective and helps a lot", "time": "7th June 2016, 06:19 AM", "postID": "post67204808", "replies": [{"text": "No help for users like me whose (HTC 001) Auto brightness doesn't even work out of the box.", "time": "7th June 2016, 10:00 AM", "postID": "post67207011", "replies": [{"text": "Mine auto brightness is also huge step back comparing to previous One's. It is too bright in the evening or at night if my slider in auto mode is at about 75%.", "time": "7th June 2016, 03:41 PM", "postID": "post67211271", "replies": [{"text": "Use Lux Lite (can do the same)", "time": "7th June 2016, 03:57 PM", "postID": "post67211529", "replies": []}]}]}]}]}, {"text": "Compared the 10 with my Samsung S6 at noon in direct sunlight in Tucson, AZ on June 06.   Couldn't see either for ****e.", "time": "6th June 2016, 11:53 PM", "postID": "post67202103", "replies": []}, {"text": "Thank you for your article\n\n\r\nDanesh Hamara", "time": "7th June 2016, 12:01 PM", "postID": "post67208492", "replies": []}, {"text": "Personally, I think max brightness on this phone isn't nearly bright enough. When I stop off at the Starbucks drive through in the morning and attempt to pay with my phone (pops a barcode on screen for the barista to scan) they always need to take my phone from me inside where it's a bit darker to scan. I have never had this issue with any other device, and never see any of the cars ahead of me having a similar issue. This is with auto brightness on and the slider all the way at max.", "time": "7th June 2016, 04:22 PM", "postID": "post67211903", "replies": []}, {"text": "Remember that when you go outside, the sun is bright, you slip on your polarized sun glasses. Next time you look at the screen, it's dark.\nRemember the screen is  polarized as well, and not in the best orientation. Turn the phone horizontal, see if brighter again. \n-Just saying this in case it is affecting some of the 'too dark' comments.-", "time": "9th June 2016, 03:30 AM", "postID": "post67235078", "replies": [{"text": "Yeah the polarization was a completely gooned up oversight in manufacture of the lcd. Could have done it 90 Deg off.", "time": "19th June 2016, 03:07 AM", "postID": "post67383759", "replies": [{"text": "Then you can't take pictures with sunglasses on and you can't use the gps while driving with the SGs on. It goes both ways in terms of preferable polarization orientation.", "time": "21st June 2016, 03:28 PM", "postID": "post67421034", "replies": []}]}]}, {"text": "Slightly lower than on S7 but visible enough.\n\n\n.", "time": "9th June 2016, 11:42 AM", "postID": "post67239512", "replies": []}, {"text": "Much brighter than my LG G3. I don't need to crank the brightness to  40% indoors anymore. I can keep my HTC 10 around 15-20% brightness and see it just fine indoors.", "time": "23rd June 2016, 06:42 AM", "postID": "post67445838", "replies": []}, {"text": "Compared to the Nexus 6P the HTC display is visible with no issues on direct sunlight. It is definitely not perfect, but I really like it.", "time": "23rd August 2016, 07:46 PM", "postID": "post68329643", "replies": []}]}, {"title": "Contrast (true blacks)", "rating": 5.0, "links": ["https://forum.xda-developers.com/htc-10/review/contrast-true-blacks-t3361299"], "threads": []}, {"title": "Color saturation & accuracy", "rating": 4.5, "links": ["https://forum.xda-developers.com/htc-10/review/color-saturation-accuracy-t3361300", "https://forum.xda-developers.com/htc-10/review/color-saturation-accuracy-t3361300/page2", "https://forum.xda-developers.com/htc-10/review/color-saturation-accuracy-t3361300/page3", "https://forum.xda-developers.com/htc-10/review/color-saturation-accuracy-t3361300/page5"], "threads": [{"text": "Not very good at all (regression)", "time": "5th June 2016, 03:20 PM", "postID": "post67181427", "replies": [{"text": "He said colorblind people disregard. \r\nColor saturation & accuracy are excellent here.", "time": "5th June 2016, 03:40 PM", "postID": "post67181682", "replies": [{"text": "How do you know if I'm colorblind?", "time": "5th June 2016, 03:42 PM", "postID": "post67181704", "replies": [{"text": "Because you stated not good at all, The HTC 10 camera is by far the best yet.\n\n---------- Post added at 10:47 AM ---------- Previous post was at 10:46 AM ----------\n\n\n\r\nBecause you stated not good at all.", "time": "5th June 2016, 03:47 PM", "postID": "post67181752", "replies": [{"text": "This isn't about the camera 😃\n\n LTR.", "time": "5th June 2016, 03:49 PM", "postID": "post67181787", "replies": [{"text": "Haha, my bad, still the display is better than all previous models.", "time": "5th June 2016, 03:55 PM", "postID": "post67181861", "replies": []}]}]}]}]}]}, {"text": "for me, my sharp panel is very bad, reddish, much worse than the m9. wating for new calibration profiles or a kernel with support for color balance mod", "time": "6th June 2016, 02:56 PM", "postID": "post67195398", "replies": []}, {"text": "I have a tianma panel and it is very good. Colors are a bit oversaturated though, even in sRGB mode. I might try a cooler setting though. Currently I have it one notch towards cool. \nOverall I am loving the display.", "time": "20th August 2016, 03:49 PM", "postID": "post68278437", "replies": []}, {"text": "do Tianma displays still have pink shifting?", "time": "6th September 2016, 05:44 PM", "postID": "post68558370", "replies": []}, {"text": "For enthusiasts there is a color control available: http://forum.xda-developers.com/show...&postcount=309", "time": "7th September 2016, 11:09 AM", "postID": "post68569364", "replies": []}, {"text": "I have a Sharp panel and is awful. No matter what setting(sRGB/Vivid) the screen has a red accent.", "time": "13th September 2016, 11:58 AM", "postID": "post68665202", "replies": []}, {"text": "Mines fine\nSlightly pink but nothing compared to the horrihle tints on AMOLED", "time": "29th November 2016, 07:38 PM", "postID": "post69852947", "replies": []}, {"text": "Did any one got a new HTC 10 recently and see a pink/red hue?", "time": "1st December 2016, 09:17 PM", "postID": "post69886029", "replies": []}, {"text": "Yeah I've got a new one. Mine does have a slight pink hue. But doesn't bother me. And too be honest next to my 6p AMOLED screen it looks way better.", "time": "1st December 2016, 09:32 PM", "postID": "post69886204", "replies": [{"text": "Does ur new 10 has Tianma panel?\n\n---------- Post added at 10:46 PM ---------- Previous post was at 10:45 PM ----------\n\n\n\r\nDoes ur new 10 has Tianma panel?", "time": "1st December 2016, 09:46 PM", "postID": "post69886371", "replies": [{"text": "How do I find out?", "time": "1st December 2016, 09:52 PM", "postID": "post69886444", "replies": [{"text": "https://play.google.com/store/apps/d...devcheck&hl=en \n\r\nInstall the app and open it check under hardware section", "time": "1st December 2016, 09:55 PM", "postID": "post69886486", "replies": []}]}]}]}, {"text": "Doesn't say for some reason", "time": "1st December 2016, 09:59 PM", "postID": "post69886540", "replies": []}, {"text": "Few days back I was able to see. But not now.", "time": "2nd December 2016, 01:52 PM", "postID": "post69895404", "replies": [{"text": "On LeeDroid 2.7.1 it's there.\n\r\nSays right under Screen Size and above Frame Rate.\n\r\nPanel: Perfume WQHD TIANMA blah...", "time": "2nd December 2016, 08:20 PM", "postID": "post69900781", "replies": []}]}, {"text": "I'm on leedroid N . Maybe because of that", "time": "2nd December 2016, 03:00 PM", "postID": "post69896441", "replies": [{"text": "It'll tell you in the bootloader.", "time": "2nd December 2016, 06:36 PM", "postID": "post69899535", "replies": []}]}, {"text": "After using color correct screens  s6 in basic mode, Nexus 5x i  an not able live with the pink hue.", "time": "2nd December 2016, 08:25 PM", "postID": "post69900848", "replies": []}, {"text": "You do the pink hue gets better.\n\n---------- Post added at 09:58 PM ---------- Previous post was at 09:58 PM ----------\n\nIm on leedroid n think that might be why", "time": "2nd December 2016, 08:58 PM", "postID": "post69901201", "replies": []}, {"text": "Had my HTC 10 for a few days, has a slight red/pink tint. Saturation is also slightly high (on SRGB profile). Screen's not as good as my previous midrange Moto X Play. Manageable, but IMO it should be better for a flagship.", "time": "3rd December 2016, 02:25 AM", "postID": "post69903930", "replies": []}, {"text": "Mines tianma.  Does have a slight pink hue.  Although the screen is still on par wirh my 6p.", "time": "3rd December 2016, 12:31 PM", "postID": "post69908982", "replies": []}, {"text": "This concerns me a little. Of all the phones i have ever owned, The only phone i ever missed and regretted selling was my htc m7. I currently own an s7 edge and recently decided i would like a change after having samsung for the last 3 years . The htc 10 seemed like it would be perfect for me but this concerns me. ,y htc 10 will be here tomorrow so until i cannot test the unit i will have personally but some of the reviews seem to be a mixed bag. Some say the camera on the edge is alot better and in truth i could live with that as long as the camera is very good (the s7 edge is remarkable to be fair) others though suggest the htc 10 camera is equal or at least \"almost\" as good as the s7 edge. Same goes for the screen. Some are disappointed, Others claim the screen is just as good as the s7 edge but just not as vibrant which may or may not be as pleasing to the eyes as the vibrancy of the s7 edge will........ others are very happy with the display! This is one aspect i care about. If the display is as poor as some are saying then thats enough for me to get rid of the phone. Is it really that bad? According to some reviewers, The sharp panel and tianma panel are the exact same apart from one being polarized vertically ??", "time": "6th December 2016, 10:45 PM", "postID": "post69963655", "replies": []}, {"text": "I returned  the phone seeing pink hue.  The one they send also has the same problem. Better return the phone if u see pink tint", "time": "6th December 2016, 11:13 PM", "postID": "post69963950", "replies": []}, {"text": "Got my HTC 10 yesterday and initially I was quite worried reading this thread while waiting for my phone to arrive. Once I got my hands on the phone, however, I didn't see any noticeable issues with the display. My previous phone was Galaxy Alpha and trust me guys, this phone has a pretty good display, although sunlight legibility is a little low compared to the Alpha. I am also happy with the color accuracy at srgb mode.. way better than my previous phone's amoled.", "time": "28th January 2017, 12:56 PM", "postID": "post70769239", "replies": []}, {"text": "For me, HTC 10 display is just abobe average. Not perfect contrast, a bit oversaturated colors, pink color shift when viewing screen from  from angle.\nYes, when you use only this phone, you may think that display is good. But compared to devices with perfrectly calibrated screen, you will see taht HTC 10 is far from perfect. I placed Samsung S7 and Iphone 6 plus/6s near my HTC, set nearly same brightness: HTC in on the lower end, sadly. Newer think that i will say this ablut HTC, but its flagship dislay only regular, not perfect. Even my HTC One M7 has better screen, with more  contast and without color shift.", "time": "30th January 2017, 12:50 PM", "postID": "post70798424", "replies": []}, {"text": "Does the screen support the DCI-P3 wide color gamut? I can not find any official info about it. Btw I found that some reviews say Super LCD 5 of HTC 10 supports DCI-P3 standard, and before HTC 10 display they have used sRGB.", "time": "8th October 2017, 06:32 PM", "postID": "post74083561", "replies": []}, {"text": "I have rr remix final nougat build from tabpole with clean slate 2.3.1 installed. I had a samsung note 3 for 6 months and several amoled phones before that. I've seen how amoled screens compare to lcd screens, I too have the crap screen from that company on my phone and I've been using kcal to adjust properties until I stop being annoyed with screen tints. And I think I'm close, but all of our eyes are different, so idk.\n\r\n I've included my kcal stuff for anyone interested in trying the settings for yourself", "time": "11th October 2017, 12:33 AM", "postID": "post74112204", "replies": []}]}, {"title": "Clarity/resolution", "rating": 5.0, "links": ["https://forum.xda-developers.com/htc-10/review/clarity-resolution-t3361301"], "threads": [{"text": "The display is very sharp and everything is crystal clear. No problems here.", "time": "23rd August 2016, 08:21 PM", "postID": "post68330176", "replies": []}, {"text": "I've gotten bright spots on the LCD that really make it weird to look at on bright backgrounds, dark ones are fine though", "time": "22nd October 2017, 03:44 AM", "postID": "post74248569", "replies": [{"text": "Warranty should cover that.", "time": "22nd October 2017, 03:57 PM", "postID": "post74254111", "replies": []}]}]}, {"title": "Minimum brightness", "rating": 4.5, "links": ["https://forum.xda-developers.com/htc-10/review/minimum-brightness-t3361302"], "threads": [{"text": "it's still too bright at min brightness, had to use an filter app.", "time": "14th June 2016, 09:58 AM", "postID": "post67310280", "replies": []}, {"text": "Yep agreed. I did find turning on power save seemed to reduce brightness.", "time": "9th July 2016, 07:05 PM", "postID": "post67673407", "replies": [{"text": "Yea, I found out quickly when I switched to the 10 that Powersaver just can't be turned on while outside in sunlight.\r\nPowersaver does the following:\r\nConserves CPU Power/ Reduce Screen brightness/ Turn off vibration feedback/Put data connection to sleep when screen is off (or at least it used too)\n\r\nWe used to have the option to enable/disable (see attached image) these features when powersaver is turned on, now we just have the option to turn it on/off. Wish we still had the option to disable certain things like brightness, or vibration.", "time": "9th July 2016, 08:23 PM", "postID": "post67674307", "replies": []}]}, {"text": "Yeah, turning on power save will reduce brightness, it work.", "time": "14th July 2016, 08:05 AM", "postID": "post67737941", "replies": []}, {"text": "http://forum.xda-developers.com/htc-...-0-01-t3385167 does the job too.", "time": "21st July 2016, 09:46 AM", "postID": "post67840166", "replies": []}, {"text": "Better than iPhone and dont need  to jailbreak/root to filter it down even more. Very happy", "time": "26th July 2016, 10:13 AM", "postID": "post67908144", "replies": []}, {"text": "wish can really reduce to minimum, so not to bright on dark room", "time": "15th September 2016, 01:43 AM", "postID": "post68693036", "replies": []}]}, {"title": "Call quality", "rating": 5.0, "links": ["https://forum.xda-developers.com/htc-10/review/call-quality-t3361303", "https://forum.xda-developers.com/htc-10/review/call-quality-t3361303/page2"], "threads": [{"text": "Definitely not top notch. HTC should have included some kind of noise suppression feature like other OEMs like LG.", "time": "3rd June 2016, 11:48 PM", "postID": "post67159425", "replies": []}, {"text": "Mine is good. I didn't experience any issue, phone call is very clear.", "time": "14th June 2016, 09:56 AM", "postID": "post67310264", "replies": []}, {"text": "Mine keeps cutting out.", "time": "25th June 2016, 02:41 AM", "postID": "post67472000", "replies": []}, {"text": "Very clear for me. I bought my Dad an HTC 10 as well, so HTC 10 to HTC 10 is BEYOND amazing. Its super clear.", "time": "27th June 2016, 05:41 PM", "postID": "post67505883", "replies": []}, {"text": "The best out of my all my previous phones, all samsungs.  Calling my wife at work from home, I have never sounded better, she says.  The speaker phone was also superb even when I was talking and playing a game, she couldn't tell I was tapping on th screen.\nCould be a mix of a stronger signal I get with this phone at home. I'm always green whereas with all my other Sammy's my reception was pretty much yellow all the time, never green.  Wifi calling with T-Mobile also helps.", "time": "27th June 2016, 08:37 PM", "postID": "post67508119", "replies": []}, {"text": "I actually have the total opposite. My call volume is sooooo low. I constantly have to repeat or ask the other end what did you say.", "time": "27th June 2016, 08:44 PM", "postID": "post67508208", "replies": []}, {"text": "I have same issue.", "time": "2nd July 2016, 04:17 PM", "postID": "post67574737", "replies": []}, {"text": "Same for me, the other end oftens ask me to repeat myself again.", "time": "6th July 2016, 03:00 PM", "postID": "post67628730", "replies": []}, {"text": "My voice is not heard by the other side the first 3-5 seconds.", "time": "11th July 2016, 09:32 AM", "postID": "post67693977", "replies": []}, {"text": "Came from an M8 with no issues, same callers, locations. not happy", "time": "17th July 2016, 10:02 PM", "postID": "post67789566", "replies": []}, {"text": "much better than iphone 5s, if a bit quiet", "time": "30th July 2016, 12:45 AM", "postID": "post67962347", "replies": []}, {"text": "Superior wi-fi and cellular connectivity to most other phones", "time": "16th November 2016, 12:12 PM", "postID": "post69647550", "replies": []}, {"text": "Good quality, clear and loud enoguh, but I feel it's a bit worse than my old M7. Definetly better than Samsung or iphone for that matter", "time": "19th November 2016, 04:44 PM", "postID": "post69698788", "replies": []}, {"text": "I live in the middle of London so haven't had any complaints previously and this is no different. Crystal clear (on Vodafone).", "time": "19th November 2016, 05:04 PM", "postID": "post69699078", "replies": []}, {"text": "Got phone few days ago and in some parts of the city when talking normally on the phone, people on the other side can't hear me, as if mic not working.  I check the signal strength and it is 4 to 5 bars.  I tested with and without VoLTE, no difference.  Also the earpiece seems to produce tiny sound and lacks in low end.  On top of that, most other external noise is present and other person hears it, as if mic isn't trying to eliminate noise.", "time": "26th November 2016, 09:40 PM", "postID": "post69807043", "replies": []}, {"text": "My in call volume is pretty low too.  I'm trying to find an app that will increase it without having to root.", "time": "5th May 2017, 03:56 AM", "postID": "post72167856", "replies": []}]}, {"title": "WiFi strength, range, and throughput", "rating": 3.5, "links": ["https://forum.xda-developers.com/htc-10/review/wifi-strength-range-throughput-t3361304", "https://forum.xda-developers.com/htc-10/review/wifi-strength-range-throughput-t3361304/page2", "https://forum.xda-developers.com/htc-10/review/wifi-strength-range-throughput-t3361304/page3", "https://forum.xda-developers.com/htc-10/review/wifi-strength-range-throughput-t3361304/page8"], "threads": [{"text": "I am getting drop-outs on my WiFi connection even when feet from the router.  The strength is OK but it drops connections, and when making WiFi-based calls the phone complains that WiFi signal strength is low (even when max bars!  Clearly this needs and fix from HTC as others are reporting this too.", "time": "25th May 2016, 04:51 PM", "postID": "post67021703", "replies": []}, {"text": "when I use the normal wifi from my router I seem to have issues but I'm on very old firmware still from Verizon 1.19. I hear the update helps out with wifi issues. When I connect my to my router using the 5G connection it works flawlessly.", "time": "25th May 2016, 05:05 PM", "postID": "post67021895", "replies": []}, {"text": "I find the wifi strength is not top notch. Very easily it drops its speed. Using ICE Rom.", "time": "28th May 2016, 07:36 AM", "postID": "post67060483", "replies": []}, {"text": "I found this fault on previous HTC phones that I've dealt with like the M8 M9 all had weak Wi-Fi connection and range.", "time": "28th May 2016, 11:22 PM", "postID": "post67070514", "replies": []}, {"text": "I vote excellent. I walked away from our apartment the other day and my 10 clinged on to it's dear life and maintained 1/5 bars where my M7 and missus's G3 just went: nope.\nI'll have the \"ultimate test\" for my 10 next Wednesday. Going to school and in our \"lab\" we have a WiFi router. This lab is basically a bunker, a bomb shelter.\nMy M7 could pick up the WiFi from there (with the door closed) fine in a couple of locations around and near the bunker. It's going to be interesting to see how well my 10 can pick it up.", "time": "28th May 2016, 11:46 PM", "postID": "post67070722", "replies": []}, {"text": "Wi-Fi singal to me is a great, but the speed and connection seems quite off. At times I can use my laptop while my HTC 10 is connected to the same Wi-Fi connection and my laptop speed will be great, but the HTC 10 seems quite sluggish. Additionally, sometimes I will get an error notification with Wi-Fi calling, and sometimes I'll get dropped calls when I have great Wi-Fi signal.", "time": "29th May 2016, 02:28 AM", "postID": "post67071853", "replies": []}, {"text": "WiFi signal is absolutely horrible for me. Most of the time I only get 1-2 Bars except im really close to the Router.\nMy Tablet and other phone always get way better Signal strength.", "time": "25th June 2016, 08:29 PM", "postID": "post67481881", "replies": []}, {"text": "Wifi on HTC 10 is the most horrible implementation I have seen on any device. If you think your wifi is great, go contribute your debug logs to this thread: http://forum.xda-developers.com/htc-...ng-to-t3392562 \n\r\nVote on that thread only after doing the diagnostics, not by \"oh, my wifi is great because I can browse on my phone\".", "time": "26th June 2016, 06:28 AM", "postID": "post67486015", "replies": []}, {"text": "I had issues before update 1.80.401.1: connections never seemed stable\nNow on the update I've nothing to complain about, throughput is good, ping is stable and the wifi never seems to drop again. \nRoaming between access points is also great, no drops there as well.\n\nThe range is fine as well. From the house to the garage (about 30m away) I still get a good enough signal to use internet, watch youtube etc. \nThat's through 2 brick walls and a garden with trees", "time": "26th June 2016, 11:12 AM", "postID": "post67488278", "replies": []}, {"text": "Wifi range on this phone (HTC 10) is atrocious. The phone is basically useless to me. At home, it refused to connect to my 5ghz band and would only connect to the 2.4ghz band, unless I was within 5ft of the router. \n\r\nWe are currently in Costa Rica on our honeymoon, and while my HTC 10 remains in the hotel room safe 99% of the time while we surf, explore etc., the few times I've needed it it absolutely refused to connect to any of the 3 wifi networks here. Meanwhile, my wife's Galaxy S4 connects to any of them with no issues and gets 20mbps download speeds. My Macbook Pro has no issues and two other people we've talked to have had no issues with their iPhone and LG G4. \n\r\nI wanted to love this phone but it's given me nothing but issues when it comes to network connectivity. I made the last second decision to leave my Nexus 6P and bring the HTC 10 in an effort to have a smaller phone with me during this trip, but I completely regret it. As soon as we get home the sim card will be pulled and the phone will be shoved into a drawer until another worthy phone comes along to use my next JUMP! Ondemand upgrade on. \n\r\nIt's too bad HTC is making the next Nexus phone. Because I sure as hell won't be buying it after this B.S. experience. \n\r\nAlso, for reference, when I got the phone from T-Mobile I unlocked it and flashed the U.S. unlocked RUU firmware/ROM for faster updates. I had these issues on the 1.53.617.5 RUU and they persist after the latest 1.80.617.1 update.", "time": "26th June 2016, 09:19 PM", "postID": "post67495158", "replies": []}, {"text": "@sn0warmy do you have the uh oh warranty with 1 day replacement? Because I wonder if this is a hardware issue as some people report good WiFi.", "time": "26th June 2016, 09:23 PM", "postID": "post67495215", "replies": [{"text": "I'm not entirely sure. I do pay for the accidental coverage through T-Mobile and I'm sure I could use that to get a replacement through them (they've always been great in giving me replacements when requested). But I've seen so many people with the same issues, who report the replacement doesn't solve the problem., that I almost just don't even want to bother.", "time": "26th June 2016, 09:29 PM", "postID": "post67495269", "replies": [{"text": "I had the same problem and a replacement for a new phone did the trick....", "time": "27th June 2016, 07:04 PM", "postID": "post67506947", "replies": []}]}]}, {"text": "Yeah,  I'm on the latest OTA,  1.80 and Wi-Fi is better,  but not as good as my old LG g3. Just enabled 2.4Ghz only,  and it feels better", "time": "29th June 2016, 12:27 PM", "postID": "post67530884", "replies": []}, {"text": "Agreed, reception is terrible, I bought the unlocked t mobile version through htc, am on the latest update 1.80.617.  I am currently sitting in a hotel room with crappy wifi service, but next door there is a walmart with a strong signal and I am connected through that on my laptop with 4 bars, but I can't get the 10 to connect at all.", "time": "1st July 2016, 09:45 PM", "postID": "post67565773", "replies": []}, {"text": "Oh look, there is still one bar left.... no reason to switch then....\n\n\n\nGTFO WiFi... GTFO", "time": "2nd July 2016, 08:53 PM", "postID": "post67577813", "replies": []}, {"text": "This is well know android issue that has nothing to do with htc.. Android has wifi roaming issues, same happens with samsung ore oneplus...", "time": "3rd July 2016, 07:48 AM", "postID": "post67582211", "replies": []}, {"text": "I notice sometimes it says full signal but i cant get any data through news republic or instrgram wont loads pictures and its not my wireless or internet connection as my TV is a few metrers away on wifi playing netflix. If i disconnect and reconnect it works again for a few days. 4G works fine though.", "time": "4th July 2016, 11:08 AM", "postID": "post67597636", "replies": []}, {"text": "Range sucks", "time": "4th July 2016, 02:59 PM", "postID": "post67600327", "replies": []}, {"text": "In the last couple of days I have been playing with my wireless router frequency/channel to improve my HTC 10 signal which so far it terrible compare to my old M8.\n\nMy AC router 2.4/5Ghz has the possibly to setup 2 different SSID and password for the respective frequency, which I did.\n\nI am currently living at the second floor, the router is located at the first floor on the other side of my house, pretty far I would say, in between there are microwave, Tv, cordless phone, and it's near the kitchen.\n\nI have noticed that with the 2.4Ghz the WiFi is bad as always, connection drop, speednet test gave me 4MB download and 10MB upload,really suck, I can barely streaming a video, sometimes even drop at 1MB download.\n\nThings change completely with the 5Ghz band, actually I was surprised!\n\nSetting up only a SSID with 5Ghz I suddenly got 20MB download and 60MB upload from the second floor, and 40MB/90MB download/upload  front the first floor, that was a shock.\n\nWith the 2.4Ghz it doesn't matter where I stay I always got between 1/4 MB download.\n\nBut with 5Ghz it's blazing fast, eventhus the 2.4Ghz has better throughputs to bypass walls.\n\nAnyone tried/experienced same thing?", "time": "13th July 2016, 04:35 AM", "postID": "post67721518", "replies": []}, {"text": "5Ghz slightly faster for me but only when I'm near the router", "time": "21st August 2016, 07:07 AM", "postID": "post68287197", "replies": []}, {"text": "2.4Ghz works better for distance from router for me and videos/netflix and such don't need to buffer, also tried turning off wifi calling and that helped a lot, don't use that feature anyway.", "time": "23rd August 2016, 05:11 AM", "postID": "post68318087", "replies": []}, {"text": "I just realized how bad the WiFi is on this phone.\n\nI got a cheap Xiaomi Pad 2 and to my surprize, I can watch a Youtube video on a place where I'd usually loose connection with my HTC 10.  This is around 10m away from the access point.\n\nI did some more tests around the house and in places where I can get a reliable 20mb on the Xiaomi, I get at most 1mb on the HTC 10 \n\n\nAny idea on how to fix this?\n\n---------- Post added at 06:37 PM ---------- Previous post was at 06:31 PM ----------\n\nIts worse than every other device in my home including a cheap chinese tablet", "time": "1st September 2016, 12:37 AM", "postID": "post68469347", "replies": []}, {"text": "So it seems it is a hardware fault after all. Damn htc.", "time": "1st September 2016, 04:44 AM", "postID": "post68471288", "replies": []}, {"text": "Could only test on 5Ghz, but here is everything fine. \r\nRunning LeeDroid 2.4.2 on latest WWE-firmware.\r\nTest from about 9m and 2 Rooms away from the AP with a 50down/10up internet access:", "time": "1st September 2016, 05:37 PM", "postID": "post68479917", "replies": []}, {"text": "My WiFi is spot on, network connection is not on par with other devices, like samsung, iphone on the same network and same location, still connects but strength isn't the same.\nHTC has always been this way for me though.", "time": "2nd September 2016, 11:59 PM", "postID": "post68501578", "replies": []}, {"text": "hi everybody ,\r\ni bought Htc 10 , 10 days ago/\r\ni notice that 10 have really big problem with the WIFI connecting . i realized that many users have this problem.\r\ni'm  actually don't know what to do . \r\ni really love this phone and HTC , but this issue is too significant for me ! i use WIFI almost all the day.\r\ni'm asking here for information , advises and help \r\nis this issue happend because bad antena ? or lag software?\r\nis this issue could be solved by update software? \r\ni can try to use differte kernel and rom but if i'll do this and the issuue wont be solved i will not can sell this phone  because the ROOT /\r\ni dont know if take risk and root the phone , use different kernel. if ill do this and the issue will be solved , fine /\r\nbut if the issue wont be solved i will not can sell the devise /\r\nwhat are you thinking ? will be solved the issue ? \n\r\nby the way , my software is 1.92.709.1 - taiwan\r\ncan i use international roms for this version ? ( like roms which base on 195 eurpan version ?\n\r\ni haerd that the WIFI issue happent to OPO3 , AXON7 , HTC 10 - all the devises use snapdragon820...\n\r\ni have to find solution ! \r\nhave to hear what are you thinking about the root and if it'll help...\n\r\nThank u !", "time": "6th October 2016, 08:51 AM", "postID": "post69003503", "replies": []}, {"text": "my htc m9 in 6.0 is a beast , the htc 10 with 7.0 in the same location lost signal always", "time": "4th January 2017, 02:06 PM", "postID": "post70389576", "replies": []}]}, {"title": "Cellular strength and throughput", "rating": 4.5, "links": ["https://forum.xda-developers.com/htc-10/review/cellular-strength-throughput-t3361305"], "threads": [{"text": "While data connectivity appears to be quite solid on this device, for someone with a lot of knowledge in how RF performance works, I can say this device could use some optimizations.  I am seeing dBm readings on both AT&T/T-Mobile bands to be 3 to 5 dBm weaker in signal throughput vs the Galaxy S7 (carrier versions).  This means at the edge of signal, the device is much more likely to drop off than to hang onto a fringe signal.", "time": "25th May 2016, 02:21 PM", "postID": "post67019455", "replies": []}, {"text": "Will retest at home but the same sim in my old phone at home on my previous phone,  nexus 6P could get up to around 150mb down stream and over 45mb upstream.. Insane speeds for 4G..i haven't tested this as of yet but will do once I'm in the house,  just having a pint", "time": "25th May 2016, 04:31 PM", "postID": "post67021423", "replies": []}, {"text": "Signal quality is a step down when inside compared to previous phones I've owned. This phone has a hard time holding on to weak signal, especially when inside. My Note 5 and Turbo 2 did not have problems like the HTC 10 has.", "time": "30th May 2016, 05:22 PM", "postID": "post67095006", "replies": []}, {"text": "Here's my thread with my results.  Very little if not no difference to my Nexus 6p. \n\nhttp://forum.xda-developers.com/show....php?t=3388453\n\n---------- Post added at 11:58 PM ---------- Previous post was at 11:57 PM ----------\n\nThe metal chassis of this phone will impact performance however in the 4g tests,  no difference,  I've never had a lost call either.  All very good so far.", "time": "31st May 2016, 11:58 PM", "postID": "post67114205", "replies": []}]}, {"title": "Speakerphone (loudness, clarity)", "rating": 4.0, "links": ["https://forum.xda-developers.com/htc-10/review/speakerphone-loudness-clarity-t3361306", "https://forum.xda-developers.com/htc-10/review/speakerphone-loudness-clarity-t3361306/page2", "https://forum.xda-developers.com/htc-10/review/speakerphone-loudness-clarity-t3361306/page3", "https://forum.xda-developers.com/htc-10/review/speakerphone-loudness-clarity-t3361306/page5"], "threads": [{"text": "The speakers are very loud, specially in theater mode, it's perhaps 3x louder and more detailed than an A9", "time": "24th May 2016, 11:52 AM", "postID": "post67001765", "replies": []}, {"text": "When you hear music is good but not so loud that M8/M9 even M7, IN HEADPHONES ARE VERY VERY GOOD\r\nbut if you expect a good ringtone sound...forget it, in this configuration the ringtone only sound the lower speaker ( When the phone rings)\r\nthe ring call sounds muffled and very low, same for notifications, alarms and messages\r\ndon´t think place a song like ringtone.... this will be sound TERRIBLE", "time": "25th May 2016, 10:22 AM", "postID": "post67016621", "replies": []}, {"text": "I don't understand how people calling the speaker loud. I find it a bit opposite. While I cannot say the music coming out of the speakers is low (definitely can't call it loudest), the vocals or speech in the youtube videos are definitely not loud at all. I find quite hard time listening to youtube reviews videos in a room with a ceiling fan running. I am using Insertcoin Rom.", "time": "28th May 2016, 07:40 AM", "postID": "post67060518", "replies": [{"text": "I literally just got my HTC 10 today and I found this to be the case too... at first. I'm not sure what it was, but after updating YouTube, the volume went through the roof.", "time": "29th May 2016, 03:00 AM", "postID": "post67072054", "replies": [{"text": "Updating youtube solved the problem?", "time": "29th May 2016, 04:09 AM", "postID": "post67072536", "replies": [{"text": "It seemed to. I don't know if it was that or something else, but basically I was shocked at how soft the speakers were, then YouTube closed and updated, then I reopened and played music at a decent volume.\n\r\nWeird huh.", "time": "29th May 2016, 05:59 AM", "postID": "post67073237", "replies": []}]}]}]}, {"text": "it is much louder than other cells but it is my most fav cell phone \r\nregards Junaid Shahid", "time": "28th May 2016, 06:13 PM", "postID": "post67067295", "replies": []}, {"text": "Loudness to me seems quite average, but pretty clear and non-distorted. Then again, I don't think I thought the HTC 10 seemed that loud.", "time": "29th May 2016, 02:25 AM", "postID": "post67071830", "replies": []}, {"text": "Everybody noticed how top speaker is way to quiet comparing to bottom bass speaker? In Black Player EX to balance the both speakers even I need to lower the bottom speaker to about 15-20% to have them both at about same level.", "time": "29th May 2016, 10:20 PM", "postID": "post67084290", "replies": []}, {"text": "Volume is average. Not much louder or quieter than most phones I've had in the last few years. It certainly seems clearer though than other phones where their volume is definitely louder. (They tend to distort at high volumes, limitation of physics with space constraint within the phone.)", "time": "30th May 2016, 05:13 PM", "postID": "post67094875", "replies": [{"text": "??", "time": "1st June 2016, 07:06 AM", "postID": "post67117133", "replies": []}]}, {"text": "yes, the top speaker is designed for low frequencies and the bottom for bass, for this the upper speaker never will sound with the same power and for to balance you have to  apply more balance setting", "time": "1st June 2016, 04:04 AM", "postID": "post67115824", "replies": []}, {"text": "So many HTC10 users and no one bothers to check in 5 seconds if the top speaker is on purpose much more silent than bottom speaker in playing even a simple stock ringtone \n\n-_-", "time": "1st June 2016, 07:32 AM", "postID": "post67117355", "replies": []}, {"text": "With standard htc ringtones it seems to be otherwise you claim. Upper speaker gets higher volume. Probably reason is that htc intend to use trebble & whistle like ringtones which use more upper speaker involved in producing sound.", "time": "1st June 2016, 09:10 AM", "postID": "post67118301", "replies": []}, {"text": "I find the sound quality superb and the volume is spot on, this is a phone chaps, not a ghetto blaster.\n\nGet an amplifier and you'll see how good the sound quality really is.", "time": "1st June 2016, 07:02 PM", "postID": "post67125830", "replies": [{"text": "yes\nis the HTC 10 a phone or a music player? so was  the HTC one M8 a ghetto blaster?\nHow to you use a phone if you can´t hear it when ringing\nIf you want a music player and to connect a amplifier go to Baso, Ak, Cowon or another one DAC\n\n---------- Post added at 07:01 AM ---------- Previous post was at 06:56 AM ----------\n\n\n\r\nVery interesting, because this problem occurs in the unlocked version 4G in EU/ US with original firmware. But I have to see if another ROM can work to fix this issue. I rooted and used V4A without success", "time": "2nd June 2016, 07:01 AM", "postID": "post67132186", "replies": [{"text": "Lol OK son,  calm down.. The m8 was also a phone with two identical speakers, the m10 is not. \n\nAlso why can't you hear your phone?  I've not missed a call once are you always in a loud environment?\n\nAlso I do have an amp,  a good one at that and the audio through the HTC compares with some of the best I've ever heard..", "time": "2nd June 2016, 09:07 AM", "postID": "post67133374", "replies": []}]}]}, {"text": "The speakers are good for not being front facing. I just received my phone and switched over from the Nexus 6. There is a huge difference in sounds quality.", "time": "10th June 2016, 04:10 AM", "postID": "post67250935", "replies": []}, {"text": "In my opinion, my HTC M8 had much more fuller and a bit more volume than the HTC 10.", "time": "10th June 2016, 06:52 PM", "postID": "post67260400", "replies": [{"text": "totally agree", "time": "10th June 2016, 06:54 PM", "postID": "post67260429", "replies": []}]}, {"text": "I just got this phone and noticed when on a call that it sounds muffled.  Not clear like my S7 or iPhone did.  I'm on AT&T and since it's unlocked, not sure if its using LTE over voice or not.", "time": "13th June 2016, 08:18 PM", "postID": "post67303092", "replies": []}, {"text": "It´s not for your network or company, sadly when the phone rings only sound in the lower speaker (remember that it works only for bass), for this the sound is pretty bad\nSeveral threads in this and another XDA forums appoint this, nobody knows any fix or mod for to correct this", "time": "14th June 2016, 04:50 AM", "postID": "post67307608", "replies": []}, {"text": "BoomSound is SO loud, I know HTC are renowned for their speakers but it still took me by surprise. After watching an episode of The Grand Tour last night I was also impressed with the subtlety of the audio for a phone. As an aside the bundled earphones might even replace my Sennheiser's.", "time": "18th January 2017, 08:43 AM", "postID": "post70606718", "replies": []}, {"text": "My HTC 10 is having problem with ringtone and Notification sounds. Some times the ringtone and notification sounds do not work(It occurs 1 or 2 times in a day). At this time the video will not play, it show cant play this link. Same with you tube and I have to restart the phone in order to get sound back. If any one can help kindly leave a reply. My phone is having Android Nougat 7.0", "time": "25th January 2017, 12:51 AM", "postID": "post70714527", "replies": []}, {"text": "My HTC 10 speakers are not anywhere near as loud as the M8 or M9. They are so quiet, its more noticeable when in a voice call and using the loudspeaker. Compared to my Moto X they don't stand a hope even to my Meizu Pro 5  \r\nBut I didn't buy this phone for its loud speaker performance tbh\n\r\nThe speaker is simply not loud, so don't buy the phone if you think it is gonna be loud like the last 2 one M flagships and loud speaker performance is a must.", "time": "26th January 2017, 07:30 PM", "postID": "post70743798", "replies": [{"text": "I'm experiencing similar issues.  I am a speaker person.  I use the speakers on the 10 at least 2-3 times a day if not more to listen to music, phone calls, and watch youtube.  Like you, I came from moto x (pure), and I'll say this much, the volume on the moto x feels like it is 2 times louder, though the HTC 10 has slightly better sound quality.  I actually almost never blast my moto x to full volume where as with the 10, I think I'm almost always at full volume. every time i use the speakers on the phone. Where the HTC 10 shines is when you pair it with an expensive headphone.  Only on flights do I appreciate the HTC 10 more than the moto X.  The battery on the HTC 10 is also like 2x better than on the moto x.  I really wished the 10 was louder.  I'm happy with everything else the 10 has to offer, but unlike you I actually bought the 10 for its boomsound.    I still like the phone enough not to switch, but I would love this phone if the speakers were at least M9 standards.", "time": "27th January 2017, 10:15 PM", "postID": "post70761655", "replies": []}]}, {"text": "Don't get me wrong, I agree with the audio via the headphone jack! Hands down. Also with the battery life. Just wished the loud speakers were a bit louder. But coming from using a galaxy nexus, nexus 4 and 5 where those speakers were poop. Its not a deal breaker for me", "time": "28th January 2017, 07:44 AM", "postID": "post70765918", "replies": []}, {"text": "In my opinion, speakers are loud enough but only in silent environment. Listening to the max volume in bath with active exhaust fan or during a shower, playing YouTube on max volume in a car is manageable but not loud enough. My M7 was a bit louder but also nothing special.", "time": "28th January 2017, 07:53 AM", "postID": "post70765995", "replies": []}]}]