[{"title": "Overall love", "rating": 4.0, "links": ["https://forum.xda-developers.com/huawei-p20-pro/review/overall-love-t3769447"], "threads": [{"text": "Just got the phone today, overall it's ok,   coming from mate 9 I would say the camera is impressive but I need more time to test it out.", "time": "6th April 2018, 03:06 PM", "postID": "post76143801", "replies": []}, {"text": "Got the phone this afternoon and have had an initial play.\n\r\nI came from the Mate 10 Pro so know the EMUI system fairly well and many of the P20 Pro features are similar.\n\r\nSaw a tip from a reviewer to use night mode for all shots and gave that a go with some amazing results, really sharp with good colours in poor light indoors.\n\r\nI have listened to audio on the speakers and in landscape when it changes to stereo the sound is good, nothing like a Razer Phone but good.  Sound in portrait mode through the one speaker is only average.  \n\r\nThe Bluetooth audio seems so far to be an improvement over the Mate 10 Pro which had a horrible compressed almost 128k sound even playing 320k files through Deezer.  The P20 Pro seems much closer to the quality on the iPhone 7 which is great news so far but I will report back once I have tried some FLAC files on the internal audio app.\n\r\nOther than that the phone seems slightly quicker than the Mate 10 Pro, possibly due to the newer EMUI version.\n\r\nUpdates to follow after more time with it", "time": "6th April 2018, 05:07 PM", "postID": "post76145080", "replies": []}]}, {"title": "Community development strength", "rating": 0.0, "links": ["https://forum.xda-developers.com/huawei-p20-pro/review/community-development-strength-t3769448"], "threads": []}, {"title": "Overall speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/huawei-p20-pro/review/overall-speed-t3769449"], "threads": [{"text": "Firstly Google maps is fine, no issues whatsoever so can only assume this was a one off but the reviewer probably had a bad day..\n\r\nThe speed seems a little quicker than the Mate 10 Pro in use, so face unlock and app scrolling is great and in terms of using apps, really I don't care if the iPhone X or One Plus 5 loads a game 2 seconds faster its really not important to me.  If I am honest some of the reviewers seem to focus on the tiniest issue just to get a few more views or eek out their video for a minute longer and its not really objective.\n\r\nIf you benchmark this phone, it will not blow your socks off and if that's important to you then buy an iPhone but in everyday use so far nothing has crashed, apps have responded quickly and it performs how I would expect a flagship to.\n\r\nThe Mate 10 Pro I have benchmarked higher using the stock launcher than using Nova, yet Nova is widely regarded to improve performance so that probably explains how beneficial benchmarks are to 90% of the customer base..\n\r\nNo offence intended but I have been through this with Camera reviewers talking about performance and IQ etc when some of the best photos I see posted are taken on cameras 5 years old...", "time": "07 April 2018, 10:38 AM", "postID": "post76152485", "replies": [{"text": "Would agree,  Face unlock, scrolling and fingerprint sensor are very very quick.\n\r\nComing from a 3T I'm struggling to like the launcher though, so I installed Nova, was very impressed with the performance until I tried to drop a clock widget on the home screen. Nova then crashed and wont restart. I get a pop up from Smart Recovery wanting to uninstall Nova. I'm still hacking around to see what will fix it", "time": "07 April 2018, 11:37 AM", "postID": "post76152886", "replies": [{"text": "Just added a accuweather widget in Nova launcher (i use the pro version) and it seems ok just had to adjust size but its there and works. Which clock widget was it you tried?", "time": "07 April 2018, 11:50 AM", "postID": "post76152980", "replies": [{"text": "Yeah, I'm on the Prime version too. It was the default Huawei Clock & Weather widget. As I said, Nova had been fine, I'd done my first pass with setting the desktop grid, tweaking animations. etc. \r\nI've since wiped Nova's cache and it still wont restart. I'll wipe all the Nova data next and see if it'll start up no. \r\nI have submitted a crash dump to TeslaCoil, so I'll see if they come back with any suggestions", "time": "07 April 2018, 12:42 PM", "postID": "post76153383", "replies": [{"text": "Tried the nova weather and clock and it crashed Nova completely and came up with a critical error so seems like a generic issue", "time": "07 April 2018, 01:08 PM", "postID": "post76153612", "replies": []}]}]}, {"text": "Just tested this and yep, crashed Nova, but had no issues restarting app from Huawei launcher and then making it defaults again.", "time": "07 April 2018, 01:24 PM", "postID": "post76153737", "replies": []}]}]}, {"text": "Interesting that yet again using the stock launcher the Antutu score is 2000 points higher.  Also the P20 Pro is still way behind my old Mate 10 Pro on overall score despite having the same combo.  I know benchmarks are generally useless but it would suggest Huawei still have some performance optimisation work to do on the P20 Pro.", "time": "08 April 2018, 03:01 PM", "postID": "post76165240", "replies": []}]}, {"title": "App launch speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/huawei-p20-pro/review/app-launch-speed-t3769450"], "threads": []}, {"title": "Multitasking/RAM", "rating": 5.0, "links": ["https://forum.xda-developers.com/huawei-p20-pro/review/multitasking-ram-t3769451"], "threads": []}, {"title": "Scrolling smoothness", "rating": 3.0, "links": ["https://forum.xda-developers.com/huawei-p20-pro/review/scrolling-smoothness-t3769452"], "threads": [{"text": "Lol just you... i have this Phone and no lag, no freeze, all run perfect.", "time": "07 April 2018, 09:00 PM", "postID": "post76158092", "replies": []}, {"text": "Ditto", "time": "07 April 2018, 10:40 PM", "postID": "post76158775", "replies": []}, {"text": "Ok guys, record your screens and show us how smooth your P20 PRO are!?!?", "time": "07 April 2018, 10:47 PM", "postID": "post76158815", "replies": []}, {"text": "Because without your approval, our lives will be incomplete  \n\nRelax dude. My phone is perfectly smooth and this is me coming from a pixel 2. If you don't like it, return it.", "time": "08 April 2018, 09:27 AM", "postID": "post76162533", "replies": []}]}, {"title": "Heat", "rating": 4.0, "links": ["https://forum.xda-developers.com/huawei-p20-pro/review/heat-t3769453"], "threads": []}, {"title": "Low light", "rating": 5.0, "links": ["https://forum.xda-developers.com/huawei-p20-pro/review/low-light-t3769454"], "threads": [{"text": "Taken using night mode with 5second exposure.", "time": "6th April 2018, 03:08 PM", "postID": "post76143818", "replies": []}, {"text": "it's good but i'm not blown away like some.\n\non closer look the images are all very soft", "time": "6th April 2018, 11:45 PM", "postID": "post76148473", "replies": [{"text": "The fact that the photo taken with limited light and shaky hand after gym, I'm quite impressed. But the photo does look like too much post processing involved and on the soft side.", "time": "07 April 2018, 12:41 AM", "postID": "post76148767", "replies": []}]}]}, {"title": "Photo quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/huawei-p20-pro/review/photo-quality-t3769455"], "threads": [{"text": "P20 Pro vs Pixel 2 XL...\n\nI have both devices currently and from my very brief short time with the P20 pro , the pictures taken with it don't even come close to the quality you can get from the Pixel 2 XL.\nPlease tell me its just a case of faulty software, else I think I may be taking this phone back sadly.\n\nProblems so far\nImages lack any real detail and are very soft\nHDR mode still hidden\nNight Mode whilst great is still a 4 sec picture.. (but still soft ) - (The advantage you get from those 4 secs does not seem worth it from my quick test - but i'll keep testing)\nCamera UI is rubbish... (subjective i know)\n\nBut it will be interesting to know if anyone else as similar experiences , as most reviewers online appear to suggest that this is the best camera phone ever!\n\n---------- Post added at 09:41 AM ---------- Previous post was at 09:40 AM ----------\n\nSoft images.", "time": "07 April 2018, 09:41 AM", "postID": "post76152021", "replies": []}, {"text": "Have taken a few shots with the camera, the modes are the same pretty much as in the Mate 10 Pro so you have fully manual \"Pro Mode\" which shoots RAW plus a range of features including;\nHDR\nLight Painting\nMonochrome\nAperture\nPortrait\nNight Shot\nPanorama\nThe beauty mode is now a lot less aggressive on 0 setting and in portrait mode you can get some amazing detail and shallow depth of field.\n\r\nThe overall star is night shot which takes a 3 second long exposure which is fully stabilized and its like a super HDR setting which blows away the Mate 10 Pro I had before.  Even using zoom (pinch to zoom on screen is enabled) the level of detail and depth is like using a dedicated camera.\n\r\nI think with photography and equipment there is a large element of variation in the skill of the reviewers and unless you have both cameras in identical circumstances which is nigh on impossible, its difficult to be fair to compare.  A lot of reviews I have seen go on about the AI not being perfect, which it isn't yet on any phone but its nice that this technology is developing to allow better shots for average Joe.\n\r\nI normally use a full frame Sony Alpha and I can honestly say so far the image quality I am getting on the P20 Pro is the best of any phone I have used.\n\r\nI cant comment on the XL but I have owned the Mate 10 Pro, Note 8, S8+ and IPhone 7 all recently and although these are all good phones with great cameras the shots I have got out of the P20 Pro so far have impressed me a lot more.\n\r\nAs a side note personally I would never use any of the AI modes except Night Shot, I never use the AI enabled render modes which is where many of the reviewers have had problems because its not a perfected science yet.", "time": "07 April 2018, 10:27 AM", "postID": "post76152383", "replies": []}, {"text": "This is a good phone to benchmark the camera chops of the reviewer, those who can actually do anything more than point n shoot photos are taking amazing shots with this phone. I'm stunned how good a lot of the shots are.", "time": "08 April 2018, 01:47 AM", "postID": "post76159811", "replies": []}]}, {"title": "Video quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/huawei-p20-pro/review/video-quality-t3769456"], "threads": []}, {"title": "Selfie quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/huawei-p20-pro/review/selfie-quality-t3769457"], "threads": []}, {"title": "Time to take picture (camera launch speed)", "rating": 5.0, "links": ["https://forum.xda-developers.com/huawei-p20-pro/review/time-to-picture-camera-launch-speed-t3769458"], "threads": [{"text": "I am interested in this phone, just learned about it yesterday - about the three-camera setup in the back. What is the quickest way to launch the camera on this phone if screen is off? I came from Moto phones, they have the double-twist to launch, and now I am using HTC U11, which has the squeeze feature. I know Android has double-tap on power button to launch camera, but that's just not fast enough for me, compared to the other two ways I mentioned.", "time": "6th April 2018, 07:42 PM", "postID": "post76146638", "replies": []}, {"text": "You double press the volume down key to launch camera.\nstrangely by default this option will also take a picture at the same time which is silly, but you can turn this off.\n\nP.S its more than fast enough to launch camera this way.\n\n(i also had a htc u11 and currently a pixel 2 xl and p20 pro)\n\n---------- Post added at 09:25 AM ---------- Previous post was at 09:24 AM ----------\n\nVery fast - no complains about time to take picture", "time": "07 April 2018, 09:25 AM", "postID": "post76151898", "replies": []}]}, {"title": "Software (ease of use, features, etc)", "rating": 4.0, "links": ["https://forum.xda-developers.com/huawei-p20-pro/review/software-ease-features-t3769459"], "threads": [{"text": "not that impressed by the camera software to be honest.\n\r\nIts frustrating having to leave the viewfinder in order to change a setting.\n\r\nThe fact that HDR is kinda hidden is crazy IMO", "time": "07 April 2018, 09:26 AM", "postID": "post76151922", "replies": []}, {"text": "Not to mention the slow Mo video is so difficult to get the object in the frame. They should have an option to select the frame we needed and also not limited the video to 10s.", "time": "08 April 2018, 12:41 PM", "postID": "post76164041", "replies": []}]}, {"title": "Charging speed", "rating": 4.0, "links": ["https://forum.xda-developers.com/huawei-p20-pro/review/charging-speed-t3769460"], "threads": []}, {"title": "Screen on time", "rating": 5.0, "links": ["https://forum.xda-developers.com/huawei-p20-pro/review/screen-time-t3769461"], "threads": []}, {"title": "Standby drain", "rating": 5.0, "links": ["https://forum.xda-developers.com/huawei-p20-pro/review/standby-drain-t3769462"], "threads": [{"text": "Had my p20 pro yesterday.  Turn on Ultra Battery when i go to bed at about 2300 with 69% battery.  Wake up this morning at 0700 with 42% battery.", "time": "07 April 2018, 12:41 AM", "postID": "post76148769", "replies": []}, {"text": "See attached Screenshot.\n\nNothing changed like doze settings or smth.\nSleeping like a baby (25 min Sot) wifi and lte.", "time": "07 April 2018, 05:58 AM", "postID": "post76150546", "replies": []}, {"text": "Got phone yesterday. It had been charging sontooknit off charge when I went to sleep. 7 hours later it had only dropped 4% 96%.", "time": "07 April 2018, 07:36 AM", "postID": "post76151072", "replies": []}]}, {"title": "Heavy use endurance", "rating": 4.0, "links": ["https://forum.xda-developers.com/huawei-p20-pro/review/heavy-endurance-t3769463"], "threads": []}, {"title": "Light use endurance", "rating": 5.0, "links": ["https://forum.xda-developers.com/huawei-p20-pro/review/light-endurance-t3769464"], "threads": []}, {"title": "\"Look\" of the device (aesthetics)", "rating": 4.0, "links": ["https://forum.xda-developers.com/huawei-p20-pro/review/look-device-aesthetics-t3769465"], "threads": []}, {"title": "Quality feel (use of materials)", "rating": 4.0, "links": ["https://forum.xda-developers.com/huawei-p20-pro/review/quality-feel-materials-t3769466"], "threads": []}, {"title": "Ergonomics (in-hand feel)", "rating": 5.0, "links": ["https://forum.xda-developers.com/huawei-p20-pro/review/ergonomics-hand-feel-t3769467"], "threads": []}, {"title": "OEM skin/software", "rating": 4.0, "links": ["https://forum.xda-developers.com/huawei-p20-pro/review/oem-skin-software-t3769468"], "threads": []}, {"title": "Outdoor visibility (max brightness)", "rating": 5.0, "links": ["https://forum.xda-developers.com/huawei-p20-pro/review/outdoor-visibility-max-brightness-t3769469"], "threads": [{"text": "I struggled a little yesterday with visibility on max brightness in very bright conditions outdoors .  I would say the Samsung screen has the slight advantage over the P20 Pro outdoors on the Note 8 as does the iPhone 7..", "time": "08 April 2018, 02:48 PM", "postID": "post76165119", "replies": []}]}, {"title": "Contrast (true blacks)", "rating": 5.0, "links": ["https://forum.xda-developers.com/huawei-p20-pro/review/contrast-true-blacks-t3769470"], "threads": []}, {"title": "Color saturation & accuracy", "rating": 5.0, "links": ["https://forum.xda-developers.com/huawei-p20-pro/review/color-saturation-accuracy-t3769471"], "threads": []}, {"title": "Clarity/resolution", "rating": 5.0, "links": ["https://forum.xda-developers.com/huawei-p20-pro/review/clarity-resolution-t3769472"], "threads": []}, {"title": "Minimum brightness", "rating": 5.0, "links": ["https://forum.xda-developers.com/huawei-p20-pro/review/minimum-brightness-t3769473"], "threads": []}, {"title": "Call quality", "rating": 5.0, "links": ["https://forum.xda-developers.com/huawei-p20-pro/review/call-quality-t3769474"], "threads": [{"text": "the sound is very clear, i use it since yesterday and it's better than on my S6", "time": "5th April 2018, 09:49 AM", "postID": "post76129916", "replies": []}]}, {"title": "WiFi strength, range, and throughput", "rating": 5.0, "links": ["https://forum.xda-developers.com/huawei-p20-pro/review/wifi-strength-range-throughput-t3769475"], "threads": [{"text": "This is my second Huawei and the WiFi strength is definitely lower than other phones. I found this a problem on my mate 10. Time will tell how much of a problem this is for me. It only happens when further away from router so won't affect anyone in a smaller house. Wil do some comparison s tomorrow with my HTc u11+ which I know has a better strength at distance.", "time": "6th April 2018, 11:22 PM", "postID": "post76148328", "replies": []}]}, {"title": "Cellular strength and throughput", "rating": 5.0, "links": ["https://forum.xda-developers.com/huawei-p20-pro/review/cellular-strength-throughput-t3769476"], "threads": [{"text": "the signal is very good i have much more signal in my room than my S6 had", "time": "5th April 2018, 09:52 AM", "postID": "post76129944", "replies": []}, {"text": "so far better than my s7 edge, for example in my room i used to get 1 bar 4G now i get full 4G signal", "time": "6th April 2018, 08:05 PM", "postID": "post76146861", "replies": []}, {"text": "Good signal with Three UK middle of Butlins holiday park in a bar and a solid 4/5 bars and speed test of 25Mb", "time": "07 April 2018, 01:37 PM", "postID": "post76153844", "replies": []}, {"text": "I've got a poor Three signal at home whichever phone I use, but WiFi calling kicks in via my home AP and the quality is very good. The WiFi calling came as a very pleasant surprise.", "time": "07 April 2018, 03:02 PM", "postID": "post76154655", "replies": [{"text": "Did you purchase your phone from Three?", "time": "07 April 2018, 05:37 PM", "postID": "post76156196", "replies": [{"text": "Yes,  but the phone doesn't seem to be branded in anyway that i can see, so I'm guessing it's standard functionality that's just enabled by the SIM", "time": "07 April 2018, 05:45 PM", "postID": "post76156291", "replies": [{"text": "Thanks. I am thinking of getting one but I'm the same as you. Three signal at home is hopeless so wifi calling is a must for me.", "time": "07 April 2018, 05:52 PM", "postID": "post76156361", "replies": []}]}]}]}, {"text": "Better than my S9+ with better bandwidth...", "time": "07 April 2018, 05:33 PM", "postID": "post76156154", "replies": []}, {"text": "Great reception! Much better than my iPhone X! I have signal everywhere with ee and WiFi calls as well", "time": "08 April 2018, 02:33 PM", "postID": "post76164988", "replies": []}]}, {"title": "Speakerphone (loudness, clarity)", "rating": 4.0, "links": ["https://forum.xda-developers.com/huawei-p20-pro/review/speakerphone-loudness-clarity-t3769477"], "threads": [{"text": "https://www.youtube.com/watch?v=WVB5ixWHbPA\n\nUh oh", "time": "5th April 2018, 10:31 AM", "postID": "post76130251", "replies": []}, {"text": "did they turn on dolby atmos?", "time": "6th April 2018, 07:44 AM", "postID": "post76140376", "replies": []}, {"text": "I've got it now and yea Atmos cannot be disabled when using speakers. It's really not good compared to the s9", "time": "6th April 2018, 12:07 PM", "postID": "post76142208", "replies": []}, {"text": "very good, loud and clear even when driving with the phone on my lap (for phone calls) \n\nEDIT: for youtube and movies is very loud and clear with good details ( compared to my s7 edge), watched some Dolby atmos videos on youtube and the surround/stereo effect is very good", "time": "6th April 2018, 07:53 PM", "postID": "post76146740", "replies": []}, {"text": "it will be interesting to compare with the galaxy s9 plus that has great speakers", "time": "6th April 2018, 11:29 PM", "postID": "post76148376", "replies": []}, {"text": "No contest, the s9 plus wins\nCompared both sides by side and it's not even close", "time": "07 April 2018, 07:48 AM", "postID": "post76151141", "replies": []}]}]