[{"title": "Overall love", "rating": 4.5, "links": ["https://forum.xda-developers.com/mi-5/review/overall-love-t3348468", "https://forum.xda-developers.com/mi-5/review/overall-love-t3348468/page2", "https://forum.xda-developers.com/mi-5/review/overall-love-t3348468/page3", "https://forum.xda-developers.com/mi-5/review/overall-love-t3348468/page7"], "threads": [{"text": "Very good phone for the price, now i have to remove the bloatware to get a perfect phone.", "time": "31st March 2016, 10:57 PM", "postID": "post66135069", "replies": []}, {"text": "I'm in love since i got it, really amazing device, but like all says, i need to remove the bloatware, but still being a monster.", "time": "31st March 2016, 11:16 PM", "postID": "post66135261", "replies": []}, {"text": "Deleted", "time": "1st April 2016, 03:12 PM", "postID": "post66145065", "replies": []}, {"text": "Have had the phone for a couple of days now, and I really like the phone, but there is a few problems.\n\r\n- Still some Chinese text here and there\n - Unable to connect to PC. Device not recognized by two win10 computers.\r\n- Lock screen, unable to turn of the roll of Chinese pictures. \r\n- Play Store, unable to update or download via mobile network, only via wifi\n\r\n- Clock widgets tend to not being synchronized with phone clock.  They stop showing correct time", "time": "3rd April 2016, 10:22 AM", "postID": "post66171032", "replies": [{"text": "Hi, I can solve some problems for you.\n\r\nLock screen roll of pictures. Normally you can disable it if you put a wallpaper for lockscreen. Or to click on the small icon in the top right corner of your lockscreen.\n\r\nPlay Store, not able to download on mobile network. You need to disable the download limit in the settings of the \"downloads\" app.", "time": "20th April 2016, 01:33 PM", "postID": "post66459584", "replies": [{"text": "for the clock widgets, i think you need to add the widget app to autostart in the secuity app..\r\nalso chinese will be removed when install the global stable..\r\nchinese rom will have chines here and there", "time": "5th June 2017, 07:23 PM", "postID": "post72560410", "replies": []}]}]}, {"text": "These are very unique type of Mobiles that i ever see in mobile market. Here in Pakistan Xiaomi Mobiles are coming Soon. The first look i explored on the internet was quite amazing. I am keeping its rank after i phone luxury looks and feel.I will definitely buy this phone if prices would not so high.", "time": "20th April 2016, 06:27 AM", "postID": "post66454749", "replies": []}, {"text": "Love the phone, thought the build quality was excellent BUT my daughter dropped it and the case has split. I dropped my htc one, galaxy s, nexus 4 and a whole host of other phones a 100 times and there was no problem. Really disappointed \n\nOnly other major issue is the phone gets locked out \"this phone has been lost\" many many times a day. Sometimes i cannot use it for hours at a time because activation does not work.", "time": "23rd April 2016, 04:25 PM", "postID": "post66510587", "replies": [{"text": "That's a real bummer to hear  hope that you can get it fixed somehow. \nDo you mean that the glass back had split?", "time": "23rd April 2016, 11:46 PM", "postID": "post66515920", "replies": [{"text": "When she dropped it, it hit the top right corner. The metal body is VERY weak apparently (see bend tests), so soft it pushed in. So now the back glass panel on that corner is separated from the aluminium frame. It always felt fragile, the glass is so smooth is slides off even grippy surfaces!  BUT it is meant to be a flagship top of the market phone so i did expect more. This is the problem when one of the largest smart phone producers doesn't sell in the internet exclusion zone (Australia & NZ). No repair centres, no accessories in stores probably no warranty. Long wait for new cables, cases and anything else. \n\r\nI'm starting to see LOTS of software issues now too, MIUI has always been that way though. Be good when some custom roms come out. I guess you get what you pay for. It's no Galaxy s7, HTC one or LG that's forsure. \r\nBuyers remorse right now haha...\n\r\nOh, 3 days old too... (not my daughter, the phone )", "time": "24th April 2016, 12:12 AM", "postID": "post66516135", "replies": []}]}]}, {"text": "Having brands like Samsung, LG and others ask so much for their flagship phones is not an excuse, they sometimes cost 4 times less to build than they sell for. \nBut thinking you actually get a top of the line phone for prices like these (not talking about the prices those online import shops ask for the devices when you're not living in asia, but the actual prices Xiaomi sells the phones for) there has to be some compromise... this time it's mainly the build strength. \nThe moment you get this phone, GET A CASE asap! You don't want to break it when accidentally sitting on it :'(\n\nWant a less break prone version? Get the 128 ceramic version. \nGot the phone damaged? YouTube hugo barra tearing a mi5 apart, good reparability.\n\nLove this phone! But you have to handle it like a Chinese vase!", "time": "20th May 2016, 05:27 AM", "postID": "post66936404", "replies": []}, {"text": "Love this phone. I was skeptical at first as their past phones were less than stellar imo but the specs at this price point was too good to pass up.\n\r\nHave had it for around 2 weeks now, and though still minor quirks with software here and there, all around very happy and haven't run into any major issues. \r\nGreat battery life as well. As to be expected, the body is quite fragile but as I'm very careful with my belongings, I don't think I'll be dropping it *knock on wood*\n\r\nThe Mi 5 will be replacing my S7 - call me crazy, but the only downside (only  taking into consideration features I use) I've found so far is that the camera is obviously worse. No biggie since I always bring my DSLR for any proper events, and this way I can save some money.", "time": "4th June 2016, 07:15 AM", "postID": "post67162689", "replies": []}, {"text": "I've bought a Xiaomi Mi 5 Pro 128 GB (at tradingshenzhen.com)\nI've unlocked bootloader, TWRP, rooted, and installed Mi 5 Global Developer Rom 6.5.30 (recently updatet itself to MIUI 8 6.8.11)\n\nThe Hardware looks and feels nice. Only negative point I could mention: After some days of use I recogniced a clicking sound when I softly push the center of the backside glas (ceramic). \n\nThe Software in my opinion can compete with Samsung (there I have the direct comparison) and other brands. In some Points it's better, in some points it's a little behinde the concurence. \n\nMy impressions in detail:\nPositive:\n+ An amazing feauture added in 6.8.11 is the \"Dual Apps\" function in the settings menu. If you have dual sim, thats a extreamly important feauture. Otherwhise you cannot use WhatsApp on both Numbers. Whit MIUI 8 you can. And this whitout using WhatsApp clones as WhatsAppGB (which I used bevore MIUI 8). (I don't know if other DualSim Devices have this feauture)\n+ I've bought the Nillkin Backcover (black) and the Nillkin Flipcover. (Dark Grey) Both are great but the Flipcover is quite glossy, what I dont like.\n+ I've bought an USB-C to USB 3 (female jack) cable to connect external storage (for TWRP-Backup etc.) and other devices. I wasn't able to save the TWRP-Backup direct on the external storage, so I made an internal backup and copied it to an external fat-harddrive. The main thing is, that I have an external backup (whitout MicroSD-Cardslot a little challange)\n+ IR Sensor to controll HiFi and TV! ZaZa remote is my favourit App to use it.\n\nNegative:\n- No possibility to distinguish the SMS-Inbox of the two mobilenumbers. Sure, there is this little \"1\" or \"2\" behind the date. But what I would like to see is a \"Dual App\" for the Messages-App, a possibility to filter the messages by mobilenumber or two tabs on top of the Display where I can choose the two SIM-Cards. Anything like that would be verry nice! \n- MIUI don't give me the possibility to add an App-Link into two different folders on the homescreen =(\n- No support of ExFat formated storage via USB-C (nor NTFS or HFS+) Any tip to solve this is verry welcome!\n- E-Mail App does allow me to add different arriving IMAP and outgoing SMTP server but have NO possibility to add a different login for these two servers. A verry important feauture for me. (My Samsung was able to make this difference). Any hint is verry welcome! I've tried some other E-Mail Apps but didn't find one that can handle all my needs.\n- No MicroSD Cardslot. You could say it's not necessary when you have 128GB internal storage, but for example the backup-process would be easyer with it.\n\nFazit:\nAlltogether I am happy with my new device. It is, what I was looking for. The devices helps me to disassociate Job and Personal contacts whitout a second mobile. In some Videos i've seen, that it is more or less repairable and the replacement parts are available in the \"bay\", an important criterion I guess.\n\nEdited:\nWhen I was writing text, I had this annoying red lines under words which weren’t known by the System. I wasn’t able to find a menu-point to switch them off. My search engine helped me out with this Link. You have to open an adb shell and enter „settings put secure spell_checker_enabled 0“. With „settings put secure spell_checker_enabled 1“ you can switch them back on, if needed.", "time": "14th August 2016, 05:51 PM", "postID": "post68186017", "replies": [{"text": "Thanks for your review. \r\nWhat are the features of the e-mail app that make it superior to other e-mail apps such as Gmail, Cloud Magic or Blue Mail ?", "time": "30th August 2016, 02:08 PM", "postID": "post68444061", "replies": [{"text": "I've listet the eMail App as an negative point, so no superior things. The point is, that I was looking for a Mail App which chould cover my needs some years ago, and didn't found one. When I bought the Mi5 I just tried the wrong apps. BlueMail works great for my needs, thanks a lot for the hint!!! Cloud Magic I wasn't able to configure a different SMTP login (the function is existent, but it didn't accepted my server).\n\n---------- Post added at 12:22 PM ---------- Previous post was at 12:14 PM ----------\n\n\n\r\nNice, that its working with your config. Could you tell me/us which version of TWRC you are using? Maybe my cable is the problem, where did you got yours? Kind regards", "time": "1st September 2016, 01:22 PM", "postID": "post68475951", "replies": []}]}]}, {"text": "Really happy with mine after 3 months, had a bit of pain getting off the vendor rom and figuring out all of the battery optimizations and over zealous permissions. \r\nOnce I sorted all of that threw the google now launcher (app drawer back ,Yuss !) on it and very happy. Super snappy after my nexus 5x and the camera is great. Low light could be better but you just use the HHT low light mode and its all good. Battery life is great, I am usually at around 40% after a full day. used a nilikin case from the start and love it, the size and weight is perfect. \r\nThe rear fingerprint sensor on the nexus was way better but the mi5 but that is mostly positioning, in my opinion rear sensor wins. Great phone and very happy with it, the only issue was software niggles which are getting better and better.", "time": "17th August 2016, 12:02 AM", "postID": "post68221568", "replies": []}, {"text": "Loving mine too. Really impressive phone for the price.", "time": "19th August 2016, 06:04 PM", "postID": "post68265626", "replies": []}, {"text": "I have the phone with international ROM, camera is very good. But it has some bugs.. Like Bluetooth and Gmail connection which sometimes fails and always connected to Mi stuff which i dont like.Its not that fast either, im thinking to try out the nexus 5x because its in the same price region.", "time": "19th August 2016, 09:38 PM", "postID": "post68268536", "replies": []}, {"text": "Just updated  to Miui V8.. I will watch out for bugs.", "time": "30th August 2016, 08:39 PM", "postID": "post68449948", "replies": []}, {"text": "@onestyle,  TWRP backup by OTG works fine, I use pendrive and I did not see any problems.\n\nWytapatalkowane z Mi 5", "time": "31st August 2016, 07:03 AM", "postID": "post68455964", "replies": []}, {"text": "I have TWRP from there:\n\nhttp://miuipolska.pl/forum/index.php...iałające-OTG\n\nwith this:\nUSB3.1 Type C Male to USB3.0 A Female Adapter Converter OTG for XIAOMI MI4C\nhttps://banggood.app.link/vTcdN7AAjw\n\nWytapatalkowane z Mi 5", "time": "1st September 2016, 01:40 PM", "postID": "post68476286", "replies": []}, {"text": "not for typical user out of the box user, the os still have some bug.\n\r\nneed to tweak manually in order to have fully functional daily use.", "time": "8th September 2016, 02:42 AM", "postID": "post68580806", "replies": []}, {"text": "Hi.i will be quick as there is no many bad things to say to this great phone.im a phones lover who had 80 smartphone before this mi5 and I can say the most impressive things are the very great battery life compared with its lightweight ,it's great design and the loudness with the 1more earphones and more.\nthe only things that I'm not happy and don't feel ok with it is that I don't like to fit the cases but with this phone I have to because it has not grip and it's so delicates,t he second is that the system close up all the background applications which is not fair compared to its specs but at the end of the day it's not so hard to live with.the last is the speaker volume which is not enough for my needs.i still remember the mi note damn but it was too big!!!!", "time": "26th September 2016, 05:49 PM", "postID": "post68869323", "replies": []}, {"text": "Yes it is a great phone and cheap! I always had Galaxy phones \nbut now i think i will stay with xiaomi for the next time", "time": "28th September 2016, 11:12 AM", "postID": "post68893833", "replies": []}, {"text": "I bought my Mi5 Pro (the black ceramic variant) at tradingshenzhen.net and flashed TWRP and CyanogenMod after 7 days or so when I had unlocked it. I can not say much about the software other than a big shoutout to all developers who helped getting CM rocking. \nAbout the Hardware: It feels better than any other phone out there. Very premium and the ceramic back seems impossible to break. They did a good job there. Unfortunately the phone is *very!* slippery, but I got used to that quickly. The biggest disappointment is the stability of the metal frame. I see my phone as a device to use and enjoy, so I wouldn't put a cover on it. I dropped it once or twice and I have a concrete floor at home, so it has very visible scratches (not on the ceramic or glass but on the metal frame!) and the metal frame even bended so much that the ceramic doesn't fit 100% anymore.\nObviously, performance and features are a dream and can be compared with an S7 (I have direct comparison). I am especially happy with the camera, which shoots gorgeous pics as long as there is enough light. Features implemented in software are not a thing for me, because I would use AOSP-based ROMs on every device.\nI previously had Aldi Talk as a carrier, but I managed to get a very cheap 6GB high speed data SIM from Telekom, so I now use Aldi Talk prepaid for calls and texts and Telekom for data. All the carriers in Germany use LTE band 20 for the rural areas, but Telekom has higher frequencies everywhere where I need it. \nAlso the GPS is very quick unlike Mi4's GPS.\n\nOverall I am happy that I could get such a premium and full-featured device for the money I had. Probably the S7 has some advantages, but they are so minor, that I would've bought the Mi5 even when I had more money to spend. The biggest doubt when buying my next Xiaomi phone will be the late release of the kernel sources. Fortunately for their Qcom-based devices they do release the source at some point.", "time": "6th October 2016, 05:29 PM", "postID": "post69009549", "replies": [{"text": "Hope to get official CM rom soon, with touch home button, else i guess op3 maybe a better choice...", "time": "10th October 2016, 12:32 PM", "postID": "post69059917", "replies": []}]}, {"text": "I've seen lots of post talking about this phone. And most of them are bad reviews. Specially about GPS and battery issues has any of you faced these problems? \nI was ready to get this phone but I really need an accurate GPS for running and well battery life is important too. And now reading thru this post I feel a bit confused about it. Do you guys recommend to get this phone?", "time": "24th October 2016, 03:38 PM", "postID": "post69284823", "replies": [{"text": "After setting to high performance mode for apps, the GPS Problem for tracking apps (like RidewithGPS,Runkeeper) was fixed. Battery issue ? Never had any problems.", "time": "24th October 2016, 09:44 PM", "postID": "post69290522", "replies": [{"text": "Batterylife is awesome! GPS i dont use", "time": "29th October 2016, 08:23 AM", "postID": "post69358586", "replies": []}]}, {"text": "Perhaps it's location dependent or something else. Never had any GPS problem since I was still using RR until now with MIUI EU, it's a great navigator with google maps. Battery issues? Err...nope. It lasts at least a day and is fully charged in 90 minutes. The only battery issue I have is because it lasts too long it often has low battery when I was not around a place where I can charge it", "time": "25th October 2016, 07:23 PM", "postID": "post69305145", "replies": []}]}, {"text": "This device is awesome!!", "time": "24th October 2016, 08:43 PM", "postID": "post69289604", "replies": []}, {"text": "Moving from iPhone to mi 5 , simply I loved it as much as I loved my iPhone", "time": "2nd June 2017, 05:53 PM", "postID": "post72524196", "replies": []}, {"text": "I switched to Mi5 (Black 3/64GB) from Huawei P9 Lite and I'm amazed.. I got the most smooth experience ever, great development support, active and nice community, also the phone is very good looking (black version). I will probably keep this phone for a long time.", "time": "6th June 2017, 06:59 PM", "postID": "post72572530", "replies": []}, {"text": "Xiaomi Mi every time they come up with new phones with exciting features, I really love this phone.", "time": "14th July 2017, 06:02 AM", "postID": "post73021841", "replies": []}, {"text": "loved it much, since i replaced stock bloated MIUI .. changed to AOSPA + Stock gapps and boooh.. feels like the lost nexus series on my hand.", "time": "18th July 2017, 05:44 PM", "postID": "post73077884", "replies": []}, {"text": "It's Best", "time": "1st August 2017, 10:58 AM", "postID": "post73248129", "replies": []}, {"text": "Does display have 2.5d glass?", "time": "3rd September 2017, 11:09 PM", "postID": "post73653729", "replies": [{"text": "Nope. But the lack of 2.5d glass means you can install a protector over the whole of the screen, so I'm glad (even though 2.5d looks beautiful).", "time": "10th January 2018, 05:50 PM", "postID": "post75151055", "replies": []}]}]}, {"title": "Community development strength", "rating": 4.0, "links": ["https://forum.xda-developers.com/mi-5/review/community-development-strength-t3348469", "https://forum.xda-developers.com/mi-5/review/community-development-strength-t3348469/page2"], "threads": [{"text": "without the sources the development of this device is very small.", "time": "12th July 2016, 03:54 PM", "postID": "post67713230", "replies": []}, {"text": "xiaomi are shooting themselves in the foot by not releasing !!", "time": "13th July 2016, 10:41 AM", "postID": "post67724566", "replies": []}, {"text": "Hey don't forget they allow you to unlock bootloader and this is big plus for them  not always the can release source,  and they did that in 2015 http://www.xda-developers.com/xiaomi...ernel-sources/ but anyway right now i`m on cm-13.0-20160713-UNOFFICIAL-gemini.zip and its very good BTW. daily driver.", "time": "16th July 2016, 05:11 PM", "postID": "post67772362", "replies": []}, {"text": "The fact that Xiaomi doesn't release the complete sources makes it much harder to have a great number of devs building ROMs, Kernels, and other stuff. This device is great, has great potential and has also great potential to have a great community of developers behind it. Related to MIUI interface, the Xiaomi.eu community is great, by providing weekly and stable builds, bloatware-free, translated and optimized mainly for europeans. CyanogenMod, AOSP based ROMs will suffer and being updated slowly until the complete sources aren't released. That has mainly to do with Xiaomi. If the release happens, the dev community will approve and begin to build more stuff to this device.\n\nMy note: 3 stars.", "time": "5th November 2016, 12:45 PM", "postID": "post69471336", "replies": []}, {"text": "The complete sources is not released yet for mi5?", "time": "9th November 2016, 04:27 AM", "postID": "post69529162", "replies": [{"text": "AFAIK not yet. So are the devs behind LOS still waiting for the blobs to make the SIM on/off switch work.", "time": "5th February 2017, 01:29 AM", "postID": "post70883000", "replies": []}]}, {"text": "On los 06.02.2017\nEverything is fine", "time": "6th February 2017, 11:31 PM", "postID": "post70911368", "replies": []}, {"text": "The developement is moderate but thats not because the device is not popular, there are still some missing codes from xiaomi. We are just 1 week away from getting the new Mi6 so hopefully this will speed up the release of the full source code.\n\r\nI really like the things that are already up especialy the LOS", "time": "20th April 2017, 04:04 PM", "postID": "post71948260", "replies": []}, {"text": "Friends, I am thinking about getting this device. Would it be wise to purchase this in 2018? Or would you suggest something else. I really like the form factor, the device being handy.", "time": "7th March 2018, 04:57 PM", "postID": "post75806374", "replies": [{"text": "yep bro me too  but its not there in india now , will have to import it somehow :?", "time": "10th March 2018, 02:32 PM", "postID": "post75839316", "replies": [{"text": "you could check if there is someone willing to sell a decent used device. You will also get it very cheaply given that resale value for xiaomi phones drops drastically.", "time": "13th March 2018, 12:27 PM", "postID": "post75873680", "replies": []}]}]}]}, {"title": "Overall speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/mi-5/review/overall-speed-t3348470"], "threads": [{"text": "The speed fluctuates, sometimes is ok, sometimes just lag like hell. not sure if it related to MIUI.", "time": "3rd November 2016, 11:33 AM", "postID": "post69439800", "replies": []}, {"text": "When its cool - phone delivers very fluid experience but once it overheats it can become pretty choppy.", "time": "29th November 2016, 08:02 PM", "postID": "post69853243", "replies": []}, {"text": "Processing speed is fast . Its take few second to switch on the phone.", "time": "2nd December 2016, 01:28 PM", "postID": "post69895077", "replies": []}, {"text": "i didnt get stable performance during 6 month using this device\r\ni use MIUI 8 8.0.20 Global stable rom", "time": "3rd December 2016, 03:39 PM", "postID": "post69911187", "replies": []}, {"text": "Very fast!", "time": "5th December 2016, 09:22 AM", "postID": "post69936089", "replies": []}, {"text": "fast as the light\r\nnot faster than mi5s", "time": "10th February 2017, 01:08 PM", "postID": "post70967097", "replies": []}, {"text": "with custom roms is very good.", "time": "24th March 2017, 06:12 PM", "postID": "post71572050", "replies": []}, {"text": "great performance  on the device", "time": "2nd April 2017, 07:57 AM", "postID": "post71689614", "replies": []}, {"text": "Xiaomi performs really well. Snapdragon 820 is an assurance! \n\r\nTo improve it you can try to install tweaks or a custom kernel.", "time": "7th April 2017, 02:18 PM", "postID": "post71764459", "replies": []}]}, {"title": "App launch speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/mi-5/review/app-launch-speed-t3348471"], "threads": [{"text": "No slowdowns at all", "time": "9th November 2016, 10:20 AM", "postID": "post69532179", "replies": []}, {"text": "no noticeable delays. but then i don't have heavy games", "time": "14th November 2016, 06:40 PM", "postID": "post69619757", "replies": []}, {"text": "Apps launch flawlessly, whether it a social apps and heavy games.\r\nSD 820 is very good overall.", "time": "26th November 2016, 09:39 AM", "postID": "post69797719", "replies": []}]}, {"title": "Multitasking/RAM", "rating": 3.5, "links": ["https://forum.xda-developers.com/mi-5/review/multitasking-ram-t3348472", "https://forum.xda-developers.com/mi-5/review/multitasking-ram-t3348472/page2"], "threads": [{"text": "After playing pokemon, when you go back to Home, the home reloaded!", "time": "3rd November 2016, 11:35 AM", "postID": "post69439828", "replies": []}, {"text": "Multitasking in miui is a bit different and its awesome, also it depends how you configure it in the security app. \n\nU have to lock your apps in the recent apps screen. Otherwise if the app does nothing in the background, OS will kill it.", "time": "4th November 2016, 12:41 AM", "postID": "post69450214", "replies": [{"text": "It's not awesome! It's terrible. The lazy OS don't do your job and play it to back of users.\n\r\nI hate to lock/unlock the apps, it's feels like a workaround.", "time": "7th November 2016, 07:08 PM", "postID": "post69507488", "replies": []}]}, {"text": "Poor RAM management on my Mi5 is the main reason I'm not using it at the moment.\n\nAfter going back to my HTC 10, it's amazing how terrible it is on the Mi5. To be fair, the 10 has an extra GB of RAM (4 vs 3 on the Mi5), but still, the overview screen (recents) always lists >500 MB free, yet still closes apps so quickly, even music apps while they're playing music.", "time": "8th November 2016, 06:18 AM", "postID": "post69514649", "replies": []}, {"text": "I'm intend to buy a Xiaomi Mi 5s Plus, the 6GB RAM + 128GB ROM edition, I think it would more fast than Mi 5, But I'm not sure. I saw someone say 6GB OnePlus 3 still shutter.", "time": "9th November 2016, 04:02 AM", "postID": "post69528992", "replies": [{"text": "It is indeed faster. SD821 configuration differs significantly in the LITTLE cluster with 820. The one in Mi 5s Plus is clocked 2.2 GHz, much higher than 1.6 Ghz in Mi 5 Prime/Pro.", "time": "9th November 2016, 09:14 AM", "postID": "post69531474", "replies": []}]}, {"text": "In Pro version you have even too much RAM", "time": "9th November 2016, 10:20 AM", "postID": "post69532186", "replies": [{"text": "", "time": "18th November 2016, 10:57 AM", "postID": "post69679603", "replies": []}]}, {"text": "I just got a new xiaomi mi 5s plus, a little excitement. I hope he can beat iPhone 6, Hah....", "time": "21st November 2016, 09:35 AM", "postID": "post69721870", "replies": []}, {"text": "Never had issues but ram management seems to be poor in miui.", "time": "5th December 2016, 09:23 AM", "postID": "post69936097", "replies": []}, {"text": "Terrible RAM Management on \"Distributor edition\" MIUI 7.\nPhone sometimes lag (terribly), restarted but still lags.\nIt even managed to restart during a boss fight in a game! Just wonderful!", "time": "18th March 2017, 10:41 AM", "postID": "post71479654", "replies": []}]}, {"title": "Scrolling smoothness", "rating": 4.0, "links": ["https://forum.xda-developers.com/mi-5/review/scrolling-smoothness-t3348473"], "threads": []}, {"title": "Heat", "rating": 4.0, "links": ["https://forum.xda-developers.com/mi-5/review/heat-t3348474", "https://forum.xda-developers.com/mi-5/review/heat-t3348474/page2"], "threads": [{"text": "Phone doesn't heat much, hovewer on the upper side you can definitely notice a lot higher temperature i.e. during playing heavy games", "time": "9th November 2016, 10:19 AM", "postID": "post69532174", "replies": []}, {"text": "In my last use of MIUI 8.0.1.0 Global Stable, I have heat issues.\r\nSo bad, it felt like burning from inside. Switched to CM 13 (Now at CM 14), heat is minimum when playing heavy games.\n\r\nI think it is about how bad MIUI optimization, or maybe MIUI 8 didn't mature enough at that time.", "time": "26th November 2016, 09:06 AM", "postID": "post69797347", "replies": []}, {"text": "It gets hot charging and using wifi gaming at the same time", "time": "5th December 2016, 09:24 AM", "postID": "post69936111", "replies": []}, {"text": "Hi all, \r\nI'm using CM 13,  and playing Real Racing 3,  it gets extremely hot,  not only the top,  all the smartphone,  it's really uncomfortable.  \r\nDo you think that updating to CM 14 the problem will solve? \r\nBecause it also starts slowing the image and the game jumps. \r\nBest regards \r\nAlec", "time": "6th January 2017, 11:22 PM", "postID": "post70429843", "replies": []}, {"text": "My Mi 5 running unofficial lineage 14.1 by shade.sh and brand kernel does not heat up often. When it does occasionally heat up due to very intensive apps, its is very bearable and not too hot IMO. I am however using a thin rubber case and that may be the reason why I do not feel it being as hot as you described!", "time": "8th January 2017, 09:19 AM", "postID": "post70450744", "replies": []}, {"text": "Thanks for the answer,  yesterday night I changed to CM 14.1 and using RR3 it gets worm but not as hot as with CM 13.1\r\nRegards", "time": "8th January 2017, 12:44 PM", "postID": "post70453357", "replies": []}, {"text": "Remember its just a computer with a \"phone function\". It does get warm under heavy load. But only when i really run games for at least 20min. And it may get hot if you install a new rom and tons of apps in a short period. Usually its cool (running official lineageos 14.1).", "time": "31st January 2017, 02:30 PM", "postID": "post70815552", "replies": []}, {"text": "I have Lineage OS 14.1 Overclocked with dragonxia kernel and it doesn't heats too much while playing asphalt 8", "time": "2nd February 2017, 11:39 AM", "postID": "post70844584", "replies": []}, {"text": "Im on the newest LOS and the device gets really warm on the upper side when you charge it and use skype at the same time (thats probably because skype eats the battery really fast)", "time": "20th April 2017, 04:09 PM", "postID": "post71948336", "replies": []}, {"text": "I have come from LG Flex 2 to Xiaomi Mi5. Believe me nobody knows what baking really is while using your phone! Cherry on the cake, my LG actually fried in its last days, as per the phone repair people. Now it just keeps restarting every now and then.. . Fully satisfied with the Xiaomi Mi5 temperatures while playing online games like 8ball and CoC. The LG used to heat up in our city temperature of around 30 degrees within 15-20 minutes. In AC it was better, around half an hour.\n\nBut Xiaomi Mi5 gives me a respectable 40-50 minute game before slightly heating up. And that heating too is completely tolerable, when compared to Flex2 !!\nWith almost 2 hours of gaming and other office work, I get 5h15m plus screen on time as well \n\nOh yes, I have found this out, the Motorola QC-3.0 charger which came with my sister's MotoG4 heats up my phone VERY MUCH!\nAnd when compared, the Mi5 original QC-3.0 charger does not heat up the phone THAT much. I have seen voltage differences but the Moto charger has lower voltages and that should practically not heat up my phone a lot. I use the Moto charger at office and the Mi charger at home, both in AC rooms.", "time": "1st June 2017, 05:56 AM", "postID": "post72504227", "replies": []}, {"text": "Heating to much... And when the phone heats up, it starts to slow down... (8.5.2 eu stable)", "time": "3rd June 2017, 08:45 PM", "postID": "post72537690", "replies": []}]}, {"title": "Low light", "rating": 3.5, "links": ["https://forum.xda-developers.com/mi-5/review/low-light-t3348475", "https://forum.xda-developers.com/mi-5/review/low-light-t3348475/page2"], "threads": [{"text": "It is so many noises even Mi5 has OIS and f/2.0 and a good sensor in general", "time": "24th September 2016, 07:41 PM", "postID": "post68843008", "replies": []}, {"text": "Auto is no good for low light, use HHT, always.", "time": "26th September 2016, 01:17 PM", "postID": "post68865692", "replies": []}, {"text": "Has night mode improved at all with new firmwares?", "time": "14th October 2016, 09:16 AM", "postID": "post69123578", "replies": []}, {"text": "I dont get the hate for the Mi5 camera, imho its better than most flagships too even in low light(I know it is a flagship but at 1/2 - 1/3 rd the cost of most flagships,its truly amazing)", "time": "15th October 2016, 07:51 AM", "postID": "post69137770", "replies": []}, {"text": "the aperture is actually lower than stated. i think it is at most f/2.8 or lower. compare to another real f/2 phone in the same environment it will tell.", "time": "3rd November 2016, 11:24 AM", "postID": "post69439694", "replies": [{"text": "In terms of darkness or bokeh, cause low-light most likely has to do with shutter speed, maybe Xiaomi put higher iso to combat blur then applies noise reduction.", "time": "4th November 2016, 10:06 AM", "postID": "post69454695", "replies": []}, {"text": "Assuming the EXIF data doesn't lie, it's indeed f/2.0.", "time": "5th November 2016, 09:27 PM", "postID": "post69478402", "replies": []}]}, {"text": "Average.", "time": "5th December 2016, 09:25 AM", "postID": "post69936124", "replies": []}, {"text": "the auto mode of this phone's camera is not as expected, the shutter speed almost as-if locked at 1/8 on low light (auto mode). but the manual mode tells a whole different story, i really like the manual mode of this phone", "time": "5th December 2016, 03:21 PM", "postID": "post69940546", "replies": []}, {"text": "Can anyone answer a few questions about this phone for me? \r\n1. Would it work properly with T-Mobile?\r\n2. Could I install the Google Camera app and be able to do Photospheres?\r\n3. How does this camera compare to the Honor 8's camera? I know spec-wise, but real world performance?", "time": "11th December 2016, 10:15 PM", "postID": "post70043171", "replies": []}, {"text": ".....sony camera..... opticalstab.", "time": "10th February 2017, 01:09 PM", "postID": "post70967115", "replies": []}]}, {"title": "Photo quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/mi-5/review/photo-quality-t3348476", "https://forum.xda-developers.com/mi-5/review/photo-quality-t3348476/page2", "https://forum.xda-developers.com/mi-5/review/photo-quality-t3348476/page3", "https://forum.xda-developers.com/mi-5/review/photo-quality-t3348476/page5"], "threads": [{"text": "please post some camera samples here", "time": "13th June 2016, 05:20 AM", "postID": "post67293250", "replies": []}, {"text": "100% crop from 16mp. Saved at 75%. Zero edits.\n\n\r\nFull gallery and comparisons here:\nhttps://www.flickr.com/photos/56505616@N00/albums/", "time": "15th June 2016, 10:17 AM", "postID": "post67326023", "replies": []}, {"text": "https://photos.google.com/share/AF1Q...gzRW1VY2xFWXJn", "time": "17th June 2016, 06:27 PM", "postID": "post67364307", "replies": []}, {"text": "Great pictures, can you show me photo in night", "time": "22nd June 2016, 10:45 PM", "postID": "post67442065", "replies": []}, {"text": "Some says that the camera quality at night is not good, can u confirm that?", "time": "27th June 2016, 08:53 AM", "postID": "post67500213", "replies": []}, {"text": "", "time": "27th July 2016, 11:35 AM", "postID": "post67924154", "replies": []}, {"text": "I have some complaints. Overall the color and contrast is not as good as those of my galaxy s4. The pictures are sharper, but the following applies\nHDR: too agressive, can add a hint of desaturation.\nGREEN: taking pictures of green grass on a cloudy day produces extreme oversaturation of green. Turning down the overall saturation relieves this  a bit, but of course it reduces the saturation of everything and so had to turn it back up.\nCOLORS: compared to galaxy s7 it's clear that the colors are not great on the mi5. I tried this with a friend. You don't notice that much looking at MI5 shots in isolation, but compared to the S7 there's a big difference.\n\nThe camera is really lagging behind the rest of the high quality specs of the phone.", "time": "20th August 2016, 08:59 AM", "postID": "post68274016", "replies": []}, {"text": "I kinda like the night picture, there's a noticable improvement from Mi 4c. Here are some samples, you can guess what mode used to take the pictures from the suffix (HHT is automatically used at night even if you turn off auto HDR, but choosing HHT manually turns HDR on, which is weird):\nhttps://dl.dropboxusercontent.com/u/...190027_HHT.jpg\nhttps://dl.dropboxusercontent.com/u/...190036_HDR.jpg\nhttps://dl.dropboxusercontent.com/u/...193715_HHT.jpg", "time": "20th August 2016, 08:54 PM", "postID": "post68282245", "replies": []}, {"text": "You can not easily get bad photo quality with such a camera module from Sony.\n\r\nPersonally, I am pleased with the saturation rich photos from stock camera app. But I also found that open camera provides even better photos (exposure, etc.)", "time": "28th August 2016, 09:46 AM", "postID": "post68407362", "replies": []}, {"text": "hows the camera quality on cm13 or other custom roms?", "time": "14th September 2016, 03:39 PM", "postID": "post68685351", "replies": []}, {"text": "turn down noise reduction in camera apps.. and it will make great pictures all day long..", "time": "22nd September 2016, 09:52 AM", "postID": "post68805927", "replies": []}, {"text": "I've been using the camera for a few days and the issue I have with it is that it prioritises low ISO over longer shutter speed, resulting in motion blur in any picture that is not taken in good light or at a static subject.\n\r\nI'm having trouble shooting people (especially children) indoors, with good light, where my previous phone (iPhone 5S) had little trouble: it just upped the ISO but maintained a relatively fast shutter speed.\n\r\nIt's an issue with the original camera, the Cyanogenmod camera instead uses higher ISO which results in higher shuter speeds, less motion blur but higher noise and less detail.\n\r\nStill, I think that's preferable...\n\r\nAn example, just shot indoors, fluorescent lighting:\r\nOriginal Camera: shutter speed 1/17, ISO 562\r\nCyanogenmod: shutter speed 1/30, ISO 1360", "time": "12th December 2016, 06:13 PM", "postID": "post70056180", "replies": []}, {"text": "downtown milky way\n\n\n\nmoon", "time": "28th December 2016, 04:36 PM", "postID": "post70292059", "replies": []}, {"text": "Can anyone take picture with aosp and cm14.1 roms?\nThanks\nSorry for my bad english", "time": "14th January 2017, 07:37 PM", "postID": "post70553745", "replies": []}, {"text": "No Problem with your english\n\nI had the phone for a week in its great\n\nI Take 3 pictures 2 on Lineage 1 on miui 8 Nugat \n 1 with snapdragron on Lineage\n2 with Stock Lineage camera\n3 stock miui Nougat with Stock camera (my doughter moved the Keyboard)\n\n\n\nhttps://drive.google.com/folderview?...GVvazFWdlYyYTA\n\n3 more pictures of garden\n\n1 miui camera\n2 lineage camera\n3 lineage with snapdragon camera", "time": "15th January 2017, 06:59 AM", "postID": "post70559210", "replies": []}, {"text": "Chinese New Year firework", "time": "30th January 2017, 11:47 AM", "postID": "post70797740", "replies": [{"text": "Can you please tell the settings you used for these pics? (iso, shutter speed)", "time": "20th July 2017, 06:28 AM", "postID": "post73097343", "replies": [{"text": "", "time": "22nd July 2017, 03:35 PM", "postID": "post73127282", "replies": []}]}]}, {"text": "http://cloud.tapatalk.com/s/58902352...31_080455.jpg?\nTaken it with stock camera and Lightroom\n\n\nMI 5 cihazımdan Tapatalk kullanılarak gönderildi", "time": "31st January 2017, 05:41 AM", "postID": "post70809857", "replies": []}, {"text": "I use Snap Camera on AOSP 7.1.1 (JDC).\nThe photos quality is not so bad but not so good as a stock camera", "time": "24th March 2017, 12:30 PM", "postID": "post71567574", "replies": []}, {"text": "Hi,\r\nis it possible to port Miui camera for custom roms?", "time": "24th March 2017, 05:59 PM", "postID": "post71571899", "replies": []}, {"text": "gets the job done I suppose", "time": "2nd April 2017, 08:00 AM", "postID": "post71689638", "replies": []}, {"text": "So far this is my best macro taken with my Mi5 Prime", "time": "6th April 2017, 11:00 AM", "postID": "post71748616", "replies": []}, {"text": "The Mi5 has a powerful camera, the problem it that it is not enough optimized. \n\r\nSo you take best shots using Manual mode, for example in automatic mode exposure is always elevated and hdr is setup too much often.", "time": "7th April 2017, 01:52 PM", "postID": "post71764135", "replies": []}, {"text": "I think the camera is optimized well.\n\nI use most of the time manual mode with the Focus Peaking option for best macro shots (like the one in my previous post).\nAs the automatic mode, I use it for landscapes and other photos, and I manually adjust exposure.\nAnd I use Google Camera for taking Photo Sphere (360 photos).\n\nThe only bad thing is the .RAW support...", "time": "7th April 2017, 02:59 PM", "postID": "post71764960", "replies": []}, {"text": "Hi folks, I buy Mi5 these days and phone is great. I m specially fall in love in camera which is great. Here are few shots in auto mod that I took.", "time": "20th July 2017, 02:06 AM", "postID": "post73095648", "replies": []}, {"text": "Open Camera seems like a good alternative so far. More control over jpg compression and saves RAW(DNG) format. I didn't see a panorama option tho.\r\nVideo gives you control over FPS and bitrate but no 4k.", "time": "5th August 2017, 05:00 AM", "postID": "post73292411", "replies": []}, {"text": "Original Image:\n\n\r\nAfter Lightroom edit:", "time": "7th August 2017, 06:43 PM", "postID": "post73320571", "replies": []}, {"text": "Comparison between several camera app with RR ROM.\r\nWith custom ROM, we struggle to find best way to take picture as good as MIUI do, and still MIUI do better at taking picture.\n\r\n- I do this in a room with controlled light source at night, so every picture taken have the same environment condition.\r\n- Using tripod and timer when taking picture, so no shaky image.\r\n- I use auto mode, so ISO, shutter speed and white balance are auto.\r\n- I compare normal auto mode with HDR on and off.\r\n- I use RR ROM august version, with no kernel and any edit on system file.\n\r\nCamera app I use :\r\n+ Default snap cam from RR ROM\r\n+ Google camera with HDR+ from https://www.xda-developers.com/googl...ra-hdr-ported/\r\n+ OnePlus Camera from https://forum.xda-developers.com/mi-...odded-t3591177\n\r\nIn this comparison, you will see how these three camera deal with, noise, sharpness and HDR.\r\nPicture is zoomed to actual pixel so we can see the detail.", "time": "19th August 2017, 04:22 AM", "postID": "post73453691", "replies": []}, {"text": "These are some of the photos I take with mi 5. No effect and all is taken with official camera software\n\r\nhttps://photos.app.goo.gl/35CSOh0dFZOr6Y3Y2\n\r\nWhat do you think?", "time": "18th September 2017, 04:43 PM", "postID": "post73840118", "replies": []}, {"text": "Google Camera has made an huge jump in terms of HDR photo rendering on Mi5 (all variant) while Xiaomi's effort is still beneath the ground with their so called MiuiCamera HDR.", "time": "24th December 2017, 11:46 AM", "postID": "post74946927", "replies": []}, {"text": "My  album", "time": "24th December 2017, 04:59 PM", "postID": "post74949689", "replies": []}, {"text": "stock camera app\r\nmanual mode", "time": "11th January 2018, 09:14 AM", "postID": "post75157843", "replies": []}]}, {"title": "Video quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/mi-5/review/video-quality-t3348477"], "threads": [{"text": "My only complaint of this nice piece of gear is the video recording feature.\n\nThere is no 1080p@60fps recording option. Even the recording quality in good light conditons at 30fps (1080p) is not smooth and really choppy \n\nHave not see any advantage of the 4axis OIS future.\n\nHope to see developers that can fix this issiue with software updates. \n\nI think the best video recording quality has the Samsung Galaxy S6/S7/Note series and the Iphone 6/6s line.\n\nHope to see other opinions and good nwes", "time": "15th June 2016, 10:28 AM", "postID": "post67326145", "replies": [{"text": "Keep dreaming!!! You should have thrown your cash at the other phones instead.\n\nGuys, I keep seeing constant complains and whining about this phone and yet the  only person to blame is your self. Read the god damn reviews !!!!!", "time": "15th June 2016, 10:38 AM", "postID": "post67326229", "replies": []}]}, {"text": "all reviews point that video recording is just ok, nothing great... OIS is almost non-existent...\n\nno software update will fix that...\n\nread more carefully next time", "time": "16th June 2016, 08:26 AM", "postID": "post67340713", "replies": [{"text": "It has a great video recording quality for it's price. OIS and auto-focus is better than the more expensive flagship op3.  \r\nwatch?v=Z8H5kOnryEo", "time": "28th August 2016, 08:36 PM", "postID": "post68416412", "replies": []}]}, {"text": "OIS is clearly there, try recording while driving a motorcycle. There will be no, or at least minimal, glowy images as in non-OIS enabled devices. Color rendering is still the best, S7 and 6S is behind for this one. Lighting is natural, however you may prefer S7's \"always daylight\" choice (i.e., it will show bright light even in dark environment), but that's completely preference. I choose natural. Slow motion is great, even if only single 720p@30fps choice (slowed down 4x from 120fps) I found it very useful to record fast motion videos to see it later in detail.", "time": "30th August 2016, 09:43 AM", "postID": "post68440796", "replies": []}, {"text": "this is the worst think in this device\r\nit cant shoot a good video\r\nget a lot off blurry result every time video", "time": "3rd December 2016, 03:55 PM", "postID": "post69911391", "replies": []}, {"text": "For me its 75/100. \r\nMiui makes it complicated to chenge to 4k, fullhd slow-mo quickly. Timelapse feature is great. There were problems with rotation for camera but software update solved them. So it is not great but nice to see they are improving littlle by little.", "time": "5th December 2016, 09:13 AM", "postID": "post69935990", "replies": []}]}, {"title": "Selfie quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/mi-5/review/selfie-quality-t3348478"], "threads": [{"text": "it takes great selfie compare to all my device before\r\nevent in low light room, i still get good selfie", "time": "3rd December 2016, 03:43 PM", "postID": "post69911242", "replies": []}, {"text": "Selfies are not very great. Not bad, but not great. Beaufy feature and filters are quite good, but selfie camera performs quite bad in low light situations.", "time": "5th December 2016, 09:15 AM", "postID": "post69936012", "replies": []}]}, {"title": "Time to take picture (camera launch speed)", "rating": 5.0, "links": ["https://forum.xda-developers.com/mi-5/review/time-to-picture-camera-launch-speed-t3348479"], "threads": [{"text": "If you try to do it really fast it might not focus correctly. so It is fast but not always great, you need to take a sec to focus.", "time": "5th December 2016, 09:30 AM", "postID": "post69936182", "replies": []}, {"text": "The camera launches really fast and you can use the burst mode to take the snaps you really do not  want to  but it will be in focus or not, that's pure 50/50.", "time": "21st December 2016, 12:24 AM", "postID": "post70184932", "replies": []}]}, {"title": "Software (ease of use, features, etc)", "rating": 4.0, "links": ["https://forum.xda-developers.com/mi-5/review/software-ease-features-t3348480", "https://forum.xda-developers.com/mi-5/review/software-ease-features-t3348480/page2"], "threads": [{"text": "The native ability to prevent apps from auto starting is a real battery life saver. It allows you to use Facebook and Messenger without chewing up your battery when you put the phone down.\n\nMIUI has a love/hate relationship with users outside of China, but it's so good looking you always want to go back to it.", "time": "4th April 2016, 04:31 PM", "postID": "post66191387", "replies": []}, {"text": "I like how MIUI handle apps permission, with complimentary to Marshmallow system.\nBut if you use their non-global ROM, it is really annoying to not being able to sync your Google's contact and calendar.\nI do understand that this is China's official policy, so either you work around it (using non-google contact and calendar account) or you switch side and use MiCloud apps.", "time": "24th April 2016, 08:41 PM", "postID": "post66529339", "replies": [{"text": "Sorry but what are you talking about?!\n\r\nYou can download an app called \"google installer\" from the Xiaomi app store. From within that app you can download most services/apps related to google!\n\r\nMy wife has a xiaomi minote, still on original chinese rom, and it has all google services running including contact's and calendar's sync.", "time": "5th May 2016, 07:27 AM", "postID": "post66703062", "replies": [{"text": "Which version does she use?\nWhen I used the original 7.2.4 global ROM that came with my Mi 5 (64 GB), the sync worked. But after I changed it with 7.2.12 china ROM, it doesn't sync calendar and contact anymore. I have tried to flash/install latest sync adapters, but those 2 just won't sync.\nI also found google installer \"fixer\" for apps updating issue but did find any for fixing the contact/calendar sync issue.\nMy Mi 5 has actually been returned to seller because it suddenly died and cannot be charged. I can flash 7.2.13 china ROM, 7.2.4 global ROM, and 6.3.17 dev ROM via fastboot, but it just won't turned on.", "time": "5th May 2016, 08:53 AM", "postID": "post66703864", "replies": [{"text": "After some time i got myself in an apk install frenzy. So if you can, and still have the problems with sync, \nreflash the rom you prefer\nFollow the steps mentioned with the mi app store. (Search for Google, click the blue paw with du in it)\nInstall and let it run.\nThen check the permissions and make sure all Google services and apps have permissions.\n\nWhat made my calendar sync appear, was installing Google calendar! Removed it after my miui calendar synced with Google \n\nI got it working on all three miui roms. (Dev, china,global.)\n\nGood luck\n\n\n\n---------- Post added at 04:16 AM ---------- Previous post was at 04:13 AM ----------\n\n\n\r\nMany issues can be resolved with changing permissions and notification access.\nTrue it's annoying to not have apps automatically do what they should, but once you got the permissions sorted, and the notification access running properly, check battery saving and background data settings.\n\nNo app crashes, no sudden freezes, nothing at all on my mi5 32gb, with Chinese dev rom.\nBut i had to do a little tweaking", "time": "20th May 2016, 05:16 AM", "postID": "post66936294", "replies": [{"text": "What exactly did you change in the permissions and notifications?", "time": "23rd May 2016, 09:53 AM", "postID": "post66984162", "replies": [{"text": "Well to get my syncing going on, permissions like access to accounts by Google apps, reading contacts info etc. Notifications access for whatsapp, inbox and such. \nI still have a delay in some apps like Viber and whatsapp, but hey, got my bootloader unlocked going to cm13 now. \nNot worrying about miui restrictions anymore.", "time": "23rd May 2016, 12:28 PM", "postID": "post66986028", "replies": [{"text": "Ok, thanks for your answer.", "time": "23rd May 2016, 06:52 PM", "postID": "post66991528", "replies": []}]}]}]}]}]}]}, {"text": "I'm having more issues than i can count with the software... \n\nDont get me wrong, the phone is great, but the software is just... annoying. \n\nFirst, app chrashes and i mean allot, facebook, snapchat pretty much everything. \nThen there's the fact that some apps (like snapchat) wont show notifications when i get a new snap, i use the chinese rom as of right now, and im hugely dissapointed :/ \n\nGood phone with half baked software i hope these issues will be resolved", "time": "7th May 2016, 03:48 PM", "postID": "post66740254", "replies": [{"text": "Tell me the ROM info I will give u the custom ROM for it.", "time": "28th May 2016, 06:41 PM", "postID": "post67067601", "replies": []}]}, {"text": "Too much heating issues and then my phone has a lot of random freezes and >2 gb ram is always in use due to some reason. The software is turning out to be a major setback and I wish I had purchased the moto x pure instead. Waiting to root and flash CM. Hate to see SD820 going to waste", "time": "9th May 2016, 08:12 PM", "postID": "post66773985", "replies": []}]}, {"title": "Charging speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/mi-5/review/charging-speed-t3348481", "https://forum.xda-developers.com/mi-5/review/charging-speed-t3348481/page2"], "threads": [{"text": "Charging I'd more then awesome! Last phone was an S5, that charged pretty fast. But this baby (while using the standard QC 2.0 charger) charges up to my ideal standards! Not needed to charge it during the day yet, but if i needed it to, it didn't need more then an hour for it. Lovely!", "time": "20th May 2016, 05:18 AM", "postID": "post66936346", "replies": []}, {"text": "I have an qc 3.0, It charges full from about 10% to 100% in about 1h 30min", "time": "20th May 2016, 12:08 PM", "postID": "post66940302", "replies": []}, {"text": "Cool, gonna deplete the battery and see how fast it charges on my standard 2.0 charger that came with it.", "time": "20th May 2016, 01:08 PM", "postID": "post66941032", "replies": []}, {"text": "So, on a 2.0 charger, standard charger from 10% to 100% in one hour and 15 minutes.\n15 min - 30%\n30 min - 55%\n45 min - 73%\n60 min - 90%\n75 min - 100%", "time": "21st May 2016, 06:30 AM", "postID": "post66952628", "replies": []}, {"text": "", "time": "22nd May 2016, 09:30 PM", "postID": "post66977800", "replies": []}, {"text": "Charging speed depends from charger max current. And comparison need to spend on same charger.", "time": "23rd May 2016, 05:53 AM", "postID": "post66981759", "replies": []}, {"text": "Quite fast enough, only lose to Oneplus 3 (which my GF have). From 0 to full I just need about 1h15mins when not turned on.\r\nCompare to my old LG G2 which needs 1h40mins from 0 to full.", "time": "26th November 2016, 09:10 AM", "postID": "post69797390", "replies": []}, {"text": "it need 1,5 hour from zero to full charge\r\ni use standard charger from xiaomi,", "time": "3rd December 2016, 03:45 PM", "postID": "post69911269", "replies": []}, {"text": "Original included charger charges lightning fast. On PC or regular charger it takes much longer for apparent reasons (no QC capabilities).", "time": "5th December 2016, 09:06 AM", "postID": "post69935897", "replies": []}, {"text": "all day all night half a day ....thats very good it is not like redminote 3 pro battery but its ok", "time": "10th February 2017, 01:14 PM", "postID": "post70967184", "replies": []}, {"text": "takes about 1 -1.25 hrs to fully charge.  really happy with the speed!", "time": "17th February 2017, 09:40 AM", "postID": "post71067193", "replies": []}, {"text": "1:15 with Lineage OS and custom kernel", "time": "4th March 2017, 02:56 AM", "postID": "post71274806", "replies": []}, {"text": "1:20 with ROM AOSP 7.1.1 (JDC)", "time": "24th March 2017, 12:22 PM", "postID": "post71567498", "replies": []}, {"text": "Original charger takes 80 min for me.\r\ncustom rom.", "time": "24th March 2017, 06:08 PM", "postID": "post71572005", "replies": []}, {"text": "android nougat miui gets charging upto 3amps", "time": "2nd April 2017, 07:58 AM", "postID": "post71689620", "replies": []}, {"text": "I really suggest you to buy a Qualcomm certified QC 3.0\n\r\nXiaomi charger is QC 2.0, you can see its output can reach maximum, 2.5 A, while QC 3 get 3 Amp. \n\r\nIn 10 minutes of charge, I can charge up to 18% of battery.", "time": "7th April 2017, 12:26 PM", "postID": "post71763199", "replies": [{"text": "Xiaomi original charger is QC3.0 certified,says 2.5A just due to chinese laws,but charges at 3A at times. And charges fastest,compared to Blitzwolf,Tronsmart and Aukey QC3.0 chargers i measured.\n\r\nProblem is,with latest Global Stable,they tweaked kernel a bit and they all charge 15min longer and without usual 0-60% burst we used to have(bout 20-25min). It is cooler aight but it's slower.", "time": "2nd October 2017, 09:30 PM", "postID": "post74013677", "replies": []}]}]}, {"title": "Screen on time", "rating": 4.0, "links": ["https://forum.xda-developers.com/mi-5/review/screen-time-t3348482", "https://forum.xda-developers.com/mi-5/review/screen-time-t3348482/page2", "https://forum.xda-developers.com/mi-5/review/screen-time-t3348482/page3", "https://forum.xda-developers.com/mi-5/review/screen-time-t3348482/page5"], "threads": [{"text": "Can you tell me how much SOT can u get and your usage as well? Thanks!", "time": "9th September 2016, 02:20 AM", "postID": "post68597088", "replies": []}, {"text": "I got 3 to 5, 3 mostly on working days, especially when we got a lot of things to do (less touch on the phones). 5 or something on the weekend, especially when we go out somewhere (pictures and videos will dominate battery use, followed by social media for sharing them).", "time": "10th September 2016, 09:46 AM", "postID": "post68616635", "replies": []}, {"text": "I get around 7 hrs of Sot on miui 8 global stable which is not bad but on miui 7 i could easily reach 9-10 hrs of sot...", "time": "11th September 2016, 10:39 AM", "postID": "post68632343", "replies": []}, {"text": "Ressurection remix,always lte on, 3 mails syncing, fb, Viber messenger chatting ,tapatalk and over an hour of mp3 listening\n\nΣτάλθηκε από το MI 5 μου χρησιμοποιώντας Tapatalk", "time": "17th September 2016, 05:40 PM", "postID": "post68734000", "replies": [{"text": "That is amazing.. Do you use app as greenify ? Have you rooted your phone ?", "time": "14th February 2017, 01:39 PM", "postID": "post71026849", "replies": []}]}, {"text": "I get around 4-5 SOT with only on mobile data, HSPA+ and around 6-7 only on WiFi ( with flightmode on - as I have currently at home no network due to stupid issue with ISP ( broken cable ) and where I use WiFi I have a bad signal - and everyone I know calls with whatsapp or messenger or skype or viber ) . FYI , those screen on times are until 20 procent battery left as I charge if I can never under 20.", "time": "21st September 2016, 05:38 AM", "postID": "post68787620", "replies": []}, {"text": "Wi-Fi only will get me 7-8 hours SoT, altough sometimes it droppes a little faster and i get 5-6 SoT not sure why.\nRunning Cyanogenmod 13 20160906. Since i only use 3-4 SoT i have 50+ percent over at the end of the day, so i am satisfied.\nAlso my first phone with Quickcharge and i like it more than i would have tought.", "time": "21st September 2016, 07:24 PM", "postID": "post68797941", "replies": []}, {"text": "Running MIUI Global Stable 8.0.1.0, it is about 3h30mins on my average use... Phone heats a lot, sometimes when idle. Maybe that's why battery consumed quickly.\r\nSometimes phone not sleep, which is maybe bug from MIUI or Google Services (or both).\r\nMy usage is mostly playing medium to heavy games and social media. Phone usually at Wi-fi (work and home from Sun to Sat, yay!)\n\r\nCurrently running CM 14, before that: CM 13. Battery life's good. Got screen on time usually 4h40mins to 5h with same usage pattern.", "time": "26th November 2016, 09:15 AM", "postID": "post69797459", "replies": []}, {"text": "3-5 hours on average, 3 if I rely heavily on LTE. Though my record is 8 hours on 3G in rural Italy 😁", "time": "29th November 2016, 07:55 PM", "postID": "post69853146", "replies": [{"text": "Woooooow 8 hours ? In rural France I can't reach 5 hours", "time": "14th March 2017, 12:10 PM", "postID": "post71423345", "replies": []}]}, {"text": "Does latest miui 8 global stable (8.1.2.0) have good screen on time? Thanks.\r\nSorry for bad english", "time": "30th November 2016, 11:26 AM", "postID": "post69861963", "replies": [{"text": "I am asking myself the same question. Right now my phone is with 8.1.2.0 but I cannot reach even 5h SOT. No 4G, No GPS, No NFC, No Hotspot. The only app which is allowed to autostart is Messenger. Everything is turned off. Most of the time I am on Wi-fi. I have great signal but Only 4h SOT...", "time": "30th November 2016, 01:39 PM", "postID": "post69863533", "replies": []}, {"text": "see for yourself:", "time": "2nd December 2016, 07:08 PM", "postID": "post69899936", "replies": [{"text": "what theme u r using ? ur status bar is nice", "time": "2nd December 2016, 07:31 PM", "postID": "post69900183", "replies": [{"text": "Here's a them Hybrid [V8]! Link: .http://zhuti.xiaomi.com/detail/8a326...6-ae97ca3b7b2a", "time": "2nd December 2016, 08:03 PM", "postID": "post69900578", "replies": []}]}]}]}, {"text": "I am jealous. I am hardly getting even 5h SOT and i am not even using 4G. LOL.", "time": "2nd December 2016, 07:59 PM", "postID": "post69900527", "replies": []}, {"text": "i can get 4,5 hours screen on time in normal usage\r\nbut\r\ni recently did a lot of browsing in midnight\r\nand it got me  6 hour SOT   (7 hour after full charge until 1 %)", "time": "3rd December 2016, 03:37 PM", "postID": "post69911162", "replies": []}, {"text": "Hi guys, I'm running on Version: V8.1.4.0.MAAMIDI (MIUI8) Global ROM [ LATEST ] and I get around 4-5 Hours of SOT. I wonder if there any Official MIUI ROM which gives 5+ SOT. Please do reply with the version and a screenshot. Thanks", "time": "22nd February 2017, 03:23 PM", "postID": "post71143266", "replies": []}, {"text": "SOT on MIUI 8 nougat is really bad. I used to get 5 hours on MM, but getting only 3.5 hours on N", "time": "25th February 2017, 11:02 AM", "postID": "post71182649", "replies": []}, {"text": "Around 6 on LTE all day CM13", "time": "2nd March 2017, 09:34 AM", "postID": "post71250739", "replies": []}, {"text": "It depends on how everyone is using their phone. I can get 5hrs SOT if I use the phone a lot. On the other hand, I can't get over two days without charge and only 2, even 1 hrs SOT. 4G is constantly on during the day, I guess Google Now and location checks are having their toll on the battery regardless of screen time. \n\nDuring the night when I turn off everything and DND mode is on, for 7-8hrs battery drain is usually 2 to 3%. With LTE/Wifi on it is around 5%. During the day however the drain is much higher when I move around and the phone changes cells, google tracks me and etc...", "time": "4th March 2017, 08:18 PM", "postID": "post71284761", "replies": []}, {"text": "5 on LTE and Lineage", "time": "24th March 2017, 06:16 PM", "postID": "post71572087", "replies": []}, {"text": "I get 3 hrs + average but when i use it for youtube or movies sot improves to 6+ hrs", "time": "26th March 2017, 04:41 AM", "postID": "post71590382", "replies": []}, {"text": "great sot times for me atleast decent", "time": "2nd April 2017, 07:54 AM", "postID": "post71689585", "replies": []}, {"text": "It depends a lot from the use. \n\r\nWith Xiaomi.eu, mostly in WiFi I can reach up to 5-6 hour of SOT with a mild usage. \n\r\nUsing only 4g, I get a lot less, around 4 hours of usage.", "time": "7th April 2017, 02:23 PM", "postID": "post71764505", "replies": []}, {"text": "That's my battery life on the latest miui global stable V8.2.2.0.NAAMIEB\nbackground apps: facebook, messenger, instagram, kik, tinder\nI didn't use 3g that day tho\nhttp://imgur.com/a/PHJ5h", "time": "13th April 2017, 09:49 PM", "postID": "post71849580", "replies": []}, {"text": "During a normal work day i get 4-5 hours SOT without WIFI and low display brightness. I'm on the newest LOS", "time": "20th April 2017, 03:52 PM", "postID": "post71948048", "replies": []}, {"text": "Heavy usage \n\nSOT:\n4:37 - 5:0 (wi-fi)\n3:35 (4G)\n\nAICP - 7.1.2", "time": "13th May 2017, 11:55 AM", "postID": "post72276810", "replies": []}, {"text": "I get around 5 hrs of Sot on LineageOS 14.1 Lte and Wifi on", "time": "9th June 2017, 09:20 AM", "postID": "post72605007", "replies": []}, {"text": "I get around 7 hrs of Sot on miui 8", "time": "15th June 2017, 05:13 AM", "postID": "post72677657", "replies": []}, {"text": "Also +/- 3h sot from when I bought it", "time": "28th December 2017, 01:13 PM", "postID": "post74990455", "replies": [{"text": "Same here both with Lineage or xiaomi.eu, 3g is very expensive \n\nInviato dal mio MI 5 utilizzando Tapatalk", "time": "29th December 2017, 06:15 PM", "postID": "post75005518", "replies": []}]}, {"text": "Abou t 4-5 hours but use 3g only when I use data, for speaking I use 2g all the time", "time": "30th December 2017, 02:24 PM", "postID": "post75014354", "replies": []}]}, {"title": "Standby drain", "rating": 4.0, "links": ["https://forum.xda-developers.com/mi-5/review/standby-drain-t3348483", "https://forum.xda-developers.com/mi-5/review/standby-drain-t3348483/page2", "https://forum.xda-developers.com/mi-5/review/standby-drain-t3348483/page3", "https://forum.xda-developers.com/mi-5/review/standby-drain-t3348483/page4"], "threads": [{"text": "If anyone could post the standby drain overnight it would be great. I would like to know how much % is lost during night time....", "time": "22nd September 2016, 04:09 PM", "postID": "post68810423", "replies": [{"text": "My own experienced...with plane mode active from 3am till 9am...100% to 98%....", "time": "22nd February 2017, 04:06 PM", "postID": "post71143825", "replies": [{"text": "I can confirm same here LOS airplane mode = 0am till 6am 100% to 98 or 97 % so at max decrease a 1/2% an hour.", "time": "1st March 2017, 09:56 AM", "postID": "post71237082", "replies": []}]}]}, {"text": "This one is from mine:\n\r\nIt's 20% over 9 hours, so it's around 2% per hour. Everything is still on: sync (3 email accounts, 7 social media apps), wifi, bluetooth, etc.", "time": "23rd September 2016, 03:15 AM", "postID": "post68818030", "replies": [{"text": "The software looks cool. Could you tell the name of it?", "time": "27th June 2017, 07:34 AM", "postID": "post72819221", "replies": [{"text": "GSam Battery Monitor", "time": "27th June 2017, 09:33 AM", "postID": "post72820165", "replies": []}]}]}, {"text": "I'd really like help with this area, if anyone can give me any advice. If I charge my phone to 100% at night then unplug it, when I wake up in the morning it's down to less than 50%. This is with pretty much nothing on, no wifi, data, bluetooth etc. This happens most of the time, but not all the time (when it doesn't I can get a few days of use out of the phone), and I've yet to identify and fix the exact cause.\n\nHaven't empirically tested, but I seem to get more battery life when in continual use (listening to music off and on, etc), then when resting overnight/for long periods.\n\nI can give any details needed, but I'm using Cyanogenmod 13.0-20160908. Have tried Doze, and GSam (can post any logs if I know what's useful), and Wakelock detector. Would changing roms help?", "time": "24th September 2016, 10:52 AM", "postID": "post68836545", "replies": [{"text": "Hi Khazidhea,\n\r\nI can tell for sure that it is NOT NORMAL that your phone drains about 7 to 8% of battery life each hour ! \r\nEspecially if you disconnect Wi-Fi and BT. \r\nThe only thing I can think of, is that you are in an area where the phone constantly switches from 3G to 4G to get on the network. \r\nOf course, if you have 2 SIM cards in that phone, that may increase the drain significantly...\n\r\nI think that if you are on Cyanogen, there is an option in Settings that is called \"SIM Cards\". \r\nIf you select that option, you should be able to have some access to settings for each SIM Card. \r\nTry to select one and look for the option called \"Preferred Network\" and select something like \"WCDMA\" or \"GSM\" (that is 2G in the US and 2G in Europe). \r\nSee if that improves...\n\r\nAs far as I am concerned, I run my Xiaomi mi5 with a ROM called \"Tipsy-OS\" that I have compiled myself...\r\nSo far, I am unplugged since 2 hours, have used the phone with 4G, BT, Wi-Fi, automatic updates of apps, mail retrieving, applied themes via substratum... and lost 2%. \r\nSo no, 8%/hour without doing anything is NOT NORMAL !\n\r\nRegards.", "time": "25th September 2016, 10:18 AM", "postID": "post68849936", "replies": []}]}, {"text": "I finally ended up fixing this. Simply changing  the setting \"Preferred network type\" from 4G to 3G made my battery usage change from about 2/3 of a day, to up to 4 days, with my typical pattern of usage. Note that when my battery was being drained before I did not have data turned on, so not sure why that ended up being the fix.", "time": "19th October 2016, 12:25 AM", "postID": "post69196245", "replies": [{"text": "If 4G coverage is bad in your area, it will trigger reconnection over and over again, causing battery drain. The protocol itself is indeed more battery consuming in general, but shouldn't have much gap with 3G under the same coverage quality.", "time": "19th October 2016, 02:55 AM", "postID": "post69197672", "replies": []}]}, {"text": "% 5 full network bltooth", "time": "29th October 2016, 08:36 AM", "postID": "post69358688", "replies": []}, {"text": "seems mine 1-2%per hour all sync on, wifi.", "time": "2nd November 2016, 04:08 AM", "postID": "post69419536", "replies": []}, {"text": "In a non-airplane mode with WiFi connected I get a bit more than 1%/h with greenify activated.", "time": "4th March 2017, 11:00 AM", "postID": "post71278481", "replies": []}, {"text": "I posted in another thread but i've got no answer.\r\nI decided to switch to Global Dev ROM thinking it might solve my battery issues, but it only got worse, im getting around 40% battery drain overnight. Any ideas???? I don't have mi sync enabled, google play is set to not auto-update apps, i barely use mobile data, so only wifi.", "time": "5th March 2017, 07:32 PM", "postID": "post71297373", "replies": [{"text": "seems like a wakelock, the global dev is the official? Did you install any other app of it's like that after the wipe and flashing? Check for wakelock detector apps in the store", "time": "5th March 2017, 08:31 PM", "postID": "post71298047", "replies": [{"text": "Official Global Dev, so i noticed that \"Lite Messenger Facebook\" was draining the battery like h3ll, i uninstalled it and now i've been using my phone for an entirely day browsing/email/duolingo and half battery has gone, the way it is going i will have to charge every 2 days or so. In the meantime i might just use facebook messenger through the browser.\n\nAlthough Global Dev is fine, there are some bugs and MiFit does not want to sign in, i might go back to Global Rom when 8.2 comes out to Mi5.\n\nThank You!", "time": "7th March 2017, 12:00 AM", "postID": "post71314100", "replies": [{"text": "Try this : if you had flashed your devices maybe you could calibrate your battery.\r\nYou can find 'Battery Ultra Saver' on xda store\n\r\nHave a good day.", "time": "7th March 2017, 02:33 PM", "postID": "post71321767", "replies": [{"text": "I didn't know about xda store, that is really cool!\r\nI downloaded Battery Saver Ultra, and i am calibrating my device now\n\r\nThanks and have a good day too.", "time": "7th March 2017, 03:19 PM", "postID": "post71322374", "replies": [{"text": "i could not find xda store.", "time": "8th March 2017, 02:11 AM", "postID": "post71329530", "replies": [{"text": "It is actually XDA Labs\n\r\nHere is the link to the page, also the page has the link to download the APK\nhttps://www.xda-developers.com/xda-labs/", "time": "8th March 2017, 03:38 AM", "postID": "post71330148", "replies": []}]}]}]}]}]}]}, {"text": "During the night (8h) I can lose 2-3% (without wifi, BT, LTE...). I'll try Battery Saver Ultra tonight ! Thanks", "time": "17th March 2017, 11:51 AM", "postID": "post71466756", "replies": []}, {"text": "With auto battery saver from 21:30 till 8 spends 3%", "time": "24th June 2017, 08:09 PM", "postID": "post72791891", "replies": []}, {"text": "I'm on 8.1.2.0 Global Stable right now. During the night no Wi-Fi, BT etc. 3G switched to 2G. Every 5 hours drain 3% charge. Sometimes 5% charge is drained in 10 hours of standby. Never get over 6% in 10 hours.=.", "time": "2nd July 2017, 08:13 PM", "postID": "post72884984", "replies": []}, {"text": "Global 8.1.4.0 drain is 2-3% overnight, with all turned on(gps,bt.wifi,data, brightness auto). Autosync off and only smart bracelet app allowed to autostart.", "time": "3rd July 2017, 12:39 PM", "postID": "post72891552", "replies": []}, {"text": "Hey everyone \r\nRecently updated my phone to 7.0.. MIUI 8.2.2\n\r\nThe Standby in normal mode with 4G on and social apps running in the background, the drain overnight is 1% PER EVERY HOUR.\r\nBut strangely enough, when I shift the mode to BATTERY SAVING, the drain overnight is more than 2% per hour. Battery Saving is supposed to SAVE Battery rather than deplete it faster! I have only tried it once though so I can try again if anyone recommends!", "time": "24th July 2017, 12:59 PM", "postID": "post73148686", "replies": []}, {"text": "on 8.1.2.0 global stable\nover night (about 8 hours or more ) lost 9% of batteries (from 54% to 45%)\nwifi connected, network 4G, reading mode on", "time": "25th July 2017, 09:32 AM", "postID": "post73159659", "replies": []}, {"text": "I get 5% battery drain at night ( wifi,gps,bluetooth ,everything turned off)", "time": "28th September 2017, 11:24 AM", "postID": "post73962424", "replies": []}, {"text": "Seems MIUI 9 has stabilized. I get similar battery life as with Marshmallow. That is, 5-6h SOT/ day or 3-4h/2 days and 2-3% drain overnight. Looks good.", "time": "28th September 2017, 01:38 PM", "postID": "post73963609", "replies": [{"text": "Which ROM version are you using?\r\nOr... which custom kernel/gorvernor settings?\r\nI am curious as I cannot get more than 2 hours SOT/day with xiaomi.eu, 7.9.21, default kernel/settings, battery saver enabled.\r\nThanks!", "time": "4th October 2017, 10:09 AM", "postID": "post74030676", "replies": []}]}, {"text": "Stock xiaomi.eu MIUI9, same as you, as far as I can tell. GPS, bt, wifi, data on all the time, autosync off, autostart off for all apps except bt smartwatch. I don't want notifications, I see them when I start apps. I have sms and phone calls for urgent matters. Never had only 2h sot...I probably get 3-4h while using navigation, which sucks a lot of energy.", "time": "4th October 2017, 10:18 AM", "postID": "post74030761", "replies": []}, {"text": "I get 6% battery drain for 8h sleep on LOS. Will check once more tomorrow.", "time": "4th October 2017, 03:45 PM", "postID": "post74033861", "replies": []}, {"text": "Hi", "time": "6th October 2017, 03:26 PM", "postID": "post74057584", "replies": []}, {"text": "I'm happy with battery life...", "time": "8th October 2017, 08:28 PM", "postID": "post74084965", "replies": [{"text": "Which build which kernell? Howww??? I only get 2-3 hrs screen on time in 5 hours 😔", "time": "13th October 2017, 07:28 AM", "postID": "post74138667", "replies": []}]}, {"text": "Xiaomi.eu 7.9.21 stock, BT,GPS,WiFi,data on, sync off", "time": "13th October 2017, 08:07 AM", "postID": "post74138918", "replies": []}, {"text": "I get 1% drain overnight, but i keep wi-fi, bluetooth, data and gps off. I only turn them on when I need them. \n\nThe battery life on this phone is absoluteley amazing. Running Xiaomi EU Rom, MIUI 9,  ver7.10.12", "time": "16th October 2017, 11:43 AM", "postID": "post74177312", "replies": []}, {"text": "Install forcedoze from the app store and enable with ignore movement sensors.  2 or 3% over night for me and works great during the day. You wont really do much better.", "time": "17th October 2017, 12:53 PM", "postID": "post74190595", "replies": []}, {"text": "No pictures in my previous post, so I'll put them here\r\n2-3% overnight with everything on, but automatic energy saver from 1 to 7am. Don't know if that helps, I think it just disables GPS and maybe closes apps more aggressively.", "time": "17th October 2017, 02:31 PM", "postID": "post74191699", "replies": []}, {"text": "Updated to last .eu weekly, 7.10.19, and drain is higher, about 5% overnight. Hoping it will be better after a while, as it was before. SOT is also worse, down by about 1h to maybe 5h.", "time": "24th October 2017, 05:47 AM", "postID": "post74273343", "replies": []}]}, {"title": "Heavy use endurance", "rating": 4.0, "links": ["https://forum.xda-developers.com/mi-5/review/heavy-endurance-t3348484"], "threads": []}, {"title": "Light use endurance", "rating": 4.5, "links": ["https://forum.xda-developers.com/mi-5/review/light-endurance-t3348485"], "threads": [{"text": "can last a day for light usage (24 hours)", "time": "3rd November 2016, 11:37 AM", "postID": "post69439840", "replies": []}, {"text": "I usually drain it with around 35 - 40 % per day with light usage...very good.", "time": "3rd November 2016, 12:57 PM", "postID": "post69440749", "replies": []}, {"text": "I get ~40hrs with light usage", "time": "9th November 2016, 06:24 AM", "postID": "post69529969", "replies": []}, {"text": "it usually lasts me 3 days, with around 5 hours of screen on time and 10% battery left. it's worth mentioning that sync is off and i don't use battery draining apps, like facebook or messenger.", "time": "18th November 2016, 10:07 PM", "postID": "post69688468", "replies": []}, {"text": "3 days with 4-5 hours SOT but mainly on wifi, 30 mins  calls a day and MiBand connected.", "time": "29th November 2016, 07:58 PM", "postID": "post69853182", "replies": []}, {"text": "i never get 24 hour in light use\r\nmeybe aroud 16-18 hour\r\nmaybe because may place didnt have good celular signal", "time": "3rd December 2016, 03:52 PM", "postID": "post69911353", "replies": []}, {"text": "For me, after several weeks with LOS installed, the battery comsumption is exactly as others here found it, 30-40% a day with light usage", "time": "5th February 2017, 01:25 AM", "postID": "post70882979", "replies": []}]}, {"title": "\"Look\" of the device (aesthetics)", "rating": 4.5, "links": ["https://forum.xda-developers.com/mi-5/review/look-device-aesthetics-t3348486"], "threads": [{"text": "i love it is like a new woman......it takes time to change your mind...... until this you get another", "time": "10th February 2017, 01:12 PM", "postID": "post70967156", "replies": []}]}, {"title": "Quality feel (use of materials)", "rating": 4.5, "links": ["https://forum.xda-developers.com/mi-5/review/quality-feel-materials-t3348487"], "threads": [{"text": "the quality material is quiet good\r\nbut didn't feel like flagship because its very light", "time": "3rd December 2016, 03:48 PM", "postID": "post69911311", "replies": []}, {"text": "Gorilla glass screen is not as scratch resistant as one might think. Aluminum sides are quite nice, buttons are great. Speakers and selfie cam are mediocre. Overall: quite a nice device, not perfect.", "time": "5th December 2016, 09:09 AM", "postID": "post69935939", "replies": []}]}, {"title": "Ergonomics (in-hand feel)", "rating": 4.5, "links": ["https://forum.xda-developers.com/mi-5/review/ergonomics-hand-feel-t3348488"], "threads": [{"text": "It's really ergonomic\r\nI've the OEM (Xiaomi) Shockproof Case and the Mi5 still good in hand not too big neither too heavy\r\nI go with my thumbs (i've very large hands) on the top of the screen without the need to move the phone.", "time": "7th June 2016, 04:24 PM", "postID": "post67211928", "replies": []}, {"text": "How does the glass back feel in hand? Is it like the Samsung S7? Had one in hand today and felt kind of warm and slippery, not that premium.", "time": "3rd August 2016, 06:55 PM", "postID": "post68029611", "replies": []}, {"text": "Feels better than Mi 4c, especially in landscape mode when you're playing games or taking pictures.", "time": "4th August 2016, 06:19 AM", "postID": "post68035798", "replies": []}, {"text": "Feels really good in the hand. Easy 1 hand usability. Light. Comfortable to hold cause of the curved back and edge. \nIt is slippery though!", "time": "14th August 2016, 04:57 AM", "postID": "post68178608", "replies": []}, {"text": "sometimes if holding \"incorrectly\" in palm, the edge could be wrongly \"touched\" and affect the touch on the screen.", "time": "3rd November 2016, 11:38 AM", "postID": "post69439860", "replies": []}, {"text": "This is one of the aspect where probably Mi5 is one of the best mobile absolutely. \n\n5.15 inch, less than 130 g, just perfect. \nAlso with a cover it still remains really handy.", "time": "7th April 2017, 03:28 PM", "postID": "post71765317", "replies": []}, {"text": "Screen has sharp edges, not really pleasure to hold. And it's slippery a lot, you can't even put it on desk/glass because it immediately slip and fall down. \nBack panel is nicely curved, overall looks good 😁\n\nMoto X with leather back and 2.5D front is much better with these. I'm starting looking for back skin...", "time": "8th April 2017, 02:51 PM", "postID": "post71777790", "replies": []}, {"text": "at first i thought having curve back was good but not really with mi5 because of the sharp feel of metal bezel. its slippery as well with the glass. otherwise it feel good for one handed phone use", "time": "9th April 2017, 07:50 AM", "postID": "post71786257", "replies": []}, {"text": "It really fits perfect in my hands but with wet hands or when the phone is really cold (during winterdays) it is slippery. I was lucky enough to not let it fall down (doesn't like cases at all, they ruin the optic of any phones )", "time": "20th April 2017, 03:59 PM", "postID": "post71948173", "replies": []}]}, {"title": "OEM skin/software", "rating": 3.5, "links": ["https://forum.xda-developers.com/mi-5/review/oem-skin-software-t3348489"], "threads": [{"text": "I'm in the \"if it isn't broke...\" camp. I don't like MIUI - If I'd wanted IOS, I would've got an iPhone.", "time": "11th July 2016, 02:13 PM", "postID": "post67696889", "replies": []}, {"text": "Yeah, me neither. 5 minutes after pulling it out of the box bootloader was unlocked and RR was installed. It's a matter of who likes what, but I don't like MIUI.", "time": "15th July 2016, 10:05 AM", "postID": "post67754123", "replies": [{"text": "What is that you mentioned \"RR\" ?", "time": "17th July 2016, 07:25 PM", "postID": "post67787733", "replies": [{"text": "Resurrection Remix", "time": "18th July 2016, 06:30 AM", "postID": "post67793581", "replies": [{"text": "still havnt received my unlock code, what text did you put in the request unlock code box on the website to get it that fast /??", "time": "21st July 2016, 08:24 AM", "postID": "post67839358", "replies": [{"text": "I just wrote that I want to install custom ROM", "time": "22nd July 2016, 10:06 AM", "postID": "post67854181", "replies": []}, {"text": "it may take few days. like 4 or 5 days. it's depend.", "time": "25th July 2016, 02:42 PM", "postID": "post67896883", "replies": []}]}, {"text": "Do you like RR? What things aren't working?\r\nI really hate the pos-software called miui just after 2 days of use", "time": "28th July 2016, 04:30 PM", "postID": "post67942750", "replies": [{"text": "Yes, I love it! The only thing that isn't working is capacitive home button. It is because of lack of kernel sources. When (if?) Xiaomi releases sources, devs will be able to handle this issue for sure.\n\nEdit: Oh, and some people reports VoLTE not working. I can't test it as my service provider don't offer it.", "time": "1st August 2016, 06:32 AM", "postID": "post67990587", "replies": []}]}]}]}]}]}, {"title": "Outdoor visibility (max brightness)", "rating": 5.0, "links": ["https://forum.xda-developers.com/mi-5/review/outdoor-visibility-max-brightness-t3348490"], "threads": [{"text": "fantastic", "time": "10th February 2017, 01:10 PM", "postID": "post70967127", "replies": []}, {"text": "Great. Don't have any problems.", "time": "4th March 2017, 08:49 AM", "postID": "post71277301", "replies": []}, {"text": "Outdoor visibility is really good. \n\nThat's because Mi5 display can reach more than 600 nits of brightness and is poor reflective.", "time": "7th April 2017, 05:18 PM", "postID": "post71766774", "replies": []}, {"text": "not so good,  perhabs rom or kernel? \nrom: resurrection remix 5.8.0\nkernel: dragon xia 3.5", "time": "28th April 2017, 04:24 PM", "postID": "post72077638", "replies": []}]}, {"title": "Contrast (true blacks)", "rating": 5.0, "links": ["https://forum.xda-developers.com/mi-5/review/contrast-true-blacks-t3348491"], "threads": []}, {"title": "Color saturation & accuracy", "rating": 5.0, "links": ["https://forum.xda-developers.com/mi-5/review/color-saturation-accuracy-t3348492"], "threads": []}, {"title": "Clarity/resolution", "rating": 5.0, "links": ["https://forum.xda-developers.com/mi-5/review/clarity-resolution-t3348493"], "threads": []}, {"title": "Minimum brightness", "rating": 5.0, "links": ["https://forum.xda-developers.com/mi-5/review/minimum-brightness-t3348494"], "threads": []}, {"title": "Call quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/mi-5/review/call-quality-t3348495"], "threads": [{"text": "great", "time": "10th February 2017, 01:10 PM", "postID": "post70967120", "replies": []}]}, {"title": "WiFi strength, range, and throughput", "rating": 4.0, "links": ["https://forum.xda-developers.com/mi-5/review/wifi-strength-range-throughput-t3348496", "https://forum.xda-developers.com/mi-5/review/wifi-strength-range-throughput-t3348496/page2", "https://forum.xda-developers.com/mi-5/review/wifi-strength-range-throughput-t3348496/page3", "https://forum.xda-developers.com/mi-5/review/wifi-strength-range-throughput-t3348496/page4"], "threads": [{"text": "Wifi isn't strongest 5's part. Pretty weak, when my old s6 gets 3bars of wifi, 5's only one. Maybe new wifi driver would help, just need to wait.", "time": "2nd April 2016, 05:43 PM", "postID": "post66161684", "replies": []}, {"text": "just checked mine against my s6 and my mi5 gets 3 bars(switching to 4 sometimes) and so does the s6.\n\nedit:just installed wifi analyzer on both phones and both measure at -70dbm for my network. Identical", "time": "2nd April 2016, 07:46 PM", "postID": "post66163447", "replies": []}, {"text": "I was in a friend house today and mi5 had 1 bar (sometimes 0 bars) and my work phone (an iPhone 6) had 3 bars", "time": "3rd April 2016, 07:35 PM", "postID": "post66178138", "replies": []}, {"text": "don't look at the number of bars, they could be set up differently. use wifi analyser to check signal strenght received by the phones, or do a speedtest", "time": "17th April 2016, 05:26 AM", "postID": "post66402766", "replies": [{"text": "Yes, exactly.\n\nI just got my xiaomi mi5 black 64gb and in comparison to my wife's s6 we get different results in respect how wifi bars are being displayed. S6 shows full wifi bars, xiaomi shows 3 (supposedly @middle of signal strength) , but speedtest shows that both phones get the same ~200Mbps download/upload speed. Tested on netgear r7000 router with 250Mbps fiber connection.", "time": "28th April 2016, 02:47 PM", "postID": "post66588547", "replies": []}]}, {"text": "Regardless of the bars showing, Mi5 has poor wifi strength.\n\nI use my smartphone every day of my life many time lying on my bed. As you can imagine, the area in which I use the mobile will be as much 40x40cms (actually less), so that the accuracy of my \"experience\" is great. Wifi signal is poor exactly in this area of my house. I haven't measured data, but I know count the times disconnects from my network to connect to 5Ghz 2.4Ghz (2.4 gives me more distance), or disconnected directly from 2.4Ghz.\n\nAbout 5Ghz, MI5 is better than the Nexus 4 and worse than a G2, which is not the best in the world about signal strength.\nAbout 2.4Ghz is worse than both, at least in the ROM I've been so far.", "time": "17th May 2016, 12:02 AM", "postID": "post66885249", "replies": []}, {"text": "Mi5 (unofficial CM13) vs Moto G 3rd gen official CM13 (better)", "time": "9th August 2016, 07:52 PM", "postID": "post68114870", "replies": []}, {"text": "My new Mi5 with Global Stable Rom (latest) has weak wifi signal. In a distance of 15-20 meter with some walls in between I used to have 2 bars with my old Xiaomi Redmi 3 and now with my Mi5 I don't have any signal at all. There is something definately wrong with the Wifi of this phone. Hope a driver or an update from Xiaomi will fix it or else the phone is useless", "time": "17th August 2016, 08:18 AM", "postID": "post68225703", "replies": []}, {"text": "Mine is surprisingly good, better than my previous Mi 4c. We have two AP on each floor in my office. With Mi 4c, going up or down from one floor to another, there's a blank spot somewhere on the stairs. With Mi 5, none. It just switches smoothly from one AP to another. Sometimes it even sticks to AP at the first floor when I'm on the second, pretty neat to pass through the thick floor.\n\r\nHere's the one at my home:", "time": "17th August 2016, 09:41 AM", "postID": "post68226478", "replies": []}, {"text": "Hey,  news on this? I'm on the lastest developers rom and the signal is way worst than on lg g3 :\\ often it says no internet connection. where g3 doesn't have any problem.", "time": "12th September 2016, 02:02 PM", "postID": "post68650426", "replies": []}, {"text": "In Spain I dont have Wifi Problem", "time": "14th September 2016, 01:46 PM", "postID": "post68683618", "replies": []}, {"text": "my wifi is poor too", "time": "23rd September 2016, 02:16 AM", "postID": "post68817528", "replies": []}, {"text": "my wifi is awful. The range is low, 5-10meters and the donwload maximun is round 400kb/s. Please anyone knows how we can fix this? \r\nthank u", "time": "1st October 2016, 08:52 PM", "postID": "post68942421", "replies": []}, {"text": "I bought new mi5 32GB on Friday 21 2016, When i tried to transfer a single file small video file just about 88MB from one of the mobile to MI5 it took 6 mins to receive in Mi5. I used shareit app to transfer fileS between two mobiles.  \n\r\nAnd moreover when i tried to connect the MI5 device through wifi . Its very slow its not even crossing 1mbsp speed to download.\r\nI have very good wifi internet connection there is no issues in the internet or wifi signal.\n\r\nCan any one please help me in fixing the wifi issue?", "time": "22nd October 2016, 04:35 AM", "postID": "post69246762", "replies": []}, {"text": "Wi-fi strength is bad... in MIUI 8. I never thought different ROMs will differ.\r\nIn my bathroom (yes, I carry my phone in bathroom), Wi-fi will come and go in MIUI 8.\n\r\nHowever, it is better in CM 13 and CM 14. Didn't have that problem in my bathroom. So I think Wi-fi signal is good, depends on what ROM you use.\r\nBefore Mi5, I used LG G2. Mi5 is better (with CM 13 ROM, of course) than my old G2.", "time": "26th November 2016, 09:20 AM", "postID": "post69797499", "replies": []}, {"text": "It is definitely better than my previous phone - mi3. I am surprised it connects to some quite remote networks.", "time": "29th November 2016, 07:54 PM", "postID": "post69853133", "replies": []}, {"text": "it has great signal and wifi reception compare to my redmi note 4", "time": "3rd December 2016, 03:41 PM", "postID": "post69911204", "replies": []}, {"text": "I also think Mi5 wifi performs worst than my previous phones like the Lenovo K3 Note and Xiaomi Redmi Note 3 Pro. The Bluetooth also has worse signal like the Redmi Note 3 Pro (Lenovo K3 was way better). \n\nCould it be with the antennas placement? Because I can see the bars go up and down if I hold the phone differently (wifi analyzer is the same)", "time": "14th December 2016, 01:58 PM", "postID": "post70085584", "replies": []}, {"text": "From the posts, it looks like the bad WiFi experiences may be the fault of the official ROM. Can more people report on their experience with WiFi on custom ROMs?", "time": "6th March 2017, 07:41 AM", "postID": "post71303129", "replies": []}, {"text": "I discovered that wifi channel (in router settings) is a great difference. My phone works great on channel \"1\" but it's around zero if I allow router pick channel randomly", "time": "7th March 2017, 05:32 PM", "postID": "post71324183", "replies": []}, {"text": "I a;so facing wifi signal poor problem and its harassing me. so what can i do now", "time": "30th April 2017, 08:18 PM", "postID": "post72106423", "replies": []}, {"text": "I had excellent wifi signal with LineageOS, until switched back to MIUI 8 (eu version). Before i had 3-4 bars and no connection problems in my room, but now i have only 1-2 and keep disconnecting from time to time.", "time": "31st May 2017, 10:22 PM", "postID": "post72501261", "replies": []}, {"text": "Pretty weak", "time": "15th June 2017, 05:05 AM", "postID": "post72677611", "replies": []}, {"text": "Mi5 cannot detect dual band signal (5.0Ghz SSID) from my router. I guess everyone is going through same issue when it comes to 5.0Ghz.", "time": "24th June 2017, 05:33 PM", "postID": "post72790350", "replies": [{"text": "Working fine with Mi Wifi Router Mini and Yi 4K+, faster speed as well.", "time": "30th June 2017, 10:51 PM", "postID": "post72864688", "replies": []}, {"text": "Rotuer at home (orange funbox 2.0): no difference between 2.4GHz or 5GHz - works on both\nWifi at work:Ruckus APs - working as intended.\n\n5GHz network reporting 430Mbps connection speed (between phone and router - not to the internet) at home and in the office.\nWith that said - speedtest reaches limits of ISP contract...", "time": "12th September 2017, 05:26 PM", "postID": "post73766753", "replies": []}]}, {"text": "i believe the poor wifi performance is due to the bad antenna design.", "time": "29th June 2017, 06:49 PM", "postID": "post72850826", "replies": []}, {"text": "My Mi5 32GB\n\nMIUI 8.2.2.0\n\nchannel 155 @ 5G", "time": "1st July 2017, 05:10 PM", "postID": "post72872444", "replies": []}, {"text": "Wifi is fine, up there with the best phones I had.", "time": "3rd July 2017, 12:42 PM", "postID": "post72891584", "replies": []}]}, {"title": "Cellular strength and throughput", "rating": 4.5, "links": ["https://forum.xda-developers.com/mi-5/review/cellular-strength-throughput-t3348497", "https://forum.xda-developers.com/mi-5/review/cellular-strength-throughput-t3348497/page2"], "threads": [{"text": "HI,\r\nI have a real problem with my Mi 5, the cellular card seems not to work properly, indeed it constantly changing from one network to another , es: from 4G to H+ to H  so the LTE cell is not well detected.\r\nI have made some test with  SpeedTest  using two smartphones ( Z1 on the left - Mi 5 on the right )  with the same Network operator and into the same place but the result are  completely  different see the enclosed image . Does any one have the same problem? \r\nThank you \r\nS", "time": "4th May 2016, 03:09 PM", "postID": "post66692087", "replies": []}, {"text": "I can confirm that I have same issues, I sometimes drop to E. I have never had issues like this previously with any of my Nexus phones. There is definitely something wrong here. WiFi isn't any better. I can't connect to router from place in my house where Nexus 5 does just fine with 4 out 5 bars.\n\nNot good.", "time": "7th June 2016, 02:18 AM", "postID": "post67203115", "replies": []}, {"text": "I'm thinking on buying this phone, I live in the US but as far as I know, none of the LTE band this phone uses is compatible with any US carriers, right?\r\nI use MetroPCS, btw.", "time": "18th June 2016, 06:40 AM", "postID": "post67371007", "replies": []}, {"text": "Have Band 3 LTE in my country but cant access it at all! maximum HSDA+ but no LTE  \nUsing Mi5 pro official China stable ROM", "time": "30th June 2016, 11:00 PM", "postID": "post67552588", "replies": [{"text": "Same problem as lordtao", "time": "9th July 2016, 10:30 AM", "postID": "post67667911", "replies": []}]}, {"text": "Yes with latest 7.5.1.0 I got some issues with cellular.\n\r\n(usa/tmobile)", "time": "5th July 2016, 12:29 AM", "postID": "post67606945", "replies": []}, {"text": "I also have problems. It usually switch to E or No Signal for a while. Maybe with public kernel source someone could fix that.", "time": "9th September 2016, 10:00 PM", "postID": "post68610728", "replies": []}, {"text": "Using MIUI 8, I notice that phone will switch to \"No Signal\" for a very brief moment and then went back.\r\nDidn't have that kind of problem in CM 13/ CM 14.", "time": "26th November 2016, 09:21 AM", "postID": "post69797516", "replies": [{"text": "I'm interested in buying this phone. Can we please get more feedback, guys? Maybe reception (WiFi too apparently) is bad with official ROM but ok on custom ROMs?", "time": "6th March 2017, 07:43 AM", "postID": "post71303141", "replies": [{"text": "", "time": "8th March 2017, 02:34 PM", "postID": "post71336564", "replies": []}]}]}, {"text": "I'm able to get consistent wifi, able to stream videos from my home server smoothly. Full connection throughout the house.\n\r\nBut cellular is a bit patchy, sometimes dropping to \"Emergency calls only\" while moving (for example, car, bus).\r\nIt's good while stationary, but often sits just short of full bars.", "time": "11th March 2017, 07:18 AM", "postID": "post71377218", "replies": [{"text": "Same issue here, static is OK, but when fast moving in a car or any transport **** happens.\r\nI'm using Global Stable 8.1.4.0(MAAMIDI).", "time": "14th March 2017, 12:27 AM", "postID": "post71417617", "replies": []}]}]}, {"title": "Speakerphone (loudness, clarity)", "rating": 4.0, "links": ["https://forum.xda-developers.com/mi-5/review/speakerphone-loudness-clarity-t3348498", "https://forum.xda-developers.com/mi-5/review/speakerphone-loudness-clarity-t3348498/page2", "https://forum.xda-developers.com/mi-5/review/speakerphone-loudness-clarity-t3348498/page3"], "threads": [{"text": "it's loud, but on max volume there's a lot of distortion, contacted Xiaomi, they sayed that's normal (i don't think so, maybe faulty batch, mine's 64GB white one). Overall, loud, but not clear enough.", "time": "31st March 2016, 06:51 PM", "postID": "post66131529", "replies": []}, {"text": "How is the sound quality through 3.5mm jack?", "time": "31st March 2016, 08:24 PM", "postID": "post66132968", "replies": [{"text": "Great and loud, loudest from all phones i had. Check gsmarena review for more details", "time": "31st March 2016, 09:21 PM", "postID": "post66133829", "replies": []}]}, {"text": "Anybody tried to cover one of the speakerphone holes? I've tried mine, and sounds from the left ones are small compared to the right ones. I looked into the holes, and it seems that something covered the left holes from the inside. I've attached a picture of it.", "time": "4th April 2016, 07:57 AM", "postID": "post66185112", "replies": [{"text": "same for my phone, seems to be normal", "time": "4th April 2016, 08:56 AM", "postID": "post66185688", "replies": []}, {"text": "the left hole probably contains mic and no speaker and also for symmetry", "time": "4th April 2016, 12:15 PM", "postID": "post66187757", "replies": []}, {"text": "Hey mate,\n\r\nThat is not the speaker hole. That hole for the mic and this phone comes with the single speaker (just mono not like stereo).", "time": "17th July 2016, 07:30 PM", "postID": "post67787790", "replies": []}]}, {"text": "loud and clear", "time": "11th April 2016, 09:02 AM", "postID": "post66301677", "replies": []}, {"text": "loud and beautiful", "time": "26th April 2016, 07:24 AM", "postID": "post66550350", "replies": []}, {"text": "The speakerphone is very loud and clear, it's amazing to have the combination of both", "time": "7th June 2016, 04:11 PM", "postID": "post67211744", "replies": []}, {"text": "In test the loudspeaker is quiet good \n\n\n\r\nSource: G******A", "time": "6th July 2016, 08:41 PM", "postID": "post67633065", "replies": []}, {"text": "I have no problem with the speakerphone sound, but the headphone out could be a lot better, lots of background noise with sensitive in ear monitors. That said, other \"flaships\" like the LG G2 suffer from the same problem...", "time": "12th December 2016, 06:24 PM", "postID": "post70056311", "replies": [{"text": "I'm afraid it's your headphones mate. The phone is very clear and proper tests (through GSMarena) show that it has the lowest distortion of any phone on the market (conparable to Sabre DACs), not to mention it's decently loud too, something phones like the G2 can't boast. That said, I didn't like the sound signature (how the output is shaped), so I replaced the audio driver with Viper4Android and disabled Xiaomi's driver altogether. I suggest you try that and see if that works for you?", "time": "5th February 2017, 06:38 PM", "postID": "post70893357", "replies": [{"text": "In a way it really is the headphones, for being such good IEM \nThey cost more than the Xiaomi Mi5. Problem is, good IEM are generally very sensitive, so they need a good quality source, with no background noise.\n\nSorry but it the Mi5 really has bad sound quality. Way worse that any iPhone.\n\nI've given up and went and bought an IPhone 7. No problems there, of course.", "time": "5th February 2017, 07:23 PM", "postID": "post70893939", "replies": [{"text": "I also prefer IEMs for their sound quality. Which ones do you use? Also, check out this website and run the tests, it's quite fun and revealing: http://www.audiocheck.net/soundtests_headphones.php\n\nSee the attached screenshot. There shouldn't be an audible distortion difference between the Mi 5 and iPhone. And unlike the iPhone, you can actually change the audio driver to suit your preference.\n\nEdit: Looking at the numbers you can see that the Mi 5 has quicker frequency response, lower noise level, higher dynamic range, less harmonic distortion, less intermodulation distortion, and less stereo crosstalk than an iPhone 6s. There is not a single thing you can measure where the iPhone does better yet you call the Mi 5 \"way worse\". I don't have an iPhone on me so I can't verify it myself, but output should be identical.", "time": "5th February 2017, 07:51 PM", "postID": "post70894298", "replies": []}]}]}]}, {"text": "Which ROM are you using? Do you have VoLTE in your country?\r\nI am using CM 13.0-20161211-NIGHTLY.\r\nThe speakerphone sound is pretty loud and clear, but my friends tell me my mic is pretty bad while I'm using the speakerphone.\r\nI think my problem is ROM dependent rather than a hardware defect.\r\nI am planning to revert to MIUI soon, I will keep you posted.", "time": "13th December 2016, 10:36 PM", "postID": "post70076436", "replies": []}, {"text": "I got crackling and broken loudspeaker, tried to flash another ROM but the issue persisted", "time": "16th December 2016, 02:30 PM", "postID": "post70118432", "replies": []}, {"text": "I flashed MIUI Global Stable ROM.\r\nThe speakerphone now works fine on phone calls.\r\nI still got issues on Skype calls though (it occurs only on Skype).", "time": "16th December 2016, 02:44 PM", "postID": "post70118642", "replies": []}, {"text": "i got htc one m8 now, and planning to upgrade to this phone, what do i need to expect about sound quality?", "time": "4th February 2017, 05:02 AM", "postID": "post70870697", "replies": []}, {"text": "Westone 4.\n\nThere's nothing wrong with the iPhone 7 output, as clean as it can be, no need to alter the sound.\n\nAbout the measurements, those are quite limited and basic. Just an example: without measuring the output impedance, another basic measurement, no one can know how the Mi5 performs with sensitive IEM. My guess is that the output impedance is quite high. Fine for larger headphones or less sensitive IEM, but not for sensitive IEM.", "time": "5th February 2017, 07:54 PM", "postID": "post70894325", "replies": [{"text": "I see you prefer perfectly balanced output, those drivers are really good, much better than mine (Sennheiser Momentum 2, 20Ohm). It's really interesting that you mention the iPhone 7 output is so clean, you make me extremely curious and I seriously want to get my hands on one to test the sound.\n\r\nWell considering how deafening loud the Mi 5 can be, and how the Mi Note was aimed at driving proper over ear headphones, my guess is they were designed for high impedance output as well. I don't like headphones because even expensive ones sound pretty ****ty if you compare them to IEMs.\n\r\nDid you check out the website link I sent you?", "time": "6th February 2017, 08:01 AM", "postID": "post70900143", "replies": []}]}]}]