[{"title": "Overall love", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s7/review/overall-love-t3330737", "https://forum.xda-developers.com/galaxy-s7/review/overall-love-t3330737/page2", "https://forum.xda-developers.com/galaxy-s7/review/overall-love-t3330737/page3", "https://forum.xda-developers.com/galaxy-s7/review/overall-love-t3330737/page13"], "threads": [{"text": "Perfect smartphone, for me!", "time": "7th March 2016, 09:01 PM", "postID": "post65708848", "replies": []}, {"text": "After a weeks use.. Battery is great, display is great, and it feels much better in hand than the S6..", "time": "9th March 2016, 02:23 PM", "postID": "post65739046", "replies": []}, {"text": "All we need is root and my  life is complete", "time": "9th March 2016, 04:19 PM", "postID": "post65741174", "replies": [{"text": "This is first time when I don't need root. Everything works well. Annoyng sound while booting is away, sound when charging could be turned off.\r\nApplications data can be restored wth Helium, Package Disabler can stop bloatware.\r\nOnly ads in applications are remaining but I can live with it.", "time": "10th March 2016, 10:58 AM", "postID": "post65755676", "replies": [{"text": "What about camera sounds? They are quite annoying to me.", "time": "10th March 2016, 01:54 PM", "postID": "post65758217", "replies": [{"text": "Mute System volume. I made a rule in Tasker for that. No Camera sounds. \r\nI know, it is more work than one switch in the application with root but it isn't worth to lose warranty. Only one thing I cannot fix without root are ads. But I have only one game with ads and I can live with them.", "time": "10th March 2016, 02:08 PM", "postID": "post65758446", "replies": []}, {"text": "Are you talking about shutter sound? Just go into the camera settings and turn it off.", "time": "10th March 2016, 03:49 PM", "postID": "post65760203", "replies": []}]}]}]}, {"text": "I could be wrong, but it is my understanding that root/knox tripping doesn't affect warranty inside the EU.", "time": "10th March 2016, 02:37 PM", "postID": "post65758916", "replies": []}, {"text": "So far I like it, feels much lighter than my Note 3 and is considerably faster in everything it does. Using Package Disabler to slowly disable the ton of junk on there, the DirecTV thing keeps popping up which is getting old real quick especially as I have disabled it twice now.", "time": "10th March 2016, 05:10 PM", "postID": "post65761706", "replies": []}, {"text": "The Galaxy S7 looks like a great phone. Samsung improved in many areas from its predecessor. Congratulations! Great reviews. \n\nIgor Goldshteyn\nTucson, Arizona", "time": "10th March 2016, 07:57 PM", "postID": "post65764635", "replies": []}, {"text": "I am really impressed with the fluidity of these Sammy animations.   SD card is a bitch, tho.", "time": "10th March 2016, 09:08 PM", "postID": "post65765813", "replies": []}, {"text": "This phone absolutely ROCKS!!!\n\r\nI have the Gold AT&T S7 w/ the free 64 GB sdcard from BestBuy... and free Gear VR.\n\r\nThis phone is sooo much faster than my S6 Edge was.  It's better in every way.\n\r\nThe fingerprint button CRUSHES my S6 Edge in speed... wow.\n\r\nThe screen is AMAZING... can't believe it's better than the S6, but it is... brighter, crisp, vivid colors.\n\r\nI like the improved trimmed-down Touchwiz.\n\r\nMy battery life is PHENOMENAL... no comparison to S6 Edge.\n\r\nI swear to you these superlatives are not exaggerations... it really is that good.\n\r\nI've been developing an app and testing it daily on the S6 Edge for the better part of a year.  I've owned the HTC One M7 and M8 and developed on those -- rooted 'em, custom kernels, etc, and various iPhones 3-5.\n\r\nThe S7 is the King of Android phones, as far as I'm concerned.  I won't even try to compare it to the iPhone  .\n\r\nIt's fast as hell... and doesn't get hot like my S6 Edge did.\n\r\nSo yeah, it completely rocks in pretty much every way... works well with my Huawei Watch, bluetooth paired with my Model S no problem... Wifi works great, LTE great... call quality great.\n\r\nI would have preferred it to have kept the IR blaster, and if it was lighter it would be nice, but those are pretty minor quibbles... sure unlocked boot loader, etc. would be nice, but heck, simply developing for Android takes enough time let alone hacking the phone itself, so I don't really miss not being able to root, but anyway.\n\r\nOverall it simply blows my mind.\n\r\nSmartphone Nirvana.  Not kidding.", "time": "10th March 2016, 10:53 PM", "postID": "post65767315", "replies": []}, {"text": "Very happy with the phone so far. \n\nGear VR is rly fun too.", "time": "11th March 2016, 01:11 AM", "postID": "post65768846", "replies": []}, {"text": "overall the phone is good but battery life is not so great sure it will be fixed in the future updates \n\nI own the SM-G930F", "time": "11th March 2016, 12:01 PM", "postID": "post65775926", "replies": []}, {"text": "hello maybe some can help me disable device security form smart manager.....if there is a way..... ( i don't want it", "time": "15th March 2016, 12:06 AM", "postID": "post65842472", "replies": []}, {"text": "Call me fanboy or anything. But this one is near perfection.\n\r\nOn star discount by bloatwarez from Samsung, Google, Microsoft, and Facebook.", "time": "15th March 2016, 09:42 AM", "postID": "post65848145", "replies": []}, {"text": "Just got it last night, upgraded from Note 4 - the fluidity of it blows my Note 4 away, which lagged a bit, especially opening the camera and switching to and from camera and gallery. I've gone from the S3 to Note 4 and now to this and am happier each time with the trimmed down TouchWhiz and less bloat. I do have two questions though:\n\nI was under the impression you could have just the \"edge\" always one with time/date, etc. although I don't see this as an option, only the \"always on display\" which is the whole screen. Am I missing something?\n\nWhen I open a game, CoC for instance, my screen goes to like full on torch mode - ultra saturated, and looks pretty bad. I have the screen set to Basic but for some reason it changes when I open CoC.\n\nLoving the phone so far, hopefully the battery impresses.", "time": "15th March 2016, 02:06 PM", "postID": "post65851648", "replies": []}, {"text": "I love this phone. Had a S6 for a while, but could not live with the horrible battery and reception. All gone with this beauty. Best phone I've had, and I've had hundreds of phones over the years...", "time": "15th March 2016, 09:24 PM", "postID": "post65859304", "replies": []}, {"text": "Well, I actually left Verizon where I had the badass Motorola Droid Turbo 2 (which I'll never stop loving) to T-Mobile and got the Galaxy S7. I like it so far, but I'm not in love with it like my Droid. Hopefully, it'll grow on me...", "time": "15th March 2016, 10:22 PM", "postID": "post65860244", "replies": []}, {"text": "does anyone know how to disable device security from smart manager ???", "time": "16th March 2016, 08:52 PM", "postID": "post65878459", "replies": []}, {"text": "For a flagship phone I think the S7 is underwhelming.   There is absolutely nothing new in the phone. \n\r\nThe implementation of the Always On Display is pretty useless.  It can only display Samsung Apps.   I heard LG G5 can do a lot more. \n\r\nThe display is nice. But so it was on the S5 and S6.   \n\r\nAnd finally, IMO is the \"BACK\" button on the right!. It should be on the left.", "time": "17th March 2016, 07:05 PM", "postID": "post65895778", "replies": []}, {"text": "This phone MUST have 5 stars.. I have never ever had a greater phone.. \r\nAll is fast and fantastic..", "time": "18th March 2016, 11:26 AM", "postID": "post65906966", "replies": []}, {"text": "In the past few years my wife and I went from Note 2 (Verizon) to Note 4 (ATT) and now back to Verizon on this S7.   We simply got tired of carrying around the behemoth phablet so we were looking to downsize to either S7 Edge or the S7, Verizon offered BOGO deal with both our Note 4 trade in, they also gave us two free Samsung S2 watch ($350 retail each), extra $100 visa credit per line, and more data for less (16GB for $80 vs 15GB for $100 from ATT), can also claim the free VR gear from samsung, too good of a deal to past up!  LOL  I heard the Edge screen is super sensitive (saw quite a few complaints on S7 Edge forum) and there's no getting around it yet, and some people had the curve screen scratch too easily.  After playing around with both phones at the store we found the Edge wasn't much of a downsize anyway but the S7 is just perfect.   \n\nPerformance:\nThe camera from S7 is leap and bound above the Note 4, it focus instantly, it is significantly more responsive than our Note 4, which had some focusing bugs issues, the Note 4 simply would not focus until we shoke the phones a few times, I've went through two new Note 4 with the same focusing problem, odin new rom or factory reset did not help either, it happened on 4.4 Kitkat and 5.01 Lolipop so it seems like a hardware issue.  Overall we love our new S7, it feels much more responsive navigating and opening multiple apps, didn't notice lag like we often do with Note 4, no delay in keyboard.  Battery life seems fine to us, it last us all day so no complaint there, though the phone does run warmer than Note 4, during charge or heavy usage in cpu/gpu intensive apps or games.  Usually we upgrade our phones in 2 years cycle so the non-removable battery never bothers us at all, we have never needed to replace the battery on Note 2 or Note 4.\n\nCase:\nWe bought several different cases for the S7, the $20 VRS Design High Pro shield feels cheap and the shell is too thin and inadequate to protect from drop, volume and power buttons are free floating and clicky, they are easily fell off as well.  2nd one we ried was the $40 Otterbox Defender, unfortunately the built-in screen protector on both unit we bought have too much gap and don't sit flush to the screen, the buttons for volume and power are extremely stiff and hard to press in, for whatever reason Otterbox mess this one up for the S7, this is a complete garbage comparing to the Defender we had on our Note 4, won't even pay $20 for this junk so we returned it.   3rd one we tried was the SUPCASE Full-body Rugged Holster Case with Built-in Screen Protector for $18, it is slightly slimmer than the Otterbox Defender but fits like a glove, the screen protector sits flush to the screen with zero gap or rainbow effect, my wife can't even tell there's a screen protector in place, volume and power buttons are responsive and easy to press, overall the SUPCASE feel as rugged as the defender from our Note 4, it is what the S7 Defender should have been.  I would gladly pay $40 for it, feels like I ripped them off for paying only $18 from Amazon.  If you want a rugged case for the S7 the SUPCASE is the one to get!", "time": "20th March 2016, 09:21 AM", "postID": "post65940280", "replies": []}, {"text": "I just bought this with nice deal (400€ or about 450$) new from my operator and I am especially happy with still camera quality and battery endurance.\n\nBecause I live in dark north, camera quality is very important to me. \n\n+Wireless charging inbuilt\n+Water resistance\n+Camera and manual controls for this\n+Overall quality\n+Batterys endurance\n.+Not so slippery that I thought\n\n-Fingerprint magnet in back, at least in gold version\n-The fingerprint sensor could be always better\n-4K videos not as stunning, at least theres always FHD@60fps what is nice one\n-Not easy to change the battery or pay this date about 60€\n\nPs. forgot to mention the possibility to lower screen resolution, which gives you an extra battery life!  \n\nOverall, I think this is the best money can buy in about 500€ status, with quaranteed 2 year warranty.", "time": "29th May 2017, 01:48 AM", "postID": "post72467585", "replies": []}, {"text": "Overall I really enjoy the Galaxy S series. \r\nWhen I did finally upgrade for \"Flip-Phone\" to a \"Smart-Phone\", it was a very inexpensive Alcatel that I purchased in full from Walmart.\r\nI had always said I'm never going to spend over $300(USD) on a phone, I have my computers. Well the very first \"Smart-Phone\" was a Galaxy S5 I had purchased from a friend for about $70(USD).\r\nA month later I broke the phone and went back to Alcatel  (this time only spending $30(USD) at Walmart) and immediately I was disappointed and missed the abilities of the Galaxy S series phones. I then purchased a pre-owned Galaxy S6 $350(USD) Verizon. Then about 8 months later I again purchased a pre-owned Galaxy S7 $500(USD) Verizon.\r\nNeither the S7 or S6 is an Edge, but still I love them both. \r\nHowever, I cannot wait to purchase the Galaxy S8E+ (64gb<).\r\nUntil then I will continue to cherish the S6 & S7", "time": "1st June 2017, 12:52 AM", "postID": "post72502376", "replies": [{"text": "The S series has been a hit from the start for me. I'm really looking forward to getting the S8 too but I must resist... for now... Pretty soon you'll be saying \"I'll never spend over $1000 on a smartphone\"", "time": "1st June 2017, 01:00 AM", "postID": "post72502431", "replies": []}]}, {"text": "After reading this topic .... yep, I'm getting this phone. Tried S8 and not really an improvement over S7. Got a deal at my operator for S7 -> \"24 x 15 €\" and my buddy will take the contract \n\nRight now I'm on INT Sammy S6 and the battery really isnt THAT bad, but since S7 has bigger one + better processor ... hoping for a better SoT and standby than S6.", "time": "1st June 2017, 03:57 PM", "postID": "post72510037", "replies": []}, {"text": "This has been a great phone. Beautiful screen and excellent performance. Battery life is very good. I use my phone for work taking signatures, pictures and processing clients and it works from 530am until I go to bed on one charge. Wifi and signal connectivity is outstanding.  The size is perfect for my uses, not too big not too small it fits perfectly in my shirt pocket. The stock camera app is lacking but that's really my only gripe.", "time": "9th October 2017, 11:42 AM", "postID": "post74091872", "replies": []}, {"text": "Doing my part to keep the love alive for this device (last post was in October).  \n\nI've been a Galaxy S fanboy since my Captivate days.  I've owned over 20 different phones since, still have most of them (LG's, Samsungs, Motorola's). At some point we should just admit to our addictions I suppose. It is a strange hobby ... according to my wife. \n\nThe S7 (a phone I got cheap and fixed, how I've obtained the majority) is, so far, one of my favorites. I've yet to root or customize it (beyond converting the G930V to G930U) but as a daily driver in which I depend on for work, can't beat it. When the flash bug hits I'll tinker with it eventually.", "time": "24th March 2018, 05:24 AM", "postID": "post75997159", "replies": []}, {"text": "Over a year with my S7 and I still love it. Best Android phone I've ever had. Rock solid and still pretty darned responsive. I've never rooted it because I've had no reason to for me (plus I want to use Samsung Pay which is great).\n\nMy oldest daughter got her's almost 2 years ago. My wife finally dumped her flip phone. The MotoZ was on sale for $10/month with no trade-in so she went for that. It was too big for her hands and she said it made her hands hurt. She decided to pay extra for the S7, so now we have three of them in our family. Youngest is on iPhone 7. Too in-grained with Facetime, group messenging, etc with her friends who are all on iPhone. As long as it works for her, no problem.", "time": "27th March 2018, 01:57 PM", "postID": "post76034272", "replies": []}]}, {"title": "Community development strength", "rating": 3.5, "links": ["https://forum.xda-developers.com/galaxy-s7/review/community-development-strength-t3330738", "https://forum.xda-developers.com/galaxy-s7/review/community-development-strength-t3330738/page2"], "threads": [{"text": "Since it has been 3 days only from official launch, we should wait for the scene to begin it's journey. \n\nI'm pretty sure that it will have same support as S6, and Edge variants.\n\nBUT, there is always a \"but\", international one has been finally shipped with Exynos Social. \n\nHas to be seen if it has community support  (I wish it would!)\n\nEnviado desde mi SM-N920C mediante Tapatalk", "time": "12th March 2016, 10:45 PM", "postID": "post65804344", "replies": []}, {"text": "Too early.... even i purchased it first day is available....\r\nKeep it stock for a while.... then if someone not beats me try to port edge panel from bigger brother...\r\nPeople still waiting for more reviews, but in my opinion is far more then excellent compared to my S5(even no removable battery.... let's see how performs but as for now seems lot better than S5)\r\nDigging here and there, seems we have a lot of hidden features to try to enable, so our devs will have lot to do.... then add what sammy removed here(lockscreen effects, waether, pedometer asf...)\r\nGive it few weeks, work will start, know a dev will upgrade.... a great dev hahahaha", "time": "14th March 2016, 01:04 PM", "postID": "post65831562", "replies": []}, {"text": "A really great dev is needed in order to exploit this one... I only hope it doesn't take to long because I can't live without root.", "time": "14th March 2016, 09:48 PM", "postID": "post65840353", "replies": [{"text": "same here. i give it til end of april or maybe mid april after i get back from vacation. if its not rooted i'm selling this ****.", "time": "15th March 2016, 08:05 AM", "postID": "post65847170", "replies": []}]}, {"text": "Aint no power aint no root returned mine thats it", "time": "17th March 2016, 04:15 AM", "postID": "post65883742", "replies": []}, {"text": "be really patient and calm guys...even a dev come out..... still no apktool working for MM..... so maybe instead of moaning, try to support @iBotPeaches apktool developer .....\r\nWhen we have this..... mods will come for sure..... roms even.....\r\nMy project is port edge panel....let's keep stock my S7 for a while(ahahahah i never thought i can live so long with a stock rom lol)\n\r\nSee you soon \n\r\n..and S7 is not a s**t", "time": "17th March 2016, 01:01 PM", "postID": "post65889460", "replies": []}, {"text": "Hello guys, it's 3rd day I'm using my new s7. Will play few days before root and start creating my mods!\n\nОтправлено с моего SM-G930F через Tapatalk", "time": "20th March 2016, 05:08 AM", "postID": "post65938231", "replies": [{"text": "hey mate,\n\r\ninstalled today TWRP, no root as i push and pull via adb\r\nUnluckily with odexed rom not a lot of mods can be done... no luck with edge panel, as jar cannot be touched.... \r\nPort can be done easily, (all frameworks and jars are the same, so with odexed we will have edge panel and a lot of hidden features  )\r\n I plan(with my friend Tamirda, i'm not a dev) to build a stock deodexed rom for now.... a good base to start with", "time": "21st March 2016, 06:38 PM", "postID": "post65965505", "replies": [{"text": "How's it going with the deodexing? I'm trying to deodex for hours now, still can't deodex services.jar. That's the only one left, everything else got deodexed just fine.", "time": "22nd March 2016, 06:18 AM", "postID": "post65972893", "replies": []}]}]}, {"text": "I'm worried about the Exynos version. Had the s5 with Samsung's chip and never really got a decent alternate ROM, and not a hint of something not TW based.", "time": "20th March 2016, 05:44 PM", "postID": "post65947060", "replies": []}, {"text": "I hope development strength will be stronger than my previous phone (lg gflex 2) lol.\r\nI live in Greece so i got the exynos version. Bootloader is unlocked but i personally will wait until a good rom comes out in order to trigger knox.\r\nuntil now phone is super fast , no lag all are ok i dont miss root that much.", "time": "22nd March 2016, 09:05 PM", "postID": "post65984366", "replies": []}, {"text": "No Root, No Recovery, bootloader locked, etc.", "time": "25th May 2016, 02:16 PM", "postID": "post67019377", "replies": []}, {"text": "I prefer AOSP/LineageOS roms. There are currently some bugs in BT calling and ambient display, but overall it's good.", "time": "27th March 2017, 12:23 PM", "postID": "post71607174", "replies": []}, {"text": "How is the development for this phone these days? Looking to a new phone (current is an ailing z2). Looking at S7, OnePlus 3t, and the LG G6.", "time": "11th June 2017, 11:59 PM", "postID": "post72637044", "replies": [{"text": "I would suggest getting the oneplus 3T easier for rooting and much more customization/development", "time": "13th June 2017, 05:51 AM", "postID": "post72651528", "replies": [{"text": "I'm in opposit situation. I have OP3t now, and it's the best phone i think, but I don't like it's size :/\r\nI'd like to sell OP3t and buy something smaller like S7, but I hate TouchWizz. Are there good aosp roms for s7 enough for daily driver and with good camera and battery? I love stock feelng of OP3t, but s7 with clean android would be awesome. What should I do?\r\nAny other good smartphone with 5\" screen and great dev support?", "time": "14th June 2017, 06:20 PM", "postID": "post72672416", "replies": []}]}]}]}, {"title": "Overall speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s7/review/overall-speed-t3330739", "https://forum.xda-developers.com/galaxy-s7/review/overall-speed-t3330739/page2", "https://forum.xda-developers.com/galaxy-s7/review/overall-speed-t3330739/page3", "https://forum.xda-developers.com/galaxy-s7/review/overall-speed-t3330739/page4"], "threads": [{"text": "Speed is just awesome ... it's a flagship ... not expecting anything else", "time": "20th March 2016, 11:15 AM", "postID": "post65941423", "replies": []}, {"text": "Performance is good but i think there is a problem that lags the keyboard.", "time": "4th April 2016, 07:52 PM", "postID": "post66194512", "replies": []}, {"text": "I Don't know its my phone or else, but in some games, its little bit lag when loading some scene. But one thing that I notice that my S7 signal is more weak than my previous phone (on LTE), it's very noticeable that sometime I have to restart my phone or change it to 3G first than switch it back.", "time": "8th April 2016, 04:49 PM", "postID": "post66258411", "replies": []}, {"text": "I have had similar signal issues while my other gs7 had a good signal. Replaced the device now the signal is good.. \n\nAs far as speed, it feels slower to me then my s6 and note5 games dont run as smooth, gear vr jitters or glitches quite a lot, something the note5 never did. And it doesnt register touches well. I have had these issues on 3 separate gs7. 2 mine and the one i returned and swapped mainly because the signal and i could see glue separations and striations in sunlight between the lcd and screen. I have really come to dislike this phone, a first for me with samsung.", "time": "8th April 2016, 11:52 PM", "postID": "post66264443", "replies": []}, {"text": "My S7 doesn't seem much faster than the LG G2 it replaced. Might this have something to do with the higher resolution?", "time": "25th April 2016, 12:39 AM", "postID": "post66531792", "replies": []}, {"text": "Much faster and snappier than lg g3 i have ownded previously.", "time": "10th May 2016, 02:23 PM", "postID": "post66785440", "replies": []}, {"text": "Sometimes lags (barely visible)", "time": "18th June 2016, 10:14 AM", "postID": "post67373060", "replies": []}, {"text": "This is my new account and was here since my galaxy s2 and I really looked deeply into the matter.\nImproved to an S4 later and tuned the hell out of it. And now having an S7.\nThe Hardware and the processor improved really much since then, so it's not an hardware issue, it's allways a configuration and software issue, if the phone lags.\n\nI can't understand why people are unhappy with their phones, that aren't \"snappy\" enought.\nIt's their fault, because they accept the default settings most of the time and don't care about improving their phone by themself, by optimizing settings, disable useless/unused features and remove all that bloatware and spyware crap.\n\nAlso with a good custom rom most of these problems are solved anyway, even by default if the developer did the optimization for you... lazy ass \n\nMaybe start with something like that:\n\nActivate Beast Mode on Galaxy S7\nwatch?v=nHEm50oRsNs\n\nps: can't post full links yet with this acc. lol", "time": "21st July 2016, 11:54 AM", "postID": "post67841357", "replies": []}, {"text": "Excellent CPU ,OS,RAM optimization\nsuperb performance,I am fully satisfied\n-Device G930FD(Exynos)", "time": "23rd July 2016, 07:34 AM", "postID": "post67866459", "replies": []}, {"text": "The speed  of galaxy s7  is awesome, you can say Much faster and snappier", "time": "23rd July 2016, 08:34 AM", "postID": "post67866894", "replies": []}, {"text": "speed is acceptable.  Lags are experienced, but compared to S6 it is a bit better.", "time": "25th July 2016, 07:02 AM", "postID": "post67892617", "replies": [{"text": "I am running King rom with prometheus kernel with no lag and I mean absolutely no lag. Here is AnTuTu not that benchmarks mean anything right?   \n\n\n\n\n\nDelivered by my Silver S7.", "time": "25th July 2016, 02:27 PM", "postID": "post67896698", "replies": [{"text": "I would be much happier if our Verizon varian could be on the custom ROM/kernel too!  And... also has the Exynos on board!", "time": "25th July 2016, 04:58 PM", "postID": "post67898647", "replies": [{"text": "Ya that blows.  : (\n\nDelivered by my Silver S7.", "time": "25th July 2016, 05:03 PM", "postID": "post67898719", "replies": []}]}, {"text": "Still satisfied?", "time": "28th September 2016, 01:55 PM", "postID": "post68895793", "replies": []}, {"text": "Nice...\n\nPrometheus  out of the Box or some tuning?\n\nIf it so can you share your settings?", "time": "2nd October 2016, 11:08 PM", "postID": "post68956742", "replies": []}]}]}, {"text": "Everything is super fast. apps open up instantly, I really like double tapping home button for camera. overall speed is great. been using it for few months, never had any lag.", "time": "2nd October 2016, 06:42 PM", "postID": "post68953987", "replies": []}, {"text": "agree speed is top notch.", "time": "22nd November 2016, 04:48 AM", "postID": "post69734762", "replies": []}, {"text": "i have buy the same phones, s2 s4 s7\n\nInviato dal mio SM-T700 utilizzando Tapatalk", "time": "2nd December 2016, 03:35 PM", "postID": "post69896961", "replies": []}, {"text": "I'm honestly not all that happy with its performance.\n\r\nWhile I wouldn't say it lags necessarily, there's always a lot of dropped frames and glitchiness while opening apps, Google Now, FB messenger bubbles, etc. I often found myself just plain not using features of the phone just because the dropped frames made it feel cumbersome.\n\r\nAnd while I know people will say \"Aw man, the facebook app sucks. I don't even use it.\" Yeah, sorry, but I actually want to use it. That's what it's there for. That's what it should be. Just saying not to use it, or to use things like facebook through even slower means like the internet browser or Chrome, is basically cutting off your nose to spite your face.\n\r\nWhile I'm not an iPhone guy (haven't owned one since the iPhone 4), I will say, there's far less dropped frames and glitchiness in the iPhone operating system. If I had to sacrifice a bit of customization or features in Android to achieve an iPhone-smooth experience on a beautifully-Samsung display, I'd do it in a second. \n\r\nAlthough, to be fair, I do think it's more Samsung's fault than Android's; Samsung phones have always dropped more frames than a lot of the stock or vanilla Android phones.", "time": "15th January 2017, 01:54 AM", "postID": "post70557244", "replies": [{"text": "Every single phone drops frames maybe a little less than samsung", "time": "15th January 2017, 05:49 AM", "postID": "post70558741", "replies": [{"text": "Sorry, I didn't mean to say other phones don't drip frames - obviously they do.\n\r\nBut, imo, Samsungs suffer from it way more than most other phones - especially iphones. So much so that, for me, it can negatively effect the overall experience of using their phones.", "time": "15th January 2017, 06:02 PM", "postID": "post70566717", "replies": [{"text": "if u flash the beta 2, for s7 it is on xda, ur phone will run smoother, but u hv to be on PH1 Firmware inatructions are there tho", "time": "15th January 2017, 06:07 PM", "postID": "post70566768", "replies": [{"text": "But to me, as a consumer, you shouldn't have to do that. \n\r\nYou shouldn't have to basically rebuild your phone just to have it work right. I mean, obviously I get it if you're a tech geek, and that kind of thing is fun to you, that's cool. I don't mean to be critical in that sense. But if you're a phone manufacturer - probably the second best/most popular (in the US, at least) - your phone should be a beast right out of the box. And like I said, for me, I've always had better UI experiences on other brand phones.", "time": "16th January 2017, 01:05 AM", "postID": "post70571121", "replies": [{"text": "ur not rebuilding ur phone, touchwiz isnt as bad as u seem now, what im talking about is the official beta from samsung that they discontinued for the verizon model", "time": "16th January 2017, 01:07 AM", "postID": "post70571141", "replies": []}]}]}]}]}]}, {"text": "I have a Verizon S7 flat and its rooted and running Stang5litre's ROM and I haven't had any issues or lag.... It runs great... I just wish we could unlock the boot loader.", "time": "22nd January 2017, 08:58 AM", "postID": "post70669584", "replies": []}, {"text": "Speed is a little disappointing for me, especially when browsing the web or when the heavy usage kicks in. TouchWiz's redesign is noticeable though I will say that.", "time": "24th January 2017, 12:51 AM", "postID": "post70697577", "replies": [{"text": "Give a try to the stock browser... more fluid compare to chrome. \n\nEnviado do meu SM-G930F através de Tapatalk", "time": "24th January 2017, 11:49 AM", "postID": "post70703598", "replies": []}]}, {"text": "Exynos blazing fast and very smooth all day", "time": "21st March 2017, 10:21 PM", "postID": "post71531156", "replies": []}, {"text": "Good.", "time": "27th March 2017, 12:24 PM", "postID": "post71607180", "replies": []}, {"text": "Somebody here convinced me to buy it over HTC10.\r\nI don't like it.\r\nUsing this very site on it is botchy and stuttery. And FB and such apps as well.\r\nI haven't optimized it in any way and I don't think I should need to in a flagship phone.\r\nMy OnePlus 3T runs every thing(btw I'm writing this after reopening this site on OP 3T) like a boss. One thumb swipe on OP3t and it moves smoothly AF.\n\r\nMy Q is that should I replace my LGV20 with a S7. I don't want another OnePlus 3T.\r\nWould I have the same problems in S7.\r\nI would be buying the exynos version (India).\n\r\nThanks.", "time": "5th April 2017, 06:17 PM", "postID": "post71739991", "replies": []}]}, {"title": "App launch speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s7/review/app-launch-speed-t3330740"], "threads": [{"text": "100% only 5 stars apply here", "time": "20th March 2016, 11:16 AM", "postID": "post65941428", "replies": []}, {"text": "Fastest Android phone I've used to date.", "time": "20th June 2016, 08:05 AM", "postID": "post67400164", "replies": []}, {"text": "very fast android, slightly ahead of my other device, Xiaomi Mi5.", "time": "22nd November 2016, 04:49 AM", "postID": "post69734769", "replies": []}, {"text": "Good.", "time": "27th March 2017, 12:24 PM", "postID": "post71607186", "replies": []}, {"text": "On 7.0 its a bit faster than on 6.0", "time": "23rd April 2017, 02:34 AM", "postID": "post71986668", "replies": []}, {"text": "In comparison to other e.g. One Plus it looks like a bit slower. But overall it is pretty good.", "time": "22nd May 2017, 05:56 PM", "postID": "post72391322", "replies": []}, {"text": "Everything is instant.", "time": "11th June 2017, 07:24 PM", "postID": "post72634698", "replies": []}]}, {"title": "Multitasking/RAM", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s7/review/multitasking-ram-t3330741", "https://forum.xda-developers.com/galaxy-s7/review/multitasking-ram-t3330741/page2"], "threads": [{"text": "100% ... anyway I thing it is due to android 6.0.1 than samsungs tweaks", "time": "20th March 2016, 11:16 AM", "postID": "post65941436", "replies": []}, {"text": "So far I'm loving this phone. I used to be a Galaxy hater, but this phone is amazing. Everything is SMOOTHER than butter, and I've got at least 10 different apps running right now.", "time": "24th March 2016, 04:46 AM", "postID": "post66007172", "replies": []}, {"text": "Way better than the Note 5 was!", "time": "28th March 2016, 11:32 AM", "postID": "post66075234", "replies": []}, {"text": "Samsung has improved Ram management tremendously \n\nhttps://youtu.be/Xfd1Vc9IvbQ", "time": "3rd April 2016, 02:33 AM", "postID": "post66167502", "replies": []}, {"text": "I'm interesting is asking if someone may run the below DRAM bandwidth app in \"Misc\" mode using 2 & 4 threads:\n\r\nSearch for \"RgBandwidth\" in the PlayStore.\n\r\nAs you may all know the new Exynos 8890 has in it the internally developed ARM CPU cluster (the BIG cluster) called Exynos M1.\r\nAccording to Andrei's below detailed article we should see a major leap in raw DRAM bandwidth due to a completely redesigned Cache Coherency mechanism: \r\n\"Samsung Announces Exynos 8890 with Cat.12/13 Modem and Custom CPU\" - November 12, 2015 - from anandtech[dot]com \n\r\nI don't own (yet) this phone, but I would be glad if someone could run this benchmark with both the S6 & S7 to see the difference.\r\nThanks\r\nPierdamiano", "time": "13th April 2016, 08:49 AM", "postID": "post66337128", "replies": []}, {"text": "memory so far is enough. some stock bloatware occupied some memory tho.", "time": "20th May 2016, 05:11 PM", "postID": "post66944507", "replies": []}, {"text": "Unfortunately they didn't fix the issue. If you start to use an app more (eg: facebook, youtube), the system removes other recently apps from memory. And this happens with battery saver disabled! \n\nWith built-in app battery saver, the system remove apps from RAM after few minutes/hours of no usage. Eg, if you leave your apps overnight, the next morning, most of the apps will reload. This happens only with battery saver on.", "time": "5th June 2016, 11:54 AM", "postID": "post67178996", "replies": []}, {"text": "always seem to have lots of ram free, moreso than my other device the Xiaomi Mi5.", "time": "22nd November 2016, 04:49 AM", "postID": "post69734776", "replies": []}, {"text": "it about 3 yrs I don't use Samsung galaxy as daily phone for long time!\nI remember famous gui problem called S-Lag on galaxies and also lots of news about new and clean gui\nalso I experience it but not for long time!\nhow RAM usage and freeing process works? without rebooting for like 10 days of heavy usage. (last long time experience with galaxy was not good  )\nbut really like to buy upcoming S8... so need to know more", "time": "13th February 2017, 01:44 AM", "postID": "post71005186", "replies": []}, {"text": "since the 5.1 update android has done so well on managing ram almost on all devices  but i give it to previous poster about s lag\nsammy im so proud of you and what youve almost become.\nram managment has improved so much more in the mm updates i cant wait to try nougat  \ndamn shame between ram and core pros power it beats my pc into the ground", "time": "13th February 2017, 11:29 PM", "postID": "post71019394", "replies": []}, {"text": "I have a 4gb ram honor 8 and it does out perform the s7, I own both in real world speed and battery life.", "time": "7th March 2017, 12:51 AM", "postID": "post71314482", "replies": []}, {"text": "4GB is more than enough.", "time": "27th March 2017, 12:13 PM", "postID": "post71607049", "replies": []}, {"text": "9/10, mostly satisfied, but some apps get refreshed all the time.", "time": "6th May 2017, 07:20 AM", "postID": "post72182810", "replies": []}, {"text": "7.0\r\nReally good multitasking\r\nMine does not free up memory while busy or asleep at night)", "time": "2nd July 2017, 03:18 PM", "postID": "post72881907", "replies": []}]}, {"title": "Scrolling smoothness", "rating": 4.0, "links": ["https://forum.xda-developers.com/galaxy-s7/review/scrolling-smoothness-t3330742", "https://forum.xda-developers.com/galaxy-s7/review/scrolling-smoothness-t3330742/page2", "https://forum.xda-developers.com/galaxy-s7/review/scrolling-smoothness-t3330742/page3", "https://forum.xda-developers.com/galaxy-s7/review/scrolling-smoothness-t3330742/page5"], "threads": [{"text": "What's with the choppy scrolling? Do I have a defective device?", "time": "11th March 2016, 05:51 AM", "postID": "post65771537", "replies": []}, {"text": "Silky smooth so far. \n\nWhat have you found that isn't smooth?", "time": "11th March 2016, 10:33 AM", "postID": "post65774673", "replies": [{"text": "Happens a lot in Chrome and Tinder. Also stutters here and there during general use.", "time": "12th March 2016, 07:48 AM", "postID": "post65791708", "replies": []}]}, {"text": "Chrome scrolls facebook well and considerably slower than the S6.  Fenix scrolls twitter well, but slightly less smooth than the s6, but not so much to have me find another twitter agent.\nSettings menu scrolls perfectly.\nNotification shade drops down with not dropped frames, which is a major win.", "time": "11th March 2016, 05:14 PM", "postID": "post65781263", "replies": []}, {"text": "Not a bit on chrome.  Or notification pull down.  Those are really smooth.\n\nMines exynos BTW.", "time": "12th March 2016, 08:43 AM", "postID": "post65792344", "replies": []}, {"text": "So far butter!", "time": "12th March 2016, 10:21 AM", "postID": "post65793575", "replies": []}, {"text": "Flicking up and down through is smooth. But,  scrolling slow with my finger is choppy. Even here on xda.", "time": "12th March 2016, 02:09 PM", "postID": "post65796741", "replies": [{"text": "How choppy are we talking? I personally came to XDA on my phone just to see if I could reproduce it and my phone seems to be silky smooth no matter where I'm scrolling. Any chance for a video of it?", "time": "18th March 2016, 12:52 AM", "postID": "post65900716", "replies": []}]}, {"text": "Really slow scrolling! I don't know If mine is defective..", "time": "18th March 2016, 12:01 AM", "postID": "post65900174", "replies": []}, {"text": "I have seen shutters, but that's because I'd the ads. Using an as blocker and it's pretty smooth", "time": "18th March 2016, 06:52 AM", "postID": "post65904017", "replies": []}, {"text": "I've found chrome to be choppy both on the s6 edge and the s7. \n\r\nI use the Samsung browser and it's spot on", "time": "18th March 2016, 10:55 AM", "postID": "post65906582", "replies": []}, {"text": "Swapped my S7 and it's still choppy, but it seems to be dependent on the app and not the device.", "time": "19th March 2016, 03:04 AM", "postID": "post65920251", "replies": []}, {"text": "smoother than BUTTER here on Exynos version.   cannot make it lag even if i try.", "time": "19th March 2016, 04:09 AM", "postID": "post65920809", "replies": []}, {"text": "I was having this problem too, extremely choppy scrolling on almost any web page, I read some forums about a similar issue with the s6 and it recommend toggling the JavaScript support in both browsers and after doing so its pretty smooth, buttery smooth with JavaScript off but we need that on in 2016", "time": "19th March 2016, 07:36 AM", "postID": "post65922421", "replies": [{"text": "What website specifically? I have yet to see any choppy scrolling on this device.", "time": "22nd March 2016, 07:55 PM", "postID": "post65983254", "replies": []}]}, {"text": "Honestly, so far the S7 is a lot smoother than the S6 too me. This thing is buttery smooth so far. Samsung just needs to ditch their processors and stick with snapdragon.  I can't get over how much smoother and responsive this phone is compared to the S6.", "time": "19th March 2016, 04:52 PM", "postID": "post65929417", "replies": []}, {"text": "sometimes I feel there is some space for improvement ... egg app list is not butter fluent", "time": "20th March 2016, 11:17 AM", "postID": "post65941443", "replies": []}, {"text": "new update is available for french version  70MB", "time": "21st March 2016, 03:58 PM", "postID": "post65962990", "replies": []}, {"text": "Snapdragon version, tested out on 5GHz WiFi.\n\r\nMine is smooth in chrome, but chops when a page is loading or the page has heavy content/lots of pictures when scrolling faster.\r\nBrowsing XDA in Chrome is overall smooth, but can be choppy when the page is finishing loading and especially scrolling faster with longer posts with lots of ads between the posts.\r\nInstagram and Twitter are overall smooth, but again if pictures are loading it gets choppy when scrolling faster.\n\r\nOverall nice and smooth, for me seems to be just faster scrolling that causes choppiness.\r\nSeems pretty normal to me, very happy with the S7 so far.", "time": "21st March 2016, 10:39 PM", "postID": "post65968818", "replies": []}, {"text": "New user of s7 . My previous phone was lg gflex 2 .scrolling is too much faster than my previous phone i must get used to it. Lol. Absolutely no lag using dolphin as my main browser. 20-30 % faster than gflex 2.\r\nvellamo browsing benchmark 3500 with dolphin.", "time": "22nd March 2016, 08:11 PM", "postID": "post65983528", "replies": []}, {"text": "I use firefox for android with abp, scrolling is usually smooth and sites load as quick as any mobile device I've used, but there is occassional scrolling stutter.\n\nThe geekbench 3 benchmarks on my 820 S7 are nuts, 2343 single and 5470 multi, those are laptop numbers, and that single score is a enormous improvement over any other android device. I have no complaints about performance.", "time": "23rd March 2016, 07:57 PM", "postID": "post66001175", "replies": []}, {"text": "Smooth all over so far,  big difference to my S6. I have exynos version. \n\nSkickat från min SM-G930F via Tapatalk", "time": "17th April 2016, 08:59 PM", "postID": "post66414169", "replies": []}, {"text": "My only real issue with scrolling is when I open the app list (or any other long list). The phone stumbles for about a second, then is fine. Maybe this has more to do with memory than anything, though.", "time": "25th April 2016, 12:36 AM", "postID": "post66531765", "replies": []}, {"text": "Mates, I had this same annoying issue and it seems it is not a device's but an app's issue. I have rooted, changed the ROM and nothing changed. However, when I simply changed, for instance, Firefox to Dolphin, things got solved. Maybe it could be an app incompatibility with Marshmallow or something related to it.", "time": "8th May 2016, 01:21 AM", "postID": "post66746486", "replies": []}, {"text": "Very choppy, in fact the p.o.s. just froze entirely and required a soft reset to shut it down. Noted sd card appeared in notifications sttaight afyer so that may be the issue. I just came from htc m8 and NEVER had to soft reset EVER. Samsung dogs##t.", "time": "17th May 2016, 11:37 AM", "postID": "post66891127", "replies": []}, {"text": "Compared to my iPhone 5s I had before the scrolling on the Galaxy S7 and the Galaxy S7 edge is a lot less smooth then before. No matter in which App I try it.. One of the biggest things I miss so far. If there is any idea or fix, let me know..", "time": "17th May 2016, 10:33 PM", "postID": "post66900320", "replies": []}, {"text": "S7 (snapdragon), no glitches/choppiness here, very smooth and fast including scrolling, had for almost a month now.", "time": "20th May 2016, 04:15 PM", "postID": "post66943693", "replies": []}, {"text": "Smooth as silk!", "time": "20th May 2016, 05:03 PM", "postID": "post66944393", "replies": []}, {"text": "Comming from OnePlus 3 I can say S7 is significanlty laggier and jerkier. Very dissapointed. Really not trolling. I use extensively Poket - Read It Latter so I know every single animation. On S7 reading an article and opening top right menu, I can clearly see first the text menu items appearing and after that icons on the left of the items being drawn. My old S5 does it better. OnePlus3 does the menu rendering instantly. This and a lot of scrolling lag, small delays and jerkiness makes makes me wonder what is wrong this S7, it cannot be hardware really. I even set resolution to half (hd ready), nothing changes.\n\nEdit: S7 is new, unlocked, Exynos variant, 7 days old, with last stock Android.", "time": "22nd August 2017, 04:58 PM", "postID": "post73498346", "replies": [{"text": "It's nougat issue. Samsung softwarely makes s7 older, so many people will RUN for new s7 and note8. Install or pixel like ROM(but with stock s7 nougat android)(cuz it's with tweaks), or try to install via Odin official marshmallow, or try to enable force GPU rendering.", "time": "23rd August 2017, 10:46 PM", "postID": "post73516095", "replies": []}, {"text": "I downgraded to Marshmallow, and it is buttery smooth again.", "time": "24th September 2017, 12:49 AM", "postID": "post73908053", "replies": []}]}]}, {"title": "Heat", "rating": 4.0, "links": ["https://forum.xda-developers.com/galaxy-s7/review/heat-t3330743", "https://forum.xda-developers.com/galaxy-s7/review/heat-t3330743/page2", "https://forum.xda-developers.com/galaxy-s7/review/heat-t3330743/page3", "https://forum.xda-developers.com/galaxy-s7/review/heat-t3330743/page6"], "threads": [{"text": "what i find is that my device (S7) stays very cool under conditions that my other device (m8) would overheat. now i dont play traditional games on my smartphone but i do run chess engines against each other on all 4 cores and typically after about 10 minutes i would have to stop because my m8 would reach over 50 degrees Celsius (122 Fahrenheit). under more strenuous conditions the s7 only reached 40 degrees Celsius (104 Fahrenheit)  after running for close to an hour. although the phone got physically hot which may be alarming, but i relied on an app to measure the internal temp. once i get a case for the s7 i probably wont even notice.\n\nall in all, these results blew me away. i will try this again after i root the s7 and overclock it. but for now im very impressed.", "time": "9th March 2016, 05:52 AM", "postID": "post65732894", "replies": [{"text": "I switched from the M8 to the S7 and my M8 never got this hot. My S7 is always getting warm and the battery life sucks. I got it 3 days ago and have yet to play a game or watch media on it and it still heats up and the battery is down in the teen % by late afternoon.", "time": "11th March 2016, 11:03 PM", "postID": "post65786613", "replies": []}]}, {"text": "The question here is does it throttle and how fast does it start throttling?  A lot of people are complaining about the heat but really it should be hotter. The new heat pipe is supposed to disperse the heat to the frame away from the processor. Now if it is only hot where the processor  is located like my s6 then that is a problem.", "time": "10th March 2016, 12:56 PM", "postID": "post65757328", "replies": []}, {"text": "I've been pleasantly surprised with how cool the device stays as well.  I keep it in an Incipio DualPro (although I find myself taking it out often either for Gear VR time, or just because the damn phone is nice to look at) and tend to go on usage binges frequently.  Even throwing in a little gaming here and there (mostly Clash of Clans which used to warm up the S5 pretty easily.)  So far, so cool.  Even wireless charging (slow or fast) seems to run cooler.\n\nIf it's throttling to keep the temperature averages lower, then it hasn't been of detrimental effect to my own usage patterns so far.", "time": "10th March 2016, 03:21 PM", "postID": "post65759685", "replies": [{"text": "a bit off topic.. how is that incipio case working out for you. i've been eyeing it but haven't read any feedback. is it a slick case or does it have some texture for the grip? rubbery or plastic? thanks for any help.", "time": "12th March 2016, 03:52 PM", "postID": "post65798216", "replies": []}]}, {"text": "I am actually hater of Android phones, but the features provided by Samsung Galaxy S7 and edge S7 are truly amazing.  actully I personally saw after charging all Android devices they get heated. But I must say this S7 and S7 Edge are not from this family.  Also there are some great features like water residence technique.... etc.", "time": "10th March 2016, 04:02 PM", "postID": "post65760461", "replies": []}, {"text": "does it get hot when constantly using the facebook app(Like my S6 overheats sometime when using it often due to heavy usage)? i'm buying the S7 next week", "time": "11th March 2016, 01:07 AM", "postID": "post65768800", "replies": []}, {"text": "After a few days of use I can say that it does not even get warm much less hot while doing anything I normally do, including gaming and I play a wide range of games on my phone including some pretty graphical ones. The only time it has felt warm at all was when I was first downloading and trying all of my VR games, not sure why though because I played a couple hours of VR last night and it did not heat up at all, maybe it was burning in?", "time": "11th March 2016, 05:28 PM", "postID": "post65781489", "replies": []}, {"text": "Both my S7 and my wife's S7 get very warm. I immediately noticed it on the first boot for both devices when the Play Store was installing all of our apps. Installing about 50 apps took over a hour. I think both of our devices are defective as they are not consistently running smoothly as well the LTE speeds are 50% slower than our previous S6 and S6 Edge. So far a factory reset has not corrected the problem for either device. That said both S7's still score very high with Antutu 128000-129000. It's all very odd.", "time": "11th March 2016, 09:14 PM", "postID": "post65785171", "replies": []}, {"text": "Qualcomm SD820 sucks unfortunately.  Gets hot, bad battery life, ****ty DAC.", "time": "12th March 2016, 03:27 AM", "postID": "post65789207", "replies": []}, {"text": "No problems with heat or battery here. Way cooler than my s6.", "time": "13th March 2016, 02:16 PM", "postID": "post65813900", "replies": [{"text": "+1", "time": "13th March 2016, 03:42 PM", "postID": "post65815279", "replies": []}, {"text": "Definitely cooler than my s6 and to the person stating this phone gets hotter than his m8 did, you DEFINITELY must have a bad phone. The m8 and m9 always got very hot in my experience this phone is almost like ICE in comparison. My s6 even was cooler than either of those 2 and the s7 is even cooler than the s6. Battery life seems to be a little better than my s6 as well.", "time": "14th March 2016, 09:03 PM", "postID": "post65839603", "replies": [{"text": "Can I just ask you. What's the average temperature your device sits at when using it? And the maximum you've gotten it up to. I need to compare mine to it as I came from a s5 which didn't really get hot. But because the s7 is new I'm also quite paranoid with the heat and need to see if I have a defected device or not. And please state wether you have exynos or sd\n\n---------- Post added at 07:18 PM ---------- Previous post was at 07:14 PM ----------\n\n\n\r\nDo you have exynos or snapdragon? I've got exynos and I experienced a average of 33 degrees Celsius, is that normal or average", "time": "16th March 2016, 08:18 PM", "postID": "post65877798", "replies": [{"text": "I don't have any temperature measuring programs on the phone, but it rarely even feels warm. It will show heat a little more than your s5 does because its glass and metal but the s7 runs cooler than my s6 and the s6 wasn't really a hot phone either IMO.", "time": "16th March 2016, 08:33 PM", "postID": "post65878116", "replies": []}]}]}]}, {"text": "I switched from my old S4 to the S7 on day one, and equipped it with all of the same accessories.  I work in a kitchen, and it's often extremely hot on the line, but even in an Otter Defender my S4 would rock all day as a bluetooth music player connected to our soundbar.  Ever since the switch I will get between 30-45 minutes only running DoubleTwist on BT before I get a hard reset from overheating.  I've taken to leaving it in the pantry, but now I have to run off the line every time I want to change the song or the volume.  As a desktop builder I understand the compromises between heat, performance, and cooling, but this seems a little sensitive.", "time": "15th March 2016, 08:59 AM", "postID": "post65847696", "replies": []}, {"text": "I have g935f.  Before that i had G920f and i have to say, best phone i ever had in my hands. No heating... Playing games for a few houers and no throtel no overheatin. Batthery is much bether than on S6, but i think that MM for S6 is more optimized for S6 then S7.  Abouth heat, i think that the diference is in CPU. Exynus VS Snapdragon...", "time": "16th March 2016, 02:58 PM", "postID": "post65871818", "replies": []}, {"text": "haven't had a chance to see it overheating ... not playing aaa games", "time": "20th March 2016, 11:18 AM", "postID": "post65941462", "replies": []}, {"text": "Normal that my s7 heats up to 50 celsius while surfing? Im on exynos", "time": "4th April 2016, 04:56 PM", "postID": "post66191762", "replies": [{"text": "Mine goes only to 33°C. While gaming it goes to 37°C. I am also on Exynos. It's Made in India with latest March update preinstalled.", "time": "9th April 2016, 06:24 AM", "postID": "post66267389", "replies": []}]}, {"text": "Coming from an S3, my S7 (exynos, not edge)  gets pretty hot even at standard use like some web surfing in chrome or whatsapp chatting.\nAnd the battery seems to drain for no reason  , but damn is it fast as hell.", "time": "13th April 2016, 03:06 PM", "postID": "post66341728", "replies": []}, {"text": "Gets really warm with little use.", "time": "20th June 2016, 08:06 AM", "postID": "post67400170", "replies": []}, {"text": "Not really..\n\nEnviado do meu SM-G930F através de Tapatalk", "time": "21st June 2016, 12:20 PM", "postID": "post67418527", "replies": []}, {"text": "At initial setup while syncing my iOS data to S7, device felt warm to touch..\nAlso for no reason when i applied Material design black theme, the device was warm to touch when it was idle.. Removed it and everything came normal.. \n\nNoticed that when device is charged in switched off state, its quite warm to touch. but when charged with device turned ON, can feel slight warm..", "time": "21st June 2016, 04:41 PM", "postID": "post67422127", "replies": []}, {"text": "Only time it really gets hot is when I use the Navigon app with realtime traffic enabled, regardless if plugged to the standard car charger or without - otherwise I can't complain, not doing excessive gaming though. Btw couldn't resist and rooted a few days ago, got rid of all the Knox stuff (I hope) and not looking back so far. Have to say this was the 1st phone with root already available which stayed stock for 2 weeks.", "time": "21st June 2016, 09:44 PM", "postID": "post67426247", "replies": []}, {"text": "I disabled  fast charging feature.. now its fine try it?", "time": "22nd June 2016, 05:06 PM", "postID": "post67437771", "replies": []}, {"text": "It seems that did the trick, thx", "time": "23rd June 2016, 06:49 AM", "postID": "post67445895", "replies": []}, {"text": "only when fast charging it gets warm EXYNOS", "time": "31st August 2016, 05:32 PM", "postID": "post68464073", "replies": []}, {"text": "Mine has never overheated, only gets slightly hot while gaming or upgrading some apps.", "time": "4th July 2017, 05:19 AM", "postID": "post72899837", "replies": [{"text": "My samsang galaxy S 7 also heat while operating normal task...also battery charging rate 1hrs from 5%to 100% but drain time in 1hrs near about 50%...is my phone working right or overloaded", "time": "8th March 2018, 04:21 PM", "postID": "post75817741", "replies": []}]}]}, {"title": "Low light", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s7/review/low-light-t3330744", "https://forum.xda-developers.com/galaxy-s7/review/low-light-t3330744/page2"], "threads": [{"text": "best low light device on the market ...", "time": "20th March 2016, 11:18 AM", "postID": "post65941469", "replies": []}, {"text": "Period.", "time": "31st March 2016, 11:05 PM", "postID": "post66135169", "replies": []}, {"text": "sometimes laggy", "time": "1st May 2016, 09:33 PM", "postID": "post66645174", "replies": [{"text": "Well, that's how photography in low light works. The shutter speed is increased sometimes up to 1/8 s, which roughly translates to 8 fps. That ain't smooth.", "time": "20th May 2016, 10:57 PM", "postID": "post66949243", "replies": []}]}, {"text": "the rear camera's quite well, but I hate the fix focus on the front camera.", "time": "21st May 2016, 08:02 AM", "postID": "post66953381", "replies": []}, {"text": "way tooooooooooo much sharpening in Auto mode......I got the Samsung sensor.", "time": "26th May 2016, 05:38 PM", "postID": "post67037814", "replies": []}, {"text": "Got a stunning shot of the stars with a 10s exposure. All I can say about this camera is wow.", "time": "30th May 2016, 07:06 PM", "postID": "post67096476", "replies": []}, {"text": "I think the camera in low light (almost without light) works pretty well. \n\r\nyou can look at this, I was amazed ... \r\npostimg.org/image/refmvvrwr/", "time": "23rd October 2016, 10:57 PM", "postID": "post69274739", "replies": []}, {"text": "It's good but it doesn't touch the LG G4/G5 in low-light, especially since max exposure is 10 seconds on this compared to 30 on the LG devices.", "time": "25th October 2016, 01:00 PM", "postID": "post69299288", "replies": []}, {"text": "Very good in photos, good in videos but only at 30fps (that's normal, physics applies :3)\nThe only feature I'd love to get is to use for example 4 pixels for each pixel when recording at 1080p, like that, each pixel is 4 times bigger and gets 4 times more light. It also could be useful in photos but the quality loss will be noticeable (but not in videos)", "time": "27th October 2016, 07:43 PM", "postID": "post69338146", "replies": []}, {"text": "Very good.", "time": "27th March 2017, 12:26 PM", "postID": "post71607209", "replies": []}]}, {"title": "Photo quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s7/review/photo-quality-t3330745", "https://forum.xda-developers.com/galaxy-s7/review/photo-quality-t3330745/page2", "https://forum.xda-developers.com/galaxy-s7/review/photo-quality-t3330745/page3", "https://forum.xda-developers.com/galaxy-s7/review/photo-quality-t3330745/page24"], "threads": [{"text": "pictures looks great ... but there is no detail everything is melted and blended together ... too much software tweaks ... unfortunate - when buying I was expecting something better", "time": "20th March 2016, 11:19 AM", "postID": "post65941481", "replies": []}, {"text": "Yes. I noticed even viewing Online Demos on my Phone that the S6 Photos were sharper and more detailed than S7.\n\r\nThe S7 in good light seems more similar in Detail to iPhone 6.\n\r\nNot sure how S7 Camera got such a high rating.\n\r\nIf shooting low light it has advantages but does not seem to equal S6 in good light.\n\r\n\"Three iPhones and a Stripper walk into a Bar.\"..oh wait...no iPhone jokes...", "time": "20th March 2016, 02:38 PM", "postID": "post65944077", "replies": []}, {"text": "This camera is unreal. Where my Sony Z3 would struggle this phone shows it's mustard incredibly well. Impeccable detail that is on par with some micro four thirds cameras out there. I'm very very impressed.", "time": "29th March 2016, 07:11 PM", "postID": "post66098722", "replies": []}, {"text": "I think the pictures are fantastic. Way better than my SGS4 I switched from.", "time": "29th March 2016, 08:29 PM", "postID": "post66099962", "replies": []}, {"text": "They seem to be the same as my S6 in quality, but better in low light, which is about what I expected. The S7 camera is just a touch better than the S6's from what I can see. Not sure what the other guys are getting, but this is on par with my S6 for sure.", "time": "29th March 2016, 08:45 PM", "postID": "post66100194", "replies": []}, {"text": "COmpare this to my old phone, the Xperia Z3, the photo quality is much better despite its 12MP camera. The optical stabalization is awesome. i can zoom into an object and the object will stay relatively stable.", "time": "31st March 2016, 06:01 AM", "postID": "post66122154", "replies": []}, {"text": "wish it was better\r\nby the way, be sure to check out my website", "time": "8th April 2016, 05:24 PM", "postID": "post66258957", "replies": []}, {"text": "The pictures and videos looks great on the phone but when transferred to PC or uploaded it is not the same. This is because of the AMOLED.", "time": "18th April 2016, 03:07 PM", "postID": "post66425317", "replies": []}, {"text": "i just moved from lumia 950 to s7 and im very disappointed with pic quality , but apps make it up i guess", "time": "19th April 2016, 11:00 AM", "postID": "post66439652", "replies": []}, {"text": "Show us the pictures, including why you like the camera or why you are disappointed by it.", "time": "20th April 2016, 02:00 PM", "postID": "post66459922", "replies": []}, {"text": "The best low light camera phone with f1.8 aperture. Should I skip the DSLR?", "time": "1st May 2016, 03:18 PM", "postID": "post66640318", "replies": []}, {"text": "Using pro mode", "time": "11th May 2016, 12:27 PM", "postID": "post66800367", "replies": []}, {"text": "To avoid Samsung high postprocessing with extreme software sharpening i'm using RAW and than convert it with Photoshop. There is much more details in RAW so, picture quality is better.", "time": "12th May 2016, 09:23 AM", "postID": "post66814284", "replies": []}, {"text": "Try Snap Camera...\nhttp://forum.xda-developers.com/show....php?t=2055140", "time": "13th May 2016, 12:12 AM", "postID": "post66825971", "replies": []}, {"text": "", "time": "14th May 2016, 07:27 PM", "postID": "post66852265", "replies": []}, {"text": "", "time": "14th May 2016, 09:06 PM", "postID": "post66853437", "replies": []}, {"text": "After all the hype and rave reviews about the camera, I thought I'd be getting a DSLR quality camera. Using the default settings, the camera isn't that good and overprocesses everything. Pro mode fixes that and RAW photography is excellent though.", "time": "15th May 2016, 01:47 AM", "postID": "post66855988", "replies": [{"text": "Really.. expecting DSLR quality. We hear that every year but this year you really believed it  It's technically impossible to get DSLR qualities like great bokeh and real low light capabilities. Why: sensor size. I'm using a sony a7 (fullframe sensor or 35x24mm =864mm² sensor vs de s7 edge imx260/isocell ~5.8x4.3mm =25mm².  De sony a7s has the same pixel count (12mp) as the imx260/isocell but has a much greater area to catch light. Therefore the a7s can take pictures with higher iso's without too much loss in colour or gains in noise (). With my sony a7 I have 24mp but up too iso6400 I have almost no noise. Try the same iso with the imx260 and you get one big noise picture (or iso800). \n\r\nBokeh or out of focus quality can be achieved with a couple of tricks (like close focus and far backgrounds) But DSLR/mirrorless capabilities not so much.. they have to use tricks and processes like the huawei p9 or post processing like the s7 does. Why: simple physics\n\r\nPicture quality in good light: It can be as good as a DSLR/mirrorless but only if they have cheap 'stock' lensen or crappy sensor. Details and colours are always better on a leica (~2000+usd) or zeiss (~1000+USD) lenses even on a cheap DSLR with a crop sensor or even a 1\" sensor. \r\nVisual size comparison:\n\n\r\nComing from the Lumia 950xl and using fullframe sensor camera with good optics, I'm loving what I'm seeing on the S7 edge. Shooting auto or pro mode and raw. I just didn't board the hype train and still get great photo's.", "time": "16th May 2016, 03:37 PM", "postID": "post66878235", "replies": []}]}, {"text": "I haven't thoroughly tested the phone, I just got it 8-9 hours ago, but initial impressions is it's light years better then my old LG G3.", "time": "16th May 2016, 07:45 AM", "postID": "post66872837", "replies": []}, {"text": "", "time": "16th May 2016, 09:14 AM", "postID": "post66873627", "replies": []}, {"text": "I went from an S6 to an S7 and I also feel my S6 took better pictures when using full Auto mode compared to the S7 in full Auto. The S7 takes great pictures I just think the S6 had better detail and seemed less processed.", "time": "17th May 2016, 09:36 PM", "postID": "post66899571", "replies": []}, {"text": "switching from LG G4, massive improvement especially in low light! Camera start speed is way better as well!", "time": "20th May 2016, 05:08 PM", "postID": "post66944461", "replies": []}, {"text": "Pro mode rocks", "time": "29th May 2016, 07:16 AM", "postID": "post67073858", "replies": []}, {"text": "", "time": "30th May 2016, 05:45 PM", "postID": "post67095315", "replies": []}, {"text": "", "time": "3rd June 2016, 12:34 PM", "postID": "post67150926", "replies": []}, {"text": "The S7 has a great camera, shoots great photos.", "time": "3rd June 2016, 06:35 PM", "postID": "post67155888", "replies": []}, {"text": "I'm pretty happy with the S7 camera. Though not DSLR quality, it's better than other phones I've owned in the past. \r\nShoots great in lowlight, well balanced colours (imo) and not overprocessed unlike the Z5 it replaced.", "time": "4th June 2016, 07:02 AM", "postID": "post67162577", "replies": []}, {"text": "wow! nice photo!!", "time": "5th June 2016, 02:50 AM", "postID": "post67174690", "replies": []}, {"text": "I enjoy the camera more now after I started using the Google Camera mod. Gives my pictures more detail, less sharpening and often more accurate colors, although more noise. The noise is way easier to fix in an app like Photoshop Express, compared to over-sharpening. For really low-light photos I might still use the stock camera though.\n\nThe stock camera often made the pictures look kind of fake too.", "time": "14th February 2018, 09:52 PM", "postID": "post75570335", "replies": [{"text": "true that a d i did compare tge s7 is vettee in every single category  i compared", "time": "15th February 2018, 02:40 PM", "postID": "post75577768", "replies": []}]}, {"text": "Am i the only one whose front camera quality sucks? in the normal stock camera app with nougat, please i need help, i literally get no details in the selfie mode, i have beauty mode on \"0\" and all others are default, hopefully i can get help.\n\nThanks", "time": "4th March 2018, 01:14 PM", "postID": "post75768562", "replies": [{"text": "I think it's normal. The front camera is really bad. Use gcam instead, but then you have a problem with massive lens distortion.", "time": "4th March 2018, 02:53 PM", "postID": "post75769627", "replies": [{"text": "I already use gcam but today i started taking look at old galaxy s7 comparision youtube vids and their selfies looked better than my own stock front camera", "time": "4th March 2018, 02:56 PM", "postID": "post75769652", "replies": [{"text": "Maybe that's because of the low quality of the youtube video. Idk...", "time": "4th March 2018, 06:21 PM", "postID": "post75771944", "replies": [{"text": "Anyways thank you", "time": "4th March 2018, 06:42 PM", "postID": "post75772130", "replies": []}]}]}]}]}, {"text": "I will test the s7 in few days , i am buying it knowing the camera sucks. I like to shot with phone but i need to change from my OPO. \r\nI did make a comprising RAW photo from my OPO to a Friends S8", "time": "22nd March 2018, 09:51 AM", "postID": "post75975844", "replies": []}]}, {"title": "Video quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/galaxy-s7/review/video-quality-t3330746", "https://forum.xda-developers.com/galaxy-s7/review/video-quality-t3330746/page2", "https://forum.xda-developers.com/galaxy-s7/review/video-quality-t3330746/page3"], "threads": [{"text": "I am really dissapointed here ... \r\n4k - probably good I tried it but have no intention to use it - maybe in few years ..\r\n1080 60fps - too much detail lost\r\n1080 30fps - it looks like painting ... terrible - my s4 is doing nicer videos ... or even my iphone 6\r\n720 240fps - well iphone does better", "time": "20th March 2016, 11:21 AM", "postID": "post65941498", "replies": []}, {"text": "Here's mine shot in 4k with post-processing added in Sony Vegas Pro:\nhttps://www.youtube.com/watch?v=iiDiSAoFMiU\n\nNon post-processed version are also available here:\nhttps://www.youtube.com/watch?v=6kiV0O7GvfU", "time": "29th March 2016, 10:17 AM", "postID": "post66091111", "replies": [{"text": "Pretty damn good man !", "time": "18th April 2016, 04:58 AM", "postID": "post66418510", "replies": []}, {"text": "how do you add the cinematic look", "time": "29th May 2016, 08:19 AM", "postID": "post67074401", "replies": []}]}, {"text": "Video from a concert this past weekend.Straight out of the camera.Shot in QHD.Given the conditions I was very impressed with the video and sound quality.\nhttps://www.youtube.com/watch?v=9SZaK8hdQt0", "time": "30th March 2016, 03:03 AM", "postID": "post66104345", "replies": [{"text": "Video is set private!", "time": "17th April 2016, 11:43 PM", "postID": "post66416001", "replies": []}]}, {"text": "I compared the video quality of Samsung Galaxy S7 vs Lg G3.  For the same HD video on youtube, LG G3 provide crisp and colourful output, while S7 video is saturated and pixelated. I am disappointed with S7.", "time": "30th March 2016, 07:31 AM", "postID": "post66106370", "replies": []}, {"text": "https://www.youtube.com/watch?v=aldBSkz6UCo\n\r\nCheck this CInematic 4K Video which is filmed with the Galaxy S7", "time": "17th April 2016, 02:30 PM", "postID": "post66408446", "replies": []}, {"text": "Hmm.. it's funny to see that those that are disappointed do not share an example, while the enthusiastics do. \nThis way it's impossible to compare.", "time": "20th April 2016, 01:59 PM", "postID": "post66459913", "replies": []}, {"text": "I moved several weeks ago from iphone6+ to S7.\nYesterday I attended a live music show and recording on S7 were horrible (distorted) compared to previous iphone 5 and 6 experience I had.\nHere are 2 from yesterday that are bad\nhttps://youtu.be/YZG2LqMMraM\nhttps://youtu.be/Kba-CLtZJlE\nand 2 good with 5 and 6\nhttps://youtu.be/LyrlLPP2zpE\nhttps://youtu.be/fiJofpOj9ko", "time": "30th May 2016, 02:46 PM", "postID": "post67092739", "replies": []}, {"text": "4k at night: https://youtu.be/EW8qM1ggYB8\r\n240fps at day: https://youtu.be/0Q5HAggaDwg\n\r\nFor me it is much better then lg g3 does, i never try iphone", "time": "3rd June 2016, 12:22 PM", "postID": "post67150786", "replies": []}, {"text": "While the sharpening look really bad in photos, Galaxy S7's video quality is superb.", "time": "20th June 2016, 08:07 AM", "postID": "post67400182", "replies": []}, {"text": "Hello. Video stabilization doesn't work at all. Even if I use HD with the setting checked... \nThe video shakes at every step I make.", "time": "6th April 2017, 12:48 AM", "postID": "post71744028", "replies": [{"text": "I read somewhere that the video stabilization option in the menu is for electronic image stabilization. Supposedly OIS is always on and doesn't react the same with EIS enabled.. Try shooting a video with that box unchecked and see if it's any better", "time": "6th April 2017, 12:11 PM", "postID": "post71749286", "replies": []}]}, {"text": "Still sound is awful shooting concerts, iphone is superb in this feature... so annoying", "time": "6th April 2017, 07:48 AM", "postID": "post71746848", "replies": []}, {"text": "Over the last 2+ years, I had an S5+ (G901F). The one with SD805 and the IMX240 (same sensor powering Note 4). Recently, due to an accident which resulted in destroying my S5+, I bought an S7 (Exynos version...and quite possibly an ISOcell sensor or whatever Sammy calls it these days) I don't think I ve got the IMX260 powering my unit, so I can't make any comments regarding the hardware...\nOS wise - it was 4.4.4 and 6.0.1 on my S5+ and Android N (pre-installed) on my S7.\n\nSince I am a hardcore video shooter with my phone, I can share my impressions of the S7. In short, I was rather disappointed.\n\nVideo rec modes remain the same for both i.e. 4K, 1080p 30/60, 720p...don't care\nI was expecting similar output (if not better) from my S7 compared to my S5+. But no. After triple-checking on the camera/video/photo settings, I was still recording videos where compression artifacts are clearly visible. Usually in darker areas (but not always the case) - sometimes even in areas that you d believe the camera is focusing on. I m not saying that this is a sensor issue, but rather more of a post-processing / compression issue. If I freeze the video at certain parts, I can see in a frame, compression artifacts such as the ones you d get from a highly-compressed JPEG. Which makes me wonder why didn't I see any of those whilst I was checking on the video quality produced by the S7, compared to other flagship models.\n\nI am not sure if that quality drop between the two flagships is justified by the fact Samsung decided to move from 16MP -> 12MP, or the software i.e. Nougat vs Marshmallow (...or both). For all I know, frame quality under video recording, has significantly dropped in the S7, compared to the much older S5+. (don't know what the case was for S6, never actually tested it...) Just to clarify - this is definately not a stabilization issue (phone position is fixed whilst shooting).\n\nThe good parts - obviously - the S7 is very good under low light conditions (both video rec and photo shoting). Focus and photo shooting is amazingly fast. Two areas that it clearly smokes the S5+ as far as the camera is concerned. But that's about it really. And I d rather have the 'slower' S5+, rather than the heavily grained videos the S7 produces. Being able to shot better in the dark is always a bonus, but not so important to me. I m usually shooting 1080@30. Sometimes 4K, but under good light only (due to lack of HDR whilst at 2160p). 1080@60 video shooting quality seems like a 'tie' between the S7 / S5+. Both very smooth and similar amount of details preserved in the video. But yet again, I m not shooting high-speed moving objects so as to justify shooting at 60fps. But I m expecting better quality per-frame whilst at 30fps. And at 30fps, the S5+ produces better results.\n\nAlso, the video trimmer under S7/Nougat seems to lack the Rotate feature. Don't know if it was moved under the Movie Maker app (which I haven't yet downloaded). Video processing seems to be much slower now. Trimming under 4.4.4 was at least twice as fast compared to what it is now! I am really curious if trimming under more recent versions of Android actually re-compresses the output file. If that's the case, that would be discraseful to say the least...can anyone confirm this? I will at some point test this myself and post the results.\n\nJust to clarify. I m not saying that recorded videos using the S7 are bad - I m saying that it lacks the quality per-frame of the ones shot by the S5. I very rarely recall seeing compression artifacts in videos captured by my older S5+ and that is why is pretty obvious to me now. And I can't explain it. If it's not a sensor issue, could it be that the compression ratio has been increased? If that's the case - it's a good thing - as it could be fixed in a later release. Has anyone witnessed video quality degredation from Marshmallow ->> Nougat?\n\nPlease share your thoughts.", "time": "12th July 2017, 12:42 PM", "postID": "post72999514", "replies": []}, {"text": "Having tested camera/video more thoroughly, I can confirm that the video trimmer app, actually re-processes output video (re-compressing), which inevibly results in significant quality deterioration.\n\nSay you have a 10min video, and you just want to keep 20secs of it, you ll have to trim x2 times (as there is a minimum output of X seconds, especially if you only need few seconds of footage from larger file).\nWhich means that the quality you ll get in the final crop is less than inferior, considering that the initial video had to be recompressed twice.\nWhich I think, it really is a disgrace :/\nIt seems to me that Samsung had to comply with the youth generation who only want to quickly post a video on YT, putting any quality considerations aside.\n\nStill image quality remains more less the same to the S5+. With the added benefit of the Pro Mode. But as a video shooter, the S7 is easily blown by the much older S5+. As least for now, given the latest Andoid 7 (and also 6.0.1).\n\nWhat a pitty.", "time": "24th July 2017, 02:09 PM", "postID": "post73149411", "replies": []}, {"text": "S7 Autofocus struggles on 60 fps.\n\r\nHere you go. My actual video @ 60 fps\n\nhttps://youtu.be/j_i9rEZPaCo\n\n---------- Post added at 09:21 PM ---------- Previous post was at 08:57 PM ----------\n\nCamera struggles on auto focus at 60 fps video capture.", "time": "23rd October 2017, 02:21 PM", "postID": "post74264736", "replies": [{"text": "Camera was trying to focus on the floor not the drawers in front of it\n\nMore light and only one thing for it to try and focus on", "time": "23rd October 2017, 05:19 PM", "postID": "post74267135", "replies": [{"text": "I will give it a try and upload a video again. thanks for the up. BRB\n\nYou're right mah man! It focuses on great light / outdoor lights. I will upload a video example here. I forgot how the sensor works at 60 fps where the sensor requires more light than 30 fps.\n\nhttps://youtu.be/hSwlkPO2gc4", "time": "23rd October 2017, 11:07 PM", "postID": "post74270961", "replies": []}]}]}, {"text": "Nighttime / Low Light Fireworks display test (QHD) (Download for full quality, GD plays in 1080p)\n\n\nCode: \nhttps://drive.google.com/file/d/0B1n1dOrFf12MejNtTmo2LVN6R0U/view?usp=sharing", "time": "4th November 2017, 10:36 AM", "postID": "post74401734", "replies": []}]}, {"title": "Selfie quality", "rating": 3.0, "links": ["https://forum.xda-developers.com/galaxy-s7/review/selfie-quality-t3330747", "https://forum.xda-developers.com/galaxy-s7/review/selfie-quality-t3330747/page2", "https://forum.xda-developers.com/galaxy-s7/review/selfie-quality-t3330747/page3"], "threads": [{"text": "The front facing camera is permanently fixated on things in the background while things (faces) at selfie distances are out of focus. This defeats the purpose of the front facing camera. It doesn't seem to adjust its focus ever... \n\nHowever, I do like the raise your hand or say cheese to take a picture function.", "time": "19th March 2016, 12:43 AM", "postID": "post65918950", "replies": []}, {"text": "Noticed the same thing, pictures on face are a blurry mess compared to my s6.", "time": "19th March 2016, 09:30 AM", "postID": "post65923503", "replies": []}, {"text": "Yep noticed too, and I even made a comparison with the S6, which resulted sharper..", "time": "19th March 2016, 01:45 PM", "postID": "post65926532", "replies": []}, {"text": "I have an S7 and my wife has the S7 edge and the front camera is the best we ever had.", "time": "20th March 2016, 12:49 AM", "postID": "post65935978", "replies": []}, {"text": "my sister was complaining the same thing but it thought she was being nit picky as she just switched form Apple but i guess it might be a known issue then.", "time": "20th March 2016, 04:06 AM", "postID": "post65937735", "replies": []}, {"text": "Front camera is totaly out of focus! Has anyone else noticed that? A flagship phone shall never have such low level defect!", "time": "4th April 2016, 07:27 AM", "postID": "post66184808", "replies": [{"text": "Welcome to the party, check out the S7 camera thread and you will see that many have this issue.", "time": "4th April 2016, 09:11 AM", "postID": "post66185817", "replies": []}]}, {"text": "The front camera is utilising the center focus mode. Mine is working great. Sharps selfies and lots of details. Look at the eyes and the baby's shirt that is in focus. Tey are sharp and clear.", "time": "1st May 2016, 03:40 PM", "postID": "post66640612", "replies": []}, {"text": "Not impressed, blurry snapshots.", "time": "18th June 2016, 10:15 AM", "postID": "post67373068", "replies": []}, {"text": "took this one today with my front camera  I'm very satisfied with its quality", "time": "18th June 2016, 09:29 PM", "postID": "post67381160", "replies": []}, {"text": "extremely disappointed with the front facing camera. very blurry  selfies.", "time": "20th June 2016, 03:47 AM", "postID": "post67398163", "replies": []}, {"text": "blurry and feels like the beauty filter is on eventhough its off. \r\nmy s6 was way more realistic.", "time": "20th June 2016, 07:22 AM", "postID": "post67399758", "replies": []}, {"text": "Camera too wide inducing unwanted distortion and even with all the beauty feature turned off, image still look very paint like.", "time": "20th June 2016, 08:08 AM", "postID": "post67400191", "replies": []}, {"text": "I'm interested by this topic. Any sample? The picture above is not really sharp. I hesitate with the One Plus 3. \nThanks", "time": "20th June 2016, 05:41 PM", "postID": "post67407208", "replies": []}, {"text": "I've created a thread on Samsung forum regarding this. Front camera has fixed focus to infinity instead of 40-50cm and software libs apply a crazy blur on faces and skin tones especially when iso goes up. It's incredible, I use screenshot of viewfinder to have a better picture than the shooted one!", "time": "6th August 2016, 04:12 PM", "postID": "post68069486", "replies": [{"text": "Link please?", "time": "15th August 2016, 03:07 PM", "postID": "post68198437", "replies": []}]}, {"text": "a lot of distorsions. I hate wide angle cameras.", "time": "15th September 2016, 04:27 PM", "postID": "post68702384", "replies": []}, {"text": "S7 offer poor unrealistic selfie ..Best selfie which i had was with Htc one m8 and M9", "time": "17th September 2016, 02:45 AM", "postID": "post68724997", "replies": []}, {"text": "Honestly, the selfie camera on the s7 is the worst feature in my opinion. It seems out of focus no matter what lighting, and it seems to do a lot of post-processing even when the \"beautify\" settings are turned off. I still argue that my s5 takes better looking selfies (note: not better MP)", "time": "4th April 2017, 05:28 AM", "postID": "post71717113", "replies": []}, {"text": "The selfie camera got an unexpected quality for a high-end device, old but yet, my old iphone (5c) took better pictures, and not to forget about low light which sometime my old take it better", "time": "29th June 2017, 02:52 AM", "postID": "post72842309", "replies": []}]}, {"title": "Time to take picture (camera launch speed)", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s7/review/time-to-picture-camera-launch-speed-t3330748"], "threads": [{"text": "Well, I've had my S7E for 24 hours now and have to say it's real fast to open the Camera up, to focus and snap a photo.\r\nI'm comparing along side my G4 which I also own.\r\nIt's definitely quicker.", "time": "9th March 2016, 02:59 PM", "postID": "post65739713", "replies": [{"text": "It helps that there's a double-click home button to launch the camera app.\n\nWhich the home button also powers on the screen.\nAnd it also reads  your fringerprint and unlocks the device.\n\nSo you can go from device-off to taking an in-focus picture in literally 1 second (or less).", "time": "9th March 2016, 03:12 PM", "postID": "post65739924", "replies": []}]}, {"text": "Maybe not quite that fast for me, but pretty dam near.\r\nDouble click sure helps.", "time": "9th March 2016, 03:18 PM", "postID": "post65740049", "replies": [{"text": "You can double-click from screen-off and it'll register everything.\n\r\nThough, YMMV if the camera app is already in RAM.  That can introduce a very slight delay.", "time": "9th March 2016, 03:24 PM", "postID": "post65740134", "replies": []}]}, {"text": "home + home + volume up\ndone.", "time": "11th March 2016, 02:39 AM", "postID": "post65769741", "replies": []}, {"text": "100% no comment - it just work super fast", "time": "20th March 2016, 11:21 AM", "postID": "post65941504", "replies": []}, {"text": "AI focus point not as good as iPhone but still one of the best in Android world.", "time": "20th June 2016, 08:09 AM", "postID": "post67400196", "replies": []}]}, {"title": "Software (ease of use, features, etc)", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s7/review/software-ease-features-t3330749"], "threads": [{"text": "I don't understand why I can't use auto adjust option in gallery for photos taken with motion photo feature on... anyone??", "time": "3rd June 2016, 07:41 PM", "postID": "post67156779", "replies": []}]}, {"title": "Charging speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s7/review/charging-speed-t3330750", "https://forum.xda-developers.com/galaxy-s7/review/charging-speed-t3330750/page2", "https://forum.xda-developers.com/galaxy-s7/review/charging-speed-t3330750/page3", "https://forum.xda-developers.com/galaxy-s7/review/charging-speed-t3330750/page5"], "threads": [{"text": "charging speed is fine, but anyway after quick charging the phone has like 20-30% less battery life ...", "time": "20th March 2016, 11:22 AM", "postID": "post65941515", "replies": [{"text": "what ???", "time": "20th March 2016, 11:35 AM", "postID": "post65941650", "replies": [{"text": "I am saying that battery life is incredible ... but I noticed when I charge the phone using fast charging from like 10% to 100% then it is loosing capacity much faster ... that is it ... I am still satisfied", "time": "20th March 2016, 07:52 PM", "postID": "post65949078", "replies": []}]}]}, {"text": "Interesting,  thanks.", "time": "20th March 2016, 08:36 PM", "postID": "post65949744", "replies": []}, {"text": "I disabled fast charging since on my S6 Active it used to make the phone insanely hot and actually started burning the cable at the point where it connected to the phone.\n\nThat being said, I'm actually really impressed how fast this phone charges with just a usb cable from a computer or car usb port. Very fast charging without 'fast charging' enabled.", "time": "23rd March 2016, 09:00 AM", "postID": "post65991809", "replies": []}, {"text": "There is only a 10 minutes difference between fats charging on and off on my s7. Is that normal?", "time": "29th April 2016, 05:32 AM", "postID": "post66598458", "replies": []}, {"text": "It charge 0-60% quick but after that it charge normal speed.", "time": "29th April 2016, 01:18 PM", "postID": "post66603189", "replies": []}, {"text": "I've also noticed that.. I thought was something with me, or it was just a feeling from myself!\nBut now I've seen more people dealing with same \"problem\" (if we can put it that way)!\n\nWhen I charge with Fast Charging ENABLE, the S7 seems to drain battery faster then when I charge with Fast Charging DISABLE!", "time": "29th April 2016, 05:46 PM", "postID": "post66607069", "replies": [{"text": "Totally agree! I had SOT time till yesterday about 2-3h...and yesterday i had to charge my phone with regular 2A 5V charger at work...takes 30 minutes more time but SOT was allmost 7 hours", "time": "29th April 2016, 07:24 PM", "postID": "post66608561", "replies": []}]}, {"text": "I'm not comfortable with how hot my phone gets while fast charging. Reading this, I'll try turning it off. I'm also uncomfortable with how hot wireless charging makes my phone. I doubt I'll use it much unless the micro USB port goes.", "time": "1st May 2016, 02:35 AM", "postID": "post66626805", "replies": []}, {"text": "How much time do you keep your phone in charging? \nMine is charging in 1 hour and 45 minutes, but i keep it 2 hours.  ( I disabled Fast Charging )", "time": "12th May 2016, 09:02 AM", "postID": "post66814068", "replies": []}, {"text": "maybe to reduce heat, don't wait until phone is <66% battery level to charge it up ?", "time": "13th May 2016, 06:54 PM", "postID": "post66837550", "replies": []}, {"text": "About 1h wifi charging", "time": "16th May 2016, 09:35 AM", "postID": "post66873826", "replies": []}, {"text": "Using QC2.0 charger is really quick.", "time": "20th May 2016, 05:08 PM", "postID": "post66944470", "replies": []}, {"text": "Charges pretty fast, I turned off quick charging because my phone gets very warm.\r\n10% in about 10-20 minutes?", "time": "6th June 2016, 12:48 AM", "postID": "post67187999", "replies": []}, {"text": "I use volt meter with fast charge on get arount 1.7a and with fast charge off around 1.3a. It's pretty fast even fast charge is off", "time": "7th June 2016, 07:05 AM", "postID": "post67205257", "replies": [{"text": "But, with fast charge it uses about 9 volts wich means a max of about 15 watt. \n\r\nwithout fast charge it uses about 5 volts which means a max of about 6,5 watt\n\r\nSo less then half max power without fast charge..\n\r\nI haven´t seen the phone getting more then 1,4 amps on 5 volt even with stock charger..", "time": "7th June 2016, 11:05 AM", "postID": "post67207790", "replies": []}]}, {"text": "What wireless charger are you guys using?! Specifically you guys with hot phones. The reason I ask is because my s6 use to get hot using the standard samsung fast wireless charging pad. Now with the newer Samsung fast wireless charging stand it is cooler to touch. I also noticed there is a fan runing being the pad. \n\nPerhaps the fan is helping keeping the phone cooler then other pads?!", "time": "7th June 2016, 07:09 AM", "postID": "post67205290", "replies": []}, {"text": "Just nowI tried and get this. No idea @@", "time": "7th June 2016, 11:30 AM", "postID": "post67208074", "replies": []}, {"text": "I just find it best to use the standard charging. Battery life is much better from a trickle charge", "time": "11th June 2016, 12:45 PM", "postID": "post67269713", "replies": []}, {"text": "will it damage the phone?", "time": "15th June 2016, 10:23 PM", "postID": "post67335673", "replies": [{"text": "Nope, unless u live in a really hot place, fast charging heats up the battery a bit more, that is supposed to be like that due to higher current.\n\r\nSome people have said that after that the battery capacity is reduced, I haven't tested this yet, but this isn't supposed to happen, there must be something not correctly configured in the rom, kernel or the phone itself, a battery life is only reduced due to long term usage, if u try overcharge the battery or if the current going in is higher than it's supposed to be(which could also result in explosion and i highly doubt they would allow such risk).\n\r\nI got my father's phone two days ago, i installed Superman rom, i hope this doesn't happen, i'm try to check battery volts after each type of charging.\n\r\nSoon we may see more details/fixes for this.", "time": "18th June 2016, 02:11 AM", "postID": "post67369189", "replies": [{"text": "Exactly what happened to me, phone was fine when i got it. but as soon as i flashed it, i experienced device starts to heat in less than 5 min as soon as i activate the wifi and battery life got crappy. i flashed a samsung stock rom donwloaded from sammobile, but that didn't change a thing", "time": "22nd July 2016, 12:10 PM", "postID": "post67855376", "replies": [{"text": "This whole thread is a bit concerning. I have an S7 on its way and was thinking to give wireless charging a try. I flash roms on all my previous phone but have been noticing that my s4 gets pretty hot running games. I was going to pick up a CHOE QI 2016 and realized that i need to pay a lot more for the fast charge version and came across this.", "time": "25th July 2016, 10:08 PM", "postID": "post67902370", "replies": []}]}]}]}, {"text": "I just love quick charge.", "time": "20th June 2016, 08:09 AM", "postID": "post67400206", "replies": []}, {"text": "Compared to the S6 which doesn't charge (25% in 5hrs) when plugged into a pc, how does the S7 fare? \nTested a friend's exynos model, seems it's got the same issue, is the qualcomm model same thing?", "time": "4th July 2016, 08:02 PM", "postID": "post67604255", "replies": []}, {"text": "Gotta appreciate the fast charge feature over the standard 3hrs or so to recharge", "time": "2nd August 2016, 10:16 AM", "postID": "post68007591", "replies": []}, {"text": "this is battery very power full", "time": "3rd October 2016, 09:26 AM", "postID": "post68960983", "replies": []}, {"text": "very fast charging with original charger and cable", "time": "21st March 2017, 10:23 PM", "postID": "post71531189", "replies": []}, {"text": "Very fast. 'Ampere' shows up to 2.5A on stock charger.", "time": "27th March 2017, 12:11 PM", "postID": "post71607029", "replies": []}, {"text": "Well, without a valid test there's no point in posting anything\n\r\nMy battery drain varies depending on what I do with the phone day to day\n\r\nOne day it might be 4 hours SoT, next day might be 6 hours SoT\n\r\nIf you can not back up your claim, and want to post biased results, which they will be as you are not going to post results contradicting your claim, then don't bother\n\r\nIf you are 100% sure you are correct you would run controlled tests to ensure all is identical other than fast vs normal charging techniques \n\r\nIf you will not do this, it only confirms that you know you will be proven wrong", "time": "10th April 2017, 11:15 AM", "postID": "post71801320", "replies": []}, {"text": "so turning off fast wireless charging will have a battery last longer than if i use fast wireless ?? \nonly in the car some times do i plug a cable into the phone for charging.", "time": "10th April 2017, 12:42 PM", "postID": "post71802128", "replies": []}, {"text": "Same here and its normal because of overheat.", "time": "25th April 2017, 09:03 PM", "postID": "post72030207", "replies": []}, {"text": "Awesome. 5% to full in 1.5 hours.", "time": "4th July 2017, 05:20 AM", "postID": "post72899847", "replies": []}, {"text": "nvm", "time": "23rd January 2018, 12:36 PM", "postID": "post75304325", "replies": []}]}, {"title": "Screen on time", "rating": 4.0, "links": ["https://forum.xda-developers.com/galaxy-s7/review/screen-time-t3330751", "https://forum.xda-developers.com/galaxy-s7/review/screen-time-t3330751/page2", "https://forum.xda-developers.com/galaxy-s7/review/screen-time-t3330751/page3", "https://forum.xda-developers.com/galaxy-s7/review/screen-time-t3330751/page85"], "threads": [{"text": "7 hours with 15% left", "time": "8th March 2016, 07:44 AM", "postID": "post65715630", "replies": [{"text": "You can't be serious!\r\nEdge/non-Edge? Exynos/Snapdragon?", "time": "8th March 2016, 09:05 AM", "postID": "post65716527", "replies": [{"text": "I'm getting similar results and I'm on the Exynos.", "time": "8th March 2016, 09:11 AM", "postID": "post65716578", "replies": [{"text": "Great..\r\nHow's standby drain?", "time": "8th March 2016, 09:21 AM", "postID": "post65716704", "replies": [{"text": "Got the phone yesterday so let's just say it hasn't gotten much standby time thus far as I'm constantly playing with it.", "time": "8th March 2016, 09:52 AM", "postID": "post65717041", "replies": [{"text": "S7 or S7 edge?", "time": "8th March 2016, 12:09 PM", "postID": "post65718665", "replies": []}]}]}]}]}]}, {"text": "6 hours with 12% left. 4G connection all the time\nS7 Edge", "time": "8th March 2016, 07:54 AM", "postID": "post65715735", "replies": []}, {"text": "13 1/2 hours device on battery, 6 hours SoT, 17% left. I have the tmobile galaxy s7 edge.", "time": "8th March 2016, 12:45 PM", "postID": "post65719164", "replies": []}, {"text": "14hrs 36min with 5hr SOT and battery at 29%.  t-mo s7 edge!", "time": "8th March 2016, 01:54 PM", "postID": "post65720256", "replies": []}, {"text": "At the moment its 9hours since unplugged. Screen time is 5h 18min and 28% left.  \r\nGaming, browsing, etc.  Its S7 with Exynos. Yesterday it was 6h+ and about 12% left when i charged it.", "time": "8th March 2016, 01:57 PM", "postID": "post65720300", "replies": []}, {"text": "Got it today. Set all my settings, downloaded GB of stuff, few restarts, half an hour Asphalt 8, 4G/ WLAN, automatic brightness, no batterysaver active\nI think this is really nice \nAntutu i've testet was at 129k points \nNice to, but would be better soon \nGreets", "time": "8th March 2016, 10:44 PM", "postID": "post65728913", "replies": []}, {"text": "My new S7 had a reasonable day I guess. Not too impressive but ok.\n\n5Hr SOT fully drained.\n\nA bit of GearVR and a bit of nav via google maps and the rest browsing.\n\nI thought it might be better but im glad its not worse.\n\nHappy enough.", "time": "10th March 2016, 02:53 AM", "postID": "post65750411", "replies": []}, {"text": "4+ sot with auto brightness. About 1.5 hrs of deezer and 1hr of hearthstone.\r\nRest is twitch and a bit of browsing.\n\r\nAlso 1hr+ calls", "time": "10th March 2016, 02:00 PM", "postID": "post65758318", "replies": []}, {"text": "I heard that Exynos has better scores on running browsers.\nSo the Snapdragon may not last as long as Exynos when browsing?  Did I interpret it.correctly?  \n\nI use my phone very heavy on web browsing and I am on Verizon network using S6 currently.  The rooted S5 runs smoother than unrooted S6 and lasts longer.", "time": "10th March 2016, 07:56 PM", "postID": "post65764621", "replies": [{"text": "Maybe but dipends on the usage.\nAs the Note 4 with the Exynos a lot of people got very good battery life, even little bit more than snapdragon", "time": "10th March 2016, 09:19 PM", "postID": "post65765970", "replies": []}]}, {"text": "26 hours total time, 20% left, 4 hour SOT.", "time": "10th March 2016, 10:08 PM", "postID": "post65766690", "replies": []}, {"text": "Sorry for czech screenshot.\r\n1d 2h 58min on battery, estimation 2h 45min\r\nSOT 2h 33min", "time": "11th March 2016, 08:24 PM", "postID": "post65784454", "replies": [{"text": "You know unless you have the phone for more than a few days, it will be hard to tell its potential. The fact is that with a new device, the first day is stressful to the unit with all the apps and data installing. Then there is the tweaking to get it just the way you want it. For myself, I am getting a decent battery use but, like I said, it will be up and down till my s7 is driving day to day without any additional pressure.", "time": "12th March 2016, 05:20 PM", "postID": "post65799753", "replies": []}]}, {"text": "what Jetbruicelee said.\n\nfirst few days are not the best \"regular usage\" times..\nI've had my phone for a week now.. and I'm averaging about 5 hours SOT.  and I get home from 10hour work day with about 40% left... where as with my Nexus 5X i would be 15% or less.\n\nI'm very happy with this phone.", "time": "12th March 2016, 07:55 PM", "postID": "post65802171", "replies": []}, {"text": "GS7(exynos version ) 1d1h20min on battery , 5:45h on screen time , 30% left", "time": "12th March 2016, 10:31 PM", "postID": "post65804171", "replies": []}, {"text": "S7, exynos: 1d 14h 26m, 49% remaining (it was mostly on standby yesterday). Screen 36%, Cell standby 25%", "time": "13th March 2016, 09:06 AM", "postID": "post65809967", "replies": []}, {"text": "Yesterday gave my new S7 a workout. Got a total of 7 hours SoT !", "time": "13th March 2016, 10:02 AM", "postID": "post65810521", "replies": []}, {"text": "So this new S7 compared to the S6 give much more juice?", "time": "13th March 2016, 11:21 AM", "postID": "post65811507", "replies": []}, {"text": "14 hours 52 mins on battery. 3 hours 42 SoT. 14% left. Exynos SoC. Day 2 ownership (i.e. first full charge). What are people disabling in terms of bloatware?", "time": "13th March 2016, 12:40 PM", "postID": "post65812561", "replies": []}, {"text": "Full day of usage. Lots of play time and just browsing/chatting/videos.\r\nOnly NFC is off allways. BT is allways on and check my HR every 5 minutes (mi band 1s tracker on hand). Also connects to my car automaticly (i was driving about 1.5hours today).\r\nQuite OK  Exynos version.", "time": "13th March 2016, 10:38 PM", "postID": "post65822274", "replies": []}, {"text": "Since everyone uses their phone differently, I decided to measure my battery life when using my frequently used apps.\n\nS7 Exynos version with everything left on auto/default (except always on screen turned off):\n\n0.6% battery drained per hour overnight = estimated 166hrs standby time\n1.5% battery drained per hour in my pocket during the day = estimated 66hrs standby time\n10% battery drained per hour while using Chrome = estimated 10hrs screen on time\n10% battery drained per hour while using MX Player  = estimated 10hrs screen on time\n15% battery drained per hour while using Google Maps Navigation = estimated 6.6hrs screen on time\n20% battery drained per hour while using Gear VR = estimated 5hrs screen on time.\n\nSince I spend most of my time web browsing I am very happy with the battery life.", "time": "14th March 2016, 10:57 AM", "postID": "post65829904", "replies": []}, {"text": "I hardly get 3:30 to 4 hours", "time": "22nd March 2018, 07:00 PM", "postID": "post75981078", "replies": []}, {"text": "Check screenshots:  4 hours SOT over nearly 45 hours with 10% left.  Everything on, except Always On Display off.", "time": "25th March 2018, 04:30 AM", "postID": "post76007296", "replies": []}, {"text": "My sot", "time": "29th March 2018, 06:53 PM", "postID": "post76059704", "replies": []}]}, {"title": "Standby drain", "rating": 4.0, "links": ["https://forum.xda-developers.com/galaxy-s7/review/standby-drain-t3330752", "https://forum.xda-developers.com/galaxy-s7/review/standby-drain-t3330752/page2", "https://forum.xda-developers.com/galaxy-s7/review/standby-drain-t3330752/page3", "https://forum.xda-developers.com/galaxy-s7/review/standby-drain-t3330752/page30"], "threads": [{"text": "hi there. got my s7 few days ago and it sleeps like a baby hehe 1% lost in 6 hrs", "time": "8th March 2016, 03:31 PM", "postID": "post65721854", "replies": []}, {"text": "I lost 10% of battery the past two nights. I have the always on feature turned on tho.", "time": "8th March 2016, 05:32 PM", "postID": "post65723915", "replies": []}, {"text": "The mine 0,5% a hour\n\nInviato dal mio SM-G930F utilizzando Tapatalk", "time": "16th March 2016, 03:53 PM", "postID": "post65872814", "replies": []}, {"text": "I typically lose about 4-5% overnight.  Not bad, but not as good as a Nexus", "time": "26th March 2016, 04:24 AM", "postID": "post66040696", "replies": []}, {"text": "I have a massive batterydrain in standby when I am connected to WiFi. When I'm on mobile data I have no batterydrain at all in standby \n\nI don't have a clue why it is like this", "time": "26th March 2016, 12:14 PM", "postID": "post66044906", "replies": [{"text": "Go to WiFi > more > keep WiFi on during sleep > off \n\r\nMore than likely your WiFi is causing the drain by the always scanning feature turned on", "time": "26th March 2016, 06:16 PM", "postID": "post66049858", "replies": []}]}, {"text": "I lose 18% over 8 hours. Maybe I'll try turning wifi off tonight. That said, battery life overall seems really good. No problems whatsoever getting through a full day on one charge.", "time": "26th March 2016, 03:35 PM", "postID": "post66047621", "replies": [{"text": "Yes, do try that. It would be interesting for me too to know. \n\n\n\n\nHave that setting now but should not have to. On my S6 I have it allways on and there is no batterydrain problem.", "time": "26th March 2016, 07:12 PM", "postID": "post66050669", "replies": []}]}, {"text": "with heavy use, 2 days battery life without charging. and also its charging is pretty fast too", "time": "31st March 2016, 06:03 AM", "postID": "post66122173", "replies": []}, {"text": "I loose 1% over a 7h night on plane mode. \nSM-G930FD", "time": "1st April 2016, 02:20 AM", "postID": "post66136871", "replies": []}, {"text": "I bearly loose 1% per night (wifi on/always on display). Even in heavy use, the battery doesn't give up that easy...", "time": "1st April 2016, 11:31 AM", "postID": "post66142024", "replies": [{"text": "What tweaks/optimizations do you have? Exynos version or SD820? \n\nI have the SD820 with package disabler pro and greenify and I lose about 5% overnight...", "time": "1st April 2016, 03:16 PM", "postID": "post66145113", "replies": [{"text": "Hey man,\n\r\nI have the exynos version. Still on stock, i just used \"package disabler pro\" - as you do - to get rid of all the bloatwares and apps i don't use. \n\r\nOh, and i don't know if that's relevant, but i disabled the fast charge, in order not to preserve the - non switchable - battery, it still charges quite fast.\n\r\nI've checked three times now, i was never below 99% when i woke up.\n\r\nHope it helps.", "time": "1st April 2016, 03:28 PM", "postID": "post66145297", "replies": [{"text": "only lost 1% with Always on Display?  That doesn't sound right\n\nI lose about 2-3% over night without Always on Display", "time": "1st April 2016, 04:08 PM", "postID": "post66145917", "replies": [{"text": "Yet this is. I just turn the phone back (with the screen hidden) so that the \"always on\" doesn't turn on.", "time": "1st April 2016, 04:15 PM", "postID": "post66146024", "replies": []}]}]}]}]}, {"text": "My phone drops 20% in 2 hours on standby and I'm at my wits end trying to figure out why android os is taking 500mb of data  a day", "time": "2nd April 2016, 12:52 AM", "postID": "post66153036", "replies": []}, {"text": "20% Over night absolutely not normal! \nHave to recharge phone twice a day.\nI am on stock and cannot apply root (this is company phone).\nWhen I had Nexus 5, battery drain was not so horrible.", "time": "2nd April 2016, 09:55 AM", "postID": "post66155942", "replies": []}, {"text": "Here is a picture of my battery drain \n\nFrom start I have WiFi on and then I turn WiFi off and the battery drain stops \n\nCan't understand why WiFi is draining my battery like this ? \n\n\n\nSkickat från min SM-G930F via Tapatalk", "time": "3rd April 2016, 06:21 PM", "postID": "post66177091", "replies": []}, {"text": "Anyone wanna explain wtf is going on with this, I don't have any backing up turned on. No syncing no diagnostics uploading. No Google photo no Google Drive, all of that disabled with tons of apps disabled with package pro disabler", "time": "4th April 2016, 09:50 AM", "postID": "post66186218", "replies": []}, {"text": "My battery drain was fairly minimal at first-- maybe 1%/hour at most with all background services enabled plus Always On Display. Lately however it's gotten a lot worse. For instance I've barely used my phone today and after about 6 hours I'm down to 75% remaining. Not sure what changed, but I was really enjoying the battery life before and now it kinda sucks. I haven't rooted my phone or attempted to uninstall any bloat, so I'm not sure what could've caused the change.\nAs a long time Android user quite frankly I find it ridiculous that every device and Android revision ALWAYS suffers from poor battery life.", "time": "4th April 2016, 05:15 PM", "postID": "post66192091", "replies": []}, {"text": "Most likely the famous radio active bug. I lost 50% today with less than one hour display activity", "time": "6th April 2016, 03:51 PM", "postID": "post66224313", "replies": []}, {"text": "Mine has been draining way too fast in standby.\n\nAlways On Display, DND on, I drain at 2.48% per hour.\nAOD off, DND on, I drain at 2.22% per hour.\n\nThere's no way Doze is working for me.", "time": "7th April 2016, 05:33 PM", "postID": "post66242405", "replies": []}, {"text": "The problem was the Samsung Push Service Update.\n\n(came as auto app update these days, may vary few days and some might not have installed yet, check ur playstore apps)\n\nGo to apps, uninstall (will downgrade the app) -> fine standby drain again. Maybe do a reboot afterwards. I already reported to samsung + rated the app and u can update Post 1 \n\nur all welcome", "time": "7th April 2016, 11:07 PM", "postID": "post66247134", "replies": []}, {"text": "Now I'm on my third S7. Still same problem with batterydrain. Yesterday I started this one and right away I got an 73 mb update. I did a factory reset after update and only installed my Gmail, Nova launcher, tesla unread, tapatalk and dolphin. It consumed 60% over night on WiFi. Did a factory reset again this morning and will not install anything now to see if there is batterydrain when my phone is clean.", "time": "9th April 2016, 10:53 AM", "postID": "post66269890", "replies": []}, {"text": "Can somebody explain to me what is going on?\n\r\nThis only seems to happen when I am at home. At work I get nearly no drain.\n\r\n(WiFi & Mobile data are both on, but the phone was connected to a WiFi network during my test)", "time": "9th April 2016, 11:39 PM", "postID": "post66280188", "replies": [{"text": "No doubt, it's your wifi settings or something in your wifi network that keeps your device awake. I have the same issue on my LG GPad since cm 13. I searched weeks for the reason. Then I found out that my multiroom wireless speaker system (something similar to Sonos but cheaper) caused this drain and prevents my tablet from deep sleep. It happens only on my tablet (and only since marshmallow), not on my galaxy s5 and as I can say now not on my galaxy s7 too.\nSo I would recommend that you disconnect any other device from your wifi and test again. I would also use an app like cpu spy so you can check quickly if your device is going to deep sleep while screen off. \n\nGesendet von meinem SM-G930F mit Tapatalk", "time": "10th April 2016, 06:56 AM", "postID": "post66283758", "replies": [{"text": "I'm on my own private router. The only thing other than my phone connected to it is my computet via an Ethernet cable. There is nothing (like a Sonos or Chromecast) that could be keeping my device from sleeping.\n\nCould it be my network coverage? At home I only get Edge coverage, so could my phone just be scanning for a better signal all the time? If so, how can I fix this?\n\nAnd I guess deep sleep is the same thing as doze? If so, I checked yesterday with that GSAM app, and it said it was asleep most of the time. It only woke once for a minute or so.", "time": "10th April 2016, 09:35 AM", "postID": "post66285217", "replies": []}]}]}, {"text": "Could also be your  router. I have seen multiple issues mentioned in an Asus router forum related to battery drain. Can you update your router.. \n\nAlso I have just found out that clearing most recent list every time I leave my phone helps a lot. Flash etc I chrome actually keeps running if you jump out of it.", "time": "10th April 2016, 09:48 AM", "postID": "post66285360", "replies": [{"text": "I use the router my ISP gave me. It's a Zyxel router, and can not update it (nor flash any custom firmware).\n\nI had every app closed when I tested my idle drain, but on a normal day, I usually don't have that much open anyways.", "time": "10th April 2016, 09:53 AM", "postID": "post66285432", "replies": [{"text": "Try going to <Settings>---<Wi-Fi>----<Upper right corner - MORE>---<Advanced>---<Keep Wi-Fi on during sleep - Select never>. Should help during Wi-Fi consumption and battery life. Curious, Snapdragon or Exynos?", "time": "11th April 2016, 07:43 PM", "postID": "post66310855", "replies": []}]}]}, {"text": "I have the dreaded Google Play Services battery drain, which absolutely destroys the battery..\n\nA help thread with Google has so far had them suggesting the wiping data and removing accounts \"fix\" which stops it for a week, and now it's started again.\n\n:|", "time": "7th March 2018, 05:08 PM", "postID": "post75806492", "replies": []}]}, {"title": "Heavy use endurance", "rating": 3.5, "links": ["https://forum.xda-developers.com/galaxy-s7/review/heavy-endurance-t3330753", "https://forum.xda-developers.com/galaxy-s7/review/heavy-endurance-t3330753/page2", "https://forum.xda-developers.com/galaxy-s7/review/heavy-endurance-t3330753/page3"], "threads": [{"text": "22h straight? How is this even possible? was the phone plugged in?", "time": "9th May 2016, 08:40 AM", "postID": "post66764719", "replies": []}, {"text": "This phone idle drains almost as much battery when in use, if you are a heavy use, this is not a bad phone for you.", "time": "20th June 2016, 08:12 AM", "postID": "post67400240", "replies": []}, {"text": "Coming from the Droid maxx I find the battery to be underwhelming. The only saving grace is the quick charge. Love the device hardware but battery sucks.", "time": "17th July 2016, 02:07 AM", "postID": "post67777553", "replies": []}, {"text": "Phone is doing great while using it, its only downside is that it gets quite hot while using. Other than that its great and i love it !", "time": "18th July 2016, 05:16 PM", "postID": "post67800323", "replies": [{"text": "mine starts to heat in less than 5 min as soon as i activate the wifi", "time": "22nd July 2016, 11:48 AM", "postID": "post67855160", "replies": []}]}, {"text": "It gets hotter than Galaxy S5.  Gets very hot when doing continous web browsing.  Gets overheat warning when playing VR for 30 mins.  \n\nThe game's name is Lands End", "time": "22nd July 2016, 07:15 PM", "postID": "post67860554", "replies": []}, {"text": "Mine doesn't get hot at all but I am not gaming. About the hottest it gets when updating Android. And I live in a very hot and humid climate so I am very satisfied.", "time": "25th July 2016, 07:36 PM", "postID": "post67900595", "replies": [{"text": "Can you download CPU-Z and tell us the battery temperature when you are on Chrome for more than 10 minutes and when you are charging the phone ? Mine gets warm after using it a bit and hot when charging.", "time": "26th July 2016, 12:05 PM", "postID": "post67909330", "replies": []}]}, {"text": "I don't browse much on the phone. It's just annoying. Also, I have been using USB charging from a desktop which is horribly slow but also doesn't heat up the battery which is good. Like I said the only time I notice it getting hot is on a long Android update. When I update all apps and have like 20 or 30 apps to be updated it gets warm but not hot. And the ambient temp here is around 90-95F right now in my living room. Right now on phone info it shows 33C CPU and 33.3C battery. I don't use cpuz because of the ads. I thought cpux had temps but i can't find them now.", "time": "26th July 2016, 12:22 PM", "postID": "post67909550", "replies": []}, {"text": "Oh it does get hot with the wall charger! I have been using usb charging and it takes over three hours to go from 40% or so to full but the phone stays cool. The wall charger is much faster but it really heats up the phone. I guess what you are seeing is normal. Try usb charging if you don't need to get the battery full in a hurry.", "time": "27th July 2016, 10:40 AM", "postID": "post67923624", "replies": []}, {"text": "Using this phone while playing Pokemon Go gets me about 4-1/2 hours until i need to recharge. I usually use my Samsung Charging pad to recharge my phone. just sit it down and leave it.", "time": "11th August 2016, 04:01 AM", "postID": "post68134472", "replies": []}, {"text": "low endurance, i using phone every day, instagram facebook and other soc. media and i have to charge phone twice a day :/", "time": "19th December 2016, 05:32 AM", "postID": "post70156432", "replies": []}, {"text": "i heavily modified my s7 software (Google Play Services replaced with microG, Xposed installed, Magisk installed, Amplify, Greenify, Better Battery Saver, Disable-Service, PowerNap, AFWall+, AdAway, AppOps, etc), and i get very very good battery, 6 hours SOT minimum with heavy LTE usage on whatsapp, facebook, instagram, etc. But yeah, in stock bloated rom, battery sucks.", "time": "20th December 2016, 02:01 PM", "postID": "post70177323", "replies": [{"text": "Does your s7 have the exynos processor or snapdragon? if it's snapdragon, can you tell me what other apps you used to get such awesome battery life, or what guides you used that led you to the use of such apps? I can barely crack 4 hours SOT with mainly Firefox, Youtube use, and some facebook/whatsapp. On top of that, when I rooted my s7 and tried using greenify+amplify+forcedoze my battery life was VERY BAD compared to stock and full bloat.", "time": "22nd December 2016, 11:11 PM", "postID": "post70214695", "replies": [{"text": "It's Exynos! i think 4hs SOT with Qualcomm it's ok since it is less efficient (At least on our phone). I can't tell about battery drain on root because the root method of your version is different, so maybe it's a kernel issue (no deep sleeping or something like that  or a bad CPU governor keeping the cores at high frecuency).", "time": "14th January 2017, 09:40 PM", "postID": "post70555045", "replies": []}]}]}, {"text": "I purchased this phone on 12/21 from Best Buy.  I am coming from an unlocked Moto Z Play with which I was averaging 10 hours of screen time.  Greatness and benchmark every OEM should consider.  The apps on the S7 are the same as I had on the Moto.  Today is my first day of a full charge and I have actually used it less than I typically would the Moto Z Play.  I would try to kill the battery on the Moto purposely.  That thing just kept going.  Underwhelming battery life is about right for the S7 but I knew coming in that there would be absolutely no comparison.  \n\nWhy did I switch?  This phone game is one of give and take.  I would take the Moto Z Play with that Snapdragon 625, insane battery life, 10x better finger scanner and the software experience over the S7 any day.  There was one thing that I could not deal with on the Moto and this is where the S7 shines.  The camera on the Moto is horrendous.  \n\nI have a nice shooter but I don't lug it everywhere I go.  More times than not I want to take a picture with my phone where you just wouldn't carry a camera.  \n\nSo, as of this post I am on target for about 4 hours of SOT on the S7 which falls short of what I am used to (Moto Z Play, 10 hours and about 8 on the  iPhone 6 Plus that I just sold).  \n\nGive and take.  Return this S7 and go back to the Moto Z Play but deal with a camera that sucks but IMHO excels over the S7 in every other aspect?", "time": "22nd December 2016, 11:43 PM", "postID": "post70214961", "replies": []}, {"text": "Wait android 7. I can tell you there the fingerprint unlocking are fast as lightning!!! And sot i get 6-8h because in nougat the doze is very good.", "time": "23rd December 2016, 09:12 AM", "postID": "post70219255", "replies": []}, {"text": "It would be useful to state whether you own the Exynos or the Snapdragon* version  I have the Exynos, it doesn't get hot, not even when charging. 6 hours game time.", "time": "24th December 2016, 02:17 PM", "postID": "post70235562", "replies": []}, {"text": "Just installed BTU firmware on my 930FD. Doing reasonably well. Display resolution set to 1080p, getting about 30m more SOT than MM.", "time": "20th January 2017, 07:41 AM", "postID": "post70638287", "replies": []}, {"text": "Playing need for speed most wanted. I get 5 hours  more or less.", "time": "25th January 2017, 06:34 PM", "postID": "post70726603", "replies": []}, {"text": "So I would call myself a heavy user as I use my phone daily for work, tethering, etc.  This includes running GPS constantaly for hours on end tracking skiing/mountain biking, playing music via pandora (both cached and in service modes) and it doesn't get that hot at all.  The ONLY time I feel it getting hot is when I have tethering on in addition too everything else.\n\nI've used both wireless and fast charging it it's not too hot when I pick it up.  To be fair, I have a lifeproof case on it so that may be absorbing heat but those are my results.  \n\nI must say, battery life is on point for me.  I can get a full day including 5+ hours tracking with GPS and music.", "time": "26th January 2017, 10:12 PM", "postID": "post70745984", "replies": []}, {"text": "Never needed to charge my phone during the day, even when used heavily (~3-4 gaming)", "time": "27th March 2017, 12:19 PM", "postID": "post71607117", "replies": []}, {"text": "Flagship devices can handle huge things but unfortunately battery's aren't. They just focus on adding up features instead of giving good performance on whatever is packed on the phone with good battery back up.", "time": "7th October 2017, 10:15 PM", "postID": "post74073426", "replies": []}, {"text": "When my phone hits 15% it literally counts down to zero in 15 seconds.  Just started happening about a week ago.  Any suggestions are greatly appreciated!", "time": "8th October 2017, 01:37 AM", "postID": "post74074645", "replies": [{"text": "Looks like your battery is dead. You would need a battery replacement.\n\nBefore you can try recalibrating the battery by draining to 0 and then recharging it to 100 in one shot. Do it 2-3 times and it should calibrate properly.", "time": "26th November 2017, 07:26 AM", "postID": "post74639555", "replies": [{"text": "Thank you for the response.  It was, indeed, the battery.", "time": "10th December 2017, 07:06 PM", "postID": "post74801700", "replies": [{"text": "Did you get it replaced? If so then how? And how much did it cost?", "time": "11th December 2017, 03:11 AM", "postID": "post74805201", "replies": [{"text": "Hi there, I ended up purchasing a battery and new back in Amazon.   If I had sent it in and used insurance, there was a chance chance it would be swapped out for a refurbished unit without even checking if it was the battery.   Sounded fine until rep told me it would be $150 if phone was damaged.  Unlucky for me, I cracked the back Glass the 1st day i had it.  After, reading many posts, i was 80-90% convinced it would be fixed with with new battery.  This was just enough doubt to keep me from spending 80 bucks for a pro to replace battery.  If financial situation had been better, I would have opted for one of these 2 options.  \n\r\nEnded up costing about $25 bucks and a few hours time...much of which was spent watching YouTube tutorials.  Before discovering this forum, I considered myself pretty tech savvy.  But I am far from it, unless comparing to peers.  I did spend a few years dealing craps, so I can say I have good hands...this was definitely a plus!  All worked great.  \n\r\nAbout 6 weeks later, I dropped phone, which I have done many times.  After initial crack, I bought a heavy duty case which served me very well.  However, when I picked it up, it was dead.  I figured I just needed to plug it in and start it up.  When I did, the battery icon would flash off every couple seconds and vibrate.  I suspected that the connector from battery to board had come loose and needed to be reseated.  Opened it back up and it didn't work.  Tried every button combo and was able to get into download mode and but could not do it when connected to conputer.  Inshould add that phone is not rooted.  I got into recovery mode but could not boot, so i ended up trying a factory reset.   Now the phone shows \"recovery booting\" in small blue letters and keeps flashing and vibrating...just like it had initially done with the battery icon.  I could and can still get into download mode when connected to wall charger, but no luck with computer.  \n\r\nIn a lsst ditch effort,  i completely disassembled and detached wire from power button mechanism.  I was convinced that it was \"stuck\" (even though button did not physically seem stuck), and it seemed to make a lot of sense as to why phone could not charge or boot.   That didnt work so i took out the mechanism, hoping that the wire was for something else....nope, lol. \n\r\nSorry for the novel.  If you are still with me, I have a question.  When receiving an OTA update on my old S5, which I activated, I saw the familiar blue \"recovery booting\" at the beginning of process.   This is likely foolish thinking, but I wondered whether an OTA update that i had been delaying from Verizon, had been forced on my S7 when I did the factory reset and somehow could be playing a part in my misery. \n\r\nFINALLY, my question...could this ever be the case?  And more importantly, would it be possible to have a VZ tech  push some sort of fix to my phone if I can get it into download mode?  I apologize if this is a dumb question and realize that I can certainly call tech support and ask, but figured it would be helpful to know the answer, beforehand.  \n\r\nIf anyone has read this far and lives in, or visits, Minnesota, I will gladly buy you a few rounds for your patience!  \n\r\nP.S. I wrote about this in another thread a couple weeks ago.  A commentor described exact same issue...did not get a reply, though....sorry if duping the issue is bad etiquette.", "time": "19th December 2017, 07:47 AM", "postID": "post74893852", "replies": []}]}]}]}]}, {"text": "Indeed, when I start playing a game and YouTube at the same time, it starts to slow down a lit", "time": "21st December 2017, 04:18 PM", "postID": "post74920109", "replies": []}]}, {"title": "Light use endurance", "rating": 3.5, "links": ["https://forum.xda-developers.com/galaxy-s7/review/light-endurance-t3330754", "https://forum.xda-developers.com/galaxy-s7/review/light-endurance-t3330754/page2"], "threads": [{"text": "I'm still breaking in the phone, but it seems like I should be able to make 48 hours in light usage. It won't be quite as easy as with my old LG G2, though.", "time": "25th April 2016, 12:47 AM", "postID": "post66531852", "replies": []}, {"text": "i have the phone for almost 4 weeks, light usage (no games, no FB, no YouTube), some web browsing, almost 1-2h of calls and the battery never got under 48h...i am pretty happy with it", "time": "26th April 2016, 03:45 PM", "postID": "post66556463", "replies": []}, {"text": "Not a good phone for light use.", "time": "20th June 2016, 08:11 AM", "postID": "post67400232", "replies": []}, {"text": "Stock ROM, a few app disabled. I never was able to reproduce these. 4+ days standby, 7+ hours SOT.", "time": "15th January 2017, 06:24 PM", "postID": "post70566944", "replies": []}, {"text": "@red6hu how did you change the signal and wifi signal icons because in stock rom there are different icons .", "time": "15th January 2017, 10:51 PM", "postID": "post70570079", "replies": [{"text": "With Samsung's Good Lock app.", "time": "16th January 2017, 02:20 AM", "postID": "post70571631", "replies": []}]}, {"text": "Battery just flies away with wi-fi on", "time": "21st March 2017, 10:24 PM", "postID": "post71531196", "replies": []}, {"text": "No complaints.", "time": "27th March 2017, 12:19 PM", "postID": "post71607121", "replies": []}, {"text": "Doesn't matter you are a heavy user or light you'll get only 10-15 minutes of difference.", "time": "7th October 2017, 10:16 PM", "postID": "post74073434", "replies": []}, {"text": "Adding my rarely used apps to \"Always Sleeping Apps\" in battery settings has improved my standby time a lot. I can easily get 2 days with 2.5 hours SOT now.", "time": "10th October 2017, 03:45 AM", "postID": "post74101314", "replies": []}]}, {"title": "\"Look\" of the device (aesthetics)", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s7/review/look-device-aesthetics-t3330755", "https://forum.xda-developers.com/galaxy-s7/review/look-device-aesthetics-t3330755/page2", "https://forum.xda-developers.com/galaxy-s7/review/look-device-aesthetics-t3330755/page3"], "threads": [{"text": "Looks great, feels great, excellent speed and stamina. What more could you ask for?", "time": "9th March 2016, 02:20 AM", "postID": "post65731053", "replies": [{"text": "完美！", "time": "3rd May 2016, 12:57 AM", "postID": "post66667229", "replies": []}]}, {"text": "Agreed, mine just got here. Lovin it!!", "time": "9th March 2016, 04:29 AM", "postID": "post65732175", "replies": []}, {"text": "I'm about 36 hours in to having mine. Loving it. The size is a welcome change.", "time": "9th March 2016, 04:34 AM", "postID": "post65732229", "replies": []}, {"text": "Going from a Nexus 6P to this, sort of I am still carrying both right now.. work and personal but I love the look and feel of this phone.. So much more manageable and really the screen size difference is not big enough for me to care.", "time": "9th March 2016, 04:44 PM", "postID": "post65741653", "replies": []}, {"text": "I traded in a Note 4 for this (which I loved) and I'm thrilled with the smaller size.  It's the perfect middle ground for me - not too big for my pockets.  As a tall guy, I could carry the Note 4 just fine in my pocket and in my hand it was great, but I absolutely love the downsized goodness that is the S7.  My note was always rubbing holes in my pants pockets because it's just slightly too big.", "time": "10th March 2016, 12:06 AM", "postID": "post65748756", "replies": [{"text": "Came from the Note 4 as well. For a 5'0\" tall, 100-pound girl like me the Note 4 was seriously huge!! I loved it to bits but it came to the point where it was impractical to carry and hold. I love the size of the S7 and generally the device looks so sleek and classy! I guess what the Note 4 lacked was that \"premium feel\" devices released afterwards have.", "time": "23rd April 2016, 09:04 PM", "postID": "post66514217", "replies": []}]}, {"text": "I'd prefer the phone be a bit shorter and wider (like the LG G2 I'm coming from). Otherwise, the size is nearly perfect for me.", "time": "25th April 2016, 12:35 AM", "postID": "post66531749", "replies": []}, {"text": "Sexy", "time": "1st May 2016, 03:32 PM", "postID": "post66640514", "replies": []}, {"text": "The pearlescent finish and curved back are pretty nice to look at.", "time": "1st May 2016, 04:02 PM", "postID": "post66640904", "replies": []}, {"text": "thanks", "time": "5th May 2016, 09:57 AM", "postID": "post66704590", "replies": []}, {"text": "I actually just mentioned this in another thread. I have the Gold Platinum Galaxy S7 (not Edge). It is THE sexiest phone I have ever owned. Ever. I was very leery about buying it since it can't be rooted and I've rooted every single Android phone since the Droid, rocking Android 2.0.1, which I bought the day it was released. Though root didn't exist, and I had no idea what root even was for probably a couple months. Basically I screwed with the phone and set everything up that could be possibly customized on my own. At which point I was bored at work and discovered root while looking up what else could be customized that I didn't discover on my own playing with the phone. I was one of the 2% on VZW who had their 3G data throttled back by 90%. So I was also one of the first with 4G, getting a Thunderbolt, rather than waiting for the Bionic (luckily because that was delayed for so long, I was almost due for a new upgrade). But back to the point from my ADDetour, I barely mind not having root. I do wish I could customize the statusbar icons/text/clock colors/fonts. But otherwise loving marshmallow. And I've always liked touchwiz. And love this one. But that's only half of it. This is the first time I can say in terms of hardware that Android crushes Apple. It is one drop dead sexy phone. Though damn near every flagship Android looks better than the iPhone now. I even owned a few iPhones over the years, trying to accept them because I've always thought they were great devices, but none lasted more than a couple weeks before I sold em off and got a new Android. Even though I thought it looked better physically, and I always jailbroke them and tried to make myself like it, I always came right back to Android. As I said in my thread about getting a case for it. I want as little as possible. I have always just slapped a case on my Androids without a second thought. But I don't wanna cover this beauty up. On a scale of 1-10, I give it an 11. I just couldn't be happier with this phone. Well, once somebody finds the exploit to root it. But as a stock device. Never had one like this", "time": "9th May 2016, 02:50 PM", "postID": "post66768981", "replies": []}, {"text": "I love the way the camera and flash is lined up. Screen is amazing!", "time": "6th June 2016, 12:51 AM", "postID": "post67188021", "replies": []}, {"text": "Definitely the best looking phone I've ever had.", "time": "18th June 2016, 10:33 AM", "postID": "post67373249", "replies": []}, {"text": "Just look slick and stylish. The glass texture feels great too!", "time": "20th June 2016, 08:13 AM", "postID": "post67400247", "replies": []}, {"text": "Love the way it looks and feels in my hand. If i had 1 negative thing to say it would be the glass gets slippery when you hand starts to sweat a bit.", "time": "11th August 2016, 04:06 AM", "postID": "post68134520", "replies": []}, {"text": "Love this phone, build quality, aesthetics and everything, its one of the best looking smartphones, sleek, stylish, premium even better.", "time": "11th August 2016, 05:03 AM", "postID": "post68134870", "replies": []}, {"text": "Superb build quality, but personally I'd rather my S6 Edge for innovation and design.\n\nDon't get me wrong the S7 is a great phone but it's lacking on overall design, the larger battery makes it heavy, the glass/metal make it so slippery, not a good combination.\n\nThe amount of times I've nearly dropped this phone in the space of a week is ridiculous and I have a good track record not breaking my phones, ended up buying a case which made it look like an S6 flat, so not too impressed that it doesn't stand out. Ive had every model in the S range, this & the S5 are the least visually exciting ones I've owned", "time": "31st October 2016, 01:29 AM", "postID": "post69384901", "replies": []}, {"text": "I have the s6. Will miss the s7, the look of that phone is fabulous", "time": "1st November 2016, 12:00 PM", "postID": "post69406782", "replies": []}, {"text": "S7 i think is the most coolest thing id ever had.\r\nBut my hand is not fitting to keep the phone safe", "time": "2nd November 2016, 10:53 AM", "postID": "post69422961", "replies": []}, {"text": "Super fast phone.       EVERYTHING!", "time": "7th November 2016, 10:45 AM", "postID": "post69500548", "replies": []}, {"text": "Looks good.", "time": "26th March 2017, 06:30 PM", "postID": "post71598322", "replies": []}]}, {"title": "Quality feel (use of materials)", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s7/review/quality-feel-materials-t3330756", "https://forum.xda-developers.com/galaxy-s7/review/quality-feel-materials-t3330756/page2", "https://forum.xda-developers.com/galaxy-s7/review/quality-feel-materials-t3330756/page3", "https://forum.xda-developers.com/galaxy-s7/review/quality-feel-materials-t3330756/page4"], "threads": [{"text": "The Gorilla Glass is not Scratch Resistant than my old Galaxy S4.\n\r\nIt's the 7th day I'm using the phone. I used the phone like it's my new baby. Still I could see some really minor scratches on the front glass. If putting in the pocket gives me such scratches, Samsung and Corning you both done a bad joke. The phone is already fragile with the glass back. Now, If I have to worry about the front glass, it's not good.\n\r\nAlso, You have to be very careful while holding it as it slippery.\n\r\nThe look is premium but...", "time": "24th March 2016, 07:49 AM", "postID": "post66008653", "replies": []}, {"text": "Super su", "time": "24th March 2016, 07:51 AM", "postID": "post66008664", "replies": []}, {"text": "Screams premium. It feels just a bit more premium than Sony Z5. In hands it feels expensive.", "time": "31st March 2016, 11:04 PM", "postID": "post66135158", "replies": []}, {"text": "then maybe iphone is for you.", "time": "1st April 2016, 08:12 AM", "postID": "post66139738", "replies": []}, {"text": "Yeah, the screen is super scratchy. Otherwise everything is great.", "time": "1st April 2016, 04:43 PM", "postID": "post66146467", "replies": []}, {"text": "I have both iPhone 6S and S7. Samsung did excellent job with S6 and S7. Now phones look and fill premium!", "time": "2nd April 2016, 10:01 AM", "postID": "post66155976", "replies": []}, {"text": "Perhaps you have defects, as this phone has been to hell and back in the past month and it still doesn't have a scratch. I have a case protecting the back and sides, but the front is vulnerable.", "time": "2nd April 2016, 09:27 PM", "postID": "post66164791", "replies": []}, {"text": "The S7 is one of the nicest feeling Android phones I've ever had, although I'm not a fan of glass on the back. The phone feels nice enough I've gotten more premium feeling cases for it than other phones. Right now I have two Obliq cases, the Slim Meta and Flex Pro. Both feel better than anything else I've ever tried.", "time": "25th April 2016, 12:43 AM", "postID": "post66531820", "replies": []}, {"text": "Good feeling but back is huge fingerprint.", "time": "18th June 2016, 10:22 AM", "postID": "post67373137", "replies": []}, {"text": "Feels great but I'm afraid of impacts now since it's all glass.\n\nPast samsung galaxies were plastic with maybe a metal trim. Those were bulletproof and didn't need a case.\n\nThis version requires protection. Good thing it's thin enough that a jelly case won't alter feel too much and vastly improves grip.", "time": "18th June 2016, 10:40 AM", "postID": "post67373303", "replies": []}, {"text": "It seems that the power button is hanging in the middle and is functioning as a flip switch..\r\nSometimes it starts to operate as a push button, but the next time I use it's seems to be back at flipswitch..\n\r\nThe glass is very scratchy.", "time": "22nd June 2016, 12:38 PM", "postID": "post67434237", "replies": []}, {"text": "Hey guys,\nI have a problem with my s7. The home button get scratchy on the left side of it. I've been using it normally with a case. So no way it got the scratches from a table or something else. I've read a lot about the scratchy home buttons on galaxy s7, but here's my question: has someone experience what to do or what we can say to samsung or maybe did u got your replaced or something. Idk it's just screwed up guys u pay so much money for a good looking phone and then it scratches by daily usage.", "time": "24th June 2016, 08:37 AM", "postID": "post67461025", "replies": [{"text": "It's a known issue for Samsung Galaxy S7 and S7 edge.", "time": "24th June 2016, 05:33 PM", "postID": "post67466767", "replies": [{"text": "I know man, but what can we/I do ?", "time": "25th June 2016, 12:14 AM", "postID": "post67470971", "replies": [{"text": "The scratches won't affect the function of the scanner. \nSamsung has to come with an official statement, I'm sure they are aware of this issue. And I agree this happens to fast for such a \"high end\" phone.", "time": "25th June 2016, 10:19 AM", "postID": "post67475413", "replies": [{"text": "Yes man the scanner works flawlessly but u know what I mean. It's just ugly and so much money for nothing. \nThey could replace it for free and hope that it's only on some products.", "time": "25th June 2016, 08:31 PM", "postID": "post67481899", "replies": [{"text": "It's on all Galaxy S7 products...", "time": "26th June 2016, 07:43 AM", "postID": "post67486534", "replies": []}]}]}]}]}]}, {"text": "I did quite a bit of research before my girlfriend bought her last two phones and the Galaxy consistently ranks as the best phone for the common user. The S6 made some odd choices that compromised the user experience, but the S7 is solid and better than ever. Battery life, performance, size, user experience - in my mind the S7 is the ultimate iPhone killer (for a power user I might suggest upgrading to the Note).\n\r\nAs far as quality feel, go to your local retailer and hold one in your hand for yourself! It feels good in the hand, solid enough, fast as all hell. Yes get a screen protector and a case, but all around this phone is quite sturdy.", "time": "24th June 2016, 07:26 PM", "postID": "post67468234", "replies": []}, {"text": "Well, sturdy... \nI know, you shouldn't drop a $$$-phone, but it happens sometimes. Didn't have any case or screen protection when it happened, so I guess I'm lucky. I have pretty dents on the upper/lower left/right edges of the frame. The dents did not affect the screen, but it was close...\nNow I'm running a Spigen, still looking for a nice screen protector/second glass.", "time": "14th July 2016, 11:33 PM", "postID": "post67749041", "replies": []}, {"text": "I mean this on all edges\n\n...otherwise: quite happy with Samsung again, they did pretty much everything right with this one. My last Samsung was the S4., switched from a Sony Z3C to the S7. \nI'm not complaining about glass and general look, use & feel - but hey... glass at the back ? Come on. It can't be that hard to design a back frame that neither slips, breaks or draws scratches like hell. I know that the industry for cases etc needs to live as well, but...", "time": "14th July 2016, 11:38 PM", "postID": "post67749085", "replies": []}, {"text": "As for screen protectors, this is my z3c. Maybe it got in my pockets along with keys, but without a 2nd screen... Toast.", "time": "15th July 2016, 12:02 AM", "postID": "post67749262", "replies": []}, {"text": "I think that the S7 is made of fine materials, glass makes a very good impression.", "time": "16th July 2016, 02:29 PM", "postID": "post67770425", "replies": []}, {"text": "A month of use, upgraded from Galaxy S4. To me, the S4 has the better materials & form factor. I think the S7 has the best looking design I've ever seen in a phone, but this doesn't really matter to me, and the fragile glass back and dent-prone metal frame demand a case, made even more important by the slipperiness of the back glass and the curved rear edges. The curved edges feel slightly more comfortable on my fingertips, but offer decreased grip. The rear corners (where the curved edges taper to full width at the top and bottom) dig into my hand a bit - not horribly bad, but less comfortable than the S4. The substantial weight increase also adds a bit to the poorer handling of the S7. I never used an S4 case in 3 years, but the gorgeous S7 design requires a case, defeating the whole purpose of that beautiful design. A case adds unwanted physical size to the phone. The good battery life I'm getting and the excellent charging speeds have made losing removable battery fairly easy to swallow, although I'd still prefer removable. I much prefer having the headphone jack on top, although this is more of personal preference.\n\nOn the plus side, I like the S7's all-black home button. Water resistance & fingerprint sensor are a very nice bonus.\n\nAnd in all aspects of performance, the S7 is the clear winner, basically doing everything better and quicker. The extra 16GB of storage is great.\n\nHad they made a variant that was essentially an S4 with all the S7 internals, that would be perfect to me. But since root was achieved, the S7 is my daily driver and the S4 is mothballed as a spare, so despite its shortcomings, the S7 is a worthy successor.", "time": "1st August 2016, 12:44 AM", "postID": "post67988259", "replies": []}, {"text": "I got white one with Spigen Crystal Shell. In addition I wear it in a leather belt purse for stronger protection. No screen protector ever used with S7 or any other phone before.\r\nI realized that flash and hart rate monitor cover is made of soft plastic and is VERY prone to scratches, so you gotta be very careful with it. I got fine micro scratches on it after day 2 or 3 and absolutely no clue what caused them.", "time": "1st August 2016, 06:58 PM", "postID": "post67999143", "replies": []}, {"text": "Well I was in love with my S7, until the rear camera lens/cover spontaneously decided to shatter.  I swear to god this phone has never been dropped, but somehow the clear cover for the rear camera broke.\n\nI've had the phone in a Spiegen case since day 1, and it's never been out of it.  When I was searching for repair parts, a lot of people seemed to suggest this was a common problem dating back to the S6 and S6E?\n\nEither way, great phone other than this weird flaw?", "time": "5th August 2016, 09:51 PM", "postID": "post68060510", "replies": []}, {"text": "Love the way it feels. Sadly i'm using a Lifeproof fre case so i don't get to feel the phone as much.", "time": "11th August 2016, 03:52 AM", "postID": "post68134416", "replies": []}, {"text": "How's everybody s7 holding up in terms of durability/falls? I have been reading a bit more and have read reports from falls at very low heights and even glass cracking from the heat. I wanted to make the s7 my next phone for a while but the sense im getting is that it might not be as durable as my s5", "time": "31st August 2016, 10:59 PM", "postID": "post68468493", "replies": [{"text": "I would say go for a tempered glass protector if you are worried about the glass cracking. Also definitely get a case, as much as it feels better to use without a case, the back being glass as well makes me worried especially when I'm outside. Coming from the s5, the s7 feels much better in terms of build quality. Also, the sides can be dented if you are not careful and drop it easily.", "time": "4th September 2016, 05:07 PM", "postID": "post68526326", "replies": []}]}, {"text": "Good feeling and quality but back is huge fingerprint and very very soft.\n\r\nI'm very happy with this phone", "time": "2nd September 2016, 11:29 PM", "postID": "post68501334", "replies": []}, {"text": "Has anyone had a problem with the home button getting scratched up or the paint coming off? I was attaching a screen protector to mine and the sticky adhesive pieces used to align it where on the home button. When I removed it, the paint came up. Nothing I could have done to avoid this besides never put that stuff there in the first place.....I was following the directions. Looks like the paint isn't that good on the home button......", "time": "9th September 2016, 02:08 PM", "postID": "post68604095", "replies": []}, {"text": "The home button is awful. I have had the phone for a couple of months. Had it in a pocket with nothing else and when I removed it I discovered two deep scratches on it. There are plenty of web pages confirming that Samsung have not protected the home button properly. I emailed Samsung about this and I was told that it's cosmetic and not their problem. The rest of the phone feels premium but the home button is a real let down. I have been looking for a home button protector but they all seem to lose finger print capability. I had an S4 Mini before this phone which I had no problems with. I will definitely do more investigation in the future before trusting a brand based on previous experience. Don't get me wrong, I think the phone is great, camera is fantastic, screen is beautiful (though finding a screen protector for the 2.5D curved edge is proving an expensive exercise) but I would have looked elsewhere had I waited a while after release to discover this glaring flaw in an otherwise excellent phone.", "time": "10th September 2016, 07:59 PM", "postID": "post68624319", "replies": [{"text": "Agree, the home botton isnt great in any way. \n\r\nI just got myself a Spigen Rugged Armor Case. I can realy recommend this case! It's probably the best looking case i have seen on a phone.", "time": "15th September 2016, 12:25 PM", "postID": "post68699055", "replies": []}]}]}, {"title": "Ergonomics (in-hand feel)", "rating": 4.0, "links": ["https://forum.xda-developers.com/galaxy-s7/review/ergonomics-hand-feel-t3330757", "https://forum.xda-developers.com/galaxy-s7/review/ergonomics-hand-feel-t3330757/page2"], "threads": [{"text": "Depends on the case.....", "time": "7th March 2016, 11:46 PM", "postID": "post65711134", "replies": []}, {"text": "I am a big guy with big hands, but have always preferred a small phone. With my s7 (flat) and the thin fir spigen case on it I really have zero complaints. In fact I think it is about the most comfortable phone to 1 handed surf on I have ever had.", "time": "8th March 2016, 03:33 AM", "postID": "post65713202", "replies": []}, {"text": "Have to say glad i didnt go to N6p route.  Its perfect size.", "time": "8th March 2016, 07:43 AM", "postID": "post65715626", "replies": []}, {"text": "Too slippery. Bought the OEM clear cover because of that. Its also slippery but makes the overall feel a bit better + i can place it to table or slide it with no fear scratching it.", "time": "8th March 2016, 02:02 PM", "postID": "post65720361", "replies": []}, {"text": "Feels a lot nicer than the S6 in hand!", "time": "8th March 2016, 08:25 PM", "postID": "post65726909", "replies": []}, {"text": "I miss the menu button!\nSome apps do not have an on screen menu button, so the device needs one.\n\n(I rooted, so I could use a rebutton to make a long-click home the menu. And, no, the long-press back won't work with every app!!)", "time": "9th May 2016, 02:32 PM", "postID": "post66768727", "replies": []}, {"text": "it's kind of an impossible question. Everyone's hands are different. I can palm a basketball with long fingers on a comparatively smaller palm, so I can navigate damn near any phone short of 6\" single-handedly with ease. And even then, the Huawei Nexus 6P I can use one-handed fairly easily. But the Moto Nexus 6, not so much. But I still do prefer the smaller phones for pocket comfort, as I dislike belt clips and holsters. So I chose the S7 over the Edge. And I honestly LOVE it. No problems whatsoever with the size in my hand or pocket. I haven't put a case on it yet. Honestly, I don't want to, no for the sake of size, I just don't wanna cover this beauty up. But I will be buying a thin one for it shortly. Likely before the end of the day honestly", "time": "9th May 2016, 03:47 PM", "postID": "post66769784", "replies": []}, {"text": "I prefer on-screen buttons, especially when it leads to a smaller chin. I also dislike the back and menu buttons being opposite of what they are in the OS. I don't care for the glass back, either. Otherwise, the phone feels fine.", "time": "11th May 2016, 02:07 AM", "postID": "post66794468", "replies": []}, {"text": "I had a Note 5, but after a couple years of phablets I decided I wanted a normal sized phone, and the S7 is perfect. It really feels great, and I only use a case occasionally.", "time": "13th May 2016, 01:29 PM", "postID": "post66833017", "replies": []}, {"text": "Feel great but sometimes it is a bit slippery like all metal casing phones...", "time": "20th May 2016, 05:09 PM", "postID": "post66944482", "replies": []}, {"text": "It's extremely slippery, and I'm not a small sweaty hands kind of guy... But overall the best smartphone ever, so far. BTW the OP, LOL!", "time": "19th June 2016, 02:44 PM", "postID": "post67389864", "replies": []}, {"text": "I accidentally trigger icons/actions which are closer to the bottom of the screen and far out on both left and right. This is when I hold the phone and operate it with one hand. I've been a Nexus 5 user for two years (several Android phones before that), and the issue I'm having is simply because the screen on S7 is raised above the phone's edge and curved.", "time": "19th June 2016, 08:47 PM", "postID": "post67394664", "replies": [{"text": "same happens with me, not always though, very rare, but still a prob!", "time": "10th April 2017, 05:05 AM", "postID": "post71798226", "replies": []}]}, {"text": "Well, i always gotta be warned because phone is pretty slippery and display is expensive as hell, as well as it's back", "time": "7th October 2017, 10:19 PM", "postID": "post74073453", "replies": []}, {"text": "For me it feels quite great in hand. It's small and comfortable, because of the rounded glass at the back. It's a little slippery but it's the best phone i've ever used.", "time": "8th October 2017, 01:14 PM", "postID": "post74079677", "replies": []}, {"text": "The placement of the Back button in the lower right makes it awkward to operate the phone with only the right hand. You have to contort your right thumb, or slide the phone around, to reach the Back button, which I use more frequently than the application switcher button. Stock Android has the soft Back button to the left and the task switcher to the right, for good reason.\n\r\nAlso, the power key is too low on the right edge of the phone. S7 Edge had it at the right height.", "time": "20th October 2017, 01:00 AM", "postID": "post74224640", "replies": []}]}, {"title": "OEM skin/software", "rating": 3.5, "links": ["https://forum.xda-developers.com/galaxy-s7/review/oem-skin-software-t3330758"], "threads": [{"text": "Touchwiz is uglier than ever!! But with Themes. Just download marshmallow dark theme..  its even better than stock M", "time": "8th March 2016, 07:46 AM", "postID": "post65715652", "replies": [{"text": "what theme is that? screenshots?", "time": "15th March 2016, 02:37 PM", "postID": "post65852127", "replies": []}]}, {"text": "I assume he means material dark", "time": "16th March 2016, 03:30 AM", "postID": "post65863853", "replies": []}, {"text": "Yes.. Material dark.. There are a lot of \"black\" themes. I like the ones that use stock icons.", "time": "17th March 2016, 01:47 PM", "postID": "post65890181", "replies": []}, {"text": "I don't use TouchWiz. I never have, really. I'm using Smart Launcher Pro 3, but I did apply the Material Dark theme to the phone for the TouchWiz parts that are really visible.", "time": "25th April 2016, 12:45 AM", "postID": "post66531840", "replies": []}, {"text": "I hate Samsungs bloated Touchwiz. Free all the software!", "time": "27th March 2017, 12:17 PM", "postID": "post71607098", "replies": []}, {"text": "touchwiz is the best ui out there, its so simple and snappy!", "time": "10th April 2017, 05:10 AM", "postID": "post71798264", "replies": []}]}, {"title": "Outdoor visibility (max brightness)", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s7/review/outdoor-visibility-max-brightness-t3330759", "https://forum.xda-developers.com/galaxy-s7/review/outdoor-visibility-max-brightness-t3330759/page2"], "threads": [{"text": "I'm impressed with daylight visibility. 75% brightness is plenty.", "time": "25th April 2016, 12:48 AM", "postID": "post66531856", "replies": [{"text": "I tend to find the auto-brightness is too bright in many situations, including outside under the noonday sun.", "time": "23rd May 2016, 01:20 AM", "postID": "post66979809", "replies": []}]}, {"text": "My older Samsung Galaxy S5 is much brighter.", "time": "1st May 2016, 03:31 PM", "postID": "post66640495", "replies": []}, {"text": "Just Excellent, even in full sunlight the screen remains legible. Very impressive compared to other phones I've used.", "time": "1st May 2016, 04:40 PM", "postID": "post66641413", "replies": []}, {"text": "Any of you with a Note 5 been able to confirm the suggestion by some on YouTube that say the Note 5 is brighter than the S7/Edge?", "time": "3rd May 2016, 05:40 AM", "postID": "post66669473", "replies": [{"text": "I currently own a note 5 is does get really bright and no issue outside but never used a s7 before", "time": "3rd May 2016, 04:16 PM", "postID": "post66676395", "replies": []}]}, {"text": "This is actually a perk that made me reconsider this over the HTC 10.  The brightness outside is phenomenal on this device.", "time": "25th May 2016, 02:18 PM", "postID": "post67019403", "replies": []}, {"text": "Despite the low-ish brightness output I'm pleasantly surprised with this", "time": "24th January 2017, 12:57 AM", "postID": "post70697615", "replies": []}, {"text": "Superb here in sunny Los Angeles. My secondary is a Note3 with Phronesis Note7 MM port, and the \"Outdoor Mode\" in the Display settings is just ridiculous bright. I do notice the absence of this feature in stock S7 firmware. Fantastic nonetheless!!!", "time": "24th January 2017, 08:02 AM", "postID": "post70701103", "replies": []}, {"text": "dreaded pink line down side of screen now becoming annoying", "time": "2nd February 2017, 09:12 PM", "postID": "post70852163", "replies": []}, {"text": "When I'm outdoor in extreme sunlight the phone's brightness goes all the way up and then it enters a mode where colours seems washed out.  But only if the light is very strong. Does your S7 behave the same?", "time": "2nd May 2017, 01:04 PM", "postID": "post72129831", "replies": [{"text": "Shine a torch at the light sensor and it'll do the same", "time": "2nd May 2017, 06:46 PM", "postID": "post72134538", "replies": [{"text": "Yes, i know, i tried and you are right: it does the same. But is this normal? Does yours do the same?", "time": "3rd May 2017, 06:41 AM", "postID": "post72140619", "replies": [{"text": "Of course, it is the extra brightness setting for bright sun readability \n\nMy S5 did it too", "time": "3rd May 2017, 10:01 AM", "postID": "post72142384", "replies": []}]}]}]}, {"text": "It's outstanding", "time": "22nd May 2017, 05:54 PM", "postID": "post72391302", "replies": []}]}, {"title": "Contrast (true blacks)", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s7/review/contrast-true-blacks-t3330760"], "threads": [{"text": "Very good.", "time": "26th March 2017, 10:40 PM", "postID": "post71601162", "replies": []}, {"text": "Perfect contrast (as you'd expect from an AMOLED panel)", "time": "9th July 2017, 02:54 PM", "postID": "post72963645", "replies": []}, {"text": "5 stars is an only option because it's OLED technology screen means black = black not any of grey hue.", "time": "10th July 2017, 12:15 PM", "postID": "post72973649", "replies": []}]}, {"title": "Color saturation & accuracy", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s7/review/color-saturation-accuracy-t3330761", "https://forum.xda-developers.com/galaxy-s7/review/color-saturation-accuracy-t3330761/page2"], "threads": [{"text": "Love the phone but the display has a strong blue tint. The white is OK only when looking perpendicular at the phone, anything more than 5 degrees angle and it's getting a blue tint. \nNot sure if it's worth replacing whit a new one, I compared mine with some others in stores and all are about the same. Only the edge has better colors at angles.", "time": "24th March 2016, 05:58 AM", "postID": "post66007734", "replies": [{"text": "I aggree with you about the blue tint . In my phone is also visible but not that strong.\nBut in general it has the best display i ever saw in a phone!", "time": "25th March 2016, 12:30 AM", "postID": "post66022262", "replies": []}]}, {"text": "I don't know what you all are talking about because when I was shooting a video outside the colors on my screen were so close to the actual colors of the things I was recording that it was crazy. Closer then any other phone I have ever used. Period. Not commenting on the rest of the stuff, but I was impressed with that", "time": "25th March 2016, 03:55 AM", "postID": "post66024141", "replies": []}, {"text": "Just open Google page in your browser then look at it perpendicular and increase the angle slowly. Mine is getting blue tint pretty fast.", "time": "25th March 2016, 05:54 AM", "postID": "post66025015", "replies": []}, {"text": "Color saturation and accuracy are good and can be adjusted in the display settings, the only minor problem I have is color shifting when tilting the phone more than 20 degrees like the problem stated above. When it comes to screen uniformity on white and grey? Well I have been through 2 unit replacements before I finally got a uniformed screen without the pink tint on some part of the screen when viewing whites and greys.", "time": "25th March 2016, 02:49 PM", "postID": "post66030782", "replies": [{"text": "Does your white get a blue tint at angles ? I see it on mine everywhere, on icons, text, etc. It's uniform but annoying.", "time": "25th March 2016, 09:31 PM", "postID": "post66036691", "replies": []}]}, {"text": "It varies from phone to phone so it isn't something that is going to be standardized across all phones.", "time": "25th March 2016, 05:35 PM", "postID": "post66033348", "replies": []}, {"text": "I tried to capture how are my colours. Photos taken with an nexus 5. Look at that orange... That was supposed to be red. That is how I see the red when I look perpendicular on the phone. Photo is taken at an angle because perpendicular shots show both phones red, not true. \nThe white is blue tinted at angle on s7, less intense white / grey on angle ( not pink ) on g4. \nThe s7 is in the box, I'll exchange it tomorow. I found one on display in another store and it had perfect collors at all angles, to bad it's not my store. If the next one has issues I'll ask for the money and buy from that other place. \nEverything else was perfect on this phone, damn amoled lottery \n9h sot, perfect Wi-Fi and gsm signal; the audio is mediocre at best, but I could live with that.", "time": "26th March 2016, 06:18 PM", "postID": "post66049880", "replies": []}, {"text": "The blue tint is a byproduct of having amoled screen.", "time": "27th March 2016, 01:58 AM", "postID": "post66055201", "replies": []}, {"text": "Not like it is on mine. I compared it with other s7's, one was about as bad and the other was perfect. On mine it's impossible to use the phone 5 minutes and not notice. Just tilting the phone a little (<5°) and the blue is visible. Normally the blue appears at much bigger angles, and I'm ok with that. \nAnyways, no excuse for that \" red. \"", "time": "27th March 2016, 04:25 AM", "postID": "post66056349", "replies": []}, {"text": "On white screens my s7 has a warm tint when looking directly at it, but If I pan to the side or something it'll look crisp white.", "time": "27th March 2016, 07:17 AM", "postID": "post66057693", "replies": []}, {"text": "I got the new one today. It has the same bright orange for red but the white is a little better. I still see the blue tint but not as strong as the other one and starts at a bigger angle.", "time": "27th March 2016, 04:55 PM", "postID": "post66064256", "replies": []}, {"text": "Just yesterday evening I noticed display is not uniform, the top part is a bit pinkish when displaying white, and the bottom is a tad greenish/yellowish (it's barely noticeable).\n\r\nThere's a big problem though when showing grey/dark blue (like the settings menu when using the \"Material Dark\" theme ):\n\r\nAbout 1/3 of the screen (top part) is very dark compared to the much lighter bottom 2/3 of the screen.\n\r\nI'm gonna call warranty tomorrow and try to get a replacement, unfortunately Samsung's importer in my country don't have very good customer service so I'm afraid they won't agree to replace it.\n\r\n(btw I found a whole thread with ~100 pages on the S6 with the exam same problem I'm experiencing).", "time": "16th April 2016, 12:26 PM", "postID": "post66391018", "replies": [{"text": "All I'm going to say is good luck getting one that's perfect. I was part of the s6 thread. People ended up getting worse units.", "time": "17th April 2016, 10:45 AM", "postID": "post66405679", "replies": []}]}, {"text": "Samsung's AMOLED has come a long way since the first generation and it is now really comparable to IPS (or even better)", "time": "20th May 2016, 05:10 PM", "postID": "post66944488", "replies": []}, {"text": "I would actually prefer the blue tint if ever, however mine has a yellowish tint (only on white) and it kind of annoys me.", "time": "16th July 2016, 06:26 PM", "postID": "post67773325", "replies": []}, {"text": "I find the LightManager app useful to adjust tint.\n\nhttps://play.google.com/store/apps/d...nager&hl=en_GB", "time": "16th July 2016, 09:29 PM", "postID": "post67775296", "replies": []}, {"text": "mine actually got very warm display, especially with 'basic' setup. Adaptive is much better, but the screen looks oversaturated.", "time": "30th July 2017, 02:57 AM", "postID": "post73221989", "replies": []}, {"text": "It has quite a strong pink tint when viewing perpendicular. The slightest tilt in any direction turns it into a light green tint.\nThe red test screen, seen from a 45deg angle shows orange as in the picture some posts before mine.\n\nLooks like the red OLEDs are quite unreliable. They seem to have a narrower angle than the blue and green ones. Compensation of this effect turns the units either into pink or blue tinted items. \n\nDifficult to deal with this behaviour as a sensitive photographers eye. Just ordered a second unit to compare it with.\nKind of longing back to my 4 year old lovely yellow warm tinted S4.", "time": "5th September 2017, 01:51 PM", "postID": "post73673683", "replies": []}]}, {"title": "Clarity/resolution", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s7/review/clarity-resolution-t3330762"], "threads": [{"text": "Its ****ing Awesome in qhd 😂 500 stars rating xD", "time": "23rd April 2017, 02:36 AM", "postID": "post71986684", "replies": []}]}, {"title": "Minimum brightness", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s7/review/minimum-brightness-t3330763"], "threads": [{"text": "Could be lower in my opinion.", "time": "27th March 2017, 12:16 PM", "postID": "post71607086", "replies": [{"text": "I am sometimes using this app, works fine.", "time": "27th March 2017, 04:00 PM", "postID": "post71609706", "replies": [{"text": "That sounds really great, I'll try it. Thank you! Didn't thought of this possibility", "time": "27th March 2017, 04:01 PM", "postID": "post71609730", "replies": []}]}]}]}, {"title": "Call quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s7/review/call-quality-t3330764"], "threads": [{"text": "For whatever reason its better than my note 5.", "time": "7th March 2016, 06:23 PM", "postID": "post65706083", "replies": []}, {"text": "I have zero complaints. Even kept a clear call in a place I was used to always dropping on my g4 (1 specific corner coming into my little rural town).", "time": "8th March 2016, 03:33 AM", "postID": "post65713215", "replies": []}, {"text": "Galaxy S7 Exynos version here.\n\nCall quality is really low & phone reception is really weak .......... talking in noisy place is really hard to handle by the S7 .\n\nI wasn't expecting such performance ......but it is maybe because of water proof stuff.\n\nduring a call there is an extra volume option but it is not helping specially if someone is working outside office.\n\nSamsung should fix that issue if it is fixable", "time": "15th May 2016, 11:54 AM", "postID": "post66860718", "replies": []}, {"text": "Good call with 4g, perfect audio", "time": "16th May 2016, 09:41 AM", "postID": "post66873880", "replies": []}, {"text": "I think it's still too loud in the lowest call volume.", "time": "4th June 2016, 04:55 PM", "postID": "post67168774", "replies": []}, {"text": "I have had my s7 for a few weeks and it has the worst cellular reception of any phone I have ever owned in my life.\n\r\nI have lived in the same place for 17 years and been on the same network for 10 years and have NEVER had a call fail to come through to me and never been unable to make a call - until I got this phone.\n\r\nThe reception where I live is pretty bad - on iphone for instance, I get 1-2 dots downstairs and 3 upstairs.\n\r\nNoticed a couple of weeks ago that I was getting alerts that I had voicemail. Most of my communication is via whatsapp etc using wifi, hadn't occurred to me to look at the cellular coverage, but when I did, I noticed that half the time, I have no signal at all. If I do get a signal and then pick the phone up, it usually vanishes. \n\r\nThe maximum I can get is 1 bar and even with that, if I call the phone, it goes straight through to VM.\n\r\nI bought two of these phones at the same time - one to give to my business partner when we meet later this month - so I tried using the second phone - and it is even worse!\n\r\nIn short, have used six different BlackBerries and three different iPhones (plus a cheap credit card size phone) and none of them have ever missed a single call in my house, however, have used two S7s in the same locations and same network and can confirm they are almost unuseable.\n\r\nAnyone want to buy two nearly new S7s? would suit someone who does not want to be disturbed by people phoning them!", "time": "4th October 2016, 07:56 PM", "postID": "post68982026", "replies": []}, {"text": "When I am on a call, I can notice a constant hissing from the earspeaker. It's very faint and this is only noticeable in a quiet environment, either calling landlines and mobiles. In 2g is somehow lower. I have tried different cell towers and signal levels. Same result. The earspeaker is working well however, only this background noise that seems to start when a call is being established.", "time": "20th November 2016, 11:20 AM", "postID": "post69709174", "replies": []}, {"text": "No problems so far.", "time": "27th March 2017, 12:15 PM", "postID": "post71607073", "replies": []}]}, {"title": "WiFi strength, range, and throughput", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s7/review/wifi-strength-range-throughput-t3330765", "https://forum.xda-developers.com/galaxy-s7/review/wifi-strength-range-throughput-t3330765/page2"], "threads": [{"text": "Hello.  Have no wifi drops yet like my s4 on stock had.  Other than that can't tell anything else more specific at this time.....  \r\nBut I'd really really really like to know weekday the s7 wifi is rated for.....  think I read mimo for 867mb (?)   May be just me but I don't know why I'm having difficulty finding any real specific facts for S7 wifi specs.   Would like to know the s7 max wifi b4 I upgrade my router if needed.  Thank you.", "time": "26th March 2016, 01:32 AM", "postID": "post66039387", "replies": []}, {"text": "Here you go", "time": "27th March 2016, 08:11 AM", "postID": "post66058133", "replies": []}, {"text": "Here are some tests I did with my S7!", "time": "28th March 2016, 07:01 AM", "postID": "post66072710", "replies": []}, {"text": "Wifi connection is awesome at 5ghz.very stable no dropouts.", "time": "28th March 2016, 11:03 AM", "postID": "post66074896", "replies": []}, {"text": "Problem with the wifi on WPA(TKIP). Bad stability.", "time": "31st May 2016, 10:25 AM", "postID": "post67104166", "replies": []}, {"text": "Works perfect.", "time": "3rd June 2016, 12:24 PM", "postID": "post67150803", "replies": []}, {"text": "I can get the same speed as my desktop computer using wireless. My speed is 150mb/s.", "time": "6th June 2016, 12:50 AM", "postID": "post67188012", "replies": []}, {"text": "Range isn't as good as my S5.  Same spot in the house, I'll get 3 out of 4 bars of wifi strength whereas the S5 had all 4 out of 4 anywhere in the house.", "time": "13th July 2016, 12:11 AM", "postID": "post67719529", "replies": [{"text": "Same here.", "time": "13th July 2016, 04:01 AM", "postID": "post67721271", "replies": []}]}, {"text": "Wifi on S5 (901F) is better than on S7 (930F). Longer range and stability.", "time": "25th August 2016, 01:27 PM", "postID": "post68359153", "replies": []}, {"text": "Some timeouts on low signal, but generally very good.", "time": "27th March 2017, 12:15 PM", "postID": "post71607076", "replies": []}, {"text": "I have set wifi policy to go off when I lock the phone, but it stays always connected when I check it after hours. Any ideas? Wifi calling is set to off and nougat patch December installed", "time": "2nd February 2018, 12:05 AM", "postID": "post75415141", "replies": []}]}, {"title": "Cellular strength and throughput", "rating": 4.0, "links": ["https://forum.xda-developers.com/galaxy-s7/review/cellular-strength-throughput-t3330766"], "threads": [{"text": "In Hillsboro, OR", "time": "12th March 2016, 06:01 AM", "postID": "post65790634", "replies": []}, {"text": "honolulu hawaii, can barely get 15 download and always get double upload", "time": "12th March 2016, 08:38 AM", "postID": "post65792273", "replies": []}, {"text": "Luleå, Sweden\n\r\nA bit faster with TCP Reno. Bic was around 80Mbps in.", "time": "12th March 2016, 03:06 PM", "postID": "post65797514", "replies": []}, {"text": "http://www.speedtest.net/my-result/a/1797685431\n\nTelstra Melbourne, Australia", "time": "12th March 2016, 09:12 PM", "postID": "post65803198", "replies": []}, {"text": "Vodafone Romania \nTest in Bucharest.", "time": "12th July 2016, 07:53 PM", "postID": "post67716731", "replies": []}, {"text": "43mb down\n19mb up\n61ms latency to Dallas 2 server on speedof.me", "time": "13th July 2016, 12:08 AM", "postID": "post67719502", "replies": []}, {"text": "New test  \nBucharest, Romania by Vodafone.", "time": "13th July 2016, 09:29 AM", "postID": "post67723903", "replies": []}, {"text": "Some timeouts when having lot LTE signal, but generally very good.", "time": "27th March 2017, 12:14 PM", "postID": "post71607067", "replies": []}, {"text": "I'm disappointed. Few dropped calls with \"Missed call\" SMS after few minutes, on Nougat.\nFound many complaining people on Russian forums.... \nYes, they found a solution. Flashing modem from MM via Odin, but no OTA updates until original modem is reflashed.", "time": "20th April 2017, 03:42 PM", "postID": "post71947876", "replies": []}]}, {"title": "Speakerphone (loudness, clarity)", "rating": 3.5, "links": ["https://forum.xda-developers.com/galaxy-s7/review/speakerphone-loudness-clarity-t3330767"], "threads": [{"text": "S5 (901F) is louder, but S7 (930F) is clearer.", "time": "25th August 2016, 01:34 PM", "postID": "post68359243", "replies": []}, {"text": "No section for overall audio quality / headphones etc?\n\nNot impressed with the audio quality from the S7, with the supplied S7 headphones and with my S5s headphones, the audio has a lot less bass and depth than the S5, I was expecting an improvement but instead it sounds pretty tinny and trebley \n\nThere is an equalizer and other audio tweaks but they don't improve it\n\nEDIT - Scrub the above, decided to have a play with the 'Adapt sound' setting, set it to 'personalised', everything sounds a lot better now, bass is back too", "time": "9th October 2016, 10:50 PM", "postID": "post69053209", "replies": []}, {"text": "Speakers are loud and crisp, but due to the IP68 not that clear in my opinion. Vibration is also very strong on this phone..", "time": "27th March 2017, 12:14 PM", "postID": "post71607058", "replies": []}, {"text": "With Dual Speaker Mod.. it is amazing so... 5 stars!", "time": "16th April 2017, 07:20 PM", "postID": "post71888094", "replies": []}, {"text": "Duel speaker mode,dolby and change audio value to 93 and phone incredibly loud and clear.Startle **** out of you if my phone rings.So loud and crispt and people are amazed with excellent sound.Coupled with that ogutube 3.1 and download music you desired and s7 flat is awesome with excellent battery life,sean", "time": "17th April 2017, 11:08 PM", "postID": "post71904938", "replies": []}]}]