[{"title": "Overall love", "rating": 5.0, "links": ["https://forum.xda-developers.com/htc-u11/review/overall-love-t3699052", "https://forum.xda-developers.com/htc-u11/review/overall-love-t3699052/page2", "https://forum.xda-developers.com/htc-u11/review/overall-love-t3699052/page3"], "threads": [{"text": "I am not at all happy that I bought the HTC U11+.  Overall, this phone is a 7 out of 10 at best.  I am on T-Mobile and not happy.  I have been with HTC since 2009.  And was always impressed.  The last phone was the HTC One.  This U11+ is simply unreliable.  \nCalls: When I call people they are frequently unable to hear me on the first call.  Maybe they do hear me on the second call.  We do hear each other if they call me back.  \nGmail: Frequently, the gmail app does not load properly. It will give me a white screen.  I go out, and come back in, and we are fine.\nBattery: It lasts about 30 hours.  But I am not a heavy user, and do try to keep location turned off. \nSpeaker: Sometimes caller does not hear me via speaker phone.  \n\nT-Mo tech support said that this phone does not have LTE 1900.  Therefore I am operating on 4G 1900.  That is not T Mo's sweet spot.\n\nDid I complain enough?  I can give you a fresh one.  I came back to xda seeking root options, but I think it is a bit early for devs.  But they do always save the day.  So, only love for this community.", "time": "14th December 2017, 02:02 PM", "postID": "post74845057", "replies": [{"text": "I concur the Gmail bug. Also, the notifications drawer, in the home screen, takes several tries to come down when you pull it down from the centre of the screen. Finally, sometimes, the auto-brightness does not do its job with the brightness very low.\n\r\nApart from that, the rest is worthy it.", "time": "15th December 2017, 12:32 AM", "postID": "post74850335", "replies": []}, {"text": "Sorry to hear you are not enjoying the device. I was concerned about my mobile signal and speed so I downloaded LTE Discovery app. \n\nMy U11+ never shows that I am on LTE on the status bar. It always shows 4G. LTE Discovery app shows I am connected to band 4 LTE and speed test shows the same ball park up / down speeds as my Pixel here in SF.\n\nI like this phone ALOT but unsure if I will keep it for the long haul.", "time": "15th December 2017, 07:37 AM", "postID": "post74852788", "replies": []}]}, {"text": "I live in the UK and the phone works perfectly fine even though is the Hong Kong version. People in the US should know that this phone was not meant to be sold there.", "time": "15th December 2017, 01:11 PM", "postID": "post74855329", "replies": [{"text": "Agreed. I Live in Australia and purchased the Taiwan version. Works like a charm. Love this phone!", "time": "2nd January 2018, 05:49 AM", "postID": "post75044146", "replies": []}]}, {"text": "I am using Taiwan model of this phone on Tmobile in bay area and have none of the issues mentioned above by pklunavat. This phone has a score of 11 on 10 for me. Excellent phone in every regard. See my impressions/review thread: https://forum.xda-developers.com/htc...sodes-t3714841", "time": "18th December 2017, 08:58 PM", "postID": "post74889984", "replies": []}, {"text": "This is the best phone I have ever had. Better than the U11. It offers great performance, design and features.", "time": "26th December 2017, 01:43 PM", "postID": "post74967406", "replies": []}, {"text": "I love the Sound over Earphones  1++++++", "time": "27th December 2017, 03:58 PM", "postID": "post74980551", "replies": []}, {"text": "I'm loving this phone\n\nBrightness is good for me, night filter built in is nice to have\n\nEdge sense carousel is great, and I've had no problems as mentioned above\n\nHowever, I'm disappointed with the camera. It got really good reviews, but it seems that any shot with motion in it comes out blurry\n\nShots of buildings or landscapes are great, but when I try to take pictures of my kids, it's blurry. Apparently a lot of new smartphone manufacturers are concentrating on HDR processing rather than getting bigger sensors. A friend with an iPhone 8 has the same problem, as does another friend with the Pixel 2 XL.\n\nI'm trying the Google Camera Port on my U11+, hopefully it will show some improvement....", "time": "29th December 2017, 07:47 PM", "postID": "post75006509", "replies": []}, {"text": "Well, do I love it? I do like it a lot. I'm coming from the HTC 10 which I really loved but in the end the battery wasn't up to scratch anymore.\nThe U11+ is large, almost too large for my jeans pockets but that's not surprising, the phone dimensions were no secret. I got the hyped transparent black version and I like it but I think it's far overrated. Thanks to that ultra glossy glass back it's impossible to use the phone without a case, I'm using a cheap transparent flexible bumper thing which does the job.\nThe battery life is great, it easily does 48 hrs (without any optimisation other that disabling News Republic) and more (actually more than 72hrs over Christmas when I hadn't used it much) with the same usage pattern of my old 10 which lasted about 10 hrs in the end and one full day when it was new so this is surely a great improvement. The screen of the 10 is the better one I woould say, especially that purple tint when scrolling doesn't look nice, but it's sharp, bright and the colours are good.\nI haven't taken many photos but the few I took were at least as good as the already very good 10's camera. The earphones are amazing and so is the fingerprint scanner.\n\nI won't say that I love it but as mentioned before, I like it a lot. I'm still happy that I haven't bought the 5T instead out of impatience! It's also still early into the phone's life, there hopefully will be a few more tweaks and improvements over time.", "time": "3rd January 2018, 06:48 PM", "postID": "post75064557", "replies": []}, {"text": "Coming from galaxy S8. I can say this is the best device that I have ever had. Last HTC device I was using was htc m9.", "time": "5th January 2018, 04:52 PM", "postID": "post75089547", "replies": []}, {"text": "Used my U11+ for a week now and this is absolute a real good device, it's fast and design is perfect.", "time": "12th January 2018, 04:13 PM", "postID": "post75173855", "replies": []}, {"text": "Hi, coming from HTC 10. In my opinion, the HTC 10 was a good phone. But the HTC U11+ is absolutely thrilling me. Usually I rooted all my HTCs directly, so far I don't really have any desire to do that, because the device does everything I need.\n\r\nThe sound is great, the battery is excellent. The whole thing is completely stable and I personally find squeezing phenomenal, especially with Edge Sense Plus.", "time": "12th January 2018, 08:43 PM", "postID": "post75176689", "replies": []}, {"text": "I just returned my Pixel 2 XL for the annoying blue tint and pretty happy so far, not regretting at all.", "time": "20th January 2018, 10:02 PM", "postID": "post75274630", "replies": [{"text": "So while I'm considering the U11+ for its not so absurd price, you're telling me that you got from the Pixel 2 XL to this phone? Nice to know.", "time": "24th January 2018, 08:01 PM", "postID": "post75320795", "replies": [{"text": "I was originally intended to buy the U11+ since I heard the rumors about its existence and that it was meant to be the Pixel 2 XL, so I was curious about what kind of device was this.\n\r\nFor things of life, I finished buying the Pixel 2 XL with a nice discount like 3 weeks ago.\n\r\nSince the first time I turned on the device, I knew I was not going to be happy because of the screen and the annoying blue tint. I think people out there who diminished the problem is because they are not used to good screens or they are blind, and moreover, when they tell you \"I look the phone straight forward\", is bull5sh1t as well, because I faced plenty of situations when I couldn't see the phone straight forward and it was annoying.\n\r\nPeople can say you can have the best camera, the best software updates, unlimited space for photos and videos, no lag, etc, but let me tell you that all of those \"selling points\" for the Pixel are not that good:Best camera - Honestly, I made a photo comparison between the U11+ and the Pixel 2 XL, and in 7 of 10, the HTC was better and with more detail, text was more legible and forms were sharper. I think that HTC learned something after making every Pixel so far, but when I show the pictures, people just blame me and say I'm crazy. Video on Pixel was horrible and the audio extremely poor. The difference in aperture indeed makes a difference, even when it seems a small one.\nSoftware updates - Yes, you have them, but guess what?, it breaks compatibility sometimes with apps. With the Pixel 2 XL I had a lot of force close applications, so what's the point of having the latest release if Google is not obligating developers to update their applications timely?. Yes, 3 years of software updates, but honestly, who stays with the phone for 3 years?.\nPhotos and video - I don't use Google or any other storage service to have all my photos and videos. I'm old school, and I put everything is a hard drive. I think is safer, besides, I don't like that certain things of my private life are around in the internet.\n\r\nBut the screen is not the only issue, I faced a lot of other hardware and software issues along the way, and thanks to the extremely bad quality control from LG and Google, the device you are getting is overall mediocre quality. I was expecting to receive a device with no serious bugs and well built because it a phone directly from Google, but the reality is totally another one.\n\r\nOverall, I faced the following issues that made me return this phone:\r\nBlue tint\r\nSlow fingerprint sensor\r\nSuper slow \"fast\" charge (taking no less than 3 hours)\r\nBluetooth issues while streaming music\r\nProblems with Android Auto\r\nBanding while recording video\r\nAwful sound and video quality\n\r\nComing from the Mate 9 Pro, one of the finest devices I have ever had, was a big hit for me to change to the Pixel 2 XL because all of these issues. Each time I saw the screen, it just made me sad and made me wonder: why a €1K phone have these kind of issues?, and moreover, what kind of idiot am I to buy and accept something like this with all these flaws?. Google is not getting my money this year, and believe me when I say that I'm a Google fan, but quality and product overall is not in pair with what most flagships are offering.\n\r\nStill I see why people is buying and defending the Pixel, and in the moment I was packing it to return it, I felt bad, like if I was betraying Google or the ideology. At some moment I felt fear to return it and better keep it and accept the flaws, but that makes me no different from all the iSheeps you see out there that buy everything that comes with an Apple logo in the back, something that I clearly hate, because we are becoming zombies instead of intelligent consumers.\n\r\nI have the U11+ for a week now and I can say I feel home again, is like having my old Mate 9 Pro, but with Android stock, and I haven't faced any issues AT ALL, just perfect, smooth and awesome behaviour. I can highly recommend the device.\n\n\n\r\nP.D.: Sorry for the long post.", "time": "25th January 2018, 08:51 AM", "postID": "post75325704", "replies": []}]}]}, {"text": "I have been using the U11+ since December 21st and I love it. The phone is very fast, has a very good display and a great design. The only negative side is that it needs a bit more care when holding it in the hand not to fall.\nOverall, this is a great phone and it is the best HTC has ever made.", "time": "25th January 2018, 10:08 PM", "postID": "post75333403", "replies": []}, {"text": "Hi guys,\n\nDo you know if we get the full Oreo functionality and features?  I know about PIP which requires a subscription to Youtube, do we get anything else?  I read that Smart Text doesn't work in the U11 section...", "time": "25th January 2018, 10:40 PM", "postID": "post75333612", "replies": [{"text": "Smart Text is not working from me, and I didn't notice it until you mentioned it.\n\r\nPiP is working for me with maps in driving mode.\n\r\nBesides that, I haven't noticed much.", "time": "26th January 2018, 08:33 AM", "postID": "post75337233", "replies": []}, {"text": "Just tested, pip for YouTube doesn't work for me but that is probably I bcoz I do not have YouTube Red. \n\nPip works for Google Maps though. No idea what smart text is", "time": "26th January 2018, 10:11 AM", "postID": "post75338010", "replies": []}]}, {"text": "I was annoyed about PIP not working on YouTube until I discovered split screen multitasking which kind of gets around the problem, to a certain extent.\n\r\n- I actually thought that was an Oreo feature and was embarrassed to realised that it had been introduced with Nougat, but that I did not know, LOL.", "time": "26th January 2018, 03:12 PM", "postID": "post75340792", "replies": [{"text": "Try this: pip works\nhttp://iytbp.onlineyoutube.com/", "time": "26th January 2018, 03:48 PM", "postID": "post75341199", "replies": []}, {"text": "I have the black themed version, just installs as apk, use microg to enable login. Disable official app if you want to.", "time": "26th January 2018, 03:53 PM", "postID": "post75341248", "replies": []}]}, {"text": "Pip in action", "time": "26th January 2018, 03:57 PM", "postID": "post75341295", "replies": []}, {"text": "Just got my Translucent U11+ yesterday and I'm loving it! Upgraded from the regular U11", "time": "18th February 2018, 03:26 AM", "postID": "post75607454", "replies": []}]}, {"title": "Community development strength", "rating": 3.5, "links": ["https://forum.xda-developers.com/htc-u11/review/community-development-strength-t3699053"], "threads": []}, {"title": "Overall speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/htc-u11/review/overall-speed-t3699054"], "threads": [{"text": "Did anyone test the speed of the micro-sd card.  How fast is fast???\n\nTHX", "time": "5th December 2017, 04:02 PM", "postID": "post74745204", "replies": []}, {"text": "Faster than any phone I've ever owned.", "time": "3rd January 2018, 08:13 AM", "postID": "post75057763", "replies": []}, {"text": "Coming from the Nexus 6P, it's very fast! No complaints.", "time": "3rd January 2018, 02:40 PM", "postID": "post75061537", "replies": []}, {"text": "I have made a Benchmark with App \"A1 SD Benchmark\"\nThe result with an  SAMSUNG Evo Plus 128 GB is\nread 76,22MB/s\nwrite 38,08MB/s\nnot bad", "time": "14th January 2018, 09:36 AM", "postID": "post75192597", "replies": [{"text": "Same test with SanDisk MicroSDXC Extreme Pro 64GB.\r\nRead 79,5 MB/s\r\nWrite 64,01  MB/s", "time": "17th January 2018, 04:21 PM", "postID": "post75234196", "replies": []}]}]}, {"title": "App launch speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/htc-u11/review/app-launch-speed-t3699055"], "threads": []}, {"title": "Multitasking/RAM", "rating": 5.0, "links": ["https://forum.xda-developers.com/htc-u11/review/multitasking-ram-t3699056"], "threads": []}, {"title": "Scrolling smoothness", "rating": 5.0, "links": ["https://forum.xda-developers.com/htc-u11/review/scrolling-smoothness-t3699057"], "threads": []}, {"title": "Heat", "rating": 4.5, "links": ["https://forum.xda-developers.com/htc-u11/review/heat-t3699058"], "threads": []}, {"title": "Low light", "rating": 4.0, "links": ["https://forum.xda-developers.com/htc-u11/review/low-light-t3699059"], "threads": [{"text": "Too much noise in low light.\r\nMy one X9 feels better.", "time": "14th January 2018, 07:53 PM", "postID": "post75198937", "replies": [{"text": "Sadly I have to agree, low light pics do look more grainy than my old Nexus 6P", "time": "17th January 2018, 03:18 PM", "postID": "post75233459", "replies": []}, {"text": "Is normal to have noise at night, but comparing the shots with my Pixel 2 XL, this U11+ is superior in most of the situations, and I can only imagine about the aperture difference to explain this.", "time": "20th January 2018, 09:58 PM", "postID": "post75274591", "replies": []}]}]}, {"title": "Photo quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/htc-u11/review/photo-quality-t3699060", "https://forum.xda-developers.com/htc-u11/review/photo-quality-t3699060/page2"], "threads": [{"text": "Colour and exposure is good\n\nSharpness is poor for anything other than static objects\n\nI'm trying out the Google Camera Port to see if there's any improvement, but otherwise I'm really disappointed in the lack of sharpness when there is any movement involved", "time": "29th December 2017, 08:02 PM", "postID": "post75006654", "replies": [{"text": "Try using pro mode - sport", "time": "31st December 2017, 08:05 AM", "postID": "post75023139", "replies": []}]}, {"text": "Tried it just now, pictures come out far too grainy and dark, because of the high ISO to compensate high shutter speed\n\nI could adjust the settings, but I didn't want to get into the realm of adjusting all settings to take a quick snap", "time": "31st December 2017, 11:24 AM", "postID": "post75024768", "replies": []}, {"text": "In the exact situation the camera is great in a well lit situation but anything other than that I need the subject to be completely still.\n\r\nDisappointed I may send it back and get the Pixel 2 XL.", "time": "31st December 2017, 11:38 AM", "postID": "post75024902", "replies": []}, {"text": "I played around with my friends Pixel 2XL, tested side by side shots, it isn't much better at all\n\nThe Google Camera Port on the U11+ is better, but only slightly with respect to motion. \n\nIn my testing so far;\n\n- Less motion blur with Google Camera Port, but it's still there\n- Definitely better detail with the U11+ camera\n- Less blown out highlights with Google Camera Port\n- Quicker shutter speed with U11+ camera all round", "time": "31st December 2017, 06:18 PM", "postID": "post75029178", "replies": [{"text": "What is this port and where can I find it? \n\r\nIs it the one made by Mark Harman on the Play store?", "time": "1st January 2018, 01:15 PM", "postID": "post75036169", "replies": []}, {"text": "What's your verdict?", "time": "3rd January 2018, 04:43 PM", "postID": "post75063093", "replies": []}]}, {"text": "Hi, it's the port of the camera from the Pixel 2, you can find it here;\n\nhttps://www.xda-developers.com/googl...ra-hdr-ported/\n\nThere is a bug- it force closes in slow motion mode\n\nI've been using it more, and I've found that the Google Camera seems to have a kind of 'make- up' effect to people's skin. People's skin looks unnatural, almost too good. It doesn't look BAD on the HTC camera, it just looks real\n\nPlease let me know how you get on", "time": "1st January 2018, 10:35 PM", "postID": "post75041572", "replies": []}, {"text": "I'm using a new version now, the one with added portrait mode\n\nCheck this out\n\nhttps://www.xda-developers.com/pixel...-android-oreo/\n\nhttps://forum.xda-developers.com/mi-...591177/page162\n\nI'm using v1.3\n\nLimited testing so far, but portrait mode works great\n\nDetail is better than the port I was using before, and as before there are less blown out highlights then the U11+ camera", "time": "3rd January 2018, 06:33 PM", "postID": "post75064372", "replies": []}, {"text": "Very good especially for a smartphone. Shot using Stock camera app in pro mode for DNG, processed on PC https://photos.app.goo.gl/bJCCjiUbrisyCs6J3", "time": "29th January 2018, 02:06 AM", "postID": "post75367320", "replies": []}]}, {"title": "Video quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/htc-u11/review/video-quality-t3699061"], "threads": []}, {"title": "Selfie quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/htc-u11/review/selfie-quality-t3699062"], "threads": []}, {"title": "Time to take picture (camera launch speed)", "rating": 5.0, "links": ["https://forum.xda-developers.com/htc-u11/review/time-to-picture-camera-launch-speed-t3699063"], "threads": []}, {"title": "Software (ease of use, features, etc)", "rating": 4.0, "links": ["https://forum.xda-developers.com/htc-u11/review/software-ease-features-t3699064"], "threads": []}, {"title": "Charging speed", "rating": 3.0, "links": ["https://forum.xda-developers.com/htc-u11/review/charging-speed-t3699065"], "threads": [{"text": "It takes me about 3 to 3.5 hours to charge the U11+ from 0% to 100% using the original charger. This is in line with a review from Tweakers.net (Dutch techwebsite) who found in their standardized battery test that charging the U11+ took 3.5 hours.", "time": "19th January 2018, 12:31 PM", "postID": "post75256388", "replies": [{"text": "I'm sorry to totally disagree with you, and most probably you have a defective unit.\n\r\nMine takes a little bit more than an hour and a half, original cable and charger.", "time": "20th January 2018, 09:30 PM", "postID": "post75274369", "replies": []}, {"text": "Hi\n\r\nThat doesn't sound right either, for those times your phone is charging at standard speeds not fast charging.  When you are next plug in check the lockscreen and make sure 'charging rapidly' is displayed with the time it's going to take.", "time": "23rd January 2018, 09:03 AM", "postID": "post75302428", "replies": []}]}, {"text": "I think that mine takes a couple of hours to recharge and will measure it properly the next time I charge it up.\n\r\nI noticed an improvement in charging time using Volutz USB C cables (set of 5) and, in fact, when I went back to the standard lead I got a message that my phone was charging more slowly than usual.\n\r\nI bought another charger as a spare, a Spigen, which I also highly recommend.\n\r\nI'm not allowed to post the links as I am a newbie, but both available on Amazon.", "time": "24th January 2018, 09:37 AM", "postID": "post75314744", "replies": []}, {"text": "Around one hour from 15% to full using both my stock charger and another old Nexus 5X charger.", "time": "24th January 2018, 02:47 PM", "postID": "post75317749", "replies": []}]}, {"title": "Screen on time", "rating": 4.5, "links": ["https://forum.xda-developers.com/htc-u11/review/screen-time-t3699066", "https://forum.xda-developers.com/htc-u11/review/screen-time-t3699066/page2", "https://forum.xda-developers.com/htc-u11/review/screen-time-t3699066/page3", "https://forum.xda-developers.com/htc-u11/review/screen-time-t3699066/page5"], "threads": [{"text": "I get between 4 and 8 hours SOT, depending on usage. If I am a lot on the road, using LTE, then I get an SOT of around 4 hours (above it). If I am on WiFi, then it gets or exceeds 8 hours SOT. With a mixed usage I get around 5-6 hours.", "time": "26th December 2017, 01:45 PM", "postID": "post74967432", "replies": []}, {"text": "I'm not getting as much sot as in was with the normal U11 having said that I've only had the device for 2days so see how it goes...", "time": "29th December 2017, 07:54 AM", "postID": "post74999415", "replies": [{"text": "Remember to disable News Republic and disable background data for Facebook. This helps a lot and gives your device at least 1 hour SOT more.", "time": "29th December 2017, 05:36 PM", "postID": "post75005061", "replies": []}]}, {"text": "Using 70% auto brightness, I get around 5 hours SOT over 24 hours on 4g/LTE nothing special", "time": "29th December 2017, 05:41 PM", "postID": "post75005127", "replies": [{"text": "On Wi-Fi it is much better. Expect 7-8 hours SOT", "time": "29th December 2017, 07:05 PM", "postID": "post75006047", "replies": []}]}, {"text": "With the battery size i was expecting similar results to the mate 10 and mate 10 pro but looks like its not the case", "time": "1st January 2018, 12:07 PM", "postID": "post75035619", "replies": []}, {"text": "Standby time is terrible, have disable the always on display, wifi, removed news republic and more bloatware included by htc and in 8h lost around 15% battery.", "time": "2nd January 2018, 08:12 PM", "postID": "post75052511", "replies": []}, {"text": "Terrible? No not here. This battery is great. I have problems getting it empty. And I use my phone a lot. Aod is on by contact. Auto brightness, wifi on.", "time": "3rd January 2018, 08:17 AM", "postID": "post75057799", "replies": [{"text": "which OS version are you on? is it the Taiwan model?", "time": "3rd January 2018, 09:23 AM", "postID": "post75058299", "replies": []}]}, {"text": "Any other tips for battery life, I'm getting around 5h SOT that's with auto brightness off and brightness set to around 40% or lower, disabled background data for fb, insta etc..., Bluetooth scanning off, wifi on, disabled news republic and other bloatware. \n\nHave to say I was expecting more so bit disappointed.", "time": "3rd January 2018, 09:29 AM", "postID": "post75058349", "replies": [{"text": "Oddly enough, my battery has improved by not disabling everything I do not use. I have uninstalled/disabled apps I do not use, but I have not touched background data or run in background settings at all.\n\nOn 4G battery could be better but on WI-FI I am satisfied. 1.5 days usage or 2 days days if its light usage. I did factory reset though and I still think the software can be optimised more.", "time": "3rd January 2018, 10:51 AM", "postID": "post75059112", "replies": []}]}, {"text": "After cleaning cache and data from home sense, my battery improved alot. Home sense was using around 29% (805mah), changed for Nova launcher and it was the same. The only thing common on both was a theme for navbar.", "time": "4th January 2018, 07:36 AM", "postID": "post75070594", "replies": []}, {"text": "In developer options I have turned off always on mobile data as it appears to be an Oreo default. I've noticed a difference with that.", "time": "4th January 2018, 12:13 PM", "postID": "post75072976", "replies": []}, {"text": "Battery life is unreal on this phone!!\n\r\nCurrently 7hrs 23mins screen on time and 1d 8hrs since last charge.....8% left so got a bit more in it....lovvvvve it", "time": "5th January 2018, 01:23 AM", "postID": "post75081179", "replies": []}, {"text": "Very happy with the battery life..", "time": "5th January 2018, 04:54 PM", "postID": "post75089570", "replies": []}, {"text": "I'm only losing 2% overnight on WiFi or 4g. Love this battery 😃", "time": "5th January 2018, 07:55 PM", "postID": "post75091597", "replies": []}, {"text": "After the first full charge, 25% remaining with already 6h SOT", "time": "8th January 2018, 10:01 AM", "postID": "post75121772", "replies": []}, {"text": "I have to agree that battery is really good with this phone:", "time": "20th January 2018, 09:30 PM", "postID": "post75274377", "replies": [{"text": "Hello, I'm curious, what apps did you use when you reached 12 hours of screen on time ?\r\nI barely get to 6h. Thanks", "time": "27th February 2018, 11:23 AM", "postID": "post75712503", "replies": [{"text": "YouTube, Kiosco, Chrome and WhatsApp mostly; no games. I was on WiFi.", "time": "27th February 2018, 01:10 PM", "postID": "post75713431", "replies": [{"text": "That could explain it. Thanks.\r\nI am half the time on not so good 4G signal, and do play a few games.", "time": "27th February 2018, 09:10 PM", "postID": "post75718224", "replies": [{"text": "Usually when I go mixed usage between Wi-Fi and 4G, I can get around 7-8 hours at least over 2 days.\n\r\nPhone has really good consumptions and stand by time is also on point.", "time": "28th February 2018, 09:36 AM", "postID": "post75722875", "replies": []}]}]}]}]}, {"text": "I have to say that my battery never reached such high SoT.... The max I got was 4-5 hours of full day on WiFi. The weird thing is that Google Chrome used the most battery life by far each time (~30%). Anyone else had this problem?", "time": "1st February 2018, 10:20 AM", "postID": "post75406779", "replies": []}, {"text": "Oops... Double post...", "time": "1st February 2018, 11:39 AM", "postID": "post75407428", "replies": []}, {"text": "Yes, I can confirm that I have very similar SOT on my european U11+.\r\nUsually 8-10h SOT with about 30% brightness and about 70% usage on WiFi.\r\nMaximum I reached was 10.53h SOT, only on WiFi.", "time": "14th March 2018, 03:14 PM", "postID": "post75886950", "replies": [{"text": "Is that rooted or stock?\n\nI have a Pixel 2 XL which has decent battery life. If I push it on wifi i will get 9 hrs SOT. I don't see how the U11 plus can almost get 11 hrs SOT. It might have a bigger battery but the pixel is running best of Android will OLED panel. Nevertheless HTC have done a great job with the U11 PLUS. Credit where its due. I don't think i csn go to another phone after using the Pixel XL 2. \nI have used various phones LG 2, LG 4, SAMSUNG S4, NOTE 5, S7 EDGE,  NOTE 8, SONY XZ PREMIUM AND FINALLY THE PIXEL XL 2. MY FAVORITE TWO AEE PIXEL 2 XL AND XZ PREMIUM.\nBoth devices have been lag free with nice battery life. The screen on the sony xz premium is the best I have seen absolutely stunning. The pixel is very smooth and a joy to use", "time": "16th March 2018, 12:14 PM", "postID": "post75908483", "replies": []}]}, {"text": "Stock Oreo.\r\nBelow screens made this night. \nhttps://zapodaj.net/c4f111e8e27f5.png.html\nhttps://zapodaj.net/6933e509597ee.png.html", "time": "16th March 2018, 01:33 PM", "postID": "post75909214", "replies": [{"text": "Woow thats great result. Didn't expect that much especially on a LCD panel. Comes pretty close to the Mate 10 pro. Advantages of the Mate 10 pro are OLED screen and a more efficient SOC. Nevertheless this is excellent screen on time as most phones don't even come close to this.", "time": "21st March 2018, 06:49 AM", "postID": "post75962881", "replies": []}]}]}, {"title": "Standby drain", "rating": 5.0, "links": ["https://forum.xda-developers.com/htc-u11/review/standby-drain-t3699067", "https://forum.xda-developers.com/htc-u11/review/standby-drain-t3699067/page2"], "threads": [{"text": "I have terrible standby drain, basically the phone never truly sleeps, it is kept awake on a low CPU frequency by Kernel (Android OS).\nThis is what I see in GSam, and I lose 20% battery over one night (8 hours).\nThis is why my battery life is somewhat 4 h SOT over 24 hours.\nAnd I think this device should be capable of double that, maybe 7 h SOT over 24 hours.\nAnybody else see this king of behaviour ?", "time": "16th February 2018, 01:43 PM", "postID": "post75589354", "replies": [{"text": "Is a known issue and HTC is already working on it.\n\r\nSo far, they recommend to reboot the phone every 1-2 days to prevent this.", "time": "17th February 2018, 07:20 PM", "postID": "post75604349", "replies": []}]}, {"text": "I had same problem with my U11+\nI reset application preferences and now the smartphone seems to go into deep sleep (Doze)", "time": "16th February 2018, 02:39 PM", "postID": "post75589951", "replies": []}, {"text": "Had pretty bad standby battery drain recently on my U11+ and did 2 things that seemed to have fixed it. \n1) Cleared cache on HTC Doze\n2) Ram Boost+ for the first time and then enabled Smart Boost\n\nDid these ard 12hrs ago and standby drain seemed to have improved a lot. Will report in a few days to let you guys know if it's really fixed for me or not.", "time": "17th February 2018, 03:57 AM", "postID": "post75596294", "replies": []}, {"text": "Reboot everyday  !?!\nIt's a boring solution... and not the solution for my problem.", "time": "17th February 2018, 11:00 PM", "postID": "post75606005", "replies": [{"text": "It is the workaround HTC recommended until they release the update with the fix.", "time": "18th February 2018, 01:00 PM", "postID": "post75611557", "replies": []}]}, {"text": "I'm not having any standby drain even without rebooting my phone.", "time": "18th February 2018, 05:45 PM", "postID": "post75614626", "replies": [{"text": "You have 3,5 hours of SOT from 29% battery ?, and with 11 hours off the carger.\r\nAt this rate you will get more that 10 hours of SOT.\r\nThis seems almost unreal to me... I don't even have half of that, with medium use...\r\nPlease share more... settings, apps, how do you do it ?", "time": "19th February 2018, 08:32 AM", "postID": "post75620851", "replies": [{"text": "Yes i could,i already shared a screen shot in other thread ,plus the 2 last pages for info what i have disabled\nhttps://forum.xda-developers.com/sho...840&p=75594359", "time": "19th February 2018, 09:05 AM", "postID": "post75621062", "replies": []}]}]}, {"text": "This is my situation, with the last software update! 6 hours awake screen off!", "time": "19th February 2018, 01:28 PM", "postID": "post75623306", "replies": []}, {"text": "I've only disabled Bluetooth, so no more connection to Android Wear watch... Zero issues with sleep now, two full days easily done.", "time": "19th February 2018, 08:23 PM", "postID": "post75627618", "replies": []}]}, {"title": "Heavy use endurance", "rating": 4.5, "links": ["https://forum.xda-developers.com/htc-u11/review/heavy-endurance-t3699068"], "threads": []}, {"title": "Light use endurance", "rating": 3.5, "links": ["https://forum.xda-developers.com/htc-u11/review/light-endurance-t3699069"], "threads": []}, {"title": "\"Look\" of the device (aesthetics)", "rating": 5.0, "links": ["https://forum.xda-developers.com/htc-u11/review/look-device-aesthetics-t3699070"], "threads": []}, {"title": "Quality feel (use of materials)", "rating": 5.0, "links": ["https://forum.xda-developers.com/htc-u11/review/quality-feel-materials-t3699071"], "threads": []}, {"title": "Ergonomics (in-hand feel)", "rating": 5.0, "links": ["https://forum.xda-developers.com/htc-u11/review/ergonomics-hand-feel-t3699072"], "threads": []}, {"title": "OEM skin/software", "rating": 4.5, "links": ["https://forum.xda-developers.com/htc-u11/review/oem-skin-software-t3699073"], "threads": []}, {"title": "Outdoor visibility (max brightness)", "rating": 4.0, "links": ["https://forum.xda-developers.com/htc-u11/review/outdoor-visibility-max-brightness-t3699074", "https://forum.xda-developers.com/htc-u11/review/outdoor-visibility-max-brightness-t3699074/page2", "https://forum.xda-developers.com/htc-u11/review/outdoor-visibility-max-brightness-t3699074/page3", "https://forum.xda-developers.com/htc-u11/review/outdoor-visibility-max-brightness-t3699074/page9"], "threads": [{"text": "Interesting...\n\nDo you know wich is the max nits ?\n\nU11 was 528 nits I think", "time": "19th November 2017, 09:44 PM", "postID": "post74570260", "replies": [{"text": "No it was lees than 500.\nhttps://www.notebookcheck.net/HTC-U1....236922.0.html", "time": "20th November 2017, 03:29 AM", "postID": "post74572162", "replies": []}]}, {"text": "441 I think...", "time": "21st November 2017, 10:56 AM", "postID": "post74586103", "replies": []}, {"text": "How can this screen support HDR with less than 500 nits... lmao", "time": "21st November 2017, 11:28 AM", "postID": "post74586396", "replies": []}, {"text": "The u11+ screen is different from the u11. We don't know how many nits it has.", "time": "21st November 2017, 01:37 PM", "postID": "post74587552", "replies": []}, {"text": "It wont sell on this price tag", "time": "22nd November 2017, 12:06 AM", "postID": "post74593668", "replies": []}, {"text": "According to the GSMArena test (third page), the screen tops out at 300 nits...", "time": "27th November 2017, 10:42 PM", "postID": "post74660133", "replies": [{"text": "If the battery and display are as they say, the phone will be sent back lol.", "time": "28th November 2017, 02:42 AM", "postID": "post74661660", "replies": []}]}, {"text": "This is disappointing and epic tragic result if that true to all htc u11 plus device when release.\nI will return it immediately back to HTC.\n\nI can’t imagine HTC made such epic fail flagships device ever.\n\nHope review unit of gsmarena was faulty.\n\nAnd even battery life is completely disaster and totally unacceptable for almost 4000 battery capacity.\n\nIt’s lower than all device out there with 3000 it’s even worse than 2700 battery capacity of Sony XZ1.\n\nTotal unbelievable and frustrating.", "time": "28th November 2017, 06:43 AM", "postID": "post74663314", "replies": []}, {"text": "It´s imposible only 300 nits. So How this phone it´s going to support HDR video playback with this brightness? \nI think is imposible", "time": "28th November 2017, 03:50 PM", "postID": "post74668183", "replies": []}, {"text": "4 to 7 hours SOT is very good battery life.\nI imagine the 4 hours SOT is with LTE most of the case and high brightness level and 7 hours with most WiFi and lower brightness lever for example 40-50%\n\nWith my Galaxy S8 plus that’s the SOT I get so as I can see HTC has the same behavior and no problem.\n\nNow I’m having  one week now Huawei P10 and having 5 hours SOT per day mixed WiFi-LTE usage.\n\nSo judging from that the battery life for HTC is above average and on par with my previous S8 plus and current P10.", "time": "30th November 2017, 07:43 AM", "postID": "post74687076", "replies": []}, {"text": "Fear not... the gsm arena reviewer does post on the comments and his reply to someone yesterday was .... \n\"Hey,\n1. No you won't notice the low brightness. It's hard to explain, but the screen somehow looks brighter than it is, a few of our colleagues thought it had an above average brightness than our tools measures. So, no, I wouldn't be worried about this. Plus - the screen has great contrast and lovely colors, so I think you'll like it.\n2. The phone easily lasts at least a day, and even two days with a normal usage pattern - using the phone before and after work, lunch time, and before bedtime.\"\n\nPanic over?", "time": "1st December 2017, 06:26 AM", "postID": "post74697527", "replies": []}, {"text": "Hello guys,\r\nI will buy the htc u11+ from hong kong. It will work on Europe networks?\r\nThanks", "time": "11th December 2017, 09:52 PM", "postID": "post74814874", "replies": []}, {"text": "Guys i just received the device.. All set.. All perfect.. Just an issue with the screen.. The screen is not as clear as expected.. And the brightness must be also in full to be ok.. I dont mind to have it in max brightness.. But the issue is with the screen.. Is there any solution or that's the case??", "time": "17th December 2017, 06:16 PM", "postID": "post74878138", "replies": []}, {"text": "The main problem is with the brightness not the screen (colours etc). I need to have the phone to max brightness in order to be normal. Is there a reason for this?", "time": "20th December 2017, 10:26 AM", "postID": "post74906178", "replies": [{"text": "Something can't be right. Side by side with S8, the S8 is brighter and more saturated, but the U11+ is still bright. S8 in basic or amoled photo mode, colours look similar to U11+\n\r\nHTC Megathread, someone with S8 and U11 and U11+ did a comparison. Brightness is good and the display is better than the U11.\n\r\nDevcheck and AIDA64 do not show display manufacturer.", "time": "24th December 2017, 01:56 AM", "postID": "post74943837", "replies": [{"text": "I've pre ordered my U11+ from HTC Club and I can't check myself, but Devcheck should show the panel manufacturer under 'Hardware' section, under 'Screen size' (at least, with HTC 10 it was possible).\nI'm reading another Italian forum and I found some pictures with U11+ and Pixel 2XL in sunlight, HTC is less bright... Also U11 seems a bit brighter, but U11+ should have greeter viewing angles and a better black level.\nI hope that this panel is at least not worse than my current Zuk Z1\n\nInviato dal mio ZUK Z1 utilizzando Tapatalk", "time": "24th December 2017, 08:58 AM", "postID": "post74945762", "replies": []}]}]}, {"text": "I just got my unit yesterday evening and i can certify that the  display its owful!!! Max brightness its below average , looks greysh , and white looks kind of washed grey. I am so disappointed . If i compare the display with mate 10 Pro and Pixel 2 XL i simply wanna cry!!! I hope HTC will do something ,not even a cheap phone has such a poor display brightness!!!", "time": "23rd December 2017, 12:26 PM", "postID": "post74938189", "replies": [{"text": "Could you please check your display manufacturer? You can use 'AIDA64' or 'DevCheck Hardware and System Info' to find it out.\n\nHTC may have used two different manufacturers for the display (for M10 they were Sharp and Tianma) with slightly different brightness\n\nInviato dal mio ZUK Z1 utilizzando Tapatalk", "time": "23rd December 2017, 04:04 PM", "postID": "post74940020", "replies": []}]}, {"text": "With adaptive brightness on and around 50% setting it works well for me. I come from Oneplus One and this has a tone comparatively on the warmer side. I noticed that after 60% brightness the display suddenly becomes vivid and looks great when watching videos. Not sure what's going on, is there any battery saving algorithm going on or what.", "time": "26th March 2018, 07:41 PM", "postID": "post76026248", "replies": []}, {"text": "What you mean with adaptive brightness?Is that auto brightness or where can i find this setting?", "time": "26th March 2018, 07:57 PM", "postID": "post76026428", "replies": [{"text": "yeah, there are actually two settings:\r\n1. in the battery settings\r\n2. in the display settings\n\r\nboth do exactly the same thing.\n\r\non slightly different note, just started thinking that maybe brightness is intentionally lowered because of.... Pixel 2xl", "time": "26th March 2018, 09:58 PM", "postID": "post76027679", "replies": []}]}, {"text": "So both of this settings must be on?Is t that the same?\n\nPoslano z mojega HTC U11 plus z uporabo Tapatalk", "time": "26th March 2018, 10:20 PM", "postID": "post76027874", "replies": []}, {"text": "I compared U11+ to my old trusty M8 and it seemed to me that on max setting M8 is a little brighter. That said, just used it in the middle of a Mediterranean island in direct sunlight on a very clear day and had no trouble whatsoever seeing what's on the screen .", "time": "27th March 2018, 12:24 PM", "postID": "post76033372", "replies": []}, {"text": "Not possible to \"overwrite\" the settings to let the brightness go higher?", "time": "1st April 2018, 03:10 PM", "postID": "post76088391", "replies": []}]}, {"title": "Contrast (true blacks)", "rating": 4.5, "links": ["https://forum.xda-developers.com/htc-u11/review/contrast-true-blacks-t3699075"], "threads": []}, {"title": "Color saturation & accuracy", "rating": 4.0, "links": ["https://forum.xda-developers.com/htc-u11/review/color-saturation-accuracy-t3699076", "https://forum.xda-developers.com/htc-u11/review/color-saturation-accuracy-t3699076/page2"], "threads": [{"text": "i have to say im really happy with my screen. No yellowish marks on the bottom, not pink tinge, not even that much back light bleed. I must be a lucky one or my eyes dont work properly!", "time": "29th December 2017, 01:38 PM", "postID": "post75002371", "replies": []}, {"text": "Just got mine today, no issues so far. screen is good, i can notice slightly that the edges are a bit darker but it doesnt bother me.", "time": "29th December 2017, 03:02 PM", "postID": "post75003273", "replies": []}, {"text": "No problem at all here. U11 Is brighter. But the U11+ looks sharper and more realistic. That said. Blacks are very deep for a lcd display.", "time": "3rd January 2018, 08:10 AM", "postID": "post75057742", "replies": []}]}, {"title": "Clarity/resolution", "rating": 5.0, "links": ["https://forum.xda-developers.com/htc-u11/review/clarity-resolution-t3699077"], "threads": []}, {"title": "Minimum brightness", "rating": 4.5, "links": ["https://forum.xda-developers.com/htc-u11/review/minimum-brightness-t3699078"], "threads": []}, {"title": "Call quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/htc-u11/review/call-quality-t3699079"], "threads": []}, {"title": "WiFi strength, range, and throughput", "rating": 4.5, "links": ["https://forum.xda-developers.com/htc-u11/review/wifi-strength-range-throughput-t3699080"], "threads": [{"text": "Give you 5 star for Wifi strength..", "time": "28th November 2017, 09:30 AM", "postID": "post74664590", "replies": []}, {"text": "U11+ has an excellent wifi range and throughput. I get around -71dBm signal strength) from my router at a spot where my HTC10 gives me -83dBm. At that spot, U11+ maxes out the internet traffic, whereas 10 is limited to about 45Mbps. So, anyone with HTC 10 will appreciate the huge jump in performance of wifi.\n\r\nAlso, the idling issue found with HTC 10's wifi is not there in U11+. It does not eat through battery while idling on wifi.", "time": "10th December 2017, 04:46 PM", "postID": "post74800254", "replies": []}]}, {"title": "Cellular strength and throughput", "rating": 4.0, "links": ["https://forum.xda-developers.com/htc-u11/review/cellular-strength-throughput-t3699081"], "threads": []}, {"title": "Speakerphone (loudness, clarity)", "rating": 5.0, "links": ["https://forum.xda-developers.com/htc-u11/review/speakerphone-loudness-clarity-t3699082"], "threads": [{"text": "It's definitely loud enough to use in the car with no distortion, loud enough to use during a shower too. Outside of noisy environments, max volume is generally too loud. That's a good thing probably.", "time": "4th December 2017, 11:33 PM", "postID": "post74738167", "replies": []}]}]