[{"title": "Overall love", "rating": 4.5, "links": ["https://forum.xda-developers.com/xperia-z5/review/overall-love-t3348499", "https://forum.xda-developers.com/xperia-z5/review/overall-love-t3348499/page2", "https://forum.xda-developers.com/xperia-z5/review/overall-love-t3348499/page3"], "threads": [{"text": "The best companion for me. Best cam, amazing audio, great gaming feel and the best fluidity", "time": "1st April 2016, 02:04 PM", "postID": "post66143952", "replies": []}, {"text": "And lack of development...no custom roms, no cust kernels.. Thats the only thing i dont like about z5", "time": "1st April 2016, 06:38 PM", "postID": "post66148213", "replies": [{"text": "The stock ROM is so good in this device, I would probably just stick with it. Unlike Samsung Galaxy phones which ruins the stock google experience, this one doesn't. It used to stutter and lag a lot on Lollipop, but after the Marshmallow update, 99% of the lag is gone.", "time": "1st April 2016, 10:47 PM", "postID": "post66151786", "replies": []}]}, {"text": "i love it pretty, powerfull and slick", "time": "3rd April 2016, 02:25 AM", "postID": "post66167448", "replies": []}, {"text": "Obviously it's the best phone i've ever owned, coming from a nexus 4 and a moto G.  Build quality, design, the beautiful screen, playstation exclusive features ( WHICH NO ONE EVER TALKS ABOUT FOR SOME REASON, EVEN THOUGH THEY'RE AWESOME???), the camera is great if you know how to utilize it, almost stock android experience. The only downer is the camera software, algorithm and the lack of full manual controls and RAW.", "time": "3rd April 2016, 02:11 PM", "postID": "post66173588", "replies": [{"text": "To be fair, and assuming you are talking about the remote play stuff, the reason people don't talk about this is that it's not exclusive really. Some clever people ripped it and modified the apks so they will work on pretty much any phone. Not only that, the modded version is actually better as it removes the WiFi requirement so you can use it over a good 4G connection too!\r\nStill awesome features, just not unique.", "time": "4th April 2016, 11:28 AM", "postID": "post66187264", "replies": []}]}, {"text": "I had this phone for a while before giving it to my mom and stick to my old Z1. \n\nCamera have very fast focus speed and good WB. Just need a better image processing software.\n\nStock Lolipop is buggy and very late Marshmallow update compare to other brand's 2015 flagship device. However, It's worth to wait because most of bugs were fixed.\n\nI love frosted glass at the back too, easier to keep it clean than a glossy one at Z1.", "time": "4th April 2016, 04:39 AM", "postID": "post66183435", "replies": []}, {"text": "The Z5 is great, the Marshmallow update has boosted it a lot, thats for sure.\nThe camera isn't that great when it's a little darker. (Black becomes purple/blueish?)\nThe front camera is terrible when its darker.\nMy overall experience is still 5/5 because the sound is great, it has a really good battery life, and it never freezes or random reboots.", "time": "4th April 2016, 01:03 PM", "postID": "post66188368", "replies": []}, {"text": "Great phone!", "time": "5th April 2016, 12:53 AM", "postID": "post66198432", "replies": []}, {"text": "I tried to make love to it. Now I have a sticky phone", "time": "5th April 2016, 09:10 AM", "postID": "post66202557", "replies": []}, {"text": "love it, but i hope there will be other CM or AOSP ROM so the phone could do more like Nexus 6P", "time": "10th April 2016, 04:03 PM", "postID": "post66290166", "replies": []}, {"text": "I love my z5, i love sony since the very beginning. (since sony ericsson)\nAnd like it or not, sony has the most stable android version, eventhough they are very slow at updates.\nIm pretty satisfied with sony.\n\nThe only bad thing is, how hard it is to root sony and do stuffs like that.\nSecurity and these stuffs make us harder to costumize our own phone.\n\nI know sony have their own reasons. But at least, give us the simple damn chance to root our phone without unlocking bootloader\n\nGesendet von meinem E6653 mit Tapatalk", "time": "27th April 2016, 09:28 AM", "postID": "post66568325", "replies": []}, {"text": "Absolutely love it!!! Moved from Z2 and it's the best phone I ever owned. Not sure why so many people have problems as I have not experienced any so far", "time": "27th April 2016, 01:54 PM", "postID": "post66571336", "replies": []}, {"text": "Sounds like a defective unit, return it immediately.", "time": "28th April 2016, 06:06 AM", "postID": "post66582540", "replies": []}, {"text": "Clearly I got a dud give the high ratings of this topic. The audio using Sony 5-pin headphones is ok but not great if you're after true HiFi clarity and audio detail. But trying to use third party standard pin headphones or line connections is a complete joke due to the phone not recognising the connection about 75% of the time and just spitting out hideous humming and buzzing noises. This was present from the word go and no method of cleaning inputs has helped. And the fingerprint sensor only works half the time with no rhyme or reason as to why it won't recognise the print. I have two Samsung devices and both have absolutely no issues whatsover.\n\nSo if this my lover, they'd be out the door with their bags trying to find a new home.", "time": "13th May 2016, 02:15 PM", "postID": "post66833619", "replies": []}, {"text": "The best smartphone I've ever had.\n\nEvery Sony I get is just better every time.", "time": "16th May 2016, 12:15 AM", "postID": "post66869583", "replies": []}, {"text": "It is one of the most beautiful devices currently! There are times when I'm looking at and admiring the device!", "time": "17th May 2016, 06:46 PM", "postID": "post66897097", "replies": []}, {"text": "Pretty dissapointed with this device after having it for less than 4 months and moving from LG G2 and HTC M8.\r\nProblems:\r\n- landscape/portrait orientation switching stops working after some time, reboot of the unit gets it back alive, temporarily (happens after Marshmellow update)\r\n- Yelow ghostly spots have started showing up on the upper left edge of the screen, most likely due to overheating (I'm using phone a lot )\r\n- Finally, few days ago when I rinsed my unit in clean, tap water, some of it entered the unit and made it's place under the screen, making upper left corner of the screen (water entered from headphone jack?) glowing like it has brighter spill...\n\r\nAll in all, I wille try to return this expensive piece of faulty electronics, but I guess they will not accept to give me some other device... \r\nSony was my first Android device, but now I'm confident that it's the last one as well...", "time": "27th June 2016, 08:58 PM", "postID": "post67508384", "replies": []}, {"text": "+ love the stock rom look\r\n+ Super Video recording image stabilization \r\n- Awful lag before starting video recording\r\n+ Great photos in good light \r\n- not so amazing purple & bluish tint in low light\r\n+ Great sound\r\n- Cheap headphones included \r\n- I miss glossy glass back \n\r\nOverall not so much impressed, but still a great phone.", "time": "10th July 2016, 01:36 AM", "postID": "post67676987", "replies": []}, {"text": "I have the green one and love it too much. Looks amazing,\r\nDisplay perfect,\r\nCamare great,\r\nHeadphone sound is perfect speakers are not that much good though it is stereo\r\nPerformans is great.\r\nBattery is good not amazing like Z2", "time": "28th August 2016, 01:27 PM", "postID": "post68410073", "replies": []}, {"text": "great design, great camera, great performance, in one package.", "time": "19th September 2017, 09:04 AM", "postID": "post73848445", "replies": []}, {"text": "Yes I was a Sony Fan, But this is the Mistake they Did, Z5 Is fail\r\nI am using Z5P, Unfortunately The Worst smartphone Experience.\r\nBuggy Stock Rom\r\nWorst Battery Management \r\nSad camera \r\nLow Developers", "time": "23rd September 2017, 03:56 PM", "postID": "post73903134", "replies": []}, {"text": "I love it, it has best design ever, better than the xzp's one in my opinion, the only thing I don't like is the snapdragon 810 built in it", "time": "1st April 2018, 05:52 PM", "postID": "post76089916", "replies": []}]}, {"title": "Community development strength", "rating": 3.0, "links": ["https://forum.xda-developers.com/xperia-z5/review/community-development-strength-t3348500"], "threads": [{"text": "We need some custom rom love for this device. Although I find Sony's take on Android to be less invasive than most others, there are some AOSP ROMs the Z5 could definitely use..", "time": "2nd April 2016, 02:21 PM", "postID": "post66158719", "replies": []}, {"text": "We need only existenz for z5 imo. Its stable,fast and have a lot cool features.", "time": "2nd April 2016, 05:48 PM", "postID": "post66161744", "replies": []}, {"text": "Too many hardware issues, overheating, giroscope, water resistance is nonexistant.", "time": "27th June 2016, 09:00 PM", "postID": "post67508400", "replies": [{"text": "What kind of hardware issues? Overheating can easily be fixed with software modification, personal experience. Gyroscope? Water resistance is not really an issue in regard to android development...", "time": "24th September 2016, 02:24 AM", "postID": "post68832568", "replies": []}]}]}, {"title": "Overall speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/xperia-z5/review/overall-speed-t3348501"], "threads": [{"text": "Since MM shows no lags, very responsive", "time": "5th April 2016, 12:54 AM", "postID": "post66198439", "replies": []}, {"text": "it's fast, but sometimes lag when opening the camera.. and very very very very very lag when using AR Effect", "time": "10th April 2016, 04:00 PM", "postID": "post66290123", "replies": []}, {"text": "No lags.\nOnly some camera problems.\nIve read somewhere that it is because the RAM. Need more RAM memory to open the camera faster.\nBut other than that, z5 is fast.\n\nGesendet von meinem E6653 mit Tapatalk", "time": "27th April 2016, 09:30 AM", "postID": "post66568349", "replies": []}, {"text": "Since 6.0 it is rather fast for me.", "time": "2nd May 2016, 09:20 PM", "postID": "post66664817", "replies": []}, {"text": "I have lag all over, unless I have just rebooted the phone, which is works fine for a few hours after i reboot, but then after that it heats up, battery drain, etc. my battery lasts maybe 6-8 hours with 1hr SOT. \n\nNot really good", "time": "6th June 2016, 07:02 PM", "postID": "post67198819", "replies": []}, {"text": "When I buy it in winter with little apps installed, it's very fast, but now It lags alot in summer, easy to over heat, sometimes I really want to brick it ...", "time": "8th June 2016, 11:20 PM", "postID": "post67233152", "replies": []}, {"text": "I have Z5 for 3 months yet.Before 2 days I imstall latest 224 update and my phone is fast just like that.Everything open in milisecond,swiching from apps is fast.Multitasking are great.Phone can keep up to 1gb in memory.I am very pleased using him.Its a liittle bit faster than Z2 which I also have.", "time": "10th June 2016, 03:19 AM", "postID": "post67250579", "replies": []}]}, {"title": "App launch speed", "rating": 4.0, "links": ["https://forum.xda-developers.com/xperia-z5/review/app-launch-speed-t3348502"], "threads": []}, {"title": "Multitasking/RAM", "rating": 4.5, "links": ["https://forum.xda-developers.com/xperia-z5/review/multitasking-ram-t3348503"], "threads": [{"text": "Power is not an issue in Z5, rather not so tuned rom... I think... Getting random freezes then restarts when multitasking, my gf Z2 has allso problems on 6.0.1. Freezes ocasional, does not restarts.", "time": "17th July 2016, 06:29 PM", "postID": "post67787045", "replies": []}]}, {"title": "Scrolling smoothness", "rating": 4.5, "links": ["https://forum.xda-developers.com/xperia-z5/review/scrolling-smoothness-t3348504"], "threads": []}, {"title": "Heat", "rating": 2.5, "links": ["https://forum.xda-developers.com/xperia-z5/review/heat-t3348505", "https://forum.xda-developers.com/xperia-z5/review/heat-t3348505/page2", "https://forum.xda-developers.com/xperia-z5/review/heat-t3348505/page3", "https://forum.xda-developers.com/xperia-z5/review/heat-t3348505/page6"], "threads": [{"text": "On Marshmallow update, overheating was improved but still jump to high temperature fastly due to powerful SoC.", "time": "31st March 2016, 05:29 PM", "postID": "post66130178", "replies": []}, {"text": "In brazil (+/- 30ºC / 86ºF ambient) the phone easily overheats when opens for a long time third party app camera (ex. snapchat) or heavy games (ex. gta sa)", "time": "2nd April 2016, 09:24 PM", "postID": "post66164744", "replies": []}, {"text": "on mexico in a city with normal temps of 30-35 on (sometimes winter) alost all year, or 45-50 in summer and i since have it since december it doesnt really over heat(jsut heat that much that you cant hold it)that much 4 to 6 times in all the time i have it", "time": "3rd April 2016, 02:29 AM", "postID": "post66167478", "replies": []}, {"text": "depending on the app used, I usually get 40-55 C from normal browsing and social media apps to extensive gaming like asphalt 8. I live in Philippines which usual temps are ranging from 28-35 degrees celsius. CPU Temp by mooncake is the app I use to monitor my temps.", "time": "3rd April 2016, 07:34 AM", "postID": "post66169528", "replies": []}, {"text": "45.3 °C max for me since MM in 3d gaming as reported by Battery Monitor Widget, 30°C in sleep mode avg", "time": "5th April 2016, 12:52 AM", "postID": "post66198417", "replies": []}, {"text": "My phone unusually heats up without any reason and battery drains like almost 20 % in standby in 1 hr.This doesnt happen everytime though,I checked if any background apps were running.But its normal like FB ,Whatsapp,Album etc,.The back side on top of the phone gets heated", "time": "17th April 2016, 02:48 PM", "postID": "post66408700", "replies": []}, {"text": "Rev 4 here no overheating or anything.Cooler than my Galaxy Note 4 and previous Z3", "time": "18th April 2016, 02:54 PM", "postID": "post66425056", "replies": []}, {"text": "İn turkey \n37-55C ıf ı play games be 60C and more  :/ ı think too hot", "time": "14th June 2016, 09:28 AM", "postID": "post67309984", "replies": []}, {"text": "A lot hotter than my Note 3 and OnePlus One, but it's bearable.", "time": "14th June 2016, 06:21 PM", "postID": "post67316636", "replies": []}, {"text": "the temps are fine. the same with my 6p.\nthe hottest S810 device I used was the M9 then the Oneplus2.\nthe 6p and the z5 is on par when it comes to heat. so good job sony.", "time": "15th June 2016, 05:30 AM", "postID": "post67323421", "replies": []}, {"text": "I'm planning on upgrading to a Xperia Z5 but this thread makes it come to my mind... does the XZ5 custom kernels have undervolt features? In my experience undervolting makes phones cooler. So is it possible with the z5?", "time": "17th June 2016, 05:02 PM", "postID": "post67363082", "replies": [{"text": "Short answer : no and the z5 doesnt need it. Long answer: The Z5 has AVS or auto voltage scaling(similar to the 6p) thus, it makes it very hard to implement undervolting. Androplus kernel used to have undervolting, but it was completely broken and does nothing to the voltages. AVS scales according to load and frequency. Therefore, if you are using your phone with very light use, it should not scale the voltage up and heat up the phone.", "time": "19th June 2016, 09:18 AM", "postID": "post67386435", "replies": []}]}, {"text": "Guys, thanks for those informations.\nI am about to get new phone and (untill now) Z5 was my first choice.\nI had Lumie 920 in the past and I did not like how hot it was getting.\nI do not play games however I browese web a lot,use FB, Spotify, etc... - will I have trouble with temp?\n\nI now own lumie 640 - it does not get hot and it has awesome battery life (even under W10m). As I need Android phone and Z5 has decent battery and camera I was thinking it might be a good swap... (plus waterproofing, etc). Not so sure anymore \n\nIs this the problem for Z5 Compact as well, do you know?", "time": "21st June 2016, 06:26 AM", "postID": "post67414812", "replies": [{"text": "My z5 heats up while charging, you can feel the top half of the phone starting to heat up. Today my z5 went crazy trying to watch a video on a site that works on my z3,m8. The whole phone froze and started burning it was weird, previous days I would notice it heat up doing daily things. You'll definitely notice heat if you haven't had issues before with a previous phone", "time": "21st June 2016, 11:13 PM", "postID": "post67427263", "replies": []}]}, {"text": "Lumia 920 was getting really, really hot.\nEspecially during navigation in a car. Screen on, software (Here Drive) running, charging on and sometimes sun through the windshield.\n\nDo you guys use Z5 in a car? Is it not turning off because it is too hot? That would be a bummer....", "time": "22nd June 2016, 06:00 AM", "postID": "post67430389", "replies": [{"text": "No problem in my car up to now.\nWe'll see this summer...", "time": "23rd June 2016, 06:12 AM", "postID": "post67445573", "replies": []}]}, {"text": "Ok, got Z5, id does get quite hot (yes, during navigation as well) but I can live with that.\nPlus I have it in see through cover so it does not feel as hot to touch. But to be honest I am not impressed. I was expecting it to be cooler.", "time": "27th June 2016, 07:18 AM", "postID": "post67499426", "replies": []}, {"text": "I use google map yesterday and charging in same time, my Z5 was so hot that it won't charge properly and continu to drop battery with a quick charger.", "time": "28th June 2016, 06:14 AM", "postID": "post67512892", "replies": []}, {"text": "I almost never get above 50 but it does feel pretty warm to the touch after a long period of use, even just browsing with poor signal. I think it's actually hotter after 6.0.1", "time": "29th June 2016, 01:35 AM", "postID": "post67525619", "replies": []}, {"text": "I just bought the z5P a week ago... in Saudi Arabia.... in the middle of a scorched summer (55C and rising next month) (-_-)\n\nmy only issue was with the camera overheating. \nI managed to resolve the video recording overheat issue by keeping it in (Full HD 30fps) and using the internal memory.\nAlso, I reduced the screen brightness down to minimum while recording. I recorded 30+ minutes without any issue\nI didn't test the 4K recording yet tho...\n\nOne more thing.... don't use Snapchat... snapchat is bad, Mkay. It blew up my LG G4 and pants rear pocket after keeping it running in the background! and when I used it with the z5 it almost did the same.\n\nHere's a screenshots from the phone with the temperature right after I stopped the recording", "time": "30th June 2016, 07:26 PM", "postID": "post67550222", "replies": []}, {"text": "My battery reaches about 40 - 46° when on heavy use while gaming (ex. playing Need for Speed No Limits for an hour or so... ) Then I leave it idle for a while and it cools down\n\r\nBtw my battery drains about 20% - 23%in an hour while playing, is that normal? (Playing NFS or any other high-graphic game)", "time": "2nd July 2016, 02:23 AM", "postID": "post67567743", "replies": []}, {"text": "Heats less than Z2, but then Z5 is better in gaming,  so this should count as improvement i think, couple of days my gf's z2 didn't allow capturing video anymore because of the awful heat outside,  my z5 managed to do it, when z2 cooled a bit it worked fine later on", "time": "10th July 2016, 01:20 AM", "postID": "post67676850", "replies": []}, {"text": "On the UK, in Winter, the Sony Xperia Z5 is a very useful device. It keeps us warm without turning on the fireplace. Haha\nHowever, in the summer, the camera is just like a hot barbecue, too hot (for me) to handle it, especially when records 4K video!\n\nP/S: Bought the Z5 Dual Sim on Nov, 2015", "time": "12th July 2016, 04:24 AM", "postID": "post67705956", "replies": [{"text": "i cannot agree more  i also sad that to my friends that i can warm my hands in winter and  cook some some eggs  in summer...i think xperia z5 is the only phone with that kind of ability.", "time": "13th July 2016, 02:37 PM", "postID": "post67727249", "replies": []}]}, {"text": "The problem with Sony's Xperia Z line of devices is that they use a \"Premium\" glass and metal sandwich construction.  With the glass panels acting as a insulator keeping the heat in the device and the metal frame acting like a heatsink draw heat away from the SOC.  This combination of materials used in a device's design is what makes it a very expensive handwarmer.  In fact all devices that have the same \"Premium\" construction suffer from the same overheating problem.", "time": "16th July 2016, 12:59 PM", "postID": "post67769441", "replies": [{"text": "A warm phone actually means a good thing, it means that the phone is properly dissipating heat. Some phones may feel cooler but the Z5 runs really cool(even when feeling warm) it runs from 45-60c over clocked which aren't high temps at all. In contrast, my mi3 and Redmi note 4g both felt cooler but were always pinned at 60c\n\n---------- Post added at 05:57 PM ---------- Previous post was at 05:56 PM ----------\n\n\n\r\nWhy don't you try out the Z3 or Z3+ ? Both could roast your own skin playing games.", "time": "19th July 2016, 05:57 PM", "postID": "post67816068", "replies": [{"text": "But it could also mean that your device is producing way too mucn heat and is having a problem dispersing it.", "time": "19th July 2016, 08:29 PM", "postID": "post67818117", "replies": []}]}]}, {"text": "I am quite perplexed at how 4k recording could heat up modern phones so much. For example my Z1 with 4k mod and same Mbit (55Mbit/s, steadyshot enabled to counter shakyness) at ambient temp of 25 celsius after 5 minutes battery was 40 and CPU was 60 degrees. CPU usage was about 70-80% across all 4 cores and the CPU never went above 1Ghz (goes upto 2,15GHz at full load). That is on the SD800. SD810 should be able to do the same with much less CPU usage thus it creates a question mark why it produces so much heat with what should be low to moderate workload.", "time": "20th July 2016, 11:18 PM", "postID": "post67835233", "replies": [{"text": "The reason why the SD810 is so hot is because of the rushed move to 64bit. The ARM cores don't play nicely with other parts of the SoC so it heats up more when doing certain workloads. This is even worse with kryo on the sd820, although no heat issues but several parts of the SD820 are partially broken(parts like the DAC). Also the architecture of krait is different from the big and little cores and as such CANNOT BE COMPARED TO EACH OTHER(the same load may not produce the same amount of heat)", "time": "21st July 2016, 03:25 AM", "postID": "post67837119", "replies": [{"text": "So in other words the SD800 beasts the SD810 and SD820 for stable 4k recording/encoding.", "time": "21st July 2016, 04:17 AM", "postID": "post67837447", "replies": []}]}]}, {"text": "Mine gets really hot sometimes, even when my phone isnt doing anything. It starts to burn my legs sometimes and then it just cuts out and restarts.", "time": "2nd October 2016, 10:09 PM", "postID": "post68956261", "replies": [{"text": "There's something very wrong with your phone", "time": "23rd October 2016, 09:36 AM", "postID": "post69264348", "replies": []}]}, {"text": "Unusable during summer here (+35c)", "time": "4th November 2016, 09:27 AM", "postID": "post69454358", "replies": [{"text": "What's your cpu and gpu temp", "time": "5th November 2016, 12:36 PM", "postID": "post69471221", "replies": [{"text": "Never bothered into measuring them, but doing some light multitasking will make it so hot that it will throttle to the point that I cannot type, so sometimes I had to put it in the freezer for a couple minutes...\r\nAlready sent it to service once assuming there was something wrong with it, but it came back in the same conditions. I guess this phone is not suitable for warm regions or hot summers, plan to get rid of it before next summer, winter is coming so the extra heat is \"welcome\" haha.", "time": "7th November 2016, 04:19 AM", "postID": "post69497369", "replies": [{"text": "I live in a very hot climate and my phone is doing fine. Try Sunkernel and ROMX combination, seems to work great(honestly I don't know how) but my phone's cpu is at 70C MAX in super intense games whole charging. Battery stays cool too.", "time": "7th November 2016, 04:27 AM", "postID": "post69497425", "replies": []}]}]}]}, {"text": "Mine doesn't get HOT much, only when playing heavy games or online games over LTE. And in none of those situations it becomes unusable or laggy.", "time": "5th November 2016, 02:40 PM", "postID": "post69472864", "replies": []}, {"text": "Rev3 here, played Asphalt 8 for about 30 minutes, much cooler than the old Xperia Z I had before.", "time": "5th November 2016, 08:19 PM", "postID": "post69477617", "replies": []}]}, {"title": "Low light", "rating": 4.0, "links": ["https://forum.xda-developers.com/xperia-z5/review/low-light-t3348506"], "threads": [{"text": "On maneul mod 8mp it is great maybe not as good as s7\n\nas an example i took it with night scene mod looks fantastic", "time": "28th August 2016, 01:33 PM", "postID": "post68410150", "replies": [{"text": "Is there a night scene mod?  Or did you mean night Mode in camera settings?", "time": "29th August 2016, 08:55 PM", "postID": "post68433223", "replies": []}]}, {"text": "There is a night scene mod in manuel mod 8mp it is what i mean", "time": "29th August 2016, 09:09 PM", "postID": "post68433395", "replies": []}, {"text": "Mode! Not Mod I supposed.", "time": "5th July 2017, 10:34 PM", "postID": "post72921194", "replies": [{"text": "Yea it has been long time after message, it is wrong  It is \"mode\"", "time": "5th July 2017, 11:06 PM", "postID": "post72921432", "replies": []}]}, {"text": "Anyway I would love to see how Z5's camera performs in low light condition with the new Nougat 7.1.1 update, does it result better picture in Nougat or it's just the same?", "time": "6th July 2017, 09:00 PM", "postID": "post72932120", "replies": [{"text": "It's still great in daylight, but in low light it's just horrible, I think those guys of SONY hasn't improve the camera of Z5 in the nougat software update. What they want is buy the new xz premium, lol. So Z5 and the remain Z series won't receive the next android update, all the x series will done.", "time": "6th August 2017, 06:38 PM", "postID": "post73309160", "replies": []}]}, {"text": "Im use on low light,  manual mode and EV +0.7 or 1", "time": "7th July 2017, 04:40 PM", "postID": "post72941800", "replies": []}]}, {"title": "Photo quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/xperia-z5/review/photo-quality-t3348507", "https://forum.xda-developers.com/xperia-z5/review/photo-quality-t3348507/page2"], "threads": [{"text": "It's okay, but cant do a close up / macro picture", "time": "10th April 2016, 04:01 PM", "postID": "post66290131", "replies": []}, {"text": "On daylight it is better than S7 but on low light you can just use 8 mp to take good pictures and it is not as great as s7", "time": "28th August 2016, 01:22 PM", "postID": "post68410023", "replies": []}, {"text": "the picture quality is good, but the post processing is horrible.\n\ni dont know why my old samsung s6 with Exmor R camera (Made by sony) can create more sharper and detail pictures (you can see it while zooming the photo, not when capturing), while my z5 creates more unnatural sharp image (Oversharpen) and horrible when zooming it (zoom the photo, not zoom when capture).", "time": "17th December 2016, 11:24 AM", "postID": "post70131062", "replies": [{"text": "Daylight images are good with fine and realistic details even on 100 % crop\r\nMinor issue are edges cause not that clean and sharp.\r\nDaylight picture quality is one of the best today,for me better than S7 even.", "time": "17th December 2016, 10:28 PM", "postID": "post70138639", "replies": []}, {"text": "Actually the S6 and S7 oversharpen more than the Z5. At 20MP the Z5 doesn't have too much sharpening or noise reduction which makes the flaws in the lens more apparent. Some other smartphone cameras try to compensate for it by using an unsharp mask and then smearing it with noise reduction. The only time the Z5 is oversharpened is in 8MP mode and 1080p video mode, but not as much as other phones.", "time": "21st December 2016, 08:30 PM", "postID": "post70197942", "replies": []}]}, {"text": "I think its horrible. Samsung phones have waaay nicer colors and the Z5 camera takes very dark pictures.", "time": "22nd December 2016, 08:51 AM", "postID": "post70204463", "replies": [{"text": "i agree", "time": "27th April 2017, 09:00 PM", "postID": "post72060401", "replies": []}]}, {"text": "as xperia big fan \ni think Z2 is the best xperia camera \n\nused s, arc s, p,v,z, z1, z2, z3, z5 and xperia x \n\ntoday i took 2 photos \n1 with Z5 and 1 with oneplus 3 inside the home with lights on. \n\nZ5 camera reflected to much light off the wall .\nactors in TV were not seen at all by Z5", "time": "26th December 2016, 03:11 AM", "postID": "post70255943", "replies": []}, {"text": "Can someone post some pictures including lowlight pics taken with xperia z5 with nougat 7.1.1? I want to know if the camera produces better picture in 7.1.1 compared to 5.1.1.\n\nThank you in advance", "time": "5th July 2017, 10:31 PM", "postID": "post72921158", "replies": []}, {"text": "For me it seems the pictures look the same. Did not compare in detail and don't have examples at hand though.\nI'm really happy that I gave it away, don't want it back.", "time": "16th July 2017, 12:41 PM", "postID": "post73049423", "replies": []}, {"text": "I honestly expected a lot more. Sony makes cameras for other devices while putting their average on their own.", "time": "19th January 2018, 12:32 PM", "postID": "post75256411", "replies": []}]}, {"title": "Video quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/xperia-z5/review/video-quality-t3348508"], "threads": [{"text": "Video quality is excellent and the stabilization is very effective as well. It does not reduce frame rate in low light like some other phones, instead increasing the ISO. \n\nAutofocus is reasonable but you can't lock on to an object.\n\nThe disappointment is the lack of manual options. Occasionally the white balance of the video will shift. Even if you use the colour/brightness slider to tweak white balance, it will still shift since there's no option to choose a distinct white balance profile.", "time": "3rd April 2016, 11:42 PM", "postID": "post66181087", "replies": []}]}, {"title": "Selfie quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/xperia-z5/review/selfie-quality-t3348509"], "threads": [{"text": "I am not a teenage girl but I use the front camera fairly often because I use the app 1SecondEveryday to capture 1 second of my life each day and often the best way to do that is a 'selfie', especially if I'm on my own somewhere.\nPreviously I had a Z3 which was a great rear camera but the front one was pretty terrible. If I was taking a selfie with mates in the pub it was always too dark and grainy. The Z5 front camera is much improved. Not great but 'good enough' for my uses.", "time": "4th April 2016, 11:36 AM", "postID": "post66187345", "replies": []}, {"text": "Sample pictures guys/girls?", "time": "5th July 2017, 10:36 PM", "postID": "post72921208", "replies": []}, {"text": "Is there any way to fix soft skin effect always on on selfie camera? Even if i switch it off it still process photo in soft skin", "time": "12th August 2017, 09:33 PM", "postID": "post73379753", "replies": []}, {"text": "The camera is superb! But, it's kinda lag.", "time": "4th September 2017, 06:47 PM", "postID": "post73664099", "replies": []}]}, {"title": "Time to take picture (camera launch speed)", "rating": 3.0, "links": ["https://forum.xda-developers.com/xperia-z5/review/time-to-picture-camera-launch-speed-t3348510", "https://forum.xda-developers.com/xperia-z5/review/time-to-picture-camera-launch-speed-t3348510/page2", "https://forum.xda-developers.com/xperia-z5/review/time-to-picture-camera-launch-speed-t3348510/page3", "https://forum.xda-developers.com/xperia-z5/review/time-to-picture-camera-launch-speed-t3348510/page5"], "threads": [{"text": "I felt bad when tried at showroom, it took a little bit of time to save picture. But when I bought it and be installed latest 5.1.1, the time to take and save a picture is less than 1 second.", "time": "31st March 2016, 05:32 PM", "postID": "post66130228", "replies": []}, {"text": "I think camera app start-up is reasonable but the shutter lag is unacceptable. I once photographed a seagull standing on a bridge and it was still standing when I pressed the shutter but the sensor captured it flying away...\n\nhttps://www.dropbox.com/s/j5hcj2jeaz..._0988.JPG?dl=0", "time": "2nd April 2016, 01:01 AM", "postID": "post66153116", "replies": []}, {"text": "Not good. App takes too long to start, can't take quick bursts of photos and the images take too long to save. It's a real shame.", "time": "29th April 2016, 09:58 PM", "postID": "post66610514", "replies": []}, {"text": "I agree. Really not good at all, especially since many other phones on the market take photos in the blink of an eye.", "time": "1st May 2016, 03:00 AM", "postID": "post66626954", "replies": []}, {"text": "Long time Sony fan. App launch and shutter lag pathetic. Sometimes it takes 3 - 5 seconds to actually take the picture!", "time": "1st May 2016, 02:54 PM", "postID": "post66639973", "replies": []}, {"text": "It's really bad with Flash ON/Auto, much quicker if you switch it off.", "time": "5th May 2016, 10:14 AM", "postID": "post66704774", "replies": []}, {"text": "Since Marshmallow it's a little bit better, but it's still way slower than the Galaxy S6/S7. Even my old Galaxy Note 3 was faster. I expected better from that phone in the camera department, and I don't blame the sensor... I think the app is the culprit. Compared to Samsung, LG, HTC and Apple, Sony probably has the worst stock camera app", "time": "10th May 2016, 03:46 PM", "postID": "post66786729", "replies": []}, {"text": "I think the only way you can minimize it is using the shutter button. Using the on-screen button will slow it down cause more lag because it autofocuses once again. The thing is the Z5 always captures the frame directly after \"capture\" instead of the current frame.  I had an old Sony point-and-shoot from over 10 years ago and it was able to pause immediately to save the frame the moment the button was pressed.\n\nIt's even worse on third-party apps because taking a picture causes the camera to autofocus first and struggle for a considerable time before taking the picture.\n\nIt's probably poor optimization but I highly doubt Sony will fix it, even though it seems to have improved in the X/X Performance. Now they're claiming 0.6 shutter response from standby and \"nearly instantaneous\" normal shutter response.", "time": "19th May 2016, 02:05 AM", "postID": "post66918192", "replies": []}, {"text": "apart than camera launch time, that is depending on various parameters, disable the \"photo analyzer\" app. The picture save time will be increased dramatically as the phone will not search for faces , etc", "time": "23rd May 2016, 03:26 PM", "postID": "post66988475", "replies": []}, {"text": "Timing to take picture is fast,there is no phone on the market that focusing faster than Z5.Only when you taking bigh resolution photos 23/20 mpx phone needs about second or two to save it.", "time": "10th June 2016, 03:23 AM", "postID": "post67250611", "replies": []}, {"text": "Depends on conditions.  The camera is very slow at auto-focus.  In daylight and a stationary target, there's no noticable shutter lag.  At night and/or moving target, it can be a few seconds enough that you miss whatever you were trying to video. Video seems to always take a few seconds to start recording.  The camera also does not seem to support zoome of any kind.  If I attempt to zoom at all, the picture quality seems to become horrible for some reason.\n\nAs for time from screen off, it seems to vary.  sometimes the camera app is up in less than a second, sometimes I have to wait a second or two.", "time": "17th June 2016, 03:34 PM", "postID": "post67361839", "replies": [{"text": "Can you show a screen-recording showing there's no shutter lag? Many users here have noticed -  take a picture of cars passing by and you can see it always skips a frame (I would estimate 1/20 of a second).\n\r\nXperia X boasts 0.6 second capture from startup yet they won't bring such optimizations onto the Z5. perhaps some of it is due to the hardware, but just about EVERY other high-end phone has nearly no shutter lag, even those with 20+MP sensors.", "time": "2nd July 2016, 08:56 AM", "postID": "post67570286", "replies": []}]}, {"text": "last day I worked with my friend's LG v10 fast and smooth UI and great Pictures that I never had chance to took with 23 megapixel z5!\r\nSOC 810 IN Z5 and 808 in v10 and 23 megapixel against 16 , something wrong that Sony can't fix this ! yet.", "time": "28th June 2016, 10:06 AM", "postID": "post67515042", "replies": []}, {"text": "I said \" In daylight and a stationary target, there's no noticeable shutter lag.\"  A car passing by isnt stationary so the auto-focus has to do some work.  I don't think 1/20 of a second is noticeable to most people. I mean most movies are around 1/24 of a second and you dont notice.  I think for a real camera, 1/6th of a second is about average.  1/20th might be for pre-focused.\n\nI dont have another camera so I can't time it.  I tried using a timer on my laptop and taking a photo of my screen while clicking my mouse to start the timer at the same time.\nIf my phone is in the right mood, using the camera button, I can get a photo off in just less than 2 seconds.\nThe shutter lag seemed to be about 0.3 seconds.  Now if I repeatedly tapped the shutter button, it seemed to be as fast as 0.1 seconds.\n\nSo in the right conditions, I think it is pretty fast.  In the wrong conditions, its horrible.", "time": "2nd July 2016, 03:03 PM", "postID": "post67573850", "replies": [{"text": "I already half-pressed the shutter button so that autofocus is locked - it still captures the frame after the screen flashes. Using manual mode at 8MP with sports mode speeds things up a little bit. Some people on this forum have disabled thermal throttling and the lag is significantly reduced, but is still present. The final capture press after autofocus is determined should be virtually instantaneous regardless of conditions, as it is on iPhone, Samsung Galaxy and many other phones. While there is still some input lag (which is something like 5ms) and the autofocus also slow things down, this is what companies call \"zero shutter lag\" - even if it isn't 100% true it is still reasonable. Sony Xperia always skips a frame after the shutter button is pressed and that is your final image. This may seem like nothing but for action shots this is unacceptable. And it's not because the sensor is higher resolution as HTC M9+ Supreme Camera Edition has a 21MP Sony sensor that is just as fast as the iPhone 6 or Galaxy S7. So currently, the Z5 is a terrible choice for instant action shots.\n\r\nIt's even worse for video - it always takes me  1-2 seconds for the phone to film the first video. A second video is much faster, but videos showing the Xperia X has much faster video capture on the first go.", "time": "3rd July 2016, 12:09 AM", "postID": "post67579461", "replies": []}]}, {"text": "I remember Kit-Kat times and Sony burst mode.\r\nSome users now what i am talking about...\n\r\nGuys what is going on. Software  should be faster and faster... I personally bought z5 mainly because of the promises that camera is top nodge and now i can see that is not... Period and i am sory to say that, as huge Sony fan.\r\nBottom line is that you can have all MP in the world,  fancy smancy auto focus, addons and so on,  when post-processing is bad, user experience is bad allso.", "time": "10th July 2016, 01:48 AM", "postID": "post67677068", "replies": []}, {"text": "I'm also annoyed that video and camera buttons are not on the same interface, and you need to swipe. Some people prefer it because they accidentally film video instead of taking a photo, but it would be better if they gave an option, since the initial release had both on the same interface.\n\nAnd I can't understand why there is no burst mode... Some claim the hardware is too slow but my friend said he had it on the Z3, and HTC M9+ Supreme Camera has it as well (I only tried briefly). I was deciding between the HTC and the Z5 and went for the Z5 because I thought the camera would be better and also because it has quick-charge and runs on a Qualcomm SoC (I was well aware of the overheating issues, but I'd rather have an SoC that is reliable with updates - the M9+ is still on Lollipop in many places!)", "time": "10th July 2016, 09:55 AM", "postID": "post67680528", "replies": []}, {"text": "No matter what settings I use my camera is very slow, slow to launch and slow to take picture.  I normally have to hold the phone still for a second after I press the shutter to make sure it has take the picture properly.  It is not terrible but certainly not as quick as other flagships on the market.  \n\nI am going to to a master reset of the phone today to see if it helps, I shall report back!", "time": "12th July 2016, 07:47 AM", "postID": "post67707636", "replies": []}, {"text": "I have taken the plunge and did a factory reset on my phone.  It's too soon to tell whether it's had any effect on camera launch speed but let everyone know once I've used it for a bit longer.", "time": "12th July 2016, 11:56 AM", "postID": "post67710042", "replies": []}, {"text": "So the process of reinstalling everything on my phone is not as painful as I thought but I haven't got a huge amount on my phone.\nI am pleased to say that the camera launch speed for now is very good! So if you would have been struggling with camera speed problems then I would definitely recommend giving this a try but only if you have all the latest firmware installed and it will certainly make your phone run smoother as well.", "time": "13th July 2016, 06:27 AM", "postID": "post67722323", "replies": []}, {"text": "I find the camera launch speed reasonable but even after factory reset the shutter lag is still noticeable.", "time": "19th July 2016, 12:32 AM", "postID": "post67805488", "replies": []}, {"text": "Yep,but after this update 253 camera took pictures faster than before.Try  253 firmware.", "time": "19th July 2016, 04:54 AM", "postID": "post67807414", "replies": []}, {"text": "Well often people say it's faster after each update but after a few days of usage, I find the difference to be marginal if any", "time": "23rd July 2016, 03:17 AM", "postID": "post67864572", "replies": []}, {"text": ".253 is an improvement in speed, at least i am using slim rom. 253 ( prior flashed stock.253.tft)  and there is no lag in taking video. I have my screen off and lockscreen active, hardware button swiftly takes picture  when I  need it. \n\r\nSo in  my last comment i was so angry buying z5, now i see some progress made\n\r\nUnder line, am happy now, still i need to check if blue tint still exists in night conditions", "time": "11th August 2016, 12:24 PM", "postID": "post68138874", "replies": []}, {"text": "Can you post a screen capture of how fast the shutter is?", "time": "14th August 2016, 07:14 PM", "postID": "post68187128", "replies": []}, {"text": "Shutter speed is really slow on all MM builds.. There is also a lot of grain in the pictures on MM.. Seems to me like they built new camera drivers and they're not complete yet. Switched back to Lp and all these issues are gone. Shutter speed is really fast and also camera launches fast. Just make sure to not update the camera app if u switch to lp.", "time": "17th August 2016, 10:03 AM", "postID": "post68226663", "replies": []}, {"text": "I tried the Xperia X Performance and XA today - virtually no shutter lag but still no burst mode. Although there were some updates to the capture algorithm of the X series, why didn't they think of them in the first place? Even my HTC One X+ from 2013 has practically no shutter lag.\n\nIs it possible to revert back to the original camera app? Only that one has a separate button for video recording - I hate having to swipe up to record video but there are some who say accidentally press the video button (GSMArena complained about it as well)", "time": "18th August 2016, 02:18 AM", "postID": "post68239151", "replies": []}, {"text": "I got 253 today... still almost the same amount of shutter lag.\n\nIf you really think it is faster, please do a video showing it. Even the video posted a while back with thermal throttling turned off (which the user thought had very little shutter lag) has about the same amount of shutter lag as mine", "time": "22nd August 2016, 09:46 AM", "postID": "post68303217", "replies": [{"text": "Disappointed,  Problem is, prolonged use i think...So Shutter lag remains for videos.... In dark pictures blue tint allso remains, it seemed that fresh clean install helped for a while, at least with lag, but now i really dont now what to say... \n\n \n\n---------- Post added at 10:57 AM ---------- Previous post was at 10:54 AM ----------\n\n\n\n\nYesterday i unlocked old sony xperia z1 on lollipop stock and camera speed was great.. Wtf???? Then i realized that progress in .  253 was just in my head. I widh so bsdly thst sony would fix his cam software", "time": "22nd August 2016, 09:57 AM", "postID": "post68303283", "replies": []}]}, {"text": "Just a quick update.  \nResetting the device DEFINITELY improves the camera launch speed (not just in my head) BUT after a week of use it is back to the way it was before again.  So for those of you thinking of resetting to speed up the camera app, I wouldn't bother.  It is the biggest annoyance about this phone.", "time": "22nd August 2016, 04:01 PM", "postID": "post68307829", "replies": []}, {"text": "Is it as fast as this XZ demo?\nhttps://www.youtube.com/watch?v=txSzBCx4B_Q\n\nIf you look carefully there's a slight lag still but it is really fast.\n\nIs there predictive hybrid autofocus like the X series?", "time": "18th January 2017, 02:19 AM", "postID": "post70603316", "replies": [{"text": "Object tracking works, yes. Edit: Gotta say though, it's not like predictive auto-focus. It just seems to be object tracking.  Edit2: Just checked it. Object tracking continuously keeps the object in focus, however when you hit the shutter button, it focuses again which kinda destroys the whole purpose. \n\nIt isn't as fast as XZ though. But still much faster than before. It's actually the focusing that takes time, not capturing or saving. You can spam the shutter button and it will take photos really quick.", "time": "18th January 2017, 08:54 PM", "postID": "post70617229", "replies": [{"text": "Well that's a bit disappointing that it refocuses but the X series still had that problem.\n\r\nDid you try using the physical camera button and half-pressing to focus first? The on-screen shutter button focuses when you press it and captures the image only when you let go of it.\n\r\nWhat about third-party apps like Open Camera, Manual Camera and Camera FV-5? On Marshmallow it's really bad because the autofocus hunts a long time and sometimes can't even save the photo...", "time": "19th January 2017, 12:14 AM", "postID": "post70619293", "replies": []}]}]}, {"text": "just got Nougat and it seems to be only slightly faster. For the most part it is just the view feed resumes faster. Disappointed. I tried the XZ and it has NO shutter lag (as long as I half-press the camera button).\n\nI've tried 20MP and 8MP with same result. It just seems now that Superior Auto is just as fast as 8MP Sports mode.\n\nVideo recording starts a bit faster but still about half a second. Stuttering is really bad now but maybe because I just updated and the phone is still warm.\n\nNot sure if doing a factory reset would improve it.\n\nEDIT: another annoyance - the screen recorder app does not recognize when the camera app is rotated to landscape mode and therefore still records the video as \"portrait\" orientation despite being set to landscape!", "time": "11th April 2017, 05:19 PM", "postID": "post71819097", "replies": []}, {"text": "Little/no change on Android 7.1.1. Still a lack of manual options. Also really annoyed that since 7.0 you can no longer focus on a point using touch capture - it just focuses on the center of the image if you do that.", "time": "10th July 2017, 07:37 PM", "postID": "post72978297", "replies": []}]}, {"title": "Software (ease of use, features, etc)", "rating": 3.5, "links": ["https://forum.xda-developers.com/xperia-z5/review/software-ease-features-t3348511"], "threads": []}, {"title": "Charging speed", "rating": 4.0, "links": ["https://forum.xda-developers.com/xperia-z5/review/charging-speed-t3348512", "https://forum.xda-developers.com/xperia-z5/review/charging-speed-t3348512/page2", "https://forum.xda-developers.com/xperia-z5/review/charging-speed-t3348512/page3"], "threads": [{"text": "Take 2h30 with UCH20 and 2h with UCH10/Anker Powerport 18W, hope Sony would increase the limitation of current, it has been limited at 1555mA maximize.", "time": "31st March 2016, 05:36 PM", "postID": "post66130305", "replies": []}, {"text": "Mine got 1.54hrs to full", "time": "1st April 2016, 01:52 AM", "postID": "post66136695", "replies": []}, {"text": "with MM update,, I can get 1% to full about 2hrs, compared before in LP which I can only charge it in 2hrs and 20mins.. Im using Z5 Dual (E6683) btw and using a tronsmart 18w QC 2 fast charger (which isnt properly utilized by Z5)", "time": "1st April 2016, 04:42 AM", "postID": "post66137993", "replies": []}, {"text": "Edit:\r\nWith QuickCharge 2.0 from 30% - 100% in 1 :40 Hours and 2,2A", "time": "1st April 2016, 09:04 AM", "postID": "post66140282", "replies": [{"text": "Which is pathetic, my old S6 edge would charge from about 15% to full in about an hour whilst streaming from TuneIn Radio, connected to Wifi, to a bluetooth speaker.", "time": "1st April 2016, 09:22 AM", "postID": "post66140495", "replies": []}, {"text": "I can get only 1556mA at maximum, I'm using dual sim variant, is it the problem?", "time": "2nd April 2016, 04:13 AM", "postID": "post66154283", "replies": []}]}, {"text": "With pa-u28 from 22% to 100% in 1h 42m", "time": "1st April 2016, 10:09 AM", "postID": "post66141057", "replies": []}, {"text": "hello \ncan i charge my sony z5 premium with quick charge 3.0 charger ?\ninstead of quick charge 2.0 charger is that okay and safe ?\n\nregards", "time": "2nd April 2016, 12:54 PM", "postID": "post66157471", "replies": [{"text": "at the moment qqc 3.0 for only s820 and s617 proccesors. 810 supports qqc2.0", "time": "5th April 2016, 02:16 PM", "postID": "post66206079", "replies": []}]}, {"text": "2 hours", "time": "4th April 2016, 05:38 PM", "postID": "post66192466", "replies": []}, {"text": "New aukey pa-u28, 45 mins of charge,  from depleted, no overheat at all on Z5", "time": "9th April 2016, 09:30 AM", "postID": "post66269003", "replies": [{"text": "Wow only 45min from 0% to 100%?\nIf yes i'll buy it..\n\nInviato dal mio E6653 utilizzando Tapatalk", "time": "2nd May 2016, 10:28 PM", "postID": "post66665739", "replies": [{"text": "? His post clearly states 45 minutes from depleted to 54%, not full. Not impressive at all.", "time": "3rd May 2016, 09:04 PM", "postID": "post66680981", "replies": [{"text": "When phone is cold it gaves me up to 60% from depleted in 45 mins, maybe its not impressive as you said, but when u r in a hurry just plug it for 10 mins and gives you enough battery to get a couple of hours more, also is 60% against 40 with normal charger so is a must for a couple of bucks", "time": "5th May 2016, 07:01 PM", "postID": "post66711773", "replies": []}]}]}]}, {"text": "My Quick Charge 2.0 / 3.0 plug says 'Charging rapidly' when used with my Z3 Tablet Compact, but does nothing fancy with my Z5. Fail", "time": "9th May 2016, 01:44 PM", "postID": "post66768113", "replies": []}, {"text": "It is most reliable to measure from 0 to 90%, because from 90-100 it slows down significantly.\n\r\nI once got from 2-72% in 68 minutes with the UCH10, so that's about 1% per minute. Not bad, way better than my previous HTC Butterfly s which took nearly 4 hours to charge is 3200mAh battery. \n\r\nThe voltage does increase so it is supporting QC 2.0 but not to its fullest potential - someone else here indicated that the Z5 doesn't use step-charging. Perhaps Sony restricted quick charging to minimize overheating.", "time": "10th July 2016, 10:00 AM", "postID": "post67680574", "replies": []}, {"text": "The non-Quick Charge UCH20 performs pretty much the same, certainly within 10% charge rate on the Z5. I have another QC 2.0 charger that performs the same too.\n\nZ5 just doesn't support quick charge.", "time": "10th July 2016, 10:08 AM", "postID": "post67680627", "replies": []}, {"text": "Hey Guys, I saw this thread and just thought i'd share my knowledge on the Xperia Z5 (E6653).\nIm sure most of you are already familiar with what i might say in my post. if that is the case.. then you are free to disregard and ignore this post .\n\n1. Quick Charge 3.0 is not supported on this device.. And to be honest, you don't even need it.. \"Why is that??\" you may ask.. Here is the simple answer..\nUsing a 5v 2.1A USB Charging Adapter and a thick USB charging cable with a length of about 60cm (MAX) (shorter the better). Will charge your device fast enough... Believe me.. lol\n\n2. Atleast once a week (Full charge your battery from a depleted state) - Dead battery, and while it is powered off.. Dont start charging it for only a few minutes and then turning it on.. LEAVE IT OFF (if you dont have any alarms set for the next morning etc)\n\n3. Do NOT keep your device on charge while you're playing  CPU and GPU intensive games.. IF your battery is at roughly 70% or Above.. UNPLUG the charger from your phone.. Or you will shorten the life span of your battery very quickly.. Because at 70% and Above charging speed slows down significantly to the point where if you're playing games your battery will keep discharging rather than charge because it's consuming more power than it can restore..\n(Hence the damage to overall battery life span).\n\n4. Last but not least.. Every so often.. If you're a power user (someone who always plays a shi*t load of games and has heaps of apps running in the background etc etc). Try to remember to Calibrate your battery every so often..\n(Usually when you notice things like -----> Battery draining unusually faster than normal, Battery not holding charge as long as it use to, device heating up a little more than normal, charging isn't as fast or efficient anymore) etc..\n\nJust a few things i thought i'd throw out there.. \n\ntake care Ya'll..", "time": "1st August 2016, 06:00 AM", "postID": "post67990352", "replies": []}, {"text": "I'm using a third party Quick charger and the result is attached and from 8% to 100% in 1 hour and 56 minutes.\nhttp://www.aliexpress.com/item/Ugree...1-7594ef5aaff9\r\n Is the charging speed fine as quick charge like 9V-2A or its equal to 5V-2A?\r\nAnd\r\nCould someone tell me the charging time and speed who are using the Sony Quick charge UCH10", "time": "15th August 2016, 08:12 PM", "postID": "post68202637", "replies": []}]}, {"title": "Screen on time", "rating": 3.5, "links": ["https://forum.xda-developers.com/xperia-z5/review/screen-time-t3348513", "https://forum.xda-developers.com/xperia-z5/review/screen-time-t3348513/page2", "https://forum.xda-developers.com/xperia-z5/review/screen-time-t3348513/page3", "https://forum.xda-developers.com/xperia-z5/review/screen-time-t3348513/page5"], "threads": [{"text": "The best SOT Android smartphone ever, this was confirmed by a lot users and famous blogs.", "time": "31st March 2016, 05:37 PM", "postID": "post66130324", "replies": []}, {"text": "Best for me is 4:48 as reported by Battery Monitor Widget, but mostly is 3D games so I think is pretty good", "time": "5th April 2016, 12:45 AM", "postID": "post66198343", "replies": []}, {"text": "I have my Phone 3 hours off Power, Battery goes down to 60% and the main app draining power is the Display with 17% as per the battery consumption chart. \nIn the Details to the batteryconsumption of the display it says the display was on for 1:35, however I hardly turned it on.\nThat is the same since LP and even with MM I reset already 3 times. no change.\nI would love the meet someone with that great performance. mine seems just broken :/", "time": "6th April 2016, 12:27 PM", "postID": "post66221339", "replies": []}, {"text": "Such a pity that the battery is not awesome maybe due to bloatwares", "time": "10th April 2016, 04:01 PM", "postID": "post66290138", "replies": [{"text": "Actually I hope so. I am one step away from rooting my phone and hope that this might help, especially with greenify having root access.\r\nThe device is almost unusable anymore with this battery life. I factory reset once a week, don't even have many apps or do much with it but it still lasts just half a day.\r\nAfter a factory reset the first 2-3 days are almost fine up to one day.\r\nI dont even think 2 days are possible if I don't activate the whole time...", "time": "14th April 2016, 11:54 AM", "postID": "post66356594", "replies": [{"text": "Xperia Z5 Tmobile USA\n2.5HR SOT \nMobile radio likes to stay active throughout the day. Have tried many roms/ factory resets. \n\nHopefully next software update....feel like i've been saying that for years about various android phones...", "time": "18th April 2016, 06:21 PM", "postID": "post66428501", "replies": []}]}]}, {"text": "I'm getting average 7-9 hours SOT with my Xperia Z5 Dual E6683... btw is it normal for the GPS indicator at the battery usage page to show that it's constantly turned on throughout the whole day eventhough it's turned off?", "time": "19th April 2016, 02:46 AM", "postID": "post66434786", "replies": []}, {"text": "On average daily use with WiFi on and location enabled most of the time I will get 5 hours SOT.  I have pushed it close to 6 with reducing my brightness to almost nothing and only using the phone for messaging.  Several factors will affect SOT.  For me getting group messages or picture messages drops battery life. Using Chrome also drops it.", "time": "19th April 2016, 04:15 PM", "postID": "post66444191", "replies": [{"text": "Curious what your app list is?", "time": "20th April 2016, 10:53 PM", "postID": "post66467951", "replies": [{"text": "Are you asking the app usage in the day? Funny enough my battery life today was a definite miss but it got me through the workday and that's all I need.", "time": "21st April 2016, 12:09 AM", "postID": "post66468608", "replies": []}]}]}, {"text": "Nah I meant like what apps do you have that are non-stock..\n\nBut looks like my phone is back to not dozing.. losing ~10% overnight, where I used to lose 3%. Looks like I'm getting the Mobile Radio Active bug displaying through google play services. Clearing caches of apps that appear to be causing it as I go...", "time": "21st April 2016, 12:35 AM", "postID": "post66468808", "replies": []}, {"text": "I finally got down to root my phone.\nBefore I managed to last up to 6 hours battery (I'm not talking about SOT, just regular use) since MM update and no stamina.\nI followed the guide to safe my DRM and root the phone: http://forum.xda-developers.com/xper...oader-t3354307\nThe hilarious leap forward was by using the MOD for the SD810 from nreuge: http://forum.xda-developers.com/xper...weaks-t3321841\nNow I do have about 16-20 hours of battery life and I last a full day with moderate use, listening to MP3 via bluetooth, WhatsApp Stuff, and little Clash of Clans.\nThis is how I expected it to be.\nThe best part, the phone does NOT get HOT. I have to do really heavy stuff to even get it warm!\nThis saved my Z5, and I'm now really happy with it.\nIf somebody is concerned about performance, I did not recognize any performance issues since using this mod! I just stay on Heimdall tweak.\n\nHave fun!", "time": "26th April 2016, 11:03 AM", "postID": "post66552540", "replies": []}, {"text": "Idk why but i barly get 2 hours of sot", "time": "10th September 2016, 10:32 AM", "postID": "post68617185", "replies": [{"text": "my Z5 is giving Avrg7.5hours SOT\n\n---------- Post added at 06:46 AM ---------- Previous post was at 06:44 AM ----------\n\n\n\r\nhey buddy! Can i install custom recovery in xperia Z5 wih locked bootloader?", "time": "25th January 2017, 06:46 AM", "postID": "post70717369", "replies": [{"text": "Unfortunately not.", "time": "7th February 2017, 02:03 PM", "postID": "post70919673", "replies": []}]}]}, {"text": "how is the screen on time for light user \nonly facebook whatsapp some youtube calls >>> etc \nis it good as Xperia Z3 i managed to get more than 10 hours SOT in it \nwhat about Z5 ?", "time": "10th November 2016, 11:59 AM", "postID": "post69550427", "replies": []}, {"text": "Without playing game, 4.5 - 5 hours SOT. (%60 wifi, %40 mobile)\n*brave browser 3-4 hours\n*youtube 0.5-1 hour\n*fizy (music service) 0.5-1 hour\n\nWith playing game (clash of clans), 2.5 - 3 hours SOT. (%70 wifi, %30 mobile)\n*clash of clans 1-2 hours\n*brave browser 0.5-1 hour\n*youtube 0.5-1 hour", "time": "19th March 2017, 03:25 PM", "postID": "post71496462", "replies": []}, {"text": "My Xperia Z5 has started troubling me since last 3 days. Screen on Time and battery 🔋 endurance have gone terribly low the standard and that too with any unidentified reasons..\n\nPreviously, i used to get around 4hrs of SOT and no percentage drop 💧 throughout the night 🌃 standby.  But since the last 3 days i dont even get more than 2hrs of SOT and had to loose around 8-9% in the stand-by time ⌚ of night 🌃.. \n\nI am a noob, clean user, no root and nothing modified at all. Please suggest me a way to improve this. I am frustrated...", "time": "4th April 2017, 08:47 PM", "postID": "post71727733", "replies": [{"text": "You should switch to lineage. It is my understanding that there's a SOT of around six hours... \n\n\nOtherwise some of the custom stock roms do pretty well too", "time": "5th April 2017, 10:03 AM", "postID": "post71734070", "replies": []}]}]}, {"title": "Standby drain", "rating": 3.5, "links": ["https://forum.xda-developers.com/xperia-z5/review/standby-drain-t3348514", "https://forum.xda-developers.com/xperia-z5/review/standby-drain-t3348514/page2"], "threads": [{"text": "Battery drain rating on Sony's Stock ROM is only average (0.7-1% per hour in Airplane Mode), no matter if (unrooted) Stock ROM or with Custom Kernel; 0.5% at best with gauge tweaks and other modifications;\n\r\nAOSP/CM ROM appears to be excellent - 1% per several hours;\n\r\ndoesn't come close to my Note 3 (a few per cents per day) or even my Galaxy S1 with the original battery (2-3% per day), but that's no disadvantage of the Z5 per se\n\r\nbattery's technology simply wasn't allowed to catch up with progress yet", "time": "28th April 2016, 12:55 AM", "postID": "post66580313", "replies": []}, {"text": "Something keeps my device awaken - not sure what this could be, as the Wakelock Detector and other apps that can show culprits require root to run on Android versions from KitKat and above. This causes battery drain when the phone is not in use overnight. Does anyone else have similiar issue?", "time": "29th April 2016, 01:34 PM", "postID": "post66603409", "replies": [{"text": "it's most likely something else\n\r\nor part of the kernel or deep within the system,\n\r\nbecause blocking wakelocks does hardly have any effect", "time": "29th April 2016, 02:14 PM", "postID": "post66603978", "replies": []}]}, {"text": "I find my standby drain to be terrible. I can leave my phone in my pocket, with all background app closed down and it still somehow looses 30% in about an hour.", "time": "2nd October 2016, 10:26 PM", "postID": "post68956414", "replies": [{"text": "Have you tried with BREVENT APP together with an aggresive Doze app (Greenify, ForceDoze, NaptimeX)? I´ve now installed Brevent + Greenify and standby during night from 100% \"only\" takes me 0,5% per hour more or less.\n\r\nAlso inside Brevent you have possibility to access to AppOps (be careful with this option).", "time": "26th January 2018, 04:52 PM", "postID": "post75341912", "replies": []}]}, {"text": "You keep breathing while sleeping", "time": "2nd October 2016, 11:36 PM", "postID": "post68956946", "replies": []}, {"text": "I use GSAM Battery Monitor to keep an eye on things. After a few weeks I'm happy enough with battery drain levels.\n\nIt mostly depends on phone signal; if I'm at home the signal is very weak and this can drive the standby drain up to nearly 10% an hour, and the phone can get warm. But if it has better phone signal then the drain can be as low as 2% or 3% per hour.\n\nI have my phone set to turn off wifi when screen is off. I also use a Notification area weather app, Messenger, WhatsApp, Facebook, Instagram, etc and I have a number of email accounts and calendars syncing regularly so I would say I'm not running things in a lean manner. I'm sure if I uninstalled most of these apps my standby time would be spectacular, but then I wouldn't be getting particularly good use out of my smartphone.", "time": "11th October 2016, 06:59 PM", "postID": "post69082047", "replies": [{"text": "Hey, how do you turn wifi or even data off? Using stamina but how exactly?\n\nMuch appreciated", "time": "21st January 2018, 02:04 AM", "postID": "post75276129", "replies": []}]}, {"text": "I found that Bluetooth was causing massive drain on my phone. The fix which worked for me without turning off bluetooth (I like it to auto connect when I get in the car) was Settings->Location, then click the 3 dots menu in the top right and then Scanning, turn off Bluetooth Scanning. There are a few other things you can do as well.", "time": "1st March 2018, 12:39 PM", "postID": "post75735511", "replies": [{"text": "What else things do you mean?", "time": "1st March 2018, 05:48 PM", "postID": "post75738517", "replies": []}]}, {"text": "After z5 becomes it can drain upto 30% per hour", "time": "13th March 2018, 12:05 PM", "postID": "post75873493", "replies": []}]}, {"title": "Heavy use endurance", "rating": 3.5, "links": ["https://forum.xda-developers.com/xperia-z5/review/heavy-endurance-t3348515"], "threads": [{"text": "I always get a fully day usage with this phone, WiFi and Mobile Data are always on, 2 mails sync every 1 hour, ~10 apps background data, take ~10 pictures and ~5 minutes video recording, ~1,5 hour listening to music.", "time": "31st March 2016, 05:40 PM", "postID": "post66130390", "replies": []}, {"text": "Pretty decent, I'd love Stamina mode back though.", "time": "1st April 2016, 03:16 PM", "postID": "post66145118", "replies": []}, {"text": "How can people play those \"shut the phuck up and pay the iaps\" game like things.. \nAnyway, a good 3 - 4 hours of ingress and still over half left.", "time": "2nd April 2016, 01:22 AM", "postID": "post66153277", "replies": []}, {"text": "I don't understand why sony annouce 48 hrs in normal use, the phone doesn't reach 36hrs even in sleep with data off, wifi off, screen off", "time": "2nd April 2016, 01:07 PM", "postID": "post66157648", "replies": [{"text": "you mad bro  5 hour SOT i think its not so bad.", "time": "2nd April 2016, 05:21 PM", "postID": "post66161360", "replies": []}]}, {"text": "No just 1.5 hour sot bro", "time": "2nd April 2016, 06:06 PM", "postID": "post66161979", "replies": [{"text": "Man I have same problem. \r\nSent the peace on service, they changed battery, now, after one week, again on service, waiting for resolution, but definitely hardware problem. \r\nIt started approximately 2-3 months after I purchased the mobile.", "time": "2nd April 2016, 08:31 PM", "postID": "post66164124", "replies": []}]}, {"text": "This is what a good kernel means. Completely stock.", "time": "2nd April 2016, 08:29 PM", "postID": "post66164093", "replies": []}]}, {"title": "Light use endurance", "rating": 4.5, "links": ["https://forum.xda-developers.com/xperia-z5/review/light-endurance-t3348516"], "threads": []}, {"title": "\"Look\" of the device (aesthetics)", "rating": 5.0, "links": ["https://forum.xda-developers.com/xperia-z5/review/look-device-aesthetics-t3348517", "https://forum.xda-developers.com/xperia-z5/review/look-device-aesthetics-t3348517/page2"], "threads": [{"text": "With me, Sony's design is the best.", "time": "31st March 2016, 05:41 PM", "postID": "post66130407", "replies": []}, {"text": "BEST DESIGN EVER! very premium feel and quality", "time": "10th April 2016, 04:02 PM", "postID": "post66290152", "replies": []}, {"text": "Looks very nice in gold", "time": "11th April 2016, 02:41 PM", "postID": "post66306021", "replies": []}, {"text": "Mine is black and it is the most beautiful handset ever", "time": "15th April 2016, 05:51 PM", "postID": "post66379521", "replies": [{"text": "i have the gold one, love the way handset looks/feels\n\nZ3+(z4) is a bit more sleek though, thinner, shinier.", "time": "16th April 2016, 01:39 AM", "postID": "post66385136", "replies": []}]}, {"text": "Green one is fantastic", "time": "28th August 2016, 01:28 PM", "postID": "post68410085", "replies": []}, {"text": "got the black one so so so sexy and beautiful, it feels so premium", "time": "30th August 2016, 12:18 AM", "postID": "post68435510", "replies": []}, {"text": "I think its a beautiful phone, the 'candybar' design does look rather attractive", "time": "2nd October 2016, 10:18 PM", "postID": "post68956351", "replies": []}, {"text": "Yes, I feel it's much improved from the Z3 Compact even, esp the speaker design and frosted back.  The entire phone feels more matte to me, and the speakers on the front are almost invisible the way they are just slits at the top and bottom, great for using glass screen protectors.  Feels good in the hand and is significantly faster than my Z3c", "time": "3rd October 2016, 11:14 PM", "postID": "post68970530", "replies": []}, {"text": "I have graphite black and phone is nice looking and premium build.\nIn he's class is maybe best buy on the market.", "time": "5th October 2016, 02:26 AM", "postID": "post68985711", "replies": []}, {"text": "i dont know what to say but sony phones have the greatest design ever, with their unique \"square\" design. i like it.", "time": "17th December 2016, 11:31 AM", "postID": "post70131120", "replies": []}, {"text": "Just buy a Chrome Z5 Premium and he is gorgeous ! I had the gold one before he was great too", "time": "4th January 2017, 04:17 PM", "postID": "post70391660", "replies": []}, {"text": "Bezels are too big, and while the buttons look nice, they are not placed in the best position.", "time": "5th January 2017, 12:54 AM", "postID": "post70398109", "replies": []}, {"text": "Coming from an S6, this the best looking device i have ever used,Sony did an awesome job.", "time": "26th February 2017, 06:43 PM", "postID": "post71201309", "replies": []}]}, {"title": "Quality feel (use of materials)", "rating": 5.0, "links": ["https://forum.xda-developers.com/xperia-z5/review/quality-feel-materials-t3348518"], "threads": [{"text": "back cover of my z5 lose after playing heavy games and like a layer removing from right side (bottom)", "time": "11th April 2016, 11:52 AM", "postID": "post66303638", "replies": []}, {"text": "Very premium materials. but problem is corners. It is very easy to damage with small fall but possible to change them i will change one of them as it looks very bad now", "time": "28th August 2016, 01:30 PM", "postID": "post68410106", "replies": []}]}, {"title": "Ergonomics (in-hand feel)", "rating": 4.5, "links": ["https://forum.xda-developers.com/xperia-z5/review/ergonomics-hand-feel-t3348519", "https://forum.xda-developers.com/xperia-z5/review/ergonomics-hand-feel-t3348519/page2"], "threads": [{"text": "Z5 isn't comfortable to hold as much, because OmniBalance design has a flat back panel and sharp edge.\n\nbut It's acceptable for me since this phone is a third xperia device   I've ever owned. \n\nThe real problem is volume button. I don't know why they positioned it very close to camera button. make it difficult to press with one hand.", "time": "11th April 2016, 04:11 AM", "postID": "post66299051", "replies": [{"text": "+1 on that point. The volume button is ridiculously low compared to most phones. Makes it somewhat of a pain to use. \n\r\nThat said, overall the feel is quite nice. My only concern is the back, with no case on, it's fairly slippery and easy to lose your hold of.", "time": "15th April 2016, 01:42 PM", "postID": "post66375588", "replies": []}]}, {"text": "I find the Z5 compact very uncomfortable to hold. Slightly too big for my hands. Too thick and corners add to the problem. I think the device is gorgeous though. Z1 Compact is way more comfortable to hold.", "time": "11th April 2016, 02:49 PM", "postID": "post66306157", "replies": []}, {"text": "looks good but:\n-slippery, prone to drop\n-edgy or quite sharp corners at the back of the phone", "time": "25th April 2016, 04:45 AM", "postID": "post66533444", "replies": []}, {"text": "Feels nice to hold, but feels very slippery.\nThe volume button is sometimes a pain because its too low near the camera button.\nEsp. because that i had z1, im used to pressed the volume button on the middle of the phone.\nSo its kinda weird now.\nBut i love the design, and i have the white z5, and i love it\n\nGesendet von meinem E6653 mit Tapatalk", "time": "27th April 2016, 09:25 AM", "postID": "post66568296", "replies": []}, {"text": "It is not much ergonomic but design is fantastic", "time": "28th August 2016, 01:30 PM", "postID": "post68410117", "replies": []}, {"text": "Looks amazing but super slippery", "time": "31st August 2016, 04:05 AM", "postID": "post68454466", "replies": []}, {"text": "The volume buttons are that way because when you hold it horizontally, it is more comfortable. I don't agree fully with this decision, but I am pretty sure that is the reason.", "time": "20th September 2016, 08:24 AM", "postID": "post68773090", "replies": []}, {"text": "also if the phone is in your pocket, its very easy to access the volume buttons", "time": "23rd September 2016, 07:54 PM", "postID": "post68828968", "replies": []}, {"text": "Ergonomics is great.I use Nillkin Scrub  and feel nice in the hand and not too heavy in the pocket.", "time": "27th September 2016, 02:26 AM", "postID": "post68874931", "replies": []}, {"text": "its a large phone dude! and no curves to set hands! its slippery also and above all! they don't ship it with BOOK CASE COVER  (leather) in order to protect the device! I bought leather cover online in order to protect my investment!", "time": "24th October 2016, 10:51 AM", "postID": "post69281058", "replies": []}, {"text": "The back glass isn't quite even with the metal frame, so you would feel the sharp edges of the frame when holding the phone. In other words, the metal frame is a hair thicker than the phone itself. You might not see that in the pictures but you'd certainly feel it. I'd say it's a design flaw but nothing you can't live with.", "time": "5th November 2016, 08:25 AM", "postID": "post69468845", "replies": []}]}, {"title": "OEM skin/software", "rating": 4.5, "links": ["https://forum.xda-developers.com/xperia-z5/review/oem-skin-software-t3348520"], "threads": []}, {"title": "Outdoor visibility (max brightness)", "rating": 4.5, "links": ["https://forum.xda-developers.com/xperia-z5/review/outdoor-visibility-max-brightness-t3348521"], "threads": []}, {"title": "Contrast (true blacks)", "rating": 3.5, "links": ["https://forum.xda-developers.com/xperia-z5/review/contrast-true-blacks-t3348522"], "threads": []}, {"title": "Color saturation & accuracy", "rating": 4.5, "links": ["https://forum.xda-developers.com/xperia-z5/review/color-saturation-accuracy-t3348523"], "threads": []}, {"title": "Clarity/resolution", "rating": 5.0, "links": ["https://forum.xda-developers.com/xperia-z5/review/clarity-resolution-t3348524"], "threads": []}, {"title": "Minimum brightness", "rating": 4.0, "links": ["https://forum.xda-developers.com/xperia-z5/review/minimum-brightness-t3348525"], "threads": []}, {"title": "Call quality", "rating": 5.0, "links": ["https://forum.xda-developers.com/xperia-z5/review/call-quality-t3348526"], "threads": [{"text": "No problem at all. Speakers not so good.", "time": "2nd December 2016, 01:38 AM", "postID": "post69888406", "replies": []}]}, {"title": "WiFi strength, range, and throughput", "rating": 4.5, "links": ["https://forum.xda-developers.com/xperia-z5/review/wifi-strength-range-throughput-t3348527", "https://forum.xda-developers.com/xperia-z5/review/wifi-strength-range-throughput-t3348527/page2"], "threads": [{"text": "i have a router of wimax \" bm626 hauwei\"\r\nz5 dual connect with it but no internet.\r\ninstead i have z3 compact at same time\r\nz3 it connect with it with internet.\r\nwhy\r\nany one can help?", "time": "23rd June 2016, 08:10 AM", "postID": "post67446590", "replies": []}, {"text": "Did you tried to reset router to default settings? Did you tried to update router to newest firmware?", "time": "23rd June 2016, 11:56 AM", "postID": "post67448791", "replies": []}, {"text": "Thank you for providing this information so that we know how to protect their eyes", "time": "25th June 2016, 05:34 AM", "postID": "post67473202", "replies": []}, {"text": "Well all I can say is I have no issues with signal strength at all. When my WiFi works fine, the throughput is good too. The problem I am having with mine (on both 6.0 and 6.0.1) is that I lose my WiFi connection every few minutes. What happens is I'll be browsing online and after a few minutes nothing is loading but the signal indicator in the status bar shows a full signal. I have to turn off WiFi on my device, then turn it back on in order for it to keep going. Very irritating. I have many wireless devices in my house, this is the only one doing it. Oh and I've tried using 2 different routers, no change.\n\nAnyone else experience this?", "time": "25th June 2016, 07:21 PM", "postID": "post67481182", "replies": [{"text": "Im having the exact same issue as you... the connection to the WiFi itself doesnt disconnect.. But what is actually happening is that the Device itself seems like it is putting itself in to this wifi sleep state briefly for a minute or 2 and then just suddenly comes back to it's senses (suddenly wakes up and starts sending/receiving data packets which then resumes loading like normal.. and it does this randomly at nonspecific times..\r\nIt could happen within a minute or 2 of using the wifi... or sometimes even after an hour or so of streaming (sometimes within 5 minutes of streaming).... \n\r\n***NOTE*** \n\r\nMy Xperia Z5 has custom ROM and Kernel and is rooted with SuperSU with Xposed and busybox installed running Latest Marshmallow 6.0.1 (.224) Firmware.. \n\r\nTHEN I suddenly decided **** this, I'm actually going to fix this shi* lol ( you know that moment when you just had enough and finally decide to bother doing something about it,  ).. that's the moment I had..\n\r\nAnyway to keep this simple...\n\r\nAfter several hours of troubleshooting, testing and diagnosing , and trying to narrow down, isolate and fix the damn problem causing it to happen, I'm not sure 100% just yet but I may have found the problem and the fix to this IF the wifi \"Hanging\" doesnt occur anymore after doing some minor editing of the system files. (Only able to do with a rooted device) .\n\r\nI will inform you guys with my results in a couple of days and hopefully the outcome is good news .. IF not, ill just have to keep trying and if all else fails ill just factory reset the device since getting everything back on to my phone will only take 30 minutes..\n\r\nPeace!", "time": "17th July 2016, 04:01 PM", "postID": "post67785089", "replies": [{"text": "Awesome, keep us posted if you find anything! I'm looking into it at my end as well  FWIW, I have factory reset and even re-flashed the firmware multiple times with no improvement. Just trying to save you time and effort into reinstalling and stuff", "time": "17th July 2016, 09:15 PM", "postID": "post67788995", "replies": []}]}]}, {"text": "No issue with mine, reaching as fast as 400Mbps near the router.  Signal strength works as well as the Intel PCI-E wireless AC7260 cards in my house, so that's pretty impressive. Overall pretty satisfied with the WiFi performance. \n\nI'm using a Netgear Nighthawk R7000 router with a fibre connection, so I guess that's something.", "time": "29th June 2016, 01:30 PM", "postID": "post67531598", "replies": []}, {"text": "Sweet as bro, thanks for the heads up.. Well so far I haven't noticed any dropouts of any sort as of yet. But I still have some things that I am testing.. Will update soon..", "time": "18th July 2016, 10:39 AM", "postID": "post67795704", "replies": []}, {"text": "Well.. Here i am.. And unfortunately the issues still persisted..  To top it off, my phone decided to start having random moments where it would just restart on its on, even when left idle for a non specific amount of time. Anywhere between 1 and 3hrs.. I started getting really ticked off with it, so I decided to factory reset the device and install the latest (stock) firmware .253 from Sony using xperifirm and flashtool.. Flashed successfuly, applied latest andropluskernel, applied root, and xposed and also debloated the rom.. so far its been little over 12 hours and i havent really noticed any WiFi issues apart from the WiFi at some point tends to almost seem like it lags and slows down briefly and then just loads.. Not as bad as it was on previous firmware  .225 ..  Overall performance and battery on device seems pretty decent, without Amplify, without disabling any services or any system tweaks of any kind...\n\nSo now that I am onthe new firmware and rooted etc... I will as of this point specifically going to dedicate my diagnosticsand testing solely on the WiFi issue and see if I can find a permanent fix this time on the latest firmware..\n\nWill report back soon.. Hopefully what I have in mind works..\n\n(buffer size, WiFi chip power tweaks, WiFi sleep timers, etc etc etc)", "time": "20th July 2016, 01:57 PM", "postID": "post67827861", "replies": []}, {"text": "I have tried looking through logs on the phone to try and diagnose with no success. Still trying here though", "time": "27th July 2016, 02:55 AM", "postID": "post67919796", "replies": []}, {"text": "this WiFi issue is a headache, i just don`t know if all what i need is through my z5 to the wall and smash it -_-\nE6653_32.2.A.5.11_R9C_Generic Global\nand \nE6653_32.3.A.2.33_R2D_Generic Global\ni tried both firmware and WiFi problem is still exist, any solution ??", "time": "29th March 2018, 10:29 AM", "postID": "post76055039", "replies": []}]}, {"title": "Cellular strength and throughput", "rating": 4.0, "links": ["https://forum.xda-developers.com/xperia-z5/review/cellular-strength-throughput-t3348528"], "threads": [{"text": "what about signal strength in good areas written in dbm/asu?", "time": "9th January 2018, 08:18 AM", "postID": "post75133154", "replies": []}, {"text": "wifi functionality appears not so great (at least when compared to the Galaxy Note 3 which might be an all-time top of its class, not sure)\n\ncellular strength looks, like it's okay but not super-great", "time": "10th January 2018, 09:30 PM", "postID": "post75153263", "replies": []}, {"text": "For me, cellular strength is pretty good. But I cant really compare it with my friends's phones since we all are using different providers.\nbut I would say that the lte is pretty good, but not that superior.\nWifi is pretty good but also not very strong or superior.\n\nSince z5 came out for about 2 years ago, I would say that the device is just not as good as devices that just come out.\n\nBur im pretty satisfied with my device", "time": "13th January 2018, 07:58 PM", "postID": "post75187519", "replies": []}]}, {"title": "Speakerphone (loudness, clarity)", "rating": 3.5, "links": ["https://forum.xda-developers.com/xperia-z5/review/speakerphone-loudness-clarity-t3348529"], "threads": [{"text": "Very low speaker compare to other premium phones also many user have louder top speaker and low at bottom", "time": "1st April 2016, 01:50 AM", "postID": "post66136689", "replies": []}]}]