[{"title": "Overall love", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel-2/review/overall-love-t3685571", "https://forum.xda-developers.com/pixel-2/review/overall-love-t3685571/page2", "https://forum.xda-developers.com/pixel-2/review/overall-love-t3685571/page3"], "threads": [{"text": "Now that I have one in hand I do truly love it it's an amazing phone it does what I want when I want. The screen is amazing it get so bright! The feed back for the keyboard is just right and the endless little things it does the software is so refined now and only going to get better. This is were Android is at.", "time": "23rd October 2017, 12:19 AM", "postID": "post74258944", "replies": []}, {"text": "I am so disappointed in this phone.", "time": "16th November 2017, 02:00 PM", "postID": "post74534460", "replies": []}, {"text": "I'm in love with the Pixel 2. It's the 2017 version of the Nexus 5. I was missing too much a powerful Google phone with small size. \n\nIt's still expensive compared to the Nexus 5/5X but at least it has minimum 3 years of updates guaranteed (unlike the Pixel 1). \n4 or 5 years would be optimal but I think Google is getting there.", "time": "18th November 2017, 08:13 PM", "postID": "post74558617", "replies": []}, {"text": "I'm really happy with it. It looks like a shrunk Nexus 6P from the front.\nComing from the Nexus 6p general thoughts:\n- The 6p from 2015 has a better screen, higher resolution aside it's significantly brighter @ maximum brightness\n- In general use(I dont play games with it) it seems slightly faster but not alot.\n- Its weird going back to a smaller phone, the 6p feels massive/unwieldy when I hold it now.\n- I know the XL is popular but given the return to the 6p dual speaker Google should have used Huawei to make the XL, the y would have hit it out of the park (and I'd probably be an XL owner).", "time": "29th November 2017, 08:38 PM", "postID": "post74682963", "replies": []}, {"text": "i'm very happy with this phone. way better than my pixel 1. battery life is unreal compared to what I used to get on my pixel wiht the same usage. I have no issues getting well over 1 day + with 3-4 hours SOT.\nsuper snappy and responsive and love that I was able to unlock the bootloader and root in case I want to try out future developments.", "time": "11th December 2017, 03:28 PM", "postID": "post74810945", "replies": []}, {"text": "I started using Android on the OG Motorola Droid then Droid X until Nexus phones hit the market & have owned nothing but Google phones since. When I was heavy into ROM & Play Store app development I often bought other popular phones for testing & as a writer for various Android sites was able to  test several phones including Flagship devices from all the big name producers & have to say that the Pixel 2 is by far in my opinion the best iteration of an Android phone thus far. Performance, features, battery life, etc is top notch. I don't mind a bezel & if I were able to change something about the device it would be a removable battery & for Google to stand up to carriers like Verizon & say \"Hey - if you want to be the exclusive carrier for this phone we will not lock bootloaders\". Google is touted as pure Android and Android was built around the idea of freedom & community development.  I hope to see Google add more functionality to the fingerprint sensor in the form of scrolling, camera shutter button, etc - all already developed by independent developers.\nTo close on a positive note, I am Glad to see Google taking steps towards rectifying the fragmentation problems with projects like Android One (Sprout) and Project Treble.", "time": "17th December 2017, 03:12 PM", "postID": "post74876358", "replies": []}, {"text": "I love google andoid devices since my Nexus 5 (Which ended up very badly after 2 years though)\n\r\nSo I baught Pixel 2 again,\n\r\nBattery 4 hours of SOT (with video call, LTE and Youtube usage \r\nHeating issue when playing game or when on video call\r\nNo Headphone in box\r\nNo USB cable to connect to computer in box\n\n\r\nIf somehow I can ignore all this in coming days I wont return it.", "time": "17th December 2017, 11:30 PM", "postID": "post74880417", "replies": []}, {"text": "Delivers on what I expected. Good value as I got a 40% discount.", "time": "20th December 2017, 03:29 PM", "postID": "post74908965", "replies": []}, {"text": "Just got this phone late last week.\n\nAs a previous iPhone 6s user, the switch felt seamless as hardware wise I it didn't feel different to hold in the hand. Finger print reader location moved but felt more convenient and responsiveness and layout of the phone just felt right.\n\nI got mine through Verizon with the $300 off promo which isn't a bad deal seeing as I sold my iPhone and was funding for a Gen 1 Pixel.\n\n#teampixel", "time": "20th December 2017, 03:44 PM", "postID": "post74909144", "replies": []}, {"text": "Definitely not worth the full retail price. Other OEM's have surpassed Google in hardware and design, and on top of that, the clean android experience is completely over-rated. The phone feels great in the hand, runs great, and the camera is top notch. But all of those features are commonplace among flagships in 2017. The only real advantage the pixel line has is the updates and the camera software (which will get ported to other devices again like last year).\n\nDon't get me wrong, in a vacuum, the phone is spectacular. But it's also pretty mundane compared to everything else. My 2016 Honor 8 does more and costs less than the Pixel 2. Stock software is really holding this device back. A few more bells and whistles would have gone a long way.", "time": "25th December 2017, 11:21 PM", "postID": "post74961939", "replies": []}, {"text": "everything is perfect except for slow & easy to stuck...", "time": "3rd January 2018, 07:02 AM", "postID": "post75057252", "replies": [{"text": "Auto-correct typos?", "time": "3rd January 2018, 09:48 PM", "postID": "post75066324", "replies": [{"text": "Find out the reason, it's some barely used apps always running in the background, after block them, everything is going well now.\n\nBut my NFC still not working......", "time": "5th January 2018, 01:56 AM", "postID": "post75081394", "replies": []}]}]}, {"text": "Please google. Open your eyes.", "time": "8th January 2018, 09:58 PM", "postID": "post75129212", "replies": [{"text": "I would love a Pixel 3 smaller and lighter than the Pixel 2 without loosing screen size. \n\nStill...I used to throttle a lot the Nexus 5, also de 5X and the 6P just browsing...etc.\n\nPixel 2 is the first one that I can't throttle so I never suffer performance hits.", "time": "11th January 2018, 11:51 PM", "postID": "post75166154", "replies": []}]}, {"text": "Hate love the camera. Good stills photo, terrible portraits (sometimes parts background aren't blurred at all).", "time": "1st April 2018, 06:24 PM", "postID": "post76090185", "replies": []}]}, {"title": "Community development strength", "rating": 3.5, "links": ["https://forum.xda-developers.com/pixel-2/review/community-development-strength-t3685572", "https://forum.xda-developers.com/pixel-2/review/community-development-strength-t3685572/page2"], "threads": [{"text": "How in the hell does Google let their devices languish in locked bootloader prison with carriers anymore? Why don't they give us the ability to root the phone if we're developers? You'd think you could just jump right in and unlock your bootloader on the Google Store purchased ones (unlocked ones - not Verizon trash) except they don't provide a cable TO CONNECT TO YOUR PC WTF WHY AM I YELLING", "time": "16th November 2017, 02:17 PM", "postID": "post74534643", "replies": [{"text": "am i missing something? i got my pixel 2 from google store, and unlocked / rooted it easily the same day i received it thanks to awesome members here at XDA\n\r\nit also included the necessary USB-C cable (and adapter to connect to type A usb ports)", "time": "16th November 2017, 04:57 PM", "postID": "post74536316", "replies": [{"text": "The cable I got was USB-C to USB-C to plug into the phone and the charging brick. The adapter I got was USB-C male/USB-A female so you could attach it to an old phone and transfer contacts. You telling me you got a cable/adapter that let you connect your new phone to your PC?? I'm even more pissed off if that's the case...poor distribution QA on top of the other issues too?!", "time": "23rd November 2017, 04:21 AM", "postID": "post74606287", "replies": [{"text": "I received the same as you.  I used the cable from my moto z2, not sure how it could have come with anything different than what we received.\n\r\nYes Google should have included a USB C to USB A male vs female for sure.", "time": "23rd November 2017, 12:21 PM", "postID": "post74609552", "replies": []}, {"text": "So Google is now responsible for you having a PC without the proper connections to plug your phone in?\r\nOr are they responsible for you not being able to order a Micro USB to USB C adapter for a few bucks?\n\r\nWhich one is it I wonder...", "time": "23rd November 2017, 01:29 PM", "postID": "post74610154", "replies": [{"text": "I really want you to be saying this in a sarcastic tone, but since this is the internet and I can't read tone I'm just going to fly into a rage instead.\n\r\nAre you seriously suggesting that once the pixel 2 comes out everyone on the planet immediately gained the ability to connect USB-C straight to their computers? Or is it that you are seriously suggesting that it is somehow nonsensical to at least include an extra adapter that mates this new cable type to everyone's existing computer connections? Yes we can purchase a crap-ton of adapters that get us from the phone to the ISS but for the minimal cost of this simple connection type and for the cost I paid I would expect that I would be able to connect my development machine to this device in the exact same fashion I've been able to connect EVERY OTHER DEVICE I'VE EVER HAD. They've all been able to connect to my PC out of the box. This is the first time I've opened a new device box and been at a loss for how to immediately get to working on it. Somehow I believe this was an oversight on the part of Google.", "time": "23rd November 2017, 02:47 PM", "postID": "post74610889", "replies": [{"text": "Sure sure. Totally an oversight on the part of Google that you did not check which accessoires come with the phone, totally agree.\n\r\nBTW, what do you think of the included headset? I think the volume is much too low, I can't hear anything. On the other hand, I never had the cables twisted yet!", "time": "23rd November 2017, 03:36 PM", "postID": "post74611370", "replies": [{"text": "I...         ... I'm dead.", "time": "23rd November 2017, 04:12 PM", "postID": "post74611768", "replies": []}]}]}]}]}]}]}, {"text": "My 200 dollar Acer laptop has a USB C port and the provided cable works fine for me. USB C is the modern standard that everyone is moving to. Is it that unreasonable to think that Google would provide cabling for the modern standard that most manufacturers are adopting?", "time": "23rd November 2017, 07:23 PM", "postID": "post74613640", "replies": []}, {"text": "I can't be more happy with this phone. \n\nThe only thing I'd improve is to have 4 years of Android updates instead of 3.\n\nIn development they will always be on the top because of the open binaries / developers previews etc. \n\nHowever....I think that over the last years security became a top priority and now a lot of people don't open the boot loader. Even Google disabled android pay when you open it.\n\nAnd the price is not in favour neither. I think Google needs to release a budget Pixel at lower price...something like 400-450$.", "time": "23rd November 2017, 10:24 PM", "postID": "post74615121", "replies": []}, {"text": "Theres the kernels and some homebrew ROMs.\n\r\nFeels like this device is hard to work on.\nTWRP now fails to decrypt after the February update.\r\nA/B partition seems hard to support so theres no official custom ROMs for Pixel 2.\n\r\nSo far this phone is not what I would recommend for the serial flashers and customizers.\r\nJust a normal phone for normal users.", "time": "6th March 2018, 10:32 AM", "postID": "post75790543", "replies": [{"text": "It's something we came up with at Citibank in about 1989 - update to an unused part of storage.  If it works, point whatever is using that part of the firmware at the update and use the place the old version sat as the next update space.  The update crashed right on the last byte?  No problem.  You haven't repointed to it, so it's just empty space until the next try.  Better than a bricked phone because the battery died right at the end of an update.  It's about time Google caught up to the late 80s.  (Yes, that was sarcasm.)  My only complaint is the SD card - I have to carry an adapter around with me, and keep the SD card and adapter in my pocket.  128GB internal and 256GB external would have been nice.  (I already have about 50GB used, and that's with only one TWRP backup.)\n\r\nMaybe it's time to flash a kernel with speed adjustment, although it seems to be idling around 430-450MHz.", "time": "18th March 2018, 07:42 PM", "postID": "post75934808", "replies": []}]}, {"text": "I see development at Linage, at AICP for our device.\nGApps are now available for Android 8.1. Many changes had to be made because of project Treble.\nThere is development, but for now many ppl look into things on their own and not as collective.", "time": "6th March 2018, 12:51 PM", "postID": "post75791876", "replies": []}]}, {"title": "Overall speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel-2/review/overall-speed-t3685573"], "threads": [{"text": "There is absolutely nothing I can throw at this phone to slow it down. With 4GB of LPPDDR4X RAM, this phone is a Monster. The 835 chip powering a 5\" 1080p screen is a great combination. Easily future proof for the next 3 years in Google's ecosystem. Now we just have to hope that 3rd part app developers keep optimizing for Android.", "time": "20th October 2017, 04:02 AM", "postID": "post74225640", "replies": []}, {"text": "It's stutters from time to time.", "time": "16th November 2017, 02:03 PM", "postID": "post74534494", "replies": []}, {"text": "It's the fastest phone I've ever used. With 2.45Ghz big cores , clean Android and 4GB of RAM it does everything action basically instantly", "time": "18th November 2017, 08:06 PM", "postID": "post74558571", "replies": []}, {"text": "Stock android... i love it.\n\r\nIts so incredibly smooth and fast. Never had any performance issues.", "time": "23rd December 2017, 11:29 AM", "postID": "post74937794", "replies": []}]}, {"title": "App launch speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel-2/review/app-launch-speed-t3685574"], "threads": [{"text": "It better launch fast with that chipset", "time": "16th November 2017, 02:03 PM", "postID": "post74534507", "replies": []}, {"text": "App launch speed is extremely fast. However I think this can still be improved by future Android releases. The SoC is already overkill for most of the tasks.", "time": "19th November 2017, 06:20 PM", "postID": "post74568522", "replies": []}]}, {"title": "Multitasking/RAM", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel-2/review/multitasking-ram-t3685575"], "threads": []}, {"title": "Scrolling smoothness", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel-2/review/scrolling-smoothness-t3685576"], "threads": [{"text": "Very smooth, really enjoying it.", "time": "19th October 2017, 05:35 AM", "postID": "post74213355", "replies": [{"text": "What about on apps that tends to be sloppy?", "time": "19th October 2017, 11:42 AM", "postID": "post74216343", "replies": [{"text": "The only app I have that exhibits strange scrolling behavior would be Firefox Developer. It scrolls smoothly, but doesn't register swipe intensity well. this only occurs in firefox, so i'm not faulting the phone, but i've sent a message to mozilla about it.", "time": "21st October 2017, 04:02 PM", "postID": "post74243081", "replies": []}]}]}, {"text": "Mine glides like butter, not sure what's going on with yours. I'm using Chrome btw.", "time": "19th October 2017, 12:47 PM", "postID": "post74216979", "replies": []}, {"text": "I have had intermittent scrolling issues on the pixel 2 when I hold it one handed and try to scroll with my thumb.  I realized it's because the base of my thumb is brushing the opposite side of the screen and preventing it from scrolling freely or clicking on something I didn't intend too.  I had to adjust the way I hold it.", "time": "30th November 2017, 04:00 PM", "postID": "post74691295", "replies": []}, {"text": "Choppy on Play store somehow...", "time": "29th December 2017, 08:00 PM", "postID": "post75006640", "replies": []}, {"text": "So far, my scrolling has been as smooth as butter on ice. The only app I have an issue with is UCCW. On my original Pixel, it's very smooth but on my new Pixel 2, it's incredibly choppy.  Like, the app scrolls smother on my old original Nexus 7 tablet and that thing runs incredibly slow now, lol. But other than that, everything else seems to run smooth.  Chrome, Home, Harmony, IFTTT, Stringify, Hue, Photos, Youtube, Amazon, Walmart, Arlo, my SMS app....everything is buttery smooth. Its just something about UCCW that makes it stutter really bad on my Pixel 2 but not the original. But I rarely have to open and use UCCW so it doesn't bother me.", "time": "5th January 2018, 06:29 AM", "postID": "post75083157", "replies": []}]}, {"title": "Heat", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel-2/review/heat-t3685577", "https://forum.xda-developers.com/pixel-2/review/heat-t3685577/page2"], "threads": [{"text": "Gets a bit warm, not over whelming, about the same as my Nexus 5X", "time": "19th October 2017, 05:33 AM", "postID": "post74213346", "replies": []}, {"text": "While it gets a touch warm - even when it was downloading and installing all 150 apps, 15GB of Google Play Music, with Folder sync doing data transfers it still stayed much colder than my Z5C ever did with a couple of minutes use.  That would probably burn toast!", "time": "22nd October 2017, 06:31 PM", "postID": "post74255818", "replies": []}, {"text": "I thought it got pretty warm, but idk. The material might have just transferred heat to my hand easier because my hand was sweating and you could see it on the back of the phone.", "time": "22nd October 2017, 07:18 PM", "postID": "post74256371", "replies": []}, {"text": "The phone gets REALLY hot when its constantly downloading something.", "time": "22nd October 2017, 11:44 PM", "postID": "post74258718", "replies": []}, {"text": "Anyone got any battery temps? If I run games for an extended period I end up around 43C. Cooler than my Moto X Pure which would hit like 47C.\n\nIdle and light use around 30-33C. The phone has never felt hot to me in any circumstances so far.\n\n\"Feels kinda warm\" isn't a very good measurement.", "time": "23rd October 2017, 04:29 AM", "postID": "post74260327", "replies": []}, {"text": "If anybody can provide heavy load or gaming temps I'd appreciate it. Also any additional info such as case or no case.", "time": "23rd October 2017, 05:45 AM", "postID": "post74260742", "replies": []}, {"text": "Usually if u charge and use a device at the same time that's when things get hot pixel 2 got warm enough to feel threw a tough spigen case wile browsing and charging nothin crazy", "time": "24th October 2017, 04:04 AM", "postID": "post74272726", "replies": []}, {"text": "Hmm not great. I came from a note 7 which was very warm to a note 8 which was ever so cool. Considering the pixel but the heat issue among other things is a right turn off.", "time": "24th October 2017, 10:28 AM", "postID": "post74275404", "replies": [{"text": "it will not get as hot as your note 7. note 7s had a few of them explode which just goes to show that sometimes the phone would get hella hot. not a lot of them did so it wasnt a huge problem when referring to how many blew up vs how many were sold but i presume higher than avg temps on all of them", "time": "24th October 2017, 09:08 PM", "postID": "post74282268", "replies": []}]}, {"text": "It gets hot sometimes even when you aren't doing anything.", "time": "16th November 2017, 02:04 PM", "postID": "post74534514", "replies": []}, {"text": "No heat issues so far. The best example for heat is to use Hangouts video calls. Generally with every previous phone I've owned I got a massive battery drain and heat when using FHD video calls. With the Pixel 2 the difference is huge. \n\nWe have to consider that this phone is easily ramping the big cores to 2.45Ghz and still maintains a good temp. I'm not suffering temp throttle like I was used after 5 minutes or more of continuous usage/browsing/etc.", "time": "19th November 2017, 06:18 PM", "postID": "post74568503", "replies": []}, {"text": "It only gets warm when charging. I did not experience any kind of extreme heat coming from the phone and im a heavy user.", "time": "23rd December 2017, 11:30 AM", "postID": "post74937800", "replies": []}, {"text": "Only gets really hot when using AR, not so during games", "time": "1st April 2018, 06:21 PM", "postID": "post76090161", "replies": []}]}, {"title": "Low light", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel-2/review/low-light-t3685578"], "threads": [{"text": "Samsung Galaxy S9 VS Google Pixel 2 Camera Battle:\nhttps://www.youtube.com/watch?v=E6pfvcy9Shk", "time": "4th April 2018, 11:38 PM", "postID": "post76126242", "replies": []}]}, {"title": "Photo quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel-2/review/photo-quality-t3685579", "https://forum.xda-developers.com/pixel-2/review/photo-quality-t3685579/page2", "https://forum.xda-developers.com/pixel-2/review/photo-quality-t3685579/page3", "https://forum.xda-developers.com/pixel-2/review/photo-quality-t3685579/page4"], "threads": [{"text": "Not taken by the \"average consumer\" but I have to admit that these picks are AMAZING!  Cant wait to have my 2XL in hand to test it out! https://9to5google.com/2017/10/07/go...mples-gallery/\n\n\nUpdated link with Full Res Pics\n\nhttps://photos.google.com/share/AF1Q...UwVlg2LUZESDhn", "time": "8th October 2017, 08:27 PM", "postID": "post74084944", "replies": []}, {"text": "I haven't taken more than a few photos, but oh my lord this camera is absolutely awesome. Depth of field trick is snazzy and works perfectly 99% of the time. Color accuracy on photos is mind-blowing.\n\nhttps://photos.app.goo.gl/AWwB8R1uW2CQJPBh1", "time": "22nd October 2017, 01:18 AM", "postID": "post74247832", "replies": []}, {"text": "Took some sample pictures with Pixel 1 and Pixel 2, compared images on PC, they look identical but some are better on Pixel 1. Pixel 2 colors are more saturated and there is no flare....", "time": "31st October 2017, 03:44 AM", "postID": "post74353657", "replies": []}, {"text": "I have been comparing the photos from the Pixel 2 to the iPhone 8 Plus if anyone is interested 😄\n\nDaylight and Night time", "time": "31st October 2017, 05:11 AM", "postID": "post74354106", "replies": []}, {"text": "Took pictures today after dusk, same thing. Most images look identical to Pixel 1, but when I zoom in I can see that lens on Pixel 1 is a little bit sharper with less noise. \nEdit: also noticed that automatic white balancing is off sometimes. Pixel 1 gets it right while Pixel 2 doesn't.\n\nBut all negatives are relatively small, I wouldn't say one is better then another", "time": "1st November 2017, 01:17 AM", "postID": "post74364154", "replies": []}, {"text": "I don't find the camera miles better than previous phones I've owned (S7, S8, 5s pixel port etc). But it's capable, fast, a good allrounder and DOF mode is okay for a single lens construction. Hdr+ is a joy and considered, that Google don't yet utilize the new chip empowering this function it's FAST. \n\nSendt fra min Pixel 2 med Tapatalk", "time": "2nd November 2017, 09:07 AM", "postID": "post74378008", "replies": []}, {"text": "I have been able to take amazing pictures with the N5,N5X,N6P and now with the Pixel 2. \nHDR+ does a great job in all these phones I owned. \nThe main quality difference between the N5 and the latest 3 I mentioned, are the megapixels. (But HDR+ quality was still solid in the old 5).\n\nThey main difference between the 5X/6P and the Pixel 2 is the speed to take photos, launch the camera, focus and process the HDR+ but the quality is really close. \n\nI've decided to stick with HDR+ enhanced (which is similar to the old HDR+ in the Nexus) to minimise the risk of getting unfocused areas that sometimes with the HDR+ are not so detailed. So I'm sacrificing speed to capture photos to try to get always a perfect HDR+ shot.", "time": "4th November 2017, 11:25 PM", "postID": "post74408337", "replies": [{"text": "do you think it's better then middle range budget mirrorless camera ?", "time": "5th November 2017, 02:08 AM", "postID": "post74409631", "replies": [{"text": "I don't know because I stopped using cameras for my trips, since I got a Nexus 5 with HDR+ and before that I mostly used the typical compact Sony cyber shot with Carl Zeiss lense. \n\nAnd I only regret to use smartphone as main camera when I switched from the N5 to Z5 Compact and went to Paris and took ugly photos. Specially nightly photos and closeup photos. This is the main reason I sold that phone after 6 months and went for the 5X.\n\nProbably you can get better details with those cameras you mention. But there are some key features in HDR+ (this is all post processing) that do a lot of magic: \n\n- Focus in most of the areas. (You can focus on a person's face and still capture the details behind a window that points to the street / or the clouds in the sky/ or other faces; as if you had focused directly on that window or clouds). \n- More dark skies at night. The night photos look amazing. Nightly skies try to be converted to a more solid dark colour. \n- Same good quality with sunny photos that have a lot of sunlight or sun rays and you can't see well trough the camera app when taking the photo because of the high brightness. After HDR+ you could have a good result more opaque.\n\nOther things I like from the latest Google phones cameras: \n- Panoramas. Sometimes I take a panorama with just 1 captured image, because of the increased FoV to fit a building. And sometimes you need to take more than 1 because the building still doesn't fit.\n\n- Capture photos when walking: In previous HDR+ Nexus cameras when you press the shutter, camera starts capturing and you can have blurry photos if you were moving. In The Pixel 2 when I press the shutter of the camera (also walking and with HDR+ enhanced) phone camera blocks and take some time to capture to maximize the possibility of a crisp shot. (And if you press the shutter and starts shaking the camera it won't capture till you stop shaking)\nSo I'm taking photos when I don't have time to stop now. \n\n- Minimum focus distance: I love close-ups / macro shots and the latest Google phones had a good minimum focus distance and mixed with HDR+ the result is amazing.\n(The Z5 Compact I owned used to have a wide angle but terrible minimum focus distance I hate this). \n\nWhat I don't really care is the new portrait mode. You get 2 photos when using it. With blurry unfocused areas and the original with no blur. I think this is only useful for CV photos or some close-ups or special cases. There is a lot of people that loves this feature. I personally prefer the photo that contains more data for 99% of my captures.", "time": "5th November 2017, 06:39 AM", "postID": "post74410909", "replies": []}]}]}, {"text": "Absolutely love the camera on my Pixel 2. Below are some examples shot really quickly from The Shard in London.\n\r\nI had the iPhone 8 plus briefly and although similar, I'd probably say the Pixel 2 is a bit better, I also think the portrait mode is insanely good considering it only has one camera!", "time": "5th November 2017, 05:57 PM", "postID": "post74416678", "replies": []}, {"text": "Pixel 2 vs Pixel 1 (Auto, flash off, lens clean, no case)\n\nhttps://photos.app.goo.gl/FTyfRvJHxWAx38e93", "time": "5th November 2017, 06:27 PM", "postID": "post74416987", "replies": []}, {"text": "Very happy with the camera.", "time": "7th November 2017, 01:12 PM", "postID": "post74435639", "replies": []}, {"text": "took pixel 2 for a two weeks Europe trip, omg! The pictures are amazing!!!!", "time": "7th November 2017, 07:30 PM", "postID": "post74439662", "replies": []}, {"text": "When I wanted to check the photo quality on the big screen, I realised that the uploads to Google Photos are compressed. The settings menu only offers the options compressed & unlimited or uncompressed & limited to your 15 GB quota.\n\r\nAnyone else noticed this?\n\r\nSidenote: I tried to take photos of a sunrise on a cloudy day, and the quality wasn't nearly as good as expected after the raving reviews. What's more, the difference between normal, hdr+ and hdr+ enhanced are, at least on the P2's own screen, absolutely marginal.  I'm a bit confused about this. \r\nAnyone else could try to replicate this?\n\r\nI'll have another go as soon as a sunrise presents itself.", "time": "11th November 2017, 11:11 AM", "postID": "post74477604", "replies": []}, {"text": "Anyone have these strange bands when they take a pic of their television screen?  They come and go depending on the focal point (usually go away when focused off screen).  I never saw these with my S6.  Maybe it's just my tv?  Maybe the camera is so good it's picking up something with the refresh?", "time": "11th November 2017, 04:15 PM", "postID": "post74480266", "replies": [{"text": "This usually happens when the shutter speed go higher than the screen refresh rate 1/50 or higher.", "time": "11th November 2017, 05:36 PM", "postID": "post74481033", "replies": [{"text": "Ok thanks makes sense.  There's no way to change the sutter speed on the google camera that i've found or have i missed something?", "time": "12th November 2017, 10:57 PM", "postID": "post74494570", "replies": [{"text": "I think if you click around on the object and the auto focus might change shutter speed depending on the conditions.\n\n Otherwise, unfortunately you have to live with it, people have been taking photos of televisions for decades and there has always been the screen door/refresh rate effect.", "time": "13th November 2017, 03:32 AM", "postID": "post74496137", "replies": []}]}]}]}, {"text": "I have strange blue \"blick/dot\" if I try to take picture pointing to the sun. ( see attached image ) Any idea why is that?\nOther pictures looks great\nhttps://drive.google.com/file/d/1egk...Nyca5tZ3z/view", "time": "12th November 2017, 12:00 PM", "postID": "post74488362", "replies": [{"text": "Normal lens flare from the sun.", "time": "12th November 2017, 12:19 PM", "postID": "post74488510", "replies": []}]}, {"text": "Yeah, but I was a bit surprised, why it's blue always\nNot nice white flare look", "time": "12th November 2017, 12:25 PM", "postID": "post74488567", "replies": []}, {"text": "Hi guys, although I'm pretty happy with photo quality from the stock app sometimes I need to lock focus or change exposure time. Coming from V20 where manual mode was massive and I miss it a lot. Can you recommend some third party app with good photo quality and rich features? I saw Open Camera but it has not been updated for a long time now...\nHere's some pics I took with pixel2, nothing special to be honest, all took with auto/portrait mode.\nhttps://photos.app.goo.gl/OZ3p4IkFoq40rbeF3", "time": "6th March 2018, 07:05 AM", "postID": "post75788905", "replies": []}, {"text": "What settings are people using for their camera...particular for general everyday use?  I am quite satisfied with default...except when using the zoom.  Anything more than 0 zoom introduces a lot of pixelation and lack of detail.  I'm assuming it is digital zoom only but it is almost not usable for me at all...especially compared to the HTC One M8 that it replaced (where the camera resolution was it's weakness at the time).  Am I doing something wrong or should zoomed photos at least be decent?  Thanks in advance for any tips/recommendations.", "time": "10th March 2018, 07:13 PM", "postID": "post75842194", "replies": []}, {"text": "Just a few winterland photos, taken just for get a clear picture on how the camera module in the Pixel 2 can handle bright light sources that \"collides\" with the sensor.\n\nEven though the aperture is fixed and non-tweakable (lucky SGS9 owners for this feature, damnit) I have to say that the camera in my Pixel 2 impresses more and more on me. Those shots is a solid proof (at least for me) on that Google have made some incredible smart and bloody futureproof design choices when creating the software algorithms that is powering this beast on the camera side.\n\nI really hope that the Pixel 3 will take the same route and double and fine tune it to perfection!", "time": "15th March 2018, 09:49 PM", "postID": "post75902940", "replies": [{"text": "That's an insane amount of snow! Where are you and will Spring ever come? lol", "time": "2nd April 2018, 10:14 PM", "postID": "post76102914", "replies": [{"text": "I am living in Sweden, and yes believe me, we have a shitload of snow yet left. 😁", "time": "2nd April 2018, 10:31 PM", "postID": "post76103049", "replies": []}]}]}, {"text": "Stellar camera!!!\n\nVerstuurd vanaf mijn Pixel 2 met Tapatalk", "time": "18th March 2018, 10:00 PM", "postID": "post75936041", "replies": []}, {"text": "Samsung Galaxy S9 VS Google Pixel 2 Camera Battle:\nhttps://www.youtube.com/watch?v=E6pfvcy9Shk", "time": "4th April 2018, 11:38 PM", "postID": "post76126241", "replies": []}]}, {"title": "Video quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/pixel-2/review/video-quality-t3685580", "https://forum.xda-developers.com/pixel-2/review/video-quality-t3685580/page2"], "threads": [{"text": "I am particularly interested in low-light videos of both devices and the audio quality. From a few samples i could check on YouTube i suspect problems with the noise suppression at least on the XL. Trying to  assemble examples in this thread: https://www.reddit.com/r/GooglePixel...ght_and_audio/\n\nSoo.. get your samples out to the world!", "time": "21st October 2017, 07:35 AM", "postID": "post74238832", "replies": [{"text": "Here is a quick video on how I shoot really good low light video. https://youtu.be/YnBjJeMJ6Po\r\nSee if this helps. \n\r\nOverall the video quality of the Pixel 2 is mind blowing I think. For a phone this thing is incredible. Ive been vlogging on this thing and really impressed with the quality. \nhttps://youtu.be/lYmMQRHMiSI\nhttps://youtu.be/OFlP5bWQkYQ", "time": "6th January 2018, 06:01 PM", "postID": "post75102885", "replies": [{"text": "Your video in the dark is superb, I tried the apps you listed.. the Cinema 4k app looks best on my Pixel 2 I just wish you could use 60fps as i like the way it looks", "time": "24th January 2018, 08:32 AM", "postID": "post75314239", "replies": [{"text": "Yeah I would love to see 60 or 120 fps but I cant seem to get any response from the app developer.", "time": "24th January 2018, 03:02 PM", "postID": "post75317895", "replies": [{"text": "Is that the berst app you use then? \n\r\nim going to try to learn how to do this better.. got to start somewhere i suppose!", "time": "24th January 2018, 03:10 PM", "postID": "post75317953", "replies": [{"text": "Yes. Cinema 4k for me is the best. Open camera is also good but has no noise reduction. Cinema 4k has really good noise reduction. Filmic pro isnt worth it for me. The quality is just mush compared to what you get on Cinema 4k no matter what color profile or bitrate you use.", "time": "25th January 2018, 06:22 PM", "postID": "post75331356", "replies": []}]}]}]}]}]}, {"text": "https://youtu.be/bBQgX_2s9uE", "time": "10th November 2017, 02:36 PM", "postID": "post74469338", "replies": []}, {"text": "Absolutely amazing video quality. Its so fast and the auto focus is perfect in my opinion.", "time": "23rd December 2017, 11:33 AM", "postID": "post74937821", "replies": []}, {"text": "I love this camera so much. New video messing around with bokeh https://youtu.be/4u0pa3rBAyI", "time": "21st January 2018, 08:56 PM", "postID": "post75285961", "replies": []}, {"text": "I made this video with my Pixel 2. Im pretty satisfied with the quality considering the low light but the sound could be a bit better. But it was really loud there. So maybe that was the issue.\n\nhttps://youtu.be/_Ie8UiQbgjk", "time": "23rd January 2018, 08:23 AM", "postID": "post75302114", "replies": []}, {"text": "I love this, auto focus works good.\r\nIts quality too.", "time": "5th March 2018, 05:42 AM", "postID": "post75776550", "replies": []}]}, {"title": "Selfie quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/pixel-2/review/selfie-quality-t3685581"], "threads": [{"text": "The stock camera app is great, it makes beautiful pictures.\n\r\nThe thing i noticed which is really really bad is using the camera of other apps like snapchat, instagram, facebook. The color calibration or correction does something weird. It makes my pictures look very odd and not detailed in any way.", "time": "23rd December 2017, 11:32 AM", "postID": "post74937814", "replies": []}]}, {"title": "Time to take picture (camera launch speed)", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel-2/review/time-to-picture-camera-launch-speed-t3685582"], "threads": [{"text": "Having used the Pixel 2 in a Verizon store, this aspect of the phone looks VERY promising. Leaps and bounds faster than my Nexus 6P.", "time": "18th October 2017, 09:49 PM", "postID": "post74210258", "replies": []}, {"text": "Camera launch is actually the fastest I have ever seen on a smartphone, also faster than iPhone 8 Plus.", "time": "4th November 2017, 12:02 AM", "postID": "post74398327", "replies": []}, {"text": "No issues whatsoever with bringing the camera up.  I love the double press the power button to start the camera; so much more fluid than the ridiculous swipe gestures I could never get to go right on iOS.", "time": "5th November 2017, 11:08 PM", "postID": "post74419119", "replies": []}, {"text": "Camera launch speed is really fast (for now... The phone is still new).\n\nCamera was really slow in my Nexus 6 and 6P.  I was always missing occasions. Took almost 5 seconds every time to be ready to take a shot.\n\nNow it's about 1 second at most.", "time": "19th November 2017, 03:01 PM", "postID": "post74566476", "replies": [{"text": "My camera of pixel 2 is crashing", "time": "5th February 2018, 07:12 AM", "postID": "post75451738", "replies": [{"text": "You could try deleting apps data and cache", "time": "18th March 2018, 03:48 AM", "postID": "post75927352", "replies": []}]}]}, {"text": "I figured I'd time the camera \"zero to picture\".   No way, it's too fast.  200ms?  It's faster than I am, so I'm the limit in how fast I can get a picture, the app is no limit at all.", "time": "18th March 2018, 07:24 PM", "postID": "post75934627", "replies": []}, {"text": "Undoubtedly, Google has taken AI into a smartphone camera to another level.", "time": "26th March 2018, 06:03 AM", "postID": "post76018829", "replies": []}, {"text": "1-2 seconds using double press power button", "time": "1st April 2018, 06:22 PM", "postID": "post76090175", "replies": []}]}, {"title": "Software (ease of use, features, etc)", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel-2/review/software-ease-features-t3685583"], "threads": [{"text": "no professional mode on camera", "time": "19th December 2017, 08:58 PM", "postID": "post74901180", "replies": []}]}, {"title": "Charging speed", "rating": 4.0, "links": ["https://forum.xda-developers.com/pixel-2/review/charging-speed-t3685584"], "threads": [{"text": "I am horrifically disappointed in this device's charging speed.", "time": "16th November 2017, 02:05 PM", "postID": "post74534525", "replies": [{"text": "what is your best result? I saw some videos comparisons and pixel was the latest one(", "time": "22nd November 2017, 09:37 PM", "postID": "post74603967", "replies": [{"text": "It takes hours to get to 100%. I recently got hold of a USB-A to USB-C cable and plugged the phone into my Nexus 6 brick. The difference was astounding. Full charge in about 1.5 hours. It's sickening that I spent the money on this phone only to have it be so disappointing. I'm a diehard Google fanboi but this is ridiculous.", "time": "23rd November 2017, 04:14 AM", "postID": "post74606257", "replies": []}]}]}, {"text": "I was very pleasantly surprised by how fast this phone charges, untill the past few days.  Now all the sudden it seems very average.  \"Charging Rapidly\" is not anywhere near as impressive now as it was.  Has anyone else experienced this?  I want to figure out if it's just the phone (I have seen other slow charging complaints but not this specifically), or if I caused it.  \n\nI installed that stock kernel with security pass patch, twrp beta1, Magisk 14.4.2, and Viper4Arise.  Pretty confident that it's not any of those things, but everything else is pretty standard.\n\nThis is the case with the charger that came with the P2 in box, the older N5x charger, and the usb-c car charger.  I know the new P2 one is stronger, but the change is noticable all around.", "time": "21st November 2017, 01:27 PM", "postID": "post74587461", "replies": []}, {"text": "My 'Charging Rapidly' also does not seem to be all that rapid, using the charger that came in the box and can take quite a while to get to 100%.", "time": "21st November 2017, 05:29 PM", "postID": "post74590107", "replies": []}, {"text": "Definitely miss my 1+5  dash charge. Damn that thing was fast.", "time": "23rd November 2017, 10:23 PM", "postID": "post74615114", "replies": []}, {"text": "Some numbers, today I connected my phone at 19% with stock charger.\n- 30 min charge: 19% to 56%\n- 40 min charge: 19% to 67%\n\nI don't think that's bad, it's definitely not FAST, nor regular. But considering all the issues the 6P had with batteries, I don't really want to charge my battery in less than one hour. (Specially now that the phone has at least 3 years of updates, I'd like to have 90% of battery life or more in 3 years)\n\n\nI'll have to do another test, something like from 35% to 80% (this would be more real life, I only need a 2nd charge when I'm traveling in a city with a power bank, using Maps and Camera all the time). \n\nUltra fast charging and wireless charging are some of the features that I care less in the phone. I want some fast charging between 30% and 90%, but I don't require it to be extremely fast. \n\nTL : DR: If you value an ultra fast charging over other things in a phone, definitely skip the Pixel 2.", "time": "24th November 2017, 11:40 AM", "postID": "post74619813", "replies": []}, {"text": "p2's charging current is capped at 2700ma (could be up to around 3200ma by kernel hax), meanwhile high battery temperature (over 45 Celsius degrees) and others things such as screen state will cap the current more (half or more)\nWithout those restricts, fully charge time should be around a hour.", "time": "27th November 2017, 08:26 PM", "postID": "post74658995", "replies": []}]}, {"title": "Screen on time", "rating": 4.0, "links": ["https://forum.xda-developers.com/pixel-2/review/screen-time-t3685585", "https://forum.xda-developers.com/pixel-2/review/screen-time-t3685585/page2", "https://forum.xda-developers.com/pixel-2/review/screen-time-t3685585/page3", "https://forum.xda-developers.com/pixel-2/review/screen-time-t3685585/page18"], "threads": [{"text": "Outstanding. 3h 45m SOT over 9 hours and 49% left still", "time": "19th October 2017, 10:29 PM", "postID": "post74223659", "replies": [{"text": "Awesome. Sounds like at that rate it would just break 7 hours SOT. Thats amazing for an 800 series on such a small battery, imo.", "time": "19th October 2017, 10:34 PM", "postID": "post74223693", "replies": []}]}, {"text": "I finally charged around 2am at 5% after clocking 5 hr 52 m SOT", "time": "20th October 2017, 11:59 AM", "postID": "post74229019", "replies": []}, {"text": "Today is overcast and rainy in Portland (surprise)\nSo I've only had to keep brightness between 20-40%\nI am extremely happy about battery life. \n\n45% left with 4 hours 40 minutes SOT. Today has been very average in terms of my usage, light gaming, light social media, light browsing and moderate GPS navigation. \n\nhttps://photos.app.goo.gl/cxaW1NAQAD2y4Yyt1\n\nI'm on track to hit 8-9 hours SOT with pretty good usage across the board. Screen legibility at 30% brightness is awesome too! Have had no problems reading text or watching videos/taking pictures. There was one time I was sitting in a cafe directly under a bright light and I had to turn brightness up to 60%. I've still never had to crank it to 100% yet.", "time": "22nd October 2017, 01:12 AM", "postID": "post74247807", "replies": []}, {"text": "Screen on time, on wifi, has been awesome. Over 6 hrs last charge, today, over 4 hrs and at 65% remaining.", "time": "22nd October 2017, 07:32 AM", "postID": "post74249805", "replies": []}, {"text": "6 hours sot", "time": "25th October 2017, 06:36 AM", "postID": "post74286091", "replies": []}, {"text": "How are you people getting such massive SoT? I got 3h 20m with about 19h usage yesterday.\nThe current status looks like 1h sot in 9h usage (mostly overnight). I had always-on on. Screenshots attached.\nI installed naptime now to see if that helps.\nHow do I check if the battery health is ok? I used accubattery which says about 92% health, is that normal or inaccurate measurement?", "time": "25th October 2017, 10:48 AM", "postID": "post74287945", "replies": []}, {"text": "I got a little over five hours SOT with 2% left last night.  Forgot to get screenshots.  I was running at 50% brightness and have almost all of the \"marketed\" features turned on.", "time": "25th October 2017, 04:35 PM", "postID": "post74291338", "replies": [{"text": "How many hours between last full charge & 2% for you? I have 3h sot, 16h since last full charge and 18% remaining. I am concerned about it now and need to figure out quickly whether I should return it.", "time": "25th October 2017, 05:11 PM", "postID": "post74291768", "replies": []}]}, {"text": "Yep thats exactly correct.", "time": "25th October 2017, 07:32 PM", "postID": "post74293348", "replies": [{"text": "Any update?", "time": "26th October 2017, 02:56 PM", "postID": "post74302229", "replies": []}]}, {"text": "No. I use adaptive brightness and if it becomes too bright sometimes I manually reduce it. I will take screenshots again today.", "time": "26th October 2017, 08:49 AM", "postID": "post74298895", "replies": [{"text": "From what I was told some time ago, adaptive brightness uses a sensor, requiring some (a lot? A little?) battery use there. I don't know if it is much... if it counteracts the point of adaptive brightness or what.\n\nPersonally, I just use the lowest tolerable brightness, manually adjusted as needed (which isn't too frequent, honestly), and I think I get the best battery I can from the screens I use.\n\nMight be worth testing the two out see if manual helps any.", "time": "26th October 2017, 03:17 PM", "postID": "post74302453", "replies": []}]}, {"text": "Okay, didn't think about that but i anyway disabled adaptive brightness in the morning today. Have 2.5h SoT, 15.5h uptime so far (since last full charge) and 42% battery remaining.  With this rate it is likely to be slightly under 5h SoT which is still lower than what most people are reporting.\nI also installed accuBattery to check battery health and it estimated it to be 91%, are these estimates usually correct? Should I be concerned?", "time": "26th October 2017, 03:39 PM", "postID": "post74302739", "replies": [{"text": "The other battery saver I saw posted, and it seems to be a big deal for the pixel 2... Turn Always On Display off. In the settings it even says it eats battery. Lol.", "time": "26th October 2017, 04:35 PM", "postID": "post74303418", "replies": []}]}, {"text": "Not as great yesterday.   I've never been able to get massive SOT out of any phone I've owned (S6, HTC One X) when compared to some of the times I'd see here on XDA.  Here's what I got yesterday.", "time": "26th October 2017, 05:01 PM", "postID": "post74303741", "replies": []}, {"text": "I'm really impressed with battery life. I was a little worried about the battery size of the Pixel 2, but things seem good.", "time": "27th October 2017, 05:42 PM", "postID": "post74316141", "replies": []}, {"text": "Screen on time is not a very comparable measure across users.  One person could have the screen on to watch a video with the file on the device and another person could be playing a high-end game.  They will have very different screen on times.", "time": "27th October 2017, 10:00 PM", "postID": "post74318670", "replies": [{"text": "True. However, I am concerned because I hardly use my phone for any processor intensive app or game or anything like that. Basic browsing, Facebook, Whatsapp, Spotify etc.", "time": "28th October 2017, 12:18 AM", "postID": "post74319628", "replies": [{"text": "Many social media type apps have bad reputations for battery drain.  For example, https://www.lifewire.com/how-faceboo...attery-3880043", "time": "28th October 2017, 12:47 AM", "postID": "post74319813", "replies": []}]}]}, {"text": "Pixel 2 5\" -\n\r\nThis was the end of my first day, during which I installed approximately 70 apps over WiFi (the rest I had the night before prior to charging overnight), as well as watching a few YouTube videos.\n\nhttps://i.imgur.com/lmsU0H4.png\n\r\nToday, I setup all my apps (logged in, updated passwords, etc.), watched some more YouTube videos, browsing, etc.  Even did some voice texting with the Assistant while I was walking to lunch, which was pretty cool.  I expect I'll surpass six hours before bedtime no problem (3+ hours away).\n\nhttps://i.imgur.com/KWKEOEb.png", "time": "28th October 2017, 02:03 AM", "postID": "post74320188", "replies": []}, {"text": "I wonder how Pixel 2 compares to Pixel 1 XL as far as battery goes? My Pixel 1 XL is about the minimum I would want in my battery, but due to newer and more efficient hardware perhaps Pixel 2 is roughly the same?\n\nAny comments on this? I am not a big fan of 2 XL this year and have an ability to pick up regular 2 almost for free, but I am not sure it's a good idea due to 2770 battery vs 3500 that I have now in 1 XL", "time": "30th October 2017, 02:31 PM", "postID": "post74346956", "replies": []}, {"text": "Only get this SOT on my pixel 2. 3 hours top\n\r\nShould I make reports to Google?", "time": "29th March 2018, 05:05 AM", "postID": "post76052768", "replies": [{"text": "Sounds more like that you have not optimized your system and is all stock.", "time": "29th March 2018, 04:43 PM", "postID": "post76058384", "replies": [{"text": "Do you mind sharing the tricks or link that you can refer to? I'm kinda new to using this Google's phone and  still yet to get the best of it (beside the camera)\n\r\nThank you.", "time": "29th March 2018, 04:55 PM", "postID": "post76058502", "replies": [{"text": "1) Disable everything in the settings app that you doesn't use and manually enable them when needed.\n\n*Advanced steps*\n\n2) Root and \"debloat\" your ROM of choice.\n3) Unlock the bootloader and flash a custom kernel.", "time": "29th March 2018, 07:12 PM", "postID": "post76059873", "replies": [{"text": "Is this okay though?\n\nI've already done the 1st step (still considering the rooting steps)\n\n\n\nIf it doesn't load: 25% remaining after 11h29m last full charge and 3h34m screen usage", "time": "1st April 2018, 07:39 AM", "postID": "post76084885", "replies": [{"text": "For getting more screen on time - you need a custom kernel that gives you full control over the hardware, so you can adjust it toward battery life, by finetuning the kernel.", "time": "1st April 2018, 10:24 AM", "postID": "post76086062", "replies": []}]}]}]}]}]}, {"text": "I disagree with the above. Pixel is already running barbone Android. The ONLY thing you can \"debloat\" is around 100mb. Maybe the Google Play movies and two or three iterations of keyboards. Custom kernel is a good move, but even without it I can safely hit~4 5/ 5 hrs of SoT on an average day. Search for rogue apps and if possible, do a factory reset.", "time": "1st April 2018, 03:54 PM", "postID": "post76088755", "replies": []}, {"text": "3-3.5 hours, 5\"", "time": "1st April 2018, 06:14 PM", "postID": "post76090096", "replies": []}, {"text": "My best so far that I noticed was 5h SOT with 52% left. According to GSam my average is 6h SOT and 1d 17.9h. Wifi/GPS/Bluetooth always running. I have very few apps installed, and I spend a lot of time initially setting things up to tune for low battery consumption.", "time": "3rd April 2018, 07:35 PM", "postID": "post76112777", "replies": []}]}, {"title": "Standby drain", "rating": 3.5, "links": ["https://forum.xda-developers.com/pixel-2/review/standby-drain-t3685586", "https://forum.xda-developers.com/pixel-2/review/standby-drain-t3685586/page2", "https://forum.xda-developers.com/pixel-2/review/standby-drain-t3685586/page3", "https://forum.xda-developers.com/pixel-2/review/standby-drain-t3685586/page7"], "threads": [{"text": "Stand by amazing like international s2 amazing when the phone locks and goes to sleep even with all the listening it's doing this thing is solid ur at 5 percent and u lock ur phone u can guarantee that it won't move for a few hours", "time": "24th October 2017, 01:11 AM", "postID": "post74271767", "replies": []}, {"text": "Went to be with 93% woke up 7 hours later with 93%.", "time": "24th October 2017, 02:33 PM", "postID": "post74277652", "replies": [{"text": "Do you have auto sync disabled or something?", "time": "26th October 2017, 09:17 PM", "postID": "post74306539", "replies": [{"text": "Nope, everything enabled.", "time": "26th October 2017, 09:21 PM", "postID": "post74306579", "replies": []}]}]}, {"text": "Night 1, went from 55% to 47% in 8 hours. Hoping this is an anomaly and it gets better tonight. It's not terrible, but not great either, and not consistent with other reports I've heard.", "time": "24th October 2017, 03:17 PM", "postID": "post74278196", "replies": []}, {"text": "Mine is average 7-10% overnight drain. Have had the phone for 3 nights. Will continue monitoring", "time": "25th October 2017, 06:24 PM", "postID": "post74292585", "replies": []}, {"text": "I noticed when my phone was not fully charged , around 94 percent , I lost 8 percent overnight . Gonna do a full charge tonight and see if another drain happens", "time": "27th October 2017, 04:30 PM", "postID": "post74315337", "replies": []}, {"text": "From 11pm to 7am overnight the battery dropped from 90% to 80%", "time": "27th October 2017, 06:08 PM", "postID": "post74316439", "replies": []}, {"text": "I tried with and without ambient for my standby average. \n\nWithout ambient it took 4% for 8 hours\nWith ambient it took 5% for 8 hours", "time": "27th October 2017, 06:39 PM", "postID": "post74316798", "replies": []}, {"text": "I am a very light phone user, I went to bed at 100%, woke up at 100% , just now reached 90%!", "time": "27th October 2017, 08:06 PM", "postID": "post74317651", "replies": []}, {"text": "I'm averaging a little over 1% / hour drain overnight.  Looking at GSAM battery monitor,  there's a small spike in battery usage at regular intervals.  This even happened in safe mode.", "time": "27th October 2017, 09:26 PM", "postID": "post74318418", "replies": [{"text": "I tried Greenify and drain went down to about 0.4% / hour overnight.  I'm not sure if the difference is Greenify or turning off Always on Display.", "time": "2nd November 2017, 06:17 PM", "postID": "post74383804", "replies": []}]}, {"text": "So in other words, it doesn't hold charge during standby any better than other phones in this segment. My Honor 8 will only drop 3-5% overnight and it has numerous accounts set to auto-sync.", "time": "2nd November 2017, 05:20 PM", "postID": "post74383135", "replies": []}, {"text": "See my Screenshots below. That's what I am expecting from a standby behavior. When I'm done using my phone, there is almost no drain over a long period of time (like over night or during work). \n\nHow did i achieved this? I've disabled for certain apps the background app refresh, like on the battery consuming app Facebook - app keeps updating your timeline. ...or Whatsapp - app keeps downloading photos and text messages in the background...\n\nAll other pixel related features like always on display or playing now are still enabled. Expect OK Google, I prefer the active Edge activation.\n\nI have also the newest official Software update installed with display color fix, (working) NFC buzz fix and November security patch. Build OPD1.170816.025", "time": "9th November 2017, 05:57 AM", "postID": "post74455112", "replies": []}, {"text": "Always plug in over night, but in morning when I unplug, minor use for 3-4 hours still says 100%. NEVER got this good on my Pixel 1 or Nexus 6p. I have several push email accounts and background news, but ZERO social media apps loaded.", "time": "11th November 2017, 01:47 PM", "postID": "post74478904", "replies": [{"text": "Same here and i was worry about the small battery in this phine but it seems it's better than what i expected.", "time": "11th November 2017, 03:19 PM", "postID": "post74479743", "replies": []}]}, {"text": "100% at 11pm Las night woke up at 7:30am so 8 and a half hours later at 100%. Didn't even know that was possible. (No always on display of course)", "time": "12th November 2017, 12:45 PM", "postID": "post74488741", "replies": []}, {"text": "Just noticed an hour and a half after I unplugged my phone that the phone showed \"13 min since last full charge\" and the phone showed \"100% battery life\", thought it didn't make sense as already had about 20+ minutes of screen on time and was using Bluetooth. I restarted my phone and found the battery was at 98% then within a few minutes drained to 95%, but when I restarted it the battery stats showed \"last full charge 0 minutes ago\".", "time": "12th November 2017, 01:57 PM", "postID": "post74489418", "replies": []}, {"text": "I'd guess if your batter is showing 100% after a few hours of use, the battery is miscalibrated rather than having super low drain.", "time": "12th November 2017, 04:33 PM", "postID": "post74490964", "replies": [{"text": "I think so too.\n\r\nIf I go to bed at 100%, I wake up 7 hours later at 100%. Anything below 100% I will lose about 2-5% in 7 hours overnight. No always on display, all auto-sync enabled.", "time": "13th November 2017, 03:22 PM", "postID": "post74501166", "replies": []}]}, {"text": "I left my charger at work last night and was down to 8% when I set airplane mode and went to bed. Luckily my wife was up with the baby and woke me up on time this morning because my $1000 phone was dead.", "time": "16th November 2017, 02:09 PM", "postID": "post74534565", "replies": [{"text": "The Pixel 2 costs $650... What phone are you taking about?", "time": "29th November 2017, 09:42 PM", "postID": "post74683522", "replies": []}]}, {"text": "I think I'm not having an excellent standby time but probably this is because of the active display. Standby time is ok anyway so nothing really bad. But I do lose some % at night. Probably some apps draining. \n\n8.1 DP here.", "time": "17th November 2017, 08:01 AM", "postID": "post74542237", "replies": []}, {"text": "Dropping by to say that I have the exact same experience, here are my findings:\n\n- Google Play Services in System is the source of the drain\n- If I reboot my phone the drain stops\n- If I'm not on wifi the drain does not occur\n- The drain restarts when I'm on wifi and connect my phone to the charger\n\nLet me know if anyone else can confirm these happenings", "time": "18th November 2017, 06:41 PM", "postID": "post74557834", "replies": []}, {"text": "Standby battery drain will also be materially affected by the strength of the mobile signal when the phone happens to be. In weak signal areas you'd be surprised how much extra power the phone may use trying to 'keep in touch' with the cell towers. This is so the network knows where the phone is in case it needs to deliver a call or sms. Not sure where this drain is actually reliably revealed in the UI.", "time": "21st November 2017, 12:20 PM", "postID": "post74586854", "replies": [{"text": "This is true, except the fact that I got a RMA device which gets HALF of the battery my original device got. My lifestyle has not changed, I still work mornings in my condo, then walk to my business in the afternoon. The use has been the same as the previous device but battery runway has been cut in half? WTF.", "time": "29th November 2017, 05:47 PM", "postID": "post74681242", "replies": []}]}, {"text": "Turn off \"Always on\" in Ambient display and battery stayed 100% for 5 hours after unplugging charger.\r\nPretty happy with this performance, especially compared to my old 6P.", "time": "29th November 2017, 04:35 PM", "postID": "post74680503", "replies": []}, {"text": "It's Wifi for me. Betterbatterystats shows \"Wifi On\" and \"Wifi Running\" at 100% everytime I check summary stats. Anyone have any ideas on this? I already did a network settings reset and am still getting it. I did not get this on my first pixel 2 before RMA'ing it.", "time": "29th November 2017, 09:20 PM", "postID": "post74683325", "replies": [{"text": "In settings, search for WiFi scanning\n\r\nTurn that and Bluetooth scanning off and it will go away", "time": "30th November 2017, 05:41 AM", "postID": "post74686316", "replies": []}]}, {"text": "Oops, quoted wrong post originally. Sorry. \n\nWho only has 1 charger?? Lol", "time": "30th November 2017, 04:48 PM", "postID": "post74691826", "replies": []}, {"text": "Mine is currently losing 10% charge an hour while idle. I've only had my pixel 2 for a week", "time": "7th February 2018, 05:39 AM", "postID": "post75474591", "replies": []}, {"text": "Somebody posted this thread for tracking battery drain after the march update:\nhttps://forum.xda-developers.com/pix...0#post75793230\n\nHave any of you experienced improvements?", "time": "6th March 2018, 05:33 PM", "postID": "post75795014", "replies": []}, {"text": "It quicky lost 2% after unplugging for about 15 minutes.\n1% by Play services and the other by Android System.\n\nSometimes this phone has a lot of its own things to do.", "time": "12th March 2018, 01:48 AM", "postID": "post75856880", "replies": [{"text": "Remember how that works, though.  Play services used 1% of the 2% used, not 1% of the total battery power.  So that's 2/100% of the battery power for Play Services.\n\r\nBut, as the OP asked, yes, the phone crunches numbers all night when you sleep, even if it's just running in a tight loop\nCode: \nlabel: goto label\nwaiting for something to happen.  The CPU speed may drop down to 400MHz (System Panel Light shows the CPU speed, and if you just let it sit there for a minute you'll see how slow it gets) (and if you've installed a controllable kernel you can drop it lower than that) (and speed costs battery), but it doesn't stop completely when you're not doing anything.\n\r\nI have the screen dark all night (Proximity Service with the phone face down) and don't generally drop more than 1%-2% with battery saver off.  With it on, I seldom drop 1%.", "time": "16th March 2018, 06:17 PM", "postID": "post75912219", "replies": []}]}, {"text": "This is my calculated standby/idle/screen off-drain, taken from the battery statistics from EX Kernel Manager app.\n\nPretty good and not so bad, IMO!", "time": "17th March 2018, 08:27 PM", "postID": "post75924402", "replies": []}, {"text": "Possibly my first post - I just swapped my Xperia XZ Premium with the Pixel 2 of my wife because she was complaining that the battery does not last more than 6 hours - and she has 1 Gmail Account and a few apps that she runs.\n\r\nHowever, since I completely factory reset the phone and loaded all my stuff and my email accounts - I use 6 of them - 3 on Google and 3 on O365, and a host of other apps - I have not seen the kind of battery drain that she has been complaining off.\n\r\nI have WiFi and Bluetooth always on, have turned off ambient screen and also on-screen notifications. Just charged the battery to 100% and will report back tomorrow morning on the drain.", "time": "18th March 2018, 03:42 PM", "postID": "post75932394", "replies": []}]}, {"title": "Heavy use endurance", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel-2/review/heavy-endurance-t3685587"], "threads": [{"text": "Ive noticed this phone its battery life is so much better than the google pixel XL which was my previous phone.\n\r\nAfter 29 hours of normal usage my phone was at 2%.\n\r\nafter 14 hours of heavy usage it was at 5%.\n\r\nIm really satisfied about the battery life.", "time": "23rd December 2017, 11:28 AM", "postID": "post74937789", "replies": []}]}, {"title": "Light use endurance", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel-2/review/light-endurance-t3685588"], "threads": []}, {"title": "\"Look\" of the device (aesthetics)", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel-2/review/look-device-aesthetics-t3685589", "https://forum.xda-developers.com/pixel-2/review/look-device-aesthetics-t3685589/page2"], "threads": [{"text": "I went to Verizon yesterday and they only had the standard Pixel 2 on display. I must say, I am very impressed by the look. Once I grabbed it, the bezels faded and I was immersed in the screen. I think that since the bezels are actually black rather than charcoal like the original pixel, it feels like it just fades away more. I wasn't expecting to like it at all.", "time": "14th October 2017, 04:27 PM", "postID": "post74155337", "replies": [{"text": "Thats really good to hear! The \"charcoal\" always bothered me im glad they went real black this time.\n\r\nA little behind since i juts got back from 2 weeks in hawaii today but i get my 5\" one pretty soon!", "time": "15th October 2017, 04:54 AM", "postID": "post74161467", "replies": [{"text": "Welcome back, man! I hoped you enjoyed the honey moon. \r\nThe black is nice to have, I hates the not so quite black color of the original pixels.", "time": "17th October 2017, 07:37 PM", "postID": "post74195550", "replies": []}]}]}, {"text": "I always told myself that if they ever re-made the Nexus 6P but with better specs I would buy it. I think the Nexus 6P is the PERFECT phone. The Pixel 2 looks just like it, albeit, a little smaller. So I'm sold, should have mine by the 19th! WOOT! I just hope that the file system isn't the same as the Pixel, that was horrendous for flashing ROMs. I'm sure it is though...:\\", "time": "14th October 2017, 05:54 PM", "postID": "post74156371", "replies": [{"text": "My Nexus 6P was awesome until it failed me during my vacation with the BLOD which I can't solve until I super heat it. Backed up my stuff and now waiting for Pixel 2 XL to arrive. In its last days the 6P became so unreliable. A pitty.", "time": "14th October 2017, 11:47 PM", "postID": "post74159716", "replies": []}, {"text": "When you get it, please post to the battery life thread your experience. I too went and took a look and I am very tempted. I can't live with something like the S8, though, which only get 3 to 4 SOT on a charge. I might be looking for too much, but Id like my next phone to have 6 to 8 hours SOT.", "time": "16th October 2017, 02:30 AM", "postID": "post74173287", "replies": [{"text": "I average 6-8 SoT everyday with my pixel 2. Check out the battery thread in \"real life reviews\" section. I posted one with 7 hours 40 minutes SoT with moderate usage of GPS, Bluetooth, social media and taking plenty of photos. Screenshots included.", "time": "24th October 2017, 03:43 AM", "postID": "post74272613", "replies": []}]}]}, {"text": "Built quality is amazing, holding it makes me feel like it's worth the money.", "time": "15th October 2017, 09:06 PM", "postID": "post74171161", "replies": []}, {"text": "I love the look of this phone, bezels included.", "time": "19th October 2017, 05:45 AM", "postID": "post74213417", "replies": []}, {"text": "Guys,\r\nI am absolutely in love with the way this device was constructed. Bezels are NO ISSUE once you start to actually use the device. Also, with the bezels this phone is an absolute dream to use with one hand. \r\nHighly recommend this device.", "time": "20th October 2017, 02:48 PM", "postID": "post74230834", "replies": []}]}, {"title": "Quality feel (use of materials)", "rating": 3.5, "links": ["https://forum.xda-developers.com/pixel-2/review/quality-feel-materials-t3685590"], "threads": []}, {"title": "Ergonomics (in-hand feel)", "rating": 4.5, "links": ["https://forum.xda-developers.com/pixel-2/review/ergonomics-hand-feel-t3685591", "https://forum.xda-developers.com/pixel-2/review/ergonomics-hand-feel-t3685591/page2"], "threads": [{"text": "The phone feels great in hand, it has a nice powdery metal finish on the back that gives it a bit of grip. The phone is a tad smaller than I expected in comparison to my Nexus 5X, but i'm not gonna knock it down because of that. I do intend to get a rhinoshield bumper, which should add just the bit of size and protection I want.", "time": "19th October 2017, 05:49 AM", "postID": "post74213457", "replies": []}, {"text": "Some context: My phone history up until the last few months has been a reliable new phone every two years system. Original Evo 4G, Evo 4G LTE, HTC One M8, HTC 10, and then in the last couple of months I've been trying out quite a few, the S8, The Essential Phone, now the Pixel 2. \n\nIt's a big adjustment moving from \"bezelless\" options to a 5\" screen, but oh man, my early review of the ergonomics is that it's the most comfortable phone I've held since my Evo 4G LTE (which was back in the 4.7\" screen days). Excellent reachability for all parts of the screen with one hand and without having to reposition or stretch. It feels great so far!", "time": "19th October 2017, 07:58 PM", "postID": "post74222103", "replies": []}, {"text": "Is stable enough on the hand, to use it without a case? (I haven't used a case for black Nexus 5 and black Nexus 5X BUT I had to use a case on Z5 Compact and have to use a case on my current 6P because these two are slippery)", "time": "19th October 2017, 11:26 PM", "postID": "post74224100", "replies": [{"text": "It's very similar to the Nexus 5 in terms of hand feel.  Almost as grippy, pretty much the same weight and balance.  \n\r\nThe 6P was too slippery and was not as comfortable to hold.\n\r\nI don't see a need for a case for the Pixel 2.", "time": "20th October 2017, 12:25 PM", "postID": "post74229235", "replies": [{"text": "Good to know, nexus 5 is the best ergonomic phone in my hands so far\n\nEnviado de meu SM-G950F usando Tapatalk", "time": "21st October 2017, 01:06 PM", "postID": "post74241353", "replies": [{"text": "I was OK with the Nexus 5. But with the Galaxy Nexus I was much better than with the 5.\n\n(And with the Moto X, also 4.7\" like the Galaxy Nexus, much better than any other Android phone I've tried).\n\nI'll plan to use my Pixel 2 without case if it's not slippery \nOtherwise, some Dbrand  maybe, but I think the dbrand with grip is the \"dragon\" one and it's ugly for the pixel imo...", "time": "21st October 2017, 10:52 PM", "postID": "post74247005", "replies": [{"text": "Just got my Pixel 2 today. Yeah it's a bit slippery to me. At the moment I'm travelling through Prague and with the cold weather my hands are so dry that the phone ends very slippery.\n\nI need a case asap. Would love to have something that doesn't cover the glass corners. 100% clear and ultra thin.", "time": "29th October 2017, 11:41 AM", "postID": "post74335019", "replies": []}]}]}]}]}, {"text": "Phone is very comfortable coming from an original Pixel. A bit grippier than the original but I can say without a doubt that it feels less durable in hand than the 1. I had the casemate wallet style on the Pixel and will probably do the same for the 2.", "time": "21st October 2017, 09:07 PM", "postID": "post74246228", "replies": []}, {"text": "Coming from s6 screen is the same size but phone is like half the thickness and half the weight. The phone is super easy to use in one hand. I've got nothing bad to say about it ergonomicly", "time": "22nd October 2017, 10:25 PM", "postID": "post74258158", "replies": []}, {"text": "It's feel good in the hands with the premium build of it. Despite the opinions on it. I'd say that the whole phone size is a bit larger then it should be seeing as how it's only a 5\" screen.", "time": "30th October 2017, 09:14 AM", "postID": "post74344446", "replies": []}, {"text": "Feels very high quality. \nAlso think it's a lot bigger than it should. \n\nAnd the most important thing is that it is really slippery to be used without a case or something that adds more grip.", "time": "1st November 2017, 12:25 AM", "postID": "post74363884", "replies": []}, {"text": "Firstly, I'm a case guy, regardless of the phone (unless it's absolutely bulletproof, and then still no guarantees) so I have a case on it. But I kinda feel bad putting a case on this phone which feels so good. I'm switching over from a Nexus 5x and my first reaction was \"wait what did I just pay $600+ for??\", but after a few hours I realized that the feel alone says flagship phone (obviously that's not the main reason I appreciate the phone, but it's good to know I got my money's worth). Though I can't speak for the white phone, the Pixel 2 matt black has an amazing feel. \r\nSo for for the way it feels in the hand, 5stars!", "time": "12th November 2017, 02:27 PM", "postID": "post74489706", "replies": []}, {"text": "The size is perfect, reminds me of the Nexus 5 and all the fond memories I had.", "time": "20th December 2017, 01:03 PM", "postID": "post74907509", "replies": []}, {"text": "Despite the over-all footprint being a bit large with those bezels, the phone feels surprisingly good in the hand. It's not so slick that I worry about dropping it and the chamfered edges offer a bit of reassurance that it won't be easily dropped. The only other phone that fit my hand better was the Compact line of Sony Xperias. I hope they keep a similar footprint on the Pixel 3 when it inevitably switches to the horrendous 18:9 aspect ratio.", "time": "25th December 2017, 11:36 PM", "postID": "post74962017", "replies": []}]}, {"title": "OEM skin/software", "rating": 4.0, "links": ["https://forum.xda-developers.com/pixel-2/review/oem-skin-software-t3685592", "https://forum.xda-developers.com/pixel-2/review/oem-skin-software-t3685592/page2"], "threads": [{"text": "I'm annoyed at being a beta tester for Oreo. There are clearly bugs that cause stuttering on my device.", "time": "16th November 2017, 02:10 PM", "postID": "post74534575", "replies": []}, {"text": "As simple as it can be. Every phone should start this way.", "time": "20th December 2017, 01:04 PM", "postID": "post74907518", "replies": []}, {"text": "No complaints here. I'm glad this phone wasn't load with bloatware or unnecessary apps.", "time": "20th December 2017, 03:46 PM", "postID": "post74909160", "replies": []}, {"text": "Honestly, it's too basic. I appreciate how light it is, but it could really use more features built in to make the phone more customizable.", "time": "25th December 2017, 11:46 PM", "postID": "post74962073", "replies": [{"text": "Could you make some concrete example of important missing features in android 8.1 stock?\nI'd like to buy it, but I need more info first.", "time": "12th January 2018, 05:11 PM", "postID": "post75174477", "replies": [{"text": "Cannot program hardware buttons to launch custom quick actions like flashlight or calculator.\n\nNo native theme support.\n\nCannot take a scrolling screen capture or edit the screenshot immediately before sharing or saving.\n\nNo support for advanced gestures to launch shortcuts.\n\nBasically, you can't do anything that most other manufactures bake into their skins. I know the XDA community has historically hated skinned versions of Android, but the hardware couldn't keep up with the software in years past. Now, it's no longer an issue for most mid range and higher devices and the additional features of those skins are sorely missed in the Google Pixel line.\n\nI had to root just to do half of what is listed above.", "time": "17th January 2018, 02:56 PM", "postID": "post75233248", "replies": [{"text": ".............uh....yeah, You can. Just took a screenshot. Opened up the screenshot and hey look, an edit option.\n\r\nThe only feature i'm interested in, though, is a Private Mode. I loved it on my Galaxy S6. Any pictures I took while it was turned on were completely hidden as soon as I turned it off. I know there are apps out there for hiding pictures but\n\r\nA. do I really trust them that much?\r\nB. You have to take a picture, open the app, enter your password, select \"import\", select you image(s), select enter. It was nice just being able to tap \"Private Mode\" and enter my pin and BOOM. Done. From there, just take a picture and it automatically saves to the private folder.", "time": "3rd February 2018, 04:55 AM", "postID": "post75428484", "replies": [{"text": "That's not what I mean. The screen shot of already saved; therefore, as you said, you have to open the saved file and then edit and then save again. I'm taking about doing it right from the screenshot menu that many other Android devices have. Even the crappy iPhone has it.", "time": "3rd February 2018, 01:59 PM", "postID": "post75432626", "replies": []}]}]}]}]}, {"text": "Could benefit from being able to make folders in the app drawer, also be able to hide apps to keep the app drawer tidy.", "time": "17th January 2018, 12:34 PM", "postID": "post75231599", "replies": [{"text": "Why not just use a custom home launcher like Nova? It's fast anyhow", "time": "31st January 2018, 05:51 PM", "postID": "post75399444", "replies": []}]}, {"text": "Great , i want to try it next time", "time": "5th February 2018, 07:07 AM", "postID": "post75451718", "replies": []}]}, {"title": "Outdoor visibility (max brightness)", "rating": 3.5, "links": ["https://forum.xda-developers.com/pixel-2/review/outdoor-visibility-max-brightness-t3685593"], "threads": [{"text": "Brightness level has been noticeably lower than my previous phone the oneplus 3. In the full sunlight it is... Tolerable", "time": "21st October 2017, 08:47 PM", "postID": "post74246051", "replies": []}, {"text": "My Honor 8 gets noticeably brighter at the max setting. What I don't know yet is does the Pixel have the adaptive contrast feature that automatically boosts the darker sections of the image in direct sunlight for better visibility? Granted, you have to have this option enabled under developer options (make the screen easier to read in direct sunlight).", "time": "26th October 2017, 09:22 PM", "postID": "post74306590", "replies": []}, {"text": "I was expecting this thing to outshine the sun for $1000. It's only marginally better at full brightness than my Nexus 6.", "time": "16th November 2017, 02:11 PM", "postID": "post74534582", "replies": [{"text": "The pixel 2 costs $649.99 USDA\nYou are about $350 off bub.", "time": "25th November 2017, 07:20 PM", "postID": "post74634897", "replies": []}]}, {"text": "Hopefully not driving the AMOLED display so hard will at least make it last a little longer?!", "time": "21st November 2017, 12:23 PM", "postID": "post74586878", "replies": []}, {"text": "definitely not bright enough at max brightness, hope flar2 will bring HBM (high brightness mode) to pixel 2 someday", "time": "27th November 2017, 08:29 PM", "postID": "post74659019", "replies": []}, {"text": "I never go higher than 30% brightness when outdoors, not needed", "time": "23rd December 2017, 11:00 AM", "postID": "post74937597", "replies": []}]}, {"title": "Contrast (true blacks)", "rating": 3.0, "links": ["https://forum.xda-developers.com/pixel-2/review/contrast-true-blacks-t3685594"], "threads": [{"text": "My screen doesn't look truly black even when the phone is completely powered off. Noticable contrast from the black bezels. Annoying. Is this just how they are? My last several AMOLED screens have been much more true black.", "time": "28th October 2017, 03:09 AM", "postID": "post74320555", "replies": [{"text": "When screens are completely off, the slightly grey dielectric layer is more noticeable. With current technology that layer is never going to be \"true black.\" \n\nThe pixel 2 uses a Samsung display, this is the blackest you'll see.", "time": "28th October 2017, 06:24 PM", "postID": "post74328134", "replies": [{"text": "On or off, this screen jumps out to me as basically appearing backlit like an LCD, especially from an angle.  I have had nothing but oled since 2012 and haven't noticed this on previous phones.", "time": "29th October 2017, 12:46 AM", "postID": "post74331021", "replies": []}]}]}, {"text": "because they were so cheap and decided not to darken it.  cheap move.", "time": "29th October 2017, 10:43 PM", "postID": "post74340997", "replies": [{"text": "uhhh, source please? I've owned a several flagship/midranger LG, Moto and Samsung phones in the past several years and I have never seen a phone where the dielectric layer on OLED displays is pure black. \n\r\nRegardless this topic is mostly subjective, I can't find any information about display manufactures darkening their dielectric layer.", "time": "2nd November 2017, 01:01 AM", "postID": "post74375124", "replies": [{"text": "look at galaxy s8 and v30.", "time": "2nd November 2017, 04:48 AM", "postID": "post74376513", "replies": [{"text": "like I said...it is subjective. Unless you can show proof or any article written specifically about what you are talking about. The Pixel 2 display is a Samsung made OLED.", "time": "2nd November 2017, 09:56 PM", "postID": "post74386048", "replies": [{"text": "I think being of the same black colour as the body around the screen gives you a feel that its pure black... Also, the absence of light makes a difference too, with no screen borders visible unlike other LCD phones..", "time": "3rd January 2018, 04:02 AM", "postID": "post75056061", "replies": []}]}]}]}]}]}, {"title": "Color saturation & accuracy", "rating": 3.5, "links": ["https://forum.xda-developers.com/pixel-2/review/color-saturation-accuracy-t3685595"], "threads": [{"text": "Some brief observations about Pixel 2's display (in Natural and Boosted color modes):\n+ Max brightness is pretty bright, and should provide adequate visibility in most conditions.\n+ Nice, deep, inky, and uniform black, just as you'd expect from an OLED.\n- Pure green (#00FF00) renders considerably lighter and paler than reference. Using my eyes alone, I can't tell how much of this is due to undersaturation vs color inaccuracy. The result is that elements that are mostly green (e.g. Google Hangouts icon, plant life in photos) sometimes look noticeably less vibrant in comparison to other elements on the screen.\n- Red is undersaturated relative to the other colors. This is evidenced by the green tint that is clearly visible when viewing yellow and orange colors. Deep reds skew slightly purple as well.\n- The display's color temperature appears cool in all but the brightest of indoor viewing conditions. I'm sure it looks neutral (i.e. great) under the blaring fluorescent lights of an electronics store, but isn't as well suited for home or office viewing. Some people prefer cooler colors. I'm of the mind that neutral or very slightly warm color temperature displays are much easier on the eyes and more visually appealing.\n\nMost 2017 OLED smartphone displays I've seen have the problems I've listed, albeit to varying degrees. I'd chalk it up to the difficulties inherent to OLED screens, but past experience suggests otherwise: I've owned OLED phones with better color accuracy all the way back to 2013. It seems like things really got worse this year. Not sure if its the displays themselves or the color profiles being applied.\n\nUsing the new Saturated color mode swings the color temperature to a more neutral position, but the resulting appearance is way too saturated in general for my liking, and it doesn't completely resolve the issue of inaccurate reds.\n\nI'm disappointed, as the display's color issues cause it to fall short of what I expect to find on a phone in Pixel 2's price range. I haven't decided yet whether I'm going to keep it.", "time": "15th November 2017, 06:36 PM", "postID": "post74526006", "replies": []}, {"text": "Receive mine today, and the colour calibration was way off... I thought it a little yellow at first, and perhaps the beach on the default wallpaper might be influencing my judgement. Installed a few aps, played around with the settings, and then compared it with my previous phone and oh dear - it was clearly very yellow. Greys in particular looked awful, and whites like aged paper rather than white. So disappointing.\n\r\nI also compared the colours with my aging Nexus 7, and that looked much better too, as do my various monitors.  I've RMA'd the device, and will give one more a go before deciding whether to keep it. Such a shame - one of the main reasons I went for a 2 rather than a 2 XL was the supposedly better display... And if only Google would allow us to calibrate the colours ourselves, I could probably have resolved the issue myself.", "time": "20th December 2017, 03:41 PM", "postID": "post74909094", "replies": []}, {"text": "Color calibration is indeed terrible. \n\r\nComparing it to me previous phone, google pixel XL. It makes some colors fade in such a weird and ugly way. \r\nI cant stand it", "time": "23rd December 2017, 10:59 AM", "postID": "post74937589", "replies": []}]}, {"title": "Clarity/resolution", "rating": 4.0, "links": ["https://forum.xda-developers.com/pixel-2/review/clarity-resolution-t3685596"], "threads": []}, {"title": "Minimum brightness", "rating": 3.5, "links": ["https://forum.xda-developers.com/pixel-2/review/minimum-brightness-t3685597"], "threads": [{"text": "I have to use a third-party app to get the brightness down enough. It still glows like it's daytime in my room.", "time": "16th November 2017, 02:12 PM", "postID": "post74534589", "replies": []}, {"text": "Minimum brightness is nice with the Night Light enabled. With this special colour mode you can comfortably read something before going to sleep.", "time": "19th November 2017, 06:15 PM", "postID": "post74568470", "replies": []}]}, {"title": "Call quality", "rating": 3.5, "links": ["https://forum.xda-developers.com/pixel-2/review/call-quality-t3685598", "https://forum.xda-developers.com/pixel-2/review/call-quality-t3685598/page2", "https://forum.xda-developers.com/pixel-2/review/call-quality-t3685598/page3"], "threads": [{"text": "Terrible, constant high pitch sound always present when screen is on and a clicking sound that is like a clock. Always the same rate and always present even during calls. RMAing my Pixel 2 and my wifes Pixel 2 for the same reason.", "time": "19th October 2017, 09:35 PM", "postID": "post74223171", "replies": []}, {"text": "My Pixel 2 has the same type of problem. When you are on a phone call and using the phone against your ear, you hear digital interference noises and ticking sounds. It is so very annoying and unusable.", "time": "19th October 2017, 10:06 PM", "postID": "post74223444", "replies": []}, {"text": "I heard that turning NFC off help this for the 2 xl", "time": "21st October 2017, 03:04 PM", "postID": "post74242457", "replies": []}, {"text": "I made one call today from my house and didnt have that problem but my NFC has been off since setting up the phone. I am on Fi and wifi calling as well. One off thing though is I did pair the device up with my Jeep and was playing pandora when a call came through over bluetooth. My Kenwood receiver picked the call up and immediately maxxed out the volume, the beep was loud enough to crackle my aftermarket speakers. Scared the **** outta me. I just immediately hit end call and dropped the volume down. I wouldnt doubt his very well may be an issue Kenwood though.", "time": "21st October 2017, 08:45 PM", "postID": "post74246023", "replies": []}, {"text": "No issue here with call clarity.  Maybe a small step down from my Turbo.  But if there is one thing Motorola always nails is their radios.\nSide question though,  should these phones have a Face Sensor that locks the screen while on a phone call?  Mine isn't locking and I was doing all manner of crazy things when my cheek touched the phone.", "time": "22nd October 2017, 11:46 PM", "postID": "post74258734", "replies": [{"text": "Can you turn the proximity sensor on and off?", "time": "23rd October 2017, 02:56 AM", "postID": "post74259788", "replies": [{"text": "A little google searching suggests there's a link to Adaptive Brightness.  I've re-enabled AB and will see what happens today.", "time": "23rd October 2017, 12:26 PM", "postID": "post74263828", "replies": []}]}]}, {"text": "Call quality seems to be good, but I have noticed an intermittent high pitched electronics whine. It's not on every call and not on every call with every person. \n\r\nIt's not a *fix*, but I find myself making and receiving actual phone calls less and less. These days just about every app has a high definition VOIP option available, so I find myself using that a lot. Hangouts, Messenger, Signal, etc. If you're making a lot of business calls daily or talking on the phone a lot with someone over a traditional voice call, I could see it as a dealbreaker. But moving forward, if there's a slight bug I can live with, some minor electronics whine over a legacy communication channel would be it.", "time": "23rd October 2017, 02:25 PM", "postID": "post74265097", "replies": []}, {"text": "I noticed the same problem from my pixel.. I was on a voice call using the Duo app, there a very low volume static clicking sound.  I turned off NFC as this thread suggested and the clicking noise goes away; however, there's still some static noise.  I wonder if this is a hardware issue...", "time": "24th October 2017, 06:35 PM", "postID": "post74280530", "replies": []}, {"text": "Can any of you tell us where you got your GP2? Is it a Verizon Phone or did you order it from Google Store?", "time": "24th October 2017, 10:26 PM", "postID": "post74282967", "replies": []}, {"text": "I just noticed this issue today, it is in line with the rest of your comments (\"clock ticking\", interference sounds, etc)\n\r\nI have a Verizon Pixel 2, but I do not think it is limited to their phones. Hopefully Google is able to patch the issue in a future software update by disabling whatever is causing the issue during a phone call.", "time": "24th October 2017, 10:52 PM", "postID": "post74283214", "replies": []}, {"text": "I assume a software fix will resolve the issue. It would be shocking to go to production with such a glaring problem.", "time": "25th October 2017, 12:50 AM", "postID": "post74284008", "replies": [{"text": "Is the Pixel XL screen burn-in not a glaring problem?", "time": "25th October 2017, 12:51 AM", "postID": "post74284016", "replies": []}]}, {"text": "Is anyone else having an issue where you place a call and nobody can hear you on the other end?", "time": "2nd November 2017, 06:54 PM", "postID": "post74384196", "replies": []}, {"text": "Just got my Pixel 2 XL Black last night, No clicking or Buzzing sounds. Call quality is clear. Speaker is bloody loud had to turn it down VS my original Pixel XL.Side Note NFC is on I use NFC daily.", "time": "2nd November 2017, 10:14 PM", "postID": "post74386203", "replies": []}, {"text": "My Pixel2 from google store works perfect. No sound issues. In fact better than my Pixel. The signal at my home left my pixel constantly jumping onto wifi, now I have bars and never goes on wifi. Using Verizon pre-paid.", "time": "8th November 2017, 01:58 PM", "postID": "post74447575", "replies": []}, {"text": "Tried a GSM call today (Pixel 2 to Nexus 5X) and it was fine. Nothing wrong / Nothing special.\n\nGenerally I use VoIP that works also good.", "time": "8th November 2017, 09:12 PM", "postID": "post74452053", "replies": []}, {"text": "I have the P2 on verizon, even my shitty lgv10 had better reception. I keep getting \"you're breaking up\" Anything I could do to boost the signal?", "time": "14th November 2017, 06:37 AM", "postID": "post74508357", "replies": [{"text": "Same issue, AND the beta didn't fix the annoying clicking sound either.", "time": "14th November 2017, 03:37 PM", "postID": "post74512800", "replies": []}]}, {"text": "November security update is supposed to fix the sounds while on the phone I never had the issues so I don't know if it actually fixed it", "time": "15th November 2017, 12:24 PM", "postID": "post74522264", "replies": []}, {"text": "The .025 update did fix the clicking - verified by many people.\n\nCall quality on mine is fine. Speaker is very clear, people on the other end hear me fine, and reception is very good indeed.", "time": "15th November 2017, 05:09 PM", "postID": "post74525086", "replies": []}, {"text": "Call quality is good, no complaints.  I recently got the phone and out of the box received Oreo 8.1 update and never experienced any noise in the earpiece.", "time": "11th December 2017, 11:06 PM", "postID": "post74815423", "replies": []}, {"text": "Hoping to get another opinion.  I was coming from an HTC One M8 that didn't have great call quality.  I had to place my ear on a specific side of the grill to hear anything.  The Pixel 2 is much louder but, I'm curious...when I hear a recorded message such as voicemail it sounds fine.  When I actually talk to another person, especially with an iPhone (that is what my wife and parents have) it is loud, clear...but sounds a little tinny.  Is this normal?  Also, I noticed that when speaker phone is enabled, only the bottom speaker seems to be used.", "time": "19th December 2017, 01:56 AM", "postID": "post74891826", "replies": []}]}, {"title": "WiFi strength, range, and throughput", "rating": 4.0, "links": ["https://forum.xda-developers.com/pixel-2/review/wifi-strength-range-throughput-t3685599", "https://forum.xda-developers.com/pixel-2/review/wifi-strength-range-throughput-t3685599/page2"], "threads": [{"text": "2.4ghz signal strength is improved over my OG Pixel, but the 5ghz reception for me has been significantly worse to the point that I can't use 5ghz in my home with this phone as it has to be much closer to the router than my OG pixel which I can go anywhere in my house with. Anyone else experiencing the same?", "time": "25th October 2017, 10:50 PM", "postID": "post74295258", "replies": [{"text": "If it's on a 5GHZ network it will always lose connection if you aren't close to your WiFi router. That's how 5GHZ just works. \nhttps://kb.netgear.com/29396/What-is...4-GHz-and-5GHz", "time": "30th October 2017, 09:08 AM", "postID": "post74344407", "replies": [{"text": "How profound, you also lose connection to 2.4ghz wifi if you aren't close enough, that's just how it works! \n\r\nHowever what is being said here is that the 5ghz reception on the Pixel 2 is not great. At a range where my OG Pixel and laptop are both showing around -68dbm signal strength the Pixel 2 is showing -80dbm and can't hold a stable connection to 5ghz. I doubt there is anything wrong with it and most likely this just boils down to the design of the antennas and case. The 2.4ghz wifi strength seems to be slightly better than my OG Pixel.", "time": "30th October 2017, 02:55 PM", "postID": "post74347226", "replies": [{"text": "Where are you getting this information from? Are you doing internet speed tests?", "time": "30th October 2017, 07:56 PM", "postID": "post74350415", "replies": [{"text": "On the phones I am using WiFiAnalyzer app from VREM Software to get signal strength information. There are lots of others available in the play store. I have a wifi analyzer application on my desktop as well to read out the dBm values for networks from my laptop.", "time": "30th October 2017, 08:02 PM", "postID": "post74350470", "replies": []}]}]}]}]}, {"text": "Using speedtest.net on 5ghz, downoad speeds on my Pixel 2 are about 20-50% slower than my Nexus 6P.", "time": "27th October 2017, 11:31 PM", "postID": "post74319343", "replies": []}, {"text": "I've been noticing a lot of drops with 5ghz where my old Nexus 5x has been solid. Lately, it's been from the next room over from my router. I've switched over to 2.4 and will test that out over the next few days.", "time": "29th October 2017, 05:46 PM", "postID": "post74338470", "replies": []}, {"text": "I concur - 5GHz WiFi lacks range. 2.4GHz WiFi appears fine, though.", "time": "16th November 2017, 01:56 AM", "postID": "post74529312", "replies": []}, {"text": "5 GHz Band has a smaller coverage area than 2.4 GHz. It has nothing to do with the phone..5 GHz band is the better one to be on. It has more non-overlapping channels which means less traffic assuming you don't pick a busy one. 2.4 GHz band only has 3 channels that don't overlap.", "time": "16th November 2017, 08:02 AM", "postID": "post74531510", "replies": []}, {"text": "Like with the 5X and the 6P. \n\nPixel 2 starts with 5Ghz when I reboot the phone and minutes later change to 2.4Ghz and never come back to 5Ghz until the next phone reboot. \n\nThis is happening even near the router and in a small house that have 90% 5Ghz signal even in the most remote areas.\n\nThe 5Ghz traffic is also pretty low in the area compared to 2.4Ghz which is more crowded. \n\nThe router used is an Asus OnHub and both SSIDs have the same name.", "time": "19th November 2017, 07:28 AM", "postID": "post74562496", "replies": []}, {"text": "some problems with wifi, on 3 different routers, no miracast", "time": "19th December 2017, 09:00 PM", "postID": "post74901196", "replies": []}, {"text": "Hi", "time": "30th January 2018, 05:37 AM", "postID": "post75380241", "replies": []}, {"text": "We have a pair of Ubiquiti UniFi AP-AC-Pro WAPs at opposite ends of the house to provide decent coverage throughout (long skinny house with solid internal walls). My Pixel 2 always connects at 5GHz using 802.11ac and stays connected at 5GHz using 802.11ac, and the UniFi WAP controller software shows that the phone connects at a TX rate of between about 500Mbps and 900Mbps depending on distance from the WAPs. With the phone about 10m from the nearest WAP, if I run an ftp server on the phone and use an ftp client on a PC to copy a 1Gb VOB file up to the phone and then back down again, I get a throughput of around 55-58Mb/sec (440-465Mbps) in either direction.\n\r\nI suspect a lot of the problems reported are due to the generally poor quality of consumer-grade WiFi WAPs.", "time": "10th February 2018, 05:12 AM", "postID": "post75510380", "replies": []}, {"text": "Same here! My pixel 2 wont connect to the 5ghz network unless its near the router. And also WiFi disconnects automatically frequently. Any fix for this???", "time": "11th February 2018, 02:52 AM", "postID": "post75521100", "replies": []}, {"text": "Haris, that depends on your wifi signal.  If it's strong, the phone is defective, and you know the \"cure\" for that.  If you're going through anything large and conductive, or noisy - a refrigerator, a microwave oven that's running, 5 walls, etc. - that's the problem and you have to get some signal to where you are.  (I could never use anything on my deck, which had to shoot 2.4MHz through a microwave to get to the router, when the microwave was running.  the only \"solution\"?  Wait.)  Now, in a larger house, with a more centralized router, no problem anywhere.  No problems finding a clean 2.4 MHz channel, so I have 5MHz turned off.)", "time": "11th February 2018, 05:49 PM", "postID": "post75529068", "replies": []}]}, {"title": "Cellular strength and throughput", "rating": 4.0, "links": ["https://forum.xda-developers.com/pixel-2/review/cellular-strength-throughput-t3685600"], "threads": [{"text": "I've been wondering this question for a long time, does network performance directly correlate to the processor/modem? I remember going from a HTC M8 to a Nexus 6P and the download/upload speeds went up drastically. That was going from a Snapdragon 801 to a 810. Can I expect the same thing going from the 810 to the 835?", "time": "10th October 2017, 04:05 PM", "postID": "post74107361", "replies": []}, {"text": "Seeing a 5-10dbm improvement on my 5\" Pixel 2 when directly compared to a 5\" Pixel 1, on LTE Bands 2 and 4 (T-Mobile). Able to retain LTE in a hardware store where the Pixel 1 drops to Edge or No Service. LTE speeds on my Pixel 1 were always \"slow\" when compared to an Intel iPhone 7 and other Android flagships (50-75% of their speed). The Pixel 2 is much better here as well. Patiently waiting for root to verify 4x4 MIMO and 256QAM is active for my carrier, but it seems likely so far. \n\r\nPixel 2 on the left on the attachments. The 30/90mbps speeds are on a 20mhz B4 tower, no aggregate bands. The 100/160 speeds were on a 20mhz B4 + 5mhz B2 tower. Not sure if the towers are upgraded for 4x4 MIMO.", "time": "27th October 2017, 11:35 PM", "postID": "post74319371", "replies": []}, {"text": "My top speed (mbps) with the Nexus 6P was around 60mpbs. With the Pixel 2 I am reaching over 90. Glad I made this investment.", "time": "28th October 2017, 04:52 PM", "postID": "post74327132", "replies": []}, {"text": "It gets fewer bars in the exact same spot on my desk at work than my Nexus 6 did.", "time": "16th November 2017, 02:13 PM", "postID": "post74534599", "replies": [{"text": "I'm curious about that, how does it perform in the fringe areas 3g/1x territory?", "time": "9th December 2017, 02:21 AM", "postID": "post74783000", "replies": [{"text": "Strangely enough, (and even with my Nexus 6,) in the booming megalopolis that is Tallahassee, FL, I don't run into any 3G/1X areas, and I live on the outside of town.", "time": "9th December 2017, 04:20 AM", "postID": "post74783654", "replies": []}]}]}, {"text": "It's quite good.  I've had 300 Mbps speedtest results on Rogers, which does not even have 4x4 MIMO.", "time": "11th December 2017, 04:45 AM", "postID": "post74805766", "replies": []}, {"text": "I'm not impressed on Verizon here in Maryland.\nSitting in my car right across the street from a tower the best I got was 66/22.", "time": "15th December 2017, 05:02 PM", "postID": "post74857479", "replies": []}]}, {"title": "Speakerphone (loudness, clarity)", "rating": 4.0, "links": ["https://forum.xda-developers.com/pixel-2/review/speakerphone-loudness-clarity-t3685601", "https://forum.xda-developers.com/pixel-2/review/speakerphone-loudness-clarity-t3685601/page2", "https://forum.xda-developers.com/pixel-2/review/speakerphone-loudness-clarity-t3685601/page3"], "threads": [{"text": "I was astonished when I heard the speakers for myself, they are really loud but clear!", "time": "18th October 2017, 08:32 PM", "postID": "post74209420", "replies": []}, {"text": "I like the speakers, but they need some tweaking, the sound isn't as full bodied as my HTC One M7 was. They're clear sounding, but a bit tinny for my taste. I'll be happy when some eq mods get implemented.", "time": "19th October 2017, 05:31 AM", "postID": "post74213321", "replies": []}, {"text": "I was really pleasantly surprised by them. They are just as loud as my Nexus 6P WITH the Viper4Android soundboost all the way up. Once I get V4A on the Pixel 2 I wonder just how loud it will actually get. Sounds amazing for such a small phone too, wow.", "time": "19th October 2017, 11:10 AM", "postID": "post74216056", "replies": []}, {"text": "Got mine in yesterday. nice crisp clear sound... but the earpiece speaker is treble biased, and the bottom speaker is bass biased... \nMakes things sound really weird when listening to music or watching movies in landscape...\n\nI am getting an exchange unit and will update when that unit comes in.\n\nUpdate: Exchange unit came in... I've been using it for a few days now, and I have noticed no difference from my last unit... an hour on the phone with google device engineers got me the response that this is by design to increase the frequency range... I still don\"t like it as it bothers me..\n\nwho wants to buy a gently used pixel2?", "time": "20th October 2017, 02:25 PM", "postID": "post74230526", "replies": [{"text": "The same situation. Is it feature or defect? Can anybody confirm it? Thanks.", "time": "21st October 2017, 12:14 AM", "postID": "post74236475", "replies": []}]}, {"text": "Anyone's speakers distorting or crackling?  Coming from iPhone 7.  Speakers on iphone are not loud, but they do sound good.  Pixel 2 by comparison is tinny and crackle at higher volumes.\n\r\nCoincidentally, I'm RMAing the Pixel 2 right now for ticking noise in earpiece and constant high frequency emission.  Wondering if maybe my speakers are no bueno too.  No one else seems to have the speaker distortion or at least too early.\n\r\nEdit: I was playing \"Bridge Burn\" by little comets when i noticed.  Then played thievery corporation's \"Culture of Fear\".  Maybe someone else can compare?", "time": "22nd October 2017, 09:43 PM", "postID": "post74257829", "replies": [{"text": "I just got mine today I do not have the sound in the ear piece and also my forward face speakers are crisp loud and clear with just a slight thumping for base it amazing to my ears but what do I know I came from a s6 😒", "time": "23rd October 2017, 12:07 AM", "postID": "post74258879", "replies": [{"text": "Thank you sir.  New phone will be here Wednesday.  We shall see.", "time": "23rd October 2017, 01:02 AM", "postID": "post74259167", "replies": [{"text": "hope u get one without issues", "time": "23rd October 2017, 01:11 AM", "postID": "post74259232", "replies": []}]}]}, {"text": "My speakers seem to rattle a little at max volume, even just with Google Assistant or navigating. Haven't noticed any issues on calls though I haven't made a lot since I got my Pixel 2.\n\r\nOverall quality seems all right a few notches down from max, but is quite noticeably worse than my nexus 6.", "time": "23rd October 2017, 10:28 PM", "postID": "post74270630", "replies": []}]}, {"text": "Could anybody check if speakers are producing the same sound (you can cover it by finger). My unit's top speaker has more hights, bottom one has more mids and bass. Maybe it's by design. I am not sure. Thank you.", "time": "23rd October 2017, 10:51 PM", "postID": "post74270823", "replies": [{"text": "Yes, absolutely agree with you.  Bottom is far better at base and mids.  Top speaker is opposite.", "time": "23rd October 2017, 11:26 PM", "postID": "post74271103", "replies": []}]}, {"text": "https://9to5google.com/2017/10/24/th...res-why-video/", "time": "24th October 2017, 07:33 PM", "postID": "post74281183", "replies": []}, {"text": "The are crystal clear but when I compare them to my nexus 6, the bass is better on the nexus", "time": "25th October 2017, 02:05 AM", "postID": "post74284424", "replies": []}, {"text": "Noticed quite a bit of distortion when navigating at max volume.  The voice is full bodied and, combined with the software EQ choice, I think it hits that perfect low-mid tone and overpowers the speakers.  Stepping it down two notches basically eliminates it.  Also noticed that the speakers are very directional compared to the OG pixel XL.  Had both devices playing the same music and Pixel 2 audio disappears when faced away compared to the OG pixel which was much more audible when the speaker was pointed away.  I think the amount of bass they are trying to offer is lofty and unattainable and the device would sound better with a bit more mid and less extreme treble and bass.  If I decide to keep this device I'll be praying for the dev community to offer up some display and audio tweaks.  P.S. I haven't noticed the ticking/noise from the speakers on my device but I think if they dropped this ultra hifi EQ choice, a slight drop in highs would probably make it much less noticeable or might make it disappear completely if the frequency could be isolated and cut (I'm looking at you 6kHz and above).", "time": "25th October 2017, 04:32 PM", "postID": "post74291303", "replies": []}, {"text": "Can anyone get me /etc, /lib & /bin folders? I might take a look if there is any ways to improve your device's speakers", "time": "27th October 2017, 12:28 AM", "postID": "post74308011", "replies": []}, {"text": "Yes, I'm an audiophile. Maybe I just got lucky this time around. I got my phone earlier than expected and haven't had a single issue that has been reported here. No weird sounds when on a call, no loose parts, speakers are loud (as my Nexus 6P was with boosting). I dunno.", "time": "27th October 2017, 05:43 PM", "postID": "post74316144", "replies": []}, {"text": "thanks for the reply, unfortunatly I'm the only one around here with one and can't compare, maybe I'll find a demo somewhere.", "time": "27th October 2017, 06:19 PM", "postID": "post74316570", "replies": []}, {"text": "Im amazed about how loud the speakers are and still so clear", "time": "23rd December 2017, 11:01 AM", "postID": "post74937606", "replies": []}]}]