[{"title": "Overall love", "rating": 4.5, "links": ["https://forum.xda-developers.com/nextbit-robin/review/overall-love-t3317671"], "threads": [{"text": "https://www.youtube.com/playlist?lis...Y0iKu6bg7h6HLg Here are some videos on YouTube channel I made of just my Robin, unboxing, and some stuff showing the quality work it produces.... It is left open so you can post videos too, if you would like, that would be great! \n\n---------- Post added 04-06-2016 at 12:04 AM ---------- Previous post was 04-05-2016 at 11:46 PM ----------\n\nhttps://www.youtube.com/playlist?lis...Y0iKu6bg7h6HLg Here are some videos on YouTube channel I made of just my Robin, unboxing, and some stuff showing the quality work it produces.... It is left open so you can post videos too, if you would like, that would be great!", "time": "6th April 2016, 07:04 AM", "postID": "post66217742", "replies": []}, {"text": "I love this phone. Some thing could be improved, but taking in account this is the first smartphone from Nextbit, it's pretty good!", "time": "2nd June 2016, 01:00 PM", "postID": "post67135893", "replies": []}, {"text": "It's good, but not great for me", "time": "2nd June 2016, 02:47 PM", "postID": "post67137266", "replies": []}, {"text": "I absolutely am in love with my Robin, so much so that my 6P just sits in a drawer. The only thing I could ever think of to improve would be using an amoled screen but that's just personal preference.", "time": "27th June 2016, 09:43 PM", "postID": "post67508880", "replies": []}]}, {"title": "Community development strength", "rating": 4.0, "links": ["https://forum.xda-developers.com/nextbit-robin/review/community-development-strength-t3317672"], "threads": []}, {"title": "Overall speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/nextbit-robin/review/overall-speed-t3317673"], "threads": [{"text": "especially on cm13", "time": "31st May 2016, 12:57 PM", "postID": "post67105813", "replies": []}, {"text": "The Robin is absolutely great in the speed department. I ditched my Nexus 6P for it when on paper that's defo a downgrade in a way.", "time": "27th June 2016, 09:45 PM", "postID": "post67508906", "replies": []}, {"text": "Doubted that while ordering the phone now this became daily driver.  The device performs really good on CM13 and the battery drain is also respectable", "time": "6th November 2016, 02:18 PM", "postID": "post69488337", "replies": []}, {"text": "considering change to cm13 after see posts above. i have been using the stock rom for couple week. speed is not too bad but definitely seen slow down as the phone is encrypted.", "time": "8th November 2016, 05:39 PM", "postID": "post69522446", "replies": []}]}, {"title": "App launch speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/nextbit-robin/review/app-launch-speed-t3317674"], "threads": [{"text": "All apps except for the camera launch quickly", "time": "11th March 2016, 05:29 PM", "postID": "post65781513", "replies": []}]}, {"title": "Multitasking/RAM", "rating": 5.0, "links": ["https://forum.xda-developers.com/nextbit-robin/review/multitasking-ram-t3317675", "https://forum.xda-developers.com/nextbit-robin/review/multitasking-ram-t3317675/page2"], "threads": [{"text": "Pretty good multitasking speed actually. That extra GB of RAM really sets it apart from 2GB phones like the 5/5x", "time": "29th June 2017, 06:34 AM", "postID": "post72843588", "replies": [{"text": "I know it isn't the place to ask questions , but I want to know , is this community (nextbit robin community) active ( or need she someone to port ROMs , make mods,...)?", "time": "29th June 2017, 06:47 AM", "postID": "post72843680", "replies": [{"text": "I'm honestly not sure as I got a Robin just today (it's a great deal!), but from what I see, it used to be fairly active, but is slowly dieing. There's more and more \"unofficial\" ports, threads seem to be quieting down a bit, slower developments...\n\nBut then again, like I said, I'm new here, and this is just what I noticed in my brief time here.\nOh and yeah this is the wrong thread.", "time": "29th June 2017, 06:56 AM", "postID": "post72843753", "replies": [{"text": "Another question concerning this device , is there 1 model or 2(one with 1080p cam and the other with 4K cam)", "time": "29th June 2017, 10:34 AM", "postID": "post72845479", "replies": [{"text": "No, there's only one model, and the camera can record in 4K.\n\nIt defaults to recording in 1080p though.", "time": "29th June 2017, 03:38 PM", "postID": "post72848495", "replies": [{"text": "Thank you\nI'll submit some mods on the theme and apps section soon ( when I'll receive mine ) , stay tuned", "time": "29th June 2017, 04:12 PM", "postID": "post72848935", "replies": []}, {"text": "The last question (please anwser asap because very important) :\n can you advises me any quick charger for my Nextebit Robin , the official one is unavailable so , can you tell me if they are any replacement charger(type C because I'm in the European Union)?? , And what charger are you using usually ??", "time": "29th June 2017, 06:37 PM", "postID": "post72850691", "replies": [{"text": "Well, if you buy the Nextbit Robin, it comes with a USB Type-C cable, all you need is a power brick to plug into the wall. I'm just using the one I got from my old phone. Honestly I don't know how wall charging would work in the EU since I've never traveled outside the US.\n\nEdit: As long as the charger you buy is a Qualcomm Quick Charge 2.0 or greater charger it will Quick Charge. Just be sure it's a certified one since there are dozens of knock offs.\n\nAlso, this will most likely not be a problem, but make sure you don't get one that uses a different Quick Charge technology like OnePlus's Dash charger.", "time": "29th June 2017, 08:17 PM", "postID": "post72851736", "replies": [{"text": "Alright , I found this on the web :\nhttps://www.amazon.fr/Charge-Chargeu.../dp/B00RCM0TGY\n\nCan you tell me if it's a good one ? If voltage is a problem, tell me please.", "time": "29th June 2017, 08:32 PM", "postID": "post72851860", "replies": []}]}]}]}]}]}, {"text": "I mean just look at the android/original android development sections they're full of recent ROMs. Development hasn't ever been this fast for the device. So to answer your question, yes it is active.", "time": "29th June 2017, 09:41 PM", "postID": "post72852507", "replies": []}]}]}]}, {"title": "Scrolling smoothness", "rating": 5.0, "links": ["https://forum.xda-developers.com/nextbit-robin/review/scrolling-smoothness-t3317676"], "threads": [{"text": "Loading new sites with video and ads will introduce stutter, where input is unresponsive for a second or two. Haven't tried true flagships lately so I'm not sure if this is normal behavior. Looking forward to root to install AdAway to alleviate these issues.", "time": "7th March 2016, 08:10 PM", "postID": "post65707986", "replies": []}, {"text": "Adaway is the first thing I installed once I had root.\n\nHaven't had any lag with browsing, but I do find the notification pulldown can lag quite noticeably sometimes. A little bit annoying.\n\nAlmost everything else is pretty smooth (and I'm quite fussy)", "time": "22nd March 2016, 01:27 PM", "postID": "post65977167", "replies": []}]}, {"title": "Heat", "rating": 3.0, "links": ["https://forum.xda-developers.com/nextbit-robin/review/heat-t3317677"], "threads": [{"text": "Can get hot if using Quick Charge and playing a game at the same time, with the hottest point being the back near the cloud logo. It's noticeably hot, but doesn't seem any more so than other phones.", "time": "7th March 2016, 08:13 PM", "postID": "post65708017", "replies": []}, {"text": "Getting quite hot for me during general use. On occasion barely doing that much as well. I think the CPU could do with some custom kernel love to try some undervolting and governor tweaking to help.", "time": "23rd March 2016, 08:04 AM", "postID": "post65991271", "replies": []}, {"text": "I think it might have to do with the fingerprint sensor. Mine gets hot with screen time.", "time": "13th May 2016, 10:56 PM", "postID": "post66840355", "replies": []}, {"text": "My Robin used to get hot but not much anymore with the newer updates.", "time": "27th June 2016, 09:44 PM", "postID": "post67508892", "replies": []}, {"text": "Mine gets really hot when playing Pokémon go, but I think it's because of being a bad optimized app.", "time": "17th December 2016, 06:05 PM", "postID": "post70135858", "replies": []}, {"text": "My Robin gets hot no matter what ROM I am using.  I have tried stock, AOSPA, Lineage and Omni.  I emailed Nextbit customer support about this issue when I first got my Robin (when they still did email support).  I went through the battery tests they suggested (FCQ (*#*#6721#*#* on the stock ROM) and Ampere) and provided them with screenshots.  They stated that the temps I was showing in the screenshots of the battery tests I performed were 'normal' for the device.  \n\r\nI have found that the Robin is really sensitive to the temperature of the environment that it is in.  On hot days, under mild use, the device gets very hot (like battery temps around 110-116 F).\n\r\nAt this point, it is what it is.  I think that the excessive heat is a combination of a processor that is known to run a bit hot, combined with the materials that the phone is made of.", "time": "19th August 2017, 01:27 PM", "postID": "post73457694", "replies": []}, {"text": "I had it to film a concert (sound is ruined on any videos, pictures ok..ish) But the thing, it was incredible hot, i had to stop using it during the concert and it felt like it burned a hole in my pocket for a bit after i turned it off, and it also gets reallly hot around the fingerprint sensor, and the display itself was like a pocket warmer.\nMight been cause i used a Thick and robost phone case, cause i am afraid i break it anytime i put in my pocket.... \nSend it back to amazon and got my money back now. (Bought it just when it dropped to 100$, now its gone from amazon.de.. lol)", "time": "4th April 2018, 04:56 PM", "postID": "post76122574", "replies": []}]}, {"title": "Low light", "rating": 3.5, "links": ["https://forum.xda-developers.com/nextbit-robin/review/low-light-t3317678"], "threads": []}, {"title": "Photo quality", "rating": 3.5, "links": ["https://forum.xda-developers.com/nextbit-robin/review/photo-quality-t3317679"], "threads": [{"text": "I feel like it's generally good when you're taking a closeup shot. So like when you're about 3 feet or less from the subject. It especially takes better pictures when you force (not auto, always on flash) the flash on to take the picture. Manual mode helps to lighten up pictures. The best pictures are taken outside in really vibrant, clear sunlight. Not a yellow/orange tinted day. The further you are from a subject the worse the photo quality. It seems like the photos seem to be a bit out of focus in the final results than in the viewfinder. Also, sometimes the pictures seem a bit, smudgy. It's like the pictures aren't really true-to-life sometimes (The more landscape photos or more than 3 feet away from subject, and without flash), they come off like pastel drawings.", "time": "4th June 2016, 10:32 PM", "postID": "post67172782", "replies": []}]}, {"title": "Video quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/nextbit-robin/review/video-quality-t3317680"], "threads": []}, {"title": "Selfie quality", "rating": 3.5, "links": ["https://forum.xda-developers.com/nextbit-robin/review/selfie-quality-t3317681"], "threads": [{"text": "I really like the selfie camera. However, colors aren't as accurate or vibrant. Colors sometimes come out as light ghostly. Like it takes in too much brightness when in good lighting, and blows you out in the photo, than using enough contrast, warm, and color accuracy to accurately represent you in the photo. I also think having a selfie light flash such as the HTC 10 has which makes the screen blink bright before taking the picture than taking the picture would be a great iteration. I do think the selfie camera is great though, there's just always room for  improvement.", "time": "4th June 2016, 10:40 PM", "postID": "post67172856", "replies": []}]}, {"title": "Time to take picture (camera launch speed)", "rating": 4.5, "links": ["https://forum.xda-developers.com/nextbit-robin/review/time-to-picture-camera-launch-speed-t3317682"], "threads": [{"text": "Nextbit's camera app needs work, in that it launches a bit slow and suffers from shutter lag. You will notice the screen flash and freeze frame as you take a picture, but the resulting photo will be a little later than that, so you will miss time-sensitive moments. Lag remains when using Google's stock camera app. An update has been promised for release in April.", "time": "7th March 2016, 08:16 PM", "postID": "post65708070", "replies": []}, {"text": "Pretty fast, I have no issues.", "time": "4th June 2016, 10:38 PM", "postID": "post67172839", "replies": []}]}, {"title": "Software (ease of use, features, etc)", "rating": 4.0, "links": ["https://forum.xda-developers.com/nextbit-robin/review/software-ease-features-t3317683"], "threads": [{"text": "Software is pretty great. I do think that there needs to be an update on the HDR mode. I always feel like HDR is supposed to accurately represent the colors of the photo, as well as the brightness and contrast accurately when the auto mode doesn't do it properly. But on the Robin, it kind of makes the photo look artificial with brightening the whole photo then adding that shine like effect on it.", "time": "4th June 2016, 10:42 PM", "postID": "post67172871", "replies": []}]}, {"title": "Charging speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/nextbit-robin/review/charging-speed-t3317684", "https://forum.xda-developers.com/nextbit-robin/review/charging-speed-t3317684/page2"], "threads": [{"text": "Charging speed with a Quick Charge 2.0 adapter is as expected: excellent. It is in line with other phones with the same capability.", "time": "25th February 2016, 07:41 PM", "postID": "post65520196", "replies": [{"text": "Will Quick Charging work with my Motorola Turbo charger if I use the Robin cable on it?", "time": "4th March 2016, 03:55 AM", "postID": "post65644193", "replies": [{"text": "I'm not sure, but I've tested it with Aukey (wall) and Anker (car) chargers, both work fine with Quick Charge 2.0 speeds.", "time": "5th March 2016, 05:47 AM", "postID": "post65661499", "replies": []}, {"text": "I'm a year late, but yes it will (I tried it with a 15 watt, doesnt charge as fast as the Samsung Adaptive Fast Charging brick though)", "time": "5th June 2017, 09:25 PM", "postID": "post72561573", "replies": []}]}]}, {"text": "I charged with the official charger and a Iselector Qualcomm quick charge and nothing as well. Iselector worked on both the V10 and G4. Not sure why this is not working", "time": "13th March 2016, 07:45 AM", "postID": "post65809134", "replies": []}, {"text": "Nevermind. Charging fast now. False Alarm lol", "time": "14th March 2016, 01:12 AM", "postID": "post65824271", "replies": []}, {"text": "I thought the charging speed was great when I wasn't paying attention, but when I did actually pay attention and time it, it took about 1 hour and 40 minutes to fully charge. So, I would check into that. Also, the Robin doesn't seem to be USB-C Power Delivery Compliant to deliver the rapid charging like the Nexus 6p and Nexus 5x does, so getting fast charging from USB-C chargers that take USB-C to USB-C cables is useless, you'll get standard speeds. So please implement USB-C Power Delivery in the successor to the Nextbit Robin, so we can enjoy that fast charging technology as well, in addition to Qualcomm Quick Charge fast charging technology.", "time": "4th June 2016, 10:57 PM", "postID": "post67173002", "replies": []}, {"text": "I am waiting for my Robin to be delivered. I am really confused about the charger. Does it show anything on the screen when a proper quick charge 2 charger is used. Like, in my Nexus 5X when I use original charger it shows \"charging rapidly\" but when I use another charger it shows \"charging\" or \"charging slowly\" depending on the source.\n\r\nI'm from Bangladesh and it's hard to find a certified QC 2.0 charger. Is it ok if I buy a charger which is has 5V2A or 9V2A or 12V1.5A written on it?", "time": "12th December 2016, 09:58 AM", "postID": "post70049455", "replies": [{"text": "Yes, it shows the same charging messages as the Nexus.", "time": "13th December 2016, 08:15 PM", "postID": "post70074676", "replies": [{"text": "I ended up ordering a Nextbit charger.", "time": "26th December 2016, 07:42 AM", "postID": "post70257760", "replies": []}]}]}, {"text": "My Nextbit charges slowly no matter what . i have tried new cables and different adapters and outlets.  Could it be a software issue ?", "time": "29th December 2017, 06:24 PM", "postID": "post75005608", "replies": [{"text": "What version of the os?", "time": "1st January 2018, 12:20 AM", "postID": "post75031614", "replies": [{"text": "Android 7.1.1 with nextbits original firmware", "time": "2nd January 2018, 04:03 PM", "postID": "post75049650", "replies": []}]}]}, {"text": "With a Qualcomm  3.0 charger and 3.0 cables, I get 2500ma speeds (12.5w). Only when charging from less than 50% though. The charging speed slows down as you approach 100%. The lock screen should say \"charging rapidly\" if it's working though.", "time": "1st January 2018, 10:08 PM", "postID": "post75041358", "replies": []}]}, {"title": "Screen on time", "rating": 4.0, "links": ["https://forum.xda-developers.com/nextbit-robin/review/screen-time-t3317685"], "threads": []}, {"title": "Standby drain", "rating": 4.5, "links": ["https://forum.xda-developers.com/nextbit-robin/review/standby-drain-t3317686"], "threads": []}, {"title": "Heavy use endurance", "rating": 3.0, "links": ["https://forum.xda-developers.com/nextbit-robin/review/heavy-endurance-t3317687"], "threads": []}, {"title": "Light use endurance", "rating": 4.5, "links": ["https://forum.xda-developers.com/nextbit-robin/review/light-endurance-t3317688"], "threads": []}, {"title": "\"Look\" of the device (aesthetics)", "rating": 5.0, "links": ["https://forum.xda-developers.com/nextbit-robin/review/look-device-aesthetics-t3317689"], "threads": [{"text": "unique", "time": "31st May 2016, 12:57 PM", "postID": "post67105817", "replies": []}, {"text": "Absolutely love the design of the phone, the only real reason I backed it on Kickstarter, something different", "time": "2nd June 2016, 02:49 PM", "postID": "post67137321", "replies": []}, {"text": "Amazing! One of the most uniquely designed and looking phones ever. I constantly have people come up to me to ask about my phone, or stop and double take. Please keep the unique and dual-tone colors on the successor to the Nextbit Robin. The length of the phone is great, the rectangular design is great, the circle design language mix with the boxy rectangular design language is just perfect. Such a cool looking phone. Keep this design language.", "time": "4th June 2016, 10:47 PM", "postID": "post67172904", "replies": []}, {"text": "I absolutely love the unique colors of the mint (dang I wish I had mint night) it just stands out in a good way compared to every other metal slab phone there is.", "time": "27th June 2016, 09:42 PM", "postID": "post67508872", "replies": [{"text": "Well, your wish is coming true a year later lol... I will begin creating just that soon XD....\nPhotos of Custom Robin Link", "time": "24th November 2017, 01:22 AM", "postID": "post74616036", "replies": []}]}, {"text": "This is the reason I bought this phone.  I have been wanting a true squared phone for a while.  The older Sony models were close to perfection, I believe this one nails it.  This will be a phone in my lineup that will most likely get the most use, with a OnePlus 3T and a Samsung Galaxy S7 Edge.  I can't stand the edge, but I like to have a factory / carrier phone just incase something funky happens.  The 3T is a power horse and fun for modding.", "time": "7th January 2017, 09:54 PM", "postID": "post70445115", "replies": [{"text": "I second the notion  \r\nI have an Axon7 and a S7 edge, just picked up the Robin a few days ago and love the design. \r\nIt not feel as premium as glass on glass (s7 edge) or all metal (Axon7) but it still feel great, and I love the finger print sensor placement!", "time": "8th January 2017, 01:48 AM", "postID": "post70447147", "replies": []}]}, {"text": "To this day I can't go more than a week without somebody asking what kind of phone that is? It's very eye catching and is greatly part of why I got it.", "time": "4th November 2017, 10:28 AM", "postID": "post74401677", "replies": []}]}, {"title": "Quality feel (use of materials)", "rating": 3.5, "links": ["https://forum.xda-developers.com/nextbit-robin/review/quality-feel-materials-t3317690"], "threads": [{"text": "The Nextbit Robin feels light for its size, but is solidly built. It uses a smooth plastic all around, so it can be slippery if you have dry hands. A soft touch rubber coating, seen on phones like the Nexus 5, would have been an improvement. The raised volume buttons are clicky, responsive, and snug. The power button, which also houses the fingerprint sensor, is clicky and is flush with the body.", "time": "25th February 2016, 07:46 PM", "postID": "post65520287", "replies": []}, {"text": "never thought about how much this would capture fingerprints on the back.. i have cleaned with alcohol wipes daily.", "time": "22nd March 2016, 07:35 PM", "postID": "post65982923", "replies": []}, {"text": "It's too slippery, and mine has a weird bump on the back.", "time": "25th March 2016, 04:09 PM", "postID": "post66032002", "replies": []}, {"text": "My girl friend and I were backers of the phone through kickstarter. \n\nWe just received the devices a week or so ago and take good care of our electronics. We had them in tempered screen protectors and cases since unboxing and with a little over a week the colored portions of the device are deteriorating at an astonishing rate. \n\nMy electric has got what seems to be a scratch on the top portion, and my girlfriend's is starting to discolor (while in the bumps case) around the edges and has a random dent on the top. \n\nIncredibly non-durable and disappointing to say the least.  \nMint Discoloration & Dents: https://drive.google.com/file/d/0Bys...ew?usp=sharing\nElectric Scratches on Top - 1 Week in Jeans (No Change or keys) : https://drive.google.com/file/d/0Bys...ew?usp=sharing", "time": "29th March 2016, 09:02 PM", "postID": "post66100436", "replies": []}, {"text": "It is still holding up. Appears too how the phone is developing stress cracks on the front speakers and by the charging port.", "time": "2nd June 2016, 07:19 AM", "postID": "post67132372", "replies": []}, {"text": "Mine has unfortunately started to peel slightly around the camera and the speaker and a very strange crack has appeared beside the power button.", "time": "2nd June 2016, 02:50 PM", "postID": "post67137338", "replies": []}, {"text": "I don't know what else to say besides it feel really amazing in the hand and very high-quality and premium.", "time": "4th June 2016, 10:48 PM", "postID": "post67172907", "replies": []}, {"text": "So the Robin feels great, the phone fit perfect in my hand and the texture of the plastic used does feel pretty good. Its lightweight but still pretty solid for the material. Now as for the actual design of the product, paired with the processor and the fact that it seems to get pretty warm pretty quick, I have had some bad luck with the phone. I had the phone for about 4-5 days and used it relatively lightly, with the exception of streaming videos and your basic games. I noticed the phone would get really warm really quick. Upon flipping the phone over to check the back I noticed what seemed to be a scratch, which was odd as I have not taken the phone out of a case or even put it in my pocket with anything before a case was on it. So a couple more days went by and I noticed more \"scratches\". Now this seemed very weird. Upon looking into it further I noticed a bulge in the lower central part of the phone and the \"scratches\" were appearing bbetween the cloud logo, where the phone reached its hottest, and the bulge. So I reached out to Nextbit and they advised I get a replacement sent, which I did, however I noticed upon receiving the replacement there seems to be the same odd bulge in the same location as my previous phone. The stress marks kept growing on the old phone, and now it has me worried that the new replacement will be doing the same thing. I have attached some pictures of the stress marks on the phone before I sent it back to have it for documentation. \n\r\nIt's sad as I really enjoy the snappiness of the phone and the design of both the hardware and OS however I just think the phone could have been tested a bit more before being put out to production. Overall its a pretty solid phone and for the price point on amazon ($299) is a plus.", "time": "23rd June 2016, 05:27 AM", "postID": "post67445204", "replies": []}]}, {"title": "Ergonomics (in-hand feel)", "rating": 4.5, "links": ["https://forum.xda-developers.com/nextbit-robin/review/ergonomics-hand-feel-t3317691"], "threads": [{"text": "While the Nextbit Robin looks too geometrical for comfort, it's not the case since it has generous rounded corners. The smooth plastic body may be a little slippery for dry hands, which may lower confidence taking the phone in and out of the pocket throughout the day.", "time": "25th February 2016, 07:49 PM", "postID": "post65520334", "replies": []}, {"text": "I found the corners at the bottom make for difficult \"lying back in bed\" texting.\n\nGenerally you lay the phone balancing on the side of one of your pinkies, but this is difficult and it's almost like a balancing act.\n\nUsage in other scenarios are no problem. The corners make it slightly more awkward for jacket pockets that aren't also square though.", "time": "23rd March 2016, 08:06 AM", "postID": "post65991285", "replies": []}, {"text": "I recieved my Robin yestrday and after one day, I have to say it's one of the best phones I ever held in my hand. It's simple, fits in my hand just perfectly.", "time": "26th March 2016, 08:11 AM", "postID": "post66042469", "replies": [{"text": "Do you feel you have a small or large hands? This is definitely a big phone which is my concern.", "time": "29th April 2016, 06:43 PM", "postID": "post66607957", "replies": []}]}, {"text": "I have VERY large hands but the Robin feels like it was made to fit your hand.  It is very comfortable to hold, the square frame is deceiving.", "time": "12th May 2016, 03:31 AM", "postID": "post66811303", "replies": []}, {"text": "i admit i have to say that the robin is something really beautiful for our hands.\n\r\ncoming from the oneplus one, which has a really nice backcover, we all know that, it feels just great in the hands.\r\nits not that cold and normal plastic, but its a soft nice warm touch.\n\r\ngreez", "time": "31st May 2016, 12:55 PM", "postID": "post67105796", "replies": []}, {"text": "Absolutely amazing! This is something the Robin REALLY excels at. I have both the HTC 10 and the Nextbit Robin and the Nextbit Robin feels so much better in the hands. It really feels premium. The solid feel and weight in the hand is perfect. Also the length of the phone feels great in the hand. Please do no change this factor in the successor to the Nextbit Robin. Additionally, the top and bottom of the Robin (The 2nd color - mine being the blue of the electric) makes the phone much longer and rectangular, this with the boxiness makes it much more easier to type out messages on the Robin compared to more curved smartphones such as the HTC 10. Please keep the rectangular frame on the successor, this is great!", "time": "4th June 2016, 10:45 PM", "postID": "post67172884", "replies": []}, {"text": "The Robin feels clean. It's super sharp (look wise), and the texture is smooth to the touch. Overall really pleased with the ergonomics of this device.", "time": "18th November 2016, 04:50 PM", "postID": "post69684434", "replies": []}, {"text": "I have a Robin  and Nexus 5x. Generally speaking, the Nexus has the perfect feel with with and without a case. The Robin has an amazing feel without a case, and is just slightly too wide and long for me to enjoy with one hand with a case on it. (That is a finger length issue ...not a phone problem for sure, as it is one of the most attractive phones I have seen).", "time": "14th May 2017, 04:58 PM", "postID": "post72291340", "replies": []}]}, {"title": "OEM skin/software", "rating": 5.0, "links": ["https://forum.xda-developers.com/nextbit-robin/review/oem-skin-software-t3317692"], "threads": [{"text": "The default launcher that Nextbit developed needs more work. If you have a dark wallpaper, the app names are still displayed with a dark font. There's no app drawer icon in the bottom shelf, instead it's an icon on the home screen that requires two taps to show all apps in a vertical list. Since this is a custom launcher, access to Google Now is not as intuitive as scrolling to the left.\n\nAs a long-time Nexus user, I am biased. I've resorted to switching to the Google Now launcher, and things are much better. Your mileage may vary.", "time": "7th March 2016, 08:24 PM", "postID": "post65708185", "replies": []}]}, {"title": "Outdoor visibility (max brightness)", "rating": 4.5, "links": ["https://forum.xda-developers.com/nextbit-robin/review/outdoor-visibility-max-brightness-t3317693"], "threads": [{"text": "generally ok but does funny things sometimes with auto brightness", "time": "2nd June 2016, 02:51 PM", "postID": "post67137349", "replies": []}]}, {"title": "Contrast (true blacks)", "rating": 5.0, "links": ["https://forum.xda-developers.com/nextbit-robin/review/contrast-true-blacks-t3317694"], "threads": []}, {"title": "Color saturation & accuracy", "rating": 5.0, "links": ["https://forum.xda-developers.com/nextbit-robin/review/color-saturation-accuracy-t3317695"], "threads": []}, {"title": "Clarity/resolution", "rating": 5.0, "links": ["https://forum.xda-developers.com/nextbit-robin/review/clarity-resolution-t3317696"], "threads": []}, {"title": "Minimum brightness", "rating": 5.0, "links": ["https://forum.xda-developers.com/nextbit-robin/review/minimum-brightness-t3317697"], "threads": [{"text": "The minimum brightness is low enough, but not the lowest I've seen. Among my devices the Nexus 7 (2013) can go lower, so to compensate I use Twilight to introduce additional dimming. As I already use Twilight to automatically cut blue light at dusk, this is not an inconvenience.", "time": "25th February 2016, 07:52 PM", "postID": "post65520377", "replies": []}]}, {"title": "Call quality", "rating": 5.0, "links": ["https://forum.xda-developers.com/nextbit-robin/review/call-quality-t3317698"], "threads": [{"text": "I was suprised how good sound quality is.", "time": "26th March 2016, 08:13 AM", "postID": "post66042499", "replies": []}, {"text": "Call quality is very high.", "time": "3rd August 2016, 07:29 PM", "postID": "post68030053", "replies": []}, {"text": "Call quality is a definite reason to get this phone. Coming from a Nexus4, calls are clearer and more intelligible on both ends.", "time": "29th November 2016, 12:28 AM", "postID": "post69840650", "replies": []}, {"text": "I have found call quality to be great. Great volume and clarity for me and the person on the other end.", "time": "2nd December 2016, 12:52 AM", "postID": "post69888110", "replies": []}]}, {"title": "WiFi strength, range, and throughput", "rating": 5.0, "links": ["https://forum.xda-developers.com/nextbit-robin/review/wifi-strength-range-throughput-t3317699"], "threads": []}, {"title": "Cellular strength and throughput", "rating": 5.0, "links": ["https://forum.xda-developers.com/nextbit-robin/review/cellular-strength-throughput-t3317700"], "threads": [{"text": "Upgraded from HTC One M7, a metal phone made by the same designer of the Robin. Previous dead spots now give me a couple bars of LTE, so there is definitely an improvement.", "time": "7th March 2016, 08:27 PM", "postID": "post65708232", "replies": []}]}, {"title": "Speakerphone (loudness, clarity)", "rating": 4.0, "links": ["https://forum.xda-developers.com/nextbit-robin/review/speakerphone-loudness-clarity-t3317701", "https://forum.xda-developers.com/nextbit-robin/review/speakerphone-loudness-clarity-t3317701/page2"], "threads": [{"text": "Compared to the HTC One M7, the speakers on the Nextbit Robin are not as loud or clean. The low-end cuts out a little at max volume, distortion can be heard at louder volumes. It has a slightly hollow sounding quality, as if the sound is echoing in the body. While better than many smartphone speakers due to it being front-facing stereo setup, it's not as refined as HTC's offerings.\n\nBest use scenario for the speakers are for podcasts, YouTube videos, and light gaming. Music aficionados or those who spend a significant time consuming video content without headphones may want to demo the unit before considering a purchase.", "time": "25th February 2016, 07:38 PM", "postID": "post65520144", "replies": []}, {"text": "Speakers are very bad! At 80% volume they distort and crackle. Even some ring tones crackle at full volume. Very disappointed.", "time": "17th March 2016, 09:00 PM", "postID": "post65897607", "replies": []}, {"text": "The speakers sound extremely bad. And the sound output itself too. It probably has to do with the software though, because there is no way it can sound this bad without doing something wrong with the software. Honestly, I get sick listening to the speakers. They have this extremely weird effect on the sound that makes the speakers sound like crap.", "time": "18th March 2016, 08:14 AM", "postID": "post65904808", "replies": []}, {"text": "was fine, then recent update made min volume incredibly loud!\r\nhopefully next update will fix it", "time": "2nd June 2016, 02:52 PM", "postID": "post67137364", "replies": []}, {"text": "I am currently testing the next update... The volume ramp up had been fixed! It's so much better now. We plan on releasing it soon, but we still need more testing done as well as certification through Google, so it will take some time. Thanks for everyone's patience!", "time": "4th June 2016, 08:50 AM", "postID": "post67163512", "replies": []}, {"text": "im on latest OS 7.1.1 april security patch.\n\ncrackling sound. at 50% volume still there. how can to fix it? \n\nits hardware problem?", "time": "24th August 2017, 06:18 AM", "postID": "post73519027", "replies": [{"text": "thru headphone or speaker?", "time": "2nd October 2017, 02:47 PM", "postID": "post74009320", "replies": [{"text": "bottom speaker", "time": "3rd October 2017, 05:51 AM", "postID": "post74016687", "replies": [{"text": "even in custom roms?", "time": "3rd October 2017, 08:11 AM", "postID": "post74017579", "replies": [{"text": "yes. on AOSPA rom more cracklingg.", "time": "3rd October 2017, 10:39 AM", "postID": "post74018806", "replies": []}]}]}]}]}]}]