[{"title": "Overall love", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s9/review/overall-love-t3746268", "https://forum.xda-developers.com/galaxy-s9/review/overall-love-t3746268/page2"], "threads": [{"text": "Just had a chance to use review unit of s9 . Camera and sound has some improvement but really disappointed that battery is still same size and has not changed since s7 ... S7 edge camera is still very much capable and if u just want to upgrade from s7 or s8 for camera then its not worth it in my opinion", "time": "26th February 2018, 02:01 AM", "postID": "post75695974", "replies": [{"text": "Well,  the cpu efficiency  has changed... more ram is added,  so 3500 could actually work out definitely  better than s8 plus... which  isnt bad on battery,", "time": "27th February 2018, 06:03 PM", "postID": "post75716520", "replies": []}]}, {"text": "The Galaxy S9 is my first Android Phone and I switched from an iPhone 7 to it. \r\nThis Mobile is absolutely Genius. I just love it. The Dual Sim Option was the reson for the switch but after 2 days I can say I love all the features the Galaxy S9 has. I can recommend a switch to everyone.", "time": "13th March 2018, 11:08 AM", "postID": "post75872987", "replies": [{"text": "ate you using the standrd version?\r\nis dual sim option available for all versions?", "time": "13th March 2018, 07:04 PM", "postID": "post75877745", "replies": [{"text": "Dual sim is a special version of the unlocked model (or maybe the standard version of the unlocked one, I haven't checked this year). You are able to slot a second sim in place of the SD card if you want to.\n\nAfter 2 days, I can say I am really impressed with everything except the battery life, and I know that will get better as it stabilizes and I am not tweaking it constantly. I am especially impressed with the new speakers and the Atmos surround - the best movie sound I have heard on a phone yet!", "time": "16th March 2018, 12:15 AM", "postID": "post75904005", "replies": []}]}]}, {"text": "I got the mobile from my carrier and they said they only have dual sim phones.", "time": "16th March 2018, 09:58 AM", "postID": "post75907434", "replies": []}, {"text": "Switched over from an iPhone 6S.  I borrowed a Pixel (original) and then a very old Droid Maxx (painful!)\n\nFirst 48 hours with the S9 Snapdragon have been really good, I think I actually prefer TouchWiz over vanilla Android Oreo on the Pixel.\n\nHardware quality is outstanding.  I'm in love with the screen.  AOD sounded like it would waste a lot of battery but doesn't seem to.  It's really useful and keeps me from turning my phone on all the time to see if there are messages.\n\nBixby isn't awful, but I wish it worked with Signal for messaging.  I will have to see if there's some way to make the two work together.\n\nMy biggest gripe is that annoying `high volume` warning that can't be disabled.  I'm streaming to my car, the signal is supposed to be set to 100%.", "time": "16th March 2018, 03:59 PM", "postID": "post75910751", "replies": []}, {"text": "Yes it is love, it is possible to love a phone you attached full day and night❤️", "time": "17th March 2018, 12:34 AM", "postID": "post75915343", "replies": []}, {"text": "It's soooo gooood! I came from an S6 so the improvements are nuts. I was asking myself if loving a phone was possible just yesterday", "time": "18th March 2018, 07:59 PM", "postID": "post75934982", "replies": []}]}, {"title": "Community development strength", "rating": 0.0, "links": ["https://forum.xda-developers.com/galaxy-s9/review/community-development-strength-t3746269"], "threads": []}, {"title": "Overall speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s9/review/overall-speed-t3746270"], "threads": [{"text": "Home button delays the same as in Galaxy S8, that's why you don't remove the physical one", "time": "24th March 2018, 06:41 PM", "postID": "post76003378", "replies": []}, {"text": "I have owned the exynos variant for about 2 weeks. I use it having decreased the animation time and there is absolutely no stutter. I've come for the s7 which is no slouch and can feel that this is the most refined experience yet. You can't go wrong. I can't lie I had 'terrible' battery for about 1 and half weeks. But it's much better now.", "time": "25th March 2018, 08:09 AM", "postID": "post76008568", "replies": [{"text": "How about the gpu performance?", "time": "07 April 2018, 01:50 PM", "postID": "post76143064", "replies": [{"text": "Definitely no sloucher in gaming performance. Does not lack performance whatsoever, can handle all games including the Honkai Impact 3 at max settings with no fps drops.  Its basically the second best gaming performer right now outperformed by the SD845. but although battery life is not bad, apparently SD845 is better in every way. This year i'd actually consider the SD845. What device do you currently own? Because that way i might advise you wait for the S10 where they will actually improve efficiently a lot with the new 7nm chips.\n\nEdit: Don't get me wrong, i love the S9 even though i owned the S7 previously. The features it includes such as the Dolby Atmos supported stereo speakers, headphone jack and the great experience Touchwiz offers in my opinion. Touchwiz just looks better than stock android which otherwise is boring in my opinion and other manufacturers are still refining their experience. And if you don't like touchwiz? Get a launcher or even change your theme to your liking. Hopefully Samsung will increase the amount of software updates due to Project Treble support too.\n\nIt's just that depending on your device and its state, i'd wait for the S10 which i reckon will be the 'holy grail' (unless they somehow screw it up). By then performance wouldn't be a issue whatsoever and battery life should increase and hopefully capacity too.\n\nAny more questions feel free to ask. I'm willing to help.", "time": "07 April 2018, 02:37 PM", "postID": "post76143518", "replies": [{"text": "Woah thank you alot! Im having this kind of feeling where I am dissatisfied with the s9, especially with exynos, yet you made me calm. I got s5 from Dubai with Snapdragon which is surprising since SD is only available in US and in China, and this year, I hope that my model going to have on 13th of April is SD too. Im really excited! Anyways, coming from s5 to s9 is considerably a \"good\" upgrade, isnt? My screen is dying and it cant wait for s10 anymore", "time": "07 April 2018, 02:52 PM", "postID": "post76143656", "replies": []}]}]}]}]}, {"title": "App launch speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s9/review/app-launch-speed-t3746271"], "threads": []}, {"title": "Multitasking/RAM", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s9/review/multitasking-ram-t3746272"], "threads": []}, {"title": "Scrolling smoothness", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s9/review/scrolling-smoothness-t3746273"], "threads": []}, {"title": "Heat", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s9/review/heat-t3746274"], "threads": []}, {"title": "Low light", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s9/review/low-light-t3746275"], "threads": [{"text": "Much better than I expected!", "time": "11th March 2018, 07:31 PM", "postID": "post75853841", "replies": []}, {"text": "Really looks good took pictures in low light and everything came out good.", "time": "14th March 2018, 03:42 PM", "postID": "post75887262", "replies": []}, {"text": "I just started an youtube channel focused on camera test and reviews, and my first upload is a low light test between my 2 phones: Galaxy S9 and Mate 10 Pro. I will sell one of the phones to keep new ones comming for new reviews. So wich one would you choose? (daylight review comming soon)\n\nhttps://www.youtube.com/watch?v=S6QlGoBpCzI&t=16s", "time": "2nd April 2018, 03:20 PM", "postID": "post76098669", "replies": []}, {"text": "Samsung Galaxy S9 VS Google Pixel 2 Camera Battle:\nhttps://www.youtube.com/watch?v=E6pfvcy9Shk", "time": "4th April 2018, 11:37 PM", "postID": "post76126233", "replies": []}]}, {"title": "Photo quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s9/review/photo-quality-t3746276"], "threads": [{"text": "We have early Camera Test from PC World:\n\nSamsung Galaxy S9 1.5 vs 2.4 Aperture: https://www.pcworld.com/article/3257...mera-test.html\n\nGo to post : Samsung Galaxy S9 Dual Aperture - f/1.5 vs f/2.4 | What's the Difference ?", "time": "26th February 2018, 05:23 AM", "postID": "post75697110", "replies": []}, {"text": "Dx0mark   the new king os smartphones,    s9 plus scoring 99 points", "time": "1st March 2018, 11:59 AM", "postID": "post75735123", "replies": []}, {"text": "This post has user-made pics sample as well https://www.reddit.com/r/Android/com..._of_galaxy_s9/\nI notice the F1.5 does improve quality significantly in low light, though I'm not sure if that's enough for people to be convinced. you only see the difference if you zoom in and pixel peep.", "time": "6th March 2018, 12:41 AM", "postID": "post75786583", "replies": []}, {"text": "I just started an youtube channel focused on camera test and reviews, and my first upload is a low light test between my 2 phones: Galaxy S9 and Mate 10 Pro. I will sell one of the phones to keep new ones comming for new reviews. So wich one would you choose? (daylight review comming soon)\n\nhttps://www.youtube.com/watch?v=S6QlGoBpCzI&t=16s", "time": "2nd April 2018, 03:21 PM", "postID": "post76098681", "replies": []}, {"text": "and this is my daylight camera test:\n\nhttps://youtu.be/41guxYgASpY", "time": "3rd April 2018, 11:07 AM", "postID": "post76107739", "replies": []}, {"text": "Just one economy bulb 15W (equivalent to a 40-60w regular bulb) bulb above my desk. The other light is coming from the monitor with an YouTube video opened in full screen. The picture was made in auto mode, and has no additional editing.  I mention that the picture was taken in the ultra wide mode 18.5:9 f/1.5 .", "time": "4th April 2018, 09:52 PM", "postID": "post76125526", "replies": []}, {"text": "Samsung Galaxy S9 VS Google Pixel 2 Camera Battle:\nhttps://www.youtube.com/watch?v=E6pfvcy9Shk", "time": "4th April 2018, 11:37 PM", "postID": "post76126236", "replies": []}]}, {"title": "Video quality", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s9/review/video-quality-t3746277"], "threads": [{"text": "Some Test using the Galaxy S9 vs the Pixel but this is ONLY using Cinema 4k and Filmic Pro - https://youtu.be/pIpD05-vFhs\nHere is a test in fairly low light using the stock app vs cinema 4k. Also I wanted to see how grading the footage from the stock app did.  - https://youtu.be/jrXUYjpWj_E\nThe stock camera app is surprisingly good. I am coming from a google pixel 2 which the stock app is terrible for video quality.", "time": "19th March 2018, 09:43 PM", "postID": "post75947533", "replies": []}, {"text": "Galaxy S9 destroys google pixel 2 in low light https://youtu.be/ZX_JY35oFCc", "time": "22nd March 2018, 10:52 PM", "postID": "post75983243", "replies": []}, {"text": "IDK the pixel 2 was holding its own. Im also moving from an XL2 but I think the camera and video are better on the XL2. However im not sure they they its so much better to warrant the hardware problems i have had with the XL2", "time": "22nd March 2018, 10:55 PM", "postID": "post75983267", "replies": []}, {"text": "not even close", "time": "23rd March 2018, 02:55 AM", "postID": "post75984793", "replies": []}, {"text": "Vlogging test using the S9. Gotta say Im super impressed. https://youtu.be/pgtPisI9BBg", "time": "24th March 2018, 03:33 PM", "postID": "post76001536", "replies": []}, {"text": "Here is a test with the built in microphone VS several vlogging mics. https://www.youtube.com/watch?v=in3DwY2IKUA&t=17s", "time": "24th March 2018, 09:41 PM", "postID": "post76004898", "replies": []}, {"text": "https://youtu.be/rl3nI1W9ryM\nSlow motion 4k 60 fos b-roll", "time": "06 April 2018, 04:00 AM", "postID": "post76127728", "replies": []}]}, {"title": "Selfie quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/galaxy-s9/review/selfie-quality-t3746278"], "threads": []}, {"title": "Time to take picture (camera launch speed)", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s9/review/time-to-picture-camera-launch-speed-t3746279"], "threads": []}, {"title": "Software (ease of use, features, etc)", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s9/review/software-ease-features-t3746280"], "threads": []}, {"title": "Charging speed", "rating": 4.0, "links": ["https://forum.xda-developers.com/galaxy-s9/review/charging-speed-t3746281"], "threads": []}, {"title": "Screen on time", "rating": 4.0, "links": ["https://forum.xda-developers.com/galaxy-s9/review/screen-time-t3746282", "https://forum.xda-developers.com/galaxy-s9/review/screen-time-t3746282/page2", "https://forum.xda-developers.com/galaxy-s9/review/screen-time-t3746282/page3", "https://forum.xda-developers.com/galaxy-s9/review/screen-time-t3746282/page5"], "threads": [{"text": "I usually get 4 hours top, how about others?\n\r\nI use the phone moderately, AOD, 4G, GPS high accuracy enabled. Auto-brightness, QHD resolution, no battery saver, no high-performance mode.\n\r\nI voted 3*", "time": "15th March 2018, 12:15 PM", "postID": "post75897003", "replies": [{"text": "Exynio version??", "time": "15th March 2018, 04:38 PM", "postID": "post75899761", "replies": []}]}, {"text": "Yes", "time": "15th March 2018, 04:53 PM", "postID": "post75899928", "replies": []}, {"text": "Used to get about 5 1/2 on the s8+.  So far I'm at 35% on the so and over 3hrs of sot.  Expecting similar with the s9 due to smaller bat.", "time": "16th March 2018, 04:01 PM", "postID": "post75910770", "replies": []}, {"text": "4.5 hours yesterday ..\n\nToday my 3rd full charge seems to be on Pace for 5 hours plus ...about 50% brightness, multiple Bluetooth devices", "time": "16th March 2018, 07:21 PM", "postID": "post75912865", "replies": []}, {"text": "First few days was around 4ish now I've done just over 6 twice in a row. Hopefully I'll be able to get 6 on avg going forward!", "time": "16th March 2018, 08:55 PM", "postID": "post75913766", "replies": []}, {"text": "I usually average about 3.5-4 hours SOT on every phone I own. So far over the last 3 days my Galaxy s9 hasn't been any different. I really don't understand how you people are getting between 5-6", "time": "16th March 2018, 09:14 PM", "postID": "post75913938", "replies": [{"text": "They probably have long screen timeout and just let it timeout... \n\nThough I got 5hrs yesterday watching a lot of video both on the SDcard and streamed over my WiFi", "time": "16th March 2018, 10:52 PM", "postID": "post75914701", "replies": []}, {"text": "The new system update seemed to have helped. Also I turned off location for a lot of apps that I won't use regularly since it might start using it in the background. Auto brightness is off and my brightness is always about half way or just under. Most other things are on like AOD. Not sure what else could have caused it. \n\r\nIt's always a good idea to check the battery graph page and see what apps are at the top of the list to figure out why your battery isn't doing well. Maybe it depends what you do on the phone too. For me it's mostly web browsing and watching videos.", "time": "17th March 2018, 12:22 AM", "postID": "post75915276", "replies": []}]}, {"text": "Full charge in about 1 hour 15 minutes,\r\nSOT averages on 4-5.5 hours\r\nStandby drain is about 1-2% per hour", "time": "17th March 2018, 01:14 AM", "postID": "post75915591", "replies": []}, {"text": "First few days I had about 2-3h SOT. \nNow, after a week I am finally seeing 4 hours. Not very impressed. Only thing I have turned off is AOD and auto brightness. How people get above 5h is beyond me.\n\nEDIT:\nWifi on all day, bad reception area and still 3h SOT with 50% battery left. Looks like the battery life is improving. Note that brightness was at about 20-30%", "time": "17th March 2018, 01:38 PM", "postID": "post75920360", "replies": []}, {"text": "", "time": "18th March 2018, 12:23 AM", "postID": "post75926251", "replies": []}, {"text": "Best I've gotten so far. Very impressed after a terrible start with the battery life.", "time": "18th March 2018, 12:48 AM", "postID": "post75926392", "replies": []}, {"text": "Hi guys, I have phone 7 days now and at the atart the battery was quite bad, but now it somehow improved.. I browse web a lot and watch youtube.. Mixed usage of WiFi and 4G. With those numbers I think I could get 7 hours SoT. I was thinking that I will switch the phone for plus version, because of thr battery, but I like the small factor of regular 9. So Im quite happy, that battery is improving after a week. Im on exynos version.", "time": "18th March 2018, 10:12 AM", "postID": "post75929493", "replies": []}, {"text": "This is what I'm getting on my S9 (SD 845). Picked it up on Friday so have had it for a little over 48 hrs. \n\nhttps://imgur.com/a/nfeCR\n\r\nHow are you guys getting over 5 hours of SOT and full day of use? \n\r\nMy phone drains 15-19% per hour with the screen on. At night while I'm sleeping the phone drains 1.5% per hour but during the day I'm seeing 4-6% battery drain with the screen off. \n\r\nI'm using AOD, no battery saving, auto brightness, Location/Scanning on, Bluetooth on, wifi on but only if screen is on or charging. \n\r\nComing from my Oneplus 5, I'm getting around maybe half to 1/3 of the battery life of my old phone.\n\r\nWill the phone get better battery life soon? Seems like everyone else is reporting terrible battery life the first few days.", "time": "19th March 2018, 12:40 AM", "postID": "post75937206", "replies": []}, {"text": "Should I just throw this garbage away?\r\nSick of this sh*t. AOD off, WQHD+ Medium Brightness Exynos.", "time": "19th March 2018, 07:34 AM", "postID": "post75939407", "replies": []}, {"text": "2nd day, and got 6hrs sot. that's with setting up the phone, taking a lot of photos at a friend's wedding and posting on Instagram, watching YouTube, trying out different themes, downloading and listening to songs on Spotify, having GPS with multiple Uber rides, AOD on, and group messaging throughout. not as good as my previous S8+, but about what I expected with the smaller battery. this is on Snapdragon, without battery saver, and always on entertainment mode.", "time": "19th March 2018, 04:26 PM", "postID": "post75944283", "replies": []}, {"text": "I've had it for about 5 days and so far haven't seen SOT of longer than 3 hours. Starting to regret selling my S8+ now. I was getting 4-6 hours with that, and 500mAh shouldn't be that different. I have AOD on, HD res (not QHD), and just WiFi enabled, all other connections (NFC etc) off.", "time": "19th March 2018, 08:55 PM", "postID": "post75947132", "replies": []}, {"text": "Been about 4 days on mine and have started to see 4 1/2 maybe 5 on sot.  Similar to my old s8+.\n\nWhat I did is fully charge and deplete battery to 0.  Charge again to 100 and did trick for me.", "time": "20th March 2018, 06:06 AM", "postID": "post75950727", "replies": []}, {"text": "My battery usage today\n\nBeen a busy day, and less time to use the phone, but overall great battery life for me", "time": "20th March 2018, 04:04 PM", "postID": "post75956032", "replies": []}, {"text": "Ok this phone is the most ****ed up battery.....First WEEK absolute crap battery life (2-3 hours max screen on time). Now, finally I'm getting over 5 hours. I do however have \"intelligent scan\" turned off and location off most of the time. Surely intelligent scan doesn't use that much battery? Like....WTF.", "time": "21st March 2018, 11:09 PM", "postID": "post75972123", "replies": []}, {"text": "day 4 - seems like it's settled, and got 7hrs sot (see attached). similar usage to my previous post.", "time": "22nd March 2018, 01:00 AM", "postID": "post75972832", "replies": []}, {"text": "I'd take a screenshot, but i'm attempting to fully deplete and recharge the battery because i'm gettig like 3 and  1/2 hours  screen on time.\r\nTo clarify i've set permissions for locations to be for only google maps, i've left it on for find my samsung predominantly. \n\r\nIs it because i have intelligent scan on?\n\r\nI have the exynos variant and have had it since the 13th.", "time": "22nd March 2018, 12:30 PM", "postID": "post75977101", "replies": []}, {"text": "Yo, the highest i can get is probably around 4 hours SOT and 24 hours on battery . I'am using apps like snapchat, instagram,facebook. Automatic brightness, AOD.  Location on battery saving. . Is snapchat the battery killer?  even tho it doesnt show that its draining much in Battery usage?\n\r\nCan any1 using snapchat,instagram, and facebook reply and tell ur SOT   / batterytime. cheers", "time": "22nd March 2018, 08:45 PM", "postID": "post75982098", "replies": [{"text": "FB. I uninstalled that garbage.  IF I have to use it, I'll log in through the website.", "time": "23rd March 2018, 03:49 AM", "postID": "post75985056", "replies": []}]}, {"text": "Here are my results.\n\r\nSimilar on the S8+.  So no complaints.", "time": "23rd March 2018, 01:45 AM", "postID": "post75984387", "replies": []}, {"text": "New personal best", "time": "23rd March 2018, 05:58 PM", "postID": "post75992261", "replies": [{"text": "That's the battery life for s9+ right? Not the s9..", "time": "24th March 2018, 08:07 AM", "postID": "post75998062", "replies": []}]}, {"text": "My personal best on my 8 day old Exynos is 4hrs 20 mins. #fail", "time": "23rd March 2018, 06:41 PM", "postID": "post75992708", "replies": []}, {"text": "-Get a dark theme\r\n-i left on location for find my samsung, if you are like me revoke location access to everything even google maps except Google play services. Google maps tracks your location in the background otherwise.  It'll just ask you for location access whenever you use it. Otherwise turn it off.\n\r\n-Enable power saving mode only for decreased brightness. Don't down clock CPU and anything else unless you wish. Somehow this manages to help a lot with predicted battery life.\n\r\n-Disable Facebook's ability to run in background.\n\r\nAt first battery life was terrible but even with a lot of gaming I'm getting  very good battery life.\n\r\nI  have exynos variant", "time": "24th March 2018, 05:58 AM", "postID": "post75997334", "replies": []}, {"text": "So I got this phone today and I'm on my first charge. Right now it has 50%  left and I got exactly 4h SOT. Exynos variant.\n\n\r\nEdit: I'm now at 25% charge and got exactly 6 hours SOT", "time": "4th April 2018, 09:11 PM", "postID": "post76125185", "replies": []}, {"text": "My latest battery usage on my s9 exynos", "time": "06 April 2018, 05:33 PM", "postID": "post76134392", "replies": [{"text": "I have difficulties to reach 3 SOT, with your same phone (s9 exynos), can you share your settings?\r\nI have all apps under control (except Telegram, Whatsapp and Fitbit), no Always on display but my battery drain more in stand by than using it... I don't know why", "time": "06 April 2018, 09:40 PM", "postID": "post76136786", "replies": [{"text": "Hmm.. my setting is\r\n- fhd+\r\n- developer options: mobile data turned off when on wifi\r\n- screen brightness about 35% with auto on\r\n- disabled facebook\r\n- no AOD (doesnt use it that much)\r\n- dark theme (but my wallpaper isn't though)\r\n- apps are sleeping always except line messenger, whatsapp, google play games, spotify\n\r\nOnly that I think..\r\nMy usage today was even better", "time": "07 April 2018, 12:29 PM", "postID": "post76142385", "replies": [{"text": "Today usage, I have your same settings (except  for developer one and auto brightness)", "time": "07 April 2018, 01:39 PM", "postID": "post76142951", "replies": []}]}]}]}]}, {"title": "Standby drain", "rating": 4.0, "links": ["https://forum.xda-developers.com/galaxy-s9/review/standby-drain-t3746283"], "threads": []}, {"title": "Heavy use endurance", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s9/review/heavy-endurance-t3746284"], "threads": []}, {"title": "Light use endurance", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s9/review/light-endurance-t3746285"], "threads": []}, {"title": "\"Look\" of the device (aesthetics)", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s9/review/look-device-aesthetics-t3746286"], "threads": []}, {"title": "Quality feel (use of materials)", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s9/review/quality-feel-materials-t3746287"], "threads": []}, {"title": "Ergonomics (in-hand feel)", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s9/review/ergonomics-hand-feel-t3746288"], "threads": [{"text": "Fits in my pocket nicely in my Tough Armor case. Can't even tell I have a phone.", "time": "17th March 2018, 11:42 PM", "postID": "post75925964", "replies": []}, {"text": "So far one handed use is very comfortable, coming from an S7.", "time": "19th March 2018, 10:25 PM", "postID": "post75947914", "replies": []}, {"text": "I hate the Bixby button location. Wouldn't be an issue if the power button was on the back, like my last few LGs.", "time": "21st March 2018, 02:11 PM", "postID": "post75966539", "replies": []}, {"text": "Much more comfortable than the +.  Coming from the S8+.", "time": "27th March 2018, 04:12 PM", "postID": "post76035723", "replies": []}]}, {"title": "OEM skin/software", "rating": 4.0, "links": ["https://forum.xda-developers.com/galaxy-s9/review/oem-skin-software-t3746289"], "threads": []}, {"title": "Outdoor visibility (max brightness)", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s9/review/outdoor-visibility-max-brightness-t3746290"], "threads": []}, {"title": "Contrast (true blacks)", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s9/review/contrast-true-blacks-t3746291"], "threads": []}, {"title": "Color saturation & accuracy", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s9/review/color-saturation-accuracy-t3746292"], "threads": []}, {"title": "Clarity/resolution", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s9/review/clarity-resolution-t3746293"], "threads": []}, {"title": "Minimum brightness", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s9/review/minimum-brightness-t3746294"], "threads": []}, {"title": "Call quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/galaxy-s9/review/call-quality-t3746295"], "threads": [{"text": "My calls stay connected by go silent after a short period. Sometimes it returns for a few seconds then goes quiet again\n\nOdd the one thing that I expect a phone todo is make phone calls\n\n\n\n---------- Post added at 07:20 AM ---------- Previous post was at 07:03 AM ----------\n\nConstantly drops calls", "time": "17th March 2018, 08:20 AM", "postID": "post75917708", "replies": [{"text": "I have the S9 dual SIM model and have exactly the same problem!", "time": "19th March 2018, 05:12 PM", "postID": "post75944818", "replies": [{"text": "I had the same problem with my new S9 in Australia. While I was talking on a call  minute or so it would go silent for the other party for about 6 seconds then come back. I had only had the phone for 5 days so took it back to Harvey Norman. After checking with their Samsung Franchisee, they exchanged the phone but only because it was less than 15 days from purchase. Still testing the replacement.", "time": "30th March 2018, 05:15 AM", "postID": "post76063673", "replies": []}]}, {"text": "My wife and I each bought a new Samsung S9 phone on March 16 at an Xfinity Mobile store near Boston. Both phones were activated with new SIM cards. Both phones experience random \"dead air\" lasting from three to 10 seconds during a call. This is very annoying. We have turned off VoLTE calling and Global Networks in settings. No difference.\n\r\nNow waiting for Samsung's firmware update and hoping this will fix the problem.", "time": "2nd April 2018, 03:14 PM", "postID": "post76098616", "replies": []}]}, {"text": "deactivate VoLTE and WLAN Call and try again", "time": "17th March 2018, 02:50 PM", "postID": "post75921091", "replies": [{"text": "Neither are active or even available as it's a sim free phone and those functions only work on a phone provided by the network", "time": "17th March 2018, 04:24 PM", "postID": "post75922018", "replies": []}]}]}, {"title": "WiFi strength, range, and throughput", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s9/review/wifi-strength-range-throughput-t3746296"], "threads": [{"text": "I have good experience with samsung mobiles and mostly i trust their products. I m waiting for Samsung galaxy s9 release date in India? Any guess?", "time": "9th February 2018, 10:23 AM", "postID": "post75500369", "replies": [{"text": "It's already pre-selling on ebay so you should be able to get it very soon. Much more expensive on Amazon. In", "time": "18th February 2018, 10:45 PM", "postID": "post75617209", "replies": []}]}, {"text": "Hhhh", "time": "11th February 2018, 08:58 PM", "postID": "post75531176", "replies": []}, {"text": "Samsung Galaxy S4 i545", "time": "16th February 2018, 06:09 PM", "postID": "post75592198", "replies": []}]}, {"title": "Cellular strength and throughput", "rating": 4.0, "links": ["https://forum.xda-developers.com/galaxy-s9/review/cellular-strength-throughput-t3746297"], "threads": [{"text": "Signal Strength:\n - full bars with S9 and Xperia Z2 Tablet\n - one less bar with Note 4\n\nSpeed:\n - 80Mbps with Xperia Z2 Tablet\n - 60Mbps with S9", "time": "13th March 2018, 12:53 PM", "postID": "post75873916", "replies": []}, {"text": "Better than my S7 so far; S9 actually gets reception in my bathroom at work but my S7 didn't. But worse than my Pixel 1; it could load videos in the bathroom and had 3G in an underground pub, yet my S9 respectively couldn't and didn't have any data connection.", "time": "15th March 2018, 04:34 AM", "postID": "post75893736", "replies": []}]}, {"title": "Speakerphone (loudness, clarity)", "rating": 4.0, "links": ["https://forum.xda-developers.com/galaxy-s9/review/speakerphone-loudness-clarity-t3746298"], "threads": [{"text": "Very interested to find out.", "time": "4th March 2018, 07:25 PM", "postID": "post75772509", "replies": []}]}]