[{"title": "Overall love", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-v10/review/overall-love-t3246699", "https://forum.xda-developers.com/lg-v10/review/overall-love-t3246699/page2", "https://forum.xda-developers.com/lg-v10/review/overall-love-t3246699/page3", "https://forum.xda-developers.com/lg-v10/review/overall-love-t3246699/page7"], "threads": [{"text": "Very happy with it so far and I've only had it for a couple days but am loving it so far.", "time": "11th November 2015, 10:14 PM", "postID": "post63778929", "replies": []}, {"text": "LG has stepped up to make a great looking, great feeling device. With the addition of the extra battery/200g micro SD AND the 100G for 2 years on Google Drive? Well done", "time": "12th November 2015, 01:40 AM", "postID": "post63781268", "replies": []}, {"text": "Unrooted AT&T version is surprisingly usable for someone who swore to never own an unrooted device.  \n\nI returned my stock Note 4 after a few days in favor of my rooted Note 2 with DN4 ROM.  I actually expected to return the V10 because I love my Note 2 so much.     My Note 2 went on craigslist the day after getting my V10.\n\nOutside influences prevent me from leaving AT&T for T-mobile, so the contract extension is irrelevant to me.  Still, I almost considered buying the T-Mobile phone outright to get the unlocked bootloader.  After a few days with the locked down AT&T version, I'm glad I saved the $350 difference.   I'll still root it the first chance I get, for the most part, I don't even realize the difference.", "time": "12th November 2015, 03:16 AM", "postID": "post63782121", "replies": [{"text": "Couldn't have said it better myself...", "time": "12th November 2015, 07:51 PM", "postID": "post63794141", "replies": []}]}, {"text": "Never been more satisfied with a phone in my life.  \n\nHave owned the \nOG galaxy\ngalaxy s3\ngalaxy s4\nHTC One m8 \nand now the LG V10\nOnly the M8 comes close to the level of satisfaction i feel now", "time": "13th November 2015, 05:10 AM", "postID": "post63800422", "replies": [{"text": "I agree. This is the happiest I've been with a phone since the m8, and I had a Sony z3 and galaxy s6 in between. Very impressed.", "time": "14th November 2015, 10:52 PM", "postID": "post63827561", "replies": []}]}, {"text": "Note. Knock on works well. G4 was iffy to annoying. I don't feel the heat in my pocket because of the screen turning on accidentally. On the G4 I Turned it off. On that note, screen touch response has been excellent none of the issues that haunted some G4.\n\nEDIT: Two weeks after: The more and more I keep using this phone, the more I use it, if that makes sense.  The love for actually making use of lots more started with my LG G4, but the V10 continues to do one up every time. I never really used my devices for listening to music, but now that the screen is just that much bigger, albeit 0.2\" as a whole I've enjoyed more youtube videos. That going in hand towards finding and listening to more music. I really do enjoy this phone, unlocked boot-loader, rooted, or not, does't make a difference to my enjoyment, even with it's quirks.. No regrets paying full price.", "time": "13th November 2015, 09:08 PM", "postID": "post63811989", "replies": []}, {"text": "I love the knock feature which allows you to turn screen on/off by double tapping. Next to the ESS DAC this is my favorite feature. Pretty great for an unrooted phone. Almost went with HTC M9 for it's ability to play hi-res music but so far am very happy I went with the V10. I just couldn't turn this one away with such amazing audio specs.", "time": "14th November 2015, 03:26 AM", "postID": "post63815434", "replies": []}, {"text": "Had this phone for 24 hours and just 💘 it! I've had a G2 and traded a G3 for this one on TMob. I wish they carried the white version like the international version on Amazon.", "time": "14th November 2015, 11:29 PM", "postID": "post63828009", "replies": []}, {"text": "I'm coming from Note 5, I own currently the following phones, Motorola XPE, Note Edge, S6 Edge (soon to be send it as a gift to my nephew), I'm waiting for the Nexus 6P to be delivered to me, but I really like this phone.  I'm using this as my daily phone and planning to keep it like that. Definitely in love with this phone.", "time": "16th November 2015, 02:28 PM", "postID": "post63854349", "replies": []}, {"text": "Had an LG G Pro 2 for over 18 months, which was my favourite phone ever.  Bought a Note 4 earlier this year (because I loved my old Note 2, way back when...) but it just wasn't as good as the G Pro 2, so I sold it on. \nBeen waiting for LG to bring out their next big thing - liked the G4 but wanted a bigger screen - so I was excited when rumours about the V10 started to appear, and even more excited when I saw they were keeping the SD card slot and removable battery!\nGot my imported V10 at the weekend and it's just perfect. Seriously. I can't think of anything I'd want to change (well, maybe a more reliable FPS...) \n\nNow, if we can get a simple root solution to install Viper4Android I can die happy. )", "time": "16th November 2015, 03:48 PM", "postID": "post63855787", "replies": [{"text": "Which version doo you have.h901 had root and we have v4a installed running great", "time": "17th November 2015, 02:39 PM", "postID": "post63872746", "replies": [{"text": "H961N - the dual sim version. \nNo root for me yet. (((", "time": "17th November 2015, 03:13 PM", "postID": "post63873265", "replies": []}]}]}, {"text": "I will tell you what I don't like. For a phone that boasts a high end headphone amp it can barely drive a pair of earbuds. Very lame.", "time": "16th November 2015, 11:23 PM", "postID": "post63862678", "replies": []}, {"text": "Yeah that's a Bummer 😢", "time": "17th November 2015, 03:25 PM", "postID": "post63873456", "replies": []}, {"text": "Other than issues with the Fingerprint sensor & cases (which should be resolved through an update that is/will be available soon), the LG V10 is virtually flawless. I find the second screen useful to quickly launch apps from any screen, call contacts, preview incoming messages, etc. The display is very bright, text is sharp and colors are realistic. Speed is excellent for web browsing, launching apps, screen scrolling, etc.. Capabilities- such as recording video, taking photos (front and back cameras), 32 bit Hi-Fi audio DAC playback, 64 GB of built in storage as well as removable storage/battery, build quality, call quality, advanced LTE data speeds, etc. are top notch. Aggressive promo packages and an excellent price on the T-Mobile network made/make the phone an unbeatable value. As with any well designed piece of electronics- the whole is greater than the sum of the parts- and the phone simply delivers where competitors have compromised.", "time": "20th November 2015, 03:17 PM", "postID": "post63923544", "replies": []}, {"text": "Just got my Verizon V10 Yesterday. Absolutely LOVE IT!", "time": "20th November 2015, 05:04 PM", "postID": "post63925211", "replies": []}, {"text": "I think this is very close to the perfect phone.. Only thing I am missing are the front facing dual speakers.. Other then that everything is too notch and it is easily the most feature packs smart phone this year.. Thanks so much lg for sticking with LCD display... I just hate smiled panels", "time": "21st November 2015, 05:31 AM", "postID": "post63933145", "replies": []}, {"text": "Came from the S3 to the note 2 to the G3 which is now my girlfriend's new phone lol i love my LG V10 nearly as much as i love her", "time": "21st November 2015, 06:27 AM", "postID": "post63933570", "replies": []}, {"text": "I'm coming from a Note 4 Developer Edition. Been a while since I have run a non modded device. Thought that would be a major hinderance... After running the thing through the debloater tool I really can't find a problem with it. Actually thinking about putting the DevEd on Swappa. The only time it has been powered on since getting the V10 is to take pix of the 10s IMEI for the promo.", "time": "21st November 2015, 04:25 PM", "postID": "post63939807", "replies": []}, {"text": "Love it!", "time": "23rd November 2015, 08:51 AM", "postID": "post63966663", "replies": []}, {"text": "Love the phone still waiting for my 200 gb card and removable battery but overall I love it just also giving it sometime before I root it atmos and viper and I'm good", "time": "23rd November 2015, 11:53 AM", "postID": "post63968412", "replies": []}, {"text": "how you guys finding the UI? I've never got on with lg ui always sluggish and very cartoonish worse then Samsung.", "time": "23rd November 2015, 04:33 PM", "postID": "post63972534", "replies": [{"text": "Samsung is actually harder to navigate,there's just so much useless crap Also found the Samsung touchwiz to feel unresponsive. I haven't gotten the v10 to do weird things.", "time": "23rd November 2015, 05:23 PM", "postID": "post63973346", "replies": []}]}, {"text": "Think il get me one o these 😋", "time": "23rd November 2015, 08:04 PM", "postID": "post63975727", "replies": []}, {"text": "The fact that LG released this very advanced device with almost NO accessory support pretty much doomed it to only those of us who care about specs over add-ons. It's ridiculous that the device has very few accessories. Where are the battery cases? Where are the extended batteries? Where are the cradles? Oh, and not include wireless charging is just silly. Seriously, LG, you give us the ability to charge wirelessly and THEN want to charge us almost $60 for the \"ability\" to do so? What a gyp. Actually make the device as good as it can be if you're going to release one with such great specs. Was the 200Gb card and extra battery a way to make up for bad product decisions?", "time": "27th November 2015, 02:39 AM", "postID": "post64027874", "replies": []}, {"text": "I had issues with my fingerprint scanner with my case and my solution to it was squeezing the end where the steel bars are and it worked with my case", "time": "3rd December 2015, 08:13 PM", "postID": "post64134324", "replies": []}, {"text": "The best phone I've ever had.", "time": "9th April 2016, 06:58 PM", "postID": "post66276639", "replies": []}, {"text": "So far I love it!  I was having a problem with the battery running down quickly, even when the phone was idle, right after the Marshmallow update, but I got that fixed. This is my first LG Android phone. I owned an LG years ago, but this was before Android! A co-worker of mine had a LG and I was impressed with the build quality. I like getting a new phone every two years, and when I upgrade, it has to be a real upgrade! I was coming from a HTC One Max, so the new phone had to have the following:\n\n1. Same sized screen, or very close. When you get a 50 inch TV, you do not want to go back to a 20!  \n2. The internal storage had to be more. I went from 32 to 64GB. \n3. My phones HAVE to have an SD card slot for storage expansion. I use Google Drive, but access to it is too slow, and it uses data transferring or adding files to it if I am off wifi.\n4. The V10 has a replaceable battery, which was the only thing I did not like about the One Max. I have never had a battery go bad in a phone, but do not want to have to swap out the entire device and be without a phone while it is being repaired or replaced. I can now also buy a high capacity battery if I want.\n5. Did not think it was possible, but the screen on the V10 is better than the Max.\n6. The processor is faster. This phone is smooth as butter!\n7. Looks mean something also, and I like the design of the LG.\n8. The V10 takes much better pictures than any phone I have ever had. I do not use it much, but so far I have been impressed!\n\n   So this will do me until 2018!", "time": "11th April 2016, 02:47 PM", "postID": "post66306120", "replies": []}]}, {"title": "Community development strength", "rating": 3.0, "links": ["https://forum.xda-developers.com/lg-v10/review/community-development-strength-t3246700", "https://forum.xda-developers.com/lg-v10/review/community-development-strength-t3246700/page2"], "threads": [{"text": "I think when (or if) the Verizon version gets root and an unlocked bootloader, I'm pretty confident development would pick up quickly.  But until then, I think it's sadly going to be a big ZZZZZ for us.", "time": "11th November 2015, 10:16 PM", "postID": "post63778970", "replies": [{"text": "Im afraid i will have to agree...im on vzw with a new V10. I havent activated yet because of no root...maybe i shouldnt hold my breath :P", "time": "18th November 2015, 12:22 AM", "postID": "post63881298", "replies": []}]}, {"text": "I have T Mobile and before this I had the G4, so root being accomplished so quickly on the V10 was a great thing and there is  TWRP so development is ready. I'm hoping there's are some motivated Devs ready to take this to the next level with the secondary screen applications are endless and the possibilities of clever and innovative ways to use it really excite me, I hope there are others as pumped as well. I really see a lot of potential in this device.", "time": "11th November 2015, 11:08 PM", "postID": "post63779618", "replies": [{"text": "im with you. im excited", "time": "17th November 2015, 05:23 AM", "postID": "post63866500", "replies": []}]}, {"text": "I think this remains to be seen. But given the way AT&T has blocked a lot of dev work (Came from a Note 3), I can only pray there is less of a roadblock on this handset", "time": "12th November 2015, 01:43 AM", "postID": "post63781293", "replies": []}, {"text": "For the T-mobile it seems like Development is picking up (read the CM12.1 thread! Exciting!)", "time": "12th November 2015, 03:25 AM", "postID": "post63782207", "replies": [{"text": "Link to this thread you speak of please", "time": "17th November 2015, 05:28 PM", "postID": "post63875500", "replies": []}]}, {"text": "I know it has been more than a week since the phone is out and i already see bootloader unlocked with root capability for t-mobile variants(which is what i have) so i foresee a lot of possibility out there for other developers to jump in. Hopefully we will get to choose between other ROMs as we currently have blackhole ROM only being actively worked on.", "time": "12th November 2015, 04:46 PM", "postID": "post63791186", "replies": []}, {"text": "Is there a video that shows how to root the T-Mobile version", "time": "22nd November 2015, 12:59 AM", "postID": "post63946068", "replies": []}, {"text": "LG usually has pretty bad development support compared to say Samsung, htc. It's one of the reasons why i haven't bought it yet.\r\nI absolutely hate lg ui far too cartoonish and sluggish but if it had cm12.1 or stock android it would be one of my favourite for sure.", "time": "23rd November 2015, 04:23 PM", "postID": "post63972343", "replies": []}, {"text": "IMHO YMMV LG hardly needs development. Most people that I know with LG devices really enjoy rooted debloated stock. Its not like other devices Ive had that you just need something baked into the rom. At most I notice customising via xposed. And even those with locked bootloaders and no root find a way to debloat and customise their phones. Gone really are the days of needing to wait for a dev to cook or bake in something and end user cant just do themselves. At least for me its been my experience with the latest Tmobile LG devices. As long as the os and ui are snappy..", "time": "24th November 2015, 09:25 PM", "postID": "post63993358", "replies": []}, {"text": "I personally can't wait till we get cm12 or 13 it will make this phone fly... I mean a guy made cm 12.1 happen on my gear s so I don't see why it would not happen on v10\n\nBeameD From My LG V10... The one with the ALWAYS ON SCREEN... Watching me.. 😱", "time": "29th November 2015, 06:43 PM", "postID": "post64067116", "replies": []}, {"text": "So  there is no bootloader Unlock for the normal International Version of the LG v10?", "time": "9th December 2015, 03:22 AM", "postID": "post64218520", "replies": []}, {"text": "A little weak at the time ... \r\nI blame LG for letting Verizon lock up the bootloader like Fort Knox ... didn't anyone with marketing knowledge realize that it's the Hackers happiness with a phone that helps promote how friendly it is, promotes Apps for the phone and ends up selling more base phones that never get modded or rooted.  \r\nI hope this all changes soon - as much as I like this phone, it can only get better with more attention by those who can tweak, mod and root them.", "time": "22nd December 2015, 10:28 PM", "postID": "post64443302", "replies": []}, {"text": "Development is weak for this device. We need more support. I think the 808 shouldn't be too hard to develop for, but I'm not a Chef", "time": "25th December 2015, 02:21 AM", "postID": "post64478353", "replies": []}, {"text": "Worst Development ever !!", "time": "13th February 2016, 01:51 PM", "postID": "post65304431", "replies": []}, {"text": "Definitely lacking. But the experience of the phone is solid so it lessens the need. However the marshmallow wait is too long (not devs fault of course). that coupled with the unparalleled dev on Nexus's has me contemplating a 6p ..", "time": "10th March 2016, 05:15 PM", "postID": "post65761814", "replies": []}]}, {"title": "Overall speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-v10/review/overall-speed-t3246701", "https://forum.xda-developers.com/lg-v10/review/overall-speed-t3246701/page2", "https://forum.xda-developers.com/lg-v10/review/overall-speed-t3246701/page3"], "threads": [{"text": "The ONLY lag I've seen up to this point is when I first set up the device and was restoring 130 apps, and tried to do something else too", "time": "12th November 2015, 01:41 AM", "postID": "post63781276", "replies": []}, {"text": "I got the Moto X Pure edition on the release date.  I had more lag on that phone than the V10.   I haven't experience any lag. The V10 has been flawless for me so far.", "time": "12th November 2015, 01:45 AM", "postID": "post63781316", "replies": [{"text": "No lag with my MXPE and I am a picky SOB   No reviews call out lag that I recall, nor most users.  You must have gotten a bad device", "time": "16th November 2015, 05:28 PM", "postID": "post63857496", "replies": []}]}, {"text": "Pretty much on par with the LG G4. Smooth no unexpected lag. \n\r\nI too experienced a slight studder at first boot while it was downloading, installing and restoring apps, syncing data while I tried to go into other settings at the same time. But it's expected and not at all an issue once first boot has settles.", "time": "12th November 2015, 07:13 PM", "postID": "post63793532", "replies": []}, {"text": "Good, fast (enough for me), no glitches whether on WiFi or Cellular.", "time": "22nd December 2015, 10:30 PM", "postID": "post64443324", "replies": []}, {"text": "So lg v10 fast and smooth like note 5 or not???\nWanna trade my note 5 with it", "time": "30th December 2015, 07:28 PM", "postID": "post64566187", "replies": []}, {"text": "Actually I experience very severe lag on V10.   twice withing 2 months of ownership of this device.   the V10 does not response at all. even I try to long press the power button (trying to reboot it).  after a minute or so, it become responsive.  \nI believe the reason for the lags partially because I enabled the full disk encryption on this device.\n\nI still love this phone and thinking whenever I have chance.  a factory reset might help to clean some stock bloatware and make if faster.", "time": "31st December 2015, 09:39 PM", "postID": "post64583257", "replies": []}, {"text": "Good enough..", "time": "13th February 2016, 01:51 PM", "postID": "post65304438", "replies": []}, {"text": "I experience lag with Youtube videos (it just completely stops playback for no reason at all), and while using Spotify. Benchmark results are terrible for a device that has high end specs. Obviously software-related issues which will never get fixed.", "time": "25th February 2016, 05:54 PM", "postID": "post65518488", "replies": []}, {"text": "So I can't seem to find what kind of storage the V10 uses. I heard the Iphone 6s used a nvme based rom which apparently made the device a lot snappier. \nI'm curious what type of rom the V10 uses, as it has so many innovative features, it would be strange if LG skipped over the rom.", "time": "19th March 2016, 11:32 AM", "postID": "post65924837", "replies": []}, {"text": "I have the phone for several days now and i am yet to find something that it cannot handle. I tested 4K video playback from youtube using mozilla firefox (not the youtube app which is lighter) and it worked flawlessly. I even tried 15Mbps HD Stream over VPN connection which was also handled without any issue. The only thing that may be a problem is a very heavy game but i am not a gamer so i have not tested deeply with games. For me this is the best phone that i had for all these years.", "time": "27th March 2016, 05:35 AM", "postID": "post66056911", "replies": [{"text": "I agree, the V10 is my first LG phone. I had HTCs, Samsungs and Apple phones before. The V10 is the best of them.", "time": "27th March 2016, 07:37 AM", "postID": "post66057866", "replies": []}, {"text": "I am also very impressed with the phone. MIne is a company phone so have to keep it stock for the best part apart from disabling individual apps etc but I am a constant heavy user over approximately 10hrs each day and so far (had it a month) it hasn't missed a beat and battery life is very good compared to the S4 I was previously using.", "time": "7th April 2016, 09:53 AM", "postID": "post66236061", "replies": []}]}, {"text": "The fastest phone after Nexus devices", "time": "9th April 2016, 07:00 PM", "postID": "post66276670", "replies": []}, {"text": "Fast and smooth \r\nBur my mate 8 is faster and smoothe with kirin 950 beast", "time": "13th April 2016, 04:31 PM", "postID": "post66343077", "replies": []}, {"text": "Did a side by side comparison of a friend's HTC 10 and the V10. Launch speed of all apps tested were very similar. I tested FB, camera, phone app, chrome, play store, settings, reboot, maps, but no games.\nThe SD808 is keeping up pretty well, even though it only gets half of the antutu score compared to the SD820. In everyday use, you don't really feel any difference. I think only gaming will be affected.", "time": "5th May 2016, 03:07 PM", "postID": "post66708249", "replies": []}, {"text": "My v10 is fast and i can have the brightness up to max and charge this phone via usb on my laptops 3.0 port.  My g4 keeps sucking battery down when on usb power", "time": "6th May 2016, 02:14 AM", "postID": "post66716803", "replies": []}, {"text": "https://www.youtube.com/watch?v=BUt53WC6-xs\n\r\nReally no need to upgrade if you're not a gamer  and even if you are", "time": "2nd September 2016, 02:24 PM", "postID": "post68493456", "replies": []}, {"text": "Don't know if I should call it lag or what. But the knock thing is pretty frustrating. I don't know if the device misses my knocks or I don't knock properly. \r\nAnd it takes some time when I try to wake it up at lock screen using knocks.\nApart from that. It is truly amazing Android phone. Its my first time using a fast Android phone. Just moved from iOS. Last Android phone that I used was Galaxy S2.\r\nIn love with speed of LG V10. Never thought android could be this fast.", "time": "2nd September 2016, 04:27 PM", "postID": "post68495477", "replies": []}, {"text": "My v10 lags most of the time, when ever im opening an app it always takes 1-3 seconds to open, whenever i scroll down a page or on any screen , i can feel the lag happening.", "time": "2nd March 2017, 12:57 PM", "postID": "post71252777", "replies": []}]}, {"title": "App launch speed", "rating": 4.0, "links": ["https://forum.xda-developers.com/lg-v10/review/app-launch-speed-t3246702"], "threads": [{"text": "Quite good.  \r\nNever any delays or glitches.", "time": "22nd December 2015, 10:32 PM", "postID": "post64443349", "replies": []}, {"text": "By far the best phone I've owned. Simply amazing!", "time": "8th February 2016, 03:15 AM", "postID": "post65207836", "replies": []}]}, {"title": "Multitasking/RAM", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-v10/review/multitasking-ram-t3246703"], "threads": [{"text": "Very good.  \r\nWhether I'm doing a split screen or I have a multitude of apps open, the phone delivers the next app to use with no delay.", "time": "22nd December 2015, 10:34 PM", "postID": "post64443374", "replies": []}, {"text": "Perfect", "time": "13th February 2016, 01:51 PM", "postID": "post65304443", "replies": []}, {"text": "It's good! I can run a few apps and the phone still functions normally~", "time": "14th February 2016, 02:44 AM", "postID": "post65314157", "replies": []}]}, {"title": "Scrolling smoothness", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-v10/review/scrolling-smoothness-t3246704"], "threads": [{"text": "i feel this phone is very snappy and fast.. doesn't feel lag at all", "time": "1st December 2015, 05:29 PM", "postID": "post64098528", "replies": []}, {"text": "This is one of the few times I'm giving a full 5 Stars ... because this is one area where I can't imagine it getting any faster.  \r\nWhether swiping from side to side for Apps and Widgets, or surfing up and down through pages and pages of Instagram or Internet pages, it's as buttery smooth as I could ever ask for.", "time": "22nd December 2015, 10:38 PM", "postID": "post64443421", "replies": []}, {"text": "Worst UI performance I've ever come across on Android.  Choppy scrolling most of the time everywhere even the settings app wtf.", "time": "2nd April 2017, 01:39 PM", "postID": "post71692971", "replies": []}, {"text": "True. Worse in nougat", "time": "9th August 2017, 11:20 PM", "postID": "post73345959", "replies": []}]}, {"title": "Heat", "rating": 4.0, "links": ["https://forum.xda-developers.com/lg-v10/review/heat-t3246705"], "threads": [{"text": "I feel the heat coming out around the area where the camera is and it radiates downward from there. While i dont mind this during cold weather right now but i am worried how annoying this will be in the summer. I personally dont see a big problem with a moderate heat as my hand rarely touch the back where the heat is due to how you grab this phone in an elipse shape instead of grabbing flat which is a great design for the heat dissipation.", "time": "12th November 2015, 05:08 PM", "postID": "post63791540", "replies": []}, {"text": "Much cooler than my LG G4 h811.  Most of the warmth is in the power button area.\n\r\nThe LG G4 would get really warm. Especially the battery area. After some slight use I'd put it in my pocket and could really feel the heat on my leg. I do not feel it in the v10\n\r\nI'm posting this observation on a rather heavy use day too.", "time": "13th November 2015, 08:30 PM", "postID": "post63811492", "replies": []}, {"text": "a friend of mine have this device, and its much cooler than my A9... we both use for play games in 3d...", "time": "9th December 2015, 11:44 PM", "postID": "post64234953", "replies": []}, {"text": "I have no heat issues.  \r\nThe one time I ran Waze, occasional Texts, GPS, WiFi and E-Mail all at the same time while the phone was plugged into a high output cigarette charger ... it got warm.  Not burning-hot like the Sammy Note Edge would under identical conditions ... just warm.", "time": "22nd December 2015, 10:41 PM", "postID": "post64443465", "replies": []}, {"text": "Its not hot... It works so good", "time": "12th January 2016, 08:25 AM", "postID": "post64765651", "replies": []}, {"text": "Best I ever had!!", "time": "13th February 2016, 01:52 PM", "postID": "post65304454", "replies": []}, {"text": "Never gets hot. At most, a little bit warm. I'm impressed!", "time": "17th March 2016, 02:45 AM", "postID": "post65882933", "replies": []}]}, {"title": "Low light", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-v10/review/low-light-t3246706"], "threads": [{"text": "I liked most of his tests, just passing it along..", "time": "15th November 2015, 05:44 PM", "postID": "post63840094", "replies": []}, {"text": "It's fairly good.", "time": "12th January 2016, 09:52 PM", "postID": "post64777000", "replies": []}, {"text": "not as expected", "time": "13th February 2016, 01:52 PM", "postID": "post65304459", "replies": []}, {"text": "I expected a little better pictures of artificial light", "time": "9th April 2016, 07:05 PM", "postID": "post66276742", "replies": []}, {"text": "Not great like I expected", "time": "10th April 2016, 07:11 AM", "postID": "post66283884", "replies": [{"text": "same here, I was holding s7 edge today. I was expecting a little difference but there is a huge one...I'm not trusting online reviewers anymore.", "time": "12th March 2017, 10:42 PM", "postID": "post71401545", "replies": []}]}, {"text": "Unless you have a tripod at the club, and people are not moving, it is pretty bad. Pictures are noisy and dark, and the biggest issue: Auto mode is really bad. All the reviews say that LG V10 has super night vision, but they don't take into consideration actual life situations.\n\r\nAnd when are we getting the Nougat update?", "time": "29th May 2017, 07:58 AM", "postID": "post72469967", "replies": []}]}, {"title": "Photo quality", "rating": 5.0, "links": ["https://forum.xda-developers.com/lg-v10/review/photo-quality-t3246707", "https://forum.xda-developers.com/lg-v10/review/photo-quality-t3246707/page2", "https://forum.xda-developers.com/lg-v10/review/photo-quality-t3246707/page3"], "threads": [{"text": "all pictures from front camera are fuzzy looking and facebook picture posts or videos are blurry and very poor quality. I come from Note 4 and I never saw this", "time": "1st December 2015, 09:51 PM", "postID": "post64102369", "replies": [{"text": "I'm having this exact issue. My photos across all three cameras are blurry and full of noise. I have a G4 as well, and my photos come out perfect. Software glitch maybe?", "time": "3rd December 2015, 07:23 PM", "postID": "post64133616", "replies": []}]}, {"text": "Saw some shrooms...", "time": "3rd December 2015, 05:04 PM", "postID": "post64131620", "replies": [{"text": "awesome, thanks for sharing.", "time": "9th December 2015, 04:58 AM", "postID": "post64219502", "replies": []}]}, {"text": "...all of the cameras have lenses which are flush to the exterior\n\nTry cleaning the lens' areas and make sure there are no protective films on them.\n\n..just a thought", "time": "7th December 2015, 07:03 AM", "postID": "post64184222", "replies": []}, {"text": "Excellent picture quality and camera software.", "time": "6th January 2016, 09:30 PM", "postID": "post64679011", "replies": []}, {"text": "Very good for a Cell Phone.", "time": "12th January 2016, 09:53 PM", "postID": "post64777011", "replies": []}, {"text": "Always love LG's camera.", "time": "14th January 2016, 10:28 PM", "postID": "post64810395", "replies": []}, {"text": "Nothing to complain", "time": "16th January 2016, 09:42 AM", "postID": "post64831304", "replies": []}, {"text": "The camera is about the only think i'm liking on this phone right now....", "time": "19th January 2016, 03:13 AM", "postID": "post64874852", "replies": []}, {"text": "perfect", "time": "13th February 2016, 01:52 PM", "postID": "post65304463", "replies": []}, {"text": "Hey guys!\n\r\nI want to buy V10 this week \n\r\nI would like to know\n\r\n1.Is V10 in white color going to be dirty?\n\r\n2.Will LG release stock roms?\n\r\n3.Which one is better in auto mode?G4 or V10?\n\r\n4.Is it worthy to buy V10 instead of G4?\n\r\nWhat do u think should I buy G4?\n\r\nsorry for grammatical problems\n\r\nThanks", "time": "13th February 2016, 06:23 PM", "postID": "post65308700", "replies": [{"text": "Why dont you answer?", "time": "14th February 2016, 11:35 AM", "postID": "post65318790", "replies": []}]}, {"text": "I cant stand the front facing camera's. Terrible quality. So grainy. The rear camera is much better.", "time": "16th February 2016, 07:36 PM", "postID": "post65359749", "replies": [{"text": "The front cameras are ok. The rear camera is awesome. I never seen such good camera on a phone. Comparable with a DSLR camera.\nI have V10 H961N (rooted) and G4 H815(rooted) too. Exactly the same camera on both. The same quality. The software on V10 has more option than on G4 (almost on video)", "time": "25th February 2016, 10:00 AM", "postID": "post65511289", "replies": []}]}, {"text": "The camera is not the worst I've seen but compared to Nexus 6p it's quite bad. Even G4 has better quality pictures, which is indeed strange. Most of the photos I take are blurry, or have weird edges around them. Even when it's a sunny day. I did expect a lot more, but I won't say the camera is complete sh*t.", "time": "25th February 2016, 05:48 PM", "postID": "post65518383", "replies": [{"text": "It could be scratched too. I picked up a used V10 and had the same problem. The scratches weren't easily noticeable but when you looked in the right light you could see them. I ended up ordering a new lens and it works awesome again. I have  new G4 I compared the pics with and they are pretty much identical. As for the 6P taking better photos it's close but no way. I had a 6P and the V10 takes much more realistic photos with less blur. There is no manual mode or OIS so good luck with the motion and night shots. After owning many phones this is the best camera hands down, second is the Note 5. I tried the S6, Note 4 and 5, Turbo and Turbo 2, MotoX Pure, 6P, G4 and the V10 within the last month or so along with a couple not worth mentioning.", "time": "26th February 2016, 09:45 PM", "postID": "post65539437", "replies": []}]}, {"text": "Sounds like your lens is dirty.", "time": "26th February 2016, 08:43 PM", "postID": "post65538632", "replies": []}, {"text": "\" title=\"The beetle never looked better \" />", "time": "15th March 2016, 10:50 AM", "postID": "post65848964", "replies": []}]}, {"title": "Video quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-v10/review/video-quality-t3246708"], "threads": [{"text": "Nice Video Camera test.", "time": "15th November 2015, 05:45 PM", "postID": "post63840117", "replies": []}, {"text": "Made some daytime videos (T-Mobile ver.)\n\r\nHere is the auto mode  https://youtu.be/t5J4_0Bdps8 , https://youtu.be/vYoLp__C4t4 , https://youtu.be/B4t2B--90pE .\r\nThis is HD manual  https://youtu.be/2HQA3DSL5Rk , https://youtu.be/5GiwX9qkSSI .\n\r\nNightime video is much worse.\n\r\nTotally disappointed. Frequent focusing in both modes - better than it was on my LG G2. But still shaky", "time": "16th December 2015, 11:20 PM", "postID": "post64350677", "replies": []}, {"text": "The low light video capture quality is really bad in comparsition with my old S6 Edge. There is so much noise? I think it's a software based issue. Hope that LG or our developers will solve this problem. I like my device (H960) but the quality should much better", "time": "3rd January 2016, 11:46 AM", "postID": "post64618702", "replies": []}, {"text": "I really like this aspect of the phone.   Lots of options and the ability to take a still while shooting video is a wonderful thing!  Good job LG.", "time": "12th January 2016, 09:55 PM", "postID": "post64777036", "replies": []}, {"text": "I'm going to a festival, what would be recommended to do to get the best video recording?", "time": "7th April 2016, 11:04 PM", "postID": "post66247109", "replies": []}]}, {"title": "Selfie quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-v10/review/selfie-quality-t3246709"], "threads": [{"text": "I come from the note 3 and barely took selfie because of the low quality in the low light and it's narrow angle. However, i am taking selfie with LG V10 while i am in vacation now and have convinced my parents that selfie sticks are not needed due to exception camera quality, so i am happy with the possibility it provides. Also, it clears my skin pretty good automatically", "time": "12th November 2015, 03:34 PM", "postID": "post63790039", "replies": []}, {"text": "Processing is terrible for front facing camera. I'm sure the hardware can perform well, but all shots look extremely artificial. Even with beauty mode off.", "time": "21st November 2015, 05:46 PM", "postID": "post63940967", "replies": [{"text": "I totally agree with the beauty mode it's a little too much even turn off like you said. I'm not a front-facing picture kind of guy these are just my 2 cents, simple software update should take care of this, other than that best phone I ever owned.", "time": "27th November 2015, 08:32 PM", "postID": "post64038949", "replies": []}]}, {"text": "IMHO if you're ugly no amount of camera hardware or software can make you look good, even at a beauty setting of 11...\n\nOn that note, I think my selfies looks decent enough. Where are you posting them anyways, doesn't each site downgrade the pictures' quaility anyways?", "time": "22nd November 2015, 09:16 PM", "postID": "post63959996", "replies": []}, {"text": "I agree with PsychDrummer. Plus coming from the S6, the S6 was more vibrant and crisp.", "time": "23rd November 2015, 06:53 AM", "postID": "post63965613", "replies": []}, {"text": "Compared to the G4, the front facing camera(s) are sort of lack-luster. Is there anything that can be done to improve quality?", "time": "27th November 2015, 04:33 AM", "postID": "post64028750", "replies": []}, {"text": "The selfie camera really sucks. Even with the smoothing turned all the way down.", "time": "9th December 2015, 10:31 PM", "postID": "post64233984", "replies": []}, {"text": "I like it .... and I like the option to choose two different lenses when shooting.  \r\nHaving the Glamour Feature is a win-win too.", "time": "12th January 2016, 09:57 PM", "postID": "post64777058", "replies": []}]}, {"title": "Time to take picture (camera launch speed)", "rating": 4.0, "links": ["https://forum.xda-developers.com/lg-v10/review/time-to-picture-camera-launch-speed-t3246710"], "threads": [{"text": "I have been using double tap of volume down button to launch camera app and so far it hasnt failed me to launch within one second. One thing i love this camera other than the quality of the photo is the OIS.", "time": "12th November 2015, 04:40 PM", "postID": "post63791087", "replies": []}, {"text": "Good as any other ... but there are ways to get it open faster than going through home screen.   That's a nice touch.", "time": "12th January 2016, 09:58 PM", "postID": "post64777075", "replies": []}, {"text": "double tap volume down does it too , its the superfastest way", "time": "15th January 2016, 01:46 PM", "postID": "post64818930", "replies": []}]}, {"title": "Software (ease of use, features, etc)", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-v10/review/software-ease-features-t3246711"], "threads": [{"text": "Better then TW but still need some improvements.. some of the setting seems hard to find.", "time": "1st December 2015, 05:26 PM", "postID": "post64098481", "replies": []}, {"text": "The standard stuff is easy to figure out and use ... the more involved stuff is laid out quite well.", "time": "12th January 2016, 09:59 PM", "postID": "post64777086", "replies": []}, {"text": "They say that LG has terrible UI, but coming from CM, I don't dislike it at all.", "time": "21st January 2016, 10:41 PM", "postID": "post64920990", "replies": [{"text": "so, its terrible, but you don't dislike it? Very meaningful, thanks for sharing!", "time": "10th February 2016, 12:09 AM", "postID": "post65242011", "replies": [{"text": "Rather, people say it's terrible, but I think it's pretty nice.", "time": "15th February 2016, 01:07 AM", "postID": "post65329075", "replies": []}]}]}, {"text": "Lack of customization especially for the lock screen. A shame really.", "time": "28th January 2016, 09:04 AM", "postID": "post65021412", "replies": []}]}, {"title": "Charging speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-v10/review/charging-speed-t3246712"], "threads": [{"text": "Anyone have a good app to read charging amps reliably?", "time": "11th November 2015, 09:49 PM", "postID": "post63778614", "replies": [{"text": "fast but not impressive since my G2 used to charge at 1600-1800 mah and only need ~ 1 - 1.5h to charge and the V10 with fast charge technology takes the same ~1.5h\n\n---------- Post added at 12:11 AM ---------- Previous post was at 12:09 AM ----------\n\n\n\r\nsearch for battery monitoring on or ampere", "time": "20th April 2016, 12:11 AM", "postID": "post66451563", "replies": []}]}, {"text": "Just took it out of the box, had 40%. Plugged it into my motorola turbo charger, with long flat braided cloth cable, it was charging at 5v.. I switched out the cable and used the 24awg cable from ZeroLemon's charger and it went to 9v. 40-80% in 30mins~ Main screen off (using OLED USB Doctor sleeve)\n\nI use the Ampere app, it's good for getting an idea, it's not exact.", "time": "12th November 2015, 01:02 AM", "postID": "post63780899", "replies": []}, {"text": "Very fast", "time": "1st December 2015, 05:26 PM", "postID": "post64098470", "replies": []}, {"text": "My first phone with fast charging ... and I love it!", "time": "22nd December 2015, 10:43 PM", "postID": "post64443484", "replies": []}, {"text": "love the fast charge seems to charge faster than my fast charge nexus 6", "time": "24th December 2015, 04:39 AM", "postID": "post64464049", "replies": [{"text": "I thought my Nexus charged a little faster. Not sure what it is..", "time": "10th April 2016, 08:08 PM", "postID": "post66294111", "replies": []}]}, {"text": "Better than G3", "time": "9th April 2016, 07:06 PM", "postID": "post66276756", "replies": []}, {"text": "Fast to charge\nFast to lose charge", "time": "10th April 2016, 07:10 AM", "postID": "post66283879", "replies": []}]}, {"title": "Screen on time", "rating": 4.0, "links": ["https://forum.xda-developers.com/lg-v10/review/screen-time-t3246713", "https://forum.xda-developers.com/lg-v10/review/screen-time-t3246713/page2", "https://forum.xda-developers.com/lg-v10/review/screen-time-t3246713/page3", "https://forum.xda-developers.com/lg-v10/review/screen-time-t3246713/page6"], "threads": [{"text": "I'll leave this here..\n\nEdit. Auto brightness under Florida Sun. Facebook, ebay and reading posting on xda. \n\nDetails: Not rooted, bootloader locked, wifi off, sync auto on, 2nd screen stock, location on, LTE on T-mobile, vibration strength stick, vibration with sound, vibration type rapid, vibrate on tap, sound effects dialpad sounds rest off, wifi calling on", "time": "13th November 2015, 08:39 PM", "postID": "post63811613", "replies": []}, {"text": "Brightness set at 20%, no Auto brightness, 2nd screen on the whole time, Verizon 4G LTE the entire time (no wifi)", "time": "14th November 2015, 01:08 AM", "postID": "post63814337", "replies": []}, {"text": "Screen on time is a failed meter for battery life.. I can run navigation on all day and have the screen off. I will show less screen time no matter what.. Same goes if you're listening to music while the screen sleeps.. Anyway the avg Lg phone with this battery gets you about 2.5-4.5 hrs of screen time depending on your usage. Same as G3 and 4.. Lg has excellent standby time, but horrible screen time. If you actually use your phone, these will be your results.. I go into different lighting every few minutes so I have to adjust my brightness.  No way you can keep it on one setting all day unless you're not going anywhere..ever..", "time": "15th November 2015, 06:44 AM", "postID": "post63832044", "replies": [{"text": "thats my analysis. I thought going from the g3 to LG v10 would give that galaxy note 5 or s6 edge life...nope. still averaging about 2.5 to 3.5 total use is around 7-9.\n\n---------- Post added at 12:20 AM ---------- Previous post was at 12:18 AM ----------\n\n\n\r\ni saw that vid and most review sites state the same", "time": "17th November 2015, 05:20 AM", "postID": "post63866463", "replies": []}]}, {"text": "Comparison video Note 5 vs LG V10 vs. Nexus 6P SOT Battery Test!", "time": "15th November 2015, 05:35 PM", "postID": "post63839949", "replies": []}, {"text": "Stock no root\n\nBeameD From My LG V10... The one with the ALWAYS ON SCREEN... Watching me.. 😱", "time": "19th November 2015, 12:45 AM", "postID": "post63898712", "replies": []}, {"text": "I am getting around 5 hours of sot time.", "time": "19th November 2015, 10:55 AM", "postID": "post63904318", "replies": []}, {"text": "5h 48min sot with 15h30 overall on the battery...beast!!!!", "time": "19th November 2015, 11:00 PM", "postID": "post63914129", "replies": []}, {"text": "do you have GPS, Auto-Sync, Location on or off, and the second screen. That would help us determine what's best\n\n---------- Post added at 07:35 PM ---------- Previous post was at 07:33 PM ----------\n\nI'm getting 3.25 to 4.0 SOT with about 10-11hrs battery usage. GPS off, Screen on auto, location off, sync off and I turn sync on once a hour. I'm rooted", "time": "20th November 2015, 12:35 AM", "postID": "post63914984", "replies": []}, {"text": "", "time": "20th November 2015, 03:43 AM", "postID": "post63916607", "replies": []}, {"text": "I forgot to screenshot it but I got 20hrs +3hrs SOT bluetooth,location,sync and autobrightness on yesterday. VERY impressed coming from the Note 4, was rooted and bloat free.", "time": "20th November 2015, 05:39 AM", "postID": "post63917469", "replies": []}, {"text": "Stock barely 3 days old", "time": "24th November 2015, 02:08 AM", "postID": "post63979651", "replies": []}, {"text": "Results seem good, at least matching the Note 5's. But honestly the G2 still smokes all of these results. I got 19h of use with 1h45m of SOT yesterday... and 74% remaining. Not even kidding. And not even rooted, 5.0.2 stock.", "time": "28th November 2015, 11:31 AM", "postID": "post64046737", "replies": []}, {"text": "I have BT on, wifi on, location on and auto brightness on. Volte is off. I have 2 sim cards installed. My phone is not rooted.\r\nI will get about 3 hours SOT and about 15 hours battery life per day.\r\nI needed to install Greenify to get these results. Before Greenify I was barely getting 8 hours, which was a little depressing. \r\nI do carry a spare battery though, but I would expect a little more than 8 hours from a 3000mah battery.  \r\nRight now battery life is mostly on par with my previous Note4.  I didn't use need to use Greenify on the Note4 though.  I had the same features turned on with the N4 as I have with the V10.  \r\nI feel that the N4 had better standby time. Perhaps the 2nd screen on the LG is drawing extra power, but I actually find it useful so am happy to keep this on. \n\r\nThis current setup is working ok for me. I'm not frugal with the use of the phone. Firstly because I really enjoy using this phone and secondly, having a removable battery is the lightest and easiest solution for not worrying too much about running out of power. Tethering to an external power brick is most annoying. \n\r\nHaving said that, it's still an interesting challenge to eke the best out a smartphone battery. \r\nI can see others here are getting 5 hours SOT out of their phones. \r\nI suspect a lot of the features I have turned on have reduced my SOT, but if some of you have a similar setup to mine and have better SOT I would love to know of other useful tweaks that I could try.", "time": "30th November 2015, 03:48 PM", "postID": "post64081000", "replies": []}, {"text": "5-6 hours, depending on what I'm doing. Unfortunately I treat it like it has a big battery, and usually by the end of the day I'm getting pretty low.\n\nI'm glad that it comes with such a fast charger, and I'm looking forward to getting my spare battery.", "time": "30th November 2015, 04:44 PM", "postID": "post64081899", "replies": []}, {"text": "I'm lucky to get 3 hours off a full charge.", "time": "30th November 2015, 11:16 PM", "postID": "post64087179", "replies": []}, {"text": "More than 5 hours all day everyday", "time": "30th November 2015, 11:48 PM", "postID": "post64087505", "replies": [{"text": "Show us your average. Also what apps are running.  You can stare at a single page or photo all day and get 5hrs SOT everyday anyday", "time": "7th December 2015, 09:07 AM", "postID": "post64185399", "replies": [{"text": "On the T-Mo version I get 8+ hours SOT if all I am doing is web browsing/reading. Brightness has a much bigger effect than what apps you are running.", "time": "10th December 2015, 09:50 PM", "postID": "post64251267", "replies": []}]}]}, {"text": "you could  refer to the full spec of v10 on phonearena", "time": "9th December 2015, 03:15 AM", "postID": "post64218448", "replies": []}, {"text": "I have to admit the dose featute works incredibly well. I lost 1% in 13 hours. Thats amazing but i dont care about standby time. Im worried about screen on time. Its very poor. No good if you can't use your phone", "time": "11th December 2015, 11:37 AM", "postID": "post64259339", "replies": []}, {"text": "Yesterday I got 5hrs SOT. Using the t-mobile version.", "time": "15th December 2015, 08:06 PM", "postID": "post64331200", "replies": []}, {"text": "Lol 10h of sot...It's like this...my v10 got some yellowish edges around screen, so I turn on app screen burn test..or somth. like that. I leave it running trought the night and at morning mobile was still on...flashing colors on screen", "time": "24th December 2016, 02:02 PM", "postID": "post70235346", "replies": []}, {"text": "The battery lasts a lot longer now...... I am using a Samsung fast charger..... Charging speed is extremely fast", "time": "4th January 2017, 04:48 PM", "postID": "post70392170", "replies": []}, {"text": "Another proof", "time": "5th January 2017, 10:18 AM", "postID": "post70402999", "replies": []}, {"text": "^ How the f**k did you get 10 hours screen on time? I get around 2.5 to 3 hours absolute max battery. Gone through 3 different batteries, makes no difference...\n\nThe LG V10 is the worst phone I've ever had for battery.", "time": "9th January 2017, 10:10 PM", "postID": "post70477536", "replies": [{"text": "No mate...this 10 h of SOT are with app  flashing the screen. app called screen burn in...I was surprised when I find my phone still flashing in the morning. \nIf I use normally my phone SOT is 2,30 - 3h", "time": "9th January 2017, 10:15 PM", "postID": "post70477580", "replies": []}, {"text": "Same, my phone dies annoyingly fast. I just bought a new battery and it barely helped. I also have greenify which seems to work well when it comes to standby time but the screen on it dies stupidly fast.", "time": "11th February 2017, 11:39 PM", "postID": "post70989715", "replies": [{"text": "I have found that using Andy's rom with Nebula's kernel gives me the best possible battery life with this phone. Before, it would be around 2 pm of a regular day and my battery was about to die. Now it goes until 9 pm or even 10 pm and still got some juice left. I have taken several screenshots to prove I'm not just \"thinking\" it gives me better battery life. It truly does. I have downloaded some battery monitoring app to track it now but to anyone unhappy with battery life (really, most of us), the best setup for a t-mobile V10 as of right now is Andy's rom with Nebula's kernel.\n\r\nI don't have root yet, no need for it as this rom is incredibly fast and stable, and of course, as stated above, battery life is truly superb!", "time": "23rd February 2017, 12:35 AM", "postID": "post71149523", "replies": []}]}]}]}, {"title": "Standby drain", "rating": 4.0, "links": ["https://forum.xda-developers.com/lg-v10/review/standby-drain-t3246714", "https://forum.xda-developers.com/lg-v10/review/standby-drain-t3246714/page2", "https://forum.xda-developers.com/lg-v10/review/standby-drain-t3246714/page3", "https://forum.xda-developers.com/lg-v10/review/standby-drain-t3246714/page14"], "threads": [{"text": "Not impressed with the steady drain.", "time": "21st November 2015, 10:23 PM", "postID": "post63944511", "replies": []}, {"text": "Turn off Enhanced LTE.", "time": "22nd November 2015, 02:11 AM", "postID": "post63946686", "replies": []}, {"text": "Yes I went to bed last night and lost 43 percent in 8 hours!", "time": "22nd November 2015, 02:21 AM", "postID": "post63946769", "replies": []}, {"text": "wow lots wrong. my problem is that i'm rooted and have exposed installed so i never know if its the mods affecting the phone overheating and battery drain. Glad tmobile was able to do a swap.", "time": "22nd November 2015, 03:12 PM", "postID": "post63954660", "replies": []}, {"text": "WIFI is stuck on and won't chut-off for dep sleep. How do you turn off enhanced LTE?", "time": "22nd November 2015, 05:21 PM", "postID": "post63956631", "replies": []}, {"text": "is  enhanced LTE named volte?", "time": "22nd November 2015, 07:50 PM", "postID": "post63958819", "replies": [{"text": "Turn off VoLTE and also look in the advanced setting in the wifi area, press the three dots at the upper right of the screen, and turn off location and passport.\n\r\nI still have the feeling that I bought a 'red headed step child' and I don't know if I'm liking it.", "time": "22nd November 2015, 11:33 PM", "postID": "post63961625", "replies": []}]}, {"text": "Coming up on 4 hours on battery (unplugged at home, trip to work, sitting at work) and I am still showing 100%, not seeing an idle drain issue.  Running bone stock.\n\nI have both WiFi(not connected to a network for commute or at work) and sync enabled (Google, Facebook), GPS and Bluetooth disabled.", "time": "23rd November 2015, 02:58 PM", "postID": "post63970935", "replies": []}, {"text": "Coming up on 8 hours on battery and a few texts and quick Facebook scrolls... sitting at 94%.  Estimated time remaining is around 58 hours.", "time": "23rd November 2015, 08:06 PM", "postID": "post63975749", "replies": [{"text": "I think I'm getting mine to sleep now.  Unchecking the location and passport options under the wifi advanced settings appears to have helped dramatically.", "time": "23rd November 2015, 11:05 PM", "postID": "post63977978", "replies": []}]}, {"text": "Excellent!", "time": "24th November 2015, 02:37 AM", "postID": "post63979910", "replies": []}, {"text": "lost about 10% during my sleep of 6 hours..", "time": "1st December 2015, 05:28 PM", "postID": "post64098521", "replies": []}, {"text": "Some of the ideas mentioned above helped, but rooting my phone i noticed a process kept wanting root. Non stop. Did some research on this process and its tmobile checking for things. I plan on keeping phone, but supposedly it will report back to tmobile about your device being rooted and void warranty. Regardless, i used titanium and froze it. the run away process is \"com.tmobile.pr.adapt\". My battery actually hasn't dropped in almost 2 hours but 1 % since freezing this application, and that's because of other applications i have going in the background. Hopefully this can help ya'll out too. \n\nDo some research if you want on that process, before freezing it, but i've noticed no changes to anything else. Nor do i use the tmobile account app and such on my phone.", "time": "1st December 2015, 05:53 PM", "postID": "post64098904", "replies": [{"text": "Yes, T-mobile likes to have all their branded devices phone home, including their ASUS router.  I unplugged a T-mobile branded ASUS router for two weeks I had connected to my internal network and one day I received a text stating I was being charged a hundred and something bucks for it.  I called TMO and they acknowledged not seeing it active so they billed me for it.  I sent it back.    I'm not surprised that the router phoned home, but no where in the documentation included with the router did it mention that the device would phone home nor did it mention what type of data the router would be including with each call to the mother ship.  That really urked me.  \n\r\nIt also urks me that I cannot uninstall the t-mobile app, or disable it.  What if I wanted to switch carriers?  My phone is paid for.  How would I go about uninstalling the TMO stuff?  blah!", "time": "1st December 2015, 09:44 PM", "postID": "post64102285", "replies": []}]}, {"text": "I'm on the Verizon (VS990) variant.\n\r\nI installed Greenify (as I always have) and was getting stupid battery drain. I noticed that I have an app called 'Restrict Idle Apps', which is a system app that I've never seen before. Hmm. Just for fun, I removed Greenify. I now get 1% or less per hour drain on idle. My guess is that LG made \"their own version of greenify\" and they were fighting it out, with my battery being the collateral damage.\n\r\nDoes anyone else have the 'Restrict Idle Apps' or is it unique to the VS990?", "time": "4th December 2015, 10:07 PM", "postID": "post64151490", "replies": []}, {"text": "U can uninstall all the T-mobile bloat ware. Even the PR.adapt ect. I have on g4 and my v10. Don't uninstall the unlock app til 40 days after its been on the network then u can submit a temp unlock remove the app so it doesnt phone back to them that its a temp unlock and unlock your phone from the network without their help. Volte defense decreases battery life on all devices and wifi calling enabled will send all the same information that the my tmobile app does and is also how they are cracking down  on people abusing the hotspot/teth feature", "time": "5th December 2015, 08:49 AM", "postID": "post64156677", "replies": [{"text": "huh?", "time": "5th December 2015, 06:27 PM", "postID": "post64163326", "replies": []}]}, {"text": "i had to tweak my settings with greenify several times before i got to the point my phone would last a full day on one charge. i still haven't perfected it where my lg urbane will show notifications meaning there is something in the setting still to be adjusted but before my phone only lasted about 6 or seven hours now i can stretch from 5am to 10 pm and still have about 20 percent battery life.  being on verizon i would have thought thta i would be easier to make the adjustments to prevent battery drain but i suppose not.  i'm t-mobile. and i work there so i have a few ideas about what it takes to keep the phone from phoning back home....this makes me miss my g2 it had a three day battery life....and that was back when i had verizon.\n\n---------- Post added at 09:09 PM ---------- Previous post was at 09:06 PM ----------\n\nthis goes without saying but i noticed by not having sync on the battery life is greatly improved which makes me wonder what exactly is all synced.  and wondering if there is a way to control what is synced......", "time": "9th December 2015, 03:09 AM", "postID": "post64218369", "replies": []}, {"text": "Hi guys ， i get my lg v10 from 3 days back taiwan version (H962) and the device is completely awesome.. But the battery is heavily drain in the standby .. Please can anyone help me in that issue and how i can stop this drainage .. Specially i didn't make root for my device and i think till now there is no root available for the taiwan version ( H962)..\n\nThanks for your help in adnavce", "time": "14th December 2015, 09:11 PM", "postID": "post64315761", "replies": [{"text": "power off the phone.\n\nJust joking.\n\nI had the power drain when  first got the phone, and I think I have figured out the problem.\n\nI have stopped using the supplied power adapter, fast charge is not good on the battery, I now use a standard 2.0A power adapter, first time I use the standard power adapter I charged for about 6 hrs, then use the phone as normal and let it auto power off,  then charge to 80%-90% now, once the % drop to about 10%-15% I start to charge my phone, I get about 6hrs on 100% during standby.\nWill start using wireless charging now, so I will see how it goes.", "time": "15th December 2015, 03:42 PM", "postID": "post64327477", "replies": [{"text": "I use my Nexus 6 charger instead of stock charger and batt life increase a lot, and charging faster than stock.", "time": "14th February 2016, 07:15 PM", "postID": "post65325076", "replies": []}]}]}, {"text": "Anyone try putting down their phone face-down when going to bed at night to see the results?", "time": "15th December 2015, 07:08 PM", "postID": "post64330327", "replies": [{"text": "This is my observation:\r\nInitially when not much apps were installed, it was just 2% over night. Later on after installing apps I saw it varying from 5 to 10.\r\nLater removed all the possible bloats, turned off passport in Adv WiFi settings and this is the current drain over night:\r\n1) 3% - Wifi, Data and Sync - all off and device facing down\r\n2) 4% - All On device facing down\r\n3) 5% - All on Device facing up \n\r\nThat looks pretty much stable and hope it will be even better with Marshmallow.", "time": "22nd December 2015, 07:36 PM", "postID": "post64441165", "replies": []}]}, {"text": "This is fantastic!  \r\nI don't use any Batter Saver during the day - when the phone is not in use for an hour or so, it has only lost a percent or two even when receiving e-mails and texts that I haven't opened for a few hours.", "time": "22nd December 2015, 10:47 PM", "postID": "post64443523", "replies": []}, {"text": "Couple questions:\r\nhas anyone noticed a difference in drain between wifi or bluetooth being on vs off?\r\nI also have a Verizon version with Greenify (free) installed, would disabling it be enough to see if it has a negative affect?\n\r\nthanks!", "time": "15th February 2016, 04:40 PM", "postID": "post65339259", "replies": []}]}, {"title": "Heavy use endurance", "rating": 3.5, "links": ["https://forum.xda-developers.com/lg-v10/review/heavy-endurance-t3246715"], "threads": [{"text": "1 to 3 hours of phone use a day.  \n30 to 50 emails a day. \n5 to 200 texts a day. \n1 to 3 hours on Google, Web-Sites, Forums, etc.\nLocation Services and WiFi always ON. \nRandom Bluetooth use (driving only - connected to Hand Free in car) \nI shut the apps down after using them.   \nThis is a \"normal\" day ... and I get 10 to 12 hours with no problems.  It's better than my previous phones!", "time": "22nd December 2015, 10:56 PM", "postID": "post64443610", "replies": [{"text": "Nope. I play Simcity Buildit pretty often and this phon lags worse than my M8 HK and Nexus 7 (2013 wifi). There is a setting in the battery settings that modifies game frame rates to improve battery life. Didn't notice a difference in performance with or without this feature activated.\n\nHonestly, if you visit a website with more than 1 or 2 ads (eg XDA as I'm typing right now) you'll experience lag.  But the biggest issue is the battery life. I go through about 1% per minute playing Simcity. I feel like I'm playing on my 10 year old G1. At least back then having horrific battery performance was kind of expected. I'm returning this phone ASAP.\n\n---------- Post added at 08:49 AM ---------- Previous post was at 08:34 AM ----------\n\n\n\r\n1.5 hours of screen time\nNo emails\nNo texts\n1 hour of web use\nLocation services and wifi on all day\nBluetooth off and no Bluetooth use\nNo shutting down apps (this is better for battery life on lollipop than killing them, and why not have multitasking capabilities? This is 2016 with a $700 phone)\nThe phone limps into 12 hours but only after consciously trying not to use it after %30 because I still had 5 hours left in my day. \nMy useage is normally double or triple this. \nI get 16-20 hours easily with my normal useage on my HTC M8 HK with battery saver on (yes it's a little slower, but not problematically so). \n\nTLDR: My nearly 2 year old phone outperforms a phone released 5 months ago. I'm returning the LG ASAP.", "time": "28th February 2016, 03:49 PM", "postID": "post65566693", "replies": []}]}, {"text": "Can this phone do heavy performances? heavy games??? Without any lag??\nIn benchmarks its level isnt so high but what in reality????", "time": "12th January 2016, 08:13 AM", "postID": "post64765523", "replies": []}]}, {"title": "Light use endurance", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-v10/review/light-endurance-t3246716"], "threads": [{"text": "First day moderate use, euphoric stage, ended work day with 33%", "time": "13th November 2015, 05:59 PM", "postID": "post63809487", "replies": []}]}, {"title": "\"Look\" of the device (aesthetics)", "rating": 5.0, "links": ["https://forum.xda-developers.com/lg-v10/review/look-device-aesthetics-t3246717"], "threads": [{"text": "I previously had note 3 and galaxy nexus and this phone is such a great looking phone with stainless steel on the sides and secondary screen on the top. I love how short the top empty space is (the area on the top) and also the bottom portion. Also, the back of the phone (removable back) gives a premium feel along with a huge circle for the camera.", "time": "12th November 2015, 05:01 PM", "postID": "post63791428", "replies": []}, {"text": "I've had Nexus 4, Nexus 5, Nexus 6, LG G4, Motorola Atrix HD, and Sony Z3 all within a year's use. The N4 and AHD were nice. The N6 feels great in the hand well balanced, G4 much the same. But the Sony Z3 stood out as clean and sleek.\n\nThe v10 a cross between the N6 G4 that almost meets the Sony in its clean sleek design. Altho the ss is nice looking bling. I would have preferred Teflon or the same materials used on the Sony sides, much like the v10 back, too and lower bezel material. It can take drops dings and bangs much more IMO.", "time": "12th November 2015, 05:23 PM", "postID": "post63791803", "replies": []}, {"text": "IMO, the LG V10 reminds me of Blackberry devices - they look business/professional friendly and don't scream \"hey, im a teenager and my mommy bought this phone for me!\" \n\nThe V10 has the look of being \"professional\". The stainless steel sides add a bit of variation but since most of it has the brushed effect, it is not too shiny so it makes the phone have a subtle look. The V10 is like the badass of the room. It doesnt need to be loud cuz it knows it can kick your ass.", "time": "13th November 2015, 01:17 AM", "postID": "post63798254", "replies": []}, {"text": "hands down best mix of aesthetics and practicality in a smartphone ever", "time": "13th November 2015, 05:08 AM", "postID": "post63800397", "replies": []}, {"text": "Forgot to mention, has anyone with an LG G4 noticed the effect/illusion of the screen having a belly or curved upwards concave instead of downward convex? It's messing with my mind and eyes.", "time": "13th November 2015, 08:26 PM", "postID": "post63811427", "replies": []}, {"text": "It's not like there's a lot of options for the look of a phone, it's more-or-less a cookie-cutter rectangular design as that's the format that works.  It the the textured back of the phone that I like the most.", "time": "24th December 2015, 04:27 PM", "postID": "post64471998", "replies": []}, {"text": "Front and back look nice and clean. The sides suggest a tough build. Looks more premium than many other phones out there.", "time": "17th March 2016, 02:50 AM", "postID": "post65882984", "replies": []}]}, {"title": "Quality feel (use of materials)", "rating": 5.0, "links": ["https://forum.xda-developers.com/lg-v10/review/quality-feel-materials-t3246718"], "threads": [{"text": "It's grippy yet at the same time If you're light to touch it's slippery. The phone looks premium business-like. Sofisticated yet not pretentious. The coating on the back cover reminds me of the feel of the Kevlar backs on Motorola devices.\n\nSolid. Tight. Doesn't creek.", "time": "12th November 2015, 07:08 PM", "postID": "post63793463", "replies": []}, {"text": "Quality of phone feels \"assuring\". Stainless steel sides give the feeling of sturdiness. Back cover is the type of material that sort of \"heal\" if there is a small indent/nick.\n\nGorilla glass 4 on this device seems to avoid and resist smudges compared to the iphone 6/6s.", "time": "13th November 2015, 01:11 AM", "postID": "post63798186", "replies": []}, {"text": "The stainless steel sides... love it so much", "time": "13th November 2015, 05:09 AM", "postID": "post63800407", "replies": []}, {"text": "Home run in this category.  It feels solid, it looks solid, it's heavier than most and it feels right in my big hands.  \r\nGood job LG.", "time": "24th December 2015, 04:28 PM", "postID": "post64472012", "replies": []}, {"text": "All of things in design is good but i think the back cover could be better than it.\nThe stainless steel sides is perfect and make a good feeling\nI preffer phones are simple design and the front side of this phone is excellent", "time": "12th January 2016, 08:07 AM", "postID": "post64765456", "replies": []}]}, {"title": "Ergonomics (in-hand feel)", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-v10/review/ergonomics-hand-feel-t3246719", "https://forum.xda-developers.com/lg-v10/review/ergonomics-hand-feel-t3246719/page2"], "threads": [{"text": "I prefer LG design, having buttons on the back. That being said, the power button is harder to find IMO then on the G4, previous sets, because it's flat for finger prints.", "time": "12th November 2015, 04:08 PM", "postID": "post63790581", "replies": []}, {"text": "I moved on from my Nexus 6.  IMHO, the V10 has batter hand feel.  It's very sturdy and feels more comfortable in the hand.  It's a very balanced unit.", "time": "13th November 2015, 05:09 AM", "postID": "post63800414", "replies": [{"text": "How are differences in the screen department?", "time": "13th November 2015, 05:46 AM", "postID": "post63800728", "replies": [{"text": "I have noticed two differences.  First, the amoled panel on the N6 creates a more saturated appearance while the v10 appears more natural.  There is perhaps the slightest \"lean\" towards blue.  I believe I saw somewhere the the color (Kelvin) is well north of 5000, which supports this notion.  That said, to me it's hardly noticeable.  THe second is the brightness. I kept the N6 at about 33% percent brightness and I keep the v10 at 45% brightness to achieve the same appearance.  Again, this is a minor issue, except for the battery impact.   I'm on my third charge cycle, and after 36 hours of run time on this charge and nearly 3 hours of talk time and 2 hours of screen on time, I'm at 8 %.  The N6 was a bit better, but the battery was 15% larger.  Overall, I think the phone is excellent.  It feels great in the hand and I'm getting used to the back buttons quickly.", "time": "13th November 2015, 03:10 PM", "postID": "post63806918", "replies": []}]}, {"text": "That's what she said... (sorry couldn't resist)\n\n\n\r\nIMO The v10 visibility is brighter and clearer than the G4, even though the G4 is really clear already. The N6 amoled is still neat, contrasty colors (but not real) and bigger screen wise.. I still like the N6 screen size, as it's wider not taller, but I think I can finally sell it, as I've essentially turned it off since getting the v10. Haven't used my G4 since either.\n\r\nNote. I keep my phones in my left front pocket solo. It fits very well. No bending pressure felt when walking or going up down steps. Not heavy, can't feel it bulge, slides in and out super easy without feeling like it's gonna slip out. It doesn't flip horizontally or diagonally, stays vertical, other designs do flip and I have to readjust so not to snap it.", "time": "13th November 2015, 07:39 PM", "postID": "post63810838", "replies": []}]}, {"text": "This is my first LG phone so it's taken some time to get used to the power button placement, but I prefer it now on the larger phone not having to reach across to the opposite side.  I use mine without a case and love the feel of the rubber back and metal side rails.  Definitely the most solid phone I've ever had.", "time": "13th November 2015, 02:09 PM", "postID": "post63806043", "replies": []}, {"text": "power button has been the biggest annoyance, but all feels good. I previously had the G3 and G4", "time": "13th November 2015, 02:45 PM", "postID": "post63806552", "replies": []}, {"text": "I have large hands, so overall a 4/5 from me. The button placement is great, but I'm still getting used to LG functionality (button locations, knock codes, etc). The size of the phone deters some functions such as knocking, but it's really the weight that causes it to lose a star from me. The power button feel is also a bit annoying--makes it hard to find between the volume buttons just due to texture. Not a huge deal, and this is my first phone larger than an SGS4 so my opinion will likely change over time.", "time": "13th November 2015, 04:21 PM", "postID": "post63808092", "replies": []}, {"text": "it's my first phone with controls on the back side and after a day or two - it's perfect!  My fingers naturally fall about where the On/Off and Volume buttons are and it feels natural.  A great design for a positive user experience.", "time": "24th December 2015, 04:30 PM", "postID": "post64472049", "replies": []}, {"text": "I like this phone. But this is my large phone. I find the phone a little slippery. Mainly the metal bars makes it slippery. especially when taking photos. any suggestions?", "time": "25th December 2015, 10:41 PM", "postID": "post64490421", "replies": []}, {"text": "Weight: you start to feel the weight of the phone after using it for a longer period. But it also adds a premium feel to it.\r\nErgonomics: First phone which I don't accidentally push the power or volume buttons, because they are all on the back.\r\nFingerprint scanner: snappy, and reliable.", "time": "17th March 2016, 02:54 AM", "postID": "post65883017", "replies": []}]}, {"title": "OEM skin/software", "rating": 4.0, "links": ["https://forum.xda-developers.com/lg-v10/review/oem-skin-software-t3246720"], "threads": [{"text": "I like it.  Dark screen with Icons and Widgets that are easy and clear to see.  I like the software too.  It's smooth, easy to use and the options are a cinch to customize to the users preference.", "time": "24th December 2015, 04:33 PM", "postID": "post64472083", "replies": []}, {"text": "I think I prefer Samsung's take on Android, more than LG's. LG hasn't really gone forwards as much as I hoped. It's not bad, but all the extra bloatware is just that - you don't need any of it, and it brings nothing new on the table. The tweaks to make it an LG phone are OK, but it's a bit of a mess to be honest. Too many settings and options to choose from, too little effect on actual functionality.", "time": "25th February 2016, 05:52 PM", "postID": "post65518452", "replies": []}, {"text": "I think the V10 has way less bloat out of the box than previous G series phones... (On Verizon)", "time": "1st March 2016, 02:28 AM", "postID": "post65592375", "replies": []}]}, {"title": "Outdoor visibility (max brightness)", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-v10/review/outdoor-visibility-max-brightness-t3246721"], "threads": [{"text": "Auto brightness settings outdoor under Florida Sun. Using Motorola Nexus 6, I couldn't see what's on the screen, even bringing my hand up for a shadow. Using the LG G4 the screen would brighten and colors would wash out, making things very legible aka Notion Ink pixel qi screen. The v10 does it one better, clear legible, and colors still vibrant.", "time": "13th November 2015, 06:15 PM", "postID": "post63809701", "replies": []}, {"text": "Yes, it's pretty readable outdoors even the brightness is 60%", "time": "15th November 2015, 03:08 PM", "postID": "post63837692", "replies": []}, {"text": "surprisingly the brightness isn't bad. coming from a g3, im impressed", "time": "26th November 2015, 06:23 PM", "postID": "post64022830", "replies": []}, {"text": "I don't know how anyone could ever give 5 stars on this ... except maybe ... and I mean maybe ... the Curve.  Every phone has a reflective surface and outside, they're all hard to see unless you're in the shade.  Same with this phone.", "time": "28th December 2015, 11:47 PM", "postID": "post64535710", "replies": [{"text": "I own a Nexus 6 Motorola as well as a LG V10. The 6 can't be read in the full sun but the V10 can. Here in Thailand I have lot's of sun every day so I know what I am talking about. I would give 4.5 stars out of 5.", "time": "22nd August 2016, 02:20 AM", "postID": "post68299567", "replies": []}]}]}, {"title": "Contrast (true blacks)", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-v10/review/contrast-true-blacks-t3246722"], "threads": [{"text": "I like how natural the images are, they're not over saturated ... they appear sharp and natural.", "time": "28th December 2015, 11:49 PM", "postID": "post64535734", "replies": []}, {"text": "No other LCD can match the blacks, it's very close to Amoled.", "time": "17th March 2016, 02:55 AM", "postID": "post65883032", "replies": []}]}, {"title": "Color saturation & accuracy", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-v10/review/color-saturation-accuracy-t3246723"], "threads": [{"text": "Mine is generally not too bluish as other display floor models even under daylight (5000-6500 Kelvin).\nColor is just right.", "time": "30th November 2015, 08:51 AM", "postID": "post64076008", "replies": []}, {"text": "The screen is perfect, just have mine set up like this for a little bit of more contrast.", "time": "1st December 2015, 12:32 AM", "postID": "post64087936", "replies": [{"text": "I just bought this phone Saturday and I love the whole big screen and 2nd screen but one question is making me doubtful about it. the images are so pixel or some what very contrast that it makes it look very contrast and some kind of blurriness not sharp. Can you help me with this.", "time": "1st December 2015, 04:41 PM", "postID": "post64097852", "replies": []}, {"text": "i can't find that setting? where is it ?\nthanks\n\nI'm pretty happy with the colors so far not over saturated", "time": "1st December 2015, 05:25 PM", "postID": "post64098454", "replies": [{"text": "Search for \"screen color adjustment\" in settings.", "time": "5th December 2015, 12:25 AM", "postID": "post64152872", "replies": []}]}, {"text": "I have mine OFF and it is perfect", "time": "27th September 2016, 09:30 AM", "postID": "post68878158", "replies": []}]}, {"text": "I like how natural the images are, they're not over saturated ... they appear sharp and natural.", "time": "28th December 2015, 11:49 PM", "postID": "post64535737", "replies": []}, {"text": "Go to google playstore download display calibration  its an excellent app it akes a huge difference at any brightness level   also download v10 hidden settings   another great app no root required for either      v10 is an awesome device had mine just under a year no equal in the camera dept. And just as quick to load apps games etc as my wifes s7", "time": "24th September 2016, 01:09 PM", "postID": "post68838005", "replies": []}]}, {"title": "Clarity/resolution", "rating": 5.0, "links": ["https://forum.xda-developers.com/lg-v10/review/clarity-resolution-t3246724"], "threads": [{"text": "I dont know if you guys and gals with good eyes notice.. But I suggest anyone looking at an LG G4 or v10 to look at and read the screens with reading glasses on.. The IPS screen clarity is unrivaled. \n\nFor my eyes, the ever so slight increase in size to the G4 makes the screen easier to read.", "time": "24th November 2015, 09:17 PM", "postID": "post63993237", "replies": []}, {"text": "all pictures and facebokf posts with images or videos are very poor quality. they are all distorted and very fuzzy.. I think I'm switching to another phone.", "time": "1st December 2015, 09:46 PM", "postID": "post64102315", "replies": [{"text": "I think the display has excellent clarity and with 560 DPI you would be hard pressed to see imperfections.  Could it be something wrong with your software configuration as hardware problems would be evident all the time ?", "time": "2nd December 2015, 03:51 PM", "postID": "post64113748", "replies": [{"text": "well not sure since I just got this phone Saturday and have not messed with anything. How can I know?", "time": "3rd December 2015, 08:04 PM", "postID": "post64134202", "replies": []}]}, {"text": "Check Chrome's Settings 😉\n\nhttp://www.fastcompany.com/3054102/e...qajbMSe6sZV4pw\n\nsent with Hugz from my new fully stock, non-rooted VZW LG V10 VS990 which an old faithful still working Rezound helped me to afford to get\n\n---------- Post added at 02:45 AM ---------- Previous post was at 02:32 AM ----------\n\n\n\r\n It's hard to understand what you are seeing.\n\nIt could be the Lock Screen's Swipe Effect or maybe the Blurred background view that happens when the phone is On and the Power button is held down to view the Shut down choices.\n\nCheck those to see if they are causes\n\nsent with Hugz from my new fully stock, non-rooted VZW LG V10 VS990 which an old faithful still working Rezound helped me to afford to get", "time": "8th December 2015, 07:45 AM", "postID": "post64202496", "replies": []}]}, {"text": "That is software problem. If it was hardware it would affect everything", "time": "4th December 2015, 05:13 AM", "postID": "post64139524", "replies": []}, {"text": "I'm really enjoying the clarity of the resolution, but in the last few days I've started to notice something strange. Had the V10 for almost a month now. I've noticed that every now and then, when I hit the power button while looking at the screen, it looks like an old 3D effect (seen without the glasses), around all writing and icons. It looks like red & blue outlines, sort of 1/2 & 1/2, and only for a millisecond or so. Anyone else seeing bad 80's 3D?", "time": "4th December 2015, 09:43 PM", "postID": "post64151193", "replies": []}, {"text": "Very good to me.  \r\nI do wear glasses for close up, yet don't need them with this phone.", "time": "28th December 2015, 11:50 PM", "postID": "post64535746", "replies": []}]}, {"title": "Minimum brightness", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-v10/review/minimum-brightness-t3246725"], "threads": [{"text": "In the dark 1/5th the top corner from the 2nd display down the phone is lit and bleeding light. Woke up to check time, for the first time last night and thought \"oh the screen cracked?!\"", "time": "12th November 2015, 04:29 PM", "postID": "post63790915", "replies": []}, {"text": "I had a similar experience with the guy above and i felt it is great to put the phone face down even though it doesnt really bother me with second screen being always up. However, i think the phone gets too dark on lowest brightness for me to read or view videos so i am not sure if that is good or not. I guesd i have to use apps to adjust the lowest brightness to be brighter LOL(First world problem).", "time": "12th November 2015, 04:55 PM", "postID": "post63791325", "replies": []}, {"text": "Never turned down that much ... but good enough the one time I used it.", "time": "28th December 2015, 11:51 PM", "postID": "post64535756", "replies": []}, {"text": "On my HTC M8, I had to use Screen Filter to reduce the brightness when using the phone in complete darkness. On the V10 I don't need that app, the minimum brightness is low enough for night use.", "time": "17th March 2016, 02:58 AM", "postID": "post65883057", "replies": []}, {"text": "Minimum brightness is a tad to bright for me. As is automatic brightness in general. It worked for me on Galaxy S5, but now I manually adjust it as automatic is just to bright!", "time": "13th June 2016, 08:42 PM", "postID": "post67303397", "replies": []}, {"text": "Delete", "time": "13th June 2016, 11:45 PM", "postID": "post67305362", "replies": []}]}, {"title": "Call quality", "rating": 5.0, "links": ["https://forum.xda-developers.com/lg-v10/review/call-quality-t3246726", "https://forum.xda-developers.com/lg-v10/review/call-quality-t3246726/page2"], "threads": [{"text": "And please, make your comments how others can hear you with and without loudspeaker \"on\".", "time": "13th November 2015, 10:47 AM", "postID": "post63803485", "replies": []}, {"text": "I just used this phone for the first time on calls of any length.  Thanksgiving and all that.  I actually said, out loud, a couple of times, \"Wow!  This is the best phone I've used in a long time!\"  Those other phones would be iPhone 6, Moto X 2014, Moto X, and Galaxy Nexus", "time": "27th November 2015, 11:50 AM", "postID": "post64032503", "replies": []}, {"text": "No problem making calls with phone itself or headset putting on.", "time": "30th November 2015, 08:45 AM", "postID": "post64075955", "replies": []}, {"text": "Callers could not hear me until third redial or reboot. Factory reset did not work. Verizon replaced the phone about five days ago.\nSame issue on intermittent basis. My suspicion is that being constantly on wifi due to weak data signal both at home and in the office has something to do with it. Calls via bluetooth in car work perfectly.\n\nHaving said that, never had those problems on previous phone ( SG Note 2). Same provider and location.", "time": "30th November 2015, 06:33 PM", "postID": "post64083538", "replies": []}, {"text": "I get service in places in my house I didnt get with my lg optimus l90\nBest phone I've ever had. Calls are crystal clear over mobile network or WiFi.", "time": "30th November 2015, 08:44 PM", "postID": "post64085374", "replies": []}, {"text": "Excellent.", "time": "28th December 2015, 11:51 PM", "postID": "post64535758", "replies": []}, {"text": "Don't get me wrong, I absolutely love this phone, but my experience with call quality is horrendous. Wifi calling? Constant dropped calls, breaks up, people can't hear me. Full LTE bars? Constant dropped calls, breaks up, people can't hear me.  My biggest disappointment with the phone is the call quality, its probably the worst in any phone I've ever had, and I was really hoping the new TruSignal tech by Qualcomm was going to make it exceptional, buts horrid.", "time": "29th December 2015, 06:15 AM", "postID": "post64539179", "replies": []}, {"text": "When I'm calling with other phones (not all of them) I can hear quite a robotic sound in my front speak, but that's just a problem of the other person i guess. Otherwise it has pretty good \"calling powers\".", "time": "29th December 2015, 10:43 PM", "postID": "post64551399", "replies": []}, {"text": "Best phone i've used for making call", "time": "2nd January 2016, 02:26 AM", "postID": "post64599066", "replies": []}, {"text": "I mean it's a $600 phone", "time": "11th January 2016, 04:01 AM", "postID": "post64746317", "replies": []}, {"text": "Phone is not usable if trying to place a call with Wifi Calling.  I can hear the caller but the caller cannot understand what I'm saying.  I don't know what else to try since I rely on Wifi Calling since I work in the basement of a hospital.", "time": "12th January 2016, 07:28 PM", "postID": "post64774868", "replies": []}]}, {"title": "WiFi strength, range, and throughput", "rating": 3.5, "links": ["https://forum.xda-developers.com/lg-v10/review/wifi-strength-range-throughput-t3246727"], "threads": [{"text": "My cheap samsung has better wifi signal", "time": "1st December 2015, 05:27 PM", "postID": "post64098491", "replies": []}, {"text": "Good ... but I've had better with an old phone, the Sammy S III", "time": "28th December 2015, 11:52 PM", "postID": "post64535768", "replies": []}, {"text": "It's odd, my g3 reported a weaker signal but constantly connected. My v10 reports a better signal but the first attempt almost always fails regardless of the app. It was like a 3-4 dB difference between the phones. But when it's connected I've had better speeds with my v10", "time": "29th December 2015, 09:19 PM", "postID": "post64550359", "replies": []}, {"text": "Very poor compared to my past HTC's", "time": "22nd January 2016, 06:06 PM", "postID": "post64933100", "replies": []}, {"text": "The WiFi connection drops frequently on my V10. It's one of the only things I'm disappointed in. I'm hoping a future firmware update will make it better.", "time": "1st February 2016, 08:27 PM", "postID": "post65097701", "replies": []}, {"text": "Compared my Note 4 wifi connectivity to the LG V10 side by side, the Note 4 shows a better throughput connection figure.", "time": "9th February 2016, 05:28 AM", "postID": "post65226659", "replies": []}]}, {"title": "Cellular strength and throughput", "rating": 4.0, "links": ["https://forum.xda-developers.com/lg-v10/review/cellular-strength-throughput-t3246728"], "threads": [{"text": "I've always switched between AT&T and T-Mobile. AT&T has always had better penetration until now T-Mobile using the h901 I've been able to consistently get signal and fast data access even deep into buildings and in elevators. An issue I had using my LG G4 h811 on AT&T, always losing signal. It seems to reflect on my battery endurance as well.", "time": "13th November 2015, 06:23 PM", "postID": "post63809819", "replies": []}, {"text": "its a par with my note 2 i wish it is a lot better", "time": "1st December 2015, 05:27 PM", "postID": "post64098497", "replies": []}, {"text": "Pretty good", "time": "5th December 2015, 08:53 PM", "postID": "post64165226", "replies": [{"text": "It's what I get on average from home.", "time": "5th December 2015, 08:55 PM", "postID": "post64165239", "replies": []}]}, {"text": "i went from a g4 to the v10 at my house i get service everywhere other tmobile phones dont g4 was in and out with the v10 i havent dropped a single call and get 5mb down and 3 up which is good bc others dont even get data sometimes aka roomates icrap 6s lol\n\ni brag about the exceptional signal i get all the time and i always have a better db reading than anyone else in my area nw of twin citties mn", "time": "7th December 2015, 06:03 AM", "postID": "post64183671", "replies": []}, {"text": "Never have a problem.  Gets a signal all the places any other phone gets a signal.", "time": "28th December 2015, 11:53 PM", "postID": "post64535774", "replies": []}, {"text": "I ran a few RF tests with this device to view transmit/receive with some DIAG equipment. I can personally say that the CDMA-2000 Band 13 variant has amazing RF conditions.", "time": "29th December 2015, 03:23 PM", "postID": "post64545224", "replies": []}]}, {"title": "Speakerphone (loudness, clarity)", "rating": 4.0, "links": ["https://forum.xda-developers.com/lg-v10/review/speakerphone-loudness-clarity-t3246729", "https://forum.xda-developers.com/lg-v10/review/speakerphone-loudness-clarity-t3246729/page2"], "threads": [{"text": "It's muffled and distorts. Ss-sounds are almost inadible during calls and there's a \"fuzz\" on louder sounds. Annoying. Hopefully they can fix it in a software update.", "time": "11th November 2015, 08:13 PM", "postID": "post63777171", "replies": []}, {"text": "It's not as clear and loud as G4.", "time": "11th November 2015, 08:27 PM", "postID": "post63777419", "replies": []}, {"text": "Volume is pretty good but the clarity is only so-so in my opinion.  Coming from the One M8, which was my last phone, the speakers could use improvement.", "time": "11th November 2015, 10:22 PM", "postID": "post63779040", "replies": []}, {"text": "How do others hear you when loadspeaker is on? Do they hear you clear? Or they constantly asking you to repeat what you just said?", "time": "12th November 2015, 08:48 AM", "postID": "post63785195", "replies": [{"text": "I've used it a couple times and haven't had anyone complain about not being able to hear me.", "time": "12th November 2015, 12:19 PM", "postID": "post63787401", "replies": []}]}, {"text": "I come from note 3 and the speaker volume and clarity is clearly better than the note 3 or any other devices i have seen. I also own Sennheiser HD 650 and can confirm that onboard DAC is quite effective for high impedance headphones. Also for car audio and bose earphone i own show the benefit of auto upscaling of music i own. Very pleased with the purchase so far and still awaiting for the promotion i applied for!", "time": "12th November 2015, 03:28 PM", "postID": "post63789934", "replies": []}, {"text": "it is pretty loud actually.. and the clarity is not bad for only 1 speaker", "time": "1st December 2015, 05:28 PM", "postID": "post64098506", "replies": []}, {"text": "I think it fair to good.  Good enough for speakerphone conversations even in mildly noisy environments, but not great for music listening ( compared to Nexus 6P ).  I think the microphone quality is excellent as some people have been unable to tell that I'm on speakerphone.", "time": "2nd December 2015, 04:12 PM", "postID": "post64114102", "replies": []}, {"text": "Mine is good. bottom firing speaker.. you can use your hand and kind of cup the bottom of the phone.. makes it quite a bit louder.. other times I actually turn the phone upside down so the speaker is pointed up at my face. Seems adequate for me in clarity and volume.", "time": "2nd December 2015, 05:20 PM", "postID": "post64115134", "replies": []}, {"text": "Works fine for me.", "time": "28th December 2015, 11:53 PM", "postID": "post64535777", "replies": []}, {"text": "Much improved from the G2. While on that phone, anytime I used speaker, the person on the end always said \"did you put me on speaker???\". And reception was awful as well. \nThe V10 is clear and loud enough. Not one person has even asked.", "time": "29th December 2015, 02:10 AM", "postID": "post64537093", "replies": []}, {"text": "The speaker is mediocre only. But this is compensated by the superior sound coming from the headphone jacket.", "time": "17th March 2016, 03:13 AM", "postID": "post65883217", "replies": []}, {"text": "speaker is really bad\ni had mate 8 it has way better speaker quality with good bass", "time": "5th April 2016, 12:27 AM", "postID": "post66198165", "replies": []}]}]