[{"title": "Overall love", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-g6/review/overall-love-t3573450", "https://forum.xda-developers.com/lg-g6/review/overall-love-t3573450/page2", "https://forum.xda-developers.com/lg-g6/review/overall-love-t3573450/page3", "https://forum.xda-developers.com/lg-g6/review/overall-love-t3573450/page9"], "threads": [{"text": "Bought the phone preorder on the 17th and it came in on the 30th. So far I love this phone. Coming from the 6P its not renewed my interest in Android phones after not caring about upgrading for a year or two. Phone feels great in hand, runs smooth, looks awesome, and battery life impresses me. No complaints. Went to Best Buy to try out the S8 since Im still in the 14 day return period and decided to keep the G6.", "time": "3rd April 2017, 06:46 PM", "postID": "post71711301", "replies": []}, {"text": "Easily the best phone on the market. I keep the same phones for years, last phone being an LG-G2. This is the first phone that I was willing to upgrade to. Only thing I need now is ROOT so I can have my backup LG-G6 and this one synced exactly and just swap if any issues occur. NANDROID backups are crucial to me, so it's the only thing I feel I need at this point.", "time": "4th April 2017, 02:43 PM", "postID": "post71722658", "replies": []}, {"text": "Just picked mine up from Verizon yesterday. First time with an LG Phone. It's alright so far- my older phone (nexus 5X) had the power button above the volume, and i'm pretty used to that. So that's an adjustment. But overall, I think that it's very nice. Fast, and feels durable. No major complaints.", "time": "4th April 2017, 04:32 PM", "postID": "post71724275", "replies": [{"text": "Not your first time with an LG phone. The 5X was manufactured by LG.", "time": "4th April 2017, 04:45 PM", "postID": "post71724476", "replies": [{"text": "I was going to say the same thing but didnt want a negative perception of the G6. My girlfriend got her 5X when I got my 6P and that 5X didn't hold up well at all.", "time": "4th April 2017, 10:11 PM", "postID": "post71728767", "replies": []}]}]}, {"text": "I came from 6p > one plus 3t > g6. \nLove it\nJust itching for TWRP and custom roms and MAYHEM!", "time": "6th April 2017, 05:46 AM", "postID": "post71745892", "replies": []}, {"text": "I went from Sanyo MM5600 -> Sanyo MM9000 -> HTC One -> LG G2 -> LG G6.   As you can see, I keep my phones for YEARS.\n\nI just need root now for the Transparent modded Google Store, and to be able to remove bloatware.", "time": "6th April 2017, 03:28 PM", "postID": "post71751622", "replies": []}, {"text": "great battery life, snappy performance, quick boot up,  build quality is wonderful only con: bloatware.", "time": "6th April 2017, 10:09 PM", "postID": "post71756550", "replies": []}, {"text": "I was an iPhone user. This phone grabbed my attention and I really like it so far.", "time": "8th April 2017, 09:56 AM", "postID": "post71775063", "replies": []}, {"text": "I came from a Galaxy S7 which specs wise wasn't much of an upgrade.. Though, this phone runs circles around my Snapdragon S7 and doesn't seem to show any hint of slowing down.", "time": "9th April 2017, 03:51 AM", "postID": "post71784752", "replies": []}, {"text": "I just picked this up today and I'm coming from a Nexus 6. \n\r\nI have to say that this phone is making me sad.  It's smaller than my beautiful giant and I just discovered that in the Google Play Music App there is no equalizer so my $200 Sony Bluetooth headphones sound like **** when casting from this phone.  I ask for so little from a phone but for a manufacturer to kneecap an app that I use all of the time is making me want to return this thing.  I honestly think I'd rather suffer with my 2+ year old beast with it's battery that is fading than use a phone that is making me cringe.  \n\r\nThe zippiness of the processor and the 1 GB extra of memory doesn't seem to be enough to make me embrace this phone.  I so wanted to like it.", "time": "10th April 2017, 06:41 AM", "postID": "post71798927", "replies": [{"text": "I am surprised that you didn't looked at the specs and do a side-by-side comparison before purchasing it.\n\n---------- Post added at 08:38 PM ---------- Previous post was at 08:33 PM ----------\n\n\n\r\nI am ready to upgrade my G3 but am surprised that Verizon hasn't offered any discount on the G6 yet.  I can wait until they offer the $10 a month deal like they did on the iphones last year.", "time": "17th April 2017, 02:38 AM", "postID": "post71891863", "replies": []}]}, {"text": "There are apps for EQ. I used to use some on my G2 and they worked well.", "time": "10th April 2017, 07:35 PM", "postID": "post71807176", "replies": []}, {"text": "I love this phone. Went up from an LG G3, which I also loved. This new phone is a work horse and charges lightening fast! I was not too happy about them making the battery permanent and only offering a 32GB model. But the fact that it's waterproof was something I was willing to give up (not being able to exchange the battery feature). To get over the 32GB drawback, I purchased a 256GB micro sd card for my phone, then used the tool to split the memory between the internal and SD card ( https://forum.xda-developers.com/and...ernal-t3583875 ). The screen is awesome and the performance is so smooth. I do miss having root but the features this phone offers almost gives me every option I had with root on my LG G3. The fact that Sprint offered this phone at 50% off, allows me to pay in payments without interest, and finally they give me a Google Home unit for free made this purchase a no brainer.", "time": "14th April 2017, 10:35 PM", "postID": "post71863601", "replies": []}, {"text": "Coming from the Note 5 the LG6 transition has been such a smooth experience. Most of the bloatware can be deleted in 2 minutes and the other frozen so really have no gripe about not having root. Battery life is excellent and aod works well.  Never have been a fan of led notifications as for the ir for tv never used that so don't miss it. The software experience from lg is fluid and lag free and have come along way from the lg flex/flex2 I owned in the past.  I installed a 128g micro Sd card and loaded my music ,movies and pictures on it so not having 64g to start is not a big deal. Being a camera fan this has been a joy to use and shoot. I mainly use manual mode and the macro shooting is incredible. Night shooting I use a tripod and have been able to take some amazing shots. Everyone talks about the premium feel and this phone has it.  Fingerprint sensor is fast and accurate and placement is perfect.\r\n The Lg G6 just feels right in the hand with the weight and thickness being just right. I am using the Spigen Neo case and is still smaller than my note 5 with no case. The only downside with the G6 is the headphone jack output could be a little louder. I am sure this phone will only get better with future updates and overall this is an amazing phone. In simple terms the G6 just works", "time": "21st April 2017, 02:49 PM", "postID": "post71963137", "replies": [{"text": "I noticed you moved from a Note 5 to the G6- could you comment on how your experience was with moving from AMOLED to LCD on this phone?  I'm going to replace my Note 4 soon (i still love that phone) and haven't ever used LCD.  I was really tempted by the LG V20- still chewing on maybe doing that instead.  Thanks!", "time": "23rd April 2017, 02:57 AM", "postID": "post71986834", "replies": []}]}, {"text": "Oled has better blacks but G6 is respectable and the G6 looks better on everything else It all a matter of preference.  Was at Best Buy today and played again with the S8 and in no way felt the S8 was better.  G6 was more fluid and the screen whites just seal the deal.  The note 5 I had needed root to get a better phone experience on the other hand LG has done it right out of the box and is a pleasure to use. Root is not needed to enjoy the G6.\nAnother note holding the S8 it just feels cheap where the G6 feels like money well spent. I purchased mine off Ebay new in box for 450.00. I consider it a steal at tjat price.", "time": "23rd April 2017, 08:06 PM", "postID": "post71998207", "replies": []}, {"text": "When I first got the LG G6 I wasn't terribly happy with it at first considering they removed one of my favorite features the IR blaster, and a few other things but I realize I guess I was more or less avoiding change. Now that I warmed up to the phone and also compared it to the S8 I'm definitely glad I stuck with LG. My battery life is definitely Superior to most of the phones I've had in the past I'm able to get almost a full day out of it was very heavy use and most of my features like location and Bluetooth on. As far as the design of the phone it is definitely a sturdy and sleek-looking phone. I do have issues with the Bluetooth app force closing a lot and I don't enjoy having the volume buttons on the side again. I keep turning off my screen when I instinctively go to turn up the volume. But with that being said the S8 does not have the remote feature on it and the speaker location is in the exact same spot meaning I'll cover it with my phone sideways on either phones. I did get a case and that has helped. Another thing that I like about the LG G6 is the location for the power and fingerprint reader is place in a very good spot and feels natural when turning it on and off. I can't wait for a route to come for custom kernels and ROMs but if it's anything like the G4 that may or may not ever happen. I've had the LG G3 G4 and now the G6 and I can definitely say I'm glad I'm sticking with LG and I feel some of my first reviews on it work bias based off of me wanting it to be like my old phone.", "time": "24th April 2017, 05:19 PM", "postID": "post72011131", "replies": []}, {"text": "Great phone, snappy, all the features I really want, and no gimmicky curved screen.  Side by side with the S8, this is the winner.  Always had samsungs notes 2,3,4,5,(rip7)- and thought I was scared of LCD for no reason.", "time": "9th May 2017, 08:23 PM", "postID": "post72230939", "replies": []}, {"text": "I purchased a LG G6 from AT&T a week ago.  My experience was horrible.  The phone was very laggy, more than any phone I've used in a long time. I have heard that some of the carrier G6's have this problem but the unlocked versions are very snappy. Have any of you guys experienced any poor performance with the G6?  The reason I ask is because I may buy the unlocked version from B&H if the performance is good.  Thanks", "time": "17th May 2017, 03:59 AM", "postID": "post72321866", "replies": []}, {"text": "I spent 2 weeks with a s8+ before taking it back and getting a G6. Reasons? \nI like the G6 display better. Displays are subjective so to me the color balance and accuracy on the G6 is superior to the s8.  Also, I can use white based themes with out thinking, OMG I'm killing my battery lol. \n\nCameras seemed pretty lateral. Both great shooters, so adding in wide angle gives the G6 the edge. \n\nProtection. I have to use a screen protector and case. My work would destroy my phone's if I didn't. It's all but impossible to really protect the s8. The screen makes it very difficult unless you go LifeProof. \n\nAs for battery, the s8+ crushed anything I ever owned on battery. Yes, it's that good. 8 to 10 hours real sot. It was amazing. I miss that. \n\nSoftware. It's nice to use software not competing with the software. LG embraces Google as Sammy tries to compete with it. Bixby? Really? The dedicated button no body asked for\n\nOver all I'm super happy with the G6. Feels great in the hand. Looks great and performs.", "time": "19th May 2017, 06:00 AM", "postID": "post72348268", "replies": []}, {"text": "Sad that the battery is only 3300mah. We wouldn't care if the phone was just a little bit thinker. What's with in the race of making phones thinner anyways? If it's a Trend then by-god help us All", "time": "23rd May 2017, 04:24 PM", "postID": "post72402631", "replies": []}, {"text": "I'm coming from G3 after it served me for 3 years. I love my G3 so I give it to my father in law to keep him alive... haha\n\nI just got my G6 today and so far after I'm using it for this fullday,, I'm happy with it. It gives me same feeling when I got my G3 3 years ago, even better I think. Battery life improved a lot (I suggest to update it software directly and hard rest the phone). No more heating problem since G3 was heating a lot (but I still love it).\n\nSo far my final review after using it today is :\namazing display\nblazing fast user experience\ngood battery life (I'm moderate user with only chatting, browsing, social media, and music freak)\nQuadDAC is also great feature for me.. it feels like upgrading my office speaker into expensive ones\nAnd the last one is its reasonable price, only around 500$ (I'm from Indonesia, and local guarantee mobile phone here is very expensive) has like 350$ difference with the mighty S8\n\nI think I will have another happy 3 years ahead with LG again", "time": "16th November 2017, 02:37 PM", "postID": "post74534864", "replies": [{"text": "It is great that you like it. I think its the main thing that you happy with your new phone. I have a new one too and I like my One Plus 5T a lot.", "time": "5th April 2018, 10:01 AM", "postID": "post76130008", "replies": []}]}, {"text": "Hi all,\r\nI just want to give my experience with the G6 so far.\r\nI have it since april and have transitioned from an G3.\r\nDesign and build quality: really an exeptional phone. Till now, iPhone4 was, IMHO the best ever built phone (too bad I really dislike iOS), that combination of glass and aluminum.. Now, iPhone 4 comes in second, LG G6 comes first.\r\nDisplay: since I had G3, actually, except for size and proportions, it's nothing special because G3 had an awesome display. Btw I like LCDs more than OLEDs because I don't like that yellowish hue and cartoonish colours.\r\nUser interface and overall UI:  Good, doesn't lag, intuitive, overall satisfiing.\r\nBattery: good, from 5 to 15 hours of bat time depending of use.\r\nCamera: well, the only awesome thing about this is the wide angle camera. There are just some things that only a wide lens can capture, and I personally like the wide angle look. \r\nAnd that concludes what I like about the g6.\r\nStandard rear camera is just OK, takes a lot to autofocus, when you use the shortcut to open it it really does open fast bit takes sometimes up to 3 seconds to take a picture and sometimes picture doesn't even get saved.\r\nAt low light it's just crap. I'm sorry to say that in these days even a calculator makes good pictures in abundance of light. Autofocus lags, then takes ages to snap a photo and when it does everything is blurry. Flash doesn't help because it makes everything bluish and again a bit blurry. I bought this phone mainly for it's camera and because I watched a lot of reviews and it looked really good bit no one made a real life test which consists of 3 steps: seeing something interesting, getting your phone and snapping a pic, and not in perfect conditions. Static or on a tripod, and then zooming in and comparing the microns, that's not real life.\r\nI tried pixels ported camera app.. It's sometimes a bit betterb that's all.\r\nSelfie camera: nothing good about it, wide angle, noisy, bad aperture and anything less than 100% perfect conditions produces very bad photos. I'm so sorry to say that but Samsung S7 makes better photos, a 1 year older phone. \r\nI defended the colours of LG for almost 3 years but now I get to see that LG hates Europeans. No quad DAC, no wireless charging (my G3 had it) and the headphones are a 5€ POS and G6 is (was) most expensive in Europe.\r\nI want to love this phone but to say it's a \"flagship phone\" is an exageration and I think it is the last LG I own. I'll probably buy an S7 (because G6 value drops so rapidly it's almost funny) and with all of it's quirks and yellow display enjoy at least in a good snapper.  :-/ Perhaps if I save a bit could buy a Pixel.", "time": "17th November 2017, 08:47 PM", "postID": "post74548865", "replies": [{"text": "It looks like we're lucky with the G6-- supposedly the V30 camera has even worse low light performance. And the v30 is an expensive phone.", "time": "11th December 2017, 04:52 PM", "postID": "post74811915", "replies": []}]}, {"text": "Hi all,\nI was thinking to get a Samsung S7 or LG G6, just because both have a flat screen surface. I am no fan of the Samsung Edge screen. S7 is cheaper but 1 year older. The significant points for consideration are photo quality (main camera), design, dual sim support and a few other smaller things. \n\nIn the end I chose LG G6 and one of the main reason, it supported the Google Camera. S7 from my region has the Exynos chipset so not possible for the Google Camera apk to be sideloaded. Also need to mention the bigger capacity 64 GB vs 32 GB and the new display form (latest design). Price different is only $50 (S7 is cheaper) so no more Starbuck for me for the next 10 days.\n\nSo far I am really happy with my decision.", "time": "11th December 2017, 07:52 AM", "postID": "post74806935", "replies": []}, {"text": "Loving the waterproofness of the G6! Sure, it's not recommended to try it in the ocean or the swimming pool, but just for cleaning the phone under the tap when it gets too dirty or taking some underwater shots in clean water, it's a killer feature to have!", "time": "24th February 2018, 03:56 PM", "postID": "post75679830", "replies": []}]}, {"title": "Community development strength", "rating": 2.5, "links": ["https://forum.xda-developers.com/lg-g6/review/community-development-strength-t3573451", "https://forum.xda-developers.com/lg-g6/review/community-development-strength-t3573451/page2"], "threads": [{"text": "I think this being the only response in 7 weeks says it all, at least as far as development progress (or lack of). \nI don't have a G6 yet, I get it later this morning. I've read most of the threads here and dozens of reviews over the past 2 weeks and Im still not sure what to expect.\nIve also been interested in the V20 but even though it was released over 6 months ago there's still not much development regarding root, custom ROMs etc.. Because of that and other incidental info I've gleaned it seems LG devices  are harder to crack. It doesn't help that LG decide not to release particular models in the UK / Europe. \nIve been with my Xperia Z2 for just on 3 years now and for the first two of those the XDA forum was buzzing with development. There's less activity now as people upgrade to newer devices, but there's still more development happening than there is here and the V20 forum. \nBut I'm looking forward to trying the G6, I think the first few hours will help me decide if I want to to keep it or sell it on and consider either the V20 or Xperia XZ. \nNo doubt I'll be back posting in this forum pretty soon....", "time": "5th May 2017, 03:13 AM", "postID": "post72167542", "replies": []}, {"text": "I had my G6 for an hour before swapping for it for a week old as-new V20 c/w LG Quick Cover and £150 cash \n\r\nAs beautiful as the G6 is it just wasn't for me. I didn't like the glass back, purely as I think even wearing a decent case it will be very vulnerable if dropped. \r\nSo I've been using the V20 just over a day and so far I'm really happy with my choice. \r\nIt's the H990ds Taiwan model, Titan (dark grey) and is an incredibly well built phone.", "time": "8th May 2017, 05:54 AM", "postID": "post72207971", "replies": []}, {"text": "People are working towards root right now, I am following it on hangouts. Looks like the T-Mobile variant is the only one who will get it for a while, as it is the only one with an unlockable bootloader.", "time": "8th May 2017, 06:41 PM", "postID": "post72216169", "replies": [{"text": "How do you follow it on hangouts?", "time": "8th May 2017, 07:39 PM", "postID": "post72216893", "replies": [{"text": "May I also join the discussion?", "time": "9th May 2017, 05:36 AM", "postID": "post72221703", "replies": []}]}, {"text": "Yeah, I'd like to join the Hangout", "time": "8th May 2017, 07:58 PM", "postID": "post72217129", "replies": []}]}, {"text": "I'm with T-Mobile and would get the G6 in a heartbeat if root and possible recovery come. Imagine CM14.1 / Lineage OS wow", "time": "8th May 2017, 08:37 PM", "postID": "post72217610", "replies": []}, {"text": "Just be patient. \n\nIt will come support for custom ROMs and the availability to successfully root for the G6. Same was with the G2 few years ago or the G5 last year. \n\nhttps://forum.xda-developers.com/sho....php?t=3361309\n\n\n\nGesendet von meinem LG-D802 mit Tapatalk", "time": "20th May 2017, 06:23 PM", "postID": "post72367860", "replies": []}, {"text": "i hope Root in H870 version u.u", "time": "28th May 2017, 06:25 PM", "postID": "post72464060", "replies": []}, {"text": "any word on custom ROMs? The unofficial LineageOS ROM thread was closed.\nTWRP is fully functional now (please correct me if I'm wrong).\n\nEdit: Sorry if I'm rude! I just read the development thread in the g5 forum", "time": "5th July 2017, 08:21 AM", "postID": "post72912827", "replies": []}, {"text": "What variant I buy that I have best development and importantly root?", "time": "14th October 2017, 10:11 AM", "postID": "post74151409", "replies": [{"text": "European H870 or US997 carrier free\n\nInviato dal mio LG-H870 utilizzando Tapatalk", "time": "15th October 2017, 08:44 AM", "postID": "post74163144", "replies": [{"text": "Thanks mate, hope I find them.", "time": "16th October 2017, 10:41 AM", "postID": "post74176794", "replies": []}]}]}]}, {"title": "Overall speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-g6/review/overall-speed-t3573452"], "threads": [{"text": "Top notch...but still it could have SD835....", "time": "4th June 2017, 06:12 AM", "postID": "post72541282", "replies": []}, {"text": "Mines fast, 2 things that really make people feel they have a slow phone.. 1. Always closing background apps. This truly shows the phone down cause the phone has to reopen every app every time they use it if they \"close all\" like most do to conserve battery life. In reality leaving them open speeds up the phone and saves battery life since phone doesn't have to speed the extra power to relaunch the app it just pulls it back up from being \"minimised\"  2. People that use stock launchers and don't change the animation scale in dev options.  I'd like to actually add a 3rd. Connection speed truly does slow the phone down too. Lot of people confuse ann app not fully loading or a browser being slow. With that being the phones fault when I turn 1/2 the time it's from slow connection speeds.", "time": "8th June 2017, 08:09 AM", "postID": "post72591931", "replies": []}]}, {"title": "App launch speed", "rating": 4.0, "links": ["https://forum.xda-developers.com/lg-g6/review/app-launch-speed-t3573453"], "threads": [{"text": "Everything I've launched opens blazingly fast, and I have over 400 apps installed already. (copied a lot of my other stuff from my other phone over to it. OH, and I did it with LG Backup / LG Mobile Switch which worked much quicker than expected. Even the installations of the apps was almost instant each... well except really big apps/games, but those still took no time compared to my older phones.", "time": "4th April 2017, 01:49 PM", "postID": "post71721953", "replies": [{"text": "You used Lg Backup and Switch to copy apps because you already had an Lg phone or does it work with other brands?", "time": "22nd April 2017, 02:15 PM", "postID": "post71978305", "replies": []}, {"text": "Was going to use this LG software to backup my Sprint LG G6 phone on my computer. Software installed on computer properly. Couldn't get it to work as software wouldn't recognize USB connection. Samsung support said software only works with Win 10. Nothing on their website says anything about this restriction. Just FYI...", "time": "5th November 2017, 01:22 PM", "postID": "post74413899", "replies": []}]}, {"text": "Unfortunately I had to Rate one star. The basic feature of adding a 2nd google account to google apps, freezes the phone and crashes. Without Root, on a verizon locked bootloader I will be unable to fix the problem. Looks like I need to return, and consider the Pixel or purchase a MXPE.", "time": "17th April 2017, 04:18 PM", "postID": "post71899525", "replies": []}, {"text": "I copied from my LG-G2 to my LG-G5 via the WiFi option. I'm not sure if it'll work with other phones, but I'd think it was LG specific.", "time": "22nd April 2017, 03:55 PM", "postID": "post71979655", "replies": []}, {"text": "Yeah probably.\nI don't know of anything else than Titanium Backup on rooted phones to get every apps exactly like they were from a phone to another.", "time": "22nd April 2017, 09:18 PM", "postID": "post71983960", "replies": []}, {"text": "There is a 1-2 second lag after tapping an app icon and time to get launched", "time": "5th November 2017, 12:45 PM", "postID": "post74413581", "replies": []}]}, {"title": "Multitasking/RAM", "rating": 4.0, "links": ["https://forum.xda-developers.com/lg-g6/review/multitasking-ram-t3573454", "https://forum.xda-developers.com/lg-g6/review/multitasking-ram-t3573454/page2", "https://forum.xda-developers.com/lg-g6/review/multitasking-ram-t3573454/page3"], "threads": [{"text": "I've run over 30 apps at once and it swaps between them instantly without lag.  No issues whatsoever doing what I want how I want on this phone.", "time": "4th April 2017, 02:39 PM", "postID": "post71722599", "replies": []}, {"text": "I'm not sure if anyone is getting this same error, but it keeps saying that I don't have enough memory to play videos. Never seen this error on any other LG phone that I have owned in the past. http://imgur.com/waldOvw", "time": "7th April 2017, 03:36 AM", "postID": "post71758950", "replies": []}, {"text": "my RAM went down to only 1gb free... how is this possible", "time": "8th April 2017, 07:13 PM", "postID": "post71780870", "replies": [{"text": "More ram used is better on Android. Most 4GB phones run with around 1 to 1.5GB free. Android caches your app data to improve loading times. Having more free ram actually hurts you. Androids memory management isn't like Windows for example.\n\n\nThis phone is an absolute dream for multitasking lol.", "time": "9th April 2017, 03:49 AM", "postID": "post71784736", "replies": []}, {"text": "Free RAM is useless RAM\n\n---------- Post added at 09:20 AM ---------- Previous post was at 09:19 AM ----------\n\n\n\r\nI don't have that.", "time": "12th May 2017, 02:20 PM", "postID": "post72266290", "replies": []}]}, {"text": "Is this phone overly aggressive on memory management?  I keep seeing times when either overnight or even just not using the phone for like an hour, I suddenly only have 3 apps in my recent apps list and not the 6 or 8 I had been using.  Which is just baffling to me as I never saw this on my old Galaxy S6.  With 4GB of ram, this phone should not be needing to dump apps out on its own like this so much.", "time": "10th April 2017, 03:52 PM", "postID": "post71804464", "replies": []}, {"text": "That's odd. Everything I have running stays running with no issues other than the stuff I have set to auto-close, via Greenify.", "time": "10th April 2017, 07:34 PM", "postID": "post71807156", "replies": []}, {"text": "I thought with Android 7 the need for Greenify disappeared?", "time": "22nd April 2017, 02:16 PM", "postID": "post71978330", "replies": []}, {"text": "The multitasking is great but there's one glaring design flaw. When you have an app open and you open the notification drawer you get this round button at the bottom to change app scaling. This is great until you want to type a reply in the notification drawer.\n\nThe scaling button stands on top of your keyboard making it impossible to type anything without constantly having to move the button out of the way. The button is locked to the bottom so you can only move it left and right. Thankfully it only appears on certain apps like games.", "time": "10th May 2017, 09:43 AM", "postID": "post72237136", "replies": []}, {"text": "just go into the 'secret menu'... *#546368#*870# (for the H870 model) open SMC menu and go to the bottom and select force long display, and change it to true, then the app scaling reminder/option will (should) stop. While there disable LDB (LG's 24/7 tracking software) frees up a lot of memory and helps battery to.", "time": "12th May 2017, 01:13 PM", "postID": "post72265535", "replies": []}, {"text": "The function of LDB (MLT) is well known, you can Google it.", "time": "13th May 2017, 07:22 AM", "postID": "post72274706", "replies": []}, {"text": "Yes disabling it definitely adds a bit more zing to performance not to mention better battery.", "time": "14th May 2017, 06:41 AM", "postID": "post72285774", "replies": []}, {"text": "Also never forever about developer options and animation scale. I always run mine at .5 sadly zero never works for me but I use nova launcher and its \"faster than light\" seething. Forget animation make it faster..also hopefully everyone knows about double tapping the recent apps button and you can quickly swap between the last app you were in and the one you're currently in. Much faster than selecting it from the list", "time": "15th May 2017, 07:19 AM", "postID": "post72297817", "replies": []}, {"text": "thanks for the info bro.", "time": "6th November 2017, 05:36 AM", "postID": "post74421116", "replies": []}, {"text": "When i lock the screen apps using internet (like chrome, amazon...) are killed immediatly from ram and I have to launch them again. Is there any option to change or something I can do?", "time": "22nd November 2017, 10:22 PM", "postID": "post74604358", "replies": [{"text": "Try this:\nGo to settings, battery and power saving, battery usage and ignore optimizations, then choose the app you want working even when screen is off\n\nInviato dal mio LG-H870 utilizzando Tapatalk", "time": "23rd November 2017, 09:38 AM", "postID": "post74608296", "replies": []}]}]}, {"title": "Scrolling smoothness", "rating": 4.0, "links": ["https://forum.xda-developers.com/lg-g6/review/scrolling-smoothness-t3573455", "https://forum.xda-developers.com/lg-g6/review/scrolling-smoothness-t3573455/page2"], "threads": [{"text": "Terrible scrolling! My kindle fire 7 rooted has better scrolling. Unbelievable a flagship phone performs like this.", "time": "26th May 2017, 03:09 PM", "postID": "post72438462", "replies": []}, {"text": "Scrolling and all around performance is excellent on my G6. No complaints at all.", "time": "26th May 2017, 03:37 PM", "postID": "post72438757", "replies": []}, {"text": "Can you make a video?", "time": "26th May 2017, 04:35 PM", "postID": "post72439371", "replies": [{"text": "But you ain't seen his girlfriend yet", "time": "26th May 2017, 07:31 PM", "postID": "post72441291", "replies": []}]}, {"text": "My Lenovo P2 has smoother scrolling than this. It has Snapdragon 625 and costs $300.", "time": "6th June 2017, 07:39 PM", "postID": "post72572991", "replies": []}, {"text": "I am having the scroll lag issues since I got my G6. I have factory reset it multiple times. No gain. I have enabled Forced GPU rendering to no avail. I disabled HW overlays but gets disabled automatically. I don't know whats wrong here. Other than this scrolling issue, I am very happy with this phone.", "time": "16th June 2017, 08:01 PM", "postID": "post72698341", "replies": [{"text": "I guess you are mentioning about the Google Chrome scrolling lag? Try Ad Blocker to remove the ads, A Snapdragon 821 device like the LG G6 , One Plus 3T or the Google Pixel offers smooth performance without any kind of micro stutter. LG G6 is surprising smoother than the newer Snapdragon 835 or the Exynos 8895 device Galaxy S8!", "time": "17th June 2017, 06:09 PM", "postID": "post72708687", "replies": [{"text": "Thank you for your response. No, I am not taking about just Google Chrome. Its almost every app where there is some kinda scrolling. Examples include chrome, Firefox, Facebook, 9gag, Reddit, even XDA. Its everywhere man. Also, I do have adblocker installed.", "time": "17th June 2017, 07:36 PM", "postID": "post72709496", "replies": []}]}]}, {"text": "Mine scrolls pretty, pretty smoothly in all those apps and using Adguard. There might be a problem with yours...", "time": "17th June 2017, 08:59 PM", "postID": "post72710225", "replies": []}, {"text": "I've got no scrolling issues at all. Wanna test scrolling download 9gag and enable scroll with volume keys. Hold down on the volume key.  Truly there's no lag at all in my phone. Maybe, just maybe some scroll blur which is nothing to not expect. But truly no lag.", "time": "18th June 2017, 01:52 AM", "postID": "post72712128", "replies": []}, {"text": "Always having problem with this phone. My Galaxy S6 was much smoother overall, no single stutter in comparison with my new G6. Basically with the G6 I came back to the days of LG G3, still the same software experience.", "time": "12th December 2017, 04:42 PM", "postID": "post74823746", "replies": []}]}, {"title": "Heat", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-g6/review/heat-t3573456", "https://forum.xda-developers.com/lg-g6/review/heat-t3573456/page2"], "threads": [{"text": "Basically non-existant even with heavy use. Most of the heater is at the top of the phone. LG put heat pipes that attach to the battery so it's likely this is what reduces the heat substantially.", "time": "30th March 2017, 05:05 AM", "postID": "post71645436", "replies": []}, {"text": "I have never had a phone that would not get heat under extensive use, heck even my computers do that. People have to be realistic about such a measure and understand how much processing power is being used in a tiny compartment. If you run an engine in a sealed box with very little venting in comparison to running an engine in the open... it's GOING TO GET HOT. People need to understand this and be more realistic when looking for a phone that they think will be ice cold at all times.", "time": "4th April 2017, 01:48 PM", "postID": "post71721932", "replies": []}, {"text": "The phone does stay cool. I have tried the samsung galaxy S7 Edge snapdragon and it just is terrible once it gets hot. That is important for performance.", "time": "17th April 2017, 04:19 PM", "postID": "post71899542", "replies": []}, {"text": "It deals with heat much better than a lot of phones. The LG G3 was a much worse offender and overheating even caused some hardware problems for me with that phone. The G6 really isn't bad at all.", "time": "18th April 2017, 04:07 PM", "postID": "post71914750", "replies": []}, {"text": "Battery died after 14 hours of of google maps, streaming music over bluetooth and recording videos. just before dieing, the Clean Master app showed the cpu tempurature at 42 degrees, with one of those clear otterbox cases on. With the Otterbox off the cpu sits about 32 degrees with med-heavy use", "time": "23rd April 2017, 03:17 PM", "postID": "post71994266", "replies": []}, {"text": "Well, of you try Antutu, the second time you will obtain 100k points and nor 150k as usual.\r\nAnd the phone becaumes very hot.\r\nOp3T with same processor didn't do it", "time": "24th April 2017, 05:56 PM", "postID": "post72011734", "replies": []}, {"text": "Hi my CPU runs at 35-36 Deg at idle time when. do some simple tasks such as browsing our watching YouTube it hits 40 Deg and while playing games it goes to 43 Deg that's the max I've seen in the device. I monitor the temperature using the cpu temperature app. I also get a poor SOT of 4 hours max, IDLE Time and to draw too much power", "time": "29th June 2017, 05:33 PM", "postID": "post72849898", "replies": []}, {"text": "A weird thing is happening with my mobile for the past 2 days. my phone never went beyond 36C even when I use it in direct sunlight sometimes. and my phone felt warm only when i used it in direct sunlight. otherwise no matter what the temperature, my phone stayed very lil warm. from Day before yestrday , during my travel, or when idle. the phone starts at 26-28C, and suddenly raises upto 33. and today it set a all time high going till 39C and the phone felt pretty much warm even when there was no sunlight and the ambient temperature throughout my travel stayed at 25C. i was just seeing youtube videos, for which my phonw never even got a bit warm, today it was high. and even unlocking and replying in fb messenger gets it to 36-37C. what suddenly happened to my Mobile. I'm pretty much mobile. for something which never crossed 36 suddnely going near 40 and feels pretty warm to touch.\n\nJUST COPY PASTING SO THAT SOMEONE COULD HELP ME", "time": "1st February 2018, 07:42 AM", "postID": "post75405507", "replies": [{"text": "Network reception problems / something running heavily in the background / an app was updated and now causing increased CPU usage / phone running too long without a reboot.\n\r\nFirst of all, have you tried rebooting the phone?", "time": "1st February 2018, 12:37 PM", "postID": "post75408064", "replies": [{"text": "Guess I did that yesterday and let's see. so you're suggesting the phone should be rebooted once in while? if so the frequency! \r\nand network recetion, I travel through the same route everyday, so the network pretty much remains the same.. and I was usingFB Messenger, how can i know which app is running in the background. and updates, was configured to run only on Wifi, I was on mobile data, so no updates were going on  thanks for the response though. Kindly help me, coz this is driving me crazy, this is one helluva awesome phone so I don't want it to go crazy too", "time": "2nd February 2018, 06:15 AM", "postID": "post75417312", "replies": []}]}]}, {"text": "Does anyone else's G6 warm up when using the cameras? It stays cool most of the time but once you switch on the camera and take 1-2 photos, it starts warming up. The battery also starts dropping faster. This isn't too bad with the LG app but it gets noticeably warm with the Google Camera app. Is this normal? Going to buy the Spigen case for it so not sure if it will help with the heat dissipation.\n\nThe battery dropping faster also worries me if the phone can be used as a main camera on a trip.", "time": "6th February 2018, 06:27 PM", "postID": "post75469863", "replies": []}, {"text": "Bro sry to disturb you.. My device is connecting as unauthorized. Tried all possibilities. Still unauthorized and cant connect 😞", "time": "7th February 2018, 02:33 AM", "postID": "post75473501", "replies": []}, {"text": "Do you have ADB enabled in developer settings?\n\nInviato dal mio LG-H870 utilizzando Tapatalk", "time": "7th February 2018, 08:44 AM", "postID": "post75475928", "replies": [{"text": "Android Services.\r\nmusic streaming app.\n\r\n both are the top consumption.. but still worried about this. I travel. noapps in background. heat automatically raises for nothing", "time": "9th February 2018, 04:59 PM", "postID": "post75504612", "replies": []}]}]}, {"title": "Low light", "rating": 3.5, "links": ["https://forum.xda-developers.com/lg-g6/review/low-light-t3573457"], "threads": [{"text": "Does fairly well in low light. There is some grain, but depending on how zoomed in you are, it's not incredibly noticeable. Likely down to ISO settings.", "time": "30th March 2017, 04:54 AM", "postID": "post71645359", "replies": []}, {"text": "Handles objects in low light reasonably well though it can be a bit noisy from the ISO setting.  People, however, don't look right in low light (overprocessing of their skin makes them look like an oil painting), and it doesn't handle motion in low light well at all.  I have much better results using manual mode in low light, however, so I believe this is a software issue with the auto mode.  If anyone else is having better experience than I am with low light people and movement, I'd love to hear what you're doing differently.", "time": "4th April 2017, 04:47 PM", "postID": "post71724500", "replies": []}, {"text": "this is what it looks like zoomed in. It's ****. 1/5", "time": "24th August 2017, 06:44 PM", "postID": "post73526414", "replies": []}, {"text": "yes but what is your iso? were you using digital zoom? etc\r\n see pic below 50% crop at iso 2700, its an excellent result from any phone cam at such a high iso.", "time": "25th August 2017, 08:12 AM", "postID": "post73532391", "replies": []}]}, {"title": "Photo quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/lg-g6/review/photo-quality-t3573458", "https://forum.xda-developers.com/lg-g6/review/photo-quality-t3573458/page2", "https://forum.xda-developers.com/lg-g6/review/photo-quality-t3573458/page3", "https://forum.xda-developers.com/lg-g6/review/photo-quality-t3573458/page28"], "threads": [{"text": "This camera is amazing. Sometimes the LG camera gets the white point a little off. For example, if you're in a restaurant with a lot of red lamps, it may read as a warmer setting. This is something that can be adjusted manually (and easily fixed in an image editor)\n\r\nI feel like some of the details are \"smoothed\" out, but I don't know if that has to do with the camera as much as the app. It's not necessarily bad. If you take micro shots, it's more noticeable, this smoothing effect. It may be a setting in the camera... if you want crisp shots, it's certainly feasible. For example, I was taking up close shots of the fabric of the clothes I am wearing. However, sometimes it is hard to get the camera app to focus on the right thing. It's worse the closer you are to the subject. However it can definitely focus up-close with the non-wide angle camera, though I think a bit less than my Samsung S5 used to be able to do. If you need textures for graphic design work, it's definitely feasible though.", "time": "30th March 2017, 04:57 AM", "postID": "post71645385", "replies": []}, {"text": "Camera does do some heavy post processing. You can tell when you zoom in. \n\nFirst Picture is using Stock Camera Auto Mode\n\n\n2nd Picture is using OpenCamera Camera2 API Auto Mode\n\n\n3rd Picture is using RAW OpenCamera Camera2 API Auto Mode", "time": "24th April 2017, 07:12 PM", "postID": "post72012882", "replies": []}, {"text": "I think the wide angle is garbage for landscape shots. Click on photo and zoom in a bit you'll install see what I'm talking about. I love wide angle for closer you shots though. 2nd photo of fire is really just to show why u love the manual settings.", "time": "25th April 2017, 06:53 AM", "postID": "post72019722", "replies": []}, {"text": "Does anyone use any other camera application to unlock the full potential of this camera? coming from the Galaxy s6 edge, I really liked their camera application and was easy to access the more advanced settings (iso, exposure, ect...) this camera allows that but it makes it very difficult and is overly complicated when those settings are finally available.", "time": "26th April 2017, 11:05 PM", "postID": "post72047173", "replies": [{"text": "Using a camera app other than LG's own stock camera app will most likely result in poorer quality images. LG specifically optimizes their app to take advantage of the phone's hardware to the fullest potential. \nThus why if you ever flash a non-stock-based ROM, you will find that your camera is just not as good as before.", "time": "26th April 2017, 11:44 PM", "postID": "post72047520", "replies": []}, {"text": "The manual option gets easier when you figure out how to use it.. You'll be able to get some great pics with it.", "time": "27th April 2017, 05:28 PM", "postID": "post72057746", "replies": []}]}, {"text": "Someone should do some guide  with best settings.", "time": "27th April 2017, 05:40 PM", "postID": "post72057911", "replies": []}, {"text": "There's some guides on YouTube for the V20.. It's the exact same concept", "time": "27th April 2017, 05:42 PM", "postID": "post72057944", "replies": []}, {"text": "Thanks, i will check it, its my first LG after years with Samsung.", "time": "27th April 2017, 05:43 PM", "postID": "post72057970", "replies": []}, {"text": "this one is pretty in-depth..\n\nhttps://www.youtube.com/watch?v=MQ82z1E92NU&t=2s", "time": "27th April 2017, 05:48 PM", "postID": "post72058032", "replies": []}, {"text": "Yeah... other then the stock App. for Camera results in lower quality photos like when i use the Z-Camera App. which is great for Editing but other then that use stock", "time": "27th April 2017, 09:42 PM", "postID": "post72060915", "replies": []}, {"text": "I really like the camera, feels like an upgrade from G5, but too bad there's no 13mp 16-9 mode", "time": "29th April 2017, 12:47 PM", "postID": "post72088531", "replies": [{"text": "Yeah, the full resolution isn't cropped like the 16:9 one.. You can open it in an app and do the cropping yourself.", "time": "30th April 2017, 08:00 AM", "postID": "post72098419", "replies": []}]}, {"text": "Why is nobody here talking about the front camera? The rear camera has a horrible oversharpening effect and the front camera is plain trash (normal & wide both). What I further do not understand is why the 13MP mode doesn't have a 16:9 or 18:9 ratio. Clicking pictures in 4:3 on this already narrower display is a mediocre experience. With the G6 camera being ported to the G4 already, I do not find a single advantage having the G6 over G4 for still photography (both manual & auto). Why are people being irrational and praising a sub-par camera setup on the G6?\n\nI just got my Indian G6 (64GB & Quad-DAC). I am coming from an LG G4 (H818N) and I haven't been impressed by the cameras. The display on the G6 is better, the design & ergonomics are better, the build quality is exceptional too. But if you have used a G4 or an S7e or an iPhone 7, you will not like the cameras on this one.\n\n\nFor anyone reading this who is out to buy a new device, if you prefer a good smartphone camera you will be let down. Go for a Pixel or S7e or S8/S8+ for better camera performance.", "time": "29th April 2017, 01:10 PM", "postID": "post72088775", "replies": [{"text": "I have a Xiaomi Mi5 too. What I did notice for sure is that the Mi5's front camera is way better that the one on the G6. Also, the back one seems better on low light conditions. The one on the G6 seems to \"lag\" in stand-by mode. On the G6 : the main camera is having exposure and saturation issues, the wide angle one has oversharpening issues. I don't know what everyone are praising about... I sure hope they will fix some issues with the next updates.\r\nI kinda feel sorry I didn't chose the S7 Edge.", "time": "29th April 2017, 06:54 PM", "postID": "post72092735", "replies": [{"text": "You are still talking about a recently launched device. The G6 front camera is worse than my good old G2 and S4. I have a Oneplus 3 in my house whose front camera is way better than this S#! T on G6. How I wish we had return policies here in India. Very disappointed. I am done with LG atleast for this life time! 😑", "time": "29th April 2017, 10:49 PM", "postID": "post72094872", "replies": []}]}]}, {"text": "Hmm. I'm getting a little confused. I was considering buying the Huawei p10, because I want to use my mobile more, for taking pictures. Then the LG G6 is on a discount, making the G6 almost as cheap as a Huawei p10. And some reviewers says that the G6 camera is better than the P10 also in low light.", "time": "30th April 2017, 04:44 PM", "postID": "post72103879", "replies": [{"text": "If you do not care about the front camera, the G6 is probably the best phone for you. But if you do care about the selfies and also want exceptional quality stills, I'd suggest going with the Pixel or Pixel XL.", "time": "30th April 2017, 06:20 PM", "postID": "post72105055", "replies": []}]}, {"text": "I would like to know how to get the best low light pictures using manual settings.", "time": "1st May 2017, 12:47 PM", "postID": "post72115079", "replies": []}, {"text": "pretty sure that people complaining about photo quality don't know how to take good pictures.", "time": "1st May 2017, 02:46 PM", "postID": "post72116541", "replies": []}, {"text": "I was adamant I'd go P10 Plus after playing with one at MWC. Then I fell in love wit the LG G6, no I want the S8 but am still feeling drawn back to the G6 simply for that wide angle camera.\n\nCan anyone put up some night shots of starts/astrophotography style shots? I really want to see what they look like as that's a big thing for me.", "time": "2nd May 2017, 03:56 PM", "postID": "post72132100", "replies": []}, {"text": "I must admit, day1 with my G6 and I want to return it, the wide angle camera is terrible, image quality is like cameras used to have 10 years ago with it, even when shooting in RAW/manual mode, such a terrible camera.", "time": "2nd May 2017, 04:50 PM", "postID": "post72132907", "replies": [{"text": "just remember with that wide an angle and only 13mp your resolution and detail will be less, with that taken into account the IQ is as good as you'll get from a 13mp with and ultra wide FOV.", "time": "4th May 2017, 08:17 AM", "postID": "post72155921", "replies": []}, {"text": "I would have to agree with that statement as well..  After, pretty extensively, messing around with auto and manual modes, it really does seem like this camera is 10 years old.  The pictures are grainy, it rarely clearly focuses on the source, even in low and high light situations and the pictures just aren't as good as some of the other phones that I have used.", "time": "9th May 2017, 02:35 PM", "postID": "post72226636", "replies": []}]}, {"text": "grand w\n\n---------- Post added at 12:31 PM ---------- Previous post was at 12:29 PM ----------\n\nwe bought similar one here at https://kase.com/collections/s8 . They are still doing promotion where Free one case per order.\n\nIn my opinion its great in quality and different from other cheap case. Will post some photo shortly", "time": "3rd May 2017, 01:31 PM", "postID": "post72144541", "replies": []}, {"text": "I'd take the gs7 camera over this one sadly. The wide angle is epic as long as you know, you don't zoom or ever plan to print one", "time": "11th May 2017, 01:27 AM", "postID": "post72247098", "replies": []}, {"text": "has anyone tried to capture raw (DNG) photos with any app, like lightroom mobile, manual camera etc ?\n\nAll the raw photos has a purple hue, that i cant correct afterwards.... can you try it please ?", "time": "11th May 2017, 01:18 PM", "postID": "post72252432", "replies": []}, {"text": "The back cameras are pretty stellar, but I just find the front selfie camera to be terrible. No detail in the shots at all. I believe the G5 had 8MP and they downgraded to 5MP on the G6... My 6P takes much better selfie shots.", "time": "11th May 2017, 07:48 PM", "postID": "post72257058", "replies": []}, {"text": "https://share-your-photo.com/bb269cc2c7\nhttps://share-your-photo.com/03f44eb25e", "time": "7th March 2018, 12:53 PM", "postID": "post75803757", "replies": []}, {"text": "Random quick ones", "time": "7th March 2018, 10:43 PM", "postID": "post75809771", "replies": []}, {"text": "", "time": "15th March 2018, 09:38 AM", "postID": "post75895657", "replies": []}, {"text": "Carlsbad California. Taken with Google cam and edited with snapseed over all happy with end result. (Not going for natural effect or I would've clearly not edited it so much)", "time": "22nd March 2018, 08:10 AM", "postID": "post75975169", "replies": []}, {"text": "wrong topic - delete pls", "time": "22nd March 2018, 01:51 PM", "postID": "post75977850", "replies": []}, {"text": "Hi all, I've read all the thread as I'm considering buying a G6 for the large price drop and its camera capabilities (I like also the phone dimensions). Someone said G4 was better but I've seen raws of that phone and I wouldn't say they are much better than the G6 ones. Someone pointed out it had a bigger sensor, but I don't know if \"bigger and older\" is better than \"smaller and newer\". I think the real point is LG image processing.\r\nDid anyone ever compare raw pictures taken with this phone with photos of other phones whose camera is better regarded, like pixel2 or iphoneX?\r\nAlso, what about V30 pictures?", "time": "24th March 2018, 03:52 AM", "postID": "post75996684", "replies": [{"text": "I had the G4, then the Huawei P9 and now the G6 and i must say that the G4 had less processing on the photos, but, whit the GCAM app the photos are mutch better, even then the G4.\r\nResuming, G4 stock camera= Better picture quality / G6 GCAM= Better picture quality", "time": "29th March 2018, 09:58 AM", "postID": "post76054801", "replies": [{"text": "Hi, could you possibly attach an example GCAM/STOCK photos for comparison?", "time": "29th March 2018, 09:48 PM", "postID": "post76061238", "replies": []}]}]}]}, {"title": "Video quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-g6/review/video-quality-t3573459"], "threads": [{"text": "I did a few sample videos with the different quality settings and WOAH!!! Especially the videos at 60fps with adequate light from a lamp. When a lot of light it's even smoother when I figured it could not be smoother. Nothing like it. Heck, video of hands looks better than real life and you could see every piece of detail in the skin easily. But I am a photographer so am good with taking photos and have very still hands, so others experience might be a bit different from mine.", "time": "4th April 2017, 01:43 PM", "postID": "post71721873", "replies": []}, {"text": "Looked great in a well-lit environment as stated above.  Had a lot of noise in a darker environment, but not so much as to render it unusable.  Someone that does a better job of holding the camera steady and framing the video might have a better result though.", "time": "4th April 2017, 04:49 PM", "postID": "post71724530", "replies": []}, {"text": "Anyone tried the audio/video quality in loud environments such as discos, festivals , concerts ...? \n\nVery interesting in this feature .\n\nThanks in advance", "time": "10th June 2017, 08:37 AM", "postID": "post72616888", "replies": [{"text": "Here is a link to a song I recorded at a Ghost/Iron Maiden song. I forgot to put it on concert mode and left it on normal .  Here is a link to a video I recorded later in the show as well, still processing so I don't think YouTube will have it in HAD for a while . \n\nhttps://drive.google.com/file/d/0B_n...w?usp=drivesdk\n\nHere is the night video, I think I remembered to switch to 4k.", "time": "14th June 2017, 04:12 AM", "postID": "post72663881", "replies": []}]}, {"text": "Very poor audio quality  \n\nhttps://www.instagram.com/p/BVQUqvHhw9h/", "time": "15th June 2017, 08:25 PM", "postID": "post72686200", "replies": []}, {"text": "good video", "time": "19th December 2017, 02:17 PM", "postID": "post74897025", "replies": []}, {"text": "Is it just me or is the video quality really bad? Full HD videos are not sharp/crisp at all and there's a slight painted/blurry look to frames, even in moderately good sunny conditions. \n\nThis is more apparent with the wide angle lens but the normal lens has this too. I tried shooting with the GCam app and the normal lens video is worse than the stock app. Video Stabilisation is on. 4k videos are pretty sharp but Full HD is my preferred choice.\n\nAnyone know any settings that could be changed to fix this?", "time": "18th February 2018, 05:11 PM", "postID": "post75614268", "replies": []}]}, {"title": "Selfie quality", "rating": 2.5, "links": ["https://forum.xda-developers.com/lg-g6/review/selfie-quality-t3573460", "https://forum.xda-developers.com/lg-g6/review/selfie-quality-t3573460/page2", "https://forum.xda-developers.com/lg-g6/review/selfie-quality-t3573460/page3"], "threads": [{"text": "So far on the demo in my store, the FFC is hazy and unclear, but that's the only thing so far I'm not particularly fond of about the G6...", "time": "28th March 2017, 07:35 PM", "postID": "post71626442", "replies": []}, {"text": "Front camera has been really good so far. Only have taken a couple of pics but they have been good.", "time": "29th March 2017, 03:31 AM", "postID": "post71630644", "replies": []}, {"text": "Nothing to write home about.  A little worse than the G4 in terms of image quality imo, but the wide angle probably makes up for that in usability.  If you take a lot of selfies and the quality matters to you, not sure this would be my first phone choice.", "time": "4th April 2017, 04:44 PM", "postID": "post71724455", "replies": []}, {"text": "well my G6 only lasted  3 hours, my note 5 took better pics with front and rear, the G6 I had flew performance wise but the camera is not very good,  wish it would have taken better pics and I might have kept it.", "time": "5th April 2017, 12:15 AM", "postID": "post71729746", "replies": [{"text": "In my comparison the front camera took better pics than my Note 5. I did some comparisons just for myself. However, I deleted them since I too sent back the phone.", "time": "5th April 2017, 12:41 AM", "postID": "post71729913", "replies": []}]}, {"text": "I don't know why the 5-star rating.\nEvery comparison video I saw of the G6 FFC showed, that it has the worst result of all (vs P10,iP7,GS8,OP3T).", "time": "11th April 2017, 12:04 PM", "postID": "post71815282", "replies": []}, {"text": "Anyone can post for the compare picture that taken by G6 and other new top devices?", "time": "12th April 2017, 08:13 AM", "postID": "post71826630", "replies": []}, {"text": "The selfie camera is poor to say the least. The front camera on my S6 seems a lot better sadly..", "time": "12th April 2017, 04:57 PM", "postID": "post71832155", "replies": []}, {"text": "Grainy and not focused no matter how much or little light there is.", "time": "9th May 2017, 02:38 PM", "postID": "post72226665", "replies": []}, {"text": "The worst Selfie camera I ever seen on a 500 dollars flagship. Big **** omg, low light pic are ****, blured with grain, and high light photo quality is bad. 100% ****, wtf is this sensor ? I so disappointed..", "time": "12th June 2017, 01:33 PM", "postID": "post72642754", "replies": []}, {"text": "le grand angle est plus utile que le selfie quand on habite près du Puy de Dome", "time": "12th June 2017, 02:14 PM", "postID": "post72643220", "replies": []}, {"text": "Weird very little issues here. Low light sucks % but other than that I'm happy", "time": "12th June 2017, 08:58 PM", "postID": "post72647807", "replies": []}, {"text": "yeah it's extremely blurred imo! so much smudge.", "time": "13th June 2017, 11:46 AM", "postID": "post72654527", "replies": []}, {"text": "And I thought G4 had a bad selfie camera.. what a disaster.", "time": "17th October 2017, 01:36 PM", "postID": "post74191086", "replies": []}, {"text": "Use the rear wide angle camera for selfies, don't know why LG dropped from 8mp to 5mp. LG V30 front camera 5mp seems better than the LG G6.", "time": "17th October 2017, 07:54 PM", "postID": "post74195754", "replies": []}, {"text": "One of my friends really want this phone but he is a bit confused which phone to buy between HTC 10 and LG G6, All he wants to have is a better camera, sound, and battery. Should he opt for LG G6?", "time": "4th February 2018, 09:18 PM", "postID": "post75448407", "replies": []}]}, {"title": "Time to take picture (camera launch speed)", "rating": 5.0, "links": ["https://forum.xda-developers.com/lg-g6/review/time-to-picture-camera-launch-speed-t3573461"], "threads": [{"text": "Very very fast even with all the automatic stuff enabled. Will be nice to see how it performs as the phone gets bogged down by apps, etc.", "time": "30th March 2017, 05:04 AM", "postID": "post71645425", "replies": []}, {"text": "If you use the double press volume down to launch camera and quickly press volume up to take picture it's ridiculously fast. IMO the only thing that's going to slow this phone down is slow SD cards (read/write speeds) and cache.", "time": "3rd April 2017, 04:09 AM", "postID": "post71702082", "replies": []}, {"text": "I bought a Sandisk Extreme PRO 64GB MicroSD card for this reason. The write speed is supposingly around 90MB/s. Either way it's expensive, but if you plan on heavy use, I'd strongly recommend that card.", "time": "4th April 2017, 01:54 PM", "postID": "post71722028", "replies": []}]}, {"title": "Software (ease of use, features, etc)", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-g6/review/software-ease-features-t3573462"], "threads": [{"text": "This is some of the best software I have ever used with a camera. It can run in manual and it is very well fine-tuned. I also like that when you're in manual, you can \"level\" the phone as there is a graphic that appears to show you if you are tipping the phone in the shot.\n\r\nThe White balance (color temperature), ISO, shutter speed, EV(?), Manual Focus is possible in manual mode... HDR can also be turned on and off or left on \"auto\". \n\r\nThere are filters and lots of cool \"modes\" you can play with. There is also a \"pop out\" feature that uses both of the back cameras to create an inset image (which is customizeable with filters, different shapes, etc)\n\r\nThe selfie camera has lighting settings, filter and skin tone as well. Lighting adds more light to your face and skin tone basically adds a gaussian blur to your face if you want to give the appearance of faux smoother skin.\n\r\nYou can take advantage of the extra screen real estate and put a pop-up \"camera roll\" on the side to setup new shots based on past ones.", "time": "30th March 2017, 05:03 AM", "postID": "post71645418", "replies": []}, {"text": "is it still the 5 min recording limit for 4K due to heating ? which LG v10 also has??", "time": "24th April 2017, 08:03 PM", "postID": "post72013672", "replies": [{"text": "So what happens when you try to record again right after you just filmed? A warning too cool down/wait 5Min.?", "time": "27th April 2017, 09:46 PM", "postID": "post72060966", "replies": []}]}, {"text": "Adequate, but difficult to use and over -difficult to use. Very difficult to navigate and understand within the application.", "time": "9th May 2017, 02:38 PM", "postID": "post72226678", "replies": []}, {"text": "This phone has one of the best implementation of OEM skin over android. Its super light overlays and not trying to do too much in terms of animations and gimmicks. UX 6.0 has a consistent and proportional feeling throughout all the system apps with strict adherence to material design guidelines. \nI highly recommend the following settings to take advantage of the insanely dense and crisp screen on this device and to best showcase the UX 6.0 UI themes.\n# On Display settings\n-- Set display size to smallest (makes the nav bar look apt-ly sized and frees up real estate)\n-- Use LG's font instead of Roboto (this font is incredibly crisp on screen and uber readable)\n-- Use bold settings for font (helps readability insanely, esp after setting the display size to small) \n# On developer settings\n-- Set animation speeds to 0.5x on all three animation types\n-- Force GPU rendering for 2D\n# Use a Dark Theme\n-- Use a dark theme or black theme, default one is too bright to my taste.\n\nI'm coming from a Oneplus3T who's OxygenOS had rave review for being a tastefully functional AOSP+ implementation of android. UX 6.0 takes it a notch up on the design side and is more refined than OOS. I wish they get to 7.1.2 soon to take advantage of the battery life improvements, otherwise this one's been mighty impressive so far compared to the experience i had on Oneplus3T.", "time": "20th June 2017, 06:08 PM", "postID": "post72742874", "replies": [{"text": "Tried your settings....Looks good...Thanks\n\n---------- Post added at 03:46 PM ---------- Previous post was at 02:50 PM ----------\n\n\n\r\n Tried your settings....Looks good...Thanks", "time": "22nd June 2017, 03:46 PM", "postID": "post72765308", "replies": []}]}, {"text": "using open camera", "time": "1st November 2017, 12:39 AM", "postID": "post74363963", "replies": []}, {"text": "Coming from mi 5, this mobile is excellent in terms of hardware and software needs to improve more. Previously had g2 which was perfect in all aspects. My sincere suggestion is improve the rom like miui. It has better features and doesn't lagg or hang.", "time": "12th February 2018, 06:54 AM", "postID": "post75535353", "replies": []}, {"text": "If anybody wonder how to enable volume bar (yes it's very hidden xD) here is instruction https://forum.xda-developers.com/sho...php?p=75512773", "time": "14th February 2018, 07:19 PM", "postID": "post75569041", "replies": []}]}, {"title": "Charging speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-g6/review/charging-speed-t3573463", "https://forum.xda-developers.com/lg-g6/review/charging-speed-t3573463/page2", "https://forum.xda-developers.com/lg-g6/review/charging-speed-t3573463/page3", "https://forum.xda-developers.com/lg-g6/review/charging-speed-t3573463/page13"], "threads": [{"text": "I have used the charger that came with it (since it was the only USB-C cable I had at the time) and it charged amazingly fast. I bought a Wireless charger as well which is also amazingly fast. It's my first wireless charging experience and I was told it trickle charges so it would be much slower than charging from the cable, but I barely notice a difference in speed at all. I keep checking the phone what seems like every couple of minutes if not seconds and the % has increased by a lot more than I would have imagined. I thought wireless charging to be pointless and a who-cares ordeal, but not that I have experienced it... I don't think I will go back to a device without it (not for a phone at least). I'm not sure if any health issues can be there from radiation, but I'm almost dead anyway (well... I have about 50 years to go I guess) so I don't really care, lol.  \n\nFor those wondering, I went with the CHOETECH Qi Model T513 wireless charger. Input: DC5V/2A (Max) Output: 7.5W which I purchased from Amazon for only $19.95. That was 50% off at the time I purchased it, but that was only a few days ago so  you might want to check on it.", "time": "4th April 2017, 02:00 PM", "postID": "post71722095", "replies": [{"text": "Really? I feel my g6 charges way slower then my S7 edge. I still have it but I'm gonna test this tomorrow.\n\n---------- Post added at 09:45 AM ---------- Previous post was at 09:45 AM ----------\n\n\n\r\nReally? I feel my g6 charges way slower then my S7 edge. I still have it but I'm gonna test this tomorrow.", "time": "6th April 2017, 09:45 AM", "postID": "post71747898", "replies": []}]}, {"text": "Went and picked up this bad boy today. LS variant. Out of the box, had 41%. Using my car charger Qualcomm Quick Charge 2.0(yes 2.0) and the included USB C, it charged to 70% in the 20 minute drive back to my house. For using the old QC tech, still charged amazingly fast. I have a QC3.0 39W wall charger that got delivered this afternoon. Will wait til this baby dies and charge her up with that and will report back.", "time": "7th April 2017, 09:49 PM", "postID": "post71769884", "replies": []}, {"text": "Ive noticed when using a QC 3.0 charger and cable doesnt seem like the g6 is actually charging faster. Its suppose to support QC but its not.", "time": "8th April 2017, 03:17 PM", "postID": "post71778104", "replies": []}, {"text": "I'm finding this charges a lot slower than my S7 Edge as well. Using the provided cable and charger it takes about 2.5 hours to go from 5% to full which is generally fine, but there isn't a burst and then trickle. I appreciated being able to plug my phone in for a short time when it was low and top it up enough to go out and not worry about it dying. Can't really do that with this one.", "time": "9th April 2017, 10:21 PM", "postID": "post71795604", "replies": []}, {"text": "I had a power brick laying around and says qualcomm 2.0 and it charge`s really fast,  like 1% of battery every min. , but yes with the stock charger brick takes forever to charge.", "time": "9th April 2017, 11:41 PM", "postID": "post71796285", "replies": []}, {"text": "Using a Xiaomi USB C charger (45W) which supports both UPD 2.0 and QC 3.0, my phone charged very fast.", "time": "26th April 2017, 11:08 AM", "postID": "post72037733", "replies": []}, {"text": "Mine charges super fast with the supplied charger. I plugged in with 11% yesterday and hit 50% in like 25 minutes.", "time": "26th April 2017, 12:18 PM", "postID": "post72038491", "replies": []}, {"text": "quick charging is convenient and all, but is there a way to revert to normal charging? I don't want to accelerate my cycles. Thanks.", "time": "1st May 2017, 04:36 PM", "postID": "post72118060", "replies": [{"text": "Use a non-QC charger.", "time": "1st May 2017, 04:38 PM", "postID": "post72118104", "replies": []}]}, {"text": "thanks. I'll do that, I have to get extra cables anyway. Although I was wondering if there was a way to hack it phone-wise.", "time": "1st May 2017, 04:48 PM", "postID": "post72118244", "replies": []}, {"text": "Yeah I take back what I said. The supplied charger does appear to \"only\" be QC 3. It still seems faster then QC2 though. Maybe it's just in my head. It works for my needs though, I can get almost 50% in like 20.", "time": "5th May 2017, 12:13 PM", "postID": "post72172092", "replies": []}, {"text": "Charge in airplane mode when you can. When you have no worries of anyone calling or texting. With wifi off as well you'll see a decent jump in fast charging.", "time": "7th May 2017, 06:20 AM", "postID": "post72195031", "replies": []}, {"text": "purchased by phone a couple of days back and it charged from 5% to 100% in approx 1.40 mins with the stock QC 2.0. I'm damn impressed....", "time": "27th May 2017, 09:28 AM", "postID": "post72446978", "replies": []}, {"text": "Let me Ask y'all something. Coming from a LG G4 and just Charging My Batteries by a OEM Battery Charger I got 2HRs More of SOT. When I charge via the USB Quick Charger I got the same 3HRs as usual. So I got 5 while charging Slower then the SO-Called Quick Charging. To my understanding Batteries are meant to Slow-Charge rather then Fast", "time": "27th May 2017, 07:01 PM", "postID": "post72452640", "replies": []}, {"text": "I get fast charging from the power cube they supplied, and also my samsung \"active fast charging\" cubes.\n\r\nI also got fast charging from an off-brand wireless, adrema, which will pull almost 2 amps max... \n\r\nGreg", "time": "2nd June 2017, 06:30 PM", "postID": "post72524616", "replies": []}, {"text": "I can confirm. Charger bundled is QC 2.0 and, also, a poor QC because, reading the labels on it, it's always 1.8 A, no matter if in 5V or 9V mode (in this second way it should give more Ampere).\r\nSo: 3300mAh battery / 1800 mAh charger = 1,83 hours needed (theory tested in practice with full charge from 5% to 100%) in 2 hours.", "time": "5th June 2017, 08:00 AM", "postID": "post72553588", "replies": []}, {"text": "I just bought a charger with QC 3.0  and the speed it practically the same of the standard charger.. what a shame.. I think this LG doesn't really support qualcom quick charge.", "time": "6th June 2017, 10:38 AM", "postID": "post72567018", "replies": [{"text": "QC3.0 charger ? Which one? Which Brand ? Whats the output Volts ?", "time": "6th June 2017, 12:11 PM", "postID": "post72567802", "replies": [{"text": "this one AUKEY Quick Charge 3.0", "time": "6th June 2017, 12:47 PM", "postID": "post72568130", "replies": [{"text": "oh....I was planning to buy one...thats why asked..\n\n---------- Post added at 01:10 PM ---------- Previous post was at 01:07 PM ----------\n\nToday I connected a Moto Turbo Charger which has 3 different Outputs...\n1. 5V, 2.85A\n2. 9V, 2.85A\n3. 12V, 2.15A\nWhen I connected my G6...it showed fast charging...but dont know whether its using 9V or 12V... 😕", "time": "6th June 2017, 01:10 PM", "postID": "post72568332", "replies": [{"text": "I don't know what's going on.. probably it's the cable from LG, tomorrow I will receive a new usb type C cable.. Hope it will be better :\\ \r\nI mean this phone is great, but recharge time is bull****.", "time": "6th June 2017, 01:14 PM", "postID": "post72568401", "replies": [{"text": "Yeah....even the cable plays a major role in charging speeds...Just update here after the cable comes...", "time": "6th June 2017, 01:21 PM", "postID": "post72568481", "replies": [{"text": "Just received this USB type C cable , same ****, slow recharge.. Lost any hopes.", "time": "7th June 2017, 12:58 PM", "postID": "post72581288", "replies": []}]}]}]}]}]}]}, {"text": "The water may just take several days to dry in the jack. Thankfully it's supposed to be water proof. Better use a mild cleaning agent, i use tft claner for almost any \"sensible\" applications,which will dry even under difficult conditions within minutes.", "time": "16th March 2018, 06:57 PM", "postID": "post75912639", "replies": []}, {"text": "AEX Oreo 8.1 v.5.3/ Melina Kernel... qc 3.0 seems to work", "time": "2nd April 2018, 03:23 PM", "postID": "post76098707", "replies": []}, {"text": "My Nexus 6P charges much faster. My G6 also won't fast charge on direct USB C to USB C, which means my car charger that fast charged my Nexus 6P is useless and my direct USB C cord plugged into my motherboard also won't fast charge. This phone also loses charge while using Google Maps.", "time": "3rd April 2018, 01:50 PM", "postID": "post76109209", "replies": []}, {"text": "It supports the original Quickcharge at 5v 2A instead of QC3 9v 1,8A. When the port lacks QC, there may be another fallback step at USB3 5v 0,9A,but this ain't good no more.\nUse as a car satnav is quite demanding, so even with QC1 it may drain the battery, but shouldn't with QC3.", "time": "3rd April 2018, 06:19 PM", "postID": "post76111989", "replies": []}]}, {"title": "Screen on time", "rating": 4.0, "links": ["https://forum.xda-developers.com/lg-g6/review/screen-time-t3573464", "https://forum.xda-developers.com/lg-g6/review/screen-time-t3573464/page2", "https://forum.xda-developers.com/lg-g6/review/screen-time-t3573464/page3", "https://forum.xda-developers.com/lg-g6/review/screen-time-t3573464/page41"], "threads": [{"text": "6h 30min SOT", "time": "30th March 2017, 09:09 PM", "postID": "post71656288", "replies": []}, {"text": "5h 47m SOT @ 29%", "time": "1st April 2017, 10:37 PM", "postID": "post71685702", "replies": []}, {"text": "I'm on the AT&t version and the battery life is crap. I've been lucky to get 3.5 hours of SOT. My 2 year old One M9 gets about the same battery life. I'm hoping to AT&T releases an update to improve this because everyone on T-mo talking about 6 hours of SOT with like 40% remaining.", "time": "3rd April 2017, 02:11 PM", "postID": "post71707479", "replies": [{"text": "Have you been able to fix this? I'm also getting poor battery life.", "time": "5th April 2017, 09:26 PM", "postID": "post71742274", "replies": [{"text": "I'm happy to report that I have, mostly. I took into the att store and they ran a diagnostic check on it and told me that the quickmemo app was hitting y processor pretty hard which is strange because I have never used it (it also doesn't show up under battery usage). It can't be disabled but I forced stopped it. When I did force stop it my ram usage dropped by like 10% so I don't know what the heck that app is doing. The odd thing is it will occasionally start up again and I have no idea why. I did open the app and set the capture+ action to be handled by gallery instead of quickmemo and there are no permissions set for it, so we'll see what that does. I'll be watching it closely.\nThe biggest culprit I believe was my outlook app was having a contact sync issue. Once I went on the app and fixed that issue my battery life has been great. I hit my phone hard yesterday to try it out and while I only had around 4 hours of SOT when the screen wasn't on I was listening to music (probably at least 4 hours of music playback). I downloaded apps from the playstore, surfed the web, streamed some videos, took photos and lot of other heavy uses and it made it from 6am to 6pm  with 10% left before i plugged in. I was pretty impressed.\nSo I say mostly fixed it because fixing the outlook sync issues helped a great deal, but that quickmemo app could still cause a little drain and I can't figure out how to stop it. I'll keep an eye on it and  report back.", "time": "6th April 2017, 01:47 PM", "postID": "post71750320", "replies": [{"text": "This is great to hear. I did what some people recommended and did a factory reset, installing all apps \"by hand\". And force stopping the quickmemo app saved some ram/battery as well. Battery life and stand by seem a lot better. Not great, but better. Gonna see how it fairs in a few days. If it's still bad, might get a replacement. I'm hoping for an unlocked bootloader on this so I can debloat the damn thing. That would help a great deal with battery. Thanks.", "time": "6th April 2017, 07:12 PM", "postID": "post71754466", "replies": []}]}]}]}, {"text": "4 hours 3 mins sot 25% remaining . All on sprint LTE no wifi today with between 1/2 and full bars, usually full though. Insane coming from an s6 edge that would get maybe 2 hours before dying in the same conditions. Loving this phone. Very excited for kernels and ROMs to start hitting this phone", "time": "5th April 2017, 06:09 AM", "postID": "post71732041", "replies": []}, {"text": "almost 6 hours SOT?! i crack 5h even and it died as i hit that mark. Im assuming none of you guys are running the always on display? my other issue is at school service blows. I legit watched my phone bleed 12% battery in the course of one class.", "time": "6th April 2017, 07:03 AM", "postID": "post71746495", "replies": []}, {"text": "7 hours and 26 minutes so far with 48 percent remaining. Estimated time remaining is 6 hours and 11 minutes I've used it pretty heavily throughout the day and this is day one of using it on battery so I'm very very impressed.\n\n---------- Post added at 09:07 PM ---------- Previous post was at 09:05 PM ----------\n\nOn a side note I recommend not using always on display there's really no need for it and it's going to waste your battery life.", "time": "6th April 2017, 10:07 PM", "postID": "post71756501", "replies": []}, {"text": "After first full charge", "time": "7th April 2017, 06:36 AM", "postID": "post71760189", "replies": []}, {"text": "My 3rd day of use. First time actually running it down", "time": "8th April 2017, 02:22 PM", "postID": "post71777460", "replies": []}, {"text": "My average is 4hrs 15 mins to 4hrs 45mins I have all beta google apps including Google play services and beta versions of facebook and Instagram.", "time": "8th April 2017, 03:16 PM", "postID": "post71778086", "replies": []}, {"text": "Definitely great battery.", "time": "9th April 2017, 05:33 AM", "postID": "post71785385", "replies": []}, {"text": "What am I doing wrong here", "time": "9th April 2017, 06:05 AM", "postID": "post71785567", "replies": [{"text": "The top three reasons for battery drain (with a non defective phone). \n\n1. Screen on with full brightness. \n\n2. Rogue application or data heavy application (email being a big one or apps that run on the background constantly).\n\n3. Poor cell coverage area where phone is sucking up juice trying to stay connected to towers. \n\nBest way to trouble shoot is to start with a 100% clean factory reset phone. Follow these steps \n\n1. Reduce screen brightness as much as possible, using auto brightness helps, but you may have to adjust manually if it's at full 🔆 in your location. \n\n2. Don't install any applications at first. If your battery drain doesn't happen until after you install applications, then you'll need to figure out which one is the culprit. \n\n3. Turn off the cell radio in poor coverage and see if that does anything. If your battery improves you know that's the issue. I know CDMA phones in poor coverage area suck the life out of a phone (Sprint and Verizon).\n\nAfter that it's time to consider defective device.", "time": "9th April 2017, 03:44 PM", "postID": "post71790933", "replies": [{"text": "Cell coverage i know is one reason while im in school. i swear that place has a jammer installed somewhere. with AOD ill watch the battery just drain itself. Im probably gonna do a factory reset today or tomorrow and see what comes of it.", "time": "9th April 2017, 04:15 PM", "postID": "post71791332", "replies": []}]}]}, {"text": "1st full charge. Coming from a corrupted battery nexus 6p with 2hrs of sot, this phone is so much better in any case", "time": "9th April 2017, 08:51 AM", "postID": "post71786734", "replies": []}, {"text": "Got mine in the mail yesterday, it was shipped with 40% juice. Had almost 3 hours of SOT on that :P\nLet' see what my first charge will be like", "time": "9th April 2017, 12:08 PM", "postID": "post71788555", "replies": []}, {"text": "Coming from the Galaxy S6 I have to say the battery life and SOT is really good and about almost twice what I got from the S6.\r\nThis is Day 1 after its first full charge, I'd rate the usage as pretty heavy as I was queued at Home Affairs from 8am till midday.\r\nOff the charger from 7am and currently on 13% remaining @17:55 South African time.\r\nI should see 6 hours before needing to recharge", "time": "12th April 2017, 04:54 PM", "postID": "post71832101", "replies": []}, {"text": "Battery life is horrendous for me. Worst I've seen on Android device in some time. For a device with a 3300 battery this really is laughable. Battery stats reveals nothing and always shows a steep line. Is LG software always this bad or is this an Android 7.0 thing? I'm probably gonna dump this thing.", "time": "17th April 2017, 11:32 AM", "postID": "post71896021", "replies": [{"text": "What Carrier you on? Some Apps from the Carrier can cause issues and only by Disabling them can improve battery life to some extent", "time": "17th April 2017, 07:41 PM", "postID": "post71902500", "replies": [{"text": "I may have solved the issue sonewhat. I factory reset and set up the phone as new. Standby seems much better now.", "time": "17th April 2017, 09:48 PM", "postID": "post71904092", "replies": [{"text": "That's good to hear.. not many people are complaining about the battery...\n\nI just wish I got a little more screen on time. Lol. I wanna be in the 6 hour club", "time": "18th April 2017, 02:17 AM", "postID": "post71906456", "replies": [{"text": "I believe it depends on the Carrier as some have so-called bloatware while some don't and if you live in the UK then you don't have to worry about it.", "time": "18th April 2017, 04:00 AM", "postID": "post71907306", "replies": []}]}]}]}]}, {"text": "Well tjat was short lived. Ive got like 8 apps installed and the rapid drain has returned. Im getting rid of this thing. LG sofrware is worse than Samsungs...", "time": "18th April 2017, 11:48 AM", "postID": "post71911304", "replies": [{"text": "Clearly you have a bad phone as this is not normal.", "time": "18th April 2017, 02:44 PM", "postID": "post71913503", "replies": []}, {"text": "It's obviously your device and not the software, seeing how nearly everyone is expressing their love for their battery life. Something is keeping your phone awake.. What are the 8 apps you have installed?", "time": "18th April 2017, 04:06 PM", "postID": "post71914737", "replies": []}]}, {"text": "I have the Korean variant and I'm averaging just about 5 hours SOT.  But I've noticed that my #1 battery hog is Snapchat.  It uses more power than the screen does on a daily basis.  I'm willing to bet if I just got rid of Snapchat that I could hit 5.5 or maybe 6 hours of SOT daily.", "time": "18th April 2017, 12:44 PM", "postID": "post71911958", "replies": [{"text": "Also if you have Facebook App that can cause it to. Just use the mobile site. A lot better...", "time": "18th April 2017, 02:44 PM", "postID": "post71913504", "replies": []}]}, {"text": "First of all, I can't thank you enough for patiently responding to all my whining here! thank you very much!\none last whining which I'm very concerned about, sometimes, even watching youtube doesn't get my mobile warmed up, but just scrolling through the images in the gallery makes it warm up! ambient was 31, was browsing through gallery, it raised to 34 and became warm to notice.[/QUOTE]\nTry wakelock detector.. let it run for a day to collect information about apps running in background", "time": "12th March 2018, 08:49 PM", "postID": "post75866803", "replies": [{"text": "Try wakelock detector.. let it run for a day to collect information about apps running in background[/QUOTE]\n\r\nAny well known app name for wakelock detection.. I used Gsam but, is there any specific wakelock detec tor alone app?", "time": "13th March 2018, 01:53 PM", "postID": "post75874442", "replies": [{"text": "Any well known app name for wakelock detection.. I used Gsam but, is there any specific wakelock detec tor alone app?[/QUOTE]\n\nYou can try,as a first step, courier spy..it informs you about how much time certain frequencies take place..", "time": "13th March 2018, 09:44 PM", "postID": "post75879344", "replies": []}, {"text": "Any well known app name for wakelock detection.. I used Gsam but, is there any specific wakelock detec tor alone app?[/QUOTE]\nWakelock detector is the app#", "time": "13th March 2018, 10:24 PM", "postID": "post75879703", "replies": [{"text": "Wakelock detector is the app#[/QUOTE]\n\r\nMan this phone is shitting me.. 100% charged at night with no apps running in the background. with just WiFi connected and Always-On Display.. for the past 5 days it's min 12% drain overnight.\r\ndaybefore yesterday 11% today it was 14% and it extends,, when checked it just says Phone Idle and nothing else", "time": "15th March 2018, 04:49 AM", "postID": "post75893824", "replies": []}]}]}]}, {"text": "Unlocked rooted us997 7h 40min sot\r\nWakelock detector 1% awake\r\nFulmics rom", "time": "15th March 2018, 07:54 PM", "postID": "post75901897", "replies": []}, {"text": "A trick i do to have more screen on time is to acutally use it more often with screen on. As i have tested, leaving my phone in idle still drains battery and so when i try to use it, it suddenly drains faster with the screen on. But if you constantly use your phone, more power will actually go to the screen being on and so you get a longer screen on time", "time": "22nd March 2018, 04:20 PM", "postID": "post75979308", "replies": []}, {"text": "Mine H870 model has got a really really bad battery life. I need to charge minimum 1 times in school with a fast charging power bank.\r\nI disconnect the charger at morning (100%), and I'm sitting on the freaking 3-4th lesson, and my battery is at about 40-50%.\r\nMy average SoT is ~2,5 - 3hours on mobile data, on Wi-Fi a bit better. I tried with full stock ROM, and with FULMICS+ROOT+Full Greenify, and nothing extra...\r\nI bought this phone at '17 July brand new.\n\r\nAny ideas?", "time": "22nd March 2018, 08:13 PM", "postID": "post75981786", "replies": []}]}, {"title": "Standby drain", "rating": 3.5, "links": ["https://forum.xda-developers.com/lg-g6/review/standby-drain-t3573465", "https://forum.xda-developers.com/lg-g6/review/standby-drain-t3573465/page2", "https://forum.xda-developers.com/lg-g6/review/standby-drain-t3573465/page3", "https://forum.xda-developers.com/lg-g6/review/standby-drain-t3573465/page18"], "threads": [{"text": "I have been on and off mine all day without heavy use due to being at work, and by the time night came without me charging I was around 79%. This is from 5AM to 11PM.   But I must admit... I went into the sttings and set EVERYTHING as inactive that I was able to do so and recommend everyone do it. The apps will never turn on or activate unless you manually open one in which case it will then stay active. It's great for apps that do crap in the background which you never use anyway. Oh, and I use Greenify as well, and always keep my tasks clear. So yeah... I'm used to saving battery by habit so my experience is different from most.", "time": "4th April 2017, 02:03 PM", "postID": "post71722133", "replies": [{"text": "Did you hook your phone up to a computer and use the ADB commands to enable Greenify's aggressive doze? That really helped me, Nougat's built-in doze is still crap compared to Greenify. Also, setting WiFi to inactive while display is off, as well as enabling data saver in data management to restrict mobile background data for all apps helps greatly with wakelocks. Also everyone should consider disabling certain notifications from apps like Maps and Assistant which can create a lot of wakelocks.\n\nI wrote a few tips to help with battery life on Nougat in the G5 section, but it should apply here as well:\nhttps://forum.xda-developers.com/att...tions-t3570944", "time": "14th April 2017, 06:29 PM", "postID": "post71861017", "replies": [{"text": "No I did not. Heck, I didn't even know I COULD do that. That'll be my objective before tonight though, thanks!", "time": "15th April 2017, 11:02 PM", "postID": "post71877106", "replies": []}]}]}, {"text": "My standby time has been brutal... Would not be using my phone for around 1 hr and then id see my battery drop from a 36 to 30.... I closed all apps and even used the smart cleaner to get rid of some.. I dont know whats the problem to be honest. If they can fix the standby drain i could honestly reach for 5 to even 6 hours of screen on time", "time": "14th April 2017, 07:36 AM", "postID": "post71853884", "replies": [{"text": "I agree with jaeyo, my standby time is amazing. Off the charger overnight for 8 hours i only lose 2%. I do have AOD scheduled to turn off from 11p to 5a.", "time": "14th April 2017, 01:35 PM", "postID": "post71857330", "replies": []}]}, {"text": "My standby has been really good, I can leave it off charge overnight and can only go down 2% or so, but once I start using it the % drops heavily after 5 minutes or so. I've got to go through the settings to turn off notifications because I've noticed apps like candy crush giving me notifications", "time": "14th April 2017, 11:10 AM", "postID": "post71855772", "replies": []}, {"text": "Standby time wears on you depending on what apps you got running\n\n🤜🏾💢🤛🏾", "time": "14th April 2017, 10:12 PM", "postID": "post71863390", "replies": []}, {"text": "I found the culprit. Apparently one of my skin apps was causing wakelocks keeping the phone awake the whole time. Deleted it and installed greenify, will see how things goes", "time": "15th April 2017, 01:37 AM", "postID": "post71864959", "replies": []}, {"text": "I love Greenify's aggressive doze", "time": "17th April 2017, 09:02 AM", "postID": "post71894576", "replies": []}, {"text": "Does Greenify help? I get some seriously terrible standby drain going. Is it LG software that's so bad?", "time": "17th April 2017, 11:34 AM", "postID": "post71896052", "replies": []}, {"text": "Honestly dont know how to fix this standby drain.. If ibhad root i would easily find the culprit through betterbatterystats but since i dont have that, cant seem to figure out why my standby drain is so high. I would leave my phone on the desk at 30% not using it all and come back 2 hrs later to 16%. Horrible standby time means losing precious screen on time sad sad", "time": "21st April 2017, 08:51 AM", "postID": "post71958920", "replies": [{"text": "Use Greenify to force Hibernate Quick Memo+. Seems to have solved my standby drain issues.", "time": "21st April 2017, 12:30 PM", "postID": "post71961306", "replies": [{"text": "The problem is Quick Memo+ isnt the problen because i dont even have that application. I did a factory reset and it got rid of the app so I dont know what to do", "time": "21st April 2017, 06:04 PM", "postID": "post71966076", "replies": [{"text": "You must have it. It's baked into the OS. Look in the essentials folder of the LG (iOS) Home it'll be there", "time": "22nd April 2017, 12:06 AM", "postID": "post71970547", "replies": []}]}, {"text": "Do you need root for Greennify? I would like to start using it.", "time": "21st April 2017, 07:31 PM", "postID": "post71967292", "replies": [{"text": "You can use greenify by plugging your phone into your computer and use adb commands", "time": "21st April 2017, 07:57 PM", "postID": "post71967687", "replies": [{"text": "No root needed.", "time": "21st April 2017, 08:40 PM", "postID": "post71968291", "replies": []}, {"text": "Don't really know how to use ADB commands.  But I will try to figure it out", "time": "28th April 2017, 08:53 PM", "postID": "post72080999", "replies": []}]}]}]}]}, {"text": "I use greenify and my standby time is excellent, during the night (8 hours or so) the battery only drops 1 to 2%, which is great, I do disable wifi when I go to bed though. my SOT is about 6hrs and my 'time since last charge is 85 hours with 8% battery left), I do control which apps have access to background data.", "time": "2nd May 2017, 09:45 AM", "postID": "post72127705", "replies": []}, {"text": "Yes I do", "time": "2nd May 2017, 10:43 AM", "postID": "post72128322", "replies": [{"text": "which apps are you hibernating? and do you have auto hibernate on?", "time": "2nd May 2017, 07:40 PM", "postID": "post72135219", "replies": []}]}, {"text": "The past couple of days for me my battery life has been good I would finish up my day with around 60% left.\n\nCurrently I'm on 67 with 2hr 10 min SOT bit 15 hours off the charger and at work walking in a low reception area for 8 hours of the day.", "time": "2nd May 2017, 01:18 PM", "postID": "post72129965", "replies": []}, {"text": "Maps, camera, Facebook, Instagram, memo, music etc. \n\n\n\n---------- Post added at 09:20 PM ---------- Previous post was at 09:19 PM ----------\n\nIn Greenify yes I have auto hibernate on", "time": "2nd May 2017, 08:20 PM", "postID": "post72135681", "replies": []}, {"text": "I'm getting a 5% drain after 8 hours of standby. And this includes NO aod and the wifi on. I don't know if this normal for the LG, but my other phones S7 and Redmi Note 4 are around 1 to 2% standby drain.\n\nIs there a way besides Greenify?", "time": "3rd May 2017, 05:05 AM", "postID": "post72139891", "replies": [{"text": "Try going into your wifi setting and turn off keep wofi awake when screen off. I realized when wifi is on i get horrible standby drains. I went to bed with 93% and woke up with 90% after 8hrs standby. Losing .4%/hr on standby", "time": "3rd May 2017, 03:33 PM", "postID": "post72146131", "replies": [{"text": "This is strange. I had literally only 1% drain in 8 hours after switching off the WiFi, I wonder what would the drain be if I was not on LTE and switched to regular gsm (2g) network. \n\nBut isn't this an issue? My previous S7 never had so much drain with the same settings.", "time": "4th May 2017, 05:31 AM", "postID": "post72154728", "replies": []}]}]}, {"text": "I use greenify too which helps a bit however I'm looking forward to the day when we can get a more efficient kernel and a few annoyances tweaked. I think the phone would be real good with an optimized rom.", "time": "4th May 2017, 01:06 PM", "postID": "post72158646", "replies": []}, {"text": "Not sure what happened but my G6 sh*t the bed big time last night even with ForceDoze set to turn off wifi. Over 8 hours I lost 57%. Not cool", "time": "6th May 2017, 12:57 PM", "postID": "post72185872", "replies": []}, {"text": "In the meantime, I did radical surgery-- blocked background data from all apps except Whatsapp and SMS messenger, and switched location services to GPS only. \nDrained decreased  to about 1% an hour. \nI also think that the \"100%\" battery indication is like the \"F\" in your car's fuel guage-- which can stay at F for quite a bit of driving then starts to drop more quickly after a certain point. \nThe 100% can last almost 2 hours then starts to drop at a higher rate. \nSince my phone is not rooted I'll try GSam's adb method for getting more stats.\nThe question is will the information I get be actually useful in trying to change something. If its a hoggy app, yes, but if it just the google/android system, not much to do about it.", "time": "19th December 2017, 08:46 AM", "postID": "post74894253", "replies": []}, {"text": "My experience of using Gsam pointed to a combination of a android system, Kernel and google play services causing the battery drain which I can do nothing about. I agree that the battery drain is non linear with it dropping 100% to 95% at about 1% an hour in standby and after that it increases on my phone to about 2% an hour. Really hoping that IF we get Oreo it MIGHT improve things but I have strong doubts on both counts.", "time": "19th December 2017, 04:08 PM", "postID": "post74898173", "replies": [{"text": "In my case Gsam identified a shopping app (Listonic) that was running in the background using a disproportionate amount of power so I shut it down.\r\nToday I'll see how the phone does", "time": "20th December 2017, 07:12 AM", "postID": "post74904733", "replies": []}]}, {"text": "It feels to me that because I charge the phone at 15-30%, the battery drops faster. It is not the only Android I am feeling this happens to either. I just installed GSM Battery Monitor in hopes to see of it's anything that does it. I keep data off at night though. Only WiFi is running and it can take 1-2% of battery. The day I let the battery drop to 0 and then fully charge it, to recalibrate the battery, it feels the battery lasts more. I am kind of blaming Android though, for not being able to accurately read the battery. Still though, seeing how my mother's Xiaomi Redmi Note 4 can go on for days with minimal power drop, makes me feel the power cluster of the LG G6 is just pulling a lot from the Battery. That or it is just not switched and used correctly by the G6.", "time": "20th December 2017, 05:41 PM", "postID": "post74910327", "replies": []}, {"text": "Over the last few days standby drain has increased massively from 2% an hour to about 5% an hour. I have only updated a few google apps so that could be the issue. I thought 2% was bad but 5% is appalling! Anybody else had any similar issues?", "time": "29th December 2017, 11:12 PM", "postID": "post75008197", "replies": []}]}, {"title": "Heavy use endurance", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-g6/review/heavy-endurance-t3573466", "https://forum.xda-developers.com/lg-g6/review/heavy-endurance-t3573466/page2", "https://forum.xda-developers.com/lg-g6/review/heavy-endurance-t3573466/page3"], "threads": [{"text": "Played a lot of games and apps at same time without closing them, and even dual windows some stuff. Phone seems unphased at all, other than a little heat which is to be expected due to so much running, but it ran like a PC. No lag, no hiccups, no problems. I also had the screen brightness set to 79% so that may also be a factor.", "time": "4th April 2017, 02:05 PM", "postID": "post71722149", "replies": []}, {"text": "Day 1, 1st Full Charge, heavy usage especially from the morning till midday.", "time": "12th April 2017, 05:00 PM", "postID": "post71832187", "replies": []}, {"text": "thanks for the pic", "time": "12th April 2017, 06:22 PM", "postID": "post71833234", "replies": []}, {"text": "After 1st charge to 100%, day started at 7AM and was at 5% by 8PM. The day consisted of about 4 hours of video streaming, 2 hours of Pandora, and about 20-30 minutes checking facebook/instagram.\n\r\n2nd day, 100% started at 6AM and it's currently at 60% at 1:35PM. About 45 minutes checking facebook/instagram, 1 hour streaming video and 1 hour reading manga.\n\r\nBoth days have location services and Wi-Fi on, Screen always on setting turned off, and auto brightness.", "time": "14th April 2017, 09:39 PM", "postID": "post71863064", "replies": []}, {"text": "Colour me impressed!", "time": "15th April 2017, 04:38 PM", "postID": "post71872856", "replies": [{"text": "What do you have your brightness set as?", "time": "15th April 2017, 05:28 PM", "postID": "post71873439", "replies": [{"text": "Brightness is set to Auto which seems plenty good enough for all situations IMO.\n\nBattery is at 5% time for a recharge. Final usage attached, 19hrs uptime with almost 6 hours SOT with no power saving of any kind.", "time": "15th April 2017, 06:21 PM", "postID": "post71874167", "replies": [{"text": "Thats not bad at all. Do you leave it on wifi all day? Did you make any adjustments out of the box?", "time": "15th April 2017, 07:35 PM", "postID": "post71875069", "replies": [{"text": "No adjustments at all Jeremiah. I did push the auto brightness up an extra 5%. Coming from a S6 this screen needed the extra brightness when I'm sunlight.\n\nWi-Fi is on all day and Bluetooth for most of the day as I have a Gear S2 Classic connected to the phone. \n\nMy S6 could get me 19hrs uptime but the SOT wpuld be like 2hrs maybe 2.5hrs\n\nLight usage should easily get me 2 days on the G6.", "time": "15th April 2017, 08:12 PM", "postID": "post71875489", "replies": [{"text": "Cool. I have Bluetooth on all day and I rarely use wifi, that tends to drain my battery a little more than it should.. I get about 18 hours up time but i haven't been able to get anymore than 4.50 SOT.", "time": "15th April 2017, 08:23 PM", "postID": "post71875607", "replies": []}]}]}]}]}]}, {"text": "And the battery just seems to be getting better as the days pass", "time": "17th April 2017, 03:11 PM", "postID": "post71898570", "replies": []}, {"text": "With heavy clash of clans use and other hard running apps I'm overall happy with the battery life. Though I did come from the LG G4.. So I could be just wowed by normal battery use.", "time": "21st April 2017, 05:54 AM", "postID": "post71957227", "replies": [{"text": "How much more battery on G6 vs G4?  I have G4 now and am on the fence between G6 and Galaxy S8.  Battery life is a priority.", "time": "21st April 2017, 07:36 AM", "postID": "post71958143", "replies": [{"text": "I noticed a improvement but honestly if your looking for battery life Samsung always wins! LG Still won't last a full day really", "time": "21st April 2017, 09:15 AM", "postID": "post71959164", "replies": [{"text": "What do you do? I get 5 hours SOT time and 13 to 16 hours of battery..i guess that's not technically a full day.", "time": "23rd April 2017, 08:44 AM", "postID": "post71989594", "replies": [{"text": "I do play clash of clan, and that eats a large amount of battery. Without the game I would agree with your numbers definitely!", "time": "24th April 2017, 09:59 AM", "postID": "post72005299", "replies": [{"text": "For sure.. Games do that.. I can't wait to test it with the games I play", "time": "24th April 2017, 04:38 PM", "postID": "post72010516", "replies": [{"text": "One awesome thing is the screen size is absolutely killer, the other cool thing is I feel my screen is a lot more sensitive to my touch which at first messed me up and games but I've learned to cherish it.", "time": "24th April 2017, 05:12 PM", "postID": "post72011048", "replies": []}]}]}]}]}]}]}, {"text": "One of Y'all just use the Mobile Site of Facebook and tell me the SOT results. Uninstall the App of course and try to use the Opera Browser if possible as it works the best", "time": "23rd April 2017, 09:50 PM", "postID": "post71999375", "replies": []}, {"text": "is it still the 5 min recording limit for 4K due to heating ? which LG v10 also has??", "time": "24th April 2017, 08:03 PM", "postID": "post72013665", "replies": [{"text": "Are you serious?", "time": "24th April 2017, 08:45 PM", "postID": "post72014238", "replies": []}]}, {"text": "The phone is only a month old, but I use this thing extremely heavy and, so far, the battery has been great.  I am curious on how long it is going to take for it to stop taking the beating that it has been and not work as long.", "time": "26th April 2017, 11:07 PM", "postID": "post72047189", "replies": []}, {"text": "Q6 (original from LG) is very nice hardworker (min 4days on battery).\r\nQ6 (from suckers like Zend) is ****ing res-hungry (max 1day)", "time": "20th March 2018, 09:28 AM", "postID": "post75952063", "replies": []}, {"text": "So been using this device for couple weeks, the battery is amazing. I'm on fulmics rom.", "time": "5th April 2018, 06:08 AM", "postID": "post76128377", "replies": []}]}, {"title": "Light use endurance", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-g6/review/light-endurance-t3573467", "https://forum.xda-developers.com/lg-g6/review/light-endurance-t3573467/page2"], "threads": [{"text": "With light use my battery barely moves.", "time": "4th April 2017, 02:06 PM", "postID": "post71722164", "replies": []}, {"text": "My first day of real life use I had 70% remaining, that was with social media, 9 hours of work and 14 hours off the charger", "time": "6th April 2017, 02:03 AM", "postID": "post71744502", "replies": []}, {"text": "are you guys leaving the always on display off? ive had mine for a few days coming from a pixel and this battery hasnt impressed me much. But granted ive had the always on, on.", "time": "6th April 2017, 07:00 AM", "postID": "post71746465", "replies": [{"text": "Honestly I think the AOD barely effects it. I have AOD on and after being off the charger for 3 hours with light use, a few texts and checking email, I've only gone down 1%.", "time": "7th April 2017, 02:05 PM", "postID": "post71764300", "replies": []}]}, {"text": "I've turned mine off since day one", "time": "6th April 2017, 11:17 AM", "postID": "post71748791", "replies": []}, {"text": "HI All,\n\r\nI have had my G6 since this Friday that pasted. I haven't had a phone this good for a long time. I previous owned a LG V10 and this phone just out performs all my other phones. Its fast has a battery life that i have very pleased with.  So far I have played games most of the day and i make it home with about 20%. If i charge my phone while driving I have about 60% when i get home. I purchased Three anker USB C cables, they seem good but its a very snug fit. \n\r\nI also have yoo tech  glass on the phone which was a awesome deal. \r\nI am using Spigen  LG g6 Tough Armor  its very small but strong.", "time": "11th April 2017, 12:53 PM", "postID": "post71815809", "replies": []}, {"text": "sometimes on los 14.1 fastcharge isn't working. Else super fast.\r\nendurance with los could be better", "time": "1st November 2017, 12:42 AM", "postID": "post74363983", "replies": []}, {"text": "What is the longest standby time anyone has got from a full charge with light use? My max is just over 47 hours with very little use but I have some standby drain issues. Has anyone had this phone off the charger for 72 hours or more?", "time": "3rd November 2017, 07:53 AM", "postID": "post74389694", "replies": []}, {"text": "On light use honestly i get 6-8h of SoT and yeah i am not kiding.", "time": "4th November 2017, 09:21 AM", "postID": "post74401213", "replies": []}, {"text": "Easily lasts me the whole day, although the drain can be variable even with seemingly the same usage pattern. But even under the worst scenario I am left at the end of a day with 30-40% left. So I charge every night-- what else can you ask for?", "time": "29th December 2017, 07:50 AM", "postID": "post74999383", "replies": []}]}, {"title": "\"Look\" of the device (aesthetics)", "rating": 5.0, "links": ["https://forum.xda-developers.com/lg-g6/review/look-device-aesthetics-t3573468", "https://forum.xda-developers.com/lg-g6/review/look-device-aesthetics-t3573468/page2"], "threads": [{"text": "Much better in person than the photos showed.", "time": "4th April 2017, 02:07 PM", "postID": "post71722175", "replies": []}, {"text": "The g6 is a beautiful phone. Feels premium in the hand and you only have to hold it to fall in love with it", "time": "6th April 2017, 02:01 AM", "postID": "post71744492", "replies": []}, {"text": "This phone looks and feels extremely premium. I love my phone and I've been loyal to LG even reluctantly. They a did a great job this time around\n\n🤜🏾💢🤛🏾", "time": "14th April 2017, 10:18 PM", "postID": "post71863443", "replies": []}, {"text": "I said this is one of kind of phone especially the large screen.  However, I hate LG made full screen but didn't allow user to hide the navigation and expand apps to take advantage of large screen size.   So, what is the point having a large screen while you lose the bottom of the screen to the navigation?  I set all app the use 18:6 ratio but does not work as I expected.  I love it but hate it.", "time": "20th April 2017, 06:56 PM", "postID": "post71950863", "replies": [{"text": "If you did a bit of reading you'd learn most apps aren't yet optimised for the 18:9 display. Quit whinging and enjoy your new phone", "time": "21st April 2017, 01:09 AM", "postID": "post71955035", "replies": []}]}, {"text": "I personally like having the Nav bar always there", "time": "21st April 2017, 01:40 AM", "postID": "post71955282", "replies": []}, {"text": "I love the look G6. Its amazing", "time": "21st April 2017, 07:35 PM", "postID": "post71967349", "replies": []}, {"text": "Yeah I often take it out of the case at home because it just looks so damn beautiful. I love the way it is cut and just how tall the screen is. I do admit. I am used to wider screens but since having this phone I find I prefer this tall screen think phone look and feel.", "time": "21st April 2017, 08:08 PM", "postID": "post71967844", "replies": []}, {"text": "I dig it. Can't wait for the new phone feel to wear off, so I can wear it without the case.  Kinda wanting to hear about any screen cracking problems (or lack their of)too.\nGot the silver one. I think it looks just as good, compared to pictures.", "time": "22nd April 2017, 12:34 AM", "postID": "post71970770", "replies": []}, {"text": "I love the black one (which is what I have), like less the white one and hate the platinum one... Sorry but  a small bezel phone with such good black levels is ruined with a non-black bezel imo! \nI love the effect of the screen being invisible when it's off/showing solid black!", "time": "27th January 2018, 04:55 PM", "postID": "post75352210", "replies": []}, {"text": "Fortunately there is the choice, because for my part I love the ice platinium, the white a little less but it still happens ..\n\nBut the black I do not like at all, it spoils all the curves of the phone and this glossy aspect really gives me a feeling cheap ^^\n\nA color that would give me a lot more: Bordeaux red (I do not know if it means something in English, more simply wine color) with the same brushed metal effect as Platinum", "time": "28th January 2018, 06:45 PM", "postID": "post75364185", "replies": []}]}, {"title": "Quality feel (use of materials)", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-g6/review/quality-feel-materials-t3573469", "https://forum.xda-developers.com/lg-g6/review/quality-feel-materials-t3573469/page2"], "threads": [{"text": "The phone I ordered is the Ice Platinum. \n\r\nThe phone itself feels wonderful in the hand. I particularly love the bevel work along the sides of the phone. Everything feels very well polished.\n\r\nThe camera and finger print sensor are in a good place. The button feels very sturdy. No unusual clicking or hitching. Feels like it will stand years of use quite fine.\n\r\nI am not sure what the back is made of. It's possible it's like the black and is made of glass due to the wireless charging. Either way, it feels very smooth to the touch. Doesn't have a metal texture at all, it feels like smooth glass. Everything on the phone is smooth for the most part except for where the bevels are. They have a bit of a polish though. The non-recessed finger print sensor and camera feel premium.\n\r\nThis is honestly one of the most well constructed phones I've ever owned. Look up G6 tear down on Youtube... they open up the phone and you can see the materials and they also scratch at the back to reveal the glass construction. It takes a beating.", "time": "30th March 2017, 04:43 AM", "postID": "post71645266", "replies": []}, {"text": "I ordered the black (as always due to it matching everything and working well with cases that you can still see parts of the phone body (all cases pretty much... at least the top) and it feels perfect. Of course I put it in a case immediately and refused to use it until my case was on due to liking a thicker phone for holding purposes, but it feels natural just as my LG G2 that I am coming from.", "time": "4th April 2017, 02:09 PM", "postID": "post71722202", "replies": []}, {"text": "I've had mine for 2 days now and coming from an iPhone the visual appeal of the phone is what made me switch over, along with the themes etc. As a first time Android user the go-to phone is usually a Samsung but I'm glad I got this device. I have to take extra care for now as I'm waiting for my phone case and tempered glass to come in the mail. This phone has a premium feel and I am happy", "time": "6th April 2017, 01:59 AM", "postID": "post71744485", "replies": [{"text": "You coming from Apple and not picking Samsung is huge. Seems like you have an objective POV and I think this was a good choice for your first time. You'll learn that there are other manufacturers other than Samsung that can deliver but if you're looking for something that can be a culmination I believe LG is the way to go.\n\n🤜🏾💢🤛🏾", "time": "14th April 2017, 10:27 PM", "postID": "post71863536", "replies": []}]}, {"text": "I dropped mine from one meter high on the concrete. The metal frame has marks on upper right and lower right corners, no sign of damage at the front and the back of the phone. MIL- STD is a must have.", "time": "27th October 2017, 08:17 AM", "postID": "post74310839", "replies": []}, {"text": "Had mine since August (original had some possible defects). AT&T replaced it for free and this thing is absolutely amazing.\nThe build quality of it is incredible. I love the way the metal (Aluminum?) bezel feels. It's smooth and doesn't scrape my hand, the glass back has a nice, slight curve, doesn't crack easy, and is quite durable. The screen is great, especially how the way it matches exactly with the edge of the bezel.\nThat's all I have to say for now on the build quality, but I'll update this post with information later.", "time": "27th October 2017, 12:21 PM", "postID": "post74312697", "replies": []}, {"text": "It has fallen from my hands couple of times, no cracks, no bumbs, and in the hands it feels amazing.. Quality feel for me is at highest range. 😎\n\nPowered by LG G6", "time": "30th October 2017, 03:52 PM", "postID": "post74347805", "replies": []}, {"text": "Wi-Fi ko Kis Tarah hack kiya jaye", "time": "30th October 2017, 05:03 PM", "postID": "post74348617", "replies": []}, {"text": "Hello,\r\nSorry for my english...\r\nI bought a new micro-sd card. \r\nSIM and microSD drawer didn't want to pull out easily.\r\nAfter having extracted the tray, to use it, I realized that it was broken. So I can't put it back on or use the phone.\r\nI contacted the LG support, which tells me that this is not covered by the warranty, and it gives me an address to send for repair.\r\nThe repair estimate just returned... 270.40 €!!!!!!!! \r\nThey're changing the motherboard and the case !\r\nI'm really angry with LG.\r\na piece of advice, don't use this drawer too often.", "time": "4th January 2018, 04:46 PM", "postID": "post75076102", "replies": []}, {"text": "Why didnt you asked them first the costs of repair ? I never repair the phone before they tell me how much will it cost. And why didnt you try to get that drawer on ebay or something ? Lol :S", "time": "4th January 2018, 05:02 PM", "postID": "post75076303", "replies": []}, {"text": "Are you able to get the small piece of plastic out of the drawer that has snapped off? If you can then you can by replacement sim/sd tray on eBay for 10-15 Euro. Good luck.", "time": "9th January 2018, 12:32 PM", "postID": "post75135291", "replies": []}]}, {"title": "Ergonomics (in-hand feel)", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-g6/review/ergonomics-hand-feel-t3573470"], "threads": [{"text": "Fits in the hand like a glove. Can't complain. I'm a small woman (5'0\") but I have long fingers. I can pretty much one hand most of the screen. The finger print sensor is in a great spot too and with the screen being longer, it's harder to cover the camera when holding it (except when in landscape)\n\r\nIt is a little slippery for one hand when taking pictures though. Of course if you get a case, that's easily solved.", "time": "30th March 2017, 04:46 AM", "postID": "post71645297", "replies": []}, {"text": "Coming from a note 5 this phone feels prefect. No more needing to stretch the fingers", "time": "3rd April 2017, 07:08 AM", "postID": "post71703386", "replies": []}, {"text": "PERFECT in every way. And the fingerprint, OMG. It works SO FAST!!! Like literally immediate reading with no errors yet. If you input your fingerprint properly there is never and issue and the fact that I can just pick up my phone and use it while others cannot... AMAZING! I do have extra lock screens set (of course) in case I'm sleep and someone wants to touch my finger to the back of my phone (use common sense people) but to just open and make calls, perfect.", "time": "4th April 2017, 02:11 PM", "postID": "post71722228", "replies": []}, {"text": "I'm loving how this phone feels in the hand compared to how that s7edge felt. The s7edge was a good phone, I loved the screen but the palm rejection kept bugging me. With the G6, that no longer is an issue at all. The phone feels nice and sturdy in the hand and I don't feel like I have to baby the phone. Having said that though, I still got a spigen carbon fiber case for it!", "time": "29th April 2017, 02:07 AM", "postID": "post72083491", "replies": []}, {"text": "My previous phone was an S7 Edge, which felt like a piece of jewelry. It constantly slipped around and generally didn't have stability (particularly for one hand operation). After a couple days of use, I have no complaints and really like the LG G6 so far. \n\r\nMy biggest nag: for users of the Twilight app (or similar), you cannot dim/red-shift the soft buttons (i.e. back, home, app switch).", "time": "1st May 2017, 08:30 AM", "postID": "post72112388", "replies": []}]}, {"title": "OEM skin/software", "rating": 4.0, "links": ["https://forum.xda-developers.com/lg-g6/review/oem-skin-software-t3573471"], "threads": [{"text": "At first glance, I wasn't a fan of the LG aesthetic. Actually I prefer the non-app draw setup. I like that everything is accessible through screens. I may actually take advantage of folders this time...\n\nThe Settings area looks closer to stock. There's not a whole ton of bloat. It's much better than Samsung bloat, that's for sure. There are definitely LG features shipped with it and for the most part they are useful. For the most part, the OS doesn't fill like it is being overwhelmed by branding. The LG stuff is out of the way for most major functions.\n\nSome of my favorite LG features...\n\nThe double tap to unlock the screen is my favorite feature by far.\n\n\"Comfort View\" will be good to use for when I'm not able to sleep and am reading articles. It basically is like the f.lux app for PC. It removes blue light (makes color temperature much warmer) and this is highly customizable. So if you are already staring at screens all the time and just need something more pleasant on the eyes, you can turn this on and off easily in the notification menu.", "time": "30th March 2017, 04:54 AM", "postID": "post71645356", "replies": []}, {"text": "I've never used the LG skin before and I'm happy to say it's alright. I wish it used the new Nougat style compact settings menu but unfortunately it's as cluttered as previous generation phones.\n\nThe biggest issue I have is the theme support. ALL of the downloadable skins are horrible. There are absolutely no modern or stylish skins. They all are the kind of skins you would install on a kid's phone.\n\nThe only usable skins are the default ones (default, platinum, black, white). Even they are annoying because all but the default one put your app icons inside ugly black boxes that make it harder to differentiate the icons.\n\nOther issue is the \"app scaling button\" that appears in the notification drawer and stands on top of your keyboard if you try to use quick reply.\n\nOther than that the skin and software are great and I've been very happy with the experience!", "time": "10th May 2017, 10:16 AM", "postID": "post72237420", "replies": []}, {"text": "Never been a fan of ANY custom (OEM) skin.\nTrue, there are not a lot of themes, but I think that's an issue with the 18:9 aspect ratio too.\n\nSo, hating the LG interface, I just bought Pixel UX theme on play store : so far so good.\nI used only cyanogenmod / lineageos on my LG G2/G3/G4, so could't keep the stock LG theme on my new LG G6.\n\nhttps://play.google.com/store/apps/d...pixel.ui&hl=it", "time": "10th May 2017, 09:26 PM", "postID": "post72245355", "replies": []}, {"text": "I just received my new LG G6 today, and I've been testing things all day.\n\r\nSo far I found 2 issues:\r\n1. No flashlight widget or application. You can only access the flashlight through the notifications bar but it's a 2 step process. You have to slide down the notifications bar then open the drop down to get to the flashlight.  Ideally, a flashlight should be easily accessible. Most times people use a flashlight is when they really need it or in an emergency - spur of the moment circumstances. It would be convenient to have this on the home screen or at least have the option. \n\r\nI read some articles saying that there is a \"torch\" or flashlight widget but there is none to be found. I have no idea what these people are talking about. They right 2 pages about the LG G6 torch widget... I'm guessing they don't even own a G6? And, they assumed it was just like its predecessor?\n\r\n2. Shortcut icons on the lock screen. I have no idea why there are even settings for this or why this is even a feature. First of all, you cannot access the lock screen shortcuts because of fingerprint security or password lock security. Once you unlock your screen, you will enter the home screen rendering the lock screen shortcuts useless. I wanted to remove all of the shortcuts but 2 of them are stuck there and cannot be removed.\n\r\nThese 2 very simple things annoy the hell out of me.", "time": "15th August 2017, 08:03 AM", "postID": "post73407287", "replies": [{"text": "For the Torch light, drag down the notifications tray and you can add \"Flashlight\".\r\nAlso from the Play Store, download \"Key Plus for LG\" you can modify key down or key up buttons, normally double press key down would access to the camera, so you can modify key up to \"Toggle Flashlight\" It works when the screen is off.", "time": "15th August 2017, 05:03 PM", "postID": "post73412476", "replies": []}]}, {"text": "Welcome to android!", "time": "16th August 2017, 05:30 AM", "postID": "post73417927", "replies": []}, {"text": "Great other than the ugly stretch effect when swiping on last or first screen. Also, on my G6 if I choose app drawer, I can only have UI4.0.", "time": "16th August 2017, 09:28 AM", "postID": "post73419568", "replies": []}, {"text": "look is shiny. feels sturdy.\r\nglass isn't the right material for the back of a phone.\r\nIf only they made plastic/carbon back..", "time": "1st November 2017, 12:44 AM", "postID": "post74363989", "replies": []}]}, {"title": "Outdoor visibility (max brightness)", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-g6/review/outdoor-visibility-max-brightness-t3573472", "https://forum.xda-developers.com/lg-g6/review/outdoor-visibility-max-brightness-t3573472/page2", "https://forum.xda-developers.com/lg-g6/review/outdoor-visibility-max-brightness-t3573472/page3"], "threads": [{"text": "Would've loved an amoled screen.", "time": "19th April 2017, 02:42 AM", "postID": "post71922237", "replies": []}, {"text": "Well that's sure to help anyone considering getting the G6. \nAre you sure it's not Amoled? Did you research reviews and specs before you were forced to get your G6? \nPlease don't reply.", "time": "2nd May 2017, 03:20 PM", "postID": "post72131581", "replies": []}, {"text": "Well i have used the phone in direct sunlight and cant really say anything bad about it is readable so tha i can take calls, read texts but i wouldn't go out and start watching a video since when i say direct sunlight its like 90+°F lol but if i sit in a sunlight area with a bit of wind then yes phone is plenty bright enought for me to watch content on and enjoy it", "time": "3rd May 2017, 02:05 PM", "postID": "post72144962", "replies": []}, {"text": "For me it deserves 4 stars. LG G6 is more than sufficiently visible under direct sunlight.", "time": "4th May 2017, 01:11 PM", "postID": "post72158702", "replies": []}, {"text": "It's pretty amazing to me that nobody other than Samsung has figured out oled for mobile screens.  You know lg has been working on it for years, but for some reason they just can't mass produce it.   Samsung has it mastered.", "time": "4th May 2017, 06:26 PM", "postID": "post72162865", "replies": [{"text": "Mastered? Lol... Reddit is full of people complaining about burned in screens on their S8 after just a few days.\n\n\n\r\nComputerBase (Germany) even measured 624nits:\r\ncomputerbase.de/2017-04/lg-g6-test/#abschnitt_sehr_hell_und_hoher_kontrast\n\r\n(Can't post links directly, sorry)\n\r\nDefinitely bright enough.", "time": "4th May 2017, 07:33 PM", "postID": "post72163668", "replies": [{"text": "i didnt know that... i guess i meant they are far, far ahead of anyone else in mobile oled displays\n\r\nim very impressed with the lg g5's display.   super bright, very rich in color.   and crazy sharp.", "time": "6th May 2017, 06:03 PM", "postID": "post72189391", "replies": []}]}]}, {"text": "Actually LG isn't really starting to dabble in small OLED until next year.\n\nAs far as screen quality goes I saw a review stating measured 557 nits, as bright as the iPhone 7. Color accuracy was better than the iPhone and S7. Gamut was a little disappointing with 136% sRGB vs 197% for the S7. All in all a great display, probably the best LCD ever put in a phone.", "time": "4th May 2017, 07:28 PM", "postID": "post72163616", "replies": []}, {"text": "It's summer season where I'm at and yesterday I was at the beach. Visibility is low in outdoor bright light.", "time": "8th May 2017, 12:50 PM", "postID": "post72211616", "replies": []}, {"text": "Probably a weird question, but how is this phone when using with polarised sunglasses? \n\r\nMy Z2 turns to black in some angles in portrait mode and completely black in horizontal.\n\r\nCheers", "time": "21st June 2017, 09:36 PM", "postID": "post72757486", "replies": []}, {"text": "I will have pretty good comparison. HTC 10 was having highest ppi and regarded as the best lCD display. However outdoor visibility was extremely bad. I  am not sure but I think it is a characteristics of LCD display . One thing I notice that even for camera HTC 10 was relying on display. Whenever I was opening camera app the screen was automatically turning 100% bright and  then comeback to normal after closing the app. It happen with third party camera app as well. I will report once I get G6.", "time": "16th July 2017, 04:04 PM", "postID": "post73051450", "replies": []}, {"text": "my experience: under sunlight (outdoor) in automatic brightness it is very difficult to see..... the always on display is completely invisible!!!!\r\nwrong buy for me this g6", "time": "17th July 2017, 11:52 AM", "postID": "post73061303", "replies": [{"text": "Don't use auto brightness. Auto brightness is buggy in most devices. Try to do it manually.", "time": "17th July 2017, 12:50 PM", "postID": "post73061907", "replies": [{"text": "Yes it may be buggy however according to   http://www.androidauthority.com/lg-g6-review-752130/\r\nthe LG G6 display actually gets brighter than 100% when it is set to AUTO.\n\r\n\"Putting it through our testing, we found the display to have a max manual brightness of 556 nits, which is boosted to a very respectable 663 nits when auto brightness is engaged under direct light. In sunlight, this is likely to be even higher\"\n\r\nI have no way to test this myself.  The display is just barely usable in direct sunlight. Better than my G3 though.  I wish it was better in this regard since I use this as my motorcycle GPS sometimes.", "time": "29th July 2017, 01:00 PM", "postID": "post73215089", "replies": []}]}]}, {"text": "Anyone know how it compares with the LG V20 display?", "time": "28th July 2017, 03:54 PM", "postID": "post73205602", "replies": []}, {"text": "If the sun shines directly on the screen on max brightness I can see absolutly nothing", "time": "29th July 2017, 02:11 AM", "postID": "post73210924", "replies": [{"text": "Sorry for you but in the same condiction i see all very well and compared to my previous device (Samsung Galaxy s4, Redmi Note 2 and Lg G3) i think LG G6 is better of all of them, on automatic brightness too...", "time": "29th July 2017, 01:42 PM", "postID": "post73215433", "replies": [{"text": "Do you use auto brightness and/or a screen protector? I guess some phones have brighter screens than others...", "time": "29th July 2017, 07:46 PM", "postID": "post73219126", "replies": []}]}]}, {"text": "Ok. I must modify my opinion. I just used the phone in direct sunlight for 10 minutes, on auto.  Reading websites and using Google maps. It isn't really that bad. Very usable. The best phone I've had so far.  Most of my issue was really the angle of the phone cradle and the motorcycle visor.", "time": "29th July 2017, 08:03 PM", "postID": "post73219276", "replies": []}]}, {"title": "Contrast (true blacks)", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-g6/review/contrast-true-blacks-t3573473"], "threads": [{"text": "This screen has a very nice black point. It's not as extreme as Samsung's AMOLED screen but it is still a nice screen. I largely prefer the LCD to AMOLED simply because of lack of permanent burn-in which means the contrast will remain fairly consistent throughout the life of the phone.", "time": "30th March 2017, 05:09 AM", "postID": "post71645457", "replies": []}, {"text": "I've had issues with AMOLED whites looking creamy whereas my LGs always put out a nice color spectrum.", "time": "2nd April 2017, 11:07 PM", "postID": "post71700171", "replies": []}]}, {"title": "Color saturation & accuracy", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-g6/review/color-saturation-accuracy-t3573474", "https://forum.xda-developers.com/lg-g6/review/color-saturation-accuracy-t3573474/page2"], "threads": [{"text": "The LCD is fairly color accurate all considering. This screen is very close to what I achieve using a hardware color calibrate with my work machines. The reds are not too red (faux saturation) and the cooler tones show up as prominently.\n\r\nIt's just a shame I can't hook up a hardware calibrator to it to test it.", "time": "30th March 2017, 05:24 AM", "postID": "post71645564", "replies": []}, {"text": "I am coming from a OnePlus 3T, so when first firing up the G6 I was a little disappointed. I couldn't believe how much more vivid the AMOLED screen was compared to the LCD. Well, now that I have been using the G6 exclusively for the past two days, I am growing quite fond of this screen.  The colors are quite accurate and precise, just not as vivid/saturated as what I was looking at for the past 6 months.  Liking this phone more and more each day.", "time": "31st March 2017, 11:56 PM", "postID": "post71672463", "replies": []}, {"text": "The screen color temperature is definitely on the cool side, certainly higher than 6500K. \n\nIt is not pleasant at first for me. I've been using Nexus 6P on sRGB mode for more than a year, and the color saturation on the G6 under default, out of the box settings is disheartening. \n\nTo somehow mitigate this, what I did was to enable ComfortView, set at Low Setting. It's far from perfect, but that's better than nothing.", "time": "17th May 2017, 04:42 AM", "postID": "post72322108", "replies": []}, {"text": "How is this compared to the S8/+ ?", "time": "21st June 2017, 09:29 PM", "postID": "post72757434", "replies": [{"text": "From what I saw side by side compared to the S8+ at full brightness, I could see the whites having a more pinkish hue very slightly than the S8+. The S8+ having brighter highlights. Obviously, the S8+ also has deeper blacks, more saturated, and viewing angles are much better because of its AMOLED display.  Other than that, the overall range of colours seemed fairly close between the G6 and S8+.", "time": "25th June 2017, 06:25 AM", "postID": "post72795728", "replies": []}]}, {"text": "Not sure who will see this but I think the G6 LCD screen compared to an amoled like the one's on the oneplus 3/3t/5 and the s8/s8+ is just better in certain scenarios. There are some people who might be audiophile esque and want high fidelity and things like that. And there might be some people who like bass boosted beat headphones and other things like that which are not accurate at all but are enjoyable on a certain level. If you like big bass sound and you are that kind of person then you will like the amoled screen but I am personally not. I like knowing that what I see on my screen is what it is supposed to look like. \n\nFor instance the other day I was looking at a picture of the fifty shades of gray poster. It is supposed to be black and gray but it had a colored tint to it on the s8 compared to a g6 which looked as it should. All I am saying is that there are going to be times when the s8 because it pops colors so much will make what you see innacurate. And that might bother you or it might not. But it bothers me.", "time": "27th July 2017, 09:50 PM", "postID": "post73197225", "replies": []}, {"text": "Exactly what Scape said. Tech people who know their stuff want accurate color reproduction and analytic sound. The wide mass wants flashy Colors and boomsound. Easy people rate phones by how saturated the phone looks. The more saturation = the better. This is complete BS for people who have knowledge about Electronics. Its like comparing people who buy a Classic car and put Chrome rims on it not caring for the paint because \"CROME RIMZ M8\". Where there are also people which buy a classic car, care to make it look as original as possible and know every part of their car.\n\nThe 2nd. Car may look boring to people, but its quality and worthwise extremely preferable. For example a natural Color reproduction can help when taking photos with the G6. If you take a photo on the Amoled Screen of a Galaxy, and then open it on your calibrated IPS, you will be flashed about how different it looks then on the phone. Thats not what you want. \n\nRegarding the Bass... Well i like perfect color recreation but i hate neutral speakers or headphones, im  quite a basshead but i still want a good clarity, deep stage and low noise.", "time": "28th July 2017, 07:46 PM", "postID": "post73208089", "replies": []}, {"text": "Guys did anyone you tried screen color adjustment under settings-accessibility ?", "time": "5th November 2017, 12:41 PM", "postID": "post74413549", "replies": [{"text": "Yeah, i kept my custom color setting enabled for a few weeks since the blue color looked way better. It is only when switching back to the default setting that i noticed how washed out the reds looked. I reverted back to the defaults.", "time": "8th November 2017, 08:40 PM", "postID": "post74451781", "replies": [{"text": "True", "time": "9th November 2017, 07:59 AM", "postID": "post74455839", "replies": []}]}]}, {"text": "I bought G6 after iP6S+ and I'm really disappointed from display over all. Blue is on G6 boosted as hell.  At home I have calibrated displays and iPhone is much more closer. I can't watch photos (photographer) on G6 because of it. Even automatic brightness control is not ok for me. It's still dimmer than I want. LuxLite solved that but colors are terrible.", "time": "30th November 2017, 11:28 AM", "postID": "post74688705", "replies": []}, {"text": "Why my phone is reporting me that I have screen resolution of 1440x2703 and PPI 544? https://imgur.com/a/lNXhw", "time": "6th December 2017, 09:58 AM", "postID": "post74753097", "replies": []}]}, {"title": "Clarity/resolution", "rating": 5.0, "links": ["https://forum.xda-developers.com/lg-g6/review/clarity-resolution-t3573475"], "threads": [{"text": "The clarity and resolution is unbelievable, literally. The one thing I hate is the movies/videos I had that look great taking my whole screen on my other phone now look pixelated when full screen is used for them, but if I play them at 100% (original size) then everything looks even better than the video should look, which is scary. I need to program an upscaler to see if it could help smooth smaller videos out. OR... I guess I could program an app to make videos only use the top half of the screen. hmmm..", "time": "4th April 2017, 02:15 PM", "postID": "post71722275", "replies": []}]}, {"title": "Minimum brightness", "rating": 4.5, "links": ["https://forum.xda-developers.com/lg-g6/review/minimum-brightness-t3573476"], "threads": [{"text": "It could be a tad darker, but if you use the \"Comfort view\" setting in notification menu, you can turn down blue light which works just as well. This setting is highly customizable.", "time": "30th March 2017, 04:37 AM", "postID": "post71645227", "replies": [{"text": "I personally didn't think the yellow tint that Comfort View offers helped me. Instead, I used System UI tuner (This app: https://play.google.com/store/apps/d...muituner&hl=en) to enable the stock android night mode. If you want to try it, it essentially works the same but the tint is more red-ish and is more tolerable in my opinion. However, the intensity of the tint can't be adjusted.\r\nAnyways, I do agree with you that the display should get a bit darker.", "time": "1st November 2017, 01:43 AM", "postID": "post74364292", "replies": []}]}, {"text": "To me, this is the weak point of the screen. It will get acceptably dim, though, if you activate both battery saver and comfort view, but who wants to go through those steps each time you want to read at night? I've just been using one of the night shift apps to dim the screen during night hours.", "time": "1st April 2017, 03:28 PM", "postID": "post71680407", "replies": [{"text": "Thanks for the tip, this combo does make the screen acceptably dark enough. \r\nHas anyone had any luck with automating lg's settings? I have not been successful with Tasker and would really like to schedule this based on time and ambient light sensor.", "time": "14th April 2017, 05:38 AM", "postID": "post71853028", "replies": []}]}, {"text": "Anyone notice the auto brightness toggle not sticking? AT&T model.", "time": "12th April 2017, 04:31 AM", "postID": "post71825097", "replies": []}, {"text": "Lux", "time": "17th April 2017, 09:05 AM", "postID": "post71894605", "replies": []}, {"text": "min brightness could be darker.\r\nmax should be brighter", "time": "1st November 2017, 12:45 AM", "postID": "post74363998", "replies": []}]}, {"title": "Call quality", "rating": 5.0, "links": ["https://forum.xda-developers.com/lg-g6/review/call-quality-t3573477", "https://forum.xda-developers.com/lg-g6/review/call-quality-t3573477/page2"], "threads": [{"text": "Amazingly, it sounds ultra clear and when I use it with my car through bluetooth people can actually hear me without me having to speak extra loud. \n\nFREAKY STORY!!  This is serious\nOH, another crazy thing, using this phone with my car FIXED MY SPEAKERS. Generally my audio in the car played loud, but after pairing my phone and running music through a downloaded app it sounded kind of whatever.. just the norm. But immediately after I played the same song through the stock app and it was ultra loud, clear, more BASS, MID, and TREBLE, etc. After unconnecting my phone, the car now plays music at around the 30% volume level as if it were on maxium volume. Friggin AWESOME!!!! That's probably a freak incident that just happened and may not have anything to do with the phone, but it's been that way for years and the first time I used bluetooth in the car it fixed that.", "time": "4th April 2017, 02:20 PM", "postID": "post71722339", "replies": []}, {"text": "This is the best phone I've used in a long time in terms of call quality. It is EXCELLENT.\n\r\nSpeaker phone goes through very clear as well. My grandmother is very grouchy about whether I sound muffled or \"far away\" and she has yet to complain... she is an excellent way to soundtest my bluetooth/equpment :P\n\r\nBut actually, mostly everyone has mentioned the phone sounding really fantastic when I call.\n\r\nThe ear piece is adequately loud but just can't get over the quality. I come in very clear to people on the other side, so not having to repeat myself as much. Just can't remember the last time I had this much clarity... HD Voice I'm sure helps, but the last time I had a great \"phone\" persay was a Nokia.", "time": "17th April 2017, 09:54 PM", "postID": "post71904154", "replies": []}, {"text": "Clear and strong, on T-Mobile in Ohio.", "time": "9th May 2017, 08:26 PM", "postID": "post72230972", "replies": []}, {"text": "My first LG G6 kept dropping network, and I would cut in and out on phone calls very often. I'm not sure if it was a Freedom network issue or the G6, but I've never had that issue on my G4, so I swapped out the G6 for another one. I'm hoping this one doesn't have any issues, but I also switched to Public Mobile's much better network now too, so hopefully no issues at all anymore. I'm very impressed by everything else, only complaint would be speaker phone volume is a bit low, coming from the G4, but the clarity (most of the time) makes up for it.", "time": "8th July 2017, 10:47 AM", "postID": "post72950192", "replies": []}, {"text": "I'm om Fido right now and my call quality is terrible. I can hear people fine but they say they can't hear me. And it cuts in and out. Im very skeptical about changing phones because it seems like I will have the same issue. I will dig deeper and see if it's a lg problem or Fido problem", "time": "16th July 2017, 05:37 PM", "postID": "post73052500", "replies": [{"text": "I randomly have same issue with mine but 1. It's random. 2. I'm on Verizon, usually never an issue. 3. Most calls are made to cell phones so it could be on their end", "time": "20th July 2017, 07:52 AM", "postID": "post73098086", "replies": []}]}, {"text": "I fixed the problem and it's confirmed. I turned off voice over lte (VoLTE)", "time": "20th July 2017, 03:01 PM", "postID": "post73102526", "replies": []}, {"text": "I will try that. I can hear people really well. But with about half my calls, I cut out for them. Cells and landlines both. Very frustrating. I have AT&T version.\n\n---------- Post added at 06:27 PM ---------- Previous post was at 06:01 PM ----------\n\nI cannot find the VoLTE setting on my AT&T version. Anyone tried adjusting the noise suppression or clarity settings?", "time": "8th August 2017, 07:27 PM", "postID": "post73332061", "replies": []}, {"text": "I'm with Fido as well and I have VoLTE disabled since I got the phone (as recommended by the rep at Fido).\n\nI have found if I have a case on the phone (any case and I have a few all of which are good reputable companies with excellent cut outs on all ports) I need to (almost 100% of the time) need to yell for the other end to hear me without cutting out, even that doesn't always work. If I pull the case off during the call they hear me fine (almost all the time). In all cases I can hear them perfectly.\n\nThis is driving me nuts as I always have my phone in a case and can't figure out what the issue might be. Nearest I can guess is that the mics do not like being recessed in the cases or causes weirdness that the noise cancellation can't figure out.\n\nSOOO frustrating when a phone can be a phone! The rest of the device is pretty rock solid!", "time": "31st October 2017, 05:02 PM", "postID": "post74359878", "replies": [{"text": "Try to turn OFF both noise suppression and enhance voice clarity under call settings", "time": "1st November 2017, 08:12 AM", "postID": "post74366264", "replies": []}]}, {"text": "I honestly hear people better when i call them with whapp, and they hear me better aswell...\n\nAcutally if i am going to be honest, lots of people are complaing to me that they hear me but have a feeling like i am 10m from the phone.. So idk.", "time": "3rd November 2017, 04:44 PM", "postID": "post74394270", "replies": []}, {"text": "I had to disable all the sound \"enhancements\" to get decent voice quality. \n\r\nVoLTE= Off\r\nNoise Suppression=Off\r\nVoice Clarity=Off\r\nWiFi Calling=Off\n\r\nNow, nobody complains.", "time": "1st February 2018, 09:03 PM", "postID": "post75413854", "replies": []}, {"text": "I have people complaining that they don't hear me well. I have to press phone to my cheek :/  . Will try settings from above, and post results in a day or two.", "time": "4th February 2018, 04:42 PM", "postID": "post75445653", "replies": []}]}, {"title": "WiFi strength, range, and throughput", "rating": 5.0, "links": ["https://forum.xda-developers.com/lg-g6/review/wifi-strength-range-throughput-t3573478"], "threads": [{"text": "Pulls all WiFi signals in my home on all bandwidths with no issues, connects almost instant and is ready for use within seconds of connecting. I can use my WiFi in the house from my car much better when sitting outside or in the driveway and my routers are in the middle of the house block by tons of walls.", "time": "4th April 2017, 02:38 PM", "postID": "post71722582", "replies": []}, {"text": "Seems to have trouble switching towers when driving. I have had data drops/disconnects when I can see several Verizon Towers nearby. Its not a verizon issue but phone issue. However, when stationary, seems to maintain high speeds. I have pulled faster speeds with this, then the S7 Edge snapdragon 820.", "time": "17th April 2017, 04:21 PM", "postID": "post71899564", "replies": []}, {"text": "Mine works well and stays connected to my 5GHZ signal... my older phone/devices sometimes have issues connecting in the rooms at the farthest end of my home... which is not a big home by any means but it does have brick wall inbetween. It does very well.", "time": "17th April 2017, 09:51 PM", "postID": "post71904127", "replies": []}, {"text": "Coming from the Note 5 the wifi on the G6 is amazing. My biggest gripe with the note 5 is at my Gym they have 3 different wifi and the note 5 most of the time would either not connect or switch wifi.\nWalked in with the LG6 and instantly sync up to wifi and had no problems switching to different connections.", "time": "21st April 2017, 02:18 PM", "postID": "post71962694", "replies": []}, {"text": "My WiFi experience on the G6 has been quite poor. WiFi disconnects all the time, like multiple times while watching a single YouTube video. I have WiFi set to stay on all the time, and my $30 Kindle Fire has perfect WiFi throughout the entire house and never disconnects. Really wondering how to fix this...", "time": "22nd April 2017, 02:33 AM", "postID": "post71971650", "replies": [{"text": "I used to have a \"n\" wifi router and my laptop (which supports ac mode) never work right. Until one day, I upgraded my router to \"ac\" supported one and it just works perfectly.\n\nJust my 2 cents.", "time": "24th April 2017, 04:35 PM", "postID": "post72010454", "replies": []}]}, {"text": "Gets farther from my wireless router than my note 4 did, and that was pretty good.  Quite pleased.", "time": "9th May 2017, 08:25 PM", "postID": "post72230965", "replies": []}, {"text": "Hi,\ncan anyone check if Your G6 have a problem with \"not seeing\" WiFi 2.4GHz networkson on channels 12,13,14 ? \nI checked two G6 from one delivery. Phone is updated, I did a factory-reset twice. H870 Orange soft. I contact LG support and I was told that probably the motherboard need to replaced...the phone has 2 months and for me it is a factory defect.", "time": "20th June 2017, 06:38 PM", "postID": "post72743203", "replies": []}]}, {"title": "Cellular strength and throughput", "rating": 5.0, "links": ["https://forum.xda-developers.com/lg-g6/review/cellular-strength-throughput-t3573479"], "threads": [{"text": "On my LG-G2 there were many times when I would not receive calls/text messages immediately without a delay. Other times I had no signal period, especially for GPS. This phone's GPS tracks on instantly and I am able to use data with LTE in places I could not before. It's Although I'm JUST outside of the Sprint LTE areas (B.S. considering I'm just a few streets/blocks away from an area with it on their coverage map) and I am now downloading as high as 25MB/s instead of the maximum 2MB/s I was getting before this phone. Phone cellular beats my crappy TWC, now Specturm, internet at times and I pay for the max 300MBps package.  Ain't that a *****", "time": "4th April 2017, 02:36 PM", "postID": "post71722557", "replies": []}, {"text": "Slightly better than my last daily driver, a note 4.", "time": "9th May 2017, 08:27 PM", "postID": "post72230987", "replies": []}]}, {"title": "Speakerphone (loudness, clarity)", "rating": 4.0, "links": ["https://forum.xda-developers.com/lg-g6/review/speakerphone-loudness-clarity-t3573480", "https://forum.xda-developers.com/lg-g6/review/speakerphone-loudness-clarity-t3573480/page2"], "threads": [{"text": "just got mine today, speaker is very good its loud and clear with little to no distortion", "time": "28th March 2017, 01:17 AM", "postID": "post71615814", "replies": []}, {"text": "Much better than other phones I've experienced by far. Sounds clear without rattling speaker sounds when high.", "time": "4th April 2017, 02:31 PM", "postID": "post71722502", "replies": []}, {"text": "Great speaker. It's not as fantastic with music with lower tones, but for voices it is very clear which is fine since that's pretty much all I use my speaker for is for Lynda.com videos (tutorials) and speaker phone. Speech come through clear enough to hear across the room on loud. Speaker could get a bit louder (I've heard louder), but it's not as quiet as some other devices I've had. It's high end is plenty loud for me given I have sensitive ears when it comes to higher tones and noise.\n\r\nSurprisingly it does not interfere with phone calls and everyone is happy about how well they can hear me when I call.", "time": "17th April 2017, 09:56 PM", "postID": "post71904168", "replies": []}, {"text": "While the speaker is pretty clear and loud I don't like the location at all. If you turn your phone sideways for games or movies your hand 🖐️ sits right over the speaker. Very annoying if you sit your phone on your thumbs with pointer fingers going up.", "time": "19th April 2017, 05:07 AM", "postID": "post71923546", "replies": []}, {"text": "It's decent", "time": "20th October 2017, 07:24 AM", "postID": "post74226858", "replies": []}, {"text": "When compared with other smartphones in the same price range this smartphones sound quality is better..\r\nIts clear and loud", "time": "23rd October 2017, 10:01 AM", "postID": "post74262568", "replies": []}, {"text": "The loudspeaker is pretty decent doesn't make strange sound on full volume while my Redmi 4x volume is too low as compare to G6", "time": "27th October 2017, 07:52 AM", "postID": "post74310669", "replies": []}, {"text": "As far as I'm concerned, the speaker volume is the worst part of this device.  I have to set volume to the max to get a decent sounding ringtone. It's very clear and has great quality, but it's just too weak.", "time": "25th November 2017, 04:47 AM", "postID": "post74627571", "replies": []}, {"text": "One of the loudest speakerphone having mobile phone.\nI am so impressed with its performance.\nI am coming from Nexus 5X.", "time": "28th November 2017, 09:54 AM", "postID": "post74664771", "replies": []}, {"text": "Coming form iP6S+ and because of that I'm disappointed. Almost no low tones. It seems like it's good for voice, but not for music", "time": "30th November 2017, 11:34 AM", "postID": "post74688751", "replies": []}]}]