[{"title": "Overall love", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s8/review/overall-love-t3645185", "https://forum.xda-developers.com/galaxy-s8/review/overall-love-t3645185/page2"], "threads": [{"text": "I can't believe I'm saying this but I love it! Other than that dumb fingerprint scanner :| Ughhh I just use pattern! feels really strange to use pattern thesedays\nIt also has that good old samsung lag and stutter but it's much more acceptable now. It stutters and it's nowhere near smooth 60fps but not torture either!\nIT'S ALSO SOOOO goood in your hands! my s7 edge wasn't very nice to hold without a case", "time": "29th October 2017, 11:27 AM", "postID": "post74334920", "replies": []}, {"text": "I love love love regular S8 but battery life is a real bummer", "time": "10th December 2017, 03:05 PM", "postID": "post74799130", "replies": [{"text": "Really?  How about turning off Sync and manually syncing only when you need to.  I get the word \"smart\" is placed in front of the word \"phone\" but the real use of the device is as a PHONE.  For any other use, even Samsung sells that \"dock\" thing where you *can* use the phone as an android desktop-like replacement, but even there, its plugged in while in that use!\n\nBecause I'm not constantly checking emails and not using those communications apps that many of your type of person seems to use, I don't need Sync turned on, and would rather have the option to do manual sync on EVERY app, where some fail this (or have in the past) requiring lots of extra steps too get them to sync when you want to ...\n\nIts that constant SYNC of data that you aren't using *right now* that is always draining your battery.  Otherwise I'm sure you're not complaining that you use all these apps all the time, and by nature of the fact that using memory and processing capabilities actually USE power from the only source it has (the battery) .. right?\n\nIts not the same argument as the recent Iphone garbage where Apple was caught deliberately slowing down the processing to conserve battery draws to maximize the length of time the \"smart\" in the smartphone could actually run.. nor is the battery life an issue with regards to the explosive fire causing nature of the previous note gen phone right?\n\nOr do you actually think you should be able to play racing games on your phone for hours at a time, without consequence? or have constant wireless or cellular data in use downloading or just even CHECKING for updates regardless if there are any .. \n\nI don't begrudge your type of user from wanting more battery life, but you have to accept the responsibility for your actions too .. if you wanted longer battery life, you'd need to chose options more accordingly.  This phone has no \"user replaceable\" battery, and in days of old, companies would make extra capacity batteries and would include a new back cover for your phone to allow for the bigger battery bulge.. \n\nI don't like the saying  .. but its true in this case .. It is what it is.  The battery will only last as long as the power draining apps you run can be sustained.\n\nPS/Edit: by the way on my S8 I'm getting nearly 2 days of use, I play 4 games regularly, but none of them that require constant processing power, so the largest use of that power is the screen being on.  And with that, I manually lower the brightness so that it is less than what the \"auto\" setting would use.\n\nand an FYI ... anything that does \"location\" work ... thats a big energy hog too .. geo location with satellites is yet another battery drain.  Social heart-beat apps too how do you think they know where you are or you know where they are? ... close proximity broadcasting and data transmissions .. you either find out through Bluetooth or a combination of that plus Geo-Location sent back to their servers .. data data data and MORE data.. ... read that as battery zapping bits moving about when you don't need them ... wanna know if your friend is close by? how about looking up and away from your phone for a minute?", "time": "17th January 2018, 06:02 PM", "postID": "post75235342", "replies": []}]}, {"text": "Love it too, wish the snapdragon ver had root with magish", "time": "11th December 2017, 07:24 PM", "postID": "post74813489", "replies": []}, {"text": "Lots of love on this thread!!", "time": "5th January 2018, 09:46 AM", "postID": "post75085036", "replies": []}, {"text": "I know Im a bit late to the party,  (I always wait about 3 - 6 months before buying a flagship, so the bugs get sorted)  but I Just got my regular S8 (Ive used an S8+, but in UK... the + is STILL an extra £10p/month on contract).. and yep... I love it too.. its awesome and Bixby is actually useful and interesting now... Unlike HTC who have done Nothing with Sense Companion at all..\n\nMy only gripe with the S8 over the S8+ is the tinney speaker on the S8... the S8+ sounds far better and a bit louder as well... but on the whole... awesome phone.", "time": "6th January 2018, 09:36 PM", "postID": "post75104956", "replies": []}, {"text": "I did the pre-order via BestBuy and luckily qualified for and recieved the 256gb sd card, AKG headphones along with the VR headset. So in that respect, extremely happy.\n\nThe phone itself is very good. The camera & video can be excellent especially in sunlight, night shots are good too.\nWith 64GB space I can take over 2000 pics and videos before I have to download and erase.\nSpeaking of space, one thing I have been waiting for, for years is the ability to hold all my mp3s on one device. The 256gb card does it for me. I think there's 40k odd songs on it right now. Of course during all this time of waiting, it's not really that important anymore with all the streaming services available. I have amazon prime/unlimited music so...\n\nSpeedwise I can't complain, I just pulled 50Mbps this afternoon on my local tower. The camera is mostly quick to respond though I miss the shake to wake camera app my last Moto had.\n\nBiggest non-love is the screen. Not a fan of the long and skinny aspect ratio. I think the S7 Edge with 5.5\" is the better form factor, but I had an S6 and didn't want an immediate upgrade, I usually skip a year. But really other than that I like everything about the S8. Does everything I want it to without complaining. Can't get much better than that!\n\n---------- Post added at 12:13 AM ---------- Previous post was at 12:08 AM ----------\n\n..oh yeah Bixby. WTF is that stupid thing anyway? What a dumb name. Useless button. I wish they'd just kill it off, give it a graceful death and let the button be assigned in settings. sorry for the neg in the love thread but somebody had to say it", "time": "9th January 2018, 11:13 PM", "postID": "post75142108", "replies": []}, {"text": "I did like my s8 UNTILL all the adds started, now its none stop with adds, so as a life timer haven a samsung phone, i now have decided to switch over to a iphone,  simply due to iphones are not having the intrusive  add issues samsung has going on, so to sum this up you at samsung are going to loose alot of customers because  of the adds you think u must put out, so ill say good bye to samsung shortly and start a new chapter with my new iphone, you  guys must realize  u made the phone we buy the phone it now becomes our phones and if we wanted all the adds we would go online and get them,  we dont want all the adds like you have now, get rid of these adds and you  will gain back  lost customers", "time": "28th January 2018, 01:00 PM", "postID": "post75360668", "replies": [{"text": "ads?  What ads were you getting?  And when did they start?  Which cellular carrier?\n\r\nThe only thing with ads in them are the apps you use.  Example Visual Voicemail .. the current version of it you either pay for it, or you get ads, regardless if you're using the full extent of the program or just using the basic version of it.  And so in a case like that, the answer is simple really .. don't use that app, I mean like ever. \n\r\nOther than visual voicemail there hasn't been any samsung included app on mine (under Boostmobile) that generated ads, external to using the app and even with visual voicemail, it won't show you ads unless you're actually using the app.  I do have gripes that the basic apps that came with the phone lost some of the features that were in the older (other) generations of the phone but in 60 days of use not one ad ever.", "time": "28th January 2018, 04:55 PM", "postID": "post75363016", "replies": []}, {"text": "Is this dude SERIOUS??", "time": "17th February 2018, 12:19 AM", "postID": "post75595113", "replies": []}]}, {"text": "Yes i love the s8 honestly i love this phone so much.  roms custom kernels, hacking the samsung them strore doing all the crazy stuff getting 35 hours battery time on single charge listing to 16 hours of music time that display is so cool even that iphone X is suppose to befaster or whatever the S8 is so much better lol the only phone i consider to bay after i had my s8 since is it came out about year ago was the Note8 but it was to big:", "time": "11th February 2018, 10:59 AM", "postID": "post75524549", "replies": []}, {"text": "I can get 35h off the charger and 7 hours of SOT with mine. I don't have any complaints whatsoever. Root isn't even a necessity for me anymore because there's so many built in features.", "time": "11th February 2018, 11:06 PM", "postID": "post75532290", "replies": []}, {"text": "I came from multiple iphones (before them I had android devices). I must say this phone is awesome! Only thing I would like to be better is sot. I can only have 3/3,30h...", "time": "12th February 2018, 09:09 AM", "postID": "post75536421", "replies": []}]}, {"title": "Community development strength", "rating": 3.5, "links": ["https://forum.xda-developers.com/galaxy-s8/review/community-development-strength-t3645186"], "threads": []}, {"title": "Overall speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s8/review/overall-speed-t3645187", "https://forum.xda-developers.com/galaxy-s8/review/overall-speed-t3645187/page2", "https://forum.xda-developers.com/galaxy-s8/review/overall-speed-t3645187/page3"], "threads": [{"text": "It's ok still has a way to go tho", "time": "15th August 2017, 01:07 PM", "postID": "post73409745", "replies": []}, {"text": "I can say it, the phone is \"fast\", maybe not the fastest, but phone is fast, I've not used a galaxy series phone as my daily driver since Galaxy Note 2, however I've tested every Galaxy series phone, And with S8 plus finally I went back again to Galaxy series phone as my daily phone.. That's all I can say about it.", "time": "15th August 2017, 09:33 PM", "postID": "post73415073", "replies": [{"text": "I can agree on this. I have been using iPhone 3 years now and finally i came back to samsung android camp with release of s8+.\r\nIt's fast but it ain't so smooth than i expected it to be. I mean for time to time when i use multiple apps at the sametime, it stutters and keyboard lags time to time too. \r\nOtherwise it's really good.", "time": "7th September 2017, 04:42 PM", "postID": "post73703636", "replies": []}]}, {"text": "Coming from the S6, i can positively say that i have noticed an improved experience in terms of fluidity and multitasking. Really can't complain right now", "time": "24th August 2017, 11:33 AM", "postID": "post73521626", "replies": []}, {"text": "Try setting your performance mode to game mode and the phone seems to be smoother and faster. Not sure if it's just a placebo effect though.", "time": "29th August 2017, 01:59 AM", "postID": "post73578371", "replies": []}, {"text": "regarding to S5 - awsome :P", "time": "2nd September 2017, 04:16 PM", "postID": "post73637053", "replies": []}, {"text": "Slows down a lot after some months. camera starts slow and is not reliable. RAM Management is shitty for a flagship.", "time": "28th September 2017, 11:44 PM", "postID": "post73969391", "replies": [{"text": "Clear your cache in recovery!", "time": "29th September 2017, 07:12 AM", "postID": "post73972047", "replies": [{"text": "thanks, tried that already but it did nothing. only thing what helped was a full wipe. for now it's much faster ( i asume for a month or so)  but still lags more than my old 6P. Let's see if it will  improve when they update it to android 8 next march.", "time": "3rd October 2017, 10:52 PM", "postID": "post74026386", "replies": [{"text": "Lol 6p was the laggiest garbage phone I've ever owned", "time": "4th November 2017, 02:44 AM", "postID": "post74399217", "replies": []}]}]}, {"text": "Same her. The slowest device i own.", "time": "30th September 2017, 06:54 PM", "postID": "post73989231", "replies": []}]}, {"text": "Got to say I've only been using this phone for just over 1 week and the last few days it's started lagging already, which is a real surprise imo, had an S7 edge a year ago and it wasn't like this. \n\nHowever after finding this thread I checked my mode and it was set to optimised mode, so set it to performance mode and will see how it goes.", "time": "3rd October 2017, 01:27 PM", "postID": "post74020371", "replies": []}, {"text": "Bought less than a week ago, previous phone OnePlus3 - used for a year.\r\nOnePlus 3 became slower than when i just bought it after a year because of all the stuff installed etc, obviously.\r\nSo this phone i have now(s8) - feels about the speed of OP3(after a year, not new) - and often times even slower.\r\nReally disappointed.\r\nI factory reset my OP3 to sell it, it feels like a lightning compared to s8.\r\nI am afraid to think how this thing will work after few months...\r\nYes ok great display(feels smaller than OP3 though because of weird aspect ration, also more comfortable in hand, to be honest, but smaller)\r\nYes very good camera(reviews say, tried to take few pics yesterday, didn't see any noticeable difference to be honest, but ok may be i dont know how to shoot).\r\nBut except for that dont feel like it justifies the price.\r\nThe fingerprint sensor is amazingly crappy after OP3(again we are talking a 1.5 generation older chinese phone!!!)\r\nI am really afraid after few months it will go real slow.\r\nThe only good thing since its galaxy i believe it d be easier to sell if want to later, compared to OP5 which would come way cheaper if i chose it.\r\nI ll give it some more time, if i feel like its getting even slower i ll sell it and buy an OP5.\n\r\nHonestly though, for that price they should be ashamed at Samsung for selling a phone that cheaper chinese brands easily outperform it.", "time": "10th October 2017, 08:00 AM", "postID": "post74102865", "replies": []}, {"text": "I've been using my phone in \"High-Performance\" mode for a week now and so far so good, even though I've since found out that there is no boost from the CPU in this mode it seems much more fluid compared to the \"Optimised mode\".", "time": "10th October 2017, 12:24 PM", "postID": "post74104989", "replies": []}, {"text": "Not fast. it lags and stutters and isn't smooth but it's ok! I think I can kinda live with it?!", "time": "29th October 2017, 11:28 AM", "postID": "post74334929", "replies": []}, {"text": "The problem with this thread is that not everyone who is complaining bought the phone. Some just hate Samsung, some just write based on what they read on the internet. \n\nIts a shame XDA has so many trolls atm.", "time": "2nd November 2017, 01:08 PM", "postID": "post74380089", "replies": []}, {"text": "I kicked myself for not jumping on to the Verizon 50% off deal on the Google Pixel 2. This Samsung S8 blows, it lags way too much after some use i have to close all the apps (at times not that many are running) or just restart the phone.  I would have assumed for a flagship phone this would be a lot faster.  I'll have to wait for another deal before I toss this phone and get a Pixel 2.", "time": "28th November 2017, 02:43 AM", "postID": "post74661664", "replies": [{"text": "Coming from OnePlus 5 i must say except from screen and camera(in some scenarios only), everything else is a downgrade for me. For the first 3 days i felt i have moved to a 2 years old device but i am adjusting to it slowly. Thing i hate the most about this phone is RAM Management. It is so poor that sometimes system apps gets reloaded just after 10-15 minutes.\n\n---------- Post added at 12:34 AM ---------- Previous post was at 12:31 AM ----------\n\n\n\r\nExactly! The irony is, even system apps gets reloaded after 10-15 minutes.", "time": "27th December 2017, 07:34 PM", "postID": "post74982764", "replies": []}]}, {"text": "I would give a \"quickness\" rating of 3/5 if I consider the performances of the phone out of the box. I mean it's ok, but can get messy.\r\nHowever, after flashing a decent rom and rooting the thing, debloating most of samsung crap with package disabler or equivalent, I managed to get something really really fast that deserves a 5 stars rating.", "time": "7th December 2017, 08:34 AM", "postID": "post74763680", "replies": [{"text": "Which rom? Which root method?\n\r\nI've held off on rooting for now due to the supposed 80% battery limit, and because I haven't seen many good roms out. Could just be me, though.", "time": "31st December 2017, 05:43 PM", "postID": "post75028818", "replies": [{"text": "I've been running renovate ice roms (nougat and oreo beta version) for a couple of months now.", "time": "1st January 2018, 01:26 PM", "postID": "post75036258", "replies": []}, {"text": "I've got my (Exynos) S8+ running this ROM with Magisk, and it definitely feels faster. No lag or stutter whatsoever, or any other performance complaints for that matter.\n\r\nFor me, debloating alone makes worth rooting. I haven't had that 80% battery issue, but anyways battery performance really improved over the stock samsung ROM.\n\r\nWith that being said, coming from a Moto Z Play as my daily driver for about a year, I can't really say the Samsung feels $500 faster by any means. And it goes trough the battery waaaaay faster.", "time": "2nd January 2018, 07:58 PM", "postID": "post75052353", "replies": [{"text": "Ah, I see. If only there was a well developed AOSP ROM solution as there always was for phones like the GS4 back in 2013-2015. It's been close to a year and I'm not seeing very pleasing ROM options, other than the tweaked TouchWiz ROMs which I deem to have basically the same features.\n\r\nThanks though, hopefully I won't screw up the root process", "time": "4th January 2018, 06:29 PM", "postID": "post75077448", "replies": []}]}]}]}, {"text": "I honestly do love this phone but got a crack on the corner of screen from a 2 feet drop onto carpet really disappointing thinking of just getting the note 8 but I might just go with the pixel 2 xl yeah I'll be missing some key features that Samsung offers but I just love the idea of having every new update for the next three years and straight from the source as well", "time": "10th December 2017, 12:44 AM", "postID": "post74793189", "replies": []}]}, {"title": "App launch speed", "rating": 4.0, "links": ["https://forum.xda-developers.com/galaxy-s8/review/app-launch-speed-t3645188"], "threads": [{"text": "It's ok!", "time": "29th October 2017, 11:29 AM", "postID": "post74334936", "replies": []}]}, {"title": "Multitasking/RAM", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s8/review/multitasking-ram-t3645189"], "threads": [{"text": "I haven't tested it but it's good enough for me! holds like 9 apps I think or maybe 10? multi tasking on that huge tall display is amazing!", "time": "29th October 2017, 11:30 AM", "postID": "post74334946", "replies": []}]}, {"title": "Scrolling smoothness", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s8/review/scrolling-smoothness-t3645190"], "threads": [{"text": "Lags and stutters :| not horribly though! it's like console compared to a PC (iPhone and others being a PC ok maybe more like 144hz compared to 30-60fps )", "time": "29th October 2017, 11:31 AM", "postID": "post74334951", "replies": []}, {"text": "I am also interested why every android while using data lags.", "time": "29th October 2017, 01:44 PM", "postID": "post74336059", "replies": [{"text": "Not every Android. Stock Android does not lag at all. Try a Pixel for a day and report back. \n\r\nSammy just has way to much bloat on top of Android. Even 6 gigs on the Note 8 cant fix the occasional lag.", "time": "1st November 2017, 04:57 PM", "postID": "post74370532", "replies": [{"text": "Pixel does lag as well when using data in background. I've tested it. Just ios change priority to higher when on the top and giving less priority to network access to make UI smoother.", "time": "1st November 2017, 05:27 PM", "postID": "post74370853", "replies": [{"text": "Good to hear buddy. Glad you tested it. \n\n\r\nI have a Note 8 and a Pixel 2 in my hands right now.  Night and day difference. But since you tested it for me, you must be right.", "time": "1st November 2017, 05:34 PM", "postID": "post74370933", "replies": [{"text": "We were talking about Pixel nature Pixel in first place, did we? I don't know pixel2 and oreo. Maybe you're right. I was comparing my girlfriend's pixel 1 with my s8 couple months ago. PXL definitely better than s8+ but not buttery smooth. Do you own one? Make a video with profile gpu rendering On.", "time": "1st November 2017, 06:42 PM", "postID": "post74371625", "replies": []}]}]}]}]}, {"text": "With chrome browser things are a bit better. Defenetly the stutter is there but not as persistant as it is on the stock internet explorer.", "time": "30th October 2017, 12:18 PM", "postID": "post74345749", "replies": []}, {"text": "As a mobile dev in a first phase I thought it was caused by the app I was working on, but I can definitely say that this stuttering is actually a system-wide issue with the S8 \n\r\nIt's probably related to the Samsung's Android ROM; I'd love to hear feedback from ppl with custom ROMs, I'm quite confident they don't have this kind of issue.", "time": "31st October 2017, 02:52 PM", "postID": "post74358360", "replies": []}, {"text": "No scroll stutter in anything except facebook app and playstore which forced me to actually use facebook via chrome and the problem was solved. I have disabled a whole bunch of services and other apps and it helped quite much.\n\r\nA tip for chrome users is to enable data saver built in option and use adblock. Ads these days are one of the main causes of stutter in web browsing.", "time": "31st October 2017, 07:58 PM", "postID": "post74361788", "replies": []}]}, {"title": "Heat", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s8/review/heat-t3645191"], "threads": [{"text": "Lol....3 posts and you can came to spot this nonsense?!", "time": "14th September 2017, 12:54 PM", "postID": "post73788728", "replies": []}, {"text": "Using TomTom app for over an hour yesterday and my S8 really contributed to global warming. No it wasn't charging at the same time and not attached to the windshield nor in direct sun-light.\nOn the other hand I experienced this same effect with previous smartphones 😉", "time": "15th September 2017, 08:17 AM", "postID": "post73798895", "replies": []}, {"text": "You wouldn't expect to use a PC/Laptop for an hour or more and it not get hot. The same goes for a phone which is essentially a small PC!", "time": "20th September 2017, 02:08 PM", "postID": "post73864390", "replies": []}, {"text": "max Temp with mine under load is 43°c (Aida64). Battery is a bit lower. \n\nAnyways most if not all of the modern SoCs are getting warmer then odler Models (Which is normal) . I think thats why many Devices have a Heartpipe build in now.\n\nThe only SoC where i was worried was the Snapdragon 810 in the HTC M9.", "time": "20th September 2017, 03:13 PM", "postID": "post73865163", "replies": []}, {"text": "I found this device (G950F just to be more precise) to be a bit cooler than the previous iterations (and I've used all it's predecessors),  probably the large footprint has an influence here as well.", "time": "24th September 2017, 11:55 AM", "postID": "post73912694", "replies": []}, {"text": "Mine gets a little warm, but I haven't gotten it uncomfortably so, regardless of what I've thrown at it so far.  Seems to top out in that \"noticeably warm but not uncomfortably so\" range, which is nice", "time": "30th September 2017, 07:50 PM", "postID": "post73989734", "replies": []}, {"text": "Had my phone for only 24H no heat yet! but the same happened with my s7 edge for some reason even after re flashing the stock rom with ODIN it started heating like crazy! also I haven't taken it outside yet, my s7 edge's battery goes up to 37 outside! even up to 38!", "time": "29th October 2017, 11:32 AM", "postID": "post74334956", "replies": []}, {"text": "Had mine for 2 months now. It warms up after prolonged use but what do you expect? It's normal! Nothing unusual", "time": "29th October 2017, 05:52 PM", "postID": "post74338542", "replies": []}]}, {"title": "Low light", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s8/review/low-light-t3645192"], "threads": [{"text": "I have this image to add", "time": "11th November 2017, 04:43 PM", "postID": "post74480507", "replies": []}, {"text": "How to remove viewfinder lag when shooting in dark?", "time": "12th November 2017, 03:36 PM", "postID": "post74490389", "replies": []}, {"text": "I am getting bright spots when i take pictures with flash and camera close to object.", "time": "14th November 2017, 07:06 AM", "postID": "post74508539", "replies": []}]}, {"title": "Photo quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s8/review/photo-quality-t3645193", "https://forum.xda-developers.com/galaxy-s8/review/photo-quality-t3645193/page2", "https://forum.xda-developers.com/galaxy-s8/review/photo-quality-t3645193/page3"], "threads": [{"text": "yes, i am surprised at the quality of the front camera. \"pathetic\" is the word i would use. \n\noneplus 3 and 5 both have an amazing front camera.\n\nshame on you, samsung. it's amazing that with so many loyal customers you would cut corners on this.\n\nrear camera is top-notch, though!", "time": "11th August 2017, 05:34 PM", "postID": "post73366147", "replies": [{"text": "Just switched from the G6. Now that was a ****ty front camera", "time": "12th August 2017, 02:34 AM", "postID": "post73370405", "replies": []}]}, {"text": "S8 produces in auto mode the best combination of good light and low light shots. In good light, there is a bit over-sharpening going on but no so much to destroy the photo quality.  The handling of exposure is very good , the detail also and the colors are rich. At low light shots , S8 is the king with clear improvement over the S7/S7 edge. Better detail, low noise levels, more accurate colors, better handling of light flares. My only complaint is that in the evening light, the S8 camera gives more light that is needed. If for example you take a shot of the sky at 20:00 it will appear as it was taken one hour earlier at 19:00.  In general there is no phone out there that can beat S8 at the triple combination of design+display+camera in auto mode. I am always talking about the rear camera. I never use the front camera on my phones ( i hate the trend of selfies ).", "time": "13th August 2017, 12:53 AM", "postID": "post73381134", "replies": []}, {"text": "Back camera produces nice colors but the quality, or sharpness/details level is downright bad.\nComing from Pixel is maybe putting the bar high but the rear camera here is just bad.", "time": "17th August 2017, 09:12 AM", "postID": "post73431880", "replies": [{"text": "Quick tip, go into pro mode, and change nothing other then -0.2 exposure, (during day) and iso around 150-500 for low light, you will be amazed.", "time": "17th August 2017, 01:11 PM", "postID": "post73434292", "replies": [{"text": "There is a slight improvement with the exposure tweak.\r\nHaven't tried low light yet\r\nThanks.", "time": "17th August 2017, 03:52 PM", "postID": "post73436147", "replies": [{"text": "You can even try -0.3 depending on how much light there is, in sunlight even 0.3 is great and balances the very bright scenes, and gets you alot detail in overexposed areas.", "time": "17th August 2017, 04:11 PM", "postID": "post73436349", "replies": []}]}]}, {"text": "You must be a terrible photographer then lol one of the best rated phone cameras that exist", "time": "4th November 2017, 02:50 AM", "postID": "post74399248", "replies": [{"text": "Must be a troll lol one of the least useless posts there are", "time": "4th November 2017, 05:22 PM", "postID": "post74405232", "replies": [{"text": "Because I know a lot about photography and know how good the camera is? Yep, everyone that disagrees with you is a troll. Solid thinking....", "time": "4th November 2017, 07:50 PM", "postID": "post74406660", "replies": [{"text": "No man, just your lack punctuation, general tone, and usage of \"lol\".", "time": "4th November 2017, 08:10 PM", "postID": "post74406852", "replies": [{"text": "Your lack punctuation eh...", "time": "4th November 2017, 08:14 PM", "postID": "post74406886", "replies": [{"text": "fourth grade had a lot to offer in that regard, I suggest you don't skip it this time.", "time": "4th November 2017, 08:21 PM", "postID": "post74406945", "replies": [{"text": "You missed the joke.... Like your lack words you mean?\n\r\nI have two degrees thanks!", "time": "4th November 2017, 08:44 PM", "postID": "post74407142", "replies": [{"text": "Well darn, I missed an \"of\". That must make the camera so great.", "time": "4th November 2017, 09:31 PM", "postID": "post74407500", "replies": [{"text": "So missing a period makes me a troll, as well as making my argument invalid, but a distinct lack of understanding English on your part doesn't? You're an interesting fellow. Anyway let's move this to pm if you're so inclined. You'll receive no further response from me here.", "time": "4th November 2017, 09:41 PM", "postID": "post74407585", "replies": []}]}]}]}]}]}]}]}]}, {"text": "Post some examples, cos in my experience the S8 rear camera is really good, and I've tried a few phones over the last year or so, and the S8 is easily the best thus far...", "time": "4th November 2017, 11:05 PM", "postID": "post74408194", "replies": [{"text": "Yep it isn't one of the top rated by every review site and photography site for no reason", "time": "5th November 2017, 01:28 AM", "postID": "post74409064", "replies": []}]}]}, {"text": "I did post an example, comparing the S8 to the Pixel.", "time": "5th November 2017, 06:01 AM", "postID": "post74410732", "replies": [{"text": "Please repeat the link or photo, i can't find it in the thread, thanks", "time": "5th November 2017, 06:46 AM", "postID": "post74410941", "replies": [{"text": "He can't and won't...\n\nAnyone can google it if they're so inclined. The pixel and s8 are equally rated by pretty much every site", "time": "5th November 2017, 12:00 PM", "postID": "post74413164", "replies": [{"text": "You mean can and won't. I'm not going to spoon feed.", "time": "23rd November 2017, 04:29 AM", "postID": "post74606311", "replies": []}]}]}]}, {"text": "If anyone interested, here's a comparison between 2 shots taken with respectively Samsung Camera vs Open Camera, both in auto settings mode, focus set at the exact same point - on the mouse.  1st shot is samsung camera, 2nd is open camera\r\nI've been finding that the open camera produces a bit more realistic lightning as well as slightly less noise but maybe decreased sharpness.\n\r\nAlso, I think the overall quality of the rear camera, even if better than most of what's being available today in the phone catalog, is not that good. It lacks details and sharpness.\r\nI have never found a camera that could match what the Lumia 1020 was capable of achieving: enclosed, cat picture taken with the said lumia. I mean if you look closely you can actually see my reflection in the cat's pupil.", "time": "23rd November 2017, 04:09 PM", "postID": "post74611739", "replies": []}, {"text": "I loved this quality..", "time": "28th November 2017, 09:29 AM", "postID": "post74664574", "replies": []}, {"text": "Has anyone tried the port of the google camera?\nWhat is the best Gcam mode for our S8?\nI am testing model Pixel 1, Hdr +", "time": "9th December 2017, 11:16 AM", "postID": "post74786350", "replies": []}]}, {"title": "Video quality", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s8/review/video-quality-t3645194"], "threads": [{"text": "Horrible", "time": "16th March 2018, 06:01 PM", "postID": "post75912050", "replies": []}]}, {"title": "Selfie quality", "rating": 3.5, "links": ["https://forum.xda-developers.com/galaxy-s8/review/selfie-quality-t3645195"], "threads": [{"text": "Amazing quality even in low light conditions", "time": "8th March 2018, 03:26 PM", "postID": "post75817201", "replies": []}, {"text": "Selfie cameras are made for disabled amoebas. I would get rid of this bullshit module, and replece it with something handy. IR blaster for example.", "time": "15th March 2018, 02:11 PM", "postID": "post75898117", "replies": []}, {"text": "With Google camera it is amazing", "time": "16th March 2018, 05:59 PM", "postID": "post75912027", "replies": []}]}, {"title": "Time to take picture (camera launch speed)", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s8/review/time-to-picture-camera-launch-speed-t3645196"], "threads": []}, {"title": "Software (ease of use, features, etc)", "rating": 4.0, "links": ["https://forum.xda-developers.com/galaxy-s8/review/software-ease-features-t3645197"], "threads": [{"text": "There is no option to add a shortcut to Google Photos on my S8 - not in the google photos app, not in the settings of the camera. \nI can't disable/uninstall the gallery that Samsung is providing.\nI can't set Google Photos as a default gallery app. \n\nThis is the ROM which I don't wanna switch to a custom one because I don't want to lose some of the great options that this ROM provides.\n\nBut unless I get an answer to how to eliminate these problems, I will have to custom rom it a bit.", "time": "25th December 2017, 07:14 PM", "postID": "post74960266", "replies": []}, {"text": "on a custom ROM (batman ROM 1.5.0) is very close to stock and with it you can delete any system apps, i deleted samsung gallery app and installed a 3rd party app as gallery option.", "time": "27th December 2017, 07:04 PM", "postID": "post74982507", "replies": []}, {"text": "Samsungs have one of the most intuitive, easy to use interfaces.\n\nMy uncle (in his late 60s) learn to use a Samsung within days. And he never used a smartphone before. This says a lot about ease of use.", "time": "5th January 2018, 09:47 AM", "postID": "post75085057", "replies": []}]}, {"title": "Charging speed", "rating": 4.0, "links": ["https://forum.xda-developers.com/galaxy-s8/review/charging-speed-t3645198"], "threads": [{"text": "I got problems with it...\nSometimes it charges really quick, like Quick Charge does. But then sometimes it says it needs about 8 hours to charge fully.\nThats why i voted Average 3* and charging speeds sometimes even differs if i plug it out and in again.\nEDIT:\nWith the original charger which came in the box it works fine and needs about 1h and 40m to fully charge.", "time": "30th July 2017, 10:16 AM", "postID": "post73224804", "replies": [{"text": "OK, the original charger, what is the Voltage & Amperage Output?\r\nAlso.....\r\nFrom 25% to full charge using a QI Wireless Charger and the Original Charger that came with it, how long to full charge?\r\nFrom 25% to full charge using the USB out on a laptop (.5Amp), how long to full charge?", "time": "17th September 2017, 06:57 PM", "postID": "post73829433", "replies": []}, {"text": "Hi are you Iranian? \r\nIf you doesn't use official Charger of S8 that it's available in Phone Box it's probably correct that your device will not be charged very fast and you have to use the Official and trusted charger of Galaxy s8 that Samsung electronics have confirmed it.", "time": "7th October 2017, 04:36 PM", "postID": "post74069960", "replies": []}]}, {"text": "1 hour 45 mins normal charge with original cable and adapter S8 rocking stock AQF7 not rooted", "time": "12th August 2017, 05:42 PM", "postID": "post73377588", "replies": []}]}, {"title": "Screen on time", "rating": 3.5, "links": ["https://forum.xda-developers.com/galaxy-s8/review/screen-time-t3645199", "https://forum.xda-developers.com/galaxy-s8/review/screen-time-t3645199/page2", "https://forum.xda-developers.com/galaxy-s8/review/screen-time-t3645199/page3", "https://forum.xda-developers.com/galaxy-s8/review/screen-time-t3645199/page19"], "threads": [{"text": "Really impressed by the battery life on S8.\r\nWay better than my S7 edge!", "time": "6th August 2017, 03:11 AM", "postID": "post73302037", "replies": []}, {"text": "Here very satisfied with battery life on the S8+", "time": "6th August 2017, 09:45 AM", "postID": "post73304288", "replies": []}, {"text": "incredible on mine is only 4h30 SOT max.... whats our setings ?", "time": "6th August 2017, 01:34 PM", "postID": "post73306182", "replies": []}, {"text": "Resolution on FHD+.That's all.", "time": "6th August 2017, 02:42 PM", "postID": "post73306813", "replies": []}, {"text": "Gnow ? Location ?", "time": "6th August 2017, 04:07 PM", "postID": "post73307637", "replies": []}, {"text": "I'm a heavy user, so I don't expect much from the battery unfortunately  I have gnow, location, social medias, multiple Gmail accounts... Fml 😂", "time": "8th August 2017, 08:54 PM", "postID": "post73333137", "replies": []}, {"text": "And your SoT with all of that @Majin101 ?", "time": "11th August 2017, 03:14 PM", "postID": "post73364463", "replies": [{"text": "I average about 3 hours SOT. If I'm lucky, maybe 4", "time": "11th August 2017, 03:48 PM", "postID": "post73364898", "replies": []}]}, {"text": "Ok thank you for our answer.", "time": "11th August 2017, 09:03 PM", "postID": "post73368262", "replies": []}, {"text": "7 hours 30 min SOT with 2% left. This phone just doesn't want to go to bed, lol.", "time": "11th August 2017, 11:20 PM", "postID": "post73369289", "replies": []}, {"text": "Just Wifi,no data connection during this weekend, S8, FHD+ and between 30 and 60% brightness.", "time": "20th August 2017, 06:02 PM", "postID": "post73472706", "replies": []}, {"text": "Please more information of our setting with our SOT time (location, Gnow, wifi, brightness...)\nThank", "time": "20th August 2017, 09:00 PM", "postID": "post73474644", "replies": []}, {"text": "4 hours or so. out of 16 to 17", "time": "21st August 2017, 10:44 PM", "postID": "post73488084", "replies": []}, {"text": "I probably average 6 hours SOT with 13 hours standby and have over 10% battery remaining.  This is with sync on for all social media, four email accounts (2 gmail, 2 outlook), location on, wifi on, bluetooth on (connected to my Gear S3), brightness automatic, playing music thru Amazon Prime Music, watching FB and IG videos.", "time": "24th August 2017, 07:58 PM", "postID": "post73527213", "replies": []}, {"text": "With stock rom? I don't believe you", "time": "26th August 2017, 08:35 AM", "postID": "post73545157", "replies": [{"text": "Don't believe who?", "time": "28th August 2017, 11:12 PM", "postID": "post73577389", "replies": [{"text": "You", "time": "29th August 2017, 09:29 AM", "postID": "post73581259", "replies": [{"text": "Whahahaha.  Ok dude.", "time": "29th August 2017, 06:31 PM", "postID": "post73587103", "replies": []}, {"text": "So today I only got ~5 hrs SOT but I was in a bad reception area at work.  \nSo I stick to my comment about getting 6 hrs SOT on average.  Stock ROM, use Waze GPS, Amazon music, FB, IG, three emails syncing, Bluetooth synced to my Gear S3, location services on high accuracy.  Misc app use like XDA, Android Authority, Snapchat, Samsung Pay, chrome, Samsung browser, theme store.  \nThis FN phone is the GOAT!!  End of story, kid.", "time": "30th August 2017, 05:25 AM", "postID": "post73592173", "replies": [{"text": "S8 or s8 plus ? Exynos or snapdragon ?", "time": "30th August 2017, 07:52 PM", "postID": "post73601464", "replies": [{"text": "S8 on AT&T...so snapdragon.", "time": "30th August 2017, 10:34 PM", "postID": "post73603051", "replies": []}]}]}]}]}]}, {"text": "Hi, in FHD or WQHD ?", "time": "26th August 2017, 01:26 PM", "postID": "post73547688", "replies": []}, {"text": "Wow guys, your battery lifes are amazing. I consider mig self mid-high user however i get max 3h SOT och 15h Battery life.\n\r\nAOD ON\r\nBT/WIFI ON 24/7\r\nGPS ON high acc\r\n1 exchange account\n\r\nApps i use\r\nSpotify\r\nInstagram\r\nSnapchat\r\nWhatsapp\n\r\nI have already done 2 factory resets, cleaned cashe 2 times. \r\nWhile factoy rested, not installed any apps, simply using stock apps, still same ****ty SOT. Maybe got 30min more.\r\nSamsung service check it for faults and didnt find any, reflashed it. \n\n\r\nDafuq is wrong with my phoooone?!", "time": "30th August 2017, 07:50 AM", "postID": "post73593132", "replies": [{"text": "What about screen brightness or screen timeout time? \nIf you have wifi, I would suggest turning airplane mode on and then connect your wifi.  With AT&T they have \"wifi calling\" which means I can call and text using wifi.  It helps.", "time": "30th August 2017, 04:54 PM", "postID": "post73599249", "replies": [{"text": "I have auto brightness off.\n\r\nI have already tried leaving the phone on with airplane mode and had a 5% drop during 8hours. Which suxx.. My phone would still be 100%", "time": "31st August 2017, 07:06 AM", "postID": "post73606478", "replies": []}]}]}, {"text": "Please also help my in my thread\n\nhttps://forum.xda-developers.com/gen...0#post73597390", "time": "30th August 2017, 02:52 PM", "postID": "post73597487", "replies": []}, {"text": "Thank you", "time": "31st August 2017, 06:35 AM", "postID": "post73606222", "replies": []}, {"text": "Oh oh.. up at 545am at 100% charge of my wireless charger  shower breakfast watch some Facebook vids and at 640am I was at 47% battery   \n\n\n\n\n\n---------- Post added at 11:25 AM ---------- Previous post was at 11:23 AM ----------\n\nMust be a fluke.. I have had phone for a week. Here is a typical day", "time": "31st August 2017, 12:25 PM", "postID": "post73609282", "replies": []}, {"text": "Am impressed to, was only getting 3 to 4 hours SoT, then tweaked phone according to this article (disabling apps etc.) https://www.xda-developers.com/the-g...my-experience/ and now, after using the tweaks in the article I'm on 7 hrs SoT with 15% battery left, so very impressive imho.", "time": "13th September 2017, 08:31 AM", "postID": "post73773881", "replies": [{"text": "Thanks for the link, i've wondered what to disable as i can barely get 3 hours of SoT so hoping this will help.  I left Knox up so we will see the difference.", "time": "16th September 2017, 07:13 PM", "postID": "post73817775", "replies": []}]}, {"text": "Hello\nafter the Oreo update, my battery life has decreased drastically. I fresh installed it with Odin. I've also removed unwanted Samsung apps. Before the update, with Nougat, I could reach 5 hours of SOT, now I barely reach 4.\n\nFrom GSAM, I've realized that System Android and Kernel are consuming twice what they were consuming when I was with Nougat. I made a quick comparison\n\nOreo GSAM infos: https://i.imgur.com/0jRiSSO.jpg\nNougat GSAM infos: https://i.imgur.com/14an98v.png", "time": "9th March 2018, 07:45 PM", "postID": "post75831560", "replies": [{"text": "This is exactly what's happening with me too, the Oreo update has ruined my battery life. I am going to give Oreo 1 week and if it is still draining, I'll be rolling back to Nougat.", "time": "14th March 2018, 01:58 PM", "postID": "post75886181", "replies": []}]}]}, {"title": "Standby drain", "rating": 3.5, "links": ["https://forum.xda-developers.com/galaxy-s8/review/standby-drain-t3645200", "https://forum.xda-developers.com/galaxy-s8/review/standby-drain-t3645200/page2", "https://forum.xda-developers.com/galaxy-s8/review/standby-drain-t3645200/page3", "https://forum.xda-developers.com/galaxy-s8/review/standby-drain-t3645200/page9"], "threads": [{"text": "I lose about 3% an hour while I sleep. No other phone I've owned has drained that much. \n\nI'm sure it's an app sucking the juice out of it.... I've restored it back to clean factory setting 3 times, after a few weeks it always goes back to about 3% an hour. \n\nI uses Gsam battery monitor, but it shows nothing out of the ordinary other than: System, Samsux DeX (which I don't use), or the  Kernel is usually really high.\n\nI LOVE everything else about this phone, other than this.", "time": "1st September 2017, 03:07 AM", "postID": "post73617951", "replies": [{"text": "I lose 3% an hour too.  I have an old Galaxy Note 3 on Resurrection Remix 5.8.3 (Android 7.1.2) that lasts 25 days on standby.  It's the stupid LagWiz bloated OS!", "time": "6th September 2017, 05:59 PM", "postID": "post73690749", "replies": []}]}, {"text": "did your mobile data is always on while u sleep? bcoz for me it drains only 3 percent after 7 hrs of sleep with mobile data off.\nwith mobile data 10% battery drain after 7hrs", "time": "1st September 2017, 10:52 AM", "postID": "post73621353", "replies": []}, {"text": "I have the same problem, with mobile data ON...phone drains 3% overnight (8hours).\nMy old Samsung S6 drains 0-1% over night with cell radio on.\n\nall draining apps optimized with brevent.\nbattery draining apps disabled with BK Disabler + some gapps services disabled\nvolte + wifi calling off.\n\ngsam and better battery stats show no problems.\nBut Android Battery statistics show high cell standby drain.\nI think it is a modem issue.\n\nI have got an G950F with DBT Firmware", "time": "4th September 2017, 08:06 PM", "postID": "post73665034", "replies": []}, {"text": "I lose 0.5% overnight.\nNot per hour... but over the whole night.\nNo AOD.\nDisabled bixby and all bixby services.\nDisabled anything related to Samsung's voice services.", "time": "6th September 2017, 06:35 AM", "postID": "post73683400", "replies": []}, {"text": "4% in 6 hours  (bad lte 1-2, wifi on)", "time": "6th September 2017, 11:10 AM", "postID": "post73685628", "replies": []}, {"text": "I have the same issue.. even in day or night it drains 3-4% per hour with AOD off. on Power saving mode. \nNot sure what to do.", "time": "7th September 2017, 05:15 PM", "postID": "post73704042", "replies": []}, {"text": "I was having massive standby drain, even with Greenify, then I set up the phone with these settings https://www.xda-developers.com/the-g...my-experience/ (see \"Linked a screenshot) and uninstalled Greenify (read somewhere that it can get into a loop of auto hibernation which drains battery) and wow! from 4 to 5% an hour to 2% over 7 hours  so am very chuffed!", "time": "9th September 2017, 03:05 PM", "postID": "post73728242", "replies": []}, {"text": "Hi there,new to the forum and just wanted to share me experience of the standby drain.\r\nI usually put my my phone off when i go to sleep,but afther reading this tread i wanted to test how much my phone drains over night...\r\nAOD off , wifi and mobile data off, lost about 5 % on 10 h,so i asume this is pretty good", "time": "11th September 2017, 10:02 AM", "postID": "post73749607", "replies": [{"text": "Should be find after that.", "time": "12th September 2017, 09:23 AM", "postID": "post73761714", "replies": []}]}, {"text": "@thenessus how to disable bixby and voice without root?", "time": "13th September 2017, 09:00 AM", "postID": "post73774134", "replies": [{"text": "just install a package disabler from playstore and select bixby to be disabled", "time": "14th September 2017, 08:36 PM", "postID": "post73794042", "replies": [{"text": "I wish i can remap it into sound/vibrate just like an iphone or one plus toggle.", "time": "15th September 2017, 04:06 PM", "postID": "post73803565", "replies": []}]}]}, {"text": "You can remap it easily, just use bxactions app, works well.", "time": "15th September 2017, 04:25 PM", "postID": "post73803771", "replies": [{"text": "after i disabled all the bixby services, using bxactions doesn't do anything. And i cannot use control mode on bxactions too because i don't have windows machine unfortunately.", "time": "16th September 2017, 05:03 PM", "postID": "post73816272", "replies": []}]}, {"text": "You need bixby home and voice to be active to remap the button with bx actions", "time": "16th September 2017, 05:30 PM", "postID": "post73816594", "replies": [{"text": "i just tried, it's kinda hit and miss action. Perhaps i need to use control mode to get it fully working.", "time": "17th September 2017, 03:11 AM", "postID": "post73821196", "replies": []}]}, {"text": "same issue. i got both the s8 and s8+, both lost 15% after 7-8 hours sleep...\r\nafter some normal usage the battery dies arround 5pm everyday... this is really annoying.\r\nthe battery is the biggest but the only disappointment on my s8 and s8+, hopefully this can be fixedby system patch on some day.", "time": "26th September 2017, 09:28 PM", "postID": "post73944304", "replies": [{"text": "are you using Greenify? I would really set up phone in terms of the debloating as mentioned in the link I posted earlier and then see if it improves, but for me Greenify was doing something odd, so yes yes after debloating according to the link and then uninstalling Greenify (maybe it conflicts with Samsung's optimizer or something) I saw a really big improvement in battery life.", "time": "27th September 2017, 12:47 PM", "postID": "post73950953", "replies": [{"text": "Hi, i don't usethe Grennify, i just used the PDP and disabled the services which on the list and turned off the AOD on the S8.\r\nThe change was significant.\r\nIt lost 4-5% overnight sleep(8hours), and I still had arround 35% at the 5pm after a normal daily usage.\r\nreally appreciated.\r\nI am gonna try to make the same change on the S8+ aswell tonite.", "time": "28th September 2017, 10:55 AM", "postID": "post73962223", "replies": [{"text": "Hi,\n\r\ncan you please write some how-to?\r\nI do not know which services and what is AOD?", "time": "28th September 2017, 12:17 PM", "postID": "post73962853", "replies": [{"text": "see this link (go to debloat section), https://www.xda-developers.com/the-g...my-experience/ and click on the screen shot link to see the apps that are disabled. AOD stands for Always on Display (in settings/display).", "time": "28th September 2017, 01:58 PM", "postID": "post73963800", "replies": []}]}]}]}]}, {"text": "My battery life is fine too with Bixby and other Samsung bloat disabled with package disabler", "time": "26th September 2017, 11:24 PM", "postID": "post73945260", "replies": []}, {"text": "I've disabled some bloat and compared the standby drain with and without AOD: for 6 hours (my sleep time) it used to drain 10% with AOD. Without it it just drained 3%. So I'd say AOD makes up for 3 times as much drain in standby. Which is significant if you consider your phone is on standby for 10 hours a day (a low estimate).", "time": "27th September 2017, 05:20 PM", "postID": "post73954060", "replies": []}, {"text": "Ive used tutorial and xml import for package disable pro from android.gadgethacks, plus few of my own, and im on stock draining about 0.4-0.5/h, wifi off on sleep, with data active 4G about 0.6/h in standby. AOD off, location off, nearby devices scanning off.  1h55min Sot, auto brightness, 73% battery left, used 27%, over period of 22hrs currently. Stock firmware.", "time": "28th September 2017, 02:22 PM", "postID": "post73964072", "replies": []}, {"text": "I'm very chuffed with battery life, with wifi on, data off (have wifi at work & at home), AOD off, and bloatware disabled with package disabler, also have naptime installed, but use the phone for a bit of everything, got just on 7 hrs SoT and 80 odd hours between charges, see screenshot.", "time": "29th September 2017, 08:01 AM", "postID": "post73972359", "replies": [{"text": "do you use naptime? did not the notifications affect your device? does everything work correctly? app naptime have you done using adb and all permissions according to the manual? well thank you.", "time": "29th September 2017, 10:31 AM", "postID": "post73973513", "replies": []}]}, {"text": "Yes i use Naptime and used the adb commands when setting it up. No problems for me so far. Which notifications are you talking about?", "time": "29th September 2017, 10:33 AM", "postID": "post73973535", "replies": [{"text": "I mean, for example, GMAIL. we will not receive the notification. can it be related to the Gear VR service?\nhttps://ibb.co/j7PN5b", "time": "29th September 2017, 11:17 AM", "postID": "post73973894", "replies": []}]}, {"text": "3% for 8 hours. Two days on oreo beta. Aod disabled, wifi in sleep disabled too, LTE", "time": "20th January 2018, 05:36 AM", "postID": "post75265457", "replies": []}, {"text": "Does greenify works or does anything using agressive doze?", "time": "20th January 2018, 11:56 PM", "postID": "post75275375", "replies": [{"text": "personally speaking, apps like these just gives placebo effect. android has gotten really matured now. you don't need greenify's aggressive doze.\r\nSamsung has something similar inbuilt into their 'Device Maintenance' system.\r\ngo to Settings > Device Maintenance > Battery > *scroll all the way down* Always Sleeping Apps > *top right 3 dots* Add Apps.\n\r\nI personally selected all of them including gmail and whatsapp and they work just fine (though whatsapp sometimes don't show notification but shows app dot) but hey, if your are using greenify, this would be a way better solution.\n\r\nAlso, I selected bxAxtion (Bixby remapping app) under Unmonitored App.", "time": "26th January 2018, 02:27 PM", "postID": "post75340347", "replies": []}]}, {"text": "I also experience worse battery life since Oreo. Top Drainer is called \"Battery on Standby\" with 20%. No idea what that means, wasn't there in Nougat.", "time": "26th February 2018, 09:25 PM", "postID": "post75706730", "replies": []}, {"text": "For me: \nOreo:  2,5% per hour (via AccuBattery) in standby.  \nNougat: 1,1% per hour (via AccuBattery) in standby. \n\nSame options enable in both cases (wi-fi, data, gps, sync...)", "time": "1st March 2018, 07:22 PM", "postID": "post75739372", "replies": []}, {"text": "Running on Oreo as well and have a massive battery drain. I have used my phone today and charged 30% this afternoon. Currently it is on 3% again with just 4,5 hours screen on time.\nDid notice the Android system is using up about 500-600 mah daily.\n\nMy wife also has a s8 on nougat. \nShe is watching Netflix all day. Had almost 7 hours screen on time at the moment and still has 28%. Android system is using only 200-300 mah.\n\nWtf!\n\nMessing up the battery life so everyone will buy the S9?!", "time": "3rd March 2018, 06:19 PM", "postID": "post75760732", "replies": [{"text": "I have no issues regarding battery drain, running Oreo this week on my S8, 3% drop in 8 hours overnight\n\r\nDid you try to wipe the cache partition after ota install", "time": "3rd March 2018, 08:29 PM", "postID": "post75761868", "replies": [{"text": "after switch off the several apps background data I manage to save a lot of batt seriously, earlier was terrible even after 5 mins unplugged from the charger it drains out 2% for nothing\n\n---------- Post added at 11:16 AM ---------- Previous post was at 11:15 AM ----------\n\n\n\r\nwow this is amazing! Will try that later thanks", "time": "16th March 2018, 04:16 AM", "postID": "post75905398", "replies": []}]}]}, {"text": "I've been on the Oreo beta for a while, and yes I agree, standby drain is terrible. I figured a factory reset would help, and not load as many apps. Sure enough same thing. Disappointed. I want to upgrade to GS9 Exynos from this SD835", "time": "8th March 2018, 12:31 AM", "postID": "post75810423", "replies": []}]}, {"title": "Heavy use endurance", "rating": 2.5, "links": ["https://forum.xda-developers.com/galaxy-s8/review/heavy-endurance-t3645201"], "threads": []}, {"title": "Light use endurance", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s8/review/light-endurance-t3645202"], "threads": [{"text": "worst", "time": "27th July 2017, 06:40 AM", "postID": "post73188058", "replies": [{"text": "I think the G6 has it beat.", "time": "27th July 2017, 10:06 PM", "postID": "post73197380", "replies": []}]}]}, {"title": "\"Look\" of the device (aesthetics)", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s8/review/look-device-aesthetics-t3645203"], "threads": []}, {"title": "Quality feel (use of materials)", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s8/review/quality-feel-materials-t3645204"], "threads": []}, {"title": "Ergonomics (in-hand feel)", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s8/review/ergonomics-hand-feel-t3645205"], "threads": [{"text": "It's a beautiful phone, but even though it isn't wide, it's thickness still makes it more difficult to type with one hand. The V30 is easier with one hand despite being wider mainly due to how thin it is.", "time": "20th October 2017, 06:20 PM", "postID": "post74233258", "replies": []}]}, {"title": "OEM skin/software", "rating": 3.0, "links": ["https://forum.xda-developers.com/galaxy-s8/review/oem-skin-software-t3645206"], "threads": [{"text": "Settings menu bg is not solid black causing it to glow redish", "time": "13th August 2017, 01:54 AM", "postID": "post73381429", "replies": [{"text": "You can change it with themes.", "time": "14th August 2017, 01:02 AM", "postID": "post73392760", "replies": []}]}]}, {"title": "Outdoor visibility (max brightness)", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s8/review/outdoor-visibility-max-brightness-t3645207"], "threads": []}, {"title": "Contrast (true blacks)", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s8/review/contrast-true-blacks-t3645208"], "threads": []}, {"title": "Color saturation & accuracy", "rating": 4.5, "links": ["https://forum.xda-developers.com/galaxy-s8/review/color-saturation-accuracy-t3645209"], "threads": []}, {"title": "Clarity/resolution", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s8/review/clarity-resolution-t3645210"], "threads": []}, {"title": "Minimum brightness", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s8/review/minimum-brightness-t3645211"], "threads": [{"text": "best in businesses", "time": "26th July 2017, 07:30 PM", "postID": "post73183382", "replies": []}, {"text": "My Oneplus5 gets dimmer than my s8. But u can always download screen dimming filter app", "time": "28th July 2017, 05:58 PM", "postID": "post73206953", "replies": []}]}, {"title": "Call quality", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s8/review/call-quality-t3645212"], "threads": [{"text": "its great and i love the fact that i can talk on the speaker phone from the other side of the room and the person on the other side of the call can still hear me. its awesome", "time": "26th July 2017, 07:31 PM", "postID": "post73183393", "replies": []}, {"text": "People are complaining on the other end for me...what?!?!, i can't hear you. Unlocked version", "time": "28th July 2017, 11:33 PM", "postID": "post73209986", "replies": [{"text": "clean microphone holes both bottom and top \n\r\nsignal quality is good ?", "time": "29th July 2017, 12:29 PM", "postID": "post73214843", "replies": []}]}, {"text": "I normally get dead silence in the beginning of every call for a few seconds but after that's everything is crystal clear. I'm on Verizon.", "time": "30th July 2017, 05:03 PM", "postID": "post73228501", "replies": []}]}, {"title": "WiFi strength, range, and throughput", "rating": 3.5, "links": ["https://forum.xda-developers.com/galaxy-s8/review/wifi-strength-range-throughput-t3645213", "https://forum.xda-developers.com/galaxy-s8/review/wifi-strength-range-throughput-t3645213/page2"], "threads": [{"text": "the range actually is pretty good vs s7\n\nbut the speed is huge compared to s7 on a Linksys  wrt3200acm router", "time": "26th July 2017, 10:20 AM", "postID": "post73177300", "replies": []}, {"text": "I find the range to be lacking compared to my old LG V10 but the throughput is great.", "time": "26th July 2017, 03:46 PM", "postID": "post73180796", "replies": []}, {"text": "Bluetooth issues \n\r\nDualshock 4 connects but no inpuit, when Bluetooth speaker is enabled the audio causes controls to be slow on gear vr", "time": "13th August 2017, 01:53 AM", "postID": "post73381421", "replies": [{"text": "This thread is about Wi-Fi not bluetooth.", "time": "13th August 2017, 04:48 PM", "postID": "post73388549", "replies": []}]}, {"text": "On the review section there is communications like radios but no section for Bluetooth. So I posted it here as it's the closest thing", "time": "15th August 2017, 12:50 AM", "postID": "post73404561", "replies": []}, {"text": "I got an S8 today and tested it out and it was like maxed out at 39 Mbps when i have Gig internet,  so dunno if there is something I gotta turn on or off, or just test it again later once its on network for awhile", "time": "17th August 2017, 12:29 AM", "postID": "post73428561", "replies": []}, {"text": "I have issues with wifi, it says internet may not ve available", "time": "24th August 2017, 09:44 PM", "postID": "post73528294", "replies": [{"text": "what router do you have ??\n\r\ndid you try firmware update??", "time": "24th August 2017, 11:32 PM", "postID": "post73529062", "replies": [{"text": "Here is the thread: https://forum.xda-developers.com/sho....php?t=3594772\n\r\nIts just not abt the router, also  am using neighbours wifi, so cant tinker with that", "time": "26th August 2017, 07:58 AM", "postID": "post73544836", "replies": [{"text": "request a new unit", "time": "26th August 2017, 12:53 PM", "postID": "post73547368", "replies": []}]}]}]}, {"text": "0=00000000000000×p1", "time": "8th January 2018, 09:54 PM", "postID": "post75129183", "replies": []}]}, {"title": "Cellular strength and throughput", "rating": 5.0, "links": ["https://forum.xda-developers.com/galaxy-s8/review/cellular-strength-throughput-t3645214"], "threads": [{"text": "I have the unlocked version of the phone on AT&T (coming from a Moto X Pure) and I'm pretty impressed so far.", "time": "26th July 2017, 12:01 PM", "postID": "post73178295", "replies": []}, {"text": "hangs on to 4g for alot longer than my stupid oneplus 3 (unlocked s8)", "time": "26th July 2017, 07:28 PM", "postID": "post73183368", "replies": []}]}, {"title": "Speakerphone (loudness, clarity)", "rating": 4.0, "links": ["https://forum.xda-developers.com/galaxy-s8/review/speakerphone-loudness-clarity-t3645215", "https://forum.xda-developers.com/galaxy-s8/review/speakerphone-loudness-clarity-t3645215/page2", "https://forum.xda-developers.com/galaxy-s8/review/speakerphone-loudness-clarity-t3645215/page3"], "threads": [{"text": "Its loud and clear. Great sound. All stock and no root", "time": "25th July 2017, 11:09 PM", "postID": "post73172706", "replies": [{"text": "Same for me... Perfect.", "time": "25th July 2017, 11:36 PM", "postID": "post73172927", "replies": []}]}, {"text": "great and loud sound. idk why people complain that there are not front firing speaker. i mean you aint gonna watch movies on a phone...", "time": "26th July 2017, 07:29 PM", "postID": "post73183378", "replies": [{"text": "I watch a ton of movies on my phone ... adult and on kodi and no the speaker is not lour and crisp", "time": "31st July 2017, 05:16 PM", "postID": "post73240108", "replies": [{"text": "Get headphones or a bluetooth speaker for like 100bucks. You got an s8, dont tell me you dont have 100eur more to spend on something", "time": "31st July 2017, 06:18 PM", "postID": "post73240842", "replies": []}]}]}, {"text": "The quality is good but honestly if it went a pinch louder then it would be perfect", "time": "10th August 2017, 09:26 PM", "postID": "post73356795", "replies": []}, {"text": "speaker quality is par at best. obviously no improvements in the past 2 or 3 generations.\n\npeople have a hard time hearing me on speakerphone. speaker for me is just barely loud enough.\n\nhopefully they will fix in coming updates.", "time": "11th August 2017, 05:37 PM", "postID": "post73366173", "replies": []}, {"text": "Does anyone else get a laser beam sounding tone on high pitched sounds", "time": "12th August 2017, 02:33 AM", "postID": "post73370399", "replies": [{"text": "Coming from a Moto X Pure, which had stereo front facing speakers, This was is the best way to describe it. It totally sounds like laser beam sounding tones and it drives me insane.", "time": "21st January 2018, 07:30 PM", "postID": "post75285218", "replies": [{"text": "After having the phone for almost a year I've gotten used to it and barley notice it anymore", "time": "21st January 2018, 07:52 PM", "postID": "post75285407", "replies": [{"text": "I hope so. Got the phone off Ebay, and at first, thought it was a defect.", "time": "21st January 2018, 09:00 PM", "postID": "post75285996", "replies": [{"text": "Yeah the S8 volume sucks.", "time": "18th February 2018, 01:32 PM", "postID": "post75611891", "replies": []}]}]}]}]}, {"text": "The quality and loudness is not good enough on the speaker phone. Honestly,  i have a lenovo vibe s1 costing $135, sounds better and louder. Sorry to say, i had to say this, as i was comparing the loudspeaker clarity with Huawei honor 6+ and lenovo vibe s1, both of these phones performed better than s8", "time": "24th August 2017, 09:34 PM", "postID": "post73528205", "replies": []}, {"text": "I like having the front firing speakers since my finger sometimes covers the speaker when I hold the phone in landscape with one hand.  With the bottom speaker, I have to kind of \"cup\" the speaker to \"direct\" the sound frontwards.  The sound isn't bad, but I do prefer the front firing speakers for this reason.  \n\nOn calls, with Verizon HD calling, it sounds amazing.  With regular calls, it sounds pretty good usually, but if I'm outside, I often find myself selecting the \"Turn on extra volume\" option.", "time": "25th August 2017, 06:49 PM", "postID": "post73539231", "replies": []}, {"text": "I'd have to say it sound a bit on the quiet side. Since it is very similar to my G4, I've already got use to it.", "time": "25th August 2017, 07:35 PM", "postID": "post73539758", "replies": []}, {"text": "I traded my S5 in for an S8 and transferred my ring tones over from the S5 to the S8.  Even at full volume on the S8 they are much quieter than the S5.", "time": "1st September 2017, 05:51 PM", "postID": "post73625811", "replies": []}, {"text": "I love modem strike online and it sucks cause how you hold the phone it covers up the sound. Sucks. You can't 'cup' and play", "time": "16th September 2017, 08:35 AM", "postID": "post73811293", "replies": []}, {"text": "My S7A is the loudest phone I have heard compared to all my friends and co-workers.\nSpeaker on the S8A is really that bad?\nI got my S7A just befor the S8A became available, I'm considering dumping my S7A and getting the S8A.\nHmmm, maybe a major update might include a fix for the amplifier.\nCould also be the location of the speaker on the S7A.......", "time": "17th September 2017, 06:47 PM", "postID": "post73829328", "replies": []}, {"text": "I actually just had to send mine in due to the loudspeaker being all distorted sounding. Was really disappointed because I love this phone. I sent the phone in for warranty repair. I will reply with how it turned out.", "time": "20th January 2018, 08:37 PM", "postID": "post75273917", "replies": []}, {"text": "Speaker isn't loud enough, need a proper working mod, to increase it a bit. Currently using \"dual speaker mod\", but it doesn't increase the volume itself. Dolby atmos is crap, and \"viper4android\" doesn't work at all. Any suggestions?", "time": "8th March 2018, 08:12 AM", "postID": "post75813319", "replies": [{"text": "Have you heard of the app called speakerboost?  That WILL increase the volume quite a bit. But be warned don't raise it too high or you'll risk blowing the speakers.", "time": "9th March 2018, 03:35 AM", "postID": "post75822867", "replies": [{"text": "Haven't heard of it yet. I'll check it out then. Thanks!\n\nEDIT: The app is useless. Doesn't work AT-ALL. Thanks anyway.", "time": "9th March 2018, 03:06 PM", "postID": "post75828581", "replies": []}]}]}]}]