[{"title": "Overall love", "rating": 4.5, "links": ["https://forum.xda-developers.com/razer-phone/review/overall-love-t3699118"], "threads": [{"text": "I like this phone.  Switched from a OnePlus 5 and while it is a downgrade in weight, dimensions and camera it's an improvement in screen size, screen scrolling/overall performance feel and speakers.  Now when I look at other phones the Razer Phone just feels faster thanks to the 120Hz display.", "time": "1st December 2017, 04:12 PM", "postID": "post74702365", "replies": []}, {"text": "Best phone I ever had. Even better than my Oppo Find 5.", "time": "24th February 2018, 11:48 AM", "postID": "post75677548", "replies": []}, {"text": "Too heavy, small screen, and vibration motor is hideous.", "time": "3rd March 2018, 11:36 PM", "postID": "post75763087", "replies": []}]}, {"title": "Community development strength", "rating": 2.0, "links": ["https://forum.xda-developers.com/razer-phone/review/community-development-strength-t3699119"], "threads": [{"text": "Razer should step in and help with the development because it's through this type of grass roots approach that you win XDA folks over.   I mean, no root yet?  People are also scared to root because they officially say they will not honor warranties?  Razer grow up.", "time": "1st December 2017, 04:13 PM", "postID": "post74702376", "replies": []}, {"text": "Razer's online chat support just told me that source code will be available for download on their support website on December 15th.  I imagine after that happens development will take off, especially since we can unlock the bootloaders so easily already", "time": "3rd December 2017, 03:43 AM", "postID": "post74717734", "replies": []}, {"text": "We can only hope that is true. Look at what has happened with one plus and a strong community.", "time": "5th December 2017, 09:09 PM", "postID": "post74748159", "replies": [{"text": "I wonder how many OnePlus phones though feel to the builtin engineering backdoor they were adding.\nI'll never consider a OnePlus after the researcher found that sending data quietly back to OnePlus. I'm quite familiar with diagnostic data retrieval and how vital it is, but I'm not one to say shady practices are ok.\nI was pretty concerned at first about Razer since they've never done anything cell phone wise, but at the same time, if they wanted to mine data, they could have done it long ago via Synapse.\nPlus the fact that the researcher found root could be obtained by manipulating the process, that shows OnePlus either didn't care or was just that ignorant.\nApologies, I've been told left and right that OnePlus is better than this phone, but that's ignoring so much.\n\nI can't wait for the development to take off once things progress. This phone has more potential than anything on the market right now.", "time": "6th December 2017, 01:57 PM", "postID": "post74755194", "replies": [{"text": "They all do it. Even Google builds things into their OS for just that reason. Heck they were just found to be tracking location data even if you told them not to. So the only way to be sure is to build your own OS going over every single line of code.  Unless you are do that then you really cant complain when they are caught doing just what the OS was made to do by a company that makes its money doing that.", "time": "14th December 2017, 03:15 AM", "postID": "post74840282", "replies": [{"text": "Na, that's a complacency statement there.\r\nI would guess it was a new thing Google added. There's researchers out there everyday looking at these kinds of things. Of course it begs to question how long it's been there, but everything aside, they're using your data plans. That would result in an FCC, direct court case, licensing, fines, and if they get lucky a class action lawsuit.\n\r\nThe OS was not made to perform background actions to collect data on users. That is quite incorrect.\n\n---------- Post added at 02:50 PM ---------- Previous post was at 02:49 PM ----------\n\n\n\r\nYup. I cannot stand to think that some companies think it's their device even after you pay them hundreds of dollars for it.", "time": "14th December 2017, 12:50 PM", "postID": "post74844375", "replies": []}]}]}]}, {"text": "I think it may be a good idea to start a donation pot that we can offer a senior recognized developer to help purchase this Phone for them.", "time": "6th December 2017, 07:35 PM", "postID": "post74758589", "replies": []}, {"text": "Lack of root and dev support is a definite no no for me. I rooted one oneplus 5t loaded a custom rom and the thing now flies.", "time": "14th December 2017, 07:29 AM", "postID": "post74841800", "replies": []}, {"text": "Zero. twrp released and instructions don't work for many people. Code been out for over a month and not even an alpha ROM.", "time": "3rd March 2018, 11:37 PM", "postID": "post75763099", "replies": []}]}, {"title": "Overall speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/razer-phone/review/overall-speed-t3699120"], "threads": [{"text": "This phone is the fastest experience that Android offers.  Period!  This is not only because the Snapdragon 835, 8GB of 1866MHz DDR4 RAM and fast read/write speeds to the 64GB storage.  It's also because of perception.  Since the display can refresh at 120Hz it just feels like it has more processing power than the other SD835 based phones out there.  It will still seem faster than the SD845 when released so it will be my main phone for longer than the OnePlus 5 was.", "time": "1st December 2017, 04:25 PM", "postID": "post74702494", "replies": []}, {"text": "Fastest phone I've ever used. Faster than the s8 I had too which is based on the same soc.", "time": "2nd December 2017, 05:01 PM", "postID": "post74713194", "replies": []}, {"text": "I have yet to run into a single slow down on the phone. Everything loads and runs quickly. App swapping is near instantaneous. Boot times are quick, especially considering it isn't currently running Oreo.", "time": "1st February 2018, 03:14 PM", "postID": "post75409920", "replies": []}, {"text": "Lightning fast! But I have to say, I'm coming from a Nexus 5 and a Wileyfox Swift 2X. Anything is fast after that", "time": "24th February 2018, 11:14 AM", "postID": "post75677213", "replies": []}]}, {"title": "App launch speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/razer-phone/review/app-launch-speed-t3699121"], "threads": [{"text": "Apps launch very fast.  If it is slower than the OnePlus 5 I just cannot tell.  The OP5 uses UFS 2.1 which is pretty speedy.  The Razer Phone seems to utilize the same technology but I just don't see it officially announced anywhere.", "time": "1st December 2017, 04:26 PM", "postID": "post74702512", "replies": []}, {"text": "Haven't had an app that loads slow yet.", "time": "24th February 2018, 11:15 AM", "postID": "post75677227", "replies": []}]}, {"title": "Multitasking/RAM", "rating": 5.0, "links": ["https://forum.xda-developers.com/razer-phone/review/multitasking-ram-t3699122"], "threads": [{"text": "Hands down a beast of a phone.  8GB with what seems to be a very good handle on which apps to swap out of memory makes for a good phone.", "time": "1st December 2017, 04:27 PM", "postID": "post74702521", "replies": []}, {"text": "Scored top of the charts for Passmark's android average benchmark comparison. Beat Google's pixel 2 lineup which is also based on a newer version of the OS.\nI've yet to see it's slow down. Not sure if it's the cpu or amount of ram, but of course only a combo of both will bring up the bottom line.", "time": "2nd December 2017, 05:00 PM", "postID": "post74713174", "replies": []}]}, {"title": "Scrolling smoothness", "rating": 5.0, "links": ["https://forum.xda-developers.com/razer-phone/review/scrolling-smoothness-t3699123"], "threads": [{"text": "Hands down the best Android phone out there for smoothness, feeling of true power on a mobile device.  120Hz cannot be beat and hasn't in any smart phone out there.  Good work Razer.", "time": "1st December 2017, 04:28 PM", "postID": "post74702530", "replies": []}, {"text": "If any other brand actually has a 'display locks to display actual framerate' vs 'display spits out X number of frames per sec regardless of what the actual video output is; duplicate frames or dropped frames' I'm unaware. On a phone package I don't think it's been expanded upon as an actual area of improvement, but Razer did it. And it's pretty dam awesome.\nEven fewer-color games with combic book style animations have great visuals because you can tell you're not seeing any gpu to display frame mismatching.", "time": "2nd December 2017, 04:58 PM", "postID": "post74713159", "replies": []}, {"text": "Nothing compares to the smoothness this display offers at the moment short of gaming PC monitors. Scrolling through websites or apps is butter smooth.", "time": "1st February 2018, 03:17 PM", "postID": "post75409956", "replies": []}, {"text": "Got it right, finally\n\nhttps://forum.xda-developers.com/raz...r-wow-t3743477\n\nI concur, currently no phone in my 1st hand experience compares to the Razer panel!", "time": "2nd February 2018, 10:13 AM", "postID": "post75419108", "replies": []}, {"text": "The best.", "time": "15th February 2018, 03:10 PM", "postID": "post75578116", "replies": []}, {"text": "I use it with 120hz and 1440p and never had such a smooth device. Not compareable with other Android devices or with an iOS device.", "time": "19th February 2018, 12:46 PM", "postID": "post75622908", "replies": []}, {"text": "I can still read text while scrolling. I have never been able to do that (maybe on my PC).", "time": "24th February 2018, 11:18 AM", "postID": "post75677257", "replies": []}]}, {"title": "Heat", "rating": 4.5, "links": ["https://forum.xda-developers.com/razer-phone/review/heat-t3699124"], "threads": [{"text": "Razer wasn't kidding when they said that the heat dissipation in this phone is borrowed from their gaming laptop division.  This thing can get a little warm but is a far cry from all of the other phones that I have felt and used.  Good work Razer.  I benchmark like crazy and have not seen it throttle ever.", "time": "1st December 2017, 04:30 PM", "postID": "post74702550", "replies": []}, {"text": "With the screen at 3/4 brightness and playing Titanfall Assault, the phone gets pretty warm. Which isn't an issue hwoever I notice the touchscreen starts to be less accurate.", "time": "1st December 2017, 07:17 PM", "postID": "post74704105", "replies": []}, {"text": "Can't say it's been hot, not even sure I can say it's been warm. This is with using the razer rugged case, which is like 2-3mm thick so I think I would probably feel it if it became hotter.\nTemps are good when verifying via CPUZ.", "time": "2nd December 2017, 04:55 PM", "postID": "post74713131", "replies": []}, {"text": "Heat dissipation is through the aluminum case itself and as such can get warmer than feels comfortable during heavy use.", "time": "1st February 2018, 03:20 PM", "postID": "post75409989", "replies": []}, {"text": "When you play graphically heavy games for very long (examples 2 hours on RoS: Rules Of Survival), the phone heats up but its quite slow. Dissipates faster than other flagship phones though", "time": "9th February 2018, 12:36 PM", "postID": "post75501651", "replies": []}, {"text": "Mine got way too hot too quickly.", "time": "3rd March 2018, 11:39 PM", "postID": "post75763102", "replies": [{"text": "Rippu. Try limiting your graphical use. The phone really puts emphasis more into the games and actually pushes your phone to the limits.", "time": "16th March 2018, 01:33 AM", "postID": "post75904511", "replies": []}]}]}, {"title": "Low light", "rating": 2.5, "links": ["https://forum.xda-developers.com/razer-phone/review/low-light-t3699125"], "threads": [{"text": "This camera is not good and feels like something from 2012 in low light.", "time": "1st December 2017, 04:14 PM", "postID": "post74702386", "replies": []}, {"text": "Not the sharpest tool in your pocket. Very grainy. But if you hold the camera very still it's ok.", "time": "24th February 2018, 11:19 AM", "postID": "post75677275", "replies": []}, {"text": "Horrible compared to Note 8, Pixel 2XL and even the 500 dollar OnePlus5T", "time": "3rd March 2018, 11:39 PM", "postID": "post75763107", "replies": []}]}, {"title": "Photo quality", "rating": 3.5, "links": ["https://forum.xda-developers.com/razer-phone/review/photo-quality-t3699126"], "threads": [{"text": "I would prefer to have left 3.5 stars as the camera is just average.  Everything seems a little blurry when zoomed in.  Through editing every single photo you can bring it up to a 4 star image but people don't want that. I don't want that.  I just do it because I want to enjoy the photo after I took it.  Razer step up please.", "time": "1st December 2017, 04:16 PM", "postID": "post74702405", "replies": []}]}, {"title": "Video quality", "rating": 3.5, "links": ["https://forum.xda-developers.com/razer-phone/review/video-quality-t3699127"], "threads": [{"text": "This video quality has been pretty bad from my experience.  Coming from the OnePlus 5, which went for $220 less than the Razer, it's just not something I want to use.", "time": "1st December 2017, 04:18 PM", "postID": "post74702428", "replies": []}]}, {"title": "Selfie quality", "rating": 5.0, "links": ["https://forum.xda-developers.com/razer-phone/review/selfie-quality-t3699128"], "threads": []}, {"title": "Time to take picture (camera launch speed)", "rating": 3.5, "links": ["https://forum.xda-developers.com/razer-phone/review/time-to-picture-camera-launch-speed-t3699129"], "threads": [{"text": "Launching the camera app is fast.\nTaking a picture not so much.", "time": "24th February 2018, 11:21 AM", "postID": "post75677292", "replies": []}, {"text": "Horribly slow compared to other flagship phones.", "time": "3rd March 2018, 11:41 PM", "postID": "post75763113", "replies": []}]}, {"title": "Software (ease of use, features, etc)", "rating": 3.5, "links": ["https://forum.xda-developers.com/razer-phone/review/software-ease-features-t3699130", "https://forum.xda-developers.com/razer-phone/review/software-ease-features-t3699130/page2"], "threads": [{"text": "One think i found odd is that NFC is not located in the quick access area(swipe down). You actually have to go into settings to enable or disable it. Could be something with Nova launcher . It's been many years since I goofed around with Nova so I'm very familiar with all the settings. Could have been a touchwiz feature. I've been on Samsung and touchwiz so long i have forgotton how many features were exclusive to Samsung.  And Yes it is a little refreshing.", "time": "30th November 2017, 08:27 AM", "postID": "post74687380", "replies": [{"text": "I found the same thing, I missed the sound profile toggle from my Galaxy S7. Since then I've been using 'Tile Extension for Nougat' (https://play.google.com/store/apps/d...unny.tilemedia)  which add the toggles back into the Quick Settings Menu, But in your case you will need to install 'Nougat / Oreo Quick Settings' (https://play.google.com/store/apps/d...sestito.ntiles) instead for NFC option as Tile Extension doesn't seem to have that toggle.", "time": "30th November 2017, 01:41 PM", "postID": "post74689846", "replies": [{"text": "Wow. Thanks for the tips. I will look into these. \n Btw i meant, 1*thing* i noticed and, also i am *not* very familiar with Nova.... But i think you understood me.", "time": "30th November 2017, 01:47 PM", "postID": "post74689897", "replies": []}]}]}, {"text": "Right", "time": "10th December 2017, 04:49 PM", "postID": "post74800280", "replies": []}, {"text": "give it 6 months to a year so they finish software  then get the build quality sorted out and the phone running on fully functional software all should be set , at the moment it's good hardware with junk software if they reckon this is polished is a polished turd", "time": "22nd December 2017, 02:19 AM", "postID": "post74924571", "replies": [{"text": "I don't know what your talking about, but right now as it stands, it's pretty polished to me. The only real issue i noticed was the camera and that's made quite a bit better by the last 2 updates from the ota's and camera updates via play store. I don't know what else you expect to be tweaked or fixed. This is based offa a stock android with few extra crap installed, unlike samsung/lg/etc and I wouldn't trade it\n\nNow give us a nice oreo 8.1 update and keep them coming regularly and I'd be happy as hell!", "time": "26th December 2017, 12:14 AM", "postID": "post74962234", "replies": [{"text": "if Samsung or Apple put out a phone with the software unfinished as this has on it they would have customers returning them ie note 7 fiasco, don't get me wrong it's a good phone but I feel it's been rushed to market. and I own in the region of 3 grands worth of razer products I just feel this is sub par compared to their normal effort.", "time": "27th December 2017, 12:46 AM", "postID": "post74973519", "replies": [{"text": "This is also there first phone.. Dunno if you remember how bad some other launches were years ago.\n\nGranted they did rush the software, but that's easily fixed assuming they keep up with updates, which they have been very good with so far.\n\nI'm no razer fanboi, but I think they have a stellar phone, easily a successor to the nexus line of phones by Google.", "time": "27th December 2017, 12:53 AM", "postID": "post74973560", "replies": []}]}]}]}, {"text": "Send me photo please", "time": "14th January 2018, 11:09 AM", "postID": "post75193414", "replies": []}, {"text": "Stock camera app is very slow (even after the update).\r\nOpen Camera is better and has much more options.", "time": "24th February 2018, 11:22 AM", "postID": "post75677298", "replies": []}, {"text": "Almost pure android", "time": "3rd March 2018, 11:41 PM", "postID": "post75763122", "replies": []}]}, {"title": "Charging speed", "rating": 5.0, "links": ["https://forum.xda-developers.com/razer-phone/review/charging-speed-t3699131"], "threads": [{"text": "Really quick to charge, it is very nice to be able to charge for about 15 minutes and 30% added charge.", "time": "6th December 2017, 12:20 AM", "postID": "post74749501", "replies": []}, {"text": "The gargantuan 4000 mAh battery charges quickly thanks to the included QC4+ charger; it doesn't get too warm while charging, with battery temps peaking around 30/36c (screen off/on) with a 23.3c room temp. That's with a case on as well.", "time": "1st February 2018, 03:36 PM", "postID": "post75410200", "replies": []}, {"text": "No one else talking about charging speeds? I was looking for some in depth reviews of the QC4+ wishing my QC2.0 gs8 had it mainly for controlling heat better. Anyone else notice huge difference between the two?", "time": "2nd February 2018, 04:17 PM", "postID": "post75422871", "replies": []}, {"text": "Very fast. Within an hour it's almost full.", "time": "24th February 2018, 11:23 AM", "postID": "post75677304", "replies": []}, {"text": "My phone stops quick charging after 25% and we'll go back to normal charging for the rest of time do any of you know what the problem could be. I am rooted and I am using magisk. So if you have any ideas let me know I have used the stock charger and wire and a combination of other Quick Charge Chargers and wires with the same result.", "time": "2nd March 2018, 06:11 PM", "postID": "post75749734", "replies": []}]}, {"title": "Screen on time", "rating": 4.0, "links": ["https://forum.xda-developers.com/razer-phone/review/screen-time-t3699132", "https://forum.xda-developers.com/razer-phone/review/screen-time-t3699132/page2"], "threads": [{"text": "1hr 30 mins of sot left with 64% battery\n\r\n48mins of gaming", "time": "4th December 2017, 12:52 AM", "postID": "post74727948", "replies": []}, {"text": "Battery saver on the whole time+720+60hz, on wifi+cell, web browsing+streaming, music, vids, txting, few games, 9+ hours SOT.\nGF's phone, ton of gaming/txting/fb/web, battery saver only turned on after <10%, 7+ hours SOT.", "time": "4th December 2017, 03:03 AM", "postID": "post74728602", "replies": []}, {"text": "SOT is good not great but that is at 120 1440. I easily make it through the day so why change it.", "time": "6th December 2017, 12:25 AM", "postID": "post74749525", "replies": []}, {"text": "This phone has amazing SOT! I'm sitting here 13hrs in, 37% battery remaining with 6hrs screen on so far.. Lots of browsing, some Lineage 2, and an hour or two of music streaming so far.. That's with bt/wifi/lte, auto brightness, max resolution and refresh rate. Just using stock without any battery saving stuff.. Alot nicer then my 6p for sure!", "time": "6th December 2017, 12:59 AM", "postID": "post74749692", "replies": [{"text": "Hi! I have a 6P and I'm on the fence about this phone. I absolutely love that it has a higher refresh rate screen, massive battery and lots of RAM.  I love my 6P but the battery life could be better and the Ram management is terrible( my biggest grip).  The lackluster camera on the Razer doesn't reeeeaally bother me as I don't take many pictures but how does the max screen brightness compare between the phones? If they are relatively similar that's great because I'm happy with the brightness on my 6P.  Thanks for your help.", "time": "7th December 2017, 05:58 PM", "postID": "post74768707", "replies": [{"text": "It's more than enough.. Especially if you turn off auto-brightness it gets very bright! I run my phone dimmer cause I like it, but it gets very bright, not sure what all the criticism was about.\n\nThe camera is lacking features and the quality is still average at best, but if you use one of the google/pixel camera ports it helps with the quality.. I really don't find the quality that bad myself, but the missing features definitely compared to the opengapps one.", "time": "7th December 2017, 06:08 PM", "postID": "post74768804", "replies": []}]}]}, {"text": "Its amazing i was watching episodes on netflix after 5 hours screen on time 62% of battery left.", "time": "7th December 2017, 10:43 AM", "postID": "post74764614", "replies": []}, {"text": "Best so far I've had.\r\nAverage around 6hrs. In my opinion best battery life I've ever had on a phone.\n\r\nResolution @ 1440p\r\nRefresh @ 120hz", "time": "8th December 2017, 04:56 PM", "postID": "post74778940", "replies": []}, {"text": "That is amazing specially if flagship devices cant even do half of that in most cases.", "time": "9th December 2017, 12:00 AM", "postID": "post74782283", "replies": [{"text": "OMG, don't get me started on the s8.. lol", "time": "9th December 2017, 09:30 PM", "postID": "post74792035", "replies": []}]}, {"text": "This is awesome phone", "time": "10th December 2017, 04:49 PM", "postID": "post74800277", "replies": []}, {"text": "Resolution 1440p\nRefresh 120Hz\nBrightness ~35%\nAmbient Display Off\nAdaptive Brightness Off\nNight light Off\nBuild number .853\n\nSOT ~8hours (2hours of which was Maps in the car.)\n~10min voice call\n~2hour WhatsApp call\n\nQuite unprecedented since my many years since day dot with Android.\n\nAs good as the SOT is, I'm more appreciating how the device deep sleeps - I like that flat line on the graph.\nNo need to fight with Android ecosystem or any quirky issues preventing deep sleep: the Razer sleeps like a baby (no greenify, battery improvement nor brevent nor lspeed nor sdmaid equivalent apps) \n\nWell done Razer.\nNow sort the tiny quirks and smack this out of the park", "time": "14th December 2017, 11:53 AM", "postID": "post74843857", "replies": [{"text": "Nice!!\r\nI am still impressed with the battery management.", "time": "14th December 2017, 12:45 PM", "postID": "post74844333", "replies": []}]}, {"text": "Almost 6 hours (last time I checked). So very impressive.", "time": "24th February 2018, 11:24 AM", "postID": "post75677313", "replies": []}]}, {"title": "Standby drain", "rating": 3.5, "links": ["https://forum.xda-developers.com/razer-phone/review/standby-drain-t3699133"], "threads": [{"text": "Here is something that seems to have helped my standby battery drain.:\nGo to phone settings\nUnder \"Wireless and Networks\" select \"More\".\nUnder there select \"Cellular Networks\"\nIn there disable \"Enhanced 4G LTE Mode\"\n\r\nThis may have helped me because I'm in a poor reception area.", "time": "28th January 2018, 12:36 AM", "postID": "post75355857", "replies": []}]}, {"title": "Heavy use endurance", "rating": 5.0, "links": ["https://forum.xda-developers.com/razer-phone/review/heavy-endurance-t3699134"], "threads": []}, {"title": "Light use endurance", "rating": 5.0, "links": ["https://forum.xda-developers.com/razer-phone/review/light-endurance-t3699135"], "threads": []}, {"title": "\"Look\" of the device (aesthetics)", "rating": 5.0, "links": ["https://forum.xda-developers.com/razer-phone/review/look-device-aesthetics-t3699136"], "threads": [{"text": "I love square phones. Also loved my Oppo Find 5 (until I dropped it).\r\nNice low key design with only the logo on the back and no lettering.", "time": "24th February 2018, 11:27 AM", "postID": "post75677345", "replies": []}, {"text": "This phone in my opinion looks very nice with the beveled edges and sharp corners. It's enough and not too much at the same time. I wish it came with more color options but I love the current color.", "time": "1st March 2018, 03:28 AM", "postID": "post75731799", "replies": []}]}, {"title": "Quality feel (use of materials)", "rating": 4.5, "links": ["https://forum.xda-developers.com/razer-phone/review/quality-feel-materials-t3699137"], "threads": [{"text": "It's heavy. Heavy enough to make me 2nd doubt my purchasing decision. I'd recommend holding one in person before buying to ensure you are okay with the weight. That weight is balanced fairly well with a slight bias towards the lower half, though I'm REALLY splitting hairs here.\r\n It's built solidly, but the sharp corners concern me in regards to drop performance. Considering that it's using Gorilla Glass 3 (more scratch resistant than GG5, but much less shatter resistant), has tightly packed components, and the fact that aluminum doesn't provide shock protection, I'd recommend a soft case. It'll add even more weight to the device, but is worth the trade-off for added grip and durability.", "time": "1st February 2018, 03:48 PM", "postID": "post75410341", "replies": []}]}, {"title": "Ergonomics (in-hand feel)", "rating": 4.0, "links": ["https://forum.xda-developers.com/razer-phone/review/ergonomics-hand-feel-t3699138"], "threads": [{"text": "Tjdb ebak", "time": "10th December 2017, 04:49 PM", "postID": "post74800281", "replies": []}, {"text": "just got my razer. Dont have a case yet planning to get the silicon one because without the case the aluminum casing feels cold, edges are fine, the power button is excellent, i just dont like the volume buttons. I feel with a good case it would be real handy and ergonomic", "time": "20th December 2017, 05:19 PM", "postID": "post74910115", "replies": []}, {"text": "The case gets really cold in AC and it's kinda uncomfortable", "time": "21st December 2017, 03:58 AM", "postID": "post74914356", "replies": []}, {"text": "It's a little big for my hands and a little slippery (that's what she said).\r\nBut with an Orzly case it's not slippery and holding it has a nice weight to it.\r\nTwo handed use phone mainly.\r\nToo bad landscape is only useful in one position ('cause of the left and right speakers that do not switch).", "time": "24th February 2018, 11:30 AM", "postID": "post75677371", "replies": []}, {"text": "I personally like phones that are more angular and designs like Xperia phones. I like the weight of the phone and think the heft to the phone gives it a good character.", "time": "1st March 2018, 03:26 AM", "postID": "post75731785", "replies": []}]}, {"title": "OEM skin/software", "rating": 5.0, "links": ["https://forum.xda-developers.com/razer-phone/review/oem-skin-software-t3699139"], "threads": [{"text": "Love that they used Nova launcher. I have used it a couple of years and it's still the best launcher. Even more when paired with KLWP.", "time": "24th February 2018, 11:31 AM", "postID": "post75677383", "replies": []}, {"text": "I love the overall UI, I love Nova launcher, I have been using it for a year and a half and think it's the perfect choice for this phone. The ui is very stock Android which I prefer a lot.", "time": "1st March 2018, 03:24 AM", "postID": "post75731770", "replies": []}]}, {"title": "Outdoor visibility (max brightness)", "rating": 3.5, "links": ["https://forum.xda-developers.com/razer-phone/review/outdoor-visibility-max-brightness-t3699140"], "threads": [{"text": "Just a heads up, turn off adaptive brightness and you can make the screen much brighter...  Don't know if this is meant or what..", "time": "6th December 2017, 07:27 AM", "postID": "post74752008", "replies": []}, {"text": "No problems outside. But like chanter100 says, adaptive brightness seems to keep brightness around where you set brightness, but if you turn off AB, then brightness gets higher.", "time": "6th December 2017, 01:53 PM", "postID": "post74755141", "replies": []}, {"text": "Not the best, but I have had all my phones on low brightness, because I rarely use them in full sunlight.", "time": "24th February 2018, 11:32 AM", "postID": "post75677391", "replies": []}]}, {"title": "Contrast (true blacks)", "rating": 3.5, "links": ["https://forum.xda-developers.com/razer-phone/review/contrast-true-blacks-t3699141"], "threads": []}, {"title": "Color saturation & accuracy", "rating": 4.0, "links": ["https://forum.xda-developers.com/razer-phone/review/color-saturation-accuracy-t3699142"], "threads": []}, {"title": "Clarity/resolution", "rating": 4.5, "links": ["https://forum.xda-developers.com/razer-phone/review/clarity-resolution-t3699143"], "threads": [{"text": "Has anybody seen checkerboard marks on the screen? Specially it's noticeable on mine in a white background.", "time": "22nd November 2017, 10:36 PM", "postID": "post74604466", "replies": []}, {"text": "Yup I got the checked board as well. Starting to get use it, but ruff when coming from AMOLED display.", "time": "23rd November 2017, 04:47 AM", "postID": "post74606404", "replies": []}, {"text": "I see it a little but hardly notice it.. If I hadn't seen it mentioned on here, I probably wouldn't have thought twice of it.", "time": "23rd November 2017, 06:01 AM", "postID": "post74606840", "replies": []}]}, {"title": "Minimum brightness", "rating": 3.5, "links": ["https://forum.xda-developers.com/razer-phone/review/minimum-brightness-t3699144", "https://forum.xda-developers.com/razer-phone/review/minimum-brightness-t3699144/page2"], "threads": [{"text": "The saddest part about display is this I quote: \"Razer seems to have opted for the latter since the Razer phone has one of the dimmest screens we have ever seen. Its brightness maxes out at just 223 nits. There is no max auto over-burn either, so you are stuck with that. Perhaps the high refresh rate necessitated this sacrifice. Whether or not it was a justified one is up to fans to decide. Contrast is sub-par as well. Definitely not flagship grade.\" Quote taken from gsmarena : https://www.gsmarena.com/razer_phone-review-1683p3.php", "time": "12th November 2017, 08:07 PM", "postID": "post74493173", "replies": []}, {"text": "I run my brightness as low as I can usually for battery savings and lifespan of the screen so this makes no difference to me \nNo phone does well in direct sunlight imo.", "time": "13th November 2017, 03:13 PM", "postID": "post74501060", "replies": [{"text": "I would like to disagree. Samsung S7 and newer S models are great in direct sunlight. Same with most Samsung AMOLED panels. usually LCD's are lacking in direct sunlight. And since this phone has such a dim screen, it makes sense.", "time": "13th November 2017, 07:07 PM", "postID": "post74503643", "replies": [{"text": "Idk, I just returned a s8 and that sucked in sunlight. Heh..", "time": "13th November 2017, 08:23 PM", "postID": "post74504417", "replies": [{"text": "Interesting. Then you'll hate the Razer as it will be far worse than the S8. lol", "time": "13th November 2017, 08:43 PM", "postID": "post74504614", "replies": []}]}]}, {"text": "Same here, and the fact that having the screen up at full brightness is just way too uncomfortable. Especially under ambient lighting conditions.\n\nGranted, Direct sunlight readability will be an issue but I live in London and most outdoor phone use requiring more than a few minutes of screen viewing just isn't conducive to city life", "time": "14th November 2017, 04:14 AM", "postID": "post74507565", "replies": []}]}, {"text": "Na, I accepted long ago that glossy screens and sunlight doesn't go together. Physics and all.. If it's an emergency I'll make it work of course.\n\nI know I'll be happier with the razer before I even touch it because I won't be strongarmed into submission like a Samsung user. That was one disappointment coming from the Windows Phone failtrain. Held out a good number of years.. \nPlus this has a combo of hardware that is unmatched right now. The software is obviously rough in the camera and display section, but at least it can change. I would hate to be iphone/pixel users atm.", "time": "13th November 2017, 11:16 PM", "postID": "post74505879", "replies": []}, {"text": "Right.. Being a grown up now I can do so much more, so hanging around in random places outside usually doesn't happen anymore. \nI'm at my computer usually if not at work. I'll just be glad to have this, which is just about as premium as premium gets for a phone, a computer, an entertainment device, and a personal gaming device.", "time": "14th November 2017, 02:12 PM", "postID": "post74511942", "replies": []}, {"text": "to be fair the screen brightness can go much higher, its just software probably holding back. as the device has an unlocked bootloader, expect alot of custom roms will be able to refine this device. razer will probably be very dev friendly...", "time": "15th November 2017, 10:56 AM", "postID": "post74521581", "replies": []}, {"text": "Got my phone, I think people complaining about screen brightness just never turned off adaptive brightness or Razer adjusted it since those reviews. The screen gets super bright. Almost as bright as my lumia 950xl. \nThe white on this is better than the white on that too, and it's an amoled.", "time": "22nd November 2017, 01:42 PM", "postID": "post74599253", "replies": []}]}, {"title": "Call quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/razer-phone/review/call-quality-t3699145", "https://forum.xda-developers.com/razer-phone/review/call-quality-t3699145/page2", "https://forum.xda-developers.com/razer-phone/review/call-quality-t3699145/page3"], "threads": [{"text": "The in-call volume is SO quiet and the mic is too sensitive; family can hear themselves loudly when I use speakerphone.", "time": "17th November 2017, 10:39 PM", "postID": "post74549668", "replies": []}, {"text": "yes the call volume is dramatically quiet as if you are speaking to someone long distance in the 80s. very unhappy about this. razer sort!", "time": "17th November 2017, 11:55 PM", "postID": "post74550063", "replies": []}, {"text": "Hmm. Perhaps a bluetooth device is required until Razer sorts this out.\nBetween the camera and this I still have to give them props for their first device. I don't see more problems than the Iphone X and Pixel 2 so far.. lol", "time": "18th November 2017, 01:59 PM", "postID": "post74555088", "replies": []}, {"text": "no issues here, i can hear well and no complaints on the other end", "time": "19th November 2017, 03:08 PM", "postID": "post74566552", "replies": []}, {"text": "Sounds pretty normal to me. I do have to kinda be precise on my ear placement but not terrible nor overly treble-thick.", "time": "22nd November 2017, 02:02 AM", "postID": "post74594334", "replies": []}, {"text": "Regular call volume is great for me. However when connected through Bluetooth if I make a call i can barely hear the other person, as if they are really far away. Incoming call on BT is fine though. Has anyone else experienced this?", "time": "22nd November 2017, 07:48 PM", "postID": "post74602991", "replies": [{"text": "I have this exact issue. Calls on the headset and speakerphone are fine. However just like you incoming BT calls are fine but outgoing are almost impossible to hear. I have tried removing and re-adding the pairing but no change.", "time": "22nd November 2017, 09:24 PM", "postID": "post74603862", "replies": []}]}, {"text": "A quick update. There was an update that I needed to restart to get. That fixed the bluetooth issue. Hope it works for anyone else too.", "time": "22nd November 2017, 10:45 PM", "postID": "post74604543", "replies": []}, {"text": "call volume is too quiet", "time": "22nd November 2017, 11:09 PM", "postID": "post74604702", "replies": [{"text": "Yes, call volume is very very quiet. Something needs to be done about call quality and clarity..", "time": "26th November 2017, 07:25 PM", "postID": "post74646569", "replies": []}]}, {"text": "When making an outgoing call, even the ringing tone is quiet.", "time": "28th November 2017, 06:40 PM", "postID": "post74670214", "replies": []}, {"text": "After having the phone a bit, I will have to agree that call is very quiet..  Even turned up all the way...  In fact you have to have it up all the way just to be able to have a conversation.", "time": "28th November 2017, 07:10 PM", "postID": "post74670572", "replies": []}, {"text": "And yet they say \"Oh that's strange. We've had no complaints of that.\"\n\nIf you complain enough, they'll replace it under warranty if you say you've factory reset it 4 or so times.\nBut there's no Limited Editions left so you'll only get a regular one. \n\nAlso they post your replacement only after you've sent yours and you've given them a tracking number.", "time": "28th November 2017, 08:27 PM", "postID": "post74671318", "replies": [{"text": "The limited edition, is not special. It's a sticker.\r\nAlso, in defense of Razer, they give you a prepaid label.", "time": "8th December 2017, 01:17 PM", "postID": "post74776844", "replies": [{"text": "It's also on your box. The green is a status symbol. It stands out as being one of the few that were available at launch. \n\nIt's a little thing that let's you be proud that you managed to get one.\nThat's the difference.", "time": "8th December 2017, 02:37 PM", "postID": "post74777595", "replies": [{"text": "If you're more concerned about a sticker's color to the point you're afraid to RMA it, that's on you.\nOtherwise if it were me? I would tear the sticker off before I RMA it and explain to customer service they're getting a phone back without the sticker.\nI understand what you're saying, but I feel it's unnecessary especially since it's a sticker. But I guess if the sticker makes you happier than the phone makes ya, grats. \nI'm willing to bet it wouldn't be that hard to duplicate the sticker. I'm pretty tempted to do so just to make all the folks who think it's so important realize, it's not. No serial numbers anyways.", "time": "8th December 2017, 04:04 PM", "postID": "post74778458", "replies": [{"text": "There's no real issue with the phone apart from a quiet in call volume but that can be sorted through access to the system files via root that should be possible via the factory images to be released on the 15th. \nAccording to some, changing a value or two should fix it. \nPerhaps we'll be able to tweak the mic as well to turn down it's sensitivity. \n\nNo need for an RMA for problems you can fix yourself. \n\nAlso having TWRP will be very useful for restoring the phone should anything happen to it. Long live android. \n\nP.S If you want to make a green sticker and stick it over that nice looking silver sticker be my guest but I'm not sure it's worth it to prove a point. And I'm not sure it's easy to print a fancy aluminum sticker with that specific colour ID. \nBut it's up to you. If you can you could make some nice profit on eBay lol. \nJust remember to make the sticker for the box too and put in the description that it's a replica sticker. :3", "time": "8th December 2017, 04:24 PM", "postID": "post74778655", "replies": [{"text": "Oh no, I wouldn't put one on my phone. But it would be some good profit.\r\nStep1 make stickers\r\nStep2 ?????????\r\nStep3 profit", "time": "8th December 2017, 04:51 PM", "postID": "post74778904", "replies": []}]}]}]}]}]}, {"text": "Call quality has been excellent for me.  I appreciate how well I can hear the folks on the other end of the line.", "time": "1st December 2017, 04:20 PM", "postID": "post74702445", "replies": []}, {"text": "I hear people very quiet when calling them. This phone performance wise is really good battery as well but i have a dilemma because i can swap it for what ever i want note 8 or iphone 8 plus huawei mate 10 pro currently my main phone is the Iphone X 256gb", "time": "7th December 2017, 10:47 AM", "postID": "post74764645", "replies": []}, {"text": "Have had the phone for two days\nMixed experience regarding call quality\nSometimes loud and sometimes a little low volume  , although not too much.\nStrange", "time": "7th December 2017, 02:05 PM", "postID": "post74766330", "replies": []}, {"text": "I am having in call issues. I am using Virgin Mobile on my Razer phone and one of my friend uses kudo on his one plus 5t.when on call I can here him fine but he cannot here me. He is the only person I have faced this issue with and same is for him. Not sure what the problem could be. Any thoughts.", "time": "17th December 2017, 09:34 PM", "postID": "post74879685", "replies": []}, {"text": "Sound while calling is a little low (how come? It has such good speakers?!)", "time": "24th February 2018, 11:35 AM", "postID": "post75677422", "replies": [{"text": "On speaker phone or ear?", "time": "24th February 2018, 07:20 PM", "postID": "post75681847", "replies": [{"text": "Ear. Haven't used speakerphone yet.", "time": "24th February 2018, 09:53 PM", "postID": "post75683027", "replies": []}]}]}]}, {"title": "WiFi strength, range, and throughput", "rating": 4.0, "links": ["https://forum.xda-developers.com/razer-phone/review/wifi-strength-range-throughput-t3699146"], "threads": [{"text": "Razer Phone about 20ft from wireless AC access point, between two walls. Downloaded data for TItanfall 600MB .obb pretty fast, less than a minute it seemed.\n\nSpeed test on the phone via my ISP site is 166.9 down, 15.9 up. Basically maxed out what the ISP is sending 150Mbps down, 15Mbps up.", "time": "22nd November 2017, 04:44 PM", "postID": "post74601164", "replies": []}, {"text": "Running Speed Test - See photo attached\n\nAt home on my 5Ghz network I've not dropped below 700mbs link between the phone and my router,  however that maybe due to my home setup and having some expensive Netgear hardware around the house but mostly have just used 4G over my home WiFi.", "time": "27th November 2017, 10:58 AM", "postID": "post74653142", "replies": []}, {"text": "Range is horrible on my Razer Phone.  I only get about 70% of the range of my previous Lenovo Phab 2 Pro and ZTE Axon M on 5Ghz band and about 80% of 2.4Ghz bands.  The wife's Samsung Galaxy Note 8 gets about the same range as my previous phones did.  I get the same results at my home and workplace.  I haven't ran speed tests yet as I'm most upset about the seriously lacking range.", "time": "5th January 2018, 06:58 AM", "postID": "post75083362", "replies": []}, {"text": "Probably has to do with 5Ghz, but when I am on the second floor (8 meters from router) speed goes down fast.\r\nBut apart from that it's super fast.", "time": "24th February 2018, 11:39 AM", "postID": "post75677456", "replies": []}]}, {"title": "Cellular strength and throughput", "rating": 4.0, "links": ["https://forum.xda-developers.com/razer-phone/review/cellular-strength-throughput-t3699147"], "threads": [{"text": "So far it's receiving signal better than my old 950xl and a s8. Noticeable difference as I have my work mapped out mentally as to where signal sucks(I thought) and where it's good.\n10-20% signals on both previous phones at my desk, now it's a solid 60% WITH lte+ vs the others were always hopping between lte and 3g.", "time": "22nd November 2017, 04:08 PM", "postID": "post74600824", "replies": []}, {"text": "Mine appears to have a better signal then my older HTC and S8 plus.. Not to mention the GPS on Waze while on my S8 plus would sometimes be off and move around, so far my Razer has been perfect.", "time": "22nd November 2017, 04:30 PM", "postID": "post74601046", "replies": []}, {"text": "I am having in call issues. I am using Virgin Mobile on my Razer phone and one of my friend uses koodo on his one plus 5t.when on call I can hear him fine but he cannot hare me. He is the only person I have faced this issue with and same is for him. Not sure what the problem could be. Any thoughts.", "time": "17th December 2017, 06:50 PM", "postID": "post74878423", "replies": []}]}, {"title": "Speakerphone (loudness, clarity)", "rating": 5.0, "links": ["https://forum.xda-developers.com/razer-phone/review/speakerphone-loudness-clarity-t3699148"], "threads": [{"text": "Tested speakerphone, real nice and loud. Caller couldn't hear herself at all though she speaks fairly quiet.", "time": "22nd November 2017, 02:03 AM", "postID": "post74594345", "replies": []}, {"text": "Speakerphone has been excellent on the Razer Phone.  People often tell me that they didn't know they were on speakerphone.  I just wish with these fantastic speakers that I could turn the volume up about 20% higher than it allows.  Sometimes you are talking to people that are using cheap bluetooth headphones that happen to have a microphone on it.  These calls are where I need to turn off the speakerphone and put the phone physically to my ear because it's not loud enough.", "time": "1st December 2017, 04:22 PM", "postID": "post74702465", "replies": [{"text": "Try Volume+ Free. It's the only app I could find that boosts in-call volume, and it does it quite well.", "time": "6th February 2018, 10:38 PM", "postID": "post75472090", "replies": []}]}]}]