[{"title": "Overall love", "rating": 4.5, "links": ["https://forum.xda-developers.com/v20/review/overall-love-t3484919", "https://forum.xda-developers.com/v20/review/overall-love-t3484919/page2", "https://forum.xda-developers.com/v20/review/overall-love-t3484919/page3", "https://forum.xda-developers.com/v20/review/overall-love-t3484919/page9"], "threads": [{"text": "Surprised at thin, light and high quality.", "time": "28th October 2016, 05:42 AM", "postID": "post69344006", "replies": []}, {"text": "yup...runs smooth...great replacement for my N7", "time": "28th October 2016, 06:14 AM", "postID": "post69344245", "replies": []}, {"text": "Didn't think I was going to be happy with ANY phone after losing my first true love, the Note 7.    All joking aside, this is one of the better phones currently available today!  Once you disable bloat and that God forbidden \"Lookout\" app that is the WORST app that a company could pre-install on any phone...", "time": "29th October 2016, 02:12 PM", "postID": "post69362023", "replies": []}, {"text": "I'm impressed with Android 7.0 and the LG V20 hardware.  I'm coming from a Note 4, and so far, I like it.  I've been riding stock.  No Nova Launcher, yet.", "time": "4th November 2016, 06:11 PM", "postID": "post69461271", "replies": []}, {"text": "I love it too. I'm on day two coming from a GS7 Edge that I just gave to my wife. AT&T had a great deal on a LG 10.1 G-Pad to go along with this phone so my wife got the pad and the edge. We're both extremely happy.\n\nI should also mention that I'm a loyal Note user from the original days. The GS7 Edge was my first foray back into a regular phone. \n\nOriginal Note\nNote 2\nNote 3\nNote 4 (just sold back to AT&T)\nGS7 Edge\nThis monster", "time": "4th November 2016, 09:38 PM", "postID": "post69463771", "replies": []}, {"text": "After using this phone I went back to my Note 7. I'll take my chances. Don't get me wrong, the LGv20 is not a bad phone, it just doesn't do anything exceptionally well. The screen is meh, the fingerprint scanner is annoying as all you have to do is touch it and it unlocks, i'd rather have the lgv10 fingerprint implementation. And the quad dac is less obvious than the lgv10. In other words the Dac on the v10 was better as in loudness. I don;t know if its nougat or the v20 but when I use the built in gmail app and I delete an email I get the option to undelete but it doesnt actually undelete. And one you go SAMOLED all screens look like ass in comparison.", "time": "14th November 2016, 06:59 PM", "postID": "post69620030", "replies": []}, {"text": "Best phone on the market as of November 2016.", "time": "16th November 2016, 05:48 PM", "postID": "post69652709", "replies": [{"text": "Nice going to T-Mobile today and going to use my jump on demand and get this bugger.. So pissed off about Samsungs locked bootloader! Going to miss the wireless charging in the brand new Defender case I just bought LOL no biggie.", "time": "17th November 2016, 07:56 PM", "postID": "post69671133", "replies": []}]}, {"text": "I just bought mine yesterday.  I've been using Galaxy S5s for a year and a half waiting for someone to come out with a new phone with swappable batteries and MicroSD.  The S5 is much loved by me.  I'm going to miss the wallet cover which positively shut off the screen on the S5 and the V20 is a little larger than I like, but I do like the fingerprint scanner which works a lot better than the last I used, which was a Note 4.", "time": "16th November 2016, 10:38 PM", "postID": "post69656574", "replies": []}, {"text": "I love my V20, I am so happy with it, the performance, battery life, build quality, appearance, all of it! <3 This device!\nI got it this past Monday 11/14, and it has been an absolute joy.\nIt has also made work related tasks much easier and my signal throughout the Denver metro area has been fantastic, much better than my S6 or my iPhone 6S Plus.\nFull bars in data centers where the other devices had one or two.\nI traded in my phone and sent my company issued phone back after two days owning the V20.\nIt is that good.", "time": "19th November 2016, 06:39 AM", "postID": "post69692173", "replies": []}, {"text": "I previously had an LG G4 for about a year before switching to a Huawei Mate 8 for about 3 months until I received my V20 H990DS this Friday, 18 November. So far I'm really happy. The phone has excellent build quality for a phone that has a removable battery. It's thin and light albeit slightly tall. \nI love the QHD screen, it may not be AMOLED but it is an excellent LCD panel with vibrant colors and it really looks great. I do have slight light bleed from the second screen but it doesn't bother me at all. In fact, I'll accept that to have the extra screen and I really hope LG keeps this feature in future versions of the V series. Though I do agree that LG should move to AMOLED for the next version in the V series lineup.\nI've enabled the app drawer and have found the LG skin to be a pleasant experience with its customization options and themes. Certainly a step up from the G4. The phone is really fast and the audio is absolutely amazing.\nI love having true dual sim with a memory card slot. Signal quality on wifi and LTE is excellent.\nAs for the camera's, I haven't spent much time testing them out yet but so far the image quality looks great and the wide angle lens is awesome despite the lower resolution.\n\nSo, I'm still experiencing the phone and testing out the various features but overall I really think LG did a great job with the V20 and I'm very happy with it so far.\n\nWhat else would I have liked? Wireless charging, AMOLED displays, higher resolution wide angle rear camera and front facing camera. Unlocked bootloader.\n\nThanks LG. Happy customer here! (so far)", "time": "19th November 2016, 09:36 PM", "postID": "post69702495", "replies": []}, {"text": "Had the phone now for about 2 weeks.   Coming from a Samsung ATIV SE Windows phone with Win10 Mobile.  \n\r\nSo far I like the build quality of the phone. Feels solid, glad it is not super thin like some of the new phones.  Hate that, do designers think people are a bunch of wimps that can't hold anything over a 5mm thick?\r\nThe screen is good.  I am not one that really cares what type of screen I have, whether its OLED or LCD.  As long as I can read it, I am good with it.  \n\r\nGuess my biggest disappointment is with the OS.  I have been away from Android on a phone, though I have three Android tablets, plus an Ipad for work and a 8\" Windows tablet for tinkering.\r\nI am NOT IMPRESSED with Android 7.0.  The camera app on the V20 is good, but the processing software makes for some rather crummy pictures, either in auto or manual mode.  Too much noise if you barely zoom in.  Not real impressed right now after spending a couple days trying to get good with the camera.\n\r\nAs far as Android in general,  there is too much fragmentation, almost too many apps trying to do the same function, while all of them doing it rather poorly.  I don't need 5 different file managers, I just need one that does what I want it to do.  Same with web browsers.  How many do you really need?\n\r\nGuess I am just used to using my phone as a phone first, work tool second.  I don't have all the gee whiz apps like Instagram, Snapchat, and all that garbage.  I use my phone for specific functions and I want apps that do it right the first time.\n\r\nHopefully by the time my contract is up on this phone, Verizon will be off CDMA and fully switched to their version of GSM.  Then maybe some phone makers will start making Windows phones for their network again.  Going to be a long 2 years for me.  May just sell this V20, and go back to my ATIV SE for the duration.  Not impressed with Android right now.", "time": "20th November 2016, 03:00 AM", "postID": "post69705081", "replies": [{"text": "I think you got some bloat from your carrier, not LG.", "time": "20th November 2016, 06:59 PM", "postID": "post69715235", "replies": [{"text": "Actually I have disabled everything from VZW except their Messaging app.  \n\r\nGuess you didn't follow what I was saying.  Too much fragmentation in Android, period. Minimal quality controls.  Instead of one or two really good apps to do a specific function, you have 15 or 20 that are at best mediocre apps.\r\nI blame the majority of that on having Java as the main app language for Android.  Any 12 year old can write code for Java, doesn't mean it is clean, concise, efficient code.  Same with apps. Just because it was easily written, doesn't mean it is a good app.\r\nAre there bad examples of other type of code?  Of course, but Java seems to be the most prevalent from what I have seen.\n\r\nAlso the few apps that I have on Android now that I had on my Windows phone, mainly the Office and MS related ones, are not that great actually.  I don't expect MS to make them as good for Android, but even then, at least make them useable.", "time": "21st November 2016, 07:04 PM", "postID": "post69729278", "replies": [{"text": "Let's agree to disagree on that.  I've used Windows phone, had iPhone before and now Android. Android is by FAR the best os.  Yes, it's not perfect but it's much better than anything else out there. Regarding app.. I honestly don't understand you.. just get the good ones. Nobody promised that ALL apps on the store are good.  Do 1 minute research before downloading.\r\nReally, you comment sounds a bit ridiculous. No offense.", "time": "21st November 2016, 09:33 PM", "postID": "post69731148", "replies": []}]}]}]}, {"text": "I really like this phone.  The only thing I don't like is the headphone/quad dac/thing.  I get volume issues (I.E. The max volume changes from day to day like the quad dac is not always activated.)  Sound cuts out randomly at a rate of about 20 times an hour.  If I clear cache (both from recovery and from settings > storage) the issue goes away for a while.  I talked to Verizon, and they said that they were aware of the issue and are waiting on a software fix....  So once that is fixed, I think this phone is damn near perfect for my use.  Second screen *does* light bleed in darkness, but that doesn't bother me.", "time": "3rd January 2017, 02:00 PM", "postID": "post70374489", "replies": [{"text": "I'm having the same issue with the DAC. Hopefully when LG patches the security flaws it addresses that as well.", "time": "6th January 2017, 03:46 AM", "postID": "post70415777", "replies": []}]}, {"text": "This phone is junk, CONSTANT lag, terrible memory management.", "time": "5th January 2017, 05:55 PM", "postID": "post70409417", "replies": [{"text": "I would have to disagree.", "time": "15th January 2017, 05:17 PM", "postID": "post70566080", "replies": []}]}, {"text": "I came from a V10 (and before that a Note 4). \n\nI think the V20 is a huge improvement over the V10 in day to day performance.  SD808 to SD820 is no comparison.   V20 is a solid improvement in battery life, especially in standby. It still guzzles juice like none other when taking pictures especially recording video, however.   The V10 was lacking in all-day usability.  The V20 is up there with how my Note 4 used to be under KitKat before Samsung ruined its battery life with a series of increasingly buggy software updates.  \n\nI like the larger font and extra brightness of the 2nd screen and at least on my units, the V20's Second Screen has less light bleed than my V10's. I preferred the physical design and textured back of the V10.  The V20 is way too slick without a case.   Ideally, I'd have rear volume buttons and where the battery release button is on the V20 would be a dedicated camera shutter button or some kind of assignable multi function button.   Wide angle camera isn't the best quality but has been surprisingly useful on the V20 and is quickly becoming a essential feature.   \n\nV20 charges with inconsistent speeds but overall much faster than the V10, even on an old non-QC  1A charger I have in my office.  \n\nCall quality and reception on the V20 is better than the V10.   \n\nI wish the V20's screen was a little brighter at maximum brightness and a little dimmer at lowest setting.   I REALLY miss not having at least the option for wireless charging on the V20.  I have Qi pads all over the house from my Samsung days that are now useless.  \n\nThe camera on the V20 is a little better than the V10's for stills and a lot better in video but results in Auto mode still leave much to be desired.  The camera can be incredibly slow to launch and take pictures, especially on multiple shot to shot sequences.  Not being able to mute the camera shutter noise is SO annoying!  Samsung has had it since the GS5 I believe.  I love being able to adjust the screen density in Nougat. Finally I can shrink down the onscreen nav buttons at least somewhat!  \n\nOverall I am happier with the V20 than I was with the V10 but there's still plenty of room for improvement  by LG.", "time": "6th January 2017, 03:01 PM", "postID": "post70423005", "replies": []}, {"text": "Considering this phone. Concerned about signal. I've had a note 4 before. Would you say this has better signal and call quality than the note 4??", "time": "8th January 2017, 04:03 AM", "postID": "post70448232", "replies": []}, {"text": "Coming form G5 im not that much happy. \r\nLoudspeaker is terrible. Sound is very quiet and sound quality is terrible. \r\nUsing screen will leave many marks comparing to G5 that will not show any fingerprint. So when you scroll down, you will always see things over your screen. \r\nTaking phone after my old one, with grey background you can see screen blinking (refresh rate seams very low)\r\nPhone speed for some reason looks lower then G5 but that always can be because of newer software and it could be fixed in new updates. \n\r\nOverall, i like new screen but i would never buy this phone, just waited for G6.", "time": "8th January 2017, 07:51 AM", "postID": "post70449913", "replies": []}, {"text": "guys i'm using this phone for about 5 days now, i have to say battery life is a big concern to me; if i streram music listening to it with a BT headset, battery consumtpion rate is about 25% every hour, i't huge! however i just made an Antutu Benchmark yesterday and obtained a HUGE Score of 142566! got to figure out this battery thing cause the v20 is a nice performer and camera features are pretty sweet.", "time": "10th January 2017, 11:29 AM", "postID": "post70484894", "replies": [{"text": "get the battery kit. that'd help you a lot. (or get a powerbank that is capable of FastCharge function). \n\r\nAnd ... Geez, man!!!! why're u using BT headset??? I mean, I'm not blaming you for battery drain, but ... this phone has Quad DAC!!! pls use a cable headset and get use those DAC modules. You'll see a huge difference. They're truly unique to this phone.", "time": "11th January 2017, 06:12 AM", "postID": "post70498356", "replies": []}]}, {"text": "I love it over my Samsung Galaxy Note Edge for the following reasons:\n\nThe LG V20 charges faster (using the same charger for each phone)\nThe LG V20 does not seem to lag therefore appearing much faster whereas the Touchwiz noticeably lags\nThe LG V20 battery life (especially for an extreme user such as myself) is amazeballs!\nThe LG V20 is a beautiful, lightweight, thin device.\nThe LG V20 appears more customizable (not taking root into account) with LG's home screen.\nThe LG V20 does not contain very much bloatware (at least the T-mobile version does not) compared to the other phone.\n\nDid I mention how beautiful it is and how fast it is??", "time": "13th January 2017, 04:46 AM", "postID": "post70529114", "replies": []}, {"text": "Just picked up a H990 DS (dual sim) for $396 AUD (x 0.75 for USD at time of writing) which seems expensive but the dual sim versions command a premium.  Really looking forward to the high-quality audio.  I still use AUX IN for playing music on my car and its very annoying having to turn up volume on my Galaxy Note Edge (note 4) to maximum and have to also increase the volume on the car's stereo significantly to get decent volume.  You basically go deaf when you switch back to the CD or radio!  My car has a factory-fitted THX-certified sound system (BMW E85 Z4 M Roadster).\n\r\nLove the fact that its durable, has a replaceable battery, good camera and secondary screen (I find it useful on the Note Edge).  Was going to buy another Samsung but realised that what I've loved about Samsung phones is no longer around - replaceable battery, durability (see how easily people smash their S8 screens!) and practicality(second screen) and cool multi-media capabilities with the DAC and great video quality.  Already bought spare battery and charger to compensate for what may be a bad battery issue, but its probably not as bad as people are stating.\n\r\nReally useful that it also has expandable storage in addition to (not in place of) being dual sim.  Got mine in black and can't wait!!!!", "time": "28th December 2017, 02:53 AM", "postID": "post74985800", "replies": []}]}, {"title": "Community development strength", "rating": 3.0, "links": ["https://forum.xda-developers.com/v20/review/community-development-strength-t3484920", "https://forum.xda-developers.com/v20/review/community-development-strength-t3484920/page2"], "threads": [{"text": "Well, seeing as though there is NO comments, I will be the first to say that I am hoping that we get root as quick as possible!  Judging by the great people we have working on this phone, I have ZERO doubts!", "time": "29th October 2016, 02:13 PM", "postID": "post69362045", "replies": []}, {"text": "M only concern is carrier specific development. T-Mo is doing well, as well as any HK based v20; however, AT&T/Verizon/Sprint models are yet to get as much attention.", "time": "29th October 2016, 02:24 PM", "postID": "post69362163", "replies": [{"text": "what this guy said^^^^\r\nI'm on Verizon...I do see that bootloader unlock was achieved with the pixel on Verizon... so I'm sure it's possible with this device, on Verizon, I just don't know if the verizon variant will get the needed support from the development community.  I wish I had a clue...", "time": "29th October 2016, 04:38 PM", "postID": "post69363873", "replies": []}]}, {"text": "Seems like real development is about to start for Tmobile! @Chainfire confirmed that the LG V20 has been rooted. And i also have seen some users concerned with other variants even if it is not the variant they are using >> good solidarity. So , we all hope that each variant find the path to the root. The more the merrier!", "time": "31st October 2016, 05:12 AM", "postID": "post69386575", "replies": []}, {"text": "I plan on picking up the VZW version in the next couple day.  Hopefully more people will do the same.\n\r\nWhat would the devs need from the VZW version to start work on the boot loader unlock / getting root?  \n\r\nWilling to try and help with that.  I am fairly familiar with Linux and somewhat with adb, so just tell me what you need, how to pull it, and I will do my best to pitch in.\n\r\nDk if I will root mine specifically because I will use it for work also, and some of our software will not currently accept a rooted Android phone onto the network.  Can't say what it is, other than it is in-house proprietary software.", "time": "2nd November 2016, 05:01 PM", "postID": "post69428089", "replies": []}, {"text": "Development is very weak on all carriers except T-Mobile.", "time": "3rd November 2016, 08:30 AM", "postID": "post69437938", "replies": []}, {"text": "for now development for Tmobile model is pretty decent. I just hope it wont die too early\nWe got root and future look bright. Other models not so lucky with development just because they are locked", "time": "3rd November 2016, 04:32 PM", "postID": "post69443819", "replies": []}, {"text": "I hope we can get development on the factory unlocked non carrier specific version as well!", "time": "5th November 2016, 01:11 AM", "postID": "post69465784", "replies": [{"text": "I think you're pretty much in the clear", "time": "5th November 2016, 11:29 AM", "postID": "post69470511", "replies": []}]}, {"text": "I'm offering up my Verizon device for testing.", "time": "5th November 2016, 08:01 PM", "postID": "post69477390", "replies": []}, {"text": "Maaaan i hope they manage to make Resurrection Remix and ACIP roms for the LG V20. Those 2 are my favorite roms on every device i have had.  and if the 2nd screen is the problem, they can drop that behind (at least for a while, i wouldnt mind) lol. Of course, first someone need to start with CM14 for this device. (I have been looking all over the web, including github and there is not  a single trace of CM14 for LG V20) on the other hand, at least we have root for the h918, ( i also hope other variants get root too). It is odd that no one have asked the question of: \"Will there be CM14 for the LG V20?\".... at least none existen threads, nor comments could be found while googling. but well. I guess i turned out to be the first, lol. Although i saw on CM website there is a subforum of the LG V20, however it is totally empty.", "time": "20th November 2016, 04:04 AM", "postID": "post69705506", "replies": []}, {"text": "Compared to when I first bought this phone, the development has really picked up.  \n\r\nI'm on the Resurrection Remix ROM for Verizon and i'm loving it.", "time": "3rd February 2017, 01:02 AM", "postID": "post70854268", "replies": []}, {"text": "I wish there was some developing going on for version H990ds", "time": "6th February 2017, 09:30 AM", "postID": "post70900960", "replies": [{"text": "Once it get root and open bootloader life will be much easier \r\nSame thing for 990.\r\nIts almost there 😎", "time": "6th February 2017, 10:23 AM", "postID": "post70901497", "replies": []}]}, {"text": "Very quiet in this thread  for the last 3 months. \nI've had my V20 for a day and I'm loving it. I researched a lot beforehand and knew development was pretty much nonexistent but I hope there may be a root exploit in the future. \nI have the H990ds Taiwan model.", "time": "7th May 2017, 09:30 PM", "postID": "post72204531", "replies": []}]}, {"title": "Overall speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/v20/review/overall-speed-t3484921", "https://forum.xda-developers.com/v20/review/overall-speed-t3484921/page2", "https://forum.xda-developers.com/v20/review/overall-speed-t3484921/page3", "https://forum.xda-developers.com/v20/review/overall-speed-t3484921/page8"], "threads": [{"text": "Did not know this, but what a difference. Thanks.", "time": "29th October 2016, 03:42 AM", "postID": "post69356410", "replies": []}, {"text": "I do this for any Android phone I buy since years. This works on all Android phones", "time": "29th October 2016, 05:22 AM", "postID": "post69357145", "replies": []}, {"text": "VZW model here: got the phone late yesterday afternoon. Got an update early this AM. Phone struggles multitasking when I have Google music, hangouts, web browser, email open. Lag switching between apps. Not happy.", "time": "29th October 2016, 11:32 AM", "postID": "post69360344", "replies": [{"text": "Just opened up every app that you mentioned PLUS 3 others, and it multitasks like a champ!  I can go into the previous apps and scroll through them with ease and then hit any of the apps and it pops up instantly without any reloads...   What is the exact situation you are having issues with cause I have the T-Mobile version ( which also has lots of bloat ) and I am seeing the exact opposite as you are.  The FIRST thing I always do is to disable as much bloat as I can and the number one app that needs to be disabled is that NASTY Lookout app!  That should almost be illegal to put onto our phones!  I seriously can't believe people think they need these types of apps on the Android platform, just be conscious of what you are doing and you should never need anything that scans all apps in the background...", "time": "29th October 2016, 01:03 PM", "postID": "post69361219", "replies": []}]}, {"text": "I've disabled all VZW bloat which wasn't much actually. I am in the process of resetting and wiping the phone and will report back.", "time": "29th October 2016, 01:05 PM", "postID": "post69361246", "replies": [{"text": "I see that you are using a Pixel XL?  Maybe that's why you are a little let down?  LOL  j/k of course, but that phone is probably the smoothest Android phone I have ever used personally...  Don't forget to also go into \"Battery & power savings\" and disable that \"Game battery saver\" that is always on by default!  This is why so many reviewers are noticing frame drops, because it is trying to save battery while performing tasks that need it the most!  Why they have this on by default just amazes me, because the average person would just think that this phone kinda lags in certain games...  Just an FYI, you may have already found that out.", "time": "29th October 2016, 02:08 PM", "postID": "post69361973", "replies": []}]}, {"text": "OK reset lg 5 times and during each setup, the screens lagged and are slow. Phone is definitely slow. I tried with and without Sim card installed using Wi-Fi or network.\nI think the overnight VZW update is the culprit. Returning phone today.", "time": "29th October 2016, 02:15 PM", "postID": "post69362063", "replies": [{"text": "That sucks!  Sorry dude, luckily you have that KILLER Pixel phone already.  Looks like you either got a dud, or Verizon's variant has some issues...", "time": "29th October 2016, 02:37 PM", "postID": "post69362315", "replies": []}]}, {"text": "OK just for fun one last time before I was going to return did another reset w/o sim but on wifi. Phone  responded normally during setup and now with all apps loaded.\nBut the Pixel XL, Note 7 (RIP) and   Edge (especially the unlocked firmware) are definitely faster overall. With that being said, this phone is still competent and a pleasure to use.", "time": "30th October 2016, 11:55 AM", "postID": "post69374979", "replies": [{"text": "yep..it'll do until the note 8...it'll do", "time": "30th October 2016, 04:44 PM", "postID": "post69378572", "replies": []}]}, {"text": "Runs in circles all day long, trade in phone was the original LG Flex, this thing is supersonic", "time": "31st October 2016, 04:37 PM", "postID": "post69394287", "replies": []}, {"text": "Nice! The animation fixes really do seem to speed it up even more.", "time": "31st October 2016, 08:19 PM", "postID": "post69397810", "replies": []}, {"text": "Picked mine up last night.  Traded in a note 5.  Definitely much faster!  Only thing I can complain about is the USB C connector.  I have a bunch of micro-USB cables around, including the car charger... Hate to have to buy more cables.", "time": "1st November 2016, 12:16 AM", "postID": "post69400569", "replies": [{"text": "Just buy adapters for those cables:\nhttps://www.amazon.com/gp/product/B0...?ie=UTF8&psc=1", "time": "1st November 2016, 12:23 AM", "postID": "post69400620", "replies": []}]}, {"text": "Cool!  Thanks!", "time": "1st November 2016, 12:48 AM", "postID": "post69400888", "replies": []}, {"text": "I am on Sprint and the phone lags more when it is charging because the phone gets hot.", "time": "3rd November 2016, 08:35 AM", "postID": "post69437984", "replies": []}, {"text": "When I stopped charging my phone when I played games the lag become very minimum.\n\n\n\n---------- Post added at 06:33 PM ---------- Previous post was at 06:31 PM ----------\n\nSamsung phones don't slow down when they become super hot which is why they are more prone to catch on fire.", "time": "3rd November 2016, 07:33 PM", "postID": "post69446567", "replies": [{"text": "<MOD EDIT>\n\n\r\nSamsung's are notorious for throttling.  Check anandtech.  Pull that out of thin air?", "time": "3rd November 2016, 08:40 PM", "postID": "post69447562", "replies": []}]}, {"text": "I think you should be happy with type c regardless of how many old charges you have. At least you don't have to worry about them dang prongs being pushed in no more making the charger useless", "time": "5th November 2016, 11:33 AM", "postID": "post69470537", "replies": []}, {"text": "my phone was running really fast but today it was going really slow. I ended up going into twrp and wiping dalvik and cache and disabled a few more apps with titianium backup (T-mobile stuff) and it seems okay again. hopefully it stays. is there a better way to disable apps then titianium backup i feel like TB is overkill. on note 7 there was an app with no root required that net you disable them. and i know of the pm hide <package> shell command. wonder which is better. What ways have you guys done it and what apps have you disabled?", "time": "8th November 2016, 01:01 AM", "postID": "post69512002", "replies": []}, {"text": "On my phone I'm noticing intermittent stuttering and lag. I use klwp and I've noticed that most themes with animations stutter when I was able to run them just fine on my note 5.\n\nAnyone else notice this?", "time": "8th November 2016, 11:10 PM", "postID": "post69526856", "replies": []}, {"text": "No lag at all", "time": "15th August 2017, 07:14 PM", "postID": "post73413773", "replies": []}, {"text": "I think LG ui make the phone slow a bit. I have LeEco phone it's faster for everyday use, open apps. If you put stock Android on v20 it would be good,better than LG ui I would think. But overall experience is fine great screen, exceptional audio, good battery life.", "time": "16th August 2017, 04:17 PM", "postID": "post73423847", "replies": []}, {"text": "Properly optimized, this phone screams!", "time": "29th August 2017, 11:48 PM", "postID": "post73590106", "replies": []}, {"text": "Seems to handle most things like a champ.. do have some issues occasionally of slow downs or pauses.. not sure if related to multitasking..", "time": "9th November 2017, 04:50 PM", "postID": "post74460390", "replies": []}, {"text": "For those who have lags, are you rooted amd have you tried removing RCTD? https://forum.xda-developers.com/v20...-root-t3661490", "time": "18th November 2017, 09:18 PM", "postID": "post74559107", "replies": []}, {"text": "Poor performance", "time": "10th December 2017, 01:20 PM", "postID": "post74798039", "replies": []}, {"text": "Not so favourable after a while of using. Especially when you switch frequently and quickly among apps for multi tasks, it can be a bit frustrating.\n\n---------- Post added at 02:42 PM ---------- Previous post was at 02:38 PM ----------\n\nI guess nowadays the app developer are intentionally creating more and  more sophisticated apps to burden our phones, and without substantial value. I just can not understand facebook even occupies several hundreds megabites of my storage space, which I barely open. This is exploiting and ungrateful.", "time": "1st April 2018, 02:42 PM", "postID": "post76088116", "replies": []}]}, {"title": "App launch speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/v20/review/app-launch-speed-t3484922"], "threads": []}, {"title": "Multitasking/RAM", "rating": 4.5, "links": ["https://forum.xda-developers.com/v20/review/multitasking-ram-t3484923"], "threads": [{"text": "Multitasking works way better than my n4. However I still think multiwindow works better with samsung phones.", "time": "23rd December 2016, 12:37 AM", "postID": "post70215381", "replies": []}]}, {"title": "Scrolling smoothness", "rating": 4.5, "links": ["https://forum.xda-developers.com/v20/review/scrolling-smoothness-t3484924"], "threads": [{"text": "Must say, it's waaaay better than the (3) Note 7's that just got sent back to T-Mobile...  I say (3) because that's the number of phones I had through this whole fiasco that just ended.  So I def had a chance to see the differences , if any.", "time": "29th October 2016, 02:18 PM", "postID": "post69362098", "replies": []}, {"text": "Scrolling isn't choppy at all.  200 custom icons in Nova or a complex webpage like say the New York Times.  Even with the animation speeds in Developer Options set to 0.5x it is still smooth and flies.\n\r\nIf I were to be very VERY critical....v20 like most Android mobiles (and most AMOLED/IPS screens be they mobile or desktop) has some motion ghosting to it.  I'm being nit-picky there though.", "time": "29th October 2016, 05:37 PM", "postID": "post69364673", "replies": []}, {"text": "When using the ebay app, the phone seems to stutter when im scrolling up and down a page. Does anyone else have stutter/lag. Like if a scroll through a sellers page and browse cases is where i notice the stutter.", "time": "29th October 2016, 09:46 PM", "postID": "post69367822", "replies": []}, {"text": "I have been having the same problem to with eBay to I think it's the app cuz everything else is still buttery smooth and most times its the app cuz when a new OS is out some apps have not been updated to new systems", "time": "30th October 2016, 04:09 AM", "postID": "post69371016", "replies": []}, {"text": "Was laggy but after removing facebook and messenger apps\nIt is very amooth and fast", "time": "21st January 2017, 02:08 AM", "postID": "post70651336", "replies": []}, {"text": "Like a baby's bottom.", "time": "3rd February 2017, 01:05 AM", "postID": "post70854295", "replies": []}, {"text": "Just got a second-handed one on taobao. Can't complain with this.", "time": "1st April 2018, 02:45 PM", "postID": "post76088184", "replies": []}, {"text": "Three Sprint V20s here. No issues with scrolling. Yeah maybe an app or two but I attribute that to the apps. Always in Comfort View so no ghosting or burn issues either", "time": "1st April 2018, 07:55 PM", "postID": "post76090975", "replies": []}]}, {"title": "Heat", "rating": 4.0, "links": ["https://forum.xda-developers.com/v20/review/heat-t3484925", "https://forum.xda-developers.com/v20/review/heat-t3484925/page2", "https://forum.xda-developers.com/v20/review/heat-t3484925/page3"], "threads": [{"text": "What heat? The battery gets a little warm while charging. Once charged it reverts to room temperature.", "time": "23rd October 2016, 02:49 AM", "postID": "post69261101", "replies": []}, {"text": "i did a test. now the file got corrupted  (because i used both, horizontal and vertical mode) so,, if i get to fix it i will upload it IT last about 3 hours playing 1440P videos, but the battery warmed upto about 41-42C.  If the corrupted file doesnt fix, then im going to do a 1080p video and see how long it last.", "time": "23rd October 2016, 03:02 AM", "postID": "post69261192", "replies": []}, {"text": "I know Samsung is getting heat right now, but the LG did get warm when doing the initial download and setup. Not hot, just warm.  During charging using AIDA64 I saw temperatures around 50c at times, and the battery temperature was up to 36c. This is similar to the temps on my S7 edge.  I was not doing a fast charge, just using a regular wall charger with the included cable.", "time": "25th October 2016, 11:44 PM", "postID": "post69308277", "replies": []}, {"text": "This phone is perfectly fine, and does NOT heat up any more than the average smartphone does.  No need to worry about anything here...", "time": "29th October 2016, 02:15 PM", "postID": "post69362071", "replies": []}, {"text": "I haven't noticed any heating at all, Even when setting up.", "time": "30th October 2016, 03:15 AM", "postID": "post69370625", "replies": []}, {"text": "It only got slightly warm during set up, as it was downloading over 90 apps from my google account backup. I dont think we have to worry about heat with this one.", "time": "30th October 2016, 01:57 PM", "postID": "post69376310", "replies": []}, {"text": "Mine got a little hot when gaming for a while but that's any cell phone.", "time": "30th October 2016, 06:22 PM", "postID": "post69379956", "replies": []}, {"text": "Mine didn't hear heat up using lg backup surprisingly.  Mine barely has any noticeable le temperature increase during charging.  Haven't tested a heavy duty game yet.  Done some heavy file transfers over wifi and screen mirroring.  No heat.", "time": "30th October 2016, 11:41 PM", "postID": "post69383948", "replies": []}, {"text": "Just got my v20 a week ago and this thing runs cold all the time. Im coming from a HTC 10 and it's quite nice. My HTC 10 would get hot enough while charging it or playing a intensive game it needed to be stuck in a case or it would almost burn me.", "time": "8th February 2017, 03:26 AM", "postID": "post70929379", "replies": []}, {"text": "My V20 was running hot, over 102°f\nI had 32% battery life when I pulled the battery and waited 2 mins before I turned phone back on. When I turned phone back on, I was at 18% battery life and it's still declining as I'm writing this. WTF???", "time": "7th April 2017, 03:53 PM", "postID": "post71765652", "replies": []}, {"text": "Haven't had any over heat battery issues as of now, and I'm with this phone since December 2016.", "time": "13th April 2017, 01:56 PM", "postID": "post71843627", "replies": [{"text": "Same here, had it since it first came out and never had any heat issues with it. I swear these manufactures release updates and cause our phones to start acting up wherever they release a new device. It started happening after the G6 was announced and I received an OTA update for bug fixes! Bug fixes my ass, they just want us to buy a new phone!", "time": "13th April 2017, 05:18 PM", "postID": "post71846274", "replies": []}]}, {"text": "Actually I had this problem a week ago. I had an LG V10 before that did the same thing then a few days later fried. I had to return it for warranty repair then sold it. Fast forward to an LG V20, love it had it for a few months then suddenly it was draining battery fast and getting hotter then normal. I downloaded  a few battery apps to help me trace the culprit but to no avail. Finally one day I just powered it off for about 2 hours and it has been back to normal since then.\n\r\nVery strange and got me a bit worried about another chipset frying or another bootloop... lets hope not.", "time": "14th April 2017, 10:15 PM", "postID": "post71863422", "replies": [{"text": "Thanks, I'll try your method and hopefully it'll work for me as well. I had the same thing happen with my V10, and I loved that freaking phone, was built like a sexy tank. LoL\nI hope my V20 doesn't start down same road of infinite bootloop, from which there's no return.👍", "time": "15th April 2017, 02:22 PM", "postID": "post71871211", "replies": []}]}, {"text": "I've had a v20 H990N for a little over a week, coming from a G3 (3 years without any issues until it died, i prefer to keep phones as long as they work).  I have played asphalt extreme for at least an hour straight a few times on wi-fi, with the screen between 60-70% brightness and have not experienced anything except minor warming.", "time": "18th April 2017, 09:17 PM", "postID": "post71919188", "replies": [{"text": "Need to follow your update cycle, getting phones and keeping it until they stop working. I have so many phones that I've collected, I used to switch out just for sake of changing phone shape etc.\n\nI'm on v20 and intend to use it until it dies.", "time": "20th April 2017, 07:05 PM", "postID": "post71951003", "replies": []}]}, {"text": "I does heat much more than expexted", "time": "30th April 2017, 06:06 PM", "postID": "post72104876", "replies": []}, {"text": "I've been getting constant high temperature warnings on my v20 recently. Not even with high usage. Took 3 pictures and up pops the high temperature warning, without having any other apps running.  This is also my second v20 as the first would restart every 30 seconds before even leaving the TMobile parking lot. I'd be careful with this phone, as much as I love it there is constant screen retention on the notification area, this new overheating issue, 4 hours screen on time, and no security updates. I must say though the phone is excellent with a great camera,screen, and processor, these few problems are going to make me buy from a different company in the future.", "time": "11th May 2017, 04:18 PM", "postID": "post72254552", "replies": []}, {"text": "Looks like your battery could be on its way out. Try an app like AccuBattery for a few days, get an idea of battery health, you got nothing to lose.", "time": "11th May 2017, 05:46 PM", "postID": "post72255581", "replies": []}]}, {"title": "Low light", "rating": 4.0, "links": ["https://forum.xda-developers.com/v20/review/low-light-t3484926", "https://forum.xda-developers.com/v20/review/low-light-t3484926/page2", "https://forum.xda-developers.com/v20/review/low-light-t3484926/page3", "https://forum.xda-developers.com/v20/review/low-light-t3484926/page4"], "threads": [{"text": "Looks like an oil painting...", "time": "25th October 2016, 05:46 AM", "postID": "post69294896", "replies": []}, {"text": "Low light was certainly a disappointment. Took side-by-side photos using V20 and my S7 edge.  The LG does no better than a 6 version iphone. Not even in the same class as S7.", "time": "25th October 2016, 11:40 PM", "postID": "post69308238", "replies": []}, {"text": "I agree that low light seems pretty average. Dynamic range seems slightly about average as well.", "time": "26th October 2016, 12:21 AM", "postID": "post69308644", "replies": []}, {"text": "Any red eye seen on people?", "time": "26th October 2016, 11:10 PM", "postID": "post69324321", "replies": []}, {"text": "I agree. The low light shots leave a lot to be desired. Coming from an S7 Edge, it's definitely a disappointment. Hopefully it's something that can be fixed with a software update.", "time": "27th October 2016, 03:24 AM", "postID": "post69326580", "replies": [{"text": "I wonder if there is a way to give feedbacks to LG and whether they check it or not.", "time": "27th October 2016, 05:04 AM", "postID": "post69327388", "replies": [{"text": "I'm not sure how good LG is at listening to their customers. It would be really nice if they could fix it though.", "time": "27th October 2016, 05:28 AM", "postID": "post69327556", "replies": [{"text": "yeah i have some request myself.", "time": "27th October 2016, 05:30 AM", "postID": "post69327576", "replies": []}]}]}]}, {"text": "I don't have the V20 (yet), but with my V10 in low light I have to use manual mode and increase lower the shutter speed.\n\nThis is inevitable because the V20 use the Exmor IMX298 sensor with a pixel size of 1.12µm, in comparison, the Nexus 6P have 1.55µm and S7 edge have 1.4µm, which let in more lights.\n\nIt's kind of a trade off between low light performance and total megapixels. I really want that wide angle camera though.", "time": "27th October 2016, 03:24 PM", "postID": "post69334090", "replies": []}, {"text": "you can not expect much from imx298\nit's really bad choice for a flagship phone. imx298 is good for midrange phones\nwhen imx378 is available why imx298?\nimagine imx378 f1.8 +ois ...", "time": "27th October 2016, 07:43 PM", "postID": "post69338145", "replies": []}, {"text": "Low light is certainly average. Coming from a note 7... It's not even comparable...", "time": "3rd November 2016, 12:05 PM", "postID": "post69440142", "replies": [{"text": "When I went from the s6 edge+ to the s7 edge (I had to return the note 7 new in box because of what happened) I thought the newer model actually was a bit of a step back from the s6 edge+ in low light. \n\r\nI have confidence that software can absolutely improve the quality of the image.  I donlt have confidence that the update to the camera software will ever happen though \n\r\nMeanwhile, I will shoot in manual if need be since pics come out generally better to much better than auto.", "time": "15th November 2016, 12:23 PM", "postID": "post69630981", "replies": [{"text": "no phone can beat the S6 edge on camera quality, which is a bummer", "time": "19th November 2016, 12:22 AM", "postID": "post69689652", "replies": [{"text": "I too felt the S6 edge/edge+ camera is the best I've ever seen. I think only the Pixel produces better pictures now (with HDR+ mode on)", "time": "20th March 2017, 09:12 AM", "postID": "post71506845", "replies": []}]}]}]}, {"text": "Video in lowlight is not so bad. \n\nhttps://drive.google.com/open?id=0B_...mpXSTdEaDlzZzA\n\nI didnt do it with 4k but with 1080p.", "time": "16th December 2016, 11:36 PM", "postID": "post70125481", "replies": []}, {"text": "You can get some insane shots in low light with manual mode. Long exposure shots come out amazing. These are from the beach at around midnight. No light at all. Did a little light painting.", "time": "12th April 2017, 04:28 AM", "postID": "post71825081", "replies": [{"text": "What's \"light painting\"?", "time": "13th April 2017, 01:54 PM", "postID": "post71843617", "replies": []}]}, {"text": "Does this port http://forum.xda-developers.com/moto...bled-t3543988/ work on your's camera? On mine it only makes blurry shots in HDR+ enabled mode\n\r\nWTF?", "time": "30th April 2017, 03:26 PM", "postID": "post72102883", "replies": []}, {"text": "Not quite low light photo but low light video. \r\nStill testing the camera's limits. This video is shot with Cinema 4K in 2K resolution with 200mbs and then edited in Adobe Premier. Camera gives a green cast in shadows but it might be due to an incorrect white balance i set.\r\nyoutu.be/iQcTSWLWAG0", "time": "30th April 2017, 09:29 PM", "postID": "post72107314", "replies": []}, {"text": "Amazing low light performance. I am really happy with LG V20 camera I never got such quality pictures with HTC 10 ever in my nine month usage. HTC 10 does well in  good lightning condition, so does OnePlus 5. However both these phone struggle in low light condition.  Attach picture taken in complete darkness. I rarely got noisy and blurry images with LG V20. On the contrary I use to get blurry, Noisy, yellowish and pinkish pictures while using HTC 10 camera inside my home..", "time": "26th July 2017, 07:40 PM", "postID": "post73183487", "replies": []}, {"text": "Manual mode all the way", "time": "17th September 2017, 01:19 AM", "postID": "post73820622", "replies": []}, {"text": "does ok with low light.. wouldn't say its the best on the market..  flash is average as well.", "time": "9th November 2017, 04:50 PM", "postID": "post74460396", "replies": []}, {"text": "Just use Google camera mod and you'll get the best lowlight photos", "time": "2nd February 2018, 05:28 PM", "postID": "post75423649", "replies": []}, {"text": "This phone made me love night shots\n\n\nУвеличить\n\nУвеличить\n\nУвеличить\nУвеличить\n\nУвеличить\n\nУвеличить", "time": "11th February 2018, 06:52 PM", "postID": "post75529843", "replies": []}]}, {"title": "Photo quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/v20/review/photo-quality-t3484927", "https://forum.xda-developers.com/v20/review/photo-quality-t3484927/page2", "https://forum.xda-developers.com/v20/review/photo-quality-t3484927/page3", "https://forum.xda-developers.com/v20/review/photo-quality-t3484927/page30"], "threads": [{"text": "With good lighting, the camera takes pictures comparable to the note 7. But the note 7 starts faster and focuses faster.", "time": "3rd November 2016, 12:06 PM", "postID": "post69440154", "replies": [{"text": "yeah I had the note 7 myself and completely agree what you said, except for the pic quality, I still found that the pics were better on the S7 edge/note 7  compared to the V20 I had , I loved my blue coral Note 7, but traded it in and got the V20 and realized I was wanting  the camera opening quickness, better pics, led,AOD, wireless charging, and waterproofing(I kayak a lot), so I just returned my V20 for the sliver S7 Edge, then the next day I got the 100.00 bill credit for going back to Samsung, since I had the Note 7", "time": "3rd November 2016, 04:15 PM", "postID": "post69443523", "replies": []}]}, {"text": "Yeah, I miss the note 7 camera (and stylus). With the note 7, I could actually start the camera and take a very quick shot through heavily tinted windows and it comes focused and great. I can't seem to do that with the v20..\n\nOver all the camera is good.. But it falls behind over the Samsung ones. I'll keep this though and wait for the note 8...", "time": "4th November 2016, 12:16 AM", "postID": "post69449981", "replies": []}, {"text": "Wonder how the Mate 9 camera will compare.", "time": "4th November 2016, 12:46 PM", "postID": "post69456516", "replies": []}, {"text": "My wife's relatives were in town.  For the first time, my wife let me take pics with my device.  She didn't really like the quality on the Note 4, but she did trust the LG V20.  Pics came out great.  YMMV of course... lighting, conditions, settings.  But Auto Mode does a pretty good job.", "time": "4th November 2016, 06:14 PM", "postID": "post69461311", "replies": []}, {"text": "What would everyone recommend for the HDR Settings? Auto, On, or Off?", "time": "9th November 2016, 07:58 PM", "postID": "post69540529", "replies": []}, {"text": "I've tried a bit of testing... The only time manual was better for me was when I lowered the iso and took a longer shutter speed to lessen grain. But auto does a good job.\n\nWhat I don't like is when you zoom in. Then everything seems like a water color painting. Although my wife's iPhone 6 does the same when you zoom in. I'm not sure.. But I don't think the note 7 did that....", "time": "11th November 2016, 04:00 PM", "postID": "post69570427", "replies": []}, {"text": "Can you post sample photos?", "time": "12th November 2016, 06:25 PM", "postID": "post69587797", "replies": []}, {"text": "Took this with the v20 wide angle camera and have to say I am quite impressed. Shot the phone with manual mode and HDR on.", "time": "16th November 2016, 04:23 AM", "postID": "post69643106", "replies": []}, {"text": "Here are a few photos I've taken with the regular lens, HDR, and 4:3 16MP. \n\nBoth photos have a decent amount of light in them, but I thought they turned out pretty well.\n\nP. S. Sorry for them being sideways", "time": "16th November 2016, 01:52 PM", "postID": "post69648931", "replies": []}, {"text": "Thanks", "time": "16th November 2016, 06:54 PM", "postID": "post69653668", "replies": []}, {"text": "Capable of taking some good photos, but this is the most inconsistent phone i've ever owned. Photos are grainy when they have no reason to be (more than sufficient lighting). Shutter speed drops to 1/9 most of the time, causing  huge blurry messes.\n\nThey need to send an update out to fix this, zero reason this sensor/lense should have these issues. My g5 takes much better photos in nearly all situations", "time": "16th November 2016, 11:23 PM", "postID": "post69657065", "replies": []}, {"text": "do all photos look like an oil painting when you even slightly zoom in or is it just me?? would this even be possible to fix with a software update in the future?", "time": "27th November 2016, 06:19 AM", "postID": "post69811511", "replies": [{"text": "Yes, I noticed this too..But then I went to a Samsung store and tested the s7..and it was similar. I don't remember that hastening to my note 7 though...unless I'm mistaken", "time": "28th November 2016, 01:51 PM", "postID": "post69831794", "replies": []}]}, {"text": "I think the camera is terrible on the V20. Its okay in bright light, but even indoor lighting it struggles with. Everytime I try to grab a photo of my son I regret buying this phone.", "time": "1st December 2016, 04:20 AM", "postID": "post69873732", "replies": []}, {"text": "I took advantage of the T-Mobile S6 trade in while I really liked my camera on the S6 I was ready for an improvement and it was a toss up between the s7 or the v20 for a free trade in I couldn't pass it up. Problem is since I gave my S6 away I cant replace my V20 with the S7 or anything else Im stuck with it I can return it within the 15 days but that wouldn't help my situation I believe since I got the free bill credit trade in from the S6.\r\nApparently  I made the wrong decision based upon the camera it's terrible! I've tried every setting manual or auto every lighting condition and I can confirm like the others here grainy or blurry photos. Only great lighting will yield decent photos but not one photo so far is even better than my S6 sadly. Is this maybe cause its the t mobile variant? Other reviews online and photos I've seen I Was impressed. \r\nThis camera went backwards for me. Everything else about the phone I really like however this camera which is my #1 priority is ****. If I zoom in I see the water painting look. If I use the front camera all pics look like a water painting without even zooming in. One thing I did notice is the wide angle lens the color accuracy looks better than the regular lens in auto and it's less grainy WTF! I've tried 4:3 and 16:9 does not make a difference. pissed about this. T-Mobile said there surprised by this but reading here obviously I'm not the only one seeing this.  T mobile said they would look at it and if they see what I'm saying they could replace the phone with another V20 but what will that do? is this maybe a t mobile specific issue? will a software update fix this?", "time": "1st December 2016, 02:23 PM", "postID": "post69880127", "replies": []}, {"text": "Yes low.light pictures suck", "time": "1st December 2016, 04:42 PM", "postID": "post69882117", "replies": []}, {"text": "Has anyone tried turning off HDR? I've been reading the forums on reddit and by turning off HDR, the quality of the photos, according to the users, increased tenfold. So, that's definitely something to try.", "time": "2nd December 2016, 06:33 AM", "postID": "post69890692", "replies": [{"text": "You have a link to that discussion for us? I couldn't find it while skimming over the V20 subreddit.", "time": "2nd December 2016, 06:11 PM", "postID": "post69899186", "replies": []}]}, {"text": "Low light in automatic can be very hit ormiss. I'd definitely recommend another phone like the s7/s7e for users who just want a good P&S. However, in manual mode the V20 can produce absolutely outstanding photos. \n\n(Resized to 1024x768 @ 95% jpg quality)\n\nThe Big Witch Overlook was shot in near pitch black. A tripod + long exposures for some. I massage the images via Adobe Lightroom Mobile often. But you gotta have a good raw image to start out with and the V20 excells at that. \n\nBut, automatic mode in anything but good light can be pretty bad. I bought my girlfriend an S7 specifically because it focuses crazy fast and takes excellent photos in nearly any condition without having its hand held.", "time": "4th December 2016, 10:27 PM", "postID": "post69930768", "replies": []}, {"text": "Exceptional photos!\nI like particularly the second one.", "time": "4th December 2016, 10:57 PM", "postID": "post69931050", "replies": [{"text": "Thanks \n\nI've talked with one other person who's had weak results on tmobile v20s and one guy who's sprint one had photo issues. The sprint one got replaced and it was doing better. The tmobile one I'm not sure on yet.\n\nIt does seem like LG needs to work on the camera drivers/app badly. Even on mine I'll sometimes get the occasional bad one even when the light/conditions don't seem to be a reason. But at the same time, I can capture exceptionally crisp photos with very little to no apparent noise or noise reduction. Like these (and both are cropped center from  4:3 16mp ones)", "time": "4th December 2016, 11:40 PM", "postID": "post69931354", "replies": []}]}, {"text": "the pics from the front camera always looks if the beauty modus is on but its not. \ni have a screen protector but it does not cover the lens. anyone else with this problem?", "time": "7th December 2016, 12:19 PM", "postID": "post69971601", "replies": [{"text": "A) Front camera is only 5mp (actually 4.9) when using full resolution.\r\nB) Just like the main cameras, the FFC defaults to a smaller resolution setting from the factory.\r\nC) The sensor size is pretty small. Packing a lot of pixels into a small space requires sacrifices in image quality. That's just physics.\r\nD) Which means cropping and zooming on this sensor is not advised.\r\nE) Most likely there is noise reduction being applied to cope for C. Again, physics.\n\r\nPersonally, I would just use the main camera and voice shutter.", "time": "7th December 2016, 02:40 PM", "postID": "post69973608", "replies": []}]}, {"text": "The front camera is really  bad.. I miss my HTC one A9 front camera...", "time": "7th December 2016, 02:09 PM", "postID": "post69973122", "replies": []}, {"text": "Just bought t mobile v20 \nAnd camera is really bad\nToo slow\nImages processing is very bad\nZoom is bery bad\nMy old v10 cam was way better\nI feel im using sheap mobile", "time": "7th January 2017, 10:29 AM", "postID": "post70435465", "replies": [{"text": "Examples with settings and exif data in one of the camera threads would be useful. (And I'll forgo jokes about berries and sheep.) I can address your other issues there too.", "time": "7th January 2017, 11:45 PM", "postID": "post70446175", "replies": []}]}, {"text": "https://www.flickr.com/photos/137689.../shares/7jz8A5", "time": "7th January 2017, 02:29 PM", "postID": "post70438592", "replies": []}, {"text": "Happy New year guys!\nThese are from the beautiful Dana Point, CA!", "time": "7th January 2018, 07:51 PM", "postID": "post75115916", "replies": []}, {"text": "Some of my recent stuff. Shot in DNG, edited in Lightroom Mobile.", "time": "8th January 2018, 03:52 AM", "postID": "post75119261", "replies": []}, {"text": "Some of my shoots.\nhttps://photos.app.goo.gl/NqnA9Z1h0qZKA33A3\nEdited with Snapseed or just google Photo.", "time": "9th January 2018, 03:52 PM", "postID": "post75137634", "replies": []}, {"text": "Arrival", "time": "10th January 2018, 11:00 PM", "postID": "post75154009", "replies": []}, {"text": "Some of my latest", "time": "17th January 2018, 04:01 AM", "postID": "post75227371", "replies": []}, {"text": "Some more new ones.", "time": "20th February 2018, 02:28 PM", "postID": "post75635265", "replies": []}, {"text": "Two pictures from Lg V20, from the same flower.\n\r\nThe left picture is only for see how flower is so small, e how Lg V20 can do a fantastic photo of this on the right side.", "time": "7th March 2018, 07:04 PM", "postID": "post75807762", "replies": []}]}, {"title": "Video quality", "rating": 5.0, "links": ["https://forum.xda-developers.com/v20/review/video-quality-t3484928", "https://forum.xda-developers.com/v20/review/video-quality-t3484928/page2"], "threads": [{"text": "Still waiting to purchase this phone but found an \"AMAZING\" video shot with a V20 strapped on top of his head! \n\n          Enjoy  https://www.youtube.com/watch?v=QzX1VJ33daE", "time": "21st October 2016, 10:16 PM", "postID": "post69243709", "replies": [{"text": "Wow, talk about impressive.", "time": "21st October 2016, 10:57 PM", "postID": "post69244147", "replies": []}]}, {"text": "Well, the shadow definitely confirms there's a phone on his head. That's seriously amazing to even consider doing that and it does look really good.", "time": "22nd October 2016, 04:34 PM", "postID": "post69254273", "replies": []}, {"text": "I see the wide lens and what he's doing (aside from the views) being amazing, but that quality is horrible. 🙄\n\nSent Via My LG V20", "time": "22nd October 2016, 08:53 PM", "postID": "post69257924", "replies": []}, {"text": "has anyone tried the slow-mo function on recording? when i activate that function the camera becomes way darker", "time": "22nd October 2016, 09:02 PM", "postID": "post69258041", "replies": [{"text": "It's shooting at 120 fps! So the shutter speed is incredibly fast and you will need A LOT of light. This is standard with any slow-mo recording. You can try bumping up the ISO but the reality is, you will most likely be doing slow-mo only when you have sufficient light with a sensor this small.", "time": "22nd October 2016, 11:33 PM", "postID": "post69259532", "replies": [{"text": "Now that you are saying that. i remember that with my S5, it was happening the same, so you are 100% right!", "time": "22nd October 2016, 11:49 PM", "postID": "post69259651", "replies": []}]}]}, {"text": "Ladies and Gents, please look into youtube for V20 videos. SOME SCENES clearly show a fine line in the middle of the video in most of what I saw. \n\r\nThis is NOT the only example out there, you gotta youtube for more.\n\nhttps://www.youtube.com/watch?v=oxe7nyvwXT0\n\r\nTrust me, I tried not to see it, but it is there.", "time": "24th October 2016, 09:17 AM", "postID": "post69279981", "replies": [{"text": "None on my phone. Can you provide a time stamp which u see the artifact?", "time": "24th October 2016, 03:35 PM", "postID": "post69284776", "replies": []}]}, {"text": "I took the V20 out to my son's baseball game today.  Wasn't all that impressed.  Maybe because I'm a noob, and have to learn about using the camera and video functions and capabilities of the device.  My V20 was set at FHD 60, or aka, 1080/60fps.  I was posted near 1st base.  When you launch the camera, it goes to auto mode.  When action would occur, I would hit the video button, and it would start recording.    The footage came out very bright.  It was a sunny day today with occasional cloud cover.\n\nI won't compare this too my Note 4, or my Hero4 Black that I have been always using at the baseball games.  I may have left the \"AE-L\" feature enabled, or I should have just been in manual video mode to begin with.  I will pay attention to the settings next outing, and hopefully it's just user error the first time around!", "time": "30th October 2016, 12:43 AM", "postID": "post69369446", "replies": []}, {"text": "Will post here too.\r\nLow light footage sbot with Cinema 4K, 2K/200Mbs, edited in Adobe Premier. \r\nyoutu.be/iQcTSWLWAG0", "time": "30th April 2017, 09:37 PM", "postID": "post72107408", "replies": []}, {"text": "Unique sound quality and great picture in manual mode!\nhttps://youtu.be/1z3SJuy5spk\n\nhttps://youtu.be/EKoEaLrkuwc\nhttps://youtu.be/ynLz4a0OMiw\nhttps://youtu.be/yHnH-Wgvs5c", "time": "20th February 2018, 12:27 PM", "postID": "post75634093", "replies": []}, {"text": "All shot on our beloved V20;\nPart 1: https://youtu.be/mg4-K_MiHKI\nPart 2: https://youtu.be/dJ5VjPwAs_Q", "time": "23rd February 2018, 02:59 AM", "postID": "post75663102", "replies": []}, {"text": "I have shot my short film on my LG V20. Please check it out:\nhttps://www.youtube.com/watch?v=-e-coqRsgRQ&t=3s\nThank you!", "time": "24th February 2018, 10:32 AM", "postID": "post75676853", "replies": [{"text": "Great work and great short story friend! Thumbs up", "time": "26th February 2018, 03:51 AM", "postID": "post75696593", "replies": [{"text": "Thank you very much! Stay tuned for more films!", "time": "26th February 2018, 07:16 AM", "postID": "post75697822", "replies": []}]}]}, {"text": "Question - in auto mode it has the possibility of doing 60 frames per second on video. If I go to manual video mode and make it do it's auto thing it dumps down the frames mostly to 50 fps and to make it go up you need more light and then it goes up, first it begins to push down iso until 50 then it will start effecting the FPS number. Why is that - why would it go down to 50 fps and not just down to 60 fps?", "time": "4th March 2018, 06:26 PM", "postID": "post75771992", "replies": []}]}, {"title": "Selfie quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/v20/review/selfie-quality-t3484929"], "threads": []}, {"title": "Time to take picture (camera launch speed)", "rating": 4.5, "links": ["https://forum.xda-developers.com/v20/review/time-to-picture-camera-launch-speed-t3484930"], "threads": [{"text": "The camera starts fast. It's the focusing that may fail you. In good lighting is fast enough, but you may still end up with blurry pictures if you try to take the shot the moment the camera comes up. But in good lighting, it's usually in focus. Don't try it with lesser light.. It will need up to a second to focus", "time": "3rd November 2016, 12:10 PM", "postID": "post69440193", "replies": []}, {"text": "well let me put it this way... for me I returned my V20 and went back to the the S7 edge,  found the 7 edge opens quicker and take`s  quicker pics for me, double hit the big home button and boom there you go, and the small little voulme buttons on the V20 are a pain,  I found myself hitting the volume up instead the volume down to open the camera quickly, and in general I still find the pics from the S7 edge better than the V20. but that`s my opinion, and you know what they about opinions. lol", "time": "3rd November 2016, 04:02 PM", "postID": "post69443363", "replies": []}, {"text": "Camera on the lg v 20 needs work. I really feel it's a software issue, hardware is very good. \n\nI miss the Samsung camera. I don't think I can return my v20 so I'll have to deal with it. Hopefully lg release an update.", "time": "17th December 2016, 02:18 AM", "postID": "post70126689", "replies": []}]}, {"title": "Software (ease of use, features, etc)", "rating": 5.0, "links": ["https://forum.xda-developers.com/v20/review/software-ease-features-t3484931"], "threads": [{"text": "I wish the Clear All button in the recent apps menu was placed down below instead of top right. Lg should bring it down considering that it is a 5.7 inch phablet.", "time": "17th March 2017, 07:26 AM", "postID": "post71464378", "replies": [{"text": "I am going to losing my mind , because the deleted data can be back again ,", "time": "19th March 2017, 09:44 AM", "postID": "post71492637", "replies": [{"text": "Didn't really get you. Please elaborate.", "time": "7th April 2017, 04:40 PM", "postID": "post71766260", "replies": []}]}]}, {"text": "The smart setting is limited, i. E. Actions why can't I edit more actions? \n\nI need to get apps for this. But smart setting was a brilliant idea but limited.", "time": "13th April 2017, 01:59 PM", "postID": "post71843675", "replies": []}, {"text": "Factory reset\nI had to do that today.\nIt's over all nice. I'm sticking to oem experience this time around.\n\nI think what I end up doing is installing all third party apps and disabling the oem apps, some how I feel that ruins the over all experience of using the phone and functioning of the phone gets alerted.\n\nDon't know if this is my feeling or a true experience.\n\nI'll follow-up.\n\nV20 right now is by far the smoothest experience for me. I think nougat now is the most stable os for android.", "time": "21st April 2017, 05:31 AM", "postID": "post71957024", "replies": []}, {"text": "I'm pretty sure you're able to do that on the G6.", "time": "26th April 2017, 12:43 AM", "postID": "post72032446", "replies": [{"text": "I am planning to sell my v20 to buy G6 now.. 😂", "time": "26th April 2017, 04:03 AM", "postID": "post72033870", "replies": []}]}, {"text": "Wouldn't do that, I tried the G6 in store, and in terms of the speed, they're about the same. The displays are pretty much the same, and I'd personally prefer 16:9. The G6 is beautiful, but it's made of glass, so the V20 is much more durable. The G6 does have wireless charging if you live in the U.S,  and a slightly better second camera, but it's not worth selling the V20 for it.", "time": "26th April 2017, 04:08 AM", "postID": "post72033903", "replies": []}]}, {"title": "Charging speed", "rating": 4.0, "links": ["https://forum.xda-developers.com/v20/review/charging-speed-t3484932", "https://forum.xda-developers.com/v20/review/charging-speed-t3484932/page2"], "threads": [{"text": "I use Ampere to see the rate I am getting. First plug in might only be 90 mah. I unplug, replug, it jumps up to 350. A couple more times and I end up at 900-1200. Screen off and let it fast charge.", "time": "3rd January 2017, 12:53 AM", "postID": "post70367267", "replies": []}, {"text": "I recently tried out the HTC Bolt for a couple weeks and it seemed to charge much faster than my V20. Shouldn't it be the other way around since the Bolt uses quick charging 2.0 while the V20 uses Quick charging 3.0?", "time": "5th January 2017, 03:20 AM", "postID": "post70399279", "replies": []}, {"text": "Slowest charging phone i ever owned but i still love it lol", "time": "6th January 2017, 08:30 PM", "postID": "post70427818", "replies": [{"text": "agree, LOL\n\r\neven my old G2 get 50% battery in half an hour.\n\r\nwhat's with V20?\r\nit uses QC 3.0, but charge slower.\r\nI use original V20 charger, and when charging the status is \"quick charging..\"\r\nit takes 2 hours from 27% to 100%\r\n:sad", "time": "12th January 2017, 07:45 AM", "postID": "post70514686", "replies": [{"text": "looks like something really wrong with your phone. My phone usually takes about 75 mins to charge from 0% to 100%", "time": "12th January 2017, 08:34 AM", "postID": "post70515178", "replies": [{"text": "maybe, but it looks like not just me though.\n\r\nand btw, my LG G2 can do full charge in 1 hour and 20 mins (80 minutes), and it's not even QC 3.0\n\r\nI read somewhere in gsmarena, QC 3.0 should charge to 80% in 30 mins", "time": "12th January 2017, 08:51 AM", "postID": "post70515370", "replies": [{"text": "not sure about G2. I've never had one. \n\r\nQC 3.0 might be able to do it technically, but I've never seen a phone that fast in charging yet. Not even the OP3T which every body is saying quickest in charging.", "time": "12th January 2017, 09:03 AM", "postID": "post70515486", "replies": [{"text": "Hmm.. okay.\r\nHow about your G Flex2? how long it would take to charge to 100%?\r\nG Flex2's battery 3000mAh, right? Same as G2", "time": "12th January 2017, 09:21 AM", "postID": "post70515665", "replies": []}]}]}]}]}]}, {"text": "My H910 charges relatively quickly. Just plugged it into a quickcharge 2.0, not 3.0 car charger and it went from 16% to 50% in ~25 minutes.", "time": "9th January 2017, 02:31 AM", "postID": "post70463849", "replies": []}, {"text": "I regularly get rates of 1.8A or greater using a CHOETECH or Anker charger.  One its above 80%, it drops down, but this is normal.\n\nThe Anker is QC3.0 and the CHOETECH are QC2.0", "time": "9th January 2017, 06:08 PM", "postID": "post70474408", "replies": []}, {"text": "Great \r\nVery fast charge", "time": "13th January 2017, 01:21 AM", "postID": "post70527477", "replies": []}, {"text": "Delete please.", "time": "15th January 2017, 01:49 AM", "postID": "post70557209", "replies": []}, {"text": "I have absolutely no complaints with the charging speed.  Also, I rarely drop below 40%.", "time": "3rd February 2017, 12:58 AM", "postID": "post70854234", "replies": []}, {"text": "I just bought a VS995 Verizon Unlocked off the net. Was classified as \"almost new - open box\", hope I did NOT get a unit with problems. Re-charged it now a total of 5 times and on average  (plus or minus 3-5 minutes) it takes approx. 3 hours and 18 minutes. for a full charge 0% to 100% .  A few thoughts and questions came to mind while reading all your excellent posts:\n\n1.) I believe he must of lost his quick charger because the one he gave me seems like he bought it off the net. Standard USB charger. So probably not using the quick charge function feature of this phone correct?\n2.) Can I goto an electronics store and just copy whatever voltage and amps I need to perform a quick charge? Can someone please POST what the voltages and amps needed for a quick charge 3.0 please.\n3.) Anyone have a bad battery or have one go bad after using the wrong charging devices? I was thinking of ordering a new battery BUT they are a little pricey. Anyone know some good outlets to buy them at a fair price?\n4.) Does rooting the device and putting one of the ROM's on their cell solve anyone's battery problem? If so which ROM do you recommend? \n\nOverall that is my only gripe about the phone.  I love the DAC and for all you music lovers out there try Sirius XM on the LG-V20 and make sure to use Hi-Fi made headphones. I bought myself Bowers and Wilkens P7's, sort of pricey but worth it to me. The other thing is Napster as well the songs you download sound awesome with this DAC. For both of these APPS make sure you go into settings and adjust the quality of the downloads and streaming. Otherwise you could be listening to it with poor quality settings from the get go.\n\nOk well I appreciate any help or advice on my battery situation! \nThanks in advance to anyone helping me out.\n--- Gary", "time": "10th February 2017, 12:22 AM", "postID": "post70960243", "replies": [{"text": "Any charger that says Quick Charge 3.0 would work.  I think even QC 2.0 would charge at the same speed, but just less energy efficient.", "time": "10th February 2017, 04:38 AM", "postID": "post70962080", "replies": []}]}, {"text": "The difference between qc 2 and 3 is 3 has a variable voltage allowing it to use energy more efficiently.\n\nExcess energy is lost as heat on qc2, the power is reduced in qc3 when the battery starts to get full.\n\nThe charge time is the same.\n\nSpecs for QC 2 is 5V / 9V/ 12V, specs for QC 3 is \n3.2v - 20v dynamic", "time": "12th February 2017, 03:07 PM", "postID": "post70998006", "replies": []}]}, {"title": "Screen on time", "rating": 3.5, "links": ["https://forum.xda-developers.com/v20/review/screen-time-t3484933", "https://forum.xda-developers.com/v20/review/screen-time-t3484933/page2", "https://forum.xda-developers.com/v20/review/screen-time-t3484933/page3", "https://forum.xda-developers.com/v20/review/screen-time-t3484933/page11"], "threads": [{"text": "I am getting about 6hrs of sot will post pic later", "time": "21st October 2016, 07:33 PM", "postID": "post69241559", "replies": []}, {"text": "Sot im getting right now", "time": "22nd October 2016, 02:07 PM", "postID": "post69252152", "replies": []}, {"text": "I dont know about you guys but im getting outstanding battery life. I'm going to do a test later today. Im going to charge my phone upto 100 (after it reaches 0 today) and then when 5 minutes after it says is 100, i will unplug it and i will put a 1440p video that last more than 8 hours and see how long it last with full brightness and wifi on. Then im going to post Very specific details about how everything went. Oh , aslo it will have speaker at its maximum\n\noh and just have in mind, i have 35 user apps installed, and some of them constantly sync (so it means more battery consumption)", "time": "22nd October 2016, 05:09 PM", "postID": "post69254812", "replies": []}, {"text": "Just over 3hrs. I dont think my phone has started optimizing apps or putting them in Doze.", "time": "22nd October 2016, 06:35 PM", "postID": "post69256080", "replies": [{"text": "Same as I got yesterday... I don't do anything to try and extend battery life though (brightness always on auto, and I usually turn it up a little bit).  Today will be my 2nd full day with the phone, and after 2 hours off the charger I had 99% left (only 5 minutes screen on time), but then I used the phone for about 15 minutes and it dropped quick to 94%)...  Time shall tell, hopefully it is till just optimizing like you said...", "time": "27th October 2016, 06:35 PM", "postID": "post69337086", "replies": []}]}, {"text": "My sot had been nothing short of spectacular.. I'm getting 5hr average... nexus 6 would barely reach 3... my g4 not even 3 also..I always wondered how people were getting above 4hrs.. Ive gotten 6+.....I jus miss stock Android", "time": "27th October 2016, 01:00 AM", "postID": "post69325387", "replies": []}, {"text": "I get 4 hours with medium usage and leave everything on. Wifi, BT etc. Brightness is on Auto but it shows at 50% to 70% most of the time at work. It's my bright office...LOL", "time": "27th October 2016, 06:19 PM", "postID": "post69336825", "replies": []}, {"text": "I'm on my 2nd charge and like you guys above, I'm getting abysmal battery life.\n\nI'll give the phone another week or so to optimise, and if it doesn't - it'll be sent back to T-Mobile with a piss poor rating in terms of battery life. What a shame if that's the case..", "time": "29th October 2016, 07:51 AM", "postID": "post69358263", "replies": []}, {"text": "2 hr 17 minutes screen on time. 68% left, second screen turned on while sleep. Loving it! Restored all my app backup from Google, so its not a plain phone. \nThis is after my first full charge it's only gonna get better as I rarely install new apps. \nAuto brightness at times, manual on others, as the brightness of this phone doesnt compare at all to my note 4.", "time": "30th October 2016, 08:28 AM", "postID": "post69372983", "replies": []}, {"text": "First full day at work with the phone, and actually pretty light usage day and gotta say the battery is a bit of a let down so far.  My shorter days at work over the weekend gave me some concerns, but today I'm at 2% left with 13h 28m standby and 2h 17m screen time.  No calls, no videos.  Maybe a dozen messages, web browsing, 20mins of spotify for commute.   Frankly it \"feels\" like it lasts the same as my 2 year old m8.", "time": "1st November 2016, 02:21 AM", "postID": "post69401674", "replies": []}, {"text": "I don't have a sim in mine so all my use is just on Wi-Fi.  Indoor use with 30-40% brightness, 49 apps and services disabled. The day after this I did 1080p 60fps video streaming while plugged into my Bose speakers using the Hi-Fi DAC for a little over 5Hours and got about 6.5Hours total SOT.  But so far 10hours 45 minutes is my record.  Another time I did get right at 10 hours so it wasn't a fluke.", "time": "1st November 2016, 01:52 PM", "postID": "post69408295", "replies": []}, {"text": "I'm not activating mine either so that's pretty sweet.", "time": "1st November 2016, 07:23 PM", "postID": "post69413721", "replies": []}, {"text": "Yeah the battery life sucks, and I like everything else about the phone except ****ty LED screen (I know why they didn't use AMOLED, not cost, but because with no physical home button, the buttons would burn images in AMOLED, LED won't). In any case the true test of a battery is Pokemongo at 100% brightness (which you need with this screen at all times to look half way decent). Note 7 5 hrs, Note 4 4 hours, V20 3 hours, all at 100% and same resolution/settings. So yeah, the battery life sucks, end of discussion. And my phone is a week old, no bloat and settled.  Another quirk is sometimes Antutu gets 147k excellent score and sometimes it gets half that, for no reason at all, as well as 3dMark being horrible as well for some reason, half of what it should be.", "time": "2nd November 2016, 10:26 PM", "postID": "post69432821", "replies": []}, {"text": "This is my third LG phone (Had the V10 and G5 before), and the battery performance appears very strong on this.  On my first full,  non-setup charge, and using my normal work activities (lots of emails, texts, calls, and periodic social media), here's what I got\nTotal time on battery: 54 hrs 52 min\nTotal call time: 3hrs 2 min\nTotal SOT 2hrs 44min\n\nThat's great life a regular business user.  Also, the screen is way brighter than the V10 and G5.", "time": "3rd November 2016, 12:27 AM", "postID": "post69434092", "replies": []}, {"text": "I've been getting phenomenal standby time on this phone, thanks to the new and improved Doze, better than any other phone I've ever had actually. I'm just not getting great SOT, like many others out there and I can't figure out why. I've had the phone for about a week now and all of the apps should've been optimized by now, I think. Anyone else having similar issues?", "time": "4th November 2016, 05:36 PM", "postID": "post69460792", "replies": []}, {"text": "Dmarco, a factory reset could be the solution", "time": "4th November 2016, 05:54 PM", "postID": "post69461019", "replies": []}, {"text": "Guys it is simple. It is the same Snapdragon 820 in about 10 other devices with similiar battery sizes. But the V20 will get A LOT less screen on time, my estimation is 25-50% less depending on how bright the screen is. I need the screen at 100% and low comfort blue filter to make the screen even kinda decent, like a Samsung at 70% brightness. Anyways the LCD screen on the V20 eats A LOT of battery power, it can't compete with an AMOLED. That said, the only benefit is that in 2 years your screen won't have any burn in and be worthless.", "time": "5th November 2016, 05:33 AM", "postID": "post69467603", "replies": []}, {"text": "Im getting great battery life on the v20\nAlso sleep time is also great", "time": "5th November 2016, 11:25 AM", "postID": "post69470462", "replies": []}, {"text": "I did alright mostly YouTube and browsing", "time": "5th November 2016, 11:26 AM", "postID": "post69470487", "replies": []}, {"text": "i think my SOT is good. if i use the phone for 14 hrs continuously it will give a good 5hrs.\nif i keep it in my pocket, it still doesnt doze well i keep losing 2% every hour.", "time": "6th November 2016, 12:12 PM", "postID": "post69486726", "replies": [{"text": "Doze will not work if the phone has any movement.  It is designed to be at rest for it to operate.", "time": "9th November 2016, 01:25 AM", "postID": "post69527967", "replies": [{"text": "Not true, the Doze feature in Android Marshmallow was set up to function when the phone was still without any movement. The new and improved Doze feature in Android Nougat is designed to function as soon as the screen is off. That's why we all love the new Doze feature. Google really knocked it out of the park this time👍", "time": "15th November 2016, 03:26 PM", "postID": "post69633693", "replies": []}]}]}, {"text": "I used to be 100% AMOLED all the way.  Comparing my iPad Air to my Samsung Galaxy Tab S was no contest...Samsung by a mile. Then I used the V10 QHD for a year. I now realize how frankly distorted from reality the colors are with AMOLED. Not a big deal because its still nice to look at. But if you asked me if the next V20 should be OLED since its LG After all and OLED is their specialty, I'm not so sure now. Sure the Samsung gets better battery life but that benefit is compromised by not being removable, leaving you with one battery that diminishes each time you run a full discharge quickly if you're a power user. \n\nP.s.\nNobody is playing Pokemon Go anymore.", "time": "7th November 2016, 01:56 AM", "postID": "post69496358", "replies": []}, {"text": "Have had the phone a full week now and I have to say I am pretty impressed with battery life so far. Each day I've gotten AT LEAST 5 hours of SoT, if not close to 6+.", "time": "11th November 2016, 05:58 PM", "postID": "post69572187", "replies": []}, {"text": "For whatever reason my LG V20 will not last no more than 19 hours with only 2 hours of screen on time.\n\nPart of me wants to wait for 3rd Party battery companies to start making better batteries for this phone but at the same time this is a $800 phone...I should not have the need to replace the battery already....My 2 year old Moto Nexus 6 lasts way longer than this phone and I can game on it for a lot longer with out the battery having a huge impact. The LG just drains as I watch it.\n\nI may not be giving this phone enough times to drain down to 0 but after having it since the 4th of November the battery life has been getting worse after every charge. I do make sure that the phone is using the \"Fast Charging\" by looking for the notification in the notification panel so I know its getting the full blast from the charges.\n\nI am a heavy user but I've yet to push this phone to the \"heavy usage\" department reason being I still have my Nexus 6 with all the games and etc that I still want to play and use. So with that being said this LG V20 has been nothing but a form of communication for me for the past 2 weeks. Just using it for light texting, emailing and net browsing.\n\nNot happy at all. More than likely I will be returning this phone today or tomorrow right before the 2 week mark to return for a full refund. Really is a shame. No more awesome phablets on the market...well at least within T-Mobile....and I was really hoping this phone would be replacing my aging Nexus 6.\n\nI do have the Second Screen on all the time but I do use a belt holster to hold my phone. So the second screen does power off once the sensor is blocked. So it can't be the second screen. If I am not using my holster I lay the phone down on its face....which to me kind of defeats the purpose of having the second screen....\n\nAm I wrong? Or does anyone else feel this way? I dunno maybe I am just still such a fan of my dual front facing speaker 6\" monster Nexus 6. What to do what to do....", "time": "16th November 2016, 05:39 PM", "postID": "post69652562", "replies": []}, {"text": "Okay so I'll say my impressions as shortly as possible.\n\nI'm a Computer Technician, so I'm a very analytical person. And I'm from NYC so I'm into name brands & the best quality a bit more.\n\nI must say, I NEVER owned a LG product before. I always saw them as a cheap brand with cheap parts IMO. And I was HIGHLY upset when I was forced to give up my Note 7 for it(just finally gave in a week ago because of that annoying update lol)\n\nNow when my V20 first arrived, I was mad...for the lack of a better term lol. I hated the color and the build, I got used to the shiny Samsung phones especially that blue coral so beautiful geez.\n\nI've had every Galaxy Note since the Note 2, no other phone. I'm a man of habit, and I don't like change much. Just always thought the Note series was the best phone every year\n\nNow back to the V20, the same day I received it...I almost took it back lol. I literally walked into the T-Mobile store a hour after I got it, looking to get an iPhone. I figured I'll just switch it up & suffer until the New Note comes out\n\nLong story short I couldn't do it, and decided to give the V20 at least 2 days...it's only fair right? Now I must say, it's been a week and I'm very impressed with this phone.\n\nThe secondary screen is so awesome, it reminds me of the first Galaxy Note Edge...with the REAL EDGE. Makes the screen look even bigger as a whole, looks like it's 7 inches\n\nAlso when I received a phone call randomly & saw it didn't take over my main screen and was in the secondary screen it felt heaven sent lol...I was sold after that.\n\nIMO, coming from the AMOLED screens on the Notes...for some reason I like the V20's cooler flat screen better. Side to side with my Note 7, the Note looks so yellowish & warm.\n\nIt's funny how you can just be stuck on something by habit, and then you can just see an entire different world when you try change 🤔.\n\nOverall this is an awesome phone, LG's UI is better IMO...and stuff like screenshots are so much better. I just wish the build was better, if LG can make this phone shiny & pretty next year...I would consider buying it over The New Note.\n\nWith that being said idk, I see people are getting horrible on screen time...my on screen time is pretty amazing\n\n\n\n\n\n\n\n\n\n\n---------- Post added at 06:29 PM ---------- Previous post was at 06:20 PM ----------\n\nEasily one of the best batteries I've ever had, if not the best. Also I haven't received any lag whatsoever, something I was getting with my Note 7...which I just dealt with in frustration.\n\nSamsung really dropped the ball a bit here, I've seen the light lol...\n\nI'm keeping an eye out for LG in the future...\n\nHere's a screenshot of my current battery as I'm posting this, haven't charged it since last night...been testing it. I always get around 6+ hours on screen time", "time": "18th November 2016, 05:29 PM", "postID": "post69684883", "replies": [{"text": "How on earth are you getting such phenomenal battery and SOT???\nI'm going to have to do a factory reset and start over; installing my apps one by one. Thanks for your honest review. I love this phone👍", "time": "19th November 2016, 07:57 PM", "postID": "post69701390", "replies": []}]}, {"text": "Junk", "time": "7th November 2017, 12:14 AM", "postID": "post74430521", "replies": []}, {"text": "I wish it had a little bit of a larger battery and would do better at lasting all day.. I typically have to plug it up before the end of the day..", "time": "9th November 2017, 04:52 PM", "postID": "post74460419", "replies": []}, {"text": "Really ****. Are there any good batteries that fit into this same chassis?", "time": "21st December 2017, 08:22 AM", "postID": "post74915913", "replies": []}, {"text": "Bought my V20 used more than a month ago, it had 8 months of use.  I bought a brand new battery (LG brand, with the charger)and since this time, I average around 5 hours of screen-on time.  Very pleased with the phone so far.\n\nI'm stock, wifi and bluetooth always on.  Doing lots of Facebook, YouTube, Twitter, Instagram, emails... Using Greenify though.", "time": "2nd January 2018, 07:21 PM", "postID": "post75051943", "replies": []}, {"text": "I posted info about my SOT in the neocore kernel thread, but I noticed this thread when looking for something else so I figured I'd add my stats as per my latest run down test in here as well. \n\nTest date: 13 March 2018\nModel: H990DS\nPhone/battery age: 6 months (original battery)\nFirmware: stock 10g (Australia)\nKernel: neocore-paradox-rev4\nApps/mods: Magisk, Xposed, Greenify\nSOT: 9 hours 17 minutes\nAwake time: 10 hours\nOn battery: 1d6h (30 hours)\nWiFi on: 1d5h (29 hours)\n% battery left at end of test: 19%\n\nThis test was with mostly internet browsing with Chrome and reading reddit with Boost, but also a small amount of Google maps use. I could have gotten over 10 hours SOT easily on this run but I needed to go out, so put my phone on charge again because I didn't have a spare battery (I'm ordering some spares in a few minutes).\n\nEven with heavy use (navigating with maps, playing mid to high-end games etc) I don't think I get anything less than 6 hours these days. Usually I get over 8, if i find myself at 50% battery with less than 4h SOT and light use, it's almost always some rogue app I forgot to shut down. \n\nI think the key to my ultra light battery is the neocore  kernel combined with the magisk+xposed version of greenify. Hope this helps others break the 8-9 hour SOT barrier.", "time": "22nd March 2018, 09:22 AM", "postID": "post75975623", "replies": [{"text": "I can back this . I have also gotten upto 10hours sot with weta rom and mk2000 kernel v. 1.5 on a new battery with h910 .", "time": "24th March 2018, 08:52 PM", "postID": "post76004549", "replies": []}]}, {"text": "Wtf guys. I can barely reach 5 hours SoT and a day usage. But I don't care as long im not running out of battery till the evening. Using an unlocked h910 in Germany :P.", "time": "28th March 2018, 08:31 PM", "postID": "post76049539", "replies": []}]}, {"title": "Standby drain", "rating": 4.0, "links": ["https://forum.xda-developers.com/v20/review/standby-drain-t3484934", "https://forum.xda-developers.com/v20/review/standby-drain-t3484934/page2", "https://forum.xda-developers.com/v20/review/standby-drain-t3484934/page3", "https://forum.xda-developers.com/v20/review/standby-drain-t3484934/page6"], "threads": [{"text": "Compared to the Note 7 there is next to zero residual battery drain. I forgot to plug it in one night and saw a 2% drop.", "time": "23rd October 2016, 02:38 AM", "postID": "post69261028", "replies": []}, {"text": "Doesnt really drain on sleep mode. Not bad.", "time": "24th October 2016, 06:32 AM", "postID": "post69278472", "replies": []}, {"text": "This is great to hear. My V10 can drop 30% overnight. I can't wait to upgrade.", "time": "24th October 2016, 04:43 PM", "postID": "post69285833", "replies": []}, {"text": "I'm losing upwards of 15% at night.  Not good.", "time": "24th October 2016, 11:35 PM", "postID": "post69291695", "replies": []}, {"text": "This has been one of my BEST PERFORMED sleep time phone so far! Must be something w NOUGAT also? Love it!", "time": "25th October 2016, 12:16 AM", "postID": "post69292071", "replies": []}, {"text": "I noticed sometime when we insert a new sd card the phone needs to create an internal list and this process can suck alot of battery. It might or might not be this issue thats causing some users to experience overnight battery loss.", "time": "25th October 2016, 08:16 AM", "postID": "post69296179", "replies": []}, {"text": "I got my V20 yesterday and had it sit overnight, and the drain was practically zero. Very impressed so far.", "time": "25th October 2016, 08:50 PM", "postID": "post69306353", "replies": []}, {"text": "Standby drain is beyond great. If the phone is off, then 0 to 1% is lost, depending on the stand by time.", "time": "28th October 2016, 03:10 AM", "postID": "post69342938", "replies": []}, {"text": "The standby drain is unbelievable. I've noticed between 1-2% drain per hour. That's with bluetooth, wifi, and location on, as well as android wear and google fit constantly running in the background. \n\nIt's WAY better than my GS7 Edge.", "time": "28th October 2016, 04:33 AM", "postID": "post69343517", "replies": [{"text": "So over an 8hr night you would lose 16%? That's not gifs at all.", "time": "28th October 2016, 12:39 PM", "postID": "post69347219", "replies": []}]}, {"text": "I just got the phone last night.  First of all... damn this is a sexy beautiful phone. Sleek slim as hell and the best phone I've owned thus far.\nWhat is not okay is the battery drain in standby.  I put it on the nightstand at 100% at 11:30pm, woke up at 6:30pm (7hours total) and it was down to 40%!!!!\nNot okay LG.  I moved over from the LG G5 and the standby on that was excellent, would still be in the 90%s , I hope an update is issued to fix this problem", "time": "28th October 2016, 01:53 PM", "postID": "post69348023", "replies": []}, {"text": "Over 6 hours of stand by time with 0% lost. I have 4 email accounts running, a few game notifications, etc... No facebook. \n\nThis was taken after I cleared most of my notifications.", "time": "28th October 2016, 03:53 PM", "postID": "post69348701", "replies": []}, {"text": "So what do you think I'm doing wrong here?", "time": "28th October 2016, 03:54 PM", "postID": "post69348722", "replies": [{"text": "Give it a day or two, the battery will and should improve.", "time": "28th October 2016, 03:58 PM", "postID": "post69348767", "replies": []}]}, {"text": "I too have noticed that this phone has significantly less standby drain than the S7 i was using between the Note7 return and the V20.  All in all just better with the battery in my opinion.  I usually listen to Pandora all day long at work (wired) and then use my BT headphones at the gym for a couple hours each night too.  With the S7 I had to recharge the phone near the end of the work day or i would be cutting it close by the end of my workout.  Not the case at all with the V20, after my workout im around 45% still.  I do have 2 email accounts / FB / bunch of other stuff running at all times too pretty much.  Get a lot of calls / texts throughout the day of course too.  So far it has been amazing", "time": "28th October 2016, 05:08 PM", "postID": "post69349758", "replies": []}, {"text": "I Have the V20 for 2 days and last nite lost about 30%, will check today what was running... not good but could be the battery ....", "time": "28th October 2016, 05:34 PM", "postID": "post69350123", "replies": [{"text": "7 hours I slept last night with v20 unplugged after fully charging.  Burned 1%.\n\r\nYour issue seems to either be low signal strength or apps waking the phone.", "time": "30th October 2016, 07:18 PM", "postID": "post69380687", "replies": []}]}, {"text": "Sleep mode is awesome I bearly notice a drian.", "time": "30th October 2016, 05:40 PM", "postID": "post69379384", "replies": []}, {"text": "I am havei very little sleep drain.  This phone has really surprised me. I have been loyal too thenote series since the n2.... And when the n7 issue started and we had to return it I decided to give the v20 a shot. So far it has really surprised me!", "time": "30th October 2016, 09:52 PM", "postID": "post69382741", "replies": [{"text": "Hey there, I remember you from the L900 Note 2 days of Team Veritas, small world", "time": "30th October 2016, 10:34 PM", "postID": "post69383204", "replies": []}]}, {"text": "standby drain is nothing special for me. at 745am I used it for like 22 min and got it to 99 percent... laid it down and didn't pick up again until like 1040am, and it was at 94 percent.", "time": "19th November 2016, 03:47 PM", "postID": "post69698024", "replies": []}, {"text": "I find that if you look at the battery usage the drain is from Google.\r\nA reboot or an update to one of the main Google apps is available that usually stops the drain", "time": "22nd November 2016, 03:04 AM", "postID": "post69733961", "replies": []}, {"text": "I've have mine for a little under a week, but feel silly reviewing it now. A true test of this phone and the quality of its battery use on Nougat, is truly shown in 6 months time. Every phone should start off with a great battery life when it comes to standby use.\n\r\nRooSTA", "time": "26th November 2016, 09:46 AM", "postID": "post69797811", "replies": []}, {"text": "I had fully charged and unplugged phone slept 8 hour and saw 2 percent battery down.I usually keep all my app open.", "time": "10th December 2016, 01:53 AM", "postID": "post70014754", "replies": []}, {"text": "LG phones always have solid standby time, V20 seems to be no exception. Only 4% battery drained after 8 hours on sleep mode.", "time": "10th December 2016, 05:23 PM", "postID": "post70024042", "replies": [{"text": "that must be nice.  mine drains like crazy sleeping and idk why lol", "time": "11th December 2016, 05:45 PM", "postID": "post70039672", "replies": []}]}, {"text": "Not too bad if I do say so.", "time": "26th December 2016, 03:03 AM", "postID": "post70255883", "replies": []}, {"text": "I always turn on Airplane mode when i go to sleep. some nights i have only 4% drain during Night time, this morning i had 16% battery drain to find out in battery statistics that Phone IDLE drained 10% and Android system drained 6% battery overnight...[COLOR=\"Silver\"]\n\n---------- Post added at 03:52 PM ---------- Previous post was at 03:50 PM ----------\nAnybody can explain how they achieve to only have 1-2% drain overnight?", "time": "19th January 2017, 03:52 PM", "postID": "post70628380", "replies": []}, {"text": "Standby is awesome on the V20. Highest my standby drain has ever gotten to was about 8% one night but I don't remember what the anomaly was. Normally get around 4 or 5%", "time": "19th February 2017, 11:01 PM", "postID": "post71104379", "replies": []}, {"text": "I don't get it, how do people's V20s drain so slowly, and then there are so many like me whose V20 seems to have run a marathon by the time I wake up. Is it that there are so many lemons in their battery dept, or is there sometime else?", "time": "21st December 2017, 08:21 AM", "postID": "post74915901", "replies": [{"text": "Well, it is possible to achieve 0,2 % per hour drain, but at least the phone must be rooted, you have to use apps like greenify (to put apps to sleep asap), myandroidtools to control google play services and downloaded app services, app ops to control permissions, kernel adiutor to underclock your cpu and choose different cpu governor, use less app, control your services (switch off location, bluetooth and wifi scanning, etc.). But first of all, you have to figure it out, what's more important for you: almost 0 battery drain or running services.  As far as I understood, \"normal\" battery idle drain is about 1% per hour, but I think \"normal\" has a different meaning for everyone.", "time": "21st December 2017, 03:41 PM", "postID": "post74919702", "replies": []}]}, {"text": "It works well on standing by. I like the secondary screen. It actully saves energy by preventing people from lighting up the entire screen for timing or checking updates too much", "time": "1st April 2018, 02:34 PM", "postID": "post76088097", "replies": []}]}, {"title": "Heavy use endurance", "rating": 3.5, "links": ["https://forum.xda-developers.com/v20/review/heavy-endurance-t3484935", "https://forum.xda-developers.com/v20/review/heavy-endurance-t3484935/page2"], "threads": [{"text": "3 hours and 8-12 minutes of 1440p video at full brightness, loud speaker, wifi on, and screen recorder running (although the file messed up so i cant post it).", "time": "31st October 2016, 05:09 AM", "postID": "post69386544", "replies": []}, {"text": "bad", "time": "25th June 2017, 04:45 AM", "postID": "post72795185", "replies": []}, {"text": "Battle Bay: Less than 2 hours!", "time": "25th June 2017, 07:48 PM", "postID": "post72802541", "replies": []}, {"text": "I can honestly say that it really depends on what I am doing. For example if I am digging around on the WOW companion Application or Yahoo's Fantasy Sports Application, the whole phone will get heated up and the battery starts taking a nosedive. If I'm not doing anything with my phone it can go 15 hours straight without losing a single percent. If I am just watching YouTube or something along those lines at 1080 or lower it seems to still go down, but not nearly as quickly as the (possibly poorly - from a power consumption view - designed) apps mentioned before.", "time": "26th June 2017, 03:58 PM", "postID": "post72811863", "replies": []}, {"text": "As far as I'm concerned the removable battery negates any battery performance complaints. Out of power? Pop in a new battery, and you're 100% in a few minutes, back to endure more \"heavy use\"... How can any other modern flagship begin to compare?! (not to mention a year down the line, when I can just buy a fresh battery to mitigate deteriorating capacity, while the crowd has to buy a brand new iphone/s9/m10)", "time": "5th August 2017, 04:03 AM", "postID": "post73292157", "replies": []}, {"text": "I've been playing Sky Force Reloaded a lot the past week.  I had to be next to the power charger.  I haven't bought a spare/secondary battery yet.  I carry around a usb battery and a short cable when I need too...", "time": "7th August 2017, 08:54 PM", "postID": "post73321789", "replies": []}, {"text": "Installed some more apps and games, and talk about nosedive.  From the time I leave the house at 7AM to about 12 noon, the battery drops down to 15%(battery warning).  I have to charge it then.  I have to charge it again when I leave the office, which is around 5PM.  Battery level varies at that time.  Then charge again before bed.  I still haven't rooted my phone.  Phone temperature remains about 80F to about 108F(heavy use while charging) at times.   LinkedIn, xfinity, Groupon, Weather, Waze, etc.  Battery drainers!  I've about almost had it.  I miss root, and miss the ability to freeze apps.  I will have to root this LG V20 sooner or later...", "time": "30th August 2017, 04:39 AM", "postID": "post73591902", "replies": [{"text": "Yes my does that too.. Battery lasts just a bit over half day. I purchased 2nd battery but it's getting very annoying to change and charge them when ur between places.\nHope he gets better", "time": "31st August 2017, 12:56 AM", "postID": "post73604012", "replies": []}]}, {"text": "I usually can keep my phone charges, in the car, desk, night stand. Today we where doing Hurricane prep listening to Spotify while working, watching YouTube while in the car driving from place to place. Had to set the screen to auto brightness to deal with the BRIGHT sunlight outdoors. After about 3.5 to 4 hours of use and 1 hour and 30 minuts of screen on time I was down to about 38% battery.  I had to drive home and grab my power bank. I've only had my V20 for 2 months.\n\nNot impressed!", "time": "9th September 2017, 05:04 AM", "postID": "post73723211", "replies": [{"text": "I'm still on stock H91810k.  How 'bout you?", "time": "16th September 2017, 10:28 PM", "postID": "post73819537", "replies": []}]}]}, {"title": "Light use endurance", "rating": 5.0, "links": ["https://forum.xda-developers.com/v20/review/light-endurance-t3484936"], "threads": [{"text": "I'm not a heavy user. About an hour to two of screen time per day. I listen to music through the speaker at work. When I plug in at bedtime, I have at least 50% battery left.", "time": "23rd October 2016, 02:43 AM", "postID": "post69261058", "replies": []}, {"text": "light user here too. \n\nSOT is about 2 hours with phone idle the # 1 user of battery. At this rate the phone gets 1 charge per 7 days with 15% left.\n\nOn the odd heavy day(s) SOT is over 6 hours. This phone gets the best out of it when used hard and hates sleeping.", "time": "28th December 2017, 05:20 AM", "postID": "post74986623", "replies": []}]}, {"title": "\"Look\" of the device (aesthetics)", "rating": 4.5, "links": ["https://forum.xda-developers.com/v20/review/look-device-aesthetics-t3484937"], "threads": []}, {"title": "Quality feel (use of materials)", "rating": 4.0, "links": ["https://forum.xda-developers.com/v20/review/quality-feel-materials-t3484938", "https://forum.xda-developers.com/v20/review/quality-feel-materials-t3484938/page2"], "threads": [{"text": "Meh. It ain't no Note 7. That said, what wows me is performance first. My phone will be in a case which means aesthetics is moot.", "time": "23rd October 2016, 02:41 AM", "postID": "post69261047", "replies": [{"text": "agreed...the quality of my N7 was amazing...as for the V20, screen looks great...i like the simplicity of the design...performance is great as well!!", "time": "28th October 2016, 06:34 AM", "postID": "post69344405", "replies": []}]}, {"text": "The design isn't exciting, but honestly I didn't think much of the glass note 7. That stupid thing fell out of my pocket while I was laying down and cracked the back and the camera lens cover. as douger1957 said it'll be in a case anyway.", "time": "28th October 2016, 05:02 AM", "postID": "post69343699", "replies": []}, {"text": "It is an elegant understated design IMHO, least in the titanium color.  Done well.  Varying materials match colors (matching Al to plastic ain't easy), feels good in the hand for a naked phone (most are ice cubes).", "time": "28th October 2016, 06:21 PM", "postID": "post69350802", "replies": []}, {"text": "before everyone was complaining about samsung and others that they dont use \"premium\" materials.\nNow when they do glass/metal is bad also. Easy to crack, fingerprint magnet and at the end you put case on it so what's the point really?! just higher premium price. every phone in case will look almost the same no matter if its glass or metal or plastic but people wanted so they have it", "time": "28th October 2016, 07:06 PM", "postID": "post69351430", "replies": []}, {"text": "I think my V10 felt more solid, but this phone is great too!", "time": "30th October 2016, 03:16 AM", "postID": "post69370629", "replies": [{"text": "I must concur with you.  I in particular liked the steel rails of the V10, which were attached to the main body.  I suspect the V20 would have done better in the torture test of trying to bend the main body if it still had the steel rails.  Looks like most of the rigidity of the V20 comes from aluminum back, which isn't fully attached.    True, that was a torture test, but still...", "time": "30th December 2016, 02:08 AM", "postID": "post70312686", "replies": []}]}, {"text": "it's not shiny armor nor glossy glass. But since Optimus G Pro, I stick to LG products for their build quality. G Pro, G 3, G Flex 2 and now V20, all these guys looks and feels solid in my hand.", "time": "17th January 2017, 03:39 AM", "postID": "post70587183", "replies": []}, {"text": "I'm coming from note 4. I feel that the built quality is nice. For metal phone it's light in hand, big enough to fit the hands. Nice to hold.\n\nAlso the screen is awesome. So far I'm liking the phone.\n\nI wish I had note 7, but due to their fiasco, I purchased this and I'll be with it for some time now. I don't plan on getting a new phone until this one dies.", "time": "31st January 2017, 04:06 AM", "postID": "post70809184", "replies": []}, {"text": "as for the V20, screen looks great", "time": "1st February 2017, 06:34 PM", "postID": "post70835148", "replies": []}, {"text": "Honestly, I don't think it's the nicest looking phone I've ever had.\n\r\nBut, It fits in my hand perfectly and compared to my old samsung phones, it feels much more solid.  Compared to the note 5, I can reach all of the screen with one hand no problem.  I like the more rugged, metal look of the phone.", "time": "3rd February 2017, 12:46 AM", "postID": "post70854138", "replies": []}, {"text": "They have an obviously flawed camera glass design that is shattering for thousands of people for no reason and LG is refusing to own the issue as usual.  Otherwise it feels like good quality.\n\nJust be prepared to have a useless camera.", "time": "25th February 2017, 04:06 AM", "postID": "post71179247", "replies": []}, {"text": "Maybe it has a kind of industrial look. but it is tough as hell! https://www.youtube.com/watch?v=U2El1Fo8Pqc 1000Ft drop and it still works lol!", "time": "25th March 2017, 02:37 AM", "postID": "post71576892", "replies": []}, {"text": "Who needs a glass back that easily cracks.  It'll be in a case anyway as pointed out well in most posts.  Mine had a case from the moment I bought it.  Just a cheap $4 at first but bought the ringke onyx and spigen tempered glass instantly as well.\n\nPurchased dbrand stickers as well for the rear dual cam since the factory installed clear plastic ones seems to be not durable and won't last long.  Though I still have them on for addt'l layer of protection.   I find drop protection more useful than waterproof or dust proof ability.", "time": "6th April 2017, 12:13 PM", "postID": "post71749310", "replies": []}, {"text": "Speaking of durability, a guy dropped a V20 a thousand feet from a drone onto a concrete parking lot, and the camera glass didn't break, the phone was actually still functional.  The glass seems to be more vulnerable to a scratch or maybe a direct hit, a guy scratched it with a box cutter and the glass cracked, something a protective skin should help with.", "time": "6th April 2017, 06:05 PM", "postID": "post71753654", "replies": []}]}, {"title": "Ergonomics (in-hand feel)", "rating": 4.5, "links": ["https://forum.xda-developers.com/v20/review/ergonomics-hand-feel-t3484939"], "threads": [{"text": "is the metal body steady on palm of hand or sliding?!", "time": "2nd March 2017, 09:40 AM", "postID": "post71250789", "replies": []}, {"text": "I like the phones bodystyle. I also didn't mind the weighted feel of the V10.", "time": "8th March 2017, 04:29 PM", "postID": "post71338213", "replies": []}, {"text": "At first It felt a bit too slippery for me, the first week I dropped it 2 or 3 times. A case solved that problem but adds bulk.  I just got a dbrand skin, it's a matte finish so it's not slippery at all, and retains the original thin profile which feels great.", "time": "9th March 2017, 10:28 PM", "postID": "post71357810", "replies": []}]}, {"title": "OEM skin/software", "rating": 4.0, "links": ["https://forum.xda-developers.com/v20/review/oem-skin-software-t3484940", "https://forum.xda-developers.com/v20/review/oem-skin-software-t3484940/page2"], "threads": [{"text": "I love LGs take on Android. I see some room for improvement but I'd rate it 7 out of 10.", "time": "22nd October 2016, 06:36 PM", "postID": "post69256101", "replies": []}, {"text": "I moved from a rooted G3 and immediately missed the Google Now launcher, so I threw that on. I should probably give LGs skin a shot before I change over completely.", "time": "22nd October 2016, 11:20 PM", "postID": "post69259440", "replies": []}, {"text": "I didn't much care for the LG skin. Then again, I was stymied by the lack of an app drawer which I now know is a setting adjustment away. I'm using the Pixel launcher now. I'm more comfortable with that having been a Google Now launcher user.", "time": "23rd October 2016, 02:46 AM", "postID": "post69261085", "replies": [{"text": "How do you like the Pixel Launcher? I had to go with Google Now launcher (coming from a N-6P). Wanting to try something else though...", "time": "23rd October 2016, 07:00 AM", "postID": "post69262949", "replies": [{"text": "I miss the cards page. You can get it by tapping the \"G\" twice. Accessing the app drawer means tapping a carat near the bottom of the screen. Otherwise, it's the same as Google Now.\n\nI'm intrigued by the Google Assistant available on the Pixel. I trying to cobble together bits and pieces of it. If we can get root and access to build.prop, we can get most of that feature.\n\nhttp://www.digitaltrends.com/mobile/...-your-android/", "time": "23rd October 2016, 02:41 PM", "postID": "post69267940", "replies": [{"text": "So I actually have the cards page on my V20. I just went with the Google Now launcher. And in terms of the assistant, I downloaded ALLO & it has G Assistant built in now. Or at least a \"preview version\" of it. It is pretty awesome too!!!\n\n(I realize that taking a clip of the cards page doesn't show that it is an actual page of my \"home screens\" but it is all the way to the left like it is on Google Android N.)", "time": "23rd October 2016, 03:00 PM", "postID": "post69268222", "replies": []}, {"text": "I did the best I could to take a screen shot of how I have the Cards page all the way to the left of my home screens like on clean Android N...", "time": "23rd October 2016, 03:04 PM", "postID": "post69268271", "replies": []}]}]}]}, {"text": "I give an 8/10 to the themes. I Wish they have done at least about 200+ themes before actually adding that to the setting. Then again,,,, it is better than nothing. Think about it as a CM theme store but very limited (probably \"yet\") maybe after a couple of weeks they allow others to create new themes, or they themselves do a couple of 100+ more", "time": "23rd October 2016, 07:13 AM", "postID": "post69263058", "replies": []}, {"text": "3 themes!?!?!?!? Cmon man.", "time": "23rd October 2016, 08:02 PM", "postID": "post69272686", "replies": []}, {"text": "Ok, on the stock launcher is there anyway to change the grid size? Its an option to change it in the \"regular\" home but not the \"home and app drawer\"", "time": "25th October 2016, 02:44 AM", "postID": "post69293399", "replies": []}, {"text": "Just got my V20 and I'm trying to give it a review.. Definitely a step up from the G4 G5 and V10..  Probably the best they've done.. The user interface is no longer cartoonish and has a much more sophisticated look to it.. The phone itself feels sturdy but still sleek. It went through 60,000 qc tests and it was also given a high military grade for strength.. They moved the volume buttons back to the side and I'm having a lot of trouble adjusting. The rear button design was perfect and genus.. They took away a couple of apps I really preferred, but they're take on what Google is wanting these manufacturers to start putting out, is awesome. It's the closest they've come to perfecting a blend of Lg originality with Google's streamlined material design. So far I'm very impressed. The Quad Dac damn near blows my speakers out in my Mercedes which has a Harmon Kardon surround system. Think about that, a phone blowing out a top of the line surround system.. Crazy to think how far we've come since Nokia. The camera I'll play with as the days come, but the only thing I don't like about the ui is it could use a tad bit more color and the notification menu could use a little contrast for separating cards.. Also where did smart notice and their stock calculator go. The LG calculator had an option to review history which I used frequently. Overall I'm pretty pleased having had every flagship of theirs excluding the G5..", "time": "26th October 2016, 02:21 AM", "postID": "post69309626", "replies": []}, {"text": "New to LG. My first phone with lg is this v20.\n\nThe OEM skin needs a lot of work. I'm getting used to it. \n\nI was going to slap on Nova but I'm sticking out. Thus far not bad. \n\nOptions for app drawer are in setting (initially I was not too thrilled with no app drawer and having apps on the main screen, that is apple boring) \n\nThere's no posting for DAC. But I'm very impressed. The earlier poster mentioned how the Mercedes speaks got blown, I have to check it out on my car stereo, I'm still using BT.\n\nOver all loving the functioning of the phone. \n\nComing from note series, I do miss the stylus. \n\nOEM has a screen shot app I just wish it was more versatile like the note 4 series stylus with cropping and drawing and sharing. With the OEM screen shot it seems there's multiple steps in getting the shot then cropping and then writing on it and then sharing it. Maybe I'll have up get use to the steps. \n\nKP", "time": "22nd December 2016, 04:54 PM", "postID": "post70210407", "replies": [{"text": "I thought it was awful, too. Then I found the Capture+. It's great. Works very, very well. It's in the pull down, or can be added to the home buttons or second screen in display options. Play with it for a few minutes", "time": "23rd December 2016, 07:12 PM", "postID": "post70225802", "replies": []}]}, {"text": "if you were looking for more themes and customization, just use the lg smart world app. should be able to download it on your phone via the browser.", "time": "22nd December 2016, 08:32 PM", "postID": "post70213050", "replies": []}, {"text": "No bad ****er", "time": "4th February 2017, 02:34 PM", "postID": "post70876176", "replies": []}]}, {"title": "Outdoor visibility (max brightness)", "rating": 4.5, "links": ["https://forum.xda-developers.com/v20/review/outdoor-visibility-max-brightness-t3484941"], "threads": [{"text": "It's OK. I have yet to own a phone where outdoor viewability is great.", "time": "23rd October 2016, 02:51 AM", "postID": "post69261109", "replies": []}, {"text": "Out door brightness is not good at all. I would give it a 6 at best. Coming from the best screen in the world the N7, this screen leaves alot to be desired. The N7 had unbelievable outdoor brightness.", "time": "3rd November 2016, 12:59 AM", "postID": "post69434366", "replies": []}, {"text": "Never got to see the N7 but V20 gets bright enough for use in the sun down here in South Florida provided you keep the brightness on auto. It doesn't get as bright if you turn off auto and put the brightness slider all the way up. The only thing bad is the colors get kind of washed out in max brightness mode but when you are viewing in direct sunlight, fine details get washed out anyways.", "time": "19th February 2017, 11:13 PM", "postID": "post71104472", "replies": []}, {"text": "Not bad for me. I also don't expect 4k TV quality", "time": "21st February 2017, 06:47 PM", "postID": "post71131370", "replies": [{"text": "lol true thing. i mean, why would you want a 4k display on a phone if not to drain your battery way faster? i did a test on my own about playing a video in 1440p  (which is the closest to 4k in a phone so far) and i also did one with 1080p. and as i expected, it last longer with 1080p resolution than with 1440p. And their qualities looked exactly alike. So, 1440p is not that much of a difference in a phone from 1080p  I play in 1080p all the time. Now, when i want to see something in true 4k, i cast from my phone to my 4k tv and voila! it wont directly affect the phone's battery (except for the amount of data that is being streamed from the phone to the tv which also causes battery draining, but significantly less battery drain than if played on my phone)", "time": "22nd February 2017, 02:46 AM", "postID": "post71135937", "replies": []}]}]}, {"title": "Contrast (true blacks)", "rating": 4.0, "links": ["https://forum.xda-developers.com/v20/review/contrast-true-blacks-t3484942", "https://forum.xda-developers.com/v20/review/contrast-true-blacks-t3484942/page2"], "threads": [{"text": "Definitely not a Note 7, which sets the standard for true blacks. I'll bet this screen is easier on the battery.", "time": "23rd October 2016, 02:48 AM", "postID": "post69261094", "replies": [{"text": "I'm going to disagree. The Note7 is a standard for \"true black\" because it is actually true black. An LED/OLED/AMOLED/etc display accomplishes black by simply shutting off an LED pixel, thus creating a 100% TRUE black. (Also, LED being off is using 0 energy).\n\r\nLCD's on the other hand require backlighting, thus anytime the screen is on, the entire thing is lit. This is why no LCD will ever accomplish a 100% true black. It's also the reason why LCD's tend to be more of a battery hog because all pixels, even black ones, require lighting which requires energy.\n\r\nTo see the difference, put an AMOLED and LCD screen phone beside each other in a dark room and do a google image search for 000000, click one of the results and view it full screen. The AMOLED phone will appear to be off and the LCD phone will still be giving off light.", "time": "23rd October 2016, 04:33 AM", "postID": "post69261920", "replies": []}]}, {"text": "from phonearena.com", "time": "24th October 2016, 02:50 AM", "postID": "post69276682", "replies": []}, {"text": "I don't know if everybody know this but the note 7 is irrelevant.", "time": "24th October 2016, 02:59 AM", "postID": "post69276753", "replies": [{"text": "DING DING DING We have a winner!!!!", "time": "24th October 2016, 04:10 PM", "postID": "post69285324", "replies": []}]}, {"text": "Note 4 Note 7 no difference for this discussion same AMOLED panel.\n\nthe LGv20 has a nice screen. very nice screen in fact (I now have one) it is not REMOTELY as good as my note 4 screen.\n\nway way way to high a color temp on the panel. its damned near blue. not remotely white. when I use low warming it helps a little but not much. you get used to it but you really really notice in large areas of white.\n\nthe blacks are ok but again. horrid if you are used to an oled panel. I hope LG puts an oled panel in the V30 since I know they have the tech (their oled televisions are drop dead sexy alas way way outside of anything remotely in my budget)\n\nwhat helps is that it has the 1440p panel. this really is the ideal resolution for a 5.5 to 6 inch panel where 1080p is just lacking noticeably. you adjust to the high temperature you don't adjust to low resolution.\n\nsadly so far the camera is crap at night. grrr. was hoping for better. have not really tested in in daytime yet though I expect it will be fine.", "time": "26th October 2016, 03:40 AM", "postID": "post69310291", "replies": [{"text": "So turn down the blue.  Nougat lets you.", "time": "26th October 2016, 12:38 PM", "postID": "post69315451", "replies": []}, {"text": "agreed on the crappy camera at night, shots came out really grainy or noisy on auto mode. didn't try the manual mode of tweaking yet.\n\r\nwas comparing auto shots on both my s7 edge and v20, seems like s7 edge still takes better night shots.", "time": "1st November 2016, 07:26 AM", "postID": "post69403951", "replies": []}]}, {"text": "Hmm.. Coming from a note 7... The 7 still has a better screen.. But increase brightness to 60 and up and it looks really great. Can't complain.", "time": "29th October 2016, 06:50 PM", "postID": "post69365739", "replies": []}, {"text": "Yeah the blacks cant compare to my note 4 but at least the viewing angle is good enough. Dont notice any colour shift at any reasonable angle.", "time": "31st October 2016, 05:11 AM", "postID": "post69386563", "replies": []}, {"text": "Has anyone fiddled with the Color settings under Accessibility menu?  I wonder if those would help.....anybody have success?", "time": "1st November 2016, 09:45 PM", "postID": "post69415744", "replies": [{"text": "There's already a thread all about it", "time": "2nd November 2016, 12:37 AM", "postID": "post69417712", "replies": []}]}, {"text": "It's not much of a thread tbh. I've just read it.", "time": "15th May 2017, 05:23 AM", "postID": "post72297074", "replies": []}, {"text": "Amoled vs LCD. Note 4 vs V20. You win some you lose some. Having come from Amoled screens (Nexus 6, Note 4, etc) you get spoiled by blacks. However, the colors on the V20 are fantastic. I am a weekend pro photographer and can tell you I feel the V20 is way more natural than the over saturated colors of an Amoled screen. Also viewing angles on the V20 maintain colors while the Note 4 does not. \nBut back to black levels. This is good for an LCD screen and turning off the top display improves it a lot. The black level is good but it is a dark grey. But when you watch Netflix etc in the dark it is not bad at all. Not Amoled good but definitely not bad.", "time": "19th June 2017, 02:14 AM", "postID": "post72722906", "replies": []}, {"text": "OK so having done some more watching with the lights totally off, I can say this is a disaster in terms of black levels. I watched 10 minutes of Lord Of The Rings and pretty much stopped.", "time": "23rd June 2017, 09:12 PM", "postID": "post72781437", "replies": []}]}, {"title": "Color saturation & accuracy", "rating": 3.5, "links": ["https://forum.xda-developers.com/v20/review/color-saturation-accuracy-t3484943"], "threads": [{"text": "With the various customs roms on the H918, some have the color control app which really makes a difference. Almost like having a sammy again. Note 7 RIP.", "time": "3rd January 2017, 12:54 AM", "postID": "post70367286", "replies": []}, {"text": "I'm a hardcore Sammy fan boy but I have to say that as far as color reproduction goes, this phone is better than the s7 edge and the note 7. I'm not a big fan of LCD but I am very impressed with this phone as far as color accuracy goes.", "time": "5th February 2017, 01:01 AM", "postID": "post70882821", "replies": []}, {"text": "not really that bad since i use comfort mode.", "time": "7th December 2017, 06:23 AM", "postID": "post74762799", "replies": []}, {"text": "For what it's worth, my VS995 seems to have over-saturated green a little. No biggie since my kernel has KCAL.", "time": "13th December 2017, 05:28 PM", "postID": "post74835967", "replies": []}]}, {"title": "Clarity/resolution", "rating": 4.5, "links": ["https://forum.xda-developers.com/v20/review/clarity-resolution-t3484944", "https://forum.xda-developers.com/v20/review/clarity-resolution-t3484944/page2"], "threads": [{"text": "i hate the image retention, my sony z3c, samsung note 4/edge not having the same issue.", "time": "7th December 2017, 06:22 AM", "postID": "post74762796", "replies": []}, {"text": "Ghosting\n\n😒\n\nIt's past 1 year mark.\n\nThe screen ghosting issue is so prominent that it's annoying. \n\nThis is well known in the.forum's but it's not something that lg is talking about.\n\nI'm going to have to find out if there is a recall or can get this fixed. \n\nTruly disappointed.", "time": "25th January 2018, 05:40 PM", "postID": "post75330903", "replies": []}, {"text": "https://forum.xda-developers.com/v20...fixed-t3661631\n\nTl;dr:\nRooted: KCAL\nUnrooted: SFilter/Night Screen in Google Play Store", "time": "25th January 2018, 06:13 PM", "postID": "post75331253", "replies": []}, {"text": "I think Lg v20 display has a Good Pixel per inch ratio so that We can't see any dot with naked eye but thw color production is Soo Bad .....\nI mean if we compare with Samsun display... They Are far better then This", "time": "10th February 2018, 06:43 PM", "postID": "post75517655", "replies": [{"text": "The color reproduction on the LG panels is actually *really* good. Samsung cranks the vibrancy and saturation up on their displays because it is pleasing to most people's eyes. If anything, Samsungs color reproduction is vastly inferior with default settings. Both class of panels can be calibrated to be more correct though.\n\r\nThe other thing is that LGs colors are \"cooler\" and Samsung *always* biases towards warmer displays.", "time": "20th February 2018, 01:48 PM", "postID": "post75634872", "replies": [{"text": "As we all knows people want Color vibrancy which Samsung is delivering actually.\nI've tried to calibrate my display many time but even LG's display can't compete with Samsung's 2013 flagships display.", "time": "20th February 2018, 02:36 PM", "postID": "post75635352", "replies": [{"text": "In what ways? And don't forget you are comparing an IPS-LCD to SAMOLED+ which will have vastly better blacks. LCDs can't yet compete on the contrast of an OLED. \n\nI don't care what people want. They jump from one has to another and sacrifice utility for form at the drop of a hat. \n\nI'll keep my color correct LCD that won't suffer from actual burn in \n\n(My retention is all but nonexistent and that isn't permanent regardless)", "time": "20th February 2018, 06:44 PM", "postID": "post75638019", "replies": [{"text": "Whatever it is.... There is no comparison between Ips LCD and SuperAmoled display .\r\nBy the way your retention problem can simply be fixed if you're rooted", "time": "21st February 2018, 04:35 AM", "postID": "post75642131", "replies": [{"text": "Oh I know. I run custom kcal settings", "time": "21st February 2018, 12:21 PM", "postID": "post75645519", "replies": []}]}]}, {"text": "You can try using the built-in Comfort View to make the display warmer. I set mine to high and it looks really close to my Galaxy Note 4, using the Basic display color option.", "time": "22nd March 2018, 03:44 PM", "postID": "post75978927", "replies": []}]}]}]}, {"text": "Have you experienced that? Annoying...", "time": "1st April 2018, 02:06 PM", "postID": "post76087840", "replies": []}]}, {"title": "Minimum brightness", "rating": 4.0, "links": ["https://forum.xda-developers.com/v20/review/minimum-brightness-t3484945", "https://forum.xda-developers.com/v20/review/minimum-brightness-t3484945/page2"], "threads": [{"text": "Comparing it side by side with my Note 7 (awaiting return box) It's significantly brighter at minimum brightness setting. Easily readable in a well lit room which is way too bright in my opinion.", "time": "28th October 2016, 10:54 PM", "postID": "post69354309", "replies": []}, {"text": "Use blue light or comfort view", "time": "29th October 2016, 02:43 AM", "postID": "post69356022", "replies": [{"text": "Its dim enough", "time": "29th October 2016, 03:16 AM", "postID": "post69356221", "replies": []}]}, {"text": "Yeah i need it to dim more. Its much more brighter thwn my old phone.", "time": "30th October 2016, 08:29 AM", "postID": "post69372990", "replies": []}, {"text": "The screen at 0% is a good bit brighter than my GS7 Edge was, but i knew that was going to happen coming to an LCD screen from an Amoled.", "time": "30th October 2016, 02:34 PM", "postID": "post69376798", "replies": []}, {"text": "I remember the moto x pure had a mod that would allow 0 to be much darker.. i need that on this phone. it's way too bright. needed root though.", "time": "19th November 2016, 03:49 PM", "postID": "post69698038", "replies": []}, {"text": "Just use Lux software. It can dim it as low as you want.", "time": "24th November 2016, 04:14 PM", "postID": "post69773232", "replies": [{"text": "If you're unrooted this is a big battery drain. Lux throws on what is essentially a screen filter, and since it's not at a system level it's constantly using extra resources to keep it afloat. \n\nI agree though, this screen is way too bright even on the lowest setting", "time": "13th December 2016, 07:22 PM", "postID": "post70073912", "replies": []}]}, {"text": "0% is too bright in bed. Lg needs to lower this", "time": "14th December 2016, 01:22 AM", "postID": "post70077965", "replies": []}, {"text": "Anyone else experiencing wonky auto-brightness too? Sometimes ill lay on the couch during the DAY and it lowers itself to 0%, and other times when im in bed at night with all the lights off, and the damn thing will be at 30% ..?", "time": "17th December 2016, 01:04 AM", "postID": "post70126211", "replies": [{"text": "Have been noticing this behavior for past few days. Can't tell if it's software related ie. App that's causing it vs. The rom software change due to app causing it. \n\nI wanted to do a full recovery and see how my phone behaves. \n\nHave you done a full recovery yet?", "time": "13th April 2017, 01:40 PM", "postID": "post71843456", "replies": []}]}, {"text": "Dimmest setting is still too bright on my lg v20. Had to install and use Lux yet again to make it dimmer. I thought there would be no need for Lux app in year 2017 but i was wrong.", "time": "17th January 2017, 03:44 AM", "postID": "post70587219", "replies": []}, {"text": "Way too bright.. I had considered installing Twilight, and then I found Dimmer, which is open source and only like 400kb. (F Droid - couldn't be happier)", "time": "21st December 2017, 08:27 AM", "postID": "post74915952", "replies": []}]}, {"title": "Call quality", "rating": 4.5, "links": ["https://forum.xda-developers.com/v20/review/call-quality-t3484946"], "threads": [{"text": "My mother doesn't hear real well, and says she has a hard time understanding people on the phone, but she said I am very clear and can understand me very well!  People I am talking to sound very clear to me also, so I think the sound is excellent. I use a plantronics bluetooth, so don't know if that makes a difference or not.", "time": "21st January 2017, 12:31 AM", "postID": "post70650572", "replies": []}, {"text": "Thank you. \r\nAfter  using the phone for some time I can confirm call quality to be excellent.", "time": "21st January 2017, 03:10 AM", "postID": "post70651784", "replies": []}, {"text": "I have to say, the Samsung Galaxy S7 definitely has the best call quality on a smart phone... BUT, this definitely comes in second place. The curved top part of the device with the earphone placement is genius. You don't have to press you're whole cheek or whole ear against the phone, just lean in a little bit and you can hear perfectly. It doesn't get tiring having it on one ear, like on my other phones, after a while I have to move it to another ear. It's loud as well so you may need to turn it down a bit once you put it up to you're ear, but not ear piercing loud. It is as crystal as it gets but this phone has EXTREME noise canceling, which is great, but it literally can't hear anyone talking in the background or the TV, just you. You have to yell really loud if you're in the background and you want the other person to hear you. Some guy blasted his loud speaker walking past me one day and my friend on the phone could barely hear it, it just sounded like a tiny buzz to her. Samsung still takes the cake. Even if you have one bar the quality is good, and the LTE calling is pretty good too.", "time": "29th January 2017, 08:33 PM", "postID": "post70790001", "replies": []}, {"text": "Just chiming in as well. T-Mobile h918 and the call quality is great whether on voLTE, HD voice or not. I have used a Verizon S7 and a T-Mobile S7 edge and have noticed no difference in quality compared to my V20 so far.", "time": "19th February 2017, 10:58 PM", "postID": "post71104340", "replies": []}]}, {"title": "WiFi strength, range, and throughput", "rating": 4.0, "links": ["https://forum.xda-developers.com/v20/review/wifi-strength-range-throughput-t3484947", "https://forum.xda-developers.com/v20/review/wifi-strength-range-throughput-t3484947/page2"], "threads": [{"text": "I am having problems with wifi on my work network in the office. The explanation I got from our IT department is that the phone is having troubles with multi route setting on the network. Wifi home works without problems, but wifi at the office is not working at all. It is showing as connected but you cannot open any page nor get any internet access through any app. Anybody having this issue?", "time": "30th November 2016, 01:23 AM", "postID": "post69856393", "replies": []}, {"text": "This is the first phone I've owned that has been able to fully utilize my home internet speeds. Every other phone has reduced the speeds by as much as half, and sometimes as little at 25%. \r\nThe auto switch between wifi and mobile data works great. There was nothing more frustrating than sitting in my car in front of my house, trying to pull up navigation and the phone running horrendously slow because it wanted to use my wifi that was 100 feet and 16 walls away, just because there was a signal.", "time": "1st December 2016, 05:07 AM", "postID": "post69874144", "replies": []}, {"text": "I had the same issue with my wi-fi and internet signal for a time. Have you tried checking the phone lines in your area? Stactic noise in the lines may affect the stability of the signal. Have an IT expert check and replace the line if necessary to hopefully resolve the issue.", "time": "9th December 2016, 07:29 PM", "postID": "post70010805", "replies": []}, {"text": "Signal strength is better than my note 7 before I sent not back I ran test checking data strength. I walked outside  up the street connected to home wifi note lost connect 7 houses up the street v20 i was near 9th house", "time": "10th December 2016, 04:17 PM", "postID": "post70023081", "replies": []}, {"text": "GPS accuracy, Lock speed, and reliability is poor for me. Can we vote on that?", "time": "10th December 2016, 05:12 PM", "postID": "post70023875", "replies": []}, {"text": "My V20 is head and shoulders better than my Note 7 when it comes to networking performance. I had real, serious issues with throughput on the N7.  My Note 3 would get ~5MB/sec transfers from my home Linux servers' SMB shares, the N7 would get 800-1000KB on a good day. The V20 is on par with the N3 on SMB, but where it REALLY shines is encrypted transfers via SCP. I can do SCP file copies at 80MB/sec reliably. It's amazing. I'm guessing we have some sort of encryption offload chip in the phone or something.", "time": "16th December 2016, 09:13 PM", "postID": "post70124012", "replies": []}, {"text": "Does anyone else have this issue where the wifi cuts in and out every 30 minutes or so? I have a Netgear WNDR3400 router and I'm on Nougat 7.0", "time": "17th December 2016, 07:57 AM", "postID": "post70129117", "replies": []}, {"text": "lg v20 perfect phone-very speed.\n\r\nmy favorite phone", "time": "17th December 2016, 11:48 PM", "postID": "post70139309", "replies": []}, {"text": "I agree man. Very speed. Much phone. Wow.", "time": "21st December 2016, 09:23 PM", "postID": "post70198594", "replies": [{"text": "xDDDDD Made my day", "time": "23rd December 2016, 08:54 PM", "postID": "post70226896", "replies": []}]}, {"text": "OK so I investigated the issue of not having internet  through WIFI although connected to network, and the issue is that the phone cannot use auto proxy? My LG G4 did not have this issue. Setting up manual proxy through Drony app solves the issue. Any way to get this working straight out of android? Seems like 7.0 took a step back in usability.", "time": "28th December 2016, 12:46 AM", "postID": "post70282680", "replies": [{"text": "What steps do you go through to make your v20 connect to work wifi?  I have a new v20 from Tmobile and upon my 1st try to connect to work wifi, i can reach the splash login page, but after entering credentials, it bounces me back to the splash page instead of verifying that I have logged in.  My older Nexus 6 has no issues connecting to wifi...", "time": "28th February 2017, 08:15 PM", "postID": "post71230526", "replies": [{"text": "Solution to my issue: Not sure if it was a combination of things or just solely this tip from an LG rep:\r\nGo to: Settings>Apps> (3 dots top left) > Show System> Wi-Fi > (storage>clear cache & clear data)\n\r\nTried connecting to Wifi after that and it worked on my v20.  Also I entered in slightly different info in my work wifi splash page which may or may not have made a difference.", "time": "1st March 2017, 11:01 PM", "postID": "post71246181", "replies": []}]}]}, {"text": "I have a Asus AC68U router and the LG V20 reports the connection speed as 78Mbps, whereas my S7 Edge shows the speed as 173Mbps while connected to the same network.\nWhy is the V20 connecting at such a slow speed? Have reset the router, turned off Wifi optimisation on the phone, but speeds have not improved. \nIs there anything else I can try out?", "time": "3rd January 2017, 07:31 AM", "postID": "post70370226", "replies": [{"text": "I have the same router. Mske sure you are connected to 5ghz and you will get adequate speed. I have no problems.", "time": "3rd January 2017, 05:28 PM", "postID": "post70377300", "replies": []}]}, {"text": "Wifi strength is good, a lot better than my G3. The download speeds are a little less than my laptop, like 35 vs 50 and 70 on 2 laptops, they may be connecting to different severs though, the speed seems to vary more on the phone.  Sometimes it's slow to switch over to LTE when moving out of wifi range.  Tells me no internet connection when wifi is too weak to get a good signal.  Mainly an issue I think with a weak wifi signal that it's still trying to connect to.", "time": "25th February 2017, 10:10 PM", "postID": "post71190265", "replies": []}, {"text": "Hello, has anyone had a problem that they cannot connect to 5G on your router? My phone will not connect to 5G what ever I do, but will connect no problem to 2.4G. I've tested it with several different routers and all my other devices connect without any problems.", "time": "2nd June 2017, 09:51 PM", "postID": "post72526656", "replies": []}, {"text": "I was having issues with my WiFi at home only. Connected everywhere else. I found a post on this site that helped. The post was for a different issue. I just looked at all of the other settings that were available and did a little experimenting. My issue is fixed. WiFi is now good everywhere!!! I have T-Mobile so I am not sure if it will work with other carriers.\n\r\nDial-er code that got me to the right menu.\n\r\n*#546368#*918#", "time": "6th June 2017, 05:05 AM", "postID": "post72564615", "replies": []}, {"text": "I found that taking the metal back off my v20 improved download speed significantly!\nI reported that in the discussion about people unable to get 5 GHz Wi-Fi.", "time": "2nd July 2017, 06:12 PM", "postID": "post72883723", "replies": []}]}, {"title": "Cellular strength and throughput", "rating": 3.5, "links": ["https://forum.xda-developers.com/v20/review/cellular-strength-throughput-t3484948", "https://forum.xda-developers.com/v20/review/cellular-strength-throughput-t3484948/page2"], "threads": [{"text": "Unfortunately, the signal strength is really poor for me", "time": "28th October 2016, 03:08 AM", "postID": "post69342928", "replies": []}, {"text": "Good signal for me, Lte slows down to less than 2Mbps down while my s7 is doing 34Mbps avg.  Im on at&t.", "time": "30th October 2016, 05:49 AM", "postID": "post69371726", "replies": []}, {"text": "Not enjoying the quality I'm getting, even at home. 2 bars average, and this is in the Dallas area.\nWorse than my Note 3, so I don't blame AT&T.", "time": "7th November 2016, 04:06 AM", "postID": "post69497278", "replies": []}, {"text": "Glad to know I'm not the only one with speed issues.  I was thinking there was something wrong with my phone.", "time": "7th November 2016, 05:29 PM", "postID": "post69505948", "replies": []}, {"text": "I have issues indoors at my job but my Note 7 was the same way too at my job", "time": "7th November 2016, 06:08 PM", "postID": "post69506510", "replies": []}, {"text": "A lot better than my Note 7.  I tested this morning because I am finally getting around to setting up the phone the way I like. It tested at 80/16 which the Note 7 would only speed test at 23/12. This was at home.", "time": "7th November 2016, 07:02 PM", "postID": "post69507390", "replies": []}, {"text": "Saw a report that the S7/Edge got an update to support 4x4 MIMO and 256QAM down and 64QAM up \n\n\nAlso supposedly the V20 supports this but hasn't been turned on for us (seriously WTF)\n\n\nhttp://www.androidpolice.com/2016/11...r-data-speeds/", "time": "7th November 2016, 08:49 PM", "postID": "post69509013", "replies": []}, {"text": "From I what I have read on Reddit from posts by Qualcomm engineers, the LG v20 does not support mimo. It lacks the additional anttenas for mimo, though it does support 256 QAM. I was tempted to get the s7 edge, but AT&T doesn't support MiMo or have any plans of implementing it in the near future.", "time": "8th November 2016, 02:40 AM", "postID": "post69512889", "replies": []}, {"text": "I'm always at 1 or 2 bars. I often get \"no service\"", "time": "21st February 2018, 11:28 PM", "postID": "post75651343", "replies": []}, {"text": "Most of the time I get 0 bars with an X, or full bars with 4G but no LTE, where i used to get LTE with my previous phone, I think this phone has a weak antenna", "time": "5th March 2018, 02:35 AM", "postID": "post75775480", "replies": []}, {"text": "I need some kind of hardware mod. Anyone know where is the antenna in the phone?", "time": "6th March 2018, 05:50 PM", "postID": "post75795213", "replies": []}, {"text": "I'm with the 1-2 bar group. My Nexus 5x and Samsung S8 are guaranteed to have 2 more bars than my V20, no matter where I go. I also get the spinning circle near the signal meter indicating it's searching. I've downloaded several apps to confirm my suspicion that this phone's antenna(s) suck. I like the phone, but signal is important when it affects your ability to communicate, not to mention drain on battery.", "time": "27th March 2018, 01:20 AM", "postID": "post76029033", "replies": []}, {"text": "I think a phone of this size shouldn't be any of bad reception, especially with so many metal contacts within its cover, which must act as antenna.", "time": "1st April 2018, 02:30 PM", "postID": "post76088057", "replies": []}]}, {"title": "Speakerphone (loudness, clarity)", "rating": 3.0, "links": ["https://forum.xda-developers.com/v20/review/speakerphone-loudness-clarity-t3484949", "https://forum.xda-developers.com/v20/review/speakerphone-loudness-clarity-t3484949/page2", "https://forum.xda-developers.com/v20/review/speakerphone-loudness-clarity-t3484949/page3", "https://forum.xda-developers.com/v20/review/speakerphone-loudness-clarity-t3484949/page4"], "threads": [{"text": "So far for me I find it to be OK.  Coming from having Samsung Note phones, I find it to be a big improvement.  It could still use work IMHO, but I find it to be much louder and just as clear than any of the past Note series speakers.", "time": "22nd October 2016, 01:14 AM", "postID": "post69245305", "replies": []}, {"text": "I would say that listening to music coming from the speaker, is better than average. Its no Axon 7 or HTC 10 but your average consumer will be satisfied with the volume and clarity imo.", "time": "22nd October 2016, 03:27 AM", "postID": "post69246287", "replies": []}, {"text": "Can you compare it to LG G5 speaker?", "time": "22nd October 2016, 07:10 AM", "postID": "post69247851", "replies": []}, {"text": "I am completely deaf in one ear and partially in the other ( thank you drunk driver head on hit and run ) and I love the speaker quality. I have actually had to turn down the notification volume cause it is to loud for me. So far I really like this phone and I was a Note 1, 2, 3 and 4 user. My favorite part is when it goes to \"sleep\" and I am going to use it I pick it up and it reads my fingerprint and TADA it is ready. I am very grateful for the second screen. Overall I am extremely pleased with this one.", "time": "22nd October 2016, 09:13 PM", "postID": "post69258159", "replies": []}, {"text": "The loudness and clarity is not a Gimmick, at least for mine . I usually hear music on Pandora and Spotify, and believe me, as someone who hear music daily on spotify and pandora, im experiencing something very different than other devices i have owned.", "time": "22nd October 2016, 09:19 PM", "postID": "post69258231", "replies": []}, {"text": "This is great to hear as I wear hearing aids and the speakers on the Note 7 and S7 Edge sucked for speaker calls....", "time": "22nd October 2016, 10:58 PM", "postID": "post69259266", "replies": [{"text": "I want to hear ( duh , no pun intended ) your thoughts once you get it also. Granted I keep it relatively close to me but I am pleased with the sound so far.", "time": "23rd October 2016, 12:11 AM", "postID": "post69259829", "replies": [{"text": "I am on Sprint so it looks like I won't have it till the end of the week but I will certainly check back in and let you know.", "time": "23rd October 2016, 01:04 AM", "postID": "post69260253", "replies": []}]}]}, {"text": "is it better than a iphone 5s? XD like ^ mention note 7 kinda suck when i was testing music through it", "time": "22nd October 2016, 11:29 PM", "postID": "post69259501", "replies": []}, {"text": "I was inside a AT&T store playing with the phone and was listening to Youtube.  The store was packed and I could hear the speaker very clearly.  It wasnt bad at all for one speaker.", "time": "23rd October 2016, 01:36 AM", "postID": "post69260523", "replies": []}, {"text": "Can anyone compare the speaker quality to V10? (I have V10 and sound from the build in speaker is a nightmare! Simply worse than from the worst cheap crap)", "time": "24th October 2016, 08:09 AM", "postID": "post69279332", "replies": []}, {"text": "For some reason I thought the V20 will come with dolby atmos or some audio enhancement software by B&O Play. I have seen the Korean version with the B&O logo on the back of the V20.\nSo I am guessing that the US models don't have any added audio enhancements. Correct?\nMy V10 audio gets a powerful boost when dolby atmos switches on. The volume level will be around 15% and its pretty loud.\nOn my V20, the volume has to be increase up to 50 -60% for comfortable \"loudness\". \nLet's hope soon there will be some sort of root for the V20, so I can install the dolby atmos zip file.", "time": "24th October 2016, 04:31 PM", "postID": "post69285637", "replies": []}, {"text": "Still - is there any former owner of V10? Can anyone compare the speaker quality to V20?", "time": "25th October 2016, 05:08 PM", "postID": "post69303007", "replies": [{"text": "I can tell you from having the V10 to v20   the speaker is lot better,  and its way better than than the S7 edge and the Note 7 I had,  louder and crisper.", "time": "25th October 2016, 05:23 PM", "postID": "post69303289", "replies": []}]}, {"text": "I posted about this in the V20 Q&A section, but this is the same topic so I thought I'd drop my two cents in here. The speaker on my LG G5 blows my V20's speaker out of the water and it's kind of disappointing because I love everything else about the phone over the G5 (both phones are the T-Mobile variants btw). Watching videos is fine on the V20, but music is a no-go. I could fill the room with surprisingly clear and deep sound with my G5, but the V20's speaker when it comes to music playback sounds like it's being filtered through a dense mesh", "time": "26th October 2016, 04:34 AM", "postID": "post69310726", "replies": []}, {"text": "I compared my lg g4 with the T-Mobile store demo unit they had. I was disappointed to find my g4 is significantly louder. \nMaybe the display unit wasn't configured properly?\nMy g4 is freakishly loud. \n\n\n\n---------- Post added at 06:47 AM ---------- Previous post was at 06:42 AM ----------\n\nBack when the v10 came out, I wanted the phone, till I heard how terrible the speaker was. It was just awful. I'm glad the v20 is better than the v10.\nSometimes I wonder, if you make something great, like the speaker on the g4, why would you use a worse speaker in later models? Just doesn't make sense.\nSpeakers are a big deal for me. I work in noisy environments sometimes", "time": "27th October 2016, 12:47 PM", "postID": "post69331795", "replies": []}, {"text": "Some explanation is that G4 has speaker on his back, while V10 has speaker on the lower edge... and most likely the G4 speaker is simply bigger.\np.s. Unfortunately V20 also has speaker on the lower edge and unfortunately also only one, I mean mono (((", "time": "27th October 2016, 01:50 PM", "postID": "post69332719", "replies": []}, {"text": "Is there a tweak to make the speaker louder with surround like Note 4?", "time": "28th October 2016, 01:54 AM", "postID": "post69342338", "replies": []}, {"text": "Coming from the LG which also had a single firing speaker (rear), the bottom mount of the speaker on the v20 isn't a problem for me, however it's absolutely terrible when it comes to how loud it is when notifying you. You'll miss plenty of notifications outdoors....be sure to turn it up to MAXIMUM volume and turn vibration on. Loudspeakers should be getting louder, not quieter. Phones are thin enough as it is, we don't need any more concessions for the sake of how many millimetres thick a phone is... 2/5 from me\n\r\nROOSTA", "time": "26th November 2016, 09:50 AM", "postID": "post69797854", "replies": []}, {"text": "Way louder than my Note 3 was. And I would even say louder than the Note 7 I had for a couple months. I'm happy about the speaker for it being only one. Dual front facing speakers is a travesty when not applied. Still blown away at the lack of implementation.", "time": "29th November 2016, 01:14 AM", "postID": "post69840977", "replies": []}, {"text": "Viper works great if you are rooted\r\n . Can't turn it up more than 1/10 volume.", "time": "29th November 2016, 02:07 AM", "postID": "post69841423", "replies": []}, {"text": "It works pretty good for me.. I was told by the Sprint rep that I could use the ear piece as a speaker phone as well but I haven't figured that one out yet..", "time": "1st December 2016, 01:16 PM", "postID": "post69879158", "replies": []}, {"text": "I just got my V20 and coming from G5 im very disappointed. G5 just have amazing speaker sound quality comparing to V20. After reading this i can see it's not only me.", "time": "5th January 2017, 10:54 AM", "postID": "post70403375", "replies": []}, {"text": "Speaker is quite poor compared to the setup on the Nexus 6 I switched from. (Stereo, front-facing.)  I'd put it on par with an iPhone 6.", "time": "5th January 2017, 06:50 PM", "postID": "post70410253", "replies": []}, {"text": "The clarity is excellent, but the Dec update on T-mobile lowered the max volume, so it's not loud enough in many situations, really irritating.", "time": "25th February 2017, 10:14 PM", "postID": "post71190293", "replies": []}, {"text": "I came from a Note5 from Verizon and the speaker quality and notification volume is sad.  I assumed it was just me being picky, but I played the Note5 I'm selling next to it and I don't think I'll be selling.  I really like the look and feel of this phone.  2nd screen is awesome, but for the price, this sucks.  I'm not a big Samsung fan, but it would great for some perch knocking.\n\r\nIT's a work phone as well so I can't root because of Blackberry and Good.", "time": "28th February 2017, 10:20 PM", "postID": "post71231873", "replies": []}, {"text": "These guys say there is a plastic speaker grill that impedes the sound and gives it cheap sounding audio.  It's a 5 minute fix to remove the speaker grill and makes it sound so much better. \nhttps://android.gadgethacks.com/how-...e-mod-0176333/", "time": "4th March 2017, 07:50 PM", "postID": "post71284493", "replies": []}, {"text": "I'm impressed with both loudness and clarity, first time I used it I was quite surprised at the difference to my Z2.", "time": "13th May 2017, 09:02 PM", "postID": "post72282274", "replies": []}, {"text": "If you want the best audio on your V20 check out my latest mod thread.\n\nhttps://forum.xda-developers.com/sho....php?t=3637449", "time": "21st July 2017, 05:06 AM", "postID": "post73110284", "replies": []}]}]