[{"title": "Overall love", "rating": 4.5, "links": ["https://forum.xda-developers.com/mi-a1/review/overall-love-t3679672", "https://forum.xda-developers.com/mi-a1/review/overall-love-t3679672/page2", "https://forum.xda-developers.com/mi-a1/review/overall-love-t3679672/page3", "https://forum.xda-developers.com/mi-a1/review/overall-love-t3679672/page4"], "threads": [{"text": "Lovely phone indeed", "time": "26th September 2017, 08:48 PM", "postID": "post73943887", "replies": []}, {"text": "I loved this phone however there are some bugs like dialer is not a google one eventhough it is a  AndroidOne phone and there are some bugs with cellular network.", "time": "27th September 2017, 10:03 AM", "postID": "post73949547", "replies": []}, {"text": "mynonly issue is the camera but i dont too many photos so im not that bothered, and the rest of the phone is great", "time": "27th September 2017, 01:57 PM", "postID": "post73951623", "replies": []}, {"text": "Nice Camera in its range but do need bit more improvement.", "time": "28th September 2017, 05:47 AM", "postID": "post73959933", "replies": []}, {"text": "It's been less than 2r4 hours and so far I am loving this phone. A great device at a great price point.", "time": "1st October 2017, 06:55 AM", "postID": "post73993919", "replies": []}, {"text": "Pluses:\r\n+ Pure Android (7.1.2 at the moment)\r\n+ Timely updates (not really, Android 8.0 was released months ago and there's no sign of it)\r\n+ Relatively fast and bloat free\r\n+ 3.5mm audio jack\r\n+ Price at Chinese etailers (~$210)\r\n+ Dual SIM or single SIM + microSD\n\r\nMinuses:\r\n- In low light conditions the camera sucks completely and video recording is just awful; also no OIS or EIS\r\n- Snapdragon 625 severely underperforms\r\n- Huge bezels\r\n- No stereo speakers\r\n- Automatic brightness on my device doesn't work correctly - the phone is too dim in a bright environment and too bright in a dim environment\r\n- No kernel sources yet - really Xiaomi??\n\r\nIOW we need Nexus to be resuscitated. Pixels are too expensive.", "time": "20th November 2017, 10:29 AM", "postID": "post74574747", "replies": [{"text": "I'm really happy with what I've got AUD 280 including tempered glass and delivery. Great screen and it does what I need.\n\n\n\r\nI dun understand why ppl crazy abt bezeless phones ... wat I know it's gonna hurt (spider web screen) so much once it dropped.", "time": "16th December 2017, 05:02 PM", "postID": "post74867434", "replies": []}]}, {"text": "Simple, smooth, no bloatware.", "time": "22nd November 2017, 03:19 AM", "postID": "post74594752", "replies": []}, {"text": "Pretty satisfied!!! \r\nGreat value for money", "time": "2nd December 2017, 05:00 PM", "postID": "post74713181", "replies": []}, {"text": "I feel it is a solid phone, but the design is boring. Probably after 5 years you won't have many memories about this phone, whereas some people have fond memories of other phones (like many people had about old Nokias or Walkman phones).", "time": "5th December 2017, 05:15 PM", "postID": "post74745909", "replies": []}, {"text": "1. awesome value for money\n2. love the build quality\n3. fast + smooth + stock OS\n4. great storage capacity\n5. the camera is so so.. it could do so much more with the proper software (side loaded with GCam HDR+)\n\nand this MiA1 is my daily warrior until 2 years ahead", "time": "7th December 2017, 02:52 AM", "postID": "post74761560", "replies": []}, {"text": "Love it.\n\n'Nuff said", "time": "16th December 2017, 10:36 AM", "postID": "post74864114", "replies": []}, {"text": "I think it's terrific. Best phone I've used since the OnePlus One. No idea about the camera as I haven't used it (and probably won't use it much even when I get round to it - I'm a man in his 40s, not a selfie-obsessed teenager), but it does everything I need. \n\nIt's nice and light, build quality looks good, monthly security patches and Android updates before just about any other phone on the market. For 165 quid, it's outrageous value. Love it.", "time": "20th December 2017, 03:05 PM", "postID": "post74908711", "replies": []}, {"text": "This is the best phone for me - it can give EVERYTHING a developer wants. The Chipset supports Machine Learning SDKs, the device has a Dual camera system which serves waaaay more than enough if you don't shoot 24/7. The performance is great and Android One serves the best software experience. The device feels a lot more expensive and premium than it is.", "time": "1st January 2018, 08:22 AM", "postID": "post75034078", "replies": []}, {"text": "I'm very very happy with this phone now it has oreo, I'm not one to moan about waiting for update and this was worth the wait because they fixed the multi touch sensitivity problem so all is good here", "time": "1st January 2018, 09:10 AM", "postID": "post75034361", "replies": []}, {"text": "If you people see your phone as a loving figure, you need to get a life (and a girlfriend) already.", "time": "1st January 2018, 01:46 PM", "postID": "post75036488", "replies": [{"text": "You can love anything in life and as many and as much as you wish... It's a choice. There are no rules. Grow up kido. \n\nAnd I also love this phone, almost everything about it. Except a little squeek sound when I squeeze it... My bad luck! \n\nDid I say I LOVE IT??? 🤩🤩🤩", "time": "7th January 2018, 09:00 PM", "postID": "post75116571", "replies": []}]}, {"text": "Nice experience overall after become a beta tester", "time": "9th January 2018, 10:39 AM", "postID": "post75134226", "replies": []}, {"text": "Hi, I really love this phone, it's my first Xiaomi phone.  I sold on my ebay my samsung s7 edge with broken screen and the battery only gave me 3 hours of screen, so it was a good decision to sell it. \nI am very happy with the performance on this Mi A1, maybe the camera is something I miss about my s7 edge but THANKS TO @ Arnova8G2 the camera has improved a lot. \nSo it was an excellent purchase", "time": "12th January 2018, 07:28 PM", "postID": "post75175978", "replies": []}, {"text": "Full disclosure: I do not use the phone to play games, watch videos, or other things that are high drain activities requiring lots of processing power.  As a result, this phone is very much attuned to how I use a phone.  It is fast enough and has enough memory. I read books on my tablet or computer.  I play games on my computer. I watch videos on my computer and/or my TV.  The screen real estate on a phone is too small for me to want to read books, play games or watch videos, and I don't want to carry a small tablet as a phone.\n\nI came from Samsung and Apple phones, and I gotta say, value for money, this phone rocks!  \n\nSamsung was forever behind in updates/patches and no OS upgrades unless you bought their top $$$ phones, and the bloatware was just ridiculous! (My Note 10.1 2014 NEVER got an update from KitKat, and the security patches were 1.3 years old when it finally gave up the ghost)\n\nApple build quality has gone off the rails in my opinion, and for what you pay for those phones, value for money is horrible. (6s lasted 14 months of LIGHT usage.  2 months out of warranty, bricked)\n\nThe A1 costs ~1/4 the cost of an iPhone, so even if it only lasts 14 months (I'm looking at you Apple) then I can buy another one and still be way ahead.\n\nAndroid One: OS Upgrades and timely security patches \nExcellent build quality on mine\nVery good battery life\nOreo!  (I'm looking at you Samsung)\n4GB RAM and 64GB ROM for what most companies charge for 2/3 and 32!\n\nDownside: \nThe camera.  I was really hoping that the dual lens camera would be at least VERY good.  It's ok, but nothing to write home about.  Hopefully this can be resolved with software in the future.\nAn I/R blaster app that requires basically unlimited permissions? Why?  It would be useful if I dared use it.\n\nI liked mine so much that after using it for 3 months, I bought a red one for my wife!  Oh, and SHE likes it too, even if it isn't an Apple. \n\nI like good price/performance ratios in things I buy, and I feel the A1 gives me a very good price/performance ratio!  Yeah, I DO like it, a lot.\n\n--KB", "time": "28th January 2018, 01:45 PM", "postID": "post75361066", "replies": []}, {"text": "I was blown away on how good the IR remote control is implemented with the Mi Remote app.\n\nI was able to add a rather old TV and air conditioning in my bedroom. Now I do not need to find the remote control. I just use my phone to control those appliances. \n\nAmazing that my smartphone can be used as a universal remote control.", "time": "29th January 2018, 01:49 AM", "postID": "post75367248", "replies": [{"text": "I agree that the app would be very useful.  My concern is why it needs almost unlimited permissions to do IR controls.\n\r\nTo update, it wants these permissions:\r\nDevice and app history\r\nIdentity\r\nContacts\r\nLocation\r\nSMS\r\nPhotos/Media/Files\r\nCamera\r\nMicrophone\r\nWi-fi connection info\r\nBluetooth connection info\r\nDevice ID & call info\n\r\nIt's an app to replace remote controls for appliances.  Why does it need to be so snoopy?  I don't wear a tinfoil hat, but this is a Chinese phone, and it seems that this app can pretty much know everything about you and your phone if you use it and grant these permissions.\n\r\n--KB", "time": "29th January 2018, 02:06 AM", "postID": "post75367322", "replies": [{"text": "That is often the problem with Chinese apps. They just get all permissions even if they do not use them. But you can go to android settings and retract all those permissions from that app.", "time": "31st January 2018, 08:01 AM", "postID": "post75393550", "replies": [{"text": "I went ahead and did the update, then went into app permissions.  I had the old app locked down to storage, and apparently, the limited permissions were inherited by the update as even though it said it needed all of those permissions, it only had storage turned on in app permissions.  Now, if it actually RESPECTS the permissions limits, we're good.\n\nRegards,\n--KB", "time": "2nd February 2018, 02:29 AM", "postID": "post75415984", "replies": []}]}, {"text": "Because shady chinese crappy apps.\n\n---------- Post added at 07:36 PM ---------- Previous post was at 07:33 PM ----------\n\nLove it or not, but still I don't sleep with the phone next to me tho.", "time": "1st February 2018, 06:36 PM", "postID": "post75412386", "replies": []}]}]}, {"text": "@KB_Thailand This one worked for me when I wanted to figure out which app makes connections to a certain domain:\nNetwork Log by Pragmatic Software https://play.google.com/store/apps/d...ode.networklog", "time": "2nd February 2018, 02:41 AM", "postID": "post75416062", "replies": [{"text": "Thanks for the answer mrslawa.   Evidently you were answering as I was deleting the question.  I am trying out NetGuard and will see how it works out.  I will also try your suggestion.  I just need a lightweight logger that will give me the connections so I can research them if such a thing exists.  NetGuard may be overkill for what I actually am looking for, so I will look at Network Log too.\n\nRegards,\n--KB\n\nEDIT: It appears that Network Log requires root, so it won't work on my stock A1.", "time": "2nd February 2018, 02:54 AM", "postID": "post75416146", "replies": []}]}, {"text": "In love with it. My second wife now. 😂", "time": "2nd February 2018, 12:54 PM", "postID": "post75420673", "replies": []}, {"text": "Don't normally rave about devices but after umming and ahhing for months whether to get this on import or wait for Motorola to fix the camera on the G5 Plus, I finally went for it. Never have I been happier with value for money. Bought it for the camera as my old HTC One M8 (which simply stopped working) had a mediocre camera.  Love it!", "time": "20th February 2018, 02:09 PM", "postID": "post75635070", "replies": []}, {"text": "Completely love it... coming from a Samsung A7 2016... Xiaomi beats the Samsung in every single item but the battery life. Even the camera, by far. Top quality build and premium design, for less than 200 bucks... by far the best value for money I ever had in a phone.", "time": "22nd February 2018, 04:00 AM", "postID": "post75652709", "replies": []}, {"text": "I really like this device.", "time": "28th February 2018, 09:48 PM", "postID": "post75729802", "replies": []}, {"text": "This is my first Xiaomi device and I love it. I considered buying Note 5 Pro instead but coming from a Nexus 5 I realised MIUI isn't my cup of tea. \nXiaomi + Android One is really a good combination. I love its smooth UI, loud speakers and headphone volume and quality. The cameras are great too.\nOverall solid 4 out of 5.", "time": "2nd March 2018, 07:35 AM", "postID": "post75743902", "replies": []}, {"text": "Ayyyyyy 10", "time": "13th March 2018, 12:08 AM", "postID": "post75868637", "replies": []}]}, {"title": "Community development strength", "rating": 4.0, "links": ["https://forum.xda-developers.com/mi-a1/review/community-development-strength-t3679673"], "threads": [{"text": "No kernel source after 4+ month.\nCommunity development will die this way", "time": "24th January 2018, 04:31 PM", "postID": "post75318760", "replies": []}, {"text": "I just found this one. I hope its true!! \nhttps://twitter.com/MiIntrnModSeppe/...83630487146496", "time": "24th January 2018, 08:58 PM", "postID": "post75321259", "replies": []}, {"text": "Appearently the sources have been just released : https://www.androidauthority.com/xia...ndroid-832599/", "time": "31st January 2018, 08:45 PM", "postID": "post75401244", "replies": []}, {"text": "Development is dead. No real progress from the time we did not have sources to the time when we have sources. Sorry mates, I personally do not have knowledge to build roms or kernels myself, else I would ahve contributed. We have a semi functional build of LOS 14.1 and that is all we got.", "time": "17th February 2018, 09:31 AM", "postID": "post75598539", "replies": []}, {"text": "Development pretty much dead i think. Developers shows no interest to develop for the device anymore, this pretty much caused by Xiaomi themselves.", "time": "19th February 2018, 09:24 AM", "postID": "post75621191", "replies": [{"text": "Sadly it looks that way, maybe something will change, redmi note 5 was released last week and already have official twrp and first custom rom.\nBut mi A1 is still a great phone, it will get androdi P and I personally love stock Android.", "time": "19th February 2018, 01:54 PM", "postID": "post75623563", "replies": []}]}]}, {"title": "Overall speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/mi-a1/review/overall-speed-t3679674", "https://forum.xda-developers.com/mi-a1/review/overall-speed-t3679674/page2"], "threads": [{"text": "Just because it's running 625.", "time": "27th September 2017, 06:13 AM", "postID": "post73947690", "replies": []}, {"text": "Yes it is very fast with combination of SD 625 and 4 GB ram.", "time": "27th September 2017, 06:23 AM", "postID": "post73947782", "replies": []}, {"text": "Coming from an Oneplus 5 it's OK. But of course Not near as fast", "time": "20th October 2017, 11:38 PM", "postID": "post74236290", "replies": []}, {"text": "Overall it's very smooth and there are no lags anywhere.\n\nAt the same time it's slower than my almost 4 years old Nexus 5  I know I shouldn't have expected much from SnapDragon 625 but I hoped that it would beat SnapDragon 800. Not really. Singlethreaded performance is quite lower while multithreaded is obviously higher.", "time": "20th November 2017, 10:18 AM", "postID": "post74574656", "replies": []}, {"text": "It is superb.. With few tweaks, 625 merged with stock starts performing at its best..", "time": "28th November 2017, 07:24 AM", "postID": "post74663603", "replies": [{"text": "What tweaks please?", "time": "12th December 2017, 09:02 PM", "postID": "post74826495", "replies": []}]}, {"text": "Can this run assassin's creed identity or galaxy on fire 3?", "time": "2nd December 2017, 10:22 PM", "postID": "post74715986", "replies": []}, {"text": "From body to its camera, this phone is superb. But I've an issue/concern that I'm unable to find file manager to locate files, photos,videos from the phone(like usually other phone has a separate file manager in menu to view). only after downloading few apps for photos, videos and files I'm able to view them.  Please help me with details how to locate those files, photos, songs and videos without those downloaded app.\n\r\nPlease contact: ngullie71@gmail.com", "time": "14th December 2017, 11:06 PM", "postID": "post74849853", "replies": [{"text": "Go to Settings>Storage> (Internal/External) > Files", "time": "6th January 2018, 05:50 AM", "postID": "post75095773", "replies": []}]}, {"text": "Like it so far. Just switched from HTC One X (endeavoru).\n\nAble to play Honkai Impact 3 with recommended settings.\n\nUpdated to December 2017 update. A bit laggy on the keyboard typing at times.", "time": "16th December 2017, 08:05 AM", "postID": "post74863162", "replies": []}, {"text": "as long as there is a little space in the internal storage the phone works fine.........like 10 gigs or more......should that reduce then there is slight lag....almost negligible", "time": "21st December 2017, 06:58 AM", "postID": "post74915362", "replies": []}, {"text": "It is very fast phone, if you use that is a little SD 625 under the hood. But, thanks to great Android One, and regular updates, to take and keep MiA1 smooth.", "time": "1st January 2018, 11:47 PM", "postID": "post75042046", "replies": []}, {"text": "So far so good. It's fun to use this phone. Really liked it.", "time": "6th January 2018, 07:09 AM", "postID": "post75096269", "replies": []}, {"text": "I didn't lagged a single time since i have it. Playing 3D games smooth, rendering desktop version of web pages (my last phone went crazy each time I tried that), multitasking, editing documents, no problems so far. FP scanner speed is good. Camera could load faster but still better than my Samsung.", "time": "22nd February 2018, 04:06 AM", "postID": "post75652734", "replies": []}, {"text": "Oh is good, 8.75/10 from me.", "time": "13th March 2018, 12:08 AM", "postID": "post75868636", "replies": []}, {"text": "It's a 5/10 for me. It's works well enough considering the price of <200$ - but it's nowhere near as smooth as a Galaxy S7 or similar ~2 year old flagship phones. Don't buy this and expect the same performance!", "time": "13th March 2018, 04:50 PM", "postID": "post75876300", "replies": []}, {"text": "It's okay for my use. It helps a lot the stock system.", "time": "13th March 2018, 06:56 PM", "postID": "post75877652", "replies": []}, {"text": "For me this device have good speed for normal daily use. Have no lag at all. 8/10", "time": "15th March 2018, 02:53 AM", "postID": "post75893151", "replies": []}]}, {"title": "App launch speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/mi-a1/review/app-launch-speed-t3679675"], "threads": [{"text": "No complaints for this class of SoC.", "time": "20th November 2017, 10:21 AM", "postID": "post74574685", "replies": []}, {"text": "Fast compared to NOX on my laptop.", "time": "17th December 2017, 11:31 AM", "postID": "post74874464", "replies": []}]}, {"title": "Multitasking/RAM", "rating": 4.5, "links": ["https://forum.xda-developers.com/mi-a1/review/multitasking-ram-t3679676"], "threads": [{"text": "When I run Google play store in background, other apps in foreground starts not responding.", "time": "23rd October 2017, 07:55 AM", "postID": "post74261601", "replies": []}, {"text": "3.5 gigs of RAM are excellent (~0.5 gigs are left for the GPU). What I don't understand is that why this device employs a 512MB swap partition which causes wear and tear of its internal storage. I'm sure as hell this swap partition cannot be disabled without rooting which I'd love to avoid.", "time": "20th November 2017, 10:21 AM", "postID": "post74574676", "replies": []}, {"text": "Actually it is very smooth in terms of multi-tasking", "time": "28th November 2017, 02:26 PM", "postID": "post74667273", "replies": []}, {"text": "is it just me or anyone else experienced the same thing? my recent apps keep restarting even when i got about just 4 or 5 apps opened. i checked the ram usage but it seems normal, it uses about 60-70% of ram. does anyone know whats going on here?", "time": "26th January 2018, 07:18 AM", "postID": "post75336669", "replies": []}, {"text": "What i have observed is, android OS and system, and few other Google apps take up 1.5+ Gigs of RAM. I am not quite satisfied with that...\n\nHowever the performance and multitasking is very good though.", "time": "26th January 2018, 01:01 PM", "postID": "post75339469", "replies": [{"text": "That means that 2,5 gb of ram is unused and wasted.", "time": "26th January 2018, 11:24 PM", "postID": "post75345147", "replies": []}]}]}, {"title": "Scrolling smoothness", "rating": 4.0, "links": ["https://forum.xda-developers.com/mi-a1/review/scrolling-smoothness-t3679677"], "threads": [{"text": "there is a thread about scrolling smoothness. shortly, it does provide terrible experience. see attached video.\nhttps://forum.xda-developers.com/mi-...4#post74315174", "time": "27th October 2017, 04:29 PM", "postID": "post74315320", "replies": [{"text": "Something wrong with firmware, download the latest ROM and reflash with MiFlash without saving data...", "time": "29th October 2017, 02:25 PM", "postID": "post74336455", "replies": [{"text": "@jack21, definitely it looks like something wrong with firmware. I believe if the issue happens not only to me, but to other users as well then it is global issue with firmware which should be fixed from OEM side.", "time": "30th October 2017, 11:16 AM", "postID": "post74345287", "replies": [{"text": "Well, I never encountered that problem with the official firmware.", "time": "30th October 2017, 11:18 AM", "postID": "post74345301", "replies": [{"text": "@jack21 I saw folks are discussing hardware revision differences in other thread, so that means only some specific hardware may be affected by the issue.", "time": "30th October 2017, 01:09 PM", "postID": "post74346214", "replies": []}]}]}]}]}, {"text": "For short lists scrolling is silky smooth however once a list grows beyond 10 pages (e.g. scrolling though Play Store comments) there are perceivable lags.", "time": "20th November 2017, 10:23 AM", "postID": "post74574701", "replies": []}, {"text": "Still not faced this issue. Runninig Android Oreo, Screen manufacturer is EBBG ilitek.", "time": "22nd February 2018, 04:24 AM", "postID": "post75652826", "replies": []}]}, {"title": "Heat", "rating": 5.0, "links": ["https://forum.xda-developers.com/mi-a1/review/heat-t3679678", "https://forum.xda-developers.com/mi-a1/review/heat-t3679678/page2"], "threads": [{"text": "No heating issues", "time": "23rd October 2017, 07:55 AM", "postID": "post74261604", "replies": []}, {"text": "Heating while charging both phone and charger is normal?", "time": "14th November 2017, 03:58 AM", "postID": "post74507467", "replies": []}, {"text": "It's quite relative when you say \"heat\"\n\nAny quantify unit so we on the same page? I'm using GSam Battery Monitor and my range is from 30 celsius to 40 (max). Charging with all apps off from 40% to 80% would bring the heat to 40 celsius, but the heat gradually went down (like 1 to 3 degree less, from 40 celsius) when it's from 80% to 99%\n\nPlaying Hitman Sniper would hit 40 celsius too, but I won't do it while charging.", "time": "17th November 2017, 12:33 PM", "postID": "post74544272", "replies": []}, {"text": "My device never gets even warm.", "time": "20th November 2017, 10:24 AM", "postID": "post74574704", "replies": []}, {"text": "Only lukewarm (hand temperature) while playing 3 different games for an hour.", "time": "17th December 2017, 11:30 AM", "postID": "post74874455", "replies": []}, {"text": "Mine got warm (not HOT) once or twice while surfing web in wifi at max brightness, at sun light in days of +35ºC (95F)... so I assume that was normal :P\r\nRest of the time it seems cool even while charging", "time": "22nd February 2018, 04:14 AM", "postID": "post75652774", "replies": []}]}, {"title": "Low light", "rating": 3.0, "links": ["https://forum.xda-developers.com/mi-a1/review/low-light-t3679679", "https://forum.xda-developers.com/mi-a1/review/low-light-t3679679/page2"], "threads": [{"text": "Low light need Improvement", "time": "28th September 2017, 05:49 AM", "postID": "post73959938", "replies": []}, {"text": "Low light is pretty week. Camera app is slow to capture and subjects need to be dead still to produce a usable picture", "time": "28th September 2017, 07:02 AM", "postID": "post73960437", "replies": []}, {"text": "well overall device is great only weak spot is camera in low light outside in daylight camera performs great but in absence of light there is tons of noise it's like a 3 mp camera image don't know whether a software update can fix that and when mi will provide that or just camera sensor is not capable. i think xiaomi should have asked google to modify camera app also", "time": "28th September 2017, 12:02 PM", "postID": "post73962722", "replies": []}, {"text": "In low light the cam is more or less unusable.", "time": "20th November 2017, 10:31 AM", "postID": "post74574768", "replies": []}, {"text": "Yeah, we know the problem. It is not camera itself issue, it is camera app.", "time": "1st January 2018, 11:48 PM", "postID": "post75042055", "replies": []}, {"text": "Low light performance is just Terrible, no escuses for that.", "time": "2nd January 2018, 12:41 PM", "postID": "post75047289", "replies": []}, {"text": "Low light camera performance is nowhere. Not even low light even in indoor location camera sucks.", "time": "2nd January 2018, 07:46 PM", "postID": "post75052231", "replies": [{"text": "to me its not that bad , use google camera , lowlight photo seems better than stock camera", "time": "25th February 2018, 06:50 AM", "postID": "post75685999", "replies": []}]}, {"text": "Low light photography with the inbuilt Mi-ported camera app is terrible. Pictures clicked had a high amount of noise in manual mode and focusing too was bad. In the HDR mode and with flash, pictures had unrealistic tinge and destroyed the quality. The Portrait Mode works comparatively better however the light entering the photo lens somewhat decreased. \nOverall, the app itself needs improvements. The hardware is more or lese fine.", "time": "3rd January 2018, 06:37 AM", "postID": "post75057070", "replies": []}, {"text": "Hardware camera is good for its price. I compared side to side with my old Samsung A710 (f/1.9 vs f/2.2), and the stock camera APP beats the samsung hands down. In low light, Xiaomi pics are darker but with more details. Samsung night mode makes brighter images, but more blurry and with more noise.\r\nThen, if you root (systemless with magisk works great) and use the ported Google Camera then it's a completely different world... Pics become even brighter and more detailed. Different versions could give smoother images or more detailed but noisier ones, up to your choice.\r\nWe can't compare vs an Iphone or S8 camera ofc... but in its mid-tier range camera is great for everyday usage.\r\nPS. Using Oreo build, never tried Nougat stock cam.", "time": "22nd February 2018, 04:33 AM", "postID": "post75652872", "replies": []}, {"text": "The Mi camera app considered good enough, though I admit the low light photos are terrible. What's more worst is that the HDR image is really bad compared to non-HDR in quality.", "time": "22nd February 2018, 05:26 AM", "postID": "post75653148", "replies": []}, {"text": "sideport with GCam HDR+ whichever version that suit you.. then have fun with it, if you're not satisfied with the result then it is time to use a DSLR with a 50mm 1.4 or the L series 1.2 for those low light moments..", "time": "22nd February 2018, 07:21 AM", "postID": "post75653859", "replies": []}, {"text": "For me, the build is just okay, I'm like holding my OnePlus 3T.", "time": "22nd February 2018, 10:10 AM", "postID": "post75655110", "replies": []}, {"text": "But the front camera is really bad whether it's gcam or stock. Most of the time it produces blurry images.", "time": "26th February 2018, 07:57 AM", "postID": "post75698117", "replies": [{"text": "from my perspective and experience, the front camera with only a 5 MP resolution, using the GCam resulted in a much much better sharp and crisp image.. especially the portrait mode.. (compared to the stock camera app) \n\r\nit goes back to HOW we take our photographs, steady hands and a moment (around 2-3 seconds while it process the picture) and I never took only one shot, I took many shots then pick which is the best, delete others..", "time": "26th February 2018, 02:55 PM", "postID": "post75702070", "replies": [{"text": "During low light i can't have a good group selfie neither from stock nor from gcam. Most of the time it's blurry.", "time": "26th February 2018, 05:03 PM", "postID": "post75703799", "replies": [{"text": "have you tried using the GCam with flash?\nif you have, then there's nothing at the moment an option that I could recommend using \n\nwhile using the GCam, let the auto focus (the circle thing) do it's work untill it dissapear.. then press the shutter", "time": "27th February 2018, 12:52 AM", "postID": "post75708186", "replies": []}]}]}]}, {"text": "I really don't understand. The camera module itself is pretty capable, but the software is putting it back. God I hope G Cam supports dual lens.", "time": "4th March 2018, 02:33 PM", "postID": "post75769347", "replies": []}, {"text": "Is bad, is real bad", "time": "13th March 2018, 12:07 AM", "postID": "post75868629", "replies": []}]}, {"title": "Photo quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/mi-a1/review/photo-quality-t3679680", "https://forum.xda-developers.com/mi-a1/review/photo-quality-t3679680/page2", "https://forum.xda-developers.com/mi-a1/review/photo-quality-t3679680/page3", "https://forum.xda-developers.com/mi-a1/review/photo-quality-t3679680/page12"], "threads": [{"text": "Nice", "time": "28th September 2017, 05:49 AM", "postID": "post73959941", "replies": []}, {"text": "I just got my MI A1 as an upgrade for my 4 years old Nexus 5 daily driver. First impressions in Daylight the MI A1 outperforms the Nexus 5, but in low light the lack of OIS and relatively small 1.25 um pixel size means the A1 struggles a lot. Even getting a sharp focus is slow comparing with my Nexus 6P which has laser autofocus.\n\r\nIn comparison my Nexus 5 has OIS and 1.4 um pixels, and my Nexus 6P has 1.55 um pixels. \n\r\nTaking into account the cost of the MI A1 however, this phone is a tip top performer and I have no compliants for what I paid. Very happy with it.\n\n---------- Post added at 05:56 PM ---------- Previous post was at 05:52 PM ----------\n\nHere are some samples I shot with the MI A1, might post more soon.\n\r\nPhotos have been scaled down by Google Photos app.\n\r\n1. https://photos.app.goo.gl/ZnPCaOmsNQtHaspq2\n\r\n2. https://photos.app.goo.gl/9zBmB58K2wp2JGvl1\n\r\n3. https://photos.app.goo.gl/xluE7J1qFcO27Ols1\n\r\n4. https://photos.app.goo.gl/IwdZ4ybNZMQtvsxq1\n\r\n5. https://photos.app.goo.gl/dPQsGItVW1Cal6nr1\n\r\n6. https://photos.app.goo.gl/Vv4HIUyHw3dwM5Wg1\n\r\n7. https://photos.app.goo.gl/JByd6qk95BiEbriS2\n\r\nUpdate 1: After 1 week with the device now I have to say that although daylight photos turn out great, low light shots are abysmal. Still usable in certain cases but very slow", "time": "28th September 2017, 06:59 AM", "postID": "post73960412", "replies": [{"text": "Bokeh effect is better than moto g5s plus\nLow light is better in moto g5s plus", "time": "1st October 2017, 08:00 PM", "postID": "post74000974", "replies": []}, {"text": "I loved my Nexus 6P camera quality.\nHow far is the Mi A1 camera in good light condictions from the Nexus 6P?\n\nInviato dal mio Redmi Note 4 utilizzando Tapatalk", "time": "7th October 2017, 11:20 AM", "postID": "post74066816", "replies": [{"text": "Disclaimer: I always shoot with HDR+ on my Nexus 6P. \n\nIn good lighting the MI A1 with HDR produces results comparable to the 6P in terms of dynamic range, sharpness and saturation. However, Xiaomi's HDR processing is noticeably not as refined as Google's on the 6P. HDR photos can seem slightly exaggerated on the A1 when you compare it side by side with the same shot taken on the 6P.\nThis isn't noticeable if you judge the photos on their own merit, which are very respectable and will impress you on the first shot almost every time.\n\nIn short I would say that the MI A1 has inspired enough confidence for me to carry it around full time as my daily driver and main camera for weekdays and weekends, but I still bring my 6P out when going on trips/vacations for shooting video (DJI Osmo mobile + Nexus 6P).\n\nHere's an example: \n\nA) Taken with HDR on MI A1 ⬇️\n\nhttps://photos.app.goo.gl/Yg0xG4lqLQHtqh9P2\n\nB) Same shot taken with HDR+ on Nexus 6P⬇️\n\nhttps://photos.app.goo.gl/hWYOsn4klJZ24BSF3\n\n----\nMore samples from the MI A1:\n\n1.  https://photos.app.goo.gl/JB7n7XVSKMahvUfP2\n\n2. https://photos.app.goo.gl/emF4EUgMyrwyrnab2\n\n3.  https://photos.app.goo.gl/5RbQKmCjDxAnJKJs1", "time": "7th October 2017, 03:19 PM", "postID": "post74069124", "replies": []}]}]}, {"text": "Can we take wide angle photos with the dual camera or any other app  ?", "time": "5th October 2017, 08:20 PM", "postID": "post74049013", "replies": []}, {"text": "I have a question about the camera, some people said that HDR picture takes times, about 1 to 2 seconds.\nIs that correct?", "time": "9th October 2017, 04:35 AM", "postID": "post74088572", "replies": [{"text": "Yes, HDR takes about a second", "time": "9th October 2017, 10:49 AM", "postID": "post74091387", "replies": []}]}, {"text": "Hi evryone, I am coming from the Moto G2 XT1068 which was my daily driver for 4 years and using clips lens on the camera and the picture quality was decent .. But I am amazed how the Mi A1 outperforms some of the over-priced same spec smartphones in its range.\r\nI am sharing some of the shots taken from Mi A1 during my Nepal trip.", "time": "9th October 2017, 01:26 PM", "postID": "post74092888", "replies": [{"text": "Yea, no. Those aren't photos taken on your Mi A1. A simple reverse-image search shows you ripped it off 500px - \"Portrait of a Sadhu by Ashraful Arefin\". I'm not allowed to post links but you can find it with a google search.\r\nThe photos were taken on a DSLR, over a year ago.\n\r\nJust why?", "time": "10th October 2017, 03:13 AM", "postID": "post74101130", "replies": []}]}, {"text": "Disappointed, really,i came from mi5 to mi a1.i thought it'll be better since it has dual camera,new software,new features they claiming has better camera compared to oneplus 5 even iPhone 7,but still waaay better on mi5 even with lineage os which is known as downgrading the camera quality.\nFront facing camera is the worst part,ironically i sell my mi5 to get this phone,damn!", "time": "9th October 2017, 06:40 PM", "postID": "post74096830", "replies": []}, {"text": "This is actual footage of portrait mode but when taking photos instantly its quite often resulting blurry pictures", "time": "10th October 2017, 06:03 AM", "postID": "post74102095", "replies": []}, {"text": "Another portrait mode,quite impressive but you need to hold the phone really steady", "time": "10th October 2017, 06:06 AM", "postID": "post74102113", "replies": []}, {"text": "Blurry pictures when taking picture on moving object", "time": "10th October 2017, 06:12 AM", "postID": "post74102141", "replies": []}, {"text": "Outdoor shots are pretty good and HDR does a good job without making the pictures look \"cartoonish\" which is sometimes the case. Once you take it indoors there's a rapid drop-off in quality, I find. Going out to dinner tonight and will try to make some shots in the restaurant to test. \n\nTurning on portrait mode seems to zoom in on the object automatically, which is a bit strange. Anyone else have this?\n\nManual mode is a bit disappointing as the maximum exposure time is 1/60 second, which means if you want a usable low-light shot you still need to bump up the ISO quite a bit. Hope they can fix this in an update.\n\n---------- Post added at 05:01 PM ---------- Previous post was at 04:28 PM ----------\n\nJust tried latest HTC camera from apkmirror (Sept. 28 version) and it shoots MUCH better pictures! Indoors pictures and selfies are MUCH sharper. You get nice depth-of-field shots even without portrait mode and it nicely focuses on items the Mi camera had trouble focusing on.\n\nCamera works fully without root, just install the apk. I highly recommend you give this a try!", "time": "11th October 2017, 04:01 PM", "postID": "post74119139", "replies": [{"text": "I'm trying htc camera on xiaomi Redmi notes 4 waiting for the Mi A1 to arrive but it does not work. I take the picture, but this is not saved in the gallery. Did you just download htc camera or even the gallery?\n\nInviato dal mio Redmi Note 4 utilizzando Tapatalk", "time": "11th October 2017, 05:36 PM", "postID": "post74120563", "replies": [{"text": "Just the camera. Photos open in Google photos without a problem. On some phones you need HTC gallery as well.", "time": "11th October 2017, 08:44 PM", "postID": "post74122665", "replies": []}]}]}, {"text": "I am thinking about buying this phone but I really want a decent camera. How is the focusing? The problem with my Moto Z Play is that is too unreliable. For example, in a forest or tree area, it just cannot focus. Is the Autofocus of the Mi A1 reliable?\n\r\nAlso, you guys that complain about the night shots, do you have the HHT enabled? I read that it can improve the low light shots significantly.", "time": "16th October 2017, 04:20 PM", "postID": "post74180314", "replies": [{"text": "I have no problems with focus, but maybe I'm not as demanding as you are. HHT does indeed make better shots but still you have to be super calm and still to make good shot, otherwise it's blurry.", "time": "17th October 2017, 09:08 AM", "postID": "post74188584", "replies": []}, {"text": "Out of the box, the camera is just OK imho. However, the MI A1 is easy to unlock/root. Then you can enable EIS/Camera2 in the build prop and install the ported Google camera with auto HDR+. After that it's a GREAT camera. Much sharper pics with more details even indoors and in low light conditions. Depth of field shots with blurry backgrounds are much better too and the object in the foreground is much sharper.\n\r\nWith the Google cam installed I'd say this is the best phone out there today. Only bummer is no NFC.", "time": "17th October 2017, 09:57 AM", "postID": "post74189007", "replies": [{"text": "How you will get a depth of field effect with Google Cam ? It is not supporting dual cam AFAIK", "time": "17th October 2017, 11:30 AM", "postID": "post74189779", "replies": [{"text": "Don't know but it works. See attached picture of my beer in my dimly lit kitchen.", "time": "17th October 2017, 05:42 PM", "postID": "post74194126", "replies": [{"text": "Yeah , it looks like a software trick using only the main Cam but it looks nice", "time": "17th October 2017, 05:47 PM", "postID": "post74194200", "replies": []}]}]}]}]}, {"text": "Yes, when you take picture very close to the object it does that. Also you can do similar with lens blur effect.", "time": "17th October 2017, 06:04 PM", "postID": "post74194428", "replies": []}, {"text": "The Google camera port is wonderful, a picture I took of my cat, low light", "time": "18th October 2017, 08:17 PM", "postID": "post74209232", "replies": [{"text": "Is it taken with HDR+ Auto?", "time": "19th October 2017, 10:37 AM", "postID": "post74215796", "replies": [{"text": "HDR+ enabled, not auto, when it chooses off instead of on in auto I get a green half photo in many of the cases, so I just stick with HDR+ on all the time. It works great for 95% of photos, when I need flash or zoom for some reason I just use the stock app, since we can't use the second camera in gcam and flash takes ages using HDR+ and blinds the subject.", "time": "19th October 2017, 11:17 AM", "postID": "post74216122", "replies": []}]}]}, {"text": "Trimis de pe al meu Mi A1 folosind Tapatalk", "time": "4th March 2018, 12:16 PM", "postID": "post75768008", "replies": []}]}, {"title": "Video quality", "rating": 3.5, "links": ["https://forum.xda-developers.com/mi-a1/review/video-quality-t3679681", "https://forum.xda-developers.com/mi-a1/review/video-quality-t3679681/page2"], "threads": [{"text": "Guys, could you please comment on audio quality on videos made with this device. On few video reviews people mentioned that sound is kind of choppy or glitchy. Looks like noise reduction isn't utilized, when Mi A1 shoots video. As workaround they mention that it can be solved by shooting video by a 3rd party app (FV-5). \n\nI'm thinking to buy this device, but this bug is holding me from it.", "time": "10th October 2017, 08:42 AM", "postID": "post74103221", "replies": [{"text": "Yes it is", "time": "11th October 2017, 07:00 AM", "postID": "post74114541", "replies": []}, {"text": "Go to  setting>audio and check the disable Automatic Gain Control. Now record will have stereo audio.", "time": "9th March 2018, 03:18 PM", "postID": "post75828702", "replies": []}]}, {"text": "Take a look here - https://www.youtube.com/watch?v=a8qgfwQwRbI\n\nThen see this example too - https://www.youtube.com/watch?v=6-ncyEPZIds", "time": "29th October 2017, 12:17 PM", "postID": "post74335295", "replies": []}, {"text": "For me, video seems way more pixelated than it should be when zooming, even in 4K. 4x zoom should be 1080p and it doesn't look like it is, and I can't see an option to use the zoom lens either. And 4K isn't selected by default.", "time": "29th October 2017, 06:33 PM", "postID": "post74338935", "replies": [{"text": "Pixelation is algo a problem for me. I think that the video is a little bit dark too.\n\r\nEven using the Google Camera, it's something better but it's not good for me. At least the EIS helps to stabilize the video but the quality is far from good.\n\n\r\nMan, I think the same thing. It's very weird to see the video so pixelated even using Google Camera. Sometimes it really looks like a low resolution video upscaled to a more resolution.", "time": "5th March 2018, 07:24 PM", "postID": "post75784145", "replies": []}]}, {"text": "Considering the lack of EIS and OIS it's not good, but not really bad. Avoid shooting videos in low light - they will be awful and they will have a lot of frames dropped.", "time": "20th November 2017, 10:33 AM", "postID": "post74574784", "replies": []}, {"text": "Without any kind of EIS or OIS, MiA1 is not ideal for video recording.", "time": "4th March 2018, 02:38 PM", "postID": "post75769409", "replies": [{"text": "I tried using the GCam HDR+ with its EIS and to be honest.. I have to really hold the phone as steady as possible and also in walking slowly, the end result is a bit much better than using the camera app by xiaomi..\n\nthe quality overall improved a lot, but for usable footage I guess a dedicated gimbal is needed", "time": "5th March 2018, 02:01 AM", "postID": "post75775275", "replies": []}]}, {"text": "any idea about 60fps ??", "time": "11th March 2018, 05:14 AM", "postID": "post75845867", "replies": []}]}, {"title": "Selfie quality", "rating": 3.5, "links": ["https://forum.xda-developers.com/mi-a1/review/selfie-quality-t3679682"], "threads": [{"text": "I would say selfies are pretty average.", "time": "4th March 2018, 02:36 PM", "postID": "post75769392", "replies": []}, {"text": "selfie with MiA1 using the front camera with xiaomi camera app is mediocre if I may say.. it's far from acceptable in my opinion...\n\nbut, if you use GCam HDR+ at the Portrait Mode that's another level to talk about, the details the vibrant colors the sharpness (especially in low light situation) it's the best for a modest 5 MP camera \nCMIIW", "time": "5th March 2018, 02:38 AM", "postID": "post75775493", "replies": []}, {"text": "If you are ugly, yeah selfies will be crap.", "time": "5th March 2018, 04:04 AM", "postID": "post75775994", "replies": [{"text": "SO HELPING HAHAHA , To me selfie with potrait with google cam is quite impressive (but you need a good lighting tho , or else you will get ugly ass result)", "time": "6th March 2018, 11:48 AM", "postID": "post75791226", "replies": []}]}, {"text": "Well, the point is that is a big abyss between Xiaomi Camera and Google Camera. It's impossible to say that the two pictures came from same sensors and lenses.", "time": "5th March 2018, 07:20 PM", "postID": "post75784092", "replies": []}]}, {"title": "Time to take picture (camera launch speed)", "rating": 4.0, "links": ["https://forum.xda-developers.com/mi-a1/review/time-to-picture-camera-launch-speed-t3679683"], "threads": []}, {"title": "Software (ease of use, features, etc)", "rating": 4.5, "links": ["https://forum.xda-developers.com/mi-a1/review/software-ease-features-t3679684"], "threads": [{"text": "Pretty good but EIS is needed.", "time": "27th September 2017, 06:13 AM", "postID": "post73947693", "replies": []}, {"text": "Hi, \n\r\nI noticed that the camera angle on the xiaomi a1 is a bit off. I use Open Camera. When putting it on level surface the angle is off by about 1.3° to the right.\r\nAnyone else having this issue?", "time": "25th October 2017, 10:04 AM", "postID": "post74287582", "replies": []}, {"text": "Can anyone find where to set resolution of photos in camera? I can find only in video mode (4K, Full HD, ...). Can't find in photo mode", "time": "2nd November 2017, 05:19 AM", "postID": "post74376663", "replies": [{"text": "I tried the calibrating the gyroscope using  *#*#4636#*#* codes.\r\nIt manage to reduce the angle to 0.6\n\n---------- Post added at 04:44 AM ---------- Previous post was at 04:24 AM ----------\n\n\n\r\nThe standard app does not have the resolution , but if you install Open Camera you can see in the settings option.", "time": "2nd November 2017, 05:44 AM", "postID": "post74376686", "replies": []}]}]}, {"title": "Charging speed", "rating": 4.5, "links": ["https://forum.xda-developers.com/mi-a1/review/charging-speed-t3679685", "https://forum.xda-developers.com/mi-a1/review/charging-speed-t3679685/page2"], "threads": [{"text": "So does it or it does not support fast charge?", "time": "2nd November 2017, 01:25 AM", "postID": "post74375298", "replies": []}, {"text": "M1 A1 has no fast/quick charge, anyway, charging duration is acceptably quick with Xiaomi power adapter 5V -> 2A charger.", "time": "2nd November 2017, 04:09 AM", "postID": "post74376302", "replies": []}, {"text": "for me about 2h", "time": "3rd November 2017, 02:15 PM", "postID": "post74392770", "replies": []}, {"text": "2hours charging time", "time": "3rd November 2017, 07:00 PM", "postID": "post74395777", "replies": []}, {"text": "IMHO, To extend battery life, I can live with slower charger. The xiaomi 5v 2amp charger is consider too fast for me\nI usually use 5v 1 amp for normal charging. It takes about 3hour to charge\n\nI only use 5v 2amp if I need to be fast. I usually don't fully charge with it thus not sure about charging time", "time": "4th November 2017, 10:24 AM", "postID": "post74401656", "replies": []}, {"text": "Less Than 2 hrs", "time": "4th November 2017, 02:08 PM", "postID": "post74403407", "replies": []}, {"text": "Near than 2 hours", "time": "26th November 2017, 09:22 AM", "postID": "post74640439", "replies": []}, {"text": "Screenshot from AccuBattery.", "time": "17th December 2017, 08:10 AM", "postID": "post74873017", "replies": []}, {"text": "Charging Speed with Android Oreo", "time": "18th January 2018, 01:37 PM", "postID": "post75244822", "replies": []}, {"text": "Yes it support Quick Charge, but you need Charger that support Quick Charge 3.0.\r\nRead this article.\nhttps://gadgets.ndtv.com/mobiles/new...-price-1798946", "time": "20th January 2018, 02:56 AM", "postID": "post75264470", "replies": []}, {"text": "More than 1:30 hours. Not fast, but not terrible bad. \r\nFast charge working with 2A, but it miss the QucikCharge 3.0 (sw disabled, but the chipset is cappable to)", "time": "22nd February 2018, 04:45 AM", "postID": "post75652943", "replies": []}, {"text": "Hello,\r\nI have a quick charge charger and my xiami mi a1 64gb global doesn't support quick charge it's the same with one plus 5t charger and s8 charger. So don't trust gadget it's not because xiaomi provide a new charger that the mi a1 is now compatible. Also even with the 5v 2a xiaomi charger, the MIA1 charges more quickly with Oreo that's it.", "time": "26th February 2018, 04:28 PM", "postID": "post75703367", "replies": []}]}, {"title": "Screen on time", "rating": 4.5, "links": ["https://forum.xda-developers.com/mi-a1/review/screen-time-t3679686", "https://forum.xda-developers.com/mi-a1/review/screen-time-t3679686/page2", "https://forum.xda-developers.com/mi-a1/review/screen-time-t3679686/page3", "https://forum.xda-developers.com/mi-a1/review/screen-time-t3679686/page14"], "threads": [{"text": "Good. I'm getting a consistent 6hrs+ SOT on average usage.", "time": "27th September 2017, 06:14 AM", "postID": "post73947700", "replies": []}, {"text": "Battery life is excellent getting 6hrs+ sot with jio network and 64 GB card. Really impressed with 3080 mAh battery.", "time": "27th September 2017, 06:22 AM", "postID": "post73947768", "replies": []}, {"text": "6hr+ sot with 18 to 25hr of standby and with 2hr + voice", "time": "27th September 2017, 07:37 AM", "postID": "post73948322", "replies": []}, {"text": "First discharge cycle \n1 hr of voice calling apart from the screen on time", "time": "5th October 2017, 06:53 PM", "postID": "post74048095", "replies": []}, {"text": "6 hrs with heavy use , also got 7 and 8 few times without much of standby ! On wifi even more", "time": "6th October 2017, 07:00 AM", "postID": "post74053113", "replies": []}, {"text": "Yeah easy 6-7 hours SOT which is plenty for me", "time": "6th October 2017, 03:19 PM", "postID": "post74057502", "replies": []}, {"text": "A picture is worth a thousand words", "time": "9th October 2017, 12:38 AM", "postID": "post74087130", "replies": []}, {"text": "Around 5 hour SOT and 52% battery remaining. Data on airtel 4g all time and around one hour on hotspot. The network strength is also poor.fully satisfied with battery life", "time": "11th October 2017, 04:01 PM", "postID": "post74119490", "replies": []}, {"text": "6 hours sot on an average with 12-13 hours on standby", "time": "18th October 2017, 06:08 AM", "postID": "post74200275", "replies": []}, {"text": "How the hell are you guys getting 6_8 sot with medium even heavy use... I nearly get 3.5h with light to medium use... No power saver all on like wifi 4g etc. 1 sim.", "time": "22nd October 2017, 07:03 PM", "postID": "post74256211", "replies": [{"text": "Hey mate drain your battery until your phone shuts off then charge it fully and that should help", "time": "22nd October 2017, 07:17 PM", "postID": "post74256352", "replies": []}, {"text": "yes we get it. Just check this..", "time": "24th October 2017, 03:16 AM", "postID": "post74272442", "replies": []}, {"text": "Me Too. Did u find a fix?", "time": "28th October 2017, 06:47 PM", "postID": "post74328387", "replies": []}]}, {"text": "It is very damaging to the battery what you are suggesting ...", "time": "22nd October 2017, 09:00 PM", "postID": "post74257441", "replies": [{"text": "Really, I never knew that. Why does it damage it?", "time": "22nd October 2017, 09:03 PM", "postID": "post74257466", "replies": []}, {"text": "Totally nonsense.\n\nBtw check your apps, some app is badly misbehaving and it drains your battery.", "time": "23rd October 2017, 11:42 AM", "postID": "post74263408", "replies": []}]}, {"text": "I don't know why but some one who knew his way around batteries told me is damaging and that a phone is good to charge in small intervals and not from 0-100. More like from 10-90", "time": "22nd October 2017, 09:27 PM", "postID": "post74257688", "replies": [{"text": "I heard the same thing but I've also heard that doing it once in a while can calibrate/condition the battery", "time": "22nd October 2017, 10:06 PM", "postID": "post74257996", "replies": []}]}, {"text": "It is not really, I am using only Google apps, Twitter and Reddit, and everything in the battery manager is behaving totally normal.", "time": "23rd October 2017, 11:54 AM", "postID": "post74263538", "replies": [{"text": "Well I guess that you can try to reflash the ROM with preserving data, wait couple of days and see if it gets better.\n\nOr your signal reception is very bad.", "time": "23rd October 2017, 06:32 PM", "postID": "post74267966", "replies": []}]}, {"text": "Minimum 6 hours SOT. Super standby time. Love the phone.", "time": "24th October 2017, 02:54 PM", "postID": "post74277922", "replies": []}, {"text": "At 10% 6.5 hours SoT with heavy usage...... It's really good", "time": "25th October 2017, 07:04 PM", "postID": "post74293047", "replies": []}, {"text": "the last time I tried until the battery drop to around 23% it was around 5+ hours of screen time.. for me (at the moment) it is awesome.. compared to my previous mobile Mi4i with around the same battery capacity", "time": "26th October 2017, 04:17 AM", "postID": "post74297197", "replies": []}, {"text": "Mi A1 is worth buying, as I feel from the battery life. Any suggestions?", "time": "26th October 2017, 03:03 PM", "postID": "post74302289", "replies": []}, {"text": "Anyone notice that the first 10% from 100% fully charged drop faster? When I unplugged and stay idle, it will drop to 97% within an hour. \n\nEveryone that claimed that more than 6 hours SOT, is your GPS and GPS related app on all the time with mobile data on?", "time": "28th October 2017, 02:31 AM", "postID": "post74320337", "replies": []}, {"text": "Don't use crappy facebook apps, don't put display brightness on max, use location only when you need it, and there you go.", "time": "28th October 2017, 09:46 PM", "postID": "post74329922", "replies": [{"text": "I don't even have Facebook account. My brightness in on mid always, the only thing I use is the location services.", "time": "30th October 2017, 01:23 AM", "postID": "post74342004", "replies": []}]}, {"text": "I'm getting this crap sot on moderate usage", "time": "29th October 2017, 10:19 AM", "postID": "post74334433", "replies": [{"text": "I think there was a issue with the October update mate, did you get the 118mb one?", "time": "31st October 2017, 08:23 PM", "postID": "post74362044", "replies": []}]}, {"text": "10 hours of screen on time with 10% battery left. Heavy usage with a spotty 4G network signal (my carrier's fault) and I'm using battery-hogging apps like Facebook, Messenger and some games. \n\nNot bad eh? From 95% charge to 10%, the battery lasted me the whole day.\n\nI'd have to report that bug about charging though, haven't charged at all but I had restarted the phone once due to the Nova launcher beta build that kept on restarting.", "time": "31st October 2017, 08:01 PM", "postID": "post74361818", "replies": []}, {"text": "Yesterday, I had 6h 52m SOT Time, playing 3D games and watching videos. WiFi turned on the whole day, Dual SIM with 4g enabled, location services on... It's a pretty solid number for its battery setup.", "time": "23rd February 2018, 03:08 PM", "postID": "post75668613", "replies": []}, {"text": "5.5 to 6.5 hours of SOT from my usage.", "time": "2nd March 2018, 07:39 AM", "postID": "post75743933", "replies": []}]}, {"title": "Standby drain", "rating": 4.5, "links": ["https://forum.xda-developers.com/mi-a1/review/standby-drain-t3679687", "https://forum.xda-developers.com/mi-a1/review/standby-drain-t3679687/page2", "https://forum.xda-developers.com/mi-a1/review/standby-drain-t3679687/page3"], "threads": [{"text": "My mi a1s battery is draining very fast. My phone was on airplane mode for one hour and the battery was 75% after one hour it was 58%. Why is it draining so fast on standby", "time": "1st November 2017, 07:35 PM", "postID": "post74372187", "replies": [{"text": "I am also facing same issue.Kindly suggest some technical solutions.", "time": "1st January 2018, 04:45 PM", "postID": "post75038306", "replies": [{"text": "Have you already updated to Oreo?", "time": "2nd January 2018, 07:23 AM", "postID": "post75044698", "replies": []}]}]}, {"text": "Anyone experience doze not working after the latest Oct 30 OTA update?   My phone now is 100% awake and has 0% deep sleep (according to BetterBatteryStats v2.2.2). TIA.", "time": "7th November 2017, 01:09 AM", "postID": "post74430861", "replies": []}, {"text": "My MI A1 drain about 1% during the night, with wifi on.\nI'm rooted and unlocked. i try greenify (donation) with root and xposed functions activated but it drains much more..", "time": "7th November 2017, 08:32 AM", "postID": "post74433436", "replies": [{"text": "Are you on the latest Oct 30 build?  The overnight drain used to be much less when it was on the previous Oct 14 build.  Thanks!", "time": "7th November 2017, 10:02 AM", "postID": "post74434081", "replies": []}, {"text": "1-3% during night is normal, what's the issue here?I get up to 1 to 2% with my 4 year old nexus 7,and the old bastard isn't even rooted anymore, it's stock now.", "time": "11th November 2017, 11:59 PM", "postID": "post74483873", "replies": []}]}, {"text": "New october patch", "time": "7th November 2017, 11:35 AM", "postID": "post74434852", "replies": []}, {"text": "Same issue here", "time": "11th November 2017, 05:37 AM", "postID": "post74475642", "replies": []}, {"text": "Same issue", "time": "11th November 2017, 11:25 PM", "postID": "post74483672", "replies": []}, {"text": "yeah im not getting deep doze anymore and android system is draining more battery than everything else", "time": "12th November 2017, 08:10 AM", "postID": "post74486579", "replies": []}, {"text": "Hey guys have any of you with the battery drain issue tried a full wipe by restoring to factory settings to see it that helps?", "time": "12th November 2017, 12:33 PM", "postID": "post74488627", "replies": []}, {"text": "Hey guys I turned off system ui settings and it seems to have helped a lot", "time": "13th November 2017, 03:01 PM", "postID": "post74500905", "replies": [{"text": "Hi, do you mean you turned off system UI tuner in the Settings?", "time": "14th November 2017, 12:37 AM", "postID": "post74506378", "replies": [{"text": "yep mate i got 3 hours of SOT yester day and i got down to 52% which is a huge improvement", "time": "14th November 2017, 08:20 AM", "postID": "post74509023", "replies": []}]}]}, {"text": "Hi, I also have battery drain issue. \r\nMy Mi A1  has the october patch installed, I received a week ago. \r\nWith a full charge cant have more than 3 hours of SOT until the battery completly discharges.  I  use to whatsapp and some 4G internet navigation. \r\nI have turned off the system UI tuner. \r\nI restored the phone to factory one time without a full wipe, only I restored to factory from android menu. (Sorry but, what means a full wipe? To wipe cache partition and wipe dalvik cache from recovery?)\r\nI see that I´m not the unique with battery drain issue, has someone solved this issue? \r\nDo you think that with december patch or with the arrive of Android Oreo this problem could be solved?", "time": "15th November 2017, 09:28 AM", "postID": "post74520938", "replies": []}, {"text": "For those who get 1-3% drain overnight, do you guys turn off network and wifi?", "time": "16th November 2017, 04:37 AM", "postID": "post74530240", "replies": []}, {"text": "Wastes 3% for 8 hours at night which is horrible. Cellular data off, GPS off, and only one app which polls the Internet (K-9 Mail).", "time": "20th November 2017, 10:35 AM", "postID": "post74574801", "replies": []}, {"text": "It's amazing", "time": "5th December 2017, 07:42 AM", "postID": "post74740766", "replies": []}, {"text": "Not a drop in percentage while I'm asleep with airplane mode on.", "time": "17th December 2017, 11:40 AM", "postID": "post74874530", "replies": []}, {"text": "same issue here after oreo update", "time": "2nd January 2018, 08:23 PM", "postID": "post75052633", "replies": []}, {"text": "Also have problem after Oreo update.", "time": "2nd January 2018, 08:47 PM", "postID": "post75052868", "replies": []}, {"text": "High consumption with RCS Service, around 8%, as Screen consumption (9%)", "time": "2nd January 2018, 09:41 PM", "postID": "post75053345", "replies": []}, {"text": "Yeah android system still draining lots of power for no apparent reason so oreo didn't fix that yet", "time": "3rd January 2018, 12:05 PM", "postID": "post75059862", "replies": []}, {"text": "I am at 53% and have 2h2m SOT, that is ridiculous!", "time": "3rd January 2018, 05:22 PM", "postID": "post75063532", "replies": []}, {"text": "Hi, another a1 user with poor battery performance. I lost like 10% overnight.\nI did factory reset, cleaned memory of RCSService and plenty of other apps, turned off UI settings... \nWhat else I can do?\n\nAlso, RCSService is still draining my battery, it used about 16%...", "time": "4th January 2018, 02:20 PM", "postID": "post75074337", "replies": []}, {"text": "Before Oreo update i had 6h+ SoT, now after 8.0 update i have 2,5h and already 36% battery. Now i regret", "time": "4th January 2018, 04:49 PM", "postID": "post75076139", "replies": [{"text": "Same here", "time": "8th January 2018, 01:52 PM", "postID": "post75123987", "replies": []}]}]}, {"title": "Heavy use endurance", "rating": 4.0, "links": ["https://forum.xda-developers.com/mi-a1/review/heavy-endurance-t3679688", "https://forum.xda-developers.com/mi-a1/review/heavy-endurance-t3679688/page2", "https://forum.xda-developers.com/mi-a1/review/heavy-endurance-t3679688/page3"], "threads": [{"text": "Well i don't really play candy crush, but i do like playing games over ppsspp, along with some critical ops, into the dead 2, etc. And I'm almost always using facebook or instagram or chrome. Even today, I've been continuously gaming. I'm at 28% and SOT is over 7 hours.\nEven when I'm not continuously playing games, i still get a full day with heavy use.", "time": "25th November 2017, 08:17 AM", "postID": "post74628815", "replies": [{"text": "What?? Really? Are u joking , like , everyone Is getting just 3.5 to 4 hours of sot by casually using this device.How 7 hrs? Screenshots?", "time": "25th November 2017, 07:12 PM", "postID": "post74634834", "replies": [{"text": "Everyone? I get 6 - almost 7 SOT  no games tho but still-- 3.5hrs for a 3080mah battery is really low to being with.", "time": "25th November 2017, 07:36 PM", "postID": "post74635037", "replies": [{"text": "I need to get my device replaced then.I confirmed fee users and they said they are getting 3-4 hrs", "time": "26th November 2017, 02:29 AM", "postID": "post74637814", "replies": []}]}, {"text": "How can you speak for everyone? \n\nI easily get 7 ours of SOT here.", "time": "25th November 2017, 08:30 PM", "postID": "post74635510", "replies": []}, {"text": "Certainly. Btw, the November patch improved battery life. Day before yesterday i had 9h of sot with 25% still left. But yeah, use wasn't that heavy but still above moderate. I usually play critical ops and some ppsspp games.", "time": "28th November 2017, 02:20 PM", "postID": "post74667202", "replies": [{"text": "In my experience ppsspp games are quite demanding so it´s great to hear that A1 handles it well.  I am going to pick it up for christmas so I am very excited.", "time": "7th December 2017, 07:29 PM", "postID": "post74769550", "replies": []}]}, {"text": "6.45 hours with 8% left", "time": "31st December 2017, 06:38 AM", "postID": "post75022589", "replies": []}]}]}, {"text": "Is it possible or just a joke for this year ? Mine lost only for 3.5 hours", "time": "26th November 2017, 09:18 AM", "postID": "post74640411", "replies": []}, {"text": "Since people are not satisfied if they don't see proof, here two screenshots.\n\nRegards 🤗", "time": "26th November 2017, 09:27 AM", "postID": "post74640493", "replies": []}, {"text": "I have been easily getting 6-7 hours of SOT with heavy usage and 8 hours of SOT with moderate usage. can easily go for two days with low usage. the endurance is absolutely fantastic. that too for measly 3080mah. screenshot:", "time": "28th November 2017, 06:35 AM", "postID": "post74663253", "replies": []}, {"text": "hey guys can you check what lcd screen you have because lots of people have great battery and others have terrible and i think the different lcd panels might be to bame", "time": "28th November 2017, 03:51 PM", "postID": "post74668204", "replies": []}, {"text": "6.30 SOT in 4 Days", "time": "28th November 2017, 08:44 PM", "postID": "post74671470", "replies": [{"text": "Where you bought phone?", "time": "28th November 2017, 09:16 PM", "postID": "post74671765", "replies": [{"text": "Gearbest on 8 September, received 28 october.\r\nScreenshot were made without november update...\n\r\nNow is difficult reach 6.30 in 2 days", "time": "28th November 2017, 09:21 PM", "postID": "post74671821", "replies": []}]}]}, {"text": "I don't play games, just lots of web surfing and other app usage, and I usually have 4-5 hrs SOT while using about 50% battery.   This is with the Nov update.  LTE data always enabled.", "time": "29th November 2017, 11:20 AM", "postID": "post74677424", "replies": []}, {"text": "I watch a lot of YouTube videos and surf a lot. Everyday 9-10hrs screen on time (that is if I wait till battery depletes to 0). Battery life is phenomenal.", "time": "6th December 2017, 03:21 AM", "postID": "post74750487", "replies": []}, {"text": "I can't reach more than 4 hours... maybe you guys only use it for reading ebooks? XD", "time": "6th December 2017, 07:43 AM", "postID": "post74752108", "replies": []}, {"text": "battery life depends on screen brightness also.\r\nthere are many things which can effect battery life like,\r\nno. of apps installed, screen brightness, wifi scanning always available ON/OFF etc.\n\r\ni have one A1 (rose gold) which is used by my wife, is made in india. and she is getting good battery backup. \r\ni am going to recieve mine (black) on this sunday, will compare both after that and post here.\n\r\n(comparing both will be a good idea as rose gold is made in india and black should be made in china)", "time": "7th December 2017, 09:54 AM", "postID": "post74764226", "replies": []}, {"text": "thankfully, I don't play games on my phone(s)\r\njust a casual browsing", "time": "8th December 2017, 12:22 AM", "postID": "post74771580", "replies": []}, {"text": "I just got my phone delivered 1 day back.(Matt Black Colour) \r\nDid all the updates & am getting pathetic battery life. Charging it twice a day.\r\nNetwork issue - keeps switching 4G off or keeps going to 3G.\n\r\nFinally after searching i tried *#*#4636#*#* & changes the bank to LTE/WCDMA -- Now let me see how it lasts with this band.\r\nI hope they come out with a good stable update for this phone, i feel like throwing it with the bloody battery drain.\n\r\nMy usage : No Games, No Youtube...  only calls, a lot of whats app, email (6 email accounts), light social media, browsing.\r\nSame usage with the MI Note 4 (4gb variant) used to be awesome. At the end of the day i used to still be at 30%", "time": "17th December 2017, 08:17 AM", "postID": "post74873063", "replies": []}, {"text": "After going into special menu by typing : *#*#4636#*#*, i first tried :\nLTE/WCDMA mode.... battery imporved by about 25 to 30%\nthen i moved it to LTE/TD-SCDMA/WCDMA mode & its way way better now... in this i can say i can get SOT of approx 10hrs or more... still trying it \n\nanyone  has any similar issues / comparision.\n\nThis BAND issue is really causing a problem with this phone.\nI tried Putting it on LTE ONLY... battery life was consistantly good, but no one could call me.. whenever someone called me, they got a busy signal.\n\nNow, this phones really getting irritating", "time": "17th December 2017, 01:45 PM", "postID": "post74875585", "replies": [{"text": "Your post reminded me to check my settings too, my phone was getting up to 3g signal, changed it, restarted and now i gets 4g. I hope that helps with the SOT too", "time": "31st December 2017, 04:54 PM", "postID": "post75028342", "replies": []}]}, {"text": "Battery seems to drain very quickly when doing video calls (like almost up to 20% in an hour). Otherwise the endurance is good.", "time": "19th December 2017, 10:10 AM", "postID": "post74894891", "replies": []}, {"text": "I've updated to December patch as soon as I got my phone (4 days ago). I'm getting 5-6 OST. \n\nUsage - whatsapp, browsing, Youtube (around 2-3 hours of it :P) Dual sim, LTE always enabled (*inhales* Jio). I think I'll install greenify and see if it improves things.", "time": "20th December 2017, 07:30 AM", "postID": "post74904844", "replies": []}, {"text": "lasts an entire day while the my Jio net is on.........\r\nP.S i haven't put any second sim or any sd card......", "time": "21st December 2017, 07:00 AM", "postID": "post74915374", "replies": []}, {"text": "Oreo, Jan patch.\r\nOne day I played near 5 hours of Xcom EW before the 15% warning\r\nIt's good enough for a little 3000 lithium Polymer battery", "time": "22nd February 2018, 05:05 AM", "postID": "post75653047", "replies": []}, {"text": "Around 12 to 24h (with 8h of sleep so at least 5-6h of doze) heavy use (no games bit a lot of gps, pics, facebook)... around 48h on low to none use. Have a bear minimum of apps that suits me and also aways go and inactivate apps(from developer) that I won't use but want to keep at hand.\r\nMost of the times the battery draining comes from certain apps (however it doesn't show in the battery management).\r\nBest way to measure it is to have clean install without apps for several days and see how the battery acts, then install one by one or in batches of several and after each install wait a few days and measure battery i bet that on the 90% of the cases it will be some fu**** up app that is causing the battery drain.", "time": "22nd February 2018, 08:46 AM", "postID": "post75654465", "replies": []}]}, {"title": "Light use endurance", "rating": 5.0, "links": ["https://forum.xda-developers.com/mi-a1/review/light-endurance-t3679689"], "threads": [{"text": "Enough for 8 hours of SOT and 48 hours of usage. Could be much better though.", "time": "20th November 2017, 10:36 AM", "postID": "post74574804", "replies": []}, {"text": "I'll get two days with light use. Short phone calls, some social media use, and Youtube while on the can. Even with heavy use (meaning lots of web browsing)...I'll still get more than 24 hours from the battery.", "time": "21st November 2017, 12:15 AM", "postID": "post74582247", "replies": []}, {"text": "I get about 6 - 7 hours of SoT.  Which easily gets me through 2 days.", "time": "24th November 2017, 06:56 PM", "postID": "post74623797", "replies": []}, {"text": "I give this phone an \"A1\" for light use if you know what I mean...( ͡° ͜ʖ ͡°)\n\nokay I'll help myself with the door", "time": "4th March 2018, 02:47 PM", "postID": "post75769528", "replies": []}, {"text": "4 days, 1.5 hrs charging OOTB FeelsGoodMan", "time": "13th March 2018, 12:06 AM", "postID": "post75868623", "replies": []}]}, {"title": "\"Look\" of the device (aesthetics)", "rating": 4.5, "links": ["https://forum.xda-developers.com/mi-a1/review/look-device-aesthetics-t3679690"], "threads": [{"text": "Not 18:9", "time": "11th January 2018, 10:20 AM", "postID": "post75158413", "replies": []}, {"text": "It looks like a iPhone 7 plus clone.Otherwise I would have said it looks pretty good.", "time": "14th January 2018, 04:27 AM", "postID": "post75190667", "replies": []}, {"text": "I have the white/gold and it looks good apart from the white bezels at the long edges of the screen. Wish they had done it like on my Leeco: Made them black. The top and bottom white areas are fine though.", "time": "14th January 2018, 10:01 AM", "postID": "post75192804", "replies": []}, {"text": "The antenna lines are getting faded and bleached, even after using a case. Apart from that, it fine.", "time": "4th March 2018, 02:41 PM", "postID": "post75769461", "replies": []}]}, {"title": "Quality feel (use of materials)", "rating": 5.0, "links": ["https://forum.xda-developers.com/mi-a1/review/quality-feel-materials-t3679691"], "threads": [{"text": "From the moment I picked the phone out of the box I was amazed how nice the phone feels. My mom has iPhone 7 and built quality is really very impressive. Back of the phone feels very premium and nicely built. After 2 weeks of use there are barely any scratches, I wear rings so I thought it would get scratches all over it but no. It's still like new. Front of the phone also looks very stylish and screen holds pretty well also no scratches yet. Impressive for the price!", "time": "30th October 2017, 10:11 AM", "postID": "post74344804", "replies": []}, {"text": "It feels like a premium device. Build quality is great.", "time": "22nd February 2018, 05:07 AM", "postID": "post75653059", "replies": []}, {"text": "Very slippery", "time": "26th February 2018, 10:10 PM", "postID": "post75707144", "replies": []}, {"text": "too slipery for me.. then I put it in a rubber case, problem solved", "time": "27th February 2018, 08:25 AM", "postID": "post75710982", "replies": []}, {"text": "10/10 for looks. 8/10 for build quality. Even though I agree the screen is pretty tough for a budget smartphone, the thickness of the metal body is not that satisfactory. Maybe I feel this way because i have used Moto G5s for some time. But other than that, the phone is pretty solid. \nBtw, some users have said that the lens piece is prone to break on minor drops. Not sure how much of it is true.", "time": "4th March 2018, 02:28 PM", "postID": "post75769296", "replies": []}]}, {"title": "Ergonomics (in-hand feel)", "rating": 4.0, "links": ["https://forum.xda-developers.com/mi-a1/review/ergonomics-hand-feel-t3679692"], "threads": [{"text": "Slippery.\n\nAlmost slip twice in a day.\n\nNeed a good plastic back cover.", "time": "17th December 2017, 11:33 AM", "postID": "post74874477", "replies": []}]}, {"title": "OEM skin/software", "rating": 4.0, "links": ["https://forum.xda-developers.com/mi-a1/review/oem-skin-software-t3679693"], "threads": [{"text": "Missing some features like lift to check phone, night light, double tap to wake. Google phone is also not supported on play store which is weird.", "time": "30th September 2017, 11:50 AM", "postID": "post73985127", "replies": [{"text": "My device shows certified in play store!", "time": "3rd October 2017, 05:49 AM", "postID": "post74016674", "replies": []}, {"text": "thats very annoying\r\ni m not a programer..", "time": "11th October 2017, 12:38 PM", "postID": "post74117357", "replies": []}, {"text": "Give it some time until Lineage or other Custom ROMs are released.\n\n\n\r\nI even unlocked the bootloader and rooted the device and it still shows as certified in Google Play Store app, no such problems on my side.", "time": "12th October 2017, 09:07 AM", "postID": "post74127809", "replies": []}]}, {"text": "Pinch to zoom is not smooth", "time": "9th October 2017, 07:27 PM", "postID": "post74097395", "replies": []}, {"text": "October security patch is here", "time": "18th October 2017, 08:38 AM", "postID": "post74201488", "replies": []}, {"text": "Updating October patch", "time": "18th October 2017, 08:58 AM", "postID": "post74201665", "replies": []}, {"text": "Even though it's pure Android I cannot give it more than 3* because Google doesn't want to implement theming in stock Android and by default everything is too whitish and bright. I would love to get Android 4.4 blacks where notification and settings were all white text on black background.", "time": "20th November 2017, 10:42 AM", "postID": "post74574858", "replies": [{"text": "+1 \r\nI would love that!", "time": "20th November 2017, 04:00 PM", "postID": "post74577854", "replies": []}]}]}, {"title": "Outdoor visibility (max brightness)", "rating": 4.5, "links": ["https://forum.xda-developers.com/mi-a1/review/outdoor-visibility-max-brightness-t3679694"], "threads": []}, {"title": "Contrast (true blacks)", "rating": 4.5, "links": ["https://forum.xda-developers.com/mi-a1/review/contrast-true-blacks-t3679695"], "threads": [{"text": "I will rate contrast only as 4 because ... OLED  You really have no right to rate IPS panels anything above 4 stars by definition.", "time": "20th November 2017, 10:40 AM", "postID": "post74574840", "replies": []}, {"text": "While not as good as oled, I'll say that the A1 has a good contrast. I've enabled software keys on mine and there's very little different of blacks between the software keys and the bottom chin of the phone. Even in low light environments. Called me impressed.", "time": "20th November 2017, 10:56 AM", "postID": "post74574969", "replies": []}, {"text": "A1's black is worse than my previous Nexus 5X's black, which is also IPS", "time": "20th November 2017, 12:01 PM", "postID": "post74575475", "replies": []}, {"text": "I had 4 Mi A1 in my hands and 4 total different displays. 2 Takaii, 2 Focal.\n1 Focal is brilliant white and superb contrast. 1 Focal is good, good contrast and white is little bit yellowish.\nTakaii is pure bullshit. You will feel sad having a takaii and seeing a focal. No contrast, totally yellowish and one also greenish.\n\nSo this thread means nothing without telling which lcd manifacturer...", "time": "22nd November 2017, 01:11 PM", "postID": "post74598947", "replies": [{"text": "I thought Mi A1 only had either tianma or ilitek displays. I have never heard of takaii or focal displays.", "time": "22nd November 2017, 01:34 PM", "postID": "post74599180", "replies": []}, {"text": "Please remind us how this can be checked/seen?", "time": "24th November 2017, 07:50 AM", "postID": "post74618160", "replies": []}]}]}, {"title": "Color saturation & accuracy", "rating": 3.5, "links": ["https://forum.xda-developers.com/mi-a1/review/color-saturation-accuracy-t3679696"], "threads": []}, {"title": "Clarity/resolution", "rating": 5.0, "links": ["https://forum.xda-developers.com/mi-a1/review/clarity-resolution-t3679697"], "threads": []}, {"title": "Minimum brightness", "rating": 5.0, "links": ["https://forum.xda-developers.com/mi-a1/review/minimum-brightness-t3679698"], "threads": [{"text": "Excellent minimum brightness (for an IPS panel) - I actually was afraid it would be too bright but, no, everything is OK. You might want to use some software dimmer though.", "time": "20th November 2017, 10:37 AM", "postID": "post74574813", "replies": []}, {"text": "Setting it to the lowest looks more of night screen to me.\n\nKeeping it almost at the lowest as my daily due to low light level environment in my house.", "time": "17th December 2017, 11:28 AM", "postID": "post74874443", "replies": []}]}, {"title": "Call quality", "rating": 4.0, "links": ["https://forum.xda-developers.com/mi-a1/review/call-quality-t3679699", "https://forum.xda-developers.com/mi-a1/review/call-quality-t3679699/page2"], "threads": [{"text": "Call quality is good enough...", "time": "26th September 2017, 08:50 PM", "postID": "post73943903", "replies": []}, {"text": "Calls on the other side sound muddled and not very clear", "time": "16th October 2017, 06:04 PM", "postID": "post74181678", "replies": []}, {"text": "Maybe it's some kind of a network problem, cause in my case the quality is excellent, cristal clear and loud, I had to turn down the in call volume.", "time": "17th October 2017, 06:06 PM", "postID": "post74194453", "replies": []}, {"text": "no problem with mine either. clear & loud enough. i turn down the in call volume.", "time": "18th October 2017, 10:00 AM", "postID": "post74202205", "replies": []}, {"text": "Clear and loud, mic is  next usb-c port", "time": "19th October 2017, 11:43 AM", "postID": "post74216365", "replies": []}, {"text": "Just good enough.", "time": "20th October 2017, 11:40 PM", "postID": "post74236300", "replies": []}, {"text": "why it sometimes auto calling  when I receiving the call?", "time": "31st October 2017, 05:52 PM", "postID": "post74360484", "replies": []}, {"text": "I'm getting a lot of distortion on earpiece, though not always. Receiver test gives perfectly clear sound, but when I call someone or answer the call sound is loud as hell and distorted. Lowering it down does help a little but it is still bad. At first I thought that it is a hardware issue with speaker but, as I already said, receiver test is perfect, sometimes only tone for ringing on the other side is distorted, and sometimes everything is fine.\nNo problem with calls over loudspeaker and 3.5mm.", "time": "18th February 2018, 04:30 PM", "postID": "post75613814", "replies": []}, {"text": "Loud af", "time": "13th March 2018, 12:04 AM", "postID": "post75868610", "replies": []}]}, {"title": "WiFi strength, range, and throughput", "rating": 4.0, "links": ["https://forum.xda-developers.com/mi-a1/review/wifi-strength-range-throughput-t3679700"], "threads": [{"text": "The signal strength depends a lot on how do you hold a device. It has the same problem as iPhone 4 so far.\nIf you hold it on top you see that both cellular/Wi-Fi signal bar loosing.", "time": "27th October 2017, 04:36 PM", "postID": "post74315409", "replies": []}]}, {"title": "Cellular strength and throughput", "rating": 3.5, "links": ["https://forum.xda-developers.com/mi-a1/review/cellular-strength-throughput-t3679701", "https://forum.xda-developers.com/mi-a1/review/cellular-strength-throughput-t3679701/page2"], "threads": [{"text": "Signal strength is not that great...", "time": "26th September 2017, 08:49 PM", "postID": "post73943897", "replies": []}, {"text": "I replaced a lemon Galaxy S5 that died with the Mi A1 and am pleased to see that my signal strength and WiFi signal are both stronger. I live in Thailand and the 4G is excellent.", "time": "1st October 2017, 04:46 AM", "postID": "post73993187", "replies": []}, {"text": "my signal strength is great here in the uk on 3", "time": "1st October 2017, 08:49 AM", "postID": "post73994621", "replies": []}, {"text": "Coming from a Nexus 5 I noticed the signal strength in the A1 is slightly weaker especially for 4G connections. I'm in Malaysia. \n\nI suspect it's due to the aluminum body. If I hold it with my fingertips instead of a firm grip the signal is better. Did not have this issue with my Nexus 5.\n\nStill, it's good enough for calls and streaming and I haven't had any issues of connections dropping on this device", "time": "1st October 2017, 09:57 AM", "postID": "post73995136", "replies": []}, {"text": "excellent signal,no fluctuating on jio 4g in india after september update.", "time": "3rd October 2017, 12:14 PM", "postID": "post74019606", "replies": [{"text": "That's great! But i have issues with signal fluctuating on my JIO with the same device. I already installed the new update.  Is there anything which i missed it out?", "time": "11th October 2017, 06:48 PM", "postID": "post74121461", "replies": []}]}, {"text": "I can't get 4G while my sim card is in slot 1. Preferred network type is set to 4G. But it is only connecting to 3G. No problem in slot 2 with same sim card.\n\nEdit: got an update which fixed this problem", "time": "5th October 2017, 04:58 PM", "postID": "post74046851", "replies": [{"text": "Hi, i have the same problem! Band 20 only works if i put the SIM on the Slot 2 (but i can't use my microSD card...)\n\nThe latest update didn't solve the problem.\n\nAny solution?\n\n---EDIT\n\nAfter a restart, it works.", "time": "10th October 2017, 09:57 AM", "postID": "post74103866", "replies": []}]}, {"text": "The signal strength depends a lot on how do you hold a device. It has the same problem as iPhone 4 so far.\nIf you hold it on top you see that both cellular/Wi-Fi signal bar loosing.", "time": "27th October 2017, 04:36 PM", "postID": "post74315405", "replies": []}, {"text": "Good 4.5 strength", "time": "5th February 2018, 02:07 PM", "postID": "post75455197", "replies": []}]}, {"title": "Speakerphone (loudness, clarity)", "rating": 4.5, "links": ["https://forum.xda-developers.com/mi-a1/review/speakerphone-loudness-clarity-t3679702"], "threads": [{"text": "I will rate the speakerphone only 3* because this device could have easily had stereo speakers for its size and bezels and it doesn't.", "time": "20th November 2017, 10:38 AM", "postID": "post74574823", "replies": []}, {"text": "My Mi A1 bottom speaker has a hissing sound when producing sound at the lowest volume when you are in a quite room. Anyone has this?\nYou have to place the your ear to the speaker at the lowest volume when playing sound to reproduce the issue. \nIt's like a problem it cannot produce low volume.", "time": "22nd November 2017, 02:44 AM", "postID": "post74594580", "replies": [{"text": "Yeah, I have the same problem. Kinda annoying when trying to watch videos/movies in bed at night\n\n---------- Post added at 09:07 PM ---------- Previous post was at 09:06 PM ----------\n\n\n\r\nI'm rating 3* because of the hissing/static noise on lower volumes", "time": "25th November 2017, 08:07 PM", "postID": "post74635319", "replies": [{"text": "Just noticed this and yes, I have it too and I suspect this issue to be present on all of the other devices.\r\nAs much as I like and love the sound of the Mi A1, this issue is there with the bottom speaker. although I hardly use the speaker on low volumes,  I use headphones for that purpose, had no issue so far with them on Mi A1. well looks like Xiaomi's  side effect for boosting the sound on the bottom speakers too much. I am sure that this is a software issue and need minor tinkering, I just hope they don't mess up the great loud output just because this little annoying problem. Can they? Will they?", "time": "21st December 2017, 08:42 PM", "postID": "post74922572", "replies": [{"text": "Simple choice in sound options \"loud output vs quality in low volume\" would be OK with me, I use low volume most of the time. \n\r\nAnd yes, the hissing (both speaker and headphones) do exist and it is a problem.", "time": "7th January 2018, 06:31 PM", "postID": "post75115038", "replies": []}]}]}]}, {"text": "Sound and volume OK.\r\nLocation is somewhat unhandy...\r\nhand frequently covers the speaker completely when holding the phone in landscape.", "time": "8th January 2018, 02:57 PM", "postID": "post75124753", "replies": []}, {"text": "yeah, is true the speaker have hissing sound at very low volume!\n\nat normal/high volume sound is nice and no hissing sound, or at least, not audible.\n\nAnyway i never use the speaker so low so for me the quality is very good.\n\nabout hissing sound using headphones. i have 2 headphones, cip one, from others old phones and no hissing sound even at lowest volume.\n\nabout this hissing sound, is a new bug from oreo? or was also in naugat? is a software issue or a hardware issue? will be fixed?", "time": "12th January 2018, 11:29 PM", "postID": "post75177996", "replies": []}]}]